[
    {
        "id": "1jyv6sq",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 52,
        "comments": 5599,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jyv6sq/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1k3fana",
        "author": "EffectiveTie3144",
        "title": "On April 20 2011 Real Madrid beat Barcelona in Copa del Rey final 1-0 after a Ronaldo iconic header.",
        "content": "",
        "upvotes": 282,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k3fana/on_april_20_2011_real_madrid_beat_barcelona_in/"
    },
    {
        "id": "1k3hw11",
        "author": "griffith_cascafucker",
        "title": "Shhhhhhhhhhhhhhhhhh🤫",
        "content": "",
        "upvotes": 96,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fk5mg2ig8yve1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k3hw11/shhhhhhhhhhhhhhhhhh/"
    },
    {
        "id": "1k34c1t",
        "author": "Messmers",
        "title": "[Ornstein]: Carlo Ancelotti expected to leave Real Madrid + preference (from multiple options) is to become Brazil head coach.",
        "content": "",
        "upvotes": 322,
        "comments": 86,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1dVfVpH9terRr58y8D12Qdro9CViI2btWNyppA3LDQw.jpg?auto=webp&amp;s=f2a104f58157895bed0dc3794ea24ec7ca4d8f56"
        },
        "permalink": "/r/realmadrid/comments/1k34c1t/ornstein_carlo_ancelotti_expected_to_leave_real/"
    },
    {
        "id": "1k33v37",
        "author": "Different_Craft5237",
        "title": "People are gonna be in for a rude awakening, when Carlo leaves, we bring this \"system manager\" and we watch him also fail cause the board doesn't back him properly",
        "content": "Carlo leaves. \n\nWe bring \\[ insert whoever you deem has more modern tactics \\].\n\nThe board skips on buying Huijsen. No proper number 9. No tempo dictator. And our CB signing being Militao and Jacobo back from ACL injuries, and Asencio's 1st team contract .\n\nThen come March-April-May, when the team struggles due to injuries and multiplies lackluster performances, here comes the same mob who was ZidaneOUT 6 years ago, CarloOUT at the moment, but now have became \\[ insert new manager \\]OUT. \n\n\n\nLet's glaze Arsenal with Arteta. Meanwhile their owners have backed pretty much every signing their manager requested, even for his coaching staff. \"Yeah he was able to play Merino at ST\" .... yeah, the Merino he handpicked himself knowing how versatile he could be for his system. Meanwhile, our manager asks for Harry Kane who would suit Vini - Rodrygo's playstyles to perfection, but gets told to fuck off, Mbappe is coming and you better make him work. Backline decimated ? Just shove your midfielders there, Saliba is coming on a free in 2026 (maybe).\n\n\"Xabi Alonso will come and make us play champagne modern football, unlike this dinosaur we have\" ... the same Xabi who on his first season made 12 signings and shipped out 8 players at Leverkusen for his system to work. Yeah, good luck convincing Perez with that.\n\n Then and maybe then, y'all will stfu and put more respect on the 2 managers we had for the past 10 years, and actually give them credit for the achievements instead of saying garbage like \" It was thanks to CR7 - Benzema magic - Jude brilliance - Luck\" or whatever.\n\n  \nSo unless Perez actually changes the way he operates with transfers, those unicorn managers y'all keep glazing will NEVER work here.",
        "upvotes": 335,
        "comments": 140,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k33v37/people_are_gonna_be_in_for_a_rude_awakening_when/"
    },
    {
        "id": "1k3178t",
        "author": "4gjdtokurwa",
        "title": "Arrigo Sacchi: \"I’m familiar with Florentino Perez because I worked as Real Madrid’s technical director (Dec 04 - Dec 05). He's a great President, but he focuses on forwards too much. To convince Perez to sign Sergio Ramos, I had to fight for 3 months, because he doesn’t even look at defenders.\"",
        "content": "",
        "upvotes": 372,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/huplmBTqyqxAPdrfhEPzZYQOQjcjUvM4RKrouMf5VSo.jpg?auto=webp&amp;s=3981704ff64afeea26e53d4a179c14b14f4eff79"
        },
        "permalink": "/r/realmadrid/comments/1k3178t/arrigo_sacchi_im_familiar_with_florentino_perez/"
    },
    {
        "id": "1k2xk0t",
        "author": "77SidVid77",
        "title": "[AS] Survey conducted among Real Madrid fans for who is to blame for the season's failure? (Board 58%, Players 24%, Coaching 18%), Which players to sell? (top-5: Vallejo, Vazquez, Alaba, Mendy, Vinicius), Which position to buy? (top-5: Midfielder, Right-Back, Left-Back, Center-Back, Attacker)",
        "content": "",
        "upvotes": 220,
        "comments": 209,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0fnnnbm5ysve1.png?auto=webp&amp;s=057fcd50952bdff97640b05dfdb17ede8330743b"
        },
        "permalink": "/r/realmadrid/comments/1k2xk0t/as_survey_conducted_among_real_madrid_fans_for/"
    },
    {
        "id": "1k2v8v9",
        "author": "The_Flash_20",
        "title": "Real Madrid Gave Me Joy When Life Didn’t But I Need to Step Away",
        "content": "I have been supporting Real Madrid for 19 years now. While this team has given me immense happiness and joy, unfortunately, the same can't be said for my life.\n\nSince 2017, I have been struggling. I watched this team as an escape from the reality of my life. I have failed multiple interviews that could have helped me become an Army man or an Engineer etc. but sadly I couldn't achieve those dreams.\n\nOn 10th April, I had an opportunity to turn things around, but I couldn't make it count. I don't know what the result will be, but it's heavily affecting me.\n\nI finally decided to seek help. I have been diagnosed with Insomnia and Depression.\n\nWhen they asked me about my insomnia, the source became clear, me watching football matches until 3 AM for nearly 19 years. The depression stems from my personal failures, which also began around the same time mostly in part to those sleepless nights and lifestyle that spiraled from there. \n\nI have been advised to stop watching matches in order to start the recovery process.\n\nI am 28 years old, unemployed, dealing with a bad back and facing a deadline to find a job by the end of 2025 because I have embarrassed my Parents enough already. \n\nWith these issues in front of me, I have decided to make some changes.\n\nSo, I have decided to step away. \n\nI will stop watching football until I find stability and get better.\n\nI have watched every UCL final since 2006, Every UEFA Euro final since 2008 and Every FIFA World Cup final since 2006 and countless more so I have some great memories as well. \n\nGood luck to everyone and I hope football continues to bring you the joy it brought me over the past 19 years. But for me, it’s time to stop.\n\nIt took me a week of courage to write this. If anyone of you is suffering from anything, please seek help. It truly helps in the end.\n\nGoodbye, everyone.",
        "upvotes": 212,
        "comments": 93,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k2v8v9/real_madrid_gave_me_joy_when_life_didnt_but_i/"
    },
    {
        "id": "1k2hj1x",
        "author": "Jigawhats",
        "title": "The true reason RM changed so much since last season.",
        "content": "",
        "upvotes": 2268,
        "comments": 122,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/yot77jmw6ove1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k2hj1x/the_true_reason_rm_changed_so_much_since_last/"
    },
    {
        "id": "1k2st0g",
        "author": "nutelamitbutter",
        "title": "[Bild+] A move to Real Madrid is the first priority for Florian Wirtz",
        "content": "",
        "upvotes": 256,
        "comments": 177,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/K__GjjfD1cMS_Hn8y8jjALBYF5Ao4JyEo_jrycajVOw.jpg?auto=webp&amp;s=56a9733e1d34c90a1bae90dccc9041f427e0819f"
        },
        "permalink": "/r/realmadrid/comments/1k2st0g/bild_a_move_to_real_madrid_is_the_first_priority/"
    },
    {
        "id": "1k32bpt",
        "author": "PenguinFootballClub",
        "title": "Most of our recent success has been with 4 Midfielders on the pitch. Why do we insist on switching back to variations of the 433?",
        "content": "Last season was one of the most succesful ones in our history. We won the UCL completely unbeaten. We won La Liga with a 10 points difference, only 26 goals conceded and winning both Clasicos, while rotating for the last 6 matchdays. We won the Supercopa by outclassing Barcelona with 4-1.\n\nA very large part of this success was the 442 Diamond formation, with 4 midfielders perfectly complimenting each other: Tchouameni the destroyer, Kroos the controller, Valverde the lungs of the team and Bellingham becoming a pseudo \"9\" in attack with deep runs and an extra CM in defense. Even after Kroos retired, the logical thing should have been **directly replacing him** with Ceballos or another CM with similar qualities. But the board had completely different plans (Mbappe) and Ancelotti never even tried to bench one of the front three to switch back to the 442 diamond. I think both of them should be blamed, but on this occasion mainly the board was the problem.\n\nThe last time we won the UCL (21/22) we also did it with 4 midfileders, even if Valverde was technically a RW, he was very crucial in defense and transition and mostly functioned as an extra energetic midfielder to balance the aging and less physical Kroos-Modric duo. The start to 22/23 was very strong, with Tchouameni replacing Casemiro, while Fede stayed on the RW and was scoring like crazy. As soon as we returned back to a 433 with Vini &amp; Rodrygo as wingers, our performances dropped in big games, as did our form in the 2nd half of the season and we ended up winning only the CdR. *(Of course the formation wasn't the only reason, but that's another conversation).*\n\nThe 16/17 and 17/18 UCL wins also came with a 442 diamond and Isco playing the AM role in front of the KCM trio.\n\nEven if we go back to 11/12, the season we won La Liga while breaking the goalscoring record and we were playing amazing football (even if we didn't reach the UCL final), our RW was Di Maria. A player with incredible workrate and more of a \"wide playmaker\" than a winger like Vini or Rodrygo. So again, Mourinho's 4231 that season was much more balanced and none of our midfielders or attackers allowed large gaps when defending, unlike the current season.\n\nThe only exceptions of the rule have been the 13/14 and 15/16 UCL winning seasons with the 433 and the BBC attack. But we're talking about one of the best attacking trios ever, that were complimenting each other perfectly. Also our whole XI was crazy talanted and in-form. But every other succesful campaign (especially in the UCL) in the modern Perez era (2009-) has been with 4 midfielders or a 4231 with one winger in a much more supportive role.\n\n**What can we do now?** It won't be easy, but I think we have to say goodbye to one of our front three members. A new coach can maybe improve them and make them somehow work better, but they'll never click 100%, they are too similar to each other in terms of strengths and weaknesses. People are comparing us to PSG, but they have 2 completely two footed attackers (Dembele, Kvara), while most of their attackers are constantly switching positions, it's not the same.\n\nMbappe isn't leaving any time soon, he's Perez' golden boy. Vini had a pretty weird season, but he's still the kind of player that can win you games out of nowhere (Dortmund, City away, La Real 2nd SF etc). I think Rodrygo is the one who has to leave and that's coming from someone who loves the guy [(example)](https://www.reddit.com/r/realmadrid/comments/1itwvr9/rodrygo_silva_de_goes_appreciation_post_his_last/). He's a good player, with some amazing moments for the club, but he's simply not consistent enough to be a Real Madrid starter for 50+ games per season. It's not about his position either, he has 0 G&amp;A on his last 4 games as a LW, he isn't much better as a LW or AM in Brazil. It's just how he is as a player, like it or not.\n\nTchou - Fede - Jude aren't going nowhere from our midfield, so we should either sign a world class AM that can play between the lines and be our creator (Wirtz?) or a good ball playing CM and return Jude to his AM position of 23/24. Of course **going back to the 442 won't automatically fix all our issues**, we still have to buy new fullbacks and defenders in general, we can all agree on that. But it will be a good start.\n\nThe 442 is also better suited for future prospects. Spain produces far more quality AMs or CMs, compared to world class traditional or inverted wingers. Same goes for our academy, look at Nico Paz or Arribas (a few years back). Arda will be far more useful on the #10, compared to when he plays on the right. I feel like even Endrick will benefit more from that kind of set-up, as opposed to being a \"lone striker\" in a 433.\n\n**TL;DR:** Most of our success in the last 16 years happened with 4 midfielders, including last season. We should sell one of our attackers (most likely Rodrygo) and bring back the 442, which will make our whole team much more balanced, while it's also suited for most of our players.",
        "upvotes": 55,
        "comments": 78,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k32bpt/most_of_our_recent_success_has_been_with_4/"
    },
    {
        "id": "1k2p2cm",
        "author": "Kalpesh_K",
        "title": "The right recruitment can genuinely unlock this team's full potential.",
        "content": "",
        "upvotes": 344,
        "comments": 58,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xqwwsuad9qve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k2p2cm/the_right_recruitment_can_genuinely_unlock_this/"
    },
    {
        "id": "1k2zevb",
        "author": "_ROMAX_",
        "title": "Real Madrid UCL elimination Survey",
        "content": "So I was looking through Reddit and I saw a post with the results of an AS survey among RM fans and I think that the results are a little bit odd. So I made my own one. This survey is centered on thise season and our UCL elimination against Arsenal. The results of the survey will be post on Reddit a few days later. The survey consist in 4-5 questions that can be answered in 5 minutes.\n\nHere is the [survey](https://forms.gle/Ey1mNxCzQApEqdxH8) for you to answer it.\n\nSorry for my English.",
        "upvotes": 26,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tT9X-V85mokdSqM-kURK4tNLNDGs7w4NOdH_95Z1518.jpg?auto=webp&amp;s=d2cb0e74c4057e38d9cbefd8d7478c5ab5ee0323"
        },
        "permalink": "/r/realmadrid/comments/1k2zevb/real_madrid_ucl_elimination_survey/"
    },
    {
        "id": "1k2qlov",
        "author": "Lekanswanson",
        "title": "In Defense of Rodrygo, the whole right side of the attack has been really poor since the Carvajal injury",
        "content": "I've been reading a lot of comments on this thread and this post isn't to have a go at anyone even though I wholeheartedly disagree that Rodrygo needs to go anywhere, but I am also one of the first people to realize that Rodrygo seems to fade in games a lot after 50 to 60 minutes. \n\nHe seems to always start very strong and then just disappears whereas Vini is always dangerous till the final whistle which is why when a sub needs to be made in attack Ancelotti usually takes him out instead of Vini.\n\nOne thing I think we have all forgotten to take into account however is that he is missing arguably the best right back in the world on his side for pretty much the whole season. The truth is that Rodrygo, Valverde and every player on the right side of the attack plays significantly better when Carvajal is on the pitch.\n\nThe truth is while Vazquez is decent going forward which is expected as a former right winger, he's a complete liability defensively and the whole team suffers for it as there defensive output all triple due to the major gaps he constantly leaves and his inability to actually mark anyone. \n\nYou just simply have to watch any highlights of him vs Carvajal defending to see this. The reason the left side is better is also for this precise reason, Mendy and even Fran are SIGNIFICANTLY better than Vazquez defensively so Vini rarely has to do as much defending which means he can focus more on attack.\n\nObviously there's other issues in the team beyond this but I'm just saying to not be too harsh on Rodrygo. This is also why I worry about signing Trent now because he cannot do what Carvajal does defensive wise and honestly I don't think Trent is also that much better than Carvajal offensively.\n\nWhat i do know is this is going to have to start playing some serious high pressing football from the attack if we do sign Trent.",
        "upvotes": 85,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k2qlov/in_defense_of_rodrygo_the_whole_right_side_of_the/"
    },
    {
        "id": "1k2dgq0",
        "author": "Ready_Ad_1353",
        "title": "José Mourinho describes coaching Cristiano Ronaldo: “You don’t need to give him motivation, ambition or responsibility. Its about being happy.”",
        "content": "",
        "upvotes": 616,
        "comments": 42,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dv5sa6ttanve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k2dgq0/josé_mourinho_describes_coaching_cristiano/"
    },
    {
        "id": "1k2w6ym",
        "author": "Maldo963",
        "title": "Hearing lots of mixed news and talk for next season.",
        "content": "I have heard everything from Xabi Alonso coming to Klopp coming, Carlo leaving after the Copa Del Rey final next Saturday, plus rumors about signing, Zubimendi, Huijsen, Wirtz, Saliba. I am unsure what to really believe at this point because I am not sure what’s going on in Perez mind at this moment because we have had such a limited squad even since Zidane’s last season in 2020/2021 season with 60 injuries, mainly lacking defenders which is the bigger issue and now the new issue is needing a creative midfielder who can direct this midfield and provide solid balance to the team, but I feel Perez isn’t willing to splash the cash for quality players these days and we rely on the free agents because rumor says he wants to sign Saliba as a free agent in 2027, I feel like we may end up getting gassed up and get played once next season, only new addition may end up being Trent for free, and this team will reach new lows next season if the board doesn’t act and keeps this same exact squad, honestly I may be preparing myself mentally for Europa League or Conference league on Thursday nights for 2026/2027 season, I have somewhat lost faith in this board with their blind love for signing free agents and especially having only signed Mbappe for free last season and no Nacho, Joselu or Kroos replacement. ",
        "upvotes": 15,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k2w6ym/hearing_lots_of_mixed_news_and_talk_for_next/"
    },
    {
        "id": "1k24e8m",
        "author": "Messmers",
        "title": "Cristiano Ronaldo's debut season for Real Madrid was insane",
        "content": "",
        "upvotes": 1152,
        "comments": 113,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/iaxp7415dlve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k24e8m/cristiano_ronaldos_debut_season_for_real_madrid/"
    },
    {
        "id": "1k22own",
        "author": "The-Lord_ofHate",
        "title": "I am a Real Madrid fan, I laughed at the transition at between the Spanish and English.",
        "content": "",
        "upvotes": 811,
        "comments": 71,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ofvjl0l7xkve1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k22own/i_am_a_real_madrid_fan_i_laughed_at_the/"
    },
    {
        "id": "1k2rp39",
        "author": "estagingapp",
        "title": "Can Real Madrid Fix Their Tactical Imbalance? - Data Analysis",
        "content": "",
        "upvotes": 15,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Lc2xZmVUfvCumQRuIEj58O-o95ax1yo1Xq8ppit5ca4.jpg?auto=webp&amp;s=808a9e5486dcea59782bc83df7232e2504ac3447"
        },
        "permalink": "/r/realmadrid/comments/1k2rp39/can_real_madrid_fix_their_tactical_imbalance_data/"
    },
    {
        "id": "1k2f3dn",
        "author": "King__SSB",
        "title": "A bit bitter to get it now but what a beautiful piece",
        "content": "Easily one of our greatest kits ever",
        "upvotes": 143,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xokjlaudnnve1.jpeg?auto=webp&amp;s=aa72571ff6c615cd1e94dc296f83e46a6d750e30"
        },
        "permalink": "/r/realmadrid/comments/1k2f3dn/a_bit_bitter_to_get_it_now_but_what_a_beautiful/"
    },
    {
        "id": "1k28ioo",
        "author": "intelligence3",
        "title": "🚨🚨 𝐁𝐑𝐄𝐀𝐊𝐈𝐍𝐆: Real Madrid believe the time to say ‘GOODBYE’ to some players has ARRIVED, reports Marca! “We need changes, fresh air in the locker room” is what’s been said.",
        "content": "The inevitable changes\n\nThroughout the season, and in those moments when the team has shown weakness and neglect on the pitch, the phrase has been heard more than once at Valdebebas: \"We need changes, fresh air in the locker room,\" and not only referring to the coach, but also to the squad. They believe the time has come to say goodbye to some players and to open the doors to let in the desire that has been lacking at times, just as Courtois described yesterday with the words of the wingers dropping back and helping the full-back.\n\nLucas Vázquez and Modric, due to their contract expiry, are the first, but not the only ones. Between now and the end of the season, some will be playing for their continuity. The atmosphere in the locker room isn't what it was in previous years. We will once again be very clear with them and remind them that whoever doesn't want to be there, shouldn't. The door is ajar for anyone who hesitates.",
        "upvotes": 277,
        "comments": 136,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k28ioo/𝐁𝐑𝐄𝐀𝐊𝐈𝐍𝐆_real_madrid_believe_the_time_to_say/"
    },
    {
        "id": "1k2hw9k",
        "author": "RM-PM-Surveys",
        "title": "[Post Match Survey Results] Real Madrid (1) 1-2 (5) Arsenal",
        "content": "",
        "upvotes": 70,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k2hw9k/post_match_survey_results_real_madrid_1_12_5/"
    },
    {
        "id": "1k2f0rk",
        "author": "ManuMora98",
        "title": "[Basket] We defeat Bayern 93-71 in the Euroleague Play In and will play the Play Offs against Olympiakos (Best of 5)",
        "content": "",
        "upvotes": 98,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/s5ve0odtmnve1.jpeg?auto=webp&amp;s=d2f081900122603f16196740eef1e555c2aa4374"
        },
        "permalink": "/r/realmadrid/comments/1k2f0rk/basket_we_defeat_bayern_9371_in_the_euroleague/"
    },
    {
        "id": "1k2k0rd",
        "author": "Success-Useful",
        "title": "New coach : Alonso or someone else",
        "content": "Seems like Alonso will join\n. I was curious if people had any other preference. A friend of mine was trying to convince me Conte was a good idea but that should be straight up disaster. I personally like Klopp but seems like that might not fly. I personally believe,if we can land one of Alonso, Klopp or Zizou ,we have a three peat team. Remember last time we won 3peat, it was similar pattern.",
        "upvotes": 34,
        "comments": 66,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k2k0rd/new_coach_alonso_or_someone_else/"
    },
    {
        "id": "1k1v3j3",
        "author": "basedzone",
        "title": "Lucas Vasquez Might Not be that Great, but he's a Real Madrid Legend",
        "content": "While I understand the frustration of losing and having a bad defence can get on the nerves of many fans. Please don't forget what the players have done these past seasons. This is just a bad patch. And Lucas deserves some respect at least. ",
        "upvotes": 1799,
        "comments": 136,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1v3j3/lucas_vasquez_might_not_be_that_great_but_hes_a/"
    },
    {
        "id": "1k29cj4",
        "author": "KjOnReddit1010",
        "title": "Klopp is very happy with his new role as Head of Global Soccer at Red Bull: Marc Kosicke (Klopp's agent)",
        "content": "These Klopp rumors were never from credible sources to begin with. So I think Xabi is our main target, I hope we get him.",
        "upvotes": 128,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hp8jNsIrUID86C5a3kIwrPaQWShh8eSRDYD8Zv7a0lQ.jpg?auto=webp&amp;s=adca19363e9d8167f08e0132dc8efa15946b44d8"
        },
        "permalink": "/r/realmadrid/comments/1k29cj4/klopp_is_very_happy_with_his_new_role_as_head_of/"
    },
    {
        "id": "1k22acy",
        "author": "-thechosen-1",
        "title": "I wish him a good fortune in Celesao",
        "content": "",
        "upvotes": 269,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8u1fhpohskve1.jpeg?auto=webp&amp;s=06ecbb52de038323eaca5f6e24afb5427bb56d8b"
        },
        "permalink": "/r/realmadrid/comments/1k22acy/i_wish_him_a_good_fortune_in_celesao/"
    },
    {
        "id": "1k26gwe",
        "author": "Ok-Fold6928",
        "title": "This season proves the 21/22 to 23/24 teams were actually a great footballing side and not just lucky",
        "content": "I think it's time to finally give credit to the 21/22 to 23/24 teams.\n\nBack then, people couldn’t wait to downplay what they achieved. “They were just lucky.” “Carried by Courtois and Benzema.” “Friendship FC.” “God’s favorite team.” The narrative was that they weren’t a *real* footballing team, just vibes and miracles.\n\nBut this season shows the truth that mentality alone isn’t enough. This squad also fought. They also wanted it. But the football just wasn’t good enough, and results showed it.\n\nSo no, those teams didn’t just survive on luck or divine intervention. They played good football. Controlled games when they had to. Countered with precision. Defended like a unit. They won because they were a complete team, mentally, physically, and tactically.\n\nThose Real Madrid teams weren’t just blessed — they were damn good.",
        "upvotes": 133,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k26gwe/this_season_proves_the_2122_to_2324_teams_were/"
    },
    {
        "id": "1k2cn1v",
        "author": "zNpFTW",
        "title": "End of Season Awards",
        "content": "Hey guys!\n\nI was thinking to have some sort of \"End of Season Award\" where people on this subreddit can vote for different type of categories like, best player etc. This was done a couple of years ago and I feel like it would be fun to bring it back.  \nAt the moment I have a few categories that I feel like would be nice to vote on but I'm down to take any suggestions.\n\n\n\n\\- Best player; The best player of the season  \n\\- Favorite player; This subs collective favorite player  \n\\- Most Improved player; A player who upped his game up from last season  \n\\- Most disapointing player; Player who we expected to perform better  \n\\- Revelation of the year/Breakout player; A player who came from nowhere and started performing (we all know who gets this)  \n\\- Player who deserved more minutes; Yeah you guessed it.\n\nIf you feel like this sounds fun and want to help hit me up with a message. Feel free to discuss if any more categories should be added or if any should be removed. They can be serious, fun or meme ideas. Let's have some fun together!",
        "upvotes": 35,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k2cn1v/end_of_season_awards/"
    },
    {
        "id": "1k27wwb",
        "author": "willi7lol",
        "title": "My analysis of Carlo's second tenure",
        "content": "This is my thoughts on Carlo's second tenure, its a bit long:\n\n2021/22 we had a balanced team. When you combined it with individual brilliance it can create moments/phases of brilliance and thats what we saw in the CL Knockouts. I'll also add that in 2021/22 we were lacking something until Carlo finally realised that KCM doesn't work and they needed help. He then put Valverde at RW to bring more balance. For a majority part of the tie we were inferior against PSG, City and in the final Liverpool for majority of the game. The only tie I could think of where we were better was the 1st leg against Chelsea, but the 2nd leg... well we all know what almost happened. Our balance squad combining with experience allowed us to hang in there and the moments of individual brilliance from Benzema, Modric, Rodrygo, Vini etc managed to pull us through.\n\n2022/23 we lost Casemiro and that was a HUGE defensive downgrade. Tchouameni had a huge decline after the WC, Camavinga was put on LB shift because Mendy was basically out for majority of the season + he doesn't have the positional discipline and awareness to play the DM role and Kroos as a 6 didn't work because Kroos just doesn't provide enough defensive coverage. Valverde RW experiment came to an end, because he just isn't dynamic enough going forward. On top of that Benzema had a huge fall off as well and our attack became extremely predictable because everything was flowing and only through Vini. The Alaba + Militao duo also had a huge drop in levels. When he finally decided to stop the Valverde experiment and played Rodrygo on the right we immediately saw improvement (beat Barca 4-0)\n\n2023/24 arguably the best defensive Real Madrid team I've ever seen. With Benzema gone, we went back to a 4 midfield set up, but this time we have someone who is creative, has great goal scoring instinct, defensive workrate, basically just the total package in Jude. The balance was back with the diamond. Granted, we still struggled to dominate games. The first Clasico was a disaster till Modric came on and Jude managed to pull off a brace. We barely scrapped past Leipzig, City dominated us for 3/4 part of the tie and needed  individual brilliance from Joselu to help us beat arguably the worst Bayern side in about 2 decades and got dominated by Dortmund in the first half. The team's defense managed to keep us in the game, this is something I'll give huge credit to Carlo. The defense kept us in the game and Vini, Bellingham and Rodrygo will always somehow find a goal or two to help us pull through. I'd also like to add that Kroos learned to play more as a 6. On paper Tchouameni is the DM, but in game Kroos is the one playing deeper and has significantly improved his defensive side of the game.\n\n2024/25 arguably the worst Madrid side I've ever seen. Lost Kroos = no control. Mbappe clearly isn't a striker. Jude given a different role. Injuries + Nacho's departure etc I can go on all day, but this team lacks balance. It feels like this team is playing with 4 attackers, it lacks control. On top of that, to make it even worse both Mbappe and Vini, they don't track back, they don't press AND they don't run !!! We have one of the worst distance covered by a big team in Europe. My opinion is that Rodrygo should've been dropped for an extra midfielder, but Carlo doesn't wanna upset the quartet upfront. There are no structure, no identity and no style of play. Every game is like Carlo fields starting XI he chose and let them do what they want and hoping that they can create something amongst themselves. The defense... I am not even gonna go in on that we all know what's happening. In the modern game you cannot afford to have two players who don't track back at all. You can barely get away with one nowadays, let alone two. Honestly it's frustrating Carlo doesn't give them a huge scolding for this because it is benchable behaviour.\n\nRegardless of the injuries, the squad depth or Vazquez being a liability at RB, this team should be playing WAY better than they are playing right now end of story. It's not Carlo's fault that the board doesn't bring in the players he want or reinforce the squad, but it's his fault that the players don't run, don't press and don't track back. It's his fault that he kept allowing this to happen again and again and again with no repercussions. Its his fault that he isn't authoritative enough to demand more from his players. It's simple, you don't follow instructions = bench, doesn't matter who you are. Carlo might not be the best tactical coach or gives the best instructions, but with the players he has available, this level of performance is disgustingly bad.\n\nHoping the next manager will have more authority and demands from the players. The next manager need to take control of the dressing room and insert his authority because this squad rn are full of entitled and lazy players that they know there won't be any consequences no matter what under Carlo.",
        "upvotes": 50,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k27wwb/my_analysis_of_carlos_second_tenure/"
    },
    {
        "id": "1k1zzm1",
        "author": "muaazmuaaz123",
        "title": "Real Madrid all time xi Day 1 : ST",
        "content": "Making the real Madrid all time xi, day 1, starting from strikers, the most upvoted striker will be selected in all time xi, u can also pick players apart from this list\n\nI didn't included cr7 as he played mainly as A LW in madrid",
        "upvotes": 159,
        "comments": 55,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1zzm1/real_madrid_all_time_xi_day_1_st/"
    }
]