[
    {
        "id": "1kj1pdg",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement: Ana de Armas - Tuesday 5/13 at 11:00 AM ET - Oscar-Nominated Actress and Star of Ballerina, Knives Out, Blonde, Blade Runner 2049, No Time To Die, Ghosted, The Gray Man, Deep Water",
        "content": "",
        "upvotes": 56,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4kncu8nirvze1.png?auto=webp&amp;s=a0c7326848e416dfdd4773a01d4811c00d65d9ab"
        },
        "permalink": "/r/movies/comments/1kj1pdg/amaqa_announcement_ana_de_armas_tuesday_513_at/"
    },
    {
        "id": "1khzkkk",
        "author": "EliCraigAMA",
        "title": "Hi r/movies! I’m Eli Craig, director of CLOWN IN A CORNFIELD (starring Katie Douglas, Kevin Durand, Will Sasso). It will be released in theaters this Friday, May 9. I also wrote and directed the horror-comedy cult classic TUCKER AND DALE VS. EVIL. Ask me anything!",
        "content": "Hey Reddit,\n\nI’m Eli Craig. I’m the director and co-writer of CLOWN IN A CORNFIELD which will be in theaters May 9! The film is based on the Bram Stoker Award-Winning Novel of the same name by Adam Cesare.\n\nI also wrote and directed the horror-comedy cult classic TUCKER AND DALE VS. EVIL, LITTLE EVIL starring Adam Scott and Evangeline Lilly and the award-winning comedy short THE TAO OF PONG. \n\nFeel free to ask me any questions. I'll be back tomorrow Friday, May 9, at 7 PM ET for answers.\n\nMORE ABOUT CLOWN IN A CORNFIELD\n\nIn CLOWN IN A CORNFIELD, Quinn (Katie Douglas) and her father (Aaron Abrams) have just moved to the quiet town of Kettle Springs hoping for a fresh start. Instead, she discovers a fractured community that has fallen on hard times after the treasured Baypen Corn Syrup Factory burned down. As the locals bicker amongst themselves and tensions boil over, a sinister, grinning figure emerges from the cornfields to cleanse the town of its burdens, one bloody victim at a time. Welcome to Kettle Springs. The real fun starts when Frendo the clown comes out to play.\n\nThe film stars Katie Douglas (“Ginny &amp; Georgia”), Kevin Durand (Kingdom of the Planet of the Apes), Aaron Abrams (“Blindspot) and Will Sasso (The Three Stooges).\n\nCheck out the trailer: [https://www.youtube.com/watch?v=gww5V8BPpj8](https://www.youtube.com/watch?v=gww5V8BPpj8)\n\nFollow the Film u/clown_in_a_cornfield\n\nTalk to you all later! Ask me anything.\n\n",
        "upvotes": 494,
        "comments": 148,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vn44groe5mze1.png?auto=webp&amp;s=8f764bf444720fdacce92699dfdc7c19c3653920"
        },
        "permalink": "/r/movies/comments/1khzkkk/hi_rmovies_im_eli_craig_director_of_clown_in_a/"
    },
    {
        "id": "1kildqq",
        "author": "ChiefLeef22",
        "title": "New Image of Ralph Fiennes, Jodie Comer and Alfie Williams from '28 Years Later'",
        "content": "",
        "upvotes": 7888,
        "comments": 501,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p6jb8721zrze1.jpeg?auto=webp&amp;s=adf35f9e3d6b2696d6952519eac50ed88847269e"
        },
        "permalink": "/r/movies/comments/1kildqq/new_image_of_ralph_fiennes_jodie_comer_and_alfie/"
    },
    {
        "id": "1kiosi4",
        "author": "DemiFiendRSA",
        "title": "Netflix To Remove ‘Black Mirror: Bandersnatch’ and ‘Unbreakable Kimmy Schmidt: Kimmy vs The Reverend’ From Platform on May 12 In an Effort to Ditch Interactive Programming",
        "content": "",
        "upvotes": 2588,
        "comments": 240,
        "media": null,
        "permalink": "/r/movies/comments/1kiosi4/netflix_to_remove_black_mirror_bandersnatch_and/"
    },
    {
        "id": "1kiw48d",
        "author": "Amaruq93",
        "title": "Rosanna Norton, Oscar-nominated Costume Designer (TRON, Carrie, Airplane, The 'Burbs) has died at age 80",
        "content": "",
        "upvotes": 912,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7nwyp79fnz1LzkTrVfPA8fdPp466bYMCR6t0fcqdx5A.jpeg?auto=webp&amp;s=d8802d83a8fee23eeb00b9a72a27525a499f2304"
        },
        "permalink": "/r/movies/comments/1kiw48d/rosanna_norton_oscarnominated_costume_designer/"
    },
    {
        "id": "1kisqmu",
        "author": "PrincessRuri",
        "title": "Kung Fury 2 LEAKED Sizzle Real",
        "content": "",
        "upvotes": 1299,
        "comments": 183,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FcRQTIXd9Ra3wIVu9RSovkLJzIoNWaGudQzt2r4ZEiI.jpeg?auto=webp&amp;s=c7c46776e7c0646fa2b8d98e0028866997f434d6"
        },
        "permalink": "/r/movies/comments/1kisqmu/kung_fury_2_leaked_sizzle_real/"
    },
    {
        "id": "1kisj66",
        "author": "Edm_vanhalen1981",
        "title": "Kevin Smith's Dogma to screen at this year's Cannes",
        "content": "",
        "upvotes": 910,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SNH317OfHWjBO1zvXbYTiKdW4t8YfGFh2Kf2UrjLAgM.jpeg?auto=webp&amp;s=22dd8d747c0b0b535b69a5796a3bb5cfae598994"
        },
        "permalink": "/r/movies/comments/1kisj66/kevin_smiths_dogma_to_screen_at_this_years_cannes/"
    },
    {
        "id": "1kii0hs",
        "author": "FilmWaffle-FilmForum",
        "title": "What movie completely exceeded your expectations?",
        "content": "Game Night (2018) is the first movie that comes to mind for me. Went into it expecting a typical comedy movie with a few laughs. Turns out it’s one of the most well written, thought provoking and genuinely funny comedies I’ve seen in a long time. \n\nWhat movies did you go into expecting something “meh” only to have your expectations exceeded? ",
        "upvotes": 3107,
        "comments": 1843,
        "media": null,
        "permalink": "/r/movies/comments/1kii0hs/what_movie_completely_exceeded_your_expectations/"
    },
    {
        "id": "1kir325",
        "author": "KillerCroc1234567",
        "title": "Mikey Madison, Kirsten Dunst to Star in Unique Mermaid Thriller ‘Reptilia’ from Imperative, Pastel, Black Bear",
        "content": "",
        "upvotes": 928,
        "comments": 108,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/heOgnotQ5JwFPjqZSlscYUDV_jfSoCcv3qR5dPHJrnk.jpeg?auto=webp&amp;s=26809fd8d172d09653f3c9b97c7de4547664cc5c"
        },
        "permalink": "/r/movies/comments/1kir325/mikey_madison_kirsten_dunst_to_star_in_unique/"
    },
    {
        "id": "1kiuqqh",
        "author": "Dragon_kawai",
        "title": "What’s something that seems totally normal in movies but would be absolutely insane in real life?",
        "content": "I’ve been thinking about how movies get away with showing things that we just accept as normal on screen, but if they happened in real life, people would either call the police, question your sanity, or it would just be physically impossible.\n\nFor example — movie hackers can break into government systems or highly secured databases in under 10 seconds, typing furiously on a keyboard covered in green code with zero explanation. In real life, you’d be lucky if your WiFi connected that fast.\n\nWhat are some other examples you’ve noticed? I’m sure there’s a ton of ridiculous stuff we don’t even question anymore in movies.",
        "upvotes": 547,
        "comments": 867,
        "media": null,
        "permalink": "/r/movies/comments/1kiuqqh/whats_something_that_seems_totally_normal_in/"
    },
    {
        "id": "1kiuh9u",
        "author": "Offscreenshaman",
        "title": "How Jurassic Park Subtly Lets John Hammond Off the Hook",
        "content": "He’s not the villain. He’s the grandfather. The dreamer. The face of wonder.\n\nBut rewatching *Jurassic Park*, I was struck by how softly the film lands on Hammond’s choices. There’s early critique, Ellie’s speech, Malcolm’s warning, but by the end, he’s grieving a lost dream, not facing consequences.\n\nI’m not saying he needed to be the villain. But it’s fascinating how the story wraps systemic failure in nostalgia, and leaves us mourning *with* him.\n\nIs that emotional sleight of hand? Or just good character work?\n\nCurious what others think.",
        "upvotes": 466,
        "comments": 195,
        "media": null,
        "permalink": "/r/movies/comments/1kiuh9u/how_jurassic_park_subtly_lets_john_hammond_off/"
    },
    {
        "id": "1kiwquz",
        "author": "AMA_requester",
        "title": "4-time Oscar winning makeup artist Greg Cannom Dies at 74",
        "content": "",
        "upvotes": 312,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Qf58JIr00ux1RdNSJe-XshbnDjNkXZ2eHhvB2DS1zJ0.jpeg?auto=webp&amp;s=649ad38cbb525a98d3e324c8b83fc0ba9f836b5d"
        },
        "permalink": "/r/movies/comments/1kiwquz/4time_oscar_winning_makeup_artist_greg_cannom/"
    },
    {
        "id": "1kihw8x",
        "author": "ToxtethOGrady",
        "title": "How Once Upon a Time in Hollywood Discovered a New Generation of Stars",
        "content": "",
        "upvotes": 1826,
        "comments": 240,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pp-E-Ag3Sz0ULWcb1fJ_ZCY5NBHW41zR0Kgbzs1ioM4.jpeg?auto=webp&amp;s=d7dc4245e8362dfcaed0fdbf0deee7ea9b1411a1"
        },
        "permalink": "/r/movies/comments/1kihw8x/how_once_upon_a_time_in_hollywood_discovered_a/"
    },
    {
        "id": "1kirdba",
        "author": "Realistic-Rule9364",
        "title": "I finally watched Al Pacino and Keanu Reaves in Devils Advocate.",
        "content": "Amazing movie hooked from start to finish 9.1/10 for sure. \n\nI whole heartedly didn’t expect the ending and honestly after the Epstein situation it just feels like The Devils Advocate was just tryna show what really goes on. \n\nLoved how it further showed free will and how it’s us choosing our decisions. ",
        "upvotes": 308,
        "comments": 144,
        "media": null,
        "permalink": "/r/movies/comments/1kirdba/i_finally_watched_al_pacino_and_keanu_reaves_in/"
    },
    {
        "id": "1kimao2",
        "author": "MarvelsGrantMan136",
        "title": "Godzilla x Kong: Supernova (2027) | Now in Production",
        "content": "",
        "upvotes": 541,
        "comments": 234,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KG4bBNYPRb7vFTW7XrzK5Av3rKtG5Hlknm5BEgRdotU.jpeg?auto=webp&amp;s=b6a49ba951ca24f1d9daaed362df93a230e5611c"
        },
        "permalink": "/r/movies/comments/1kimao2/godzilla_x_kong_supernova_2027_now_in_production/"
    },
    {
        "id": "1kiogbf",
        "author": "c0ntr0lled_cha05",
        "title": "I’m not sure I’ve ever felt this disturbed by a film before (Hereditary)",
        "content": "So I’ve seen my fair share of horror films but I just watched Hereditary for the first time and it might be the first one that genuinely *got* to me. I felt weirdly shaken by it - not scared, but unsettled on some deeper level. Some scenes were so horrific I didn’t even realise I was squeezing/clenching my hands until they ended. And I even unexpectedly started crying in the final 10 minutes, not out of sadness but more like something closer to dread. I literally felt off afterwards and didn’t want to go to sleep for a while. \n\nAt first I rated it 4.5 stars because it was good but I never really wanted to think about it again - but then I *did* start thinking about it again. And things started clicking.\n\n**Spoilers below:**\n\nAt first, the history of Annie’s family just seemed like a dark family backstory: her father starved himself, her brother took his own life, and both were labelled schizophrenic. I initially assumed this was just background context, sad but not exactly plot-relevant, but by the end of the film I realised they weren’t just tragic footnotes - they were likely *failed vessels* for Paimon. Annie’s mother, Ellen, wasn’t simply difficult or estranged - she was a long-time cult member, hell-bent on summoning a demon. It’s not a stretch to imagine that she tried (and failed) to use her husband and son first. Her husband deliberately starving himself becomes more than just an act of despair or mental illness when you consider that Paimon prefers ‘healthy male hosts’. Similarly, her son hanging himself in her room after claiming *“She was trying to put people inside me”*  wasn’t simply a mental breakdown. It was an act of resistance. \n\nWhen that didn’t work, she turned her attention to the next generation - hence her sudden reappearance in Annie’s life and insistence that she give birth to Peter, *the next male in the bloodline*. But Annie’s refusal to let her back in only lasted until the birth of Charlie, at which point she took control and practically raised the child, which heavily implies that Ellen had been planning for Charlie to be Paimon’s host - expecting a male - but when Charlie was born a girl, she went ahead anyway. This led to what was probably her first semi-successful attempt, and explains so much about Charlie’s eerie behaviour (her unsettling nature, the clicking sounds, how she was rather odd for a young girl), because Charlie was never really Charlie - she was always just a vessel for Paimon, waiting. But Paimon *prefers male bodies* (as Joan says), so Charlie’s form was never meant to last. Her death was never just random or for shock value, it was a ritual - *“We have corrected your first female body.”*\n\nCue Peter. \n\nThe entire film builds toward his possession with an unbearable, creeping sense of inevitability. What first seems like a chaotic sequence of family tragedies slowly reveals itself to be something far worse: an orchestrated series of events designed solely to break him down emotionally and spiritually and bring him to his most vulnerable state, ready for Paimon to take control. Every family member’s fate - from Charlie’s decapitation to Annie’s unraveling to Steve’s sudden death - was part of a dark lineage passed down like an evil heirloom.\n\n​​That’s what makes Hereditary so disturbing. It doesn’t rely on senseless gore or cheap jump scares to get under your skin. Instead its horror is slow, psychological, and brutally personal. It’s about the things you can’t outrun - not just demons or possession, but lineage, inevitability, and being born into something you can't escape. Every character’s doom feels prewritten, every scene purposeful. That’s what hit me so hard: the sense that these people were *never* free. That they were cursed not by any true fault of their own, but by blood.\n\nBy the end, it all comes together. The final treehouse coronation scene makes everything else fall into place: the decapitations of \\*just\\* the female worshipers that were used as vessels then discarded, the cult’s twisted fixation on Peter, the inescapable curse of inherited fate, and the way every family member's tragedy served the same dark purpose.\n\nTo sum up, Hereditary was horrifyingly brilliant in a way few horror films are. I may not have loved watching Hereditary, but I haven’t stopped thinking about it since. And that, to me, is the mark of something truly unforgettable. Final rating: 5 stars.\n\nAlso as for why Ellen was so dead set on using her own family as pawns in her evil plot, I’m not entirely sure. Perhaps it was because their bloodline already had some sort of unholy tie to the supernatural. Or perhaps she simply just wanted the honour of knowing it was her own flesh and blood that was responsible for hosting the demon she worshipped. Either way… wtf. (I cannot wait to rewatch this at some point in the future and notice all the extra little details I may have missed the first time round!)\n\n  \n**Edit: Wow, I genuinely didn’t expect so many people to engage so thoughtfully with my writeup - 160+ comments and counting!**\n\n**I watched Hereditary for the first time last night and wasn’t even planning to unpack it, but it haunted me so deeply I couldn’t stop thinking - and writing - about it. Hearing that it helped things 'click' for some of you or gave a new emotional angle to revisit the film with has genuinely meant a lot. Whether you loved it, hated it, or were left somewhere in between, hearing all your perspectives has added so many new layers to how I understand the film.**\n\n**Huge thanks to everyone who's taken the time to read, respond, share their thoughts, interpretations, and even personal reflections - it’s made the whole experience feel way more interesting and alive! I’ll keep responding to as many comments as I can because I’m really enjoying the conversation — but just wanted to pause and say a quick thank you here too :))**",
        "upvotes": 400,
        "comments": 217,
        "media": null,
        "permalink": "/r/movies/comments/1kiogbf/im_not_sure_ive_ever_felt_this_disturbed_by_a/"
    },
    {
        "id": "1kihnsb",
        "author": "BunyipPouch",
        "title": "First Poster for Thai Fantasy-Drama 'A Useful Ghost' - After his wife dies due to dust pollution, a man discovers that her spirit has unexpectedly returned in the form of a vacuum cleaner, he embraces it and the pair form an unconventional human-ghost love story.",
        "content": "",
        "upvotes": 911,
        "comments": 121,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/57tmwcc06rze1.jpeg?auto=webp&amp;s=c2a9077363e0a9a23d423953a2fa1e615982f558"
        },
        "permalink": "/r/movies/comments/1kihnsb/first_poster_for_thai_fantasydrama_a_useful_ghost/"
    },
    {
        "id": "1kint7s",
        "author": "KillerCroc1234567",
        "title": "New Image from “Superman”",
        "content": "",
        "upvotes": 361,
        "comments": 95,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WSCxdii5psazhczssRONJZEocVRvXmTYzVhKLIhXDGA.jpeg?auto=webp&amp;s=c5db84e916aa9dbf98dbd6c6683b26a1062718b7"
        },
        "permalink": "/r/movies/comments/1kint7s/new_image_from_superman/"
    },
    {
        "id": "1kim1wv",
        "author": "BobThe-Bodybuilder",
        "title": "Any suggestions for a mind-fuck sci-fi movie?",
        "content": "I like things with strange concepts and things that tickle your brain after watching it. Old movies are cool. Any suggestions would be much appreciated.\n\n12 monkeys\n\nOxygen\n\nMad god\n\nContact\n\nGattaca\n\nDark City\n\nThe Quiet Earth\n\nX machina\n\nEverything everywhere all at once\n\nThe abyss\n\nSwiss army man\n\nShutter Island\n\nA cure for wellness\n\nEdit: Wow... Thank you for all the suggestions! I definitely won't get to all of them but I'll keep the list for the future. For now, I'll watch Predestination as it's popped up a few times.",
        "upvotes": 279,
        "comments": 747,
        "media": null,
        "permalink": "/r/movies/comments/1kim1wv/any_suggestions_for_a_mindfuck_scifi_movie/"
    },
    {
        "id": "1kj2ukk",
        "author": "QosmoQueen",
        "title": "Movie trailers that ruined the actual movie itself? Showed/spoiled all of the best scenes?",
        "content": "Basically what the title says... what movie was spoiled and ruined for you because the trailer gave too much away or spoiled the best scenes? Particularly horror movies where all or most of the good jump scares were featured in the trailer so you anticipated them.\n\nI think the trailer for the movie Smile ruined some good jump scare scenes, especially when a girl knocks on the driver side car window.. IFYKYK",
        "upvotes": 18,
        "comments": 87,
        "media": null,
        "permalink": "/r/movies/comments/1kj2ukk/movie_trailers_that_ruined_the_actual_movie/"
    },
    {
        "id": "1kj14vd",
        "author": "Sonia341",
        "title": "‘Goosebumps’ Actress Odeya Rush Joins Horror-Thriller ‘Corporate Retreat’",
        "content": "",
        "upvotes": 27,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HQoor5iWu5rld_-0gBYL4x3pAk8CvmjCiSEHu-cNbBM.jpeg?auto=webp&amp;s=a5be7fc2a6dc6d0f5ee90bf03f5dcce9556355ed"
        },
        "permalink": "/r/movies/comments/1kj14vd/goosebumps_actress_odeya_rush_joins/"
    },
    {
        "id": "1kiwtfa",
        "author": "Redleg84",
        "title": "Indiana Jones small character moments",
        "content": "Rewatching Indiana Jones and the Temple of Doom, first time for my wife. I apologize for not correcting that sooner. Watching the scene where Indy and Short Round get stuck in the trap, small character moment I saw was Indy has a moment to escape after the first door closes but stops himself as the second door is closing. There isn’t enough time to escape but he stops himself to try and get Short Round through, realizes there isn’t enough time and they both end up stuck in the trap.\nI thought it was a very positive character moment for Indy, even though it is a dangerous situation, he doesn’t forget about Short Round. What do you all think, and does anyone else have a small character moment that stands out for them?",
        "upvotes": 41,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1kiwtfa/indiana_jones_small_character_moments/"
    },
    {
        "id": "1kj3c1i",
        "author": "Giff95",
        "title": "\"The Cat in the Hat\" (2003) is surrealist genius.",
        "content": "Okay, hear me out. *The Cat in the Hat* (2003) is not just a chaotic fever dream from our childhoods. It’s actually a brilliant piece of surrealist comedy and deserves way more credit than it gets.\n\nFirst off, let’s talk about Mike Myers' performance. It’s absolutely unhinged in the best way. He takes the Cat beyond the page and turns him into a manic trickster god, bouncing between vaudeville humor, adult satire, and slapstick. He *knows* how ridiculous the whole thing is, and he leans into it hard. That self-awareness is what gives the film its edge.\n\nNext, the set design and cinematography are insane in a good way. The film looks like a Dr. Seuss book exploded on a soundstage. The colors are bold, the architecture is twisted, and everything is slightly off-kilter. It creates this dreamlike, almost dystopian suburbia that mirrors the chaotic energy of the Cat himself. It’s visually unique in a way most kids’ films wouldn’t dare to be.\n\nAnd yeah, it’s full of jokes that definitely weren't meant for kids, but that’s what makes it timeless. As a kid, it was all goofy fun. As an adult, it’s loaded with wild one-liners and surreal humor that feels closer to Adult Swim than Nick Jr.\n\nIs it a faithful Dr. Seuss adaptation? No. But maybe it’s not supposed to be. Maybe it’s a cult film hiding in plain sight. A chaotic satire of consumerism, suburbia, and childhood boredom wrapped in a furry costume and a red-striped hat.\n\nRewatch it with fresh eyes. You might just realize it's genius in disguise.\n\nAnyone else secretly love this movie?",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1kj3c1i/the_cat_in_the_hat_2003_is_surrealist_genius/"
    },
    {
        "id": "1kikznw",
        "author": "ChiefLeef22",
        "title": "Scarlett Johansson And Miles Teller To Star Opposite Adam Driver In James Gray’s Next Film ‘Paper Tiger’; Filming To Begin Next Month &amp; Sales To Continue At Cannes Market",
        "content": "",
        "upvotes": 152,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WXoLqJFusEj1qwIJeYRO2kPFHXFXAWt6FhQPq2z1Nrc.jpeg?auto=webp&amp;s=5ba13dfa7843fbff854204a5b60da1590573724f"
        },
        "permalink": "/r/movies/comments/1kikznw/scarlett_johansson_and_miles_teller_to_star/"
    },
    {
        "id": "1kij8sw",
        "author": "NoCulture3505",
        "title": "Hannah Einbinder &amp; Gillian Anderson Board Jane Schoenbrun’s ‘Teenage Sex And Death At Camp Miasma’ For Mubi And Plan B",
        "content": "",
        "upvotes": 191,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zV_-cBJrR1SdfLZ44FG2BeXI-OIQeI_eiQKzLRIA8sA.jpeg?auto=webp&amp;s=2c87a95101ce70089f759e08b0de039fbc70731a"
        },
        "permalink": "/r/movies/comments/1kij8sw/hannah_einbinder_gillian_anderson_board_jane/"
    },
    {
        "id": "1kis4bp",
        "author": "BunyipPouch",
        "title": "Nicolas Cage's Jesus-Christ-Horror-Thriller 'The Carpenter's Son' Movie Sells To Magnolia Pictures - Planning Late 2025 Theatrical Release - Also Starring FKA Twigs &amp; Noah Jupe",
        "content": "",
        "upvotes": 43,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zvZvGRuOZIV80sNN0bh7-nOZr7yaHTnqpP2EGFshU4g.jpeg?auto=webp&amp;s=caac96bc9e3fc1818d465fab4b54c7d00ed36124"
        },
        "permalink": "/r/movies/comments/1kis4bp/nicolas_cages_jesuschristhorrorthriller_the/"
    },
    {
        "id": "1kivtte",
        "author": "ShushKebab",
        "title": "Director Hirokazu Kore-eda, director of Monster and Shoplifters, released a short film for Apple",
        "content": "",
        "upvotes": 28,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8E1CHcjoIAx9KlGM1b4EanY5LjiwLwyhaxYTVDhxPJI.jpeg?auto=webp&amp;s=f9babd2329b16d6b2dbbdc9ab8d7b58869f2dfc9"
        },
        "permalink": "/r/movies/comments/1kivtte/director_hirokazu_koreeda_director_of_monster_and/"
    },
    {
        "id": "1ki5ocg",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Simon Pegg - Wednesday 5/21 at 10:45 AM ET - Actor in 'Shaun of the Dead', 'Mission Impossible', 'Hot Fuzz', 'Star Trek, 'The World's End', 'Ice Age', 'Star Wars', and lots more.",
        "content": "",
        "upvotes": 1293,
        "comments": 91,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/adpdspvainze1.png?auto=webp&amp;s=a9b7c8b09f5beea7e357db8e7de4225587cb53dc"
        },
        "permalink": "/r/movies/comments/1ki5ocg/amaqa_announcement_simon_pegg_wednesday_521_at/"
    },
    {
        "id": "1kilhxw",
        "author": "TuxedoAugust",
        "title": "Troy Baker &amp; Yasmeen Fletcher To Star In AI-Themed Sci-Fi Horror Film ‘Othermor’ From The Distorting Mirror &amp; Twenty-Nine Palms – Cannes Market",
        "content": "",
        "upvotes": 81,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TMhHzMRVWgGwLx6zu7gkTz1_2rCX0ERSUSMLiEhXZEI.jpeg?auto=webp&amp;s=e05932a910fa02a337c8b35baa438d57701cb925"
        },
        "permalink": "/r/movies/comments/1kilhxw/troy_baker_yasmeen_fletcher_to_star_in_aithemed/"
    },
    {
        "id": "1kj2b41",
        "author": "DickNJaneNumber1Fan",
        "title": "What is a scene in a movie that is supposed to be really serious but you can’t help but find it funny?",
        "content": "I have 4.\n\n1. I CACKLE during the &gt;!“what’s in the box?”!&lt; scene in Seven. Brad Pitt’s cadence is so goofy. It almost sounds like a Jimmy Carreyesque blooper reel.\n\n2. When Ethan Hawke trips in Dead Poet’s Society, I lose it. I feel terrible because obviously he’s so distraught over &gt;!Neil’s suicide!&lt; , but gosh is it funny. \n\n3. In Harry Potter and the Order of the Phoenix, when &gt;!Voldemort is invading Harry’s mind at the end!&lt;, they put him in a wicked witch of the west sepia background and he just goes “ehhh” and it is so freaking funny. My friend and I quote it to each other all the time.\n\n4. In the fault in our stars, when &gt;!Augustus and Hazel kiss in the Anne Frank museum and everyone claps!&lt; , I mean it’s just so absurd. They didn’t even get permission from the actual museum. They just built a set to look like it! Like what?!?\n\nWhat are y’all’s?\n\n",
        "upvotes": 5,
        "comments": 44,
        "media": null,
        "permalink": "/r/movies/comments/1kj2b41/what_is_a_scene_in_a_movie_that_is_supposed_to_be/"
    },
    {
        "id": "1khye2d",
        "author": "AMA_requester",
        "title": "James Foley, Director of 'Glengarry Glen Ross' and 'Fifty Shades of Grey' Sequels, Dies at 71",
        "content": "",
        "upvotes": 2968,
        "comments": 151,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/k8bcAu2D9OnNIGurPAdJmRsQVN4ulGCYK9eSldgVBhc.jpeg?auto=webp&amp;s=42f7c4643f53a56e1cb7dd6857af98e7d55e1afc"
        },
        "permalink": "/r/movies/comments/1khye2d/james_foley_director_of_glengarry_glen_ross_and/"
    },
    {
        "id": "1kil02r",
        "author": "NoCulture3505",
        "title": "Carrie Coon and Lily James Join Bella Ramsey in Guy Nattiv’s Cult Thriller ‘Harmonia’ for Bleecker Street",
        "content": "",
        "upvotes": 66,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GkDRx1XvSzh4kRqmq_cxA7ikvQKrnqH1MJY1UdIMzx8.jpeg?auto=webp&amp;s=67404eb019b3b2566622f509f154cdf3d004b82b"
        },
        "permalink": "/r/movies/comments/1kil02r/carrie_coon_and_lily_james_join_bella_ramsey_in/"
    }
]