[
    {
        "id": "1jh9vq1",
        "author": "BunyipPouch",
        "title": "/r/movies Giveaway - 600+ Free Tickets to a Special Pre-Screening of 'The Ballad of Wallis Island' on Thursday 4/3 in NYC, LA, Denver, San Francisco, and Philadelphia",
        "content": "",
        "upvotes": 46,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mih2iw3y59qe1.jpeg?auto=webp&amp;s=c3cab925c1d2cfd6af263c1d4944de48b116b8a8"
        },
        "permalink": "/r/movies/comments/1jh9vq1/rmovies_giveaway_600_free_tickets_to_a_special/"
    },
    {
        "id": "1jg5yxw",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Snow White / The Alto Knights)",
        "content": "[Snow White](https://old.reddit.com/r/movies/comments/1jg5wz4/official_discussion_snow_white_2025_spoilers/?)\n\n[The Alto Knights](https://old.reddit.com/r/movies/comments/1jg5x0l/official_discussion_the_alto_knights_spoilers/?)",
        "upvotes": 18,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1jg5yxw/official_discussion_megathread_snow_white_the/"
    },
    {
        "id": "1jhwu9j",
        "author": "zanerands",
        "title": "Event Horizon",
        "content": "I watched event horizon about 1.5 years ago now I I think about the movie atleast once a week. It was a little bit goofy at times but the premise was really intriguing. Please for the love of god somebody create a prequel. It needs one immediately. I need one immediately lmao. Those scenes of the crew before them was super intense and grotesque but interesting nonetheless.",
        "upvotes": 578,
        "comments": 235,
        "media": null,
        "permalink": "/r/movies/comments/1jhwu9j/event_horizon/"
    },
    {
        "id": "1ji260v",
        "author": "Bennett1984",
        "title": "Green Room, Bone Tomahawk, The Witch, and the Must-See Films of 2015",
        "content": "",
        "upvotes": 139,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/m2aLA_5mFGPmBo9hnrJoRskJB_SDlx6fYq-oq02-dm4.jpg?auto=webp&amp;s=9452e5adb031c834599bd45ff8cccb38486ad9a6"
        },
        "permalink": "/r/movies/comments/1ji260v/green_room_bone_tomahawk_the_witch_and_the/"
    },
    {
        "id": "1jhe4ax",
        "author": "Bullingdon1973",
        "title": "LEAVING NEVERLAND, the 2019 Michael Jackson documentary that shook the world, has effectively vanished after HBO-MAX removed it due to a non-disparagement clause",
        "content": "",
        "upvotes": 8177,
        "comments": 1070,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VTrZrCBVxvqn7hfdABWA1RVBlxTjYZSICLwIexO4xak.jpg?auto=webp&amp;s=822dc94998183c946c57e0bdcd6d7e9ecf7b1f4c"
        },
        "permalink": "/r/movies/comments/1jhe4ax/leaving_neverland_the_2019_michael_jackson/"
    },
    {
        "id": "1jhvotz",
        "author": "MaxProwes",
        "title": "I rewatched The 6th Day (2000) and it honestly feels like a spiritual sequel to Total Recall in many ways, creepy doll humor is something straight from Verhoeven's film. People should check it out if they didn't",
        "content": "",
        "upvotes": 243,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pWhHNLzHxnn1rGlOVW8gQCx_DAA-Uvz61sBBAyeB4Vo.jpg?auto=webp&amp;s=da50d03eee6192ee473b7df5201afb95a6f270dd"
        },
        "permalink": "/r/movies/comments/1jhvotz/i_rewatched_the_6th_day_2000_and_it_honestly/"
    },
    {
        "id": "1ji0nd1",
        "author": "pilofication",
        "title": "are there any movies, where at the end, you realize you’ve been rooting for the bad guy",
        "content": "this is a silly question, but i watched a youtube video the other day and this guy was just playing a game with his friends that he made, and he set it up to make them look like they were heros savint the world and killing bad guys, but at the end they realize they saw it all wrong and they were actually good people. idk, just had a random thought and figured id ask here",
        "upvotes": 85,
        "comments": 239,
        "media": null,
        "permalink": "/r/movies/comments/1ji0nd1/are_there_any_movies_where_at_the_end_you_realize/"
    },
    {
        "id": "1ji2rom",
        "author": "These_Feed_2616",
        "title": "Tropic Thunder is one of the greatest comedies of all time",
        "content": "This movie is just fucking hilarious, I love how meta it is. The satirical way it makes fun of stuff, and the movie is filled with so many moments that make you laugh out loud. The fake trailers at the beginning are just brilliant. The simple Jack thing is hilarious. Robert Downey Jr played his part perfectly, I didn’t even see him in this movie at all, one of the best comedic performances of all time! Tom Cruise is great as the movie producer and his dancing was so hysterical, especially how he does it during the end credits. There isn’t one weak moment in this film, just scene after scene it’s just joke after joke. It’s just a perfect comedy in every way and it never gets old for me!",
        "upvotes": 41,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1ji2rom/tropic_thunder_is_one_of_the_greatest_comedies_of/"
    },
    {
        "id": "1jhg34z",
        "author": "ChiefLeef22",
        "title": "'Erin Brockovich' at 25 - revisiting Soderbergh's feelgood, earnest, old-fashioned Hollywood A-list vehicle",
        "content": "",
        "upvotes": 1501,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BhSI07bFby6-01Ac784nRBxkEsSNQUCVWdAi0Ik-qO8.jpg?auto=webp&amp;s=b6c69bdc32fc5fe32cd29fab1399bd7ae8ee32e6"
        },
        "permalink": "/r/movies/comments/1jhg34z/erin_brockovich_at_25_revisiting_soderberghs/"
    },
    {
        "id": "1jhwafz",
        "author": "Infamous-Charity3930",
        "title": "Ginger Snaps 4K Restoration(unofficial)",
        "content": "",
        "upvotes": 60,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Jc8nzLXI3LLNq82ntabbpD26xEW-qm031BF3I664h7A.jpg?auto=webp&amp;s=f26e3873e6821badca601b90a126fc3cba4a0814"
        },
        "permalink": "/r/movies/comments/1jhwafz/ginger_snaps_4k_restorationunofficial/"
    },
    {
        "id": "1jhx6zi",
        "author": "OtherwiseTackle5219",
        "title": "Blood Simple 1984",
        "content": "Joel &amp; Ethan Coen's 'Neo-Noir' Film About a Texas Bar Owner that has a Private Detective discover his Wife's Affair with one of his Bartenders.  Decides with the PI to have them killed.  Things go off the rails in so many ways.  Dark &amp; Gritty, &amp; a bit Bloody &amp; Gory at times.  Full of Tension &amp; Suspense.  Holds your interest to the end if you're a fan of Film-Noir.",
        "upvotes": 40,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1jhx6zi/blood_simple_1984/"
    },
    {
        "id": "1jhjyed",
        "author": "Venus-Xtravaganza98",
        "title": "Who are some “good “ actors that you don’t like?",
        "content": "We all have them. There’s an actor everybody loves. Maybe they’re a multi-Oscar winner, or a prominent character actor, or just a big box office draw, but you just don’t get it.\n\nMy big one is Richard Gere. I know you’d never see him on a list of greatest actors, but he’s definitely well-respected enough to have a “good actor” reputation attached to him. I like a few of his movies, but I always found him to be an excruciatingly boring watch. I suppose he’s not the worst, but more often than not I end up checking my watch when he’s on screen.\n\nWho are yours?",
        "upvotes": 429,
        "comments": 2224,
        "media": null,
        "permalink": "/r/movies/comments/1jhjyed/who_are_some_good_actors_that_you_dont_like/"
    },
    {
        "id": "1jhwny4",
        "author": "itsthewolfe",
        "title": "Fast and Furious x Transformers is the crossover movie we need.",
        "content": "Imagine Dom and Bumblebee teaming up to save the world. \n\nAll done in a Michael Bay style universe filmed with over the top explosions and action scenes\n\nThe world is in chaos. The Autobots and Decepticons have returned, but this time, their war is no longer limited to distant planets or secret battlefields. The conflict has spilled onto Earth, and humanity is caught in the crossfire. The Autobots have forged a fragile alliance with the military, while the Decepticons, led by Megatron, are more determined than ever to enslave mankind for their own power.\n\nMeanwhile, Dominic Toretto (Vin Diesel) and his crew—Letty (Michelle Rodriguez), Roman (Tyrese Gibson), Tej (Ludacris), and others—are laying low after their last mission, trying to live a normal life. But their peace is shattered when a mysterious ally, Optimus Prime (Peter Cullen), seeks them out for help. Optimus needs their skills in navigating dangerous streets and using vehicles to battle the Decepticons, who are now trying to take control of critical transportation routes to fuel their war effort.\n\nDom, reluctant at first, is convinced when he learns the Decepticons are targeting his family—his crew, and even his daughter, Brian (Paul Walker's character’s son, introduced with technology to honor his legacy). The Autobots need the best drivers and racers to infiltrate high-stakes races and sabotage Decepticon supply chains that are hidden behind underground black-market networks.. ",
        "upvotes": 41,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1jhwny4/fast_and_furious_x_transformers_is_the_crossover/"
    },
    {
        "id": "1jhd36q",
        "author": "KillerCroc1234567",
        "title": "New Poster for “Sinners”",
        "content": "",
        "upvotes": 869,
        "comments": 233,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0sdqlcbgv9qe1.jpeg?auto=webp&amp;s=f3c03e67c20539dae8c2895d7c39cf77f8f3727b"
        },
        "permalink": "/r/movies/comments/1jhd36q/new_poster_for_sinners/"
    },
    {
        "id": "1ji2pqo",
        "author": "BrandonStRandy1993",
        "title": "Which movie has the funniest plot?",
        "content": "My vote goes to Hot Rod. The entire plot of the movie is Rod trying to raise money for his stepdad’s heart transplant so he can save his life and then kick his ass. Throw in Will Arnett and the scene where Rod falls down the hill for an hour and you’ve got one of the funniest movies of the 2000s. Which other movies are immediately funnier when you just think about the basic plot? ",
        "upvotes": 11,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1ji2pqo/which_movie_has_the_funniest_plot/"
    },
    {
        "id": "1jhgtls",
        "author": "ObiWan-Shinoobi",
        "title": "What is a powerfully deep quote from a movie that has stuck with you?",
        "content": "&gt; John Connor: We're not gonna make it, are we? People, I mean.\n\n&gt; The Terminator: It's in your nature to destroy yourselves.\n\nThis quote has stuck with me throughout the years. John and the Terminator have a quiet moment in the movie, and it gives John a moment to reflect on the inevitable fate of humanity. Every year it seems like this is proving more true as I watch the world change around us.",
        "upvotes": 398,
        "comments": 604,
        "media": null,
        "permalink": "/r/movies/comments/1jhgtls/what_is_a_powerfully_deep_quote_from_a_movie_that/"
    },
    {
        "id": "1jhfng3",
        "author": "milliondollardrift",
        "title": "Do you guys know of any filmmakers who knocked it out of the park with their first feature?",
        "content": "I’d like to submit Sidney Lumet as my example, whose 12 Angry Men is likely the most beloved first film in history. Do you guys have any other examples? A similar but not exactly identical conversation might revolve around filmmakers who peaked with their first movie, which I’d also be interested in hearing examples of. I’d also like to hear reasons why these movies and filmmakers are so great, if you can articulate them.",
        "upvotes": 433,
        "comments": 880,
        "media": null,
        "permalink": "/r/movies/comments/1jhfng3/do_you_guys_know_of_any_filmmakers_who_knocked_it/"
    },
    {
        "id": "1jhzn5w",
        "author": "swagboyclassman",
        "title": "Best high fantasy films besides LoTR?",
        "content": "I’m worldbuilding and am looking for some inspiration. I already watched LoTR extended editions, which initially got me interested, then a DnD campaign I had to write for work got me thinking more about it. I’m about a year into writing and my friend asked me if I’d been watching any fantasy stuff to get inspo and I realized I hadn’t been! I’ve been writing lore raw with latent influence from everything I’d seen before, but I haven’t looked for anything new yet. Any recommendations would be really appreciated :)",
        "upvotes": 15,
        "comments": 85,
        "media": null,
        "permalink": "/r/movies/comments/1jhzn5w/best_high_fantasy_films_besides_lotr/"
    },
    {
        "id": "1jhhrt8",
        "author": "LiteraryBoner",
        "title": "Closing arguments scene from The Verdict, one of Paul Newman's best performances. A movie about how the egos and flaws of \"great men\" make collateral damage out of working class lives.",
        "content": "Rewatched this last night after king Tracy Letts drafted it in the Big Pitcure podcast 1982 draft. It's so damn good with an all-timer performance from Newman. He's in the midst of a crisis of purpose, but even when he's trying to help the working class he makes mistakes that cause his clients pain. Everyone who isn't a doctor or a lawyer or a Cardinal in this movie lumps them all into one elite class of assholes and they're not wrong. It's so well acted from everyone, including James Mason as the defending attorney. I swear you can see him start to sweat during the climactic testimony. That's fucking acting right there. ",
        "upvotes": 304,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/axDEvxw5ZZO9Ns9QKPZ0BzrZzUQYUfMJTF8K5aUa6dU.jpg?auto=webp&amp;s=443b0ba0a3f8305953f6908761c8da4329f94aa0"
        },
        "permalink": "/r/movies/comments/1jhhrt8/closing_arguments_scene_from_the_verdict_one_of/"
    },
    {
        "id": "1ji2aga",
        "author": "connorramierez",
        "title": "Why did old movies put books on the poster?",
        "content": "I've been watching a lot of older movies lately. Something I have noticed is a lot of these movies are based on books and the poster will feature a book on the poster. Not like the book that inspired the movie just... a book. \n\nHere's the poster for Rebecca: https://upload.wikimedia.org/wikipedia/commons/a/ad/Rebecca_%281939_poster%29.jpeg\n\nHow Green Was My Valley: https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/How_Green_Was_My_Valley_%281941_poster_-_Style_A%29.jpg/800px-How_Green_Was_My_Valley_%281941_poster_-_Style_A%29.jpg\n\nThe Lost Weekend: https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/The_Lost_Weekend_%281945_film%29.jpg/800px-The_Lost_Weekend_%281945_film%29.jpg\n\nThese are just generic blank books. They take up most of the space on the poster. I get wanting to establish a connection to a successful book but did audiences just forget what books were in the Golden Age of Hollywood?\n\nEdit: There are WAY more examples of this, these three just jumped out at me.",
        "upvotes": 9,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AvpDHBcylGQ4EnqnZky4UFqxRYMxD9eoASuBwKOiEzY.jpg?auto=webp&amp;s=ce04818e3ebbb107144254357816b33284a120fa"
        },
        "permalink": "/r/movies/comments/1ji2aga/why_did_old_movies_put_books_on_the_poster/"
    },
    {
        "id": "1jhqktg",
        "author": "Shaxxs0therHorn",
        "title": "What’s your favorite movie?",
        "content": "Mine's The Big Lebowski. I honestly think it's one of the best movies made in the last 30 years. It's timeless but also poignant for the comedic hubris of the 90s and the absurdity of 'the California culture' and Los Angeles. \"They peed on my fucking rug, man. This aggression will not stand.\" I don't feel like I need to give a dissertation on why. Watch it if you haven't. It's just a  completely personal opinion bc of who I am and the era I grew up in.  What's your's? ",
        "upvotes": 70,
        "comments": 359,
        "media": null,
        "permalink": "/r/movies/comments/1jhqktg/whats_your_favorite_movie/"
    },
    {
        "id": "1ji0um2",
        "author": "Kind-Significance163",
        "title": "Random question on Land of the Lost (2009)...",
        "content": "(at 2:30)\n\nIn Land of the Lost (2009), Rick (Will Ferrell) tells Will (Danny McBride) that dinosaurs have brains the size of a walnut. Then explosion sounds are heard, and they see a package at the front of the cave. They open it and it's a giant walnut, then the camera zooms in on Grumpy (the grey t-rex) smiling. There is one thing i have always wondered about this scene. What exactly made those explosion-like noises? Was it Grumpy's footsteps, or was it the package hitting the ground? I need the answer, please.",
        "upvotes": 8,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mx3NMKAW5ihfZq73z50ydz96TjbLGnxL3Uw0j8YpfDI.jpg?auto=webp&amp;s=5bad9fba90870df30365ad984b284d27a2e723c2"
        },
        "permalink": "/r/movies/comments/1ji0um2/random_question_on_land_of_the_lost_2009/"
    },
    {
        "id": "1jhbnb1",
        "author": "Les_Turbangs",
        "title": "What Is The Film? — Husband Gaslights His Wife",
        "content": "I once saw a clip of a Hollywood film in which a wife catches her husband in their bedroom in bed with another woman. The other woman quickly rushes out but the husband performs the mother of all gaslighting by calmly getting out of bed, gets dressed, sits in a chair and starts reading the paper all while denying the wife’s continued protestations. “What woman?” “What bed?”\n\nI think the actor was Bill Macy and the film likely made in the 60s or 70s. Can anyone help me identify the film?\n\n",
        "upvotes": 391,
        "comments": 69,
        "media": null,
        "permalink": "/r/movies/comments/1jhbnb1/what_is_the_film_husband_gaslights_his_wife/"
    },
    {
        "id": "1ji2s8t",
        "author": "Holiday_Estate5679",
        "title": "Patrick Bateman work profile",
        "content": "Is Patrick Bateman a businessman or an employee in Investment Banking? Asking cause I don’t see him doing much at work except for dining at fine restaurants and comparing business cards. \n\nIs his job or whatever even real? Or just a figment of his imagination? At the end he seemed to have some sort of identity crisis. What do y’all think?",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1ji2s8t/patrick_bateman_work_profile/"
    },
    {
        "id": "1jgt1xw",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for ‘Not Just a Goof’, a Documentary About ‘A Goofy Movie’ - Follows a young creative team tackling their first Disney feature, its initial disappointment, and its surprising resurgence decades later",
        "content": "",
        "upvotes": 9648,
        "comments": 460,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gs4ej4xz94qe1.jpeg?auto=webp&amp;s=e4de3419036117ddeda7007c42a23a8e8ce07f47"
        },
        "permalink": "/r/movies/comments/1jgt1xw/official_poster_for_not_just_a_goof_a_documentary/"
    },
    {
        "id": "1jho9lu",
        "author": "falabela",
        "title": "What are your thoughts on Juror # 2?",
        "content": "I just watched it on a flight and I really enjoyed it. It’s been a while since a move left me reflecting and wondering like this one did. \n\nI’m surprised about the box office stats, cause it seems to have been well received by critics. \nWas it distribution? Is it the genre or the style that didn’t resonate with the public? \n\nWhat are your thoughts?\n",
        "upvotes": 51,
        "comments": 111,
        "media": null,
        "permalink": "/r/movies/comments/1jho9lu/what_are_your_thoughts_on_juror_2/"
    },
    {
        "id": "1jh9trt",
        "author": "Bennett1984",
        "title": "THE LAST SPARK OF HOPE Official Trailer",
        "content": "",
        "upvotes": 369,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TzBmDYQb9XFtUNHj2Q1zIGiHzmBSQjgbJQcsg8egK4U.jpg?auto=webp&amp;s=6f4d215711a7a0b0f92c077549b479030b9b7a0a"
        },
        "permalink": "/r/movies/comments/1jh9trt/the_last_spark_of_hope_official_trailer/"
    },
    {
        "id": "1jhq4xh",
        "author": "Beast_Bear0",
        "title": "What are some movies with strong older women?",
        "content": "I love the older women in movies like Margo Martindale, Olympia Dukakus in Moonstruck and Steel Magnolias that have that ‘shoot from the hip’, say what I am thinking, I don’t care attitude. \n\nJane Russell, street smart in Gentlemen Prefer Blondes. \n\nI’m looking for more women like this, and their movies. \n\nI know Barbara Stanwich but what’s her best movie? \n\nThanks in advance!!",
        "upvotes": 33,
        "comments": 236,
        "media": null,
        "permalink": "/r/movies/comments/1jhq4xh/what_are_some_movies_with_strong_older_women/"
    },
    {
        "id": "1ji2tw3",
        "author": "JesusIsGoodPeople",
        "title": "Does anyone know the name of thise movies?",
        "content": "A few years ago a teacher put a movie on class, it was a heavy one, about a girl in an orphanage. In the beginning of the movie the other girls put bleach in her shampoo so she tried to run away. Thr movie is quite old, but i can't remember the name for shit. It was either British or American movie.\n\nThe second movie I'm looking for is a one about a girl whose dad was an alcoholic and she had to hide that fact in school. I thi6they bullied her? She trew her dad's alcohol out if the window and he got angry. \n\nThe third movie was about a girl who received a letter from a random person and then finds the person who turns out to be an old man in a nursery home who wrote encouraging letters to people so she became friends with him and kept writing the letters herself. It was based of a book, i think. The last letter was for her brother who, i think, had cancer. It was a simular style to \"a man called ove\", the book by fredric backman. \n\nAll of the movies except the last one could be considered a bit heavy, i watched them when i was in middle school for \"educational purposes\". The English teacher put them on for us to practice our English and to be aware from the dangers of drug and alcohol ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1ji2tw3/does_anyone_know_the_name_of_thise_movies/"
    },
    {
        "id": "1jhlafk",
        "author": "CT_Phipps-Author",
        "title": "[Movie Review] Companion (2025) is a really fun black comedy about sci-fi relationships",
        "content": "COMPANION (2025) was a film I was back and forth reviewing due to being a science fiction black comedy. If I had to define its genre, I'd say it's cyberpunk lite. A story that could basically be summarized as \"What if Blade Runner starred the machines and had really stupid people after them?\" Despite the comedic elements or perhaps because of them, the film deals with a lot of incredibly dark subject matter and touches on numerous themes of both technology as well as socialization. \n\nIt's sort of an interesting comparison to EX MACHINA, which had the idea of our machines as wholly inhuman but mankind confusing them for people. This is instead the story of us making our machines human enough that we just use it as an excuse to treat them as how we already treat ourselves (which is like shit). There's a strong feminist theme to the movie that underscores the comedy and slasher movie vibe as our heroine struggles to understand what her \"boyfriend\" now wants to murder her.\n\nThe marketing spoiled a lot of this movie in a manner like CAPTAIN AMERICA: BRAVE NEW WORLD as one of the biggest twists comes around the fifteen minute mark but is spoiled by the poster. Indeed, I wasn't even aware it was meant to be a surprise until I watched this movie with my nieces. They had no familiarity with the movie and thus were completely taken off guard when it happened. If you can watch the movie unspoiled or with people who don't know anything other than the title, then I recommend it. Otherwise, note, that the rest of the review will treat this initial reveal as a given.\n\nThe premise for Companion is that Irish (Sophie Thatcher) and Josh (Jack Quaid) are a sickeningly happy couple that are visiting their Russian friend's house for the weekend. It is an incredibly luxurious house in the middle of nowhere and they'll be joined by several friends. It is in the near future with self-driving cars and a variety of other luxury items that seem to be available only to the super rich, though Jack isn’t one of them. One of the guests, Kat (Megan Suri), is initially very hostile to Iris and she doesn't know why. Sergey (Rupert Friend) gets aggressive with Iris and events spiral out of control when he's killed.\n\nWhich turns out to have been the plan all along as Iris discovers that's what she was programmed to do all along. Iris, much to her shock and horror, is a companion robot for Josh. A sort of sexy Tamagotchi that was given a set of fake memories and a willingness to please that overrides all other considerations. Rather than the superhumans of Blade Runner, companions are deliberately made to be no smarter or stronger than \"regular\" humans with the ability of their owners to make them even dumber or weaker. Josh is fond of his companion robot but no more so than a pet and arguably even less than that as he's willing to sacrifice her as part of his plan to murder Sergey then rob him. Unfortunately, he's careless with his master control and he's turned up Iris' survival instincts.\n\nMuch of the movie is, essentially, not so veiled commentary on \"nice guy\" misogyny. Josh is good looking and willing to put on a pleasant enough face around his girlfriend but only when she's subservient to him. Ultimately, she's a convenience and someone that he gets increasingly violent toward as he finds his plans thwarted. We also discover just how fragile Josh's self-esteem is. The fact Jack Quaid is the kind of actor that would be the dorky but handsome lead in a romantic comedy, makes his transformation even more shocking. Like a slowly boiling kettle, we also see how the escalation grows from dismissiveness to furious rage.\n\nThe movie's humor comes from the same source as the movie's terror. The murderers are not particularly competent at their crimes but that doesn't mean they're not dangerous. All of them, even the more sympathetic ones, think of Iris as an appliance that needs to be destroyed. The absolute lack of sympathy from everyone around here is surprisingly well realized. Sophie Thatcher beautifully embodies both the idealized retro-girlfriend with her 1950s-esque inspired look as well as the increasingly capable Iris as she realizes her only way out may be blocked by what she was made to be. I had a lot of fun with this movie.",
        "upvotes": 50,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1jhlafk/movie_review_companion_2025_is_a_really_fun_black/"
    },
    {
        "id": "1ji2x7y",
        "author": "dafones",
        "title": "CinemaStix: Yep, I Cry Every Time (A Knight's Tale)",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/66-4981uWCvMD13vNz2G-YWCLkXbyT-rm6qoROyuUsA.jpg?auto=webp&amp;s=467808dc617f254e1528485b091e93e7b0299db9"
        },
        "permalink": "/r/movies/comments/1ji2x7y/cinemastix_yep_i_cry_every_time_a_knights_tale/"
    },
    {
        "id": "1jh386l",
        "author": "Radar584",
        "title": "What are the most Historically inaccurate movies?",
        "content": "I recognize that \"Braveheart\" contains multiple historical inaccuracies, including the misplacement of pivotal battles and the inaccurate portrayal of certain historical figures. For instance, the film depicts the Battle of Stirling Bridge without actually featuring the bridge, which played a critical role in the real conflict. Additionally, characters like William Wallace and Robert the Bruce are shown in ways that diverge significantly from historical records. \nWhat are some other movies that have historical inaccuracies?",
        "upvotes": 755,
        "comments": 1228,
        "media": null,
        "permalink": "/r/movies/comments/1jh386l/what_are_the_most_historically_inaccurate_movies/"
    }
]