[
    {
        "id": "1hqxs0r",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1hqxs0r/la_piola_friends_meetup/"
    },
    {
        "id": "1hqxs0j",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1hqxs0j/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1i99s1r",
        "author": "Available-Fee-9219",
        "title": "My photos of Torino",
        "content": "I'm a first year international student at Politecnico di Torino and here are few photos of Torino that I clicked so far. Shot on OnePlus 11r.",
        "upvotes": 789,
        "comments": 26,
        "media": null,
        "permalink": "/r/torino/comments/1i99s1r/my_photos_of_torino/"
    },
    {
        "id": "1i9z548",
        "author": "NightPuzzleheaded114",
        "title": "RANT GTT - Bici in autobus",
        "content": "Lavoro come rider e questa sera ho avuto la triste esperienza di bucare la ruota dietro della bici elettrica.\nSiccome ero in mezzo alla periferia rispetto a dove abito (fine zona San Paolo) ho pensato di salire sul primo bus che mi portasse in zona da me (Gran Madre).\nAspetto 10 minuti, arriva il 64 e l’autista mi ha detto che non potevo starci, io insistendo mostrandogli la bici con la ruota totalmente andata lo pregato di farmi stare.\nSto stronzo mi fa “eh ma se devo caricare un disabile”.\nMi ha lasciato sotto la pioggia, ad 1,30h di distanza a piedi quando il pullman era mezzo vuoto e se ci fosse stato bisogno di spazio sarei anche sceso.\nAuguro a questo infame di passare il doppio della mia disgrazia.\n\nP.s qualcuno è conoscenza se fosse possibile viaggiare su un pullman con la bici?\nAvrei anche potuto schiacciarla perché è un modello smontabile ",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1i9z548/rant_gtt_bici_in_autobus/"
    },
    {
        "id": "1i9zvt9",
        "author": "P0lpett0n3",
        "title": "Conoscete gruppi Whatsapp e Telegram per trekking in piemonte?",
        "content": "Conoscete gruppi Whatsapp e Telegram per trekking in piemonte?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1i9zvt9/conoscete_gruppi_whatsapp_e_telegram_per_trekking/"
    },
    {
        "id": "1i9szqx",
        "author": "UglycoreIT",
        "title": "Vivo da 10+ anni a Torino da fuori sede, risponderò a tutte le domande",
        "content": "AMA\nPrecisamente sono del sud Italia, sono f31 e vediamo se posso aiutarvi ",
        "upvotes": 4,
        "comments": 40,
        "media": null,
        "permalink": "/r/torino/comments/1i9szqx/vivo_da_10_anni_a_torino_da_fuori_sede_risponderò/"
    },
    {
        "id": "1i9mltu",
        "author": "ivlia-x",
        "title": "Quale biglietto devo comprare per andare da Ikea?",
        "content": "Non voglio prendere la macchina. Vedo che ci arriva il pullman 32 ma non riesco a trovare le informazioni sulle zone extraurbane…. Sull’app GTT ci si possono comprare 10 tipi diversi di biglietto extraurbano, non so quale mi serve. Aiuto?\n\nHo l’abbonamento urbano ma da ciò che vedo non vale per questa tratta",
        "upvotes": 5,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1i9mltu/quale_biglietto_devo_comprare_per_andare_da_ikea/"
    },
    {
        "id": "1i9uy8w",
        "author": "DirectInteraction825",
        "title": "Zona Aurora Torino",
        "content": "Ciao a tutti, \nsono un ragazzo che ha appena iniziato a lavorare a Torino e ho appena trovato casa in zona Aurora, in particolare l'appartamento sarebbe in una traversa vicino al Rondò Forca Ovest. \nVorrei avere informazioni riguardo a quella zona, non sono pratico di Torino perché mi sono appena trasferito e leggendo in giro non parlano bene di Aurora.\nSe avete consigli sono ben accetti.",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1i9uy8w/zona_aurora_torino/"
    },
    {
        "id": "1i9t46x",
        "author": "CryingAlwaysCrying",
        "title": "Col Range Rover per assaltare la farmacia",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HDQEN8H2BLP-bh_oVByHSnK9oNHzVSZ5MjNO6p-8JG8.jpg?auto=webp&amp;s=8c5eefd6063fa276164aced7ff95a9fe6108527f"
        },
        "permalink": "/r/torino/comments/1i9t46x/col_range_rover_per_assaltare_la_farmacia/"
    },
    {
        "id": "1i9kpxu",
        "author": "nickname1917",
        "title": "Amiat e la raccolta porta a porta",
        "content": "Come va il servizio da voi?\n\nDa me ogni settimana qualcuno si dimentica di passare, ieri quelli della carta non sono passati, la scorsa settimana non sono passati quelli della plastica, la settimana prima quelli dell'indifferenziata.\n\nOgni volta il cortile si riempie di spazzatura e bisogna fare le segnalazioni per chiedere come mai non sono passati e se cortesemente possono passare senza aspettare la settimana successiva.\n\nMa perché se ci sono i giorni prestabiliti non effettuano la raccolta?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i9kpxu/amiat_e_la_raccolta_porta_a_porta/"
    },
    {
        "id": "1i9k30v",
        "author": "Coccorocco1",
        "title": "Consigli cenetta in montagna",
        "content": "Sto cercando un posto dove mangiare a cena stasera nei pressi di Torino ma in montagna, che sia accessibile con la macchina e che non costi mille milioni 😁",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1i9k30v/consigli_cenetta_in_montagna/"
    },
    {
        "id": "1i9l8gd",
        "author": "themasterwuz",
        "title": "Zona Parella",
        "content": "Ciao, questo è il mio primo post qua. Volevo chiedere informazioni circa la zona Parella, in particolare intorno a via Nicola Fabrizi. Ho trovato un appartamento che potrebbe fare per me.   \nHo visto che la metro è piuttosto vicina, quindi immagino i mezzi pubblici non siano un problema. Per quanto riguarda gli altri servizi, tipo supermercati e locali? Si tratta di un quartiere tranquillo? ",
        "upvotes": 2,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1i9l8gd/zona_parella/"
    },
    {
        "id": "1i9padm",
        "author": "jinx_1345",
        "title": "Mostra HR Giger",
        "content": "Ciao! Vorrei chiedere un'informazione: I biglietti per la mostra di Giger si possono prendere in loco oppure solo su ticket One? Se lo prendessi on-line il sito dà la disponibilità di acquistarlo open oppure nella data considerata con orario indicato alle 9:30 (ma dura tutto il giorno?)\nGrazie a chi risponderà ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i9padm/mostra_hr_giger/"
    },
    {
        "id": "1i9la6w",
        "author": "barbax-7",
        "title": "Piazza Derna",
        "content": "Come valutereste la zona di Piazza Derna per alloggiare in hotel, una famiglia di 4 persone, con spostamenti serali verso il centro con il tram 4?",
        "upvotes": 1,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1i9la6w/piazza_derna/"
    },
    {
        "id": "1i9ii6n",
        "author": "Alternative-Oil2330",
        "title": "Mappano - Torino",
        "content": "Ciao, a breve mi trasferirò vicino Mappano e avrei il bisogno di raggiungere Torino. Avevo pensato di lasciare la macchina alla stazione di Stura, c'è qualche zona tranquilla nelle vicinanze dove parcheggiare gratis? Il parcheggio del centro commerciale le Porte è sempre aperto?\nCome alternativa avevo pensato anche Falchera cap\n\nQualsiasi consiglio è ben accetto.\n\nGrazie a tutti",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1i9ii6n/mappano_torino/"
    },
    {
        "id": "1i9eosw",
        "author": "misturbusy",
        "title": "Changes to family reunification for work visa in 2025",
        "content": "I'm partially through the process of obtaining a digital nomad visa. And my wife and I are presented with a few routes to gaining her entry to IT as well. Sidenote: she is pregnant so we're trying to be cautious and weigh routes that are shorter and those with less risk.   \n  \nCurious if anyone has gone through any of the following in the New Year (I believe a law passed at the end of December that changed the process):   \n\\- \"Visa for family reasons\"  \n\\- Family reunification process when seeking permesso di soggiorno  \n\\- One spouse with a visa obtaining a Nulla Osta for the other spouse (if so, how long does this take in Torino?)",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1i9eosw/changes_to_family_reunification_for_work_visa_in/"
    },
    {
        "id": "1i96w2q",
        "author": "Altruistic-Cash7223",
        "title": "Food in Torino after midnight?",
        "content": "\n“Hi, we will be arriving at our Airbnb around midnight. Is there any chance we can find something to eat?”\n\nNear - The Queen Victoria Pub area",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i96w2q/food_in_torino_after_midnight/"
    },
    {
        "id": "1i94fk2",
        "author": "bora907",
        "title": "Erasmus",
        "content": "I will be in Torino in 8 days for Erasmus. Any advices? What should I expect? Is there any neighbourhoods I should avoid while choosing place to stay.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1i94fk2/erasmus/"
    },
    {
        "id": "1i8y394",
        "author": "cawalli",
        "title": "Billy cobham @ Torino jazz festival 2012",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w5i2drlrnyee1.jpeg?auto=webp&amp;s=981ff34ba051c14e0446344b03bc8f629cacc7de"
        },
        "permalink": "/r/torino/comments/1i8y394/billy_cobham_torino_jazz_festival_2012/"
    },
    {
        "id": "1i93es3",
        "author": "AlessioLioRosso",
        "title": "Gli istituti di vigilanza sono sopravvalutati",
        "content": "Con quello che costa un servizio di vigilanza ci si può, con le dovute accortezza, proteggersi da soli.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1i93es3/gli_istituti_di_vigilanza_sono_sopravvalutati/"
    },
    {
        "id": "1i8t3mf",
        "author": "AltairITA",
        "title": "palestre da suggerire?",
        "content": "ciao a tutti!\n\nabito in piazza massaua (proprio sopra) e mi piacerebbe iscrivermi in una palestra.\n\nchiaramente, si vede anche dal tipo di richiesta, non sto qui a dirvi che non sono di torino ma ci abito soltanto da agosto, perché è palese, e quindi per questo non so proprio dove rivolgermi se non qui da  voi.\n\nho visto un bel po' di palestre su IG, i loro profili, ma, ovviamente, in bocca a loro sono sempre le migliori eccetera, devono pur sempre vendere.\n\nnon conosco tantissima gente a cui chiedere feedback, e i miei colleghi sono tutti di altre zone di torino (centro o zona est) e non mi va di spostarmi così tanto\n\ne quindi, eccomi qui.\n\ngrazie in anticipo!",
        "upvotes": 1,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1i8t3mf/palestre_da_suggerire/"
    },
    {
        "id": "1i8s8hr",
        "author": "swimmerturkey",
        "title": "Travelling to Turin from Milan MXP",
        "content": "Hey everyone! Could someone please tell me what's the best way to travel from Milan MXP to Turin? Are affordable taxi services available at the airport or are trains my only option? Thanks in advance! ",
        "upvotes": 1,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1i8s8hr/travelling_to_turin_from_milan_mxp/"
    },
    {
        "id": "1i894vk",
        "author": "G44bri",
        "title": "Tennis a torino capitale",
        "content": "ciao, ho 21 anni e ho fatto due annetti di tennis. Ormai sono un po' di anni, tipo tre, che non gioco più però se c'è qualcuno scarso come me che vuole migliorare/farsi qualche partita di tennis ai circoli sul Po sarebbe bello. \n",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1i894vk/tennis_a_torino_capitale/"
    },
    {
        "id": "1i80mj5",
        "author": "Ouats_Law",
        "title": "Qualcuno ha mappe personalizzate di Torino con luoghi particolari e insoliti?",
        "content": "Ciao a tutti!   \nSto cercando mappe personalizzate di Torino (da importare su mymaps) che includano luoghi particolari, curiosi e fuori dagli itinerari turistici classici. Mi interessano in particolare:\n\n* *Locali o bar con un’atmosfera unica*\n* *Angoli nascosti della città*\n* *Posti storici o curiosi di cui si parla poco*\n* *Luoghi che non si trovano con una semplice ricerca online*\n\nMi piacerebbe poter importare una mappa già pronta, fatta da qualcuno che conosce bene Torino e sa scovare chicche nascoste. \n\nSe avete qualcosa di simile o conoscete qualcuno che ha creato mappe del genere, vi ringrazio già in anticipo per la condivisione!\n\nGrazie mille!",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1i80mj5/qualcuno_ha_mappe_personalizzate_di_torino_con/"
    },
    {
        "id": "1i85nu9",
        "author": "davi_duzz",
        "title": "Cerco un gym bro/sis a Chivasso (TO)",
        "content": "Ciao a tutti!\nMi chiamo Davide, ho 31 anni e mi sono trasferito da poco a Chivasso. Mi sono iscritto in palestra qui alla Orange e sto cercando qualcuno interessato/a ad allenarsi insieme, per farci compagnia e spronarci a vicenda.\nNon conosco molte persone in zona, quindi sarebbe anche un bel modo per socializzare. Non importa il livello di allenamento, l'importante è avere voglia di migliorarsi e motivarsi a vicenda!\n\nSe vi interessa o conoscete qualcuno/a che potrebbe essere interessato/a, scrivetemi. Possiamo organizzarci per un allenamento insieme o anche solo per conoscerci! \n\nP.S. Non sono un fanatico del fitness, quindi molto easy! 😁💪🏻",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i85nu9/cerco_un_gym_brosis_a_chivasso_to/"
    },
    {
        "id": "1i8hkm7",
        "author": "Big-Kaleidoscope5163",
        "title": "politecnico di torino",
        "content": "I am planning to study in the polito, but first I have to do the foundation year. Does anyone know which foundation years the politecnico accepts?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1i8hkm7/politecnico_di_torino/"
    },
    {
        "id": "1i87rn6",
        "author": "kla_88",
        "title": "Mirafiori sud",
        "content": "Ciao a tutti. Una mia cara amica che abita all’estero sta cercando casa per venire a vivere a Torino. Ha trovato un alloggio che le piace molto in via Ugolini, che ho visto essere dietro corso unione sovietica/via farinelli. Premesso che io abito a Torino nord, quella zona non la conosco quasi per nulla, ma mi ha chiesto un parere. Potete aiutarmi? Loro sono una coppia di circa 35 anni con un bimbo piccolo. Grazie in anticipo a tutti dell’aiuto!",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1i87rn6/mirafiori_sud/"
    },
    {
        "id": "1i8l306",
        "author": "Medium_Woodpecker887",
        "title": "''Aggredito'' sul pullman 74 a caso",
        "content": "Racconto un fatto inquietante e shockante che è successo oggi,ero sul 74 che si era fermato a capolinea e doveva ancora partire,io ero alla sinistra e alla destra c'era un altro signore,giá ho avuto una sensazione di pancia da lì per quello che faceva,buttava le scatolette del cibo mi sembra fuori dal finestrino (all'inizio eravamo in 3 in pullman),comunque ignoravo la cosa e avevo le cuffie.\n\nCaso strano poche fermate dopo sale una mia amica,era una che non mi vedeva da anni quindi non mi riconosceva,decisi di andare da lei a salutarla che si era messa nei posti dietro,parlo tranquillamente e mi sento un colpo sul ginocchio arrivare,all'inizio rimango molto scioccato e poi noi 3(la mia amica era seduta vicino a un altro ragazzo) scopriamo che era quel signore,anche perché nel pullman in quel momento eravamo solo in 4,mi aveva colpito al ginocchio da dietro senza motivo a caso e poi era tornato indietro vicino all'autista,noi alziamo la voce,avvertiamo l'autista di chiamare i carabinieri per sto str***,all'inizio l'autista sembra ignorare e a dire e ''vabbè si vede che non sta bene già da come buttava le cose'' poi chiama i carabinieri,dopo a una fermata arrivano,fanno scendere me e il signore e diceva ''mi stava aggredendo'' , letteralmente noi ridiamo e diciamo che non era vero,comunque i carabinieri mi chiesero se volevo fare la denuncia sconsigliandomelo enfatizzando sul fatto che non stava bene,se lo sono soltanto preso,a me hanno fatto risalire, l'autista mi ha dato un foglietto da firmare e basta.\n\nIncredibile sti episodi,io purtroppo sono una persona abbastanza passiva,ma voglio vedere se gli capitava la persona più pazza di lui.\n\n\nSe vi capita di vederlo state attenti, è un uomo sulla 30-40ina,capelli grigi,un po' alto.\n",
        "upvotes": 0,
        "comments": 39,
        "media": null,
        "permalink": "/r/torino/comments/1i8l306/aggredito_sul_pullman_74_a_caso/"
    },
    {
        "id": "1i7jslb",
        "author": "OutstreamWeeb",
        "title": "Ma voi quanto pagate di spese condominiali + riscaldamento?",
        "content": "Volevo capire se sono io a pagare tanto o è normale. Io quasi 3000€ il 2023 e 2700€ il 2024.\n\nAbito in periferia sud.\n\n\nEdit: 90mq, nessun giardino o portineria.",
        "upvotes": 11,
        "comments": 26,
        "media": null,
        "permalink": "/r/torino/comments/1i7jslb/ma_voi_quanto_pagate_di_spese_condominiali/"
    },
    {
        "id": "1i7mtwp",
        "author": "juvegimmy_",
        "title": "Acqua del rubinetto",
        "content": "Potabile o no? È uscito un nuovo (mi pare fosse uscito anche l’anno scorso) articolo di Greenpeace a riguardo e sinceramente non so più a cosa credere ",
        "upvotes": 6,
        "comments": 44,
        "media": null,
        "permalink": "/r/torino/comments/1i7mtwp/acqua_del_rubinetto/"
    },
    {
        "id": "1i82p09",
        "author": "Sea_Background_9910",
        "title": "Torino tip?",
        "content": "Un parchetto vicino vittorio Emanuele per farsi 2 canne senza problemi?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1i82p09/torino_tip/"
    },
    {
        "id": "1i7bv4w",
        "author": "Swork-_-",
        "title": "Is Bengasi a good place to live?",
        "content": "**English**  \nSo me and my girlfriend we are planning to move right now and we found a decent house to buy just near the Bengasi metro station. I wanted to know if you guys had any information about the neighbourhood before we get the house. I heard it's not safe from people but couldn't find anything on the internet about it. That's why I'm writing here.\n\n**Italiano**  \nQuindi io e la mia ragazza stiamo progettando di trasferirci proprio ora e abbiamo trovato una casa decente da acquistare proprio vicino alla stazione della metropolitana di Bengasi. Volevo sapere se avevate informazioni sul quartiere prima che prendessimo la casa. Ho sentito dire che non è sicuro per la gente, ma non sono riuscito a trovare nulla su Internet a riguardo. Ecco perché scrivo qui.\n\nHo usato google translate quindi scusate il mio italiano sto ancora imparando.\n\nUpdate: Thanks for all the comments, I'll look for other houses. Thanks a lot really for the feedback. ",
        "upvotes": 6,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1i7bv4w/is_bengasi_a_good_place_to_live/"
    }
]