[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 8,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 53,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l795gv",
        "author": "niktrop0000",
        "title": "Department Q is great",
        "content": "\n\nThis show was great. Great cast and production. In the end they hint clearly at season 2. It being on Netflix I can’t wait to have it cancelled or to watch season 2 in about 4 years time. \n\nEDIT: yes Akram is the best",
        "upvotes": 271,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1l795gv/department_q_is_great/"
    },
    {
        "id": "1l7atee",
        "author": "Educational_Base_301",
        "title": "Any Good Netflix Shows That Premiered in 2025 So Far?",
        "content": "Hey all,  \nJust wondering if there have been any new Netflix original shows that started in 2025 and are actually worth watching. I'm always trying to catch something fresh before it gets too popular or disappears from the homepage.\n\nLooking for anything that’s well-written, mysterious, or addictive. I’m open to other genres too if the story and acting are solid. Just don’t want anything slow or boring.\n\nIf you’ve seen something this year that’s underrated or really good, I’d love your suggestions.\n\nThanks in advance.",
        "upvotes": 141,
        "comments": 177,
        "media": null,
        "permalink": "/r/netflix/comments/1l7atee/any_good_netflix_shows_that_premiered_in_2025_so/"
    },
    {
        "id": "1l7s1ho",
        "author": "3rdToLastAccount",
        "title": "been waiting on netflix support chat for over 30 mins when they said it would be 8",
        "content": "I've never contacted support before, but I assume this is normal. I just want to find out how to update my household/devices. I go to the page to manage devices, but the only option is to sign out. I cannot change my household or anything like that. This sucks and I am probably going to change to appletv or something else",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l7s1ho/been_waiting_on_netflix_support_chat_for_over_30/"
    },
    {
        "id": "1l7f03i",
        "author": "Biovatic",
        "title": "Help me find the title!",
        "content": "Hi all, I’m trying to find the name of this show (?) my boyfriend and I watched, but I only remember one scene😅\n\nThis girl is at a party and is dragged away by who I presume was her boyfriend’s best friend or brother (who knows? not me) into a forest and to a cliff that overlooks a lake, where the house the party is at is across from. The guy is obviously inebriated and starts getting handsy, which she tries to put a stop to. Things get physical, and as she tries to escape him she falls off the cliff and hits her head on the ground. The guy runs off and she isn’t found for a couple of hours by her friends.\n\nSorry that’s all I can remember! I can’t put any names or faces to the scene unfortunately. TIA!",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1l7f03i/help_me_find_the_title/"
    },
    {
        "id": "1l7d143",
        "author": "Original2021",
        "title": "Taraji P. Henson was the only good thing about Straw",
        "content": "The movie came across as preachy and predictable but wow Henson's performance makes it worth the watch. I hope the studio campaigns hard for an Oscar nomination. ",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1l7d143/taraji_p_henson_was_the_only_good_thing_about/"
    },
    {
        "id": "1l7rkk3",
        "author": "throwawayaccount931A",
        "title": "Help Locating a Show",
        "content": "Hey All - Im trying to find this show on Netflix after seeing a short on YT but the show noted in the YT clip is something else. Help?\n\nhttps://youtube.com/shorts/-3UCv6IN8Ro",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l7rkk3/help_locating_a_show/"
    },
    {
        "id": "1l7gl75",
        "author": "indiewire",
        "title": "David Lynch's Scrapped Netflix Series 'Unrecorded Night' Would've Been a Mystery, Says Cinematographer Peter Deming",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l7gl75/david_lynchs_scrapped_netflix_series_unrecorded/"
    },
    {
        "id": "1l7mwpi",
        "author": "Calzonieman",
        "title": "I'm so used to Australian fare being top notch series like Mr Inbetween, Fisk, Boy Swallows Universe, Top of the Lake and many others, then I watched The Survivors.",
        "content": "I knew 10 minutes in I should bail, but my wife insisted.\n\nEvery time they introduced a character there was the closeup accompanied by an ominous chord. The only one that escaped that, and wasn't a suspect, was Amanda.\n\nI couldn't tell whether it was the acting that was amateurish, or the writing.\n\nBUT, at least, like most of the Aussie productions, and BBC for that matter, the scenery was beautiful. Maybe we'll watch the rest with the sound off.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l7mwpi/im_so_used_to_australian_fare_being_top_notch/"
    },
    {
        "id": "1l79ya0",
        "author": "loveliesbreaking",
        "title": "Recs for light-hearted / funny shows to play in the background?",
        "content": "Some context - I have bad anxiety and it usually helps to have something calming playing in the background. Does anyone have any recs for me? I am open to literally anything! Sometimes I even watch kids show as embarrassing as that sounds so when I say I am open to literally anything I really mean it lol. ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l79ya0/recs_for_lighthearted_funny_shows_to_play_in_the/"
    },
    {
        "id": "1l7kn1l",
        "author": "Marg_Time4me",
        "title": "Filter for foreign films?",
        "content": "I just flipped through a long list of recommended shows/movies (because you watched... ) and MORE than half of them were foreign. I only want to see movies in the English language. Is there any way to filter out all these foreign films? If I wanted to watch a foreign film, I would look for a \"foreign film\" category. I'm so sick of weeding thru films that aren't in in my language. Thanks!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l7kn1l/filter_for_foreign_films/"
    },
    {
        "id": "1l7jr9g",
        "author": "norman3355",
        "title": "Delhi Crime (2019)",
        "content": "Recommended\n\nJust finished 7 part series of Delhi police investigation into gang rape and horrific mutilation of young woman on a moving bus. Loosely based on true events the drama is very engaging but troubling in the brutality of the crime. Subtitling (or dubbed English) from Hindi is good but occasionally the spoken English (not captioned) is hard to make out. Acting is very good with the dramatic focus being on the under resourced local police identifying and tracking down the suspects against background of political pressure. I like getting an insight into The culture of both police and locals. But be warned: though not graphicly shown, the discussion of sexual violence is stark.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l7jr9g/delhi_crime_2019/"
    },
    {
        "id": "1l77sx4",
        "author": "Optimal-Mycologist90",
        "title": "Dracula TV Show - 2000",
        "content": "There are three episodes that are about an hour and a half long. I read the book in college and I have seen this series twice. I remember my first time watching it, the actor who played Dracula seemed so familiar! I had never seen him in anything else. \n\nHas anyone else seen this? I absolutely loved it, though I'm still on the fence with the ending. \n\n10/10 would watch again.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l77sx4/dracula_tv_show_2000/"
    },
    {
        "id": "1l7ivj0",
        "author": "Financial_Title5056",
        "title": "Netflix Subscription on Android mobile phone, what is the best subscription for ULTRA HD?",
        "content": "Hi everyone! I am really looking forward to having my own subscription on Netflix and watch my favorite shows of all time. But the problem is I only have an android phone and just wanna ask on what is the best subscription to have HD quality when watching on a mobile phone? Thanks y'all for the help. Thank you in advance 💙",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1l7ivj0/netflix_subscription_on_android_mobile_phone_what/"
    },
    {
        "id": "1l6nyt5",
        "author": "Apprehensive_Ask1279",
        "title": "The Four Seasons",
        "content": "Is there really any point of a season 2???!!!\n\nI thought this series was ok &amp; an easy enough watch but I didn’t really think there was enough substance in it to do another series on it &amp; no characters I was remotely invested enough in to want to follow up on. Am I in the minority here?! ",
        "upvotes": 62,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1l6nyt5/the_four_seasons/"
    },
    {
        "id": "1l6pe3s",
        "author": "CatSheeran16",
        "title": "Sirens",
        "content": "So I just finished the series, and at first I thought: what the hell did I just watch? At first I was kinda disappointed that it didn’t turn into a cult revelation thing. But then I thought about it, and it has a lot of depth. Maybe I‘m overthinking this, but this series shows us how easy it is to make the women the villain, how to frame them and how we do so easily believe it. Looking back, I just ignored the signs of Kiki being just nice without any agenda. The whole time I expected her behaviour to be calculating and cunning. I  jumped to the conclusion that she must be the bad guy as the show wanted us to believe at first. Even her behaviour contradicting this assumption didn’t sway me at first. But now I see the man who manipulates the viewers perspective. I so easily believed Peter when he talked about his alienation from his kids and it being kikis fault. But when she talked about how small the marriage made her and how horrible the kids were to her, it didn’t quite resonate as much. Frightening tbh, particularly because I would go as far as saying I have definitely and massively educated myself about the patriarchy and intersectional feminism. Maybe I’m interpreting too much, but if you look at it from a feminist perspective then it - amongst other things - shows us the sway of men’s opinion’s still and the smear campaign that always hits the women ten times harder. It shows us the dangers of dependency, especially as a woman. So, I kind of liked the show. I liked how it was over the top mostly and also sometimes even a bit satirical while dealing with heavier topics.  Let me know what you think and what your interpretation is",
        "upvotes": 48,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1l6pe3s/sirens/"
    },
    {
        "id": "1l6zs35",
        "author": "Pure_Smoke833",
        "title": "I watched the series The Survivors and really liked it, but I didn’t quite understand one thing",
        "content": "There was a character — a writer — who seemed like a maniac. Was he added as a red herring so that viewers wouldn’t figure out who the real killer was? Or did I miss some moment where he was actually involved?",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l6zs35/i_watched_the_series_the_survivors_and_really/"
    },
    {
        "id": "1l7dp5u",
        "author": "IRetardYourAsshole",
        "title": "Does content availability depend on where account was created?",
        "content": "I had made an account when I was in India a while ago. I am now in the US. \n\nIs the content available for me now different from someone who started their account in the US?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l7dp5u/does_content_availability_depend_on_where_account/"
    },
    {
        "id": "1l74f6f",
        "author": "Dontevenwannacomment",
        "title": "Can someone explain the ending of The Residence to me?",
        "content": "Spoilers. \n\nSo at one point, the two detectives say they saw \"the blink\". They explain that the killer mentioned the suicide letter came from the victim's jacket pocket, yet that at no point they saw the letter be taken out of the jacket, so how would they know? \n\nBut earlier in the scene, the killer says that they saw the plumber put the suicide note in the jacket. So the cover story.... still works, doesn't it? ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l74f6f/can_someone_explain_the_ending_of_the_residence/"
    },
    {
        "id": "1l6t07x",
        "author": "Dad4897623",
        "title": "Shows for when my daughter is in the room",
        "content": "I want to find more shows/movies on Netflix to watch that have PG ratings. I’m an adult and I enjoy watching all kinds of shows, but on the weekends I want to watch Netflix while I’m working out and my 4yo daughter is in the room playing, so I can’t have any bad dialogue or mature subject matter coming up.\n\n In the past I’ve really enjoyed watching a lot of ESPN 30 for 30 documentaries, but I’ve pretty much exhausted all the PG rated ones in that series. I’ve also watched movies like My All American, Home Team, and The Long Game, which have a sports theme but are family friendly. It doesn’t *need* to be a sports show though. Any suggestions?",
        "upvotes": 23,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1l6t07x/shows_for_when_my_daughter_is_in_the_room/"
    },
    {
        "id": "1l7c7b0",
        "author": "mr-based-minded",
        "title": "Straw… Yes, again",
        "content": "Now, I don’t usually cry, however I do hold infinite amounts of empathy &amp; let me just say, Straw made the flood gates open up again. Here I am writing this with a face full of tears.\n\nWhat is everyone’s thoughts on the film? Me as a 20 year old man now, I’ve seen the struggles single mothers have to go through, first hand and through people I know. \n\nI think the movie was a great portrayal of the realities of the situation in question, though obviously hyperbolic, it still encapsulated something that can’t be displayed &amp; that’s emotions. \n\nIf we all learn to love everyone which was shown through the character of Nicole, I believe there would be a lot less problems in the world. We never know what people are going through, so never look down on someone because of their state mentally or physically, but ask the harder question: “I wonder what made them this way?”\n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l7c7b0/straw_yes_again/"
    },
    {
        "id": "1l6tqmm",
        "author": "wndoshoppa",
        "title": "So I can't watch Becoming Led Zeppelin unless I pay an additional $10/month?",
        "content": "I was all ready to watch it tonight, but Netflix is telling me that i have to change to an ad-free plan. If that's the case, why wouldn't I just rent it on Amazon prime for $5.99? Make it make sense!",
        "upvotes": 15,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1l6tqmm/so_i_cant_watch_becoming_led_zeppelin_unless_i/"
    },
    {
        "id": "1l7aayv",
        "author": "cloudynolhan",
        "title": "Adolescence BTS",
        "content": "Hi everyone,\nJust finished watching the Adolescence series, which was incredible (both the acting and the direction). Does someone knows where I could find more videos of the rehearsals (especially ep2)? There was some really short extracts in BTS videos on YouTube (channels like \"Still Watching Netflix\") but they were coupled with interviews and extracts of the final episodes, so we can't really see how it went.\nThanks :))",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l7aayv/adolescence_bts/"
    },
    {
        "id": "1l71qwe",
        "author": "alphabae10",
        "title": "MARCUS",
        "content": "Who has already watched the final episode (S3E10) of the new Season of ***Ginny &amp; Georgia***?  \nDamn, that part where Max brought a drunk Marcus home from the party at Brodie's basement, and their parents caught them. I got teary-eyed as it was a very emotional moment where Marcus kept saying, *\"I hate me!\"* \n\n\n\nI felt that.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l71qwe/marcus/"
    },
    {
        "id": "1l78vzh",
        "author": "DarthVada83",
        "title": "Recommend a series or movie that will make me a better/smarter person because I watched it.",
        "content": "Better/smarter person meaning I can get a new understanding and perspective of the human condition.  I tend to get anxious from some of the things I've watched in the past so I like to only go for inspirational/motivational content with positive messaging. Peaceful Warrior (not on Netflix) and Queen's Gambit are examples of what I love. ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1l78vzh/recommend_a_series_or_movie_that_will_make_me_a/"
    },
    {
        "id": "1l6zly9",
        "author": "akagiaa",
        "title": "DARK",
        "content": "Do you guys have anyth about the series Dark? Like bro its the most awesome series I have ever watched. But idk i didn't like  Hannah i mean she wanted Ulrich and why didn't she save him from that 1953 scene😭? I felt so bad for him. But salute  to those writers who came with this series concept 🫡",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l6zly9/dark/"
    },
    {
        "id": "1l7kxdi",
        "author": "BetterOnTheField",
        "title": "Ginny and Georgia s3 e2",
        "content": "When they where having dinner and they went outside after lynette and georigia where arguing it was day out and that was kinda stupid and annoying because it should be night and that kinda sucks why couldnt they if just have waited to filmed it looked like it was 12:00 nowhere newr sunset and the fact it was fall last episode now its summer is also annoying unless they has dinner at &gt;5 because only sesoan its that bring out is summer at dinner time so just stupid shows the impaticene of the directors.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l7kxdi/ginny_and_georgia_s3_e2/"
    },
    {
        "id": "1l6kbo8",
        "author": "Longjumping_Bowl_403",
        "title": "Archive 81: 8️⃣/1️⃣0️⃣",
        "content": "If you have even the slightest interest in horror, storytelling, or mystery, this show is for you. Strong narrative, engaging from start to finish, and enough depth to keep you hooked.\n\nThe reason it's an 8/10 is because:\n\n1. It is a bit drawn out, some dialogue and scenes feel unnecessary and 'unreal'- acting didn't make it feel 'real'.\n2. It lacked a sense of urgency, a fear factor. The kind of feeling you get when you’re caught between wanting to witness horror and wanting to escape from it.\n\nIf you haven't watched it, give it a shot. You likely won't be disappointed unless you have Fast &amp; Furious posters in your room.",
        "upvotes": 21,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1l6kbo8/archive_81_810/"
    },
    {
        "id": "1l79x4s",
        "author": "TheAkVoN",
        "title": "Can't watch breaking bad",
        "content": "No words can describe my frustration, i spended 10 euros instead of pirating the series\nVPN is not gonna do it, i plan to watch it on tv\nI can watch better call saul and El Camino just fine\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l79x4s/cant_watch_breaking_bad/"
    },
    {
        "id": "1l6gs94",
        "author": "Champloo-",
        "title": "New ui on tv",
        "content": "Is there any way to see more than 3-4 items on my huge ass tv screen? Who thought that was a good idea?\n\nAlso, is there any way to quicky access the \"new/soon on netflix\" tabs? Do they not want people to notice their new releases anymore?\n\nI normally don't really care about app uis being updated, but the new netflix ui makes browsing the app just so much worse.",
        "upvotes": 26,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1l6gs94/new_ui_on_tv/"
    },
    {
        "id": "1l6zalm",
        "author": "Fine_Mammoth8468",
        "title": "Netflix Bounty Program",
        "content": "Is Netflix Bounty Program is still up and running? I found a flaw that can bypass the “your device isn’t part of the Netflix household for this account”. It works through the Netflix app itself using any type of device (phone, tablet/iPad, tv, Netflix’s website in seconds. I’m assuming there’s a monetary incentive associated with the program.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l6zalm/netflix_bounty_program/"
    }
]