[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 12,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 66,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lhk6ah",
        "author": "moschino1837",
        "title": "What do you think is the best production Netflix has ever made?",
        "content": "Considering we’ve now had Netflix for 10+ years, what do you think is the highest quality production (film or TV show) that has been produced by Netflix, and why? ",
        "upvotes": 93,
        "comments": 234,
        "media": null,
        "permalink": "/r/netflix/comments/1lhk6ah/what_do_you_think_is_the_best_production_netflix/"
    },
    {
        "id": "1lh9ft8",
        "author": "Less_Manufacturer218",
        "title": "Dept. Q on Netflix best show",
        "content": "One of the best shows I’ve seen in a while. Characters, plot and ending all really stuck with me. Almost as much as Young Wallander. Hoping for a second season. ",
        "upvotes": 334,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1lh9ft8/dept_q_on_netflix_best_show/"
    },
    {
        "id": "1lhqury",
        "author": "Afraid_Orange6762",
        "title": "3 body problem is one of the best sci-fi shows I’ve watched in a while",
        "content": "The show is beautiful. The cinematography, how the plot advances and how the characteristics of each person is introduced to the viewers in a very subtle but definitive way. I love the show and I hope to god that they don’t discontinue. I’ve never posted a review in my life but knowing Netflix and how they’ve cancelled a lot of the shows I was eagerly  waiting for, I just wanted to post my opinion on this subreddit so that even if there was a 0.01% chance that this post could make the show gain some traction I had to do it.",
        "upvotes": 15,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lhqury/3_body_problem_is_one_of_the_best_scifi_shows_ive/"
    },
    {
        "id": "1lhnz54",
        "author": "HurricaneLogic",
        "title": "The new format",
        "content": "This new format is absolutely awful. \n\nPreviously, all categories were in subcategories, to make it easy to navigate through. \n\nNow it's a jumbled mess, with everything thrown together. I have lost interest in watching, and am seriously considering canceling. ",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lhnz54/the_new_format/"
    },
    {
        "id": "1lhlw9e",
        "author": "NoCrew_Remote",
        "title": "Lockwood &amp; Co Cancelled [RANT]",
        "content": "Lockwood and Co got canceled after just 8 episodes. I don’t care what anyone says, that’s not a full season. That’s one third of a season. It barely had time to breathe before Netflix pulled the plug.\n\nThis is exactly why people are losing faith in Netflix. You finally make something with original IP, solid cast, great atmosphere, smart writing, and instead of giving it time to grow, you kill it off faster than a ghost hunt in episode one.\n\nMeanwhile, the most mind-numbing reality shows get renewed before the first season even finishes airing. Why? Because they’re cheap and easy and someone in a boardroom thinks short-term numbers matter more than actual storytelling.\n\nPeople keep asking why fans don’t get invested anymore. This is why. You give us something promising, with real potential, then yank it away like it never mattered.\n\nLockwood and Co deserved better. The actors deserved better. And honestly, the fans who actually stuck around and told people to watch it deserved better too.\n\nSo yeah, maybe it didn’t bring in Stranger Things numbers overnight, but maybe if you let your shows breathe instead of canceling everything that isn’t a viral hit in 24 hours, you’d have more to show for it.\n\nNetflix is out here ghosting its own content. Fitting for a ghost hunting show, I guess.",
        "upvotes": 12,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lhlw9e/lockwood_co_cancelled_rant/"
    },
    {
        "id": "1lhs5jx",
        "author": "Ok-Driver2984",
        "title": "Problem with modern media",
        "content": "Hi im 20 M and this is about all tv, series, media etc.  Why is it that all forms of media are RITTLED with cheating in every form several times through the course of whatever it is. \n\nAs someone who is hyper sensitive to cheating and media portraying it as a result of my experiences through childhood and recent years im so comfused asto how or why its neccesary. \n\nI almost cant watch anything whatsoever that isn't an anime without shutting down nearly as a result. \n\nI don't expect to be catered to its merely im confused asto the appeal.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lhs5jx/problem_with_modern_media/"
    },
    {
        "id": "1lhs33k",
        "author": "Expensive-Energy-818",
        "title": "Molly Martens is a psycho - A Deadly American Marriage",
        "content": "The first wife died of an asthma attack. It's possible to die of asthma as a non asthmatic. And the prosecutors was presenting is as if Janson had strangled her, with no marks on her neck. It's crazy because strangulation can be seen on the outside and not be seen on the outside but have a full on  impact from inside the neck. But what makes this whole case a mystery is that Tom ( the father) and Molly hade bearly any scratches or woundes on them. But parts of Jansons brain was out. \n\nI believe that it was all pre planned. She read about the first wife and made up a story. Intoxicated him weak and begun hitting him with the bat. Then shouted out so that the father could come up and help her finish story. Let's not forget to change the sheets she said. Why was there a whole brick bedroom?  And why was it so easy for the to hit him with it? \n\nIf Tom was there while Janson was alive... could he have them stopped the altercation or right then call 911? NOOOO ! He always wanted to off somebody after years as a FBI agent. \n\nI feel sorry for them kids. Me, myself and I have also been manipulated as a child and used as a spokes person. I understand. They are grown now and can recall memory better.  ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhs33k/molly_martens_is_a_psycho_a_deadly_american/"
    },
    {
        "id": "1lhr07c",
        "author": "Uncaged-Rage",
        "title": "Layout is garbage",
        "content": "Yes please zoom in so i can only see 3 titles at a time now, that's fantastic!\n\nOn top of that Netflix just recently decided its not going to keep track of the shows I watch either...\n\n..and all that on top of all that,  they've ruined RAW by getting rid of all episodes from 2021 and under. So no more watching attitude or ruthless aggression eras of RAW.\n\nReally think I'm about to cancel, I'm starting to loathe Netflix.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lhr07c/layout_is_garbage/"
    },
    {
        "id": "1lhef2v",
        "author": "Creative-Ad-1363",
        "title": "Sweet Bobby",
        "content": "I'm re-watching Sweet Bobby and I'm still as shocked as the first time seeing it.\n\nWhat I'm seeing in the show this time around is how Kirat fell into an unverified fantasy so easily. We live in a romance obsessed culture, and some people will ignore hard facts and red flags to claim a relationship. Our obsession with romance is what makes women such easy victims to predatory personalities. \n\nMy hope is for women especially in marriage obsessed cultures, is to wake up and realize they're more worthy endeavors in life. It's so silly and I'm just so sooo sad for women like Kirat who are stigmatized for being single, and through their desperation are easily fooled.",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhef2v/sweet_bobby/"
    },
    {
        "id": "1lho628",
        "author": "Round-Refrigerator99",
        "title": "I need a sequel to Kpop Demon Hunters NOW",
        "content": "That movie was so amazing it should've been playing in theaters. It's been a while since I saw a good Netflix film. People were not lying when they said it was a 10/10. The songs were amazing as well and I loved the characters",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lho628/i_need_a_sequel_to_kpop_demon_hunters_now/"
    },
    {
        "id": "1lhnjdt",
        "author": "Plastic-Cricket-7437",
        "title": "Just finished watching kho gaye hum Kahan",
        "content": "It's really good movie. Unique concept . No starcast but Ananya pandey is there . Don't worry she didn't drop a disaster class according to mee . If you really want to watch a new gen movie with something different. Definitely check that out ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhnjdt/just_finished_watching_kho_gaye_hum_kahan/"
    },
    {
        "id": "1lhm5a1",
        "author": "chadderdeux",
        "title": "4k with DisplayPort on PC.",
        "content": "I have the app and a monitor to handle it. The HEVC is installed. I have heard that Netflix prefers HDMI, but I don't want to lose the extra frames when gaming. I am maxing out at 1080p with a premium account. Is there a solution to this? What's the deal? \n\nI run 4k 144hz on Windows 10 (soon to be 11, forever)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhm5a1/4k_with_displayport_on_pc/"
    },
    {
        "id": "1lhlqic",
        "author": "Own-Conclusion-2973",
        "title": "Recommendation please",
        "content": "Recommend a show like pretty little liars. A little mystery, some high school romance, female friendship, family drama, visually pleasing, good fashion. \nI know the show sucked after a few seasons and the ending was bad but it was a good watch for so long. ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lhlqic/recommendation_please/"
    },
    {
        "id": "1lhgcl5",
        "author": "_AvgCanadianEh_",
        "title": "Audio Cutting Out",
        "content": "Ok well im gonna post this again since over 1k people looked at it but said nothing. There were even some down votes for no reason. I'm just asking a question and need a little help\n\nSo here is what I am using. LG C1 Oled smart TV. Got Netflix downloaded on it. And for audio, I have a pair of Sony Wireless Headphones connected through bluetooth to my tv\n\nMy issue is, everytime I watch Netflix with this exact set up, the audio always cuts out while whatever im watching keeps playing. Ive looked it up before and something about turning off 5.1 surround or something, but thats not even an option. the only options are subtitles and audio language. Thats all. I need to know why this is happening and if there is a fix please 🙏 😭",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhgcl5/audio_cutting_out/"
    },
    {
        "id": "1lhj0fp",
        "author": "No-Opportunity-8964",
        "title": "KPop Demon Hunters could have worked as a Mini-Series",
        "content": "Yeah after watching the movie... I love it to bits! The music, the characters, I could instantly rewatch it again :D \n\nBut it also felt rushed. There is so much plot potential, but it seemed like they didn't really had the time to go in depth with the different characters.. \n\nWhile the Movie was good, I think it would have been better as a mini series, like with 5-6 Episodes. To give those deep plots more screentime.\n\nActually when I first heared about it I thought it would become an Anime like Series. \n\nWhat do you guys think? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lhj0fp/kpop_demon_hunters_could_have_worked_as_a/"
    },
    {
        "id": "1lhisqf",
        "author": "SnapSketchStudios",
        "title": "Intresting",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhisqf/intresting/"
    },
    {
        "id": "1lhiepr",
        "author": "CrikeyKillz",
        "title": "Why did the Monsters true-crime movie series get so much backlash?",
        "content": "I thought the Dahmer series was done wonderfully, I feel it did a good job at telling the story while still being entertaining to the viewer. I agree on the other hand that the Lyle and Erik Menendez series was kind of weird trying to push the incest narrative which made it seem like a shitty fan fiction in some parts but that aside it felt like it was done somewhat well. Can anybody give me some insight?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lhiepr/why_did_the_monsters_truecrime_movie_series_get/"
    },
    {
        "id": "1lhhj9a",
        "author": "Santon-Koel",
        "title": "Thoughts on boeing documentary on netflix after boeing crash in india",
        "content": "People, politicians, flight crew, airlines saw the documentary. Still they chose or allowed boeing to run? What's happening. Are human life not valuable?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhhj9a/thoughts_on_boeing_documentary_on_netflix_after/"
    },
    {
        "id": "1lh5q00",
        "author": "Character_Map9480",
        "title": "\"new season coming soon\" how long until release",
        "content": "hi! I was just wondering how long netflix usually takes to release when a show has \"new season coming soon\" on it. \n\nspecifically i'm interested in yellowjackets season 2. i figured if netflix will release season two within the next few weeks it probably isn't worth it to sign up for another streaming service rn.",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lh5q00/new_season_coming_soon_how_long_until_release/"
    },
    {
        "id": "1lh8413",
        "author": "UniqueEnigma121",
        "title": "Your Account on hold email. “Just two day left to easily restart Netflix”",
        "content": "What will happen after two days if I don’t add a payment method or add credit via gift card. \n\nThis is for my Turkish Netflix account, which I was hoping to use for a month every three months. As I don’t need Netflix every month &amp; would like to dip back in when I want. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lh8413/your_account_on_hold_email_just_two_day_left_to/"
    },
    {
        "id": "1lh3m7t",
        "author": "adiosamigo15",
        "title": "Prepping for a Product Interview — What Can Netflix Do Better or Add?",
        "content": "Hey everyone! I’m currently prepping for a product management interview and would love to get some outside perspectives.\n\nSpecifically, I’m curious — what do you think Netflix could be doing better? Are there features you wish they had or pain points you’ve experienced using the platform? Anything you’ve seen competitors doing that you think Netflix should adopt?\n\nWould really appreciate your insights — thanks in advance!",
        "upvotes": 7,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1lh3m7t/prepping_for_a_product_interview_what_can_netflix/"
    },
    {
        "id": "1lhbqgo",
        "author": "ilovebeardsss",
        "title": "Murder on the Internet - WOW.",
        "content": "So I've just started watching this series... literally less than 10 minutes into episode 1 and this so-called psychologist is something else. Did anyone else find her incredibly irritating? She came across as being rather uneducated and very presumptuous, neither of which are great traits in a psychologist. \n\nFirst of all, she states that the guy being paralytic was intentional because he wanted to make his date vulnerable (what?! He was the drunk one  not her) or because he wanted some dutch courage so that he could get away with his evil plan. Surely if it was all part of his plan, he wouldn't have gotten black out drunk? \n\nSecondly, she said that him having pre-booked a hotel is a clear sign that he wanted to control the night and has a sense of ownership. There are SO many other reasons as to why someone might book a hotel. \n\nI think what irritated me most (so far) is that she claimed that people with EUPD like Carl are often violent and spontaneous. That's just not true. I have EUPD (aka BPD) and these kind of claims can be SO damaging. I know several others with a similar diagnoses, none of whom are violent or spontaneous. I wouldn't hurt a fly, and schedules are everything. Saying he was undoubtedly dangerous because of his EUPD diagnosis was ridiculous. As if what he did was down to his personality disorder. \n\nDon't get me wrong, the guy is absolute scum and I really feel for Katie's family. This psychologist though... I'd love to know more about her credentials. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lhbqgo/murder_on_the_internet_wow/"
    },
    {
        "id": "1lhfnqa",
        "author": "Bulky-Employer-1191",
        "title": "Naked Gun",
        "content": "This was new on netflix earlier this week, did it just disappear now?  Was going to watch it this weekend and i didn't think Netflix would remove it that fast. Is this going to be common with movies and shows now, only there for 2 days?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lhfnqa/naked_gun/"
    },
    {
        "id": "1lh3957",
        "author": "5256chuck",
        "title": "Justin Willman: Magic Lover",
        "content": "This special shines (you'll catch the reference after you watch)! Serendipity brought me to it, I suppose (you'll catch that ref, too). This is a very, very good, funny and entertaining magic act/comedy show. Looking forward to seeing more from Justin. And also waiting to see him get zip code stumped, finally. That's a pretty amazing talent, in itself. There are a lot of surprising laughs. Do yourself a favor.",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lh3957/justin_willman_magic_lover/"
    },
    {
        "id": "1lgy4bx",
        "author": "towel_hair",
        "title": "Netflix automatically updated my payment information without my consent",
        "content": "4:17am Netflix emailed me three times. The first two times saying my payment information was updated. Both times using old card information. The third email saying my payment information was updated using my brand new card information. Everything was correct including expiration. How could this be possible? My card is not compromised. \n\nWell I learned that Netflix utilizes something called Visa Acount updater. This is a service offered by VISA card Issuers(your bank). They claim it’s to reduce customers calling in to update payment information.\n\nTo be fair, I DO I want my Netflix subscription to continue, but I had no clue this was even a thing. ",
        "upvotes": 11,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lgy4bx/netflix_automatically_updated_my_payment/"
    },
    {
        "id": "1lh41pz",
        "author": "Mysterious_Menu2481",
        "title": "Why No Westerns or Concerts?",
        "content": "Is it just my poor searching - or it is true? Why don't I see any western movies or a \"Westerns\" category in category search or see any Live concerts? Does anyone experience the same thing? Can anyone guess why that is?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lh41pz/why_no_westerns_or_concerts/"
    },
    {
        "id": "1lgu3bp",
        "author": "Select-Effort8004",
        "title": "Netflix Sirens - Staff celebrating Simone’s departure",
        "content": "I didn’t understand why the staff would celebrate Simone being fired. But now that I’m done watching, I wondered if they were glad for her that she was going to be free. They made fun of her, but did they not like her? Would they be better off if she were gone? Their positions were another facet of the show, hating Kiki, clearly not respecting Peter (Jose’s “Here we go again”), but a decent job with a famous employer and surely getting paid well.   \n\nSo why was Simone’s departure celebrated?",
        "upvotes": 16,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1lgu3bp/netflix_sirens_staff_celebrating_simones_departure/"
    },
    {
        "id": "1lgb1dl",
        "author": "ER-841",
        "title": "Mindhunter Star Reveals How the Netflix Series Might Finally Return 6 Years Later",
        "content": "Mindhunter was in my opinion one of the best series Netflix ever produced. So when I learned it was cancelled after the second season it was such a disappointment. In this article, they discuss how the series might return in the form of movies. I think this is really great. David Fincher would be returning with the same cast theoretically if he likes the scripts… Fingers crossed. 🤞",
        "upvotes": 281,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1lgb1dl/mindhunter_star_reveals_how_the_netflix_series/"
    },
    {
        "id": "1lhf3zw",
        "author": "MutedIndependent1236",
        "title": "America’s Sweethearts Dallas Cowboys and Body Dysmorphia ???",
        "content": "Is this documentary promoting or trying to shed light on body dysmorphia? \n\nThis organization really gives me cult vibes and it feels like this should be illegal. Either way - crazy respect for these girls, their discipline and dedication is out of this world ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lhf3zw/americas_sweethearts_dallas_cowboys_and_body/"
    },
    {
        "id": "1lhlmbr",
        "author": "justintrudeau1974",
        "title": "Adolescence: Is the average age of virginity loss in the UK eleven years old?",
        "content": "I liked the show but told a friend I wished the kid had been 17 or 18, because what 13 year old kid in the UK is having sex and finds being called an incel offensive? She told me that the average age of virginity loss is eleven years old in the UK, and when I googled a bunch of surveys that said it was 17.5 years, she stopped speaking to me. (?) Is there anyone from Great Britain here who has insight into this?",
        "upvotes": 0,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1lhlmbr/adolescence_is_the_average_age_of_virginity_loss/"
    }
]