[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 493,
        "comments": 271,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j9v3bs",
        "author": "esporx",
        "title": "Netflix HR Director Recommends Cutting Off Underperforming Employees To Keep The Best Ones Happy",
        "content": "",
        "upvotes": 167,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1j9v3bs/netflix_hr_director_recommends_cutting_off/"
    },
    {
        "id": "1ja65b3",
        "author": "--blacklight--",
        "title": "Have you had your nextflix hacked before?",
        "content": "I had a account hacked that was not an active account so got reactivated by hacker. It was a secure unique password only in an encrypted password manager. I'm assuming a session token stolen. \n\nLots of people that i talk to have had the same happen. Do you think it is common?\n\nI see netflix wins out of this (more money). So, no real motivation for 2fa or maybe securing their own systems. \n\nWhat do you think? Maybe a class action one day. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ja65b3/have_you_had_your_nextflix_hacked_before/"
    },
    {
        "id": "1ja5h90",
        "author": "Robemilak",
        "title": "Netflix Circling Daniel Craig For ‘Chronicles Of Narnia’ Movie: The Dish",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ja5h90/netflix_circling_daniel_craig_for_chronicles_of/"
    },
    {
        "id": "1ja01ag",
        "author": "VarkingRunesong",
        "title": "Netflix Circling Daniel Craig For ‘Chronicles Of Narnia’ Movie: The Dish",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ja01ag/netflix_circling_daniel_craig_for_chronicles_of/"
    },
    {
        "id": "1ja7b4s",
        "author": "TimesandSundayTimes",
        "title": "Adolescence review ★★★★★ — an outstanding drama starring Stephen Graham",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ja7b4s/adolescence_review_an_outstanding_drama_starring/"
    },
    {
        "id": "1ja725x",
        "author": "timewarpUK",
        "title": "Change/remove legacy restrictions pin",
        "content": "Our little daughter saw us enter the profile lock pin so we need to change it. This has been done, but on our account we have the old school viewing restrictions pin enabled also, which has remained on the old pin. \n\nThe profile lock pin should be enough to protect her from inappropriate content, as we will not leave our adult profiles logged in. However it is annoying for us to enter two different pins in order to watch something. \n\nI can't see any option to remove or change the viewing restrictions pin, only for the newer per profile pin. Any advice?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ja725x/changeremove_legacy_restrictions_pin/"
    },
    {
        "id": "1ja6zoy",
        "author": "S4v1r1enCh0r4k",
        "title": "Over 30 new movies &amp; shows are landing on Netflix in April",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ja6zoy/over_30_new_movies_shows_are_landing_on_netflix/"
    },
    {
        "id": "1j9imbd",
        "author": "Somethingman_121224",
        "title": "Netflix's Former Gaming Boss Mike Verdu Has Officially Left The Company Following Earler AI Role",
        "content": "",
        "upvotes": 29,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j9imbd/netflixs_former_gaming_boss_mike_verdu_has/"
    },
    {
        "id": "1j9zvut",
        "author": "Ruijerd566",
        "title": "Reason for 10sec skip consistently at same moment in show?",
        "content": "Was watching a TV show and it randomly skipped 10sec and I went back to try and watch again and it kept skipping the same 10sec over and over. I then got it fixed but is there any reason for this? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j9zvut/reason_for_10sec_skip_consistently_at_same_moment/"
    },
    {
        "id": "1j9n4cr",
        "author": "MysteriousDelay6266",
        "title": "The Clubhouse: A Year with the Red Sox | Official Trailer | Netflix",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j9n4cr/the_clubhouse_a_year_with_the_red_sox_official/"
    },
    {
        "id": "1j9x7az",
        "author": "Less_Exercise_3324",
        "title": "[Partially lost] Inspector Gadget New Years Episode",
        "content": "Hi. Does anyone remember the Inspector Gadget New Years episode that aired for 2016? I do, but this particular episode isn’t available on Netflix anymore. There is a video on YouTube that does show some pictures from that episode but there is no other video that shows the full episode. Does anybody have a clue on how to find this?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j9x7az/partially_lost_inspector_gadget_new_years_episode/"
    },
    {
        "id": "1j9pqbs",
        "author": "Ice-Guardian",
        "title": "What is the customer support email and/or phone number for the UK? I can't find them on the website",
        "content": "My account has been hacked. So I tried cancelling my debit card and getting a new one, but that started getting charged again (I found out the reason online, it automatically updates apparently and I never knew), so I need them to close the account permanently.\n\nI cancelled the subscription through my bank straight away, but it apparently doesn't work like that.\n\nBoth my email and password have been changed by the hacker, and I tried searching for my account with my details and it no longer exists, so they must have changed my name too (and kept my card details).\n",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j9pqbs/what_is_the_customer_support_email_andor_phone/"
    },
    {
        "id": "1j9pmrb",
        "author": "ArmosFr",
        "title": "Netflix Lands Crisis PR Drama Series Starring Lizzy Caplan",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j9pmrb/netflix_lands_crisis_pr_drama_series_starring/"
    },
    {
        "id": "1j9poe7",
        "author": "MysteriousDelay6266",
        "title": "Caught (March 26th) | Official Trailer | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j9poe7/caught_march_26th_official_trailer_netflix/"
    },
    {
        "id": "1j8z6lh",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix to Adapt Stephen King's \"Cujo\" into a New Film",
        "content": "",
        "upvotes": 162,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1j8z6lh/netflix_to_adapt_stephen_kings_cujo_into_a_new/"
    },
    {
        "id": "1j9qiu8",
        "author": "euxiis",
        "title": "\"Device isn't part of Netflix household\" whilst on the household network?",
        "content": "I've been getting this error on my PC whilst I'm connected to the WiFi through ethernet. I'm wondering if this is causing the problem and if there's anyway to fix it other than using a code every 2 weeks? My PC doesn't connect wirelessly to the WiFi and the ethernet cable goes directly into the router.\n Any help? \nThanks! ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j9qiu8/device_isnt_part_of_netflix_household_whilst_on/"
    },
    {
        "id": "1j9q0bf",
        "author": "MysteriousDelay6266",
        "title": "Tyler Perry's 'Beauty In Black' Renewed For Season 2 At Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j9q0bf/tyler_perrys_beauty_in_black_renewed_for_season_2/"
    },
    {
        "id": "1j9k528",
        "author": "SocialNetwooky",
        "title": "why a reboot of \"Welcome to the Family\"",
        "content": "some years ago, netflix had a fantastic spanish show called 'Welcome to the Family' with a perfect cast (Melani Olivares was great, and Yolanda Ramos as Victoria was the highlight) and, of course, a cliff-hanger. \n\nCue today : an all new show called 'Welcome to the Family' is released, with a cast that (at least judging from the trailers), doesn't hold the water to the original cast, and apparently the exact same story as the original S.1.\n\nAnybody knows why? When I saw the title my hopes went up for a long-due second season, but this is just stupid :(",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j9k528/why_a_reboot_of_welcome_to_the_family/"
    },
    {
        "id": "1j9qfjr",
        "author": "Specialist-Tiger-234",
        "title": "Subtitles and Languages",
        "content": "Currently living in Germany. A lot of the media that Netflix offers has subtitles either in the original language or in German only. Why can't they just release the subtitles in all available languages?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j9qfjr/subtitles_and_languages/"
    },
    {
        "id": "1j9f2nl",
        "author": "Thin_Giraffe8599",
        "title": "Night agent season 2",
        "content": "I’m a bit late to the game but I just finished watching night agent season 2 and I gotta say, I liked season 1 better but this season wasn’t bad. Some things I could easily predict. Idk why people are hating on Rose’s character, I actually liked her. And I gotta say Farad really annoyed me, smh he literally was risking everyone’s lives FOR A GIRL….\n\nBut i have to say THANK YOU for including the Palestinian flag in the last episode 🇵🇸🇵🇸🇵🇸🇵🇸\n\n",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j9f2nl/night_agent_season_2/"
    },
    {
        "id": "1j9e1x9",
        "author": "ProtossLiving",
        "title": "Court of Gold: More than just Team USA",
        "content": "I watched this miniseries mostly because I'm a fan of Steph Curry and I knew how things were going to go at the end. Given the name of the series, I expected that it would be mostly a documentary about Team USA, which wasn't necessarily my primary interest, but I was fine with if I got to see some Curry highlights.\n\nI was pleasantly surprised at how the other countries were featured just as significantly, probably pretty close to even time with the US (in accordance with the depth of their run in the tournament). Besides interviews with the players and coaches talking about their lives and about the games, they also followed the teams in the locker room, training sessions, and off the court before and during the Olympics. Team France and Team Serbia were followed very extensively. Team Canada was highlighted quite a bit too. Only Team Germany got the shaft in terms of how much it was featured given their 4th place.\n\nI think the players that were followed the most (in terms of interviews, behind the scenes camera time, family life, etc) were probably (in no particular order) Durant (USA), Batum (FRA), and Bogdanovic (SRB) followed by 2-3 other players and coaches from each of those countries and Canada.\n\nDon't be turned off from this Obama executive produced miniseries because you thought it would just be a Team USA chest thumping piece. It's much more than that.",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j9e1x9/court_of_gold_more_than_just_team_usa/"
    },
    {
        "id": "1j9w1c8",
        "author": "AliveVictory2006",
        "title": "Why do some of the teen shows like ginny and georgia and never have i ever give disney vibes with the acting?",
        "content": "Why do most of the teen shows like ginny and georgia and never have i ever give disney vibes with the acting?\n\nnot even hating, it’s just something i’ve noticed. is it because they try to appeal to teens by speaking like that? by over emphasizing every word sometimes? i don’t really know how to explain it. they don’t act like that on outer banks though. i know never have i ever is a comedy but ginny and georgia isn’t. i’m just saying some of the teen shows has acting that i would’ve seen on disney channel. \n\n",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1j9w1c8/why_do_some_of_the_teen_shows_like_ginny_and/"
    },
    {
        "id": "1j9kupq",
        "author": "DDkils",
        "title": "The streaming quality is real bad",
        "content": "I've been watching dark and this happened once before that for some reason in playback specs it said SD quality and the show looked shit cuz of that I cleared app data it fixed itself but now it has happened again and now clearing app data and cache ain't working.ive got a s23fe btw it's listed as supported devices ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j9kupq/the_streaming_quality_is_real_bad/"
    },
    {
        "id": "1j9t0pj",
        "author": "ContentFun7323",
        "title": "Why There aren't spin offs of Attack On Titan on Netflix?",
        "content": "It's not that they remove them and occasionaly move them back, there were never the spin offs on Netflix and There's no way to Watch them, that's odd becuase they're Canon to the main anime.\nIf you know the reason behind this or you're wondering Just like me, feel free to comment.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j9t0pj/why_there_arent_spin_offs_of_attack_on_titan_on/"
    },
    {
        "id": "1j9ttet",
        "author": "xkamp",
        "title": "How do I block indian content",
        "content": "hi I want to block all endian shows and movies, I never watched or selected any of their media and it still shows up I just want to block them so I don't see them posters when searching for something to watch \n\n how do I block it forever? ",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1j9ttet/how_do_i_block_indian_content/"
    },
    {
        "id": "1j9hx0t",
        "author": "romrotten",
        "title": "Language in rebel moon soundtrack",
        "content": "Hi guys! Does anyone know what language “a call to courage” is sung in? I imagine it’s a language made up for the film but can’t find anything anywhere.\n\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j9hx0t/language_in_rebel_moon_soundtrack/"
    },
    {
        "id": "1j9560b",
        "author": "VaniZaviBoBani",
        "title": "What is the name of this show?",
        "content": "I saw a show a while ago on Netflix,  it was a competition game show where strangers were fighting for money, but there was a saboteur amongst them. At the end of the challenges they took a quiz and answered questions about the saboteur. The player with the least correct answers got a red light via text. ",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1j9560b/what_is_the_name_of_this_show/"
    },
    {
        "id": "1j97h0a",
        "author": "yeswab",
        "title": "I actually want to see the closing credits of Zero Day, episode 6",
        "content": "Does anybody know how to turn off the automatic jump to previews of other programs? For what it’s worth, I was trying to finish Zero Day on a Samsung Android tablet, and we usually watch on a Google Chromecast. I couldn’t readily find any settings. THANK YOU!",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j97h0a/i_actually_want_to_see_the_closing_credits_of/"
    },
    {
        "id": "1j9zpej",
        "author": "MundaneElection1606",
        "title": "Netflix is removing the Lorax for another stupid show",
        "content": "",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1j9zpej/netflix_is_removing_the_lorax_for_another_stupid/"
    },
    {
        "id": "1j95ubi",
        "author": "NMokay",
        "title": "Just rewatched Purple Hearts. missing part? Did I make this up?",
        "content": "Am I making this up or was there a part where Cassie and Luke get interviewed by authorities or someone and are asked questions about each other to find out if the marriage is legit. I think immigration is brought up when talking to Cassie and Luke tells them about Cassie’s tattoo and the meaning. I think it happened before the court hearing or before they confessed there love for each other. Maybe I’m thinking of a different movie. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j95ubi/just_rewatched_purple_hearts_missing_part_did_i/"
    }
]