[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 708,
        "comments": 5202,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1o1xl5o",
        "author": "Ember_Grove20",
        "title": "What’s a Netflix original you think aged really well?",
        "content": "I was rewatching some of the older Netflix originals and honestly, a few of them still hold up so well. I’m curious which ones do you think aged the best? Are there any shows or movies you’ve gone back to and thought, wow, this still slaps?\n\nWould love to hear which ones you think are still worth watching today! \\^\\^",
        "upvotes": 19,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1o1xl5o/whats_a_netflix_original_you_think_aged_really/"
    },
    {
        "id": "1o1iob4",
        "author": "pleasedontbemeantom3",
        "title": "Wayward was sooo good until it wasn't.",
        "content": "Did anyone else feel this way?\n\nSpoilers ahead.\n\n\nI was so sucked in by wayward, it was great, the plot the mystery, the acting (Mae was a little flat but that's their shtick and I like them and Toni was so awesome I just didn't mind), I was loving it. \n\nThere was so much energy and intrigue in the show. And then in episode 8, I felt like it just didn't deliver. I think it just wasn't good as a limited series. The mystery that was built was too big for the wrap up. I wanted to understand by the end something about the inner world or workings of the townspeople. In general, for a show which centered so much around emotions, the deeper we got into the series the more shallow the characters seemed to become. It was really disappointing. We never were let into the characters internal experience. \n\nI wanted so badly to see Laura and Alex actually TALK about things. Like the relationship was never sold as functional or emotionally intimate. I get if at first they were freaked out but when they got on the same page, why was the most we got was a a couple arguments? No real conversation. Alex is obsessive and won't let things go about work but his wife is obviously going through all this and not  actually planning on leaving town snd he's not bothering her constantly about it? \n\nThe timeline just felt wonky and poorly conceived following the set up. A great concept with poor follow through. I was left wanting more, but not in a good way, but in the way that I felt they would have to undo what they had done to answer things in a satisfying way. ",
        "upvotes": 100,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1o1iob4/wayward_was_sooo_good_until_it_wasnt/"
    },
    {
        "id": "1o1wrdy",
        "author": "Top-Three-USA",
        "title": "Greg Peters Says Netflix Prefers Building Over Buying — Warns Against Big Media Mergers",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o1wrdy/greg_peters_says_netflix_prefers_building_over/"
    },
    {
        "id": "1o1qhd5",
        "author": "_missEltorri_",
        "title": "Is Monster: The Ed Gein Story really that bad?",
        "content": "I'm on episode 4 atm, and I've seen a lot of people not like this season. I personally found it to be disturbing but in a way that's like \"you wanna look away but you can't.\" I don't see the show as trying to portray him to be sympathetic, I see what he's doing and what he's done. It's creepy as hell. And as disturbing as the previous 2 seasons were, I found them to be quite educational in a way. What signs to look out for, like it's teaching us what to be cautious of. I also heard that the next season has been green lit and will focus on a female killer which is kind of a relief in a way, cause I'd like to see how these people became who they are from both sides of the gender. But I get what others are saying about how Ryan Murphy is \"glorifying\" these people. Idk, I just wanna get other people's opinion on it.\n\nP.S. Forgot to mention that I love what they did with the correlation/motif &gt;!between Gein and the movie Psycho, I think it really brought it to life.!&lt;",
        "upvotes": 16,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1o1qhd5/is_monster_the_ed_gein_story_really_that_bad/"
    },
    {
        "id": "1o20vm7",
        "author": "Jack1715",
        "title": "I feel like people really didn’t get the tone of the Ed Gein show",
        "content": "I’ve seen people say how it’s not accurate or that it’s all over the place. But the show was made like that cause the guy was schizophrenic and didn’t fully know what was real and what wasn’t. We don’t fully know what exactly happened and it’s the same for him.\n\nAnd about the girl yes she was based off someone he did actually know but she’s just the psychopathic part of his brain always pushing him to do bad things. This is why In the mental hospital she gives him a note with people he should kill but he refuses cause his no longer interested in it ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o20vm7/i_feel_like_people_really_didnt_get_the_tone_of/"
    },
    {
        "id": "1o1vs6b",
        "author": "voltagejim",
        "title": "Anyone watch True Haunting?",
        "content": "I used to love ghost shows and ghost stories back in the mid 90's through early 00's.  Then I found that all those reality ghost shows were all fake, and a lot of famous ghost stories were fake, and I just stopped believing in all that.\n\n  \nI watched this out of curiosity and honestly enjoyed it.  I honestly was trying to figure out explanations for  some of the things.  The 2nd story with the house was the most wild one.  Anyone have any additional info on these stories with rationale explanations for everything that happened?",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o1vs6b/anyone_watch_true_haunting/"
    },
    {
        "id": "1o1vfps",
        "author": "daisyup",
        "title": "Famous Last Words with Dr. Jane Goodall",
        "content": "Does anyone else find the interviewer on this show insufferable?  He doesn't seem to give the interviewee enough space to contemplate and respond.  He's not comfortable sitting in silence.  Instead he leaps to fill any quiet with his own talking.  I want to hear Jane talk, not the interviewer.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o1vfps/famous_last_words_with_dr_jane_goodall/"
    },
    {
        "id": "1o1yn2e",
        "author": "SpudmasterBob",
        "title": "Netflix Series Blu-ray Releases?",
        "content": "So my wife and I canceled some of our streaming subscriptions a while back to consolidate to the ones we watch the most, and Netflix was one we cut. \n\nHowever, there are a few shows like Stranger Things, Lost in Space, and Cobra Kai that I wouldn’t mind buying on Blu-ray if Netflix were ever to release them. \n\nHas Netflix said anything about whether or not they will be revisiting blu-ray releases of their popular shows? Or do they still have their heads up their $&amp;@*% about not releasing shows?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o1yn2e/netflix_series_bluray_releases/"
    },
    {
        "id": "1o1tv6i",
        "author": "Various_History_3900",
        "title": "Billionaire Bunker questions.",
        "content": "I’m only on episode 5!!! Please no spoilers. \n\nHow are they keeping the phone hidden if there are mics in the bracelets? \n\nWhy didn’t max beat Guillermo ass when he started getting beat up? \n\nThanks in advanced ! \n\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o1tv6i/billionaire_bunker_questions/"
    },
    {
        "id": "1o20z3y",
        "author": "freaky33",
        "title": "Sometimes no sound on Apple TV Netflix app with Dolby Atmos?",
        "content": "I have the Netflix app on my Apple TV (latest version of it), but when I start an episode of a series, I don't get any sound sometimes with Dolby Atmos. When I use a different streaming app it helps, and then I hear sound. When I switch back to the Apple TV Netflix app, the sound usually works again. Only the previews on the main page have sound. What's going on? It's only the Netflix app so there is nothing wrong with my HDMI cables or something.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o20z3y/sometimes_no_sound_on_apple_tv_netflix_app_with/"
    },
    {
        "id": "1o20owh",
        "author": "ArjoGupto",
        "title": "It’s why I got Netflix 9 years ago.",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o20owh/its_why_i_got_netflix_9_years_ago/"
    },
    {
        "id": "1o13lj2",
        "author": "BunnyBunny777",
        "title": "California bans loud commercials on Netflix (and others)",
        "content": "Newsom singed the bill effective 2026.  This should be a federal law.  Watching a show only to have a commercial suddenly start blaring 25 db louder is just menacing.  ",
        "upvotes": 104,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1o13lj2/california_bans_loud_commercials_on_netflix_and/"
    },
    {
        "id": "1o1swbd",
        "author": "psyxech",
        "title": "only one movie won't play and the error code gives no results",
        "content": "so I was trying to rewatch kpop demon hunters (cringe I know, but let me enjoy things), but it keeps giving me the error code m7381 1204. looking it up both in the website and in google gives nothing. I use chrome and it's fully updated, restarted my laptop, changed profiles etc but it still wont work, and everything else plays just fine. does anyone know what could be happening?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1swbd/only_one_movie_wont_play_and_the_error_code_gives/"
    },
    {
        "id": "1o1z463",
        "author": "Fantastic-Pension-72",
        "title": "What k-dramas, j-dramas and c-dramas to watch.",
        "content": "Hello anyone got any recommendations for Asian dramas to watch on Netflix or just any good show in general. I’m into fantasy sci-fi, action, romance just any good show to be honest trying to pass time during college and not play to many games. Thanks for the help. ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o1z463/what_kdramas_jdramas_and_cdramas_to_watch/"
    },
    {
        "id": "1o0zet1",
        "author": "Individual-Cut9977",
        "title": "Need new Netflix show recs that actually keep you hooked",
        "content": "I just finished my last series and now Im stuck scrolling for something good Everything either feels too slow or gets boring after a few episodes\n\nWhat are some shows on Netflix that pulled you in right away and actually stayed good till the end",
        "upvotes": 170,
        "comments": 381,
        "media": null,
        "permalink": "/r/netflix/comments/1o0zet1/need_new_netflix_show_recs_that_actually_keep_you/"
    },
    {
        "id": "1o1yx1f",
        "author": "Batrah",
        "title": "Anyone else can't take True Haunting seriously?",
        "content": "It's just how it's being portrayed by the director. So many silly jump scares it feels like a horror movie for teens.\n\nInteresting stories, but the execution makes it not believeable and feels like hollywood",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o1yx1f/anyone_else_cant_take_true_haunting_seriously/"
    },
    {
        "id": "1o1yw8w",
        "author": "dicklaurent97",
        "title": "Nurse Jackie is now on Netflix",
        "content": "It's dark, subtle, heartfelt and unexpected. Edie Falco stars as a drug-addicted nurse who is constantly either using or saving someone's life. It's a brilliant series if you want to watch something that is both enjoyable and challenging. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o1yw8w/nurse_jackie_is_now_on_netflix/"
    },
    {
        "id": "1o1beem",
        "author": "La_hOley",
        "title": "Did nobody in the town know that Ed Geins mother was dead in Monster?",
        "content": "Just couldn’t help but notice that even after she died he just kept referring to her as Mother as if she was still alive and the town didn’t seem to bat an eye. Wouldn’t the town of known in some way? It’s not like she died somewhere secluded and she had an actual funeral with her own gravestone. Is this a mistake or does this have any relevance to Ed Geins story?",
        "upvotes": 18,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1o1beem/did_nobody_in_the_town_know_that_ed_geins_mother/"
    },
    {
        "id": "1o1nlvw",
        "author": "cardsrealm",
        "title": "Mercy for None Review: Revenge and a Rare Glimpse into Korea",
        "content": "South Korea has captivated the world with its romantic dramas and the sound of K-pop. Yet **Mercy for None** reveals another side of the country, a darker one: the world of criminal factions.\n\nThe project originated from the webtoon **Plaza Wars** by Oh Se-hyung and Kim Kyun-tae, and was adapted for television by Choi Sung-eun and Yoo Ki-seong, who also wrote the screenplay. The series stars So Ji-seob as Nam Gi-joon, a former gangster, alongside Huh Joon-ho and Gong Myoung, who round out the main cast.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1nlvw/mercy_for_none_review_revenge_and_a_rare_glimpse/"
    },
    {
        "id": "1o1w7qw",
        "author": "Practical_Captain_58",
        "title": "In Netflix you can Turn off “Are you still watching?” and tidy your rows . Also take a peak at Behind the scene developer info.",
        "content": "You can change playback, autoplay settings and remove items from “Continue Watching” small chores that make the Netflix homepage actually pleasant. Go to Profile → Account → Playback settings (or Manage Profiles) to tweak. Doing this feels like reclaiming the app.\n\nAlso, When a title is playing on desktop, there are diagnostic shortcuts that show bitrate, CDN, resolution and other behind-the-scenes info. I think it's kind of handy if your stream is laggy or you want to see if you’re getting 4K. The classic key combo is `Ctrl+Alt+Shift+D` (varies by device). It shows a little overlay with stream stats. Use it when you suspect quality issues or...... just to brag you know.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1w7qw/in_netflix_you_can_turn_off_are_you_still/"
    },
    {
        "id": "1o1i7e2",
        "author": "Longjumping_Land_977",
        "title": "Real life recordings share the chilling actual voice Ed Gein had compared to the Netflix show",
        "content": "",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o1i7e2/real_life_recordings_share_the_chilling_actual/"
    },
    {
        "id": "1o1g0a8",
        "author": "ElLucifer666_",
        "title": "Black Rabbit RANT!",
        "content": "RANT! I only watched Black Rabbit because I saw reviews on here saying the ending was such a mind twist!\n\nFirst off the when I found out Jules had sexually assaulted Anna which - was ignored by Jake.WHO IS JULES. I literally had to restart all over from episode one to find out who Jules IS. There is no character build up. \n\nThis series is very vague and all over the place the only reason I kept watching was because users on here said the ending was a plot twist. Honestly the whole reason why I watched was waiting for this twist that never came. I was expecting some psychological thriller by the way people talked about it and this series was so BLAND. Waste of time. Not sure how this got any good reviews. ",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1o1g0a8/black_rabbit_rant/"
    },
    {
        "id": "1o1sum2",
        "author": "Byszer",
        "title": "Netflix house presale code?",
        "content": "Just wondering if anyone has a presale code they don’t need. I’m super excited to see the on in KOP open up in November. I live around the corner and am a huge one piece fan so when I saw that KOP would have One piece and Wednesday I was very happy!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1sum2/netflix_house_presale_code/"
    },
    {
        "id": "1o1ncnz",
        "author": "kocainekaviar",
        "title": "Wayward",
        "content": "The plot was great but the acting really sucked . Every actor seemed like this was their first acting role . Daniel was the only good one and maybe Leila . Also gave off such genz vibes . Could’ve been under a teen drama if there wasn’t that awkward sex scene . Opinions ? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1ncnz/wayward/"
    },
    {
        "id": "1o0w83p",
        "author": "sbailey7643",
        "title": "I actually enjoyed the Ed Gein Story",
        "content": "I have seen a lot of negative back lash regarding the series, but I actually enjoyed this season. \nFrom researching a bunch of the case, I find a lot of accuracy, and less inaccuracies. \nWhat are your thoughts?",
        "upvotes": 88,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1o0w83p/i_actually_enjoyed_the_ed_gein_story/"
    },
    {
        "id": "1o1j7gi",
        "author": "isla-bonita",
        "title": "Ed Gien and Mind Hunters",
        "content": "Did anyone notice the part where the detectives from Mind Hunters, portrayed by the charter actors, appear in the last episode of Ed Gein? I am wondering how this is all connected and was Ryan Murphy apart of making Mind Hunters? I really loved that show and got disappointed when it seemed to be cancelled. ",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o1j7gi/ed_gien_and_mind_hunters/"
    },
    {
        "id": "1o0s46h",
        "author": "Substantial_Copy_576",
        "title": "Anyone else stopped new TV shows until it has finished?",
        "content": "It’s not just Netflix but every single streaming platform out there are taking 2-3 years per season.\n\nIt’s super annoying, by the time the new season arrives, I barely remember anything about the show and all hype is long gone.\n\nHonestly, I’m skipping a lot of shows until it’s pretty much confirmed for final season or nearing it.\n\nAnd I definitely skip Netflix’s 2 part releases until they are all out. E.g. Wednesday season 2\n\n",
        "upvotes": 143,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1o0s46h/anyone_else_stopped_new_tv_shows_until_it_has/"
    },
    {
        "id": "1o1fvdq",
        "author": "Sudden_Pop_2279",
        "title": "Alice In Borderland Achieves Rare Streaming Feat With Season 3",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o1fvdq/alice_in_borderland_achieves_rare_streaming_feat/"
    }
]