[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 13,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 49,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l0t23z",
        "author": "Longjumping-Elk-7840",
        "title": "Is Dept Q worth watching ?",
        "content": "It's new and the review articals are giving mostly positive reviews, so is it really worth checking or not ? I love Mystery shows but recently I don't trust Netflix in this genre tbh. \n\n\n\n\n",
        "upvotes": 106,
        "comments": 178,
        "media": null,
        "permalink": "/r/netflix/comments/1l0t23z/is_dept_q_worth_watching/"
    },
    {
        "id": "1l0umzr",
        "author": "geniebythesea",
        "title": "Looking for a “Limited Series” show to watch. What’s your favourite?",
        "content": "As the title suggests, I’m looking to make a list of limited series shows to watch. Generally I like most genres, but specifically enjoy British crime shows/mystery, true story events, a little bit of sci fi (Severance and The OA are as far into that genre I go). A list of the shows I’ve seen and I’m looking more of is below - some of these might not be Netflix I’m not sure. \n\n- Broadchurch\n- Unbelievable \n- Unorthodox \n- Queens Gambit\n- Maid\n- Bodyguard\n- Baby Reindeer\n- The Fall\n- Gracepoint \n- Toxic Town\n- Mare of Eastown\n- The Missing \n- Adolescence \n\nEdit to add a show:\n- Bad Sisters (not Netflix show - but I highly recommend)\n- Sirens\n- Residence ",
        "upvotes": 77,
        "comments": 223,
        "media": null,
        "permalink": "/r/netflix/comments/1l0umzr/looking_for_a_limited_series_show_to_watch_whats/"
    },
    {
        "id": "1l0z2jh",
        "author": "627UK",
        "title": "Dept Q - Martin",
        "content": "I think I've missed something in the 1st episode(s) &amp; it's driving me mad. \n\nWho's Martin? \n\nHe appears to live with Carl &amp; Jasper. He's not listed on IMDB or Google searches as a cast member - despite having a speaking role. ",
        "upvotes": 13,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1l0z2jh/dept_q_martin/"
    },
    {
        "id": "1l159xn",
        "author": "NegativeParticular78",
        "title": "Sirens - S1Ep1",
        "content": "Glenn Howerton (Ethan) is 49 IRL, and Milly Alcock (Simone) is 25 IRL. Is this supposed to give me this much ick? I’m only a couple minutes in but I think he’s supposed to be a decade younger in the show? Still, gross. ",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l159xn/sirens_s1ep1/"
    },
    {
        "id": "1l0buum",
        "author": "MovieFan0512",
        "title": "The 2025 'Tudum' Event is Horrifically Bad",
        "content": "I tuned in to watch the event and it looks like the teen choice awards but for Netflix. It would have been better and more to the point by just releasing trailers and previews of upcoming shows on social media and YouTube. Not a teenybopper concert and nonsense.",
        "upvotes": 253,
        "comments": 135,
        "media": null,
        "permalink": "/r/netflix/comments/1l0buum/the_2025_tudum_event_is_horrifically_bad/"
    },
    {
        "id": "1l0czo5",
        "author": "CosmosisJones42",
        "title": "TUDUM is the cringiest thing I have ever seen.",
        "content": "I decided to check it out to see some cool trailers. I've been watching for 10 minutes, and I am cringing at everything. The host, the writing, I get that award show jokes are usually lame, but my god, I am literally shocked about how bad this is. Who approved this?",
        "upvotes": 175,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1l0czo5/tudum_is_the_cringiest_thing_i_have_ever_seen/"
    },
    {
        "id": "1l0zzd8",
        "author": "rakacha69",
        "title": "Looking for recommendations!",
        "content": "So i recently watched \"Lost In Starlight\" and I absolutely loved it! Im looking for things that are similar, romance, slice of life type anime films. Im not opposed to shows, but i prefer the films! Preferably also with happy endings please! ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l0zzd8/looking_for_recommendations/"
    },
    {
        "id": "1l0ssno",
        "author": "Mountain-Purple2907",
        "title": "Sirens: Devon the Narc/Free Simone",
        "content": "I don’t know who needs to hear this, but Devon was exhausting. Like truly insufferable. Every scene felt like a TED Talk no one asked for — dripping with self-righteousness, emotional manipulation, and smug therapist energy.\n\nShe didn’t help Simone out of love. She helped so she could own it. So she could parade around as the long-suffering savior. That wasn’t compassion. That was martyrdom weaponized.\n\nThe way she guilt-tripped, overstepped, and then had the audacity to call Simone “toxic”? Nah. She was the emotional vampire of the show — draining everyone with her need to be seen as “the good one.” And when Simone stopped giving her the validation she fed on, she suddenly flip-flopped from hating Michaela to loving her? Girl. That was jealousy, not healing.\n\nShe couldn’t handle not being the center of Simone’s emotional world. So she punished her. Classic narcissist behavior in a wellness cape.\n\nEven when she had a point, she was so smug about it that I found myself rooting against her just on principle. And that cruise? Please. She stayed behind with their dad just so she could get gold stars for suffering. It wasn’t selfless — it was performative.\n\nJustice for Simone. And prayers up for anyone who’s had to survive a Devon in real life.",
        "upvotes": 8,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1l0ssno/sirens_devon_the_narcfree_simone/"
    },
    {
        "id": "1l0wblx",
        "author": "Neo2199",
        "title": "'Stranger Things' Season 5 - Official Teaser - Volume 1: November 26 , Volume 2: December 25, Finale: December 31",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l0wblx/stranger_things_season_5_official_teaser_volume_1/"
    },
    {
        "id": "1l0kn9h",
        "author": "DrMonocular",
        "title": "Kaos (CANCELLED?)",
        "content": "Netflix pumps out a lot garbage for many seasons, which would be fine if they didn't  also cancel the most interesting and well made shows. It is a dam travesty that they canceled Kaos. It is one of the best shows they have made. They need to sell it to HBO or something at least. I'm very disappointed. It is rare that I stop endlessly trying to find something good and binge a show like I did here. 2 days, binged Kaos. I was so damn invested. Canceled. Guess I will go back to watching 20 minutes and clicking off of all the garbage they seem to love spending money on. They fumbled the Witcher real hard as well. I hope to hell they don't snatch defeat from the jaws of victory with One Piece too. I do not have high hopes for netflix in the long term with such blind idiots pulling the strings. We need a petition to renew KAOS. Who is with me?",
        "upvotes": 25,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1l0kn9h/kaos_cancelled/"
    },
    {
        "id": "1l0i61j",
        "author": "killwish_",
        "title": "Glitch: A Hidden Gem Worth Watching on Netflix?",
        "content": "\nHey r/Netflix,\nI just stumbled upon \"Glitch\" on Netflix and it looks pretty intriguing! It's a series about a police officer and a doctor who face an emotionally charged mystery when seven local residents inexplicably return from the dead in peak physical form.\nBefore I dive in, I wanted to get the community's thoughts. Has anyone watched this show? If so, what did you think? Is it worth the watch? No spoilers please!\nLooking forward to hearing your recommendations!\n\n–u/killwish_\n",
        "upvotes": 34,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1l0i61j/glitch_a_hidden_gem_worth_watching_on_netflix/"
    },
    {
        "id": "1l14zdh",
        "author": "Ares-Astle",
        "title": "Demon Slayer glitch?",
        "content": "Im having a weird issue, hopefully you all here can help me. I was watching Demon Slayer yesterday on my phone, on my profile. Today it won't show up, I have no viewing restrictions on my profile. I swapped to my wife's profile, on my account, on my phone and it pops right up. Any thoughts on why this is?\n\nThanks in advance",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l14zdh/demon_slayer_glitch/"
    },
    {
        "id": "1l0bma9",
        "author": "Lucky_Chaarmss",
        "title": "I've never seen Tudum before...",
        "content": "This is one of the dumbest things I've ever watched. They really need this to show some trailers? Just release the trailers and go about your day. Seems like a huge waste of money to me. ",
        "upvotes": 81,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1l0bma9/ive_never_seen_tudum_before/"
    },
    {
        "id": "1l0pj0e",
        "author": "Yushin1896",
        "title": "Thoughts about the series \"Bet\" in Netflix",
        "content": "I am still in episode 4.  I started watching it today. So far the series is good. Yumiko is cute. And the storyline is kinda nice too. Mostly about gambling. Haha. I heard it is adapted from a japanese manga if im not mistaken. Haha. Are you done watching it too? What are your thoughts about it? ",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l0pj0e/thoughts_about_the_series_bet_in_netflix/"
    },
    {
        "id": "1l10vnc",
        "author": "40Four-",
        "title": "Screen darkening on mobile",
        "content": "When I watch specific shows on my iPad, the screen is automatically darker than usual even tho I don’t have power saving mode on, my tablet isn’t overheating, and I don’t have any settings that could darker my screen. On the left side of the interface, it shows that my screen is lightened to the max, and some shows appear normal. Any way to fix this? I think it’s just a glitch but it’s really annoying and my app is updated ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l10vnc/screen_darkening_on_mobile/"
    },
    {
        "id": "1l109wf",
        "author": "Frosty-Engineering24",
        "title": "Netflix says ‘Your device isn’t part of the Netflix Household for this account’",
        "content": "When I leave my household, and go to a Hotel, it works just fine on their TV in the room. Always. When I go to another house to watch Netflix on their TV / Roku it works sometimes, but lately does not and states the above in the Subject line.\n\n  \nWhat do I need to do in order to use Netflix, now-a-days?\n\n  \nDo I need to connect to their Wi-Fi, and then disconnect, in order to work? Can't seem to figure out a way to make it work.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l109wf/netflix_says_your_device_isnt_part_of_the_netflix/"
    },
    {
        "id": "1l0catv",
        "author": "Significant-Chart661",
        "title": "ONE PIECE: Season 2 | Chopper First Look | Netflix",
        "content": "",
        "upvotes": 38,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l0catv/one_piece_season_2_chopper_first_look_netflix/"
    },
    {
        "id": "1l0xa9h",
        "author": "UndertaleErin",
        "title": "Screen keeps jumping every time I turn captions on?",
        "content": "I've tried restarting netflix, changing the language, changing the show, everything. Even restarting my computer doesn't work. It does this on the website as well as the app. zany suggestions? I really want to keep captions on.",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/voxll3ys7d4f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1l0xa9h/screen_keeps_jumping_every_time_i_turn_captions_on/"
    },
    {
        "id": "1l12bos",
        "author": "Obama-binladen101",
        "title": "Overlord",
        "content": "Why are they removing overlord off of Netflix? Of course they decide this after I started to watch it I’m only on season two but I guess now I have to hurry and watch as much as I can. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l12bos/overlord/"
    },
    {
        "id": "1l0wxi4",
        "author": "zay69707",
        "title": "Tudum red carpet",
        "content": "I know tudum has ended already but I was wondering how people were able to go to the red carpet (barricade) like were there tickets for the red carpet that I could’ve bought and where? \n\nI heard someone say they won a giveaway for a red carpet ticket and met Jenna Ortega which I’m also curious if it was a giveaway on the Netflix website\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l0wxi4/tudum_red_carpet/"
    },
    {
        "id": "1l0qpyb",
        "author": "killwish_",
        "title": "Absolutely hooked on \"The Trauma Code: Heroes on Call\"!",
        "content": "I just finished \"The Trauma Code: Heroes on Call\" and I'm genuinely impressed! The show is fantastic, and I found myself wishing there were more episodes. Does anyone know if a second season has been announced or when we can expect it? I'd love to see where the story goes next!\n\n–u/killwish_\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l0qpyb/absolutely_hooked_on_the_trauma_code_heroes_on/"
    },
    {
        "id": "1l0dtys",
        "author": "MysticCrest1830",
        "title": "Netflix Confirms 'Wake Up Dead Man: A Knives Out Mystery' December Premiere, Reveals Detailed Cast Information in New Teaser",
        "content": "",
        "upvotes": 16,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l0dtys/netflix_confirms_wake_up_dead_man_a_knives_out/"
    },
    {
        "id": "1l108or",
        "author": "Female_Gaze21",
        "title": "Thank You, Next (Netflix) Seyyaz or Beliz are the only people I would want to date from the show? Thoughts Anyone?",
        "content": "NO SPOILERS PLEASE I only watched season but from the first episode, I was drawn  Seyyazis' kindness and warmth (which continued throughout the entire season). He's handsome, and his face reminds me of someone I met in my past (but I can't figure out who). I am a Bi woman, so I was also attracted to Beliz.  I thought she was incredibly beautiful, and kind, but also she is incredibly smart and level headed. TBH, I also see a lot of myself her personality wise. She is a gentle person, but like me posesses a quiet confidence, that sadly gets overlooked because of the louder more messy characters.  ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l108or/thank_you_next_netflix_seyyaz_or_beliz_are_the/"
    },
    {
        "id": "1l0bsi6",
        "author": "iPhone13pm",
        "title": "Squid Game Season 3 Trailer",
        "content": "",
        "upvotes": 22,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l0bsi6/squid_game_season_3_trailer/"
    },
    {
        "id": "1kzxgcy",
        "author": "Worth-Stop3752",
        "title": "my netflix has the literal worst interface I have ever seen on my TV",
        "content": "I am one of the unlucky saps who got stuck with the new interface, I opened it said what the fuck, scrolled and immediately decided I am NOT using my netflix because wdym I have FOUR slots to look at??? it’s 100% an AI algorithm too.. which just makes it worse because I haven’t ever watched anything remotely to what’s being reccomended, why is the SETTINGS gone? who thought this shit was a good idea??? I used to be able to see like 30 things on my screen because they were smaller, but I can’t even see the next row… this is literally THE WORST interface i’ve seen on a streaming service and Km very tempted to just cancel 🙃",
        "upvotes": 138,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1kzxgcy/my_netflix_has_the_literal_worst_interface_i_have/"
    },
    {
        "id": "1l0sl2a",
        "author": "Not_Jewels",
        "title": "What is going on with Twilight and Netflix?",
        "content": "I can’t believe this is my first, and probably only, Reddit post. But can somebody explain what the deal is with Twilight on Netflix. They just returned the saga May 1, 2025, and now on June 1, the last day to watch is June 30, 2025. I know there’s something about licensing, so why return the franchise for 2 months?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l0sl2a/what_is_going_on_with_twilight_and_netflix/"
    },
    {
        "id": "1l097pf",
        "author": "norman3355",
        "title": "The Secrets we keep (2024)",
        "content": "Danish social/crime drama over 6 episodes. Fabulous direction and photography and solid cast. Avoids cliches for the most part and is refreshing to see. \n\nJust thought I’d share. ",
        "upvotes": 21,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l097pf/the_secrets_we_keep_2024/"
    },
    {
        "id": "1l0apdw",
        "author": "crosstheroom",
        "title": "that Chris Watt movie was so hard to watch American Murder\" The Family Next Door",
        "content": "I'm numb, how could he do that to his babies.\n\njust leave, it's better to be seen as an ahole who abandoned your family than to do what he did.   Doesn't matter what people think, better to be hated than to hear \"daddy no\" in your head for the rest of your life,\n\nand he even took them in the truck with Shannan dead knowing he was going to kill them when he got there.\n\nand it's so sad because it seemed he was a good guy and even with the way he treated the girls.\n\nWhen they said his parents didn't go to his wedding I knew something was wrong with his side of the family.\n\nI even felt bad for the poor little dog left behind.",
        "upvotes": 15,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1l0apdw/that_chris_watt_movie_was_so_hard_to_watch/"
    },
    {
        "id": "1l12sad",
        "author": "Top_Difference_7996",
        "title": "Blues Clues &amp; You...gone!",
        "content": "Thanks netflix, now I get to deal with a day of my kid losing his shit because you removed his favorite show.  If this wasn't bad enough now he CONSTANTLY asks Alexa for \"blues clues!\" and crys.  It was such a godsend when it was available... but now it's like getting formula during covid.  The execs deserve any bad karma coming their way.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l12sad/blues_clues_yougone/"
    },
    {
        "id": "1l0p9va",
        "author": "Realistic_Library309",
        "title": "Suggest me",
        "content": "So my exams are going to over on 3rd June so I need recommendations. \nI like emotional, romantic,thrilling movies but I don't want them to be too much intellectual. I mean no scientific movies. It can be fantasy or anything. \nIt should be either American, british , japanese or korean\nHindi too\n",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l0p9va/suggest_me/"
    }
]