[
    {
        "id": "1lafxco",
        "author": "ScrapAMA",
        "title": "Hi /r/movies, we're actor Anthony Rapp (Rent, Star Trek: Discovery, Dazed and Confused) and writer/director/actress Vivian Kerr (Grey's Anatomy). Our indie feature 'Scrap' is out now on VOD after an incredible 44 film festival run and is Certified Fresh 98% on Rotten Tomatoes! Ask us anything!",
        "content": "Hi r/movies, we're actor Anthony Rapp (Rent, Star Trek: Discovery, Dazed and Confused) and writer/director/actress Vivian Kerr (Grey's Anatomy). Our indie feature 'Scrap' is out now on VOD after an incredible 44 film festival run and is Certified Fresh 98% on Rotten Tomatoes! Ask us anything!\n\nYou might also know Anthony from other film, TV, and theater projects like: Rent (Broadway and film), Star Trek: Discovery, Dazed and Confused, School Ties, A Beautiful Mind, Without You, If/Then, Adventures In Babysitting, You're A Good Man Charlie Brown, Road Trip, and much more.\n\nSYNOPSIS: Beth (Vivian Kerr) has recently been laid off and struggles to maintain the appearance of a successful middle-class lifestyle as she bounces around Los Angeles. Hoping to land a new job and change her situation before her estranged older brother Ben (Anthony Rapp) finds out, Beth must confront her own pride in order to reconnect with him and provide for her young daughter Birdy. Meanwhile, Ben and his wife Stacy (Lana Parrilla) consider a third round of IVF and Stacy, a successful attorney, must re-evaluate her own conflicted relationship with motherhood.\n\nWatch the trailer here: [https://www.youtube.com/watch?v=b7SyTyI90IQ](https://www.youtube.com/watch?v=b7SyTyI90IQ)\n\nNow available to rent or purchase on AppleTV, Amazon, Fandango at Home, Google Play, and Vimeo-on-Demand!\n\n[https://tv.apple.com/us/movie/scrap/umc.cmc.4zwfgq5xrtuhk0cebcyrjllvf](https://tv.apple.com/us/movie/scrap/umc.cmc.4zwfgq5xrtuhk0cebcyrjllvf)\n\n[https://www.amazon.com/gp/video/detail/B0DMTMKDDV?tag=tvg\\_aig\\_showcard-20](https://www.amazon.com/gp/video/detail/B0DMTMKDDV?tag=tvg_aig_showcard-20)\n\n[https://athome.fandango.com/content/browse/details/Scrap/3769744?cmp=rt\\_leaderboard](https://athome.fandango.com/content/browse/details/Scrap/3769744?cmp=rt_leaderboard)\n\n[https://play.google.com/store/movies/details/Scrap?id=Nz11XAr5KEg.P&amp;hl=en\\_US](https://play.google.com/store/movies/details/Scrap?id=Nz11XAr5KEg.P&amp;hl=en_US)\n\n[https://vimeo.com/ondemand/scrapthefilm](https://vimeo.com/ondemand/scrapthefilm)\n\nBack at 2:30 PM ET today to answer your questions! Ask us anything\n\n",
        "upvotes": 276,
        "comments": 166,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uajtzc7n4p6f1.png?auto=webp&amp;s=e7df2fbc1b6612204b97c442f5d0e4fcabcbd1c1"
        },
        "permalink": "/r/movies/comments/1lafxco/hi_rmovies_were_actor_anthony_rapp_rent_star_trek/"
    },
    {
        "id": "1lar390",
        "author": "BunyipPouch",
        "title": "Official Discussion Megathread (The Life of Chuck, Materialists, How to Train Your Dragon, Echo Valley, Straw, Deep Cover) and Throwback Discussions (Gone In 60 Seconds)",
        "content": "**New In Theaters**:\n\n* [The Life of Chuck](https://www.reddit.com/r/movies/comments/1la4c8g/official_discussion_the_life_of_chuck/)\n* [Materialists](https://www.reddit.com/r/movies/comments/1la4c8n/official_discussion_materialists/)\n* [How to Train Your Dragon](https://www.reddit.com/r/movies/comments/1la4c8v/official_discussion_how_to_train_your_dragon/)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Gone In 60 Seconds](https://www.reddit.com/r/movies/comments/1la4c94/official_throwback_discussion_gone_in_60_seconds/)\n\n**Still In Theaters**:\n\n* [From the World of John Wick: Ballerina](https://old.reddit.com/r/movies/comments/1l4gwpn/official_discussion_from_the_world_of_john_wick/?)\n* [The Phoenecian Scheme](https://old.reddit.com/r/movies/comments/1l4gwrc/official_discussion_the_phoenecian_scheme_spoilers/?)\n* [Dangerous Animals](https://old.reddit.com/r/movies/comments/1l4gwso/official_discussion_dangerous_animals_spoilers/?)\n* [Karate Kid: Legends](https://old.reddit.com/r/movies/comments/1kyson2/official_discussion_karate_kid_legends_spoilers/?)\n* [Bring Her Back](https://old.reddit.com/r/movies/comments/1kysoob/official_discussion_bring_her_back_spoilers/?)\n* [Tornado](https://old.reddit.com/r/movies/comments/1kysore/official_discussion_tornado_spoilers/?)\n* [Mission: Impossible - The Final Reckoning](https://old.reddit.com/r/movies/comments/1kt8b6m/official_discussion_mission_impossible_the_final/?)\n* [Lilo &amp; Stitch](https://old.reddit.com/r/movies/comments/1kt8b83/official_discussion_lilo_stitch_spoilers/?)\n* [Friendship](https://old.reddit.com/r/movies/comments/1kt8b9q/official_discussion_friendship_spoilers/?)\n* [Final Destination: Bloodlines](https://old.reddit.com/r/movies/comments/1knpnb1/official_discussion_final_destination_bloodlines/?)\n\n**New On Streaming:**\n\n* [Echo Valley](https://www.reddit.com/r/movies/comments/1lar0eb/official_discussion_echo_valley/) \n* [Deep Cover](https://www.reddit.com/r/movies/comments/1lar0ej/official_discussion_deep_cover/) \n* [Straw](https://www.reddit.com/r/movies/comments/1lar0h7/official_discussion_straw/)\n* [Predator: Killer of Killers](https://old.reddit.com/r/movies/comments/1l5aczx/official_discussion_predator_killer_of_killers/?)\n* [Mountainhead](https://old.reddit.com/r/movies/comments/1l0u3hy/official_discussion_mountainhead_spoilers/?)\n* [Lost in Starlight](https://old.reddit.com/r/movies/comments/1l0u3kg/official_discussion_lost_in_starlight_spoilers/?)",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1lar390/official_discussion_megathread_the_life_of_chuck/"
    },
    {
        "id": "1lb0b16",
        "author": "CheezStik",
        "title": "The Disney Renaissance Era (late 80s/early 90s run) is actually insane",
        "content": "I know I’m not saying anything novel here but rewatching these movies with my 2yr old daughter and it is just astonishing how good these movies are. I’m talking primarily about Little Mermaid, Beauty and the Beast, Aladdin, and Lion King. Afterwards the 90s run is still good but these four movies aren’t just classics, they’re arguably the finest children’s films ever created. \n\nLike sitting here right now watching Beauty and the Beast (for the hundredth time lol) and “Bonjour” may be one of the best musical numbers I’ve ever heard. The quality of these movies is just off the charts. Makes me wonder - has there ever been a similar run where a studio just releases consecutive smash hits in such a brief period of time?",
        "upvotes": 4760,
        "comments": 789,
        "media": null,
        "permalink": "/r/movies/comments/1lb0b16/the_disney_renaissance_era_late_80searly_90s_run/"
    },
    {
        "id": "1lazrj0",
        "author": "BunyipPouch",
        "title": "Oscar-Winning Actor Gary Oldman Receives Knighthood from UK's King Charles for his Contributions to Drama - He joins contemporaries including Kenneth Branagh and Daniel Day-Lewis.",
        "content": "",
        "upvotes": 3948,
        "comments": 174,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/opAzSPDJevHm3cxUUFcKrJdmpUnkEIXZpDe6Vtl3TvA.jpeg?auto=webp&amp;s=cc8734073d558b1c67103343d713c1df588e73ee"
        },
        "permalink": "/r/movies/comments/1lazrj0/oscarwinning_actor_gary_oldman_receives/"
    },
    {
        "id": "1lb8e2u",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for the Halloween Re-Release of LAIKA’s ‘ParaNorman’ (Includes a New Short Film)",
        "content": "",
        "upvotes": 612,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w4p6l9d17w6f1.jpeg?auto=webp&amp;s=e96aacd82737207f8eb9e5225cee6de7fdcbc428"
        },
        "permalink": "/r/movies/comments/1lb8e2u/official_poster_for_the_halloween_rerelease_of/"
    },
    {
        "id": "1lazz8k",
        "author": "Apart-Combination820",
        "title": "Now that the Hate Train has passed, I watched Electric State and…Hollywood is terrible to Voice Actors.",
        "content": "I’m not complaining about the Millie Brown/Chris Pratt roles (here, at least), not the Ke Hey Quan or Stanley Tucci characters, but the voice casting is LOADED with well-known celebrities…who don’t voice act. It feels ethically wrong that voice actors didn’t get placed, but they hired popular stars for faceless roles. I didn’t even know Ant Mackie was the 3rd-most present role…did he do this WHILE doing Cap America??\n\nThis seems to be a trend among Disney-type projects, to blow up a budget in stupid ways. Were they expecting people to cheer for Woody Harrelson *not using his talent* as a peanut?\n\nWhen they marketed Little Mermaid, did they expect 8-year-olds to hear Awkwafina and go, “Mother, Father, a sassy trending comedian I don’t know is in this remake of a movie I’ve never seen. We MUST see it.” ?? \n\nNo hate at all to these celebs, it just seems like the budget &amp; the voice union get shafted by the industry…",
        "upvotes": 1162,
        "comments": 159,
        "media": null,
        "permalink": "/r/movies/comments/1lazz8k/now_that_the_hate_train_has_passed_i_watched/"
    },
    {
        "id": "1lamny3",
        "author": "mrjohnnymac18",
        "title": "Star Wars: George Lucas' Rare First Print Screens After Decades",
        "content": "",
        "upvotes": 5730,
        "comments": 667,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IyVkOGR-nNVaFtla7ZCdtW8Jtq5BcVoFWfHP6eviLvU.jpeg?auto=webp&amp;s=affb36471b8609607b44237980b5cba2f4bbedc9"
        },
        "permalink": "/r/movies/comments/1lamny3/star_wars_george_lucas_rare_first_print_screens/"
    },
    {
        "id": "1lawp7d",
        "author": "rickblaster",
        "title": "Worst Trilogy Of All Time",
        "content": "My cousin and I have a debate what is the worst trilogy of all time. For context it can only be 3 movies so anything that has a fourth movie or more or a part two to the 3rd movie doesn’t count. He says that Venom is the worst and my submission is XXX. Curious if there’s any that we might be over looking. Honorable mention is Hangover, however the first one is so good I couldn’t include it. ",
        "upvotes": 1234,
        "comments": 1305,
        "media": null,
        "permalink": "/r/movies/comments/1lawp7d/worst_trilogy_of_all_time/"
    },
    {
        "id": "1lb2fct",
        "author": "neekehehe",
        "title": "Recommend movies where two people who love each other don’t end up together",
        "content": "Make it as sad as you can. I don’t mind any language as long as I have subtitles. I need to break out of my delusion that I won’t end up with the person I love, no matter how much we love each other. I’ve been living in this unrealistic dream that if two people love each other, then they’ll end up together no matter what. That hope is going to destroy me in the future. I need to start seeing things for what they are. Any movies that will help me with this can be suggested. Thankyou in advance! ",
        "upvotes": 415,
        "comments": 1087,
        "media": null,
        "permalink": "/r/movies/comments/1lb2fct/recommend_movies_where_two_people_who_love_each/"
    },
    {
        "id": "1lb8044",
        "author": "BunyipPouch",
        "title": "First Poster for Fantasy-Comedy 'Sketch' - Starring Tony Hale &amp; Darcy Carden - A widowed father faces challenges when his daughter's chaotic drawings become real, affecting their town. He struggles to cope with this and his recent loss.",
        "content": "",
        "upvotes": 115,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cp6lde4d3w6f1.jpeg?auto=webp&amp;s=760004cf45392dba731e65e3d5b2b2623d941f0d"
        },
        "permalink": "/r/movies/comments/1lb8044/first_poster_for_fantasycomedy_sketch_starring/"
    },
    {
        "id": "1lbd43y",
        "author": "Small-Vacation-4245",
        "title": "What is the most terrifying and disturbing movie you've ever seen?",
        "content": "I just wanna watch a movie that will make me say \"this is what i call a horror movie\" because everytime i watch i horror movie, it makes me say \" this movie is so cheap and has no plot and no good story\" so i thought maybe if i ask reddit maybe they will suggest me a good and entertaining movie, and thank you everyone 🤍",
        "upvotes": 55,
        "comments": 155,
        "media": null,
        "permalink": "/r/movies/comments/1lbd43y/what_is_the_most_terrifying_and_disturbing_movie/"
    },
    {
        "id": "1lafd4a",
        "author": "MarvelsGrantMan136",
        "title": "First Image from Pixar's 'Hoppers' - Follows a young girl, Mabel, who can transfer her mind into a robot beaver with the goal of going undercover in the animal kingdom. She winds up befriending a regal beaver, King George, and uniting the animals to fight off the plans of a real estate developer.",
        "content": "",
        "upvotes": 6649,
        "comments": 765,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/feyin7x50p6f1.jpeg?auto=webp&amp;s=84df44649c26fd51d81a63f64fa3f45a9fd869be"
        },
        "permalink": "/r/movies/comments/1lafd4a/first_image_from_pixars_hoppers_follows_a_young/"
    },
    {
        "id": "1laokke",
        "author": "TheRealBrianLeFevre",
        "title": "Best example of a movie star being a movie star",
        "content": "I'm just finishing \"Moneyball\" and am thinking to myself, as someone who personally finds baseball to be a bore, that a film this engaging and entertaining about the management side of a baseball team wouldn't be half as good if it wasn't for Pitt's performance. That being said, what he does i feel is intangible. \n\nHe isn't super funny, his \"acting\" isn't especially spectacular, he doesn't pull some DDL or Meryl Streep shit, he doesn't take his shirt off or have a sex scene or anything. He's just...magnetic and highly watchable.\n\nDon't get me wrong, Hill, PSH, Pratt, all the supporting cast and the script are great, but Pitt delivers a movie star performance. What is the best example of this you can think of? A good movie elevated to phenomenal solely because a movie star was a movie star. Pure charisma. I'm thinking Clooney/Pitt in the Oceans movies, Newman in Cool Hand Luke and Butch Cassidy, Leo in Titanic. \n\nWhat's the best example you can think of? ",
        "upvotes": 1640,
        "comments": 725,
        "media": null,
        "permalink": "/r/movies/comments/1laokke/best_example_of_a_movie_star_being_a_movie_star/"
    },
    {
        "id": "1lapxr6",
        "author": "indiewire",
        "title": "Neon Reportedly Doubled Chris Stuckmann’s Budget to Reshoot ‘Shelby Oaks’ with More Gore and Violence — Sets October Release Date",
        "content": "",
        "upvotes": 1238,
        "comments": 223,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GRoVebSUmFZphbWlX6S04XHl5z6Io-ARVVi1lTCkS_c.jpeg?auto=webp&amp;s=9015902b47c008a1e3350170001c4a03ad1b4895"
        },
        "permalink": "/r/movies/comments/1lapxr6/neon_reportedly_doubled_chris_stuckmanns_budget/"
    },
    {
        "id": "1lb5bex",
        "author": "ShitInMyToaster",
        "title": "Movies where people physically fight and they resolve it by talking?",
        "content": "I'm open to anything, but I'd love any recommendations that break a genre. Where you think two opposing forces are gonna battle it out (and they do a bit) but they actually squash the beef they had. Or maybe not squash the beef but stop fighting because they realise there's other goals.\n\nExamples I can think off off the top of my head:  \nLegend (Tom Hardy beats up Tom Hardy)  \nScott Pilgrim: (Michael Cera talks to Nega Michael Cera)  \nAvengers Infinity War: Avengers meet the Guardians of the Galaxy\n\n  \nSorry if I'm not describing it well but any and all suggestions are greatly appreciated ",
        "upvotes": 88,
        "comments": 140,
        "media": null,
        "permalink": "/r/movies/comments/1lb5bex/movies_where_people_physically_fight_and_they/"
    },
    {
        "id": "1lbaj3n",
        "author": "Odd_Advance_6438",
        "title": "The Rock in Southland tales is such a bizarre but cool performance.",
        "content": "He plays an actor that has accidentally predicted the end of the world through a screenplay, and thats only like number 10 on the list of weirdest things in Southland tales\n\nIt’s sort of a bizarre caricature of himself, a guy who likes to put on a lot of bravado when practicing for a movie, but is super nervous and twitchy deep down. It was the Rocks idea to do the worried thing with his fingers. He delivers some pretty ridiculous dialogue in the film, including the pimps dont commit suicide line, with a lot of confidence\n\nAlso he still defends the film when it’s brought up, and Richard Kelly has nothing but praise for him",
        "upvotes": 35,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1lbaj3n/the_rock_in_southland_tales_is_such_a_bizarre_but/"
    },
    {
        "id": "1lb7zrc",
        "author": "whodidshit",
        "title": "What are some of the best erotic movies in foreign languages?",
        "content": "I've always found erotic movies that are not in English really exciting. I've watched and loved the following:\n\nThe Handmaiden \n\nLove \n\nBlue is the Warmest Colour \n\nLelleBelle\n\nY Tu Mama Tambien\n\nRoom in Rome\n\nQ \n\nRomance\n\nHotel Desire \n\nBrief Crossing\n\n\n\n\nI loved these because they were erotic and did have a decent plot. I watched and did not like the following:\n\n\nNymphomaniac \n\nMon Amour\n\nPaprika \n\nAnti Christ \n\n\n\n",
        "upvotes": 49,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1lb7zrc/what_are_some_of_the_best_erotic_movies_in/"
    },
    {
        "id": "1lauud1",
        "author": "deepseahag",
        "title": "A Once Lost Shelley Duvall film to premiere on her birthday in Houston",
        "content": "A long-lost piece of media is finally coming to the screen after 25 years.\n\nHouston Cinema Arts Society presents the world premiere of Dreams in the Attic, a never-before-aired live-action television film starring the late Shelley Duvall (The Shining, Faerie Tale Theatre) in one of her final roles. Filmed in 1999 on 16mm in Galveston and Houston, the movie was shelved after being passed over by the Disney Channel and has remained unseen for over two decades.\n\nIn celebration of Shelley Duvall’s birthday, the film will premiere at Houston’s historic River Oaks Theatre, marking its first public screening. Duvall stars as Aunt Nellie, the eccentric owner of a costume shop whose magical attic trunk allows anyone who tries on its costumes to bring their dreams to life.\n\nThe film features a standout cast including Haylie Duff (Napoleon Dynamite, Lizzie McGuire), Mary McDonough (The Waltons), and Vanessa Lee Chester (The Lost World: Jurassic Park). Long whispered about among fans of lost media, Dreams in the Attic has built a cult following based on its mysterious trailer and IMDb listing. Until now, no complete version of the film has ever been released or shown to the public.\n\nThe screening will include a post-film conversation with director Bob Willems, along with additional cast and crew members who will share behind-the-scenes stories and reflect on the film’s unusual journey to the screen. Also joining the conversation is Sarah Lukowski, founder of the Shelley Duvall Archive, who will speak on Shelley’s legacy and her friendship with the actress.\n\nThis special evening will honor Shelley Duvall’s extraordinary career, her Houston roots, and a long-lost film that never got the chance to shine—until now.\n\nTickets are limited. Be the first audience to see this film and reserve your seat today for this magical, once-in-a-lifetime cinematic experience!",
        "upvotes": 402,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1lauud1/a_once_lost_shelley_duvall_film_to_premiere_on/"
    },
    {
        "id": "1lajvk3",
        "author": "MarvelsGrantMan136",
        "title": "Ryan Coogler’s Criterion Closet Picks",
        "content": "",
        "upvotes": 1644,
        "comments": 149,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Atyy00cSzlpoD3_h_MCjMB9b3x7_uHGbdDZC99M8K7M.jpeg?auto=webp&amp;s=d1e3ed622322d9ac360c6f13c40ec05a238c025b"
        },
        "permalink": "/r/movies/comments/1lajvk3/ryan_cooglers_criterion_closet_picks/"
    },
    {
        "id": "1lbabdm",
        "author": "lord_coen",
        "title": "The Coen Brothers: A Look at Their Biography, Early Films, and Unique Style",
        "content": "The Coen Brothers, arguably the most iconic and influential directing team in cinema history, have indelibly shaped popular culture and cemented their legacy. Spanning from “Blood Simple” to “The Ballad of Buster Scruggs,” their body of work is characterized by its diverse range and unique stylistic fingerprint. This article will delve into a Coen Brothers biography, tracing their origins and dissecting the defining elements of their filmmaking approach to ultimately answer the question: who exactly are the Coen Brothers?",
        "upvotes": 24,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/z34DRjgAP-fKTkzHb_wek7qBUPx6FEPwicc3X8MvEAs.jpeg?auto=webp&amp;s=2914e239f01b0ebe3210d3a256260383c8404634"
        },
        "permalink": "/r/movies/comments/1lbabdm/the_coen_brothers_a_look_at_their_biography_early/"
    },
    {
        "id": "1lb0xbx",
        "author": "brennok",
        "title": "Ick - Official Trailer - in Theaters July 27-29th - Brandon Routh, Mena Suvari, Melina Pauli Weissman",
        "content": "",
        "upvotes": 126,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nYBr5MoyRFHmM6dQL_azBR5SqjJ5rWwQSfpJ7O__j0A.jpeg?auto=webp&amp;s=c12428559f744d22a8ad9521d65d9c5549d34848"
        },
        "permalink": "/r/movies/comments/1lb0xbx/ick_official_trailer_in_theaters_july_2729th/"
    },
    {
        "id": "1lbca5y",
        "author": "BunyipPouch",
        "title": "Rebecca Hall, Gael García Bernal, Noomi Rapace &amp; Beanie Feldstein To Star In Sci-Fi ‘The End Of It’ - In a near-future world where ageing can be cured and death is now optional, a 250-year old artists decides she wants to due, causing conflicts with her family.",
        "content": "",
        "upvotes": 18,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/o9Bfa1hGPZFZaW3QJR9NNCaecawg3AQY-upnF1iVCr4.jpeg?auto=webp&amp;s=baaf72473d132e008c2d04055845ed3f0cd1dc97"
        },
        "permalink": "/r/movies/comments/1lbca5y/rebecca_hall_gael_garcía_bernal_noomi_rapace/"
    },
    {
        "id": "1lapijw",
        "author": "ICumCoffee",
        "title": "‘Masters of the Universe’ Live-Action Movie Wraps Filming - Starring Nicholas Galitzine, Camila Mendes, Alison Brie, Idris Elba, Morena Baccarin &amp; Jared Leto",
        "content": "",
        "upvotes": 506,
        "comments": 253,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RI3yuoSv3Cno1XhVrcQQymcYJcfRxOmzsqSigci8Mqk.jpeg?auto=webp&amp;s=225bbc06b174d2920787feb83edaac5045c3f1eb"
        },
        "permalink": "/r/movies/comments/1lapijw/masters_of_the_universe_liveaction_movie_wraps/"
    },
    {
        "id": "1lalw54",
        "author": "MarvelsGrantMan136",
        "title": "Matthew McConaughey Reunites With ‘True Detective’ Creator Nic Pizzolatto On Feature Adaptation Of ‘Mike Hammer’ Book Series At Skydance",
        "content": "",
        "upvotes": 729,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fMylx8ZJpux_sp5uuKTcFNbtS0HIWdlbxyBFWIiox10.jpeg?auto=webp&amp;s=06f1c2845d0cae9147c55cf87b5edfb885288b99"
        },
        "permalink": "/r/movies/comments/1lalw54/matthew_mcconaughey_reunites_with_true_detective/"
    },
    {
        "id": "1lbdnro",
        "author": "Public-Profit-8184",
        "title": "Can you imagine how baffling the lost world must have been to the average person",
        "content": "TLW establishes early on that the events on isla nublar where pretty easily covered up. No one outside of the folks who made it off had any clue that dinosaurs exist again\n\nThe only person who was even talking about it was Ian and even then the general public just saw him as a complete nutcase like Alex Jones and that's if he even had any actual fame\n\nSo imagine being an average San Diego resident and there's just...a living breathing trex that's now walking down the street with zero context\n\nImagine living in this universe and finding out there is an entire island of actual dinosaurs that are just chilling and some genetics company brought them back  ",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1lbdnro/can_you_imagine_how_baffling_the_lost_world_must/"
    },
    {
        "id": "1lb9z9w",
        "author": "SolidNumerous2259",
        "title": "Looking for movies similar to The Impossible (2012)",
        "content": "Hey everyone,\nI recently rewatched The Impossible (2012), the film about the 2004 tsunami and a family struggling to survive and find each other again. It hit me hard emotionally — the disaster scenes, the realistic survival elements, and especially the heart-wrenching moments of separation and reunion.\n\nI'm looking for similar movies.",
        "upvotes": 14,
        "comments": 40,
        "media": null,
        "permalink": "/r/movies/comments/1lb9z9w/looking_for_movies_similar_to_the_impossible_2012/"
    },
    {
        "id": "1lb6tqf",
        "author": "IT_CHAMP",
        "title": "What are your favorite lesser-known finance/business movies?",
        "content": "Normally when someone asks a question like this you get your usual answers, The Big Short, Margin Call, Wolf of Wall Street, Wall Street, Boiler Room etc. but what are some of the lesser known films? \n\nI think what I love about these movies is it gives you a taste of what some people have experienced, the decisions they've had to make.",
        "upvotes": 21,
        "comments": 72,
        "media": null,
        "permalink": "/r/movies/comments/1lb6tqf/what_are_your_favorite_lesserknown/"
    },
    {
        "id": "1lb22a3",
        "author": "Virologist_LV4",
        "title": "Bebe's Kids (1992)",
        "content": "I recently saw a video depicting an unruly child next to his mother who seemed to be ignoring his behavior and I instantly thought of Bebe's Kids.\n\n Bebe's Kids, (FREE on YouTube) is the first black comedy I ever saw as a child growing up. I'm sure there's a plethora of films dated before Bebe's Kids, but as a kid, it obviously stood out above the rest.\n\nIf you have never seen or heard of Bebe's Kids, I highly recommend you take the opportunity to watch what I would call the Citizens Kane of Black Family Comedy. It's a family-friendly film that transcends race and emulates the struggle parents and children have coping with new experiences in the struggle for happiness.\n\nSeriously, BeBe's Kids is Funny as Fuq, and you're missing an unforgettable experience if you haven't had the pleasure of enjoying this film with your friends and family. \n\nIf you watched Bebe's Kids as a youth, I highly recommend rewatching it, like Dinosaurs (1991), it's chalked full of jokes only adults will understand. \n\nHave you seen Bebe's Kids? What did you think? To me, it's a kids friendly version of Don't Be A Menace To South Central While Drinking Your Juice In The Hood, another Black Comedy Masterpiece, (I'd say it's kids friendly seeing as I watched it when I was 12 years old, but probably not by today's standards) but that's a film for another post. ",
        "upvotes": 41,
        "comments": 26,
        "media": null,
        "permalink": "/r/movies/comments/1lb22a3/bebes_kids_1992/"
    },
    {
        "id": "1lao3zl",
        "author": "MarvelsGrantMan136",
        "title": "Darren Aronofsky Circling A24 Film ‘Breakthrough’ Co-Starring Dwayne Johnson",
        "content": "",
        "upvotes": 344,
        "comments": 82,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lPoHRY0b6ARR0rl4DiXyOmS1WobGgb-bGe7ZV0WrIag.jpeg?auto=webp&amp;s=449e00e239a76720dd488212f1a3c421d1f02b76"
        },
        "permalink": "/r/movies/comments/1lao3zl/darren_aronofsky_circling_a24_film_breakthrough/"
    },
    {
        "id": "1laexcr",
        "author": "TiredWithCoffeePot",
        "title": "Pixar Announces All New Original Film ‘Gatto,’ Sneaks ‘Toy Story 5,’ Confirms Joan Cusack’s Return and Presents ‘Hoppers’ Exclusive Footage at Annecy",
        "content": "",
        "upvotes": 1009,
        "comments": 132,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jNxIDva-f6NcnqrBkpJ41N2rtQUZoK3Pery6-Do2TEQ.jpeg?auto=webp&amp;s=237e2143fa31996583970eed76139d2cf53cff32"
        },
        "permalink": "/r/movies/comments/1laexcr/pixar_announces_all_new_original_film_gatto/"
    },
    {
        "id": "1lb9lj0",
        "author": "inevercountsheep",
        "title": "\"Love &amp; Mercy\"  (Story of Brian Wilson of the Beach Boys)",
        "content": "",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1lb9lj0/love_mercy_story_of_brian_wilson_of_the_beach_boys/"
    },
    {
        "id": "1laj6qc",
        "author": "trollingjabronidrive",
        "title": "Disney Sneak Peeks ‘Zootopia 2’ at Annecy: Announces Studio Return of ‘The Little Mermaid,’ ‘Aladdin,’ ‘Moana’ Director Ron Clements",
        "content": "",
        "upvotes": 545,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ugVlTiQKC9DgVF8l_SplLWzsntJMDnI_yUGslCkhcLU.jpeg?auto=webp&amp;s=7e8773c76f820ebd4d3d239dfde3a3b3bdffb8bc"
        },
        "permalink": "/r/movies/comments/1laj6qc/disney_sneak_peeks_zootopia_2_at_annecy_announces/"
    }
]