[
    {
        "id": "1ipc970",
        "author": "RoundingAMA",
        "title": "Hey /r/movies! I'm Alex Thompson, director/producer of movies like SAINT FRANCES, GHOSTLIGHT and the writer/director of medical thriller ROUNDING, in theaters now! Ask me anything! I’ll be back at 4:00 PM ET today (Friday 2/14) to answer any questions.",
        "content": "",
        "upvotes": 7,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mslaqxxcb4je1.png?auto=webp&amp;s=8c5877116ab31c5f9b882779d3ba378b5db9873e"
        },
        "permalink": "/r/movies/comments/1ipc970/hey_rmovies_im_alex_thompson_directorproducer_of/"
    },
    {
        "id": "1ipbcs0",
        "author": "take7pieces",
        "title": "Husband urged the family to watch his old favorite movie Mr.Holland’s Opus, only to find out it’s not as good as he remembers",
        "content": "He was very excited when he saw Hulu has it, so he urged everybody to watch it together, we made popcorn, a serious watch party for this family.\n\n\nIt was nice at first, great acting, same old same old “I don’t want to do the job but I have to, now let me help these kids”, it had great touching moments.\n\n\nSpoiler alter.\n\n\nHis son is deaf, then he started to feel frustrated, since they couldn’t bond. Then he basically kinda not bond with his kid for almost 15 years???? His sign language wasn’t even good when his kid was in high school. Eventually they had a big fight, he realized he’s been an absent dad, he sang to his son (with sign language) and everything is good again! \n\n\nI know it’s a movie, I guess it’s because I have kids now, the whole “father and son quickly bond again” storyline just seems so fake to me. \n\n\nThen there’s the most disturbing part. A student had a huge crush on him, he also seems to have feelings for her too???? The part they almost kiss just made me feel gross. \n\n\n\nEdit: apparently I am wrong about the symphony part so I am gonna delete it.\n\n\nHusband said, I didn’t know it’s so weird when I first saw it, I only remember it was pretty touching. \n\n\nFamily still had a great time. Funny how sometimes our old favorite films are not as good as we remember.",
        "upvotes": 725,
        "comments": 445,
        "media": null,
        "permalink": "/r/movies/comments/1ipbcs0/husband_urged_the_family_to_watch_his_old/"
    },
    {
        "id": "1iozu61",
        "author": "Sonia341",
        "title": "A24’s ‘Death of a Unicorn’ Starring Jenna Ortega Rated “R” for Strong Violence &amp; Gore",
        "content": "",
        "upvotes": 3171,
        "comments": 140,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MEsvqDMioIpko_qZblIg25GsvQWIGsQ_hnc_SADwkgM.jpg?auto=webp&amp;s=985650d86f633ad7832107af385d517fb5744e2f"
        },
        "permalink": "/r/movies/comments/1iozu61/a24s_death_of_a_unicorn_starring_jenna_ortega/"
    },
    {
        "id": "1ipcs7u",
        "author": "MarvelsGrantMan136",
        "title": "Robert Eggers' ‘Nosferatu’ Sets Peacock Streaming Date (February 21) With Never-Before-Seen Extended Cut Also Available",
        "content": "",
        "upvotes": 197,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2WhJG_Pkus-L_Tji80G5Ed52omHmAAh5CTjzmiiAqc8.jpg?auto=webp&amp;s=4ac6c401b1aef46ccb0f9f5406200b81daf0aeec"
        },
        "permalink": "/r/movies/comments/1ipcs7u/robert_eggers_nosferatu_sets_peacock_streaming/"
    },
    {
        "id": "1ipa9ln",
        "author": "TheMiddlechild08",
        "title": "Due to subtitles, the beginning of Interstellar gives away what happens to a character.",
        "content": "This is really just me asking a question. At the beginning of Interstellar they show the testimonies of older people on tv talking about what it was like on earth before they had to leave. \n\nOne of them is old Murphy. And not only that, the subtitles say it’s her. I just wonder what the thought of this is here. I never realized it was her till like the third viewing, and then recently with the subtitles on it just flat out says it’s her. Is this an accident or on purpose? Like, if you had never seen the movie and watched it with subtitles on (which unfortunately is recommended for Nolan films) and the first 5 mins it gives it away that it’s her, even though it would be hard to catch that or understand what’s going on anyways. \n\nI just wonder if anyone has noticed that or what to think of it I guess lol. I just found it odd, or maybe not put her name in the subtitle. ",
        "upvotes": 210,
        "comments": 246,
        "media": null,
        "permalink": "/r/movies/comments/1ipa9ln/due_to_subtitles_the_beginning_of_interstellar/"
    },
    {
        "id": "1ip2pgn",
        "author": "HazelsWarren",
        "title": "What is the worst plot twist you've ever seen in a movie?",
        "content": "Inspired by the recent 'worst movie you've ever seen' thread ... what is the worst plot twist you've ever seen? Not looking for plot twists you didn't like but still fit the narrative pretty well, but more like ones that completely made everything before and after worse off. \n\nFor me, it's The Dressmaker. The first 30-45 mins are okay, seems like a romantic drama starring Kate Winslet and Sarah Snook with beautiful costumes. The movie feels light and funny in parts. But then &gt;! Kate Winslet's fortunes go downhill faster than you can say A Serious Man (by the Coen Brothers). Her love interest, Liam Hemsworth, drowns in sorghum inside a grain silo (she witnesses it). Then more people die in gruesome ways, and Kate Winslet ends up blowing up the town at the end. Tone-wise, it is so off...  !&lt;\n\nThe plot choices completely ruin some of the great things it had going for it.",
        "upvotes": 1000,
        "comments": 1761,
        "media": null,
        "permalink": "/r/movies/comments/1ip2pgn/what_is_the_worst_plot_twist_youve_ever_seen_in_a/"
    },
    {
        "id": "1iowsxb",
        "author": "Edm_vanhalen1981",
        "title": "Cheech and Chong documentary will light up theaters on 4/20",
        "content": "",
        "upvotes": 1382,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EwxjcP2w0muh-t8sWU0rfLO6Iswqk_rJ58eBy02tvvk.jpg?auto=webp&amp;s=76c08d1d9d25fb1409aafadde94f92d91034650a"
        },
        "permalink": "/r/movies/comments/1iowsxb/cheech_and_chong_documentary_will_light_up/"
    },
    {
        "id": "1ip0ump",
        "author": "LiteraryBoner",
        "title": "Official Discussion - Captain America: Brave New World [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/kMowGMdwv8I3)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/kMowGMdwv8I3)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ZPi3H5nAwrkj) to see the rankings of 2024 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n---\n**Summary:**\n\nSam Wilson, the new Captain America, finds himself in the middle of an international incident and must discover the motive behind a nefarious global plan.\n\n**Director:**\n\nJulius Onah\n\n**Writers:**\n\nRob Edwards, Malcolm Spellman, Dalan Musson\n\n**Cast:**\n\n* Anthony Mackie as Sam Wilson\n* Harrison Ford as President Thaddeus Ross\n* Danny Ramirez as Joaquin Torres\n* Shira Haas as Ruth Bat-Seraph\n* Carl Lumbly as Isaiah Bradley\n* Tim Blake Nelson as Samuel Sterns\n\n**Rotten Tomatoes:** [51%](https://www.rottentomatoes.com/m/captain_america_brave_new_world)\n\n**Metacritic:** [42](https://www.metacritic.com/movie/captain-america-brave-new-world/critic-reviews/)\n\n**VOD:** Theaters",
        "upvotes": 624,
        "comments": 1218,
        "media": null,
        "permalink": "/r/movies/comments/1ip0ump/official_discussion_captain_america_brave_new/"
    },
    {
        "id": "1ioh3em",
        "author": "samx3i",
        "title": "V For Vendetta (2005) is more relevant now that when it was released",
        "content": "It's been nearly two decades since V for Vendetta (2005) hit theaters, and while it was powerful then, it feels downright prophetic now. The film (adapted from Alan Moore's graphic novel) depicts a world gripped by authoritarian rule, where fear and control are used to suppress dissent, manipulate the public, and eliminate those who don't fit a rigid, regime-approved mold. Sound familiar?\n\nOver the past several years, we've seen a troubling global shift toward far-right politics and fascist rhetoric. Governments are cracking down on dissent, scapegoating marginalized groups, and using mass surveillance and propaganda to consolidate power. In America, book bans are rising, protests are being criminalized, and political leaders openly flirt with authoritarianism while spinning their actions as \"preserving democracy.\" Meanwhile, corporations and media conglomerates control narratives just as tightly as the Norsefire regime did in V for Vendetta. The line between fiction and reality is thinner than ever.\n\nTo fans of the original graphic novel, and I am one—yes, I know, the book did a lot of things better. Alan Moore’s work was sharper in its critique of Thatcher-era Britain specifically, and the story had more complexity in certain areas. But that doesn’t mean the film was bad. In fact, I’d argue it made a few changes that I actually like (though I won’t go into spoilers). The movie, despite its differences, still stands as a powerful and necessary story—one that feels chillingly relevant today.\n\nAlso, Alan Moore hating adaptations of work is par for the course. He's entitled to that opinion as an artist, but the film stands on its own.\n\nSo if you haven’t watched V for Vendetta in a while, I highly recommend revisiting it. It’s no longer just a dystopian cautionary tale; it’s a mirror reflecting where we might be headed if we’re not careful. And remember! Ideas are bulletproof.",
        "upvotes": 17542,
        "comments": 1769,
        "media": null,
        "permalink": "/r/movies/comments/1ioh3em/v_for_vendetta_2005_is_more_relevant_now_that/"
    },
    {
        "id": "1iojy0j",
        "author": "MarvelsGrantMan136",
        "title": "Takashi Yamazaki Confirms Bigger Budget For 'GODZILLA MINUS ONE' Sequel",
        "content": "",
        "upvotes": 2600,
        "comments": 134,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/df21YLEwlhaj1PPGW92H32l97qzut86lmMZkWi4hUgs.jpg?auto=webp&amp;s=3316ff732197f3f2348c78d57b3d8e790f06e7d1"
        },
        "permalink": "/r/movies/comments/1iojy0j/takashi_yamazaki_confirms_bigger_budget_for/"
    },
    {
        "id": "1ioktsd",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'The Accountant 2'",
        "content": "",
        "upvotes": 2044,
        "comments": 371,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1acnoina7xie1.jpeg?auto=webp&amp;s=3540a66fcb326f581d1027e30ca456d76e438971"
        },
        "permalink": "/r/movies/comments/1ioktsd/official_poster_for_the_accountant_2/"
    },
    {
        "id": "1iosdg3",
        "author": "NeedNewNameAgain",
        "title": "The Worst Movie You've Ever Seen?",
        "content": "I'm currently sick and watching Gods the Deep. It's absolutely awful. Like...so bad. \n\nIf my 5 year old son had a cardboard box and 100 crayons, he would've made sets that look about the same. \n\nThe acting isn't much better than when I'm reading him books and night and try to give the characters different voices. \n\nHonestly, the SyFy channel would've been ashamed to air this movie. \n\nSo... what's your worst movie you've ever seen?\n\nEDIT: After wading through some of the replies, it is clear that some of you have never seen a genuinely bad movie in your lives. It's not just a bad movie, I'm talking about a movie so bad that Mark Wahlberg's brother Paul would have been ashamed to be in it. \n\nA movie so bad it makes The Room look like Citizen Kane. A movie whose set design would be frowned upon by 5th graders. Whose acting wouldn't have gotten them an ensemble role in a stage production of The Room, performed entirely by blind rats. \n\nIf you told me Gods the Deep was a student film, I would encourage failing them and kicking them out of film school.",
        "upvotes": 718,
        "comments": 3251,
        "media": null,
        "permalink": "/r/movies/comments/1iosdg3/the_worst_movie_youve_ever_seen/"
    },
    {
        "id": "1ipeorz",
        "author": "Minute-Necessary2393",
        "title": "Tangled is one of the most beautiful Disney films ever made.",
        "content": "Happy Valentines Day, everybody! And too celebrate....on my own...as usual (😢). I decided to watch one of my favorite Disney movies of all time....*Tangled*. This is not only one of my favorite Disney movies of all time, as I said, but also probably tied with *Frozen* as my favorite of the post-2000s Disney Era. Yes, I know there are objectively better films from the modern era like *Zootopia* and *Encanto*. But for my, *Tangled* is my all-time favorite (along with...well, you know).\n\nThe animation is absolutely beautiful, cozy, and still holds extremely, especially with the colors, the comedy also equally still holds up and I found myself laughing at a lot of points, the songs are memorable and catchy, I see The Light and the scene that goes with it is probably the highlight of the movie and one of, if not the most beautiful moment in have seen in any Disney film ever, Mother Gothel is truly the last great Disney (I love King Candy too, but he still got nothing on Gothel) who i am convinced is the Evil Queen from Snow White Years later and i refuse to think any different, the action is surprisingly solid, and not only is Rapunzel the best Disney princess (besides Kuzco, that is, lol), but also her and Eugene's love story is probably the best I've seen in any Disney film.\n\nThe two work off of each other extremely well, and you absolutely buy their chemistry, as they don't fall in love with one another right away, but instead there romance develops throughout the course of the film, and seeing it happen on screen is phenomenal, which just makes the scene when they eventually confess on the boat (in song form!) and when Rapunzel revives Eugene via her act of true love even more satisfying and heartwarming. The emotional/dramatic moments also work extremely well, and don't even get me started on how much of GOATs Maximus and Pascal are as comedic animal sidekicks.\n\nThe only problem I have is that the climax is admittedly the man saving the women again, but I'm willing to let it slide and view it more as a nitpick as it makes sense within the context of the story, and it's Rapunzel who ultimately brings Eugene back anyways. Not much else to say other then such a beautiful and solid film that I highly recommend, that i am surprised though also kindof glad Disney never did a sequel too (the closest we got was the equally fantastic and goated TV series, which i also highly recommend). With that said, if Frozen 3 and 4 are not crossovers with Tangled, I will be VERY disappointed. Maximus and Pacal interacting with Sven, Bruni, and Olaf is too amazing to think about.",
        "upvotes": 16,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1ipeorz/tangled_is_one_of_the_most_beautiful_disney_films/"
    },
    {
        "id": "1ioww1p",
        "author": "legobowser",
        "title": "When was the last time a movie went significant reshoots after it was mostly finished and was good?",
        "content": "This new Captain America movie had so many rounds of reshoots, just for it to not be good anyways. Say what you will about the Sony verse, but once they knew a movie was bad, they slapped some adr on it and released it, instead of spending millions to try and fix it and still have it suck in the end ",
        "upvotes": 341,
        "comments": 410,
        "media": null,
        "permalink": "/r/movies/comments/1ioww1p/when_was_the_last_time_a_movie_went_significant/"
    },
    {
        "id": "1ipcjut",
        "author": "chuckfr",
        "title": "Special effects pull me out of the experience in newer movies",
        "content": "I went to see the new Captain America last night (This post is spoiler free). As I'm watching it the green screen scenes (or whatever tech it is) kept pulling me out of the experience. While its been going on for a few years now in more and more TV shows and movies the experience last night was just the worst its been. And it seems to be worse in the Disney properties and with their money I'd expect better. \n\nThe experience is just putting me off more and more of watching an of these types of movies and shows. ",
        "upvotes": 18,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1ipcjut/special_effects_pull_me_out_of_the_experience_in/"
    },
    {
        "id": "1ip1sx4",
        "author": "Immediate_Wolf3802",
        "title": "Who's a menacing tough guy in movies that genuinely scares you ???",
        "content": "I'm watching MONA LISA (1986) for the first time after thoroughly enjoying the dark gangster film \"The Long Good Friday\" from 1980 I've gone on to watch it several times since \n\nAnd for me it's the short but stocky late great \"BOB HOSKINS\" who is masterful in Good Friday \n\nWhen that guy gets angry he's very convincing with the pulsating veins and raging eyes and crooked smile \n\nHe has gypsy blood ya know so it's highly likely he's been in a few scraps for real...and it'd take a brave man to take him on after purposely knockin over his pint ?\n\nWhich tough guy actor genuinely scares you with there on screen performances  that look a little too real ?",
        "upvotes": 134,
        "comments": 372,
        "media": null,
        "permalink": "/r/movies/comments/1ip1sx4/whos_a_menacing_tough_guy_in_movies_that/"
    },
    {
        "id": "1ioky7g",
        "author": "MarvelsGrantMan136",
        "title": "The Accountant 2 | Official Trailer",
        "content": "",
        "upvotes": 1367,
        "comments": 301,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Vpqs2zF-ahIJrW5G90JeojMsFgt1luafjImgxDyG-1M.jpg?auto=webp&amp;s=22d6d71755323b83a4a9e1fc20db5a6b10bf5cd3"
        },
        "permalink": "/r/movies/comments/1ioky7g/the_accountant_2_official_trailer/"
    },
    {
        "id": "1ip2bw1",
        "author": "Comfortable_Ant_2441",
        "title": "I Have No Idea Why I Enjoy ‘The Gentlemen’ So Much",
        "content": "The movie is good but it’s definitely not great. Maybe B- or B grade at best. It’s not even Guy Ritchie’s 2nd best movie. I’ve watched this movie so many times. This might be the thing that Bill Simmons and his crew on The Rewatchables podcast are always taking about. There’s just something about it that’s so easy to watch and rewatch.",
        "upvotes": 108,
        "comments": 92,
        "media": null,
        "permalink": "/r/movies/comments/1ip2bw1/i_have_no_idea_why_i_enjoy_the_gentlemen_so_much/"
    },
    {
        "id": "1iparze",
        "author": "LaserDiscCurious",
        "title": "\"Notes on a Scandal\": Uncomfortable film about a quietly menacing spinster (Judi Dench) obsessed with a teacher (Cate Blanchett) engaging in unwholesome actions with her student",
        "content": "Such a great film, yet it is rarely discussed. Judi Dench and Cate Blanchett are in top form as two repressed teachers longing for excitement in their lives, only to immediately regret their actions once it arrives.\n\nJudi Dench plays her character as a bitchy and bitter schoolteacher, Barbara, who judges everyone around her, until she meets a younger teacher, Sheba, who starts out as a lively but slightly awkward person. As Barbara becomes obsessed with Sheba, heavily suggested as being more than just friendly attention, she finds out Sheba is having sex with her 15 year old student and decides to blackmail her by forcing Sheba to spend more time with her and the cats. Trouble ensues when Sheba becomes increasingly put off by Barbara's flirtations and need to have her around 24/7. \n\nThe supporting cast is first-rate as well, featuring Bill Nighy, Andrew Simpson, Joanna Scanlan, Michael Maloney, Anne-Marie Duff, and Julia McKenzie.",
        "upvotes": 21,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1iparze/notes_on_a_scandal_uncomfortable_film_about_a/"
    },
    {
        "id": "1iovwxj",
        "author": "indiewire",
        "title": "‘No Other Land’ Is Nominated for an Oscar, but in Masafer Yatta, We’re Still Being Erased — Opinion",
        "content": "",
        "upvotes": 214,
        "comments": 86,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ho7VqLv2V0DT_gU1mm83d25S6_n0mzrN9qju2l1QVqk.jpg?auto=webp&amp;s=30f75392f4de0c81de519eab196419481cc9487b"
        },
        "permalink": "/r/movies/comments/1iovwxj/no_other_land_is_nominated_for_an_oscar_but_in/"
    },
    {
        "id": "1ip0uph",
        "author": "LiteraryBoner",
        "title": "Official Discussion - Paddington in Peru [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/fcJqQu0fPno4)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/fcJqQu0fPno4)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ZPi3H5nAwrkj) to see the rankings of 2024 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n---\n**Summary:**\n\nPaddington returns to Peru to visit his beloved Aunt Lucy, who now resides at the Home for Retired Bears. With the Brown family in tow, a thrilling adventure ensues when a mystery plunges them into an unexpected journey.\n\n**Director:**\n\nDougal Wilson\n\n**Writers:**\n\nMark Burton, Jon Foster, James Lamont\n\n**Cast:**\n\n* Hugh Bonneville as Henry Brown\n* Emily Mortimer as Mary Brown\n* Ben Whishaw as Paddington\n* Imelda Staunton as Aunt Lucy\n* Oliver Maltman as Photo Booth Voice\n* Joel Fry as Joe the Postman\n\n**Rotten Tomatoes:** [93%](https://www.rottentomatoes.com/m/paddington_in_peru)\n\n**Metacritic:** [64](https://www.metacritic.com/movie/paddington-in-peru/)\n\n**VOD:** Theaters",
        "upvotes": 88,
        "comments": 63,
        "media": null,
        "permalink": "/r/movies/comments/1ip0uph/official_discussion_paddington_in_peru_spoilers/"
    },
    {
        "id": "1ipbb4b",
        "author": "Thewhatnow5678",
        "title": "What movie is too big for the small screen?",
        "content": "Is there a movie, that you\na) never watched on the small screen after seeing it in theatres or) watched it on small screen but feel like you missed that grand feeling of theater?\n\nFor me it's Blade Runner 2049 and the new Dune movies. Saw all of them twice in cinemas, I'll probably skip the watch on a TV entirety. The soundscape, the scope in general... It doesn't translate to small. ",
        "upvotes": 11,
        "comments": 135,
        "media": null,
        "permalink": "/r/movies/comments/1ipbb4b/what_movie_is_too_big_for_the_small_screen/"
    },
    {
        "id": "1ipadxm",
        "author": "eganba",
        "title": "Movies you can no longer watch after having kids",
        "content": "Growing up I was big into scary movies and thrillers. Blood and gore did not really bother me much despite jump scares never really being my jam. Recently I had a kid and during his long naps I’ve started watching some favorites of mine. I really enjoyed Doctor Sleep when it originally came out a few years back and so I started watching that film this past week. When it got to THAT scene (if you’ve seen it you know what I’m referring to) and while I was impressed with everything about it the first couple times; watching it now with a kid made it so I had to turn it off. \n\nWhat other films are now unwatchable for you due to having kids? Just trying to avoid putting my brain through that again haha ",
        "upvotes": 11,
        "comments": 121,
        "media": null,
        "permalink": "/r/movies/comments/1ipadxm/movies_you_can_no_longer_watch_after_having_kids/"
    },
    {
        "id": "1iokotg",
        "author": "NoCulture3505",
        "title": "‘Flow’ Will Join the Criterion Collection Later This Year with 4K Special Edition",
        "content": "",
        "upvotes": 664,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tfNetlxbsNALQddg3La8eB1kS6fcFLaHrtgVh9es8Uo.jpg?auto=webp&amp;s=73f098564d05fa52531b4bdbabb80e5dce61da17"
        },
        "permalink": "/r/movies/comments/1iokotg/flow_will_join_the_criterion_collection_later/"
    },
    {
        "id": "1ior43w",
        "author": "Due_Smoke7453",
        "title": "Day of the Fight Trailer (2025) | Michael C. Pitt, Steve Buscemi, Ron Perlman, Joe Pesci",
        "content": "I love the look of this. Great cast too.",
        "upvotes": 291,
        "comments": 82,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/avmbXLKJPn6CVzeDj5hjOggoPLTFvf-RwGZJZZtv5MM.jpg?auto=webp&amp;s=078cf3051cb036ab84e0ba0c6bef4820a0166a10"
        },
        "permalink": "/r/movies/comments/1ior43w/day_of_the_fight_trailer_2025_michael_c_pitt/"
    },
    {
        "id": "1ipetov",
        "author": "RemLezar64_",
        "title": "There's a very obvious tell right at the beginning of the Coen Brothers Barton Fink that confirms he's in hell",
        "content": "This is my favorite Coen Brothers movie. I find it endlessly entertaining.\n\nAnd I know this interpretation is common but on rewatching I noticed this dialogue at the very beginning when he arrives at the hotel:\n\n\n&gt;Barton: 6 please. \n\n&gt;Elevator man: Next stop, 6. \n\n&gt;Elevator man: This stop, 6.\n\n666\n\nThat is definitely not coincidence.\n\nThoughts?",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1ipetov/theres_a_very_obvious_tell_right_at_the_beginning/"
    },
    {
        "id": "1iomrg4",
        "author": "Comic_Book_Reader",
        "title": "O'DESSA | Official Trailer | Searchlight Pictures",
        "content": "",
        "upvotes": 444,
        "comments": 144,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kNtVfSPhvlOMljLSctuWtZiCEffVjh27BZYwa9vJngU.jpg?auto=webp&amp;s=62186659dfe8b023e290c79480b135ef49e361d6"
        },
        "permalink": "/r/movies/comments/1iomrg4/odessa_official_trailer_searchlight_pictures/"
    },
    {
        "id": "1ip5488",
        "author": "CR41G3R7",
        "title": "Movies where the main character has to stay awake?",
        "content": "Really odd recommendation to ask, but I'm looking for movies where the main character has to stay awake because there is some problem one after another that keeps coming up preventing them from sleeping. \n\nI'm looking for more of an action/adventure compared to say horror (e.g. where someone is tortured) or other genre. Sort of in the same vein as \"Crank\". Can you think of anything like this? Thanks in advance!",
        "upvotes": 23,
        "comments": 138,
        "media": null,
        "permalink": "/r/movies/comments/1ip5488/movies_where_the_main_character_has_to_stay_awake/"
    },
    {
        "id": "1ioubsg",
        "author": "BunyipPouch",
        "title": "First Poster for Documentary 'Thank You Very Much' - A look at the all-too-short life and career of enigmatic comedy legend Andy Kaufman, including never-before-seen footage and intimate interviews with friends, colleagues and family members.",
        "content": "",
        "upvotes": 138,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qg3u11o17zie1.jpeg?auto=webp&amp;s=89137213d4c475e55b20729d054949e3868c9c9b"
        },
        "permalink": "/r/movies/comments/1ioubsg/first_poster_for_documentary_thank_you_very_much/"
    },
    {
        "id": "1ipcumg",
        "author": "Tetrah111",
        "title": "90's movies with a dark grungy industrial aesthetic",
        "content": "Recently I've rewatched City of Lost Children (last time having been almost 15 years ago), and I was struck by its aesthetics. It shows up in several lists of steampunk movies, but there's just something else, this grunge and industrial look was present even on non-steampunk media during the 90's and now that I'm older and that particular aesthetic isn't the norm anymore, it's starting to stick out and fascinate me.\n\nIt's very present on games from that era, that much I know for sure, with their overly designed frames for menus with lots of wires and weird tubes, like MDK, Garage: Bad Dream, Planescape, I Have No Mouth and I Must Scream and I think, even more impressively in Baroque, which I believe summarizes this feeling of being inside an old, rusty and oppressive machine. Myst or the Longest Journey had machinery or places kinda resembling that, Silent Hill too, of course, etc.\n\nThis is present in some other movies, but not as a whole thing like in CoLC. Like some brief locations in Existenz, The Cell, Darkcity maybe? Jacob's Ladder definitely.\n\nThe point of all this is that I'm looking for more movies like this. Sorry for the long introduction haha",
        "upvotes": 6,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1ipcumg/90s_movies_with_a_dark_grungy_industrial_aesthetic/"
    },
    {
        "id": "1iosjtx",
        "author": "FeagueMaster",
        "title": "Movie characters that best depict Narcissistic Personality Disorder",
        "content": "Anyone have suggestions for movies with characters that most realistically depict this? I found the mother in Beau Is Afraid did that very well, along with the shitty boyfriend in Midsommar. It seems Ari Aster has good insights into the psychological condition!\n\nThe series (not a movie though) \"Apple Cider Vinegar\" that dramatizes the health influencer Belle Gibson also does a great job in this.",
        "upvotes": 152,
        "comments": 350,
        "media": null,
        "permalink": "/r/movies/comments/1iosjtx/movie_characters_that_best_depict_narcissistic/"
    }
]