[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 112,
        "comments": 353,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mqlr42",
        "author": "BlackDoom_26",
        "title": "What is the most underrated show you have found on Netflix?",
        "content": "Sometimes I stumble upon a show I have never heard of before and end up loving it way more than I expected. I am curious if anyone else has had this experience. What is the most underrated show you have discovered on Netflix that more people should watch?",
        "upvotes": 265,
        "comments": 650,
        "media": null,
        "permalink": "/r/netflix/comments/1mqlr42/what_is_the_most_underrated_show_you_have_found/"
    },
    {
        "id": "1mqun5q",
        "author": "Sweaty-Toe-6211",
        "title": "‘STRANGER THINGS’ creators The Duffer Brothers are negotiating leaving Netflix to join Paramount Pictures.",
        "content": "",
        "upvotes": 16,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mqun5q/stranger_things_creators_the_duffer_brothers_are/"
    },
    {
        "id": "1mqpbpq",
        "author": "Oxjrnine",
        "title": "What’s with all the hate for Sirens?",
        "content": "Just binged the miniseries and I haven’t enjoyed and been surprised by a show this much in years.\n\nI thought the premise was going to be literal and it wasn’t.\n\nI thought the characters were going to be cliched but they weren’t.\n\nAnd the best part — no one is a hero or a villain.  And how everyone ends up can be either amazing or tragic (spoilers)\nKiki can easily get a copy of that photo. And being with Pete was unhealthy. Did she really isolate him from his kids or did he use her as a scapegoat.\nSimone might actually be in love with Pete because Ethan was still alive if she just wanted security.  Was revenge a motivation or was her behaviour just doing what Kikki taught her?\nDevon has absolutely no idea how to feel but she has started to stop hating herself. \n\nNone of the characters actions happen in a vacuum so every time I thought I was going to put a character in the good or bad column the story forced me to put them in the human category.",
        "upvotes": 18,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mqpbpq/whats_with_all_the_hate_for_sirens/"
    },
    {
        "id": "1mq9ah7",
        "author": "Karma_Moon84",
        "title": "Household",
        "content": "This is Beyond the pale. I have had Netflix since I got DVDs in the mail. I put up with rate hikes and kicked my family off as they left the house and made them get new accounts. Guess what. They never did. Not worth the cost. \n\nNow I am the only active profile and I take care of my father full time. He doesn't live in my home. I will start watching something at home but want to finish it at his house less than a mile from my house but to far to reach my WiFi. At first they said Are you traveling?  OK sure here's a code. But now they want me feel threatened and pay an Extra $7.99 a month to CONTINUE WATCHING WHERE I LEFT OFF.\n\n  Its beyond obvious that I am the same person. And that I'm bouncing between the same 2 physical locations. I shouldn't be forced to go through and entire \"Household location change/update\" twice a day everyday. \n\nI'm 99% sure I got a warning screen about password sharing from HBO max the other day, with a note that basically conveys don't worry this time though beacuse we can tell it's you by your viewing habits. \n\nGet it together Netflix. It's not that hard. I'm sure you have the technology to tell I haven't giving half the planet my password. You just wanna squeeze more out of me to pad your bottom line for share holders. \n\nSHAME ON YOU!",
        "upvotes": 102,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1mq9ah7/household/"
    },
    {
        "id": "1mqrpyl",
        "author": "skyeshere",
        "title": "The wrong people won Perfect Match",
        "content": "This may be an unpopular opinion as SO many people love to hate on Madison - but I wholeheartedly believe her and Freddie were the only people who deserved to win (Rachel and Ray a close second). They were the only people there who seemed to genuinely care about one another and not have any wandering eyes, even when Freddie left the house Madison stayed loyal. \n\nAD and Ollie were not perfect due to Ollie’s gross actions which definitely would have gone further if not being babysat by AD at the ‘boys day’. Despite them still being together, on the show alone I don't think they deserved it. Louis and Sandy were also terrible for obvious reasons and Daniel was showing early abusive behaviours towards poor Lucy - I genuinely have NO idea how they won or how people on that show saw that relationship going anywhere. \n\nBut my point stands, Madison and Freddie had the strongest connection - yes, including her ‘crying’ when Freddie went on his date. Crying is not always manipulation. She wasn't being treated well in the house by the others thanks to Cody’s smear campaign on her, and being upset when someone you like is sent on a date is valid. I almost stopped watching after they lost that final ‘competition’ and was kicked out of the running to win. Such a disappointment. ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mqrpyl/the_wrong_people_won_perfect_match/"
    },
    {
        "id": "1mqtvsj",
        "author": "Captain-jack-hobie77",
        "title": "Fit for tv",
        "content": "I am so excited for this to come out!! It says it will be released today but it isn’t available. I’m in EST in the United States  - does anyone know the standard time that Netflix releases programming? Anyone else as excited for this as I am? I LOVED the biggest loser growing up- it was actually horrible &amp; had no idea. Poor people. ",
        "upvotes": 3,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1mqtvsj/fit_for_tv/"
    },
    {
        "id": "1mqqtca",
        "author": "mrkinkybilly",
        "title": "Just watched, train wreck poop cruise",
        "content": "Just watched poop cruise. A true story of a cruise ship which had a fire onboard and it lost all power and was drifting in the Gulf of Mexico. The toilets stop working as a result. I felt sorry for the passengers but I also found this funny to watch and kept laughing at it",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1mqqtca/just_watched_train_wreck_poop_cruise/"
    },
    {
        "id": "1mr253w",
        "author": "WhatAboutK",
        "title": "4k two monitors issue Windows 11",
        "content": "Hi everyone\n\nI have able to make Netflix app and Edge in Windows 11 provide 4k and HDR content.\n\nThe only issue I have to disconnect my older monitor which is 2k and dose not support HDR and HDCP 2.2.\n\nThe moment I connect the older monitor, everything will be back to HD only, not even HDR.\n\nIs there anyway keep the monitor connected and stream 4k on the primary monitor?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mr253w/4k_two_monitors_issue_windows_11/"
    },
    {
        "id": "1mr19vl",
        "author": "YungVal94",
        "title": "Critical: between Life and Death OWEEE BABBBYYY",
        "content": "Hands down one of the best docuseries I have ever watched. I loved the rawness of it. They didn't sugar coat. I literally cried every episode (probably cause I'm crybaby), but I really wish it was more episodes. And I really hope they come out with a season 2 because this show was wonderful! lowkey made me want to change my profession. How did you guys like the show??",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mr19vl/critical_between_life_and_death_oweee_babbbyyy/"
    },
    {
        "id": "1mr046m",
        "author": "andrestrujillopulido",
        "title": "Una vida honrada (2025)",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mr046m/una_vida_honrada_2025/"
    },
    {
        "id": "1mpug6s",
        "author": "KnitAndKnitAndKnit",
        "title": "I am baffled by how poorly Wednesday seems to be written. Does it get better?",
        "content": "I am on Episode 4 of Season 1. Please no plot spoilers other than whether it gets better in your opinion or not.\n\n\nI really wanted to like it but I cannot get over how bad the writing is. I think it's a mixture of two things:\n\n\n1) It's very clearly a show for children, written with plenty of those comedic gags that only children find funny. This is in contrast to the way that Stranger Things was technically for children but managed to appeal to adults too, by avoiding really non-adult humour. Example from Wednesday: a character puking all of a sudden in someone's face. I can totally see a 8 year old finding this hilarious. Which is fair, but I thought it was also a show that adults would enjoy.\n\n2) The writers assume the viewer is either really dumb or has no memory, with the amount of repeating main facts/plot points in a very unnatural way. A lot of past plot is spelled out by the characters telling each other what happend (where they clearly know) so they the viewer can know, rather than what would be more natural, to imply it for the viewer to figure out.\n\nExample A (paraphrasing, but basically how it went down): Two characters meet after the years. \nCharacter 1: Remember when we met years ago\nCharacter 2: Yes I hid in the coffin during the funeral but I couldn't get out.\nCharacter 1: I found you and saved you in time.\n\nI mean, nobody talks like that about an event they both participated in.\n\n\nExample B.\n\nThere is this school ball called \"The Raven\" which characters talk about going to, from time to time.\nThen cut to a scene of a big ballroom and the school headmistress welcoming the guests saying \"Welcome to this year's raven!\"\nLike who talks like that?\nImagine showing up to your office Christmas party and the organiser saying \"Welcome to this year's Christmas party!\"\nIt's such a weird thing to say. Firstly, it's OBVIOUSLY \"this year's\" since it's happening now. Secondly everyone knows what party it is, that's why we came here.\n\nAdditionally, the characters *constantly* talk to themselves aloud when alone in rooms, to explain what they are thinking of what they are going to do. \n\nLike ok, sometimes people talk to themselves but in this show every character does it in every scene they are alone. It is sooo weird and unnatural",
        "upvotes": 262,
        "comments": 186,
        "media": null,
        "permalink": "/r/netflix/comments/1mpug6s/i_am_baffled_by_how_poorly_wednesday_seems_to_be/"
    },
    {
        "id": "1mqnhqe",
        "author": "Common-Pear4056",
        "title": "Dept Q(uestions, I have questions!)",
        "content": "Just finishing the last episode of Dept Q, but this is driving me crazy:\n\nIn her initial meeting with Sam (whom we later learn is really Lyle), Merritt makes some comment about how Sam doesn’t have an online presence. He says something about how he keeps his private life private. I took that exchange to mean Merritt had tried to look Sam up but didn’t find anything. But this would have been right after Sam died and Lyle assumed his identity, so in reality Merritt would have seen all kinds of articles covering Sam’s death in that case, right? ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mqnhqe/dept_questions_i_have_questions/"
    },
    {
        "id": "1mqx1b3",
        "author": "thedevegon",
        "title": "Is there any reason for Netflix for dividing seasons into parts?",
        "content": "I don't watch a lot of Netflix specifically but I decided to check out the new Wednesday season and there's a random 1 month gap between the episodes.  \n They did this with arcane but it worked cuz it had a three act structure, this just feels random and annoying.",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1mqx1b3/is_there_any_reason_for_netflix_for_dividing/"
    },
    {
        "id": "1mq5qnd",
        "author": "Catcatdogdays",
        "title": "The Residence",
        "content": "Bring back Cordelia Cupp!!! \n\nPlease 🙏 \n\nSo disappointed this show was canceled. This show was so entertaining and even received Emmy nominations, how could they let it go? We need more shows like this. ",
        "upvotes": 20,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mq5qnd/the_residence/"
    },
    {
        "id": "1mpn1ci",
        "author": "a_san_38",
        "title": "Netflix just quietly hiked its subscription prices up again",
        "content": "",
        "upvotes": 286,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1mpn1ci/netflix_just_quietly_hiked_its_subscription/"
    },
    {
        "id": "1mqrae4",
        "author": "Initial-Estimate-356",
        "title": "Did anyone's Perfect Match or Love is Blind just disappear?",
        "content": "Just logged in to my account and some shows that haven't been cancelled and are still going have just disappeared. The entire series just vanished despite being there last night.\n\nHas anyone had this happen to them?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mqrae4/did_anyones_perfect_match_or_love_is_blind_just/"
    },
    {
        "id": "1mq4fav",
        "author": "wewewawa",
        "title": "Netflix is cutting off older Fire TV devices in a few days - how to see if you're affected",
        "content": "",
        "upvotes": 17,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mq4fav/netflix_is_cutting_off_older_fire_tv_devices_in_a/"
    },
    {
        "id": "1mr1obx",
        "author": "Longjumping_Land_977",
        "title": "Key fact about the cruise ship actually proves there’s ‘no way’ Amy Bradley fell overboard",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mr1obx/key_fact_about_the_cruise_ship_actually_proves/"
    },
    {
        "id": "1mqcz4e",
        "author": "Dramatic_Pea4045",
        "title": "Recommendations",
        "content": "Recently, I started rewatching some Netflix shows I had first seen when I was 12 years old (I'm 20 now). Among them are Stranger Things, The end of the fucking world and 13 Reasons Why.\n\nBack then, they were the kind of shows\n\neveryone in my class was talking about, but to be honest, I didn't really enjoy them that much. Now, with a more adult perspective, I find them pretty good.\n\nSo, I'd like to ask for some recommendations of \"classic\" Netflix series-the kind everyone has heard of and probably watched. Usually, I watch animated shows like BoJack Horseman, South Park, and so on, but this time I'm looking for live-action series instead. Thanks in advance!\n\n(Here a list of what I already watched ; Squid game, Girl from nowhere, All of us are dead, Sex education, Big mouth, La casa de papel, Elite, Orange is the new black, Alice in borderland, Baby reindeer, ...)",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mqcz4e/recommendations/"
    },
    {
        "id": "1mq5bms",
        "author": "chrisabraham",
        "title": "Netflix Says It 'More Than Doubled' TV Upfront Commitments: the streamer finalized deals with all major holding companies and independent agencies in the upfront",
        "content": "# Netflix Says It 'More Than Doubled' TV Upfront Commitments \n\n# The streamer finalized deals with all major holding companies and independent agencies in the upfront\n\n[](https://www.adweek.com/contributor/saleah-blancaflor/)By [Saleah Blancaflor](https://www.adweek.com/contributor/saleah-blancaflor/)[](https://www.adweek.com/convergent-tv/netflix-doubled-tv-upfront-commitments/?utm_source=Iterable&amp;utm_medium=email&amp;utm_campaign=campaign_14595664_ADWEEK_Alert_250814&amp;lctg=720ac5a8-d270-4198-9f4a-11d737991e3d)[](https://www.adweek.com/convergent-tv/netflix-doubled-tv-upfront-commitments/?utm_source=Iterable&amp;utm_medium=email&amp;utm_campaign=campaign_14595664_ADWEEK_Alert_250814&amp;lctg=720ac5a8-d270-4198-9f4a-11d737991e3d)[](https://www.adweek.com/convergent-tv/netflix-doubled-tv-upfront-commitments/?utm_source=Iterable&amp;utm_medium=email&amp;utm_campaign=campaign_14595664_ADWEEK_Alert_250814&amp;lctg=720ac5a8-d270-4198-9f4a-11d737991e3d)[](https://www.adweek.com/convergent-tv/netflix-doubled-tv-upfront-commitments/?utm_source=Iterable&amp;utm_medium=email&amp;utm_campaign=campaign_14595664_ADWEEK_Alert_250814&amp;lctg=720ac5a8-d270-4198-9f4a-11d737991e3d)[](https://www.adweek.com/convergent-tv/netflix-doubled-tv-upfront-commitments/?utm_source=Iterable&amp;utm_medium=email&amp;utm_campaign=campaign_14595664_ADWEEK_Alert_250814&amp;lctg=720ac5a8-d270-4198-9f4a-11d737991e3d)[](https://www.adweek.com/convergent-tv/netflix-doubled-tv-upfront-commitments/?utm_source=Iterable&amp;utm_medium=email&amp;utm_campaign=campaign_14595664_ADWEEK_Alert_250814&amp;lctg=720ac5a8-d270-4198-9f4a-11d737991e3d)[](https://www.adweek.com/convergent-tv/netflix-doubled-tv-upfront-commitments/?utm_source=Iterable&amp;utm_medium=email&amp;utm_campaign=campaign_14595664_ADWEEK_Alert_250814&amp;lctg=720ac5a8-d270-4198-9f4a-11d737991e3d)[](https://www.adweek.com/convergent-tv/netflix-doubled-tv-upfront-commitments/?utm_source=Iterable&amp;utm_medium=email&amp;utm_campaign=campaign_14595664_ADWEEK_Alert_250814&amp;lctg=720ac5a8-d270-4198-9f4a-11d737991e3d)[](https://www.adweek.com/convergent-tv/netflix-doubled-tv-upfront-commitments/?utm_source=Iterable&amp;utm_medium=email&amp;utm_campaign=campaign_14595664_ADWEEK_Alert_250814&amp;lctg=720ac5a8-d270-4198-9f4a-11d737991e3d)[](https://www.adweek.com/convergent-tv/netflix-doubled-tv-upfront-commitments/?utm_source=Iterable&amp;utm_medium=email&amp;utm_campaign=campaign_14595664_ADWEEK_Alert_250814&amp;lctg=720ac5a8-d270-4198-9f4a-11d737991e3d)[](https://www.adweek.com/convergent-tv/netflix-doubled-tv-upfront-commitments/?utm_source=Iterable&amp;utm_medium=email&amp;utm_campaign=campaign_14595664_ADWEEK_Alert_250814&amp;lctg=720ac5a8-d270-4198-9f4a-11d737991e3d)[](https://www.adweek.com/convergent-tv/netflix-doubled-tv-upfront-commitments/?utm_source=Iterable&amp;utm_medium=email&amp;utm_campaign=campaign_14595664_ADWEEK_Alert_250814&amp;lctg=720ac5a8-d270-4198-9f4a-11d737991e3d)[](https://www.adweek.com/convergent-tv/netflix-doubled-tv-upfront-commitments/?utm_source=Iterable&amp;utm_medium=email&amp;utm_campaign=campaign_14595664_ADWEEK_Alert_250814&amp;lctg=720ac5a8-d270-4198-9f4a-11d737991e3d)[](mailto:?subject=Netflix%20Says%20It%20%E2%80%98More%20Than%20Doubled%E2%80%99%20TV%20Upfront%20Commitments&amp;body=I%20thought%20you%20would%20be%20interested%20in%20this%20from%20Adweek.com...%0A%0ANetflix%20Says%20It%20%E2%80%98More%20Than%20Doubled%E2%80%99%20TV%20Upfront%20Commitments%3A%0Ahttps%3A%2F%2Fadweek.it%2F4mG5Sfx&amp;utm_source=email&amp;utm_medium=awshare)[](mailto:?subject=Netflix%20Says%20It%20%E2%80%98More%20Than%20Doubled%E2%80%99%20TV%20Upfront%20Commitments&amp;body=I%20thought%20you%20would%20be%20interested%20in%20this%20from%20Adweek.com...%0A%0ANetflix%20Says%20It%20%E2%80%98More%20Than%20Doubled%E2%80%99%20TV%20Upfront%20Commitments%3A%0Ahttps%3A%2F%2Fadweek.it%2F4mG5Sfx&amp;utm_source=email&amp;utm_medium=awshare)[](mailto:?subject=Netflix%20Says%20It%20%E2%80%98More%20Than%20Doubled%E2%80%99%20TV%20Upfront%20Commitments&amp;body=I%20thought%20you%20would%20be%20interested%20in%20this%20from%20Adweek.com...%0A%0ANetflix%20Says%20It%20%E2%80%98More%20Than%20Doubled%E2%80%99%20TV%20Upfront%20Commitments%3A%0Ahttps%3A%2F%2Fadweek.it%2F4mG5Sfx&amp;utm_source=email&amp;utm_medium=awshare)[](mailto:?subject=Netflix%20Says%20It%20%E2%80%98More%20Than%20Doubled%E2%80%99%20TV%20Upfront%20Commitments&amp;body=I%20thought%20you%20would%20be%20interested%20in%20this%20from%20Adweek.com...%0A%0ANetflix%20Says%20It%20%E2%80%98More%20Than%20Doubled%E2%80%99%20TV%20Upfront%20Commitments%3A%0Ahttps%3A%2F%2Fadweek.it%2F4mG5Sfx&amp;utm_source=email&amp;utm_medium=awshare)\n\nTudum! Netflix has officially wrapped up its [upfront](https://www.adweek.com/category/tv-upfronts/) discussions, closing its third annual TV upfront talks.\n\nAmy Reinhard, the company’s ads president, announced the news, saying the streamer “more than doubled” its overall commitments, which was in line with its expectations; saw year-over-year growth across categories such as retail, CPG, health and wellness, entertainment, and tech; and finalized deals with all major holding companies and independent agencies.\n\nRegarding its offerings, the streamer’s ads leader said clients were looking forward to live programming, including WWE Raw, with Netflix partnering with DoorDash as the presenting sponsor for the new season. Meanwhile, the streamer sold out all in-game inventory for its upcoming [NFL Christmas Day games](https://www.adweek.com/convergent-tv/netflix-pitch-to-advertisers-nfl-christmas-games/), closing partnerships with Accenture, FanDuel, Google, and Verizon for in-game and broadcast features. \n\nAccording to the company, advertisers were also excited about its upcoming content slate, which includes the final season of Stranger Things as well as new seasons of Bridgerton, Emily in Paris, Nobody Wants This, and Running Point. Netflix has also secured partners for its upcoming new programming, including an untitled Will Ferrell golf series.\n\nIn addition, Reinhard noted that clients were interested in new features from Netflix Ads Suite, which were originally [announced in May](https://www.adweek.com/convergent-tv/netflix-adtech-upfront-partnerships/), and include enhanced data capabilities, expanded buying and measurement solutions, and new creative formats.\n\nAt the end of July, Netflix [announced its programmatic integration with Yahoo DSP](https://www.adweek.com/convergent-tv/netflix-expands-ad-buying-access-yahoo-dsp/), which will be available to clients globally in October, and expanded its programmatic measurement with iSpot in the United States, now offering attribution measurement along with reach and frequency.\n\nThe streamer is also planning to expand its international measurement partnerships, having secured its first partner in APAC with Australia’s OzTAM. The streamer said it’s the first global streaming service to have its audience measured and reported by the company. Netflix also integrated with Kantar IBOPE Media in Brazil to validate campaign audiences, offering advertisers enhanced insights into individual reach and cross-media effectiveness.\n\nMeanwhile, on the targeting front, Netflix expanded its language targeting to support eight languages across its ad-supported countries, expanding from English and Spanish to French, German, Italian, Japanese, Korean, and Portuguese.\n\n“We are committed to building a long-lasting ads business that not only drives impactful return on investment for our clients but also offers an entertaining and relevant experience for our members around the world,” Reinhard said in a statement. “As we head into our third year of business this fall, we can’t wait to continue to deliver a must-buy opportunity with leading technology centered around our must-watch Netflix series, films, and live events.”\n\nWith the news, Netflix joins other companies like [NBCUniversal](https://www.adweek.com/convergent-tv/nbcu-close-upfront-highest-ad-sales-volume-ever/), [Fox](https://www.adweek.com/convergent-tv/fox-wraps-upfront-2-billion-sports-properties/), [Disney](https://www.adweek.com/convergent-tv/disney-upfront-has-growth-in-sports-and-streaming-overall-volume-consistent/), and [TelevisaUnivision](https://www.adweek.com/convergent-tv/televisaunivision-upfront-historic-digital-growth/) in closing its upfront talks for the 2025-2026 cycle. Similar to other publishers, Netflix did not disclose total volume or whether CPMs (cost to reach 1,000 viewers) increased or declined.\n\n[Netflix Says It Will ‘Roughly Double Ads Revenue’ This Year With ‘Nearly Complete’ Upfront](https://www.adweek.com/convergent-tv/netflix-nearly-complete-upfront-secures-double-ads-revenue/)\n\nThe upfront closing comes not long after Netflix reported its Q2 earnings, where executives noted that the company was on track to double its ads revenue in 2025.\n\nAt its [upfront event in May](https://www.adweek.com/convergent-tv/netflix-adtech-upfront-partnerships/), the streaming giant announced several adtech advancements, more robust branded partnerships, and said its ad tier reaches 94 million monthly active users globally.\n\nAmid upfront conversations, Netflix made a significant leadership move, with [Julie DeTraglia, vp, ads measurement strategy, exiting the company](https://www.adweek.com/convergent-tv/netflix-vp-of-ad-measurement-julia-detraglia-exits-streamer/). DeTraglia [joined the company](https://www.adweek.com/convergent-tv/netflix-builds-up-advertising-team-days-before-new-avod-tier-launches/) in 2022 ahead of Netflix’s ad tier launch, spearheading global measurement strategies to help build and develop the streamer’s ads business, including its verification partnership with DoubleVerify and Integral Ad Science.\n\nDuring its last upfront, the streamer also had a leadership shakeup, with [Peter Naylor, Netflix’s former vp of ad sales](https://www.adweek.com/convergent-tv/netflix-ad-sales-vp-peter-naylor-exits/), exiting in July 2024.\n\n# [Saleah Blancaflor](https://www.adweek.com/contributor/saleah-blancaflor/)\n\nSaleah Blancaflor is a TV reporter at ADWEEK.\n\n[@saleyley](https://twitter.com/saleyley)| [saleah.blancaflor@adweek.com](mailto:saleah.blancaflor@adweek.com)",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mq5bms/netflix_says_it_more_than_doubled_tv_upfront/"
    },
    {
        "id": "1mqob7h",
        "author": "ElfQuester1",
        "title": "Screw \"household plan\" policy",
        "content": "Im so pissed. So ive had netflix for **years** but now I cant even use it because I travel sometimes? I dont care about any of their \"password sharing\" concerns. This isnt what I agreed to when I started paying for this service. Its ridiculous. Ive been using this device for netflix FOR YEARS. There is no way they can find a way to track that and understand it's clearly me. Its so money hungry. Aww did the big billionaire business get sad because they werent upcharging us enough? Ugh im so annoyed. It does it to my phones too! Wtf",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mqob7h/screw_household_plan_policy/"
    },
    {
        "id": "1mpy10q",
        "author": "Sweaty-Toe-6211",
        "title": "‘Wednesday’ Storms Back Atop Netflix Weekly TV Charts With Season 2; ‘Kpop Demon Hunters’ Rises To No. 2 On Most Popular Film List",
        "content": "",
        "upvotes": 22,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mpy10q/wednesday_storms_back_atop_netflix_weekly_tv/"
    },
    {
        "id": "1mq9y3h",
        "author": "florida_yacht_chef",
        "title": "What are some shows similar to the Hunting Wives??",
        "content": "I loved the mix of mystery, drama and scandal. I am craving something with that same addictive, twist filled vibe. I have watched the Perfect Couple and it was nice too. \n\nAny recommendations?? ",
        "upvotes": 4,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1mq9y3h/what_are_some_shows_similar_to_the_hunting_wives/"
    },
    {
        "id": "1mqmbh9",
        "author": "bigdaddy0993",
        "title": "How to change NetFlix subtitles font color?",
        "content": "As the title says, I am wondering if anyone know how to change the font color? I am watching Asian TV series and the subtitles are white in color which blends into light colored backgrounds(And BTW most of the scenes in Asian TV series have light background) and I don't know what the characters are talking about. Is there a way for us to change the font color to something else?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mqmbh9/how_to_change_netflix_subtitles_font_color/"
    },
    {
        "id": "1mqdkyp",
        "author": "NeighborhoodNo8903",
        "title": "UK The Walking Dead?",
        "content": "i genuinely think im tripping??? is it me or did netflix add TWD for a few days and take it off \n\ni saw it just the other day and thought “ooh that’ll be lovely to sit and watch for a whole weekend to see how far i get in” so i add it to my list for said weekend and it’s been a matter of days and it’s gone????\n\nam i imagining this? mixing up my streaming services? if this did happen does anyone know why?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mqdkyp/uk_the_walking_dead/"
    },
    {
        "id": "1mq6ebf",
        "author": "ToonAdventure",
        "title": "Adam Scott Among Cast For Netflix Adult Animated Series 'Strip Law'",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mq6ebf/adam_scott_among_cast_for_netflix_adult_animated/"
    },
    {
        "id": "1mqju3o",
        "author": "Plus-Version-1408",
        "title": "Ragnarok Staffelfinal der 3ten",
        "content": "„Spoileralarm“ falls du das Ende nicht kennst lies nicht weiter.\n\n\nKönnen wir mal bitte darüber reden wie sie die Serie beenden!! \nIch fühle mich grade als wär ich wahnsinnig geworden und als ob ich die letzten 8std nicht richtig aufgepasst hätte.\nDie wollen mir doch nicht ernsthaft verklickern dass er die ganze Zeit nur ein Sprung in der Schüssel hatte. Ich meine, ja, dass hat er aber noch so einen. Fluch der zwei Schwestern ist da ein Witz gegen.\n\nWie zum Beispiel sind die zwei Wanderer oder die Assistentin von Fjor gestorben wenn es nicht wegen der Riesen Schlange war?\n \nIch habe jetzt zu viele Fragen dank diesem Ende in meinem Kopf und eine 4 Staffel wird es sicher nicht geben. Ich hätte in der Folge vorher aufhören sollen zu gucken.\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mqju3o/ragnarok_staffelfinal_der_3ten/"
    },
    {
        "id": "1mq0qf9",
        "author": "Jealous-Researcher77",
        "title": "Only German and Japanese Audio",
        "content": "I live in the Netherlands and for a very popular/mainstream anime (Spy X) or even any anime. I can only select German/Japanese audio or subtitles (I have gone to my profile and selected English,Uk and other languages but it dtill doesnt work. Been having this problem for a year now. Can anyone please help?\n\nNotes:\nTried on phone and web\nLogged in and out\nMoved from South Africa to Netherlands\nThis happens to all anime ",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mq0qf9/only_german_and_japanese_audio/"
    },
    {
        "id": "1mphy2a",
        "author": "asir777",
        "title": "Just watched Adolescence",
        "content": "It was one of the best shows I have seen recently.  In the beginning I felt bad for Jamie thought maybe it was bullying that pushed him to the edge but then I saw the detective’s son who was also bullied but didn’t choose to go to a self destructive path like Jamie. Third episode made me realize that u can’t feel bad for Jamie he has no remorse for what he did and clearly has issues. I feel bad for Jamie’s family the most however especially the dad last episode I almost cried and I am a grown man. I do however think if the dad took more interest in his art and encouraged him and made him feel comfortable about himself he wudnt go down this path same with the mum as well they shudnt had been so hands off. The Detective realized this and started to spend more time with Adam which would help him in the long term.",
        "upvotes": 133,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1mphy2a/just_watched_adolescence/"
    },
    {
        "id": "1mq6ued",
        "author": "ToonAdventure",
        "title": "Genndy Tartakovsky Talks 16-Yr Jounrey On R-Rated Animated Movie Fixed",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mq6ued/genndy_tartakovsky_talks_16yr_jounrey_on_rrated/"
    }
]