[
    {
        "id": "1k56e6v",
        "author": "HuntingDaze",
        "title": "Hi /r/movies! We are Nahéma Ricci (lead actress), Annick Blanc (director/writer) &amp; Maria Gracia Turgeon (producer) of HUNTING DAZE, a Canadian thriller that premiered at SXSW in 2024. A stranded young woman joins a group of hunters at a remote cabin, threatening the group's balance. Ask us anything!",
        "content": "More information:\n\nNina, a young, tempestuous woman, finds herself stranded in the far North. She convinces five men on a bachelor hunting trip, to put her up for a few days. In this masculine microsociety, by turns hilarious and philosophical, Nina starts to feel a sense of belonging she never has before. But a mysterious stranger’s arrival changes the course of this improvised holiday forever. Both raw and dreamlike, Hunting Daze offers up a unique universe where humour, horror, the uncanny, and the sensual combine.\n\nOur film played at SXSW, Fantasia, Sydney FF, KVFF, and more in 2024. It's out now in the US and Canada on Digital.\n\nTrailer:\n\n[https://www.youtube.com/watch?v=O66TVAcpeFM](https://www.youtube.com/watch?v=O66TVAcpeFM)\n\nNahéma was also the star of 2019's \\*\\*Antigone\\*\\* from French-Canadian director Sophie Deraspe, which won five Canadian Screen Awards (and TIFF's Best Canadian Film Award) and was submited to the Oscars as Canada's Best International Feature Film choice.\n\nMaria was twice-nominated for an Oscar for Best Live Action Short Film (\\*\\*Fauve\\*\\* in 2019 and \\*\\*Brotherhood\\*\\* in 2020, both from Canada).\n\nThis is Annick's feature directorial debut.\n\nWe will be back at 4 PM ET today (Tuesday 4/22) to answer your questions. Ask us anything!\n\n",
        "upvotes": 26,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/d3rm59260ewe1.png?auto=webp&amp;s=6941c135f5447b968eddd37ae5d4ea8d60f160e1"
        },
        "permalink": "/r/movies/comments/1k56e6v/hi_rmovies_we_are_nahéma_ricci_lead_actress/"
    },
    {
        "id": "1k33sz5",
        "author": "SonyPictures",
        "title": "Hey everyone - Peter Stormare here. My upcoming movie, UNTIL DAWN, is out in theatres on April 25th. I'll be back this upcoming Tuesday, April 22nd at 9:30 AM PT to answer your questions about Until Dawn and anything else you might want to know. Ask me anything.",
        "content": "[ I'm looking forward to chatting with you about my upcoming movie UNTIL DAWN, which is in theatres on April 25th. Join me on r\\/movies this upcoming Tuesday, April 22nd from 9:30am PT-10:30am PT as I answer your questions about Until Dawn and anything else you might want to know.](https://preview.redd.it/132fqamd6uve1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=041be0644f759a3eb6c103e45b6ae0070d98170c)\n\n",
        "upvotes": 218,
        "comments": 165,
        "media": null,
        "permalink": "/r/movies/comments/1k33sz5/hey_everyone_peter_stormare_here_my_upcoming/"
    },
    {
        "id": "1k5656q",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Deep Cover' - Three improv actors (Bryce Dallas Howard, Orlando Bloom &amp; Nick Mohammed) are hired by the police to help stage low-level stings. Their instinct to ‘always say yes’ without breaking character leads them deep inside the London criminal underworld.",
        "content": "",
        "upvotes": 2414,
        "comments": 259,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/x2bbg5590ewe1.jpeg?auto=webp&amp;s=885587fc6a77b928f90e3e5396011cfd22207506"
        },
        "permalink": "/r/movies/comments/1k5656q/official_poster_for_deep_cover_three_improv/"
    },
    {
        "id": "1k58g7o",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Wes Anderson's 'THE PHOENICIAN SCHEME'",
        "content": "",
        "upvotes": 1505,
        "comments": 154,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wrnp1kd5iewe1.jpeg?auto=webp&amp;s=32b2b6a56890abe79f5cfad01f2c34716b5defeb"
        },
        "permalink": "/r/movies/comments/1k58g7o/official_poster_for_wes_andersons_the_phoenician/"
    },
    {
        "id": "1k4kcs2",
        "author": "MarvelsGrantMan136",
        "title": "New Oscars Rule: If You Don’t See All the Nominated Films, You Can’t Vote",
        "content": "",
        "upvotes": 46276,
        "comments": 1739,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cmKiQRTdAG60tRvxu0TW4Zn5IR8liBQippjgcfwwgPc.jpg?auto=webp&amp;s=e95db0c42e5f8436321569a5f64684c0a748dfb9"
        },
        "permalink": "/r/movies/comments/1k4kcs2/new_oscars_rule_if_you_dont_see_all_the_nominated/"
    },
    {
        "id": "1k54e5s",
        "author": "Bluntfeedback",
        "title": "A24-ification",
        "content": "\nJust finished my A24 weekend marathon (wrapped up with Everything Everywhere All At Once, Talk to Me, and Civil War) and I'm struck again by how consistently this studio has managed to dominate cultural conversations around film for the past decade.\n\nWhat started as an indie darling has become a full-on cultural phenomenon - to the point where \"it's an A24 film\" has become shorthand for a certain aesthetic and quality expectation. They've somehow managed to bridge the gap between critical acclaim and cult following in a way that feels unique in today's fragmented media landscape.\n\nTheir formula seems deceptively simple: find distinctive directorial voices, give them creative freedom, market the films with striking visuals and minimal exposition, and let word-of-mouth do the rest. But the consistency is remarkable.\n\nWhat I find most interesting is how they've become a trusted brand for younger audiences who might otherwise be disengaged from non-franchise cinema. The way their films spread through TikTok and social media feels different from traditional film marketing.\n\nDo you think any other studio has matched their cultural impact in recent years? ",
        "upvotes": 473,
        "comments": 138,
        "media": null,
        "permalink": "/r/movies/comments/1k54e5s/a24ification/"
    },
    {
        "id": "1k58bkh",
        "author": "IlkaBird",
        "title": "I'm So Sick of Trailers Ruining Movies",
        "content": "As the title says. I read an article about the upcoming movie Sinners, detailing the soundtrack and its production. I knew nothing of the film, so I quickly jumped over to look at the trailer. THERE IS A HUGE PLOT SPOILER in the trailer, and absolutely ruins the mystery of the film. Why are studios doing this? Do they think the viewing audience will skip the film if they don't lay out the whole thing in the trailer?",
        "upvotes": 218,
        "comments": 170,
        "media": null,
        "permalink": "/r/movies/comments/1k58bkh/im_so_sick_of_trailers_ruining_movies/"
    },
    {
        "id": "1k57se1",
        "author": "FilmWaffle-FilmForum",
        "title": "Movie endings where no one “wins”",
        "content": "Most movies have the typical hero vs villain trend where one “wins” and the other “loses”. What movies have endings with no clear winner. I feel like most revenge movies fit into this category, I Saw the Devil is the first one that comes to mind considering he basically tuned into a villain himself. \n\nWhat other movies can you think of? ",
        "upvotes": 120,
        "comments": 452,
        "media": null,
        "permalink": "/r/movies/comments/1k57se1/movie_endings_where_no_one_wins/"
    },
    {
        "id": "1k4py8m",
        "author": "MarvelsGrantMan136",
        "title": "Michael Bay And Sydney Sweeney Team On Adaptation Of Popular Video Game ‘Outrun’ At Universal",
        "content": "",
        "upvotes": 1758,
        "comments": 625,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LjlhvZawGZDImQXpD7456GCxN2LkloecT1izi8VQZK4.jpg?auto=webp&amp;s=c4de118cfe12f90df650e01a4007899cc5e19e46"
        },
        "permalink": "/r/movies/comments/1k4py8m/michael_bay_and_sydney_sweeney_team_on_adaptation/"
    },
    {
        "id": "1k53klu",
        "author": "Sisiwakanamaru",
        "title": "'Heartstopper' To End With Finale Movie On Netflix In Lieu Of Season 4",
        "content": "",
        "upvotes": 136,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oX3U-Iv7iGFBy4lfNiIFMaBWVh5KIY4I8FDMQKof6Bc.jpg?auto=webp&amp;s=d9319b779f6d35b67c9e262c5778bdd003bac6da"
        },
        "permalink": "/r/movies/comments/1k53klu/heartstopper_to_end_with_finale_movie_on_netflix/"
    },
    {
        "id": "1k58icv",
        "author": "NoCulture3505",
        "title": "Mountainhead | Official Teaser | Max",
        "content": "",
        "upvotes": 60,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LJgFdtuXQiedRv6ZQijlN5M8kdzkPaKIG5EBzSDBojU.jpg?auto=webp&amp;s=5b245b4ac80194bb3192753311a1433ec148ca18"
        },
        "permalink": "/r/movies/comments/1k58icv/mountainhead_official_teaser_max/"
    },
    {
        "id": "1k550cx",
        "author": "MarvelsGrantMan136",
        "title": "‘Enola Holmes 3’ Begins Production; Millie Bobby Brown, Henry Cavill, Louis Partridge and More Returning",
        "content": "",
        "upvotes": 95,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yThzmKiWInxRKI3vvT0z2ql_Qavke-xWi-oj5wIPSuQ.jpg?auto=webp&amp;s=5bcc890392762fdecf497f21f84167b374519b66"
        },
        "permalink": "/r/movies/comments/1k550cx/enola_holmes_3_begins_production_millie_bobby/"
    },
    {
        "id": "1k55pih",
        "author": "NoCulture3505",
        "title": "I KNOW WHAT YOU DID LAST SUMMER - Official Trailer (HD)",
        "content": "",
        "upvotes": 73,
        "comments": 134,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/F-rFAlzV460QqEuL_kGgQr5RZwfojm-m5VNsMXhL6Ns.jpg?auto=webp&amp;s=9ce0a0746961b25ed8a4afc6b0fc456440c200f5"
        },
        "permalink": "/r/movies/comments/1k55pih/i_know_what_you_did_last_summer_official_trailer/"
    },
    {
        "id": "1k55hxq",
        "author": "These_Feed_2616",
        "title": "Malcolm McDowell should’ve became an A lister",
        "content": "Malcolm McDowell is a legend, but for some reason, he never became a household name. He really has had a long career and he was fantastic in A Clockwork Orange, If, Caligula etc. he was even really good as Dr. Loomis in the Rob Zombie Halloween movies even if the movies themselves weren’t the greatest. But he mostly does a lot of obscure and low budget films. He really could’ve been up there with the all timers, he should’ve had a much bigger career in my opinion",
        "upvotes": 64,
        "comments": 62,
        "media": null,
        "permalink": "/r/movies/comments/1k55hxq/malcolm_mcdowell_shouldve_became_an_a_lister/"
    },
    {
        "id": "1k56rbg",
        "author": "AccomplishedYak411",
        "title": "What’s a movie quote that really stuck with you?",
        "content": "For me, it’s “The things you own end up owning you.” from Fight Club (1999).  \nIt hits different every time I hear it.\n\nFight Club is one of my all-time favorite movies. It’s full of strange philosophies that may sound silly at first, but they reveal something deeply true. These days, we can hardly live without smartphones or the internet — they’re practically owning us.  \nWhenever I take a break from them, I feel a sense of real freedom.  \nBut don’t worry, I’m not looking to punch anyone in a basement like in Fight Club!",
        "upvotes": 50,
        "comments": 113,
        "media": null,
        "permalink": "/r/movies/comments/1k56rbg/whats_a_movie_quote_that_really_stuck_with_you/"
    },
    {
        "id": "1k4kwxu",
        "author": "MarvelsGrantMan136",
        "title": "Ernie Hudson Taking Over Carl Weathers’ Voice Role Of Combat Carl In ‘Toy Story 5’",
        "content": "",
        "upvotes": 1691,
        "comments": 97,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2U10McmSjJZCou9utUa2THFQcUagvzQdJeukkiB0dLw.jpg?auto=webp&amp;s=e5a9e9e5782c6a749865eb9138e573ead4a4a730"
        },
        "permalink": "/r/movies/comments/1k4kwxu/ernie_hudson_taking_over_carl_weathers_voice_role/"
    },
    {
        "id": "1k55u1w",
        "author": "Wonder-Lad-2Mad",
        "title": "I just finished Lupin III: The Castle of Cagliostro (1979)...wow. just WOW. Hayao Miyazaki was THAT good from the begining. This just became one of my favourite heist movies",
        "content": "I randomly decided to give this a watch. I've heard this is Hayao Miyazaki's first feature film and his directorial debut. It's still a couple years before studio Ghibli was established. Oh this blew my mind on multiple levels.\n\n\nThis was also my first Lupin The Third experience. I...I don't know how I've lived my life so far without having ever experienced the Lupin series. I'm hooked bro. I'm so hooooked. I'm gonna go out of my way and watch a couple more Lupin III movies after this. This was my first introduction to the Lupin cast and I'm already deeply in love with them and feeling nostalgic. Lupin, Jigen, Goemon, Fujiko, Zenigata. Brilliant characters.\n\n\n\nThis is 70's anime. When animation was still colored flat. And this movie still looks like a masterpiece. The background art is so gorgeous and lovely.\n\n\nCagliostro feels so green and lush and cozy. Which is a classic Miyzaki trademark. The aesthetuc choices for the enviorment deisgn is just magnificent.\n\n\nI understand this is also more Miyazaki and less Lupin The Third as far as characterization and story goes. A bit more lighthearted and whimsical than how classic Lupin is. I personally had no complaints about that at all. I think it plays well into the character.",
        "upvotes": 46,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1k55u1w/i_just_finished_lupin_iii_the_castle_of/"
    },
    {
        "id": "1k58x00",
        "author": "NoCulture3505",
        "title": "‘Mammoth’ and ‘An Invisible Sign’ Actress Sophie Nyweide Has Passed Away",
        "content": "",
        "upvotes": 27,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/arot6TqhcVF8nyHG3oNVgADXZ7y421A3ypmfegyBmPM.jpg?auto=webp&amp;s=6d1fcd13e1c404e028d118ca9c5f9b718929ed13"
        },
        "permalink": "/r/movies/comments/1k58x00/mammoth_and_an_invisible_sign_actress_sophie/"
    },
    {
        "id": "1k4sfzb",
        "author": "letsgopablo",
        "title": "Free Solo (2018) is NERVE-WRACKING",
        "content": "Quite possibly the most nail-biting, edge-of-your-seat documentary I've ever watched in my life. My palms were sweaty for like, 90% of the runtime. The way each climb is shot by the filmmakers Jimmy Chin and Elizabeth Vasarhelyi can only be described as epic. The grand scale of Alex Honnold's achievement is presented perfectly by the camera work, from the wide angle shots that frame him dwarfed by the massive wall of death he's climbing, to the tight close-ups of his fingers and feet digging into the rock face. It doubles as both an account of a monumental feat in rock climbing and human endurance, and a character profile about the kind of person that is willing to put his life on the line in the pursuit of perfection. Alex comes across as equally fucking crazy and inspiring. God bless his wife, she's the real hero for having the patience and compassion to deal with this guy's insanity. Highly recommend this if you haven't seen it, definitely worth the watch.",
        "upvotes": 434,
        "comments": 97,
        "media": null,
        "permalink": "/r/movies/comments/1k4sfzb/free_solo_2018_is_nervewracking/"
    },
    {
        "id": "1k4o61c",
        "author": "SanderSo47",
        "title": "April 18-20 Box Office Recap: 'Sinners' opens with a fantastic $48 million domestically, making it the best opening for a live-action original film in years. Meanwhile, 'A Minecraft Movie' crosses $700 million worldwide.",
        "content": "https://preview.redd.it/ve54b1yp29we1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=d66d93333fd7c823d8b731a79eebfac3bfbba7ad\n\nOn Easter weekend, audiences decided to go watch ***Sinners***. The result? A #1 debut, and the biggest debut for an original film in the post-COVID era. While ***A Minecraft Movie*** had to cede the top spot, it's already over $700 million worldwide.\n\nThe Top 10 earned a combined $127.9 million this weekend. That's up a massive 109.7% from last year, when ***Civil War*** held the top spot from disappointing newcomers like ***Abigail*** and ***The Ministry of Ungentlemanly Warfare***.\n\nDebuting atop, Ryan Coogler's ***Sinners*** earned a fantastic $48 million in 3,308 theaters. This is the best debut for Coogler's career outside the ***Black Panther*** films. In fact, it's the biggest debut for a live-action original film in the post-COVID climate, opening above ***Nope*** ($44.3 million).\n\nSimply put, it's a fantastic start. Take into account, getting an original film to open this high is a miracle, given that audiences are pivoting to focusing on franchises. It's a testament to the strength of Ryan Coogler and Michael B. Jordan. So how they did succeed where other original films failed?\n\nFor the past decade, Coogler has earned some great good will, thanks to his works in films like ***Creed*** and ***Black Panther***. The films have earned fantastic reception, allowing him to finally get an original title like ***Sinners*** to get greenlit. It wasn't easy, obviously; a big reason why some studios turned it down was Coogler's request to have the film rights revert to him after 25 years. So Warner Bros. took the bullet and agreed to his terms, [a decision that apparently scared a lot of Hollywood executives.](https://www.vulture.com/article/to-hollywood-the-scariest-part-of-sinners-is-ryan-coogler.html)\n\nThe film's clear selling point was Coogler and Jordan, but the premise was also very important: a 1930s horror film, with Jordan playing twins. 2025 has been very weak for horror; the biggest horror film is ***The Monkey***, which hasn't even topped $70 million worldwide. The audience was starving for a horror film and ***Sinners*** arrived at the right time to offer just that. The film's fantastic reviews cannot be ignored either; it's sitting at a marvelous 98% on Rotten Tomatoes and 84/100 on Metacritic. That makes it one of the best films of the year, so even non-horror fans wanted to see if the film would live up to the hype.\n\nAccording to Warner Bros., the biggest demos were black (49%), Caucasians (27%), Hispanic and Latino (14%), and Asian (6%). They gave it an incredible \"A\" on CinemaScore. This makes it one of the few horror films to get an \"A\" on the site (***Poltergeist*** and ***Aliens*** are the other two) in its 46-year-old history. Yes, it's insanely hard for a horror film to get this grade.\n\nWhat does this mean? That the film is gonna have some damn great legs. It's already seen in the weekend; horror films can drop over 40% on Sunday, yet ***Sinners*** dropped just 25%. With no horror competition till ***Final Destination: Bloodlines***, ***Sinners*** can have a lot of space. For now, we're predicting a $170 million domestic total for the film, which is simply fantastic all around.\n\n***A Minecraft Movie*** dropped 48% this weekend, grossing $40.4 million. That's not a bad drop, but it's still rough just like last week's. The film is not collapsing, but it's not showing great legs either. The film has amassed $343.8 million so far, and it should still hit over $450 million domestically. \n\nUnsurprisingly, ***The King of Kings*** benefitted from the Easter weekend. It dipped just 9%, earning $17.5 million this weekend. That's one of the best holds for a film playing at over 3,000 theaters. Through 10 days, the film has earned $45.6 million, although with the holiday over, maybe it will have a steep drop next weekend.\n\n20th Century Studios' ***The Amateur*** was hit by the arrival of ***Sinners***. It dropped a rough 53%, earning $7 million this weekend. While the film was aiming an old audience that doesn't go to opening weekend, it looks like the film is struggling to leg out. Through 10 days, the film has earned a weak $27.1 million, and it remains a question mark if it will hit $40 million domestically.\n\nIn fifth place, A24's ***Warfare*** dipped 42%, adding $4.8 million this weekend. Through 10 days, the film has earned $17.1 million, and it will probably end its run with around $25 million domestically.\n\nUniversal/Blumhouse's ***Drop*** added $3.2 million this weekend, which is a poor 55% drop after its already low start. Despite positive reviews and word of mouth, the audience doesn't appear to be interested in the film. Through 10 days, it has earned just $13.4 million, and it's now guaranteed to miss $20 million domestically, making it one of Blumhouse's lowest grossing titles.\n\n***COLORFUL STAGE! The Movie: A Miku Who Can’t Sing*** managed to sneak into the seventh spot, despite playing in just 800 theaters, earning $2.8 million this weekend.\n\nFocus Features' re-release of ***Pride &amp; Prejudice*** earned $2.8 million in 1,393 theaters. That takes its lifetime total to $41.3 million.\n\n***The Chosen: Last Supper — Part 3*** collapsed 75% this weekend, earning just $1.5 million this weekend. Through all 3 installments, the show has made $42.9 million so far.\n\nRounding up the Top 10 was Disney's ***Snow White***, which is nearing the end of its run. It had another brutal 58% drop, earning just $1.2 million this weekend. The film's domestic total stands at a poor $84.6 million so far.\n\nBleecker Street released ***The Wedding Banquet*** in 1,142 theaters, although the film earned just $922,906. That means that the film is gonna make less than what Ang Lee's original made back in 1993 ($6.9 million).\n\nBut the real worst performer of the week was Briarcliff's animated film ***Sneaks***. Despite playing in 1,500 theaters, the film earned an abysmal $530,786 this weekend. That's one of the worst debuts for a film playing in over 1,000 theaters. Expect this to fade quickly.\n\nAhead of its wide release this week, A24's ***The Legend of Ochi*** debuted in 4 theaters, earning $52,514. That's a $13,129 per-theater average, which is quite low (usually buzzy titles like this make $25K or more). Let's just hope it can do better when it hits wide release.\n\nJanus Films also released David Cronenberg's ***The Shrouds*** in 3 theaters, where the film earned $49,361. Alos a low $16,454 per-theater average. It will continue expanding in the coming weeks.\n\n#**OVERSEAS**\n\n***A Minecraft Movie*** earned $59 million overseas, taking its worldwide total to $720 million. The best markets are the UK ($59.2M), Germany ($27.8M), Australia ($27.4M), Mexico ($24.8M) and China ($24M). The billion mark is becoming more and more likely, pals.\n\n***Sinners*** earned $15.4 million in 71 markets, taking its worldwide numbers to $63.5 million. The best debuts were in the UK ($3.2M), France ($2M), Mexico ($1.1M), Germany ($898K) and Australia ($842K). An okay start, but it's pretty clear it's gonna lean heavily on the domestic side.\n\n***The Amateur*** added a further $11.6 million this weekend, for a $63.8 million worldwide total. The best markets are the UK ($4.1M), France ($3.3M), Mexico ($3.2M), Japan ($2.3M) and Spain ($2M). At the very least, it should hit $100 million worldwide. That'd be great if it didn't cost $60 million.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Dog Man* | Jan/31 | Universal | $36,001,940 | $97,970,355 | $140,534,355 | $40M\n\n- DreamWorks' ***Dog Man*** has ended its run with $97 million domestically and $140 million worldwide. Definitely a success, given it cost just $40 million. But something weird about the film are its legs. Normally, animated films leg out to a 3x multiplier. But ***Dog Man*** finished with just a 2.72x multiplier, making it one of the most front-loaded animated films. While the Super Bowl impacted its second weekend, not hitting the $100 million milestone after its debut is kinda disappointing. But then again, this should be enough if DreamWorks wants a new franchise.\n\n#**THIS WEEKEND**\n\nWe've got three wide releases, though it's unlikely any of them can take the top spot.\n\nThe closest that could challenge the top spot is Amazon MGM's ***The Accountant 2***, which brings back Ben Affleck, Jon Bernthal, Cynthia Addai-Robinson, and J. K. Simmons in their roles. The original film earned $155 million worldwide, and has been a huge success in streaming and home media, so a sequel was pretty much imminent. Although the 9-year gap raises concerns that they might have waited too long.\n\nAnother release is Sony's ***Until Dawn***, an adaptation of the video game. Director David F. Sandberg has had success in the horror field, and in fairness, the movie tries to change things up from the game. Nevertheless, the film's premise (a time loop involving different killers) suggests it pretty much abandoned the game's original plot. It remains to be seen if the fans will be willing to buy a ticket.\n\nAnd as mentioned, A24's ***The Legend of Ochi*** is hitting wide release. The limited release numbers were quite underwhelming, but perhaps it could surprise when it hits wide release.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 688,
        "comments": 111,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/INU4HbZtF13F77xKBrA7EXM3ghda1jdBFgWni3VG1EI.png?auto=webp&amp;s=a746808332b8b7877d66c9188411044498aea617"
        },
        "permalink": "/r/movies/comments/1k4o61c/april_1820_box_office_recap_sinners_opens_with_a/"
    },
    {
        "id": "1k4k0ur",
        "author": "MarvelsGrantMan136",
        "title": "‘Ready or Not: Here I Come’ Adds Sarah Michelle Gellar, Elijah Wood and More as Searchlight Sequel Starts Production",
        "content": "",
        "upvotes": 1038,
        "comments": 126,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jnCQIGdsKEpzMAwEr-jTANl5r14yrbua1BnWtYr-UaA.jpg?auto=webp&amp;s=16fdc769793b2c3f642eea2493b610c9657b4b40"
        },
        "permalink": "/r/movies/comments/1k4k0ur/ready_or_not_here_i_come_adds_sarah_michelle/"
    },
    {
        "id": "1k568cp",
        "author": "MissingLink101",
        "title": "What are some examples of good movies which share a name but are completely unrelated to each other?",
        "content": "This came to mind as I watched Hush (2008), a British Hitcher-esque horror, the other night but have previously also enjoyed Hush (2016), Mike Flanagan's home invasion horror film.\n\nAnother pairing that came to mind were The Hunt (2016), the Danish small-town drama starring Mads Mikkelsen, and The Hunt (2020), the darkly comedic film starring Betty Gilpin (which didn't get much attention at the time due to getting shifted around due to real-world events/politics, but I loved it!).\n\nI know there are likely a lot of low budget or bad movies that share name with more acclaimed ones, and of course franchise reboots etc, but what pairing can you think of which are both good in their own right but completely unrelated?",
        "upvotes": 31,
        "comments": 67,
        "media": null,
        "permalink": "/r/movies/comments/1k568cp/what_are_some_examples_of_good_movies_which_share/"
    },
    {
        "id": "1k56l2d",
        "author": "Chocobodude",
        "title": "Jurassic World Rebirth to be  scored by Alexandre Desplat",
        "content": "",
        "upvotes": 26,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6faVBFWAQIeTSt20yYR0zJhB1U4bX4XoPIlJgMmDYVQ.jpg?auto=webp&amp;s=bec04d70f01a22fc0774a8d1550d635e78d5ec11"
        },
        "permalink": "/r/movies/comments/1k56l2d/jurassic_world_rebirth_to_be_scored_by_alexandre/"
    },
    {
        "id": "1k4gzgb",
        "author": "cruelsummerbummer",
        "title": "Weapons | Teaser",
        "content": "",
        "upvotes": 1431,
        "comments": 300,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/d0jpE60recb7ladjZGPmzpGfhiC3Z_CUcxE-8CmK3TE.jpg?auto=webp&amp;s=596c4516c3309855c4ecc76a2c56546281f521b6"
        },
        "permalink": "/r/movies/comments/1k4gzgb/weapons_teaser/"
    },
    {
        "id": "1k4dndi",
        "author": "indiewire",
        "title": "'Sinners' Packs in Lots of Irish Music, Ryan Coogler Explains",
        "content": "",
        "upvotes": 1450,
        "comments": 166,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-WRxuEXw0yGXZbLfKzWkMuCNmxKRMW0EKAG8S-SOuJU.jpg?auto=webp&amp;s=143bb5eeb21faa5231cf8bc05750ff29b323acfe"
        },
        "permalink": "/r/movies/comments/1k4dndi/sinners_packs_in_lots_of_irish_music_ryan_coogler/"
    },
    {
        "id": "1k4wtwl",
        "author": "dcterr",
        "title": "Dave",
        "content": "I just watched Dave tonight for about the 10th time. I love this movie! Not only is it a superbly acted comedy, but I think it also makes the very good point that anyone with a good heart could make a great president, which is what I think we need now more than ever! I also like how Dave was able to get all the right people on his side against the evil Secretary of Arms and ends up falling in love with the former First Lady. Hey, it could happen!",
        "upvotes": 84,
        "comments": 54,
        "media": null,
        "permalink": "/r/movies/comments/1k4wtwl/dave/"
    },
    {
        "id": "1k4l65c",
        "author": "KillerCroc1234567",
        "title": "‘Succession’ Star Alan Ruck Joins Horror-Thriller ‘Corporate Retreat’",
        "content": "",
        "upvotes": 349,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L1vwNJUmgzPGzLvvoKWYT34qlH3KouLSDVeumhqivt0.jpg?auto=webp&amp;s=1f0362e95553e49e28a511ad6a5c1b82e179b081"
        },
        "permalink": "/r/movies/comments/1k4l65c/succession_star_alan_ruck_joins_horrorthriller/"
    },
    {
        "id": "1k4ez4h",
        "author": "JazzlikeTea7432",
        "title": "Remember when Tom Hanks who made a great transition from successful comedy films to a big bunch of drama films. Which other actors who started off comedy made a big jump to a dramatic actor?",
        "content": "Tom Hanks in his beginning run in Hollywood had a bunch of comedy films success like Splash 1984, even one of the film with Dan Aykroyd released in 1987 I can't remember the name of it, Big 1988, Turner and Hoach 1989, The Burbs 1989, A league of their own 1992 and others. But until he did Philadelphia 1993 he became a dramatic actor and even he did Forrest Gump afterwards he had a great transition.\n\nBut which other actors who started out comedy then became a dramatic actor just like Tom Hanks did the jump from a goofy actor to serious actor well any suggestions about this?",
        "upvotes": 723,
        "comments": 778,
        "media": null,
        "permalink": "/r/movies/comments/1k4ez4h/remember_when_tom_hanks_who_made_a_great/"
    },
    {
        "id": "1k4t6l9",
        "author": "BunyipPouch",
        "title": "Announcement - Our AMA/Q&amp;A with Peter Stormare ('Fargo', 'Constantine', The Big Lebowski', 'Prison Break, 'Until Dawn', 'Armageddon', 'Bad Boys 2', 'John Wick 2') is now live and Peter will be back on Tuesday 4/22 at 12:30 PM ET to answer your questions.",
        "content": "",
        "upvotes": 110,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qbfpfvr76awe1.png?auto=webp&amp;s=792224d042124960f874ce57b53c7d8cfd2f2417"
        },
        "permalink": "/r/movies/comments/1k4t6l9/announcement_our_amaqa_with_peter_stormare_fargo/"
    },
    {
        "id": "1k4fcox",
        "author": "RomanReignsDaBigDawg",
        "title": "Miles Caton and Ludwig Göransson perform \"I Lied to You\" from Sinners",
        "content": "",
        "upvotes": 560,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ObQqxYcXYkCxvx7C4cP1Ytisr6YBUy9apPj2XiLQse4.jpg?auto=webp&amp;s=8f6e9850f46f04da89e678793975878deec1e350"
        },
        "permalink": "/r/movies/comments/1k4fcox/miles_caton_and_ludwig_göransson_perform_i_lied/"
    },
    {
        "id": "1k58zht",
        "author": "KillerCroc1234567",
        "title": "Focus Features Sets Christmas Day 2025 Release For ‘Song Sung Blue’ From Davis Entertainment As Stars Hugh Jackman &amp; Kate Hudson Reveal First Image",
        "content": "",
        "upvotes": 7,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EHhAqy74n1LqLEuArurhWMuADrCLxhaVrJ7LSzBkmtM.jpg?auto=webp&amp;s=aaeef1d5ba387a664936d39feda96befe2181594"
        },
        "permalink": "/r/movies/comments/1k58zht/focus_features_sets_christmas_day_2025_release/"
    },
    {
        "id": "1k4hf0z",
        "author": "chewychubacca",
        "title": "Summer Camp movies to get an 11 year old boy excited about sleepaway summer camp?",
        "content": "All I know about are movies from the 80s and 90s. I'm looking for something more modern, to help excite an ADHD kid about what fun possibilities there are at a sleepaway summer camp. Doesn't have to be particularly realistic, just something that gives an exciting vibe to get a kid over the hump of \"no, i'll hate it\", to \"maybe that will be fun, let's try it\". ",
        "upvotes": 383,
        "comments": 664,
        "media": null,
        "permalink": "/r/movies/comments/1k4hf0z/summer_camp_movies_to_get_an_11_year_old_boy/"
    }
]