[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 40,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q8z5px",
        "author": "Deadpool-fan-466",
        "title": "What was the point of casting Linda Hamilton in Stranger things S05?",
        "content": "When I first found out about it, I thought it's gonna be interesting. Either she's gonna be an important character, or Netflix wants star power (as usual) to hype up the final season.\n\nThen it became as bland as it could be: She's the new \"Papa\", trying to restore \"the program\". She even does exactly what was shown in the trailer, shooting at Eleven &amp; co.\n\nI know that being Sarah Connor in those 2 terminator movies is the only career highlight of her, but being in Stranger things doesn't change much either (for her &amp; the show)",
        "upvotes": 543,
        "comments": 125,
        "media": null,
        "permalink": "/r/netflix/comments/1q8z5px/what_was_the_point_of_casting_linda_hamilton_in/"
    },
    {
        "id": "1q935t3",
        "author": "intelerks",
        "title": "Netflix pushes 'Wednesday' to 2027 as 'Bridgerton', 'One Piece', and 'The Witcher' line up for 2026",
        "content": "",
        "upvotes": 28,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q935t3/netflix_pushes_wednesday_to_2027_as_bridgerton/"
    },
    {
        "id": "1q98hpp",
        "author": "OkCartographer4028",
        "title": "Just finished watching “Homeland”, now I don’t know what do with myself",
        "content": "I just finished watching Homeland and it’s honestly the best show I’ve seen in years. I looked forward to returning home everyday to continue watching it, I even stayed home at weekends to chill and enjoy the show. Captivating 8 seasons. Now it’s ended, I’m so sad. I can’t stop thinking about it, now I don’t know what to watch. \n\nCan someone recommend similar shows? Something as captivating ",
        "upvotes": 14,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1q98hpp/just_finished_watching_homeland_now_i_dont_know/"
    },
    {
        "id": "1q8c7eq",
        "author": "GiveMeSomeSunshine3",
        "title": "‘Black Mirror’ Renewed For Season 8 At Netflix",
        "content": "",
        "upvotes": 1137,
        "comments": 92,
        "media": null,
        "permalink": "/r/netflix/comments/1q8c7eq/black_mirror_renewed_for_season_8_at_netflix/"
    },
    {
        "id": "1q91d49",
        "author": "abitworndown",
        "title": "Netflix double subtitles",
        "content": "This is driving me crazy. I have toggled subtitles off and on but nothing seems to fix the issue. If there are english subtitles built into a show or movie, even with subtitles off Netflix adds their own subtitles and puts them on top of the built in subtitles. I wanted to add a picture of the issue but I dont think this subreddit allows it. \n\nI can see that the subtitle option is obviously turned off since the subtitles only happen when a language other than English is spoken. Its impossible to read what's on the screen which can affect the plot of what I'm watching. I've tried to find solutions but haven't had any luck. \n\nhttps://imgur.com/a/4W8QtEo",
        "upvotes": 12,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1q91d49/netflix_double_subtitles/"
    },
    {
        "id": "1q8hpk0",
        "author": "FunRealistic7609",
        "title": "Scrolling Netflix for 30 mins. Still haven't picked anything",
        "content": "Please suggest a really good show or movie that’s genuinely worth watching. Any genre works drama, romance, thriller, comedy, or even something underrated that surprised you. I’m in the mood to binge or just relax and enjoy a good story. Drop your best Netflix recommendations and save me from endless scrolling.",
        "upvotes": 175,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/1q8hpk0/scrolling_netflix_for_30_mins_still_havent_picked/"
    },
    {
        "id": "1q8svwg",
        "author": "FluidModeNetwork",
        "title": "Isn't netflix wrong about stranger things?",
        "content": "if dustin, will, lucas, max, and mike all started high school in 1985, how did they graduate in 1987? Wasn't there 3 and a half years that passed in season 5 alone?\n\nWhy is netflix's merch say graduating class of 87?",
        "upvotes": 38,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1q8svwg/isnt_netflix_wrong_about_stranger_things/"
    },
    {
        "id": "1q8yyqs",
        "author": "Unable-Youth",
        "title": "His &amp; Hers Had Potential",
        "content": "Spoiler Alert below.\n\nThis show had a lot of potential but was problematic and had loose ends:\n\n1. What’s the story with Anna’s tooth at the beginning and end? Does not serve a purpose.\n2. Why did Zoe hate Anna, if Anna was the rape victim? Zoe gives Anna the finger in one episode, and then she tries to warn Jack towards the end that “Anna isn’t who you think she is…”\n3. No explanation of why they were all friends then stopped being friends when they all seemed to watch Anna’s rape\n4. Why did Zoe stop being friends with Helen and Rachel if she was complicit in the rape?\n5. Why was Catherine trying to get back at Anna when it was Anna that was raped? What was with all the “murder” supplies she got Richard to buy\n6. Jack said Alice showed signs of dementia during the year Anna left. Was she premeditating that far in advance?\n\nFinally, how am I supposed to believe an old woman is capable of pulling off gruesome murders that require lots of physical strength as noted in one episode… I mean 40 stab wounds? Also, how did she get the friendship bracelets? Did Anna have them in her box I.e do we assume they all gave them back to her?\n\nWhat was the side story about the blackmail In Rachel’s phone when it came to their weird shit with Duffie?\n\nLazy ending and the show had more potential.",
        "upvotes": 10,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1q8yyqs/his_hers_had_potential/"
    },
    {
        "id": "1q8lcdu",
        "author": "AltruisticAide9776",
        "title": "The people we meet on vacation movie was so without depth and even without romance ?",
        "content": "I'm starting to feel like romance only works in tv shows not in movies when there is not a hint of mystery/unpredictability. In tv shows the characters gets time to develop their own characters as well as a connection with each other , in movies there just isn't that time. Look at how interesting the romance felt in heated rivalry compared to people we meet on vacation, heck even Emily in Paris romance arks are better though people are tired of them now.\n\nThis movie while watchable was just not it, there just wasn't really a reason as to why they did not get together earlier . I feel like friends to lovers works only in tv shows, like that is why so many people were shipping Harry and Hermione ( well that is a series of films/books but you get the point ).\n\nThe only redeeming quality was Poppy speaking honestly with Sarah and apologizing for her closeness with Alex.\n\nI don't get why Alex was pissed at Poppy for not I guess being more forward with her feelings when um he has a girlfriend and even got engaged to her after they had an emotional moment the previous night ? Like isn't that him running away and not wanting to acknowledge he feelings for Poppy and he is accusing her of running away?\n\nThe ending where Poppy was like \" home is where you re with your person \" was soo juvenile .\n\n  \nEdit : I know I said the \" only redeeming quality was Poppy speaking honestly with Sarah and apologizing for her closeness with Alex but really it was for Alex to have those boundaries , he was the one engaged to Sarah after all , why is it Poppy the one to apologise. ",
        "upvotes": 41,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1q8lcdu/the_people_we_meet_on_vacation_movie_was_so/"
    },
    {
        "id": "1q95gv1",
        "author": "The_Girl_1985",
        "title": "Runaway - sound of silence - artist?",
        "content": "Does anyone know who sang the song \"sound of silence\" in the episode 4 of the show \"Run away\"? \n\n  \nI'm loving it but I can't find it anywhere. Any help will be appreciated!",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1q95gv1/runaway_sound_of_silence_artist/"
    },
    {
        "id": "1q97n3a",
        "author": "Strange_Light5219",
        "title": "Why Netflix?",
        "content": "Just finished watching Lockwood &amp; co and found out the show's not being renewed for season 2. \n\nI can definitely say it's one of the hidden gems and a nice thriller. It should have gotten more attention than it received as it is also has \"mostly liked\" tag.",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1q97n3a/why_netflix/"
    },
    {
        "id": "1q96x1s",
        "author": "Low-Collection3307",
        "title": "Looking for thriller show :)",
        "content": "Hey !!\n\nI would like some recommendation on shows to watch.\n\nRecently I loved :\n\nThe Beast In Me\nApple Cider Vinegar\nAdolescence\nInventing Anna\nDon’t fuck with cats (doc) \n\nThank you 🙏 ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q96x1s/looking_for_thriller_show/"
    },
    {
        "id": "1q96bjp",
        "author": "ronfromsacramento",
        "title": "What do you think about these random choices of judges for the next \"Star Search\" reboot?",
        "content": "# Jelly Roll, Sarah Michelle Gellar and Chrissy Teigen Join Netflix’s ‘Star Search’ Reboot as Judges\n\nJelly Roll, Sarah Michelle Gellar and Chrissy Teigen have joined Netflix’s upcoming “Star Search” revival as judges, the streamer announced Tuesday.\n\nJelly Roll, Gellar and Teigen will be on hand as “Star Search” premieres live on Netflix on Jan. 20. The new edition of the talent competition series will be hosted by Anthony Anderson. The five-week event will feature new episodes on Tuesdays and Wednesdays at 9 p.m. ET/ 6 p.m. PT, with real-time voting via TV remote or mobile app.\n\n[Jelly Roll, Sarah Michelle Gellar and Chrissy Teigen Join Netflix’s ‘Star Search’ Reboot as Judges](https://www.yahoo.com/entertainment/tv/articles/jelly-roll-sarah-michelle-gellar-180000064.html?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuYmluZy5jb20v&amp;guce_referrer_sig=AQAAAJxCl9TtY0gWpwuH1-QI9wZcgHby_Z5WreelOA2g6OG13NaER4gSZyc11j2aQG6sMSX9ejTahHxdg1k-Nu4Hd6oiEqvVWjAp3wqJcH0_G59KjU5gdvktvDMY3rOSsrV44BeRf9Ad_wgRldoU41x64xPZjtIapxq_wVpyCZXSpT-v)\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q96bjp/what_do_you_think_about_these_random_choices_of/"
    },
    {
        "id": "1q95ctb",
        "author": "tricky12121st",
        "title": "Run Away - flakey green screen background",
        "content": "Like the story but the superimposed backgrounds are grim. Is ths just poor post prod or cost cutting?\nThe shots of the universities are particularly poor. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q95ctb/run_away_flakey_green_screen_background/"
    },
    {
        "id": "1q7orjz",
        "author": "Similar_Diver9558",
        "title": "‘Stranger Things’ Fans Crashed Netflix Looking For An Alternate Finale—But It Doesn't Exist",
        "content": "",
        "upvotes": 1772,
        "comments": 132,
        "media": null,
        "permalink": "/r/netflix/comments/1q7orjz/stranger_things_fans_crashed_netflix_looking_for/"
    },
    {
        "id": "1q8rkrp",
        "author": "AccomplishedPut5175",
        "title": "His &amp; Hers",
        "content": "Just finished and... I love series like this, and this kind of action. In my opinion, the series is very good, it kept my attention the whole time. Honestly, my recommendation.",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1q8rkrp/his_hers/"
    },
    {
        "id": "1q8vg2r",
        "author": "Necessary-Cause-4869",
        "title": "I want to mentally disturb myself. I want to traumatize myself. Any suggestions on what I can watch on Netflix?",
        "content": "I want to watch something mentally disturbing on Netflix. I’m looking for something intense and dark that really messes with your mind. If you have any suggestions, let me know. It can be anything related to emotional imbalance, like love, betrayal, crime, thrillers, or real life traumatizing mysteries ,documentaries, series, psychologically disturbing,anything that would mess up my mind. Please don’t suggest watching the news. I don’t want to do that , I need some entertaining, dark , intense stuff. ",
        "upvotes": 6,
        "comments": 164,
        "media": null,
        "permalink": "/r/netflix/comments/1q8vg2r/i_want_to_mentally_disturb_myself_i_want_to/"
    },
    {
        "id": "1q8hg5j",
        "author": "coolerdude56",
        "title": "”Not in the same household” even though i am",
        "content": "Im getting sick of netflix not even getting this household thing right. Yea i get that it doesnt work when im in another city but now it doesnt even work even when im at home, and also for my sister that is always at home. Everyone is connected to the same wifi.",
        "upvotes": 25,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1q8hg5j/not_in_the_same_household_even_though_i_am/"
    },
    {
        "id": "1q8uu1n",
        "author": "ithnkthrfriam",
        "title": "His and Hers",
        "content": "Spoiler***\n\nI understand the twist - but what I don’t understand is why Richard got so mad when Anna called Jack if there was never anything dangerous happening? Because he hates Jack? \n",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1q8uu1n/his_and_hers/"
    },
    {
        "id": "1q8mwc4",
        "author": "abdul_bino",
        "title": "Going on a 17 hour plane ride need some TV suggestions?",
        "content": "No more than five seasons. Have already already watched the wire breaking bad better call Saul GOT parks and rec the office. Don’t mind anime either. Any and all suggestions are welcome.",
        "upvotes": 8,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1q8mwc4/going_on_a_17_hour_plane_ride_need_some_tv/"
    },
    {
        "id": "1q832jb",
        "author": "Economy-Specialist38",
        "title": "Netflix co-CEO says he doesn’t read business books—at all. Instead, he reads one 1902 fiction about a ship and its reckless ‘hot dog’ captain over and over again",
        "content": "",
        "upvotes": 83,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1q832jb/netflix_coceo_says_he_doesnt_read_business/"
    },
    {
        "id": "1q8ole1",
        "author": "yeetskrtyeetskrt",
        "title": "anyone’s netflix not working?",
        "content": "i kid you not i have tried to watch netflix on 4 different devices but it either never loads onto netflix or when a couple things load and i try to watching something the show won’t load. we may be thinking an internet issue but i can load every other streaming service with no issues. any solutions?",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1q8ole1/anyones_netflix_not_working/"
    },
    {
        "id": "1q8xkpw",
        "author": "apka_dd",
        "title": "What’s a show you genuinely loved that you think deserves its hype?",
        "content": "Everyone talks about overrated shows, but I’m curious about the opposite.\n\nFor me, it’s **DARK**.\n\nThis is one of the very few series I’d actually call epic. The writing, casting, music, pacing, and the way everything connects across seasons - nothing feels lazy or accidental. It respects the audience’s intelligence and doesn’t spoon-feed answers.\n\nI’ve watched a lot of highly rated shows, but honestly, **I don’t think any series has beaten DARK for me yet**. Not because it’s flashy, but because it commits fully to its story and themes all the way to the end.\n\nWhat’s a show you genuinely think lived up to - or even exceeded - the hype?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1q8xkpw/whats_a_show_you_genuinely_loved_that_you_think/"
    },
    {
        "id": "1q8hcra",
        "author": "Hairy-Stop4005",
        "title": "Finally able to afford a Netflix subscription - top recommendations right now?",
        "content": "Basically as title says. I purchased my Netflix subscription. I’ve seen stranger things and loved it. I’m more so looking for series (thriller,dramas, psychological) that kinda thing. \n\nThank you in advance! ",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1q8hcra/finally_able_to_afford_a_netflix_subscription_top/"
    },
    {
        "id": "1q8x78s",
        "author": "Mom2askater",
        "title": "Lauren “Cowell”?",
        "content": "Just binged The Next Act and WTF is up with the girlfriend? I mean who changes there name to take their partners last name without being married? There’s clearly a reason they aren’t married. And for her to non-chalantly say she doesn’t want to keep her ex-husbands name anymore?? Why cause it’s a constant reminder that you cheated on your husband with his friends???? So odd. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q8x78s/lauren_cowell/"
    },
    {
        "id": "1q84on1",
        "author": "Wonderful_Nebula_802",
        "title": "Just finished watching Animal Kingdom.",
        "content": "What a brilliant series!!! \nI think I might watch it again! \nI loved Pope. Any one else have a favourite?  \nAny recommendations for a series that’s just as good?  \n",
        "upvotes": 12,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1q84on1/just_finished_watching_animal_kingdom/"
    },
    {
        "id": "1q89b3m",
        "author": "TheShyBuck",
        "title": "Are there more Korean shows on Netflix in the Middle East and North Africa than on Netflix in America or Europe? does Netflix in America have more Western shows?",
        "content": "I am from the Middle East\n\nWhen the president Yoon met the CEO of Netflix nearly 2 years ago, the Korean president called for increased investment in Korean shows (billions)\n\nand since that day nearly all that I see on Netflix are Korean shows added every week. I can't find enough American and European shows to watch on Netflix,\n\nUnfortunately most streaming services are not available in my country except for Amazon Prime and Netflix\n\nand no I never watched Korean shows on Netflix before so it is not the algorithms",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q89b3m/are_there_more_korean_shows_on_netflix_in_the/"
    },
    {
        "id": "1q8o2oq",
        "author": "wh1tef3rrari",
        "title": "Episodes keep glitching back a couple seconds every 1-2 minutes",
        "content": "I’ve constantly had issues with netflix, whether it’s on my ipad, or my laptop, there is always a bug. The latest one is that no matter what I watch, every 1-2 minutes it’ll glitch back and rewind ten seconds or so randomly. I’m not touching my screen, I’m not doing anything, just watching my show and it does this. What can I do? It’s on my laptop, I’ve uninstalled and reinstalled yet the issue persists. It’s extremely irritating ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q8o2oq/episodes_keep_glitching_back_a_couple_seconds/"
    }
]