[
    {
        "id": "1kcdwx5",
        "author": "VulcanizadoraAMA",
        "title": "Hi, r/movies. It's Joel Potrykus, writer/director/editor of VULCANIZADORA, and leading man Josh Burge. This is our fourth film together after APE, BUZZARD, and RELAXER. VULCANIZADORA is a bleak comedy-thriller about friends who embark on a disturbing mission in the woods. Ask us anything if you dare",
        "content": "What's up, cine-freaks. It's writer/director/editor/actor Joel Potrykus and leading man Josh Burge. We've been making movies together for a long time, starting with APE (2012), BUZZARD (2015), and RELAXER (2018). Our new film VULCANIZADORA opens in theaters today, May 2nd, starting at the IFC Center in NYC and expanding in the coming weeks. Find a screening near you at vulcanizadora.oscilloscope.net. \n\nCheck out the trailer here: [https://youtu.be/S80Jz\\_ob8-U?feature=shared](https://youtu.be/S80Jz_ob8-U?feature=shared)\n\nWe look forward to talking about movies and I guess literally anything else. Cheers. We'll be back tomorrow (Friday 5/2)( at 3:00 PM ET to answer your questions.\n\n",
        "upvotes": 26,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/v1qp1vsfc7ye1.png?auto=webp&amp;s=bd93424a5fe8653d6ef8dda120d5375800a57254"
        },
        "permalink": "/r/movies/comments/1kcdwx5/hi_rmovies_its_joel_potrykus_writerdirectoreditor/"
    },
    {
        "id": "1kcpxna",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Thunderbolts* / The Surfer) Plus Throwback Discussions",
        "content": "# New Theatrical Releases\n\n[Thunderbolts*](https://old.reddit.com/r/movies/comments/1kcpug8/official_discussion_thunderbolts_spoilers/?)\n\n[The Surfer](https://old.reddit.com/r/movies/comments/1kcpuhw/official_discussion_the_surfer_spoilers/?)\n\n# 25th Anniversary Throwback Discussion Threads\n\n[The Flintstones in Viva Rock Vegas](https://old.reddit.com/r/movies/comments/1kcpumj/official_throwback_discussion_the_flintstones_in/?)\n\n[Frequency](https://old.reddit.com/r/movies/comments/1kcpunu/official_throwback_discussion_frequency_spoilers/?)\n\n[Where the Heart Is](https://old.reddit.com/r/movies/comments/1kcpupt/official_throwback_discussion_where_the_heart_is/?)\n\n\n\n\n# Still in Theaters\n\n[The Accountant 2](https://old.reddit.com/r/movies/comments/1k79o5r/official_discussion_the_accountant_2_spoilers/?)\n\n[The Legend of Ochi](https://old.reddit.com/r/movies/comments/1k79o78/official_discussion_the_legend_of_ochi_spoilers/?)\n\n[Until Dawn](https://old.reddit.com/r/movies/comments/1k79o90/official_discussion_until_dawn_spoilers/?)\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n[The Wedding Banquet](https://www.reddit.com/r/movies/comments/1k1tsqm/official_discussion_the_wedding_banquet_spoilers/?)\n\n[Warfare](https://www.reddit.com/r/movies/comments/1jwev1e/official_discussion_warfare_spoilers/)\n\n[The Amateur](https://www.reddit.com/r/movies/comments/1jwev63/official_discussion_the_amateur_spoilers/)\n\n[Drop](https://www.reddit.com/r/movies/comments/1jwevax/official_discussion_drop_spoilers/)\n\n[Freaky Tales](https://www.reddit.com/r/movies/comments/1jwevev/official_discussion_freaky_tales_spoilers/)\n\n[A Minecraft Movie](https://www.reddit.com/r/movies/comments/1jr0qff/official_discussion_a_minecraft_movie_spoilers/?)\n\n\n\n\n# On Streaming\n\n**I'm a bit behind on streaming releases so here's a bunch of them from the last few weeks**\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)\n\n[G20](https://old.reddit.com/r/movies/comments/1k7zfzp/official_discussion_g20_spoilers/?)\n\n[2073](https://old.reddit.com/r/movies/comments/1k7zg0y/official_discussion_2073_spoilers/?)\n\n[Holland](https://old.reddit.com/r/movies/comments/1k7zg30/official_discussion_holland_spoilers/?)",
        "upvotes": 13,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1kcpxna/official_discussion_megathread_thunderbolts_the/"
    },
    {
        "id": "1kd4m4z",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Zoe Saldana's Neytiri in 'Avatar: Fire and Ash'",
        "content": "",
        "upvotes": 665,
        "comments": 175,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/r3rwsk846eye1.jpeg?auto=webp&amp;s=8b8956d3cb1ab3a4cdb45dfb58fe6ab18a98a8df"
        },
        "permalink": "/r/movies/comments/1kd4m4z/first_image_of_zoe_saldanas_neytiri_in_avatar/"
    },
    {
        "id": "1kd3nre",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Wes Anderson's 'The Phoenician Scheme'",
        "content": "",
        "upvotes": 720,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9sp7cb97zdye1.jpeg?auto=webp&amp;s=86eae7993487841685d5aa866d9405b9389e0e60"
        },
        "permalink": "/r/movies/comments/1kd3nre/new_poster_for_wes_andersons_the_phoenician_scheme/"
    },
    {
        "id": "1kd3da5",
        "author": "JonasKahnwald11",
        "title": "Official Poster for 'The Unholy Trinity' - Starring Pierce Brosnan and Samuel L. Jackson",
        "content": "",
        "upvotes": 494,
        "comments": 113,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o36thw01xdye1.jpeg?auto=webp&amp;s=245cd122a91098eb1ec4df931947ce94d00c0dea"
        },
        "permalink": "/r/movies/comments/1kd3da5/official_poster_for_the_unholy_trinity_starring/"
    },
    {
        "id": "1kcln9p",
        "author": "ContinuumGuy",
        "title": "Mississippi city where 'Sinners' is set has no movie theater, petitions for cast visit and public screening",
        "content": "",
        "upvotes": 7450,
        "comments": 176,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j66EWtopy-ntDUtWhbny_-8QfkKWPUITHeAeOGJzMTc.jpg?auto=webp&amp;s=9486e40f65bc5caf80bfba59b3ae931e27d4e0e9"
        },
        "permalink": "/r/movies/comments/1kcln9p/mississippi_city_where_sinners_is_set_has_no/"
    },
    {
        "id": "1kd42id",
        "author": "MarvelsGrantMan136",
        "title": "New Character Posters for 'The Fantastic Four: First Steps'",
        "content": "",
        "upvotes": 240,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/txenz5l32eye1.jpeg?auto=webp&amp;s=8aca2c7b21c581075ee4ef1cbcdf0ad34541f8fc"
        },
        "permalink": "/r/movies/comments/1kd42id/new_character_posters_for_the_fantastic_four/"
    },
    {
        "id": "1kcyipj",
        "author": "herequeerandgreat",
        "title": "in honor of dogma's 25th anniversary, here are 25 fun facts about dogma",
        "content": "in the bar scene, jay can be seen nodding off in the background. this wasn't a gag. jason mewes was actually strung out on heroin during filming.\n\nprior to signing onto the movie, alan rickman only had two questions. would the angel wings be real and would his dialogue be filmed as written. kevin smith assured him that the wings would be real and the dialogue would be filmed as written. rickman enthusiastically signed on. \n\ngeorge carlin had recently lost his wife prior to filming and asked kevin smith if there was someway he could film his scenes with his wedding ring on because he didn't feel ready to take it off. smith noted how the normally very calm carlin was very nervous when asking. smith and carlin both decided that carlin would wear a band aid on the finger with the ring to hide it. however, this was actually unnecessary since cardinals are given special rings to wear. oh well. hindsight is 20 20.\n\nin a rare move for a kevin smith movie, the bulk of the movie was not shot in new jersey. rather, it was largely filmed in pittsburgh.\n\nalanis morissette was originally offered the role of bethany but she couldn't commit to it due to her world tour. by the time morissette was available, linda fiorentino had been cast in the role. smith gave her the role of god instead.\n\nkevin smith planned to make a sequel in the aftermath of 911 which would have focused on islam. the movie would have been about bethany's daughter who would have gone on an adventure to save humanity with the aid of jay and silent bob. smith eventually decided against it, deciding that the subject matter was too complicated for him to handle gracefully.\n\nrufus's line \"know him? that N word owe me 12 bucks\" was improvised by chris rock, one of only a few things that he ad libbed for the movie.\n\nan early draft of the script featured a scene where jay and silent bob sing.\n\nholly hunter was kevin smith's original choice for the role of god. this is why jay refers to god as \"the chick from the piano\" in the film. however, hunter was unavailable. emma thompson was also offered the role but she declined due to her pregnancy. \n\nbefore jason lee was cast as azarael, bill murray, adam sandler, and john travolta were considered. sandler was even offered the role but declined due to his commitment to big daddy. \n\nboth albert brooks and chevy chase were considered for the role of cardinal glick.\n\nthis movie was the first of 3 consecutive collaborations between kevin smith and george carlin. carlin was later cast in smith's films jay and silent bob strike back and jersey girl.\n\nwhen alanis morissette was unavailable to play bethany, janeane garofalo, joey lauran adams, and gillian anderson were also considered.  \n\nthe adulterer on the train is played by scott mozier, the film's co producer and a good friend of kevin smith.\n\nkevin smith approached robert rodriguez to direct the movie. rodriguez liked the script but felt that the film was super personal for smith and that he should be the one to direct it.\n\nin addition to being the most fantasy oriented of the view askewniverse movies, dogma also holds the distinction of being the only movie in the series where the protagonist is not a man.\n\nbefore howard shore was hired to compose the film's score, danny elfman was offered the chance but was unavailable. \n\nkevin smith actually wrote the movie before clerks was even a thought. however, upon listening to a radio interview with robert rodriguez about writing around your limitations, smith decided to put the project off and make clerks instead. he considered making dogma as his followup to clerks but decided that he needed more experience.\n\nthe mooby's playground was built specifically for the movie and was deliberately modelled like a meat grinder.\n\nkevin smith briefly toyed with making the end be god answering bethany's \"why are we here\" question with \"i've got just one word for you...plastics\" which would have resulted in everyone's heads blowing up.\n\nsamuel L jackson and will smith were both offered the role of rufus. \n\nin addition to writing, directing, and starring in the film, kevin smith also helped puppeteer the wings on the angels. \n\nif you look very carefully, you'll notice that all the angels are dressed the same way. the only difference is the colors of their outfits.\n\ngwyneth paltrow, a friend of ben affleck, actually visited the set of the airport scene. during the scene where ben and matt are sitting, paltrow was sitting just off camera. \n\ndespite the controversy surrounding it's release, dogma was lionsgate's highest grossing movie until the 2004 release of crash.",
        "upvotes": 291,
        "comments": 43,
        "media": null,
        "permalink": "/r/movies/comments/1kcyipj/in_honor_of_dogmas_25th_anniversary_here_are_25/"
    },
    {
        "id": "1kcqo26",
        "author": "essenceofnutmeg",
        "title": "I finally watched Schindler's List after putting it off for years... where does all the pain go?",
        "content": "I hope it's ok to post this here, I'm not trying to be inflammatory, as I don't really discuss the actual plot of the movie or the actors.\n\n I finally watched Schindler's List, and I just need to get this off my chest and have no one else to talk to about how I feel. \n\nI tend to stay away from movies that depict historical violence. I can sit through documentaries and educational content that contains NSFL footage and testimonies, I guess I can chalk it up to me just being sensitive and easily triggered.\n\nThe movie itself was an absolute masterpiece. That being said, I went through all three hours completely unphased. I didn't cry when I saw children being killed en mass. I didn't gasp when I saw the piles of dead bodies. At no point did I look away because the horror was too much to bear.\n\nI'm numb and desensitized. Not just because of what's happening in Gaza, The Congo, Sudan... but because I've seen how the current barbarity is a mere drop in the bucket compared to the collective atrocities we as a species inflicted on ourselves for centuries. Year after year; decade after decade; millennia after millennia. The weaponization of fear fuels hate and violence to serve the greed and desires of people with power over others. To me, it's everything everywhere all at once... if that makes any sense \n\nI will say that although I was unphased during the movie, I couldn't sleep a wink afterwards. My mind couldn't rest thinking of all the parallels between the holocaust, the history of indigenous people who were colonized or annihilated, state sanctioned violence against it's own citizens, and the reality of the daily unfathomable torment that people are experiencing today. \n\nI think part of what kept me up is the understanding that this unbridled horror is avoidable, but the people with the power to orchestrate these atrocities have decided it's in their best interest to have the masses believe there is/was no way to prevent the carnage.\n\nMy ultimate takeaway from the film is that:\n\n\"Those who can see beyond the shadows and lies of their culture will never be understood, let alone believed, by the masses.\"\n-Plato \n\nOne day, when the truth comes to light, everyone will be against (insert whatever mass-manufactured atrocity here). \n\nBy then, it will have been too late to save ourselves from the consequences of our collective inaction.\n\nI cannot begin to conceptualize the physical and psychological pain that the dead victims who lived through the previous and present tortuous times experienced, not even to speak of the survivors. Where does all of their pain go?",
        "upvotes": 1243,
        "comments": 441,
        "media": null,
        "permalink": "/r/movies/comments/1kcqo26/i_finally_watched_schindlers_list_after_putting/"
    },
    {
        "id": "1kcpug8",
        "author": "LiteraryBoner",
        "title": "Official Discussion - Thunderbolts* [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/IPulGdRzLriY)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/IPulGdRzLriY)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ItnAgr4mX7QR) to see the rankings of 2025 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done \n\n\n---\n\n**Summary**  \n*Thunderbolts\\** is a Marvel Studios ensemble film following a team of reformed villains and morally gray operatives sent on covert government missions. As the group is tasked with a dangerous black-ops assignment, tensions rise among the unstable team members, revealing conflicting loyalties and buried traumas. The film serves as a continuation of storylines from *Black Widow*, *The Falcon and the Winter Soldier*, and *Ant-Man and the Wasp: Quantumania*, with a darker tone and grounded action set pieces.\n\n**Director**  \nJake Schreier\n\n**Writer**  \nEric Pearson\n\n**Cast**  \n- Florence Pugh as Yelena Belova  \n- Sebastian Stan as Bucky Barnes / Winter Soldier  \n- Wyatt Russell as John Walker / U.S. Agent  \n- David Harbour as Alexei Shostakov / Red Guardian  \n- Hannah John-Kamen as Ava Starr / Ghost  \n- Olga Kurylenko as Antonia Dreykov / Taskmaster  \n- Julia Louis-Dreyfus as Valentina Allegra de Fontaine  \n\n\n**Rotten Tomatoes**: [89%](https://www.rottentomatoes.com/m/thunderbolts)  \n**Metacritic**: [68](https://www.metacritic.com/movie/thunderbolts)\n\n**VOD**  \nTheaters\n\n**[Trailer](https://www.youtube.com/watch?v=thunderbolts)**\n\n---",
        "upvotes": 1103,
        "comments": 1421,
        "media": null,
        "permalink": "/r/movies/comments/1kcpug8/official_discussion_thunderbolts_spoilers/"
    },
    {
        "id": "1kcyqe4",
        "author": "Odins-raven",
        "title": "What's your favourite comfort movie?",
        "content": "When you are feeling out of sorts or anxious, or sad. What's your go to movie?\nFor me it's has to be Disneys Sword in the Stone. It's comedic and feel good with an underdog, and has the best disney character in my opinion... Archimedes. But I want to know what else has vibes that relax and chill you out?",
        "upvotes": 129,
        "comments": 376,
        "media": null,
        "permalink": "/r/movies/comments/1kcyqe4/whats_your_favourite_comfort_movie/"
    },
    {
        "id": "1kc7ihg",
        "author": "BunyipPouch",
        "title": "Deadline Announces 2024's Biggest Box Office Bombs: Joker 2 ($144M loss), Furiosa ($119M loss), Borderlands ($80M loss), Megalopolis ($76M loss), and Kraven the Hunter ($71M loss).",
        "content": "",
        "upvotes": 11252,
        "comments": 2342,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oo6jm3EvxqQMbO_4al2Paz-NRnSRU2bkEjALZSjBnso.jpg?auto=webp&amp;s=72836b537694c81d0e2f4f3af0ecbb48a035913c"
        },
        "permalink": "/r/movies/comments/1kc7ihg/deadline_announces_2024s_biggest_box_office_bombs/"
    },
    {
        "id": "1kccih5",
        "author": "MarvelsGrantMan136",
        "title": "Ryan Coogler’s ‘Sinners’ Gets 70mm IMAX Re-Release on May 15",
        "content": "",
        "upvotes": 3855,
        "comments": 289,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HuxGbJQ-Gi2cVZcDF1-SrwsowwF9V5w6t93B4T6FuVg.jpg?auto=webp&amp;s=966f3f7ae851c285e9466e186db60937342c18fb"
        },
        "permalink": "/r/movies/comments/1kccih5/ryan_cooglers_sinners_gets_70mm_imax_rerelease_on/"
    },
    {
        "id": "1kcgoqv",
        "author": "indiewire",
        "title": "Norm Macdonald’s ‘Dirty Work’ Gets Even Dirtier Almost 30 Years After Its Release",
        "content": "",
        "upvotes": 1974,
        "comments": 218,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XgydGaFeZfYcHh2ke_ZtG3KCmblnro9AzHoBZyk-2ZY.jpg?auto=webp&amp;s=08cc481af4b37978785726c95300c3113ac10dcc"
        },
        "permalink": "/r/movies/comments/1kcgoqv/norm_macdonalds_dirty_work_gets_even_dirtier/"
    },
    {
        "id": "1kczr85",
        "author": "SafeBodybuilder7191",
        "title": "Billy Magnussen, Ella Purnell and Ariana Greenblatt to Star in Teen Comedy ‘Hot Ted’ From ‘SNL’ Alum Hannah Levy, Protagonist Launching in Cannes (EXCLUSIVE)",
        "content": "",
        "upvotes": 71,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CfLbsulqlk2GKz-Fl_h05v5mOfV5d4k1665MqDufOlM.jpg?auto=webp&amp;s=dcb3f617388beaa0b3d8f24a520d71c7faa0c9ff"
        },
        "permalink": "/r/movies/comments/1kczr85/billy_magnussen_ella_purnell_and_ariana/"
    },
    {
        "id": "1kd4z0j",
        "author": "mikedomert",
        "title": "How come there are almost no good dinosaur movies besides first Jurassic Parks and King Kong?",
        "content": "Given how popular and interesting topic dinosaurs are, it strikes me as odd that there are almost no movies about them. Everyone knows Jurassic Park movies, and Peter Jacksons King Kong is very good but it doesnt focus on dinosaurs.\n\nIs there some obvious movie I am missing, or do good dinosaur  movies just not exist?",
        "upvotes": 32,
        "comments": 98,
        "media": null,
        "permalink": "/r/movies/comments/1kd4z0j/how_come_there_are_almost_no_good_dinosaur_movies/"
    },
    {
        "id": "1kct408",
        "author": "exophrine",
        "title": "Shudder Acquires GOOD BOY, A Haunted House Movie Told from Dog’s Perspective",
        "content": "",
        "upvotes": 222,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/okdmdOoqPdxg7IzZlXmWB4hVLwvU5BL0SZmU1N1Mymo.jpg?auto=webp&amp;s=3dfd61da771f95c7224e566aadabcd0f8247b4f2"
        },
        "permalink": "/r/movies/comments/1kct408/shudder_acquires_good_boy_a_haunted_house_movie/"
    },
    {
        "id": "1kd3vow",
        "author": "gruesomesonofabitch",
        "title": "The Hunchback of Notre Dame (1996) is one of the most beautifully dark animated films and I adore it.",
        "content": "\"Who is the monster and who is the man?\" is a question posed at The Hunchback of Notre Dame's start and finish that perfectly encapsulates the story. A man (Judge Claude Frollo) chases down a young mother, kills her, prepares to drown her deformed baby (Quasimodo), is stopped from plunging the child into a watery grave and then saddled with caring for the infant. Instead of receiving affection, the child is manipulated into thinking they're a monster who will never be loved or accepted. On top of this, the man is actively pursuing an obsession to eradicate an entire ethnic group (Gypsies) while lusting after a woman (Esmeralda) who is one of those people.\n\n\n\nIf that in no way sounds like it could be an animated children's film, much less a Disney movie, that is where you are mistaken and this is precisely why The Hunchback of Notre Dame is the most beautifully grim and special piece of work that the studio has ever produced. The first six and a half minutes alone are one of the most emotionally arresting expository sequences thanks in large part to Alan Menken's incredible music. Menken delivers what is easily his strongest score and several stellar songs (The Belles of Notre Dame, Out There and Heaven's Light/Hellfire) paired with some of the most striking visuals in any animated film.\n\n\n\nIt's immediately after the opening sequence that we are introduced to the film's only true flaw... the gargoyles. Apparently, the directors (Gary Trousdale and Kirk Wise) forcibly inserted these painfully intrusive characters as an attempt at humor which instead tarnishes the dark tone of the film; the gargoyles are even given a horribly out of place and mediocre song (A Guy Like You). A far better means for delivering their brief heartfelt moments of wisdom to Quasimodo would have been through the Arch Deacon character introduced earlier in the film.\n\n\n\nAs a whole, I have a deep love for this film despite it being just shy of perfection.",
        "upvotes": 33,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1kd3vow/the_hunchback_of_notre_dame_1996_is_one_of_the/"
    },
    {
        "id": "1kcq69t",
        "author": "SmittyFromAbove",
        "title": "I really miss Arnold being in movies",
        "content": "I grew up with Arnold Schwarzenegger movies on the TV every weekend. I don't think there's one of his movies I don't enjoy on some level. I believe we will never see anyone like him again in our lifetime. What's your favorite Arnold movie or your favorite line from him. For me, it has to be T2, but the quote is, \"Remember, Sully, when I promised to kill you last? I lied. (drops him off a cliff)\" ",
        "upvotes": 352,
        "comments": 182,
        "media": null,
        "permalink": "/r/movies/comments/1kcq69t/i_really_miss_arnold_being_in_movies/"
    },
    {
        "id": "1kczs6k",
        "author": "KillerCroc1234567",
        "title": "In ‘The History of Sound’, Paul Mescal and Josh O’Connor’s Tender Romance Defines a Complex Life (First Images)",
        "content": "",
        "upvotes": 44,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SagNu9vpi0mVElU_GSN6jEBos45h1SOTDdg-a-sd4AM.jpg?auto=webp&amp;s=92430d6b8d2d4e19c4ff056c04db2498f8b9119f"
        },
        "permalink": "/r/movies/comments/1kczs6k/in_the_history_of_sound_paul_mescal_and_josh/"
    },
    {
        "id": "1kcjlj4",
        "author": "KillerCroc1234567",
        "title": "Yorgos Lanthimos and Emma Stone’s ‘Bugonia’ Sets New Fall Release Date (October 31st)",
        "content": "",
        "upvotes": 703,
        "comments": 97,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ku9msqYdQXoGXLHeG3fMlTgGYpzwxJEos4RAvpVinVo.jpg?auto=webp&amp;s=3ca60cab2d5cb06addc4b1107f21a8ad0cc0fef3"
        },
        "permalink": "/r/movies/comments/1kcjlj4/yorgos_lanthimos_and_emma_stones_bugonia_sets_new/"
    },
    {
        "id": "1kcmpb6",
        "author": "linkenski",
        "title": "Sunshine is so good.",
        "content": "I believe it's still on Disney+, maybe by writer and directors Alex Garland and Danny Boyle who did 28 Days Later as well, it's one of the most unique, modern sci-fi films that have been made in recent decades still, and it has scenes that just swallow up all of your attention.\n\nWhat is interesting about that movie is its connection to 28 Years Later which comes out soon. Danny and Garland fell out in the production of this movie, creatively, and over the years they've both reflected on why that was. According to Garland he wanted the movie to be a slow-burn, and very contemplative, where the conclusion would be that the crew would give in to their mission to restart the dying sun, by just letting themselves die and accept the possibility that the mission might be a fluke. In his original script which can still be bought, the movie has many, many differences to what Danny Boyle ended up making onto screen, where they play chess in the opening and ending. There are still deleted scenes in the DVD of the characters playing chess.\n\nBut ultimately, what frustrated Garland and caused him to start directing on his own (making films like Ex Machina, Annihilation and Civil War) was that Danny Boyle was fixated on figuring out a solution to the plot that would be more hopeful and positive. He started making more and more editorial decisions to the script, and Danny recalled Garland pointing at an idea of making an intro-monologue to explain the premise saying \"If you do that, I'm off the project.\"\n\nThat also makes the movie interesting in itself -- how it's stuck between versions and is arguably an unfinished draft. The biggest complaint is that 2/3rds into it people joke it turns into \"Jason X\", but curiously this part is also in Garland's script, but everything just happens at a different location and leads to a different endgame.\n\nI highly recommend giving it a watch. It's a deeply evocative, but also epic science fiction, that has an all-star cast that create some intense scenes together where you're glued to the screen. It's easy if you already like Chris Evans (Captain America) who even said this was his favorite movie to make.\n\nCLIP: [Chris Evans as \"Mace\" in Sunshine (2007)](https://www.youtube.com/watch?v=FUfubQCfHUU)",
        "upvotes": 379,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-yBFAQrcB3Xp6zf4PrgJ7GVRb2rrnSNzhO2teeo60VM.jpg?auto=webp&amp;s=50705d06e2a25fb59fc7eab1eccdfc6a4a9dee54"
        },
        "permalink": "/r/movies/comments/1kcmpb6/sunshine_is_so_good/"
    },
    {
        "id": "1kc9fxl",
        "author": "MarvelsGrantMan136",
        "title": "‘A Different Man’ Star Adam Pearson to Play Joseph Merrick in ‘The Elephant Man’ Film Adaptation",
        "content": "",
        "upvotes": 1875,
        "comments": 105,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2RxZLKMcAObwO4N0bQYwlTFwsCDHjbrODUfaw5ONNVM.jpg?auto=webp&amp;s=eca0d299e2a9e1b82ad8669287e4213b157789ef"
        },
        "permalink": "/r/movies/comments/1kc9fxl/a_different_man_star_adam_pearson_to_play_joseph/"
    },
    {
        "id": "1kcgsxq",
        "author": "randolphquell",
        "title": "OCEAN WITH DAVID ATTENBOROUGH | OFFICIAL TRAILER",
        "content": "",
        "upvotes": 715,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ESFzUD8__tOtLf5G0PHX6bfY_fHctI2kK3bIoaoYgXk.jpg?auto=webp&amp;s=aa40fbe4d4ec7646dfd687c7c2969ff2f183d1ca"
        },
        "permalink": "/r/movies/comments/1kcgsxq/ocean_with_david_attenborough_official_trailer/"
    },
    {
        "id": "1kckzlb",
        "author": "aresef",
        "title": "Approaching 80: Filmmaker John Waters talks about how he avoids becoming an old fart, stage diving and his ‘youth spies’",
        "content": "",
        "upvotes": 278,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ackarmEMcnsu7EV-j0zuHAzhnWMLcdtFF9xIIyreJjE.jpg?auto=webp&amp;s=2d4cd3647462172fc2cf7e5fc337595547954db7"
        },
        "permalink": "/r/movies/comments/1kckzlb/approaching_80_filmmaker_john_waters_talks_about/"
    },
    {
        "id": "1kc9kgy",
        "author": "nrkreetxh",
        "title": "Any movies where the main character becomes the villain?",
        "content": "Does anyone know a movie where the main character starts of as the nice guy but becomes the villain because of something that happened to them? I really wanna watch a movie like this but I don’t have patience to search for it lmao. An exemple of what I'm thinking of is like, imagine harry potter but he got fed up with everything bothering and trying to kill him so he becomes a dark wizard even worse than voldmort. Does that make sence? Anyway, if anyone know please tell me, I would be happy to know :)",
        "upvotes": 1014,
        "comments": 903,
        "media": null,
        "permalink": "/r/movies/comments/1kc9kgy/any_movies_where_the_main_character_becomes_the/"
    },
    {
        "id": "1kcyjcr",
        "author": "Magnumdoge",
        "title": "What films have the most under appreciated cinematography?",
        "content": "A lot of best cinematography lists seem to have the same films on rotation. Blade Runner, Lawrence of Arabia, and basically anything shot by Roger Deakins. But what are some films that you rarely see on these lists which you're surprised aren't always there.\n\nFor me, Pleasantville's the most significant one that comes to mind. But I'm curious to hear everyone's thoughts",
        "upvotes": 16,
        "comments": 83,
        "media": null,
        "permalink": "/r/movies/comments/1kcyjcr/what_films_have_the_most_under_appreciated/"
    },
    {
        "id": "1kc9aze",
        "author": "G_Force",
        "title": "Movies that spoil other movies?",
        "content": "I'm currently in the hospital with my wife for the birth of our second child. To take her mind off labor pain, we watched one of her favorite cheesey movies - *50 First Dates*. As we watched it, I picked up on something I hadn't noticed in previous viewings.\n\nThere is a scene where Drew Barrymore's character Lucy invites her dad and brother to watch *The Sixth Sense*, which is new to her but not them (due to her memory problems). When talking about it afterwards, Lucy says something like \"I can't believe Bruce Willis was a ghost the whole time!\", thus spoiling the ending of that movie. \n\nIt caught me off guard because it was so blatant. But that got me wondering: are there other examples of a movie spoiling a different, completely unrelated movie? ",
        "upvotes": 731,
        "comments": 248,
        "media": null,
        "permalink": "/r/movies/comments/1kc9aze/movies_that_spoil_other_movies/"
    },
    {
        "id": "1kcpg6k",
        "author": "Soggy-Discipline5656",
        "title": "Poison Ivy (1992) - one of Drew Barrymore's best films",
        "content": "The name Poison Ivy had been rattling around in my head for ages. It’d pop up now and then, only to disappear again. All I knew was it was something from the ‘90s, but I’d never watched it. A quick Google for “movies by category” — ‘cause, honestly, there was nothing to watch — and there it was, among the thrillers, that familiar title. I figured it was finally time to give it a go. Finding out it was a thriller got me pumped, and when I realized it was an erotic thriller, man, I was thrilled to bits.Quick side note: I’m obsessed with ‘90s erotic thrillers. They’re practically their own cinematic wave. Why the ‘90s? It’s just my take, but ‘80s erotic thrillers feel kinda outdated, and the ones from the 2000s on are mostly just crude and overdone. The ‘90s hit the sweet spot: the eroticism drips with sensuality and charm, not just a showcase of naked bodies. You can gripe about the plot being simple (depends on who’s watching; for fans, that’s just nitpicking. Look at Color of Night or Wild Things — those prove an erotic thriller can blow your mind with crazy twists). But in this genre, a good movie isn’t just about dialogue. It’s about perfect shot composition, that awesome bluesy soundtrack, and tastefully visualized nudity. \n\nNo denying it: these ‘90s thrillers with erotic vibes have their clichés, but, damn, those clichés are what make you wanna watch, ‘cause they’re the ultimate fantasy for both women and men.Back to the movie: right from the first seconds, seeing Drew Barrymore’s character oozing sexual magnetism, you know she’s bad news. The title’s pretty straightforward but spot-on: clingy as ivy, Ivy wraps herself around Sylvia’s family, sneaking into not just their house but their hearts... even the loyal dog falls for her charm.Ivy’s the first to catch Georgie’s eye, Sylvia’s mom, the first to spark Sylvia’s interest, and, of course, Daryl, the head of the family, can’t resist her poison either. So, what’s gonna come of their run-in with this girl? And what’s it gonna cost her?\n\n[This scene could be described as \\\\\"The lady and her little dog.](https://reddit.com/link/1kcpg6k/video/mtrd6nsfw9ye1/player)\n\n  \n",
        "upvotes": 84,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1kcpg6k/poison_ivy_1992_one_of_drew_barrymores_best_films/"
    },
    {
        "id": "1kd0kj1",
        "author": "NoCulture3505",
        "title": "Angelina Jolie To Star In ‘Anxious People’ For ‘A Man Called Otto’ &amp; ‘World War Z’ Director Marc Forster, Hope Studios &amp; Black Bear — Cannes Market Hot Project",
        "content": "",
        "upvotes": 8,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2DI8Pij5KnPq2eTjnqXkxT8TsfcilzLgGJ4wnNyyM10.jpg?auto=webp&amp;s=1f3e0284d42b0fbfd37f4492c368d63a9915598b"
        },
        "permalink": "/r/movies/comments/1kd0kj1/angelina_jolie_to_star_in_anxious_people_for_a/"
    },
    {
        "id": "1kc7gmz",
        "author": "PriestofJudas",
        "title": "Best performance trapped in a bad movie?",
        "content": "It is, as condescending as it may sound, the ultimate acting compliment for an amazing acting performance to stand out in a bad movie. If you as an actor are the one beacon of hope in an otherwise bleak ocean of mediocrity, you have done your job ten times over. \n\nSo, what are the best examples?\n\nI will die on this hill but Rami Malek as Freddy Mercury in Bohemian Rhapsody absolutely deserved every single ounce of praise that he got. The movie as a whole is wildly inconsistent and definitely is not a great film especially in terms of honouring the legacy of a band as iconic and truly legendary as Queen, but Maleks performance I will to the hilt defend because he put everything he had into the portrayal. In a bad movie, he very much deserved his Oscar win. Fight me. ",
        "upvotes": 938,
        "comments": 1127,
        "media": null,
        "permalink": "/r/movies/comments/1kc7gmz/best_performance_trapped_in_a_bad_movie/"
    },
    {
        "id": "1kd52n6",
        "author": "mrjohnnymac18",
        "title": "Conclave: How the film sheds light on the secretive way popes are chosen",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/P_54qBtmFWnmhi8-vuJb8ENNq-WnwHIkeBPjBzwbXyA.jpg?auto=webp&amp;s=ae3599239f05f91bcb754a92acc0130cdd82f022"
        },
        "permalink": "/r/movies/comments/1kd52n6/conclave_how_the_film_sheds_light_on_the/"
    }
]