[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 508,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1k6c43k",
        "author": "indiewire",
        "title": "Netflix Co-CEO Says They’re Not in China Because ‘Not a Single Episode’ Cleared the Censorship Board",
        "content": "",
        "upvotes": 195,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1k6c43k/netflix_coceo_says_theyre_not_in_china_because/"
    },
    {
        "id": "1k6k1i2",
        "author": "FalconLeading",
        "title": "Animal abuse in Million Dollar Secret episode 3",
        "content": "I don't know how many of you watched this game show, but I'm on episode 3 and the use of live exotic animals is very disturbing to me.\n\nThe scene begins with each animal trapped under a cloche, those silver-dome things that cover plates. \n\nThe animals are frogs, hedgehogs, snakes, cockroaches, rats. \n\nAnyone whose worked on a film production knows behind the scenes things are extremely slow. Who knows how long those animals were there. \n\nThe contestants are then asked to transport these animals to \"terrariums\" that are basically glass boxes with a thin screen for ventilation on top. It's visible that these boxes are receiving direct sunlight and temperatures must be very high inside.\n\nYou can tell the floor of the boxes are not grass but also glass or transparent plastic. Regardless, that means that if those boxes have been in the sun it's likely that the floors were extremely hot. Once again, who knows how long they remained in those hot boxes. \n\nIt could have been cut, but it doesn't appear that any of the contestants have recieved orientation on how to handle these animals. The show is relying on the contestants fear of the animals for dramatic effect and these aren't domesticated animals, at any time they could jump out from their hands and drop to the floor. \n\nI was actually enjoying this dumb show but I just find extremely distasteful to use non-domesticated animals as \"props\" in conditions that are clearly unhealthy. ",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k6k1i2/animal_abuse_in_million_dollar_secret_episode_3/"
    },
    {
        "id": "1k64esn",
        "author": "misterpopculture",
        "title": "First Look at Charlize Theron in THE OLD GUARD 2 premiering on Netflix July 2.",
        "content": "",
        "upvotes": 103,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1k64esn/first_look_at_charlize_theron_in_the_old_guard_2/"
    },
    {
        "id": "1k65hu3",
        "author": "Whisky118228",
        "title": "IHOSTAGE IS WORST MOVIE BY NETFLIX.",
        "content": "No thriller in the name of thriller movie.\nNo tense, No Action, No side story of Amaar. \nIdc if it's real story it's just waste. I don't know why it's trending #2. Just wasted 2hrs and typing here. Beleive me don't waste your precious time.",
        "upvotes": 55,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1k65hu3/ihostage_is_worst_movie_by_netflix/"
    },
    {
        "id": "1k6cdz4",
        "author": "Designer-Ad5042",
        "title": "Oklahoma City Bombing: American Terror should have been a series!",
        "content": "I watched the documentary today, it's just over an hour and admittedly is a good summary for people who don't know much about the bombing, like me (I was 14 when it happened). But after doing more reading it barely scratched the surface. Wish it had been a series, or even a scripted series like Manhunt: Unabomber.",
        "upvotes": 22,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1k6cdz4/oklahoma_city_bombing_american_terror_should_have/"
    },
    {
        "id": "1k686tb",
        "author": "TimesandSundayTimes",
        "title": "Use subtitles watching Adolescence, Netflix boss tells Americans",
        "content": "",
        "upvotes": 37,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1k686tb/use_subtitles_watching_adolescence_netflix_boss/"
    },
    {
        "id": "1k6n4cq",
        "author": "Sweaty-Toe-6211",
        "title": "David Harbour Thought His ‘Stranger Things’ Character Should Have Died by the End of Season 1",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k6n4cq/david_harbour_thought_his_stranger_things/"
    },
    {
        "id": "1k6i05h",
        "author": "skyfalws",
        "title": "Finale of the Netflix series You",
        "content": "For me, it would be great if the fifth season ended with Joe dying of old age (he's already 31) and alone. And that Joe's narrated thoughts were actually LETTERS to his lovers that were all kept together and now the one reading/imagining/remembering was HENRY. In this case, the series takes place while Henry reads letters from each lover",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k6i05h/finale_of_the_netflix_series_you/"
    },
    {
        "id": "1k67exc",
        "author": "EthanWilliams_TG",
        "title": "The Old Guard 2: New Photos and Big Changes Revealed for Netflix Sequel",
        "content": "",
        "upvotes": 14,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k67exc/the_old_guard_2_new_photos_and_big_changes/"
    },
    {
        "id": "1k6i3mb",
        "author": "BurninUpOnWallSt",
        "title": "Is Pulse supposed to take place over a full year?",
        "content": "I’m confused about the timeline in Pulse on Netflix and hoping someone can clarify this.\n\nSo Camila’s very first day as a third-year med student was also the day Vero had her accident, which would line up with the beginning of the academic year so probably July. But by the end of the season, Vero is finally discharged and Camila is about to transfer out… which makes it seem like a full year has passed.\n\nSo were Vero and Nia in the hospital that entire year? And that the entire season covers a whole academic year? Because the pacing of the show feels like it’s going day by day. We’re in the hospital every shift, every case, and most episodes follow events in real-time (besides the flashbacks).\n\nSo did the show just jump forward without telling us? Or is it subtle time progression that we were supposed to pick up on? I’m just trying to figure out if this was intentional or a timeline inconsistency.\n\nWould love to hear how others interpreted it.\n",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k6i3mb/is_pulse_supposed_to_take_place_over_a_full_year/"
    },
    {
        "id": "1k6edl0",
        "author": "Ready-Raccoon-9180",
        "title": "Million dollar secret - Lydia",
        "content": "Spoilers… kinda… \n\n\nI just had to come here and say when Lydia called Jaimi pretentious and shallow, that was the funniest thing ever. Jaimi is a mean girl. I won’t forgive her for what she did to Lauren. If she’s really a life coach… my gosh ",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k6edl0/million_dollar_secret_lydia/"
    },
    {
        "id": "1k5yof8",
        "author": "Atlast_2091",
        "title": "Wednesday: Season 2 | Official Teaser Trailer | Netflix",
        "content": "",
        "upvotes": 28,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k5yof8/wednesday_season_2_official_teaser_trailer_netflix/"
    },
    {
        "id": "1k639b2",
        "author": "S4v1r1enCh0r4k",
        "title": "The ‘Stranger Things’ animated spinoff is officially titled ‘Stranger Things: Tales From '85’.",
        "content": "",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1k639b2/the_stranger_things_animated_spinoff_is/"
    },
    {
        "id": "1k5jlmz",
        "author": "Horustheweebmaster",
        "title": "What are some things that seem really popular but you just don't seem into?",
        "content": "For me it's Adolescence. Everybody is raving abt it, but I just don't see the hype because it doesn't look great to me. Same with baby reindeer a while back.",
        "upvotes": 184,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/1k5jlmz/what_are_some_things_that_seem_really_popular_but/"
    },
    {
        "id": "1k61jea",
        "author": "nomnomsquirrel",
        "title": "The Old Guard 2: Exclusive New Photos from the Netflix Action Sequel - IGN",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k61jea/the_old_guard_2_exclusive_new_photos_from_the/"
    },
    {
        "id": "1k6h0t7",
        "author": "No_Shoe_7317",
        "title": "I just binge watched these. Any thoughts, comments?",
        "content": "I just finished binge watching Nobody Wants This, Running Point and Pulse.  I absolutely loved all three and can't wait for new seasons to drop.  I've always loved Kristin Bell and she doesn't disappoint in this show.  I haven't watched anything with Kate Hudson on it since How To Lose A Guy....but she was fantastic in this comedy and nice to see her character break the glass ceiling and run a men's basketball team.  Pulse reminds me of Code Black some years ago with Marcia Gay Harden.  It's very good.  Anyone see these?  Have thoughts, opinions, comments?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k6h0t7/i_just_binge_watched_these_any_thoughts_comments/"
    },
    {
        "id": "1k5drti",
        "author": "Blue-Sea2255",
        "title": "Name a show that never should’ve been cancelled. For me, it’s Messiah.",
        "content": "It had everything to go on for at least five seasons. They could’ve explored so many conspiracies and layers of beliefs. I don’t get why people get offended by fictional stories.",
        "upvotes": 330,
        "comments": 634,
        "media": null,
        "permalink": "/r/netflix/comments/1k5drti/name_a_show_that_never_shouldve_been_cancelled/"
    },
    {
        "id": "1k684lu",
        "author": "reinersmommymilkies",
        "title": "Documentaries Like Tiger King",
        "content": "Not to sucker punch anyone back into 2020 where that 'cup of coffee for your head' song plays on a loop, there is no sustenance, only dalgona coffee and banana bread, and everyone's instinct reaction was to hoard toilet paper and cut bangs, but I rewatched it yesterday.\n\nIt turned into a binge watch of every single piece of media I could get my grubby neurodivergent hands on about Tiger King, and I need something with the same vibe. \n\nNot necessarily something about animals or anything like that, but something that is just truly the most batshit insane docuseries. Like the point TK was where the most sane person is the Walmart gun seller who was also Joe Exotics presidential campaign guy. \n\nJust any documentaries and series that truly makes you laugh at the absurdity at one moment, say 😀wtf😀 the next, and all in all make you consider changing your morals and values (in this case, becoming vegetarian lol) \n\nThanks! ",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1k684lu/documentaries_like_tiger_king/"
    },
    {
        "id": "1k6em9l",
        "author": "ahmedfigo0",
        "title": "Wednesday Season 2: Release Date, Cast, Plot &amp; Shocking Twists",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k6em9l/wednesday_season_2_release_date_cast_plot/"
    },
    {
        "id": "1k6crpa",
        "author": "barrymk100",
        "title": "Any update on the old Raw episodes?",
        "content": "Its been months now since Raw moved to Netflix but they still didn't add all the past episodes. I use to love to watch all the old WWE shows in date order. But with so many Raw episodes missing, its impossible to do it now.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k6crpa/any_update_on_the_old_raw_episodes/"
    },
    {
        "id": "1k68zb3",
        "author": "indiewire",
        "title": "Everything to Remember Ahead of 'You' Season 5",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k68zb3/everything_to_remember_ahead_of_you_season_5/"
    },
    {
        "id": "1k68xqq",
        "author": "doorsandcrosscheck",
        "title": "iHostage the new “thriller”",
        "content": "How did it even get the 20% on Rotten Tomatoes? I think if I were to spend 2 hours sitting in a real Apple Store anywhere in the world - that would be infinitely more exciting than this shoddy, sleepy \"thriller\". \n\nihostage put me to sleep. Watch it if you want a good nap 😴. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k68xqq/ihostage_the_new_thriller/"
    },
    {
        "id": "1k64gry",
        "author": "LushCharm91",
        "title": "'Adolescence' Emmys Campaign: Stephen Graham, Owen Cooper and More",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k64gry/adolescence_emmys_campaign_stephen_graham_owen/"
    },
    {
        "id": "1k5w7ak",
        "author": "paradisounder",
        "title": "What would you like to watch?",
        "content": "If you could have Netflix produce a series, what kind would it be? Like, what premise or plot? \n\nI loved AO, the Ozarks , Dark, Good girls, the last kingdom, Safe.  Lately, it feels like any new series that come out are boring or one dimensional. I don’t like the way the whole narco culture is romanticized, which is why I don’t watch any narco shows but the way the ozarks was produced was so good and so engaging. It really kept you on the edge of your seat with so many elements from the chosen colors to the dialogue. The AO was engaging to me because you had to really pay attention to the story line to understand what was happening and how everyone was connected. Same with Dark. \n\nI wish they’d come out with a show that had complex interconnected characters, a plot that was ever-evolving but with a clear end goal/ resolution for the characters to achieve and a big conflict to overcome. \n\n",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1k5w7ak/what_would_you_like_to_watch/"
    },
    {
        "id": "1k5y5c7",
        "author": "S4v1r1enCh0r4k",
        "title": "4 Netflix shows made it to Nielsen's Top 10 Originals for the week March 17 to March 23",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k5y5c7/4_netflix_shows_made_it_to_nielsens_top_10/"
    },
    {
        "id": "1k68xid",
        "author": "Rhen8927",
        "title": "Why is there an article theorizing that Enid will be a villian in the new season of Wednesday",
        "content": "Its screen rant, so its shit regardless but like....No?\n\nFor a number of reasons, but also because Enid would never WILLINGLY do somethibg against Wedensday.\n\nAlso, I doubt Jenna Ortega and Emma myers would go for it.\n\nThoughts?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k68xid/why_is_there_an_article_theorizing_that_enid_will/"
    },
    {
        "id": "1k6563c",
        "author": "Nearby_Ad_2519",
        "title": "TIL the old Netflix press kit, last updated 2011, is still available on their cdn!",
        "content": "https://preview.redd.it/xji4r8aeemwe1.png?width=811&amp;format=png&amp;auto=webp&amp;s=2491f6448042031ed9b49036751ed665a577d4db\n\n[http://cdn-0.nflximg.com/us/pdf/Consumer\\_Press\\_Kit.pdf](http://cdn-0.nflximg.com/us/pdf/Consumer_Press_Kit.pdf) is the link for anyone interested",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k6563c/til_the_old_netflix_press_kit_last_updated_2011/"
    },
    {
        "id": "1k5zk1v",
        "author": "Phantom90AG",
        "title": "Wednesday Season 2 - Teaser Trailer, First Look Images and Netflix Release Dates Revealed",
        "content": "Netflix has released the official teaser trailer, key art and first look images for WEDNESDAY SEASON 2, which will officially launch in two parts on 6^(th) August 2025 (Part 1) and 3^(rd) September 2025 (Part 2), exclusively on Netflix.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k5zk1v/wednesday_season_2_teaser_trailer_first_look/"
    },
    {
        "id": "1k63n9i",
        "author": "Scared-Artichoke-768",
        "title": "Help me find name of reality star",
        "content": "Can anyone please help me find the name of this reality star? I could swear that she is British and is on a Netflix show. She has long blonde hair with dark roots and a deeper voice.\n\nI can picture her face, but can’t figure out where she is from.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k63n9i/help_me_find_name_of_reality_star/"
    },
    {
        "id": "1k63dg7",
        "author": "sexyscoob",
        "title": "Cant download eps shows downloaded on too many devices.",
        "content": "My plan allows me to download on kust one device I have logged out from the remaining devices since I was unaware which device was downloading episodes. I am still unable to download the episodes it shows. Either I have downloaded on too many devices or my plan doesnt support fownloading which it does.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k63dg7/cant_download_eps_shows_downloaded_on_too_many/"
    }
]