[
    {
        "id": "1n5koa1",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 20,
        "comments": 580,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5koa1/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1n51lo0",
        "author": "scoreboard-app",
        "title": "[Match Thread] DUX Logroño - Real Madrid Femenino | Liga F, Matchday 1",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1n51lo0)",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n51lo0/match_thread_dux_logroño_real_madrid_femenino/"
    },
    {
        "id": "1n6vnh5",
        "author": "heykevin08",
        "title": "Rodrygo post: Home 🤍",
        "content": "",
        "upvotes": 724,
        "comments": 54,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wes2zrxtgtmf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n6vnh5/rodrygo_post_home/"
    },
    {
        "id": "1n6r0i9",
        "author": "Bosphore9",
        "title": "OTD 12 years ago Mesut Özil left Real Madrid for joining Arsenal for 50M€",
        "content": "Mesut Özil, the playmaker and no.10 of Real Madrid leaved the club for Arsenal in 2nd September 2013, the last day of the transfer window. His departure shocked everyone (RM players, fans and even Barca players) and was heavily criticised. \nHis teammate Khedira considered that he was top5 at his prime. Fabregas said « They sold their second best player ». Throughout his carrer at Madrid, he made 80 assists in 3 seasons.\nHis last games for Madrid were those of preseason and first two journeys of 2013/14 season. He later revealed that he never wanted to leave.\nWould you have kept him ?",
        "upvotes": 610,
        "comments": 77,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6r0i9/otd_12_years_ago_mesut_özil_left_real_madrid_for/"
    },
    {
        "id": "1n778ao",
        "author": "New-Ad-9981",
        "title": "La Liga: The Most “Elite” Amateur League in the World",
        "content": "Honestly, how does La Liga still market itself as one of the top leagues in the world when every week there's another scandal?\n\n**Referee scandals everywhere** – First the Negreira case, where Barcelona paid a former referees’ official for “consulting” over years. And the story of a ref whose company allegedly had business ties with Atlético Madrid, or another ref who had a painting of Messi on his garden wall. And of course, there’s supposedly no conflict of interest, and the fact that these refs keep making the most questionable decisions against Madrid is just a coincidence. And those were just two of the bigger scandals from last season that involved Real Madrid. Every single week there are smaller controversies — and bigger ones affecting other teams too — with absolutely no sign of things improving anytime soon.\n\n**No goal-line technology in 2025** – Every other major league solved this problem a decade ago. Meanwhile in Spain, you’re still relying on VAR guesswork and dodgy camera angles to decide if a ball crossed the line in billion-euro competitions.\n\n**Offside tech behind the times** – The Premier League uses thicker lines to account for the 2–5 cm margin of error in frame rates and calibration. La Liga? Paper-thin lines and decisions made down to a single pixel, even though the technology itself admits it isn’t that precise. Just look at Mbappé’s goal in the last match — it was clearly onside. How can anyone in this league seriously rule a player offside by 1 mm when experts agree the system has a 2–5 cm error margin?\n\n**And sometimes, VAR just… \"doesn’t work\"** - Somehow, in 2025, there are still games where VAR goes completely offline for \"technical reasons\", leaving clubs in billion-euro competitions at the mercy of human error like it’s 1995.\n\n**Home advantage? Let’s sell it to the US** – Instead of fixing officiating or infrastructure, La Liga wants to stage league games in the United States, stripping smaller clubs of one of the only equalizers they have: home turf advantage.\n\nCorruption scandals, outdated technology, decisions made with zero regard for sporting fairness, and bizarre scheduling issues — this league needs a complete overhaul before it can even be called professional. But Tebas seems to care more about money than about “unnecessary” things like fairness and integrity.\n\n**\"This isn’t football. This is La Liga.\"**",
        "upvotes": 57,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n778ao/la_liga_the_most_elite_amateur_league_in_the_world/"
    },
    {
        "id": "1n78gli",
        "author": "thewonderkid004",
        "title": "I got my first tattoo",
        "content": "",
        "upvotes": 30,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mljcaqazkwmf1.jpeg?auto=webp&amp;s=ffea7913259de8da7b24812790f122984d94daba"
        },
        "permalink": "/r/realmadrid/comments/1n78gli/i_got_my_first_tattoo/"
    },
    {
        "id": "1n6teh6",
        "author": "alleged_loyalty",
        "title": "Big chances conceded by LaLiga teams 25/26 [Managing Madrid]",
        "content": "",
        "upvotes": 225,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9vu8hc2p1tmf1.jpeg?auto=webp&amp;s=d8ce2902f07b9444970ab72b7af67ba9950c7911"
        },
        "permalink": "/r/realmadrid/comments/1n6teh6/big_chances_conceded_by_laliga_teams_2526/"
    },
    {
        "id": "1n6ni8b",
        "author": "NickyBrain_2",
        "title": "just found this on wplace. holy. shit🔥",
        "content": "",
        "upvotes": 400,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5qnmtc1eyrmf1.jpeg?auto=webp&amp;s=bca59243d4e09d1b7f524eb4bafd9f2d2162a8d9"
        },
        "permalink": "/r/realmadrid/comments/1n6ni8b/just_found_this_on_wplace_holy_shit/"
    },
    {
        "id": "1n6me2j",
        "author": "Disastrous-Duty-8152",
        "title": "All of our players that are leaving for international duty",
        "content": "",
        "upvotes": 414,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6me2j/all_of_our_players_that_are_leaving_for/"
    },
    {
        "id": "1n6jeq4",
        "author": "TheFeatherDiaries",
        "title": "LA LIGA August 2025 TEAM OF THE MONTH features Kylian Mbappe , Arda Guler and Dean Huijsen [Whoscored.com]",
        "content": "",
        "upvotes": 454,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1l60ozuz5rmf1.jpeg?auto=webp&amp;s=85b0a09367102244e0ac5c8fe926d85f41605f2c"
        },
        "permalink": "/r/realmadrid/comments/1n6jeq4/la_liga_august_2025_team_of_the_month_features/"
    },
    {
        "id": "1n6etuq",
        "author": "choker_18",
        "title": "In Madrid there is no \"I want to\"..... It's always \"I have to\".",
        "content": "",
        "upvotes": 883,
        "comments": 45,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2jf3469ezpmf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n6etuq/in_madrid_there_is_no_i_want_to_its_always_i_have/"
    },
    {
        "id": "1n6sxhe",
        "author": "cyrusmancub",
        "title": "Rodrygo: “Historia por hacer”",
        "content": "",
        "upvotes": 115,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6sxhe/rodrygo_historia_por_hacer/"
    },
    {
        "id": "1n6n5uq",
        "author": "sankethan3",
        "title": "Feel bad for Fran Garcia",
        "content": "Fran García’s journey at Real Madrid hasn’t been easy. Despite his talent and dedication, he struggles to get consistent minutes due to fierce competition in the squad. It’s tough to see a player with such potential sidelined so often. You can’t help but feel bad, as he truly deserves more chances. What are your views on this?",
        "upvotes": 194,
        "comments": 80,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6n5uq/feel_bad_for_fran_garcia/"
    },
    {
        "id": "1n6nyn2",
        "author": "mikesartwrks",
        "title": "Artist from Ireland. Painting of Cristiano I finished a couple of months back 👍",
        "content": "",
        "upvotes": 172,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6scdbvwf1smf1.jpeg?auto=webp&amp;s=d14b6c66fcd06a1816ad808dd264aa90aafba829"
        },
        "permalink": "/r/realmadrid/comments/1n6nyn2/artist_from_ireland_painting_of_cristiano_i/"
    },
    {
        "id": "1n6bz6n",
        "author": "EffectiveTie3144",
        "title": "OTD September 2nd 2013, Gareth Bale was presented at the Santiago Bernabéu as a new Real Madrid player.",
        "content": "",
        "upvotes": 1090,
        "comments": 50,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6bz6n/otd_september_2nd_2013_gareth_bale_was_presented/"
    },
    {
        "id": "1n6k9zu",
        "author": "Fluffy-Walrus3866",
        "title": "Marc Guehi for free is ideal",
        "content": "I wonder how people feel about this. I imagine most people will think meh because he’s not the big flashy signing like konate, saliba, etc. HOWEVER, this guy is the type of personality we want. Calm guy. Has stepped up to every level he’s been asked to. Like when he stepped up to playing for the English national team which is a pressure cooker. He’s got a great, professional personality. Just look at how he handled his potential transfer to Liverpool all summer, continuing to put his head down and playing til the last game for crystal palace. If we can get him for free, I know this guy is not the type to come in demanding Alaba-like wages. I regularly watch the prem and I’m a big fan. Would love to see this. \n",
        "upvotes": 115,
        "comments": 77,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6k9zu/marc_guehi_for_free_is_ideal/"
    },
    {
        "id": "1n5tyk1",
        "author": "zains43",
        "title": "Deadline day as a madrid fan",
        "content": "",
        "upvotes": 1311,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c2k7nub62lmf1.jpeg?auto=webp&amp;s=c61e7e978b3a8c8521e28e9fcc8c929c349852aa"
        },
        "permalink": "/r/realmadrid/comments/1n5tyk1/deadline_day_as_a_madrid_fan/"
    },
    {
        "id": "1n6a5my",
        "author": "clantz8895",
        "title": "Let's talk about it one of the most underrated players of the three peat era. It is Isco",
        "content": "I would have posted a picture too but it got removed. Isco was fundamental for like 4 years straight. One of the best footballers and I know people appreciate him at Betis but wow was this dude something else. I feel bad for anybody who didn't get to see his peak. Dude was doing shit only a handful of players can. Go watch his highlights and tell me he is not one of the most technical footballers of all time",
        "upvotes": 73,
        "comments": 33,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6a5my/lets_talk_about_it_one_of_the_most_underrated/"
    },
    {
        "id": "1n5up1w",
        "author": "SeamenMobster",
        "title": "Xabi convincing Rodrygo to stay and challenge Vini for his position will end up one of the most important decisions by end of season.",
        "content": "Now that the market is closing and we can confirm that Rodrygo is staying (at least till Jan), I want to point out how important it is to have 2 world class wingers fight for the same position. They should push each other's level beyond what being a guaranteed starter can get you and WE WILL BE HERE FOR IT!",
        "upvotes": 425,
        "comments": 92,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5up1w/xabi_convincing_rodrygo_to_stay_and_challenge/"
    },
    {
        "id": "1n5jcrv",
        "author": "RecognitionPrudnt12",
        "title": "Players with most champions league titles.",
        "content": "",
        "upvotes": 1648,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/krlnnn0zlimf1.jpeg?auto=webp&amp;s=a83337a99016cd0ace9db82413e87e90eaa6f352"
        },
        "permalink": "/r/realmadrid/comments/1n5jcrv/players_with_most_champions_league_titles/"
    },
    {
        "id": "1n5ox8l",
        "author": "Plane_Outside5646",
        "title": "Fede valvarde / Tchoumeni",
        "content": "When Bellingham returns, I think our midfield balance needs adjusting. If we play with 3 midfielders, we shouldn’t start both Valverde and Tchouaméni together since neither is very comfortable on the ball. Instead, we should pair Bellingham and Arda Güler for control and creativity, with either Valverde or Tchouaméni alongside them for ball-winning. Bellingham should play as a CM, while Güler plays higher up as the AM to avoid being bullied physically deeper. This setup gives us both ball control and defensive stability. However, if we go with a 4-man diamond, then both Valverde and Tchouaméni can fit in",
        "upvotes": 196,
        "comments": 173,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5ox8l/fede_valvarde_tchoumeni/"
    },
    {
        "id": "1n5me0t",
        "author": "Aggressive-Row-4489",
        "title": "Who will be sacrificed after bellingham returns?",
        "content": "After our back to back wins, i have been thinking about our lineup after bellingham comes back from the injuries. Ideally, i think the best lineup we would have at our disposal is the current defense, midfield of tchoumeni, valverde and Arda and an attack of Bellingham, Mbappe and Vini. I think that playing Bellingham in the central role would be perfect for our team to utilize those dangerous crosses from Trent(we don't have any attackers in the box when we cross) . Also, bellingham can play as a CM when arda or valverde is pushing high. Mbappe being Mbappe will thrive on either side of the wing and we also know what vinicius is capable of when he is in form . Also when we play a high pressing team , we can switch Arda for Ceballos as the closet player we have that is press resistant and control the tempo is him.  There are so many qualities and depth right now in our team I fear there will be problems in the dressing room due to the lack of playing time once everyone is fit. What do you guys think?",
        "upvotes": 120,
        "comments": 106,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5me0t/who_will_be_sacrificed_after_bellingham_returns/"
    },
    {
        "id": "1n5imc7",
        "author": "Lekanswanson",
        "title": "This season, tactically wise, performance wise so far has been way more enjoyable than any match last season",
        "content": "This post isn't to shit on Ancelotti, he was a fantastic manager for us and helped stabilize the cup and brought plenty of silverware and I will forever be grateful for that.\n\nWhat I will say is this season even though its obvious the team is still adapting to Xabi's instructions and playstyle and with the a lot of new additions to the team, it feels like for the first time in a long time, I am enjoying watching realmadrid actually play again. \n\nFor a long time it felt like I was watching because I had to watch it and there was no inspiration watching the team play and the only thing that mattered was the end result and while the results are truly the most important thing, as fans that is not what inspires us to start supporting the team and become lifelong fans.\n\nI want to sit down and watch a madrid game with excitement, expectations and enjoyment and I think Xabi is bringing that back slowly. The little intricate plays in tight spaces, the runs, the passing, movement and swagger this club has been known for feels like it's coming back and that was show in the marcelo like passing from Trent, the Ronaldo like chop from Vini and the ramos esque passing from Dean. \n\nThe results are obviously vital and very important but I urge the fanbase to give Xabi and the players time, let them cook and to support them when they eventually struggle but I believe sooner rather than later we will become a dominant force again.\n\nHala Madrid!",
        "upvotes": 151,
        "comments": 32,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5imc7/this_season_tactically_wise_performance_wise_so/"
    },
    {
        "id": "1n5jx7o",
        "author": "InsideCastilla",
        "title": "There is no better time to join the new Real Madrid Castilla sub! We are almost at 100 members",
        "content": "Every top Madridista should be taking an active interest in Castilla and the academy to fully understand how the club operates, and who their next big stars may be. Come and join us!",
        "upvotes": 77,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5jx7o/there_is_no_better_time_to_join_the_new_real/"
    },
    {
        "id": "1n52ekn",
        "author": "RecognitionPrudnt12",
        "title": "A new legend is here 💎",
        "content": "Thank you Real Madrid for this true master. Dean Huijsen is showing great signs for being one of Real Madrid legends . He will make history here . We can see it and feel it with every touch , pass , tackle he makes. The difference line is more ensuring and subtle with him in the field.\nWe are proud and happy to have a true master like him in our squad.\nHala Madeid",
        "upvotes": 892,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/s83qczpdgemf1.jpeg?auto=webp&amp;s=a99fd4d13162a909be7d9409027ca007c5c1191b"
        },
        "permalink": "/r/realmadrid/comments/1n52ekn/a_new_legend_is_here/"
    },
    {
        "id": "1n5wm3i",
        "author": "DapumaAZ",
        "title": "Espanyol date and time confirmation",
        "content": "Now that the Champions League Draw has been verified, how long is it going to take La Liga to firm up these dates and times for the Espanyol match ?  Right now the official sight has up to matchday 4 in the league and then matchday 1 and 2 for the champions league \n\n  \nla liga matchday 5, 6, and 7 all say date and time to be confirmed",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5wm3i/espanyol_date_and_time_confirmation/"
    },
    {
        "id": "1n562um",
        "author": "FrrancondonaEra",
        "title": "Francadona highlight from last game",
        "content": "",
        "upvotes": 420,
        "comments": 102,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bltuu20h6fmf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n562um/francadona_highlight_from_last_game/"
    },
    {
        "id": "1n4sfzl",
        "author": "No-Independent2522",
        "title": "The best signing this summer?",
        "content": "",
        "upvotes": 2316,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xdqs9qbcdcmf1.jpeg?auto=webp&amp;s=7ce989639e68ec27ed0a3064b7537bc42eb7c543"
        },
        "permalink": "/r/realmadrid/comments/1n4sfzl/the_best_signing_this_summer/"
    },
    {
        "id": "1n60e8p",
        "author": "Defiant_Health3469",
        "title": "Jornada 19-21 Septiempre",
        "content": "Guys, the match against Espanyol, it says it will be on Sunday 5pm (it says all la Liga games will take place at that time). Is that true or is this still something like a “placeholder” and will change eventually? We are in Madrid that weekend and would want to see the match. Thanks in advance. Oh and one of our mates would wear the Barca jersey, so both fans will hate him 😁",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n60e8p/jornada_1921_septiempre/"
    },
    {
        "id": "1n5kdh5",
        "author": "Massive_Resource6410",
        "title": "Translation of the song “Cibeles” by Sergio Ramos",
        "content": "So, our beloved captain Sergio Ramos has published a song called Cibeles: \n\nhttps://youtu.be/TU0AxQ2of7I?si=SkxOo9iKtHw6CFtW\n\nHere’s the translation of the lyrics (by ChatGPT):\n\n\n[Intro]\nThere are things I never told you\nThat still hurt me\nI never wanted to leave\nYou asked me to fly, woh-uoh-oh\nYou asked me to fly, uh-oh\nYou asked me\n\n[Verse 1]\nI would’ve killed for you, I loved you and I defended you\nBut it wasn’t within me\nYou asked me to fly\nI dressed up in gala, I gave you blood and sweat\nI enjoyed you and I suffered you\n\n[Chorus]\nI hope it goes well for you\nEven though without you I feel bad\nGood thing I walked away\nBecause you didn’t treat me the same\nYou loved me and I loved you\nBut someone always gives more\nIt was all just as I dreamed\nUntil it was time to wake up\n\n[Verse 2]\nI gave you a crown, you gave me wings\nI didn’t know they were only so I’d fly away\nAnd I look at you now, you’re still just as beautiful\nNobody is indispensable, life teaches you that\nA match lasts 90’, and I gave you ninety-three more on top\nI never got tired of trying, this story was a legend\nI’d rather die on my feet than live on my knees\nI’ll give my heart even if it’s returned to me damaged\n\n[Chorus]\nI hope it goes well for you\nEven though without you I feel bad\nGood thing I walked away\nBecause you didn’t treat me the same\nYou loved me and I loved you\nBut someone always gives more\nIt was all just as I dreamed\nUntil it was time to wake up\n\n[Outro]\nO-O-Ovy On The Drums\nYou forgot about me, you left me aside\nWithout being able to decide, that’s what hurts the most\nAnd even though it was like that, I’d come back delighted\nOnce and up to a thousand times\nAnd you know it, Cibeles, uh-oh-oh\nAnd you know it, Cibeles, uh-oh\nAnd you know it, Cibeles",
        "upvotes": 26,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4FMtgzaYD-MysbE5v-UUbwnoRbWkx_f-6HwX2gL5uUo.jpeg?auto=webp&amp;s=7f196576b1da185b195f2dfd00c0af4150e3e3f8"
        },
        "permalink": "/r/realmadrid/comments/1n5kdh5/translation_of_the_song_cibeles_by_sergio_ramos/"
    },
    {
        "id": "1n4vzjo",
        "author": "Fit_Advice_1919",
        "title": "Trent can be the kroos replacement",
        "content": "",
        "upvotes": 883,
        "comments": 90,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vawvye4p6dmf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n4vzjo/trent_can_be_the_kroos_replacement/"
    },
    {
        "id": "1n4xlbv",
        "author": "ReplacementUnited740",
        "title": "Our young goat's placements when he doesn't have the ball",
        "content": "The video criticizes the lack of decision and his lack of offensive effort without the ball.\n\nI think it's because of Mbappe's goalscoring instinct.  During the whole action he only thought about how he could score a goal himself.He was waiting for Vini to pass to the left so he could receive a cross and score.You don't score so many goals without having a great goalscoring instinct (32 goals in 35 matches is incredible).\n\nBut the problem is that he didn't think for a second that he wasn't the other 4 options during the counterattack:\nIf he had made a call to the left it could have created space for the player on the right \nIf he made a call to the right it would have created space for the player on the left \nIf he makes a call at the start of the action (vini seemed to be waiting for that) he could have been served in depth \nOr even Vini could have had plenty of space if the defenders misunderstood each other during Mbappe's deep run. \n\nI guess he thinks like that because he was often the only serious attacking option at PSG (Neymar was very often injured and Messi scored 7 goals during his first season at PSG) It would be good for the team if he made more offensive effort without the ball, I mean vini's goal is almost lucky (his luck = talent)\n\nAnd a question for the moderators: is it forbidden to make posts to talk about tactics outside of live matches? I mean one of my posts was deleted for no reason even though I just talked about tactics and was respectful/didn't insult anyone/no swear words/nothing +18\n\nIf it's forbidden for you, it would be cool to remove the ban, We always get better football analyses when we're not in the emotion of the live match.",
        "upvotes": 381,
        "comments": 72,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/przvl1h2idmf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n4xlbv/our_young_goats_placements_when_he_doesnt_have/"
    }
]