[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1pjppb1",
        "author": "mattgwa",
        "title": "International meeting Torino",
        "content": "If you need to make new international friends in Torino and practice languages I organize an international meeting\n\nIt is held every Tuesday at 8pm at Tipsy, piazza Vittorio Veneto 23B, Torino.\n\nThis project is 100% based on volunteering, 100% no-profit and open to everybody.\n\nIt's very useful to connect internationals living or travelling in town and locals, make new friends and practice languages.\n\nHere is the link to our WhatsApp group: [https://chat.whatsapp.com/Glkd55ANFrXD468PVSih8q](https://chat.whatsapp.com/Glkd55ANFrXD468PVSih8q)\n\n... and here's the link to our page on Meetup: [https://www.meetup.com/torino-international](https://www.meetup.com/torino-international)\n\nWhat do you think about my project?",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pjppb1/international_meeting_torino/"
    },
    {
        "id": "1pjejk3",
        "author": "zerozerosettete11",
        "title": "Com'è Torino per i mercatini di Natale?",
        "content": "Una ragazza che sto frequentando tiene molto al Natale e cavolate simili, io per niente. Vorrei accontentarla portandola ad un mercatino di Natale senza però allontanarmi troppo da casa. E magari a Torino avrei pure l'occasione di andarmi a vedere una partita. Che dite, si presta?",
        "upvotes": 22,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n39ctx2kyf6g1.jpeg?auto=webp&amp;s=077ea3a514ed96981ed76151172503a0f9216192"
        },
        "permalink": "/r/torino/comments/1pjejk3/comè_torino_per_i_mercatini_di_natale/"
    },
    {
        "id": "1pja3rj",
        "author": "FrancoSerra1712",
        "title": "Torino sta diventando Milano",
        "content": "Ma è possibile che trovare anche solo una stanza per studenti stia diventando proibitivo? \n\nQuando mi sono trasferito 2 anni , ho scelto Torino proprio perche più economica, ma adesso trovare una stanza sui 350/375 max sembra impossibile.\n",
        "upvotes": 22,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1pja3rj/torino_sta_diventando_milano/"
    },
    {
        "id": "1pjsha8",
        "author": "Formal-Surprise9705",
        "title": "How to apply",
        "content": "Hello everyone, I’m an aspiring Indian student interested in studying at the University of Turin, and I would truly appreciate your guidance. Could anyone please explain the correct process for international students from India to apply, including important documents and timelines? I would also like to know which scholarships are most helpful for students from low-income families—especially options like EDISU or other financial aid that covers tuition, accommodation, or living costs. Additionally, I’m curious about part-time job opportunities for students in Turin, the average cost of living, and what the classes and teaching style are like for international learners. Lastly, it would help a lot if you could share honest experiences about the social environment—specifically, whether Indian or Asian students face racism, or if the community is generally welcoming. Any advice, tips, or personal experiences would mean a lot to me.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pjsha8/how_to_apply/"
    },
    {
        "id": "1pjrsdx",
        "author": "nickname1917",
        "title": "Voi da chi preferite essere colonizzati?",
        "content": "Indiani, francesi, milanesi... c'è l'imbarazzo della scelta\n\nhttps://preview.redd.it/xwue22fr3j6g1.png?width=879&amp;format=png&amp;auto=webp&amp;s=639c848a1ee9c3637815493c20ea14d0628e7e3b\n\nhttps://preview.redd.it/yq7t8yer3j6g1.png?width=871&amp;format=png&amp;auto=webp&amp;s=7c13c36217201fe3aeed58a70515bb7da70b886e\n\nNotare che il fatto che l'India si sta comprando Torino ed il Piemonte è riportato come \"Piemonte e India mai così vicini\"  \n",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1pjrsdx/voi_da_chi_preferite_essere_colonizzati/"
    },
    {
        "id": "1pj70c5",
        "author": "ggiuliahz",
        "title": "Cerco amicizie",
        "content": "Ciao a tutti! Sono una ragazza di 24 anni e abito in provincia di Torino e sto cercando nuove amicizie! \nMi piace il cinema, le serie tv, i libri, i videogiochi e tanto altro: se condividete gli stessi interessi magari ci possiamo prendere un caffè insieme :)\nScrivetemi pure se siete interessati! ",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1pj70c5/cerco_amicizie/"
    },
    {
        "id": "1pjedt4",
        "author": "happy_arounding15",
        "title": "Amici torinesi, che mi consigliate per un cenone di Natale in vostro stile? Piatti tipici? (sono in una situazione alla \"Ti presento i miei\")",
        "content": "Vorrei ingraziarmi il padre della mia ragazza, è il primo Natale che passiamo insieme e cucinerò io. Vorrei rendere omaggio alle sue origini torinesi e dimostrarmi uno che sa come cavarsela (alla Ben Stiller in \"Ti presento i miei\" per capirci). So che è uno molto fiero delle sue radici e che lo lusingherei non imponendogli piatti che mangio solitamente io, penso lo considererebbe un segno di rispetto. Insomma: aiutatemi a comporre il cenone torinese di Natale perfetto",
        "upvotes": 1,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3wp5oh4oxf6g1.jpeg?auto=webp&amp;s=aa412d7c1322803089d1e52a50e8a925f6b16caf"
        },
        "permalink": "/r/torino/comments/1pjedt4/amici_torinesi_che_mi_consigliate_per_un_cenone/"
    },
    {
        "id": "1pjbeph",
        "author": "Sad_Fox_8800",
        "title": "Canale per fare amicizia a Torino",
        "content": "Ciao a tutti, molto spesso vedo in differenti subreddit sempre la stessa richiesta: \"Cerco amicizie\", \"Nuovo/a in città\"... ecc\n\nDa un po' di tempo sto lavorando a un progetto chiamato Broken Chat che permette di fare amicizia nei dintorni di dove si abita.\n\nL'app è disponibile per Android e iOS: [https://api.broken.chat/redirect\\_1](https://api.broken.chat/redirect_1)\n\nC'è anche il sito: [https://broken.chat](https://broken.chat)\n\nUn caro saluto",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3hr0rmw3df6g1.png?auto=webp&amp;s=ba8b01098e92abab46c477341cef173be6b5db75"
        },
        "permalink": "/r/torino/comments/1pjbeph/canale_per_fare_amicizia_a_torino/"
    },
    {
        "id": "1pja5tm",
        "author": "pessjmism",
        "title": "carte pokémon",
        "content": "buonasera! sto cercando qualcuno che venda pacchetti/blister non sovrapprezzati perché ci terrei a fare un regalo al mio ragazzo.\ntrovo soltanto prezzi spropositati e nemmeno un edicola che venda di nuovo i pacchetti a 4 euro come sei mesi fa. \nqualcuno ha consigli? siti o negozi che fa offerte? \ngrazie in anticipo 🌸\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pja5tm/carte_pokémon/"
    },
    {
        "id": "1pjg1e6",
        "author": "Bietto1369",
        "title": "cerco gruppi tg o reddit incontri piemonte",
        "content": "qualcuno ha dei gruppi per incontri occasionali o relazioni in Piemonte?\né da un po' che cerco ma non trovo nulla ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1pjg1e6/cerco_gruppi_tg_o_reddit_incontri_piemonte/"
    },
    {
        "id": "1pj45q5",
        "author": "Appropriate-Donut-49",
        "title": "sala prove a to",
        "content": "ciao !! trasferit a torino un anno fa, oggi finalmente qua per chiedervi : qualcun\\* sa consigliarmi posti a torino da prendere in considerazione per prove musicali?  \ncosto più è basso, meglio è (lol), se ci sono anche degli strumenti da utilizzare top :3 grazie in anticipo &lt;3\n\nEDIT : su materia mi hanno consigliato la sala prove del comala, qualcun\\* sa per caso come ci si organizza? li contatto? mi presento di persona? come funziona? ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pj45q5/sala_prove_a_to/"
    },
    {
        "id": "1pj9w3g",
        "author": "Mine_Antoine",
        "title": "Domanda sul rumore proveniente da Stellantis",
        "content": "Salve,\n\nho intenzione di affittare un appartamento vicino alla fabbrica Stellantis e volevo sapere se c'è rumore.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1pj9w3g/domanda_sul_rumore_proveniente_da_stellantis/"
    },
    {
        "id": "1pix7mu",
        "author": "Slay3r024",
        "title": "come funzionano i tram?",
        "content": "ragazzi buongiorno, ho una domanda, sto vedendo da google maps come arrivare dall'aereporto \"caselle\" di torino come arrivare alla inalpi arena e mi dice di prendere la tratta del tram 4.. adesso, dove abito io non ci sono i tram e non so come funzionano\n\ndevo fare il biglietto a bordo o fuori dal tram?",
        "upvotes": 6,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1pix7mu/come_funzionano_i_tram/"
    },
    {
        "id": "1pixx77",
        "author": "twenty_Two_9594",
        "title": "Cerco gruppetto amici per Padel",
        "content": "Ciao a tutti sono una ragazza di 26 anni di Torino e mi piacerebbe iniziare un corso di Padel, mi piacerebbe se riuscissi a creare un gruppetto di tre quattro persone più o meno sul mio range di età per seguire qualche lezione assieme, smezzarci il costo del maestro e poi un indomani organizzare le partite fra di noi…c’è qualcuno di interessato?\n",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pixx77/cerco_gruppetto_amici_per_padel/"
    },
    {
        "id": "1piv5k0",
        "author": "Canjul93",
        "title": "GDR - Campagna di Daggerheart in partenza il 16 Gennaio",
        "content": "Ciao a tutti!\nSono Gianluca-the.italiandm, sono un game master e membro del Fortunadado (quelli che organizzano ToPlay).\n\nVuoi provare il GdR del momento? Ottimo!\n\nDa Gennaio, in collaborazione con i ragazzi di Daggerheart Italia faremo partire una campagna in presenza al Jolly Joker di Porta Susa, a Venerdì alterni. \nNon è richiesta nessuna esperienza pregressa, ma solo voglia di avventura!\n\nPer qualsiasi domanda commentate, vi lascio anche il link al post Instagram:\nhttps://www.instagram.com/p/DSA1ZW6DFqN/?igsh=bWU0dHJkZ25wY3Q0\n\nVi aspettiamo!",
        "upvotes": 7,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c52qpgohib6g1.jpeg?auto=webp&amp;s=6604370dc657b62b2b2e63076518b049f5f9c879"
        },
        "permalink": "/r/torino/comments/1piv5k0/gdr_campagna_di_daggerheart_in_partenza_il_16/"
    },
    {
        "id": "1pjcd4a",
        "author": "Dremora2z1",
        "title": "Hi my fellow Italians",
        "content": "I’m going to Torino for a few days \n\nJust need some tips for finding weed and hookers \n\nLove yall ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1pjcd4a/hi_my_fellow_italians/"
    },
    {
        "id": "1piewn6",
        "author": "Thin-Tour-4922",
        "title": "How to find a part-time job here?!",
        "content": "As the title suggests, I am really tired of looking. The city is so big, there must be a way to find a job here right.   \n  \nI know I dont know the language yet but it's only been 3 months since I have been here. Anyone has any tips on how to get a part-time job here, anything would do, moreover I have 3 years of experience in customer service, kitchen assitance and manual labour. I am a first year masters student at the Politecnico and I am literally tired and sad to see that there are little to no jobs for students. How am I supposed to make living in this economy without any job. I am not looking for a big salary, just something for the month to pass by. Enough ranting, any suggestions would be appreciated, thank you!!\n\nOn a side note, is it possible to join schools in Torino to get experience as a teacher, I am not a native speaker but my English level is C1 overall. I am not looking for a huge salary, I have a passion for teaching and working with kids. It would help as an experience in my future studies. Is it possible to teach kids English or something in English here?\n\nThanks a lot everyone!",
        "upvotes": 12,
        "comments": 39,
        "media": null,
        "permalink": "/r/torino/comments/1piewn6/how_to_find_a_parttime_job_here/"
    },
    {
        "id": "1phg8oi",
        "author": "SteamPaz",
        "title": "Il Cielo Sopra Torino",
        "content": "",
        "upvotes": 333,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dnes9t47706g1.jpeg?auto=webp&amp;s=23ec38bece363c5b717a7027cfd693789783e8a3"
        },
        "permalink": "/r/torino/comments/1phg8oi/il_cielo_sopra_torino/"
    },
    {
        "id": "1pifjz0",
        "author": "BlackZanna",
        "title": "Migliori associazioni di volontariato animali a Torino",
        "content": "Ciao a tutti, \n\nCome da titolo, vorrei capire quali sono le migliori associazioni di volontariato per animali a Torino e dintorni,\nPer migliori, intendo dire posti che hanno una reputazione di essere luoghi affidabili dove al primo posto viene effettivamente la tutela e la cura degli animali che gestiscono, \nGrazie mille in anticipo a tutti",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pifjz0/migliori_associazioni_di_volontariato_animali_a/"
    },
    {
        "id": "1pi41fz",
        "author": "cristianemeok",
        "title": "Imparare (in realtà insegnare) a guidare",
        "content": "Ciao a tutti!\nSto cercando di insegnare a guidare a mia moglie. Lei frequenta la scuola guida e ha già superato l'esame scritto (ha già il foglio rosso).\n\nMa quando si tratta di guidare ha problemi con i pedali, tra le altre cose. Le lezioni di guida sono costose, ne ha già prese 10 e sta facendo pochi progressi.\n\nViviamo nella zona Millefonti e nei fine settimana andiamo al parcheggio del centro commerciale Lingotto per praticare per qualche ora. Ma è già troppo piccolo e finisce per girarle in tondo (è poco più di un blocco da andata e ritorno)\n\nLei (e io come copiloto) non siamo ancora pronti per uscire a guidare normalmente su strada, almeno finché non avrà imparato a usare bene la frizione. Deve ancora acquisire confidenza con la macchina.\n\nConosci qualche posto più grande dove possiamo guidare senza problemi? \n Come hai imparato a guidare in città?Hai qualche consiglio da darmi? Grazie!!",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1pi41fz/imparare_in_realtà_insegnare_a_guidare/"
    },
    {
        "id": "1phh6sj",
        "author": "Kind-Calendar793",
        "title": "E' arrivato il porta nuova express!!!",
        "content": "Tra i cambiamenti in casa GTT per molte linee urbane, troviamo la sperimentazione del nuovissimo Porta Nuova Express.   \nQuesta linea avrà come scopo quello di ridurre il numero di passeggeri tra le stazioni di Rivoli e Porta Nuova, tra le 7:00 e le 9:30, le fermate sono tre: Rivoli, Bernini e Porta Nuova (lato Via Sacchi), per poi proseguire in Corso Stati Uniti dove effettua capolinea unico. Non so a voi, ma a me ricorda tantissimo il Dora Fly... Cosa ne pensate? Top o flop?   \n🚍: BYD K9   \n🔢: M1N -&gt; Porta Nuova   \n\\#️⃣: 46E   \n📌: Piazza Rivoli ",
        "upvotes": 97,
        "comments": 35,
        "media": null,
        "permalink": "/r/torino/comments/1phh6sj/e_arrivato_il_porta_nuova_express/"
    },
    {
        "id": "1pi7owk",
        "author": "SuccessOriginal9402",
        "title": "Mirafiori Nord. Che tipo di zona è questa?",
        "content": "Ho trovato un appartamento molto carino proprio davanti allo stabilimento **Fiat**, nella zona di **Mirafiori Nord**. Mi interessa soprattutto capire com’è la situazione dell’inquinamento dell’aria e se ci sono rischi importanti per la salute, tipo malattie gravi come il cancro. Nella mia famiglia ci sono stati diversi casi e adesso ci sto molto attenta, vorrei evitare rischi inutili. L’agente immobiliare mi ha detto che la fabbrica è già chiusa e che tutti quegli edifici sono in vendita.",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1pi7owk/mirafiori_nord_che_tipo_di_zona_è_questa/"
    },
    {
        "id": "1phh8vs",
        "author": "Kind-Calendar793",
        "title": "LE NOVITÀ NON SONO FINITE",
        "content": "Dal 1⁰ dicembre sono state introdotte le linee 13+ e 68+, queste sono state istituite per agevolare il carico delle linee 13 e 68 nei rispettivi tratti tra Piazza Statuto e Piazza Vittorio Veneto e Corso Tortona e Porta Nuova",
        "upvotes": 46,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1phh8vs/le_novità_non_sono_finite/"
    },
    {
        "id": "1phdmvd",
        "author": "Necessary_Doctor_328",
        "title": "Qualcuno qui ha sempre voluto imparare la batteria ma non ha mai iniziato? 🥁",
        "content": "Io sono Erik, batterista torinese. Insegno già in una scuola di musica e da un po’ sto aprendo qualche slot per **lezioni private di batteria** qui in zona Torino/cintura.\n\nIl tipo di persone con cui lavoro di più:\n\n* chi parte **da zero totale** (anche se pensa di essere “negato per la musica”)\n* adulti che lavorano e vogliono un’ora a settimana solo per **sfogarsi e staccare**\n* ragazzi/ragazze che vogliono mettere delle basi serie per suonare in band\n\n**Come funziona con me:**\n\n* si parte SEMPRE da una **lezione di prova**: ci conosciamo, ti faccio sedere alla batteria e vediamo da che punto partiamo\n* niente letture di teoria infinite: già dalla prima lezione provi a suonare qualcosa su una base\n* impostiamo un percorso **su misura**: obiettivo band? Hobby? Migliorare il timing? Lo costruiamo insieme\n* studio attrezzato con batteria (elettronica/acustica) e cuffie, così non ti devi preoccupare del volume\n\nSe qualcuno qui si è appena riconosciuto tipo “ok, sono io quello che ci pensa da anni”, scrivetemi pure in DM:  \nposso mandarvi qualche info su **orari, zona e costi** e, se vi va, organizziamo una prova senza impegno.\n\nAnche solo per chiedermi: *“ma non è troppo tardi per iniziare a X anni?”* (spoiler: no, non è mai troppo tardi).\n\nGrazie a chi ha letto fin qui e, se conoscete qualcuno che vorrebbe iniziare, potete girargli il post 🙌",
        "upvotes": 24,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z2jtsso2pz5g1.jpeg?auto=webp&amp;s=a5763cae641a2ead2c157f2010175c3ca8636b94"
        },
        "permalink": "/r/torino/comments/1phdmvd/qualcuno_qui_ha_sempre_voluto_imparare_la/"
    },
    {
        "id": "1phjqry",
        "author": "GanSLAYER",
        "title": "Qualcuno appassionato di musica/concerti/festival?",
        "content": "Tra i vari post a tema \"cerco persone per fare x\" non mi sembra di averne visto alcuno per gente appassionata di musica, perciò eccolo. \nIo sono a Torino da un mesetto, ascolto una miriade di generi e sto in pari con le uscite più recenti (thanks fantano), dal post punk all'elettronica, hyperpop, hardcore, indie pop, experimental rap ecc.. Vado a un bel po' di concerti e festival (quest'anno primavera sound e pukkelpop + una decina di concerti singoli), perciò volevo sapere se c'è gente che si muove spesso o che conosce locali interessanti dove si suona in cui andare.\n \nPs: ho visto [qui](https://www.eventbrite.it/e/anima-larmonia-delle-sfere-tickets-1977139880606) che c'è una serata dove suonano l'album Anima di Thom Yorke questa settimana, qualcuno sa com'è il posto? Magari ci si organizza fra noi nerd di musica ahah",
        "upvotes": 6,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/badoejSA2OIt34rFIM5teco8Ec-n9LX0EF27X16dzMo.jpeg?auto=webp&amp;s=deb5ab09a0747b99fcdc5d296cb9650134a1fa6c"
        },
        "permalink": "/r/torino/comments/1phjqry/qualcuno_appassionato_di_musicaconcertifestival/"
    },
    {
        "id": "1phj9ob",
        "author": "marv150302",
        "title": "Nuove conoscenze",
        "content": "Ciao a tutti, sono un ragazzo di 23 anni, a Torino da 4 per l’università, mi piacerebbe ampliare un po’ il mio giro di conoscenze. Se ti interessano sport( in particolare calcio, palestra e corsa), musica, film, anime, manga, videogiochi o anche semplicemente uscire a bere un bicchiere scrivi pure!\n",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1phj9ob/nuove_conoscenze/"
    },
    {
        "id": "1pgxjw4",
        "author": "sico666",
        "title": "Nuovi amici 2",
        "content": "Siamo 7 amici (f26, 2f28, m28, m29, m26, m31) di Torino e provincia, i nostri interessi in generale gravitano attorno a:\n\n-le feste all'aperto (ci piace la natura)\n-il buon bere\n-il fantasy\n-il cinema\n-i concerti e il teatro\n-le conversazioni profonde\n-sparare cazzate\n- la magia e l'esoterismo\n -le gite\n -la cultura\n -l'arte\n-Igbtq+ \n-videogiochi\nSiamo inclusivi e di mentalità molto aperta, vogliamo ampliare la nostra cerchia. \n\nPer farvi capire chi siamo:\n\n• un intellettuale palestrato con la passione per gli abiti eleganti \n\n• un ragazzo timido, sensibile e introspettivo\n\n• un'artista ADHD un po' punk con la passione per la psicologia e l'horror \n\n• un'antropologa appassionata di esoterismo e concettualità\n\n• un informatico tranquillo e gentile, che quando beve diventa caotico\n\n• una jojobro, strega che ricorda un gatto\n\n•  un ragazzo molto estroverso, con la passione per i vampiri e i profumi ricercati\n\n Astenersi snob, omofobi e razzisti!!!\n\n(Mandate DM!)",
        "upvotes": 26,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1pgxjw4/nuovi_amici_2/"
    },
    {
        "id": "1pgra26",
        "author": "spacecraft628",
        "title": "DISCOTECA DAI 35 ANNI IN SU: SONDAGGIO",
        "content": "Ciao a tutti!\n\nSe ci fosse una serata in discoteca pensata principalmente con musica per adulti dai 35 anni in su, dalle 18.00/18.30 fino alle 23.00/24.00, preferireste andare di sabato, di domenica o andrebbero bene entrambi allo stesso modo?\n\nMi aiutate? Grazie!",
        "upvotes": 3,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1pgra26/discoteca_dai_35_anni_in_su_sondaggio/"
    }
]