[
    {
        "id": "1kg4hsh",
        "author": "TheSurferAMA",
        "title": "Hey reddit! I'm Lorcan Finnegan. I directed THE SURFER, starring Nicolas Cage. It premiered at Cannes and is now out in theaters worldwide. I also directed VIVARIUM, a fantasy-horror starring Jesse Eisenberg and Imogen Poots and NOCEBO, a thriller starring Eva Green and Mark Strong. Ask me anything!",
        "content": "Hey reddit! I'm Lorcan Finnegan. I directed THE SURFER, starring Nicolas Cage. It premiered at Cannes and is now out in theaters worldwide. I also directed VIVARIUM, a fantasy-horror starring Jesse Eisenberg and Imogen Poots and NOCEBO, a thriller starring Eva Green and Mark Strong. Ask me anything!\n\nTHE SURFER is out now in theaters.\n\n\\&gt; A man revisits his childhood beach to surf with his son. Humiliated by locals, he becomes entangled in an escalating conflict that pushes him to his limits.  \n\\-**Starring**: Nicolas Cage; Julian McMahon; Nic Cassim; Miranda Tapsell; Alexander Bertrand; Justin Rosniak\n\nTrailer:\n\n[https://www.youtube.com/watch?v=A7Bo6cyfWho](https://www.youtube.com/watch?v=A7Bo6cyfWho)\n\nI've also directed VIVARIUM, NOCEBO, and WITHOUT NAME.\n\nI'll be back at 1 PM PT/4 PM ET today (Tuesday 5/6) to answer your questions.\n\nAsk me anything!",
        "upvotes": 27,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sbq4tr9kx5ze1.png?auto=webp&amp;s=7ff526d43dfa4bb29663718620ef534aff485a8d"
        },
        "permalink": "/r/movies/comments/1kg4hsh/hey_reddit_im_lorcan_finnegan_i_directed_the/"
    },
    {
        "id": "1kg4308",
        "author": "MarvelsGrantMan136",
        "title": "First Images from Francis Lawrence's 'The Long Walk' - The story follows a group of young men in a dystopian future who embark on a life-or-death marathon with no set finish line",
        "content": "",
        "upvotes": 993,
        "comments": 205,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m5v01ze9v5ze1.jpeg?auto=webp&amp;s=dee16cbc6dda1e06373201914afe06764c066068"
        },
        "permalink": "/r/movies/comments/1kg4308/first_images_from_francis_lawrences_the_long_walk/"
    },
    {
        "id": "1kg57rk",
        "author": "MarvelsGrantMan136",
        "title": "First Image of George Clooney in Noah Baumbach's 'Jay Kelly' - Two middle-aged friends (Clooney and Adam Sandler) rediscover their youthful spirit during a chaotic weekend reunion, facing hilarious mishaps and heartfelt moments that force them to finally grow up.",
        "content": "",
        "upvotes": 769,
        "comments": 115,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k29hgxe846ze1.jpeg?auto=webp&amp;s=22290393ab8378039934b91e6ecec383d771c7a6"
        },
        "permalink": "/r/movies/comments/1kg57rk/first_image_of_george_clooney_in_noah_baumbachs/"
    },
    {
        "id": "1kg71aa",
        "author": "NoCulture3505",
        "title": "Amazon Lands Worldwide Rights To Jason Statham Sequel 'Beekeeper 2'",
        "content": "",
        "upvotes": 324,
        "comments": 102,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fMBnT3X41iqSCC_RhFPA5P1S7pM2kby_msiQiQoCEeY.jpg?auto=webp&amp;s=fc84858778135791e55812cf9b0115c5927a1a1d"
        },
        "permalink": "/r/movies/comments/1kg71aa/amazon_lands_worldwide_rights_to_jason_statham/"
    },
    {
        "id": "1kfzw63",
        "author": "FilmWaffle-FilmForum",
        "title": "What is the greatest female villain performance of all time?",
        "content": "When the question of “what is the greatest villain performance of all time” comes up, people tend to list the same actors. I very rarely see any female villain performances mentioned. \n\nFirst one that comes to mind is Allison Williams in Get Out. She played a sadistic, manipulative villain to an absolute T. ",
        "upvotes": 955,
        "comments": 855,
        "media": null,
        "permalink": "/r/movies/comments/1kfzw63/what_is_the_greatest_female_villain_performance/"
    },
    {
        "id": "1kfo1o1",
        "author": "MarvelsGrantMan136",
        "title": "‘The Toxic Avenger’ Is Officially UNRATED for Ultra Violence, Mutant Nudity, and More",
        "content": "",
        "upvotes": 5962,
        "comments": 391,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/T9qvM8ayvSFtsD6loxrCsFtGtdkLHYwAQpgqbJonVrY.png?auto=webp&amp;s=7b9db109886878cef37dd1b3cb636ec1fa13d5ad"
        },
        "permalink": "/r/movies/comments/1kfo1o1/the_toxic_avenger_is_officially_unrated_for_ultra/"
    },
    {
        "id": "1kg167w",
        "author": "Dimitri13_",
        "title": "What's a movie that genuinely made you sit in silence after the credits rolled - not sad, not happy, just stunned?",
        "content": "Which movie left you completely marked after the credits rolled?                                                                        \n                                                                                             \nA movie so good you thought about for hours even days after you watched it.",
        "upvotes": 504,
        "comments": 1504,
        "media": null,
        "permalink": "/r/movies/comments/1kg167w/whats_a_movie_that_genuinely_made_you_sit_in/"
    },
    {
        "id": "1kfhlk6",
        "author": "Lulcielid",
        "title": "A24’s $3.5B Valuation Pushes the Indie Studio Toward Blockbusters",
        "content": "",
        "upvotes": 8092,
        "comments": 468,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oeN1A_tY-KvZWMgFukOMTWGwvjs8JU-gOlqjVdI3QxY.jpeg?auto=webp&amp;s=88d61fdc6ecb327f44b644c64cd8094f544cdc3c"
        },
        "permalink": "/r/movies/comments/1kfhlk6/a24s_35b_valuation_pushes_the_indie_studio_toward/"
    },
    {
        "id": "1kg7f84",
        "author": "KillerCroc1234567",
        "title": "Zoey Deutch, Jon Hamm, John Slattery Starring in R-Rated Hollywood Comedy From 'Wet Hot American Summer' Director David Wain",
        "content": "",
        "upvotes": 102,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8ukxAXEkwb4vssS0g5wV5nfs1f5lvFz9gwJSq4d0xjU.jpeg?auto=webp&amp;s=f53ade1a4ccf0d6f6d87b7f4eb0da65339601e92"
        },
        "permalink": "/r/movies/comments/1kg7f84/zoey_deutch_jon_hamm_john_slattery_starring_in/"
    },
    {
        "id": "1kfvu00",
        "author": "FunShorts",
        "title": "What movie has the most \"all-star\" cast, all time?",
        "content": "\nWhat movies most come to mind when thinking of movies with the most big names?\n\nNot necessarily saying each star has to have a large role, just a credit in the movie.\n\nAny era, even if it was before someone became a big star.\n\nThe 2000s Oceans movies come to mind for me. Also, The Godfather movies, where it's possible Part 2 has more names due to De Niro being in that one.",
        "upvotes": 737,
        "comments": 1154,
        "media": null,
        "permalink": "/r/movies/comments/1kfvu00/what_movie_has_the_most_allstar_cast_all_time/"
    },
    {
        "id": "1kg4z33",
        "author": "indiewire",
        "title": "Anthony Bourdain A24 Biopic 'Tony' Is Casting For Real Chefs",
        "content": "",
        "upvotes": 98,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NX1Lyyw6Uip253H9TNU6jh2Wf8M4PR5is8RxBvDD_90.jpeg?auto=webp&amp;s=3b7eeb8b575e514fab615f06b2d820bf901ad5a8"
        },
        "permalink": "/r/movies/comments/1kg4z33/anthony_bourdain_a24_biopic_tony_is_casting_for/"
    },
    {
        "id": "1kg0yi3",
        "author": "Ezra_Porter16",
        "title": "Meet Joe Black made me rethink what real love and connection actually look like",
        "content": "I’ve seen Meet Joe Black three times now, and every time it impacts me more. As a guy who doesn’t usually enjoy romance-heavy movies, I didn’t expect this one to grab me the way it did—but it really did. It’s not just about love or death or philosophy—it’s about the kind of deep, genuine connection that most of us long for but rarely see portrayed with this kind of sincerity.\n\nWhat really hit me is the portrayal of Death—not as a monster or villain, but as a spirit who’s never experienced life, love, or connection. Watching Death interact with Susan feels innocent, honest, and deeply curious. He doesn’t approach her with game or charm or hidden motives. He’s just… open. Vulnerable. Trying to understand why being around her makes him feel something entirely new.\n\nAs a 22-year-old married man, that spoke volumes to me. I think a lot of guys are taught—either directly or through culture—that love is about conquest, performance, or even just fulfilling expectations. But Meet Joe Black shows a kind of love that’s raw and unfiltered. Death doesn’t even know what he’s feeling—he just knows that being close to Susan matters to him. That kind of presence and simplicity is something I think a lot of us have lost or never learned to begin with.\n\nThe sex scene between them really stood out, not because it was graphic (it wasn’t), but because it felt sacred. I don’t usually like sex scenes in movies—they often feel cheap, or like they’re just there for shock or entertainment. But this one felt like something else entirely. It felt like watching someone experience intimacy for the first time—not just physically, but emotionally and spiritually. There’s no lust, no selfishness—just a desire to be close, to be known, and to hold something real with someone else. It made me reflect on how important it is to approach love and sex with purity—not just in terms of physical boundaries, but in terms of motive and mindset. Are we connecting to consume or to truly unite?\n\nThen there’s the quote from Bill to Death that’s been echoing in my head ever since:\n“Truth, responsibility, taking the weight for your choices and feelings, and spending the rest of your life living up to them. And above all, not hurting the object of your love.”\n\nThat line punched me in the chest. Because that’s the part of love we don’t talk about enough—the weight. Love isn’t just about chemistry, passion, or even compatibility. It’s about making a choice, over and over again, to be someone your partner can rely on. To carry the consequences of your actions. To not run when things get hard. To live with integrity and protect the heart of the person who trusts you with theirs. That’s what being a husband means to me, and this movie put words to it in a way I hadn’t felt before.\n\nI recommend any guy watch this movie—especially if you’ve ever felt unsure or confused about what love really is. If you’ve struggled with warped ideas about sex, bonding, or what emotional connection looks like, Meet Joe Black might surprise you. It’s not a perfect film, but it’s honest, and sometimes that’s the thing that sticks with you most.",
        "upvotes": 117,
        "comments": 43,
        "media": null,
        "permalink": "/r/movies/comments/1kg0yi3/meet_joe_black_made_me_rethink_what_real_love_and/"
    },
    {
        "id": "1kg65vl",
        "author": "ChiefLeef22",
        "title": "A24's 'Friendship' - Review Thread",
        "content": "*A man tries to befriend his charismatic new neighbour, but it soon threatens to ruin both of their lives.*  \n  \nDirector: Andrew DeYoung\n\nCast: Tim Robinson, Paul Rudd, Kate Mara, Jack Dylan Grazer\n\n**Rotten Tomatoes:** [91%](https://www.rottentomatoes.com/m/friendship_2024)\n\n**Metacritic:** [78/100](https://www.metacritic.com/movie/friendship/critic-reviews/)\n\nSome Reviews:\n\n[Chase Hutchinson - ](https://www.rottentomatoes.com/critics/chase-hutchinson)[TheWrap](https://www.rottentomatoes.com/critics/source/2205) \n\n&gt;Never could the story be described as a series of sketches haphazardly stitched together as many comedies can fall into being. It looks and feels like a drama that is coming apart at the seams as Robinson careens his way through it.\n\n[Fred Topel - ](https://www.rottentomatoes.com/critics/fred-topel)[United Press International](https://www.rottentomatoes.com/critics/source/2795)\n\n&gt;In Friendship, the world around Craig reacts appropriately to his inappropriate behavior. So whereas an Adam Sandler character, or Bill Murray before him, would endear himself to the audience, Craig just digs himself deeper and deeper.\n\n[Marshall Shaffer ](https://www.rottentomatoes.com/critics/marshall-shaffer)\\- [Slant Magazine](https://www.rottentomatoes.com/critics/source/821) \\- 3/4\n\n&gt;But even for those in the audience whose mileage only goes so far with Robinson’s schtick, *Friendship* has more to offer than cringe-inducing, often bawdy humor. He and DeYoung expertly skewer the rituals that trap men in prisons of consumption and estrange them from their emotions. The film is deeply attuned to male malaise, though it steers away from offering anything resembling an overly academic thesis about its roots. More than anything, *Friendship* makes the conditions of modern masculinity feel as weird to watch as they are to understand\n\n[Variety](https://www.rottentomatoes.com/critics/source/466) \\- [Owen Gleiberman](https://www.rottentomatoes.com/critics/owen-gleiberman)\n\n&gt;Robinson’s brand of middle-class psycho surrealism works perfectly in bite-size sketch-comedy doses. Stretched out to feature length, a character like Craig simply stops making sense.\n\n[AV Club](https://www.rottentomatoes.com/critics/source/833) \\- [Jacob Oller](https://www.rottentomatoes.com/critics/jacob-oller) \\- B-\n\n&gt;But it all relies on the chemistry between the abrasive Robinson and the too-cool Rudd. Their dynamic, either playing off each other or playing with the idea of each other when they’re not sharing the screen, is strong, and DeYoung keeps them both contained to the right frequencies throughout the film. I certainly wish Kate Mara had more to do, or even to react to, as Craig’s wife, but she makes her moments count. And, for better or for (much, much) worse, *Friendship* is one for the boys.\n\n\n\n",
        "upvotes": 45,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_0YFST-YS00vpZwQGzciE2wGp3gQ2If8nVEtgVay8IQ.jpg?auto=webp&amp;s=37197a0b991754d588d429696f1a92901e10b2d5"
        },
        "permalink": "/r/movies/comments/1kg65vl/a24s_friendship_review_thread/"
    },
    {
        "id": "1kfo6ll",
        "author": "SanderSo47",
        "title": "May 2-4 Box Office Recap: 'Thunderbolts*' debuts with a solid $74.3 million domestically and $160.4 million worldwide. Meanwhile, 'Sinners' crosses $200 million worldwide, while 'A Minecraft Movie' nears $900 million worldwide.",
        "content": "https://preview.redd.it/wngz60kwb1ze1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=7c1eddccb860443e3e769a9c792de4692c33d63c\n\nWell, the summer season is officially underway.\n\nThe MCU returned to the first weekend of May, earning another #1 spot with ***Thunderbolts***. Which hopefully will be a sign of good legs ahead. Meanwhile, ***Sinners*** had another incredible hold, despite losing IMAX and other premium-large formats.\n\nThe Top 10 earned a combined $142.3 million this weekend. That's up a massive 108.2% from last year, when ***The Fall Guy*** flopped and delivered the worst start to the summer season in decades.\n\nDebuting on top, Marvel Studios' ***Thunderbolts*** earned $74.3 million in 4,330 theaters. That's below ***Captain America: Brave New World*** ($88.8 million), which premiered on February. Compared to other MCU titles, that's below ***Ant-Man and The Wasp*** ($75.6 million) and ***Shang-Chi and the Legend of the Ten Rings*** ($75.3 million) and above ***Eternals*** ($71.2 million).\n\nAll in all, this is a solid (but not fantastic) debut. At the end of the day, it's a team-up film following secondary characters that aren't very popular, with the exception of Bucky and Yelena. Marvel probably wasn't expecting this film to open at $100+ million, considering ***Brave New World*** didn't get that with a more well known character. ***Thunderbolts*** only had one hook: the introduction of Sentry. There's also curiosity surrounding the meaning behind the asterisk in the title (we'll get to that in a moment).\n\nMarvel knows that audiences haven't been fully on board with some of their previous projects (***Quantumania***, ***The Marvels***, ***Brave New World***, etc.), but they still hoped the audience could be interested in ***Thunderbolts***. To the point that one of its trailers highlighted the crew's involvement in multiple projects (most of which were A24). Well, the crew's involvement at least resulted in some great reviews (88% on RT). Not to mention the fact that back in March, Marvel confirmed that a lot of cast members from the film would be back in ***Avengers: Doomsday*** next year. While that spoiled the fate of the characters, it might have helped boost interest.\n\nAccording to Disney, 65% of the audience was male. Marvel has had a problem in attracting younger audiences, and this film is another proof of that: only 30% of the audience was under 25. What does this mean? That they're losing ground with Gen Z. This has been noted a few years, and it doesn't look like it will be fixed any time soon.\n\nIn some good news, the audience gave the film an \"A–\" on CinemaScore. That represents a solid response from the audience, although the MCU mostly falls in the \"A\" score. At the very least, that's better than ***Brave New World***'s poor \"B–\". There's no competition over the coming weeks, although ***Final Destination: Bloodlines*** will probably dethrone it in its third weekend. We'll see how it goes, but for now, a final total around $200 million is likely for ***Thunderbolts***.\n\nMarvel didn't even wait until the second week just to finally confirm on social media the meaning of the asterisk in the title. Just today, they've started promoting the film [under a new title](https://variety.com/2025/film/news/thunderbolts-poster-the-new-avengers-title-change-1236386731/) (big spoilers in that article). That's a bit too early, but will the audience be more interested in the film now?\n\nEven with the arrival of ***Thunderbolts*** and losing IMAX and other formats, ***Sinners*** was not affected in the slightest. The film dipped just 28% this weekend, adding another $33.1 million. That's almost on par with ***Get Out***'s third weekend drop (26.5%), which is simply insane. The film has earned a fantastic $179.8 million domestically, and it should continue legging out. For now, the film should hit $270 million domestically. The fact that it's getting close to $300 million is simply spectacular.\n\n***A Minecraft Movie*** dropped 40%, adding $13.7 million this weekend. One thing on its favor was [the \"rowdy screenings\" for this weekend.](https://www.hollywoodreporter.com/movies/movie-news/minecraft-movie-block-party-edition-1236202463/) Have theater employees in your hearts, for this might have been a very ugly experience. The film has earned $398.2 million so far.\n\nWell, the math is out and the numbers aren't good for ***The Accountant 2***. The film earned $9.4 million, which is a very poor 61% drop from last week. In contrast, the original dropped just 44.8%. Through 10 days, the film has earned just $41.1 million, which is $6 million below the original through the same point. That gap will continue to widen. For now, the film should finish with around $60 million domestically.\n\n***Until Dawn*** won't see a sunrise any time soon. The film dropped 52%, adding $3.8 million this weekend. That's not a horrible drop for a horror, but considering how low it began, it's simply unremarkable to make a difference. Through 10 days, the film has earned $14.3 million, and it only has one weekend before facing tough competition with ***Final Destination: Bloodlines***.\n\nIn sixth place, ***The Amateur*** dropped 48%, earning $1.9 million. That takes its domestic total to $37 million, and while it should cross $40 million, it won't be by much.\n\n***The King of Kings*** continues losing steam. This weekend, it collapsed another 59%, earning $1.7 million. The film has earned $57.7 million so far, and it won't make it much further than $60 million.\n\nA24's ***Warfare*** dropped 52%, adding $1.2 million this weekend. The film's domestic total stands at $24 million so far.\n\nIn ninth place, the Indian film ***HIT: The Third Case*** earned $955,000 in 950 theaters.\n\nRounding up the Top 10 was another Indian film, ***Guru Nanak Jahaz***. Despite playing in just 119 theaters, it earned $685,000 this weekend.\n\nOutside the Top 10, we find Nicolas Cage's new film, ***The Surfer***. Unsurprisingly, it didn't fare well. It made just $698,114 from 884 theaters. It's not gonna last long on theaters, so hurry up.\n\nA24's ***The Legend of Ochi*** fell outside the Top 10. It collapsed a brutal 76% this weekend, earning just $341,951. The film has earned a meager $2.1 million so far.\n\n#**OVERSEAS**\n\n***Thunderbolts*** also topped the overseas box office, debuting with $86.1 million abroad, for a $160.4 million worldwide debut. That's below ***Brave New World*** ($193.4 million), although that had an extra day on Monday. It was a mixed bag all around; some were pretty good, but others were soft. The best markets were China ($10.4M), UK ($7.7M), Mexico ($7.3M), Brazil ($4M), France ($3.8M), Germany ($3.6M), Korea ($3.5M), Australia ($3.4M), Japan ($3.2M) and Spain ($2.8M). Some of these markets were also boosted from local holidays (Labor Day). We'll wait for the second weekend to see if it has a chance of recouping its $180 million budget.\n\n***A Minecraft Movie*** added $26.6 million, taking its worldwide total to $874.6 million. The best markets are the UK ($69M), Germany ($35.7M), Australia ($33.5M), Mexico ($31.2M) and China ($27.5M). It's still fighting to hit the $1 billion milestone.\n\n***Sinners*** is also holding very well overseas, adding $10.4 million, for a $237.3 million worldwide total. The best markets are the UK ($13.8M), France ($6.7M), Australia ($4.3M), Mexico ($3.4M) and Germany ($2.7M). It's obviously going to skew domestically, but it looks like it could get close to $100 million overseas by the end of its run.\n\n***The Accountant 2*** added $7.2 million overseas, for a $66.3 million worldwide total. Ouch, that's not actually great. Or good at all. It should still hit $100 million worldwide, but it feels like it should've done that without problem.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Black Bag* | Mar/7 | Focus Features | $7,607,250 | $21,474,035 | $39,284,035 | $50M\n*The Day the Earth Blew Up: A Looney Tunes Movie* | Mar/14 | Ketchup | $3,158,830 | $8,875,344 | $13,896,775 | $15M\n*The Woman in the Yard* | Mar/28 | Universal | $9,395,255 | $22,405,985 | $23,175,286 | $12M\n\n- \"Make a good original movie and people will watch it.\" Yeah, where were you when ***Black Bag*** played in theaters? Steven Soderbergh's film earned critical acclaim, but it has ended its run with just $39 million worldwide. How frustrating, isn't it? A film that deserved much better. Don't cry for Soderbergh tho; he has just recently said that Focus Features confirmed that the film would eventually be profitable thanks to home media and PVOD. He also recently said that his new film ***The Christophers*** has wrapped filming and could come out this year. Damn, 3 Soderbergh films in a year????\n\n- That's all, folks. ***The Day the Earth Blew Up: A Looney Tunes Movie*** has closed with $13 million worldwide, failing to recoup its $15 million budget. But maybe Ketchup Entertainment is content with its performance, considering they just spent $50 million in buying ***Coyote vs. Acme***, which will come out next year. Let's just hope it fares better than this.\n\n- Universal/Blumhouse's ***The Woman in the Yard*** has closed its run with just $23 million worldwide. That's the second flop in a row for Blumhouse, after the unremarkable run of ***Wolf Man*** back in January. Not to mention ***Drop*** is fading quickly. What's going with Blumhouse?\n\n#**THIS WEEKEND**\n\nNothing lol. For some reason, studios avoided releasing anything noteworthy. The only major release is Lionsgate's ***Shadow Force***, but that has no chance of hitting #1. Probably not even Top 5.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 615,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Iw9byx2wC2SG6Ob24wOxVxQMBj4MpG4-PNO_KDdWCws.png?auto=webp&amp;s=c462741f51ece1ce0db8ed6b07cfb41372f08911"
        },
        "permalink": "/r/movies/comments/1kfo6ll/may_24_box_office_recap_thunderbolts_debuts_with/"
    },
    {
        "id": "1kff7vp",
        "author": "MarvelsGrantMan136",
        "title": "TOGETHER - Official Trailer - In Theaters July 30",
        "content": "",
        "upvotes": 1688,
        "comments": 126,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/caG3Ma6bnqSJY7E8kZZVgtcOViyj_e83DxF_t0BJl2g.jpg?auto=webp&amp;s=12f679c51eae2938754882e4a2037f84c43db5a8"
        },
        "permalink": "/r/movies/comments/1kff7vp/together_official_trailer_in_theaters_july_30/"
    },
    {
        "id": "1kg07z5",
        "author": "JazzlikeTea7432",
        "title": "Who is the most forgotten 90s celebrities in Hollywood after they did well and amazing in the 90s?",
        "content": "Since I done the 80s now I am doing the 90s for the celebrities who were incredible but are completely forgotten afterwards, so in my opinion I think David Strickland was a struggling actor and he wasn't very popular but had a less few hits of TV shows but he sadly passed away in 1999. \n\nAnother one was Rachel Leigh Cook was another successful in the 90s thanks to her film with Freddie Prize Jr, she was so good but until the early 2000s.\n\nEven some of the American Pie actress like Shannon Elizabeth, she was popular for that film and some others but then suddenly in the early 2000s she became forgotten and vanished.\n\nWell who else is on this list you remember that became forgotten after their serveal successful films they been in well any suggestions about this?\n",
        "upvotes": 63,
        "comments": 302,
        "media": null,
        "permalink": "/r/movies/comments/1kg07z5/who_is_the_most_forgotten_90s_celebrities_in/"
    },
    {
        "id": "1kfb18m",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Spike Lee's 'Highest 2 Lowest' Starring Denzel Washington",
        "content": "",
        "upvotes": 2161,
        "comments": 290,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9asi3dvooyye1.jpeg?auto=webp&amp;s=f53a633528ce7c214ff918a10d07644b8fd53dfa"
        },
        "permalink": "/r/movies/comments/1kfb18m/official_poster_for_spike_lees_highest_2_lowest/"
    },
    {
        "id": "1kfye80",
        "author": "TrueEntertainment933",
        "title": "What's a perfect movie that you would not change a single frame of ?",
        "content": "Not necessarily the best movie ever - but that one film where, every time you rewatch it, you think: Yep, they nailed it. Could be for emotional impact, pacing, cinematography, even nostalgia. For me, it's Before Sunset. Just two people walking and talking, but it's so precise and raw that I would not change a second of it. Curious what movie you think is perfect exactly as it is - no edits, no updates, no director's cut needed.",
        "upvotes": 72,
        "comments": 505,
        "media": null,
        "permalink": "/r/movies/comments/1kfye80/whats_a_perfect_movie_that_you_would_not_change_a/"
    },
    {
        "id": "1kfl8f3",
        "author": "ADAP7IVE",
        "title": "What's a movie quote you regularly use in daily life? I'll start",
        "content": "One of mine is from Ocean's Twelve. Brad Pitt's Rusty: \"In the physical universe that we occupy, it cannot be done.\"\n\nTo this day, no one has noticed. Might be because Ocean's Twelve is generally considered a meh film. 😅\n\nI'm curious what quotes have snuck their way into your lexicon, from popular or obscure films.\n\nETA: \n\"I have no responsibilities here whatsoever\" from A Few Good Men\n\n\"Fuck you, Mars\" and \"I am going to have to science the shit out of this\" from The Martian.\n\n\"Mr. Hammond, I think we're back in business.\" - Sattler in JP\n\n\"[Are you ready?] Let's find out.\" From X Men First Class\n\n\"What, like it's hard?\" -Elle in Legally Blonde\n\n\"Okey dokey,\" in Hannibal Lecter voice, from Hannibal.",
        "upvotes": 539,
        "comments": 1501,
        "media": null,
        "permalink": "/r/movies/comments/1kfl8f3/whats_a_movie_quote_you_regularly_use_in_daily/"
    },
    {
        "id": "1kg89ua",
        "author": "NoCulture3505",
        "title": "'The Conjuring: Last Rites': First-look at Vera Farmiga, Patrick Wilson's final haunting",
        "content": "",
        "upvotes": 11,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j8iB7emeKlmuyViY4i2H55sKmUYRrKKJnCCwF8utW8s.jpg?auto=webp&amp;s=d0770fb8983142a06b2c3eb8de99f8e306a27752"
        },
        "permalink": "/r/movies/comments/1kg89ua/the_conjuring_last_rites_firstlook_at_vera/"
    },
    {
        "id": "1kfvr7d",
        "author": "Suspicious_Abroad484",
        "title": "Final released Tony Todd flick - shot in 2005, film thought missing or destroyed.  Negatives found and released 5/1/2025",
        "content": "Just starting it.  Enjoy!\n\n[Cutter's Club on TUBI](https://tubitv.com/movies/100039678/cutter-s-club)\n\n[IMDB - no reviews yet](https://www.imdb.com/title/tt36727311/?ref_=nm_flmg_job_1_cdt_c_1)\n\nHorror icon [Tony Todd](https://www.imdb.com/name/nm0865302/?ref_=ttpl) stars in this \"lost\" Full Moon film, a gory sci-fi-fueled horror/thriller from director [Charles Band](https://www.imdb.com/name/nm0023929/?ref_=ttpl) that sees a pair of young student doctors getting involved in a secret society of surgery fetishists and monster makers called the \"Cutters Club\", overseen by the maddest of doctors. Creatures, carnage, mayhem and macabre malpractice combine in this maniacal movie, brought back from the brink of oblivion to take its rightful place as Todd's fevered cinematic swan song.\n\nRIP CandyMan\n\nedit:  Viewed last night.  No spoilers, but this is pure Tony Todd!\n\n",
        "upvotes": 108,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uwwznTmkpZSOKkbYKPATu7eYhZgP8mvZ0-Tk4AgLGk0.jpg?auto=webp&amp;s=5a0ca4b5701f281e37847e96efdc308e4376333e"
        },
        "permalink": "/r/movies/comments/1kfvr7d/final_released_tony_todd_flick_shot_in_2005_film/"
    },
    {
        "id": "1kfd1i4",
        "author": "MarvelsGrantMan136",
        "title": "Rina Sawayama to Reprise Role as Akira in Donnie Yen’s ‘John Wick’ Spinoff ‘Caine,’ Lionsgate Launching Sales in Cannes",
        "content": "",
        "upvotes": 1232,
        "comments": 81,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8GGlnxrRCullDK_2P44hINhTd-J7taTcKxcpgEctS3w.jpg?auto=webp&amp;s=6be813e930ea4654f10dfa0437a9e42bfe960c20"
        },
        "permalink": "/r/movies/comments/1kfd1i4/rina_sawayama_to_reprise_role_as_akira_in_donnie/"
    },
    {
        "id": "1kg68a5",
        "author": "LushCharm91",
        "title": "Malin Akerman &amp; Michael Jai White To Star In Thriller 'Spymasters'",
        "content": "",
        "upvotes": 13,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9XxvkXsiaVbql-NhsGQuexamjlamxLo2USie3uDzmw8.jpeg?auto=webp&amp;s=f4e0d1a76657f88c408d1732d97295d214e2bab6"
        },
        "permalink": "/r/movies/comments/1kg68a5/malin_akerman_michael_jai_white_to_star_in/"
    },
    {
        "id": "1kg2n68",
        "author": "Robemilak",
        "title": "Tatiana Maslany, Marwan Kenzari to Star in Berlin-Set Romantic Comedy ‘Any Other Night’ (EXCLUSIVE)",
        "content": "",
        "upvotes": 22,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9yCaYRs-Zg6crjBQXtOBbhacWwYK7J22qFHZFfcsJGI.jpg?auto=webp&amp;s=8e100dc32bfbfe412cd0378c650d4ca7e1f6b0a9"
        },
        "permalink": "/r/movies/comments/1kg2n68/tatiana_maslany_marwan_kenzari_to_star_in/"
    },
    {
        "id": "1kfmtnr",
        "author": "NoCulture3505",
        "title": "Chris Pine to Lead Action Film ‘Run the Night’ for Lionsgate and Hidden Pictures, Sales Launching in Cannes",
        "content": "",
        "upvotes": 270,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lr_SvSjtTfArwmrnNvSmqOXngBwyoBLqg3dXwybquso.jpg?auto=webp&amp;s=a41ecd083bc1cac5118a710ba9e1bb1c7b855138"
        },
        "permalink": "/r/movies/comments/1kfmtnr/chris_pine_to_lead_action_film_run_the_night_for/"
    },
    {
        "id": "1kg1v7q",
        "author": "cysora",
        "title": "Captivating Movie suggestions for 12 hour plane ride",
        "content": "As title says about to go go on a 12 hour flight tomorrow. I’m going to download some movies. \n\nI need movies that captivating and entertaining enough that I forget I’m on a plane \n\nI just don’t want slice of life movies or rom coms. \n\nAny suggestions would be greatly appreciated! \n\nMysteries, sci-fi, thrillers (not horrors), is always a plus but not a requirement. \n\n\n",
        "upvotes": 14,
        "comments": 100,
        "media": null,
        "permalink": "/r/movies/comments/1kg1v7q/captivating_movie_suggestions_for_12_hour_plane/"
    },
    {
        "id": "1kfmbcu",
        "author": "queen-adreena",
        "title": "One word movie titles that don’t exist",
        "content": "With thousands of films released every year, I was wondering if all the single (real) word movie titles have been taken already. \n\n- No non-English words\n- No proper nouns\n- Have to have been used in English speech at some point \n- No words that couldn’t reasonably be published on a poster\n\nIf you’ve got any ideas, what would your movie be about?\n\nGive us a quick plot summary of your movie. ",
        "upvotes": 198,
        "comments": 433,
        "media": null,
        "permalink": "/r/movies/comments/1kfmbcu/one_word_movie_titles_that_dont_exist/"
    },
    {
        "id": "1kg8f2v",
        "author": "ChiefLeef22",
        "title": "‘Practical Magic 2,’ Starring Sandra Bullock and Nicole Kidman, Sets September 18, 2026 Release Date",
        "content": "",
        "upvotes": 4,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Z1_KWDTAx6xZNsP3l4BQnHyFZlTiizg07vXWbfDWTH4.jpg?auto=webp&amp;s=3ce517b6037c0a48a7dafef492c67f8abc81098b"
        },
        "permalink": "/r/movies/comments/1kg8f2v/practical_magic_2_starring_sandra_bullock_and/"
    },
    {
        "id": "1kg438k",
        "author": "JonasKahnwald11",
        "title": "New Posters for Celine Song’s 'Materialists' - Starring Dakota Johnson, Chris Evans and Pedro Pascal",
        "content": "",
        "upvotes": 6,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ikfza1f7v5ze1.jpeg?auto=webp&amp;s=161d7f6d0d2a7ae7a6f33f9e067eb97c7d80f120"
        },
        "permalink": "/r/movies/comments/1kg438k/new_posters_for_celine_songs_materialists/"
    },
    {
        "id": "1kfcimt",
        "author": "EbmocwenHsimah",
        "title": "Highest 2 Lowest - Teaser Trailer",
        "content": "",
        "upvotes": 512,
        "comments": 152,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lTgswy_4gEh6bJatOrGfPQJDslj0Hwor3KR1Vb7jj1c.jpg?auto=webp&amp;s=6aedef995023321a5bec2f60a19c1fef8fc7c1fc"
        },
        "permalink": "/r/movies/comments/1kfcimt/highest_2_lowest_teaser_trailer/"
    },
    {
        "id": "1kg0n38",
        "author": "sidroy81",
        "title": "Prime Focus Group Inks $400 Million Deal for Mumbai Entertainment Hub",
        "content": "",
        "upvotes": 11,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VdAdoQBHVTOWfP5UxkqFBP_A2SjuH_f5pHPKgewym74.jpg?auto=webp&amp;s=634a2b3815a26839f4cab2d0f46a4482760f0645"
        },
        "permalink": "/r/movies/comments/1kg0n38/prime_focus_group_inks_400_million_deal_for/"
    }
]