[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 16,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pel907",
        "author": "somacula",
        "title": "Netflix Wins the Warner Bros. Discovery Bidding War, Enters Exclusive Deal Talks - The streaming giant hit the magic $30-a-share target and has an exclusive window to negotiate a final deal.",
        "content": "That's a wrap.",
        "upvotes": 50,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1pel907/netflix_wins_the_warner_bros_discovery_bidding/"
    },
    {
        "id": "1pem9ht",
        "author": "Obvious_Shoe7302",
        "title": "Netflix Wins Bidding War For Warner Bros. Discovery, Starts Exclusive Deal Talks",
        "content": "",
        "upvotes": 28,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1pem9ht/netflix_wins_bidding_war_for_warner_bros/"
    },
    {
        "id": "1pemlo8",
        "author": "Easy_Pen5356",
        "title": "Thoughts on Unbreakable Kimmy Schmidt?",
        "content": "I’m new to Netflix. I’m looking for a good show to watch! I’m looking for something lighthearted to watch while I pack since I’m moving and got recommended this show by my sister, but I’ve heard mixed reviews while I’ve been briefly looking..\n\nSo just wanted some firsthand opinions without spoilers! I just tried to watch Schitt’s Creek and found it too slow even though I heard it gets better. I’m gonna come back to it.\n\n(I’ve liked shows like the office and superstore in the past I tend to watch more lighthearted, shows where you don’t have to follow the plot with every detail)",
        "upvotes": 18,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pemlo8/thoughts_on_unbreakable_kimmy_schmidt/"
    },
    {
        "id": "1pecmsn",
        "author": "LollipopChainsawZz",
        "title": "Netflix is leading bidder for Warner Bros. Discovery: Sources",
        "content": "",
        "upvotes": 50,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1pecmsn/netflix_is_leading_bidder_for_warner_bros/"
    },
    {
        "id": "1pe6pfe",
        "author": "StunningComment6064",
        "title": "Which movie (on netflix) is the saddest one you ever watch?",
        "content": "Hey guys,\ncould you recommend a Netflix movie that made you cry? Or a movie that left you with strong (sad) emotions after watching it? I’m currently in the mood for something like that.\nThank you!\n",
        "upvotes": 39,
        "comments": 106,
        "media": null,
        "permalink": "/r/netflix/comments/1pe6pfe/which_movie_on_netflix_is_the_saddest_one_you/"
    },
    {
        "id": "1pel9li",
        "author": "harpreetthind",
        "title": "Movie recommendations on Netflix",
        "content": "Just got done watching midnight mass what else does everybody recommend looking for some great shows that that are in this category but open to all suggestions thanks guys",
        "upvotes": 6,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1pel9li/movie_recommendations_on_netflix/"
    },
    {
        "id": "1pdnga8",
        "author": "GuineaPKilledMe",
        "title": "Sean Combs: The Reckoning - The jurors that agreed to sit down for documentary are disgusting.",
        "content": "If every juror in Diddy's case truly felt the same way as those two they interviewed for the doc, no wonder Diddy only got away with 50 months.\n\nBoth of them seemed extremely biased. The male juror basically put all the blame on Cassie and showed absolutely no sympathy for her. He immediately gave me the creeps. Seems like he really didn't value women at all.\n\nThe woman was even worse. She couldn't even hide her delusional love for Diddy. You can tell she was jumping with joy every time how she explained how Diddy would make eye contact with the jurors. She's so delusional I wouldn't doubt if she thought he was making eye contact with only her.\n\nThose two were absolutely vile in their reasoning for only counting him with two charges.\n\nEdit: Sorry about the grammar error in the title. It was suppose to say \\*The documentary",
        "upvotes": 547,
        "comments": 148,
        "media": null,
        "permalink": "/r/netflix/comments/1pdnga8/sean_combs_the_reckoning_the_jurors_that_agreed/"
    },
    {
        "id": "1pe4fit",
        "author": "GEMHidden",
        "title": "Director recognition for Sean Combs: The Reckoning",
        "content": "Alexandria Stapleton use of arrest photos, live footage, and decades of escalating violence paints the picture of a monster built by silence and complicity. The reckoning isn’t just for Diddy but for everyone who enabled him! \n\nI’m sure 50 cent offered her a pretty penny for the series, as Diddy likely passed on it either because he believed he would receive a not guilty verdict or did not have the funds to pay for the footage. What do you all think? \n",
        "upvotes": 28,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1pe4fit/director_recognition_for_sean_combs_the_reckoning/"
    },
    {
        "id": "1pe7279",
        "author": "hevy_smoker",
        "title": "The UK top 10",
        "content": "Just looking at the top ten films in the UK and it seems no-one in the country has any desire to watch anything that isn't total and utter garbage. Same with the top ten series, utter utter garbage.",
        "upvotes": 12,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pe7279/the_uk_top_10/"
    },
    {
        "id": "1pdkhjy",
        "author": "Wayman52",
        "title": "Netflix is removing Lost, Supernatural and The 100 all in one month.",
        "content": "This is ridiculous, there's so much slop on this site now, maybe 1 in 10 shows (and that's being generous) is actually watchable, and they continually get rid of beloved movies and shows. They cancel good Netflix originals or just quietly never giving them a second season, why does anyone keep their subscription? ",
        "upvotes": 280,
        "comments": 174,
        "media": null,
        "permalink": "/r/netflix/comments/1pdkhjy/netflix_is_removing_lost_supernatural_and_the_100/"
    },
    {
        "id": "1penoe2",
        "author": "catsaway9",
        "title": "How can I download a movie in the windows app?",
        "content": "I download content on my phone all the time, but I can't figure out how to download on my laptop. \n\nI installed the app but there's no \"available for download\" section like there is on my phone app. \n\nWhat am I missing? \n\nI'm going to be without Internet tomorrow and I'd really like to have a movie or two available.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1penoe2/how_can_i_download_a_movie_in_the_windows_app/"
    },
    {
        "id": "1pel9tp",
        "author": "Fit-Object5402",
        "title": "Can’t think of show or movie name",
        "content": "Hi - I only can remember bits and pieces but it’s driving me nuts. It’s a student. I think at nyu and someone dies and he has to hide at his wealthy friends apartment and the friend pays for his flight to the funeral and then his friends come to support him at the funeral and he doesn’t show up and there’s like an explosion or shooting or a tornado during the funeral. And then after at the bar there’s a fight and he hooks up with his dead brothers ex gf from hs. And he blames himself for his brothers death. And then he stops hooking up w her and goes back to school to hang w his friends and live in the present. Does anyone know what I’m talking about? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pel9tp/cant_think_of_show_or_movie_name/"
    },
    {
        "id": "1pdosrd",
        "author": "leangreenmonkey",
        "title": "Thirty minutes into Wolf of Wall Street and now it’s unavailable to watch",
        "content": "Actually so unbelievable, I was thirty minutes into The Wolf of Wall Street on Netflix, left the app for a few minutes, came back - and now the movie is no longer available on Netflix and has the “remind me” alarm button. What the actual hell, this is never happened to me in the middle of watching a movie. Anybody else?",
        "upvotes": 56,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1pdosrd/thirty_minutes_into_wolf_of_wall_street_and_now/"
    },
    {
        "id": "1pegj3k",
        "author": "TheStickySpot",
        "title": "I just got Netflix for my first time so I can watch Vol 2 of ST with everyone else are there any show or movie recommendations as I have technically already seen Vol 1 but I’m rewatching it.",
        "content": "The only other platforms I have had were I believe Paramount and HBO Max. I never really jumped on this platform as I thought that ai would only use it for one thing but today I decided to take a gamble on it and now I am a bit overwhelmed.",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1pegj3k/i_just_got_netflix_for_my_first_time_so_i_can/"
    },
    {
        "id": "1pedddo",
        "author": "ScorpioBear1996",
        "title": "Help",
        "content": "I need help guys. I can't log in on my computer without it saying 'technical difficulties' but I can log in on my phone website and app. I dunno what's going because it doesn't make sense. I even got downloaded the app on my laptop but it's still not working",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pedddo/help/"
    },
    {
        "id": "1pelwdo",
        "author": "Used-Can-6979",
        "title": "Does Netflix automatically put new releases in the top 10 and see how long it falls off?",
        "content": "Otherwise, how would people know of a new release if there was no hype around it? I get there is a new release tab but I think people are automatically interested in stuff in the top 10.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pelwdo/does_netflix_automatically_put_new_releases_in/"
    },
    {
        "id": "1pdx4pq",
        "author": "Infinite-Albatross44",
        "title": "Love &amp; Death",
        "content": "Who has finished this? Binged watched in like 2 days😂 it literally has everything.  Period based show which i absolutely adored being from the 80s. Sex, mystery and murder. I know it came on max a while back so some of you watched but I thought it was a great TRUE story/crime!",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pdx4pq/love_death/"
    },
    {
        "id": "1peah8l",
        "author": "ThatTenguWeirdo",
        "title": "Question about ad-supported: do illegible titles still show up?",
        "content": "Occasionally use netflix to watch anime and such through a family member; they recently downgraded to the ad-supported plan which means some shows I can no longer watch.\n\nWhat I want to know is if these shows wil still show up when I search through Netflix, and if they'll still show up in my list. I prefer to at least know if the show's on the platform even if I can't watch it currently.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1peah8l/question_about_adsupported_do_illegible_titles/"
    },
    {
        "id": "1pdrsu1",
        "author": "undeadbirdo",
        "title": "Wolf of Wall Street Removed and Censored",
        "content": "Hi guys. I've seen a couple people post about how they were watching the Wolf of Wall Street and it suddenly refused to play with a \"title not available to watch instantly\" error. This happened to me too, so I used the chat feature to ask about it. I cant post the screenshots, but the agent said: \n\n\"About your concern regarding the title. I checked and confirmed that this title is not available in your location.\"\n\n\"Currently we do not have issue but can you send us a report regarding this title\"\n\n\"As I checked the title lists based in the US, this title is not seen meaning it's not available.\"\n\nI live in Texas, so im wondering if there's local laws that banned the movie or something like that. There are articles online from like 5 days ago saying it was coming back on the 1st of December, so i know im not crazy!\nAlso, what I was able to watch was censored in weird spots, and I know for a fact it wasn't like this a couple years ago. Does anyone else find this fishy??\n\nEDIT: The movie is back on Netflix, uncensored. False alarm everybody lmao",
        "upvotes": 13,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pdrsu1/wolf_of_wall_street_removed_and_censored/"
    },
    {
        "id": "1pe70sa",
        "author": "Sensitive-Artist4845",
        "title": "I have 14 days left for watching shows on Netflix.",
        "content": "Hi all! New here\n\nI wanted to watch a show on Netflix and I've got the notification that I'm not in the same house with the owner. I was shocked because I'm the owner of the account. \n\nMy mother and my sister are using my account as well but they are in my home town and I'm away from them.\n\nI've watched Stranger Things last week and I didn't had any problems. \n\nWhat should I do?\n\nThank you!",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pe70sa/i_have_14_days_left_for_watching_shows_on_netflix/"
    },
    {
        "id": "1pe5t2w",
        "author": "ShawnyMcKnight",
        "title": "Getting Lego party game to work?",
        "content": "So we have a Roku that's about 4 years old and my kids wanted to play the Lego Party game. From my understanding you can play that through the netflix app, or is an android/IOS game? I thought my kids would have a lot of fun with it but I can't figure out how to find it.\n\nPeople are saying that there is a \"games\" section of Netflix app, but I don't see that section. Would it work on Rokus or is it for Apple TVs or Android loaded devices?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pe5t2w/getting_lego_party_game_to_work/"
    },
    {
        "id": "1pdupz6",
        "author": "NikkoMai",
        "title": "Netflix Facebook page",
        "content": "Am I the only one who gets this, when I click on the Facebook page for Netflix it takes me back in time to 2019 with the cover being The Crown and the last post also being from 2019? ",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1pdupz6/netflix_facebook_page/"
    },
    {
        "id": "1pe5de4",
        "author": "freaky33",
        "title": "4K/Dolby Vision picture quality The Beast in Me bad?",
        "content": "Why is the picture quality of The Beast in Me so bad? The quality should be 4K and Dolby Vision, but on my 4K TV, the picture is very grainy and the colors aren't great. Why is that? I often experience this with 4K/Dolby Vision series. I'm using the Apple TV Netflix app.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pe5de4/4kdolby_vision_picture_quality_the_beast_in_me_bad/"
    },
    {
        "id": "1pden8k",
        "author": "brysonboompaul",
        "title": "Kalenna Harper Claims Diddy Was Awake 14 Days On Cocaine In Netflix Doc",
        "content": "",
        "upvotes": 45,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pden8k/kalenna_harper_claims_diddy_was_awake_14_days_on/"
    },
    {
        "id": "1pekcmk",
        "author": "TheTiger1988",
        "title": "The Office still carrying Netflix",
        "content": "anyone have The Office on repeat? seems to be the only show netflix has that never gets old. it's a show that def won't work in today's sensitive era, \"that's what she said\" ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pekcmk/the_office_still_carrying_netflix/"
    },
    {
        "id": "1pd5cy5",
        "author": "ohsoyouhunnii",
        "title": "The Beast in Me",
        "content": "I'm sitting here watching episode 6 &amp; I have been so annoyed at this show since the beginning &amp; am finally feeling the urge to tell someone. \n\nWhy am I annoyed might you ask? 1. because its such a slow burner &amp; 2. Aggie DOES NOT KNOW HOW TO SAY NO TO NILE. Its annoying as hell. Then the faces she makes, the stuttering every time she speaks to him—I'm aware that its acting but she is so bad &amp; needs to tell his weird ass NO. \n\n😆 I just needed to rant!",
        "upvotes": 86,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1pd5cy5/the_beast_in_me/"
    },
    {
        "id": "1pdclni",
        "author": "dailymail",
        "title": "Love Is Blind's Alexa and Brennon Lemieux announce they are divorcing after four years of marriage and just one year after welcoming their daughter",
        "content": "",
        "upvotes": 35,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pdclni/love_is_blinds_alexa_and_brennon_lemieux_announce/"
    },
    {
        "id": "1pdeo6y",
        "author": "brysonboompaul",
        "title": "Gigolo Recalls Diddy Beating Up Cassie During Sex In New Netflix Doc",
        "content": "",
        "upvotes": 28,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pdeo6y/gigolo_recalls_diddy_beating_up_cassie_during_sex/"
    }
]