[
    {
        "id": "1lzz8vz",
        "author": "Pinchus121",
        "title": "I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix and host of the Naked Lunch podcast. I travel the world eating incredible food and talking to even more incredible people. Let’s dish! AMA.",
        "content": "Hi Reddit! I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix, and host of the Naked Lunch podcast with my good friend David Wild. I’ve spent the last several years traveling the globe with a fork in hand, trying to prove that the best way to connect with people is through good food and a lot of laughs. Season 8 of Somebody Feed Phil is now streaming on Netflix and we’re serving up new episodes of Naked Lunch every week wherever you get your podcasts, including chats with legends like Jane Fonda, John Stamos, Allison Janney, and so many more!  \n  \nGot questions about the best food cities, behind-the-scenes stories from the road (or the sitcom world), or where I stand on pineapple on pizza? I’m all yours!  \n  \nLet’s eat and chat.  \n  \nPhil  \nu/Pinchus121\n\nhttps://preview.redd.it/4k4qn42nrwcf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=19b27cd4f54858b592249a41b78424ec7203a1e5\n\n\n\n&gt;Thanks everyone for joining in! Be sure to check out Season 8 of Somebody Feed Phil now on Netflix and listen to new episodes of my podcast \"Naked Lunch\" every week!",
        "upvotes": 94,
        "comments": 120,
        "media": null,
        "permalink": "/r/netflix/comments/1lzz8vz/im_phil_rosenthal_host_of_somebody_feed_phil_on/"
    },
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1m77f2i",
        "author": "Legitimate_Ad3625",
        "title": "KPop Demon Hunters has made Netflix history by breaking an unlikely record 5 weeks after its release",
        "content": "",
        "upvotes": 322,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1m77f2i/kpop_demon_hunters_has_made_netflix_history_by/"
    },
    {
        "id": "1m77eb5",
        "author": "Sadie_UK",
        "title": "With The Gentleman series 2 currently filming, which do you prefer? Movie or Series?",
        "content": "I love both, but I feel the movie is JUST a little better than the series. What do you think? I'd imagine we'd get a trailer after Christmas!",
        "upvotes": 22,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1m77eb5/with_the_gentleman_series_2_currently_filming/"
    },
    {
        "id": "1m76lde",
        "author": "Double-Reputation151",
        "title": "so...just finished watching building the band",
        "content": "ngl im massively dissapointed that szn4 didnt win but ngl they also lowkey messed up in episode 10...\n\nidk why for episode 10, the performance to win it ALL, they chose to stay pretty static on stage :/ the song choice was just lackluster tbh I was pretty confused when they chose \"Human\" which is a pretty repetitive song that says the same phrase like 50 times. not the greatest choice for a competition to win 500k\n\nI already started to see szn4's loss coming as I watched episode 8 and 9 because they didn't choose great songs at all :/ believer didn't have enough vocal range and complexity to show the uniqueness of szn4 and I forgot what other song they sang (speaks volumes)\n\nits just so disappointing because earlier in the game, somebody that I used to know and sweet love ate SOOOOOO hard and listening to them sing those songs gave me goosebumps. they really missed the mark with song selection - don't get me wrong tho, they sounded great still and their uniqueness still makes them a superior band\\~\n\nmeanwhile 3quency definitely chose very fitting songs - they had dynamic choreo and they just looked and sounded like what someone would typically think of when you say \"girl group\" - the fact that they just fit the image probably played a role in their ultimate win",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m76lde/sojust_finished_watching_building_the_band/"
    },
    {
        "id": "1m70z0d",
        "author": "Atlast_2091",
        "title": "All of Us Are Dead | Season 2 Announcement | Netflix [ENG SUB]",
        "content": "",
        "upvotes": 25,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m70z0d/all_of_us_are_dead_season_2_announcement_netflix/"
    },
    {
        "id": "1m7ctuo",
        "author": "ladyaftermath",
        "title": "Finally watched a Deadly American Marriage - question about interviews",
        "content": "Why didn't the interviewers ask Molly more questions about her lying to people regarding how she knew the kids' birth mother or how she claimed to give birth to them? I'd be curious what her answer would be.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7ctuo/finally_watched_a_deadly_american_marriage/"
    },
    {
        "id": "1m727zn",
        "author": "nickmillersmaid",
        "title": "Why are they rapid firing so many Trainwreck documentaries?",
        "content": "I loved Woodstock 99’. Since, I’ve watched Astroworld, Poop Cruise, and Balloon Boy. I love this style of documentaries, so I’m satisfied and entertained. I’m just wondering why they’re releasing so many all at once? When Woodstock 99’ came out, I was wondering why they wouldn’t continue the series (Like Monsters, the Jeffrey Dahmer series and later the Menéndez Brothers.) ",
        "upvotes": 12,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1m727zn/why_are_they_rapid_firing_so_many_trainwreck/"
    },
    {
        "id": "1m6ln52",
        "author": "Due-Calendar-4256",
        "title": "What your top 3 all time favorites on Netflix",
        "content": "What your top 3 all time favorite shows on Netflix\nMine:\n#1 DARK (SIC MUNDUS CREATUS EST)\n#2 STRANGER THINGS (011)\n#3 MONEY HEIST (GOLD IS ILLUSION)\n\nI know all are populars show but maybe there exist a underrated gem that ranked for someone and I would love to know about it. So, consider sharing it.",
        "upvotes": 100,
        "comments": 188,
        "media": null,
        "permalink": "/r/netflix/comments/1m6ln52/what_your_top_3_all_time_favorites_on_netflix/"
    },
    {
        "id": "1m7cdff",
        "author": "big14gangx",
        "title": "I couldn't decide what to watch for hours so I built a tool that gives you 3 movie recs based on your mood and I need some serious feedback",
        "content": "I was DOOM-scrolling on TikTok and Netflix looking for some good movies to watch but I couldn't find anything to match my mood.\n\nSo I built a quick tool that asks for your mood and gives you 3 movie recommendations that match what you're feeling thriller, depressed , heartbreak, action, whatever.\n\nYou can even choose moods like:\n\n“scary and funny\"\n\n“Adventurous”\n\n“Want to cry but in a good way”\n\nEach movie recommendation also includes a quick description so you can scan fast and decide.\n\nI'm also thinking of letting users leave their own reviews and rate each movie out of 5 stars so it feels more like a community-driven list, not just an algorithm.\n\nYou can try it here → [https://cypress-hide-0280.typedream.app](https://cypress-hide-0280.typedream.app/) \\---\n\nRight now I’m testing it and would genuinely love feedback:\n\nAre the recommendations good? I made sure it doesn't give just mainstream movies.\n\nDo the picks feel right for the mood you typed in? Or kinda off?\n\nDoes it feel like something you would actually use to look for a movie? if not why?\n\nPLSS tear it apart. I’m here to improve it.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m7cdff/i_couldnt_decide_what_to_watch_for_hours_so_i/"
    },
    {
        "id": "1m6mq19",
        "author": "meltingsunz",
        "title": "Netflix Reveals New Lineup of Food Shows — Including Some Returning Favorites (Exclusive)",
        "content": "",
        "upvotes": 36,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m6mq19/netflix_reveals_new_lineup_of_food_shows/"
    },
    {
        "id": "1m7alcg",
        "author": "PazzaOnXTC",
        "title": "All Quiet On The Western Front And How To Sell Drugs Online Same Voice Actor?",
        "content": "So im watching all quiet on the western front and im pretty sure that the English dub for Paul baumer is the same as merits Zimmerman from how to sell drugs online? Anyone else hear the similarities or?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m7alcg/all_quiet_on_the_western_front_and_how_to_sell/"
    },
    {
        "id": "1m73dk1",
        "author": "blackhawkq820",
        "title": "Help me with this series name",
        "content": "There was a English language series, it was about a murder but with slow paced, phycological thriller, gloomy town setting. First episode there was a victim identified but the first suspect was somehow seen at 2 places at the same time ..one place was outside of town. This gave somewhat sinner type vibe and it came near by same time as Sinner. I don't remember the series now, tried searching everywhere, no luck. It used to be heavy on Grey color usage.",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1m73dk1/help_me_with_this_series_name/"
    },
    {
        "id": "1m72s42",
        "author": "Visual_Combination68",
        "title": "Netflix’s \"La Palma\" tsunami landslide: two geoscientists break down whether it could actually happen",
        "content": "Netflix included a pretty dramatic tsunami sequence in one of their recent docu-dramas triggered by part of La Palma collapsing into the Atlantic. It’s not just fiction though; it’s based on a real 2001 paper by Ward &amp; Day that’s stirred up debate for years.\n\nTwo geoscientists made a video breaking it down. They look at whether the science behind the scenario holds up, what the original research actually said, and how newer studies view the risk.\n\n[https://youtu.be/x4D-xg4WhMw](https://youtu.be/x4D-xg4WhMw)\n\nCurious what others think. Is this something to take seriously or just another worst-case scenario that's unlikely to play out?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m72s42/netflixs_la_palma_tsunami_landslide_two/"
    },
    {
        "id": "1m792zi",
        "author": "ToonAdventure",
        "title": "Netflix Renews ‘Wednesday’ for Season 3, Eyes Spinoff (Exclusive)",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m792zi/netflix_renews_wednesday_for_season_3_eyes/"
    },
    {
        "id": "1m6svch",
        "author": "Janeeee811",
        "title": "Sirens - ending",
        "content": "Why is it implied that Michaela wouldn’t be getting any money in her divorce settlement bc Peter destroyed the photo— but they are making it painfully and awkwardly obvious to the staff and to the guests of the Gala what is going on between Peter and Simone? \n\nEven without the photo, I’m sure people will be gossiping enough to prove Peter’s infidelity.\n\nKinda stupid really.",
        "upvotes": 14,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m6svch/sirens_ending/"
    },
    {
        "id": "1m779h5",
        "author": "farroos",
        "title": "Blocked Titles Bug",
        "content": "Kids can now unblock titles in the Android app without password. Only changing Maturity Rating requires password. Obviously this is a bug because password should be required to block and unblock titles.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m779h5/blocked_titles_bug/"
    },
    {
        "id": "1m76w73",
        "author": "Own_Heart_9872",
        "title": "Need suggestions!!!",
        "content": "Want to watch something scifi, thrilling good movies on Netflix but already have seen plenty of such kind already.\nGive me some under rated movie on Netflix.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m76w73/need_suggestions/"
    },
    {
        "id": "1m75jgt",
        "author": "Tall_Beautiful_665",
        "title": "Stranger Things Season 5 Is Coming...What Are Your Craziest Theories and What Should Happen Before It Ends?",
        "content": "with Season 5 on the horizon, let's get creative!  What wild theories do you have about the final season? How do you think it’s all going to wrap up? Will Eleven and the gang finally defeat the Upside Down for good, or is there a twist waiting for us? \n\nAlso, what are some things you NEED to see happen before it all ends? I am talking epic moments, character arcs, or mind-blowing reveals. Drop your ideas below and let’s see who’s got the best theories 👀\n\nLet the chaos begin!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m75jgt/stranger_things_season_5_is_comingwhat_are_your/"
    },
    {
        "id": "1m68qbt",
        "author": "Legal-Mood-3526",
        "title": "Trainwreck: PI Moms",
        "content": "Anyone else feel kinda unfulfilled by this? Maybe it’s bc I based my expectations on poop cruise where they dedicated way too much time to the most useless details, so I thought this would be longer. I knew nothing about this case beforehand so I was very excited by the premise, but it seemed very rushed and I thought more would happen. \n\nThe story seemed quite interesting in the trailer but everything unfolded in the last 20 mins… def feel like they cut out a lot of info. I would have loved to get an extended version of this. Thoughts? ",
        "upvotes": 87,
        "comments": 117,
        "media": null,
        "permalink": "/r/netflix/comments/1m68qbt/trainwreck_pi_moms/"
    },
    {
        "id": "1m6kici",
        "author": "silivriicingencim",
        "title": "I made a Netflix extension to mark shows as watched 👀👀👀",
        "content": "Ayo... Just wanted to share [this Chrome extension](https://chromewebstore.google.com/detail/watchflix-a-netflix-watch/ndembgeojaahiiibpjhocamieepbbabe) I built in under 4 days — it lets you **mark Netflix shows as watched** so you don’t forget what you’ve seen.\n\nOnce marked, it puts a little overlay on them (you can even customize how it looks). You can also choose to **hide** watched stuff (though fair warning: hiding is kinda glitchy right now lol) You can click the extension icon to open a full list of what you’ve marked, jump straight to those shows, or remove stuff from the list. It’s been super helpful for me since Netflix doesn’t have anything like this. Its completely open source and safe.\n\nIf you have any suggestions to improve the extension just send me a dm or comment here, I will try to improve it by your feedback. Im putting an image of the extension for the lazy ones :S\n\nEdit: I couldn't find a better flair... oops  \nEdit 2: I forgor to put the links of the extension \n\n[WatchFlix - A Netflix Watchlist Extension](https://chromewebstore.google.com/detail/watchflix-a-netflix-watch/ndembgeojaahiiibpjhocamieepbbabe)\n\n[Github - xanndevs/watched-flix](https://github.com/xanndevs/watched-flix)\n\nhttps://preview.redd.it/iaz8p9f2ogef1.png?width=386&amp;format=png&amp;auto=webp&amp;s=5625df0bb753fd73bc50ca5a3437a9b69f456d6d\n\nhttps://preview.redd.it/9doc924aogef1.png?width=1560&amp;format=png&amp;auto=webp&amp;s=8e88f693beaddd88f82cd93ddb7022a9df0bc1d0",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m6kici/i_made_a_netflix_extension_to_mark_shows_as/"
    },
    {
        "id": "1m6tgfj",
        "author": "peach_ihz",
        "title": "100 years of solitude on netflix",
        "content": "Am I missing something ? This show is so confusing .\nI'm still on episode three but omg. Tried to Google somethings so I get the remark about the pigtailed kids being from incest, but were ursula and Jose related ? And why all the kids named Jose acario",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m6tgfj/100_years_of_solitude_on_netflix/"
    },
    {
        "id": "1m71m49",
        "author": "DiscombobulatedGur37",
        "title": "Parasite Translation",
        "content": "I’m rewatching Parasite on Netflix and there is a scene where the subtitles previously labeled a dish “Ram-don” and now label that dish “Jjapaguri”. I’m aware that this is the direct translation, but I find it odd that the subtitles have been changed. Is there an explanation? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m71m49/parasite_translation/"
    },
    {
        "id": "1m6kktx",
        "author": "Novel_Independent166",
        "title": "Thoughts on Untamed ending?",
        "content": "&gt;!Even though the show was full of tropes I enjoyed till the 80% mark. It just went off the rails for me from the moment Kyle’s wife was in a hospital gown for some reason. Attempted suicide due to the guilt of killing her son’s murderer? Speaking of, they just glossed over the fact that Sean Sanderson killed Caleb. Why exactly? Why did Maguire fire at Kyle in the first place? How did he know what Kyle was up to? After all of this, the whole angle with the older cop shooting his daughter knees out because he just wanted to get her to stop and talk? And then she goes off and commits suicide, almost taking out two other people while doing so? !&lt;\n\nSuper disappointed. A show hasnt gone off the rails this quickly for me since a while. So much potential, wasted.",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m6kktx/thoughts_on_untamed_ending/"
    },
    {
        "id": "1m77vb6",
        "author": "_thazbi",
        "title": "Any relationship between squid game and gaza ?",
        "content": "[https://timelinedaily.com/entertainment/we-re-not-horses-we-re-humans-how-squid-game-reflects-desperate-gazans-lives](https://timelinedaily.com/entertainment/we-re-not-horses-we-re-humans-how-squid-game-reflects-desperate-gazans-lives)",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m77vb6/any_relationship_between_squid_game_and_gaza/"
    },
    {
        "id": "1m6xlqx",
        "author": "Otherwise_Corner_235",
        "title": "Is Netflix With Ads Worth It?",
        "content": "My family just canceled Netflix due to how expensive the pricing. We previously had the Standard subscription, but because my mom doesn’t watch anything on there (but the rest if the family does), She doesn’t think it’s worth it. \n\nI’m thinking of getting the Standard with Ads subscription but I’ve been hearing that so many shows/restricted, so it is really worth buying?",
        "upvotes": 2,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1m6xlqx/is_netflix_with_ads_worth_it/"
    },
    {
        "id": "1m6r5sn",
        "author": "Zealousideal_Map5074",
        "title": "I'm on episode 4 of Mask Girl - one thing is bugging me",
        "content": "In episode 3, how did everyone know that kim mo mi is mask girl?\n\nBecause \n1) Mr jo only recognise mask girl by her hand mole.\n2) that jerk person who decided to meet mask girl, and he knows the identity only after she removed her mask in resturant. After that he started posting about how ugly she is,  but he never upload the picture of mask girl identity.\n\nAfter that scene, that jerk died and Kim mo mi killed Mr jo in her apartment. Mr jo never released any identification of mask girl in public.\n\nThey how the hell everyone all of a sudden knows who the real mask girl is? \n\nI know, Mr jo and Mo mi both disappeared from their office. But it doesn't highlight that Mo mi is mask girl! \nYes Mr jo's computer if full of mask girl pictures but he also have many other girls picture in different folder.\n\nIf a person disappeared, nobody gonna suspect the idol or actors they followed, it's stupid.\n\nAm I missing out something or it's just a plot hole?\n*NO SPOILER PLEASE*",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6r5sn/im_on_episode_4_of_mask_girl_one_thing_is_bugging/"
    },
    {
        "id": "1m6qk3q",
        "author": "anandasheela5",
        "title": "Similar shows to Love &amp; Anarchy? (I’ve watched it 4 times already!)",
        "content": "I adore Love &amp; Anarchy, especially Sophie’s character, she’s unapologetically trying to be herself while navigating all the chaos in her life, and I relate to that. I’ve already watched the series almost four times, and I’m craving something with a similar quirky, emotional, and slightly unconventional vibe. \n\nAny recommendations for shows with complex, bold female leads and that mix of humor, romance, and depth? Open to both international and English-language series!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6qk3q/similar_shows_to_love_anarchy_ive_watched_it_4/"
    },
    {
        "id": "1m6vfcm",
        "author": "gir-fire",
        "title": "Netflix with low volume what to do?",
        "content": "This solution worked for me on a Windows 10 PC: \n\nSettings &gt; System &gt; Sound &gt; Device Properties &gt; Additional Device Properties &gt; Enhancements &gt; Enable Virtual Surround and Loudness Equalization &gt; Apply &gt; OK.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6vfcm/netflix_with_low_volume_what_to_do/"
    },
    {
        "id": "1m6mcx2",
        "author": "Molybecks",
        "title": "Any true crime dramas coming soon? Like adaptations of real events",
        "content": "I know there’s the Monster series 3 production coming soon about Ed Gein. \n\nAnything else? I quite enjoyed The Staircase but that was on HBO. Anything similar?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m6mcx2/any_true_crime_dramas_coming_soon_like/"
    },
    {
        "id": "1m6p741",
        "author": "UzumakiShanks",
        "title": "Go on an epic adventure with Netflix’s “The Sea Beast”",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6p741/go_on_an_epic_adventure_with_netflixs_the_sea/"
    },
    {
        "id": "1m6e7he",
        "author": "ToonAdventure",
        "title": "NEW Pokémon Concierge Episodes 🏝️ | Coming September 4 to Netflix | Official Trailer",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6e7he/new_pokémon_concierge_episodes_coming_september_4/"
    }
]