[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oxh2pj",
        "author": "therealkingwilly",
        "title": "After 7 years as loyal Netflix customers, our account was permanently cancelled with no right of appeal.",
        "content": "\nMy family has been Netflix members since 2018. We live internationally, where I work in education. Like many expat families, we travel frequently - we’ve lived across multiple countries in Asia, Europe, Africa, and Oceania.\n\nLast week, my wife traveled overseas to care for her sick mother. Meanwhile, our children and I stayed home for school. We continued using Netflix on our various devices as we always have.\n\nNetflix’s automated system flagged this as “unusual activity” and permanently cancelled our account. When I contacted customer service, I was told:\n\n❌ There is no appeals process\n❌ There is no formal complaint procedure  \n❌ The decision cannot be reversed\n❌ Seven years of customer history means nothing\n\nThe representative literally said: “Once the system detected the issue, then there’s no option to recover it.”\n\nSo Netflix’s algorithm is judge, jury, and executioner. No human review. No consideration of our account history. No recognition that international families exist. No way to appeal an automated decision.\n\nThis isn’t fraud prevention - it’s punishing legitimate customers for living globally.\n\n@Netflix - Is this really how you treat long-term international subscribers? Where’s the humanity in your customer service?",
        "upvotes": 294,
        "comments": 111,
        "media": null,
        "permalink": "/r/netflix/comments/1oxh2pj/after_7_years_as_loyal_netflix_customers_our/"
    },
    {
        "id": "1oxr666",
        "author": "Kendikay1966",
        "title": "Dept. Q",
        "content": "Anyone else watching??  The first episode I was ready to call in the chips.  Then the second…getting warmer.   I’m into the 7th episode…WOW!  It’s got me hooked!   The acting’s excellent and the story line keeps you guessing.   So good.   Highly recommend.   ",
        "upvotes": 13,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1oxr666/dept_q/"
    },
    {
        "id": "1oxirji",
        "author": "Short_Pin_6243",
        "title": "The Beast and Me is one of the best drama shows Netflix has put out in awhile *no spoilers*",
        "content": "*****The Beast In Me******* is the title\n\nNot going to get into specifics because it’s brand new and don’t want to ruin it for anyone else. \n\nBut there was a time when Netflix put out pretty good tv dramas yearly. That time has been replaced as of recent by some pretty big misses.\n\nEven the shows I can think of from this year like Untamed, Wayward, Waterfront, Hunting Wives, Black Rabbit etc are all lacking a lot. It feels like the only shows Netflix sometimes hit on are British dramas. \n\nSo if you are reluctant to check it out, don’t be. (In my opinion of course) ",
        "upvotes": 46,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1oxirji/the_beast_and_me_is_one_of_the_best_drama_shows/"
    },
    {
        "id": "1oxscjt",
        "author": "redditgatorx",
        "title": "Hevelius Ferry Tragedy: How Bad Was the Storm Really?",
        "content": "https://youtu.be/_KhrXyMTll4?si=8Mp1XjedIt2cIkDz\n\nShort video about the newest Netflix's series about Hevelius from the perspective of a data scientist",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxscjt/hevelius_ferry_tragedy_how_bad_was_the_storm/"
    },
    {
        "id": "1oxok9s",
        "author": "lil-g4565",
        "title": "Strange glitch?",
        "content": "I'm not sure what's happening but anytime I click on a movie or TV show it's just instantly playing it. It won't take me to the \"home screen\" of said show or movie that shows the trailers seaons etc it just starts playing. I've tried searching instead to see if it's just the home screen part of netflix doing that but nope. Nothing's working I'm not sure how to fix it. ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oxok9s/strange_glitch/"
    },
    {
        "id": "1oxo1j0",
        "author": "TakesOneToKnowOne1",
        "title": "The Beast in Me — final scene",
        "content": "What is the final scene in the last ep of The Beast in Me meant to indicate? The one with Nina and the baby? Are we saying the baby is like Nile? Find that ridiculous because it’s literally just a baby.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oxo1j0/the_beast_in_me_final_scene/"
    },
    {
        "id": "1ox8qwr",
        "author": "yoggsmu",
        "title": "College football coach John Beam from ‘Last Chance U’ has died after being shot, Oakland police say",
        "content": "This is awful news… sounds like he was targeted, too. I enjoyed watching him on Last Chance U and thought he was a well-meaning coach who really cared about his kids. ",
        "upvotes": 20,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ox8qwr/college_football_coach_john_beam_from_last_chance/"
    },
    {
        "id": "1oxr3mf",
        "author": "Successful_Ask_2380",
        "title": "Has anyone had issues signing into Netflix with sky?",
        "content": "I had an account under my daughters email\nUsing my own email Netflix keeps trying to charge me to sign up even though the price is included in my my sky broadband subscription \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxr3mf/has_anyone_had_issues_signing_into_netflix_with/"
    },
    {
        "id": "1oxmpbh",
        "author": "Sufficient-Curve2951",
        "title": "Had I Not Seen the Sun ending",
        "content": "I have read many articles about this new Taiwanese show and I still wonder if Pin-yu holds a connection to Jen-yao? What do you guys think? The blind woman also brings a lot of mystery to the story, I can't wait for Part 2! But is Pin-yu Jen-yao's girlfriend from his past?\n\n  \n[https://www.soapcentral.com/shows/had-i-not-seen-sun-part-1-ending-explained-chou-pin-yu-uncovers-troubling-secrets-li-jen-yao-s-past](https://www.soapcentral.com/shows/had-i-not-seen-sun-part-1-ending-explained-chou-pin-yu-uncovers-troubling-secrets-li-jen-yao-s-past)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxmpbh/had_i_not_seen_the_sun_ending/"
    },
    {
        "id": "1oxex7o",
        "author": "harpreetthind",
        "title": "Just wondering, what shows everybody recommends watching on Netflix",
        "content": "I’m watching Brooklyn Nine-Nine already watched superstore and I’m watching Wednesday. What other shows do people recommend? Let me know in the comments since I’m currently in the looking for other shows or movies\nThanks ",
        "upvotes": 5,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1oxex7o/just_wondering_what_shows_everybody_recommends/"
    },
    {
        "id": "1oxq4wp",
        "author": "TimesandSundayTimes",
        "title": "One Day's Leo Woodall: ‘Being objectified messes with your head’",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxq4wp/one_days_leo_woodall_being_objectified_messes/"
    },
    {
        "id": "1oxk8mh",
        "author": "Comfortable-Ice-5584",
        "title": "Ikusagami - Last Samurai Standing",
        "content": "Hey Folks. \nI just finished the last samurai standing in one binge and except a few minor details I really enjoyed the series.\nAs I am unpaciant as one can be I would love to read the novel from shogo imamura.\nUnfortunately all I can find is the manga adaption. Does anyone know if there is an English version of the novel for purchase and where to get it ? \n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxk8mh/ikusagami_last_samurai_standing/"
    },
    {
        "id": "1oxf4xp",
        "author": "phredo_71",
        "title": "No translations for sign language in Orphan Black: Echoes",
        "content": "Anybody else having an issue where sign language is not translated to text, even with subtitles turned on? It happens in episode 1 of Orphan Black: Echoes but I’m sure it’s happening elsewhere. ",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1oxf4xp/no_translations_for_sign_language_in_orphan_black/"
    },
    {
        "id": "1oxoa4d",
        "author": "TomDucq",
        "title": "Downloads not accesible?",
        "content": "I’m about to board a 11h flight and downloaded some shows and movies yesterday. When I tried to access them on my first flight i got an error that I was offline. \nI’m now connected to the internet and my downloads list is empty. \nWhen I go to the show itself it says the episode is downloaded but still the list is empty. \nI only get the message to activate smart download?\n\nAnyone else who experienced this issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxoa4d/downloads_not_accesible/"
    },
    {
        "id": "1oxnlga",
        "author": "abablawan",
        "title": "Subtitles Font On Apple TV",
        "content": "\nHello everyone, I’m new here and still getting familiar with how things work. I wanted to ask if anyone knows whether the Netflix app on Apple TV allows users to change the subtitles font style or customize it in any way. I’ve seen options for adjusting subtitle size and background on some devices, but I’m not sure if Apple TV has the same flexibility. Any tips or guidance would be greatly appreciated!\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxnlga/subtitles_font_on_apple_tv/"
    },
    {
        "id": "1oxnh8h",
        "author": "Riddleboxed",
        "title": "How to change extra member to no ads?",
        "content": "Hi. \n\nI currently have an ad free subscription, and I added my brother as an extra member, but accidentally selected the 'with ads' option for him. I'd like to change it so that he doesn't see adverts, but I  cant seem to figure out how to change it.\n\nAny help would be greatly appreciated. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxnh8h/how_to_change_extra_member_to_no_ads/"
    },
    {
        "id": "1oxndz3",
        "author": "TheRealSlim_KD",
        "title": "House of Dynamite. Childish?",
        "content": "When Ms Ana Park, the NIO for North Korea is called. Why does it take her a whole minute to realise the White House has not called her to check on her welfare?\nSimilarly when your spouse who works for the top level of decision making in the country calls and asks you leave town - why the disbelief.\nAre Ms Park and the Spouse - stupid?\nA fantastic premise of a movie dumbed down for people who do not understand war.\nI think the story line could have been crisper with the disbelief being CUT out. And if the Americans cannot work out the backward trajectory of an incoming package then the rest of the world stands no chance.\nI cannot blame the President for not authorising retaliation- whom was he going to retaliate against. Random nations?\nBombers could have been launched as they can always be brought back. Nuclear missiles could have been launched as their packages have literally last minute cancellation devices...\nArguments over designated evacuaees, this scenario - has not been gamed????  then all is lost.\n",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1oxndz3/house_of_dynamite_childish/"
    },
    {
        "id": "1oxq1te",
        "author": "AdAdmirable7653",
        "title": "Netflix removes Casting from android to TV",
        "content": "So...renewed my sub to netflix today, only to find out that I can no longer cast from my phone to the TV...WTF🤮, what superhero thought that was a good idea?\n\nI have no TV remote, my phone is my tv remote. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oxq1te/netflix_removes_casting_from_android_to_tv/"
    },
    {
        "id": "1owzj6u",
        "author": "the_oncoming_doctor",
        "title": "One of the worst UI updates ever",
        "content": "I just got the latest UI update and they just seems to have butchered the UI. Clicking on a title now starts playing it instead of showing the earlier menu. This is bad because if I have to look at the episodes list or add or remove an item from my list I have to start playing which also bring it to my continue watching.\n\nSometimes my wife just watches something from my profile forgetting to switch to hers and now when I go to watch it starts from the middle. What’s more infuriating is that I don’t see a start over button anymore. So I have to rewind it and make sure I don’t see the clips when rewinding.\n\nThe previous menu list was good enough they did they have to update it to this shit.",
        "upvotes": 14,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1owzj6u/one_of_the_worst_ui_updates_ever/"
    },
    {
        "id": "1oxf7nq",
        "author": "thelastparad3",
        "title": "Did Netflix just remove a ton of anime?",
        "content": "I’m in Singapore and we used to have stuff like Demon Slayer, SpyxFamily, Frieren, Rurouni Kenshin, HunterxHunter etc but all of it seems to be gone now. Is this Netflix wide or just SG…?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oxf7nq/did_netflix_just_remove_a_ton_of_anime/"
    },
    {
        "id": "1ox53jo",
        "author": "badgalriri1097",
        "title": "Animal kingdom",
        "content": "Just finished watching the show I know it’s been out for a while but had heard it was a good show and had good amount of seasons which is what I like..\n\nAnyways so what did you think about the ending?\n\nI really hated J’s revenge I felt for the kid at first but he didn’t come into the family wanting revenge at first his grandmother took him in after his mothers passing and him knowing everything the Cody’s had put his mother through.. he had the chance to give them up to the cops and didn’t instead he decided to stay and Smurf tought him how to become one of them\n\nSmurf died and baz died as well which I feel like were the ones that truly hurt Julia pope he had a soft spot for her but he clearly was mentally ill not excusing that but Smurf had him completely manipulated..\n\nDeran and Craig had no reason to be a part of J’s revenge they had no fault in any of what Smurf put his mom through they were young and well at the end of the day they were all bad even J he had become a criminal and murderer just like them so why not just give everyone their fair share in the money and move on they wouldn’t have bothered him at all I truly started disliking J towards the end I think they all should have died or atleast they would have just lived their own seperate lives as they had all planned with all the fortune.",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ox53jo/animal_kingdom/"
    },
    {
        "id": "1owezk6",
        "author": "Impossible-Air-2843",
        "title": "What's the best show currently on Netflix?",
        "content": "Looking for a new show to watch , any recommendations?\n\nHey guys so I'm looking for a new show to watch , I can't tell you specifically the genre I like because it really depends but I'll tell you what I've watched recently that I really liked so you can get an idea , turn of the tide , Dep q , the feud , mobland, Tulsa king , son of a donkey , so yea it's a mix , any recommendations of some good attention catching series ? Thank you ",
        "upvotes": 109,
        "comments": 261,
        "media": null,
        "permalink": "/r/netflix/comments/1owezk6/whats_the_best_show_currently_on_netflix/"
    },
    {
        "id": "1oxbfwf",
        "author": "EnvironmentDue8188",
        "title": "Ads",
        "content": "Considering rebooting my membership but I can’t justify $17.99 a month. Are the ads super annoying? I have Hulu with ads and it can be really annoying/repetitive and I don’t think I can handle 2 streaming services with ads. Please let me know ",
        "upvotes": 1,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1oxbfwf/ads/"
    },
    {
        "id": "1oxe59l",
        "author": "haydenclaireheroes",
        "title": "Exploring Guillermo Del Toro's Frankenstein From the Mind of a Theater Nerd",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxe59l/exploring_guillermo_del_toros_frankenstein_from/"
    },
    {
        "id": "1owwjnd",
        "author": "fugaainfinit",
        "title": "Is the service down?",
        "content": "Just got \"kicked\" from tv, and it seems on all devices the same. On web it says \"membership canceled\" while membership is paid and active as usual. Chat is not aviabile, phone is not avaiabile. Looks like a technical glitch? Anyone else experiencing it?",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1owwjnd/is_the_service_down/"
    },
    {
        "id": "1ox7xfm",
        "author": "Timely_Gain_6225",
        "title": "No Sound",
        "content": "My Netflix has no sound. All the rest of the Apps are working fine. It can’t be a wire issue or a tv issue, it has to be the App itself. I have already uninstalled and reinstalled. The screen is fine everything is playing just silently. And my tv isn’t on mute lol.\nThe bill is up to date.\nIs anyone else having sound issues and how did you fix it??",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ox7xfm/no_sound/"
    },
    {
        "id": "1owv9sr",
        "author": "intelerks",
        "title": "Rockstar surprises fans with Red Dead Redemption’s jump to mobile and modern consoles",
        "content": "",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1owv9sr/rockstar_surprises_fans_with_red_dead_redemptions/"
    },
    {
        "id": "1oxl0dj",
        "author": "Lopsided_Attempt8922",
        "title": "Lawyer here | Should Netflix make a documentary on “How to Protect Yourself from Fake Rape Cases – 101”?",
        "content": "I’ve noticed a growing rise in discussions around malicious prosecution, defamation, and misuse of criminal provisions—especially in cases where individuals (mostly men, but not only men) get trapped in false rape allegations.\n\nThis isn’t about undermining genuine survivors. It’s about addressing the *other* reality that no one talks about: people whose lives, careers, families, and reputations get destroyed overnight due to fabricated accusations.\n\nImagine a Netflix-style documentary series that:\n\n* Breaks down **how false cases are usually set up**\n* Shares **real stories** of those acquitted after years of battle\n* Explains **legal rights**, what to do *immediately* after being accused, and how to secure evidence\n* Covers **digital safety**, consensual relationship proof, chats, call logs, and how they’re interpreted in court\n* Includes **lawyers, psychologists, cops, cyber forensics**, and even social commentators\n* Talks about **reform**, misuse, and the balance between protecting victims *and* preventing the weaponisation of criminal law\n\nThis could genuinely help people understand both sides of the system instead of the one-sided narrative we usually get.\n\nWould you watch such a documentary? And what topics do you think it should cover?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxl0dj/lawyer_here_should_netflix_make_a_documentary_on/"
    }
]