[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 149,
        "comments": 528,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mz7z78",
        "author": "L0v3_1s_War",
        "title": "Box Office: ‘KPop Demon Hunters’ Sings to $18M-$20M in First Theatrical Win Ever for Netflix",
        "content": "",
        "upvotes": 134,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mz7z78/box_office_kpop_demon_hunters_sings_to_18m20m_in/"
    },
    {
        "id": "1mzebeq",
        "author": "Holiday_Hamster3022",
        "title": "Binge recs please",
        "content": "I’m going through a rough time, my significant partner just passed and I need something to watch. I have no motivation to do anything so I figured maybe watching a show will help. Just want something lighthearted &amp; funny to keep me distracted. ",
        "upvotes": 9,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mzebeq/binge_recs_please/"
    },
    {
        "id": "1mzfhux",
        "author": "Afraid_Fishing_3694",
        "title": "A Deadly American Marriage - Can someone explain what’s happening in this photo of Molly and her dad?",
        "content": "",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mzfhux/a_deadly_american_marriage_can_someone_explain/"
    },
    {
        "id": "1mzc0et",
        "author": "Gray3706",
        "title": "Why do some of the korean shows make no sense?",
        "content": "My first example is from the new show Trigger. A man nearly rapes a woman, and the main character (an officer) arrives just in time to stop it. He checks the perimeter and leaves his partner to look at the man’s ankle monitor. The man then tries to kill the partner, but the MC stops him just in time. And guess what happens next? The MC slams him to the ground, then he and his partner just walk away—leaving a man who just attempted sexual assault and murder completely free.\n\nAnother example is in Alice in Borderland. There’s a recurring character who repeatedly tries to rape people, and the group has multiple chances to get rid of him. I don’t remember every detail, but one scene had the main character strangling this guy after he tried to assault what seemed to be his love interest. Yet, instead of finishing it, he just lets him live…\n\nI honestly don’t get what kind of message the writers are trying to send here, but it feels like it completely falls flat. Why are they portraying rape like it’s something that can just go unpunished?\n",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mzc0et/why_do_some_of_the_korean_shows_make_no_sense/"
    },
    {
        "id": "1mzkj60",
        "author": "One-Passion1428",
        "title": "Standard with ads and live boxing.",
        "content": "Do you get ads in the middle of a round or only in between rounds/pre/post fight?  I'm subbing to Netflix just for the Canelo/Crawford fight and I need to know if the standard membership with ads is good enough.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mzkj60/standard_with_ads_and_live_boxing/"
    },
    {
        "id": "1mzca04",
        "author": "f00dl3",
        "title": "3 minute ads, wtf?",
        "content": "Just got hit with my first 3 mimute ad while watching Netflix. I get 30 second ads, but come on - this stuff ain't free - I still pay a monthly subscription!",
        "upvotes": 6,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1mzca04/3_minute_ads_wtf/"
    },
    {
        "id": "1mz7wds",
        "author": "R_Steelman61",
        "title": "Fisk is great fun!",
        "content": "Love, love, love this comedy. So hard to find good comedy shows and this is a gem. Great quirky characters, comedy is very situational and all done with Australian accents (sorry American here and I just enjoy it). \nIf you haven't seen it it's great fun. ",
        "upvotes": 13,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mz7wds/fisk_is_great_fun/"
    },
    {
        "id": "1mzg1b0",
        "author": "Most_Assist2529",
        "title": "Heels needs a szn 3",
        "content": "Just rewatched heels for the first time, still one of the best shows I’ve seen and rly want a szn 3. The ending being a cliffhanger just for it to be cancelled is wild, why did they buy the rights to not bring it back? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mzg1b0/heels_needs_a_szn_3/"
    },
    {
        "id": "1mytsen",
        "author": "Cool_Meatball",
        "title": "Absolute must watch",
        "content": "Say someone would consider stopping their subscription, what would you suggest them to watch before doing it? \n\nWould love to also have recommendations of shows/movies that were not featured in top 10.\n\nI feel like Netflix always shows me the same stuff on the home page and am sure there are hidden jewels, which I’m not aware of because I don’t know how to search for them in the first place.\n\nThanks :-)",
        "upvotes": 53,
        "comments": 142,
        "media": null,
        "permalink": "/r/netflix/comments/1mytsen/absolute_must_watch/"
    },
    {
        "id": "1mzk4yr",
        "author": "Just_Literature_928",
        "title": "The Order needs to be renewed.",
        "content": "I know it's been a long time now but I still am pining for The Order. Can we get a petition going or something? I absolutely loved that show and they had enough going on for more stories. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mzk4yr/the_order_needs_to_be_renewed/"
    },
    {
        "id": "1mzj59l",
        "author": "Chemical-Bag-8256",
        "title": "Dept Q - Lyle Jennings psychoanalysis",
        "content": "It’s clear Lyle is a sociopath. Here’s what I know and what want to understand shortly follows:\n-Lyle seemed to always have a weird affinity for Merritt since they were teens. \n-When William Lingard hits Harry from behind, both teens realized the mistake. Then Lyle comes in and beats William, saying “if I hadn’t followed you, you’d be dead.” \n-Fast forward to when he was at Godhaven and he’s giving a video interview, he kept on about Sam Haig being his brother bc if he didn’t follow him, he’d be dead. \n-Add in him being thrown in the hyperbaric chamber with Harry AFTER his death, but denies Harry being dead in his video interview.\n-There are moments of clarity for Lyle, returning Merritt’s necklace, saying how he loved her, then showing extreme displays of hatred, blaming her for his brother’s death.\n\n1. Does Lyle have a split personality disorder? I personally thought he did. Why else show compassion for the tooth infection and how apologetic he was when returning the necklace? (giving a needle nose pliers seemed to be the dumbest move but yet he was able to concoct a whole new life as Sam Haig just to infiltrate Merritt’s life?)\n2. Did Lyle love Merritt? Or jealous that his brother wanted to leave to be with Merritt?\n3. Does Lyle accept that his brother actually died? In his teens he denied it.\n4. Why would Lyle assume William would continue to hurt Harry? I thought the teens knew each other unless Lyle was just looking for a reason to hurt someone?\nBONUS question 😂:\nDid the Mhòr sheriff know Lyle was the one who actually attacked William? I think this is the case, but at what point did he realize this and why not confess it? I can’t accept the “it’s his ego to not admit he was wrong.”\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mzj59l/dept_q_lyle_jennings_psychoanalysis/"
    },
    {
        "id": "1myfxwp",
        "author": "Apprehensive_Ask1279",
        "title": "The Jussie Smollett documentary",
        "content": "I would really like to hear from people who have watched the whole documentary to see if this has changed anyone’s opinion on the case.\n\nPersonally I still believe Jussie lied &amp; wants to be seen as some sort of martyr/activist. The Osundairo brothers are clearly opportunists but they have no reason to lie &amp; the producers of this are using Chicago PDs bad reputation to deflect, however multiple things can be true at the same time. \n\nLooking forward to hearing your thoughts! ",
        "upvotes": 268,
        "comments": 388,
        "media": null,
        "permalink": "/r/netflix/comments/1myfxwp/the_jussie_smollett_documentary/"
    },
    {
        "id": "1mzdg4y",
        "author": "bigguys45s",
        "title": "Any thoughts/ opinions on the 2017 Japanese Netflix original series, “Kantaro: The Sweet Tooth Salaryman”?",
        "content": "Even by Japanese standards, it’s VERY weird, wacky, silly, absurd, and strange! But that’s part of its overall unique charm. Gotta love how it teaches you about so many different unique Japanese desserts and treats/ junk foods.\n\nOverall, very enjoyable silly fun stuff! Another reason why I love Japan lol.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mzdg4y/any_thoughts_opinions_on_the_2017_japanese/"
    },
    {
        "id": "1myvh7v",
        "author": "SpeedMiserable7005",
        "title": "These guys...",
        "content": "I just learned today that Netflix prompts you every time you open your account after putting in a cancelation request to continue the subscription. Thats mad predatory and if you have a kid like I do that doesnt exactly read the prompt and just races past it, its nearly impossible to get the cancellation to stick. I cancelled my Netflix at 630am, by 930 I somehow had upgraded. The funny thing is the cancelation was put in during the weekday when everyone was at either school or work. Netflix of course had no answer for me other than I made the mistake. I suggest anyone trying to cancel, call the customer service number and have them delete your payment method. ",
        "upvotes": 16,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1myvh7v/these_guys/"
    },
    {
        "id": "1mzfsmx",
        "author": "steffi8",
        "title": "Can I use Netflix in Asia?",
        "content": "In the past I could take my Apple TV to Asia and it just worked with USA Netflix.\n\nIs that still possible?\n\nAlso how many shows can I take offline for viewing on an iPad? And how long before they expire?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mzfsmx/can_i_use_netflix_in_asia/"
    },
    {
        "id": "1myewjs",
        "author": "Ginishivendela",
        "title": "Accidentally watched through Kaos",
        "content": "To come to a cliffhanger ending and notice that it was cancelled. Absolutely loved the show, one of the best ones on the platform but as with all the other great ones I love they’re cancelled. \n\nWhy even make a show if you’re gonna cancel it before giving it an ending, and then keeping it on the platform. This has been a complaint for a long time and I can’t fathom why Netflix isn’t listening?? The viewers aren’t excited about new show due to the fear of having them cancelled. I mean who in their right mind would want to watch a brilliant show just to be disappointed by the end. Do the head honchos at Netflix have some kind of edging fetish or what’s up? \n\nI’m not the one paying my households subscription but in the future aka when I move out I’ll definitely won’t get a Netflix subscription because as much as I like the content on there I’d rather have a GoT shit ending than a cancelled show. ",
        "upvotes": 157,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1myewjs/accidentally_watched_through_kaos/"
    },
    {
        "id": "1mzcdzq",
        "author": "Final_Dependent_5478",
        "title": "Netflix not working",
        "content": "Netflix doesnt open at all. On my android device it just gets stuck on the logo, while on my apple device it says there is some connection problem. It was working just fine a few minutes ago. Is this happening to you?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mzcdzq/netflix_not_working/"
    },
    {
        "id": "1mxz31p",
        "author": "TheMirrorUS",
        "title": "Emily in Paris assistant director dies after collapsing while filming",
        "content": "",
        "upvotes": 715,
        "comments": 124,
        "media": null,
        "permalink": "/r/netflix/comments/1mxz31p/emily_in_paris_assistant_director_dies_after/"
    },
    {
        "id": "1mz6t4u",
        "author": "jujub4d3lea0",
        "title": "Long story short é realmente muito bom",
        "content": "eu assisti hoje alguns episódios de long story short e é muito bem feita a animação em série, dá pra ver como é feita com amor. Eu gosto bastante do criador de bojack e dos diretores, que são os mesmo pra essa serie ela nao é como o bojack mas é única do jeito dela, teve quem odiou mas é por causa da proposta um pouco “diferente” da de bojack.\nLong story short é uma história sobre uma família judia, e ao passar dos episódios vai contando as histórias dela, traumas, piadas internas e entre outras coisas, é bem engraçadinha mesmo e eu amei muito, tudo é bem real e os personagens são tão humanos, ao ponto de voce se identificar com eles e se importar com a história deles de verdade. eu amo como o criador de bojack escreve os personagens dele.\nMeu personagem favorito foi o yoshi e na versão br ele tem o mesmo dublador do clancy de the midnight gospel e eles são bem parecidos eu achei muito legal isso.\neu realmente gostei desse show e eu recomendo muito pra quem gosta de bojack horseman ou dos diretores de bojack",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mz6t4u/long_story_short_é_realmente_muito_bom/"
    },
    {
        "id": "1mykfmx",
        "author": "Witch_King_Malekith",
        "title": "Wednesday and the non-stop oneliners.",
        "content": "Everything line out of Wednesday's mouth is a pun or a \"cheeky\" oneliner. And all the other characters do is setting her up for her unnatural and weird responses. It gets tiring after a while.\n\nAlso, she kept talking and explaining stuff to the audience by talking to herself. This show is either for kids or for dumb adults, at least according to the writers. \n",
        "upvotes": 23,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mykfmx/wednesday_and_the_nonstop_oneliners/"
    },
    {
        "id": "1mza6gx",
        "author": "LemonadeGamers",
        "title": "Search down?",
        "content": "https://preview.redd.it/cuh2qxnwr1lf1.png?width=1304&amp;format=png&amp;auto=webp&amp;s=8fdef4c357b6927b2522f31c4e665e080f8198e5\n\nSeems like no matter what I search it isn't showing up with anything, even for shows/movies that I guarantee are on Netflix currently.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mza6gx/search_down/"
    },
    {
        "id": "1myzvsa",
        "author": "rocks4life67",
        "title": "Changing card on Salvadoran subscriptions",
        "content": "More than a month ago i visited El Salvador and bought a subscription there but it didn’t let me use my US card so I used a Salvadoran debit card. It already charged me for this months payment so would i be able to switch it to a us card? I’m worried they’ll cancel my subscription if i change it to a credit card.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1myzvsa/changing_card_on_salvadoran_subscriptions/"
    },
    {
        "id": "1myms8o",
        "author": "bigguys45s",
        "title": "For those into Japanese tv shows/ series/ movies: Any thoughts/ opinions at all on, “Old Enough”?",
        "content": "I think that it’s a cute series and show overall, but honestly also a bit scary at times, considering the fact that these are some REALLY young kids walking alongside public roads/ cars/ bridges, and for pretty/ fairly long distances, especially for children that young of age. But it’s also a very unique look at Japan/ life in Japan/ Japanese culture/ Japanese food as well.\n\nOverall, it’s really enjoyable/ interesting/ sometimes sweet and funny to me as well. 😁👍",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1myms8o/for_those_into_japanese_tv_shows_series_movies/"
    },
    {
        "id": "1myymno",
        "author": "Silly-Potential7795",
        "title": "The next drive to survive",
        "content": "I think the next best series like drive to survive would be The Ilse of Man TT. What is everyone's thoughts on it?\n\nI believe it would be the greatest show in Netflix ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1myymno/the_next_drive_to_survive/"
    },
    {
        "id": "1myou14",
        "author": "Longjumping-Elk-7840",
        "title": "Long Story Short review – TV so funny and clever it could run for ever",
        "content": "Long Story Short review – TV so funny and clever it could run for ever | Television | The Guardian https://www.theguardian.com/tv-and-radio/2025/aug/22/long-story-short-review-tv-so-funny-and-clever-it-could-run-for-ever",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1myou14/long_story_short_review_tv_so_funny_and_clever_it/"
    },
    {
        "id": "1myx4a6",
        "author": "Historical_Line_4465",
        "title": "The TV Corner : Blindspot \"Pilot\"",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1myx4a6/the_tv_corner_blindspot_pilot/"
    },
    {
        "id": "1myw1fz",
        "author": "FloridaSalsa",
        "title": "Viewing Criteria?",
        "content": "I know there are lots of posts about canceling shows. I wonder if Netflix is shooting themselves in foot. Or are viewer habits making it worse?\n\nPersonally, I won't watch series unless I see 3 seasons and Google for satisfying ending (don't leave me hanging), or I watch Limited Series. \n\nSo if everyone does this does it help or hurt? If people aren't watching shows under a certain amount of seasons, won't that lead to more cancelations? Kind of a Catch 22? \n\nShould Netflix have more Limited series where the story is complete on its own and there's an option to add another? (Dept. Q. for example)\n\nI'm not changing my criteria. I am ready to cancel and try again in a few years. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1myw1fz/viewing_criteria/"
    },
    {
        "id": "1myc3hi",
        "author": "jgroove_LA",
        "title": "Arden Cho Thought She'd Retired, Then K-Pop Demon Hunters Changed Everything",
        "content": "",
        "upvotes": 19,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1myc3hi/arden_cho_thought_shed_retired_then_kpop_demon/"
    },
    {
        "id": "1mxoe8c",
        "author": "Crafty-Ball9103",
        "title": "Can't stand how many of these exist.",
        "content": "",
        "upvotes": 469,
        "comments": 49,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ih9x1a5l8okf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mxoe8c/cant_stand_how_many_of_these_exist/"
    },
    {
        "id": "1myqbv8",
        "author": "lion_king3008",
        "title": "PoV in Adolescence",
        "content": "Sorry , I'm late for the party . I watched the series yesterday . I loved the Storytelling through single shot episodes . But I just realised the whole Adolescence series is shot from the PoV of Katie's Soul roaming around the characters ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1myqbv8/pov_in_adolescence/"
    }
]