[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1kc1pnd",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 25,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1kc1pnd/la_piola_friends_meetup/"
    },
    {
        "id": "1kq6sif",
        "author": "ExperienceVarious552",
        "title": "In quale zona trasferirsi?",
        "content": "Ciao a tutti, sono un ragazzo di 26 anni vorrei trasferirmi a Torino (abito in un paese della cintura).\nSto facendo diverse valutazioni, secondo voi sono corrette? Avete dei consigli? \nValuto affitti sui 500/600€ o acquistare a meno di 80k per restaurare. \nLe zone che avrei scelto potrebbero essere zona lingotto/inizio di San Salvario (fino a corso Marconi per intenderci) oppure Torino ovest zona piazza massaua \nVantaggi lingotto: metro, lungo Po per correre, più vicina al centro (credo?)\nVantaggi Massaua: metro, leggermente meno cara \n\nCi sono altre cose che dovrei sapere? Quale zona consigliereste?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kq6sif/in_quale_zona_trasferirsi/"
    },
    {
        "id": "1kq6uxf",
        "author": "wherearemyburritos",
        "title": "cerco ginecologa",
        "content": "Ciao a tutte,\n\nsono alla ricerca di una ginecologa (possibilmente donna) che possa aiutarmi. \nFino a poco tempo fa ero seguita da una ginecologa tramite l’ASL, ma con il Servizio Sanitario Nazionale il mio prossimo appuntamento disponibile sarebbe nel 2026!\nOvviamente è troppo tardi per le mie esigenze attuali, quindi sto cercando una professionista affidabile (anche privatamente, se necessario) a Torino.\n\nSe avete consigli o esperienze da condividere, ve ne sarei davvero grata!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kq6uxf/cerco_ginecologa/"
    },
    {
        "id": "1kpx449",
        "author": "flying_stingray",
        "title": "Anyone to exchange apple mint(me) and lemon balm/melissa(you)?",
        "content": "Hi. I'm looking for small lemon balm to exchange with my apple mint which I'm propagating now. Sure, I could just buy one but garden centre's lemon balm was all chipped and beaten, also too big. :s\n\nThe mother plant is living outdoor in full sun and good breeze, happy and healthy. I took whole branch then propagated it on Thursday and it is already rooting from two knuckles so once you pot it she will thrive. Healthy mother plant delivers good result almost every time.\n\nWhen I bought it lower leaves had mint rust(fungal illness) but as soon as I remove infected leaves and repot it in new soil it was fine. It's not showing any sign of rust for more than a month now, just thriving. Probably it was the old soil but be aware of it.\n\nI think new roots will be ready for soil after spending another week in water so this post is uploaded in advance. Please feel free to leave a comment anytime.\n\nI grow mostly herbs and use them for cooking so that I cannot use any pesticide except for neem oil. If your lemon balm suffer from pest and illness I must respectfuly decline.\n\n[After taking this picture the bottom leaves\\(2 red X\\) were removed since it was too close to new roots.](https://preview.redd.it/iib0ncf0hm1f1.png?width=1439&amp;format=png&amp;auto=webp&amp;s=8df00b59cefe52c661135a31901f9c492f2e9b5a)\n\n[Mother plant. It's spreading runners while growing taller at the same time. Those nibbles are from leaf hoppers. They visit my plants sometimes but never move in. No worries. Pest-free guaranteed.](https://preview.redd.it/vm6u3cf0hm1f1.jpg?width=1800&amp;format=pjpg&amp;auto=webp&amp;s=db71114c904ee70de066de3f0f97dcd8fd304898)\n\n[After I pop it in water one of the bottom leaves showed 2 small faded spots but I think it's due to stress. It's doing well in my windowsill.](https://preview.redd.it/it4uhbf0hm1f1.jpg?width=3001&amp;format=pjpg&amp;auto=webp&amp;s=0ba62b8ba707db7d8130b82c4ec12cff7ec0c60e)\n\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kpx449/anyone_to_exchange_apple_mintme_and_lemon/"
    },
    {
        "id": "1kpw2ax",
        "author": "stefano-cookie",
        "title": "Cerco musicisti curiosi",
        "content": "Mi piacerebbe trovare qualcuno di affine per degli inediti che ho scritto. \nLe sonorità: indie rock, fusion jazz, bossanova, funky. \nQualche influenza: kings of convenience, nu genea, Samuele Bersani, primi album dei Coldplay. \nIl mio obiettivo è formare un gruppetto informale per conoscerci e cercare affinità musicale e di amicizia. Poi si vede. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kpw2ax/cerco_musicisti_curiosi/"
    },
    {
        "id": "1kppekz",
        "author": "Erleyx",
        "title": "Cerco amici",
        "content": "Hey, I just moved down to Nichelino and I really miss hanging out with friends.\n\nSince I don’t know anyone here yet (and my Italian still kinda sucks), I’m hoping to find some chill people to meet up with. Coffee, walks, gym sessions, whatever sounds fun.\n\nI’m 18 and mostly free in the evenings. If you’re around Nichelino / Torino and down to make a new friend, hit me up!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kppekz/cerco_amici/"
    },
    {
        "id": "1kpfv7d",
        "author": "Tymtom",
        "title": "Cerco gruppo per giochi da tavola",
        "content": "Ciao, sono a Torino da poco e mi manca un sacco giocare a giochi da tavola con i miei amici. \n\nNon conoscendo persone qua a Torino, vorrei trovare un gruppo che già gioca regolarmente \n\nHo 26 anni e sono libero prevalentemente la sera ",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1kpfv7d/cerco_gruppo_per_giochi_da_tavola/"
    },
    {
        "id": "1kpi2j0",
        "author": "JeramiDeng",
        "title": "Rent in Torino for 1 month as foreigner",
        "content": "Hey I would like to rent something for 1 month without docs like proof of income\nIs this possible without airbnb etc? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kpi2j0/rent_in_torino_for_1_month_as_foreigner/"
    },
    {
        "id": "1kpqpio",
        "author": "andeee92",
        "title": "Canali Telegram Torink",
        "content": "Fino a 6 mesi fa c'erano un sacco di canali su telegram per avvalersi di fantastici pusher su Torino con meet up. Che fino hanno fatto? Come faccio a trovarli di nuovo?\nHelp please, sono perso senza",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1kpqpio/canali_telegram_torink/"
    },
    {
        "id": "1kp5p8n",
        "author": "CobblerSuccessful962",
        "title": "About permesso di soggiorno",
        "content": "Hey everyone, I had my fingerprint appointment in the middle of March and its been almost 2 months but I still got no updates from questura. I've been constantly checking the state of my application from the website but it's still not ready to be collected. Last year I got the card in 1 month after the fingerprint appointment but this year I don't understand what's wrong. How is your experience this year? Do you think I'll be waiting even longer? Also is it okay if I don't collect it (or if I collect it some other time than the one they'll be assigning) since I won't be traveling in the Schengen area?",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1kp5p8n/about_permesso_di_soggiorno/"
    },
    {
        "id": "1koy6fn",
        "author": "CryingAlwaysCrying",
        "title": "Trasferirsi ad Aosta da Torino: esperienze?",
        "content": "Ciao a tutti,\n\nQualcuno qui vive o ha vissuto ad Aosta? Sto valutando di trasferirmi lì da Torino per un po’, finché le cose non si sistemano.  \n  \nCom’è la vita ad Aosta? Lavoro da remoto quindi cerco un posto tranquillo ma non isolato. Qualche dritta su pro/contro, costi, atmosfera, ecc.?\n\nCome città mi piace un sacco, ma ci vado solo nei weekend, quindi non so come sia la vita lì.\n\nGrazie in anticipo!",
        "upvotes": 15,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1koy6fn/trasferirsi_ad_aosta_da_torino_esperienze/"
    },
    {
        "id": "1kom3gj",
        "author": "CryingAlwaysCrying",
        "title": "GTT è letteralmente impossibile",
        "content": "Giuro, prendo l’autobus tipo due volte all’anno. Ma ogni singola volta che provo ad affidarmi a GTT è una tragedia annunciata. O non passa proprio, o arriva talmente in ritardo che tanto valeva andare a piedi da subito.\n\nCom’è possibile che una città come Torino abbia un sistema di trasporto pubblico così indecente? È quasi comico per quanto fa schifo. Ma la cosa assurda è che non sono nemmeno un utente abituale, eppure ogni volta è un disastro.\n\nIeri mattina mi sono svegliato alle 7:30 per arrivare alle 9. Facile, no? Peccato che il bus delle 8:00 è diventato 8:16, poi ha continuato a slittare come se stessi guardando un countdown verso il nulla. Sono arrivato alle 9:15. Ridicolo.\n\nE il mitico “in tempo reale”? Ma reale cosa? È una presa in giro.\n\nDetto questo, massimo rispetto per chi lavora con questo sistema tutti giorni. Non ce l’ho con voi. Il problema è strutturale, gestionale, ed evidente a chiunque provi ad usare questo servizio\n\nMa seriamente: come può un sistema così esistere nel 2025 in una città come Torino\n\n",
        "upvotes": 98,
        "comments": 36,
        "media": null,
        "permalink": "/r/torino/comments/1kom3gj/gtt_è_letteralmente_impossibile/"
    },
    {
        "id": "1kp2rss",
        "author": "Bluejay_Bulky",
        "title": "any lgbt+ bar/club recommendation in turin tonight?",
        "content": "in turin for a couple of days",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kp2rss/any_lgbt_barclub_recommendation_in_turin_tonight/"
    },
    {
        "id": "1kongvd",
        "author": "Inevitable-Bad5953",
        "title": "Corsi di cioccolateria a Torino?",
        "content": "Ciao a tutti, come sappiamo Torino e una città conosciuta per il suo cioccolato e volevo sapere se ci sono delle formazioni disponibili nella città per diventare (eventualmente) cioccolatiere. Se non ci sono corsi del genere, come si avanza in quest’ambito invece? Qual’è il passaggio “normale” che si fa per entrare/avanzare?",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kongvd/corsi_di_cioccolateria_a_torino/"
    },
    {
        "id": "1kop9n5",
        "author": "skortica",
        "title": "Bici Gravel/strada giretti?",
        "content": "Ciao ciao, ho da pochissimo preso una bici Gravel e vorrei trovare qualcuno con cui andare. Fatevi avanti…",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kop9n5/bici_gravelstrada_giretti/"
    },
    {
        "id": "1kos3mf",
        "author": "Forward-Tree-6234",
        "title": "Consigli e opinioni su ONAV vs AIS",
        "content": "Ciao a tutti!\n\nHo fatto qualche anno fa il corso di primo livello con l'ONAV, adesso ho deciso che vorrei proseguire e sono indeciso se continuare con il secondo livello dell'ONAV o provare ad accedere direttamente al secondo livello dell'AIS.\n\nMi ero trovato molto bene al corso ONAV ma ho notato che purtroppo manca un livello abbinamento cibo-vino, inoltre ho notato che generalmente è molto più popolare il corso AIS. Online non ho trovato molto a riguardo, per questo spero di trovare qui qualche consiglio da parte di altri appassionati!",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1kos3mf/consigli_e_opinioni_su_onav_vs_ais/"
    },
    {
        "id": "1kopziw",
        "author": "cheekynandos5055",
        "title": "Venues to watch Italian Open Men's Single Final",
        "content": "Hello guy! I am currently in the city but can't seem to find anything.\n\nAnyone have any recommendations/places where I could watch the men's single final tomorrow? Thanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kopziw/venues_to_watch_italian_open_mens_single_final/"
    },
    {
        "id": "1knxtdb",
        "author": "Original_Draw_9492",
        "title": "Non so che fare :/",
        "content": "In questo periodo vivo a Torino, mi piace molto come città, non sono originario di qui, mi sono trasferito per studio.\nPerò negli ultimi mesi non riesco più a studiare con convinzione, non trovo più gli stimoli, non conosco nessuno.\nHo soltanto la triennale, per adesso sto frequentando la magistrale, però non ho mai lavorato, non ho grandi esperienze e non mi sento nemmeno grandi competenze o particolari talenti e qualità, inoltre mi sto avvicinando alla soglia dei 30 anni.\nVorrei tanto continuare a vivere a Torino e a lavorarci, piuttosto che tornarmene giù. \nHa senso provare a mandare curriculum a qualsiasi azienda sperando che almeno una mi prenda? ",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1knxtdb/non_so_che_fare/"
    },
    {
        "id": "1ko7xhn",
        "author": "zaynhabibi",
        "title": "Unito bachelors of economics and finance with data science",
        "content": "Hey\nHas anyone got accepted into this major? \nIf you have, please DM me, I’m trying to find people with the same major So that we could help each other out with the process\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ko7xhn/unito_bachelors_of_economics_and_finance_with/"
    },
    {
        "id": "1ko6hm2",
        "author": "Ok_Ice_7490",
        "title": "Rete FWA BBBell o Starlink Zona Borgo Po- Cavoretto",
        "content": "Buonasera!\n\n  \nCome da titolo chiedo se qualcuno di voi ha rete Fwa BBBell o Starlink nelle zona sopra mensionate, sono possessore di una rete FWA Tim che ultimamente in zona da me le prestazioni sono scese a poco più di 1Mega contro i circa 7-10 che avevo prima, sono di per sé prestazioni scadenti, ma ora faccio pure fatica a vedere video sul tubo, se qualcuno di voi ha una delle due vi prego di rispondermi sulle loro prestazioni, servizio assistenza, e performance, grazie!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ko6hm2/rete_fwa_bbbell_o_starlink_zona_borgo_po_cavoretto/"
    },
    {
        "id": "1ko6ad9",
        "author": "Algol___",
        "title": "Food, viaggi e sarcasmo: cerco nuove persone interessanti con cui parlare!",
        "content": "Ciao! Sono un ragazzo di 22 anni, appassionato di viaggi, cibo (etnico, vegan, diverso dal solito insomma), natura e tutto ciò che non è monotono.\n\nVorrei conoscere persone con una buona dose di curiosità, senso dell’umorismo e voglia di parlare di tutto tranne che delle solite menate (Torino è già pesante di suo).\n\nSe ami raccontare esperienze, sogni di girare il mondo o semplicemente ti piace chiacchierare in modo leggero ma non superficiale, potremmo andare d’accordo.\n\nNon fa per me:\n❌ Chi ha come unica personalità la marijuana\n❌ Chi vive solo per la polemica politica estrema (destra o sinistra, uguale)\n\nCosa fa per me:\n✅ Gente vera, con voglia di condividere due pensieri, qualche risata e magari scoprire punti di vista nuovi. Non voglio nessun secondo fine, solo connessioni umane reali.\n\nPreferirei parlare con persone della mia età, diciamo tra i 20 e i 30 anni. Se ti ci ritrovi, scrivimi!\n",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ko6ad9/food_viaggi_e_sarcasmo_cerco_nuove_persone/"
    },
    {
        "id": "1ko1uud",
        "author": "Marty_McCyc",
        "title": "Parcheggio per una settimana",
        "content": "Ciao,\nVorrei parcheggiare la mia auto a Torino per una settimana. Conoscente un parcheggio economico e sicuro? Non deve essere necessariamente al centro.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ko1uud/parcheggio_per_una_settimana/"
    },
    {
        "id": "1ko1agg",
        "author": "Bikini-Swan",
        "title": "Postgrad in University of Turin (Need Guide)",
        "content": "Hi there, I am south Asian and i have done bachelors in Media &amp; Communication studies, was planning for postgraduate degree in University of Turin but the admission dates have passed because it took me time to prepare all the legal documents (it was a great hassle). can anyone guide me what can i do now, I'm very stressed because i don't want to waste my time. please if anyone could help me out here, I will be grateful truly  \n\n\n\nSalve, sono un laureato in Studi di Media e Comunicazione proveniente dall'Asia meridionale. Avevo intenzione di iscrivermi a un master all'Università di Torino, ma ho perso la scadenza per le iscrizioni a causa della preparazione dei documenti legali, che è stata piuttosto impegnativa. Qualcuno potrebbe fornirmi una guida su come procedere ora? Sono preoccupato di perdere tempo. Se qualcuno potesse aiutarmi, gliene sarei molto grato.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ko1agg/postgrad_in_university_of_turin_need_guide/"
    },
    {
        "id": "1knckwr",
        "author": "MatteVat25",
        "title": "Ha un senso?",
        "content": "Questa è una delle principali vie trafficate della città. Come si vede dalla foto, la corsia è talmente larga che quasi sembrerebbe fatta per due auto affiancate... peccato che in realtà due non ci stanno.\nNon ci sono linee che separano le corsie, quindi è tecnicamente una corsia singola, solo spropositatamente larga. Il risultato? Chi guida si mette un po' dove capita, creando confusione e rischi.\nPerché fare una corsia così larga se poi non è pensata per due veicoli?",
        "upvotes": 45,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/89mxaolz2z0f1.jpeg?auto=webp&amp;s=a6befc87a82a696d07d3bc4862fa1b327d11bcf8"
        },
        "permalink": "/r/torino/comments/1knckwr/ha_un_senso/"
    },
    {
        "id": "1knwf75",
        "author": "human_sam_",
        "title": "Radio di torino con focus sulla condivisione di eventi?",
        "content": "Di radio conosco:\n\n\\- [radio blackout](https://stream.radioblackout.org)  \n\\- [rbl radio](https://rbl.media/it/)  \n\\- [radio bandito](https://www.radiobandito.it/)\n\n  \nPerò vanno bene anche podcast, settimanali, o giornalieri.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1knwf75/radio_di_torino_con_focus_sulla_condivisione_di/"
    },
    {
        "id": "1knwf59",
        "author": "Impressive_Lynx_7938",
        "title": "Parrucchiera per donna",
        "content": "Sto cercando una parrucchiera che sia veramente brava nel taglio da donna , purtroppo negli anni le esperienze che ho avuto sono state pessime e non sono mai uscita da un negozio con un taglio che corrispondesse a quello che avevi chiesto.\nQualcuno sa consigliarmi? Van bene anche cinesi ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1knwf59/parrucchiera_per_donna/"
    },
    {
        "id": "1knz093",
        "author": "_danm",
        "title": "Dove alloggiare a Torino?",
        "content": "Ciao a tutti, sto pensando di trascorrere un weekend a Torino e volevo sapere dove fosse meglio alloggiare. Quali sono le zone migliori secondo voi?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1knz093/dove_alloggiare_a_torino/"
    },
    {
        "id": "1knwuta",
        "author": "Prudent-Joke-5153",
        "title": "Nuovi in città? Cerchiamo gente tra i 25-32 anni per uscire nel weekend! 🍻",
        "content": "Ciao a tutti!\n\nIo (28M) e il mio coinquilino (26M) ci siamo trasferiti da poco in città per lavoro e, come spesso succede, non conosciamo ancora nessuno fuori dall’ambiente lavorativo.\n\nAbbiamo creato un gruppo WhatsApp per conoscere persone nella nostra stessa situazione: nuova città, nuova fase della vita, voglia di uscire e socializzare un po’ nel weekend.\nChe sia per un aperitivo, una birra, una serata tranquilla o anche una gita fuori porta… l’idea è semplicemente quella di fare due chiacchiere e creare un giro di amicizie.\n\n👉 Link per unirsi al gruppo WhatsApp:\nhttps://chat.whatsapp.com/FyNrvw3cJRED1YQflmZxbk\n\n⸻\n\n✅ Regole semplici ma importanti:\n\t•\tEtà compresa tra 25 e 32 anni\n\t•\tImmagine profilo obbligatoria (giusto per evitare account fake o poco chiari)\n\t•\tPersone che si trovano più o meno nella stessa situazione: nuovi in città o in cerca di nuove conoscenze\n\t•\tUna volta entrati, presentatevi brevemente: nome, età, cosa fate, hobby/interessi — aiuta a rompere il ghiaccio e a mantenere il gruppo autentico e attivo\n\n⸻\n\nSe vi riconoscete in questo messaggio, siete i benvenuti! ",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JQsk8GO__KcV0utypc4fuPdyryvmyMWZPx-ru1nQO4A.jpg?auto=webp&amp;s=7d5dfe0623a795715708cb37763842dde251dd13"
        },
        "permalink": "/r/torino/comments/1knwuta/nuovi_in_città_cerchiamo_gente_tra_i_2532_anni/"
    },
    {
        "id": "1knovyo",
        "author": "Pablo65t",
        "title": "Notturni per 2 chiacchiere?",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1knovyo/notturni_per_2_chiacchiere/"
    },
    {
        "id": "1kndi5l",
        "author": "tommodacoolio",
        "title": "Solo In Torino 22nd May - 26th May",
        "content": "Ciao a tutti\n\nNext Thursday I will arrive in your beautiful city on a solo trip for about 4 days. Usually when I go on my solo city breaks I use apps such as meetup etc as well as Reddit and getting chatting to strangers in bars etc.\n\nIf anyone who is also on a trip here or a local who lives here would like to get a drink, food, explore the city etc then please drop me a message. I am 32M from the UK.\n\nI appreciate that some people would not be comfortable meeting a random person online, which is why I would also like to ask for recommendations regarding which places, areas, bars and pubs are good for meeting people solo? (I don't do nightclubs personally)\n\nI am looking forward to exploring and eating my way around your fantastic city and I am particularly looking forward to trying tajarin, agnolotti and drinking bicerin as well as seeing the view from Chiesa di Santa Maria del Monte dei Cappuccini.\n\nIt will also be my birthday whilst I am in Torino so looking to treat myself to some fantastic good and great experiences.\n\nI've done a bit of research but I'm still open to all kinds of recommendations.\n\nGrazie",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1kndi5l/solo_in_torino_22nd_may_26th_may/"
    },
    {
        "id": "1kmmquk",
        "author": "Chiaraphsi",
        "title": "Cane abbandonato a Torino",
        "content": "Ciao ragazzi, 2 giorni fa questa cagnolina è stata abbandonata in pieno giorno a Torino. In zona Corso Casale.\nLa signora che l'ha abbandonata l'ha legata ad una grata di un'associazione cinofila. Purtroppo non abbiamo fatto in tempo a beccarlo sul fatto, perché era già scappata. \nLa piccola è terrorizzata, non ha microchip, non ha collare con il nome...ha iniziatl a mangiare solo ieri sera.\nPer fortuna è stata recuperata immediatamente da persone esperte e oggi è stata anche dal veterinario. \nSono davvero senza parole per il gesto di questa signora, ma la cucciola ora è in mani super sicure. Probabilmente verrà adottata a breve ma sarebbe davvero importante conoscere il suo nome per poterla tranquillizzare e farla sentire più a casa.\nSe qualcuno di voi l'ha mai vista in zona, o per caso conoscesse la situazione, non importa davvero sapere perché o per come, ma almeno conoscere il nome. \nForza reddit, magari ci riusciamo 💜",
        "upvotes": 193,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ipi3fhr3ks0f1.jpeg?auto=webp&amp;s=904114cbd813b027713c161e8474de21d161c2a0"
        },
        "permalink": "/r/torino/comments/1kmmquk/cane_abbandonato_a_torino/"
    }
]