[
    {
        "id": "1oong6p",
        "author": "DanTrachtenbergAMA",
        "title": "Hey r/movies, Dan Trachtenberg here - excited to be back and chat about my new film PREDATOR: BADLANDS, coming to a theater near you this Friday (11/7). Ask Me Anything!",
        "content": "https://preview.redd.it/vfiay4cfubzf1.jpg?width=4284&amp;format=pjpg&amp;auto=webp&amp;s=c17dba9b7674172c4e52770aace91a3030fa0ba3\n\nHey r/movies \\- I’m Dan Trachtenberg, Director of PREY, PREDATOR: KILLER OF KILLERS, and 10 CLOVERFIELD LANE. My next movie PREDATOR: BADLANDS arrives in theaters this Friday. \n\nI’ll be setting aside some time this Thursday, 11/6, at 11AM PT to answer your questions. See you all there!\n\nTrailer: [https://www.youtube.com/watch?v=cDL3Zjdz514](https://protect.checkpoint.com/v2/r01/___https://www.youtube.com/watch?v=cDL3Zjdz514___.YzJ1OnJlZGRpdDpjOmc6M2YxMzNmMTIyYTQ4ZDM3NjU1YTM3MWMyNzdhNTI0MWU6NzowMzQzOjc2YjhlMjI0NzJkMGIzMWU5ZTNiMjdkNWE5MDFlMWIyNjYyNDAyZmIwYWM1NTA4MzJkYmU0ODliNjUwZjJjZjg6aDpUOk4)\n\nSynopsis: \n\nSet in the future on a deadly remote planet, “Badlands” follows a young Predator outcast (played by newcomer Dimitrius Schuster-Koloamatangi) who finds an unlikely ally in Thia (Emmy and Golden Globe nominee Elle Fanning) as he embarks on a treacherous journey in search of the ultimate adversary. “Predator: Badlands” opens exclusively in movie theaters on November 7 in IMAX, Dolby Cinema, RealD (3D), Cinemark XD, 4DX, ScreenX and premium screens everywhere.",
        "upvotes": 92,
        "comments": 60,
        "media": null,
        "permalink": "/r/movies/comments/1oong6p/hey_rmovies_dan_trachtenberg_here_excited_to_be/"
    },
    {
        "id": "1okir4q",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Bugonia / Blue Moon / If I Had Legs I'd Kick You / Ballad of a Small Player) plus throwback discussions",
        "content": "**New In Theaters**:\n\n* [Bugonia](https://www.reddit.com/r/movies/comments/1okihoi/offcial_discussion_bugonia_spoilers/?)\n* [Blue Moon](https://www.reddit.com/r/movies/comments/1okihrc/official_discussion_blue_moon_spoilers/?)\n* [If I Had Legs I'd Kick You](https://www.reddit.com/r/movies/comments/1okihu6/official_discussion_if_i_had_legs_id_kick_you/?)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Book of Shadows: Blair Witch 2](https://www.reddit.com/r/movies/comments/1okihyi/official_throwback_discussion_book_of_shadows/?)\n* [The Little Vampire](https://www.reddit.com/r/movies/comments/1okii15/official_throwback_discussion_the_little_vampire/?)\n* [Lucky Numbers](https://www.reddit.com/r/movies/comments/1okiif7/official_throwback_discussion_lucky_numbers/?)\n\n**Still In Theaters**:\n\n* [Springsteen: Deliver Me from Nowhere](https://old.reddit.com/r/movies/comments/1oelypv/official_discussion_springsteen_deliver_me_from/?)\n* [Chainsaw Man - The Movie: Reze Arc](https://old.reddit.com/r/movies/comments/1oelyre/official_discussion_chainsaw_man_the_movie_reze/?)\n* [Shelby Oaks](https://old.reddit.com/r/movies/comments/1oelysx/official_discussion_shelby_oaks_spoilers/?)\n* [Regretting You](https://old.reddit.com/r/movies/comments/1ofgyzw/official_discussion_regretting_you_spoilers/?)\n* [Black Phone 2](https://old.reddit.com/r/movies/comments/1o8p3a4/official_discussion_black_phone_2_spoilers/?)\n* [Good Fortune](https://old.reddit.com/r/movies/comments/1o8p3c9/official_discussion_good_fortune_spoilers/?)\n* [Tron: Ares](https://old.reddit.com/r/movies/comments/1o2okpk/official_discussion_tron_ares_spoilers/)\n* [Roofman](https://old.reddit.com/r/movies/comments/1o2okr6/official_discussion_roofman_spoilers/?)\n* [One Battle After Another](https://old.reddit.com/r/movies/comments/1nqpegf/official_discussion_one_battle_after_another/?)\n\n\n**New On Streaming:**\n\n* [Ballad of a Small Player](https://www.reddit.com/r/movies/comments/1okihwe/official_discussion_ballad_of_a_small_player/?)\n* [A House of Dynamite](https://old.reddit.com/r/movies/comments/1ofgyx9/official_discussion_a_house_of_dynamite_spoilers/?)\n* [The Hand that Rocks the Cradle (2025)](https://old.reddit.com/r/movies/comments/1ofgz2p/official_discussion_the_hand_that_rocks_the/?)\n* [The Twits](https://www.reddit.com/r/movies/comments/1oae8r7/official_discussion_the_twits_spoilers/?)\n* [I Like Me](https://www.reddit.com/r/movies/comments/1oae8u5/official_discussion_i_like_me_spoilers/?)\n* [The Lost Bus](https://old.reddit.com/r/movies/comments/1o8p3is/official_discussion_the_lost_bus_spoilers/?)\n* [Play Dirty](https://old.reddit.com/r/movies/comments/1ny4mel/official_discussion_play_dirty_spoilers/?)\n* [Steve](https://old.reddit.com/r/movies/comments/1ny4mgo/official_discussion_steve_spoilers/?)",
        "upvotes": 36,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1okir4q/official_discussion_megathread_bugonia_blue_moon/"
    },
    {
        "id": "1oohm06",
        "author": "MarvelsGrantMan136",
        "title": "Brendan Fraser &amp; Rachel Weisz In Talks To Return For New ‘Mummy’ Movie From Universal; Radio Silence To Direct",
        "content": "",
        "upvotes": 16833,
        "comments": 984,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tWyywqhQtMBIOipgv5g4LUme6SScUdKkuSSD5OVc-Dw.jpeg?auto=webp&amp;s=5e040873fff3d6a4605f149448f68166ea8eafe9"
        },
        "permalink": "/r/movies/comments/1oohm06/brendan_fraser_rachel_weisz_in_talks_to_return/"
    },
    {
        "id": "1oo4vyv",
        "author": "MarvelsGrantMan136",
        "title": "Robert Pattinson finally confirms ‘Dune: Part Three’ casting and reflects on filming the sequel in the desert",
        "content": "",
        "upvotes": 9399,
        "comments": 549,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dBdrvN0Ned5NQfSClGgvHT6NEZxgPZkQJDt8NXZqPTc.jpeg?auto=webp&amp;s=094914025a50e0440472cb9d06c1500104f224a0"
        },
        "permalink": "/r/movies/comments/1oo4vyv/robert_pattinson_finally_confirms_dune_part_three/"
    },
    {
        "id": "1ooihw3",
        "author": "vought-CEO",
        "title": "New poster for Guillermo del Toro’s ‘FRANKENSTEIN’",
        "content": "",
        "upvotes": 1274,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pa6hm26cwazf1.jpeg?auto=webp&amp;s=8104b62c0c04f179c132dd29b1116c626b47377c"
        },
        "permalink": "/r/movies/comments/1ooihw3/new_poster_for_guillermo_del_toros_frankenstein/"
    },
    {
        "id": "1oo9qte",
        "author": "Accomplished_Store77",
        "title": "When did Male Characters being Ripped(regardless of genre) become a norm in movies.",
        "content": "So I just recently watched The Long Walk. And among many other things one thing I really appreciated about the movie was how average everyone looked.\nOutside of McVries and Stebbins most characters were super jacked or ripped with 6% Body fat. They were just average looking guys.\n\nAnd this raised a question in my mind. When exactly did it become a norm for leading men to be super jacked or ripped in films.\n\nI remember watching older films where the Leading Men were just average looking guys. Even in movies that had action in them.\n\nSean Connery's Bond had a fairly average build. Gene Hackman's Detective character in The French Connection looked like an average Middle Aged Guy.\nHarrison Ford's Deckard had an average man build too.\n\nBut today. If you see a horror movie the main Male character is going to be ripped.\n\nYou see a Sci Fi film the main Male character is going to be ripped.\n\nYou make a Detective movie, the main 40 year old Family man detective is going to be ripped as fuck.\n\nIf it's a teen he's going to be ripped. \n\nIf it's a doctor he's going to be ripped. \n\nIf it's a lawyer he's going to be ripped.\n\nSo when did this become a norm and why?\n\nI initially thought it might have started with Arnold Schwarzenegger and Sylvester stallone who brought the jacked look to the American Hero.\n\nBut even in the era of of Schwarzenegger and Stallone you had average guy Action heroes like Bruce Willis in Die Hard, Michael Beihn in Terminator and Ford in Witness and The Fugitive.\nLet alone in non action leading roles.\n\nSo I really am confounded as to when this trend properly started where any lead character regardless of the genre or role has to be ripped. ",
        "upvotes": 3475,
        "comments": 1503,
        "media": null,
        "permalink": "/r/movies/comments/1oo9qte/when_did_male_characters_being_rippedregardless/"
    },
    {
        "id": "1oocm6c",
        "author": "ChiefLeef22",
        "title": "'Predator: Badlands' - Review Thread",
        "content": "*Cast out from its clan, an alien hunter and an unlikely ally embark on a treacherous journey in search of the ultimate adversary.*\n\nDirector: Dan Trachtenberg\n\nCast: Elle Fanning, Dimitrius Koloamatangi\n\n**Rotten Tomatoes:** [89%](https://www.rottentomatoes.com/m/predator_badlands)\n\n**Metacritic:** [69 / 100](https://www.metacritic.com/movie/predator-badlands/)\n\nSome Reviews:\n\n[NextBestPicture - Giovanni Lago](https://nextbestpicture.com/predator-badlands/) \\- 6 / 10\n\n&gt;Trachtenberg's approach this time around gradually builds to a more underwhelming outing, even if his vision finds itself at its most grand. Not every set piece is effective despite some wonderful below-the-line work to help elevate the experience. The inevitable steering towards a more franchise-heavy focus is all but worrisome.\n\n[The Guardian - Peter Bradshaw](https://www.theguardian.com/film/2025/nov/04/predator-badlands-review-elle-fanning) \\- 2 / 5\n\n&gt;The sheer pointlessness of everything that happens subtracts the oxygen and even Fanning’s imperishable star quality can’t save it.\n\n[The Hollywood Reporter - Richard Lawson](https://www.hollywoodreporter.com/movies/movie-reviews/predator-badlands-review-elle-fanning-dan-trachtenberg-1236417477/)\n\n&gt;It’s a perspective shift that mostly works, so thoughtful is the film’s construction. Trachtenberg is generous but also careful with detail; his film remembers what it has previously introduced us to, satisfyingly referencing back to plants and animals passingly encountered an hour prior. *Badlands* is a decidedly B-movie that thoroughly utilizes and enjoys the freedoms allowed when any prestige ambition is eschewed. The film simply wants to be the best version of a zillionth *Predator* installment that it can be. If it has to complicate — and, yes, soften — the branding to do that, so be it. \n\n[David Ehrlich - IndieWire](https://www.indiewire.com/criticism/movies/predator-badlands-movie-review-1235158691/) \\- 'B+'\n\n&gt;The least “Predator”-like moments in this standalone sequel are rooted in Trachtenberg’s love for the property, and all help “Badlands” to make a uniquely compelling argument that “Predator” deserves to be higher on the Hollywood food chain than anyone thought to place it over the last 40 years. By reckoning with the series’ fundamental weakness rather than continuing to pretend that it’s the series’ greatest strength, Trachtenberg has made the brand richer than ever before. No, this isn’t your daddy’s “Predator,” and it *definitely* isn’t *Dek’s* daddy’s “Predator,” but as a wise synthetic once said, “We can be more than what they ask of us.” How rare — and extremely refreshing — to see a big studio movie recognize that the same can be true of itself. \n\n[IGN - Clint Gage](https://www.ign.com/articles/predator-badlands-review) \\- 8 / 10\n\n&gt;Dan Trachtenberg is heading in an interesting direction with this franchise and he gets bonus points for that. The Predator as a mysterious murder monster is getting some of his backstory filled in, and that’s not necessarily a bad thing. Badlands, in shifting the perspective to a Yautja main character, actually highlights what’s been great about this franchise in its better moments. Dek and Thia are an unexpectedly fun pairing that bring a new energy to the franchise and an altogether different kind of hunt. It might not be pulling the skull and spine out of us and screaming in bloody victory, but it gets close.\n\n[DEADLINE - Damon Wise](https://deadline.com/2025/11/predator-badlands-review-elle-fanning-dimitrius-schuster-koloamatangi-1236606321/)\n\n&gt;Returning director Dan Trachtenberg is clearly in a groove here, and his enthusiasm helps, notably in the film’s impeccable world-building. But the action scenes never seem to galvanize, and somewhere along the line the predator, once a ruthless, unstoppable killing machine, has simply lost its menacing mojo. It all seems a bit, well, *silly* — like a long episode of *Succession* starring John Travolta’s character in *Battlefield Earth*, or the adventures of Eric Trump in space — and that surely can’t bode well for the inevitable next instalment.\n\n[Slash Film - Jeremy Mathai](https://www.slashfilm.com/2016872/predator-badlands-movie-review/) \\- 8 / 10\n\n&gt;If there are any negatives to point out, they're mostly a byproduct of blockbuster issues as a whole. The brisk pacing that keeps things moving at a breezy clip also means any semblance of character depth and nuance is either left as subtext or outright explained in exposition, though Trachtenberg still manages to find quiet grace notes for both Dek and Thia (and perhaps others too spoilery to give away here) amid all the carnage. And even as the action rivals anything in the franchise, the much larger sense of scale might have some yearning for the contained, stripped-down joys of \"Prey.\" All of those nitpicks pale in comparison to what the filmmakers accomplish here, however. By far the funniest, most heartfelt, and boldest \"Predator\" movie of them all, \"Badlands\" etches its place in franchise history — right alongside the classic that started it all and the three worthy follow-ups that Trachtenberg has delivered so far. Let's hope there are many more to come.\n\n",
        "upvotes": 1290,
        "comments": 385,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PYQ0-VjjDsFlh2HCxD1peUUfiUACGqsregOuU_NaGzE.jpeg?auto=webp&amp;s=18a1ed424b460f44a71aa9fb5d65984fa179162c"
        },
        "permalink": "/r/movies/comments/1oocm6c/predator_badlands_review_thread/"
    },
    {
        "id": "1ooq7ku",
        "author": "williamrnava",
        "title": "Micro-perf is ruining some movie theaters",
        "content": "I started noticing a couple of years ago what looked like a grid of black dots displayed over movies in some movie theaters. It ranges from \\*very\\* visible and distracting to only slightly so. The issue is that these are 'micro-perf' screens: screens with tiny holes built into them to allow a sound from a speaker placed behind the screen to carry through. In theory, these holes are supposed to be so tiny that they're impossible to see. Unfortunately, that is not the case at a bunch of movie theaters, at least in NYC.\n\nIt looks something like this: [https://share.google/images/3lf5WK8fQr9iQsA4z](https://share.google/images/3lf5WK8fQr9iQsA4z)\n\nHas anyone else been noticing this? I'm kind of shocked at how distracting it is and at the fact that I haven't found it being discussed anywhere.\n\nThe places I've most noticed it (in NYC) are Film Forum, Nitehawk, and Angelika East (downstairs, not the big screen). These are all small/indie movie theaters, so I guess it wouldn't surprise me if it isn't a problem at big multiplexes.\n\nEDIT: A bunch of people are pointing out that this tech is very old and standard. So I was wrong to imply that the issue is micro-perf'd screens in general! Still, something about how this tech is being used recently, at least in some indie chains in NYC, is having some very bad results.",
        "upvotes": 203,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mSf9II6Djv2tBZ1L3MwNCP9tFEe2vBMxZ00Xa4k3a10.jpeg?auto=webp&amp;s=6a861b3353a1490e947a2f41272c41ecad0d76fb"
        },
        "permalink": "/r/movies/comments/1ooq7ku/microperf_is_ruining_some_movie_theaters/"
    },
    {
        "id": "1oo849m",
        "author": "ChiefLeef22",
        "title": "Jennifer Lawrence says Martin Scorsese's next film 'What Happens at Night', starring her and Leonardo DiCaprio, is expected to begin filming in January/February 2026",
        "content": "",
        "upvotes": 1546,
        "comments": 127,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WRToD23pIjJmt2atMeS7fieT4FO9kZ39LNMBN7KAAg8.jpeg?auto=webp&amp;s=25eb9299531fc42dc8c1342414b5aa7178538cfd"
        },
        "permalink": "/r/movies/comments/1oo849m/jennifer_lawrence_says_martin_scorseses_next_film/"
    },
    {
        "id": "1oovjxd",
        "author": "Rand_Al_Thor87",
        "title": "Veteran actor Tchéky Karyo, star of Nikita and The Missing, dies aged 72",
        "content": "",
        "upvotes": 70,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4kgrto8hTzdy5WKxnOgnuaX83UwG7Rzi-jde0mm9J3Y.jpeg?auto=webp&amp;s=2be16592bbe95aff45e1215348344ee5d5c59fef"
        },
        "permalink": "/r/movies/comments/1oovjxd/veteran_actor_tchéky_karyo_star_of_nikita_and_the/"
    },
    {
        "id": "1ooova0",
        "author": "UnlikelyIdealist",
        "title": "The Tomorrow War (2021) with Chris Pratt is A Christmas Carol",
        "content": "I just realised on a second watch of this B-tier movie - It's the Scrooge story.\n\nThe movie even opens with a Christmas party with Pratt's character being too caught up with work to focus on his family.\n\nHe's then subjected to three \"visits\" - lessons he's supposed to learn about himself.\n\n\n\nSpoilers, naturally.  \n\n\nThe Ghost of Christmas Past is his father - Pratt's character resents his Vietnam vet father for abandoning the family when Pratt's character was a child, which is foreshadowing what's to come.\n\n  \nThe Ghost of Christmas Present is his 2021 wife and daughter, who're trying to show him what he has.\n\n  \nThe Ghost of Christmas Future is his 2051 daughter, as he's transported into the future and shown where his need to do \"something special\" with his life ends - with the loss of his family. He's even dead in the future he's shown.\n\n  \nHaving been shown his future, he returns to the present, reconciles with his father, and takes steps to ensure the future he saw doesn't come to pass.\n\n  \nThe alien apocalypse is just window dressing.\n\n  \nThe movie is no great masterpiece of fiction, but I found the parallels entertaining.",
        "upvotes": 161,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1ooova0/the_tomorrow_war_2021_with_chris_pratt_is_a/"
    },
    {
        "id": "1oot13d",
        "author": "ninman5",
        "title": "What's a common movie trope that would make someone extremely angry if you did it in real life?",
        "content": "For me it's the one where a person wants to walk away from someone they're talking to and the person grabs their wrist or arm to stop them.  Usually a man grabbing a woman.  If someone did that to me I would be so angry with them.\n\nIn real life it would actually be considered assault and possibly harassment.  It might even provoke someone to react violently.  What's yours?",
        "upvotes": 84,
        "comments": 143,
        "media": null,
        "permalink": "/r/movies/comments/1oot13d/whats_a_common_movie_trope_that_would_make/"
    },
    {
        "id": "1oofkmv",
        "author": "NoCulture3505",
        "title": "Tramell Tillman and Ian McKellen Join Johnny Depp In ‘Ebenezer: A Christmas Carol’",
        "content": "",
        "upvotes": 466,
        "comments": 103,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qaRLrVbSCp-dvNFe9a9NJtjazgqk8Zr_AkNKCdWqKSM.jpeg?auto=webp&amp;s=050336baf599f273395c658e4bc990b31b59ee21"
        },
        "permalink": "/r/movies/comments/1oofkmv/tramell_tillman_and_ian_mckellen_join_johnny_depp/"
    },
    {
        "id": "1ooucpe",
        "author": "TheLewdFiend",
        "title": "New Five Nights at Freddy’s 2 poster",
        "content": "",
        "upvotes": 45,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rfz4qy97hdzf1.jpeg?auto=webp&amp;s=9ecbe8906d2d7395a32a211d5b003d5ea1e73fca"
        },
        "permalink": "/r/movies/comments/1ooucpe/new_five_nights_at_freddys_2_poster/"
    },
    {
        "id": "1oofhl5",
        "author": "LaserDiscCurious",
        "title": "\"Ladyhawke\" (1985) is the medieval romantic fantasy epic which should be a beloved triumph but has to settle for a small cult following. Michelle Pfeiffer was never more beautiful than in this.",
        "content": "I even enjoyed Matthew Broderick's bumbling Phillippe Gaston with the American accent because Broderick always had that appealing boy next door aura that made him easy to root in everything he's in. We know his character doesn't stand a chance with the otherworldy Isabeau, enchantingly played by Michelle Pfeiffer, but I don't know, I think every dorky kid saw themselves in Phillipe as he and Isabeau playfully flirted. \n\nI love this movie to bits. The concept of two soulmates separated by a curse which prevented them to see each other as humans is quite lovey-dovey in the right way and while Rutger Hauer mostly played complex bad guys, I think that actually enhanced his turn as Navarre, who's a heroic while still tough and almost unapproachable figure. He can be stern and rough because he's unhappy that his loyal hawk is actually the love of his life, a woman cursed to live as a hawk during the day, but when he warms up to Phillippe and he gives us a monologue, Hauer shines and reminds us of the brilliance of his big scene in Blade Runner. Such an incredibly underrated actor. \n\nThe movie didn't do well in the 80s, cuz people have no taste, and I don't get the constant bitching about the Alan Parsons Project score. I actually like the use of the synthethizers mixed with that romantic, conventional melody. It's unique and fantastic. \n\nI wish more people knew about it.",
        "upvotes": 290,
        "comments": 91,
        "media": null,
        "permalink": "/r/movies/comments/1oofhl5/ladyhawke_1985_is_the_medieval_romantic_fantasy/"
    },
    {
        "id": "1oo0t6m",
        "author": "MEMEY_IFUNNY",
        "title": "Lord of War (2005): “How can I sell a used gun” - Dir. Andrew Niccol",
        "content": "Context: Yuri Orlov (Nicolas Cage) meets with the president of Liberia, Andre Baptiste Senior (Eamonn Walker), using a revolver that Yuri was pitching to him on one of his soldiers. \n\nThis is a perfect scene, in my opinion. It’s obvious that Andre sees through the \"used gun\" excuse and knows that Yuri can potentially be threatened or scared, but he can also control himself and push down his humanity for business. An absolute monster cannot be trusted, but a human who can ignore their humanity when it suits them is great for business.",
        "upvotes": 2304,
        "comments": 178,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1wa7lpd8v6zf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1oo0t6m/lord_of_war_2005_how_can_i_sell_a_used_gun_dir/"
    },
    {
        "id": "1oo8gnd",
        "author": "LackOfStack",
        "title": "What scene did you watch an upcoming actor in that made you think “ok they’re going to be big”?",
        "content": "Just as an example, Amy Adams in Talladega Nights:The Ballad of Ricky Bobby absolutely crushed the barroom scene monologue with Will Farrell and I suddenly realized that she was much bigger than the bit parts she’d played in “The Office” or “Catch me if you can”. \n\n“Ricky Bobby isn’t a thinker. Ricky Bobby is a DRIVER”.",
        "upvotes": 445,
        "comments": 916,
        "media": null,
        "permalink": "/r/movies/comments/1oo8gnd/what_scene_did_you_watch_an_upcoming_actor_in/"
    },
    {
        "id": "1oocool",
        "author": "BunyipPouch",
        "title": "First Image of Jay Baruchel &amp; Ed Helms in Action-Biopic 'The Stunt Driver' - The film chronicles the daredevil stuntman Ken Carter's quest to execute a bold stunt of launching a rocket car across the St. Lawrence River from Canada to the US in the 1970s, facing absurd challenges along the way.",
        "content": "",
        "upvotes": 266,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rk6h9p2iu9zf1.jpeg?auto=webp&amp;s=a84f64f75cbe33ba5f99a06fe87e504f8b9251d2"
        },
        "permalink": "/r/movies/comments/1oocool/first_image_of_jay_baruchel_ed_helms_in/"
    },
    {
        "id": "1ont91z",
        "author": "Amaruq93",
        "title": "A behind-the-scenes clip of Rie Ota, the actress who played Baragon in \"Godzilla: GMK\" (2001). She was the first female monster suit actor in the Godzilla franchise.",
        "content": "",
        "upvotes": 4767,
        "comments": 109,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vd6n7nwvx4zf1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ont91z/a_behindthescenes_clip_of_rie_ota_the_actress_who/"
    },
    {
        "id": "1ooptxa",
        "author": "cryptofutures100xlev",
        "title": "‘Highlander’ Remake Adds Siobhán Cullen, Jun Jong-seo, Nassim Lyes, and Kevin McKidd (Exclusive)",
        "content": "",
        "upvotes": 40,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/h6EDLiHsZUuv7LFYpzJKyGVfwM3ZxcvTFzA3F4NIs70.jpeg?auto=webp&amp;s=42d7c7d1c1d73539e330881d19362b97c375360f"
        },
        "permalink": "/r/movies/comments/1ooptxa/highlander_remake_adds_siobhán_cullen_jun_jongseo/"
    },
    {
        "id": "1ooc401",
        "author": "JonnyBunning",
        "title": "Frank Grillo, Maria Bakalova to Lead Sci-Fi Survival Thriller Override",
        "content": "",
        "upvotes": 171,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YrZvRHN3hMDKD6wgjugnL7M8u9oKYPlU2kNyyQFFfWU.jpeg?auto=webp&amp;s=7c826e523c6d7152a36f77569286611a2c7bbb53"
        },
        "permalink": "/r/movies/comments/1ooc401/frank_grillo_maria_bakalova_to_lead_scifi/"
    },
    {
        "id": "1oobkas",
        "author": "Neo2199",
        "title": "Crimson Tide (1995) - We're here to preserve democracy, not to practice it.",
        "content": "",
        "upvotes": 163,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6EtNRRgCOTh9JsPMaBIANYQx9U70idKQXpdVFPeuICU.jpeg?auto=webp&amp;s=4b6ac58442d95a3ae5c8f335b1240da93fb09c64"
        },
        "permalink": "/r/movies/comments/1oobkas/crimson_tide_1995_were_here_to_preserve_democracy/"
    },
    {
        "id": "1oog9aw",
        "author": "Valparu",
        "title": "Is there a term for when sequels get more progressively more comedic/lighthearted in tone than the original movie in a franchise?",
        "content": "Just to give examples of what I am talking about, think of:\n\n\\-\tMonsterverse (Godzilla 2014 to GxK: The New Empire, the tone got less serious)\n\n\\-\tA Nightmare on Elm Street (From the original to Freddy´s Dead, a lot more comedy)\n\n\\-\tIce Age (the 1st one was lighthearted of course, but towards Collision Course, it became a lot more absurd)\n\nThere are most likely more examples of this trend that I am forgetting, and I am not saying that the more lighthearted ones are worse, just find interesting this increase in comedy in various franchises with a lot of entries.\n\nSo just wanted to ask if there has ever been discussed why some Directors and Studios decide to take a franchise in a more lighthearted direction if the tone of the 1st movie was not controversial or a particularly disliked element, and if there is like a movie term or nickname for when this happens in a franchise.\n\n",
        "upvotes": 92,
        "comments": 176,
        "media": null,
        "permalink": "/r/movies/comments/1oog9aw/is_there_a_term_for_when_sequels_get_more/"
    },
    {
        "id": "1oou8mq",
        "author": "TheLewdFiend",
        "title": "Five Nights at Freddy's 2 | Official Trailer 2",
        "content": "",
        "upvotes": 14,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eQXo8jdZVyBb2Q75qL2r2VfMfguzNi0bdVDaosX6QwM.jpeg?auto=webp&amp;s=9da4ecb3c0636c41be21460530f693297e011a39"
        },
        "permalink": "/r/movies/comments/1oou8mq/five_nights_at_freddys_2_official_trailer_2/"
    },
    {
        "id": "1oou8ku",
        "author": "Marie8771",
        "title": "Oddities in IMDB trivia for \"Heat\" feat. John Rhys-Davies",
        "content": "So tonight I watched \"Heat\" for the first time (I know, I know) as I'm on a bit of a Michael Mann kick. As usual as soon as I finished it I headed over to the IMDB trivia section.\n\nThe trivia contains several references to John Rhys-Davies, who is...not in the film. Although some comments reference that he may have originally been cast to play the role that John Voight went on to play? I haven't found other sources for this being the case. (I'm aware that IMDB trivia isn't ironclad as anyone can add it, this is just a funny example of it)\n\nBut like...read these.\n\n&gt;John Rhys Davies pushed director Michael Mann to make the Neil McCauley and Vincent Hanna characters \"little people\" using forced perspective camera techniques, but this was shot down as being too costly. He would later revisit this concept with Peter Jackson on Lord of the Rings.\n\nLike...what? He wanted them to look...little? And AFAIK the forced perspective concept used in LOTR was not the idea of John Rhys-Davies.\n\nAnd then:\n\n&gt;Michael Mann and actor John Rhys Davies have not spoken in 30 years but occasionally share funny YouTube videos through an intermediary.\n\nUm...ok. How would anyone know this, if this were in fact true.\n\nAnd then:\n\n&gt;The character of Nate was originally cast with John Rhys Davies, but during shooting Davies kept referring to DeNiro's Neil McCauley as \"Indy\". Despite attempts to work around this, the character was eventually recast with Jones Voight.\n\nWHAT.\n\nAnd finally:\n\n&gt;John Rhys Davies and director Michael Mann frequently clashed over the use of the word \"kadam\" rather than the conventional imperial foot as a unit of measurement in the script. And also whether the Nate character would have a pet monkey.\n\nOkay. Someone's definitely trolling...in the Trivia section of the movie \"Heat\" on IMDB. That is some specific-ass internet trolling.",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1oou8ku/oddities_in_imdb_trivia_for_heat_feat_john/"
    },
    {
        "id": "1oopusb",
        "author": "ElHijoDelClaireLynch",
        "title": "What Was the Last Movie That Made You Cry?",
        "content": "Just got around to The Iron Claw. Let me preface this by saying I’m familiar with the story of the Von Erich Family. I’ve been a lifelong wrestling fan, and my dad would always tell me about the family when I was growing up.     \n\nI already knew everything. Every twist and corner, but each one hit me like a truck. This movie completely broke me. I don’t think I’ve ever truly been emotionally affected by a movie like this. Just totally ruined.      \n\nIron Claw joins Pixar’s Up as the only two movies that have truly made me cry. Which one made you a blubbering mess?",
        "upvotes": 17,
        "comments": 91,
        "media": null,
        "permalink": "/r/movies/comments/1oopusb/what_was_the_last_movie_that_made_you_cry/"
    },
    {
        "id": "1oomspw",
        "author": "Comic_Book_Reader",
        "title": "Anthony Hopkins, Toni Collette, Stephen Graham, Charlie Plummer join Morten Tyldum’s ‘Ibelin’.",
        "content": "&gt;Charlie Plummer, Stephen Graham, Toni Collette, Isabela Merced, Maisy Stella and Anthony Hopkins have joined the cast of Ibelin, a dramatization of the real life story of Norwegian gamer Mats Steen and his virtual alter ego in World of Warcraft. Steen’s story was told in Benjamin Ree’s Emmy-nominated documentary The Remarkable Life of Ibelin.\n\n&gt;The film will be directed by Academy Award nominee Morten Tyldum (The Imitation Game) from a screenplay by BAFTA nominee Ilaria Bernardini (Citadel: Diana) and with current revisions by Academy Award nominee Hossein Amini (Drive). The story is based on Steen’s blog Musings of Life, which detailed his life with a degenerative muscular disease and the relationships he built online as “Ibelin.”\n\n...\n\n&gt;Production is scheduled to begin in Europe in spring or summer 2026.",
        "upvotes": 26,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ODYqIlt-PthvO18prYoZJ97ARm-HOx6wZxdkxQoyV2A.jpeg?auto=webp&amp;s=bf13fb1041457a0ca5621eaef93f841097fb05db"
        },
        "permalink": "/r/movies/comments/1oomspw/anthony_hopkins_toni_collette_stephen_graham/"
    },
    {
        "id": "1oojr6y",
        "author": "RealJohnGillman",
        "title": "‘Predator: Badlands’ | “Tessa Online” Official Clip",
        "content": "",
        "upvotes": 25,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/InydlAoLrFZkT_-Nema3poAO_QvqFyGL63IN62QCQfs.jpeg?auto=webp&amp;s=e55dc909c69d8295419e9f7ea7a726032a762d7b"
        },
        "permalink": "/r/movies/comments/1oojr6y/predator_badlands_tessa_online_official_clip/"
    },
    {
        "id": "1oos04c",
        "author": "s1nglejkx",
        "title": "Fantastic Planet",
        "content": "What are your thoughts on it? It was originally named \"La Planète Sauvage\".\n My first viewing I was... altered, at the time (either LSD or mushrooms - I don't don't remember - and at that particular time it was an absolute smorgasbord  of visual and musical amazingness, but I have watched it several times since - even bought the book and read it, and it, to me, is a very entertaining movie even unaltered.",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1oos04c/fantastic_planet/"
    },
    {
        "id": "1oojd2x",
        "author": "Bennett1984",
        "title": "THE MAGNIFICENT LIFE OF MARCEL PAGNOL | Official Teaser",
        "content": "",
        "upvotes": 19,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4mN5b3VyF3w5vqvLnxbemsN-XiUYxkvbC-GuUw1aTb0.jpeg?auto=webp&amp;s=4ffd8b625fd3b4b985e6d9fcd8f5590db64b3e05"
        },
        "permalink": "/r/movies/comments/1oojd2x/the_magnificent_life_of_marcel_pagnol_official/"
    }
]