[
    {
        "id": "1hdfh0w",
        "author": "MudbrickAMA",
        "title": "Hi r/movies! We are Nikola Petrovic &amp; Andrew Howard (TENET, LIMITLESS), a writer/director &amp; star of MUDBRICK, the new XYZ FILMS and MIR MEDIA movie available On Demand today! Ask Us Anything!",
        "content": "",
        "upvotes": 29,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/adywqdclzm6e1.png?auto=webp&amp;s=02d6da371feeb782b4b8f7b40cc9125c07d0fcd3"
        },
        "permalink": "/r/movies/comments/1hdfh0w/hi_rmovies_we_are_nikola_petrovic_andrew_howard/"
    },
    {
        "id": "1hd2xa8",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Kraven the Hunter / The Lord of the Rings: The War of Rohirrim / Queer / Flow / Maria / The Piano Lesson)",
        "content": "# New Theatrical Releases\n\n[Kraven the Hunter](https://old.reddit.com/r/movies/comments/1hd2v8v/official_discussion_kraven_the_hunter_spoilers/?)\n\n[The Lord of the Rings: The War of Rohirrim](https://old.reddit.com/r/movies/comments/1hd2vab/official_discussion_the_lord_of_the_rings_the_war/?)\n\n[Queer](https://old.reddit.com/r/movies/comments/1hd2vby/official_discussion_queer_spoilers/?)\n\n[Flow](https://old.reddit.com/r/movies/comments/1hd2vdk/official_discussion_flow_spoilers/?)\n\n# Streaming Releases\n\n[Maria](https://old.reddit.com/r/movies/comments/1hd2vew/official_discussion_maria_spoilers/?)\n\n[The Piano Lesson](https://old.reddit.com/r/movies/comments/1hd2vg7/official_discussion_the_piano_lesson_spoilers/?)\n\n[Carry-On](https://old.reddit.com/r/movies/comments/1hdths9/official_discussion_carryon_spoilers/?)\n\n# Still in Theaters\n\n[Y2K](https://old.reddit.com/r/movies/comments/1h7rhq7/official_discussion_y2k_spoilers/?)\n\n[Werewolves](https://old.reddit.com/r/movies/comments/1h7rhry/official_discussion_werewolves_spoilers/?)\n\n[The Return](https://old.reddit.com/r/movies/comments/1h7rht7/official_discussion_the_return_spoilers/?)\n\n[Wicked: Part 1](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)\n\n[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/)",
        "upvotes": 40,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hd2xa8/official_discussion_megathread_kraven_the_hunter/"
    },
    {
        "id": "1henqg6",
        "author": "ICumCoffee",
        "title": "‘Peaky Blinders’ Movie Wraps Filming - Starring Cillian Murphy, Rebecca Ferguson, Barry Keoghan, Tim Roth, and Stephen Graham",
        "content": "",
        "upvotes": 1939,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lzSCB872GjTfi7SDeeKyvvxFUZfMfrbX9e5nvghs3ys.jpg?auto=webp&amp;s=20349e3bec6835d072be6264fea34ab3e8d1ec34"
        },
        "permalink": "/r/movies/comments/1henqg6/peaky_blinders_movie_wraps_filming_starring/"
    },
    {
        "id": "1hew03m",
        "author": "BunyipPouch",
        "title": "First Image from Sci-Fi Thriller 'Didn't Die' - A podcast host desperately clings to an ever-shrinking audience in the zombie apocalypse.",
        "content": "",
        "upvotes": 189,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xkw9udhdf17e1.jpeg?auto=webp&amp;s=7f88f0bc22a30cff70bd7fdd6aa0a0c2a8ccafbc"
        },
        "permalink": "/r/movies/comments/1hew03m/first_image_from_scifi_thriller_didnt_die_a/"
    },
    {
        "id": "1heunkv",
        "author": "Odd_Advance_6438",
        "title": "Hugh Jackman is phenomenal in Les Miserables",
        "content": "I always loved Hugh Jackman as an actor since I was young, but really only just from playing Wolverine for a while. Now that I’ve seen a lot of his other roles, I’ve realized just how versatile and talented he really is.\n\nI haven’t seen the musical, but I really enjoyed the film version of Les Mis, and it has a pretty incredible performance from Jackman. All the performances were great (I even enjoyed Russell Crowe as Javert) but he really stands out as Jean Valjean, particularly in the scene early on where he decides to turn his life around after being touched by the man’s kindness",
        "upvotes": 112,
        "comments": 68,
        "media": null,
        "permalink": "/r/movies/comments/1heunkv/hugh_jackman_is_phenomenal_in_les_miserables/"
    },
    {
        "id": "1hetrq0",
        "author": "Mst3Kgf",
        "title": "I have a soft spot for \"Die Hard 2\" even though I admit it's basically the least of the original three \"Die Hard\" entries.",
        "content": "There's no way, of course, that \"2\" could hope to escape the shadow of the legendary original, but it's also overshadowed by \"Vengeance\" given that features such things as Bruce Willis and Sam Jackson's interplay and Jeremy Irons's terrific villain turn. It plays often like a rehash of the original (even making fun of it, like when Willis asks how it can happen to him twice). The villains are fine, but not anywhere near as memorable as Alan Rickman or Irons. And so on.\n\nBut I still really like it as a fun action flick and a worthy successor even if it doesn't quite compare to its predecessor and successor. The setting is great as an airport at Christmas is a fabulous setting for maximum carnage and chaos. Willis still has John McClane in this one as a beleaguered everyman thrown into a situation he didn't expect or want (guy just wants to pick up his wife and get back for Christmas with the in-laws) and we see him at arguably his most vulnerable at certain points. And it keeps the tradition of the first one by having even minor characters be memorable (like the cute Avis clerk who both aids and flirts with John or Holly's Taser-wielding seatmate). I frankly like watching both this and the original at Christmas as a pair for some good holiday-themed action.\n\nI'd also add another aspect that stands out; this is the darkest and most brutal entry in the franchise. Not only does it have arguably the most graphic deaths of the series (see John stabbing the mook Baker through the eye with an icicle or Major Grant getting kicked into the plane turbine), but the villains are genuine terrorists in this one, not just using it for cover. Bill Sadler plays Lt. Col. Stuart as a cold-blooded sociopath with none of Hans or Simon's charisma or likable traits, which makes him arguably the scariest \"Die Hard\" villain (easily the most hatable; Sadler apparently considers it a compliment when people tell him how much they hate the character, because that's what he intended). And worst of all, THEY CRASH A PLANE. A plane with over 200 people on it, including children. And no one makes it out alive. You have to respect an action film with the guts to do that to show just how serious the threat is.",
        "upvotes": 117,
        "comments": 138,
        "media": null,
        "permalink": "/r/movies/comments/1hetrq0/i_have_a_soft_spot_for_die_hard_2_even_though_i/"
    },
    {
        "id": "1heijcx",
        "author": "broncosmang",
        "title": "Finally got around to watching Trap and couldn’t help but feel like it was supposed to be… spoilers ahead",
        "content": "I feel like this was originally supposed to be a part of his super hero, super villain universe. There's all these little clues in there that have no real pay off. Like him snatching the box of swag like it's nothing, the whole weirdly inserted psycho-analyst that seemed way too important (like it was supposed to be the chick who ran that weird organization from Glass), tanking like 3 stun guns, and him escaping at the end. \n\nAnyway, movie was whatever, but honestly just felt like it was originally something different - and not just a $20 million dollar investment in his daughter's career.",
        "upvotes": 922,
        "comments": 185,
        "media": null,
        "permalink": "/r/movies/comments/1heijcx/finally_got_around_to_watching_trap_and_couldnt/"
    },
    {
        "id": "1hesdiv",
        "author": "Physical_Plastic138",
        "title": "What are the more incredible “must-see” films you’ve ever watched, that you never want to watch again? ",
        "content": "Some films just evoke that paradoxical sense of, “what a masterpiece… And I never want to see any of it ever again.”\n\nSaving private ryan is firmly atop this list for me. No country for old men and the green mile spring to mind too. I loved all three of them, especially NCFOM… And yet. \n\nWhat’s on your list - and why? These much loved but “un-rewatchable” films are in their own very interesting category, especially when a large audience feels the same way about it. ",
        "upvotes": 96,
        "comments": 401,
        "media": null,
        "permalink": "/r/movies/comments/1hesdiv/what_are_the_more_incredible_mustsee_films_youve/"
    },
    {
        "id": "1hegku9",
        "author": "Dingus_Squatford",
        "title": "Ninth Gate (Johnny Depp, dir. Roman Polanski, 1999)",
        "content": "Does anyone else have a soft spot for this movie?  Something about it just does it for me.  Pre weird-era Johnny Depp as a rare books dealer; part Indiana Jones adventure, part National Treasure, but with satanic manuscripts instead of doodads and geegaws.  Not really horror, but still spooky and unsettling at times.  Impeccable vibes,\nnot really sure how to describe other than mellow and dusty?  Still plenty entertaining and engaging though- this is one of my go-to rewatches and always hits the spot.\n\n “Why the devil?”\n\n“I saw him one day. I was fifteen years old, and I saw him as plain as I see you now. It was love at first sight.”",
        "upvotes": 845,
        "comments": 371,
        "media": null,
        "permalink": "/r/movies/comments/1hegku9/ninth_gate_johnny_depp_dir_roman_polanski_1999/"
    },
    {
        "id": "1he8w3a",
        "author": "meatloafpoptarts",
        "title": "When does an actor officially know they’re in a bad movie? ",
        "content": "I wonder at what point does an actor begin to understand the movie they’re in is not gonna be good? Is it the choice of director, producer, or the script? Or is it something else? With the recent movie Kraven the Hunter I was curious if Aaron Taylor-Johnson had seen the previous installments of their “universe” and if he had, how could he have possibly come to the conclusion this movie was gonna turn out any different? I’m just curious as to why most actors even bother associating themselves with something that is pretty much dead on arrival.",
        "upvotes": 2112,
        "comments": 1068,
        "media": null,
        "permalink": "/r/movies/comments/1he8w3a/when_does_an_actor_officially_know_theyre_in_a/"
    },
    {
        "id": "1he1wj8",
        "author": "MarvelsGrantMan136",
        "title": "‘Dune’ at 40: David Lynch’s Odball Adaptation Remains a Fascination",
        "content": "",
        "upvotes": 5599,
        "comments": 804,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cbHk3KKC1vwNExpO08iqlsv3WCyfNhuRgAStqvrI9MQ.jpg?auto=webp&amp;s=241557c922e336f40e12b5cf3d689b098d1bbc1c"
        },
        "permalink": "/r/movies/comments/1he1wj8/dune_at_40_david_lynchs_odball_adaptation_remains/"
    },
    {
        "id": "1hekcqs",
        "author": "majung33",
        "title": "I finally had the courage to go to the cinema on my own and I'm so glad I did",
        "content": "Hey all, I love going to watch movies in the theatre as I truly believe it can make a huge difference for many films compared with watching at home. Unfortunately I don't always have friends or family that want to join but I've always felt too socially uncomfortable to go by myself as I feel people will judge me.\n\nI just recently decided I should give it a try and man am I happy I did. Some movies are great to watch with friends, but sometimes it's awesome to be able to fully focus and engage with a film without being distracted by others, especially at the theatre. Most recently I went to catch the re-release of Interstellar in 70mm on my own and it was genuinely one of the best movie theatre experiences I've ever had. \n\nLong story short, if you've ever held back on going to a see a film alone, do yourself a favor and go to the movies on your own you won't regret it. Nobody is judging you!",
        "upvotes": 253,
        "comments": 110,
        "media": null,
        "permalink": "/r/movies/comments/1hekcqs/i_finally_had_the_courage_to_go_to_the_cinema_on/"
    },
    {
        "id": "1he58zc",
        "author": "PinkThaiShorts",
        "title": "Debra Paget's snake dance in the 1959 movie The Indian Tomb",
        "content": "",
        "upvotes": 2466,
        "comments": 376,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zWgm1JdS8pWTHgH21ZUdnwfveua3zMaORu94N3xpt8k.jpg?auto=webp&amp;s=ce68d36762cffcbe2c40d18bf5d12b551fd759ec"
        },
        "permalink": "/r/movies/comments/1he58zc/debra_pagets_snake_dance_in_the_1959_movie_the/"
    },
    {
        "id": "1hekhen",
        "author": "ajurban24",
        "title": "I realize now why I love “About Time” so much",
        "content": "First and foremost I know this is a much discussed movie. When I first saw the promo pic for it, it looked like any other rom com. Plus Rachel macadams had done The Vow and Time travelers wife before it. So I initially judged it harshly.\n\nI fell in love with this movie around 2018 when I finally got around to it and it’s become one of my top movies to watch.\n\nI’ve realized why I love it so much and find it so comforting. The father and son relationship reminds me so much of my husband and his dad. They have a wonderful relationship of friendship, respect, playfulness and love. Whenever my husband is out of town and I’m missing him, I watch this movie and I’ve only just realized it’s because it reminds me of him in a way. \n\nWe have 2 daughters and while he won’t have the son and father relationship, I know he will have the same silly and playful relationship with them rooted in love.\n\n\nSorry that was a lot! lol \n\n\nWhat movie reminds you of family?",
        "upvotes": 150,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1hekhen/i_realize_now_why_i_love_about_time_so_much/"
    },
    {
        "id": "1he84we",
        "author": "beasterne7",
        "title": "That’s Not Entirely Accurate - Independence Day (1996) - a thorough examination of one of the least likable characters in the history of cinema: Secretary of Defense Albert Nimziki, played by true genius and legend James Rebhorn.",
        "content": "",
        "upvotes": 837,
        "comments": 110,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/l-mV634Fe5aQZfGCYe6NdPE3rfbSqggnEbadPXHx19A.jpg?auto=webp&amp;s=c628b67dea9b65591ae8af599c8e35d6bfcd3297"
        },
        "permalink": "/r/movies/comments/1he84we/thats_not_entirely_accurate_independence_day_1996/"
    },
    {
        "id": "1hea6bu",
        "author": "Puzzled-Tap8042",
        "title": "Luca Guadagnino Says ‘After the Hunt’ Won’t Tackle ‘Sexuality or Love’ as His Other Films Have",
        "content": "",
        "upvotes": 357,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DzTuCBNM6zUUWgrfHFib7X1Ynnuy0YUwqKtxk8F9bao.jpg?auto=webp&amp;s=f33a759501353fa08750da7464312ee9b0d25730"
        },
        "permalink": "/r/movies/comments/1hea6bu/luca_guadagnino_says_after_the_hunt_wont_tackle/"
    },
    {
        "id": "1hej7fi",
        "author": "madcatzplayer5",
        "title": "Noelle (2019) is an instant Christmas Classic in my family now",
        "content": "This G-Rated Christmas film starring Anna Kendrick and Bill Hader really impressed me after never hearing much at all about it and giving it a watch tonight with my family. I was laughing, then I was tearing up, then I was laughing over and over again. Recommend giving it a watch if you’ve never checked it out before. Anyone else agree?",
        "upvotes": 54,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1hej7fi/noelle_2019_is_an_instant_christmas_classic_in_my/"
    },
    {
        "id": "1he77lp",
        "author": "MC_Triple_Fatal",
        "title": "I just finished watching all the Rocky movies ",
        "content": "Holy shit man. These are some of the greatest movies I ever watched. \n\nThe first movie is good, but it is pretty boring I can’t lie. It doesn’t really get all that interesting until the montage and the final fight. But man, something about that fight made it all worth it. I can’t describe it, just watching that iconic montage and fight made it feel like I didn’t waste my time. \n\nFrom there the movies just kept on getting better. My favorite one has to be 4. And to be honest I didn’t think 5 was that bad. It was enjoyable and had a good story, the only problem was since it was initially the last movie in the franchise, it would be a pretty bad way to end it. I’m glad they gave Rocky’s story a proper ending with Rocky Balboa (hate that name), which I also thought was a great movie. It had probably the most realistic fight in the whole franchise.\n\nI’ve also just finished all the Rambo movies, and just finished the first Creed movie. All of this is to say that the Rocky movies kick ass and I’m mad at myself for not watching them sooner. ",
        "upvotes": 263,
        "comments": 277,
        "media": null,
        "permalink": "/r/movies/comments/1he77lp/i_just_finished_watching_all_the_rocky_movies/"
    },
    {
        "id": "1hev34y",
        "author": "cobwebmurph",
        "title": "Very high frequency audio",
        "content": "I have a very high range of hearing and certain high frequency sounds are worse than nails on chalkboard for me, sometimes causing earaches or headaches. This happens mostly in older movies, specifically those of a horror genre (my favorite). Is there any kind of audio setting I can use to mitigate this or am I screwed?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1hev34y/very_high_frequency_audio/"
    },
    {
        "id": "1hec1ez",
        "author": "Bennett1984",
        "title": "Dead Heat, The Stepfather, The Hidden, and More B-Movie Gems of the VHS Era",
        "content": "",
        "upvotes": 122,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LH326BU5EXM1K6AFm1KTul59GxiGAkbSmc0NPHELr9Q.jpg?auto=webp&amp;s=1b669093a22d10524780716cf2d6ff803c2d0cd8"
        },
        "permalink": "/r/movies/comments/1hec1ez/dead_heat_the_stepfather_the_hidden_and_more/"
    },
    {
        "id": "1he5aj2",
        "author": "BunyipPouch",
        "title": "Irish Rap-Comedy 'Kneecap' Tops British Independent Film Awards with 7 Wins (Best Film, Best Co-Lead Performance, Best Debut Screenplay, Best Casting, Best Editing, Best Original Music, and Best Music Supervision)",
        "content": "",
        "upvotes": 306,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FYrobmUwmr7E4AOSWLVHAcYU_4qCD78Vsq0Lfsbj-4M.jpg?auto=webp&amp;s=cae6afb98082fdf3155af7a8f764b47c512f5e98"
        },
        "permalink": "/r/movies/comments/1he5aj2/irish_rapcomedy_kneecap_tops_british_independent/"
    },
    {
        "id": "1hduhu8",
        "author": "LoneWolfIndia",
        "title": "Unforgiven is one of Clint Eastwood's best movies as a director ever. I mean imagine deconstructing the gunslinger image that made you a star, and stripping away the glamor behind the Wild West.",
        "content": "https://preview.redd.it/yicntwi7lq6e1.png?width=219&amp;format=png&amp;auto=webp&amp;s=4058b385363489b27ba3d34b8e628fe804990207\n\nhttps://preview.redd.it/5a7q1fr9lq6e1.png?width=320&amp;format=png&amp;auto=webp&amp;s=49d5e104f8f85d119d971b127d6b9177902447d2\n\nWilliam Munny is everything that Clint Eastwood was not in his hey days. He can't mount a horse, he can't shoot straight, his hands shake when holding a gun. In one shot, Clint Eastwood demystified and deglamorized the gun slinger, the cowboy. He stripped him of his super hero status and showed he was some one like us, as vulnerable as could be.\n\nhttps://preview.redd.it/9eglkeoplq6e1.png?width=1600&amp;format=png&amp;auto=webp&amp;s=beb95dfb6da04b33733c5019ea3b5560fbd7cafb\n\n\n\nBut much before too, the romance behind Wild West, gets busted in the scene where the  sheriff Little Bill( Gene Hackmann), shows the grimy reality to the starry eyed English Bob. English Bob's romantic visions are shattered, when he finds himself face to face with the actual violence, he can't handle it.\n\nhttps://preview.redd.it/ldzw7xhwlq6e1.png?width=320&amp;format=png&amp;auto=webp&amp;s=79aa0d2c215f80f0c576af8e80fa301e9379f207\n\nCharacters here don't revel in the violence, they are horrified and appalled by it. The Schofeld Kid and English Bob find reality too uncomfortable to handle. Ned Logan( Morgan Freeman) is more of a pacifist, who wants to opt out of the mission, a decision that proves tragic for him. And William Munny himself is on the mission for some money, rather than any honor.\n\nIt is a Western in which there are no heroes and villains per se. William Munny's background is shown to be a sociopath who had no qualms about killing left, right and center. Little Bill while vicious and sadist, is also a God fearing sheriff, who wants to keep the town clean. There are no clear cut black and white, pretty much large swathes of grey.\n\nAnd it has 3 great actors at the top of their game, Clint Eastwood essentially parodying his own image, just check the scene where he tests his shooting skills. Gene Hackmann as the Sheriff, in a morally ambigous character, you hate him when he tortures Morgan Freeman, but then you see that he just wants to keep the town clean, and will do anything for it. And Freeman is as reliable as ever as the soft spoken Ned.",
        "upvotes": 2404,
        "comments": 214,
        "media": null,
        "permalink": "/r/movies/comments/1hduhu8/unforgiven_is_one_of_clint_eastwoods_best_movies/"
    },
    {
        "id": "1heb3a4",
        "author": "Odd_Advance_6438",
        "title": "I was surprised so many people criticize Orlando Bloom’s performance in the Kingdom of Heaven directors cut. I thought he was pretty great",
        "content": "I haven’t seen the theatrical version, so I can’t comment on criticisms of his performance in that, but I think the directors cut is easily his best performance. Felt like the audience gets a good sense of who he is, his morals, and the difficult odds he’s against\n\nIt’s difficult to keep up with actors like Edward Norton, Liam Neeson, and Jeremy Irons, but I think bloom does his best ",
        "upvotes": 116,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1heb3a4/i_was_surprised_so_many_people_criticize_orlando/"
    },
    {
        "id": "1heiinf",
        "author": "beebeegees",
        "title": "If you had to narrow it down, which 4 films of 2025 are you MOST looking forward to?",
        "content": "I’ve seen a number of questionnaires floating around, asking about everyone’s top 4 of 2024, but I’m curious to know which movies have people most excited for the new year. Including any potential dark horses you’d bet on (perhaps as your #5).\n\nI’ll be trying to catch these 4 upon release :)\n\nhttps://imgur.com/a/ZTLZTEJ\n\n(From image: Bong Joon-ho’s sci-fi comedy *Mickey 17*, Park Chan-wook’s comedy-thriller *No Other Choice*, Del Toro’s *Frankenstein* adaptation, and Anderson’s spy comedy *The Phoenician Scheme*)",
        "upvotes": 36,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3YmAsduaCZ8QStnCF6CKGuKy2UkoU2k7ZZsBuP_lQgQ.jpg?auto=webp&amp;s=8bb27021a52bd42223a596863fc1356106635b87"
        },
        "permalink": "/r/movies/comments/1heiinf/if_you_had_to_narrow_it_down_which_4_films_of/"
    },
    {
        "id": "1hef2tj",
        "author": "Reel-Rookie",
        "title": "With AI restorations on the rise in recent years I am becoming worried about the future of movie preservation.",
        "content": "I will preface this post with something positive before I discuss my concerns. The truth is that as long as there are fans of art there will be people who will properly preserve it. If you want a movie in a particular form/ cut, with the original theatrical audio mix, with every special feature ever released for that movie, and in the best/ least compressed presentation possible then there are many places online where you can access it. This post isn't referring to crazy people like me that will seek out that material. This post is aimed at people that I refer to as “casuals” or the people that aren't as crazy as me about this sort of stuff. The people that just want to watch a movie with the click of a button rather than buying a physical disc or searching for an obscure torrent. \n\n\n\nI want to start my concerns about this phenomenon by stating that I am not a gloomy type of person. I see some of the benefits of AI technology when it comes to movie restorations, but my perspective changed after December 12th, 2024. That day I went with a friend to see a one night only screening of Interstella 5555 (2003). That presentation of the movie is the worst my friend and I have ever seen, which is saying something because that movie is cursed with sub par home media releases. The version that my friend and I saw that day was AI upscaled. It ruined all of the details in the image. Every shot in the movie looked like someone rubbed Vaseline on random parts of the screen. It was pretty much unwatchable. (Here are some examples of what my friend and I saw that night: [Example #1](https://www.reddit.com/r/DaftPunk/comments/1gfqxge/interstella_ai_remaster/), [Example #2](https://www.youtube.com/shorts/b_sL6bSRhWw), [Example #3](https://www.youtube.com/shorts/pX_Ss4BrepE)).\n\n\n\nI knew this sort of stuff had happened before like with the recent Blu-ray release of [I Love Lucy](https://www.youtube.com/watch?v=lYdhJMOTPVw) and the [4Ks that James Cameron has released](https://www.youtube.com/watch?v=BxOqWYytypg&amp;pp=ygUXamFtZXMgY2FtZXJvbiA0ayBpc3N1ZXM%3D), however the difference with those is that most of them (except The Abyss) have some other decent release while Interstella 5555 is stuck with a sub par DVD and Blu-ray releases.\n\n\n\nThen there is the issue of movies staying in circulation. If this version of Interstella 5555 is the only one available on streaming or a new Blu-ray release then what will “casuals” who have never watched this movie think. Will they think that the movie shouldn't look like that or will they think that the movie is supposed to look like a Vaseline smeared mess?\n\n\n\nAI is a very helpful technology for movie restoration but it has become very obvious to me that studios are not using this technology properly and are getting extremely lazy with it. I will put it to you this way, you use a hammer to strike nails and you use a wrench to screw bolts. You can use a wrench to strike nails and you can use a hammer to screw bolts but the tools will do those tasks horribly if used in this manner. Use the right tool for the job and everything will be fine. After that night, I realized that these studios aren't doing that for whatever reason and that it is up to us to keep the art that we love alive.\n\n",
        "upvotes": 59,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1hef2tj/with_ai_restorations_on_the_rise_in_recent_years/"
    },
    {
        "id": "1hefer3",
        "author": "FakeJim3",
        "title": "Manchurian Candidate (2004) why do characters call Marco (Denzel Washington) \"captain\" and \"major\" interchangeably?",
        "content": "\nJust watched this film for the first time and kept being snapped out  of the tension wondering if I, myself, was having a psychological episode because the main character's rank kept changing!? Individual characters changed what they called him too. Sometimes \"major\" and other times \"captain\". I couldn't find an explanation online so maybe I missed something obvious!? Any ideas???",
        "upvotes": 51,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1hefer3/manchurian_candidate_2004_why_do_characters_call/"
    },
    {
        "id": "1he5l87",
        "author": "ope_poe",
        "title": "Werner Herzog muses on mysteries of the brain in Theater of Thought",
        "content": "",
        "upvotes": 170,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7QimqoVPQiCtQn-8QwrW02dabfRTzb66M6nR9uelsN8.jpg?auto=webp&amp;s=7d98b9cf2817fa25cb65374cf7aa02adf3e044e0"
        },
        "permalink": "/r/movies/comments/1he5l87/werner_herzog_muses_on_mysteries_of_the_brain_in/"
    },
    {
        "id": "1he6vq6",
        "author": "gyman122",
        "title": "Watched Manchester By The Sea with my friend and bawled my little eyes out on four separate occasions",
        "content": "Fuck! Wow, what a movie. \n\nKind of an interesting movie just to watch with your bro but holy shit. If you don’t at least get choked up at this movie, what is wrong with you.\n\nTo some degree it’s almost gratuitously sad, like manipulatively sad. It hits you from every potential angle, poking and prodding until it finds the thing that hits you hardest and then it just hammers it over and over and over. Every moment of levity (of which there are many, it’s actually a pretty funny movie!) serving only to crush you even harder later on.\n\nAnd the ending, so bittersweet. Nobody gets “fixed”, Lee doesn’t stop drinking, it’s just the most minor of victories wherein these two troubled people resolve to spend more time together. But still so sweet, so nice, such a small but warm light at the end of the tunnel.\n\nReally, really, really good",
        "upvotes": 129,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1he6vq6/watched_manchester_by_the_sea_with_my_friend_and/"
    },
    {
        "id": "1hed8kz",
        "author": "Puzzled-Tap8042",
        "title": "Criterion's March 2025 Releases Include Arthur Penn's 'Night Moves,' 'Godzilla Vs. Biollante,' Alan Randolph's 'Choose Me' &amp; An Early Charlie Chaplin Masterwork",
        "content": "",
        "upvotes": 45,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FsOlUqz1wbM04aHxRmEpFdgvV5SV4rQDOHBECt7thtw.jpg?auto=webp&amp;s=69456adbe7f0d6ea160da8c81e3fa173678e4342"
        },
        "permalink": "/r/movies/comments/1hed8kz/criterions_march_2025_releases_include_arthur/"
    },
    {
        "id": "1hdscgf",
        "author": "RaggedWrapping",
        "title": "SICKO | M.Moore Documentary free on youtube",
        "content": "",
        "upvotes": 1527,
        "comments": 108,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cyVXqqTXmpPdY7AK67fHvn66q2EkIme7fsR6cu_9yvA.jpg?auto=webp&amp;s=f3b4362cd6c71953d22976bc409cfbab3dbaaef3"
        },
        "permalink": "/r/movies/comments/1hdscgf/sicko_mmoore_documentary_free_on_youtube/"
    },
    {
        "id": "1hequ81",
        "author": "OkBuy1504",
        "title": "Carry-on style films and tv shows",
        "content": "I recently watched the new Taron Egerton film Carry-on and the whole main guy with an Earpiece being blackmailed by a mysterious bad guy reminded me allot of the 2002 film phone booth. I then thought and reminded that its scarily similar to the first half of 24 season 1. Is there any more films or tv shows that follow that same kind of concept?",
        "upvotes": 5,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1hequ81/carryon_style_films_and_tv_shows/"
    },
    {
        "id": "1heqkwz",
        "author": "Marty_187",
        "title": "Recommendations: occult thrillers/horrors",
        "content": "Inspired by a post I read this morning about The Ninth Gate I was wondering if people can recommend more movies similar like thus. \n\nI've already seen quite a lot of them in the past and they might be worth a rewatch but maybe I missed some.\nI've seen some of the classics like:\nThe omen\nThe prophecy \nStigmata\nThe devil's advocate \n\nAnd probably a couple I can't remember from the top of my head.\n\nI'd welcome any recommendations you have.\n\nCheers,\n\nMarty ",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1heqkwz/recommendations_occult_thrillershorrors/"
    }
]