[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 496,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ihevjl",
        "author": "Whobitmyname",
        "title": "‘PARASITE’ is now streaming on Netflix, ahead of the 5th anniversary of the film winning Best Picture at the Oscars.",
        "content": "",
        "upvotes": 196,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ihevjl/parasite_is_now_streaming_on_netflix_ahead_of_the/"
    },
    {
        "id": "1ih14np",
        "author": "HarperLovey",
        "title": "Any one else canceling due to price increases?",
        "content": "Had to cancel this month as rate went up to just shy of $30/mo (with taxes added in)!  I remember paying something like $12.99/mo.  Even that was a stretch back then. I've always enjoyed Netflix programming, but just can't justify the price anymore. $300/year is just not realistic. ",
        "upvotes": 176,
        "comments": 143,
        "media": null,
        "permalink": "/r/netflix/comments/1ih14np/any_one_else_canceling_due_to_price_increases/"
    },
    {
        "id": "1ihl6uu",
        "author": "_mooi",
        "title": "Subtitle customisation on tv",
        "content": "I'm using Netflix on my Samsung TV \nIm trying to make the window behind subtitles be more transparent / make the subtitle border more visible but the video player only allows 4 preset window options for subtitles background \n\n \nIs there any hidden menu where I can customise it more than the video player allows me to ? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ihl6uu/subtitle_customisation_on_tv/"
    },
    {
        "id": "1ihloax",
        "author": "fleshymemes",
        "title": "Blackscreen and autoplay?",
        "content": "I've got a problem with netflix on google chrome. Every time a new episode starts with autoplay, I got a black screen with normal sound. The video only turns on, when i pause the video or when I click with my mouse. I already tried restarting, deleting browser data and reloading. Does anyone else have this problem or is it just me? Has anyone an idea how to get rid of this? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ihloax/blackscreen_and_autoplay/"
    },
    {
        "id": "1igr62h",
        "author": "DemiFiendRSA",
        "title": "Cobra Kai: Season 6 Part 3 | Final Trailer | Netflix",
        "content": "",
        "upvotes": 73,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1igr62h/cobra_kai_season_6_part_3_final_trailer_netflix/"
    },
    {
        "id": "1ih4yl9",
        "author": "Wonderful_Act3430",
        "title": "This is ridiculous",
        "content": "Me and my mom are away from home. She’s at a work thing and I’m watching Netflix out of nowhere in the middle of my show. It tells me that the TV is a part of the Netflix household is now telling me to pay more or make a new account and pay. What is this bull ",
        "upvotes": 10,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ih4yl9/this_is_ridiculous/"
    },
    {
        "id": "1ihgxjm",
        "author": "Sad-Year-4815",
        "title": "Is anyone facing the same problem?",
        "content": "I’m trying to watch shows but after a few minutes it just gets stuck and only the voice comes thru. I’ve tried deleting and redownloading - nothing. I’ve tried a different show - nothing. I was watching suits.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ihgxjm/is_anyone_facing_the_same_problem/"
    },
    {
        "id": "1ih07ip",
        "author": "lazybearcreations",
        "title": "Anyone else feeling that the new UI is terrible?",
        "content": "I was using Netflix on the TV with the options positioned on the left side of the screen, showing categories and everything I needed to find what I want to watch.\nNow I open the app in the last few days and the options have moved to the top of the screen and the categories are gone.\nSearch is there but just not really that helpful if you want to discover new things.\nScrolling endlessly through nearly full screen sections is quite frustrating when none of them are really what I am looking for.\nI am feeling like it is a mis-step but I am open to hear if I am just not seeing the benefits here…",
        "upvotes": 15,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ih07ip/anyone_else_feeling_that_the_new_ui_is_terrible/"
    },
    {
        "id": "1ihbq0y",
        "author": "forevony_0904",
        "title": "Recommendations",
        "content": "\n\n\n\nCan anyone recommend series for me that depict mental health. I have seen shows like \nAnd autism representation \n\n\nSpinning out,\nGinny and Georgia,.\nSkins,\nNever have I ever,\nHeartbreak high\nAtypical \n\n\nEtc. .  Anyone see series like that that I can watch about mental health representation....any recommendations would be greatly appreciated ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ihbq0y/recommendations/"
    },
    {
        "id": "1ihhqu4",
        "author": "Slight_Medicine_463",
        "title": "In what order is Breaking Bad, Better call Saul and El Camino.",
        "content": "I watched Breaking Bad over 2 years ago and previously started Better call Saul to then see the likes of Tuco, Hector and the twins… but if you’ve seen breaking bad you’d see why I’m a bit confused now.\n\nSo what order was all of this suppose to be watched in if there is a correct order? ",
        "upvotes": 0,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1ihhqu4/in_what_order_is_breaking_bad_better_call_saul/"
    },
    {
        "id": "1ihhhxa",
        "author": "Square-Chapter-7889",
        "title": "Problems with Netflix residence/account",
        "content": "Ok, I'm gonna try to explain, but English isn't my first language.\nWe all know that traditional families aren't the only families.\nIn my family there is more than 2 residences, my dad's house in the big city, my mom's house in the big city, my dad's country house, my dad's wife's house in the small city close to the country house. Yeah, my dad is back and forth between those 3 places all the time because of business.\n\nMy dad pays one account(4k), my mom pays another account(1080p).\nMe and my brother use my dad's account at his house, at our mom's house and at the country house.\nMy dad use his account at his house, the country house and his wife house.\nHis wife and my half sister uses his account at my dad's house, at her house, and at the country house.\nMy mom only uses her account at her house.\n\nI use my dad's account for much more time, so when I'm at my mom's house, I still use my his account, but with all those changes, it's getting more and more difficult and it's pissing me off.\nEven him has some trouble using his account in all 3 places.\n\nI want to keep using my profile even when I'm at my mom's house, and it's already a pain to keep changing accounts everytime.\n\nAnyone got a solution? Netflix shouldn't assume that everyone has a traditional family with only 1 or 2 residences. And they even keep raising he prices!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ihhhxa/problems_with_netflix_residenceaccount/"
    },
    {
        "id": "1ihi1y8",
        "author": "KexyglamrocksBIG50",
        "title": "Should i or should'int i??",
        "content": " Im a big watcher of utube  channels i started watching about 8 monthes ago the abanded  pets in the angkor parc, i came across  recently  a channel  that has netflix  in thier name , these horrible channels do a lot to get views  im guessing  that they put netflix in thier name thinking they would get mors views becouse the viewers would think it had somethink to do with netflix so a good channel, but this channel does horrible things like chase down a mom with her 3 week old knowing that this mother doesn't  like her babies to cling to her belly so they have to walk next to her only the baby can not keep up that fast so when that happens the mom très to teach her babies (she has just one now) called lilly she tries to teach lilly that she has to keep up and not near the ppl but this for this particular  mother seems to use brutal, the mother drags the baby pulls on her fur all the long xhile the baby is screaming(well im guessing  its monkey screams)  thats just one of the things this channel does thier is a lot more, MY QUESTION  is should i try and get intouch  with netflix and tell them about tjis channel ?   Im guessing  they copy wrote thier name  that means no one can use that name?  And if the answer is yes how do i find an email that someone will read?   I thankyou for your reply and pls forgive me if my wording is not right  i dont write in english a lot.🙋‍♀️",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ihi1y8/should_i_or_shouldint_i/"
    },
    {
        "id": "1ihlndr",
        "author": "PinkyKitty930",
        "title": "Netflix has been scamming me for months",
        "content": "I'm absolutely furious at the moment. I had a Netflix account for my grandmother, and as she was moved into a care facility and no longer needed it, I cancelled it. Turns out, on the app at least, it'll just... resume your membership like you didn't cancel it. So I've been charged for months of Netflix that I wasn't even aware of. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ihlndr/netflix_has_been_scamming_me_for_months/"
    },
    {
        "id": "1ihhw43",
        "author": "Alone_Mess_4544",
        "title": "The funniest Hack ever",
        "content": "Hi all 👋!\n\nHere with the funniest hack that ever happened to me! \n\nLast night I was watching Netflix in my Apple TV and suddenly I started receiving confirmation emails that my password, phone number, email address was successfully changed and it wasn’t me 🥶\n\nMost important and hilarious moment is the notification that the account was upgraded from standard to premium 😁\n\nI quickly tried to take action as I have this account for years and I don’t want to lose it. \n\nWell of course I rang Netflix directly and explained my situation! They asked for my email and then they prompted me through an automated system where I had to prove my Visa card number that was used for the payments and I did so. \n\nI’ve changed password and email address of course and ended up recovering my account and got a free upgrade from the hacker 🥴🙂‍↔️\n\nWhat I’m still confused about is “why would someone hack a Netflix account “ ? To what ? \n\nI’m presuming I’ve logged in using someone’s computer and they just tried to cause problems but instant karma worked well 😄🥳",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ihhw43/the_funniest_hack_ever/"
    },
    {
        "id": "1igpkrg",
        "author": "pontiuspilate01",
        "title": "The Night Agent – Great Writing, Wooden Acting?",
        "content": "I’m currently on Season 1, Episode 7, and I’m still trying to understand the hype. The writing is slightly engaging—it knows how to keep you hooked with well-paced cliffhangers. But the acting? Yikes. It feels wooden, overly staged, and completely devoid of nuance, like a table read that somehow made it to the final cut. Some scenes are so stiff it’s almost impressive.\n\nI’m pushing through because I want to see if there’s a real payoff, but so far, it feels like a show that succeeds despite its cast rather than because of it. \n\nDoes it get better, or is this just what I signed up for?",
        "upvotes": 13,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1igpkrg/the_night_agent_great_writing_wooden_acting/"
    },
    {
        "id": "1ih3otz",
        "author": "Daxel79",
        "title": "Need some new movie recommendations please?",
        "content": "We like thrillers, psychological thrillers, comedies,raunchy comedies, or just flat out weird movies please. We don’t watch kids or SciFi movies. Thanks in advance for any recommendations!!!😁😁😁",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ih3otz/need_some_new_movie_recommendations_please/"
    },
    {
        "id": "1ihc1gf",
        "author": "psuitable_pseudonym",
        "title": "New category \"Swipe Left\"",
        "content": "So swiping left on dating apps means not interested and funny enough it's shit I had/have zero interest in watching or things I watched but didn't thumbs up or double thumb.\n\nWhy would they...  what were they thinking?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ihc1gf/new_category_swipe_left/"
    },
    {
        "id": "1ih7n1d",
        "author": "Biolore",
        "title": "Recommendations from wrong profile",
        "content": "Today when I opened Netflix the recommendations were loaded with kdramas, which I don't watch amany of but my wife does. There was even a \"Because you watched Litte Women\", which I confirmed is not in my viewing history. Nor are there any kdramas in my viewing history in the past year.\n\nWhat gives?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ih7n1d/recommendations_from_wrong_profile/"
    },
    {
        "id": "1ih6kk7",
        "author": "jeanettiotato",
        "title": "Please help me find this song",
        "content": "The movie is Dog Gone Trouble. The scene is right in the beginning, the first song that plays during the montage where Trouble greets his owner/companion every morning. I literally typed in the lyrics word for word on Google from the subtitles on this movie and it’s like it doesn’t exist???! I liked the song and it got stuck in my head every time my kids watched it and now it’s just bothering me at this point. Pleeeeease someone help! \n\nLyrics if this helps:\n\nI’ve got a pep in my step\nFrom the way that you hold me\nIf this is love, well nobody told me\nIt was so\nMm, mm, mm, so\n\nAnd it’s all about us\nWe do whatever we want\nSo good, we’re finally finding the love\n\nI wanted to walk by your side, walk by your side\nWalk with me, cause it’s all about is\nI wanted to walk by your side, walk by your side\nWalk with me, cause it’s all about us\n\nIt’s all about us, whoo-ooh,\nIt’s all about us \n\nEtc. \n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ih6kk7/please_help_me_find_this_song/"
    },
    {
        "id": "1ihadzp",
        "author": "IcyOutside4567",
        "title": "I’m an added member but won’t let me watch",
        "content": "I use my sisters Netflix and I’m at a different address/wifi so I pay $9 a month on her account to be able to use it at my house. When I went to watch Netflix tonight it says my device isn’t part of the Netflix household. I double checked the account and I’m still the recipient of the extra member spot. How can I fix this? \n\nThere’s nothing to click on the screen other than to login to another account or to update the household",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ihadzp/im_an_added_member_but_wont_let_me_watch/"
    },
    {
        "id": "1ifxqvy",
        "author": "dailystar_news",
        "title": "Squid Game star Lee Joo Sil dies in hospital after cancer battle as tributes paid to actress",
        "content": "https://www.dailystar.co.uk/showbiz/breaking-squid-game-star-dies-34599173",
        "upvotes": 560,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ifxqvy/squid_game_star_lee_joo_sil_dies_in_hospital/"
    },
    {
        "id": "1igvq72",
        "author": "J-20-7000",
        "title": "Where is the Chinese audio option?",
        "content": "I'm learning Chinese and it would help greatly to watch my favourite shows in Chinese audio. But for some reason this language isn't on Netflix for what I've found. Why is this and am I wrong that it's not on the site? I know that I can change the interface but that doesn't change the audio.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1igvq72/where_is_the_chinese_audio_option/"
    },
    {
        "id": "1ihdc7a",
        "author": "Moon_Frost",
        "title": "Still no way to easily restart a series?",
        "content": "It's been years... Is the only way really for me to go on my computer and log in and browse through settings to try to do it that way? I'm just trying to re-watch all of Love, Death, Robots on my tv. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ihdc7a/still_no_way_to_easily_restart_a_series/"
    },
    {
        "id": "1igl9aw",
        "author": "Royal-Emu5226",
        "title": "Logged Out Due to Diff IP Address. Any Similar Issues Here?",
        "content": "Our Netflix account was locked out due while attempting to update the Netflix Household. The account was accessed from a different IP address and we couldn’t proceed to making the update despite going through multiple SMS approvals (see attached screenshots). Note that despite many approvals via SMS, we were not able to make any changes to the said account. We also indicated that we’re “traveling” \n\nHas anyone had any similar experiences? May I ask how you resolved the issue? Thanks",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1igl9aw/logged_out_due_to_diff_ip_address_any_similar/"
    },
    {
        "id": "1ih1ksi",
        "author": "no_more_muffins",
        "title": "Any way to force the new UI for Netflix?",
        "content": "Hello,\n\n  \nI am watching Netflix with an Android TV box and I would like to use the new UI. Is there any way to force this update? I have not opted out from the beta program so I was expecting the get the new UI eventually but it seems not to happen.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ih1ksi/any_way_to_force_the_new_ui_for_netflix/"
    },
    {
        "id": "1ih7mx4",
        "author": "Countrygalsy",
        "title": "WWE on Netflix - anyone else notice the glitches on the interviews in-between the matches?",
        "content": "During CM punk interview with one of the side girls the screen kept flickering. Don't know if that was Netflix. And it just did it during the women's fight too. Seems like they r having trouble tonight might be the cuz they are in Cleveland yet could be anything. ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ih7mx4/wwe_on_netflix_anyone_else_notice_the_glitches_on/"
    },
    {
        "id": "1igzc0d",
        "author": "Celebril63",
        "title": "Netflix only got the first season of Find Me In Paris?  How did that even happen?",
        "content": "My wife found the first season adorable.  However, Netflix only got the first season.  If I had to describe it in 25 words or less, it be \"What if Glee and Dr. Who has a love child?\"\n\nWhat I'd really like to know is how they even managed to get season 1?  The show is actually a Disney+ / Hulu production.  This just doesn't make any sense.  ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1igzc0d/netflix_only_got_the_first_season_of_find_me_in/"
    },
    {
        "id": "1ihbd4y",
        "author": "Electronic-Host-6306",
        "title": "Cobra Kai part 3 reaction and review . Please check it out 🙏🙏",
        "content": "If u like it please subscribe !!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ihbd4y/cobra_kai_part_3_reaction_and_review_please_check/"
    },
    {
        "id": "1igz829",
        "author": "Diligent_Lemon21",
        "title": "Just me or are the subtitles for Perfect Match not making sense?",
        "content": "Honestly despite watching until episode 19 now, I feel like I’m missing something. It’s confusing sometimes, the subtitles feels off and doesn’t make sense. Overall, I get the plot but… I don’t know is it just me or anyone else struggling to understand the drama because of the subtitles on Netflix?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1igz829/just_me_or_are_the_subtitles_for_perfect_match/"
    },
    {
        "id": "1igx95r",
        "author": "Any-Razzmatazz-8285",
        "title": "Why did these roomates in “Worst Roomate Ever” stay so long?!",
        "content": "I’m watching “Worst Roomate Ever” on Netflix, episode “Roomate Wanted Part 2”. And I can’t help but think HOW do these people put up with these crazy roomates for so long. The one episode *spoiler* said the FIRST night mans moved in he slept with his dead dog? Why didn’t that lady kick that psycho out that day or move out that day?! She proceeded to let him stay and he proceeded to *spoiler* unalive her dogs. I would never in a million years let someone sleep with their dead animal in a house I was also sleeping in WTF?! Then the episode I’m watching now, this lady is throwing a party to make her roommate “uncomfortable” in hopes he will leave… girl if you don’t call yo homeboys or cousins to come drag this mans out… she extra asl having people loud partying and blowing cigarette smoke under his door.. like poor me please leave. Hell no girl that’s YOUR house and ur just sitting around hoping he gone leave? I’d drag a mf out physically and yes I know some of the roomates are murderers that’s why I said bring yo peoples to help you. It’s just crazy what these people allow and put up with.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1igx95r/why_did_these_roomates_in_worst_roomate_ever_stay/"
    }
]