[
    {
        "id": "1jyd3j3",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Gareth Evans - Tuesday 4/15 at 12:00 PM ET - Director of 'The Raid', 'The Raid 2', 'Apostle', and Netflix's upcoming action-thriller 'Havoc' starring Tom Hardy.",
        "content": "",
        "upvotes": 112,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gbdcf93x0nue1.png?auto=webp&amp;s=f2c64435a1934408122faa931430b78f54f78737"
        },
        "permalink": "/r/movies/comments/1jyd3j3/amaqa_announcement_gareth_evans_tuesday_415_at/"
    },
    {
        "id": "1jxy5se",
        "author": "BunyipPouch",
        "title": "Official Discussion Megathread (Warfare, Drop, The Amateur, Freaky Tales) + 25th Anniversary Discussions (Ready to Rumble, Return To Me, Rules of Engagement)",
        "content": "**New Theatrical Releases**\n\n[Warfare ](https://www.reddit.com/r/movies/comments/1jwev1e/official_discussion_warfare_spoilers/)\n\n[Drop](https://www.reddit.com/r/movies/comments/1jwevax/official_discussion_drop_spoilers/)\n\n[The Amateur](https://www.reddit.com/r/movies/comments/1jwev63/official_discussion_the_amateur_spoilers/)\n\n[Freaky Tales](https://www.reddit.com/r/movies/comments/1jwevev/official_discussion_freaky_tales_spoilers/)\n\n**25th Anniversary Throwback Discussion Threads**\n\n[Ready to Rumble](https://www.reddit.com/r/movies/comments/1jwewks/official_throwback_discussion_ready_to_rumble/)\n\n[Return to Me](https://www.reddit.com/r/movies/comments/1jwewhk/official_throwback_discussion_return_to_me/)\n\n[Rules of Engagement](https://www.reddit.com/r/movies/comments/1jwewf2/official_throwback_discussion_rules_of_engagement/)",
        "upvotes": 24,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1jxy5se/official_discussion_megathread_warfare_drop_the/"
    },
    {
        "id": "1jyp8dp",
        "author": "leafs81215",
        "title": "Actors who were going to be the next big thing and then…just weren’t?",
        "content": "I consider Clive Owen to be in this category. Nothing wrong with him, he’s a very good actor. But in the 2000s this dude was everywhere. Oscar nominated for ‘Closer’, Children of Men was tremendous, I mean he was heavily favoured to be James Bond before Daniel Craig showed up. And then, he just faded. He still works and acts quite regularly but he never got even close to those heights again. What are some other actors that just fell off of the top tier but there’s no real reason why. ",
        "upvotes": 968,
        "comments": 1608,
        "media": null,
        "permalink": "/r/movies/comments/1jyp8dp/actors_who_were_going_to_be_the_next_big_thing/"
    },
    {
        "id": "1jy6hgd",
        "author": "MarvelsGrantMan136",
        "title": "Official 30th Anniversary Posters for ‘A Goofy Movie’",
        "content": "",
        "upvotes": 6060,
        "comments": 242,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/47hintygilue1.jpeg?auto=webp&amp;s=e3abd42c1ac1f303e33f7f86716965d08aaae10d"
        },
        "permalink": "/r/movies/comments/1jy6hgd/official_30th_anniversary_posters_for_a_goofy/"
    },
    {
        "id": "1jyt5nj",
        "author": "OutrageousFootball10",
        "title": "Hollywood Is Cranking Out Original Movies. Audiences Aren’t Showing Up.",
        "content": "LOS ANGELES—When director Christopher Landon introduced his new thriller, “Drop,” before its premiere at the Chinese Theater on Hollywood’s Walk of Fame, he had a warning for the packed auditorium.\n\n“It’s really hard out there for an original movie,” he said, urging everyone who liked the Universal Pictures release to “scream it from the rooftops” and on social media.\n\n“Drop” opened this weekend to an estimated $7.5 million domestically, one of two new movies based on fresh ideas that fizzled at the box office. The other was Disney’s “The Amateur,” a spy thriller adapted from a little-known 1981 book, which opened to an estimated $15 million.\n\nAfter years of gripes from average moviegoers and Hollywood insiders alike about the seemingly nonstop barrage of sequels, spin-offs, and adaptations of comic books and toys, the film industry placed more bets on original ideas.\n\nThe results have been ugly. \n\nNearly every movie released by a major studio in the past year based on an original script or a little-known book has been a box-office disappointment. Before this weekend’s flops were Warner Bros. Discovery’s“Mickey 17” and “The Alto Knights,” Paramount’s “Novocaine,” Apple’s “Fly Me to the Moon,” Amazon’s “Red One,” and the independently financed “Horizon: An American Saga Chapter 1” and “Megalopolis.”\n\nJason Blum, who produced “Drop” and built his company Blumhouse largely on original horror franchises, said audiences’ preference for known properties has made it harder to release original movies in theaters, “even though that’s where some of the most exciting and risky storytelling still lives.”\n\nGetting people into theaters more frequently is a priority for a movie industry still recovering from the pandemic. Box-office revenue in the first three months of this year in the U.S. and Canada was the lowest it has been, excluding the pandemic, since 1996.\n\nAt the CinemaCon industry convention in early April, theater owners said they welcome more original films, but only if they are backed by robust advertising campaigns. Building buzz for a new film in a media environment fractured between YouTube, TikTok, streaming and sports is tough, particularly when it is an unknown title.\n\n“We’re opening films that have almost zero awareness,” said Bill Barstow, president of Main Street Theatres, a small Nebraska-based chain.\n\nMany consumers are content to wait until an original motion picture is available to rent online a few weeks after its theatrical release or to stream on a service like Netflix in a few months.\n\nThe only films succeeding in the current environment are those with built-in audiences, like “A Minecraft Movie,” which was released in early April and has grossed more than $280 million domestically. And these days, even franchises can be far from a sure thing. Long-running series such as Marvel and DC superheroes and live-action remakes of Disney animated classics are showing their age and proving unreliable at the box office.\n\nStudios say they have little choice but to make more original movies they hope will buck the odds.\n\n“Telling original stories and taking risks is the only path toward creating new global franchises,” Bill Damaschke, Warner Bros.’ head of animation, said at CinemaCon.\n\nSome of the increase in original film releases is attributable to Amazon and Apple, which are building film businesses with few well-established franchises. One of the biggest bets on an original film from any company this year is Apple’s “F1,” a June release starring Brad Pitt as a race-car driver.\n\nAmazon hyped 11 coming movies to exhibitors at CinemaCon, of which six were originals. Among traditional studios, Warner Bros. is taking the most risks on originals, with big budget films from directors Paul Thomas Anderson and Maggie Gyllenhaal. \n\nHollywood’s next original release comes Friday with Warner’s “Sinners,” a horror movie starring Michael B. Jordan. Next month even Marvel, home to Hollywood’s biggest franchises, is taking a gamble with “Thunderbolts,” about a super team brand new to all but the most devoted comic-book readers.",
        "upvotes": 162,
        "comments": 141,
        "media": null,
        "permalink": "/r/movies/comments/1jyt5nj/hollywood_is_cranking_out_original_movies/"
    },
    {
        "id": "1jyl762",
        "author": "Amaruq93",
        "title": "Supporters rally to save the Cinerama Dome as future of the historic Hollywood theater complex remains uncertain",
        "content": "",
        "upvotes": 442,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NftrP3ITjUMPxxhnQjaMu-Xtt8VMI1FP3PJ_zjYWSWg.jpg?auto=webp&amp;s=9c488e05a4cb9923e6d5e5082bdf14609b54dfdc"
        },
        "permalink": "/r/movies/comments/1jyl762/supporters_rally_to_save_the_cinerama_dome_as/"
    },
    {
        "id": "1jyd9gh",
        "author": "Amaruq93",
        "title": "English actress Jean Marsh (Willow, Return to Oz) has died at age 90",
        "content": "",
        "upvotes": 1138,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UUstyg-i0BZEq8RFGAP4D5DsMv-Xh_dIW0htI89QYu4.jpg?auto=webp&amp;s=4e107cd879320c54f496b1a9643b9255132bd5ee"
        },
        "permalink": "/r/movies/comments/1jyd9gh/english_actress_jean_marsh_willow_return_to_oz/"
    },
    {
        "id": "1jygd8k",
        "author": "Freddy-Philmore",
        "title": "Starship Troopers first time viewing",
        "content": "I got to see this last night in a gorgeous single screen palace theater in Los Angeles. Dang... I went in thinking how this had a bad rep but was totally blown away... thought it was an incredibly smart, wild, blood-soaked satire of authoritarianism and fascism... like it was pretty obvious but still clever. Didn't realize the entire history of the film and how critics and audiences 30 years ago thought it was promoting fascism not satirizing it.",
        "upvotes": 567,
        "comments": 296,
        "media": null,
        "permalink": "/r/movies/comments/1jygd8k/starship_troopers_first_time_viewing/"
    },
    {
        "id": "1jye7es",
        "author": "BertyBert1",
        "title": "Saddest Imaginary Friend Death in Movies?",
        "content": "Personally I think it’s Wilson the Volleyball from ‘Cast Away’, while my wife thinks it’s Bing Bong from ‘Inside Out.’  Are there any other imaginary friend/character deaths we are missing?  Imaginary friend/character should not be a human or living creature, so please no animal deaths.  Animated humans and animals also do not count.  Thank you!",
        "upvotes": 667,
        "comments": 280,
        "media": null,
        "permalink": "/r/movies/comments/1jye7es/saddest_imaginary_friend_death_in_movies/"
    },
    {
        "id": "1jyg7q6",
        "author": "MrGittz",
        "title": "An appreciation for the dying art of practical Blood Squibs. There’s just something different about them. It’s one of the last things I feel CGi hasn’t been able to replicate 100% correct. What are some of the greatest blood squib effects in film?",
        "content": "I love blood squibs. For anyone who doesn’t know, these are practical blood packs put on an actor or stunt person to simulate bullet hits. Are they realistic? No. But there is something visceral and cool about them. And they are becoming a lost art. \n\nYou can see why CGI blood hits have taken over. Blood squibs take ALOT OF TIME. There’s the rigging, the safety, the clean up. There’s none of that with digital. Add it in post and you are good to go. There’s way more control with digital. Far more safety.  \n\nImagine blowing a take during the final big shootout of Django Unchained? Those were legit blood squibs. And the room’s walls are painted red. The clean up to start again? Hours. That’s a lot of $. \n\nBut for some reason, unless there’s an example I don’t know about, I haven’t seen CGI replicate what a blood squib does. With CGI you get the red mist, but I don’t see the chunks or clothing. There’s a look to squib hits. And I’m sure cgi maybe could get it exact if they really tried, but I don’t think it’s treated as seriously or something important enough to spend precious R&amp;D time on. \n\nBut I also think squibs affect the actors performance. Think of Al Pacino in Scarface. You feel those bullet hits and his body reacts to them. There’s a physical reaction the actors have. When you watch John Wick and John is blasting these guys left, right and centre, you don’t see the actors reacting to them too much. And look I love those movies. But the bullet hits don’t have much of an impact. It’s not visceral. \n\n\n Of course digital makes it easier to remove for ratings. Look at Die Hard 4. Released as PG13 and got an unrated cut for dvd. They added the blood in digitally and it looks awful.  Same many of the “unrated” cuts of movies that originally had PG13 ratings. Awful blood hits. It’s like they all use the same digital file to render the blood. \n\n So you can see why it’s dying. For a filmmaker to use legit blood squibs in today’s filmmaking world? I feel that needs to be celebrated. Because everything is going against you. Time, money, and yes safety. To set off a blood pack is requires a small explosive charge. They can hurt.\n\nWhen I watch John Wick 1-4, or the Deadpool movies, I’m hoping for some legit blood squib action. \n\nSo. In celebration of practical blood squibs, What are your favourite blood hits in cinema? I already mentioned Django Unchained. What else? \n\nBad Boys 2 has some great squib work. In the opening scene especially. \n\nPredator 1 &amp; 2? Jesse Ventura’s death is *chefs kiss*. Total Recall has some beauties. \n\nOf course one of the GOAT’s and one of the first major uses of a squib was in Godfather. The when Michael avenges his father’s death. Man. The hang time of that blood in the air is beautiful. In fact Godfather has a few great blood sequences. Sonny’s death is amazing. His body must have been riddled with squibs(I think they even get his face)",
        "upvotes": 399,
        "comments": 143,
        "media": null,
        "permalink": "/r/movies/comments/1jyg7q6/an_appreciation_for_the_dying_art_of_practical/"
    },
    {
        "id": "1jymlg4",
        "author": "Starvel-Avarice",
        "title": "The scene with Ryan telling the story about him and his brothers in Saving Private Ryan is arguably the best and saddest part of the movie imo",
        "content": "I watched it for the first time yesterday and this scene made me cry, aside from the 3 other times it did. The way he tells it, laughing through it, Damon's performance in that bit was incredible. The way it feels so real, just so heartbreaking. They only exist as a memory, and for Private Ryan to immediately recall something like that through the grief is really touching",
        "upvotes": 98,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1jymlg4/the_scene_with_ryan_telling_the_story_about_him/"
    },
    {
        "id": "1jy0aoc",
        "author": "P3ptide",
        "title": "The HBO movie \"2073\" used the sound clip known as \"Loud Nigra\" online as a fill in for a protester getting beat up, lol",
        "content": "",
        "upvotes": 2329,
        "comments": 148,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zg6k0s1jdjue1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1jy0aoc/the_hbo_movie_2073_used_the_sound_clip_known_as/"
    },
    {
        "id": "1jyf9o0",
        "author": "FilmWaffle-FilmForum",
        "title": "What is the creepiest original score of all time?",
        "content": "My pick is more of a recent one but Jonathan Glazer’s ‘Under the Skin’ has a score so creepy it gives me literal chills every time I listen to it. Mica Levi does not get enough appreciation for creating arguably one of the best original scores in modern cinema. \n\nWhat original score never fails to give you the creeps?",
        "upvotes": 171,
        "comments": 204,
        "media": null,
        "permalink": "/r/movies/comments/1jyf9o0/what_is_the_creepiest_original_score_of_all_time/"
    },
    {
        "id": "1jysvr9",
        "author": "Tyll00PP",
        "title": "Just rewatched Arrival… and wow!",
        "content": "I randomly decided to rewatch *Arrival* last night, and man, it hit even harder the second time around. The way it blends sci-fi with emotion, time, and language is seriously underrated. Denis Villeneuve really doesn’t miss.\n\nAmy Adams deserved way more awards recognition for this—her performance was incredible. Also, the soundtrack?? Pure goosebumps. \n\nWhat do you think?\n\n",
        "upvotes": 18,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1jysvr9/just_rewatched_arrival_and_wow/"
    },
    {
        "id": "1jyhcp4",
        "author": "harpo_7879",
        "title": "Butch Cassidy &amp; the Sundance Kid appreciation post",
        "content": "I'm watching this movie again and I just... wow.\n\nI. Love. This. Film.\n\nI grew up in a \"movie family,\" with my dad quoting both famous and obscure films left and right throughout my childhood. He quoted this one *a lot* (specifically, \"I didn't know you were the Sundance Kid when I said you were cheating\"). Those quotes often led to the realization that his delivery sometimes was considerably better than the reality of whatever movie he was quoting, LOL\n\nThis, this right here, is the #1 exception. \n\nWhen I finally sat down and watched it at 16 or 17 (early aughts), I remember being blown away. This is one of the only movies that has retained that wonder for me over 20+ years now - I turn 40 this year.\n\nI'm not saying there aren't absolutely valid criticisms. There are. But this post is just about appreciating a film where, IMHO, the actors and the script and the cinematography are all nearly perfect.\n\nAnd the LINES. Just... I could quote this film forever. Which is wild because the script is in itself pretty sparse.\n\n\"I CAN'T SWIM!\"\n\"Who ARE those guys?\"\n\"You just keep thinkin', Butch, that's what you're good at.\"\n\"Rules! In a knife fight?!\"\n\"I work for Mr. E.H. Harriman...\"\n\nI know I'm not the only one who HEARS THEIR VOICES reading those, right?\n\nAll right, I'm done. Back to the movie. 🥰",
        "upvotes": 108,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1jyhcp4/butch_cassidy_the_sundance_kid_appreciation_post/"
    },
    {
        "id": "1jyfbyn",
        "author": "Laurie_Barrynox",
        "title": "The NeverEnding Story (1984) makes me yearn for the old fantasy films which gave us epic, emotional scores and not too much unnecessary exposition. And no cliched final battle.",
        "content": "I just love The NeverEnding Story. I re-watched it last night and you know how there are movies you saw as a kid and you revisit them as adults and they end up sucking. \n\nNot The NeverEnding Story. I still get emotional in the right parts, I still have my heart pumping when the score by Klaus Doldinger comes up, I'm still in awe at the VFX and sets and the movie is so deep, it's got a genuine message which continues to be current to this day. Gmork's explanation, for one.\n\nThe performances are superb. Noah Hathaway is extraordinary, he carries most of the film, conveying his acting with great committment. Barrett Oliver is believable as a boy dealing with loss and bullying and fully wrapped in the book. Tami Stronach's Child Empress is a brief but memorable presence. Everybody does a good job. Sure, some parts are a bit off but even back then, I caught the scenes I found cringy and I still loved the film. \n\nWhy can't modern Fantasy movies be like this? I feel like too many today pull the same tired shtick from The Lord of the Rings.",
        "upvotes": 101,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1jyfbyn/the_neverending_story_1984_makes_me_yearn_for_the/"
    },
    {
        "id": "1jxv0bj",
        "author": "dresoccer4",
        "title": "About Time (2013) - he’s already rich!",
        "content": "Just started watching About Time and, early on, he asks his dad why he can’t use his power to get rich, and his dad said no! You must use your powers for your hobbies and work a normal job though or else you’re cursed or something. \n\nHe says this as he spends the entire summer sunbathing on the massive back lawn of his English chateau and playing tennis on private grass courts overlooking the sea. \n\nI thought it was a joke at first because they’re obviously extraordinarily rich, but he was actually complaining that he couldn’t use his power to get even more rich. Anyone else find this perplexing? \n\nUpdate: just wanted to give a big THANKS to everyone in this thread for contributinhgg to some really awesome (and sometimes properly deep) disucssions about how wealth (and lackthereof) can be warped while being portrayed on TV and in film. Very enlightening stuff 🥂 ",
        "upvotes": 3099,
        "comments": 297,
        "media": null,
        "permalink": "/r/movies/comments/1jxv0bj/about_time_2013_hes_already_rich/"
    },
    {
        "id": "1jyb411",
        "author": "Donbeakant",
        "title": "Recommend classic dark comedies like Fargo",
        "content": "I’ve seen Fargo about 2-3 times before but it had been a while so I watched it again because I couldn’t remember how it unravelled and ended. \n\nWhat I love about this movie is how Marge (Frances McDormand) and her husband never bring work home.\nDialogues are fantastic and acting is phenomenal. \n\nOne of my favourite scenes: \nCarl (Steve Buscemi) calls Jerry (William Macy), says there’s a problem. Jerry asks, “How’s Jean?” Carl pauses and goes, “Who’s Jean?”\nKilled me. \nHe didn’t even know the name of the woman he kidnapped.\n\nAll the ‘yeaaaah’’s always stuck. The accents also did play a huge part in making the movie so loveable. \nThey should do a serious sequel with Scotty (the son) and how he grows up all messed up. \n\nI love Steve Buscemi and William Macy together. (They’ve done a few more movies together but I haven’t watched any of them)\n\nI’d love to watch more classics like this. Please recommend.\n",
        "upvotes": 154,
        "comments": 188,
        "media": null,
        "permalink": "/r/movies/comments/1jyb411/recommend_classic_dark_comedies_like_fargo/"
    },
    {
        "id": "1jygo87",
        "author": "indiewire",
        "title": "Director Frank Oz Reflects on Chaotic 'What About Bob?' Shoot",
        "content": "",
        "upvotes": 56,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZS9woLSWjiERCCq4a5UV-2XGeGoubwby4RnjQRfcius.jpg?auto=webp&amp;s=f6e3382110816340bc28a5c047cd7f0b58e2acb0"
        },
        "permalink": "/r/movies/comments/1jygo87/director_frank_oz_reflects_on_chaotic_what_about/"
    },
    {
        "id": "1jyas0p",
        "author": "Phantom_Play",
        "title": "The Phantom of the Opera (1925) - 100th Anniversary",
        "content": "The Phantom of the Opera (1925) 100th Anniversary\n\nA movie that has a complicated history. Lost versions, found footage, remade with sound, the opening scene of a man holding a lantern etc.\n\nIt premiered September 6th 1925 in New York City. Lon Chaney’s most famous role and unfortunately last time playing the a monster for Universal. ",
        "upvotes": 116,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cCdiSIgxMlj3c0ChQKcUysaizhNN4jwgG0c8J-uxN50.jpg?auto=webp&amp;s=7746e1baf8dcafe83dcc76bbf6ebd1aac9215910"
        },
        "permalink": "/r/movies/comments/1jyas0p/the_phantom_of_the_opera_1925_100th_anniversary/"
    },
    {
        "id": "1jyluik",
        "author": "Odd_Advance_6438",
        "title": "Dementus’s gang in Furiosa is amazing. Love the weird names including the Octoboss, Rizzdale Pell, Smeg, etc",
        "content": "Loved that movie. All the Mad Max films have very memorable side characters, but that film was really them at their peak. I didn’t even mention Fang, Big Jilly, the History Man, Mr Norton, Mr Harley, and Mr Davidson\n\nThey don’t have a ton of screentime, but the actors said they were required by George Miller to come up with elaborate backstories for their characters. The stunt man of Rizzdale Pell said his backstory was too horrific to repeat, though he did mention that Pell wears a wig made of scalps from people he’s killed. David Collins said that Smeg is essentially Dementus’s hype man, and helps express what he’s thinking through weird movements",
        "upvotes": 28,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1jyluik/dementuss_gang_in_furiosa_is_amazing_love_the/"
    },
    {
        "id": "1jyl89i",
        "author": "gerryf19",
        "title": "What is the worst trailer for a good movie?",
        "content": "Was looking at HULU and they have Tombstone, a movie I can never resist watching.  They also had the trailer and it is AWFUL.  If I saw that trailer I would never guess what a great movie Tombstone is.  \n\nConversely, Wyatt Earp is made around the same time, and its trailer is pretty good, but the movie is pretty, \"meh\".\n\nWhat other trailers for good movies were so bad you might have skipped the movie?",
        "upvotes": 25,
        "comments": 68,
        "media": null,
        "permalink": "/r/movies/comments/1jyl89i/what_is_the_worst_trailer_for_a_good_movie/"
    },
    {
        "id": "1jxo2dr",
        "author": "indiewire",
        "title": "'A Minecraft Movie' Director Supports The Chaos That's Happening During Theater Screenings of His Film",
        "content": "",
        "upvotes": 5192,
        "comments": 824,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WP90HhamO-A8XhEeoA5EEpkCcxVDON0WntNyHCgUzDE.jpg?auto=webp&amp;s=2b60c1fd2e91f374abe7f93858e838512c0e6de8"
        },
        "permalink": "/r/movies/comments/1jxo2dr/a_minecraft_movie_director_supports_the_chaos/"
    },
    {
        "id": "1jxygpv",
        "author": "The_ZombyWoof",
        "title": "There are weird, 80s art house movies, and then there is The Lair of the White Worm (1988) - For those times when you absolutely need to see Peter Capaldi fight a vampire with bagpipes.",
        "content": "",
        "upvotes": 878,
        "comments": 93,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XXw0EzCd37wN-WxTql9Vz9d3eq8P4r1tw-ceIp9nv3c.jpg?auto=webp&amp;s=91a5b04fcca0b287abfa04eb54b625cc5646bc8e"
        },
        "permalink": "/r/movies/comments/1jxygpv/there_are_weird_80s_art_house_movies_and_then/"
    },
    {
        "id": "1jxy1d0",
        "author": "16car",
        "title": "Which movie? A soldier wakes up in hospital in 1946, with a paper cut?",
        "content": "Grandfather is trying to find a movie he loved, possibly as long ago as the 1960s. It involves an American soldier waking up in an English hospital in 1946. \n\nAs the movie goes on, the audience discovers that he's actually in a German hospital in 1945, and the war is still on. \n\nThe protagonist realises he's being lied to, and it's still 1945, when he notices he still has a paper cut he got before he lost consciousness.\n\nETA: I said \"36 hours\" out of the blue, and the old man's face lit up. We're hoping to find it, and watch it tonight. Thank you!",
        "upvotes": 883,
        "comments": 62,
        "media": null,
        "permalink": "/r/movies/comments/1jxy1d0/which_movie_a_soldier_wakes_up_in_hospital_in/"
    },
    {
        "id": "1jxjp5d",
        "author": "cmaia1503",
        "title": "New image of Aaron Taylor-Johnson &amp; Alfie Williams in Danny Boyle’s ‘28 Years Later’",
        "content": "",
        "upvotes": 6925,
        "comments": 395,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nx4t2bau8fue1.jpeg?auto=webp&amp;s=f0f5b0194bc9bf49078f6a401eb98d1c63547eb0"
        },
        "permalink": "/r/movies/comments/1jxjp5d/new_image_of_aaron_taylorjohnson_alfie_williams/"
    },
    {
        "id": "1jy9fkv",
        "author": "keepfighting90",
        "title": "The Lives of Others (2006) is incredible",
        "content": "The Lives of Others, or *Das Leben der Anderen*, is a German movie that came out to a lot of critical acclaim in 2006, and eventually won the Best International Film Oscar over Pan's Labyrinth. I finally got around to watching it, and ended up loving it. Highly recommended to anyone looking for an intelligent, mature historical drama with fantastic performances\n\nThe summary is as follows: In 1983 East Berlin, dedicated Stasi officer Gerd Wiesler begins spying on a famous playwright and his actress-lover Christa-Maria. Wiesler becomes unexpectedly sympathetic to the couple, and faces conflicting loyalties when his superior takes a liking to Christa-Maria.\n\nWhile the above makes the movie sound like a spy thriller, it really is more of a character study with social commentary. There are some thriller-esque elements to it, and the movie *can* be pretty tense at times - this isn't really the focus however, as it's more concerned with making a point about the impact of a political and socially repressive regime on its people, whether they're against it or are complicit in supporting it. \n\nThe performances are what really make this such a great experience. Ulrich Mühe as Wiesler is fantastic, especially considering how restrained and low-key the role is. He expresses so much with just his eyes and facial expressions alone. It almost feels like he created this entire person on screen without saying a single word about his personality, because pretty much all of his dialogue is strictly about the work he does. Sebastian Koch and Martina Gedeck are really good in their roles as well.\n\nThis is definitely a slow-burn narrative that grows in power and impact as it moves along. Honestly, for the first hour or so, I thought it was just \"good\" - well-acted and directed, but not really exceptional in any way. But halfway through, it hits another gear, the screws are tightened around the characters and it gradually transforms into a tense, anxiety-inducing story before eventually ending up as a bittersweet tragedy. \n\nI also have to applaud the ending, as it's one of the most cathartic and emotional conclusions to a movie I've seen in a while. The scene in the bookstore, with Wiesler going \"it's for me\" and the camera freezing on his face for a while - just beautifully done.\n\nAny other fans of this movie?",
        "upvotes": 82,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1jy9fkv/the_lives_of_others_2006_is_incredible/"
    },
    {
        "id": "1jxo3bm",
        "author": "ChiefLeef22",
        "title": "Actor's Actor Nicky Katt ('Dazed and Confused', 'Insomnia', 'A Time to Kill') Has Died At 54",
        "content": "",
        "upvotes": 2935,
        "comments": 333,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ke77bLjuBiVGczO0K3qM39GhBsbN4IkvTkqcDJt4JhM.jpg?auto=webp&amp;s=8880cc24b680d4f34425af6e356f9f41031514f6"
        },
        "permalink": "/r/movies/comments/1jxo3bm/actors_actor_nicky_katt_dazed_and_confused/"
    },
    {
        "id": "1jytdbb",
        "author": "FilmWaffle-FilmForum",
        "title": "Which “serious” actors should take more comedic roles?",
        "content": "First person who comes to mind is Jesse Plemons. I’ve only seen him in one comedic role and it was Game Night (2018), his subtle dry humour and line delivery is brilliant. Even in his serious roles he’s got a knack for playing psychotic characters that are unintentionally funny.\n\nAre there any other actors you think should star in more comedy movies? ",
        "upvotes": 3,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1jytdbb/which_serious_actors_should_take_more_comedic/"
    },
    {
        "id": "1jyifg5",
        "author": "Arm_chair_gawd",
        "title": "Waterworld",
        "content": "This is a crazy movie. It had the most expensive production at roughly $175 mil in 1994 and was a box office flop.\nIt would ultimately become profitable via tv and  cable distribution and with movie rentals and purchases.\n\nIs it a bad movie? It depends on your perspective. I like it as a guilty pleasure movie. It’s flawed and nearly drowns under Costner’s ego, but it is entertaining.\n\nIf you like Mad Max or the Road Warrior type of action movies, you will enjoy this. Waterworld is basically the same thing, but on water.\n\nMotorcycles are replaced with jet skis and boats.\n\nThis movie also features Dennis Hopper as the main bad guy and leader of the “Smokers”\n\nKevin Costner almost died during production via an accident while filming a scene in open water.\n\n\n\n \n\nhttps://youtu.be/cjAqTXwNkng?si=4prDfMLa40K4bPaL",
        "upvotes": 17,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GwBn0CWHlce2Jm8P_7IHxq5zBzyuRYIG9Ktu2DHbLmk.jpg?auto=webp&amp;s=31951d423a00660c827a4e6bce4d0439e932684e"
        },
        "permalink": "/r/movies/comments/1jyifg5/waterworld/"
    },
    {
        "id": "1jymyw7",
        "author": "SegaGuy1983",
        "title": "Your favorite film was made 15 years before the actual release date. Who are you casting?",
        "content": "For instance, one of my favorite movies is Back to the Future.  \n\nIf this released in 1970 instead of 1985, I would cast Ron Howard as Marty McFly, Mel Brooks as Doc Brown, Hayley Mills as Lorraine, and Jay North as Biff.  \n\nI would need more time to figure out George and some of the other characters.",
        "upvotes": 7,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1jymyw7/your_favorite_film_was_made_15_years_before_the/"
    },
    {
        "id": "1jxxix9",
        "author": "Sisiwakanamaru",
        "title": "Bryce Dallas Howard's New Documentary Uncovers the Emotional Ties Between Humans and 'Pets'",
        "content": "",
        "upvotes": 591,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/idSlxQJn0iPCczebFUS2BQEsI2enbIwnJOEmN8oKGT0.jpg?auto=webp&amp;s=dfffb249102e5704742cc423ff71b03b17525d10"
        },
        "permalink": "/r/movies/comments/1jxxix9/bryce_dallas_howards_new_documentary_uncovers_the/"
    }
]