[
    {
        "id": "1q3qz83",
        "author": "scoreboard-app",
        "title": "Match Thread: Real Madrid vs Real Betis Seville Live Score | LaLiga 25/26 | Jan 4, 2026",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1q3qz83)",
        "upvotes": 157,
        "comments": 2699,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q3qz83/match_thread_real_madrid_vs_real_betis_seville/"
    },
    {
        "id": "1pyji4s",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 15,
        "comments": 1707,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pyji4s/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1q3u8w5",
        "author": "No-Independent2522",
        "title": "GoalZalo garcia goes super saiyan to make it 2-0 Betis",
        "content": "",
        "upvotes": 564,
        "comments": 42,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2jk0x2q70dbg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1q3u8w5/goalzalo_garcia_goes_super_saiyan_to_make_it_20/"
    },
    {
        "id": "1q3szy3",
        "author": "No-Independent2522",
        "title": "GoalZalo garcia scores a header 1-0 Betis",
        "content": "",
        "upvotes": 555,
        "comments": 39,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ruh4crhircbg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1q3szy3/goalzalo_garcia_scores_a_header_10_betis/"
    },
    {
        "id": "1q3udnf",
        "author": "Ready_Ad_1353",
        "title": "Asensio makes it 3-0",
        "content": "",
        "upvotes": 201,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7wmxalk31dbg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1q3udnf/asensio_makes_it_30/"
    },
    {
        "id": "1q3v30k",
        "author": "Ready_Ad_1353",
        "title": "Gonzo completes his hat trick 4-1",
        "content": "",
        "upvotes": 190,
        "comments": 37,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3e8z103x5dbg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1q3v30k/gonzo_completes_his_hat_trick_41/"
    },
    {
        "id": "1q3u9vb",
        "author": "vil727",
        "title": "Mbappé from the stands tonight watching Gonzalo",
        "content": "",
        "upvotes": 104,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vr5d9pge0dbg1.jpeg?auto=webp&amp;s=8911a1e8dd34a2e98cb73653fe8ef8d8451d0677"
        },
        "permalink": "/r/realmadrid/comments/1q3u9vb/mbappé_from_the_stands_tonight_watching_gonzalo/"
    },
    {
        "id": "1q3mmw8",
        "author": "ContributionAway1010",
        "title": "Hi guys, I drew you Toni Kroos",
        "content": "",
        "upvotes": 290,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3xhh3daa7bbg1.jpeg?auto=webp&amp;s=ec5025370b0ca918ab32db7f00ce1be076a20218"
        },
        "permalink": "/r/realmadrid/comments/1q3mmw8/hi_guys_i_drew_you_toni_kroos/"
    },
    {
        "id": "1q3p6fl",
        "author": "Expert-Mammoth8083",
        "title": "🏆 2x LaLiga, 3x UEFA Champions League, 2x Club World Cup, 2x Supercopa de España, 2x UEFA Super Cup. \n\nOn this day 10 years ago, Zinedine Zidane became Real Madrid coach for the first time. The rest was history 🤍",
        "content": "",
        "upvotes": 152,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q3p6fl/2x_laliga_3x_uefa_champions_league_2x_club_world/"
    },
    {
        "id": "1q389tr",
        "author": "One-Category5507",
        "title": "Luka Modric vs PSG. The Real LM10.",
        "content": "",
        "upvotes": 1151,
        "comments": 48,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/yx992l2vn7bg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1q389tr/luka_modric_vs_psg_the_real_lm10/"
    },
    {
        "id": "1q3p8b7",
        "author": "redsenjui",
        "title": "📋✅ Our squad for the match!  \n🆚 \nReal Betis",
        "content": "",
        "upvotes": 63,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/r67lfd7nxbbg1.jpeg?auto=webp&amp;s=1280e5bcc611c457914d0567215c7688431d0c9f"
        },
        "permalink": "/r/realmadrid/comments/1q3p8b7/our_squad_for_the_match_real_betis/"
    },
    {
        "id": "1q3tq1l",
        "author": "HumanSuspect7865",
        "title": "Which of my sketch is the best, guys?",
        "content": "3 Madrid players in here, and then one who Fede helped twerk and yet another who's Carvajal's bff. ",
        "upvotes": 34,
        "comments": 12,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q3tq1l/which_of_my_sketch_is_the_best_guys/"
    },
    {
        "id": "1q3qhxw",
        "author": "cyrusmancub",
        "title": "Starting XI v. Betis",
        "content": "",
        "upvotes": 42,
        "comments": 56,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q3qhxw/starting_xi_v_betis/"
    },
    {
        "id": "1q3p00p",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [1]-0 CD Arenteiro - Rachad Fettal 71'",
        "content": "",
        "upvotes": 42,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pjmc6z38vbbg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1q3p00p/real_madrid_castilla_10_cd_arenteiro_rachad/"
    },
    {
        "id": "1q3gb5o",
        "author": "yt_jameslurette_btw",
        "title": "Bale Benzema &amp; Cristiano.MP4",
        "content": "Quick video edit I made about BBC a bit ago. Ignore the intro — it was mainly used as a hook for an unexpected edit on TikTok, but it doesn’t really have the same effect here. Still wanted to share it with you all. Much love, and hopefully you enjoy the video! Feedback welcome, appreciate you all! Thanks",
        "upvotes": 144,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wdw9zu4af9bg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1q3gb5o/bale_benzema_cristianomp4/"
    },
    {
        "id": "1q3pcg4",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [2]-0 CD Arenteiro - César Palacios 90'",
        "content": "",
        "upvotes": 18,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ih2rtsikybbg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1q3pcg4/real_madrid_castilla_20_cd_arenteiro_césar/"
    },
    {
        "id": "1q2uq7i",
        "author": "Fit_Wrap_9580",
        "title": "Dude wanted to mock Madrid but got burned by grok, lol",
        "content": "",
        "upvotes": 792,
        "comments": 35,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q2uq7i/dude_wanted_to_mock_madrid_but_got_burned_by_grok/"
    },
    {
        "id": "1q3ssez",
        "author": "Ok_Efficiency6317",
        "title": "Karim Benzema Signed Jersey",
        "content": "Hi there,\n\nI’m looking to sell a Karim Benzema signed jersey that comes with a Certificate of Authenticity (COA) from the Real Autograph Company. I’m asking $300, and I will cover the cost of shipping to make the transaction easy and straightforward.\n\nThis jersey was received as part of a collection, and while I know Benzema is a highly respected and accomplished player, soccer isn’t a sport I follow closely. Because of that, I’d really like to pass this piece along to someone who truly appreciates his career and legacy. From what I understand, Benzema has had an incredible impact on the game, especially during his time with Real Madrid, making this a meaningful item for any fan or collector.\n\nThe autograph is clean, clear, and well-placed, and the jersey itself is in great condition. The COA from the Real Autograph Company provides assurance of authenticity. This would make a great addition to a sports memorabilia collection, a display piece for a fan cave, or even a unique gift for a soccer fan.\n\nI’ve priced this at $300 to be fair and reasonable, especially considering I’m including shipping. I’m happy to answer questions, provide additional photos, or share details about the COA for anyone who is seriously interested. I want this to go to someone who will genuinely enjoy owning it.\n\nIf you have any interest or would like more information, please feel free to reach out. I can answer any questions you may have and provide proof that this is a legit item and not a scam like there are of many on this app. Thanks for taking the time to read, and I appreciate your consideration.",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q3ssez/karim_benzema_signed_jersey/"
    },
    {
        "id": "1q2vucv",
        "author": "vil727",
        "title": "Mbappé the last time he had to come on injured in a cup final. (We won't even make it this time)",
        "content": "",
        "upvotes": 387,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mracaov595bg1.jpeg?auto=webp&amp;s=e23389e13e72d4fb33d222d75be70911320d47a0"
        },
        "permalink": "/r/realmadrid/comments/1q2vucv/mbappé_the_last_time_he_had_to_come_on_injured_in/"
    },
    {
        "id": "1q3v4l3",
        "author": "DesignerBlacksmith98",
        "title": "Planning a trip and would love to see a Game at the Santiago Bernabéu",
        "content": "Hi there, I'm Portuguese but still decided with would be better to write this post in English and not adventure myself in Spanish too much... I am planning a trip to Madrid in early February, my family has always paid very good attention to Real Madrid and we are genuinely happy when Real wins as i have family in Spain aswell that are madridistas. So i would just like to know if you guys are ok with the \"tourist fan\", I'm a Benfica fan and we have quite a big problem with that kind of people because they just go watch the game with phone in hand and couldn't care less about the team, i think I wouldn't be like that, if possible and if you can tell me where I'd love to go to a zone where proper fans reunion (maybe not the ultras tho, cuz if they're like ours it's way too crazy for a foreigner), so would it be easy for me to get tickets to the first 10/15 days of February and to what zone, if possible, should i aim to go? Thanks in advance and I'll see u in Lisbon for UCL football.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q3v4l3/planning_a_trip_and_would_love_to_see_a_game_at/"
    },
    {
        "id": "1q3n7hz",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Castilla - CD Arenteiro | Primera Federación, Matchday 18",
        "content": "#FT: CASTILLA 2:0 ARENTEIRO\n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n1:0 Rachad Fettal 71'\n\n2:0 César Palacios 90'\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n10' - Arenteiro score after a simple through pass, but the goal gets disallowed for offside, and after the review the decision stands, I don't know, it was very close \n\n14' - Palacios so close! After a blocked shot, the rebound falls for him at the edge of the box, his curled shot is almost perfect, hits the bar and bounces back down and out\n\n15' - Arbeloa asks for a review after a potential foul against Yáñez in the box - for me it's a pen, the defender clearly sticks his leg out at the last second\n\n19' - 4 minutes of revision and for some reason, he doesn't see a penalty\n\n45' - huge save by Fran, who is faced with a shot from short distance after Aguado slips in the box and has to speculate on the side he picks to jump to - he anticipates correctly and is already in the corner to save the shot once it travels goalwards\n\n47'+3 - and again Fran with another huge save! Ochoa, who is the best (outfield) player on the pitch, chases a long ball and dribbles easily past Liberto and Diego Aguado, and finishes near post, but once again Fran has the right instincts and covers the near post with his foot to deny Arenteiro's lead again\n\nHT - bad half from Castilla, who are lucky not to be down by at least one goal here. The centre of defense is incredibly shaky without Joan, he has to come on at half time if he's ready to play. Liberto, Valde and especially Aguado have severe difficulties defending Ochoa, who must be one of the fastest players in the category, but were lucky that he had a goal disallowed for offside and Fran saving the day twice. In attack, the team could've had a penalty, but apart from that, a shot from distance hitting the bar was the only real opportunity for Castilla \n\n🔄 46' - Arbeloa reacts with a triple sub and brings on Leiva, Lamini and Joan for Cristian David, Liberto and Valde\n\n🔄 63' - Rachad Fettal comes back from his lengthy injury, taking Loren's place\n\n⚽ 70' - GOLLLLL DEL CASTILLA! - Leiva drives forwards on the counter, decides to go on the outside and finish with his left foot, but his shot hits the post - it comes back to Rachad, who takes a touch and shoots, and it is deflected over the keeper and into the net - his first Castilla goal only 7 minutes into his 2nd Castilla appearance due to his long injury\n\n79' - spectacular save by Fran! Free kick from the depths of our half for Arenteiro, and their player can head it perfectly into the bottom right corner, where Fran appears with yet another incredible save to deny the goal! The following corner leads to another good headed chance, this time it hits the bar\n\n🔄 81' - last sub, Pol Fortuny on for Yáñez\n\n86' - triple chance for Castilla, first Leiva's shot is saved after he breaks free on the counter again, the rebound falls for Pol Fortuny, whose curled attempt is also saved by the keeper, and Cestero puts another rebound over the bar\n\n89' - and again Leiva is through on the counter, put though by Palacios, but again he fails to convert against the keeper\n\n⚽ 90' - GOLLLL DEL CASTILLA - right afterwards, Castilla recover the ball early again, Fettal puts through Palacios, who does what Leiva couldn't and finishes calmly into the bottom left corner to kill off the game with his 7th league goal of the season! \n\n90'+1 - Palacios got his 5th yellow for taking off his shirt during the celebration, come on.... \n\n90'+5 - penalty reviewed for Arenteiro, but not given either\n\nFT - Arenteiro, ran out of air at the end and Castilla could see out the match with a comfortable score in a less than comfortable match - Fran saved the team on 3 occasions with extraordinary saves, and the team needed the substitutions to stabilise itself. After their 7th consecutive home win, Castilla are now 3rd, 10 points behind dominant leaders Tenerife \n\n&amp;#x200B;\n\n**Kickoff:** 12:00 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid \n\n**Referee**: \n\n**Competition:** Primera Federación, Grupo 1, Matchday 18\n\n**Viewing options:** \n[LaLiga+](https://www.laligaplus.laliga.com/) (subscription - 14.99€/month) (only available in Spain)\n\n&amp;#x200B;\n\n**Castilla XI** (4-3-3): Fran González - Liberto Navascués (46' Lamini Fati), Víctor Valdepeñas (46' Joan Martínez), Diego Aguado, Jesús Fortea - Cristian David (46' Álvaro Leiva), Jorge Cestero, Dani Mesonero - César Palacios, Loren Zúñiga (63' Rachad Fettal), Dani Yáñez (81' Pol Fortuny)\n\nBench: Guille Súnico (GK), Mario Rivas, Bruno Galassi, Gabri Castrelo. \n\nUnavailable: Sergio Mestre (first team call-up), Manu Serrano (injury), David Jiménez (first team call-up), Manuel Ángel (red card suspension), Roberto Martín (injury), Thiago Pitarch (first team call-up), Hugo de Llanos (injury), Bruno Iglesias (injury). \n\nCoach: Álvaro Arbeloa\n\n&amp;#x200B;\n\n**Castilla last five matches:** WDWDL\n\n**1ª RFEF stats:** 5th | 28pt | 9-1-7 | 22:21\n",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q3n7hz/match_thread_real_madrid_castilla_cd_arenteiro/"
    },
    {
        "id": "1q2zb73",
        "author": "scoreboard-app",
        "title": "Pre Match Thread: La Liga, Round 18 Real Madrid vs Real Betis",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1q2zb73)",
        "upvotes": 66,
        "comments": 69,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q2zb73/pre_match_thread_la_liga_round_18_real_madrid_vs/"
    },
    {
        "id": "1q300g8",
        "author": "DamnThatsInsaneLol",
        "title": "The midfield situation for the next season",
        "content": "So according to most Tier 0 sources, Madrid are most likely bringing back Nico Paz for £9 million and getting either one of Kees Smit, Adam Wharton or Angelo Stiller for the role of deep lying playmaker. \n\nWill that be enough or do we need another signing? And do we need to sell anyone? Imo Ceballos has to go, maybe even Camavinga (but only if we get a really good offer) because he's somewhat injury prone.\n\nAnd the defense situation is an even bigger disaster than the midfield... Rudiger's form has taken a huge dip, Militao and Mendy perpetually injured, Carvajal still injury prone, Asencio still not ready.\n\nThis summer is crucial for the squad building.",
        "upvotes": 24,
        "comments": 61,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q300g8/the_midfield_situation_for_the_next_season/"
    },
    {
        "id": "1q23zh9",
        "author": "SprinGG_20057",
        "title": "Cooked by grok......",
        "content": "",
        "upvotes": 836,
        "comments": 36,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q23zh9/cooked_by_grok/"
    },
    {
        "id": "1q2iyjn",
        "author": "Big-Perception-6079",
        "title": "Why does Real Madrid have a style of play that is so easy for Barcelona to beat?",
        "content": "As a Real Madrid fan since the 2000s, I see that Barcelona plays better, and with better tactics than Madrid. If you look at the record, the last time they scored 5 goals against Barça was almost 20 years ago, while it seems like they only score 5 in a match every two years. In Mourinho's era, even though we had a good tactic, it still seemed like we struggled, but we put up a fight. And every defeat Madrid suffered against Barça (except for the 5-0) didn't feel like a humiliation; it felt like the team had given everything, but we just couldn't pull it off. Even with Zidane, things didn't change. At La Masia, I'm sure they teach them to hate Madrid, which is why they always have a better chance of winning. It's a shame that Madrid, or at least their academy, doesn't do something similar. Maybe then we'd stop being humiliated so often. Although, the best thing would be winning the Champions League, it seems like for them, a Clásico is more important than the Champions League.",
        "upvotes": 88,
        "comments": 89,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q2iyjn/why_does_real_madrid_have_a_style_of_play_that_is/"
    },
    {
        "id": "1q24zsf",
        "author": "Cultural_Answer_8101",
        "title": "Kylian Mbappé for Dior Summer 2026 by Jonathan Anderson. 🇫🇷",
        "content": "",
        "upvotes": 177,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q24zsf/kylian_mbappé_for_dior_summer_2026_by_jonathan/"
    },
    {
        "id": "1q201a0",
        "author": "[deleted]",
        "title": "The greatest club with no doubt 🤫",
        "content": "",
        "upvotes": 290,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ppgybai75yag1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1q201a0/the_greatest_club_with_no_doubt/"
    },
    {
        "id": "1q2bmrx",
        "author": "ManuMora98",
        "title": "[Basket] We begin 2026 with a win against Dubai Basketball 107-93 in Euroleague, after a good reaction from the team in the second half",
        "content": "",
        "upvotes": 28,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hn95wk2sa0bg1.jpeg?auto=webp&amp;s=95e316743cdbb3cc34bfbcbaf76d335c8ec45a9e"
        },
        "permalink": "/r/realmadrid/comments/1q2bmrx/basket_we_begin_2026_with_a_win_against_dubai/"
    },
    {
        "id": "1q2ay1r",
        "author": "Veridicus333",
        "title": "What to expect from VIP Gold (Bernabéu Market)",
        "content": "Title says as it.\n\nJust got tickets to us vs Atleti, in March. I have VIP Gold tickets, with access to the Bernabéu Market for the hospitality portion.\n\nWhat to expect both from the food part of the hospitality, at the Bernabéu market, and other stuff?\n\nI was just hoping to get more insight from anyone who has had an experience with this.\n\nPotentially any videos too if possible?",
        "upvotes": 24,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q2ay1r/what_to_expect_from_vip_gold_bernabéu_market/"
    },
    {
        "id": "1q1wd4e",
        "author": "wahnzig",
        "title": "Another reason watching RMA hasn't been exciting lately",
        "content": "Other than how uninspiring our games have been in the past few years, how much we've relied on pure vibes and individual brilliance to win games/titles, I've just realised another reason I've been losing interest in the current crop of Madrid players....\n\n  \nEndrick.\n\nFor a long time, we didn't have a long-term solution for Benzema's successor. Then we got Endrick, signed two years(2022 to 2024) before he actually started. Two years waiting for this young talent to arrive, while relying on false #9s! I watched Palmeiras games to track his progress. In that time he made a debut for the Brazilian NT and also got handed the NT #9 shirt! \n\n  \nRough but a decent start with good goals for Madrid. I was super excited looking forward to his second season. He was even handed our #9 shirt. \n\n  \nNow where is he? Lyon.\n\nWho do we have in his place? Masty and GG. Both decent players but what's their RMA story, compared to Endrick?\n\n  \nSame with Odegaard - tracked him through many loan spells, watched him grow wonderfully, only for him to land in Arsenal. In his place? Arda, who is a brilliant player but a last-minute signing. Can't compare both players' histories on Madrid's books before their debuts.\n\nWon't be surprised if Nico Paz follows a similar arch.\n\n\nCurrent crop of players just give me meh vibes. Mishmash RMA history. Only recently started to seriously admit academy players, too. \n\n  \nI'm a case study of one obviously. But, so much fan loyalty is being flushed down the drain by this club.\n\n  \nHoping for a better turnout in 2026.",
        "upvotes": 88,
        "comments": 50,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q1wd4e/another_reason_watching_rma_hasnt_been_exciting/"
    }
]