[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 505,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1k71md4",
        "author": "nickbruckman",
        "title": "I’m Nicholas Bruckman — director of the new documentary on Netflix, MINTED: The Rise (and Fall?) of the NFT  — AMA on 4/28 @ 4pm ET!",
        "content": "What’s up r/netflix! I’m Nick, director of *MINTED*, now streaming on Netflix worldwide (well, North America, the UK, Australia/New Zealand, and Africa!)\n\nThe film is a front-row seat to the explosive rise of NFTs becoming a $40 billion digital gold rush, all the way through the market's dramatic crash. We spent years embedded in the digital art and crypto worlds, from NFT multimillionaires flipping JPEGs to the pioneering artists flipping the script on the traditional art market, plus the critics and journalists digging into the good, the bad, and bizarre of this new frontier.\n\nWhether you love or hate NFTs, I hope the film sparks some big questions about how art, tech, and finance are colliding. Beyond NFTs, it’s about pioneering artists trying to not just survive, but lead the way forward in how we use new technology as a society.\n\nWe premiered *Minted* at the Tribeca Film Festival, and its been a wild ride since. So whether you’re a collector, a skeptic, or just a fellow documentary nerd — AMA!\n\nproof: [https://www.instagram.com/p/DI12rZQz1BX](https://www.instagram.com/p/DI12rZQz1BX)\n\nnetflix: [https://www.netflix.com/title/81993558](https://www.netflix.com/title/81993558)",
        "upvotes": 12,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1k71md4/im_nicholas_bruckman_director_of_the_new/"
    },
    {
        "id": "1k88gvo",
        "author": "Sweaty-Toe-6211",
        "title": "Joe Keery Is ‘Okay’ If He’s Only Ever Known as Steve Harrington from Stranger Things",
        "content": "",
        "upvotes": 57,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1k88gvo/joe_keery_is_okay_if_hes_only_ever_known_as_steve/"
    },
    {
        "id": "1k8e8dg",
        "author": "IrishStarUS",
        "title": "American Primeval fans must watch 'criminally underrated' Western series",
        "content": "",
        "upvotes": 11,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1k8e8dg/american_primeval_fans_must_watch_criminally/"
    },
    {
        "id": "1k8bz1l",
        "author": "Plane-Cloud-5837",
        "title": "Penn Badgley reveals why he removed his ban on x-rated scenes for the final season of YOU",
        "content": "",
        "upvotes": 11,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k8bz1l/penn_badgley_reveals_why_he_removed_his_ban_on/"
    },
    {
        "id": "1k8bfiv",
        "author": "Connect-Space1818",
        "title": "I need suggestions for new show to watch",
        "content": "Some I've watched previously :\n\nGossip Girl\nInsatiable \nNever Have I Ever\nThe Residence \nGood Girls\nSex Education \nHeartbreak High\nSquid Game\nWednesday \nHeartstopper ",
        "upvotes": 13,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1k8bfiv/i_need_suggestions_for_new_show_to_watch/"
    },
    {
        "id": "1k8d35o",
        "author": "feb19s",
        "title": "documentary reqs that arent true crime?",
        "content": "basically what the title says. it can be on anything. what is something you watched that greatly expanded your knowledge on that topic? i like learning about arts and history but also keen to look more into wildlife",
        "upvotes": 3,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1k8d35o/documentary_reqs_that_arent_true_crime/"
    },
    {
        "id": "1k7yt4n",
        "author": "Upper-Transition4714",
        "title": "Does every new show/movie added to Netflix make it to the top 10?",
        "content": "My friends and I were wondering if every show/movie makes it to the top 10 Daily. We went through the most recent shows release and they all seemed to be in the top 10 at least for a day in some country. I understand the incentive for Netflix to do so but I was wondering if you have noticed any new show/movie that hasn’t. ",
        "upvotes": 52,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1k7yt4n/does_every_new_showmovie_added_to_netflix_make_it/"
    },
    {
        "id": "1k8d4gf",
        "author": "Internal-Bed-3150",
        "title": "Emma Mackey is the White Witch in Netflix's Chronicles of Narnia movies",
        "content": "Perfect choice.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k8d4gf/emma_mackey_is_the_white_witch_in_netflixs/"
    },
    {
        "id": "1k84yz5",
        "author": "curious7189",
        "title": "Million Dollar Secret - one of the best social deduction games",
        "content": "This is better than The Traitors IMO - one of the best social deduction games\n\nI loved that the millionaire had a secret agenda. The Traitors had the traitors do some missions but it was very rare. I wanted more of that and got it in Million Dollar Secret. \n\nI enjoyed the millionaire being rotated so often. It lets you see different strategies from different players.  \n\nThe winner played such a good game, and showed she was strategic in not voting Syd when she had immunity, playing the final round right etc. \n\nI would've been okay with Sam winning too. \n\nCorey...take a shot every time Corey guessed the millionaire incorrectly 😂 he was cool though. \n\nUltimately it was nice to see all of the contestants trying to play strategically. Some of the challenges could be improved (threading needle in the final episode?) but I can say the same for the Traitors. \n\nHoping there's a season 2! What are your thoughts? ",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k84yz5/million_dollar_secret_one_of_the_best_social/"
    },
    {
        "id": "1k8gnq1",
        "author": "somabva",
        "title": "When did Netflix start claiming they have every movie in existence on search engines?",
        "content": "Is this recent or have I just never noticed it before? \n\nYou google 'any move' + streaming - which is how I always look to see if a movie I've seen a clip of on youtube that looks good is available on any of my subscribed platforms. \n\nFirst web result after the AI inserts telling you where you can actually rent/buy the movie is a link to Netflix \"Watch (title of the movie you just searched)\". Sweet I have Netflix - I click the link. It goes to a movie entry on the Netflix site with the poster, details cast etc exactly like any movie on Netflix looks. But it's not real.\n\nI assume the point of this is, if you don't have Netflix there would be some kind of 'watch thousands of great movies on Netflix!' prompt, implying that if you subscribe you'll be able to watch this movie? But Netflix doesn't actually have the movie. This is insanely scummy, and a nice big time waste for people who actually subscribe to the service.\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k8gnq1/when_did_netflix_start_claiming_they_have_every/"
    },
    {
        "id": "1k87z8a",
        "author": "Ok-Veterinarian5879",
        "title": "Netflix - Device not part of this household bypass method for home device",
        "content": "Hello, I am currently facing an issue with Netflix’s household verification system and would appreciate any practical advice or proven solutions. To explain the situation: the Netflix account owner is located in the United Kingdom, where the household was originally established and verified on a TV device. I, however, am located in Nepal, and whenever I attempt to log in using a new device or a different Wi-Fi network, Netflix immediately flags the device as being outside of the registered household and requests a verification code.  \n   \n**My Question:**   \n  \nConstantly requesting the account owner for a verification code is impractical and not a sustainable solution in the long term.I have already tried that airplane method and turning off wifi for mobile phone. But I noticed it does not ask code in new device. Since I stream mostly in laptop, so any trick to bypass this as I discovered it does not ask code when I login in to new device as I have access to netflix email and password but not verification code. But for old device it asks the code. Anyway to bypass this so that my laptop thinks it is completely new device.",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1k87z8a/netflix_device_not_part_of_this_household_bypass/"
    },
    {
        "id": "1k81wx6",
        "author": "Marite64",
        "title": "Suggestions on good series.",
        "content": "I'm watching Desperate Housewives season 6 (no spoiler please). Is there something as good on Netflix? \n\nNo violence, no gore, no sci-fi, no medical drama. Thanks. ",
        "upvotes": 9,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1k81wx6/suggestions_on_good_series/"
    },
    {
        "id": "1k7yrbs",
        "author": "HumdrumHoeDown",
        "title": "Recommendation: Warrior",
        "content": "I slept on this show since it became available. Watched a few minutes of it, didn’t bite. But i heard some hype and decided to give it a try just recently, and holy shit am I feeling rewarded for it. \n\nIt doesn’t even take long to get good, and rarely falters in any area. Writing, production, acting, casting, costumes, what have you: it’s all on point 90% of the time.\n\nIt’s a gangsters/families, cops and robbers martial arts drama, with the various gangs being fictional, but still feeling plausible in its’ historicity. I treat it as fiction, but made in imitation of real life, at least as far as the broad tensions and power dynamics of that place and time.\n\nThe writing is sharp, the characters are great portrayals of certain archetypes. The action is excellent and stylish. It’s quality top to bottom. And it’s a unique perspective.\n\nThe focus is the Chinese immigrant population of 19th century San Francisco, but also the Irish population and other ancillary forces such as nativist white supremacy, economics, existing political structures, culture barriers, space and resource limitations etc etc. \n\nIf you like historical fiction, martial arts, sopranos style gangster drama…this is for you. \n",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k7yrbs/recommendation_warrior/"
    },
    {
        "id": "1k7v333",
        "author": "KingFyx",
        "title": "Did Netflix just gave up promoting their once popular tv shows ?",
        "content": "This year, I got back into rewatching a few old shows from Netflix only to realise that there was a new season of Black Mirror. That's weird I thought to myself cause Netflix usually would promote their shows leading up to the release. \n\nAnd now with You season 5 being released, I realised that Netflix hasn't done any promos for their old shows for a while for the past 2 years ? It's only a week after the season hits or some random Tiktoks that i would find out a show is coming up. What happened ? \n\nEdit: I just went through their trailers and like, this entire year is loaded with their highest viewership shows ? How are they not making a big deal out of this year being the year of Netflix coming back with their cult classic shows ? We have Sandman, Love, Death and Robots, Wednesday, as well as Stranger Things (although I did saw Stranger Things being announced this year BUT not because of Netflix bombarding it in my face). ",
        "upvotes": 7,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1k7v333/did_netflix_just_gave_up_promoting_their_once/"
    },
    {
        "id": "1k7n76b",
        "author": "Internal-Bed-3150",
        "title": "Netflix is dropping 55 movies and series this week (April 26 - May 2, 2025)",
        "content": "",
        "upvotes": 19,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1k7n76b/netflix_is_dropping_55_movies_and_series_this/"
    },
    {
        "id": "1k8a1m8",
        "author": "Excellent-Chair2796",
        "title": "Price Increases To Netflix",
        "content": "I'm new to this forum but am really disappointed the way I am (in UK) now paying £12.99 for a service monthly I used to pay £7.99 for.  That's nearly double.  I don't want wrestling !!! Does anyone know if Netflix are losing subscribers from this, and if their updated subscription statistics are available to view anywhere ? ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1k8a1m8/price_increases_to_netflix/"
    },
    {
        "id": "1k7o601",
        "author": "mono_six651",
        "title": "YOU season 5",
        "content": "Imma be honest, surprisingly season 5 was perfect. Everything is just reasonable I cannot pick sides in this season. Everybody is in the right, literally.\n\nWhat’re your guyss thoughts?",
        "upvotes": 16,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1k7o601/you_season_5/"
    },
    {
        "id": "1k7rql9",
        "author": "Deivelicious",
        "title": "Question about camera on \"Adolescence\":",
        "content": "Hey people, I just finished Adolescence on Netflix and I'm pretty amazed by their camera work and also loved to see the short making of.\n\nA still unanswered question though is how they did the camera tracking shot in the second episode at about minute 38:35 (something like that)\nwhen the camera follows Ryan and it seems to be flying through a closed window right next to the open one where he escapes through.\n\nI haven't found any footage of how they managed to do that, is it probably just the \"effect\" of a closed window? Someone has an idea?\n\nCheers in advance and have a good one!\n\nForgive me my english for that isn't my first language.\nBest regards",
        "upvotes": 8,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1k7rql9/question_about_camera_on_adolescence/"
    },
    {
        "id": "1k84xiw",
        "author": "devilsb1tch666",
        "title": "Give your opinions on Heartbreak High in my survey! I need your help!",
        "content": "Hi!! This is for anyone who has watched the show Heartbreak High! I’m in my last year of high school currently doing research for my HSC society and culture major project, and need your guys’ help! \n\nI’m doing a research report on successful minority representations within Australian teen TV, and I’m looking specifically at Heartbreak High, both the 1994 original and the 2022 reboot! One section of my research looks specifically at audiences’ opinion for the quality and impact of Heartbreak High’s minority representation. That means I need you! \n\nIf you watched either the 1994 original 2022 versions, or both please do my survey! You can give your honest opinion on the shows successful diverse representation! \n\nPlease make it so everyone sees this because it will be really valuable research, and would love to hear everyone’s opinions!!! ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k84xiw/give_your_opinions_on_heartbreak_high_in_my/"
    },
    {
        "id": "1k844u0",
        "author": "Longjumping-Pass-51",
        "title": "Profile name and photo changed",
        "content": "I’m not sure what to do at this point so I’m gonna post it here and hope someone has a clue🤷‍♀️\n\nThis is the 3rd time this has happened within a year. The exact same thing each time. My main account picture is eleven from stranger things. The profile picture keeps getting changed to Dustin from stranger things. Along with that, the name changes from “Allison” to “Allisonaag”. Every. Time.\n\nI’ve tried logging out of all devices and changing my password but it keeps happening. I know it isn’t a HUGE deal or anything but it’s annoying😭 if anyone knows what to do or at least has been through this too please let me know🙏",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k844u0/profile_name_and_photo_changed/"
    },
    {
        "id": "1k7hfnq",
        "author": "OkBert12345",
        "title": "YOU Season5 on Netflix",
        "content": "The final season is out now on Netflix Australia.\nAnyone else bingeing it?\nJoe is back in his black cap, doing classic Joe things, back in New York, and the end seems nigh.\nI’m up to ep6 and it is a ride!\n",
        "upvotes": 29,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1k7hfnq/you_season5_on_netflix/"
    },
    {
        "id": "1k8a2cz",
        "author": "fancy_the_rat",
        "title": "How to keep the Netflix Playback Bar Permanently Visible?",
        "content": "Hi! When playing movies or series, the bottom bar with the controls (Play, Pause, progress bar) always disappears automatically after a few seconds.\n\nHowever, I would really like to keep this bar visible the entire time, as it would make controlling the playback easier for me.\n\nThanks for help.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k8a2cz/how_to_keep_the_netflix_playback_bar_permanently/"
    },
    {
        "id": "1k80pko",
        "author": "scorpioassociation",
        "title": "Show suggestions!!??",
        "content": "Can someone please suggest me some good Netflix shows? My taste in shows is very vast. I love modern family, dexter, you, breaking bad, young Sheldon, behind her eyes and many more!!\n\nPS: No romantic shows pls",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1k80pko/show_suggestions/"
    },
    {
        "id": "1k6zj5x",
        "author": "PressureForsaken7147",
        "title": "Netflix household sucks",
        "content": "I know this isn’t new, but I still want to share my thoughts on Netflix’s household policy.\n\nJust because a family doesn’t live under the same roof doesn’t mean they’re not family. In today’s world, it’s normal for siblings or parents to live in different cities. We still stay connected, so why can’t we share a Netflix account — especially when we’re already paying for one with multiple profiles?\n\nNetflix used to be okay with sharing. They even encouraged it back in the day. And now they’re changing the rules just to make more money. It doesn’t feel fair.\n\nWhat’s more annoying is that even though this policy started a while ago, I was still able to use Netflix on my laptop — just not on the mobile app. But today I got a notification on my laptop saying I can’t use it anymore either. So that’s it, I guess. One more reason to unsubscribe.",
        "upvotes": 233,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1k6zj5x/netflix_household_sucks/"
    },
    {
        "id": "1k7yej9",
        "author": "Consistent_Way2386",
        "title": "Can’t access my account on my MacBook, but can on my iPhone",
        "content": "I moved away for university, but am still using my dad’s account. I’ve had no issues using my laptop until today. Now it says “Your device isn’t part of the Netflix Household […]” but when I open Netflix on my phone, it’s still allowing me in. I just downloaded the newest MacOS update, so maybe this has something to do with it? No clue. Any help is appreciated.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k7yej9/cant_access_my_account_on_my_macbook_but_can_on/"
    },
    {
        "id": "1k887bw",
        "author": "TheMirrorUS",
        "title": "Netflix fans told to watch 'bingeable' series with 83% rating",
        "content": "",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1k887bw/netflix_fans_told_to_watch_bingeable_series_with/"
    },
    {
        "id": "1k7cl12",
        "author": "philfnyc",
        "title": "Article: Netflix Debuts Dialogue-Only Subtitles",
        "content": "Netflix, you read my mind! This is an excellent option that I’ve silently wished for. 👏🏼👏🏼👍🏼\n\nArticle: https://www.macrumors.com/2025/04/24/netflix-debuts-dialogue-only-subtitles/",
        "upvotes": 19,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1k7cl12/article_netflix_debuts_dialogueonly_subtitles/"
    },
    {
        "id": "1k72ro9",
        "author": "TCACampbell",
        "title": "Unable to use certain profiles",
        "content": "Hi, i’m currently trying to use my profile but any time I use it or my friends on the same account they cause netflix to bring up the error code tvq-st-149. \nOther profiles on the account don’t cause this. just these two. Both accounts were working fine earlier and I am trying to access them from the netflix household. Signing out and i’m in again/ reloading seems to have no effect. any help is appreciated.",
        "upvotes": 80,
        "comments": 104,
        "media": null,
        "permalink": "/r/netflix/comments/1k72ro9/unable_to_use_certain_profiles/"
    },
    {
        "id": "1k7t7f1",
        "author": "Express-Swim2713",
        "title": "*Spoiler* YOU S5 - I think u found a plot hole no one’s talking about",
        "content": "Ok so now that we’ve binge watches the entire season in a single day, IVE GOT QUESTIONS! And I think the director has deliberately kept it that way.\n\nWhen Maddie was put in the cage by Joe, maddie tried to show for a moment that she’s quite strong and doesn’t care if she’s a hostage, but soon when Ketoacidosis kicks in, and she gets know about her “superior” twin learning about the affair… she just looses it and reveals how she’s such a weak little girl. All throughout the season we see her as impulsive and extraordinarily weak in every minor situation after the cage incidence… which wasn’t really the case before that!\n\nMy theory is … when  Reagan was locked in with her… who just showed moments ago that she can easily beat up Joe, and is quite tough, CAN’T BE KILLED THAT EASILY BY HER WEAKER SISTER , that too by an insulin injection when she’s all awake and athletic!!\n\nAlso, the killing of Reagan scene and the scene when maddie hits her husband unconscious is both not shown on the show… making perfect sense that Reagan killed maggie and then pretended to be her for the rest of the show!\n\nBut even till the final episode .. it wasn’t shown.. the hallucinations, the - going to jail and still not breaking character were all a big show to make people hooked on when the show will reveal that it’s actually Reagan pretending to be her twin and not the other way around… but it was never shown!\n\nDid anyone else notice that? I can’t be the only one.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k7t7f1/spoiler_you_s5_i_think_u_found_a_plot_hole_no/"
    },
    {
        "id": "1k83he6",
        "author": "Jade_Jones",
        "title": "Why Netflix?",
        "content": "What is with Netflix constantly removing their best movies and shows? Like this time I go to watch legends of Korra(which I don't think is on anything else) and they removed it? It's not even the first time they've done something like this. Like why, is there an actual point? Can they only have a certain amount of shows, do they have to pay to keep the license to certain shows and movies? Like if not then Netflix is just ass.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k83he6/why_netflix/"
    },
    {
        "id": "1k7nypo",
        "author": "Somethingman_121224",
        "title": "Netflix Has Just Released Its Full Summer 2025 Slate and There Are Some Exciting Titles Coming Our Way",
        "content": "",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1k7nypo/netflix_has_just_released_its_full_summer_2025/"
    }
]