[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p85gri",
        "author": "pleasestoptalkin",
        "title": "Millie Bobby Brown takes me out of every Stranger Things scene she’s in",
        "content": "I don’t know if it’s the bad acting or the fact she’s a grown woman, who has had work done on her face, playing a little girl, but I just start laughing every time she’s on screen. If David Harbour really did snap at her, I get it because it seems like she stopped trying and their emotional scenes together are really bad. ",
        "upvotes": 140,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1p85gri/millie_bobby_brown_takes_me_out_of_every_stranger/"
    },
    {
        "id": "1p7pc8k",
        "author": "TheMirrorUS",
        "title": "Netflix crashes with Stranger Things Season 5 release",
        "content": "",
        "upvotes": 292,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1p7pc8k/netflix_crashes_with_stranger_things_season_5/"
    },
    {
        "id": "1p85fl1",
        "author": "Worried-Struggle2788",
        "title": "Anything on Netflix similar to Mr. Robot",
        "content": "I just finished rewatching Mr. Robot and it reminded me how good that style of show is. The mix of tech, paranoia, social commentary, and all the weird psychological stuff hits different compared to most series out right now.  \n  \nI checked Netflix but their recommendations felt kind of random and not really in the same vibe. Before I start scrolling for an hour, is there anything on Netflix with a similar feel? Something with hacking, underground groups, heavy atmosphere, or that same kind of tension where you never fully know who to trust.  \nI am not expecting a perfect match since Mr. Robot is pretty unique, but anything close in tone or theme would be solid. Would appreciate any suggestions from people who watch the same kind of shows.",
        "upvotes": 22,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p85fl1/anything_on_netflix_similar_to_mr_robot/"
    },
    {
        "id": "1p7oxqd",
        "author": "Acrobatic-Apricot874",
        "title": "Netflix broken?",
        "content": "Anyone else's netflix just break?? I was trying to watch season 5 of stranger things because it just dropped a minute ago but my netflix isn't letting me into anything...",
        "upvotes": 201,
        "comments": 187,
        "media": null,
        "permalink": "/r/netflix/comments/1p7oxqd/netflix_broken/"
    },
    {
        "id": "1p79ilm",
        "author": "intelerks",
        "title": "Linda Hamilton refuses to chase youth in 'Stranger Things': \"I do not spend a moment trying to look younger\"",
        "content": "",
        "upvotes": 513,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1p79ilm/linda_hamilton_refuses_to_chase_youth_in_stranger/"
    },
    {
        "id": "1p7iqtt",
        "author": "Gamer_8887",
        "title": "In my opinion Stranger Things is the best Netflix show I've ever watched and I am sad to know that it's coming to an end",
        "content": "I started watching it in 2020, at the time I bingewatched seasons 1-3 and I was so addicted. Season 4 in 2022 really blew me away, especially the Max episode, I still listen to that song till today. It's really good. With the final season volume 1 around the corner, I just wanted to make this post before it airs. I will miss this masterpiece of a show when it ends 😭.",
        "upvotes": 42,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1p7iqtt/in_my_opinion_stranger_things_is_the_best_netflix/"
    },
    {
        "id": "1p7vs65",
        "author": "Pulp501",
        "title": "Picture in picture settings?",
        "content": "I want to be able to have netflix playing in the background on my phone while using other apps. Ive been subscribed before and never had a problem but now it doesn't do it and there doesn't seem to be any setting for it. Never needed a setting before, it would automatically do it, like most apps do. Does netflix just not have this feature anymore? ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p7vs65/picture_in_picture_settings/"
    },
    {
        "id": "1p82uli",
        "author": "michaelpaul7",
        "title": "Standard plan with ads",
        "content": "I have the standard plan with ads and I see that it says 15 downloads per device each calendar month. I have two tablets so I should be able to get 30 downloads..... Can someone please confirm. \nI use my tablet when I have down time and no access to WiFi.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p82uli/standard_plan_with_ads/"
    },
    {
        "id": "1p7p31x",
        "author": "sgudeman",
        "title": "Opened Netflix app on Apple TV and was logged into somebody else’s account at my house… what??",
        "content": "So I opened up Netflix on my Apple TV and the account profiles were all somebody else’s account… Terrance, kids, Matthew, Michael, and Jacob. None of whom live at my house or who I have on my Netflix account. It was so weird! Had to log out and log back in as me… it was like being at an Airbnb where somebody else had forgot to log out except this was at my own house. Anyone else have this happen ever?? ",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p7p31x/opened_netflix_app_on_apple_tv_and_was_logged/"
    },
    {
        "id": "1p7hfp6",
        "author": "kebmpb",
        "title": "We betting on “yes” that the servers crash tonight at 8:00pm est?",
        "content": "Gonna be Mike Tyson/Jake Paul all over again or have they beefed up the server since then? Did they ever come out and say why they didn’t do a midnight release?\n\nShould be interesting to say the least!",
        "upvotes": 23,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1p7hfp6/we_betting_on_yes_that_the_servers_crash_tonight/"
    },
    {
        "id": "1p7lqcw",
        "author": "makeitrealforme",
        "title": "Netflix auto play",
        "content": "What's with Netflix nowadays where it doesn't even give you the option to see information about the movie/show you're interested in watching; it just automatically plays when you click it when before it allowed you to see the details before deciding to play. It's annoying.",
        "upvotes": 11,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1p7lqcw/netflix_auto_play/"
    },
    {
        "id": "1p7wgc9",
        "author": "Maybe_Everett",
        "title": "can’t see show info",
        "content": "Every time I click on a show or movie it just immediately starts it without displaying the info first. I want to watch a specific episode of a show, but it automatically just starts episode 1 without letting me choose. This has been happening for a month on multiple devices. What’s happening? ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p7wgc9/cant_see_show_info/"
    },
    {
        "id": "1p6x7e9",
        "author": "ChiefCrazybull",
        "title": "Could Guillermo Del Toro's new Frankenstein movie be a Santa Clause origin story?",
        "content": "Obviously there are spoilers, so if you haven't seen the movie then stop reading.\n\nI just finished watching the 2025 Frankenstein, and the first thing that occurs to me is that it sets the Creature up perfectly to be the origin story for Santa Claus. Here are some of the reasons:\n\n* The movie ends with the Creature walking towards the north pole, which is always thought of as the remote home of Santa Claus.the Creature\n* The Creature has a good heart and just wants to help people (he cares for the family, helps the old man, and frees the ship from the ice at the end)\n* The Creature is immortal, just like Santa.\n* Furthermore, his immortality implies some sort of magic being involved (surviving an exploding stick of dynamite goes beyond scientific explanation), which could explain some of the magical aspects of Santa.\n* The Creature begins to look like Santa at the end of the movie (with a long heavy coat like Santa's). Since he doesn't want to scare people, a big hat and beard would also make sense.\n* One of the first scenes after he escapes the lab is him befriending reindeer, foreshadowing his future as Santa.\n* After that, the Creature hid during the day and only came out at night, where he would leave seemingly magical gifts for people (much like Santa leaves gifts while everyone is sleeping). The family would also leave food or other things for him (like leaving cookies for Santa).\n* Elizabeth, who shares a mutual love with the Creature, looks shockingly similar to Jessica from the 1970 movie Santa Clause is Coming to Town (both are pale with long red hair parted in the middle). This movie is a Santa Claus origin story, so it would be a clear Mrs. Claus Easter Egg if Guillermo Del Toro intentionally styled Elizabeth like Jessica.\n* Furthermore, all the Creature ever wants is someone like him to live with. Assuming he is able to eventually create such a person (maybe using the notes he found outside the lab), then this person would also be immortal and would fit perfectly as Mrs. Claus (it would also make sense that he might make this person look like his love Elizabeth).\n* Perhaps the elves are also immortal, good creatures created by the Creature (but since he always says he wants just one other person like him, maybe he made them better suited to creating toys as craftsmen).\n* The movie takes place in 1857, which is still before Santa Claus becomes a mainstream part of Christmas.\n\nEdit: changed Frankenstein to the Creature, and changed Santa Clause to Santa Claus",
        "upvotes": 235,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1p6x7e9/could_guillermo_del_toros_new_frankenstein_movie/"
    },
    {
        "id": "1p7ae7i",
        "author": "amelix34",
        "title": "You just found out that one of the main characters in your favourite TV series is not a good person in real life. Do you keep watching?",
        "content": "There is a comedy show that I absolutely love (most of its seasons) and I rewatch it from time to time. Some time ago I read that one of the main characters was recently accused of sexual assault in real life, and as I read it was not the first time. I also saw some discussions on Reddit about them and it seems that it's established fact that a lot of people have zero respect for this person.\n\nI'll be honest it breaks my heart because I truly love the show and their character, and now when I'm rewatching the show it just feels different, everytime I see scene with them my brain reminds me who they are in real life and it's difficult to enjoy the show like I always did. I regret reading about this stuff\n\nI wonder what's your take on this.",
        "upvotes": 23,
        "comments": 141,
        "media": null,
        "permalink": "/r/netflix/comments/1p7ae7i/you_just_found_out_that_one_of_the_main/"
    },
    {
        "id": "1p7zje3",
        "author": "Many-Philosophy4285",
        "title": "Mapping the real town behind Hawkins",
        "content": "Stranger Things never shows the real layout of Hawkins so I traced every filming location and lined them up on a real map. Here is how the fictional town is built from real places and why it still feels like one location on screen\nhttps://youtu.be/8TtPfX3Xl6c\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p7zje3/mapping_the_real_town_behind_hawkins/"
    },
    {
        "id": "1p7zbla",
        "author": "AssociateLittle1487",
        "title": "What’s your opinion on Stranger Things 5 Volume 1?",
        "content": "So far it’s a much better season finale than all the other season finales I’ve seen this year (Alice in Borderland and Squid Games are of a different genre but still). Characters I thought would be boring turned out to be extremely entertaining. Comedy and fear are also intertwined very well in the different scenes and I couldn’t stop watching for a few hours straight. Plus, the plot is finally focused on one main goal instead of having multiple subplots again so I’m glad for that.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p7zbla/whats_your_opinion_on_stranger_things_5_volume_1/"
    },
    {
        "id": "1p7p1bt",
        "author": "WibbyWobbles",
        "title": "So… did Netflix just crash?",
        "content": "We all in this together or is it just me and a select group of others? I hit play on S5 of Stranger Things and it immediately gave me error code NSES-500. Now I can’t even access Netflix. \n\nJust me? ",
        "upvotes": 3,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1p7p1bt/so_did_netflix_just_crash/"
    },
    {
        "id": "1p7redm",
        "author": "NeedSpeed_",
        "title": "new season of Stranger Things in 4K Ultra HD (Dolby Vision) / HDR?.",
        "content": "I’m trying to decide between the Standard and Premium Netflix plans. I’m only subscribing to watch the new season of Stranger Things, so I want to know whether it’s worth paying extra for Premium. Is the new season available to stream in 4K Ultra HD / HDR? If not, I’ll just choose the Standard plan.\n\n  \n\n\nI tried checking online for the answer, but I couldn't find anything.",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1p7redm/new_season_of_stranger_things_in_4k_ultra_hd/"
    },
    {
        "id": "1p7tozh",
        "author": "SongChoice320",
        "title": "Netflix blocked??",
        "content": "Hopped on my pc to renew my netflix subscription which i did, then every time I went to the website it just says blocked in the top right corner. My phone works with netflix but not desktop",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p7tozh/netflix_blocked/"
    },
    {
        "id": "1p6ztg8",
        "author": "AffectionateAge1448",
        "title": "Dont Worry Darling",
        "content": "This movie is super creepy. It made me think about how women in the early 1900s used to be treated. It made me think that this is probably  how the first women who started to see through their social conditioning felt. Or any women that went agaisnt  their husbands.   It was common for women to be labeled mentally unwell, and recieve lobotomies if they did things like show anger, go agaisnt  their husbands  wishes, or step out of line with the social norms. Much like in this movie.  In the movie when the women step out of line they are labeled mentally ill, and then their brains are \"restarted\".  Women were expected to be exactly as the women in this movie are. \n\nImagine the first women in the 1940s that started to question  \"why are we house wives, why do we all dress the same, why are we servants to men, why cant we have jobs, why cant we drive , why cant we vote what is going on,  why are we given lobotomies if we show emotion or disobey our husbands\"? And then she slowly started to realize women were  being brainwashed and that women are fully capable of doing things outside of their house duties. I imagine it was much like this movie, like seeing through the simulation like social conditioning, and then being condemned by society for speaking out, and sometimes being forced to have lobotomies to make women  fall back in line with the social norms. ",
        "upvotes": 72,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1p6ztg8/dont_worry_darling/"
    },
    {
        "id": "1p7wgdw",
        "author": "1994Random",
        "title": "Respectfully respectful respect…HQ2 in North",
        "content": "…South…South has what you need. Beyond measure! There should be a subsidiary a few miles south past Trenton. Mt laurel a decent spot! (I kidde; top notch) At the same time, Hon. Phil (heck Hon. Mickie)hit a sold decade to utilize all of the state🤷‍♂️?! (Putting executives brain in front street)\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p7wgdw/respectfully_respectful_respecthq2_in_north/"
    },
    {
        "id": "1p7s8ok",
        "author": "MartinIsFarting",
        "title": "How can I mark shows/movies as watched?",
        "content": "I’ve recently switched Netflix accounts and lost my recommendations. I want to mark the movies and shows I’ve watched but I can’t quite figure out how to do it. I’ve been trying to use the thumbs up method but I’m not sure if it works to be honest.  ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p7s8ok/how_can_i_mark_showsmovies_as_watched/"
    },
    {
        "id": "1p6tnrd",
        "author": "Far_Pen3186",
        "title": "Matthew Macfadyen Gives An Incredible Performance As James Garfield’s Assassin in ‘Death By Lightning’",
        "content": "This character is infuriating, a pest, delusional, annoying as FK, pathetic, a loser, etc. The actor did a great job in making the viewer disgusted with this character! Even his voice is grating.",
        "upvotes": 147,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1p6tnrd/matthew_macfadyen_gives_an_incredible_performance/"
    },
    {
        "id": "1p7q8fk",
        "author": "Julianssjdl",
        "title": "Stranger Things won't let me watch it in QHD",
        "content": "I have the premium plan, a QHD HDR monitor, and I tried watching Stranger Things. The problem is that my monitor makes anything in 1080p look too blurry, and it's happening with Stranger Things season 5. How do I force it to play in QHD? I'm paying for the premium plan, after all. I watched Wednesday and it plays in QHD HDR. What's going on?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p7q8fk/stranger_things_wont_let_me_watch_it_in_qhd/"
    },
    {
        "id": "1p7ouat",
        "author": "SundaeNumerous9729",
        "title": "recomendação",
        "content": "Alguma recomendação de filmes ou série estilo A Diplomata e House Of Cards? Gosto de politica, suspense, drama. Até mesmo alguma recomendação de algo sobre 2 Guerra Mundial sem ser a guerra em si, mas a vida dos nazist@s",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p7ouat/recomendação/"
    },
    {
        "id": "1p7onhz",
        "author": "ExchangeSea",
        "title": "Is Stranger Things Season 5 going to be on the Standard with Ads plan?",
        "content": "So i dont have netflix and im kinda poor and i really want to watch ST S5 when it comes out in like 12 minutes and my question was just if it is going to be available to watch on the standard with ads plan. ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p7onhz/is_stranger_things_season_5_going_to_be_on_the/"
    },
    {
        "id": "1p75mit",
        "author": "huffpostuk",
        "title": "Netflix Announces New Diddy Documentary Sean Combs: The Reckoning",
        "content": "",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1p75mit/netflix_announces_new_diddy_documentary_sean/"
    },
    {
        "id": "1p81e7b",
        "author": "Chaos_BTTW",
        "title": "WHY DOES NETFLIX HAS ADS NOW???",
        "content": "IM SO MAD CAUSE ITS A SUBSCRIPTION INHATE IT THAT SUBSCRIPTIONS ARE MAKING YOU WATCH ADS WHEN YOIR PAYING FOR THEIR SERVICES LIKE ITS SO ANNOYING AND I JUST HATE IT IT SHOULDNT BE LIKE THIS",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1p81e7b/why_does_netflix_has_ads_now/"
    }
]