[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 36,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pkkf0k",
        "author": "Plushie-Queen254",
        "title": "\"This movie/is not available with your current subscription\"- why is this a thing now?",
        "content": "\nA few days ago, I was wanting to watch Annie (2014), but I didn't know what streaming service it was on, so I asked Alexa on my FireStick and it told me it was on Netflix.  In fact both the 2014 version and the original 1980s Annie was available on Netflix. I thought *great!* and clicked on the thumbnail for the 2014 Annie. \n\n\nI was taken to Netflix and when I tried to watch the film, it said I couldn't watch this movie with my current subscription. \n\nMind you, I have the basic subscription, but when I first got Netflix, it originally was that even the basic subscription could get you any movie or show they have available. So this is new to me.  \n\n\nWhen did Netflix start doing this and why? ",
        "upvotes": 89,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1pkkf0k/this_movieis_not_available_with_your_current/"
    },
    {
        "id": "1pks9y4",
        "author": "T00dd",
        "title": "All The Classic Star Trek TV Shows To Exit Netflix Globally In January",
        "content": "",
        "upvotes": 18,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1pks9y4/all_the_classic_star_trek_tv_shows_to_exit/"
    },
    {
        "id": "1pknp0e",
        "author": "Achyut_78",
        "title": "Dexter Might Be One Of The Best Tv Series On Netflix !!!",
        "content": "I started this series not knowing what to\n expect from it. I thought oh yea another serial killer series with the main character having daddy issues. But oh boy how wrong was I.\n\nThis series might just be one of the best serial killer shows, now I have seen multiple great series like Dahmer, Hannibal, You. But the consistency that Dexter maintains is unreal.\n\nIn fact it's still airing and having one of the best tv ratings ever. This series dominated the genre of serial killers.\n\nAnd the character Dexter Morgan has been played so well by Micheal C Hall, truly amazing. It's just simply lovely.\n\nThe progression of season and new serial killers introduced in each season keep you hooked with the series.\n\nI am currently on the final season of Dexter and I must say it did not miss any aspect whatsoever.\n\nI am sure most of you have already seen it but, of you haven't, then I must say it's a must watch.",
        "upvotes": 28,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pknp0e/dexter_might_be_one_of_the_best_tv_series_on/"
    },
    {
        "id": "1pkb136",
        "author": "Wonderful_Highway629",
        "title": "Director convicted of scamming $11M from Netflix and going on lavish spending spree",
        "content": "600k for mattresses really gets me.  This guy went on a shopping spree and never finished the show.  He will probably never work in Hollywood again.  I wonder what he was thinking!!??",
        "upvotes": 175,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pkb136/director_convicted_of_scamming_11m_from_netflix/"
    },
    {
        "id": "1pkwtbw",
        "author": "mr_the_boilermaker",
        "title": "What's with the non-stop music in documentaries?",
        "content": "I almost had to turn off the Charlie Sheen doc because of the annoying, non-stop background music. \n\nI DID turn off the hunt for Bin Laden doc because of the annoying, non-stop background music. \n\n  \nNetflix documentary film makers, pump the brakes on the music! It makes these shows unwatchable!\n\n/rant",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pkwtbw/whats_with_the_nonstop_music_in_documentaries/"
    },
    {
        "id": "1pk2mjf",
        "author": "vishesh_07_028",
        "title": "Quality Over Quantity was a LIE.",
        "content": "We paid more, lost password sharing, and the catalog shrank. They promised quality, but I'm still scrolling through mediocrity and re-watching Ozark. Netflix has replaced content with controversy. Where is the value for $20/month?",
        "upvotes": 196,
        "comments": 101,
        "media": null,
        "permalink": "/r/netflix/comments/1pk2mjf/quality_over_quantity_was_a_lie/"
    },
    {
        "id": "1pk9840",
        "author": "Spagetti13",
        "title": "Decades later, people are still celebrating Festivus in real life -- the made-up holiday from a sitcom that I learned about by watching \"Seinfeld\" on Netflix",
        "content": "",
        "upvotes": 70,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1pk9840/decades_later_people_are_still_celebrating/"
    },
    {
        "id": "1pkwanu",
        "author": "NotKatiee",
        "title": "Netflix resubscribing me without me asking?",
        "content": "I canceled Netflix in August because I like to switch back and forth between Hulu and Netflix. I was just checking my email and I had an email thanking me for resubscribing. I didn't do that. I'm wondering what could have caused this? I already changed all my passwords. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pkwanu/netflix_resubscribing_me_without_me_asking/"
    },
    {
        "id": "1pkurmd",
        "author": "Regular-Bite-7553",
        "title": "Netflix quality issue",
        "content": "I upgraded my plan to premium which is the highest plan available in India and I'm still not able to view with higher quality on my android tablet. I contacted netflix support they told me to change playback quality to high from auto i did that but still no change in quality. Any help here please ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pkurmd/netflix_quality_issue/"
    },
    {
        "id": "1pk3ps9",
        "author": "businessinsider",
        "title": "Guilty on all counts: Jury convicts Netflix director Carl Rinsch in $11 million fraud case",
        "content": "",
        "upvotes": 49,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pk3ps9/guilty_on_all_counts_jury_convicts_netflix/"
    },
    {
        "id": "1pkq9zf",
        "author": "MutantReaperX",
        "title": "Issue with adding payment method and not receiving code.",
        "content": "Anyone else having major issues with adding payment method? It's either it can't complete the action or when it does successfully go to the next page which is send code to phone i don't receive any code at all. If Netflix doesn't want my money i mean.. cool i can find other means of viewing their content lol but is there any fix at all or do i just wait it out until the issue resolved itself withing the next few days or something idk..",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pkq9zf/issue_with_adding_payment_method_and_not/"
    },
    {
        "id": "1pkp9dd",
        "author": "NothingDizzy239",
        "title": "Help",
        "content": "Can someone tell me who gabby from free rein looks like? Her acting and face looks so familiar but looked her up and she’s not from any other show I have seen. I bugging me so much 🤦🏻‍♀️",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pkp9dd/help/"
    },
    {
        "id": "1pk7kz6",
        "author": "RiskAndReason",
        "title": "Which show’s new season are you waiting for the most?",
        "content": "There are so many ongoing series on Netflix right now that it feels like I’m always waiting for *something* to come back.\n\nWhich show are you most excited to get a new season for?  \n",
        "upvotes": 10,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1pk7kz6/which_shows_new_season_are_you_waiting_for_the/"
    },
    {
        "id": "1pkcm6r",
        "author": "soupisgoodfood42",
        "title": "Can someone please explain what happened in s01e05 of Untamed",
        "content": "&gt;!So, the cop with the restraining order comes around to get his kid, it turns violent and he ends up arrested. Everyone has a little chat. Then main cop's ex wife is suddenly in the hospital? And he goes after the hunter guy? Seems like I must have missed something.!&lt;\n\n&gt;!Also, when they find the drug lab, one of the agents find a bomb and it goes off, but the other two just ignore him? !&lt;",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pkcm6r/can_someone_please_explain_what_happened_in/"
    },
    {
        "id": "1pj49p1",
        "author": "AnotherDarnDay",
        "title": "What did I Just watch?",
        "content": "The sean combs doc. Now to be clear I've never been a fan of Diddy. My first memory of seeing him on TV was when he did the video with faith Evans as a tribute to Biggie. \n\nBut omg, that doc just sheds a lot of things. Like he \"allegedly\" had a part in Tupac and biggies deaths. And he wanted to throw biggie the biggest funeral, made it all about him and made biggies estate pay for the entire thing? How low can a person go. \n\nNot to mention, how stupid were those jurors? They dropped the ball completely. \n\nIts nice to know he likes his \"fans\" so much he needs to shower with peroxide after greeting them. \n\nHe's a vile person.\n\nWhat's your opinion of the doc or the person its about? \n\nOn the upside sting got richy rich from Diddy over that song. Sting earns two thousand dollars a day on it from what I understand. \n\n",
        "upvotes": 791,
        "comments": 206,
        "media": null,
        "permalink": "/r/netflix/comments/1pj49p1/what_did_i_just_watch/"
    },
    {
        "id": "1pjt9bt",
        "author": "Fun_Smile3175",
        "title": "What's your favorite Netflix movie?",
        "content": "I spend roughly three to four hours watching Netflix every day, but lately I can’t seem to find any content that’s particularly interesting—most of it feels boring to me. That’s why I want to see what everyone’s favorite movies are, to make my spare time more enjoyable!",
        "upvotes": 21,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1pjt9bt/whats_your_favorite_netflix_movie/"
    },
    {
        "id": "1pk5w17",
        "author": "Hefty-Job7049",
        "title": "I can watch Vikings with ads. Hooray. Comments on Death by Lightning and the Staitcase",
        "content": "             It's a series I've been wanting to watch for awhile. It used to be blocked. I would get a message that I had to upgrade to no commercials higher priced tier. I was in Netflix yesterday and I saw it on my recommendations and am now watching. Any other series worth watching that were previously blocked due to ads being shown? \n \n               Watched Death by Lightning. I thought the nomination convention scenes were fabulous with that incredible Garfield speech. So well done. Surprised they kind of glossed over the front porch campaign with just a scene with old black soldiers. I wanted more. I actually visited that historical house recently and learned about the front porch campaign. They would bring thousands in by train to hear Garfield. He always tailored his speeches due to the different groups of people that would come hear him. He was a savvy orator. Disappointed they didn't show this.\n\nStaircase.\nI can't believe how many episodes this was. After the trial I checked how many more episodes and couldn't belive how many more to go. I watched it all but have to admit I fast forwarded all the flashback scenes between the couple. Who knows what went on really between those 2 in private. I think he's guilty. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pk5w17/i_can_watch_vikings_with_ads_hooray_comments_on/"
    },
    {
        "id": "1pipz34",
        "author": "Beneficial-Anteater2",
        "title": "Netflix needs to add an “already watched” button",
        "content": "Hey guys, now that everyone has to get their own account and every tab is recommendations scroll, can we please add a button that lets us take it off the lists. I think its a good idea because We are paying for good service and seeing all these lists with stuff that I already watched makes me wanna use other streaming platforms. At least add a “watch again tab. ",
        "upvotes": 3281,
        "comments": 110,
        "media": null,
        "permalink": "/r/netflix/comments/1pipz34/netflix_needs_to_add_an_already_watched_button/"
    },
    {
        "id": "1pk81l8",
        "author": "MarzipanProper1225",
        "title": "Not part of household",
        "content": "Hey, I have been having trouble with my netflix account. \n\nI have an account for 4 screens. I shared my account with my friend and now I noticed she can log in and watch without ever needing to confirm her household. But me the one that pays has to everytime confirm my houdehold via email. Even my brother who I gave my account to has to confirm and send me an email.\n\nI want to change this so I get this main access. Does anyone know what to do? I changed my password and logged everyone out so I could log in first but no success. This is so annoying!\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pk81l8/not_part_of_household/"
    },
    {
        "id": "1pk7rg0",
        "author": "seidinove",
        "title": "Avatar: The Last Airbender: Season 2 - YouTube",
        "content": "Looks fabulous. Further erasing the bad taste of the movie.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pk7rg0/avatar_the_last_airbender_season_2_youtube/"
    },
    {
        "id": "1pk62lq",
        "author": "Glum_Significance345",
        "title": "High tides",
        "content": "Just finished bingeing High Tides on Netflix, and wow… Louise’s character has me reeling. I get that she’s dealing with bipolar disorder, and the show portrays how that affects her decisions and impulsivity, but some of her behavior feels so messed up.\nLike, one minute she’s calling Alex a loser and toxic (which, fair, he’s got his own issues), then he cheats on her by sleeping with her best friend… and somehow they end up in a threesome with Daan – the guy she says she’s in love with? How does that even happen? It just felt wildly inconsistent and kinda fucked up, even accounting for her mental health struggles.\nDid anyone else feel this way about Louise? Or am I being too harsh – does the bipolar portrayal explain it all? Curious what others think",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pk62lq/high_tides/"
    },
    {
        "id": "1pk50h4",
        "author": "Some-Astronomer-7040",
        "title": "Netflix Claims 'Star Search' Launched Conan O’Brien—History Disagrees - LateNighter",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pk50h4/netflix_claims_star_search_launched_conan/"
    },
    {
        "id": "1pk4w7a",
        "author": "rebekahinexile",
        "title": "Any military shows recommendations?",
        "content": "Hey guys! I’ve recently watched Boots and I really enjoyed it, so i was wondering if there were any similar military shows out there worth watching? I have a Hulu, Disney+, Netflix and Prime subscription! Thanks! ",
        "upvotes": 2,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1pk4w7a/any_military_shows_recommendations/"
    },
    {
        "id": "1pjjygl",
        "author": "jvincentsong",
        "title": "Simon Cowell: The Next Act",
        "content": "I watched Simon Cowell trying to compete with kpop boy bands. It was actually guide on how to not make a modern boyband to rival kpop. First, it was all about Simon Cowell. It was selfish as he sold himself over the actual members. Hybe’s hitmaker Bang wasn’t the focus of Dream Academy. Second, Simon doesn’t understand that kpop is a rigorous program. You can’t just wing it. For example, the boys had a staged meeting with the label CEO and they supposedly were nervous. It talked about how they were nervous and couldn’t banter because they didn’t know each other so well. In Dream Academy, most of the girls spent 2 years with each other and had media training. There is a reason why Katseye has so much chemistry. Simon didn’t do any research on why Hybe is successful. He is a dinosaur that is still stuck to live auditions. Two of Katseye’s members Lara and Manon were scouted online.\nThe last thing is December 10 doesn’t even have a single launching today. Katseye had a single that launched with Dream Academy. There is lack of strategy from a producer of supposed hit groups. Yet, I do see potential in one or two members. I can see that he is trying to replicate Harry styles again. It is such a pity that the boys are being used for his ego. Hope they get to release a single at least.",
        "upvotes": 22,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1pjjygl/simon_cowell_the_next_act/"
    },
    {
        "id": "1pk34id",
        "author": "newdivided",
        "title": "Netflix replaced upcoming movies/tv shows option with clips",
        "content": "Anyone else also have had this happen? This is insane, I don’t want to watch random movie clips and spoil movie scenes , I preferred having the upcoming movies/tv shows option since it allowed me to be on the look out for interesting things to watch rather than searching the entire Netflix catalog… \n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pk34id/netflix_replaced_upcoming_moviestv_shows_option/"
    },
    {
        "id": "1pk10q5",
        "author": "long_khan",
        "title": "Muvi users — does it actually hold up for Netflix-like streaming?",
        "content": "I’ve been testing [Muvi](http://www.muvi.com/) for a video project and wanted to hear from people who’ve actually used it. I know platforms like Netflix use OTT-style setups, and Muvi claims to offer something similar on a smaller scale, but I’m not sure how true that feels in real use.\n\nIt seems convenient since hosting, monetization, and the player are already handled, but I’m still unsure about long-term performance.\n\nIf you’ve used it:\n\nIs it reliable over time?\n\nHow does it handle regular live streaming?\n\nAny limitations or issues I should know about?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pk10q5/muvi_users_does_it_actually_hold_up_for/"
    },
    {
        "id": "1pk0xpv",
        "author": "VioletBanks0591",
        "title": "Netflix and AppleTV",
        "content": "Wanted to watch Netflix content on AppleTV. The content only had teasers. Netflix agent was not helpful. Since Netflix is also on my iPad I signed in there and saw download icon for the content I wanted to watch. Does anyone know why I have to watch the content on my iPad instead of my AppleTV? Thanks for your help.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pk0xpv/netflix_and_appletv/"
    },
    {
        "id": "1pjxu88",
        "author": "VanVeleca",
        "title": "So...is the Death Note Netflix Series still happening?",
        "content": "So all the way back in 2022 the guys who made Stranger Things announced that Netflix was working on a new project for Death Note (completely unrelated to the 2017 movie, to be clear)\n\nStranger Things recently finished, right? The final season is out...so is development on this secretive new DN series still happening or did it get quietly canned? They announced like 3 years ago and from the articles I've read it seems they were still just busy with scripting, maybe filming will finally happen next year???\n\nThen again they also say that they're working on two other projects and maybe even a spin-off to Stranger Things so I dunno.......\n\nHere are the articles btw just in case someone is reading this and thinks I'm talking out of my ass:\n\n[https://deadline.com/2022/07/stranger-things-duffer-brothers-netflix-upside-down-pictures-deal-spinoff-series-stephen-daldry-stage-play-manga-death-note-the-talisman-1235058665/](https://deadline.com/2022/07/stranger-things-duffer-brothers-netflix-upside-down-pictures-deal-spinoff-series-stephen-daldry-stage-play-manga-death-note-the-talisman-1235058665/)\n\n[https://deadline.com/2022/10/death-note-halia-abdel-meguid-series-adaptation-manga-netflix-duffer-bros-1235151144/](https://deadline.com/2022/10/death-note-halia-abdel-meguid-series-adaptation-manga-netflix-duffer-bros-1235151144/)\n\nMaybe I'm huffing huge amount of copium but I'm still on the side of \"It's still happening just slowly\", and I have several reasons for my hope:\n\n1. The Death Note anime is on Netflix now and available for world wide users, not just japan, the country specifics dubs aren't available everywhere but it's unusual for Netflix to release one show in so many regions anyhow (\\*that is not a Netflix original)\n2. A metric FUCK TON of merch released this year and there's still more announced to come out in 2026, maybe it's just because the anime is turning 20 years old but maybe also because behind the scenes they are working on some kind of new project, wheter it's this supposed new Netflix series or something completely different\n3. Killer Within and the social media accounts. Killer Within still has decent success and is still getting updates even after the initial hype died down around it, and many Death Note related official social media accounts have been active or have been revived ever since 2024, posting almost every day or every week.\n\nFinally, Death Note is still really damn popular even among new gen anime fans, it just kinda makes sense for it to be revived with a BIG project someday right?...I mean, they did try that in 2017 I guess. :P\n\nIf anyone has any sort of new information, I would appreciate hearing some kind of new info that I haven't stumbled on. Because after writing all this out, I feel like I'm having a Pepe Silvia moment.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pjxu88/sois_the_death_note_netflix_series_still_happening/"
    }
]