[
    {
        "id": "1mje7bo",
        "author": "WiredForChaosAMA",
        "title": "Howdy, r/movies! I’m documentarian Rex Miller. I’ve earned 2 Peabodys, several Emmys and 2 Oscar shortlists. Past films include Citizen Ashe, A Crime on the Bayou and The Rape of Recy Taylor. My latest, HARLEY FLANAGAN: WIRED FOR CHAOS, tells the story a punk/hardcore legend, Harley Flanagan. AMA!",
        "content": "Howdy, r/movies! I'm Rex Miller, director of HARLEY FLANAGAN: WIRED FOR CHAOS. Harley Flanagan founded the hardcore punk band the Cro-Mags. He is currently the bassist, vocalist, and sole remaining founding member of the band.\n\nTrailer: [https://www.youtube.com/watch?v=ojOfP12Glok](https://www.youtube.com/watch?v=ojOfP12Glok)\n\nFrom August 8-15, there will be a limited time digital event for HARLEY FLANAGAN: WIRED FOR CHAOS – it will be available online for viewing at either https://wiredforchaos.com or https://geni.us/WiredForChaosEvent; aside from the film, the online event also features a Cro-mags performance Live at Hellfest 2022 and the Opening Night post-screening Q&amp;A.\n\n**ABOUT WIRED FOR CHAOS:**\n\nFounder of the pioneering band Cro-Mags, Harley Flanagan is a punk rock/hardcore legend who’s defied the odds – along with neglect, sexual abuse, drugs, violence and PTSD -- and lived to tell the tale.  The feature-length documentary, HARLEY FLANAGAN: WIRED FOR CHAOS, dives headfirst into the wild life and times of this larger-than-life icon and is a no-holds-barred ride, that isn’t just about the music; it’s about a man forged in fire who’s lived to tell the tale. \n\nRaised by a Warhol Factory “it” girl, Harley was thrown into the Lower East Side’s underground scene in the ’70s. Left to fend for himself, by his teens, he was squatting in Alphabet City, stealing food, dodging gangs, and living in a world that he describes as “some serious Lord of the Flies shit.” But, as his life descended into a hellish day-to-day, he was simultaneously becoming a punk rock legend: at the age of 11, he was drumming at CBGBs and Max’s Kansas City with his aunt’s band, the Stimulators. Sex, drugs and rock ’n’ roll weren’t a choice – they were survival.   But Harley was a fighter. Whether on stage, in the streets, or in the Jiu-Jitsu gym with Renzo Gracie, he never backed down. As the ferocious frontman of the Cro-Mags, he pushed NYC Hardcore into uncharted territory. But violence, addiction and a traumatic past left deep scars. The streets made him, but they also nearly destroyed him.\n\nDirected and Produced by Emmy and Peabody Award-winner Rex Miller (Citizen Ashe) for Rexpix Media, and produced by Laura Lee Flanagan, Elisabeth Haviland James and Rex Miller, HARLEY FLANAGAN: WIRED FOR CHAOS, WIRED FOR CHAOS dives deep into Harley’s past, but it’s not just war stories. It’s about what happens after. Friends like Flea, Henry Rollins, Ice T, Roger Miret, Keith Morris, Michael Imperioli, Matt Serra, Jocko Willink, Darryl Jenifer, Glenn Danzig, Brooke Smith, Marcia Resnick, Kate Schellenbach and the late Anthony Bourdain reveal the man behind the legend – confronting demons, raising a family, and sharing the knowledge of his experience to help others.  Harley Flanagan didn’t just live hardcore – he is hardcore, and WIRED FOR CHAOS is his story – loud, unfiltered, and real as hell\n\n**REX MILLER BIO:**\n\nFilmmaker Rex Miller's documentary career spans more than twenty five years. He recently directed (with Sam Pollard) the film Citizen Ashe (CNN Films), which premiered at Telluride and won Best Documentary at both the 2022 Critics Choice and Grierson Awards and was nominated for a Sports Emmy for Best Feature Doc. Miller was a frequent collaborator of Nancy Buirski’s, shooting six of her movies before her untimely death in 2023. His work has aired on Netflix, American Masters/PBS, American Experience, Starz, ESPN, Hulu, Apple TV and played many high profiles festivals including Sundance, Tribeca, Telluride, Venice, New York Film Festival, London Film festival, SxSW and DOCNYC.\n\nAsk me anything! Back at 4 PM ET tomorrow (Thursday 8/7) to answer your questions.",
        "upvotes": 43,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pax3zqzt9ghf1.png?auto=webp&amp;s=b17e15f31bd845ee3b26d7b254bd41b9363c20da"
        },
        "permalink": "/r/movies/comments/1mje7bo/howdy_rmovies_im_documentarian_rex_miller_ive/"
    },
    {
        "id": "1mjn25b",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Paul Walter Hauser - Friday 8/8 at 1:30 PM ET - Actor in 'Richard Jewell', 'Americana', 'Black Bird', 'The Naked Gun', 'The Fantastic Four: First Steps', 'I Tonya', 'It's Always Sunny In Philadelphia', 'BlacKkKlansman', 'Inside Out 2', 'Cobra Kai', and lots more.",
        "content": "",
        "upvotes": 70,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rydu3s2y3ihf1.png?auto=webp&amp;s=764117549d53546cd1ba64f11a9f79dcbe57d21b"
        },
        "permalink": "/r/movies/comments/1mjn25b/amaqa_announcement_paul_walter_hauser_friday_88/"
    },
    {
        "id": "1mjk7dh",
        "author": "MarvelsGrantMan136",
        "title": "AMC Theatres Looks To Shorten Ad Preshow Following Studios’ Ire",
        "content": "",
        "upvotes": 5941,
        "comments": 871,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/et6TD1PZfbmBo3DxXjnWBze8zZTlwJC6wQykA8YZxBk.jpeg?auto=webp&amp;s=f2c13e1aea20f310e2af95d31e24b8752fdd4c04"
        },
        "permalink": "/r/movies/comments/1mjk7dh/amc_theatres_looks_to_shorten_ad_preshow/"
    },
    {
        "id": "1mj3qei",
        "author": "LowCarbScares",
        "title": "Behold, a landmark achievement for stunts and pyrotechnics. This is the first time in Hollywood history any stuntman was fully engulfed in flames for a scene!!! (The Thing From Another World, 1951)",
        "content": "The full body burn is credited to stuntman and actor Tom Steele! I have no idea how nobody died or got hurt doing this scene. It looks far more dangerous and insane than most fire stunts since then. Like they really did just throw buckets of gasoline at a stuntman while he is already engulfed in flames thrashing about the set",
        "upvotes": 9967,
        "comments": 302,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/et3m5uxzaehf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1mj3qei/behold_a_landmark_achievement_for_stunts_and/"
    },
    {
        "id": "1mj8tod",
        "author": "apple_kicks",
        "title": "Universal Pictures to Big Tech: We'll Sue If You Steal Movies For AI",
        "content": "",
        "upvotes": 4487,
        "comments": 256,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p0Fi-6hCwt1r8DcDUMfdabi-L_z4zsGj1R0Glozhff8.jpeg?auto=webp&amp;s=5686fa7b45fbfb5d489405cb631081299fa54b9e"
        },
        "permalink": "/r/movies/comments/1mj8tod/universal_pictures_to_big_tech_well_sue_if_you/"
    },
    {
        "id": "1mj6zk8",
        "author": "MarvelsGrantMan136",
        "title": "HIM | Official Trailer",
        "content": "",
        "upvotes": 4211,
        "comments": 818,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ssYRRVXFYehCQDjTw3X86ZO_rUptMNuS7PMC_lPTxiQ.jpeg?auto=webp&amp;s=b770e4f49403f4436509863138b4347a5e6b65c8"
        },
        "permalink": "/r/movies/comments/1mj6zk8/him_official_trailer/"
    },
    {
        "id": "1mjf2kj",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Dave Bautista and Bobby Cannavale in 'Trap House' - In El Paso, Texas, an undercover DEA agent (Bautista) and his partner embark on a game of cat and mouse with their own teenage children, who are using their parents' tactics and intel to rob a dangerous cartel.",
        "content": "",
        "upvotes": 1375,
        "comments": 138,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/80tmotysgghf1.jpeg?auto=webp&amp;s=ed012d842ce91ec3adf9ad4f54c0e8746b86243a"
        },
        "permalink": "/r/movies/comments/1mjf2kj/first_image_of_dave_bautista_and_bobby_cannavale/"
    },
    {
        "id": "1mjqu4o",
        "author": "soozerain",
        "title": "Rachel Weisz’s drunk acting in The Mummy is top notch.",
        "content": "It’s low-hanging fruit to make a post about the movie here but I just rewatched it after a decade plus and it stood out to me. She’s alternately charming, vulnerable and defiant during the course of the scene and her monologue is delivered perfectly 👌 \n\n“I….am a LIBR*Aaa*RIAN!”\n\nThe way she kinda draws out the middle part of that word is priceless. You can see the exact moment Rick falls in love with her. Brendan Fraser gives this bemused, but slightly dazed smile which I feel represents almost every guy in the audience too lol",
        "upvotes": 264,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1mjqu4o/rachel_weiszs_drunk_acting_in_the_mummy_is_top/"
    },
    {
        "id": "1mjm62m",
        "author": "Sonia341",
        "title": "‘The Long Walk’ Rated “R” for Strong Bloody Violence and Grisly Images",
        "content": "",
        "upvotes": 475,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0sBao8jmgXYLDZXrPvQa-560_ktekewP8P-WPTiK_Fk.jpeg?auto=webp&amp;s=2733c73a6913f0c1e1f24e26dcf64fbb1c11fb1c"
        },
        "permalink": "/r/movies/comments/1mjm62m/the_long_walk_rated_r_for_strong_bloody_violence/"
    },
    {
        "id": "1mj798u",
        "author": "MarvelsGrantMan136",
        "title": "New Posters for 'HIM' - A legendary quarterback (Marlon Wayans) is tasked with training a rising young athlete (Tyriq Withers) who goes to train at the aging athlete’s isolated compound.",
        "content": "",
        "upvotes": 2845,
        "comments": 290,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z3wxsjih0fhf1.jpeg?auto=webp&amp;s=79bd6323495b412e5d67948775a53cf616a77354"
        },
        "permalink": "/r/movies/comments/1mj798u/new_posters_for_him_a_legendary_quarterback/"
    },
    {
        "id": "1mjm7o8",
        "author": "DiaDeLosMuebles",
        "title": "Going into \"Companion\" blind and why I refuse to watch trailers",
        "content": "WARNING: MAJOR Companion Spoilers ahead\n\n\n\nI'm one of those people who refuse to watch trailers.  It annoys the hell out of my wife.  But anyway, I knew nothing at all about the movie Companion other than Jack Quaid and the poster.  Which had a girl with white eyes.  No idea why.\n\n\\*Spoilers\\*\n\nI'm watching it, and I see this dude's girl get shit on by his friends and then almost raped and she has to kill to protect herself.  Then people rush to help the rapist. And I'm like \"wtf?\".  Then, he shuts her down and my jaw hit the floor.  I had no idea she was a robot and they did such a good job hiding it until then.  \n\nFast forward and, then I learn that it was on purpose and that this is actually a murder/heist. Second turn I didn't see coming. \n\nAfter watching the movie I decided to see if the trailer spoiled anything.  And. I guess it's hard to market a robot murder movie without a robot in the trailer.  But the reveal in the movie was amazing. And then they show the millions in cash and spoil the heist part too!  \n\nAnyway, I really enjoyed the experience of watching the movie and it kills me that anybody who saw the trailer wouldn't experience the same movie I did. ",
        "upvotes": 182,
        "comments": 86,
        "media": null,
        "permalink": "/r/movies/comments/1mjm7o8/going_into_companion_blind_and_why_i_refuse_to/"
    },
    {
        "id": "1mj7xad",
        "author": "MarvelsGrantMan136",
        "title": "Aubrey Plaza to Star as Heidi Fleiss in Upcoming Biopic From Pinky Promise",
        "content": "",
        "upvotes": 928,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1gniVGc5q7FlPITZyTHamoHHuPuO6_Fgf11tyFh2Olc.jpeg?auto=webp&amp;s=f5892014978dca73e58785d3a4f82e7c05c25b47"
        },
        "permalink": "/r/movies/comments/1mj7xad/aubrey_plaza_to_star_as_heidi_fleiss_in_upcoming/"
    },
    {
        "id": "1mj408c",
        "author": "NoCulture3505",
        "title": "If I Had Legs I'd Kick You | Official Trailer HD | A24",
        "content": "",
        "upvotes": 1567,
        "comments": 217,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AYbaw0giOwbGnwXATKG3dqyMtUyZfBx6tD0pG1GE60Y.jpeg?auto=webp&amp;s=21f248112e38f6d6e1d321e67be2ebaf65a01ac4"
        },
        "permalink": "/r/movies/comments/1mj408c/if_i_had_legs_id_kick_you_official_trailer_hd_a24/"
    },
    {
        "id": "1mjc4hy",
        "author": "girafa",
        "title": "What's a good romantic movie where the protagonist doesn't get the girl/guy?",
        "content": "Friend of mine and I were talking, she said she loves romantic movies where they end up alone at the end. \n\nCould be that they don't end up together because a partner dies, they don't match in their personalities, the Nazis are chasing them, etc. Doesn't matter. Just the main character ends up alone. \n\nWhat's the first thing that comes to mind?",
        "upvotes": 513,
        "comments": 747,
        "media": null,
        "permalink": "/r/movies/comments/1mjc4hy/whats_a_good_romantic_movie_where_the_protagonist/"
    },
    {
        "id": "1mj7y0m",
        "author": "AggravatingLeg5789",
        "title": "Paul Walter Hauser on his 'psychotic' year and four massive films",
        "content": "Americana was just one of these things where I read it and I thought, \"Well, this could be the next somebody as far as auteurs or people that everyone gets excited about.\" The way they did with Shane Black and Quentin Tarantino and Diablo Cody. I thought, \"This is a voice, this is a brain working in concert with voice, and this is someone who loves storytelling in cinema.\" You could just tell right on the page. So I was ecstatic to get to be any part in that film. And it just so happens the way he cast it, I would randomly text Tony Tost and be like, \"Hey, what about so-and-so for this or that?\" I do that with everything I act in, whether I produce or not. I'm always just giving ideas and trying to be helpful. And Tony knew exactly who he wanted for every role. And he was really dogged about knowing what he knew and sticking to his vision. And then when I saw the movie, I was like, \"Oh my God, he got great performances out of everyone.\" There's no weak link in the bunch. It's a film that is so dependent upon the writing and the actors, you know? We don't have any big budget-y stuff to throw at you. So it really had to work, and like I've been saying in all my press, I think it's the best movie I've ever been a part of. I really, really do.",
        "upvotes": 654,
        "comments": 87,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Uh7P-fnVvmz2k4jXdGpj8yZ39P_NuOQAnfba6He6-6E.jpeg?auto=webp&amp;s=212361e27508549e3c4b5e5ca5779c880ad4c2d3"
        },
        "permalink": "/r/movies/comments/1mj7y0m/paul_walter_hauser_on_his_psychotic_year_and_four/"
    },
    {
        "id": "1mjaxhq",
        "author": "indiewire",
        "title": "‘Pee-wee’s Big Adventure’ at 40: Tim Burton and More on Paul Reubens, Ditched Sequels, and Creating a Pop Culture Classic",
        "content": "",
        "upvotes": 332,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PNEQYifM08gFiXK1gofWv11VadgHp0_a3KQVuQxqj2w.jpeg?auto=webp&amp;s=605a3621c9fe8a0f29c6f4e40d2cac5ba4238439"
        },
        "permalink": "/r/movies/comments/1mjaxhq/peewees_big_adventure_at_40_tim_burton_and_more/"
    },
    {
        "id": "1miugdx",
        "author": "UniverslBoxOfficeGuy",
        "title": "Poster for 'The Glassworker'",
        "content": "",
        "upvotes": 3156,
        "comments": 314,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/31cro0i2nbhf1.jpeg?auto=webp&amp;s=db923cc471b669d0734cb7e4d9a12c2c11efd810"
        },
        "permalink": "/r/movies/comments/1miugdx/poster_for_the_glassworker/"
    },
    {
        "id": "1mjt47f",
        "author": "MonhollenMizzell",
        "title": "Which minor character in a movie deserved their own spin-off and why?",
        "content": "In many movies, some minor or background characters catch our attention more than the main leads. Sometimes they have untold stories or unique personalities that we never get to explore fully. Is there any minor character from a film you watched who you think absolutely deserved their own spin-off movie? Who are they, and what kind of story or genre do you imagine would fit their character best? Feel free to share your favorite overlooked characters and why their stories should be told!",
        "upvotes": 21,
        "comments": 32,
        "media": null,
        "permalink": "/r/movies/comments/1mjt47f/which_minor_character_in_a_movie_deserved_their/"
    },
    {
        "id": "1mjjsq0",
        "author": "Lastdabapollo",
        "title": "Chris Tucker returning for Friday 4",
        "content": "[https://www.youtube.com/watch?v=qrCdcIjfoyU](https://www.youtube.com/watch?v=qrCdcIjfoyU)\n\nThis is an interesting one. Friend of the DJ Vlad Pod Faizon Love announced that Big Worm is returning. Also, Smokey's back! No word if Money Mike is returning. Will be called \"This Friday\", not \"Last Friday. Click the link above. ",
        "upvotes": 74,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XsPp1wGZE5GaoY5gleSjvRz0YjZofzPaaEyUpFkTLu8.jpeg?auto=webp&amp;s=5c0970c0a55dbc4c2c170d1edee781953dade7d9"
        },
        "permalink": "/r/movies/comments/1mjjsq0/chris_tucker_returning_for_friday_4/"
    },
    {
        "id": "1mj41fe",
        "author": "Comic_Book_Reader",
        "title": "COLD STORAGE - Official Teaser Trailer [4K] starring Liam Neeson, Joe Keery | STUDIOCANAL",
        "content": "&gt;Starring Joe Keery, Georgina Campbell and Liam Neeson - coming to cinemas soon. \n\n&gt;When a highly contagious, mutating fungus escapes a sealed facility, two young employees, joined by a grizzled bioterror operative, must survive the wildest night shift ever to save humanity from extinction, as the microorganism spreads and destroys everything in its path. \n\n&gt;Starring Joe Keery (Stranger Things), Georgina Campbell (Barbarian), and Liam Neeson (Naked Gun). From the producer of Zombieland and the screenwriter of Jurassic Park, Spider-Man, and Mission: Impossible, COLD STORAGE is an action-packed thrill ride and pure popcorn fun. ",
        "upvotes": 441,
        "comments": 95,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4I1JfVvP5A40Qj-ClDCBhp5SJ-KcN3JoL4IEK2A6KE8.jpeg?auto=webp&amp;s=bf923c5b8e02599107126c7757c0c9439a306396"
        },
        "permalink": "/r/movies/comments/1mj41fe/cold_storage_official_teaser_trailer_4k_starring/"
    },
    {
        "id": "1mjp4ja",
        "author": "logical_blabber",
        "title": "Lesser known science fiction movies please",
        "content": "Hey\n\nLooking for some of the lesser known gems in science fiction genre. I love such movies and would like to explore, otherwise box office duds (may be). \n\nOne of my all time favorite is the man from earth. A lesser known movie but it just worked. \n\nHave seen popular ones like intersteller, matrix, inception etc. \n\n\n",
        "upvotes": 30,
        "comments": 192,
        "media": null,
        "permalink": "/r/movies/comments/1mjp4ja/lesser_known_science_fiction_movies_please/"
    },
    {
        "id": "1mj8yg2",
        "author": "NoCulture3505",
        "title": "The Cut | Official Trailer",
        "content": "",
        "upvotes": 220,
        "comments": 94,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QEtQM5m_McDZvp9ATkdJ-1t8gXUTlYNrlOlf4pZ-BK0.jpeg?auto=webp&amp;s=cad9f185a2966682f69819d79b5d8e3281d9547c"
        },
        "permalink": "/r/movies/comments/1mj8yg2/the_cut_official_trailer/"
    },
    {
        "id": "1mjd8bc",
        "author": "indiewire",
        "title": "Gregg Araki's 'Mysterious Skin' 4K Restoration Set for Academy Museum",
        "content": "",
        "upvotes": 110,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UEiCW75mgP8rWn5BY8NGEQ5FB06nQsFtAnLMVavd7T0.jpeg?auto=webp&amp;s=f5f63834a0bc9b764a3ef5d2c0b00b156ff206c2"
        },
        "permalink": "/r/movies/comments/1mjd8bc/gregg_arakis_mysterious_skin_4k_restoration_set/"
    },
    {
        "id": "1mime4r",
        "author": "MarvelsGrantMan136",
        "title": "‘Star Wars: Starfighter’: Matt Smith Lands Villain Role In New Lucasfilm Pic Starring Ryan Gosling",
        "content": "",
        "upvotes": 5759,
        "comments": 630,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/T3BKSZ9Fu6spSG6MablhI89bSAuzlyMOuaq3g5j2ACM.jpeg?auto=webp&amp;s=d02bfcedeb330aaf92eed700eb468e441a0973a4"
        },
        "permalink": "/r/movies/comments/1mime4r/star_wars_starfighter_matt_smith_lands_villain/"
    },
    {
        "id": "1mjlq6g",
        "author": "Diakia",
        "title": "Goodbye, Dragon Inn (2003) is probably the most inexplicably moving experience I've ever had with a film",
        "content": "As a former cinema employee who found solace in those lonely midnight closing shifts, watching the last stragglers slowly leave the last film and doing the final cleaning before going home at 1am, and a current cinema goer who finds solace in near empty late night screenings with the company of a few other passionate cinema goers, this movie was a revelation.\n\nI never expected to see an experience that has always felt so deeply personal to me captured so flawlessly on screen, and seeing that empty theatre shot and watching the two employees do their final duties made me feel quite emotional as it made me reflect not just on the way I used to feel cleaning those final screenings and doing the final candy bar checks, but the period of my life back then too and how far I've come from then.\n\nTsai Ming-liang has such a way at inhabiting the spaces that he films, this is my second film from him after last year's Abiding Nowhere and I definitely plan on continuing to work my way through his filmography as I've been thoroughly impressed so far with the emotions that he's able to squeeze out of his lingering shots and perfectly framed scenes that I could stare at forever.\n\nGoodbye, Dragon Inn is a film for anyone who appreciates the experience of going to the cinema as much as the movie they're seeing itself and the way that it hints at this once great cinema's heyday in amongst the reality of its run down, decrepit interior, standing in for Tsai Ming-liang's perspective on the dwindling appreciation of the experience of cinemagoing itself as illustrated by the film's final conversation, this was truly a delight and a one of a kind experience for me.\n\nWhat do you guys think of it? ",
        "upvotes": 29,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1mjlq6g/goodbye_dragon_inn_2003_is_probably_the_most/"
    },
    {
        "id": "1mjgse1",
        "author": "Impressive-Yogurt-19",
        "title": "What’s your favourite movie soundtrack?",
        "content": "Either a specific piece or a whole movie in general. (Not songs, but i will make a post specifically for that) But i’m a big sucker for movie soundtracks lol. My favourite one specifically is Hans Zimmer’s “stampede” from the Lion King. The 2019 version is even better. The whole movie in general has great music. And i also really love Lorne Balfe’s Mission Impossible Fallout and Dead Reckoning scores🔥\n\nEdit: let me also add my favourite emotional one. Bryan Tyler’s “an unlikely outcome” from the movie “the greatest game ever played.”💙",
        "upvotes": 55,
        "comments": 258,
        "media": null,
        "permalink": "/r/movies/comments/1mjgse1/whats_your_favourite_movie_soundtrack/"
    },
    {
        "id": "1mimken",
        "author": "NoCulture3505",
        "title": "New Poster for “Waltzing with Brando”",
        "content": "",
        "upvotes": 3421,
        "comments": 311,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ct61wk7dv9hf1.jpeg?auto=webp&amp;s=e5deff04f466866682c23c595f438f0fadbddea2"
        },
        "permalink": "/r/movies/comments/1mimken/new_poster_for_waltzing_with_brando/"
    },
    {
        "id": "1mj98i5",
        "author": "Sisiwakanamaru",
        "title": "Adulthood | Official Trailer | In select theatres on September 19 &amp; On Digital September 23",
        "content": "When siblings Megan and Noah uncover a long-buried corpse in their parents’ basement, they stumble into a wildly escalating spiral of crime, cover-ups, and murder. The deeper they dig, the harder it becomes to escape.\n\nFeaturing: Josh Gad, Kaya Scodelario, Billie Lourd, Alex Winter, Anthony Carrigan, &amp; more!",
        "upvotes": 90,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XRCkVrTv5IlQeTS84fTiZ9VBK6AioA1AYZhR1ZOO0O8.jpeg?auto=webp&amp;s=7a6f4148f647f29ddab925c320890d61d601155a"
        },
        "permalink": "/r/movies/comments/1mj98i5/adulthood_official_trailer_in_select_theatres_on/"
    },
    {
        "id": "1miq3cr",
        "author": "MoviesMod",
        "title": "Actress Kelley Mack Dies at 33 of Cancer - She was known for her roles on 'The Walking Dead', 'Chicago Med', and as Hailee Steinfeld's Gwen Stacey Voice Double In 'Spider-Man: Into the Spider-Verse'",
        "content": "",
        "upvotes": 1705,
        "comments": 85,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ffmELvr0s4mJWH842BQFE2hqin0FbUxcs9ak9xpAhcU.jpeg?auto=webp&amp;s=fc837cd5a64fc63a73b137d8561d29a88f9b9d53"
        },
        "permalink": "/r/movies/comments/1miq3cr/actress_kelley_mack_dies_at_33_of_cancer_she_was/"
    },
    {
        "id": "1mjl2hi",
        "author": "verissimoallan",
        "title": "A Nightmare on Elm Street 7-Movie 4K Collection I Official Trailer I Releasing September 30!",
        "content": "",
        "upvotes": 23,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0kls1fwoPM96SG5yX-f5N24m4H7FtIfPpTQw7PGvc_U.jpeg?auto=webp&amp;s=aacaabc8701585cadb61068484e7585d1c8a7be8"
        },
        "permalink": "/r/movies/comments/1mjl2hi/a_nightmare_on_elm_street_7movie_4k_collection_i/"
    },
    {
        "id": "1mjdd7n",
        "author": "muaazmuaaz123",
        "title": "Just finished watching lord of the rings triology and it was the best exp ever,",
        "content": "for starters the 3 of the movies are absoloutly amazing, it was like the sequel is even better then the last one. The setting, the plot, the cinematic, the fight scenes and the characters everything was really good about this movie and i watched the extended version of the movies\n\n  \nfrom the start there were 2 stories one was to destroy the ring and the other was to stop sauraun from invading the armies. and the film really well balance the both plots \n\ni really liked the characters too my fav is Aragon, Sam, Frodo, Merry, poppin, Gandalf, gimli, legolas so yeh i pretty much liked every character.\n\n  \nThe battle scenes were nice to watch too and we can clearly see who is hitting who and what is happening\n\n  \nnow the triology is one of my most fav triologies ever after completing it. ofc the film is long like really long but it is worth it we got to see lots of stuff like background stories, battle scenes, characters interacting with others, i really like the dynamics between legolas and gimli how they count in battlefield how many they have killed\n\n  \noverall this triology is GOATED",
        "upvotes": 50,
        "comments": 62,
        "media": null,
        "permalink": "/r/movies/comments/1mjdd7n/just_finished_watching_lord_of_the_rings_triology/"
    },
    {
        "id": "1mjr35a",
        "author": "renegadeyouth__",
        "title": "LMAO I've Never Seen Natural Born Killers Before - Tommy Lee Looks/Sounds Absolutely ABSURD Here &amp; I Love It Haha.",
        "content": "THE RANDOM CUT TO HIM LAUGHING LIKE A MADMAN IS SUCH A EASY GUT-BUSTER FOR ME HAHAHA. WHOVILLE HAIR? THE PENCIL STACHE? Is this film a crime-thriller or a dark comedy? 😂😭 \n",
        "upvotes": 4,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/iygRRWEsx_Qd42S-NSPPYHn_K_QwDG_ExprtTIX4dds.jpeg?auto=webp&amp;s=e6c47709628c93045fd96c8a6c2bfe6a0652c9c4"
        },
        "permalink": "/r/movies/comments/1mjr35a/lmao_ive_never_seen_natural_born_killers_before/"
    }
]