[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 4,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 53,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l4tn78",
        "author": "Safe-Conversation770",
        "title": "Shows similar to Dept Q",
        "content": "As the title suggests, I am looking for recommendations for shows that have the same genre as Dept Q. I thoroughly enjoyed the series. Please help a girl out. ",
        "upvotes": 13,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1l4tn78/shows_similar_to_dept_q/"
    },
    {
        "id": "1l4rh3h",
        "author": "Blessed3000",
        "title": "STRAW Last scene",
        "content": "Just watched this very moving and sad movie by Tyler Perry. The last scene shows Janiyah in the bank with the bank manager, and finally the FBI have turned her phone back on. She receives a call from her mother who is at home and the FBI are with her. She proceeds to tell Janiyah that her daughter has passed away. \n\nThis is followed by a series of what I assumed were flashbacks, but could have been hallucinations showing that she went to the school (because they asked her to come in) but the teacher tells her they didn’t call her. She then turns to look for her daughter and the hallway is empty with no sign of her daughter. (Was that real or hallucination?!) \n\nAlso she turns to the bank manager to tell her the news, and the bank manager says she already knew because she had been informed earlier. \n\nSo my questions are; did Janiyah’s daughter die a while back, hence causing her break down and the narrative about the school calling her in/ lunch money etc was a hallucination? Was the bank manager just playing along when she agreed to look after her daughter (in the event that Janiyah goes to jail)? \n\nOr did Janiyah’s daughter actually die the night before the hold up at the bank, and losing her job etc etc…  and she was not aware until that moment? \n\nJaniyah also hallucinates that the FBI throw a bomb into the bank and surround her and shoot her to death. But then back in reality she walks out with the bank manager in a state of trauma. \n\nThoughts? :-) any other views … ? ",
        "upvotes": 7,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1l4rh3h/straw_last_scene/"
    },
    {
        "id": "1l4ssm1",
        "author": "servalshark",
        "title": "Looking for a show for me and my mom!",
        "content": "Hi! Hopefully it’s cool that I post here. I very much would appreciate some show recommendations for me and my mom. She has mandatory down time for the foreseeable future and I need to keep her occupied. I’m going to try to get her into some puzzles or arts and crafts, but I’d also like a good show for us to watch together!\n\nFor her: she likes…cooking, the show Survivor, home renovation/HGTV, The Boys (weird outlier there but I thought I’d mention lol), some romance movies. \n\nI can do pretty much anything. I just want her to be happy and actually enjoy it. \n\nI was thinking of getting her to watch Nailed It! because it’s fun, but I think she’d find it too cheesy. I’ll look into anything you recommend though! Please refrain from including anything too dark or related to illness. Thanks! ",
        "upvotes": 7,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1l4ssm1/looking_for_a_show_for_me_and_my_mom/"
    },
    {
        "id": "1l4i6xe",
        "author": "Merry_Little_Liberal",
        "title": "Tires Season 2 is FANTASTIC",
        "content": "I watched season 1, and enjoyed it, it was a 6/10 for me. \n\nI just binged the entire season 2, and I really enjoyed it. HUGE step up from season 1. \n\nThe character developments from Season 1 is fantasic. Kyla, Cal, Shane, Will, Dave,  new characters that will be main characters... really good development. \n\nBringing back side characters that were in Season 1 to reprise the role in season 2 was FANTASTIC. No Spoilers!!!  At least 3 primary side characters are back for season 2 with new side stories, like getting a \"Pontiac Bandit\" episode, I hope they continue it. \n\nReally good story development, already excited for Season 3. \n\n\nEpisodes had the same vibe as The Office jump from Season 1 to Season 2. \n\nIt is still very much \"guy humor\"... pussy jokes, and ragging on each other, sure.  But if you even remotely enjoyed Season 1, do not miss Season 2! \n\nI'm going 8.5/10! ",
        "upvotes": 41,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1l4i6xe/tires_season_2_is_fantastic/"
    },
    {
        "id": "1l4tgg9",
        "author": "theeleven1111",
        "title": "Finished Ginny and Georgia and so bored now. Any similar shows?",
        "content": "Whole package of teenage and adult drama, comedy, great music and colorful.\n\nPlease recommend some great shows and movies.  I loved the charector of Georgia ",
        "upvotes": 5,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1l4tgg9/finished_ginny_and_georgia_and_so_bored_now_any/"
    },
    {
        "id": "1l47nn4",
        "author": "Sea-Guest-1299",
        "title": "Jibaro — The Most Perfect Episode in Love, Death &amp; Robots (IMO)",
        "content": "I haven’t gotten around to watching Season 4 yet, but having seen everything up to Season 3, I genuinely believe Jibaro is the most perfect episode in the entire Love, Death &amp; Robots anthology.\n\nYes, I know that’s a bold claim considering the heavy competition — Bad Travelling, Beyond the Aquila Rift, Zima Blue, and The Witness are all incredible in their own right. Everyone has their personal favorites depending on what they value most: hard sci-fi, suspense, animation style, or raw emotion.\n\nBut Jibaro hits different. For me, it’s one of the best modern folklore interpretations ever put on screen. It tells a deeply compelling, emotionally charged story — without a single word of dialogue — and still manages to feel more complete and immersive than most dialogue-heavy shorts. The animation is chaotic in the best way, the sound design is absolutely haunting, and the symbolism runs deep.\n\nIt’s beautiful, brutal, tragic, and strangely mesmerizing — a true S+ tier episode in my book. A masterclass in visual storytelling.\n\nCurious to know — where does Jibaro rank in your list?",
        "upvotes": 131,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1l47nn4/jibaro_the_most_perfect_episode_in_love_death/"
    },
    {
        "id": "1l4x9rj",
        "author": "mariberries",
        "title": "Is Monsieur Spade worth watching?",
        "content": "After binging Dept Q, I went looking for a new detective show and saw Monsieur Spade is by the same writer, and stars Detective Sam Spade (classic detective from the Maltase Falcon). I only watched 1 ep, but this is really slow, much slower than Dept Q. So I am wondering for anyone that has watched it, is it worth it? Do you recommend?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l4x9rj/is_monsieur_spade_worth_watching/"
    },
    {
        "id": "1l4hwe8",
        "author": "Ollies_Mama22",
        "title": "Ginny &amp; Georgia",
        "content": "Anyone else think Georgia is a fucking narcissist? Like I know she has good intentions. And I know her childhood trauma and all the terrible shit she went through throughout her life affects the way she goes about certain things. But omfg she is such a narcissist. She throws out such blatant narcissistic comments. It’s everyone’s fault but her own. If she’s confronted for her poor behavior, she starts crying “oh I’m a bad mom” blah blah blah. She does it to make her kids feel bad for her so they stop bringing shit up. It’s ridiculous.",
        "upvotes": 13,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1l4hwe8/ginny_georgia/"
    },
    {
        "id": "1l4vi4d",
        "author": "asciikeyboard",
        "title": "Netflix App for MacBook",
        "content": "So am I the only one that would like to see Netflix on a MacBook? Pretty crazy to me that in 2025 weeks have AI, working robots yet no Netflix app for the MacBook. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l4vi4d/netflix_app_for_macbook/"
    },
    {
        "id": "1l4v7va",
        "author": "NextChard6264",
        "title": "BRIGHTNESS ISSUES I NEED HELP",
        "content": "OK so, i am having this issue in netflix where whenever I am watching a show, the brightness bar will be at full but the brightness will be very low. IF I manually drag the brightness bar down and back up, the brightness will be high for like a min before the brightness turns down again. Issue is that the brightness bar would still be at full and unless I am manually dragging the brightness bar down and back up again every min, the brightness remains low. \n\nThis issue is only happening on my phone, not on my laptop. The only thing I have really tried is seeing if I have my adaptive brightness off, which I do, and I can't figure out how to get rid of this CAUSE ITS ANNOYING AS SHIT. PLEASE HELP ME. \n\nP.S. my netflix used to work like normal until a few days ago and at this point I can't pin point what changed but please help.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l4v7va/brightness_issues_i_need_help/"
    },
    {
        "id": "1l4uulf",
        "author": "Cheap-Junket-5742",
        "title": "help",
        "content": "there was some deleted show on netflix about 2 kids where the parents were never shown, i think they were animals and there was a talking volcano and more stuff",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l4uulf/help/"
    },
    {
        "id": "1l3ujxm",
        "author": "Curious_Natural_1111",
        "title": "Dept Q should be renewed for season 2",
        "content": "They need to wrap up who was the Leith park shooter!!!\nJust finished watching it I need to see Morck working on more cases \n\nStarted off slow but was engrossing in afterwards episodes with barely any fillers.\nThe chemistry between actors were great, loved Akram and Martin.\n",
        "upvotes": 199,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1l3ujxm/dept_q_should_be_renewed_for_season_2/"
    },
    {
        "id": "1l4qifb",
        "author": "cloudmountainio",
        "title": "Straw",
        "content": "Just finished watching…. \n\nI genuinely didn’t see that twist coming 😭 \n\nI don’t usually cry at films but this is one of those rare occasions. \n\nWhat did everyone else think of the film? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l4qifb/straw/"
    },
    {
        "id": "1l4ox55",
        "author": "whenceareyou",
        "title": "Is Netflix content region standalone from platforms ?",
        "content": "I watch Netflix on my PS5. My PS account region is US, but I'm currently not in the US right now. Netflix shows content related to where I'm physically in although I downloaded the app from my PSN account (US). Maybe media apps content like YouTube, Netflix, Disney Plus has nothing to do with PSN region ?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l4ox55/is_netflix_content_region_standalone_from/"
    },
    {
        "id": "1l43rp4",
        "author": "AndreiRED0",
        "title": "I’m looking for some good Netflix recommendations",
        "content": "I’m looking for some good Netflix recommendations and thought I’d ask around before diving into another random binge. I usually love shows like Breaking Bad, Better Call Saul, and You.But I’m also in the mood to try something completely different like a hidden gem I wouldn’t normally go for. Maybe something lighter, more artistic, or just totally off my usual radar.So if you’ve seen anything lately that really stuck with you whether it’s similar to those gritty dramas or something fresh and unexpected i’d love to hear it! ",
        "upvotes": 20,
        "comments": 121,
        "media": null,
        "permalink": "/r/netflix/comments/1l43rp4/im_looking_for_some_good_netflix_recommendations/"
    },
    {
        "id": "1l4gl99",
        "author": "unorthodox_Nerd",
        "title": "Dolby Atmos issue",
        "content": "Is anyone else having issues playing back Dolby Atmos content lately? Content that has the badge for Dolby Atmos has been playing in 5.1 or Dolby digital on both my fire tv cube 3rd gen and Apple TV 4K. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l4gl99/dolby_atmos_issue/"
    },
    {
        "id": "1l4ml6v",
        "author": "uwuadi",
        "title": "Question regarding 4K",
        "content": "I saw someone say that 4K on Netflix isn’t actually 4K and it’s not worth paying for 4K. But the quality definitely looks better when a title is in 4K compared to when it’s not. I understand that it might not be true 4K but it’s still better than lower quality options no? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l4ml6v/question_regarding_4k/"
    },
    {
        "id": "1l4ivk4",
        "author": "NathLWX",
        "title": "The Fragrant Flower Blooms With Dignity | Official Trailer | Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l4ivk4/the_fragrant_flower_blooms_with_dignity_official/"
    },
    {
        "id": "1l3nfpt",
        "author": "SketchyFella_",
        "title": "I HATE the new layout...",
        "content": "I have been saying for YEARS that Netflix has the best layout of any streaming service and have been annoyed that other streaming services have an inferior layout. Now, Netflix seems to be copying other services rather than the other way around. Why? Does anyone here actually like seeing fewer options on the screen? When you go to your list, rather than seeing multiple rows of all the things you like to watch, not you have to scroll endlessly to make it through what used to be a single screen's worth of content info. I hate this.\n\nSeriously though, does anyone know why? Are there metrics that make this make sense?",
        "upvotes": 224,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1l3nfpt/i_hate_the_new_layout/"
    },
    {
        "id": "1l3z95u",
        "author": "bubbley_bear",
        "title": "Netflix says I’m nit a part of my own household?",
        "content": "This is why I hate the new same household rule. I’m in my home, on the same phone I made my account on and use all the time to watch Netflix on. I go to open it today and it says I’m not in my household and need to get a temporary access code to use my own account?? I haven’t shared the info with anybody and I’m not signed in on any other devices. It’s letting me use it now but is there anything I can do to make sure this doesn’t happen again?",
        "upvotes": 21,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1l3z95u/netflix_says_im_nit_a_part_of_my_own_household/"
    },
    {
        "id": "1l4a5ha",
        "author": "Idlicious",
        "title": "Best movies, series and shows to watch.",
        "content": "Looking for recommendations on what to watch on Netflix right now. I'm open to any genre, but I especially enjoy horror, psychological thrillers, mysteries, and anything with a dark or mind-bending twist. Bonus points if it's something underrated or less mainstream—I'm always down for hidden gems.  Would love to hear your favorite Netflix picks—movies, shows, limited series—anything that kept you hooked or messed with your head in a good way. Thanks in advance!",
        "upvotes": 6,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1l4a5ha/best_movies_series_and_shows_to_watch/"
    },
    {
        "id": "1l4sqwb",
        "author": "jerkoff1610",
        "title": "The top five Ginny scenes in Ginny and Georgia that made me pause, cringe and stare at the wall",
        "content": "Please, this is too funny! 😭😭😭😭This missed the scene where Ginny says, Please call me Ginny. That was so hard to watch. I missed cringing on Ginny and Hunter, can't wait to start season 3 lol. Are there any more cringe scenes?? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l4sqwb/the_top_five_ginny_scenes_in_ginny_and_georgia/"
    },
    {
        "id": "1l4o5q1",
        "author": "Cultural-Detective-3",
        "title": "Netflix sirens why did Peter like Simone?",
        "content": "Why did Peter like Simone? I never understood this they barely interacted. She was so young compared to him and had nothing in common? Is there something I missed? ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1l4o5q1/netflix_sirens_why_did_peter_like_simone/"
    },
    {
        "id": "1l4cb97",
        "author": "RubyFennex",
        "title": "animated show recommendations?",
        "content": "looking for some recommendations for animated shows I could watch! I've been watching a lot of live-action lately, so I'd like to switch it up.\n\nI prefer plot-driven shows over episodic ones, unless it's a new concept (e.g. midnight gospel). characters with flaws or complicated backstories are also important to me. \n\nanime is fine as well :&gt;\n\nI've already seennn:\n- digital circus (favorite thing ever--)\n- final space\n- anything sonic related\n- aggretsuko\n- arcane\n- she-ra\n- beastars\n- death note\n- inside job\n- bna\n- midnight gospel\n\naaand probably a few more I'm forgetting? \neither or, thanks in advance!! ",
        "upvotes": 2,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1l4cb97/animated_show_recommendations/"
    },
    {
        "id": "1l3vqux",
        "author": "Legitimate_Ad3625",
        "title": "Squid Game creator says he lost 2 more teeth making the final season: 'I haven't put them back in yet'",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l3vqux/squid_game_creator_says_he_lost_2_more_teeth/"
    },
    {
        "id": "1l4l1t3",
        "author": "Reasonable_Dingo7453",
        "title": "Sirens reviews? Sharp performance, click pacing and dry wit",
        "content": "Sirens pulls you in with sharp performances, slick pacing, and just the right mix of drama and dry wit. The plot doesn’t break new ground, but the characters more than make up for it. Binge-worthy in a day or two—expect tears, chuckles, and a solid weekend watch.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l4l1t3/sirens_reviews_sharp_performance_click_pacing_and/"
    },
    {
        "id": "1l4dvc9",
        "author": "B3gayandmerry",
        "title": "4 Seasons Show Thoughts for All Women",
        "content": "Women. Listen to me. We all deserve so much more than what the writers portrayed in the show. Anne did not deserve to live the rest of her life connected to her ex-husband's 32 year old girlfriend because before he died he got her pregnant. \n\nTina Fey's character did not deserve her husband being completely incapable of taking care of himself. \n\nNick's daughter did not deserve the half ass \"I love you\" from her dad who somehow had no idea why what he did was so wrong. \n\nMy god. I thought we were done with patriarchal influenced shows. \n\n1 star rating from me. The one star is for the gay couple cuz they were the only ones carrying anything good from that show. ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1l4dvc9/4_seasons_show_thoughts_for_all_women/"
    },
    {
        "id": "1l4dq72",
        "author": "Felix212365",
        "title": "i cant access family account",
        "content": "i know the e-mail and the password but the app says that the password is incorrect any solution? (i tried logging in again and again and still no works)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l4dq72/i_cant_access_family_account/"
    },
    {
        "id": "1l4awpf",
        "author": "elrineswag",
        "title": "Anyone have workaround for no casting?",
        "content": "I cant cast to my firestick from my phone with netflix. Has anyone found a workaround yet forit? Really sucks dude. \n\nJust adding more characters lol. Xxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l4awpf/anyone_have_workaround_for_no_casting/"
    },
    {
        "id": "1l4ixho",
        "author": "Unusual-Word-7607",
        "title": "Comments",
        "content": "I wish Netflix had a comment section like YouTube does. I mainly watch on my phone not my tv. I don’t really care how that would work on a tv. But it would be cool. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l4ixho/comments/"
    }
]