[
    {
        "id": "1lpvbzw",
        "author": "HeadsOfStateAMA",
        "title": "Hello r/movies! Ilya Naishuller here. I'm the director of Hardcore Henry, Nobody and vocalist/guitarist in the indie rock band Biting Elbows. My new movie, Heads of State (starring John Cena, Idris Elba, Priyanka Chopra Jonas and Jack Quaid), is hitting Amazon Prime today. AMA!",
        "content": "Hello r/movies! Ilya Naishuller here. I'm the director of Hardcore Henry, Nobody and vocalist/guitarist in the indie rock band Biting Elbows. My new movie, Heads of State (starring John Cena, Idris Elba, Priyanka Chopra Jonas and Jack Quaid), is hitting Amazon Prime today. AMA! \n\nHere's the trailer:\n\n[https://www.youtube.com/watch?v=8J646zM7UM8](https://www.youtube.com/watch?v=8J646zM7UM8)\n\nSynopsis:\n\nU.S. President Will Derringer and British Prime Minister Sam Clarke have a not-so-friendly and very public rivalry. However, when Air Force One gets shot down over enemy territory, they find themselves on the run and working together to thwart a global conspiracy that threatens the entire free world.  \nIt'll be streaming on Prime Video starting today.\n\nI'll be back at 3 PM ET today to answer your questions. AMA!",
        "upvotes": 298,
        "comments": 230,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o11cg0exlgaf1.png?auto=webp&amp;s=8127f9e4902b626ab117320d5e30dfc440c5f212"
        },
        "permalink": "/r/movies/comments/1lpvbzw/hello_rmovies_ilya_naishuller_here_im_the/"
    },
    {
        "id": "1lr61a7",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Jurassic World Rebirth / Heads of State / The Old Guard 2 / Ice Road: Vengeance) plus throwback discussions!",
        "content": "**New In Theaters**:\n\n* [Jurassic World Rebirth](https://old.reddit.com/r/movies/comments/1lqdtaw/official_discussion_jurassic_world_rebirth/)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [The Perfect Storm](https://old.reddit.com/r/movies/comments/1lr5yfc/official_throwback_discussion_the_perfect_storm/?)\n* [The Patriot](https://old.reddit.com/r/movies/comments/1lr5ygy/official_throwback_discussion_the_patriot_spoilers/?)\n* [The Adventures of Rocky &amp; Bullwinkle](https://old.reddit.com/r/movies/comments/1lr5yi5/official_throwback_discussion_the_adventures_of/?)\n\n**Still In Theaters**:\n\n* [F1: The Movie](https://old.reddit.com/r/movies/comments/1lli8lz/official_discussion_f1_the_movie_spoilers/?)\n* [M3GAN 2.0](https://old.reddit.com/r/movies/comments/1lli8nm/official_discussion_m3gan_20_spoilers/?)\n* [28 Years Later](https://www.reddit.com/r/movies/comments/1lfsc91/official_discussion_28_years_later_spoilers/)\n* [Elio](https://www.reddit.com/r/movies/comments/1lfscb2/official_discussion_elio_spoilers/)\n* [The Life of Chuck](https://www.reddit.com/r/movies/comments/1la4c8g/official_discussion_the_life_of_chuck/)\n* [Materialists](https://www.reddit.com/r/movies/comments/1la4c8n/official_discussion_materialists/)\n* [How to Train Your Dragon](https://www.reddit.com/r/movies/comments/1la4c8v/official_discussion_how_to_train_your_dragon/)\n* [From the World of John Wick: Ballerina](https://old.reddit.com/r/movies/comments/1l4gwpn/official_discussion_from_the_world_of_john_wick/?)\n* [The Phoenecian Scheme](https://old.reddit.com/r/movies/comments/1l4gwrc/official_discussion_the_phoenecian_scheme_spoilers/?)\n\n\n**New On Streaming:**\n\n* [Heads of State](https://old.reddit.com/r/movies/comments/1lr5yb4/official_discussion_heads_of_state_spoilers/?)\n* [The Old Guard 2](https://old.reddit.com/r/movies/comments/1lr5ycn/official_discussion_the_old_guard_2_spoilers/?)\n* [Ice Road: Vengeance](https://old.reddit.com/r/movies/comments/1lr5ye1/official_discussion_ice_road_vengeance_spoilers/?)\n* [KPop Demon Hunters](https://www.reddit.com/r/movies/comments/1lghony/official_discussion_kpop_demon_hunters_spoilers/)\n* [Echo Valley](https://www.reddit.com/r/movies/comments/1lar0eb/official_discussion_echo_valley/) \n* [Deep Cover](https://www.reddit.com/r/movies/comments/1lar0ej/official_discussion_deep_cover/)",
        "upvotes": 32,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1lr61a7/official_discussion_megathread_jurassic_world/"
    },
    {
        "id": "1lscso8",
        "author": "Drag-Upbeat",
        "title": "In Interstellar, why does Cooper seem deeply connected to his daughter Murph, yet shows noticeably less concern for his son Tom? Is there a deeper reason behind this emotional imbalance?",
        "content": "\"It’s ironic that in Interstellar, Cooper appears more emotionally invested in Murph, even though Tom is the one who consistently reaches out to him through video messages. \n\n\n\nTom stays loyal to the family, takes care of the farm, looks after their grandfather, and tries to preserve their way of life.\n\n\n\n Meanwhile, Murph, although brilliant, comes off as more self-centered—she cuts off communication for years and rarely even asks about her father.\n\n\n\n It’s as if the film romanticizes Murph's intellect and rebellion, while overlooking Tom’s quiet dedication and emotional resilience.\"",
        "upvotes": 2967,
        "comments": 564,
        "media": null,
        "permalink": "/r/movies/comments/1lscso8/in_interstellar_why_does_cooper_seem_deeply/"
    },
    {
        "id": "1ls8ww0",
        "author": "CrimsonKing1029",
        "title": "What's a scene in a film that is literally laugh until you cry funny?",
        "content": "Personally, I'd have to go with the hotel scene from Borat. It still gets me every time. There are many scenes from that movie one could choose, but that one really takes the cake. \n\nI'm having trouble remembering other scenes from a movie that are painfully funny. As a kid I always laughed at the news scene from Bruce Almighty. \n\nI'd love to hear your pick! \n\nEdit: Well, I certainly wasn't expecting this to blow up. Thanks everyone for your comments. There's a lot to watch!",
        "upvotes": 5074,
        "comments": 5347,
        "media": null,
        "permalink": "/r/movies/comments/1ls8ww0/whats_a_scene_in_a_film_that_is_literally_laugh/"
    },
    {
        "id": "1lslo3r",
        "author": "CockForAsclepius",
        "title": "Movies Elevated by One Scene",
        "content": "The “I Lied to You” sequence in Sinners is one of the most surprising and transcendent things I’ve ever seen in a film. I keep rewatching it, and the reaction videos for it are great, too.\n\nSinners without it would still be great, but having it elevates the film into something else — a qualitative jump.\n\nAre there films for you that are similarly elevated by one amazing, even iconic scene?",
        "upvotes": 630,
        "comments": 569,
        "media": null,
        "permalink": "/r/movies/comments/1lslo3r/movies_elevated_by_one_scene/"
    },
    {
        "id": "1lsgeel",
        "author": "DamnThatsInsaneLol",
        "title": "Michael Madsen’s Brooding Charisma Needed Quentin Tarantino To Unlock It",
        "content": "",
        "upvotes": 1279,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/b0u9jOW3kNJxwrovFe4vsrcFkMSoa1xMGpONNXXkyxc.jpeg?auto=webp&amp;s=ab30902ad53fde233f71c9a40c7ae797cf13772c"
        },
        "permalink": "/r/movies/comments/1lsgeel/michael_madsens_brooding_charisma_needed_quentin/"
    },
    {
        "id": "1lsakki",
        "author": "BunyipPouch",
        "title": "First Poster for Dystopian-Thriller 'The School Duel' - Starring Oscar Nunez ('The Office') and Kelsey Darragh - Set in near-future Florida, schoolchildren are recruited to take part in a deadly, statewide competition known as “The School Duel”, in order to try to curb the rise of school shootings.",
        "content": "",
        "upvotes": 2019,
        "comments": 262,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/aw47xl70b2bf1.jpeg?auto=webp&amp;s=4e30ea29e022e8d3ca3bd145f681df4ddec195e8"
        },
        "permalink": "/r/movies/comments/1lsakki/first_poster_for_dystopianthriller_the_school/"
    },
    {
        "id": "1lsn3y9",
        "author": "Bootlebat",
        "title": "What's a plot hole (or something similar) from a movie that always really bothered you?",
        "content": "Here's a couple for me:\n\nStar Wars: How people in the Original Trilogy seem to think the Jedi were just a myth, even though they existed for thousands of years prior, and weren't wiped out until 20 years before, meaning there would be plenty of people still alive who had interacted with them. I've heard people suggest the Empire did a 1984-esque campaign to make people forget, but I'm just not buying it. It would be like if some evil dictator wiped out all Hindus, and 20 years later most people thought Hindus never existed, even though there would undoubtedly be people who had Hindu friends and acquaintances still around.\n\nSigns: How water is like acid to the aliens. You know, water, that liquid that covers three quarters of the planet? Imagine if you were looking for a planet to settle on, and found one that was three quarters covered in sulfuric acid, ,where it frequently rains acid, and where the inhabitants are mostly made of sulfuric acid. Do you try to colonize that planet? ",
        "upvotes": 283,
        "comments": 599,
        "media": null,
        "permalink": "/r/movies/comments/1lsn3y9/whats_a_plot_hole_or_something_similar_from_a/"
    },
    {
        "id": "1lsr3c4",
        "author": "Sebastian-dB",
        "title": "In Shark Tale (2004) the rich neighborhood is \"the top of the reef\" but it should it be the opposite.",
        "content": "The top of the reef is considered the rich neighborhood where all the successful fish live, but the first scene in the movie shows that the whole city goes into shutdown when sharks are swimming above the city, and there's no real protection or defense against the sharks.\n\nThe existence of this threat means that naturally the lower areas of the reef which are under more dense concentrations of coral reef would provide the most optimal protection against the main threat in the movie,\n\nLiving in the area with the only natural protection against the biggest threats in their city should clearly have the highest priced real estate and be occupied by the most wealthy inhabitants, but for some reason it's the complete opposite, the richest/most successful live at the top of the reef which is the most exposed to sharks and carries the highest risk of being killed.",
        "upvotes": 118,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1lsr3c4/in_shark_tale_2004_the_rich_neighborhood_is_the/"
    },
    {
        "id": "1lskbxe",
        "author": "MonkeyPunchBaby",
        "title": "What’s the latest you’ve seen a movie drop its title card?",
        "content": "I watched Mandy earlier today and the title card didn’t show up until around the hour fifteen mark. Which really surprised me. I know the Mission Inpossible movies pop up late as well, like 20-30 mins in.\n\nWhat are some other movies that pull this move and delay the title card for as long as possible? \n\n**EDIT** I’m asking about movies that put the title during the movie not at the end. ",
        "upvotes": 309,
        "comments": 167,
        "media": null,
        "permalink": "/r/movies/comments/1lskbxe/whats_the_latest_youve_seen_a_movie_drop_its/"
    },
    {
        "id": "1lshtrn",
        "author": "Vegetable_Star8931",
        "title": "Which movie completely surprised you — in a good way?",
        "content": "You ever go into a movie with low or no expectations and walk out totally blown away?  \nFor me, it was *Edge of Tomorrow*. I thought it’d be another forgettable sci-fi action flick, but it turned out to be clever, funny, and super rewatchable.\n\nWhat’s a movie that totally surprised you like that? Could be old or new — just curious to hear which ones caught you off guard in the best way.",
        "upvotes": 415,
        "comments": 507,
        "media": null,
        "permalink": "/r/movies/comments/1lshtrn/which_movie_completely_surprised_you_in_a_good_way/"
    },
    {
        "id": "1lsw512",
        "author": "ChiefLeef22",
        "title": "The LA Philharmonic performs the ‘JAWS’ score live alongside the film at the Hollywood Bowl.",
        "content": "",
        "upvotes": 29,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ixvw1g7lq7bf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1lsw512/the_la_philharmonic_performs_the_jaws_score_live/"
    },
    {
        "id": "1lsp5e9",
        "author": "hipsternativity",
        "title": "Anatomy of a Fall just fucked me up",
        "content": "I love a slow-moving, impeccably acted character/relationship study, so this was right up my alley. Yes, the court scenes are infuriating. And they are effective at highlighting the great risk of assuming context. I loved this movie. Would love to know your thoughts/reactions/theories of the film as well! ",
        "upvotes": 102,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1lsp5e9/anatomy_of_a_fall_just_fucked_me_up/"
    },
    {
        "id": "1lsvrcm",
        "author": "Briggykins",
        "title": "The real Salt Path: how a blockbuster book and film were spun from lies, deceit, and deception",
        "content": "",
        "upvotes": 29,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QL7ex6fDsRqQZo0o3KHJ0GsK39pZ-TkAALBAGi2s-oI.jpeg?auto=webp&amp;s=4114d6757426f02dc9fa70316659b50111716da3"
        },
        "permalink": "/r/movies/comments/1lsvrcm/the_real_salt_path_how_a_blockbuster_book_and/"
    },
    {
        "id": "1lsarcx",
        "author": "Ironyfree_annie",
        "title": "Spinal Tap defined a real genre with a fake band",
        "content": "",
        "upvotes": 493,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Yd2tH1NPcmKhOKW7ZYCfz9GK17q5b3XMJut8XnrZD88.jpeg?auto=webp&amp;s=e57309711c6e448f4d0e32afa49ae325030a5059"
        },
        "permalink": "/r/movies/comments/1lsarcx/spinal_tap_defined_a_real_genre_with_a_fake_band/"
    },
    {
        "id": "1lrubj7",
        "author": "MarvelsGrantMan136",
        "title": "Julian McMahon Dies: ‘Nip/Tuck’, ‘Fantastic Four’, ‘FBI: Most Wanted’ Star Was 56",
        "content": "",
        "upvotes": 9836,
        "comments": 624,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/a3yNNo3WNdl_0Vd4Qr1mH0tDqj4A3lUssYNdKaBY-bo.jpeg?auto=webp&amp;s=73e79940241520131a78f4c27de99396fb957381"
        },
        "permalink": "/r/movies/comments/1lrubj7/julian_mcmahon_dies_niptuck_fantastic_four_fbi/"
    },
    {
        "id": "1lsbebx",
        "author": "WukongsStaff",
        "title": "The Good, The Bad, and The Ugly; why was Clint Eastwood's character \"The Good\"?",
        "content": "I'd argue his character was worse than Tuco, as he is the one who started the cycle of backstabbing. He intentionally sabotaged their scam, was the first to leave him dehydrated in the desert, then lies about the name (Tuco would've backstabbed him here regardless as he wasn't aware he lied, but he was still honest about the cemetery name).\n\nMost of Tuco's backstabbing's were in response to something Blondie did first, or after the cycle of trust had been broken. Is it because Clint Eastwood is cool?\n\nI actually found myself rooting for The Bad because he was an outside force.\n\nThe only good thing that Blondie did was show humanity to the dying soldier, The Bad similarly showed humanity to the guy he gave the alcohol to. I'd say none of them were better than the other.",
        "upvotes": 342,
        "comments": 157,
        "media": null,
        "permalink": "/r/movies/comments/1lsbebx/the_good_the_bad_and_the_ugly_why_was_clint/"
    },
    {
        "id": "1lrucv8",
        "author": "PokemonGoBao",
        "title": "Whats a flopped movie you wish was a financial success?",
        "content": "Dungeons and Dragons 2023 was an absolutely delightful film. You can stream it currently, but you  can feel the passion and nothing felt phoned in. They  easily  could have used the title to get nerdy butts in the seat and collect a paycheck with a smaller budget.\n\nIt's the best movie I've seen the past 2 years. Way better than so many garbage films with easy paychecks for slop productions. Beetlejuice, Captain america, and others using big titles to make millions on lazy writing and boring characters. ",
        "upvotes": 8240,
        "comments": 2170,
        "media": null,
        "permalink": "/r/movies/comments/1lrucv8/whats_a_flopped_movie_you_wish_was_a_financial/"
    },
    {
        "id": "1lst2g3",
        "author": "bintint",
        "title": "What makes a great horror ending?",
        "content": "Noticed a trend in the earlier post about “what horror films almost had it?”, a lot of the comments were about how the third act fell short. \n\nI’ve definitely felt this, too. A horror film with a great premise but they end up showing too much or seemingly tacking on an ending that ruins the vibe of the rest of the film.\n\nWhy do you think this is? And what horror films do you feel really stick the landing?",
        "upvotes": 22,
        "comments": 70,
        "media": null,
        "permalink": "/r/movies/comments/1lst2g3/what_makes_a_great_horror_ending/"
    },
    {
        "id": "1ls8c50",
        "author": "rugbyj",
        "title": "The StormPAR Subplot in Twisters (2024) Makes Absolutely No Sense",
        "content": "So it's revealed that StormPAR is tracking these tornados at the behest of a nefarious profiteer, Marshall Riggs, who is otherwise funding their science. He's using their knowledge of where a tornado has recently hit to go and buy up the survivor's land for cheap.  \n\n**Except that information is useless,** because everyone already knows if a town has been wiped out by a tornado, because it's immediately in the news. Shared on social media. Just _freely_ published in weather reporting data online.  \n\nSpending (presumably) tens of millions to know potentially minutes quicker is of absolutely no benefit. It's like hiring someone to let you know if your house has burned down, you'll already fucking know!  \n\n---  \n\n**Easy-fix**; change it so Marshall is funding StormPAR to predict where _future_ tornados are going to happen, allowing him to short companies with resources in the area (e.g. that oil refinery), or to buy up businesses _ahead_ of time, and slapping massive insurance policies on inflated associated assets. As soon as it becomes predictive (rather than reactive) it's an even better \"bad guy plot\" because it would mean they were potentially witholding that information from victims.",
        "upvotes": 382,
        "comments": 71,
        "media": null,
        "permalink": "/r/movies/comments/1ls8c50/the_stormpar_subplot_in_twisters_2024_makes/"
    },
    {
        "id": "1lsmsgj",
        "author": "coolhandjennie",
        "title": "Uncomplicated not-too-violent movies for someone going through a hard time",
        "content": "Cinephiles of Reddit, Gondor calls for aid! A dear friend is in the midst of a terrible situation and she’s looking for movies to numb out to at night. She’s a socially conscious stoner with a great sense of humor but dumb comedies aren’t really her thing. \n\nCriteria: “**minimal violence**, new or old, not too complicated”. Also **no death/tragedy, widows, widowers or orphans**. \n\nI’ve got a list going but I like a lot things she’s not into so I’m casting a wider net. Thanks in advance!\n",
        "upvotes": 48,
        "comments": 158,
        "media": null,
        "permalink": "/r/movies/comments/1lsmsgj/uncomplicated_nottooviolent_movies_for_someone/"
    },
    {
        "id": "1lskjyk",
        "author": "Mikeyboy101591",
        "title": "The Omega Man (1971)",
        "content": "Based on the book “I am Legend” by Richard Matheson “The Omega Man” is about Doctor Robert Neville (Charlton Heston) who is the only survivor of an apocalyptic Biological warfare. Neville believes he is the plague's only immune survivor. Struggling to maintain his sanity, he spends his days patrolling the now-desolate Los Angeles, hunting and killing members of \"the Family\", a cult of plague victims who were turned into homicidal nocturnal albino mutants. The Family blame science and technology for their condition and they see Neville, as the last symbol of science, therefore he must die. Neville, uses everything at his disposal in an attempt to survive with the help of Dutch (Paul Kosolo) and Lisa (Rosalind Cash) who he meets which he know he’s not alone. I really liked the film, Charlton Heston’s performance is good and his character has very good chemistry with Rosalind Cash. While The Family are not vampires, they look like druids and they are allergic to the light. Anthony Zerbe as Jonathan as the leader of The Family who wants to kill Neville. If you haven’t seen the film would recommend it.",
        "upvotes": 67,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1lskjyk/the_omega_man_1971/"
    },
    {
        "id": "1lrn5rq",
        "author": "MarvelsGrantMan136",
        "title": "‘Sinners’ Producer Says Costumes Were Purchased From Marvel’s ‘Blade’ Reboot That Ended Up Not Shooting",
        "content": "",
        "upvotes": 17747,
        "comments": 503,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VKDgUVPCTwm5EVgpTW2kxLc4KgRCPVZQ9aduq54EVmM.jpeg?auto=webp&amp;s=d60ddb03aacac7da856f46f49d1be5cd5e0d11ad"
        },
        "permalink": "/r/movies/comments/1lrn5rq/sinners_producer_says_costumes_were_purchased/"
    },
    {
        "id": "1lso72l",
        "author": "podoboq",
        "title": "Recommendations for Robot Movies?",
        "content": "I've been doing a self-imposed challenge this year. Every Monday, I watch a different Nicolas Cage film. I'm halfway through the year now, and I'm loving it! Forcing myself to watch a thing I otherwise might not ever touch has forced me out of my normal film taste, and having such a defined structure has been a way to keep myself going through it.\n\nWith that said, I want to do it again in 2026 with a new theme. Nicolas Cage has been a great subject, but has some limitations. A lot of his work can be pretty samey, and basically everything is feature-length. Sometimes finding an entire 90 minutes on a Monday is super difficult, and I want to give myself some leeway.\n\nSo I'm trying to do robots next year. Anything robots. I thought asking people here would be better than just googling and making a list on my own. All recommendations will go into a list on Letterboxd for myself so I can pick through it through the year.\n\nRequirements:\n\n⚪ The movie has to have a robot in it. It doesn't have to be a starring role. It can even just be one scene. But preferably, the robot would have some significance to the themes of the film.\n\n⚪ A robot can be a lot of different things, but it needs to have some sense of humanity. Blade Runner counts. Transformers counts. Even Interstellar counts. Sonic the Hedgehog (with the little drone robots) doesn't count.\n\n⚪ Short films and documentaries are a plus, to space out normal feature films.\n\n⚪ Bad movies are awesome! Like I said, I'm watching Nic Cage movies this year. My tolerance for bad movies is pretty high.\n\n⚪ It needs to have a Letterboxd entry. Sorry, that's just how I track my movie habits. If it's not on Letterboxd, I may still watch it, but it won't be part of this.\n\nSo, what do you recommend?",
        "upvotes": 31,
        "comments": 188,
        "media": null,
        "permalink": "/r/movies/comments/1lso72l/recommendations_for_robot_movies/"
    },
    {
        "id": "1lsdcbt",
        "author": "keepfighting90",
        "title": "Any fans of Promising Young Woman (2020)? A damn good dark comedy with a hell of an ending",
        "content": "Just watched Emerald Fennell's Promising Young Woman and loved it. I saw a lot of polarizing reviews of it on Reddit but honestly I really vibed with it. It's a revenge drama that goes out of its way to make the act of getting vengeance completely emotionally draining and traumatizing. Weaved into the narrative is a fair bit of important social commentary on rape culture and sexual assault.\n\nCarey Mulligan gives an absolutely fantastic performance, simultaneously funny, charming, badass, broken, traumatized and vulnerable. The casting in general is on-point, especially the movie's conscious decision to use well-known \"good guys\" to play rapists and rape enablers. \n\nThe climax of the movie is an absolute gut-punch and I can see why so many people hated it. It takes some major balls to kill off your righteous, justice-seeking protagonist in such a brutal, agonizing manner, by the de-facto villain of the story of all people. But it makes sense with the thematic intent of the movie, which is the old adage of digging 2 graves when seeking revenge. The actual ending of the movie does somewhat lessen the blow a little bit but it feels very much like a pyrrhic victory.\n\nHighly recommended for anyone looking for a well-made dark psychological drama.",
        "upvotes": 136,
        "comments": 54,
        "media": null,
        "permalink": "/r/movies/comments/1lsdcbt/any_fans_of_promising_young_woman_2020_a_damn/"
    },
    {
        "id": "1ls1hoc",
        "author": "ThatGatorInTheSewer",
        "title": "Movies that have A+ Exposition",
        "content": "Basically what the title says, what movies do you think handle exposition, especially in the first act, well? \n\nI’ll start: Die Hard. Absolute masterclass in introducing the protagonist and getting to his “story” quickly and naturally (his gun accidentally showing in the plane “Dont worry, I’m a police officer”, the dialogue in the limo ride with Argyle and the tense-ish, distant interaction with Holly when he first gets to Nakatomi Plaza). All feels very natural and handled well. ",
        "upvotes": 1124,
        "comments": 410,
        "media": null,
        "permalink": "/r/movies/comments/1ls1hoc/movies_that_have_a_exposition/"
    },
    {
        "id": "1lstgeu",
        "author": "beingzen01",
        "title": "Friendship - The Wife",
        "content": "Watched Friendship today and really liked it. Seeing some of the discussion, I kinda wish I had seen it in the theater. I'm traveling right now so watched it on my iPad. Think the experience of laughing out loud at some of the absurdity would've made it even more enjoyable. \n\nAnyway, one of my main takeaways was that the wife was a damn weirdo too!\n\nLike, you probably have to be a little off to be married to that guy, so it makes sense. But I think they did a really nice job showing that she was not a \"normal\" person either in a really subtle way. Between her quazi incestuous relationship with the son, to her casually mentioning her flowers and the underlying consciousness of the universe (something along those lines), to throwing herself a welcome home party after getting out of the sewer (lol what), to just kinda shrugging off her husband's totally insane behavior throughout the whole movie...\n\nI think I found her almost as interesting as the \"main\" characters. \n\nPaul Rudd was a weirdo too in his own way, but the wife was a little subtler.",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1lstgeu/friendship_the_wife/"
    },
    {
        "id": "1lslr0l",
        "author": "Gub_Gub_a_Dub_Dub",
        "title": "What's one movie that you could watch forever?",
        "content": "For me, this would have to go to pulp fiction(1994). This whole movie just has so much life to it, along with great acting, storytelling and some of the best dialogue ever. I could rewatch this movie forever. Another movie on this list for me would be snatch(2000) This movie feels a bit like pulp fiction, but with a bunch of differences that make it it's own and one of the best endings in any movie I've seen.",
        "upvotes": 37,
        "comments": 125,
        "media": null,
        "permalink": "/r/movies/comments/1lslr0l/whats_one_movie_that_you_could_watch_forever/"
    },
    {
        "id": "1lsgyle",
        "author": "Stryker412",
        "title": "Is there a better “that guy” character actor than Shea Whigham right now?",
        "content": "His profile is impressive at 104 credits but just look at the variety of roles he takes. I learned about him in Agent Carter and always enjoy when he pops up on screen. I was surprised to see him in F1 and only be in the movie for 5 minutes. He had a pretty big role in the last two Mission Impossible movies as well.  ",
        "upvotes": 76,
        "comments": 59,
        "media": null,
        "permalink": "/r/movies/comments/1lsgyle/is_there_a_better_that_guy_character_actor_than/"
    },
    {
        "id": "1lsf5oa",
        "author": "SwampThing72",
        "title": "What movie were you surprised to find had a mid credit or end credit scene?",
        "content": "I recently rewatched the first Hellboy with Ron Perlman and when the movie ended I just let the credits play as I was distracted by something else and hadn’t turned it off yet. I was surprised when a scene popped up that had Thomas Manning (Jeffrey Tambour’s character) talking into a radio asking if they forgot about him in the crypt. \n\nI’ve seen that movie a bunch of times and had no idea that was there! Any other movies like this?",
        "upvotes": 84,
        "comments": 114,
        "media": null,
        "permalink": "/r/movies/comments/1lsf5oa/what_movie_were_you_surprised_to_find_had_a_mid/"
    },
    {
        "id": "1lsvhsm",
        "author": "These_Feed_2616",
        "title": "Is there a reason that the Coen Brothers don’t work much anymore?",
        "content": "They were huge back in the day and made so many classic films like Blood Simple, Raising Arizona, Fargo, The Big Lebowski, No Country For Old Men etc. and I looked on Wikipedia, and their last film was in 2018 for Netflix, and their last huge hit was True Grit back in 2010, are they kind of semi retired as filmmakers now?",
        "upvotes": 4,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1lsvhsm/is_there_a_reason_that_the_coen_brothers_dont/"
    },
    {
        "id": "1lsgboi",
        "author": "Liquid_Son",
        "title": "The Sandlot and Stand by Me\nA great nostalgic/coming of age double feature",
        "content": "I won't go too deep into this, but I do want to know if anyone agrees or has any opinions about it. Both films are fun and adventurous movies about romanticizing boyhood and the nostalgic \"boys will be boys\" era. I love that both movies share the same kind of comparable narrator and the characters embellish the stories they tell in a very old-school kid way. My main point is that these movies feel very similar yet very different and I find them to be one of the best double feature viewings to have every handful of years.",
        "upvotes": 56,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1lsgboi/the_sandlot_and_stand_by_me_a_great/"
    }
]