[
    {
        "id": "1ham66n",
        "author": "SanderSo47",
        "title": "December 6-8 Box Office Recap: 'Moana 2' stayed on top of the box office, earning almost $600 million worldwide after just 2 weeks. The 'Interstellar' IMAX re-release earned $4.6 million from just 165 theaters. Meanwhile, A24's 'Y2K' flopped in ninth place with just $2.1 million.",
        "content": "https://preview.redd.it/qi1cxbn2ew5e1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=6e4ef17a901777c7190d7c99319350a23894bbf8\n\nThanks to the excellent performance last week, this was a fantastic post-Thanksgiving weekend at the box office. ***Moana 2*** broke the record for highest post-Thanksgiving weekend at the box office, while ***Wicked*** and ***Gladiator II*** continued their run. As is typical with the weekend, studios avoid releasing big stuff. The biggest push was A24's ***Y2K***, which delivered one of the worst debuts for a film playing in over 2,000 theaters. In contrast, the IMAX re-release of ***Interstellar*** fared much better in just 165 theaters.\n\nThe Top 10 earned a combined $128.1 million this weekend. That's up a colossal 115% from last year, when ***The Boy and the Heron*** opened in North America. It's the best post-Thanksgiving weekend in history.\n\nWithout any competition, ***Moana 2*** easily held the top spot with $51.2 million this weekend. That represents a 63% drop, which is a little steeper than usual for the post-Thanksgiving weekend. It's worse than ***Wish*** (61%), ***Frozen II*** (59%), ***Strange World*** (58%), ***Ralph Breaks the Internet*** (54%), ***Frozen*** (53%), ***Encanto*** (52%), and the original ***Moana*** (50%).\n\nThrough 12 days, the film has earned $299.3 million domestically, already eclipsing the original ***Moana***. For a comparison, it had a huge start over ***Inside Out 2***, but it's now running almost $60 million behind that through the same point. It should hit $500 million for the holidays, but the $600 million dream appears to be dead.\n\n***Wicked*** stayed at #2, dropping 55% and adding $36.4 million this weekend. That takes its domestic total to a fantastic $322.1 million, and it should finish with over $450 million.\n\n***Gladiator II*** dropped a rough 59%, adding $12.5 million this weekend. The film has earned $132.8 million so far, and it's gonna close with a little over $150 million unless the holidays surprise us.\n\nAmazon MGM's ***Red One*** dropped 45%, adding $7 million this weekend. That took its domestic total to $85.7 million. We'd like to say it will hit $100 million, but that's pretty much Joever; Amazon announced just today that the film will start streaming on Prime Video this Thursday. That's gonna kill legs.\n\nThe Indian film ***Pushpa 2: The Rule*** opened with $4.88 million in 1,245 theaters, which grows to $9.3 million in its first five days.\n\nParamount re-released Christopher Nolan's ***Interstellar*** in 165 IMAX theaters. It earned a huge $4.6 million in these locations, which translates to a $27K per-theater average. IMAX reported that the 10 screenings that ran the film on 70mm sold out. These numbers took its lifetime gross to $192.6 million.\n\nSony/Crunchyroll's ***Solo Leveling: ReAwakening*** earned $2.4 million from just $846 theaters. Not bad for a recap of the first season.\n\nFathom Events released the concert film ***For King + Country’s A Drummer Boy Christmas Live*** in 1,540 theaters, for a limited 4-day run. It finished in eighth place with $2.2 million ($2.8 million four-day).\n\nDebuting in ninth place, we find A24's ***Y2K***, which flopped with just $2.1 million in 2,108 theaters. That's a poor $1,003 per-theater average, suggesting a lot of empty screenings. It is the 33rd worst debut for a film in over 2,000 theaters. \n\nThis shouldn't be a big surprise to anyone. The film lacked big names, with the big emphasis on its writer and director, Kyle Mooney. Mooney is definitely well known for ***Saturday Night Live***, but like a lot of stars in the show, that doesn't mean people will flock to watch that star on the screen. Horror is a profitable genre, but the film is actually a horror comedy, making it a tougher sell. A24 takes a lot of risks, but it was clear that this would struggle. Since its SXSW premiere, reviews have been mixed, and they've been worsening (currently at 43% on RT), making it one of the worst titles of the studio. It's simply a film that couldn't find an audience.\n\nAccording to A24, 58% of the audience was male, and 77% was in the 18-34 demographic. They gave it an awful \"C–\" on CinemaScore, suggesting the film will fade quickly from theaters. A run under $5 million is a possibility, and the film could be gone from theaters by the time New Year arrives. Not the best years for Rachel Zegler, apparently.\n\nRounding up the Top 10 was Lionsgate's ***The Best Christmas Pageant Ever***. It fell 53%, adding $1.5 million this weekend and taking its total to $34.4 million.\n\nOutside the Top 10, we find ***Werewolves***, a horror action title with Frank Grillo. It hit 1,351 theaters, but it flopped with just $1 million this weekend. Don't expect it to last long.\n\nVertical also decided to release Justin Kurzel's ***The Order*** in 603 theaters, but it only made $878,000 this weekend. Ouch.\n\nA24 expanded Luca Guadagnino's ***Queer*** to 47 theaters. It added $405,910 this weekend, taking its run to $866K after 10 days. It will continue expanding.\n\nSearchlight didn't even bother with ***Nightbitch***. Not only did they dump it in 82 theaters, but they didn't release box office numbers. Le sigh.\n\n#**OVERSEAS**\n\n***Moana 2*** continued leading the box office after its record-breaking weekend. It added $103.7 million overseas, taking its worldwide numbers to $599 million. Its biggest debut was Japan, where it opened with $6.5 million. The best markets so far are France ($32.5M), UK ($27.2M), Germany ($19.7M), Mexico ($19.1M) and Brazil ($16M). A billion is imminent, but it looks like it will take a little while.\n\nWhile ***Wicked*** registering strong numbers domestically, it continues performing softly overseas. This weekend, it added $26.9 million, taking its worldwide total to $457.5 million. It had very soft debuts in France ($2M), Netherlands ($1.9M) and Poland ($900K). The best markets are the UK ($47.4M), Australia ($17.2M), South Korea ($10.6M), Mexico ($8.1M) and Spain ($4.5M). It will open in more markets, but it's not like it will suddenly explode. If it was performing on par with its domestic run, we'd say a billion is a possibility, but that's not the case here. 70% of its money is coming from the domestic market, which is crazy.\n\n***Gladiator II*** added $17 million this weekend, taking its worldwide total to $368.5 million. The film is slowing down, and while it will hit $400 million, it won't get much further than that. Far below the original's $460 million worldwide total.\n\n***The Lord of the Rings: The War of the Rohirrim*** opened in 31 markets, mostly Latin America, a week ahead of its worldwide rollout. To say that it performed badly would be an understatement. The film debuted with an awful $2 million. It had terrible starts in Spain ($347K), Mexico ($239K), Thailand ($146K), Brazil ($106K), and Czech Republic ($103K). Yep, not a single market over $1 million. This suggests the film is heading for very ugly numbers in the rest of the world.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Here* | Nov/1 | Sony | $4,875,195 | $12,227,851 | $13,295,076 | $50M\n\n- Wake up babe, new Zemeckis flop just dropped. After barely one month in theaters, Sony/Miramax's ***Here*** has closed with just $12 million domestically and $13 million worldwide. Despite touting the film as a ***Forrest Gump*** reunion (Zemeckis, Roth, Hanks and Wright), the audience was uninterested. In fact, the domestic total is barely half of what ***Forrest Gump*** earned on its opening weekend back in 1994, and that's not even adjusted. Oh, Robert Zemeckis, what happened to you? To say that his glory days have passed...\n\n#**THIS WEEKEND**\n\nFive films, two of which are hitting wide release. But none stand a chance in topping the box office.\n\nThe first is Sony's latest addition in the Spider-Manless Spider-Man Universe, ***Kraven the Hunter***. This universe has been mostly profitable, but it carries an asterisk. The three ***Venom*** films are hits, while the other two (***Morbius*** and ***Madame Web***) flopped and became Internet's laughingstock. ***Kraven*** is leaning towards the latter. And for reasons beyond understand, Sony decided that this film warranted $130 million, making it their most expensive SSU film. After this, who knows what'll happen.\n\nThe other wide release is Warner Bros.'s ***The Lord of the Rings: The War of the Rohirrim***, an anime prequel to Peter Jackson's trilogy. This franchise is one of the most powerful in film history... yet ***The War of the Rohirrim*** is not gonna come close anywhere close to that. Anime has a ceilling at the box office, and the pre-sales are insanely low. With a low screen count, limited marketing, and middling reviews so far, we'll see how low it can go.\n\nParamount is releasing ***September 5*** in limited release, before its wide release on January 17. The film recounts the 1972 Munich Olympic hostage crisis from the perspective of the ABC Sports crew and their coverage of the events. The film has received some solid reviews so far.\n\nAmazon MGM is releasing ***Nickel Boys*** in limited release. The story follows two African American boys, Elwood and Turner, who are sent to an abusive reform school called the Nickel Academy in 1960s Florida. The film has received critical acclaim, and there's Oscar buzz on the horizon. Watch out for this one.\n\nThe other one is Gia Coppola's ***The Last Showgirl***, starring Pamela Anderson. Reviews are very positive, with Anderson lauded for a career-best performance.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 93,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LNJvin7oo3yxu4QZUapb8ys0RuBR811ZMZom-4aowiU.png?auto=webp&amp;s=0071337a2f7a42d1f52fc9912cb33f9b3fe2a74a"
        },
        "permalink": "/r/movies/comments/1ham66n/december_68_box_office_recap_moana_2_stayed_on/"
    },
    {
        "id": "1h9u8kv",
        "author": "BunyipPouch",
        "title": "Join us Tuesday 12/10 at 3:00 PM ET for a live AMA/Q&amp;A with Alessandra Lacorazza and Lio Mehiel, writer/director and co-star of the two-time Independent Spirit Award nominee drama film 'In The Summers'",
        "content": "",
        "upvotes": 5,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pz1p5lbg7p5e1.jpeg?auto=webp&amp;s=3f3bec0d5756e03070829379cb96e25271a534fc"
        },
        "permalink": "/r/movies/comments/1h9u8kv/join_us_tuesday_1210_at_300_pm_et_for_a_live/"
    },
    {
        "id": "1han3vi",
        "author": "MarvelsGrantMan136",
        "title": "Chris Evans Sets Marvel Return in ‘Avengers: Doomsday’ ",
        "content": "",
        "upvotes": 8302,
        "comments": 1429,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BD23bifuRvsDd5MHWwX6kuKe1Ci9DI8uiWatMOd4vLY.jpg?auto=webp&amp;s=56fb54453250a96a9a00c7f0ff5d56dca73c54b1"
        },
        "permalink": "/r/movies/comments/1han3vi/chris_evans_sets_marvel_return_in_avengers/"
    },
    {
        "id": "1hawid8",
        "author": "cruelsummerbummer",
        "title": "28 YEARS LATER – Official Trailer",
        "content": "",
        "upvotes": 829,
        "comments": 336,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lzBUokLpTaxIBlJ8drFBuD8Vmd-k9Jf8B_UFh6tagbo.jpg?auto=webp&amp;s=39eae6ba4ebd46034972fe9173ce7cfd61891e02"
        },
        "permalink": "/r/movies/comments/1hawid8/28_years_later_official_trailer/"
    },
    {
        "id": "1hax8fk",
        "author": "DemiFiendRSA",
        "title": "New poster for ‘28 Years Later’",
        "content": "",
        "upvotes": 314,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mty469naez5e1.jpeg?auto=webp&amp;s=6c64b94215f5480d91c7d0b91920ff465c4f8a48"
        },
        "permalink": "/r/movies/comments/1hax8fk/new_poster_for_28_years_later/"
    },
    {
        "id": "1haml7v",
        "author": "MarvelsGrantMan136",
        "title": "‘The Mandalorian &amp; Grogu’ Adds Jeremy Allen White",
        "content": "",
        "upvotes": 1393,
        "comments": 223,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rzfuAqPn-ldax-GuVZtqTKxkmfGanZZpoit4k7vZlpg.jpg?auto=webp&amp;s=de79806b41c825f8af46f70ddd9120016c58a236"
        },
        "permalink": "/r/movies/comments/1haml7v/the_mandalorian_grogu_adds_jeremy_allen_white/"
    },
    {
        "id": "1hafy0p",
        "author": "MarvelsGrantMan136",
        "title": "The Next 'Evil Dead' Movie is Officially Titled 'Evil Dead Burn', Releasing in 2026",
        "content": "",
        "upvotes": 2935,
        "comments": 271,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yzc1XKeRwYaTQkuDjuRbM4hWZT_CPE_mXiPBdcgfU2U.jpg?auto=webp&amp;s=e76c664badbbbdaf5d5fd5d50050b1a69d6a3dce"
        },
        "permalink": "/r/movies/comments/1hafy0p/the_next_evil_dead_movie_is_officially_titled/"
    },
    {
        "id": "1haej8j",
        "author": "MarvelsGrantMan136",
        "title": "The Lord of the Rings: The War of the Rohirrim - Review Thread",
        "content": "**The Lord of the Rings: The War of the Rohirrim - Review Thread**\n\n* [Rotten Tomatoes](https://www.rottentomatoes.com/m/the_lord_of_the_rings_the_war_of_the_rohirrim): 65% (35 Reviews)\n* [Metacritic](https://www.metacritic.com/movie/the-lord-of-the-rings-the-war-of-the-rohirrim/): 59 (12 Reviews)\n\nReviews:\n\n[Deadline](https://deadline.com/2024/12/the-lord-of-the-rings-the-war-of-the-rohirrim-review-peter-jackson-company-attempt-return-183-years-earlier-tolkein-universe-japanese-anime-1236197887/):\n\n&gt;Although not hitting us emotionally on the scale of the live action films, Kamiyama has produced a visual landscape that at times , through use of motion capture, models, and hand drawn animation do register a striking visual motif, not what we have previously associated with the cinematic efforts at Tolkein, but a world of its own merged with more allegiance to Jackson than Tolkein.\n\n[Variety](https://variety.com/2024/film/reviews/the-lord-of-the-rings-the-war-of-the-rohirrim-review-1236243179/) (60):\n\n&gt;For those who can’t get enough of Middle Earth, here’s two-plus hours of deep-cut backstory to feed your appetite, centered around a siege at the stronghold that would come to be known as Helm’s Deep (where we saw Saruman’s Orcs obliterated by Ents in “The Two Towers”).\n\n[Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/the-lord-of-the-rings-the-war-of-the-rohirrim-review-1236075681/) (80):\n\n&gt;Fans are sure to appreciate the call-outs and references to the earlier movies, including sections incorporating composer Howard Shore’s original themes and a late shout-out to Gandalf. But those not familiar with Tolkien minutiae will still be able to enjoy *The War of the Rohirrim* on its own visually grand, mythic storytelling terms, even if it does eventually seem overlong at 134 minutes (brief by comparison to the live-action entries, but still).\n\n[IndieWire](https://www.hollywoodreporter.com/movies/movie-reviews/the-lord-of-the-rings-the-war-of-the-rohirrim-review-1236075681/) (C-):\n\n&gt;“The Lord of the Rings: The War of the Rohirrim” is a paper-thin prequel that stretches a single page of Tolkien’s appendices into a 134-minute story of how the fortress of Helm’s Deep got its name (spoiler alert: it was named after a guy named Helm), I suppose we should be grateful that this limp and cheap-looking epic is bad in a few different ways than we’ve come to expect? At least it *aspires* to mine a fresh experience from the all too familiar tedium of watching Hollywood pick a franchise dry, even if it ultimately falls well short of that goal.\n\n[Polygon](https://www.polygon.com/lord-of-the-rings/492608/war-of-the-rohirrim-movie-review-peter-jackson) (80):\n\n&gt;This attention to detail and reproduction is the movie’s greatest strength — The War of the Rohirrim looks and feels like Jackson’s LotR in the best way. It’s packed full of sword-swinging adventure, kingly drama and riveting monster mayhem. Unfortunately, it also reproduces the aspect of the Jackson movies that has aged most poorly.\n\n[TotalFilm](https://www.gamesradar.com/entertainment/lord-of-the-rings-movies/the-lord-of-the-rings-the-war-of-the-rohirrim-review/) (50):\n\n&gt;What could have been an exciting experiment in telling a new tale in a beloved universe in a very different way feels heavily compromised. Kenji Kamiyama and his fellow anime veterans have produced great work before, but this uninspired expansion of the most iconic screen take on Tolkien doesn't allow anyone to show off what they can do best.\n\n[SlashFilm](https://www.slashfilm.com/1730142/the-lord-of-the-rings-the-war-of-the-rohirrim-review/) (6/10):\n\n&gt;If this is just the first of many spin-offs to come, we can only hope future efforts learn all the right lessons from \"The War of the Rohirrim.\" So where does the franchise go from here? All I know is that it'd be a shame to let the riskiest \"The Lord of the Rings\" movie in years scare us right back to safer shores.\n\n[The Wrap](https://www.thewrap.com/lord-of-the-rings-war-of-the-rohirrim-review/):\n\n&gt;“The Lord of the Rings: The War of the Rohirrim” plays like a straight-to-video rush job that got a little out of hand, and now it has to play to a theatrical crowd that’s unlikely to forgive its many haphazard flaws. It’s hard to get mad at this movie, but it’s oh so easy to be disappointed.\n\n[Empire](https://www.empireonline.com/movies/reviews/the-lord-of-the-rings-the-war-of-the-rohirrim/) (3/5):\n\n&gt;It never scrapes the heights of Jackson’s trilogy — few do — but amid a messy meeting of worlds, there are stirring moments.\n\n[Collider](https://collider.com/the-lord-of-the-rings-the-war-of-the-rohirrim-review/) (6/10):\n\n&gt;The animated trip to Middle-earth is an unexpected journey, but its subpar story and underdeveloped characters make it difficult to revisit there and back again.\n\n[IGN](https://www.ign.com/articles/the-lord-of-the-rings-the-war-of-the-rohirrim-review) (6/10):\n\n&gt;The Lord of the Rings: The War of the Rohirrim is a fascinating idea with a lackluster execution, more interesting as a concept than an actual retelling of one of Middle-earth’s famous legends.\n\n\\--------\n\nDirected by Kenji Kamiyama\n\n&gt;Set 183 years before the events of the Peter Jackson's *The Lord of the Rings* film trilogy (2001–2003), *The War of the Rohirrim* tells the story of Helm Hammerhand, a legendary king of Rohan, and his family as they defend their kingdom against an army of Dunlendings. Helm goes on to be the namesake for the stronghold Helm's Deep.\n\nRelease Date: December 13",
        "upvotes": 2583,
        "comments": 548,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/W4dsLWzTaCA8Jou4JfXY7eZGXeGpok3vjiJbRpeSFcY.jpg?auto=webp&amp;s=2d9d5dd0fee3863f28d8a14dd6e24108e111983f"
        },
        "permalink": "/r/movies/comments/1haej8j/the_lord_of_the_rings_the_war_of_the_rohirrim/"
    },
    {
        "id": "1hawxdj",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Danny Boyle’s ‘28 Years Later’",
        "content": "",
        "upvotes": 122,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fsstyo46az5e1.jpeg?auto=webp&amp;s=c2c5ec3c503488ec790636005fd498a1fd4fb2ac"
        },
        "permalink": "/r/movies/comments/1hawxdj/new_poster_for_danny_boyles_28_years_later/"
    },
    {
        "id": "1hapg94",
        "author": "Sisiwakanamaru",
        "title": "Lucy Hale 'F*** Marry Kill' Appears On PVOD, Then Disappears: Here's Why",
        "content": "&gt; Apparently, the R-rated Laura Murphy-directed title originally was scheduled for a December 6 drop, and fans were expecting it. But the release date changed a few weeks ago, and that message clearly didn’t get through to the PVOD platforms, hence the glitch\n\n&gt; Lionsgate isn’t burying or short-changing the movie, which is coming out via its theatrical day-and-date release label Lionsgate Premiere Releasing. The release-date change is an effort to align the movie with its international roll\\out in March. We’re told that a recent screening, the filmmaker announced to attendees that they could expect to see F*** Marry Kill in March.",
        "upvotes": 385,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/csp-aI1hWsbTNxo5vDG23q-vvO3n0Mqvwo8W-G-F1ig.jpg?auto=webp&amp;s=357a40a5afb5f47cee35ecfccfde7d05f3dd5478"
        },
        "permalink": "/r/movies/comments/1hapg94/lucy_hale_f_marry_kill_appears_on_pvod_then/"
    },
    {
        "id": "1ha6ixy",
        "author": "Bleus4",
        "title": "Dame Judi Dench turns 90 years old: Her regrets, first role and life stories",
        "content": "",
        "upvotes": 5004,
        "comments": 97,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gh5Jc4hpEUNJ9jeVa56MnwsTrtGhp5JD2Z4hgxdVkt0.jpg?auto=webp&amp;s=5e7df0d04f21a6922e5efd8846261580cc10fdda"
        },
        "permalink": "/r/movies/comments/1ha6ixy/dame_judi_dench_turns_90_years_old_her_regrets/"
    },
    {
        "id": "1hadp6f",
        "author": "KillerCroc1234567",
        "title": "‘Final Destination 6’ Sets Summer Release Date, J.J. Abrams-Produced ‘Flowervale Street’ Delayed to 2026",
        "content": "",
        "upvotes": 633,
        "comments": 95,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dsifleSEIDH4Cdp1cjXDCHp7jz2sbGa1Vr49qDaZBUk.jpg?auto=webp&amp;s=0151a28f132b50046f406c50a24e55c3000b8a26"
        },
        "permalink": "/r/movies/comments/1hadp6f/final_destination_6_sets_summer_release_date_jj/"
    },
    {
        "id": "1ha9swy",
        "author": "NoCulture3505",
        "title": "Golden Globes Nominations Announced",
        "content": "",
        "upvotes": 548,
        "comments": 505,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mZ6eaAoT5Er3NsRUFBwVMddMHvyFHq5S9HEdJ3Hxhlw.jpg?auto=webp&amp;s=dfc259610204f4caee430ecf54dc53bee21a5a9c"
        },
        "permalink": "/r/movies/comments/1ha9swy/golden_globes_nominations_announced/"
    },
    {
        "id": "1hahccu",
        "author": "heraclitus33",
        "title": "Most blatant product placement",
        "content": "I'm rewatching The Island (2005) and the product placement is so over the top its laughable. From michelob ultra, to the amex clear blue card, to cadillac. I'm remembering it was around this time that movies were going full tilt no shame with their product placement and the backlash that came from it. Its obviously always there but I just found this movie to be pretty ridiculous with it. Got any others?",
        "upvotes": 193,
        "comments": 417,
        "media": null,
        "permalink": "/r/movies/comments/1hahccu/most_blatant_product_placement/"
    },
    {
        "id": "1ha8rxs",
        "author": "KillerCroc1234567",
        "title": "Michael Mann Gives Update on ‘Heat 2’",
        "content": "",
        "upvotes": 611,
        "comments": 229,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hgXRSvMpux0CMPPrlhDkLg8uum2fcmJlD6BMxjSXx0U.jpg?auto=webp&amp;s=59f91e1132c245d29e735e4fb22a4cdb009acda7"
        },
        "permalink": "/r/movies/comments/1ha8rxs/michael_mann_gives_update_on_heat_2/"
    },
    {
        "id": "1haon3k",
        "author": "Willing-Raisin-9869",
        "title": "I have a question about “The substance” I seriously don’t this one thing. ",
        "content": "If you haven’t noticed - spoiler ahead .\n\nSo when Elisabeth (Demi) is told about substance she is advise “you are one” with your other self, so I was watching the movie as if her consciousness has been transferred into Sue, however later in the movie I realised Elisabeth has no recollection of what Sue does when she was watching the interview on tv she was shocked and livid and clearly hearing it for the first time. Sue is also shocked to find the mess in the apartment that Elisabeth left behind her, so she has no recollection of Elisabeth’s experiences. . So Sue is basically a clone of Elisabeth. \n\nBut then we also see Elisabeth run into the older version of guy nurse with hand mark, and he talks to her as if he himself met her with recollection of their meeting, so in that case it’s clearly not a clone. So my question is which is it? Why do Elisabeth/Sue actually do seem separate while the other guy isn’t? But the bigger question is if you are Elisabeth, you don’t actually get to experience being young again, you go to sleep for a week wasting away, why would anyone want to just clone themselves and keep going when they don’t get anything out of it?! It just doesn’t make sense. Is there a reasonable explanation within this movie’s universe that I’m just not getting ? ",
        "upvotes": 72,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1haon3k/i_have_a_question_about_the_substance_i_seriously/"
    },
    {
        "id": "1haqx1d",
        "author": "WorldsBestWrestling",
        "title": "Hellboy: The Crooked Man is better than I expected",
        "content": "I'm a fan of Brian Taylor and I love the Hellboy character, but I expected this to be a complete disaster after it got buried during its release. Honestly, it isn't a great movie, but it's completely watchable in a just-above-Sci-Fi-Original sort of way. I appreciated that they made a sincere attempt to make a southern gothic-flavored folk horror film, and some of the atmosphere is effectively spooky. However, the CGI is pretty bad and it's pretty clear that most of what we're seeing is fake, which drags it down. \n\nDespite me finding it passable enough, I'm really worried that this is the future of Hellboy in live action. There are countless Hellboy stories that could be adapted into good low budget horror movies, but this franchise will probably end up like the DTV era of Hellraiser where they make a movie every few years just to retain the rights. The character isn't much of a box office draw either, which is a shame as the comics are excellent. ",
        "upvotes": 47,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1haqx1d/hellboy_the_crooked_man_is_better_than_i_expected/"
    },
    {
        "id": "1harbwz",
        "author": "jtuck2003",
        "title": "Can we talk about what an impressive supporting actor run Ed Harris had from 1995-2001",
        "content": "He had so many good roles in such a short amount of time...\n\nNixon (1995)\n\nApollo 13 (1995)\n\nThe Rock (1996)\n\nAbsolute Power (1997)\n\nThe Truman Show (1998)\n\nStepmom (1998)\n\nPollack (2000)\n\nA Beautiful Mind (2001)\n\nEnemy at the Gates (2001)\n\n\nWhat other supporting actors have been in so many hits in a 5-6 year span?",
        "upvotes": 47,
        "comments": 48,
        "media": null,
        "permalink": "/r/movies/comments/1harbwz/can_we_talk_about_what_an_impressive_supporting/"
    },
    {
        "id": "1hai8vn",
        "author": "TBK_Winbar",
        "title": "The Nextflix animation The Sea Beast is better than almost every Disney film that's come out in the last 10 years.",
        "content": "Obviously the heavy hitters, Moana, Frozen, Brave, maybe Encanto, are all very good films, but The Sea Beast is hands down one of the best animations I've seen.\n\nThe visual effects are awesome, water hasn't been done better. The characters are well thought out and very entertaining, Karl Urban plays the role of Jacob very well. The soundtrack is excellent, and overall tone is suitably foreboding when it needs to be. The \"pirate speak\" could be better, but it is obviously aimed at kids.\n\nIt's got a lot of the charm of the first Pirates of the Caribbean movie, and follows the time-tested Moby Dick format while staying fairly original. It's got a very classic feel that reminds me of the old swashbuckling pirate films of the 80s. Its a proper adventure film.\n\nAlso, my 3yo boy is obsessed with it, so I'd have to watch it whether I liked it or not. ",
        "upvotes": 135,
        "comments": 68,
        "media": null,
        "permalink": "/r/movies/comments/1hai8vn/the_nextflix_animation_the_sea_beast_is_better/"
    },
    {
        "id": "1haw1l0",
        "author": "destructomofoyo",
        "title": "I have to give a heavy recommendation to 'my old ass'",
        "content": "I've always been a hugh Aubrey plaza fan because of the roles she chooses and she didn't dissapoint here ....\n\nThe 'future you' coming back to warm u about all the things they wish they had known is a tired some trope at this point ... But making the story about being grateful rlly made the message hit home ...,I thought they did a great job making Chad lika le (genius move naming him Chad)... And even as a straight male the subplot of her thinking she was gay was handled so maturly ... She loved Chad inspiye of his gender kinda thing ... If u like Aubrey or just need a reminder to not think to far ahead watch it plz",
        "upvotes": 15,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1haw1l0/i_have_to_give_a_heavy_recommendation_to_my_old/"
    },
    {
        "id": "1harzhp",
        "author": "PhysicalNewt3326",
        "title": "Dead Man’s Shoes (2004)",
        "content": "It’s not often that I’m literally left speechless after watching a movie. First of all, what a performance -every single actor in the movie was phenomenal. I think this was the first time I watched a disturbing movie that involved abuse of a mentally disabled person - it was awful and uncomfortable, I felt like I was watching all of this happen to a child. Put this on having no idea what I was getting into, it was an amazing movie but oh my God is it depressing. Anyone have any thoughts on it?",
        "upvotes": 28,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1harzhp/dead_mans_shoes_2004/"
    },
    {
        "id": "1haest3",
        "author": "OvarianCoincidence",
        "title": "Your favourite stupefyingly bad lines of dialogue?",
        "content": "Not talking delivery here. Nor am I talking knowingly, where the tone was already set, and everyone (audience included) was in on the absurdity of it.\n\nNo, I want very serious lines of dialogue, said with the straightest of faces as if the Oscar is flashing right before their eyes. Allow me to start:\n\n*\"Goddam time-travelling robots! Covering their goddam tracks! I knew it.\"*\n\nFrom 'Terminator: Genisys'. Delivered by non other than Oscar winner J.K. Simmons. In what is clearly a second-unit afterthought insert scene, it was his character's big payoff, proof he was not batshit insane, that he was indeed right about those goddam time-travelling robots.\n\nSimmons of course sells it so much that the stupidity of it does not register immediately. He earned that cheque more than anyone else in that film for that alone.\n\nI now open the stage to the rest of you thespians.",
        "upvotes": 177,
        "comments": 509,
        "media": null,
        "permalink": "/r/movies/comments/1haest3/your_favourite_stupefyingly_bad_lines_of_dialogue/"
    },
    {
        "id": "1ha0t0x",
        "author": "CYBOZAX_",
        "title": "District 9 is great original film.",
        "content": "A recommendation post of this film suddenly popped on my Instagram feed and I thought I should give it a try. I'm glad that I did.\n\nI knew nothing about the film other than the fact that it has aliens in it (thought that it was an alien invasion movie).\n\nNever in my life did I imagine that a film can make me sympathize with aliens and hate humans. Everything about this film is perfect. The documentary style narrative worked so well in this movie. Sharlto's character arc is simple yet so effective and beautiful. This is the most realistic film featuring aliens that I have ever watched. It made me believe that something like this can truly happen. To show aliens as refugees instead of invaders somehow felt so realistic and fresh.\n \nAnother thing that I loved about the film was it's pacing. It's perfectly paced and never drags or dips in quality. The film has a runtime of 1 hr 56 mins but it felt like I finished it in 30 mins.\n\nThe ending made me cry which no other film has ever managed to do (grave of the fireflies being an exception).\n\nThe only thing that I personally felt was slightly off in this film (it may be a little nit picky) was that it was starting to lose a little bit of its realism, but it gets back to the point eventually.\n\nIn short, District 9 is a unique film with great screenplay, Awesome performances (Sharlto especially), Beautiful yet haunting frames and some of the best social commentary I have ever watched in any film.\n\nHighly recommend if you haven't already watched it.",
        "upvotes": 2180,
        "comments": 214,
        "media": null,
        "permalink": "/r/movies/comments/1ha0t0x/district_9_is_great_original_film/"
    },
    {
        "id": "1hanr16",
        "author": "Puzzled-Tap8042",
        "title": "At Sunday’s Kennedy Center Honors, George Lucas, Martin Scorsese and Robert De Niro each appeared on stage to give special tributes to Francis Ford Coppola, while Al Pacino called him a trailblazer willing to break the first rule of Hollywood: Never put your own money in your movie projects\n",
        "content": "",
        "upvotes": 51,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KHTbjNz0gRThXDrw_cT_mPhDAC_Y3bpLHWPgviP8kZ0.jpg?auto=webp&amp;s=6b34599a0470e10cafff32e70c7ba781ae186163"
        },
        "permalink": "/r/movies/comments/1hanr16/at_sundays_kennedy_center_honors_george_lucas/"
    },
    {
        "id": "1hatq3i",
        "author": "Dismal-Channel-9292",
        "title": "La La Land’s (2016) ending sequence is one of the best uses of a no-dialogue scene in major modern film since the beginning of Up (2009)",
        "content": "I just finished a rewatch of La La Land and was reminded just how amazing the ending is, when Mia stumbles across Seb’s club and sees him for the first time since they parted ways all those years ago.\n\nDespite having seen the movie before, the sequence that shows how one of them would’ve ended up unhappy if they stayed together still manages to make a strong emotional impact. In an overall amazing film, this ending sequence still manages to stand out as one of the most beautiful and rememberable parts of this movie. As someone who lost a person I was in love with too young and imagined how things would’ve played out in other circumstances, I can’t watch this scene without tearing up and am sure a lot of other people can relate. Upon rewatching, I have a much greater appreciation for the eloquent and simply stunning way in which they were able to portray the complex feelings of thinking about what could’ve been, and ill-fated love. \n\nThe way that Emma Stone and Ryan Gosling were able to convey so much emotion through just their movements and facial expressions was a testimony to their talent. Of course, the slowed down piano version of City of Stars also plays in a big role in setting the mood for this scene and is a gorgeous score. It’s hard to think of another movie that captures such a perfect balance of being bittersweet. \n\nI know it’s strange to compare La La Land to an animated children’s movie, but I couldn’t help but thinking about Up (2009) while rewatching the ending. The beginning of Up that shows how Carl met and lost his wife with no dialogue had people of all age groups in tears when the movie was released. These two scenes are both uniquely special in the way they’re able to convey strong emotions and make an impact on the audience while using no dialogue. \n\nBarring actual silent films, can anyone else think of a scene in a movie that manages to pack an emotional punch with no dialogue on the level of La La Land and Up? Any thoughts about La La Land and its ending? ",
        "upvotes": 20,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1hatq3i/la_la_lands_2016_ending_sequence_is_one_of_the/"
    },
    {
        "id": "1ha3t94",
        "author": "theserpent_3110",
        "title": "What the fuck did I just watch movies!",
        "content": "Recently I was watching Saltburn. I was not into salburn kind of movies but that night it was my boyfriend's turn to choose the movie so I was kind of forced into watching it it. But to my surprise I kinda liked the movie.so much so that I went on a streak to watch these kind of movies. What was the movie that made you go \" what the actual fuck did I just watch \" in your head . And you kept one thinking about the same for days ? Please reccomend me some of them . Thank you!!",
        "upvotes": 1023,
        "comments": 1719,
        "media": null,
        "permalink": "/r/movies/comments/1ha3t94/what_the_fuck_did_i_just_watch_movies/"
    },
    {
        "id": "1hajwx1",
        "author": "Junior-Concern6662",
        "title": "Home Alone post-credits scene",
        "content": "I don't know if it was filmed. I've never seen it. It wasn't included on the DVD, and I haven't seen it anywhere online. But the scene was in the shooting script. Anyway, here's the scene.\n\nHarry and Marv are in jail in the day room with other offenders, and they're watching TV. And what's showing on the TV? \"Angels With Filthy Souls\". And it's right at the scene that Marv heard from outside the McCallister house. And when Harry and Marv hear the name \"Snakes\", they both look at each other and realize it was a movie.\n\nThat would've been a nice little bit of business to end the movie with. It's too bad it wasn't used.",
        "upvotes": 49,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1hajwx1/home_alone_postcredits_scene/"
    },
    {
        "id": "1hauuix",
        "author": "RockyPS2Glitches",
        "title": "Actors/Actresses who screwed up a comeback arc?",
        "content": "Everyone loves a good comeback story. From sports to music and especially movies. Robert Downey Jr., Brendan Fraser, Ke Huy Quan, Drew Barrymore, and soon probably Demi Moore and Pamela Anderson. However, what are some expectations to the rule that you know of off the top of your head?\n\nFirst one that comes to mind for me is Mickey Rourke. His acting prowess and sex-symbol status made him a promising star in the 80s. Was a notorious asshole on set who insulted producers and pretty much made things difficult for everyone. Took up boxing (which he sucked at) when his career derailed in the 90s, leaving him with tons of facial injuries that Mickey insisted on fixing with terrible plastic surgery. Then in the 2000s, Sin City and The Wrestler (the latter of which he was nominated for an Oscar for) brought him back for a while, until he later ended up doing exactly what he did before. Being an asshole to everyone on the sets of his features, taking up boxing again when his career derailed, and fuck his face up even more.\n\nAnother example I could think of is Cuba Gooding Jr.. Had a breakout role in Boyz in the Hood, won an Oscar for Jerry Maguire, then began starring in a bunch shitty comedy movies in the 2000s. Tried to redeem himself with that People vs. O.J. show, earning an Emmy nomination for his performance, until that halted when he was hit with various sexual harassment lawsuits, and now the last time I saw him recently was when he promoting some low-budget Christian movie with Kevin Sorbo.",
        "upvotes": 10,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1hauuix/actorsactresses_who_screwed_up_a_comeback_arc/"
    },
    {
        "id": "1haxbst",
        "author": "TheStonedWiz",
        "title": "What show/movie isn't an official sequel/etc to another show/movie but could act as one? ",
        "content": "What show/movie isn't an official sequel/etc to another show/movie but could act as one? \n\nFor example; \"Man With A Plan\" (the main actor is Matt LeBlanc/Joey from \"Friends\" ). The main character reminds me of Joey from \"Friends\" but it's a completely different show/universe. \n\nI've also heard this mentioned about \"The King of Queens\" and \"Kevin Can Wait\" (have never seen it). \n\nWhat are some that you know of? ",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1haxbst/what_showmovie_isnt_an_official_sequeletc_to/"
    },
    {
        "id": "1h9rcag",
        "author": "reddithawara",
        "title": "What's the most satisfying defeat of a bad guy in movie history?",
        "content": "I mean Lord of the Rings probably has to be up there, but I also really liked how they brought down Willy Bank in Oceans 13 - even though the movie probably is no cinematic masterpiece 😄 \nMaybe we can also include series if you feel like something has earned it's place here.\n\nLooking forward to the suggestions and happy discussion! 😄🙌🏻\n\nEdit: Clarification\n\nEdit II: Name mixup 😅😅",
        "upvotes": 4343,
        "comments": 3218,
        "media": null,
        "permalink": "/r/movies/comments/1h9rcag/whats_the_most_satisfying_defeat_of_a_bad_guy_in/"
    },
    {
        "id": "1halud5",
        "author": "KillerCroc1234567",
        "title": "New Interview with Anne Hathaway; Talks ‘Devils Wear Prada’ &amp; ‘Princess Diaries’ Sequels, and Starring in Christopher Nolan’s Next Movie",
        "content": "",
        "upvotes": 28,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WU7xNDMsjSSt2V7MuHhPNBC73TnBfPnlmwxWzj-pZNo.jpg?auto=webp&amp;s=3c918a1a2f8f092ab677806a43aede2ab78ecd49"
        },
        "permalink": "/r/movies/comments/1halud5/new_interview_with_anne_hathaway_talks_devils/"
    },
    {
        "id": "1harly4",
        "author": "Jess_Elyse",
        "title": "September 5",
        "content": "I just left my local Regal cinema. I went to see the $5 mystery Monday movie and boy am I glad I went tonight. The movie September 5 has a limited release around the country this Friday. The film is a historical drama that recounts the Munich massacre from the perspective of the ABC Sports Crew and their coverage of events. While the story and history behind it is sad, the way this movie told the story was intriguing. If you are able, I urge you to see this movie.",
        "upvotes": 12,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1harly4/september_5/"
    }
]