[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1osj9k0",
        "author": "niclasb92",
        "title": "I'm seriously getting tired of Netflix.....",
        "content": "Netflix is barely worth it anymore. Netflix used to be fun and priceworthy. But now, Netflix has become expensive, stressful and they don't care about the fans anymore.\n\n1. This year especially, Netflix have been spam-removing movies and shows and I don't have the time to watch the stuff I WANT to see, because I'm too busy watching all the stuff that's being removed from Netflix.\n\n2. New Netflix shows just keep getting cancelled, leaving us fans frustrated when a show ends with a brutal cliffhanger and then Netflix decides to end the show after that cliffhanger.\n\n3. The price: Netflix is the most expensive streaming service there is, especially if you want to watch in 4K. The price for viewing in 4K in Sweden is $20/month.\n\nAll these together makes we just want to unsubscribe from Netflix.\nThe only reason to stay on Netflix (for now) is because of old shows like Stranger Things for example. But I'm getting so tired of Netflix cancelling shows and spam-removing movies that once they wrap up all the old shows, I'm out. ",
        "upvotes": 344,
        "comments": 193,
        "media": null,
        "permalink": "/r/netflix/comments/1osj9k0/im_seriously_getting_tired_of_netflix/"
    },
    {
        "id": "1osagjd",
        "author": "crazyirish71",
        "title": "End credits of House of Dynamite reveal what happened",
        "content": "Spoilers ahead…\n\nWe watched HoD and were loving the suspense but really disappointed by the ending.\n\nWe have the subtitles on all the time and if have English CC subtitles turned on around 1:44:00 when the “Music By” credits appear you hear an explosion in the distance and the subtitles say “explosion” so we took it as Chicago was hit.\n\nAnyone else hear this in the credits?",
        "upvotes": 65,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1osagjd/end_credits_of_house_of_dynamite_reveal_what/"
    },
    {
        "id": "1ose2y2",
        "author": "Curious_Natural_1111",
        "title": "Guillermo del toro Frankenstein is an aesthetic sight",
        "content": "One of the most cinematic movie I have watched this year. Right from the beginning, the way flame was captured in the frozen night was breathtaking. Loved he costumes, the lightening, the set, just brilliant. Oscar Isaac really pulled off the role of mad scientist. \n",
        "upvotes": 13,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ose2y2/guillermo_del_toro_frankenstein_is_an_aesthetic/"
    },
    {
        "id": "1osjh0f",
        "author": "Historical-Egg-9194",
        "title": "Million dollar secret was a great reality show.",
        "content": "Loved it alot won't spoil anything but the way they build up the characters emotions and relationships every elimination dinner you wouldn't be sure who would get voted out and there was never a clear favourite to win it. The show was well done and very good. Recommend it to anyone who likes reality tv.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1osjh0f/million_dollar_secret_was_a_great_reality_show/"
    },
    {
        "id": "1osn9ht",
        "author": "justpotato7",
        "title": "My brother got Netflix for a month and is letting me use the account. What some of the best horror movies on it.",
        "content": "I already watched frankenstien i loved that and it'a not horror but planning on watching k pop demon hunters today. Also I will say am not a fan of found footage horror and want to watch some of the big horror movies from this year.\n\nAlso he did the basic version.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1osn9ht/my_brother_got_netflix_for_a_month_and_is_letting/"
    },
    {
        "id": "1osds3g",
        "author": "thequirkysquad",
        "title": "Netflix is too quiet",
        "content": "I watch Netflix on my web browser on my Mac. I turn up the volume to as high as it goes. It's still very quiet, especially the voices.\n\nI've read about how you can switch from English 5.1 to something else, and that this makes it louder, but I don't see English 5.1, just English \\[Original\\].\n\nI am at a loss as to what to do. Any help would be appreciated. I'd hate to cancel on account of something so seemingly fixable.",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1osds3g/netflix_is_too_quiet/"
    },
    {
        "id": "1osnjtp",
        "author": "ilovefamboys",
        "title": "I need movies or shows",
        "content": "So I don't know what to watch and I hope yall have some recommendations, also I like Action based movies, maybe some drama, or Like Teen humor (more modern movies basically) also I'm up for Romance but it has to be GAY romance (Bl, Gl any is fine as long as it's LGBTQ or anything LGBTQ related)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1osnjtp/i_need_movies_or_shows/"
    },
    {
        "id": "1osn5a4",
        "author": "Weak-Illustrator2609",
        "title": "Brightness",
        "content": "On mobile, my screen gets super dark watching big mouth, I’ve tried many other shows or movies. Alas, it only happens on big mouth. I’ve tried a few methods to resolve this issue, it only started happening today.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1osn5a4/brightness/"
    },
    {
        "id": "1orin66",
        "author": "Budget_Lavishness707",
        "title": "Guillermo Del Toro Frankenstein",
        "content": "I just finished watching Del Toro’s Frankenstein adaptation. The monster is one of my most beloved OG horror characters, so I consume ALL the things related to said subject. So I was looking forward to this movie release for quite some time. And I have thoughts…\n  My husband fell asleep after an hour due to the slow pace of the story 😂, &amp; now I have no one to currently talk me through thoughts &amp; opinions I have.\n   Has anyone else watched this?",
        "upvotes": 345,
        "comments": 186,
        "media": null,
        "permalink": "/r/netflix/comments/1orin66/guillermo_del_toro_frankenstein/"
    },
    {
        "id": "1osk26v",
        "author": "Chemical_Count5054",
        "title": "Looking for a series with orcs",
        "content": "Hello, I had Netflix a couple of years ago and watched a series with orcs in. I can’t remember the name or the plot but I’m sure that orcs were fighting to save the planet against a man with one arm or a robotic arm I think. They had a fight and the man fell from something then it ended but it did say that there was going to be a season 2 but I lost my account before that was released. I’ve signed back up today and would love to watch season one and two. Does anyone know what the show is called please ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1osk26v/looking_for_a_series_with_orcs/"
    },
    {
        "id": "1osjoqy",
        "author": "littlebluecat92",
        "title": "Netflix is so buggy on chromium",
        "content": "Is this a me problem or has someone else encountered this problem too? Whenever I try to watch Netflix on a chromium based browser, the image turns incredibly grainy. Like can barely see the characters' facial expressions grainy. The same thing on Chrome and Vivaldi. It starts out fine and then it buffers a bit and the image quality worsens, then buffers again and the image quality goes down, rinse and repeat a couple of times until the image is so grainy it's an unwatchable mess. Has anyone else had this problem and figured out a fix? Now I watch Netflix on Firefox because it doesn't have that problem. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1osjoqy/netflix_is_so_buggy_on_chromium/"
    },
    {
        "id": "1osgc59",
        "author": "Wide_You_4626",
        "title": "\"We are unable to complete your action at the moment please try later\" error prompt upon signing up with payment method.",
        "content": "Quick Summary,\n\nOn friday 7th November i received a notification from Netflix to update my payment method. Reason? the mastercard attached with my netflix account since 2023 had a problem because of which it stopped working.\n\nI didn't knew at the time so i tried adding it 2 or 3 times manually but it kept giving \"there is something wrong with payment method please try a different method\". but when i switched to a different payment method (this one was Visa card), the error now has changed to \"we cannot complete the action at the moment please try later\". \n\nSince then i have tried multiple things with 4 different payment methods from different banks (1 mastercard and 3 visa debit cards).\n\n1. I have deleted my account, tried to signup with same email again.  \n2. used a different gmail to signup.  \n3. used multiple payment methods, and FYI i have tried these payment cards on different other services like spotify, crunchyroll, EA play even and they are working. even the mastercard that started this whole drama.  \n4. Used different device, used incognito. no solution.  \n5. i've even waited more than 48 hours.\n\n  \nive contacted neflix support team and they say all of my payment methods are not eligible which is why its failing, despite the error stating \"we cannot complete the action at the moment please try later\". I've contacted the banks of all 4 cards, and they say that:  \n1. They have not received any transaction request from Netflix.  \n2. All banks are saying that they allow their customers to pay for their netflix subscription through their payment methods.  \n3. The cards have allowed online transactions.\n\nThe payment methods i've used:  \n1. HBL conventional account mastercard (debit).  \n2. Bank Alfalah Visa (debit).  \n3. Nayapay virtual debit Cards visa both.  \n\n\nwhat am i supposed to do here?\n\nThe banks are claiming no issues on their end and that all their customers are able to and eligible to pay for netflix subscriptions. The netflix support team is keep on insisting to use different payment methods all are giving:\n\n\"We cannot complete the action at the moment please try later\".",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1osgc59/we_are_unable_to_complete_your_action_at_the/"
    },
    {
        "id": "1osa5al",
        "author": "katiebabie333",
        "title": "Show Recommendations Like ‘The Hunting Wives’",
        "content": "I just finished The Hunting Wives and now I’m on a country binge. I watched Echoes and I really liked that! The country vibe is what I’m searching for!! Does anyone have a country movie or show that is:\n\nSensual. \nMurder. \nMystery. \nRomance. \n\nAt least one of these. Or none. Whatever. Something country?!\n\nPlease help before I go through country withdrawal 😫 Any rec is appreciated!\n",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1osa5al/show_recommendations_like_the_hunting_wives/"
    },
    {
        "id": "1osdqk1",
        "author": "Pudix20",
        "title": "What are some newer shows based on the creation/backstory of older shows/movies/events (Like GLOW or A League of Their Own)",
        "content": "I’m not necessarily looking for shows *like* GLOW or ALOTO. I’m looking for shows that give some kind of backstory to how the original was formed, or for expansions.  \n\nYes I know ALOTO is based (loosely) on the All American Girls Professional Baseball League formation\n\nAnd GLOW is based on… well… GLOW: Gorgeous Ladies of Wrestling. \n\nI know there are a ton of other examples I really just can’t think of them right now. \n\nI know Tick Tick Boom also goes into this category but I’ve never seen it so I can’t really comment on it. \n\nAnyway, anything like that?  ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1osdqk1/what_are_some_newer_shows_based_on_the/"
    },
    {
        "id": "1oryu13",
        "author": "MovieReview_hub",
        "title": "Review of Baramulla Movie on Netflix",
        "content": "Where Kashmir’s Snow Hides Secrets and Shadows⭐⭐⭐ (3/5)\n\nSet against the haunting snowfields of Kashmir, Baramulla mixes mystery and horror as a cop investigates child disappearances while his family faces eerie happenings at home.\n\nPositives:\nHaunting visuals, strong performances by Manav Kaul &amp; Bhasha Sumbli, and a chilling atmosphere that captures the valley’s silence beautifully.\n\nNegatives:\nThe midsection drags, horror payoff feels weak, and emotional depth is missing. The story connects late, dulling the overall impact\n\nFinal Word:\nVisually gripping but uneven — a film that impresses more in mood than in emotion.\n\n",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oryu13/review_of_baramulla_movie_on_netflix/"
    },
    {
        "id": "1ortt2g",
        "author": "bottlecoco",
        "title": "Looking for dark, dank, adult comedy movies &amp; shows",
        "content": "Hey guys,\nI’m in the mood for some good dark, twisted, adult humor — something that’s not your typical mainstream comedy. I love stuff that’s a bit edgy, sarcastic, or morally questionable but still hilarious.\nCan you recommend some movies or TV shows in that vibe?",
        "upvotes": 11,
        "comments": 117,
        "media": null,
        "permalink": "/r/netflix/comments/1ortt2g/looking_for_dark_dank_adult_comedy_movies_shows/"
    },
    {
        "id": "1osnky8",
        "author": "Regular_Bowl2453",
        "title": "Did Netflix Ever Get In Trouble For Ripping Off Anime To Create Stranger Things?",
        "content": "",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1osnky8/did_netflix_ever_get_in_trouble_for_ripping_off/"
    },
    {
        "id": "1osntuy",
        "author": "Ok_Salary_7405",
        "title": "Who the actress of Simone really is?",
        "content": "How did she get the role? Every time her close-up came on the screen I felt so uncomfortable to accept that her role is a “ cute and charming girl who makes couple of guys fall for her “. Is she a nepo baby or something?",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1osntuy/who_the_actress_of_simone_really_is/"
    },
    {
        "id": "1or4cc0",
        "author": "Repulsive_Knee9258",
        "title": "Frankenstein was beautiful",
        "content": "I won’t spoil anything but it was a truly beautiful movie, I love how they showed both perspectives of the story telling Victor’s and Frankenstein’s. The visuals in this movie were just amazing, you can tell Netflix spent a lot on this movie. I think this movie might be the best film I’ve seen come out on Netflix this year. Guillermo del Toro once again has proven he’s the best director for the dark fantasy genre of our generation. Highly recommend this film. Loved the acting of Oscar Isaac, Christoph Waltz and Jacob Elordi. excellent casting as well. I can see this even getting some Oscar nominations. 5/5 for me. ",
        "upvotes": 343,
        "comments": 74,
        "media": null,
        "permalink": "/r/netflix/comments/1or4cc0/frankenstein_was_beautiful/"
    },
    {
        "id": "1oqxuou",
        "author": "Jet_Jirohai",
        "title": "Why does it seem like Netflix is the only streaming service that knows how to make a functional user experience?",
        "content": "My main 3 streaming services are HBO, Hulu and Netflix(and YouTube premium, but that's a whole different beast), but I've used others before. I'm not talking about the content on these services or how any company manages their original content, etc. This is specifically about the UI and user experience\n\nWhen I boot up Netflix, it's always snappy, it's always easy to find what shows I've been watching and continue, the app lets me go to a series page BEFORE loading an episode, it's the best about knowing I want to restart a movie/show when the progress bar is near the end, the \"are you still watching?\" prompt is actually consistent. Nearly all of this stuff is either worse or non-existent on the other streaming services I use. Hulu makes me jump through hoops to get to a series page. HBO Max will throw up huge show banner ads I have to scroll through before I can start looking at my library\n\nMaybe there's other streaming services that compete with Netflix more in this regard, but it's something that's really been bothering me lately. If I'm bored and don't know what to watch, I'll boot up Netflix 95% of the time because browsing it feels good compared to my other options.\n\nDoes anyone else here share this opinion? I've tried googling it, but all the Reddit posts are complaining about what shows are available or just complaining about streaming in general",
        "upvotes": 597,
        "comments": 291,
        "media": null,
        "permalink": "/r/netflix/comments/1oqxuou/why_does_it_seem_like_netflix_is_the_only/"
    },
    {
        "id": "1orjaen",
        "author": "yippeee1999",
        "title": "GLOW (Gorgeous Ladies of Wrestling)",
        "content": "So I'm now watching GLOW and am well into Season Two.  Just before creating this particular post, I searched to see if there was already a GLOW discussion, and I saw some from discussions from...over 7 years ago??  Is it possible the series is that old?  And if so, maybe it means that Netflix periodically re-releases or puts certain shows (like GLOW) back in the queue for re-watching?  I say this because...I'd never heard of this show until recently, and likely it's because when I signed into Netflix one day...a few months ago...that GLOW appeared at the top of my feed, and so I naturally assumed it was new.\n\nAnyway, for those not familiar, while a show about female wrestling sounds tacky, they've really done a great job with the show...the cast (particularly the female leads, as well as Marc Maron - who is fantastic in his role) is great.  The show is clever...well-executed.\n\nFor those who've already seen the show, I'm curious if, like me, you had assumed that Season 2, Episode 7 was going to be the series finale?  (That was the episode that included a...er...broken ankle - I don't want to give too much away ...any spoilers.... )  Considering that episode, and the way that episode closed out, I actually think it would have been a perfect way to end the series.  So imagine my surprise when I saw 'Next Episode' loading up on my screen.\n\nEither way, if you've not yet watched GLOW, I highly recommend it.\n\nAlso....Hot Spot (with Japanese subtitles) and Pernille (Norwegian subtitles).",
        "upvotes": 24,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1orjaen/glow_gorgeous_ladies_of_wrestling/"
    },
    {
        "id": "1ordwpl",
        "author": "Hopeful74",
        "title": "Greiving KAOS",
        "content": "I know I am late in the game, but this was such an intelligent, soulful piece of entertainment.  Not a weak acting performance, amazing retelling of Greek Mythology.  I am so disappointed this show was cancelled, only found out just now upon finishing the series.  It is probably too late now to collect all of the amazing talent that made this happen, but I wish so much they would, or a different production company would.  Do you all think that is at all possible at this point?  One year out?  So often it takes series to become successful after 1 - 2 years into it… such an incredible shame to not have faith in this series, we need it now more than ever.\n\nI guess I just wish I understood the industry more than I do.  In my ignorant mind, I would think an old school, heavy clout, heavily connected actor like Jeff Goldblum, or any of the other high tier actors on the show, could call up Amblin Entertainment and the like and get it produced somewhere else if Netflix insisted on canceling it.  But again, I am ignorant to the entertainment industry and the way it works.",
        "upvotes": 54,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ordwpl/greiving_kaos/"
    },
    {
        "id": "1os4ieq",
        "author": "jackfuego226",
        "title": "Floor is Lava- Is there some sort of rule that only one player can move at a time?",
        "content": "Watched several episodes of the show, and in so many episodes, despite everyone knowing there's a time limit, they all just stand and watch their teammates make their own moves  before finally moving for themselves, even in episodes where there is little puzzle element that requires cooperation, they still just stand and watch instead of moving for themselves. Is there some kind of rule they don't mention that only one of them is allowed to move at a time?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1os4ieq/floor_is_lava_is_there_some_sort_of_rule_that/"
    },
    {
        "id": "1os7uko",
        "author": "RiseDelicious3556",
        "title": "Can Someone Tell me If  'Between Lands' is Worth Watching???",
        "content": "Yet another foreign language on netflix. It seems pretty slow so far and boring. Can someone please tell me if I am wasting my time?? And btw, if you happen to know of any good series on netflix, please let me know.I just loved Black Rabbit. Thanks in advance.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1os7uko/can_someone_tell_me_if_between_lands_is_worth/"
    },
    {
        "id": "1oqw0hh",
        "author": "Fun_Molasses5215",
        "title": "Chrishell Stause officially announces she's quitting Selling Sunset after nine seasons on the show",
        "content": "",
        "upvotes": 275,
        "comments": 92,
        "media": null,
        "permalink": "/r/netflix/comments/1oqw0hh/chrishell_stause_officially_announces_shes/"
    },
    {
        "id": "1orlrc9",
        "author": "AtomixMaster25",
        "title": "I need some series recommendation",
        "content": "I am bored and want some recommendations,I don't like very like heavy series I enjoyed watching young Sheldon,bbt,Kim's Convenience,suits etc. \n\nI also like basketball series \n\nJust told all this so that u guys can help🙏\n\nAlso I live in India so some shows might not be available.\n\nThanks ",
        "upvotes": 4,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1orlrc9/i_need_some_series_recommendation/"
    },
    {
        "id": "1orngg6",
        "author": "mugiwara_no_Soissie",
        "title": "Anyone else tired of shows not having the right language.",
        "content": "Like im dutch, and about 90% of the anime they have on Netflix has languages as german and Japanese, and subtitles as only german, which would be nice if we spoke german here... instead we speak Dutch lol.\n\nAnd im not talking about obscure stuff, im talking about shit like demon slayer, which is one of the most popular anime of the last decade.\n\nIt actually happens so often that we dont even have English subs, in a country which is known for having a very large bilingual population...",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1orngg6/anyone_else_tired_of_shows_not_having_the_right/"
    },
    {
        "id": "1os40yr",
        "author": "SedativePraise",
        "title": "AI generated B roll in shows on Netflix?",
        "content": "This is the first time I've noticed. In A Different World season 2 Ep. 22 there is an entirely ai generated transition sequence about a fourth of the way through the episode. I'm not sure if its anywhere else throughout the episodes and seasons, but this instance was so obvious and really quite bad. It almost made me want to just stop watching the show altogether though its one of my favorites. I understand AI is kind of a new wave and of course big companies want to jump on the bandwagon but it's really disappointing to see it so lazily and terribly implemented especially when it was completely unnecessary. It also makes me worry a bit for what to expect from the upcoming A Different World spinoff.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1os40yr/ai_generated_b_roll_in_shows_on_netflix/"
    }
]