[
    {
        "id": "1pj3n0m",
        "author": "BiGanAMA",
        "title": "Hi /r/movies, I'm Bi Gan. I've directed Resurrection, Long Day's Journey Into Night, and Kaili Blues. Resurrection premiered at Cannes earlier this year, where it won the Prix Special, and is out in select theaters starting this Friday via Janus Films. Ask me anything!",
        "content": "Hi reddit, I'm Bi Gan, here to answer your questions.\n\n[Resurrection ](https://www.imdb.com/title/tt29002950/)is out in select theaters this weekend via Janus Films. It stars Jackson Yee, Shu Qi, and Mark Chao.\n\nI'll be doing in-person Q&amp;As at screenings this weekend, info [here](https://i.imgur.com/gCB2aHS.jpeg).\n\nI've also directed [Long Journey's Into Night](https://www.imdb.com/title/tt8185182/) (2018) and [Kaili Blues](https://www.imdb.com/title/tt4613272/) (2015)\n\n**Synopsis:**\n\nA woman's consciousness falls into an eternal time zone during a surgical procedure. Trapped in many dreams, she finds the corpse of an android and tries to wake him up by telling endless stories.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=ZIJezWgFUEY](https://www.youtube.com/watch?v=ZIJezWgFUEY)\n\nAsk me anything! (Back at 4 PM ET today to answer questions)",
        "upvotes": 134,
        "comments": 118,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gn5lyrppmd6g1.png?auto=webp&amp;s=fb849bb3e71161264ea96c90bd0b040e38db05b3"
        },
        "permalink": "/r/movies/comments/1pj3n0m/hi_rmovies_im_bi_gan_ive_directed_resurrection/"
    },
    {
        "id": "1piaej9",
        "author": "EdBegleyJr-AMA",
        "title": "Hey reddit, I'm Ed Begley Jr. - You might know me from things like Best In Show, Arrested Development, Better Call Saul, This Is Spinal Tap, Pineapple Express, Strange Darling. My newest film, Don't Tell Larry, is out now on VOD. Back again to answer your questions. AMA!",
        "content": "Hey reddit, I'm Ed Begley Jr. - I had fun answering your questions last time so I'm back for more!\n\nMy newest film, a dark office-comedy titled **Don't Tell Larry**, is out now on VOD. Ask me anything!\n\nIt's available to watch for free on Youtube here:\n\n[https://www.youtube.com/watch?v=WG4JEdL0sos](https://www.youtube.com/watch?v=WG4JEdL0sos))\n\n**Bio:**\n\nEd Begley Jr. - If there’s a movie or TV show you really like, chances are, Ed's been in it. Ed has seven Emmy nominations, a Golden Globe nomination and has appeared in over 270 TV shows and movies throughout his prolific career. He played Dr. Ehrlich on the television series ST. ELSEWHERE, and he also co-hosted the green living reality show LIVING WITH ED. He is a recurring cast member in Christopher Guest mockumentaries, including THIS IS SPINAL TAP, BEST IN SHOW, A MIGHTY WIND, and more. Ed starred in SHE-DEVIL, the GHOSTBUSTERS reboot, Woody Allen's WHATEVER WORKS, and PINEAPPLE EXPRESS. He has held recurring roles on the TV hits ARRESTED DEVELOPMENT, SIX FEEET UNDER, PORTLANDIA, BETTER CALL SAUL, FUTURE MAN, GARY UNMARRIED, VERONICA MARS, PARENTHOOD, BLESS THIS MESS, and MODERN FAMILY. In addition to recently recurring on the CBS hit YOUNG SHELDON, Ed also appeared in HOLIDAY TOUCHDOWN: A CHIEFS LOVE STORY and the breakout indie hit, STRANGE DARLING.\n\n**Synopsis:**\n\nAn ambitious office worker tells a tiny lie to a truth-obsessed weirdo—and ends up trapped in a corporate nightmare of her own making.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=6xREP3uLf0Q](https://www.youtube.com/watch?v=6xREP3uLf0Q)\n\nAsk me anything! I'm back tomorrow Wednesday 12/10 1 PM PT/4 PM ET to answer your questions.",
        "upvotes": 1518,
        "comments": 569,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vgc1zk7b676g1.jpeg?auto=webp&amp;s=200432b49518819c486183f0e5e064a25b25152d"
        },
        "permalink": "/r/movies/comments/1piaej9/hey_reddit_im_ed_begley_jr_you_might_know_me_from/"
    },
    {
        "id": "1pjjohz",
        "author": "MarvelsGrantMan136",
        "title": "Jennifer Lawrence, Josh Hutcherson to Return for ‘Hunger Games: Sunrise on the Reaping’",
        "content": "",
        "upvotes": 3635,
        "comments": 203,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L2z0cG_tzainLyhvB-QooNebVYqv3vrftA0dGz-Tekc.jpeg?auto=webp&amp;s=f558bc5d9a8f8e732bae9da15140dd667396b208"
        },
        "permalink": "/r/movies/comments/1pjjohz/jennifer_lawrence_josh_hutcherson_to_return_for/"
    },
    {
        "id": "1pj7t9c",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Supergirl'",
        "content": "",
        "upvotes": 29082,
        "comments": 2187,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7wgdxs5kqe6g1.jpeg?auto=webp&amp;s=1f8837b8c5b0f6deab471dd25c519d73492bd344"
        },
        "permalink": "/r/movies/comments/1pj7t9c/official_poster_for_supergirl/"
    },
    {
        "id": "1pjj2wy",
        "author": "MarvelsGrantMan136",
        "title": "’28 Years Later III’ Moving Forward At Sony: Cillian Murphy In Talks, Alex Garland Penning",
        "content": "",
        "upvotes": 1966,
        "comments": 249,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FIv64C-yfs0K_eh7hiXA4a98sd6ZsG_2SRQ2DL-gkcU.jpeg?auto=webp&amp;s=a55385c9c924d5e8fddeb6dc6d78f23c02460b77"
        },
        "permalink": "/r/movies/comments/1pjj2wy/28_years_later_iii_moving_forward_at_sony_cillian/"
    },
    {
        "id": "1pjl3qz",
        "author": "yaboijaredd1996",
        "title": "Peter Jackson’s “King Kong” is still unmatched.",
        "content": "This movie is absolutely excellent in my opinion; I think it’s one of Peter Jackson’s best films, right alongside The Lord of the Rings. It’s perfect in pretty much every way. I love the directing, the acting, the actors, the score, and the locations. The CGI for the time looked phenomenal back in 2005 and still holds up incredibly well today. I know that the film’s length was and still is controversial, but I actually don’t mind it. I personally think that the buildup to Skull Island is well done, and I think the whole movie was paced fairly well overall - with the first hour being in New York City and on the ship, the second hour on the island, and the third and final hour back in New York with Kong causing chaos. What do you all think? I think this is still the best version of Kong; I wish the newer movies had kept the 2005 design.\n\nEdit - this is in no way a diss to the other films. I like King Kong, no matter what. I just personally really enjoy this movie, and to me, it's the best. That's just my opinion. I like having discussions and seeing them; at the end of the day, they're all good films in their own way.",
        "upvotes": 641,
        "comments": 247,
        "media": null,
        "permalink": "/r/movies/comments/1pjl3qz/peter_jacksons_king_kong_is_still_unmatched/"
    },
    {
        "id": "1pjpd6p",
        "author": "Kilordes",
        "title": "Random thoughts about John Wick (2014) and the chop shop scene",
        "content": "Re-watching the scene with Aurelio and Tarasov: the first few times I watched these scenes I was thinking of it as Aurelio owing John respect, and being disgusted by Tarasov's behavior. But re-watching it now, I realize that Aurelio is absolutely *terrified*. He realizes that if John thinks for a moment that he's helped Tarasov that he's dead, whereas if he humiliates Tarsov and kicks him out at least he has a chance of surviving Viggo's wrath. Both the scenes with Tarasov and the scenes with John he's basically making the case for his life, just in different ways.\n\nIt's easy to miss because John doesn't show any overt hostility towards Aurelio but part of Reeves' performance is he doesn't often show that, and the (apparently) calm drinking scene where Aurelio pours John a drink and they have the brief conversation about Tarasov is still one fraught with tension.\n\nAurelio's anxiousness is most evident when Tarasov first shows up with the car. It's not just Aurelio being disdainful of Tarasov, he's acutely aware that now he's involved, and knows that John's going to show up at some point. And if John thinks Aurelio helped Tarasov that he's a dead man. It's honestly a fantastic performance from Leguizamo, an all time great character actor, demonstrating a mix of emotions that I think often gets overlooked. It's honestly kind of amusing that he's demonstrating less fear during the conversation with Viggo (although not none) than he is when he's talking to Tarasov.",
        "upvotes": 321,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1pjpd6p/random_thoughts_about_john_wick_2014_and_the_chop/"
    },
    {
        "id": "1pjbal6",
        "author": "MarvelsGrantMan136",
        "title": "Jeffrey Garcia, the Voice of Sheen in 'Jimmy Neutron: Boy Genius', Dies at 50",
        "content": "",
        "upvotes": 1626,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ChCuOieB3DPVOG54TCm9kddYJOzNwsQAT1ISEtFJFE0.png?auto=webp&amp;s=967f2b0c37cdf6f78b873dcdd2a7cc91a9f1c482"
        },
        "permalink": "/r/movies/comments/1pjbal6/jeffrey_garcia_the_voice_of_sheen_in_jimmy/"
    },
    {
        "id": "1pjfz2i",
        "author": "MarvelsGrantMan136",
        "title": "First Images from 'The Weight' Starring Ethan Hawke and Russell Crowe - In 1930s Oregon, Samuel (Hawke) is a battle-scarred veteran who takes a dangerous job smuggling a fortune in gold across the wilderness to save what remains of his family.",
        "content": "",
        "upvotes": 891,
        "comments": 81,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0v5dzy2v3g6g1.jpeg?auto=webp&amp;s=0eee5237c107eb8721b1bd43f9527326553c8d39"
        },
        "permalink": "/r/movies/comments/1pjfz2i/first_images_from_the_weight_starring_ethan_hawke/"
    },
    {
        "id": "1pj9pfe",
        "author": "ChiefLeef22",
        "title": "Ryan Coogler discusses why he turned down the invitation to join The Academy, saying he finds it stressful to judge other people's work, and is more drawn to the everyday, blue-collar elements of filmmaking than to glamorous ballrooms",
        "content": "",
        "upvotes": 1219,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1pj9pfe/ryan_coogler_discusses_why_he_turned_down_the/"
    },
    {
        "id": "1pjfl3h",
        "author": "BunyipPouch",
        "title": "Francis Ford Coppola's 'Megalopolis' Returning to Theaters on New Year's Day Exclusively at Alamo Drafthouse Locations",
        "content": "",
        "upvotes": 593,
        "comments": 185,
        "media": null,
        "permalink": "/r/movies/comments/1pjfl3h/francis_ford_coppolas_megalopolis_returning_to/"
    },
    {
        "id": "1pj91xt",
        "author": "darth_vader39",
        "title": "Ramin Djawadi to Score DC Studios’ ‘Supergirl’",
        "content": "",
        "upvotes": 1081,
        "comments": 88,
        "media": null,
        "permalink": "/r/movies/comments/1pj91xt/ramin_djawadi_to_score_dc_studios_supergirl/"
    },
    {
        "id": "1pjbils",
        "author": "EuphoricButterflyy",
        "title": "First image of ‘BUDDY’, a new horror movie starring Cristin Milioti, Topher Grace and Michael Shannon. The film follows a girl and her friends who must escape a demented kids TV show.",
        "content": "",
        "upvotes": 763,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9r2tuc0cef6g1.jpeg?auto=webp&amp;s=65902a94e44b50b3ab7232abf7c729ada3dee85f"
        },
        "permalink": "/r/movies/comments/1pjbils/first_image_of_buddy_a_new_horror_movie_starring/"
    },
    {
        "id": "1pj3aqq",
        "author": "Comic_Book_Reader",
        "title": "The Drama | Official Teaser HD | A24",
        "content": "",
        "upvotes": 1999,
        "comments": 503,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JQBLipAvA24aBpjkiIzywZ85DLqr9imb5U0W2ucbgWQ.jpeg?auto=webp&amp;s=d7f5d6aab4e2ff00f918d05c854cd6e597643fb1"
        },
        "permalink": "/r/movies/comments/1pj3aqq/the_drama_official_teaser_hd_a24/"
    },
    {
        "id": "1pjl03s",
        "author": "ubcstaffer123",
        "title": "Disney composer Alan Menken: ‘I won my first Oscar, then Howard Ashman told me he was dying’",
        "content": "",
        "upvotes": 211,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/f8Q3sdrprCYHF_3eubptMmYNQXWbe77BO5GvrXjmEqw.jpeg?auto=webp&amp;s=25ca3f6ad4ad87104eedb82444c09ed2cfef65e6"
        },
        "permalink": "/r/movies/comments/1pjl03s/disney_composer_alan_menken_i_won_my_first_oscar/"
    },
    {
        "id": "1pjjmu7",
        "author": "UniverslBoxOfficeGuy",
        "title": "'Ella McCay' - Review Thread",
        "content": "*Set in an unnamed state in 2008, an idealistic 34-year-old lieutenant governor juggles familial issues and a challenging work life while preparing to take over the job of her mentor, the state's longtime incumbent governor, who suddenly accepts a cabinet position in the incoming Obama administration.*\n\nCast: Emma Mackey, Jamie Lee Curtis, Jack Lowden, Woody Harrelson, Rebecca Hall\n\nRotten Tomatoes: 21%\n\nMetacritic: 41\n\nSome reviews:\n\nJocelyn Noveck, Associated Press 1/4 - It’s hard to understand how “Ella McCay,” the first original feature from writer-director Brooks in 15 years, goes so utterly haywire. Is this really the same mind that wrote the memorable “Broadcast News”? “Terms of Endearment”? “As Good As It Gets”?\n\nJohnny Oleksinski, New York Post 1/4 - This sloppy slog is terrible; short, but interminable.\n\nMoira MacDonald, Seattle Times 2.5/4 - It’s not at all unpleasant spending two hours with Ella and her family and colleagues, but it leaves you feeling a little nostalgic for what it could have been.\n\nRadheyan Simonpillai, Globe and Mail - Ella McCay, the movie, feels like we’re being bear hugged by a lovable, slightly boozy old grand-uncle who genuinely hopes to find common ground with a new generation, but also can’t help being a little patronizing.\n\nNick Schager, The Daily Beast - Its phoniness epitomized by Emma Mackey’s lead turn, it’s the biggest dud of the artist’s career, and the holiday season’s most egregious misfire.\n\nOdie Henderson, Boston Globe 2/4 - Ella McCay never registers as a real person; she’s a collection of tics that Mackey desperately tries to play.\n\nVikram Murthi, IndieWire B - Watching “Ella McCay” can sometimes feel like time travel, particularly for those vested in bygone eras of American filmmaking, but if you’re capable of tuning into its wavelength, an old but worthwhile spirit can be found.\n\nTim Robey, Daily Telegraph (UK) 1/5 - There’s not a great deal more to be said about the experience, except that it is best politely avoided, like a Christmas invitation from neighbours you find chirpy, well-meaning and off-puttingly strange on every collision.\n\nTara Brady, Irish Times 3/5 - At 85, Brooks retains an instinct for human foibles and complex characters, even if on this occasion the material doesn’t always live up to his cast.\n\nTim Grierson, Screen International - This comedy-drama contains some of the crackling dialogue and disarming candour of Brooks’ best work. Ultimately, however, this disjointed character study ultimately feels as messy as its heroine’s life.\n\nAdrian Horton, Guardian 2/5 - Ella McCay is, first and foremost, a mess -- a clunky collection of incoherent characters and confounding plot that seem to defy basic story logic at every turn, and not in a surprising or intriguing way.\n\nWilliam Bibbiani, TheWrap - 'Ella McCay' is a film about American politics in the same way that Pixar’s 'Cars' is a movie about cars. As in yes, these are definitely films about politics and cars. But no, politics and cars don't work like that.\n\nDavid Rooney, The Hollywood Reporter - Almost everyone here is trying way too hard, with the exception of Mackey, who’s appealing and natural even when stuck in a phony world full of phony characters.\n\nTaylor Williams, Slant Magazine 2/4 - As it follows its main character navigating political and personal waters, James L. Brook’s film finds itself poised between sincerity and artificiality\n\n\nRotten Tomatoes page:\nhttps://www.rottentomatoes.com/m/ella_mccay\n\nMetacritic page:\nhttps://www.metacritic.com/movie/ella-mccay/",
        "upvotes": 245,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mGBn66B6ZbqPWPSbtQpN_72VQavbxG0gbY9tYov2aRQ.jpeg?auto=webp&amp;s=8aab0462623f76af9be4c4bc358460424f969b5f"
        },
        "permalink": "/r/movies/comments/1pjjmu7/ella_mccay_review_thread/"
    },
    {
        "id": "1pjcqgi",
        "author": "BaronGikkingen",
        "title": "New poster for John Woo's HARD BOILED, in theatres January with exclusive new interview",
        "content": "Tickets on sale now for Hard Boiled (January 25-28), A Better Tomorrow (March 1-4) and The Killer (April 5-9) \n\nMore info here: [https://collider.com/john-woo-movies-theatrical-re-release-2026-hard-boiled-a-better-tomorrow-the-killer/](https://collider.com/john-woo-movies-theatrical-re-release-2026-hard-boiled-a-better-tomorrow-the-killer/)",
        "upvotes": 521,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5fdafkbemf6g1.jpeg?auto=webp&amp;s=a23a254daefae2c50636d5f2f3aa38d77da9cb9c"
        },
        "permalink": "/r/movies/comments/1pjcqgi/new_poster_for_john_woos_hard_boiled_in_theatres/"
    },
    {
        "id": "1pjnvdk",
        "author": "KevinRobertsUSA",
        "title": "What is the Sweatiest Movie?",
        "content": "What do you think is the sweatiest movie of all time? By that I mean what movie did the characters sweat the most in? An argument could be made for Ben Hur as the guys in that galley were clearly sweating buckets, however there is a lot of sweat in the Rocky movies as well as Alien. I could also see a case for Body Heat or Sweat City, which even has sweat in the name. What movie do you think wins the title of sweatiest film of all time?",
        "upvotes": 102,
        "comments": 403,
        "media": null,
        "permalink": "/r/movies/comments/1pjnvdk/what_is_the_sweatiest_movie/"
    },
    {
        "id": "1pj23bl",
        "author": "BunyipPouch",
        "title": "Kevin Smith Talks ‘Dogma’ Rebirth &amp; How His His New ‘Jay and Silent Bob’ Film Was Derailed - In a candid conversation, the filmmaker discusses his history with Affleck and Damon, the feature he'll shoot in 2026 and wishing he'd concentrated \"on being more of a \"financial success\" during his career.",
        "content": "",
        "upvotes": 1208,
        "comments": 352,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BZU39hV0ukkYxViM1W-M7eup-i2a9hQZSSly8CSqKzg.jpeg?auto=webp&amp;s=a8aa52ec8f0c94082b5b7546ac394052433857c9"
        },
        "permalink": "/r/movies/comments/1pj23bl/kevin_smith_talks_dogma_rebirth_how_his_his_new/"
    },
    {
        "id": "1pj3f0y",
        "author": "Massimo25ore",
        "title": "Trading Places: An enduring Christmas tradition in Italy",
        "content": "",
        "upvotes": 781,
        "comments": 107,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/G1xukM7YjgatfdUqONf_jeluhtEi6-1ncfZcH2b9UsI.jpeg?auto=webp&amp;s=3b28d19cb7ef998ce8676f91190abd38dabe4802"
        },
        "permalink": "/r/movies/comments/1pj3f0y/trading_places_an_enduring_christmas_tradition_in/"
    },
    {
        "id": "1pjha1y",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Thomasin McKenzie - Monday 12/15 at 4:10 PM ET - Actress in 'Jojo Rabbit', 'Last Night In Soho', 'The Testament of Ann Lee', 'The Power of the Dog', 'Leave No Trace', 'Eileen', 'Old', 'The King', and lots more.",
        "content": "",
        "upvotes": 151,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4afrrwxqhg6g1.png?auto=webp&amp;s=2ae5da175a3384c29e41c31b5aa8a55be79c5fe6"
        },
        "permalink": "/r/movies/comments/1pjha1y/amaqa_announcement_thomasin_mckenzie_monday_1215/"
    },
    {
        "id": "1pj95m0",
        "author": "MarvelsGrantMan136",
        "title": "First Image from Andrew Stanton's ('WALL-E') 'In the Blink of an Eye' Starring Kate McKinnon - The film seeks to explore no less than the entire history of the world and tackle the nature of life, love, hope and connection, doing so by focusing on three intersecting storylines",
        "content": "",
        "upvotes": 381,
        "comments": 118,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0nssu7v1ze6g1.jpeg?auto=webp&amp;s=69ba2228fea11d126f053a324cd04df0f46d5b8a"
        },
        "permalink": "/r/movies/comments/1pj95m0/first_image_from_andrew_stantons_walle_in_the/"
    },
    {
        "id": "1pjsdgu",
        "author": "Shiny-Tie-126",
        "title": "A new billboard for Spielberg’s next UFO movie has appeared in New York City, it also teases the film’s release date, June 12, 2026",
        "content": "",
        "upvotes": 23,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YciLJ6hX3SkaTPM--fRYoYq23R1LVy2o7nepN2oGf2w.jpeg?auto=webp&amp;s=208922e0f4b7266803ea74951701badf7b5076d1"
        },
        "permalink": "/r/movies/comments/1pjsdgu/a_new_billboard_for_spielbergs_next_ufo_movie_has/"
    },
    {
        "id": "1piynq1",
        "author": "JustIgnoreMyStimming",
        "title": "What scene in a movie drives you nuts because it makes no sense?",
        "content": "For me, I love the 2005 Pride and Prejudice movie,  but when Elizabeth is visiting Pemberley with her aunt and uncle and gets separated from them, she bumps into Mr Darcy. They have an embarrassing encounter and he offers to accompany her back to the village. She says no, she likes to walk. \nShe arrived in a carriage with her aunt and uncle! In the five minutes that they've been separated, did they jump in their carriage and leave her there!!? It drives me nuts because it makes no sense (and not the way it happens in the book). \n\nWhat scene in a movie makes no sense to you and has you yelling at the screen? ",
        "upvotes": 1434,
        "comments": 2573,
        "media": null,
        "permalink": "/r/movies/comments/1piynq1/what_scene_in_a_movie_drives_you_nuts_because_it/"
    },
    {
        "id": "1pjdpos",
        "author": "EuphoricButterflyy",
        "title": "First image of ‘UNION COUNTY’, starring Will Poulter and Noah Centineo. The film follows a man assigned to mandated drug court program amid the opioid epidemic in rural Ohio",
        "content": "",
        "upvotes": 185,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/912yzy62tf6g1.jpeg?auto=webp&amp;s=e596afa1cf5c71cd033355bc19463dbcdcf92bea"
        },
        "permalink": "/r/movies/comments/1pjdpos/first_image_of_union_county_starring_will_poulter/"
    },
    {
        "id": "1pjdo9s",
        "author": "EuphoricButterflyy",
        "title": "First image of Olivia Wilde’s new film ‘THE INVITE’, starring Seth Rogen, Penélope Cruz, Edward Norton and Olivia Wilde herself. The film follows a couple on the verge of breaking up when their neighbors show up for dinner &amp; make everything worse.",
        "content": "",
        "upvotes": 183,
        "comments": 93,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zaly3kgssf6g1.jpeg?auto=webp&amp;s=9b4d4a21eb7d4c6fc975e5a91d0ab783d9d4ae20"
        },
        "permalink": "/r/movies/comments/1pjdo9s/first_image_of_olivia_wildes_new_film_the_invite/"
    },
    {
        "id": "1pjnjr0",
        "author": "stellifer_arts",
        "title": "The Producers (1967) directed by Mel Brooks - a producer and his accountant (played by Zero Mostel and Gene Wilder) are eagerly watching the debut of their theatrical production that is designed to fail so as to scam their investors for $$$$$",
        "content": "",
        "upvotes": 43,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/otqtky9-YWa26soZG-6PUYd4fBJ9vEUEAxK-UMOhJck.jpeg?auto=webp&amp;s=074917d245cabc9d03fa8367d4173f7b00af4fdd"
        },
        "permalink": "/r/movies/comments/1pjnjr0/the_producers_1967_directed_by_mel_brooks_a/"
    },
    {
        "id": "1pjmm7l",
        "author": "EuphoricButterflyy",
        "title": "Ingrid Goes West (2017)- Joshua Tree scene. Featuring Aubrey Plaza &amp; Elizabeth Olsen- Directed by Matt Spicer",
        "content": "",
        "upvotes": 42,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8rfollucph6g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pjmm7l/ingrid_goes_west_2017_joshua_tree_scene_featuring/"
    },
    {
        "id": "1pj9sr4",
        "author": "jscummy",
        "title": "In Time (2011) is such a waste of potential, even though I actually liked the movie",
        "content": "Not sure if there is a better place to post this. Just watched this movie for the first time actually and was immediately hooked by the concept and world building. Theres some cool parallels to draw with our world, and commentary to be made about capitalism and wealth inequality.\n\nEveryone in their world stops aging at 25 and uses their lifespan as currency. The poor struggle to even stay alive while the rich gamble and waste away decades. At the same time, people are still vulnerable to random acts of violence, so violence and robbery becomes rampant.\n\nThe movie starts off pretty strong and has a lot of positives I think, but it starts to fall apart later on. Lots of interesting concepts get brought up (a wealthy man at the beginning talks about being old enough to crave death, the poor do everything as quick as possible to make the most of time, and there are \"timekeeper\" cops to enforce rigid structure to the society).\n\nBut the movie never fully explains more from there, and then turns generic. Amanda Seyfrieds character is a rich man's daughter who almost immediately falls in love with the protagonist and joins his fight against the system. They fight the system by randomly robbing banks and distributing time.\n\nCillian Murphy also plays the main Timekeeper cop, but is oddly overzealous about enforcing a bizarrely shitty system. Hes shown to have an insane amount of loyalty to the rigid class structure *despite being born and raised in the ghetto*. He \"made it out\" somehow, but then devotes his life to making sure others don't, and then dies from it because he was still pretty damn poor as a cop.\n\nOverall still an interesting watch but just wish we got a lot more. Background on the system and more explanations would have been way better than a generic love story and cookie cutter standoff.\n\nIts been a while since this came out, but anyone else think similar?\n\n\n",
        "upvotes": 178,
        "comments": 62,
        "media": null,
        "permalink": "/r/movies/comments/1pj9sr4/in_time_2011_is_such_a_waste_of_potential_even/"
    },
    {
        "id": "1pjgaz8",
        "author": "Raj_Valiant3011",
        "title": "First image of ‘JOSEPHINE’, starring Channing Tatum and Gemma Chan. The film follows a young girl who acts out after witnessing a crime take place whilst her parents are helpless to console her.",
        "content": "",
        "upvotes": 66,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hatbevd7bg6g1.jpeg?auto=webp&amp;s=43ea906a7782a15acfeef068c217318e19068c04"
        },
        "permalink": "/r/movies/comments/1pjgaz8/first_image_of_josephine_starring_channing_tatum/"
    }
]