[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 495,
        "comments": 261,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1it96ui",
        "author": "TheMirrorUS",
        "title": "Brian Laundrie’s parents shunned by Florida community over Gabby Petito’s murder following Netflix docuseries",
        "content": "",
        "upvotes": 2315,
        "comments": 460,
        "media": null,
        "permalink": "/r/netflix/comments/1it96ui/brian_laundries_parents_shunned_by_florida/"
    },
    {
        "id": "1itgt0k",
        "author": "ellissabain",
        "title": "In full: The chilling ‘burn after reading’ letter Brian Laundrie’s mum wrote to him",
        "content": "",
        "upvotes": 234,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1itgt0k/in_full_the_chilling_burn_after_reading_letter/"
    },
    {
        "id": "1itnk0p",
        "author": "Debbie2801",
        "title": "Gabby Petito",
        "content": "I’m watching this atm and I have thoughts!\nObviously Brian’s parents were cautioned by their attorney not to speak to anyone. Not the police, not FBI, not Gabby’s family and certainly not the media. \n\nI feel this legal advice cost them a lot!\n\nFirstly - I believe it cost them their son - to a degree. If they had of spoken to police or FBI I believe he would have been taken in for questioning and possibly arrested or at least monitored very closely. Therefore not escaping so he could end his own life rather than face the consequences of his actions. \n\nSecondly - they lost their daughter. She has not communicated with them since Brian passed away. They never- according to her and her husband- confided in them. \n\nThirdly - their reputations in the community. People are angry at them. Blaming them for not assisting parents desperately trying to find their daughter. \n\nAnd finally financially - they had to pay Gabby’s parents a significant sum - not disclosed - from the settlement of the civil lawsuit. \n\nSo I guess I’m wondering - was it in fact sound legal advice?\nWhat are your thoughts? ",
        "upvotes": 27,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1itnk0p/gabby_petito/"
    },
    {
        "id": "1iswm3v",
        "author": "lovethats",
        "title": "Gabby Petito Doc",
        "content": "Watching Brian’s parents “search” for Brian made my blood boil. A quote from the FBI said “they did not emote.” Of course they didn’t. They knew where to pretend to look the entire time. \n\nYou’re telling me he was within a mile of the car the entire time and his parents show up to look one day and they find his remains the same day. \n\nThen Brian says in his suicide note that Gabby “begged for an ending to her pain” and he thought it was “merciful.” \n\nI have never felt a level of anger at a family in my life. I hope the entire Laundrie family pays for what they did.\n\nThis is so sickening. ",
        "upvotes": 671,
        "comments": 288,
        "media": null,
        "permalink": "/r/netflix/comments/1iswm3v/gabby_petito_doc/"
    },
    {
        "id": "1itmwcs",
        "author": "Fartmaster69420Yolo",
        "title": "Why would a Netflix original be \"leaving soon\"?",
        "content": "I am just curious. \n\nIs it Netflix checking the numbers and it's not being watched? been on for a long time? They are selling the rights of the movie to another platform? ",
        "upvotes": 12,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1itmwcs/why_would_a_netflix_original_be_leaving_soon/"
    },
    {
        "id": "1itkikl",
        "author": "dreadoverlord",
        "title": "Is there any way to disable the Netflix Games banner/preview? I just want normal TV/movie banners back",
        "content": "I have Steam and GOG. I don't need to play Civ 6 on Netflix. What I also don't need is a giant auto-playing banner on the Netflix home page telling me to try Cozy Grove.",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1itkikl/is_there_any_way_to_disable_the_netflix_games/"
    },
    {
        "id": "1itt1q2",
        "author": "No_Nectarine_4528",
        "title": "Gabby Petito doco",
        "content": "The woman that picks Brian up and drops him off at the camp site pissed me off. “The bible fell straight into his lap” AND?? Was so unnecessary and irrelevant. It wasn’t Satan that killed Gabby, it was her dog of a boyfriend. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1itt1q2/gabby_petito_doco/"
    },
    {
        "id": "1itm5xe",
        "author": "lovethats",
        "title": "Another thought about the Gabby Petito doc-",
        "content": "Does anyone else think Brian and his mom had a very weird relationship? Very mush so enmeshed. Like in her letter to Brian BEFORE he and Gabby even left on their trip she said- “I just want you to remember I will always Love you and I know you will always Love me. You are my boy. Nothing can make me stop loving you, nothing will or could ever divide us. No matter what we do, or where we go or what we say- we will always Love each other,” and “If you say you hate my guts, I’ll get new guts.”\n\nMaybe some sort of abuse there? This isn’t normal behavior from a mother. It’s giving that crazy “boy mom” vibe.",
        "upvotes": 5,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1itm5xe/another_thought_about_the_gabby_petito_doc/"
    },
    {
        "id": "1itrh1d",
        "author": "Most_Standard_2221",
        "title": "shows/movies similar to young sheldon available in australia",
        "content": "my siblings and i watch netflix together often. they’re 9 and 11 while i’m 19. we finished young sheldon and need a new show to watch that is easy to follow for kids, and has comedy and drama in it. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1itrh1d/showsmovies_similar_to_young_sheldon_available_in/"
    },
    {
        "id": "1ittp43",
        "author": "fucklmao",
        "title": "Help finding name of tv show",
        "content": "Hi!\n\nI recently watched a preview of a show about a girls dead twin who comes back as a ghost (she was killed at birth because she was deformed) and wants to terrorise the village, it was foreign - maybe Filipino? \n\ndoes anyone know the name of this show?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ittp43/help_finding_name_of_tv_show/"
    },
    {
        "id": "1ittb9q",
        "author": "Exotic_Outside_1818",
        "title": "Downloads deleting minutes after downloading.",
        "content": "I'm traveling abroad and staying in a place without wifi and Netflix won't load on the cellular service here. I just was at a place with wifi and I downloaded 3 episodes of my show. Then I went into airplane mode and confirmed the episodes were watchable. I walked only 10 minutes back to my lodging and when I opened Netflix, the downloads were gone. \n\nThis is the 2nd time it's happened in 2 days but I thought the first one was a fluke. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ittb9q/downloads_deleting_minutes_after_downloading/"
    },
    {
        "id": "1itj0o6",
        "author": "MadJackTheThird",
        "title": "Cassandra (2025) series - Does anyone know what software did they use to synthesise Cassandra's face?",
        "content": "It kinda reminds me of some very old softwares used to simulate face expressions, and they really nailed the uncanny valley effect the old softwares gave!\nI'm interested in the technical details of the methods they used in order to recreate the face. Did they use the same old implementations? ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1itj0o6/cassandra_2025_series_does_anyone_know_what/"
    },
    {
        "id": "1isz6fc",
        "author": "Jumpy_Whereas181",
        "title": "How will Netflix recover from most of its flagship series ending?! (2026 and beyond)",
        "content": "I don’t think Netflix will be able to ever capture the success of Stranger Things or Squid games or any of its other bigger  series ending. So what’s next for Netflix? Can they ever reach this peak again? ",
        "upvotes": 75,
        "comments": 102,
        "media": null,
        "permalink": "/r/netflix/comments/1isz6fc/how_will_netflix_recover_from_most_of_its/"
    },
    {
        "id": "1it876a",
        "author": "Paranoir89",
        "title": "American Murder: Gabby Petito- “Brian and Gabby’s Friend”",
        "content": "I watched the documentary in full and there’s so much to say, but I’ve honestly found other posts on it as well. \n\nOne thing I can’t seem to find is about their “friend” with the black hair.\n\nSomething about her feels off to me? I understand maybe nerves, and obviously she had known them prior to this happening.\n\nBut I don’t know, the energy she gives me is that she actually had feelings for Brian but was embarrassed about it, so she pushed it away, and wasn’t actually friends with Gabby, or was jealous of her. There’s times where she seems normal talking about them, like the engagement, but then other times not so much.\n\nIt doesn’t sit right with me that she’s in this documentary about him killing Gabby, and she’s yapping about Brian saying the friend thing or being the love of his life, and the bluebird text. She smiles a lot when talking about him, and then when she talks about him playing guitar for Gabby and “how could I be so blind?” Gives me the feeling he didn’t tell her about Gabby until they found out and she thought he was her lover boy-regardless if they were dating or not.\n\nShe isn’t actually crying at the end.\n\nIdk. I always think I’m reading too much into something and then something comes out and I’m like “I KNEW IT”, lol.\n\nI’m not even sure what this means, I guess I wonder if she knows more than she’s letting on? Gabby had reached out to her ex, and if I know anything about abusive bf’s, they’ll come back around to old “loves” to get an ego boost. Makes me wonder if he ever reached out to her when he and Gabby were fighting, or after Gabby’s death. She seems like she had that relationship with him. \n\nDid anyone else get this vibe from her or am I nuts?",
        "upvotes": 15,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1it876a/american_murder_gabby_petito_brian_and_gabbys/"
    },
    {
        "id": "1ithgyd",
        "author": "Vance617",
        "title": "We need a season 3 of The OA",
        "content": "This show was hard for me to get into, at least the first couple episodes. By the time season 2 started I couldn’t stop watching. I heard there are no plans for season 3, how can that be changed",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ithgyd/we_need_a_season_3_of_the_oa/"
    },
    {
        "id": "1ita1n3",
        "author": "MysteriousDelay6266",
        "title": "The Residence | Official Trailer | Netflix",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ita1n3/the_residence_official_trailer_netflix/"
    },
    {
        "id": "1itpw9a",
        "author": "RepublicRecent211",
        "title": "I have a Gift Card on my account but I want to save the amount on it.",
        "content": "Hello, I currently have a Netflix gift card on my account and I want to save the balance on it…I haven’t really been using Netflix recently and I feel like it’s just a waste. I want to save my gift card and pause my account. If I pause my account will it stop charging? (Hopefully this isn’t ridiculous but I don’t really use Netflix that much) ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1itpw9a/i_have_a_gift_card_on_my_account_but_i_want_to/"
    },
    {
        "id": "1itg314",
        "author": "Piggybumm",
        "title": "Gabby Petito documentary ~ Roberta Laundrie’s letter",
        "content": "Well, I guess any one that’s seen this documentary is seething, just like me. Brian’s parents are disgusting and how they were not charged with perverting the course of justice knowing their son had killed Gabby, I don’t know 🤬\n\nAnyway, I wanted to ask a question in relation to Roberta Laundrie’s ‘burn after reading’ letter to her son and this statement in particular: \n\n“If you need to dispose of a body I will show up with a shovel and garbage bags”\n\nIf your child called you to say they’d just killed someone and then came back to the family home would you: \n\na) protect your child from law enforcement questioning?\nand \nb) show up with a shovel and garbage bags to assist with the disposal of the body?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1itg314/gabby_petito_documentary_roberta_laundries_letter/"
    },
    {
        "id": "1itpqrn",
        "author": "mrbourgs",
        "title": "Did I miss anything? Gabby Petito",
        "content": "Brian Laundrie parents get there 1 month after hundreds of people been searching for his remains and found him in 45 minutes one mile away from where the car was parked?\n\nOne month only and his body is already down to the bones? (Ok maybe animal ate him)\n\nNo gun found beside him? \n\nThe mom letter saying she’d do anything to help him. Could they have had enough time to plan something?\n\n\nPlease enlighten me",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1itpqrn/did_i_miss_anything_gabby_petito/"
    },
    {
        "id": "1isxyug",
        "author": "crazycrazybeanz",
        "title": "Gabby Petito Documentary",
        "content": "Did anyone think it was odd how, in the 3rd episode of the documentary, the Petito family spread Gabby’s ashes at the place where she was found dead? It caught me off guard since I feel like most people who are murdered wouldn’t want their ashes to be spread in the park where they were killed.",
        "upvotes": 52,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1isxyug/gabby_petito_documentary/"
    },
    {
        "id": "1isha22",
        "author": "tekavi23",
        "title": "Just Finished : Gabby Petito and I have so many questions",
        "content": "\n- POS killed her &amp; then stole her money to drive home\n\nLegally speaking : \n\n- when she went missing &amp; Brian had her van in Florida, couldn’t cops pressure him to answer questions since he had a van he didn’t own ?! \n\n- after the body was found &amp; there was a FBI wanted for Brian, couldn’t by law the parents be forced to speak ?\n- after Brian went “misssing” &amp; FBI searched the entire area …. The parents went and “found him” within the hour.\n- couldn’t the parents be criminally charged for aiding a murder?!\n ",
        "upvotes": 267,
        "comments": 265,
        "media": null,
        "permalink": "/r/netflix/comments/1isha22/just_finished_gabby_petito_and_i_have_so_many/"
    },
    {
        "id": "1isewv3",
        "author": "MassiveDexterFanGirl",
        "title": "The Laundrie Family are THE worst!",
        "content": "The way they just batted off the police and gave no cooperation at all, nothing to ease the minds of the Petito Family, it's disgusting! \nThey should be charged with perverting the course of justice! ",
        "upvotes": 356,
        "comments": 147,
        "media": null,
        "permalink": "/r/netflix/comments/1isewv3/the_laundrie_family_are_the_worst/"
    },
    {
        "id": "1ith9ca",
        "author": "realdonreset",
        "title": "GHOSTS T3 y T4",
        "content": "Amigos, Netflix solo compró la T1 y T2, saben de alguna página donde poder ver la 3 y 4? Ojalá que no sea de pago. Sé que paramount las tiene pero no quiero pagar. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ith9ca/ghosts_t3_y_t4/"
    },
    {
        "id": "1itpit2",
        "author": "Comfortable_Swim_380",
        "title": "My god does anything happen in the The Witcher.",
        "content": "Or is it is just 900000000000 brain numbing lines about how he's sad about being a The Witcher.  \nI made it 2 episodes.. I think.. I'm done.. That was hell to make it through.\n\nThis is a first.. I quite literally can't watch this.. And I'll give anything a chance.  \nYou know what... you did the game proud. Hes that sad thing that can't just shut-up there as well.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1itpit2/my_god_does_anything_happen_in_the_the_witcher/"
    },
    {
        "id": "1itdbh3",
        "author": "scott_dj",
        "title": "Question about plans.",
        "content": "Can someone describe the new plan structure?  I currently have premium but they've jacked the prices up yet again and I may jump down to the mid-tier. I know it goes from 4K to 1080p and you lose a lot of screens (which are useless now with the password rules)... but my question is the AUDIO.  \n\n From what I can tell it appears other than the premium plan your option is 50-year-old stereo only.  Is it true 5.1/atmos is only available in the ridiculously expensive upper tier plan?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1itdbh3/question_about_plans/"
    },
    {
        "id": "1itaz96",
        "author": "Manjawarrior",
        "title": "Ntflix bugging on Firestick",
        "content": "I have tried to look for an answer but nothing I really tried on here worked. \n\nI have a firestick connected to my TV and whenever I try to watch Netflix on it there seems to be 2 layers of it? There is the full size of the TV, as expected but then a smaller version of inside that playing on top. It causes a lot of the text on screen to bug out, and the characters to appear glitchy and weird.\n\n  \nI have tried force stopping, clearing the cache and data, uninstalling and re-installing, unplugging the firestick from the power and re-connecting it. \n\n  \nI don't think it is a firestick to TV connection issue as the plex I use on there works perfectly fine without any issues. \n\n  \nAll help is appreciated and if there are any more questions feel free to ask, thanks.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1itaz96/ntflix_bugging_on_firestick/"
    },
    {
        "id": "1iswkri",
        "author": "CoconutEast3651",
        "title": "how come peninsula got taken down?",
        "content": "A couple months back, I noticed that Peninsula (sequel to train to Busan) was on the list of movies that was going to be released on February 11, 2025 but I noticed that it's no longer on the list and is not anywhere on Netflix. Why did they not release it? I was kind of excited to watch it tbh.. ",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iswkri/how_come_peninsula_got_taken_down/"
    },
    {
        "id": "1isw9hf",
        "author": "Squid1996",
        "title": "How I made this retro Netflix animation!",
        "content": "",
        "upvotes": 8,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pneygrd8q0ke1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1isw9hf/how_i_made_this_retro_netflix_animation/"
    },
    {
        "id": "1it9dqu",
        "author": "infinityofpearls",
        "title": "Black Warrant TV vs Book! What are the key differences?",
        "content": "I know that the pacing in the book is much faster since it is only 178 pages. But what other significant changes have been made in the series's portrayal of Tihar?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1it9dqu/black_warrant_tv_vs_book_what_are_the_key/"
    },
    {
        "id": "1it8r5t",
        "author": "Powerful-Gain-2641",
        "title": "Looking for Recent Psychological Thrillers/Mysteries",
        "content": "I’m looking for some good psychological thriller or mystery movies/limited series from the last 10 years. I enjoy stories that:\n\n* Have a dark, suspenseful atmosphere\n* Keep me hooked from the very beginning\n* Feature twisted plots with mind games, secrets, or hidden motives\n* Have a serious, realistic tone (no supernatural, sci-fi, or comedy)\n\nSome thrillers I really liked are *Gone Girl*, *Fractured*, *Orphan*, *Copycat*, *Don't Breathe*, *Behind Her Eyes*, and *Hush*. I’d love to find more recent ones with the same kind of tension and mystery.\n\nWould appreciate any recommendations. Thanks!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1it8r5t/looking_for_recent_psychological/"
    }
]