[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 40,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q31rfv",
        "author": "Aware-Platypus-2559",
        "title": "What is a 10/10 series on Netflix that actually has a proper, satisfying ending?",
        "content": "I’m tired of getting burned. I invest 10+ hours into a show, fall in love with the characters, and then Google it only to find out it was cancelled on a cliffhanger in Season 2.\n\nI want to start something knowing the story wraps up intentionally, not because the plug was pulled.\n\nAside from the obvious hitters like *Dark*, *The Queen's Gambit*, or *Breaking Bad*, what are some gems (hidden or popular) that actually stick the landing?\n\nGenre doesn't matter to me as long as the story is complete. I need something binge-worthy for the weekend that won't leave me angry at the end.\n\n",
        "upvotes": 414,
        "comments": 688,
        "media": null,
        "permalink": "/r/netflix/comments/1q31rfv/what_is_a_1010_series_on_netflix_that_actually/"
    },
    {
        "id": "1q2yhkg",
        "author": "caroulos123",
        "title": "Netflix doesn’t hit the same anymore",
        "content": "Lately it really feels like Netflix used to have better shows than it does now. A few years back, things like Stranger Things, Narcos, and Mindhunter felt bigger, more original, and easier to get hooked on. I actually looked forward to new seasons dropping.\n\nNow I open Netflix and spend way too long scrolling, adding things to my list but never pressing play. A lot of new shows feel rushed or forgettable, even if the idea sounds good on paper. I still watch Netflix, but the excitement isn’t the same.\n\nAm I the only one who feels this way, or do you think the quality really changed? Are there any newer shows that gave you that old Netflix feeling again?",
        "upvotes": 300,
        "comments": 121,
        "media": null,
        "permalink": "/r/netflix/comments/1q2yhkg/netflix_doesnt_hit_the_same_anymore/"
    },
    {
        "id": "1q2y3of",
        "author": "peoplemagazine",
        "title": "Stranger Things Finale: What Happened to Erica, Murray and Mr. Clarke? The Duffer Brothers Weigh In",
        "content": "",
        "upvotes": 208,
        "comments": 117,
        "media": null,
        "permalink": "/r/netflix/comments/1q2y3of/stranger_things_finale_what_happened_to_erica/"
    },
    {
        "id": "1q39ryk",
        "author": "Silly-Dot-2322",
        "title": "Highly recommend \"The following\"",
        "content": "A friend of mine, quite a while ago, recommended this series to me. I watched and was hooked! \n\nI just logged on to my Netflix, and it's on! \n\nI highly recommend. ",
        "upvotes": 31,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1q39ryk/highly_recommend_the_following/"
    },
    {
        "id": "1q2yc05",
        "author": "Dapper_Telephone_117",
        "title": "What the hell is Emily in Paris?",
        "content": "I’m just here to hate for a second and just see what everyone thinks. I’ve never really watched Emily in Paris, so I do not have in depth analysis nor do I know the correct terms for screenwriting or cinematography techniques. Anyways, my family has been watching the latest season during the holidays so I’ve seen a few clips here and there and just sat down to watch a full episode with my mom \n\nThe first thing I noticed is that this show is like in ultra HD. Everything is so detailed and at the same time layered in a thick coat of matte that it literally hurts my eyes. The world is just too spotless and it’s uncanny to watch. \n\nWhy does the world seem to exclusively revolve around Emily? Almost every scene is structured in a way that seems like the other characters only react when Emily walks in or does something. It gave me the feeling of playing a video game and getting a dialogue prompt. Also, multiple times in the episode Emily would effortlessly just resolve issues or make the correct decision and everything just works out for her (minus the main drama with her best friend sleeping with the guy I assume is her ex). Is no one else capable of having a good idea or an original thought? \n\nThe writing and staging is just horrendous. Every scene is like 30 seconds long because the characters just say what needs to be said in order to continue dragging the decaying corpse the show calls a plot. In the last scene of this episode Emily is firing this intern or whatever (because her boss can’t?) and this girl rebuttals by telling her that her best friend and possibly ex are sleeping together and that everyone knows except her. Meanwhile Julian is unnaturally standing in the background just looking at this conversation unfold. He only reacts once Emily looks at him and his response is literally to ignore the betrayal on Emily’s face and to escort the intern out of the building because Mindy is queued in for the ‘big reveal’. Mindy literally just walks in while Emily is visibly distraught and just starts talking… 😒😒😒\n\nWhy are these characters so one dimensional? Why is the dialogue so stale? Why does Emily feel so unnatural? How on earth did this show get popular enough to warrant a (fifth?) season? \n\nI obviously know that I am not the target demographic for this kind of show, but common? I would expect everyone to hold their favorite genres to a high standard. This show just seems so poorly done and I hate that  this is the state our shows are in, baffling. ",
        "upvotes": 60,
        "comments": 81,
        "media": null,
        "permalink": "/r/netflix/comments/1q2yc05/what_the_hell_is_emily_in_paris/"
    },
    {
        "id": "1q2eo56",
        "author": "zekevich",
        "title": "Netflix's \"second screen\" writing ideology doesn't give me hope for Netflix's future releases.",
        "content": "Them basically writing shows to \"accommodate\" for the idea that people are probably going to be scrolling on their phones while watching them, so they simplify and dumb down their shows so people can still understand what's going on while paying attention to something else. [x](https://medium.com/enrique-dans/second-screen-viewing-netflix-succumbs-to-the-dictatorship-of-the-smartphone-6b639c829fec)\n\nand quite frankly, I think this is a horrible idea. one that's going to do more harm than good. we should ***not*** be dumbing down media and art as a whole *just because* some people *might* not happen to be paying full attention.\n\nand Stranger Things 5 was a clear example of this. a good majority of the dialogue was overexplainy, exposition dumpy, unnatural and held your hand and basically treated you like you were stupid.\n\nand if THIS is any indicator of how netflix is about to write their shows in 2026 and onward? respectfully count me out, because..... 😬",
        "upvotes": 833,
        "comments": 74,
        "media": null,
        "permalink": "/r/netflix/comments/1q2eo56/netflixs_second_screen_writing_ideology_doesnt/"
    },
    {
        "id": "1q34x93",
        "author": "Thissuxxors",
        "title": "Just watched 2 bangers on Netflix, any others on there?",
        "content": "The first is Abigail, I saw it being advertised and ranked #2 in the country I'm in, and being a fan of horror I decided to watch it. I was pleasantily surprised at what a clever and fun horror movie it was, definitely recommended if you like horror films.\n\nToday I was going through my List and saw that I had added - It's What's Inside and so I decided to watch it. It's the kind of movie where it tempts you to switch it off in the first 20 mins, but oh man, am I glad I didn't. It's an absolutely brilliant movie. Yeah, it has a few flaws, but at the end of it, I was thinking what the hell did I just watch, but in a good way!\n\nCan't recommend this enough. You will be pausing quite a bit because it will twist and turn your brain!\n\nAny other good reccomendations?",
        "upvotes": 18,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q34x93/just_watched_2_bangers_on_netflix_any_others_on/"
    },
    {
        "id": "1q36nqz",
        "author": "zapns",
        "title": "When hiding items from your watch history, is the account owner notified?",
        "content": "Title. I want to watch Stranger Things and my parents are very anti-supernatural things so they would not be fond of me watching it. They check my continue watching all the time and I am unsure if they check the viewing history. ",
        "upvotes": 15,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1q36nqz/when_hiding_items_from_your_watch_history_is_the/"
    },
    {
        "id": "1q316ib",
        "author": "WestRelationship415",
        "title": "My wishes for Netflix",
        "content": "As a long time US based Netflix user there are a few wishes for the platform.  \n1/ Don’t recommend a show I have already watched and rated \n2/ clear indication in the description of base language\n3/ continue with the ‘Hot, New, Coming soon’ section and documentaries.  \n\n\nThat’s it -Simple, right?",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q316ib/my_wishes_for_netflix/"
    },
    {
        "id": "1q2squl",
        "author": "Sylverpepper",
        "title": "Stranger Things is quite something !",
        "content": "I just rewatched ALL of Stranger Things to be ready for season 5, and honestly, I loved it all over again. This series is really special and so amazing! I understand why it's so successful. I think it's meant to be watched back-to-back without waiting two years between seasons. It's not the same! And during season 5, I really felt something. It's off to a great start!\n\nIn any case, I've rarely seen people satisfied with the ending of a popular masterpiece. Whether it's a series or an anime, people are always disappointed with the ending. It's not easy to conclude a long adventure and satisfy everyone.",
        "upvotes": 27,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1q2squl/stranger_things_is_quite_something/"
    },
    {
        "id": "1q3codj",
        "author": "greennurse0128",
        "title": "Found",
        "content": "Im surprised I didn't find any topics on this. Has a late night CW or old USA feel. But better. Good story lines. Each character is more damaged than the next. End of every episode im saying *this is so f&amp;cked up*. Good show. \n\nAnyone else watching? Currently finishing up season one.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q3codj/found/"
    },
    {
        "id": "1q36pqa",
        "author": "Time-Cash-4637",
        "title": "American Man-hunt series",
        "content": "I’ve just stumbled across the American Man-hunt series on Netflix and I thought that they were absolutely fantastic.\n\nOsama bin laden was probably the pick out of the bunch with the Boston Bombers a close second. I feel like you got more exposure into the past and there day to day lives leading up to the events, I’ve learnt more in these doco-series on Netflix then watching national geographic or the discovery channel. \n\nAre they going to make more on different subjects in America or is the three on Netflix now it?, it’d be shame if they just stopped it.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q36pqa/american_manhunt_series/"
    },
    {
        "id": "1q35qd8",
        "author": "Specialist-Ad-3133",
        "title": "Stuck on the loading screen",
        "content": "Hello everyone,\n\nIm watching netflix on my Sharp tv\n\nI use browser called BrowseHere where i go to Netflix \n\nI can log in and and choose the shows but my screen stays on loading while i can hear the sound of show in the background but it just stays loading \n\nDidnt have this problem three days ago\n\nThe situtation…\nhttps://imgur.com/a/9qwhq1f\n\nCan anyone help please?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q35qd8/stuck_on_the_loading_screen/"
    },
    {
        "id": "1q2xdl7",
        "author": "Quick_Dot_9660",
        "title": "Harlan Coben - British Adaptations?",
        "content": "So I've recently learnt Harlan Coben is American and a bulk (maybe all) of his books are set in the US but there's a large portion of his adaptations on netflix are set in the UK in kind of non descript vaguely liverpool/manchester suburbs. \n\nDoes anyone know why? It's not usually something that happens with adaptations I was wondering if anyone had any production scoops.",
        "upvotes": 8,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1q2xdl7/harlan_coben_british_adaptations/"
    },
    {
        "id": "1q3cfxr",
        "author": "Butterfly__333",
        "title": "Netflix pauses movies after a few seconds; unable to unpause them.",
        "content": "I don't watch netflix much on my laptop, and every time I try to watch, it plays about 10-15 seconds of a movie or show (Just enough to get through opening credits) then the audio cuts out, then a second later the visuals just get stuck on whatever frame. It appears to be paused, but regardless of anything I do I can't unpause it. I've had this issue for almost a year. I have a chromebook and I watch netflix in-browser. My netflix account is logged into on other devices in the home but I don't try to use it when someone else is watching netflix so that's not the issue. I just wanna be able to watch stuff again!! Is anyone else having this issue or knows what to do about it?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q3cfxr/netflix_pauses_movies_after_a_few_seconds_unable/"
    },
    {
        "id": "1q36x99",
        "author": "ashuash0123",
        "title": "Run away",
        "content": "What was the expression of Simon Greene at the end. It was like he realised something but not sure why he was nodding at the end. \nNice series though. Every second of the series was interesting ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1q36x99/run_away/"
    },
    {
        "id": "1q3bo4c",
        "author": "harpreetthind",
        "title": "Question about Stranger Things",
        "content": "Just got done watching Stranger Things and you guys were right in the season after season two season three is definitely not that great. I had to rewatch it again actually just to watch the part where where world was older and the part where they went to the mall and the movie theater.\nSorry for the typing errors. I’m a visually impaired person so I have to use dictation.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1q3bo4c/question_about_stranger_things/"
    },
    {
        "id": "1q3b61i",
        "author": "SkyGroundbreaking910",
        "title": "Run Away question—NO SPOILERS PLEASE!",
        "content": "In the first episode, we see Simon and Ingrid’s daughter Anya (the one still living at home who is in school) in a wheelchair in public places, but walking at home. I’ve started ep. 2 and she’s back in the wheelchair at the hospital to visit her mom. I’m not crazy! I took screenshots and even backed up to the walking scene to make sure it’s the same character. Do they address this?? Sorry if I’m just being impatient but it’s really distracting me from the already busy plot lines. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q3b61i/run_away_questionno_spoilers_please/"
    },
    {
        "id": "1q3b4rp",
        "author": "Equivalent_Friend_12",
        "title": "Fuja by Harlan Coben",
        "content": "Impressão minha ou realmente houve uma preocupação com a escalação de um elenco bem diversificado e fora dos padrões de beleza e idade normalmente utilizados em produções dessa magnitude?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q3b4rp/fuja_by_harlan_coben/"
    },
    {
        "id": "1q3axgq",
        "author": "Emotional-Chipmunk12",
        "title": "What are some Netflix movies that you wish got a theatrical release?",
        "content": "Here are a few of my picks:\n\nFatherhood (2021) (This one was originally supposed to be in theaters, but because of COVID, it was sold to Netflix.)\n\nThey Cloned Tyrone (2023)\n\nLift (2024)\n\nMurder Mystery 2 (2023)\n\nPee-Wee's Big Holiday (2016)\n\nThe Guilty (2021)\n\nInto the Tall Grass (2019)\n\nThe Christmas Chronicles 1 + 2",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q3axgq/what_are_some_netflix_movies_that_you_wish_got_a/"
    },
    {
        "id": "1q2m94q",
        "author": "Known_Broccoli_4274",
        "title": "Give netflix some credit",
        "content": "People moan a lot about Netflix, saying it's poor content but I have to say, I don't agree. I get we all like different things and genres but Netflix has some incredible originals they've made: virgin river, Ransom Canyon, Leanne, you. I think it's still worth money and getting the ad free for a few extra pounds definitely enhances user experience\nThe only negative I have is that they've got rid of friends &amp; the big bang theory...not many own a dvd player anymore and Netflix was the only platform that showed these series without having to purchase each individual season etc. Just my opinion 🩷",
        "upvotes": 25,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1q2m94q/give_netflix_some_credit/"
    },
    {
        "id": "1q2clxr",
        "author": "Vegetable_Engine_463",
        "title": "Anyone watched Members Only: Palm Beach? Is this really how wealthy Americans look and behave?",
        "content": "I watched Members Only: Palm Beach and the whole time I had a very odd feeling, like something was off. Visually everything checks out: luxury cars, massive mansions, yachts, ocean views, etc.\n\nAt the same time, the people in the show feel strange. The outfits look cringe and overloaded, kinda Chinese market-style. The overall vibe comes off as kitschy. In Europe this aesthetic disappeared a long time ago. In Italy if someone dressed like this showed up at a high-end event here, the reaction would be… complicated. Real wealth here usually shows through restraint, quality, and taste. Loud luxury feels outdated by decades.\n\nBecause of that, the show feels staged. Expensive scenery, dramatic behavior, exaggerated styling.\n\nAmericans, is this an accurate reflection of how wealthy elites in the US actually look and behave, especially in places like Palm Beach? Or is this more of a dressed-up TV version made for drama?",
        "upvotes": 88,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1q2clxr/anyone_watched_members_only_palm_beach_is_this/"
    },
    {
        "id": "1q1rl8k",
        "author": "GuineaPKilledMe",
        "title": "Dave Chappelle - The Unstoppable",
        "content": "I have never seen something so unfunny in a long time. Genuinely what happened to this dude?? I mean I know what happened, but all he does it spew bitterness and hate.\n\nHe immediately came out preaching and ranting. Idek when he's actually telling jokes because all he does is go on and on about how he can't do this and can't do that. What a whiny baby.\n\nI used to love his standup specials. I just cannot believe that almost ten years later this man can absolutely not let anything go. I turned it off twenty minutes in without cracking as much as a smile.\n\nEdit: Some of y'all are so far up Dave Chappelle's ass that you're sending me Reddit Care alerts. You are a absolute pathetic loser to do that. Please grow up and choose to use those when someone is actually in dire need of help. I do not need help because I find your favorite comedian to be a bitter old man who rants at the clouds.",
        "upvotes": 966,
        "comments": 421,
        "media": null,
        "permalink": "/r/netflix/comments/1q1rl8k/dave_chappelle_the_unstoppable/"
    },
    {
        "id": "1q2xlox",
        "author": "Alicewithhazeleyes",
        "title": "The Serpent… looking for other things like it",
        "content": "Was so good. I don’t usually binge shows but I absolutely did this one and then binged Monster of Florence after. I’m looking for something similar to these. I don’t mind dubbed shows for English or reading subtitles. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q2xlox/the_serpent_looking_for_other_things_like_it/"
    },
    {
        "id": "1q22won",
        "author": "Prestigious-Play8863",
        "title": "Everyone who finished the Stranger Things finale, did it feel… off?",
        "content": "Everyone who finished the Stranger Things finale, did it feel… off?\n\nWatched it yesterday and I’m still sitting with it. Not angry, not impressed, just oddly underwhelmed. \n\nFeels like there was so much build-up for something that didn’t fully hit emotionally.\n\nAm I alone in this or did it leave you feeling the same way?\n\nHere's a detailed review -\nhttps://medium.com/@fbgmb/i-watched-the-stranger-things-finale-and-wait-thats-it-3ebde2924f9e",
        "upvotes": 96,
        "comments": 275,
        "media": null,
        "permalink": "/r/netflix/comments/1q22won/everyone_who_finished_the_stranger_things_finale/"
    },
    {
        "id": "1q20n8a",
        "author": "emanuele94",
        "title": "Questions about Stranger Things",
        "content": "1. Why does Vecna need to open four gates in Season 4, but then in Season 5 he changes his plan and needs twelve children instead?\n\n2. Why does Vecna need twelve children on his side to bring the Abyss to Earth?\n\n3. Why does Vecna wait years before acting directly?\n\n4. Why, in the Abyss during the final showdown, are there no other creatures present (demogorgons, demodogs, demobats, etc.) besides the Mind Flayer? Did they join him spontaneously (as if that were a good strategy…)? Were they all in the Upside Down? Were they all dead? Who knows!\n\n5. Why is Mike’s mother able to move freely around the hospital with a gas tank and hide it inside one of the dryers without any demogorgon noticing?\n\n6. Why do the military, once they become aware of the “beanstalk” plan, do nothing to stop it?\n\n7. Why does Vecna, once he learns about the “beanstalk” plan (through Kali’s memories), do nothing to stop it?\n\n8. Why, inside Henry’s mind, does Holly need to pull out the “Rise of Skywalker” move, with binoculars?\n\n9. Why, once Eleven disappears, do the military decide to abandon the town and all the protagonists as if nothing had happened? Nancy and Hopper should end up in prison for at least manslaughter. Instead, Hopper regains his job as sheriff and even considers a career advancement.\n\n10. Why is a huge creature like the Mind Flayer unable to kill the protagonists in the final battle (with legs as big as an apartment building, which everyone easily dodges with a somersault)? And how do the protagonists manage to climb to the top of a canyon so quickly?\n\n11. Why, all of a sudden, can everyone enter and exit the Upside Down without needing an oxygen mask anymore?\n\n12. Why isn’t Max blind after coming out of her coma?\n\n13. Why is Joyce involved in extremely dangerous missions and plans, despite often having no real active role and providing no significant contribution?\n\n14. Why do the characters think it’s a good idea to stop and talk and deepen their relationships in the middle of very intense action scenes?\n\n15. Why do gravity, air, sound, etc. work normally in the Abyss just like on Earth? Very convenient for playing “space explorers”!\n\n16. Why is Vecna able to activate long-distance mind control over Hopper?\n\n17. Why does Vecna kill following “ritualistic” patterns instead of attacking en masse?\n\n18. Why is Eleven able to defeat 001 as a child but not as an adult (at least initially)?\n\n19. Why doesn’t Vecna kill Eleven immediately when he has the chance?\n\n20. Why are Jonathan and Nancy not even slightly injured by the slimy substance that forms after they attack the shield generator?\n\n21. Why does Henry receive an interdimensional stone with black dust and turn into a murderous madman?\n\n22. Why does the Mind Flayer change form and strategy every season? If his goal is to infest Earth, he had countless opportunities to do so (and couldn’t he have the demogorgons carry stones with black dust to possess other people, as he did with Henry)?\n\n23. Why does no one in Hawkins, besides the protagonists, wonder what is happening? No one comes up with conspiracy theories?\n\n24. Why does no one outside Hawkins take an interest in this town? Does no one have friends or relatives outside the city? What is the government doing? No external journalists investigate?\n\n25. Why do a bunch of kids always manage to figure everything out before scientists and the military?\n\n26. Why do parents tolerate such prolonged absences and/or so easily accept absurd or incomplete explanations?\n\n27. Why is the Abyss “frozen” on the day Will disappeared?\n\n28. Why does Will, despite having survived, attract no interest from the military? (There must be surveillance footage showing him fighting off demogorgons.)\n\n29. Why don’t the demogorgons in the laundry room hear the music Lucas plays to save Max?\n\n30. Why does no one seem to notice the gigantic walls surrounding the Upside Down before Season 5? Excluding Dr. Brenner—judging by the notes he wrote and then forgot in the Upside Down lab—when did he produce them? And why is there no trace of this information in the real Hawkins lab?\n\n31. Why is Eleven even capable of generating wormholes? It has been confirmed that she accidentally created the Upside Down in 1983.\n\n32. Why is Eleven able to hurl people into other dimensions? She is the one who threw Henry/001 into Dimension X / the Abyss.\n\n33. Who or what created the shield generator in the lab that keeps the Upside Down intact? Was it Eleven when she created the bridge?\n\n34. Why is Dimension X / the Abyss the only dimension trying to interfere with Hawkins?\n\n35. Why is Suzie no longer mentioned? Why aren’t Robin and Vickie included in the finale? Why are unresolved subplots left hanging?\n\n36. Why does the fate of characters like Dr. Kay remain ambiguous?\n\n37. Why does Nancy suddenly appear skilled with weapons, without any explanation or prior training?\n\n38. Why do demogorgons switch from being intelligent predators to almost stupid monsters, depending on the circumstances and the characters involved in a given scene?\n\n39. Why do the disappearance of dozens of people, numerous deaths, and the presence of giant monsters not lead to serious investigations or intervention by the press or the FBI?\n\n40. Why, in Season 5, do the vines no longer have any significance, when up until Season 4 simply touching them disturbed the hive mind?\n\n41. Why do the characters constantly seem on the verge of death but then survive (after a few seconds, a few episodes, or from one season to the next: Hopper, Nancy and Jonathan, Steve, Eleven)?\n\n42. Why did Vecna specifically take control of Will in Season 1 and not other kids?\n\n43. Why does the wormhole show only Hawkins in the Upside Down?\n\n44. Why do the Russians disappear entirely? Why do they no longer spy on operations in Hawkins, considering that even kids manage to do so with the help of a high school physics teacher?\n\n45. Why doesn’t Vecna maintain a constant army, and why doesn’t he fully exploit it?\n\n46. Why is Max able to graduate despite having missed almost two years of school?\n\n47. Why do Joyce and Hopper never talk about Henry, even though they went to school with him?\n\n48. Why does every season have to “reset” the world as if nothing had happened before?\n\n49. Why is Vecna not mentioned at all in the early seasons?\n\n50. Why does this series handle certain narrative turning points in such a sloppy way (\"good enough, let’s go!\")?\n\n",
        "upvotes": 133,
        "comments": 141,
        "media": null,
        "permalink": "/r/netflix/comments/1q20n8a/questions_about_stranger_things/"
    },
    {
        "id": "1q27y2d",
        "author": "Mucek121",
        "title": "What are your top 6 Netflix shows ever?",
        "content": "What are your top 6 Netflix shows ever?\n\n\n\nMine top 6 are  :\n\n\n\nOzark\n\n\n\nPeaky Blinders\n\n\n\nStranger Things\n\n\n\nQueen's Gambit\n\n\n\nThe Last Kingdom\n\n\n\nHaunting of Hill House",
        "upvotes": 43,
        "comments": 166,
        "media": null,
        "permalink": "/r/netflix/comments/1q27y2d/what_are_your_top_6_netflix_shows_ever/"
    },
    {
        "id": "1q2xvul",
        "author": "koolloso",
        "title": "Stranger Things Finale Digital Cinema Package (DCP)",
        "content": "Does anyone have insight or a theory on how DCPs were distributed for this release?\n\nIf Netflix didn’t make any money from the screenings, I’d guess they’d also not want to spend a lot of money to provide hundreds of DCPs for the screenings. \n\nI saw it in two theaters. I saw it first in the actual theater (Tara Atlanta) that Lucas and Max were at in the montage at the end of the episode. There, it appeared to be a 2K projection. I also saw it in a standard Regal theater which appeared to be a 4K projection.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q2xvul/stranger_things_finale_digital_cinema_package_dcp/"
    }
]