[
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 72,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lp8idy",
        "author": "BeautifulLeather6671",
        "title": "Tires renewed for season 3",
        "content": "",
        "upvotes": 87,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1lp8idy/tires_renewed_for_season_3/"
    },
    {
        "id": "1lp8qv3",
        "author": "PixlStarX",
        "title": "Need Some Netflix Gold Suggest Your Best Series!",
        "content": "Hey folks!\nI’m on the hunt for a solid Netflix series to dive into something that really pulls you in, episode after episode. \n\nI’m open to anything: thriller, drama, comedy, sci-fi, mystery, foreign language, even documentaries if they’re binge worthy.\n\nJust looking for something with great storytelling, strong characters, or a vibe that sticks. Drop your favorites old gems or recent drops I’ll take all the suggestions I can get!\n\nLet me know what blew your mind 👇🍿",
        "upvotes": 34,
        "comments": 146,
        "media": null,
        "permalink": "/r/netflix/comments/1lp8qv3/need_some_netflix_gold_suggest_your_best_series/"
    },
    {
        "id": "1lpbk7z",
        "author": "Top-Three-USA",
        "title": "‘Squid Game’ Season 3 Sets a New Netflix Record With 60.1 Million Views in Three Days, Becoming One of The Platform’s Top Non-English Series Ever",
        "content": "",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lpbk7z/squid_game_season_3_sets_a_new_netflix_record/"
    },
    {
        "id": "1low3ws",
        "author": "isa_bru",
        "title": "I have to confirm I live at my house everytime I want to use netflix",
        "content": "So, I still live with my parents, and my mother pays for this netflix account. Sometimes when I'm bored at my boyfriend's house, I log in to netflix in his computer and watch my favorite series, my boyfriend doesn't even use the account, as he says there is nothing good on netflix. Theres no illegal account sharing, I live at my house. Like, bro, I get it they really needed to save those few bucks they lost from people sharing accounts, but now every time i access netflix, whether at home or not, I have to call my mother to get that stupid confirmation code to confirm I actually live at my house.\nThat's ridiculous, we pay such a high price for a service we supposedly can use at any time, anywhere, but as soon as someone decides to watch netflix away from home they will annoy you into leaving the platform and getting a membership from one of their competitors. ",
        "upvotes": 62,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1low3ws/i_have_to_confirm_i_live_at_my_house_everytime_i/"
    },
    {
        "id": "1loy3xm",
        "author": "feather-stone2353",
        "title": "Trainwreck: The cult of American Apparel",
        "content": "I am shocked at the level of abuse in this! How people were able to put up with that level of disrespect and emotional abuse is astonishing. This is the blueprint of a toxic work environment. I'm only 30 mins into the documentary and I'm beyond disgusted with Dov Charney...sleazy and shady. Why is it always the same type of men exploiting young people and popular culture.  ",
        "upvotes": 33,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1loy3xm/trainwreck_the_cult_of_american_apparel/"
    },
    {
        "id": "1lpgmz9",
        "author": "TurbulentAd3429",
        "title": "Good movie or tv show",
        "content": "I just finished Elite. I must say it was kinda life-changing. I was never one to watch tv shows but now i’m on a nonstop grind to find another like it. What should I watch next?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lpgmz9/good_movie_or_tv_show/"
    },
    {
        "id": "1lpasit",
        "author": "Top-Three-USA",
        "title": "Netflix Renews Shane Gillis Comedy ‘Tires’ for Season 3, Set to Premiere in 2026",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lpasit/netflix_renews_shane_gillis_comedy_tires_for/"
    },
    {
        "id": "1lpg4mv",
        "author": "Rlliuorb",
        "title": "Ads on the Standard (no-ads) plan?",
        "content": "I am watching the replay of this week's RAW and starting this week, I am forced to watch ads even though I am on the Standard (no-ads) plan, when it always skipped them in the past. is anyone else experiencing this? ",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1lpg4mv/ads_on_the_standard_noads_plan/"
    },
    {
        "id": "1lpahf0",
        "author": "Accomplished_Job1904",
        "title": "Guys suggest somethin like strangers things, The dragon prince, lockwood and co. wednesday typii",
        "content": "i have already watched most of the fanstasy stuff on netflix so dont know what to watch next.. Already watched shadow and bone, dark, carnival row, arcane, so suggest something like that ... really want to watch some fantasy kind of stuff.. also love animated ones too ...",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lpahf0/guys_suggest_somethin_like_strangers_things_the/"
    },
    {
        "id": "1lpapah",
        "author": "thewhippersnapper4",
        "title": "Squid Game Season 3 Smashes Another Viewing Record For Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lpapah/squid_game_season_3_smashes_another_viewing/"
    },
    {
        "id": "1lph4lf",
        "author": "toastymalbogesmores",
        "title": "The last episode of season 1 of the Sandman makes me feel like Neil Gaiman got to live out his fantasies sponsored by Netflix 👀",
        "content": "With season 2 coming out this week, I’m revisiting the whole separating the art from the artist debate.  \n\nThe question: Would you still watch it if it was your sister or daughter who accused him?\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lph4lf/the_last_episode_of_season_1_of_the_sandman_makes/"
    },
    {
        "id": "1lpe24h",
        "author": "PitchPlayful5139",
        "title": "Sirens explained from my POV - a show about mental illness",
        "content": "If you see the story from the point of view of Devon and Simone you can understand better that they were struggling with mental illness (both their parents did - pretty sure they both had psychosis, their parents showed symptoms of bipolar; schizophrenia, severe depression). These disorders are genetical so it makes sense that Devon and Simone struggled with mental health and they were also showing symptoms - remember that Devon also said to Simone that she is not taking her medication. At the end of the movie you see how Simone got very triggered by the fact that Kiki found out about the \"kiss\" and she got fired...Simone started to switch and got into a mixed, mania episode...\n\nKiki and her husband showed signs of Narcissim, manipulation etc\n\nI think this show is about mental illness and how mania, psychosis looks - a lot of people don't understand at all how bipolar, schizophrenia, schizoaffective disorders are like ( I am commenting as someone who has schizoaffective bipolar disorder). throughout the all episodes you can see hallucinations, the struggles etc. Even Devon thinking that Kiki has a cult...Devon gets very paranoid about Kiki and starts to have all this stories about cults, how she is killing people etc...when in reality Kiki is not an evil monster...she is just a woman with lots of money, and probably a bit narcissistic and manipulative.\n\nI think the show is also about trauma bonding between people whith mental illness like bipolar/schizophrenia with people who has narcissistic tendencies. It's well known that people on schizophrenia spectrum can be very easy to manipulate and usually are the victims. It's interesting to view the show as a person who has the disorder because throughout the whole show no one time is mentioned a disorder name. It is only mentioned that Simone and their Dad are taking medication or they should; Simone's and Devon's mom tried to kill them and then killed herself and that Devon struggles with addiction and now she is sober.  Throughout the whole show it has this feeling of everything being a hallucination, a mesmerizing or paranoia vibe ...seeing something that is not real...like a Siren - is how psychosis or mania can feel like, very good depiction. \n\nAs someone who experiences mania, depression it looks very similar with how Simone was. You can see her behavior throughout the show but especially in the end. She was shocked when she was fired and after that she got triggered when her dad said \"it will be us 2 again and we try again to be good\" she was so scared that she went back and this could also trigger a mania episode in her (mania can be triggered by high stress) and then she immediately and impulsively jumps into Peter's arms. Then the scene where she is all dressed up and she talks with her sister Devon - look at that scene where she appears like she is on drugs, like it is not real, everything moved so fast to her being the new wife, giving up her loyalty to Kiki so quickly, her being showed on that hill with the big house in her background, everything being so grandiose, quick, mesmerizing - this how mania feels",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lpe24h/sirens_explained_from_my_pov_a_show_about_mental/"
    },
    {
        "id": "1lotwqq",
        "author": "Historical-Phrase106",
        "title": "Dept Q",
        "content": "I’m absolutely loving Dept Q… \nWhat are your thoughts on this series?  I am rewatching it because I feel like I missed a lot of important parts the first time around… I know Matthew Goode’s character Carl gets a bad rap, but I feel like his cockiness and sarcasm makes the show.. ",
        "upvotes": 17,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1lotwqq/dept_q/"
    },
    {
        "id": "1lox6gp",
        "author": "Artistic_Spinach_589",
        "title": "What is your favorite official Netflix TV show character?",
        "content": "BTW it is also okay if you put a kids character (like Gabby's Dollhouse) Also, make fanart of the character, but if you don't want to, that is okay, just put a picture of the character",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lox6gp/what_is_your_favorite_official_netflix_tv_show/"
    },
    {
        "id": "1lpbj0t",
        "author": "Mateoooo808",
        "title": "How does netflix work if I dont have a Household",
        "content": "So i move around a lot for work I dont have a set place that I frequent often because im always driving from state to state. Am I still able to use netflix or nah",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lpbj0t/how_does_netflix_work_if_i_dont_have_a_household/"
    },
    {
        "id": "1lp73ea",
        "author": "OverthinkingMomo",
        "title": "Recommend some webseries based around sense of small town community and family.",
        "content": "My cousin just moved abroad and feels a sense of craving for neighbours, family etc being one tight knit community.\n\nSome shows she loves include Reply 1988, schitts creek, superstore, midnight diner.\nWondering if y’all could recommend some more of such shows that feel close to home?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lp73ea/recommend_some_webseries_based_around_sense_of/"
    },
    {
        "id": "1lo1clp",
        "author": "Weird-Personality-31",
        "title": "get rid of netflix games.",
        "content": "I want the option to disable games. I want it gone.\n\nI hate the fact that they use money which we paid to make stupid games. this is not what netflix is about.\n\nIf I want to game I will buy my AAA games.\n\nBe gone with this trash!!",
        "upvotes": 454,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1lo1clp/get_rid_of_netflix_games/"
    },
    {
        "id": "1lp5qeo",
        "author": "No_Debt8277",
        "title": "watch Tudum 2025?",
        "content": "I wanna watch Netflix Tudum 2025, but cant find it on Netflix anymore. Is it not available anymore? \nIf so, anyone know where I can watch it for free? (not reactions-videos)",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lp5qeo/watch_tudum_2025/"
    },
    {
        "id": "1low1y6",
        "author": "Fun_Molasses5215",
        "title": "Liam Payne to be given heartbreaking tribute in Netflix series that he filmed before his passing",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1low1y6/liam_payne_to_be_given_heartbreaking_tribute_in/"
    },
    {
        "id": "1lohwhc",
        "author": "brianfagioli",
        "title": "NASA teams with Netflix to stream rocket launches and spacewalks this summer",
        "content": "NASA is bringing its live space content to Netflix this summer. From rocket launches to astronaut spacewalks, the streaming platform will now beam space directly into your living room.",
        "upvotes": 39,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lohwhc/nasa_teams_with_netflix_to_stream_rocket_launches/"
    },
    {
        "id": "1lp3urx",
        "author": "freyaxx04",
        "title": "dubbing problems",
        "content": "so basically i watch a lot of asian movies and shows, and ive never had an issue like this before however everytime i go to watch something it automatically goes onto dubbed, even though i’ve previously changed it into its original language. I thought it was just happening with one show i was watching but i came to find out it’s all of my other foreign things.\n\nalso idk if this means anything but it just started happening since ive arrived on holiday abroad.\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lp3urx/dubbing_problems/"
    },
    {
        "id": "1lp9617",
        "author": "GoldDerby",
        "title": "2025’s 10 best TV shows so far: ‘Adolescence,’ ‘Cobra Kai’ among our editors’ top picks",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lp9617/2025s_10_best_tv_shows_so_far_adolescence_cobra/"
    },
    {
        "id": "1los067",
        "author": "EfficiencyPrudent330",
        "title": "Shark 🦈 Whisperer",
        "content": "So profound, emotional, intriguing &amp; educational. I recommend for the whole family and I hope this show gets more people interested in preserving our great animals of the sea ",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1los067/shark_whisperer/"
    },
    {
        "id": "1lolza3",
        "author": "MaverickWithANeedle",
        "title": "OLD GUARD II DROPS TOMORROW !!!",
        "content": "So excited!!!!! I cannot wait for the sequel to this movie. I wonder what direction they will go with it. Is there even a trailer out for it yet? Idk haven’t actually seen it if so. Just saw it was coming, so I hit the notification button, and have patiently waited a month. Actually longer if you count from when the first movie released. Anyway just thought I’d share my excitement haha ",
        "upvotes": 17,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lolza3/old_guard_ii_drops_tomorrow/"
    },
    {
        "id": "1lovtmg",
        "author": "helplesslyhopinggg",
        "title": "Question for squid game lovers, would you take the salesman up on his game? Where you either get slapped or win $74(usd)?",
        "content": "I’m curious to see if anyone wouldn’t take this offer up. I would in the blink of an eye. I would let someone slap me over and over in exchange for $75. And if you WOULDN’T play this game, what do you do for work? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lovtmg/question_for_squid_game_lovers_would_you_take_the/"
    },
    {
        "id": "1lpfbw3",
        "author": "Yumikari1",
        "title": "Will Netflix ever add some goddamn subtitles for anime",
        "content": "Hey guys, \n\nhow does this make sense for Netflix to add really good anime titles and not at least add English subtitles??? \n\nI don't understand??? \nLike... This is basic common fking sense! \nam I crazy or something??\n\nI obviously don't understand Japanese!! \n\nThis is so ridiculous! \n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lpfbw3/will_netflix_ever_add_some_goddamn_subtitles_for/"
    },
    {
        "id": "1lp166c",
        "author": "Ivy1974",
        "title": "Years ago",
        "content": "In the days when Netflix started to stream after mailing DVD’s they used to have the option to select things that were in movies to remove from your account of viewing. I take it that is long gone?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lp166c/years_ago/"
    },
    {
        "id": "1lofr2h",
        "author": "x_aphrodite_0x",
        "title": "K-drama recommendations? 💕",
        "content": "I've noticed there's lots of k-dramas on netflix and I really wanna start watching some however I just don't know what to watch!! 💕\n\nI've watched true beauty and I really enjoyed it!! However, I'm looking for a more shorter series..?\n\nI don't really mind what I get recommended however I'm not a big fan of severe violence/gore!! Thank youuuu!!!",
        "upvotes": 30,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1lofr2h/kdrama_recommendations/"
    },
    {
        "id": "1low1oz",
        "author": "TimesandSundayTimes",
        "title": "Meet Squid Game’s standout star, Park Gyu-young",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1low1oz/meet_squid_games_standout_star_park_gyuyoung/"
    },
    {
        "id": "1lorm66",
        "author": "ScottShawnDeRocks",
        "title": "Squid Game 3",
        "content": "Was this written by AI or stupidity? Both?\nI'm on the 4th episode and so much insanity has gone on. A pregnancy, birth, making the baby a participant is hands down as goofy as the masked people making the rules.\nDubs for most of the cast, but scenes with English speaking actors. \n\nWhat the hell is this slop?",
        "upvotes": 4,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1lorm66/squid_game_3/"
    }
]