[
    {
        "id": "1k9rtun",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 10,
        "comments": 612,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k9rtun/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1ka5iar",
        "author": "SixFeetBlunder-",
        "title": "All I can say is thank you, Carlo.",
        "content": "This season hurts because it feels like we could have done more. It did not end the way we dreamed, but when I look back at these years under Carlo, all I feel is gratitude.\nWe lived so many unforgettable moments together. The comebacks against PSG, Chelsea, City. Nights where it felt impossible but somehow we believed, and somehow we made it happen. The Champions League, the Super Cups, the League titles. All the happiness, all the emotions, we owe a lot of it to him.\nEven when things were bad, Carlo gave us calm. He never disrespected the club, never created drama, never lost his class. He always carried himself with dignity and love for this badge.\nNot every season can end with a trophy, but it is the memories and the journey that stay forever.\nIt hurts to say goodbye but he deserves this next chapter with Brazil.\nThank you Mister for everything you gave us. For the victories, for the faith, for the moments.\nYou will always have a place at Real Madrid. You will always be one of us.\n\n¡Hala Madrid y nada más!\n",
        "upvotes": 2038,
        "comments": 64,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ka5iar/all_i_can_say_is_thank_you_carlo/"
    },
    {
        "id": "1kafm2o",
        "author": "dark4403",
        "title": "Patience, we trust in Mbappe. Next year we win it all.",
        "content": "",
        "upvotes": 266,
        "comments": 38,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/aah2i6nncpxe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kafm2o/patience_we_trust_in_mbappe_next_year_we_win_it/"
    },
    {
        "id": "1kahj2i",
        "author": "Emergency-Hornet-594",
        "title": "🚨🚨 𝐁𝐑𝐄𝐀𝐊𝐈𝐍𝐆: Real Madrid are ready to SELL RODRYGO in case of good proposal in the summer, reports El Chiringuito.",
        "content": "🚨🚨 𝐁𝐑𝐄𝐀𝐊𝐈𝐍𝐆: Real Madrid are ready to SELL RODRYGO in case of good proposal in the summer, reports El Chiringuito.",
        "upvotes": 131,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2hLUstCVa_nAbely5eG1iBhRsuGqgJM98m2LCPJAq1c.jpg?auto=webp&amp;s=f9761ab0811f70e7d369d211508cb731455e4a35"
        },
        "permalink": "/r/realmadrid/comments/1kahj2i/𝐁𝐑𝐄𝐀𝐊𝐈𝐍𝐆_real_madrid_are_ready_to_sell_rodrygo_in/"
    },
    {
        "id": "1ka70i1",
        "author": "Ready_Ad_1353",
        "title": "Real Madrid will agree with Ancelotti on an honorable exit: he will be paid for the remaining year contract until 2026) and become a lifetime ambassador for the club. The plan is for a post-match ceremony in the last La Liga game packed with details where the coach will pose with all titles.",
        "content": "Real Madrid",
        "upvotes": 647,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/H2azZPhShosXVQCSOMpCQaaKT48dWTPAndo3RFYzWrU.jpg?auto=webp&amp;s=26653222538e2d9d9545dbede84e0e29a87207f0"
        },
        "permalink": "/r/realmadrid/comments/1ka70i1/real_madrid_will_agree_with_ancelotti_on_an/"
    },
    {
        "id": "1ka94en",
        "author": "TimothyX7",
        "title": "[Matteo Moretto] Xabi Alonso is one step away from reaching a full agreement with Real Madrid and will meet with Bayer Leverkusen in the coming days to inform them of his desire to move to Spain.",
        "content": "",
        "upvotes": 386,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/n_vg9KyxhA1ZNTVU_NZ0yjrNGVU24xxSPQU21Z5fu6c.jpg?auto=webp&amp;s=d6bb34b84e3ca7126025d4f12c9de98cfb3b05fb"
        },
        "permalink": "/r/realmadrid/comments/1ka94en/matteo_moretto_xabi_alonso_is_one_step_away_from/"
    },
    {
        "id": "1ka4fb3",
        "author": "TimothyX7",
        "title": "🚨🇧🇷 BREAKING: Carlo Ancelotti and Brazil have reached an agreement in principle for the Italian to become Seleçao head coach for the World Cup 2026. Deal valid from June, NOT after Clubs World Cup. Real Madrid and Ancelotti would part ways nicely with formal steps needed next.",
        "content": "",
        "upvotes": 617,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gpiMsnmryhITKZZf8b8ImV7adJdxvtDOdkxNbrXQVrI.jpg?auto=webp&amp;s=fe25e902ff280f1765d73a80cda3a41ad3751d06"
        },
        "permalink": "/r/realmadrid/comments/1ka4fb3/breaking_carlo_ancelotti_and_brazil_have_reached/"
    },
    {
        "id": "1k9wj9r",
        "author": "MoreanSwordsman",
        "title": "A compilation of Arda being ignored in Barcelona's penalty area.",
        "content": "I think this is one of the keys factors which lead Real Madrid's defeat against Barcelona.",
        "upvotes": 1194,
        "comments": 158,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ktg2u67r2lxe1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k9wj9r/a_compilation_of_arda_being_ignored_in_barcelonas/"
    },
    {
        "id": "1k9w2gb",
        "author": "martino732",
        "title": "This is how Rudiger played the Clasico, and Perez is still undecided about signing a CB",
        "content": "",
        "upvotes": 842,
        "comments": 96,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/89nja2utykxe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k9w2gb/this_is_how_rudiger_played_the_clasico_and_perez/"
    },
    {
        "id": "1k9ypkz",
        "author": "dark4403",
        "title": "Wished we had 10 Bellinghams on the field at times.",
        "content": "",
        "upvotes": 551,
        "comments": 67,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4r2b6879jlxe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k9ypkz/wished_we_had_10_bellinghams_on_the_field_at_times/"
    },
    {
        "id": "1kab0r9",
        "author": "RealMood8898",
        "title": "Who else feels very optimistic and excited for next season?",
        "content": "I feel very excited for what we will see next season although there is a chance things don’t go smoothly we have the players capable of adjusting to whatever Xabi implements.\n\n1. Excited to see the development of Cama playing is his natural position and what Xabi can develop such a versatile and talented player into \n\n2. Excited to see tchoumeni get consistent minutes in his natural position (assuming Perez doesn’t mess us over again) \n\n3. Excited to see belligham in a solidified role and not having to do everything for this team \n\n4. Finally having a formation and tactics set in place\n\n5. Arda and endrick finally get play time  \n\nJust very interested to see how our players develop with Xabi all of them are capable of being the best in football with the right path. All things go right nobody can beat this team ",
        "upvotes": 59,
        "comments": 47,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kab0r9/who_else_feels_very_optimistic_and_excited_for/"
    },
    {
        "id": "1ka4yhi",
        "author": "DikkeKnoepert",
        "title": "Xabi Alonso confirmed?",
        "content": "With Ancelotti basically being confirmed to take the Brazil NT job, I suppose we can comfortably say Xabi Alonso will be our new coach. What do we think? \n\nLoads of top-level experience as a player, small amount of top-level experience as a coach, in which he's shown immediately to be a force to be reckoned with. I'm very excited, but at the same time, Madrid is another level and there is little time for experimenting, results will have to be achieved very quickly. Will he be able to handle it?",
        "upvotes": 122,
        "comments": 74,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ka4yhi/xabi_alonso_confirmed/"
    },
    {
        "id": "1ka2bo0",
        "author": "BlueFrozenSoul",
        "title": "Ancelotti talking about Xabi back in 2016",
        "content": "",
        "upvotes": 157,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/z9sqhqla9mxe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ka2bo0/ancelotti_talking_about_xabi_back_in_2016/"
    },
    {
        "id": "1k9ryc9",
        "author": "Professional_Mode440",
        "title": "Now i wish luka had retired with kroos",
        "content": "",
        "upvotes": 492,
        "comments": 26,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ku2rnltovjxe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k9ryc9/now_i_wish_luka_had_retired_with_kroos/"
    },
    {
        "id": "1k9ycwf",
        "author": "o6ohunter",
        "title": "We’re going to start having some uncomfortable conversations about Rodrygo soon",
        "content": "The man is just too inconsistent. He sells us dreams and hopes of his ability for a couple of weeks every season then just goes ghost. \n\nI don’t know if it’s because of how he’s had to adopt a more defensive role thanks to Lucas Vazquez or if it’s some confidence/mental thing, but so many times I just find myself forgetting he’s even on the pitch.\n\nThe difference between him and Vini is that Vini, even on his worst games, he still fights. He still makes things happen. Whether it’s beating a defender and sending a cross in, shots on target, hell, even a G/A. He makes things happen and his presence is always felt.\n\nTo put things in perspective, Mbappé, in his DEBUT season, is only 10 goals away from equaling Rodrygo’s total LaLiga goal count. That is just crazy to me. I’d like to know everyone’s thoughts here. Am I rushing to conclusions and being reactionary? Or is this truly a player that is just not at the level of a  Real Madrid starter?",
        "upvotes": 131,
        "comments": 128,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k9ycwf/were_going_to_start_having_some_uncomfortable/"
    },
    {
        "id": "1k9s1l6",
        "author": "TrueSentence8338",
        "title": "Fun fact: Rodrygo never outscored Ramos 19/20 in the league",
        "content": "But but…Ramos took the penalties 🤧 Okay, 16/17 Ramos had more league goals than our Starboy. Another Fun fact: Mbappe is 10 goals away from matching his La Liga Goal Tally but pleeeease don‘t forget about the ,,R“.\n ,,But he‘s not playing in his natural position“ THIS GUY HAD 3 YEARS TO ADAPT WHAT ARE WE DOING HERE. We need to judge him as a rw, not what he could be as a LW.\n\nIt‘s time for uncomfortable conversations, that bench is calling I fear",
        "upvotes": 215,
        "comments": 90,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k9s1l6/fun_fact_rodrygo_never_outscored_ramos_1920_in/"
    },
    {
        "id": "1kaibnq",
        "author": "jokerlek",
        "title": "I don’t get the Angelotti hate",
        "content": "Not so much hate, maybe that’s too though, but lots of fans wanted him out. That’s not fair. He done the best with what he had. The board sabotaged him by not signing a Kroos replacement, not signing any defenders, signing mbappe wich broke the teams ballance and so on. Another complain I’ve seen was the style of play that these players are not passing enough and suffer at building attacks, but yet again I think that’s what the players can do, that’s their limits. The only thing he got wrong this season was the teams mentality, usually that was he’s strong point but kind of hard to work on crybabies mentality. The minutes issue with Endric and Guller, I don’t see a issue with that, they didn’t look that good until the end of the season so was he really wrong for not using them until now?! ",
        "upvotes": 5,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kaibnq/i_dont_get_the_angelotti_hate/"
    },
    {
        "id": "1ka34gr",
        "author": "FearlessWasFounded",
        "title": "Should Fran be starting over Mendy?",
        "content": "Fran Garcia has been a spark on the left all season, taking the ball into attack more than almost more than Vasquez, opening up defenses with astute dribbles and passes, and holding firm when it counts with crucial tackles, interceptions, and blocks. Mendy, on the other hand, has struggled one setback after another and hardly clocked the minutes required to reach top gear, leaving us short on that attacking push. Add in that Fran is easily one of the fastest players in our squad—able to burn past wingers and still sprint back into position—and you’ve got a full-back who blends flair with defensive grit. He’s built real understanding with our center-backs and midfield, while Mendy’s stop-start season has kept him on the back foot. If you desire a left-back who's fit, in form, and can switch defense to attack in the blink of an eye, I do think Fran Garcia clears Ferland Mendy.\n\n",
        "upvotes": 45,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ka34gr/should_fran_be_starting_over_mendy/"
    },
    {
        "id": "1ka88m9",
        "author": "AnAfricanShah",
        "title": "Can Xabi (if he is the next coach) handle the Culture overhaul needed?",
        "content": "I wish to preface this by saying while I've watch a fair few Leverkusen games over the last couple years, I don't follow them closely enough to have a read on Xabi.   \n  \nWhat are your guys thoughts on Xabi's ability to handle the overhaul we currently need? Tactically naturally we are a bit lost, so that's a huge task in and off itself, but after the classico display ito player behavior (that being the flashpoint, but many individual incidents prior) will he be able to get the buy in needed.\n\nLike ZZ he is a legendary ex-player, so that should buy him latitude, but I worry if the squad will be receptive. Naturally Flo will play a significant role by supporting the manager and putting faith in him but from those of you that watch more Leverkusen than me, and especially those that have followed the clubhouse news, what information is there on Xabi's man management?\n\nAt the very least he needs to be able to get buyin from the forwards to track back and be more involved in the buildup play, which Carlo has struggled to do outside the biggest games. This is for me a huge cultural issue as much as tactical. Getting that buy in will be critical.\n\nAnyway just a pretty open ended question to see what you guys think about our path forward? Even if it's just to say we don't need cultural corrections... \n\n",
        "upvotes": 22,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ka88m9/can_xabi_if_he_is_the_next_coach_handle_the/"
    },
    {
        "id": "1k9sdvd",
        "author": "Pebbledthoughts",
        "title": "Los Blancos' Finest : Arda Güler, Jude Bellingham and Aurélien Tchouaméni make the Copa Del Rey Team of the season",
        "content": "",
        "upvotes": 152,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gfpc4v1s0kxe1.jpeg?auto=webp&amp;s=b6aaeeac7a29448870f9cf43420e69bdd5be10f9"
        },
        "permalink": "/r/realmadrid/comments/1k9sdvd/los_blancos_finest_arda_güler_jude_bellingham_and/"
    },
    {
        "id": "1kaham8",
        "author": "FliX7270",
        "title": "La Fabrica Prospects",
        "content": "We really need to focus on our academy for our fullbacks instead of signing one during the transfer window. For rb we should develop Jesus fortea, currently playing in fabrica, training regularly with castilla team and has also trained with the main team. He turned 18 last month, all rounder in defense and attack, a carvajal regen. Another player who we need to develop is Paolo Iago, 18 rn, currently playing for sporting u21, our best academy prodigy whose 18 or below, plays as cm/cam, has a luka modric like playstyle, creative playmaker, really technical player a pure number 10. We even have a buy back clause on him.",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kaham8/la_fabrica_prospects/"
    },
    {
        "id": "1k9ophc",
        "author": "Ready_Ad_1353",
        "title": "The title run in, who will win La Liga?",
        "content": "",
        "upvotes": 253,
        "comments": 117,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/10s6x243pixe1.jpeg?auto=webp&amp;s=54743bc921309ba5ab006d3c8510a2ad5e784d65"
        },
        "permalink": "/r/realmadrid/comments/1k9ophc/the_title_run_in_who_will_win_la_liga/"
    },
    {
        "id": "1kairoh",
        "author": "senormadridista9248",
        "title": "History repeats itself for Real Madrid?",
        "content": "Lately, I can't help but feel a sense of déjà vu as a Madridista. The 2024/25 season is starting to mirror the events of the 2014/15 campaign in some uncanny ways.\n\nBack in 2014, under Carlo, we started the season on a high, winning both the UEFA Super Cup and the FIFA Club World Cup. Expectations were massive. But as the season went on, things began to slip. We fell short in La Liga, got knocked out in the Copa del Rey, and exited the Champions League in the semi-finals. To make matters worse, Barcelona capitalized on our decline and went on to win the treble.\n\nCarlo was sacked at the end of that season. He was replaced by former player Rafa Benítez, but that experiment didn’t last long. By mid-season, Benítez was gone, and another ex-player stepped up: Zinedine Zidane, who went on to carry us from chaos to glory.  \n\nNow, fast forward to this season. Once again, we started strong by winning the UEFA Super Cup, and we have CWC to play. But despite the solid start, there’s an unsettling sense of déjà vu, key injuries piling up, dropped points at crucial moments, and doubts creeping in just when we need momentum the most. Meanwhile, Barcelona are finding their rhythm and are in the mix for a potential treble once again (HOPEFULLY FUCKING NOT).\n\nTo top it off, Carlo is set to depart, not by sacking this time, but via mutual agreement and with another former player likely stepping in to take the reins. The parallels are undeniable.\n\nMaybe it's fate. Maybe it's the end of a cycle. But just like last time, I believe this could be the foundation for something even greater. After all, what followed 2015 was the beginning of one of the most dominant eras in Champions League history.\n\nLet’s hope we’re about to witness another rebirth. What's your thoughts guys?",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kairoh/history_repeats_itself_for_real_madrid/"
    },
    {
        "id": "1k9t3pb",
        "author": "AhmedYasha",
        "title": "If we're getting a new LB this summer, which of these options would you prefer?",
        "content": "",
        "upvotes": 89,
        "comments": 143,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i8r5ew8d8kxe1.png?auto=webp&amp;s=cc2f1d5ac740c28e2526e3392008cb8cad566b60"
        },
        "permalink": "/r/realmadrid/comments/1k9t3pb/if_were_getting_a_new_lb_this_summer_which_of/"
    },
    {
        "id": "1k9f0ez",
        "author": "ConspicuousMango",
        "title": "[Madrid Universal] Real Madrid rejected Ancelotti’s request to hire more tactical analysts — Barcelona had a team of seven analysts equipped with multiple laptops and a video camera, while Real Madrid had only two analysts yesterday",
        "content": "",
        "upvotes": 879,
        "comments": 129,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3Ma9pnH-UsHjFfbla89gmfdBiCeR6-Lm50jqinWIPZI.jpg?auto=webp&amp;s=8bb49fb02f6b0948c2df2c2b4f5fc4e4c360a22c"
        },
        "permalink": "/r/realmadrid/comments/1k9f0ez/madrid_universal_real_madrid_rejected_ancelottis/"
    },
    {
        "id": "1ka4uir",
        "author": "ace-s",
        "title": "what might be the reasoning behind having an interim manager for CWC over Xabi or whoever is joining?",
        "content": "It seems that we are considering Solari for CWC over Xabi Alonso(or whoever will end up being the main manager)\n\nthis seems like the perfect environment for the new coach to have an extended preseason. What could a potential reason be why they are considering this? \n\n  \nMaybe they are trying to convince Klopp? I feel this might be the best time for the new coach to test the existing players and see who he wants to cut from the team.",
        "upvotes": 12,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ka4uir/what_might_be_the_reasoning_behind_having_an/"
    },
    {
        "id": "1k97rh5",
        "author": "Affectionate_lab02",
        "title": "POV: Modric's \"mistake\"",
        "content": "Credits: Kevin Vallejo vía Tik Tok",
        "upvotes": 1833,
        "comments": 93,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vna3stolkexe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k97rh5/pov_modrics_mistake/"
    },
    {
        "id": "1kaixpn",
        "author": "yareg1717",
        "title": "signings in the summer and their fit in Xabi's system",
        "content": "Seeing that Xabi is currently in the lead to become real's next coach, I just got done watching a video explaining how Xabi is likely to set up our formation. the video made me question a couple of things, with the main questions being about our current squad and possible transfers in the summer.\n\nthe youtuber in the video, Stratman Dave ([here](https://youtu.be/037cyizkWpU?si=rR1l5V73ZJ5ApC-j) is the link), assumes that xabi will play the team in a 3-4-2-1 formation, with rodrygo filling in the 'grimaldo-role' as left wing back. i, however, am not convinced that this role suits rodrygo. although he is able to defend to some degree, i think he isnt a lwb, and probably wont be what xabi is looking for if he were to play with one. this made me doubt rodrygo's future in real more, as he also has not been good at the usual right wing position. garcia would be our only option, as mendy was introduced as the left center back in the video and alaba is likely gone.\n\n  \ni personally think garcia is a solid player, and ideal to have come off the bench when needed. i don't see him as the starting left back in the team. this made me wonder: who do you think the club should target in the summer IF a move were to be made?\n\n  \nI was also thinking about our need for a back up striker. more of a natural #9 that can come off the bench and be a threat in the box with size and aerial skills. someone like joselu would be something that I hope we will pursue in the summer. ancelotti has emphasized crossing a lot in his offensive schemes, but we have lacked length since joselu is gone. endrick has been great but is not someone we should rely on as our sole back up striker.\n\ni really wonder if there are others who share this thought. xabi's style of play will undoubtedly involve crosses in the box, and seeing that we are gonna have trent who is elite at this, i genuinely believe that this team will benefit from having an actual striker off the bench. i haven't done much research on who this might be tho.\n\n  \nyour thoughts?",
        "upvotes": 1,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6cM6DyR5zJLOI-XLfPx_-3x01G86hj48AIDjJ2Fg6nM.jpg?auto=webp&amp;s=950024d16a892418542af68a8c2007c21ee1af6d"
        },
        "permalink": "/r/realmadrid/comments/1kaixpn/signings_in_the_summer_and_their_fit_in_xabis/"
    },
    {
        "id": "1k9p8zr",
        "author": "im7an",
        "title": "This is why i hate when some fans md at Vini for being selfish!",
        "content": "There’s so many times this situation happened this season and i think Vini himself lose his confidence when in this situation.\n\nWhat i think he should do if he was at peaked confidence and truly at his best form, he should just cut inside and no matter no angle or not, he should just shoot to the goal himself!\n\nThat is how Big Players should be!",
        "upvotes": 92,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vkeiztdwvixe1.jpeg?auto=webp&amp;s=d8be575f3098ff7667633a2bf587b8e432439fe6"
        },
        "permalink": "/r/realmadrid/comments/1k9p8zr/this_is_why_i_hate_when_some_fans_md_at_vini_for/"
    },
    {
        "id": "1k9qtsn",
        "author": "anthrgk",
        "title": "Lot of fans are way too emotional and change their mind way too often. I'm glad they don't make the decisions.",
        "content": "This isn't a post defending Rodrygo. I'm just bringing up his case as a perfect example of how lot of fans dramatically change their mind within the span of few weeks, sometimes just one week.\n\nRight after we lost the against Arsenal in El Bernabeu, Marca asked people to  \nvote which players should leave this summer. I'll paste here the most relevant part and I'll provide the link for those who want to read it:\n\n\\&gt;The question was simple, but forceful (Which players should leave in the summer?)... and the answer couldn't have been more direct  \n\\[.......\\]  \n**&gt;Jesús Vallejo** received 12% of the votes \\[...\\] He narrowly surpassed (11%) **Lucas Vázquez**, \\[...\\] The list of culprits is long and sharp. **Alaba followed closely (10%), then Ancelotti and Mendy (9%)... before surprisingly reaching Vinicius (63,000 votes).**  \n\\[.......\\]  \n**&gt;As things stand, Courtois gets the best grade of all (7.16) and Vallejo the worst (3.19). In total, 14 players passed (Courtois, Valverde, Asensio, Bellingham, Rüdiger, Brahim, Ceballos, Lunin, Modric, Mbappé, Carvajal, Endrick, Rodrygo, and Camavinga) and 10 failed (the rest of the squad and Ancelotti).**\n\n  \nLink: [https://www.marca.com/futbol/real-madrid/2025/04/18/aficion-mira-palco-exige-dos-fichajes-venderia-vinicius-verano.html](https://www.marca.com/futbol/real-madrid/2025/04/18/aficion-mira-palco-exige-dos-fichajes-venderia-vinicius-verano.html)\n\nThat was only 1 week ago. The votes were pretty much in line with what many people was saying on this sub after that game.\n\nThose with good memory should remember how for most part of the season how many people used to name Tchouameni as a player who should be sold, and Vinicius (best of the world last season according to most fans) was very often mentioned as a player an attacker that should be sold.\n\nRodrygo or Mbappe were barely mentioned if someone asked if any of our attackers should leave.\n\nFast forward two weeks and nobody thinks Tchouameni should leave, almost nobody mentions Viniciuys should leave but lot of people think Rodrygo should.\n\nNow some will claim that they never asked for Vinicius to be sold but they always asked Rodrygo to be sold. Well, maybe you in particular didn't but the facts are there. If are one of those who claims this or the other certified great player should be sold then I don't believe you, and if you think Rodrygo isn't a great player (despite his performance this season) then I'm sorry but I gotta laugh at how little you understand this team sport.",
        "upvotes": 57,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MvABGJOw1RhOKMEr1hDhTQ6dmv946d2Luju6ZFaF8Yc.jpg?auto=webp&amp;s=41f917829a95b9d18a06b798ba9cdf0d6f0d5dee"
        },
        "permalink": "/r/realmadrid/comments/1k9qtsn/lot_of_fans_are_way_too_emotional_and_change/"
    },
    {
        "id": "1k929rx",
        "author": "heylo07",
        "title": "Aurelien Tchouameni on Instagram: \"They celebrate our losses like we ain’t gon win again. We will be back🤝🏾\"",
        "content": "",
        "upvotes": 1841,
        "comments": 123,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lmi7knoq9dxe1.png?auto=webp&amp;s=72378ce4f94d635666fbcc7c7cd9a2388ecf478d"
        },
        "permalink": "/r/realmadrid/comments/1k929rx/aurelien_tchouameni_on_instagram_they_celebrate/"
    }
]