[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 116,
        "comments": 360,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mrbk7y",
        "author": "AsCrowsFly75",
        "title": "Because You Watched 😡",
        "content": "Is there any possible way to change the layout on Netflix? The current interface is so annoying. While they’re at it, please for the love of all that’s good, label a film or series as international so people can decide if that’s what they want or not. I have so many ‘Resume Watching’ shows that I bailed on because it was foreign with shitty voice-overs. ",
        "upvotes": 34,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1mrbk7y/because_you_watched/"
    },
    {
        "id": "1mqlr42",
        "author": "BlackDoom_26",
        "title": "What is the most underrated show you have found on Netflix?",
        "content": "Sometimes I stumble upon a show I have never heard of before and end up loving it way more than I expected. I am curious if anyone else has had this experience. What is the most underrated show you have discovered on Netflix that more people should watch?",
        "upvotes": 546,
        "comments": 1136,
        "media": null,
        "permalink": "/r/netflix/comments/1mqlr42/what_is_the_most_underrated_show_you_have_found/"
    },
    {
        "id": "1mqun5q",
        "author": "Sweaty-Toe-6211",
        "title": "‘STRANGER THINGS’ creators The Duffer Brothers are negotiating leaving Netflix to join Paramount Pictures.",
        "content": "",
        "upvotes": 118,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1mqun5q/stranger_things_creators_the_duffer_brothers_are/"
    },
    {
        "id": "1mrpjuk",
        "author": "refdeser",
        "title": "The echoes of survivors:Inside Korea’s Tragedies - JMS (ep 3 &amp; 4)",
        "content": "\nMaple is such a strong woman, standing up and seeking justice for the sexual abuse. It takes a lot of courage, especially with JMS followers constantly harassing her. I’m so happy that, at the end of the episode, she finally got her own happy ending.\n\nAs the story unfolds, it’s really shocking to see how the authorities were also involved with JMS and even tried to disrupt the investigation. Salute to the director, despite being threatened by JMS followers, he continued investigating and kept the cameras rolling.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mrpjuk/the_echoes_of_survivorsinside_koreas_tragedies/"
    },
    {
        "id": "1mr7us0",
        "author": "satan_69-",
        "title": "We need to talk about The Echoes of Survivors",
        "content": "I am writing this to boost this tv serie, hoping at least the victims perhaps will receive some peace. People needs to know what happened to them, and internet has to talk about it!!!\n\nThis case blow my mind. Never heard about it before. Did a quick research. It is still 80% unknown, mainly the details of it. My heart aches for the victims that grew up being dead inside. I wonder, why this case is not talked enough??",
        "upvotes": 17,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1mr7us0/we_need_to_talk_about_the_echoes_of_survivors/"
    },
    {
        "id": "1mra6eo",
        "author": "ShacklesOfLanguage",
        "title": "Netflix no longer allows sign in on desktop away from home?",
        "content": "Has anyone else experienced this problem?\n\nMy family has a second home, we haven’t been able to log into Netflix on the Roku since they stopped allowing sharing. That’s no surprise.\n\nWhat I can’t believe is now I tried to use it on my phone on the WiFi and that was blocked\n\nThen I tried my laptop and that was blocked\n\nAnd then I tried a DESKTOP and that was blocked\n\nThey’ve completely removed the ability for me to use it anywhere outside my home. I “get” blocking tvs, but desktops and phones make no sense and I do not understand. \n\nAnyone else have this problem?\n\n",
        "upvotes": 14,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1mra6eo/netflix_no_longer_allows_sign_in_on_desktop_away/"
    },
    {
        "id": "1mrp7r6",
        "author": "Sad-Perception-9894",
        "title": "What if Wednesday had Enid as a love interest… and Ej was in the mix?",
        "content": "I’ve been imagining an alternate take on Wednesday where Enid becomes Wednesday’s love interest, but with a twist: Ej is also part of the story. Adding Ej changes the dynamics, their friendships, and even the vibe of Nevermore Academy in unexpected ways. It never appeared on TV, but thinking about it makes me wonder how this version could play out. Has anyone else imagined alternate storylines like this for Netflix shows?”",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mrp7r6/what_if_wednesday_had_enid_as_a_love_interest_and/"
    },
    {
        "id": "1mrp4e5",
        "author": "Sad-Perception-9894",
        "title": "What if Wednesday had Enid as a love interest?",
        "content": "I’ve been imagining an alternate take on Wednesday where the story explored a romantic arc between Wednesday and Enid. It never appeared on TV, but thinking about it makes me wonder how it would have changed their friendship, character growth, and the vibe of Nevermore Academy.\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mrp4e5/what_if_wednesday_had_enid_as_a_love_interest/"
    },
    {
        "id": "1mrfzcw",
        "author": "Affectionate_Sky9090",
        "title": "Is JOELLE from the biggest loser on reddit? (Netflix documentary)",
        "content": "I just want her to see that I have so much love and appreciation for her.\nWhat an absolutely beautiful woman that didn't deserve all that horrid nastiness!",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mrfzcw/is_joelle_from_the_biggest_loser_on_reddit/"
    },
    {
        "id": "1mr8jcu",
        "author": "Eefienator93",
        "title": "Help a girl out!",
        "content": "I'm desperately searching for a serie to watch. So please let me know your top 5! They can be older series too. I wouldn't know the name of the category I like (maybe fantasy) but I'm looking for something that has little to nothing to do with daily life things. Preferably something that makes it feel like a different kind of dementia. The series I can think of off the top of my head that I really like are:\n*Sandman\n*The 100\n*From\n*Dark\n*1899\n*The OA\n*Dead boy detectives\n*Locke &amp; Key \n*The end of the f*king world (not really the same category but has little to do with everyday life sh*'t) \n*Strangers things, my least favorite tho (too many seasons, story gets boring but maybe they safe it in the last season)\n*Shadow and bone\n\nI also really like anime, my top 3 is:\n*Spirited away\n*Avatar the last airbender\n*Arcane \n\nMany thanks in advance! ",
        "upvotes": 6,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mr8jcu/help_a_girl_out/"
    },
    {
        "id": "1mrlgce",
        "author": "Frequent_Anteater_16",
        "title": "Trailers/Reviews UK",
        "content": "Can anybody help? I no longer get the short little preview/trailer on shows as I'm browsing.  I always found this really useful and I miss it! For context I'm in the UK, and my Netflix is through a sky q box. Also there now seems to be a 20 second delay in playing next episodes, anybody else? If someone could solve these issues for me id be ever so grateful!😊",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mrlgce/trailersreviews_uk/"
    },
    {
        "id": "1mqtvsj",
        "author": "Captain-jack-hobie77",
        "title": "Fit for tv",
        "content": "I am so excited for this to come out!! It says it will be released today but it isn’t available. I’m in EST in the United States  - does anyone know the standard time that Netflix releases programming? Anyone else as excited for this as I am? I LOVED the biggest loser growing up- it was actually horrible &amp; had no idea. Poor people. ",
        "upvotes": 28,
        "comments": 130,
        "media": null,
        "permalink": "/r/netflix/comments/1mqtvsj/fit_for_tv/"
    },
    {
        "id": "1mriwsg",
        "author": "Musical2one",
        "title": "Iconyx missed a golden opportunity on Building the Band",
        "content": "They could have absolutely crushed one of the most iconic love ballads of the ’90s. Imagine them performing “I Swear” or “I Can Love You Like That” by All-4-One. Both are timeless anthems, and Iconyx would have taken either to another level.\n\nIf you haven’t heard those songs, stop what you’re doing and go listen. Then picture Iconyx owning that stage with that 4-part harmony…goosebumps guaranteed. 🎤✨",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mriwsg/iconyx_missed_a_golden_opportunity_on_building/"
    },
    {
        "id": "1mqqtca",
        "author": "mrkinkybilly",
        "title": "Just watched, train wreck poop cruise",
        "content": "Just watched poop cruise. A true story of a cruise ship which had a fire onboard and it lost all power and was drifting in the Gulf of Mexico. The toilets stop working as a result. I felt sorry for the passengers but I also found this funny to watch and kept laughing at it",
        "upvotes": 36,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1mqqtca/just_watched_train_wreck_poop_cruise/"
    },
    {
        "id": "1mqpbpq",
        "author": "Oxjrnine",
        "title": "What’s with all the hate for Sirens?",
        "content": "Just binged the miniseries and I haven’t enjoyed and been surprised by a show this much in years.\n\nI thought the premise was going to be literal and it wasn’t.\n\nI thought the characters were going to be cliched but they weren’t.\n\nAnd the best part — no one is a hero or a villain.  And how everyone ends up can be either amazing or tragic (spoilers)\nKiki can easily get a copy of that photo. And being with Pete was unhealthy. Did she really isolate him from his kids or did he use her as a scapegoat.\nSimone might actually be in love with Pete because Ethan was still alive if she just wanted security.  Was revenge a motivation or was her behaviour just doing what Kikki taught her?\nDevon has absolutely no idea how to feel but she has started to stop hating herself. \n\nNone of the characters actions happen in a vacuum so every time I thought I was going to put a character in the good or bad column the story forced me to put them in the human category.",
        "upvotes": 42,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1mqpbpq/whats_with_all_the_hate_for_sirens/"
    },
    {
        "id": "1mrbzpo",
        "author": "tysonmama",
        "title": "Question about The Waterfront",
        "content": "Don’t want to rewatch right now as I have tons of shows to get to. So can anyone explain the Dave Annable WES character. I thought he was the real estate agent trying to help Belle sell the property to a developer. Then the bank papers came, then the ending where he will work for Belle now. WHO is this guy?  WHAT were the bank papers? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mrbzpo/question_about_the_waterfront/"
    },
    {
        "id": "1mrgfix",
        "author": "nickelalkaline",
        "title": "Netflix video quality oddity",
        "content": "I was watching Seinfeld on Netflix and found something odd about the video quality. Im watching on a galaxy s24 ultra. This show usually keeps changing the camera angle according to who is talking. I noticed that the video quality is great, then there is a camera angle change and the quality is awful. Then return to previous angle and image quality is great, then it changes again and is bad. This keeps going for the entire show. Seems that the video is encoded with this odd coded that choses camera angles for saving bandwidth...",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mrgfix/netflix_video_quality_oddity/"
    },
    {
        "id": "1mrfct5",
        "author": "Gualuigi",
        "title": "4K Streaming on PC question",
        "content": "Hey everyone, I'm tired of seeing content in what looks to be 720p. I use the Chrome browser but from previous posts I've read, using the microsoft store app helps with streaming in 4k. I have tried it and it makes no difference to the streaming quality. I am subscribed to the 4k plan, the profile is set to \"high\" quality, I am using a 4k monitor, and I am also getting \\~700mbps download/upload. If you need to know my GPU, I have an RTX 4070. Thank you in advance!",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mrfct5/4k_streaming_on_pc_question/"
    },
    {
        "id": "1mq9ah7",
        "author": "Karma_Moon84",
        "title": "Household",
        "content": "This is Beyond the pale. I have had Netflix since I got DVDs in the mail. I put up with rate hikes and kicked my family off as they left the house and made them get new accounts. Guess what. They never did. Not worth the cost. \n\nNow I am the only active profile and I take care of my father full time. He doesn't live in my home. I will start watching something at home but want to finish it at his house less than a mile from my house but to far to reach my WiFi. At first they said Are you traveling?  OK sure here's a code. But now they want me feel threatened and pay an Extra $7.99 a month to CONTINUE WATCHING WHERE I LEFT OFF.\n\n  Its beyond obvious that I am the same person. And that I'm bouncing between the same 2 physical locations. I shouldn't be forced to go through and entire \"Household location change/update\" twice a day everyday. \n\nI'm 99% sure I got a warning screen about password sharing from HBO max the other day, with a note that basically conveys don't worry this time though beacuse we can tell it's you by your viewing habits. \n\nGet it together Netflix. It's not that hard. I'm sure you have the technology to tell I haven't giving half the planet my password. You just wanna squeeze more out of me to pad your bottom line for share holders. \n\nSHAME ON YOU!",
        "upvotes": 149,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1mq9ah7/household/"
    },
    {
        "id": "1mrb027",
        "author": "bobshmo",
        "title": "Blindspot disappeared?",
        "content": "Can anyone in the US tell me if Blindstop has disappeared from Netflix for them? I was watching it and instead of going to the next episode,  I got a trailer for something else. I'm just trying to see if it's just me.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mrb027/blindspot_disappeared/"
    },
    {
        "id": "1mra8cy",
        "author": "SquirrelFickle7163",
        "title": "Kdramas on Netflix America with English dub",
        "content": "I have watched switched. See you in 19th Life, girl from nowhere, school for arrwabi girls, 21 25. \n\nIt doesn’t have to be kdrama jusr a forgin show. \nI prefer for it to be set in high school simair to the shows ive already watched",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mra8cy/kdramas_on_netflix_america_with_english_dub/"
    },
    {
        "id": "1mra647",
        "author": "marcosuper-04",
        "title": "I'm having problems with Netflix",
        "content": "Hi, I'm trying to watch series or films and it keeps loading endlessly. I've already unpacked the app and then installed it but the result doesn't change and it gives me the same errors with other devices too. What can I do?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mra647/im_having_problems_with_netflix/"
    },
    {
        "id": "1mr7f3s",
        "author": "Nates4Christ",
        "title": "Netflix Canada unavailble on travel",
        "content": "When I opened my Canada Netflix in Indonesia I got a message my service is not available there. I called Netflix and they said I had to cancel and get a local account to view. In the past I had a USA Netflix and I was able to watch while traveling abroad. Any idea if maybe USA is different than Canada on that? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mr7f3s/netflix_canada_unavailble_on_travel/"
    },
    {
        "id": "1mr7e6x",
        "author": "LeadershipFull2787",
        "title": "Obessed with Kpop demon hunters",
        "content": "Anyone else completely obsessed with kpop demon hunters ?!?! Its sooo good! The songs are so fun and cute. I wasn't expecting to get into it as much as I did!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mr7e6x/obessed_with_kpop_demon_hunters/"
    },
    {
        "id": "1mqrpyl",
        "author": "skyeshere",
        "title": "The wrong people won Perfect Match",
        "content": "This may be an unpopular opinion as SO many people love to hate on Madison - but I wholeheartedly believe her and Freddie were the only people who deserved to win (Rachel and Ray a close second). They were the only people there who seemed to genuinely care about one another and not have any wandering eyes, even when Freddie left the house Madison stayed loyal. \n\nAD and Ollie were not perfect due to Ollie’s gross actions which definitely would have gone further if not being babysat by AD at the ‘boys day’. Despite them still being together, on the show alone I don't think they deserved it. Louis and Sandy were also terrible for obvious reasons and Daniel was showing early abusive behaviours towards poor Lucy - I genuinely have NO idea how they won or how people on that show saw that relationship going anywhere. \n\nBut my point stands, Madison and Freddie had the strongest connection - yes, including her ‘crying’ when Freddie went on his date. Crying is not always manipulation. She wasn't being treated well in the house by the others thanks to Cody’s smear campaign on her, and being upset when someone you like is sent on a date is valid. I almost stopped watching after they lost that final ‘competition’ and was kicked out of the running to win. Such a disappointment. ",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mqrpyl/the_wrong_people_won_perfect_match/"
    },
    {
        "id": "1mr19vl",
        "author": "YungVal94",
        "title": "Critical: between Life and Death OWEEE BABBBYYY",
        "content": "Hands down one of the best docuseries I have ever watched. I loved the rawness of it. They didn't sugar coat. I literally cried every episode (probably cause I'm crybaby), but I really wish it was more episodes. And I really hope they come out with a season 2 because this show was wonderful! lowkey made me want to change my profession. How did you guys like the show??",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mr19vl/critical_between_life_and_death_oweee_babbbyyy/"
    },
    {
        "id": "1mqnhqe",
        "author": "Common-Pear4056",
        "title": "Dept Q(uestions, I have questions!)",
        "content": "Just finishing the last episode of Dept Q, but this is driving me crazy:\n\nIn her initial meeting with Sam (whom we later learn is really Lyle), Merritt makes some comment about how Sam doesn’t have an online presence. He says something about how he keeps his private life private. I took that exchange to mean Merritt had tried to look Sam up but didn’t find anything. But this would have been right after Sam died and Lyle assumed his identity, so in reality Merritt would have seen all kinds of articles covering Sam’s death in that case, right? ",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mqnhqe/dept_questions_i_have_questions/"
    },
    {
        "id": "1mpug6s",
        "author": "KnitAndKnitAndKnit",
        "title": "I am baffled by how poorly Wednesday seems to be written. Does it get better?",
        "content": "I am on Episode 4 of Season 1. Please no plot spoilers other than whether it gets better in your opinion or not.\n\n\nI really wanted to like it but I cannot get over how bad the writing is. I think it's a mixture of two things:\n\n\n1) It's very clearly a show for children, written with plenty of those comedic gags that only children find funny. This is in contrast to the way that Stranger Things was technically for children but managed to appeal to adults too, by avoiding really non-adult humour. Example from Wednesday: a character puking all of a sudden in someone's face. I can totally see a 8 year old finding this hilarious. Which is fair, but I thought it was also a show that adults would enjoy.\n\n2) The writers assume the viewer is either really dumb or has no memory, with the amount of repeating main facts/plot points in a very unnatural way. A lot of past plot is spelled out by the characters telling each other what happend (where they clearly know) so they the viewer can know, rather than what would be more natural, to imply it for the viewer to figure out.\n\nExample A (paraphrasing, but basically how it went down): Two characters meet after the years. \nCharacter 1: Remember when we met years ago\nCharacter 2: Yes I hid in the coffin during the funeral but I couldn't get out.\nCharacter 1: I found you and saved you in time.\n\nI mean, nobody talks like that about an event they both participated in.\n\n\nExample B.\n\nThere is this school ball called \"The Raven\" which characters talk about going to, from time to time.\nThen cut to a scene of a big ballroom and the school headmistress welcoming the guests saying \"Welcome to this year's raven!\"\nLike who talks like that?\nImagine showing up to your office Christmas party and the organiser saying \"Welcome to this year's Christmas party!\"\nIt's such a weird thing to say. Firstly, it's OBVIOUSLY \"this year's\" since it's happening now. Secondly everyone knows what party it is, that's why we came here.\n\nAdditionally, the characters *constantly* talk to themselves aloud when alone in rooms, to explain what they are thinking of what they are going to do. \n\nLike ok, sometimes people talk to themselves but in this show every character does it in every scene they are alone. It is sooo weird and unnatural",
        "upvotes": 290,
        "comments": 198,
        "media": null,
        "permalink": "/r/netflix/comments/1mpug6s/i_am_baffled_by_how_poorly_wednesday_seems_to_be/"
    },
    {
        "id": "1mriari",
        "author": "Previous_Sugar_Gay",
        "title": "TAKE “FIXED” off the platform!",
        "content": "The new film ‘FIXED’ is absolutely disgusting and basically just soft core animated animal porn. WTF were y’all thinking?!? I feel violated just by the trailer. NETFLIX, TAKE IT DOWN! ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mriari/take_fixed_off_the_platform/"
    },
    {
        "id": "1mrcx2j",
        "author": "randymysteries",
        "title": "Fixed should come with a warning",
        "content": "I'm old enough to remember the controversy surrounding \"Fritz the Cat.\" \"Fixed\" is essentially the dog version. If you wouldn't let your children watch \"Fifty Shades of Gray\" with their Saturday morning breakfast, you best hide the clicker so they don't turn on \"Fixed\" in the hope of watching a cartoon about a cute doggy. This is X-rated raunch from beginning to end. \n\nEdit: There should be a warning on the catalog page that has links to the film and additional information. The warning should be something like \"Warning: This cartoon is inappropriate for viewing. Unless you're extremely high or you enjoy looking at dogs' genitals, avoid watching this cartoon unless you want to be offended.\"",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mrcx2j/fixed_should_come_with_a_warning/"
    }
]