[
    {
        "id": "1joono2",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1joono2/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1joonon",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1joonon/la_piola_friends_meetup/"
    },
    {
        "id": "1jxo2k1",
        "author": "crepaaaa",
        "title": "Consiglio su concerto a Torino",
        "content": "Buonasera r/torino,\nCon un amico stavo pensando di prendere dei biglietti per andare a vedere un concerto a Torino il 25 giugno (Collegno per la precisione, il Parco Certosa Reale) e volevo qualche consiglio per capire meglio dove alleggiare. Il concerto finirà di notte quindi il mio dubbio è: posso tornare a Torino senza macchina da Collegno prendendo i mezzi pubblici la notte? Inoltre secondo voi locals ha senso prendere un Airbnb a Torino anziché cercare qualcosa a Collegno e magari farsi un giro a Torino il pomeriggio dopo il concerto? \n",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1jxo2k1/consiglio_su_concerto_a_torino/"
    },
    {
        "id": "1jxnn92",
        "author": "cr0w8ar",
        "title": "Consiglio per ditta traslochi internazionali da Regno Unito verso l’Italia",
        "content": "Salve ragazzuoli, io e famiglia stiamo pianificando il rientro in Italia da Londra e stiamo chiedendo preventivi per effettuare il trasloco. Avete qualche ditta da consigliare in loco? I prezzi da Londra sono abbastanza alti. Grazie in anticipo!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jxnn92/consiglio_per_ditta_traslochi_internazionali_da/"
    },
    {
        "id": "1jxfjr0",
        "author": "Parmesean_Lover",
        "title": "Poste Italiane",
        "content": "Hi,\nI ordered two boxes/letters from Ebay but I wrote the wrong cap number on them, and instead of Beinasco, they will indicate Torino now, while there is no street with that name in that adress that I wrote.\nOne of the Boxes is with PosteItaliane Poste1 and other is with La Poste currently. \nWhat will happen?\n",
        "upvotes": 3,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1jxfjr0/poste_italiane/"
    },
    {
        "id": "1jxij30",
        "author": "No-Bit-2036",
        "title": "Conoscete negozi di skate?",
        "content": "Cerco in particolare dei negozi che vendono anche le tavole (usate e non)",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jxij30/conoscete_negozi_di_skate/"
    },
    {
        "id": "1jwtwuo",
        "author": "Ieatyeet",
        "title": "GTT (scontato, lo so)",
        "content": "Salve a tutti, volevo raccontare la mia esperienza, che fa ridere se si riesce a non piangere. Stavo aspettando il 15, meraviglioso tram che ama effettuare tutte le sue corse e ai suoi orari... Comunque, alla fermata faccio segno più volte di fermarsi. L'autista, dall'altezza del su trono di moderna tecnologia nostrana, mi fissa e tira dritto. Lo rincorro, senza successo. Scelgo allora di prendere il 30 (per andare da un' altra parte). Salta 2 corse, ma cosa lo sto a dire. Qua ci si mette il clima, e mi viene un'insolazione, provocandomi quasi uno svenimento e vado a rinfrescarmi per evitare che il prossimo tentato mezzo sia un'ambulanza (unica cosa decente di sta città i bar). Notiamo, tutto nel giro di 30 minuti o meno. Salgo poi sul tanto sperato 15, ma l'impassibile giudice delle rotaie sabaude ci fa scendere dopo 3 fermate per guasto al mezzo. Devo farne altre 3 col 68. Se non ci riuscirò mi troverete sulle notizie.\n\nBaci Torino",
        "upvotes": 38,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1jwtwuo/gtt_scontato_lo_so/"
    },
    {
        "id": "1jxbi01",
        "author": "allexj",
        "title": "Quali sono le zone/vie di Barriera che sono da evitare assolutamente?",
        "content": "",
        "upvotes": 2,
        "comments": 46,
        "media": null,
        "permalink": "/r/torino/comments/1jxbi01/quali_sono_le_zonevie_di_barriera_che_sono_da/"
    },
    {
        "id": "1jxol8q",
        "author": "AGIL_name89",
        "title": "Escape Gtt's officer",
        "content": "Stavo pensando raga, sarebbe molto figo nonché divertente creare un gruppo dove ci condividiamo la posizione dei controllori GTT in modo da aiutare coloro che non si possono permettere il servizio. \n\n\nPensieri? Idee?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jxol8q/escape_gtts_officer/"
    },
    {
        "id": "1jxmuyr",
        "author": "EuphoricSurprise1455",
        "title": "LSD",
        "content": "Sto cercando qualcuno che venda LSD a Torino, conoscete qualcuno?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1jxmuyr/lsd/"
    },
    {
        "id": "1jwv2dz",
        "author": "realcvnce",
        "title": "conoscenze nuove?",
        "content": "ho voglia di fare nuove conoscenze (m19) qualcuno disponibile? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jwv2dz/conoscenze_nuove/"
    },
    {
        "id": "1jwlomp",
        "author": "Ok-Rush-5896",
        "title": "Metro",
        "content": "Cosa è successo oggi in metro che annunciava che non si sarebbe fermata a porta Susa?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jwlomp/metro/"
    },
    {
        "id": "1jwtmh4",
        "author": "b1729",
        "title": "Housing",
        "content": "Hi everyone! I need your advice to find a home in Turin; would you suggest a reliable website regarding it? Thank you.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jwtmh4/housing/"
    },
    {
        "id": "1jw4z9l",
        "author": "Dangerous_Willow7496",
        "title": "Santa Rita M25",
        "content": "Sono da poco sbarcato qua a Torino e in questi giorni passando vicino al parco di Santa Rita, davanti lo stadio del Toro, ho visto un sacco di ragazzi giocare a Basket, correre, fare delle attività insomma.\nE mi si è riaccesa la voglia di concludere i pomeriggi in questo modo. \nHo 25 anni, faccio il programmatore web e mi piace la natura, gli animali, la musica e ciò che penso piaccia a tante persone (Compreso anche i Videogiochi naturalmente ).\nSono cresciuto stando sulle panchine con gli amici, fino a sera, giocando, scherzando e parlando di qualsiasi cosa ci passasse per la testa.\nE ora mi piacerebbe creare questa cosa anche qua a Torino.\nQuindi si, il mio è un annuncio per trovare amici 😂\nL’annuncio è rivolto a entrambi i sessi, non faccio discriminazioni.\nSe anche te ti trovi un po’ in questa situazione e hai voglia di fare cose scrivimi o commenta qua sotto, così magari da creare un gruppo e iniziare a prendere con più leggerezza queste belle giornate.",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jw4z9l/santa_rita_m25/"
    },
    {
        "id": "1jvy7gl",
        "author": "Dry-Substance1987",
        "title": "Qual è il vostro locale preferito a Torino?",
        "content": "",
        "upvotes": 9,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1jvy7gl/qual_è_il_vostro_locale_preferito_a_torino/"
    },
    {
        "id": "1jvvoap",
        "author": "Original_Draw_9492",
        "title": "Cosa mi sono perso?",
        "content": "C'è un casino di volanti e furgoni della polizia e tanti agenti per strada, soprattutto in zona politecnico, come mai?",
        "upvotes": 10,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1jvvoap/cosa_mi_sono_perso/"
    },
    {
        "id": "1jw1bvr",
        "author": "No-Disaster-2966",
        "title": "Parchi/aree attrezzate per grigliate nei pressi di Torino",
        "content": "Ciao a tutti!  \nIo e il mio gruppo di amici sabato vorremmo fare una bella grigliata in un parco. Vi chiedo di darci qualche consiglio su un bel parco con aree attrezzate.   \nGrazieeee",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jw1bvr/parchiaree_attrezzate_per_grigliate_nei_pressi_di/"
    },
    {
        "id": "1jwaqeq",
        "author": "Pablo65t",
        "title": "Chi per 2 chiacchiere?",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jwaqeq/chi_per_2_chiacchiere/"
    },
    {
        "id": "1jw9ov1",
        "author": "LIB8RATO",
        "title": "BLUENERGY",
        "content": "Ciao a tutti! \nQualche recensione sul servizio di elettricità e gas BLUENERGY? Quanto è facile navigare, servire, ecc.? Grazie",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jw9ov1/bluenergy/"
    },
    {
        "id": "1jvzkzf",
        "author": "Deprica",
        "title": "Area picnic attrezzata con barbecue",
        "content": "Ciao,\n\nAvete qualche nome o una lista di zone picnic attrezzate con barbecue per grigliata in zona Torino?\n\nPreferibilmente con possibilità di prenotazione a pagamento.\n\nAnche spostandosi verso Asti, Pinerolo, Vercelli o andando su verso Aosta.\n\nGrazie mille",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jvzkzf/area_picnic_attrezzata_con_barbecue/"
    },
    {
        "id": "1jvca8k",
        "author": "Unlucky_Winner_1187",
        "title": "Why escalators in metro stations are always under maintenance",
        "content": "",
        "upvotes": 33,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1jvca8k/why_escalators_in_metro_stations_are_always_under/"
    },
    {
        "id": "1jvuy02",
        "author": "mutantgenes",
        "title": "Shops to buy caps in Torino? 🧢",
        "content": "As title says, thanks.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jvuy02/shops_to_buy_caps_in_torino/"
    },
    {
        "id": "1jw4zk7",
        "author": "2list1Ana",
        "title": "Hello ragazzx!",
        "content": "\n\n\n\n\n\nCi sono ii posti con il internet gratis? Anche senza consumazione in locale.\n\n\n\nGrazie,\nRiku2",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1jw4zk7/hello_ragazzx/"
    },
    {
        "id": "1jvj3uu",
        "author": "Milo93x",
        "title": "Dove parcheggiare per visitare il centro",
        "content": "Ciao, sapete dirmi un buon punto della città dove posso arrivare in macchina e parcheggiarla (gratuitamente se possibile) per poi muovermi a piedi o con i mezzi per visitare il centro storico e i principali luoghi di interesse?",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jvj3uu/dove_parcheggiare_per_visitare_il_centro/"
    },
    {
        "id": "1jv6v53",
        "author": "lu_ce_2004",
        "title": "techno girls 🩷",
        "content": "Hey ma ci sono delle ragazze a cui piace andare a ballare techno che come me cercano compagnia? :) \nScrivetemi se vi va! ",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1jv6v53/techno_girls/"
    },
    {
        "id": "1jva3k5",
        "author": "CowEnvironmental3401",
        "title": "Aree camping montagna",
        "content": "Mi consigliate dei posti in montagna dove si può andare a stare in tenda e fare escursioni ?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jva3k5/aree_camping_montagna/"
    },
    {
        "id": "1jv19jg",
        "author": "throwawayinaprial",
        "title": "Free2Move Car Disappeared During Rental / Auto scomparsa durante il noleggio con Free2Move",
        "content": "English version below.\n\nVoglio condividere un'esperienza assurda con Free2Move, nel caso qualcuno abbia vissuto qualcosa di simile o possa offrire consigli.\n\nIl 6 aprile, intorno alle 14:00, è stata noleggiata un’auto tramite l’app Free2Move per 4 ore. Dopo aver guidato in giro per Torino, l’auto è stata parcheggiata e chiusa in Via ****** verso le 17:20. Circa 50 minuti dopo, tornando sul posto, l’auto era completamente sparita.\n\nControllando l'app, risultava che il motore fosse acceso e il noleggio ancora attivo. È stato subito contattato il supporto, ma senza alcun aiuto concreto. Un operatore ha confermato che l’auto era stata chiusa alle 17:20 e poi riaperta alle 17:46 – non da noi. Ha detto che avrebbe segnalato il problema al supporto tecnico e di non fare nulla nel frattempo.\n\nNel frattempo, il contatore a minuti è partito. Il giorno dopo (7 aprile), il noleggio risultava ancora in corso. È stato fatto un nuovo tentativo con il supporto, ma l’operatore ha semplicemente respirato nel telefono senza dire nulla fino a chiudere la chiamata. Richiamando, un altro operatore ha detto solo di andare dalla polizia e fare una denuncia.\n\nIl processo di assistenza è stato un incubo. Molti operatori continuavano a ripetere “contattate la polizia e fate la denuncia” senza dare alcuna informazione utile. Farlo in Italia senza parlare bene l’italiano è stato estremamente difficile. Anche la polizia ha avuto problemi a comunicare con Free2Move – un agente ha chiamato la linea italiana, e anche lui ha ricevuto solo silenzio in risposta. La linea inglese non è stata meglio: niente istruzioni scritte, nessuna verifica delle comunicazioni precedenti, nessun dettaglio sul tracciamento GPS e rifiuto di parlare con l’agente.\n\nDopo ore di stress, la polizia ha accettato di prendere la denuncia, ma con grande riluttanza. Sono state passate più di 8 ore in questura, senza contare le ore perse al telefono con l'assistenza. In più, ci sono stati costi per taxi e giornate lavorative perse, inclusa la necessità di fungere da interpreti.\n\nAd oggi, nessuna conferma che non siamo responsabili per la scomparsa dell’auto, né alcun tipo di compensazione per lo stress, i costi sostenuti o il tempo perso. Tutta la documentazione è stata inviata.\n\nQualcuno ha vissuto un’esperienza simile con Free2Move? Siete riusciti a risolvere o ad ottenere un rimborso? Questa situazione è stata assurda e ogni consiglio o testimonianza sarebbe molto utile.\n\n-----------------\n\nJust wanted to share an infuriating experience with Free2Move in case others have dealt with something similar or can offer advice.\n\nOn April 6th around 2 PM, a car was rented via the Free2Move app for 4 hours. After driving around Torino, it was parked and locked on Via ****** around 17:20. About 50 minutes later, when returning to the car, it was completely gone.\n\nUpon checking the app, it showed the engine was running and the rental was still active. Support was contacted immediately, but no help was provided. One rep admitted the car had been locked at 17:20 and mysteriously unlocked again around 17:46 – which was not done by us. They said they’d escalate the issue to technical support and told us to wait.\n\nMeanwhile, the rental timer kept running. The next day (April 7th), the rental was still active, and another call was made to support. This time, the representative just breathed into the phone and stayed silent until the call ended. When calling again, the new rep told us to file a police report.\n\nThe entire process with support was a nightmare. Multiple reps gave no concrete help, repeating the same phrase: “contact police and file a report.” Trying to do this in Italy without fluency in Italian was extremely difficult. Even the police struggled to communicate with Free2Move — one officer called the Italian support line, only for the rep to repeat the silent treatment. Calls to the English support line were just as useless: no written instructions, no checking chat/email history, no explanation of GPS tracking, and a complete refusal to speak with the officer directly.\n\nEventually, after hours of stress and persistence, the police agreed to take the report — but not without hesitation. We spent over 8 hours in the station alone, not to mention the wasted time and energy speaking with unhelpful support staff. On top of that, we had to pay for taxis and lost a day of work, including time needed to act as our own translator.\n\nTo date, there has been no confirmation that we’re not liable for the car’s disappearance, nor any compensation offered for the stress, financial cost, or wasted time. Documents and reports have been submitted.\n\nHas anyone else experienced something like this with Free2Move? Did you manage to resolve it or get compensated? This experience has been absolutely ridiculous, and any advice or shared stories would be appreciated.\n\n",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jv19jg/free2move_car_disappeared_during_rental_auto/"
    },
    {
        "id": "1jv9zsr",
        "author": "Inside-Grass1064",
        "title": "what to eat in porto nuovo",
        "content": "i’m going to turin for a trip and i’ll stay there for 2 days. i’m open to any suggestions of restaurants and places to visit.",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1jv9zsr/what_to_eat_in_porto_nuovo/"
    },
    {
        "id": "1jv3xmp",
        "author": "LinceAgu",
        "title": "GTT - Reggia di Venaria",
        "content": "Ciao a tutti! \nVivo da un po’ a Torino ma non riesco ancora a capire bene tutti i biglietti di GTT. Vorrei andare alla Reggia di Venaria e mi hanno detto di prendere il VEX. La mia domanda è: il biglietto è lo stesso? Io ho l’abbonamento mensile da 38 euro, va bene anche per quello? \n\nGrazie mille!\n",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1jv3xmp/gtt_reggia_di_venaria/"
    },
    {
        "id": "1jv2ein",
        "author": "DPPenjoyer18",
        "title": "Qualcuno ha avuto esperienze con To Room?",
        "content": "Come da titolo, volevo sapere se qualcuno di voi ha avuto esperienze con To Room, riguardo soprattutto l’affitto a lungo termine di stanze/appartamenti. Sono una società relativamente giovane da quel che ho capito e su Trustpilot hanno solo due recensioni, quindi ho pensato di chiedere qui. \nGrazie a tutti",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jv2ein/qualcuno_ha_avuto_esperienze_con_to_room/"
    },
    {
        "id": "1jv0vay",
        "author": "deadboyy",
        "title": "Consigli su trasloco",
        "content": "Avete avuto esperienze positive con qualche servizio in particolare? Consigli?\n\nNon ho tantissima roba ma non posso farlo da solo.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jv0vay/consigli_su_trasloco/"
    },
    {
        "id": "1juot3j",
        "author": "PinApprehensive1555",
        "title": "Che voto dai a Torino?",
        "content": "Sulla base della tua esperienza e confrontandola con altre città come Milano, Berlino, Madrid, Lisbona, ecc., che valutazione daresti a Torino?",
        "upvotes": 4,
        "comments": 49,
        "media": null,
        "permalink": "/r/torino/comments/1juot3j/che_voto_dai_a_torino/"
    }
]