[
    {
        "id": "1grzjbd",
        "author": "GladiatorMovie",
        "title": "AMA: We're the costume designers for Ridley Scott’s latest epic “Gladiator II.” Ask us anything about our longtime careers in film and TV, and about working on such a huge project. ",
        "content": "We are **Janty Yates** (Costume Designer) and **David Crossman** (Costume Designer – Military Costumes) and we had the pleasure of working on Ridley Scott’s new film, Gladiator II. We’ve both spent decades working in the industry, garnering awards, and working on some of the biggest movies in Hollywood.\n\nWe’ve been on Ridley Scott projects previously, and between the two of us, we’ve worked on franchises like Harry Potter, Star Wars, and Alien. With an eye for detail, and a love of storytelling, our passion for outfitting the right actors in the perfect wardrobes is very special to us both.\n\nIf you want to know more about the process, the methods, and the artistry of costume design for big, epic movies, we’re here to take your questions. \n\nWe are:\n\n* [Janty Yates](https://www.google.com/url?q=https://www.imdb.com/name/nm0946765/&amp;sa=D&amp;source=docs&amp;ust=1731688586703178&amp;usg=AOvVaw3l_HfawFgp6Rgx07DWbfZl), Costume Designer. Yates has worked in this field since 1989 and has two Academy Award nominations, including one win. Gladiator II marks Yates 18th collaboration with Ridley Scott\n\n* [David Crossman](https://www.google.com/url?q=https://www.imdb.com/name/nm0189366/&amp;sa=D&amp;source=docs&amp;ust=1731688586703575&amp;usg=AOvVaw382KB9AjxnnfM3CtG96Jeu), Costume Designer – Military Costume. Crossman has worked as a costume designer since the late 90s and has one Academy Award nomination for Napoleon, which he shares with Yates.\n\nhttps://preview.redd.it/6rn3v7kv731e1.png?width=1988&amp;format=png&amp;auto=webp&amp;s=9248ede2359a90b2ca141dbe26e0fb993ece6c1d\n\n&gt;Thank you all so much for joining us and asking so many wonderful questions about our lives and careers. \n&gt;This has been such a memorable experience for both of us. We could not be more appreciative.\n&gt;Can’t wait for you all to see the costumes on the big screen!\n&gt;",
        "upvotes": 150,
        "comments": 88,
        "media": null,
        "permalink": "/r/movies/comments/1grzjbd/ama_were_the_costume_designers_for_ridley_scotts/"
    },
    {
        "id": "1gt6kt0",
        "author": "DonnieDarkoRabbit",
        "title": "We all know by now that Heath Ledger's hospital explosion failure in The Dark Knight wasn't improvised. What are some other movie rumours you wish to dismantle? ",
        "content": "I'd love to know some popular movie \"trivia\" rumours that bring your blood to a boil when you see people spread them around to this day. I'll start us of with this:\n\nThe rumour about A Quiet Place originally being written as a Cloverfield sequel. This is not true. The writers wrote the story, then upon speaking to their representatives, they learned that Bad Robot was looping in pre-existing screenplays into the Cloververse, which became a cause for concern for the two writers. It was Paramount who decided against this, and allowed the film to be developed and released independently of the Cloververse as intended. \n\nEdit: As suggested in the comments, don't forget to provide sources to properly prevent the spread of more rumours. I'll start:\n\n[Here's my source about A Quiet Place](https://www.indiewire.com/features/general/a-quiet-place-cloverfield-1201950098/)",
        "upvotes": 4709,
        "comments": 1378,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2XaePXmFWO1NrIlrFo0cbkq283vkL8gCoUNnbcwypak.jpg?auto=webp&amp;s=789e0240701cb79a7ba2f05de6fcfb69be491756"
        },
        "permalink": "/r/movies/comments/1gt6kt0/we_all_know_by_now_that_heath_ledgers_hospital/"
    },
    {
        "id": "1gtbzh9",
        "author": "Both_Sherbert3394",
        "title": "I might just be dumb but I genuinely enjoyed 'Trap'",
        "content": "I actually saw this at an early screening so it was before any of the reviews had come out, and having been all over the board with M Night, I never really know what to expect, but the concept for this one was more interesting to me than either of the last two movies he's made, so I was at least curious to check it out.\n\nAs far as the 'believability' of it, I was a little surprised how many people seemed to just totally be in shock that M Night would make a film with a ridiculous concept, given that he also made a movie about a beach that makes you old, meaning I wasn't exactly holding out for stark realism. I admit, it is an absurd premise, but when the movie is being pitched as 'Silence of the Lambs at a Taylor Swift concert', I'm not going into it expecting anything other than entertaining schlock, which is exactly what I got. It feels like a slightly shitty De Palma movie, but I'll take a flawed, original concept over fucking Venom 3 or Red One any day.\n\nThe main reason this works at all, for me at least, is Josh Hartnett. M Night movies live or die on their characters, and while this is nowhere near Bruce Willis in Unbreakable or James McAvoy in Split, I still thought he really understood exactly what he needed to bring, and the fact that it was contextualized as 'an obsessive serial killer in a highly tense situation having to feign normalcy' made the signature weird Shyamalan dialogue make a lot more sense, especially when the daughter would call him out on sounding weird.\n\nHis performance (and the film in general) has been compared to the Hitman games, and I think that's pretty apt. It's also a movie where the overall quality of the production combined with the ridiculousness helps make it feel like 'polished/\"elevated\" schlock', which studios aren't really making a lot of anymore, for better or for worse.\n\nAfter rewatching it on streaming the other night just to see if anything had changed from the early version I saw (it hadn't), I can definitely admit the hype of being at a screening gave me a bit of a rose-tinted view of it the first time, but in general I still thought it was a fun movie with more self awareness than Shyamalan usually has, and had enough fun with its concept that I was a little bummed when it seemed like most people really weren't digging it, at least at first. Curious how y'all felt about this one.",
        "upvotes": 527,
        "comments": 205,
        "media": null,
        "permalink": "/r/movies/comments/1gtbzh9/i_might_just_be_dumb_but_i_genuinely_enjoyed_trap/"
    },
    {
        "id": "1gt56nr",
        "author": "Kind_Mastodon_1585",
        "title": "The ‘Sideways’ Revolution: How a Single Joke Upended the Wine World\n",
        "content": "",
        "upvotes": 1666,
        "comments": 188,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mjuy77fk9qb13CVdg9yjJPgntvCY_YDQPyWOadN5BjY.jpg?auto=webp&amp;s=9483ac2c17b8ca691ec80b651088ff0f842a1d33"
        },
        "permalink": "/r/movies/comments/1gt56nr/the_sideways_revolution_how_a_single_joke_upended/"
    },
    {
        "id": "1gtfcwh",
        "author": "Curious_Feature_7532",
        "title": "Glengarry Glen Ross they really stole the leads for $2,500?",
        "content": "Watched Glengarry Glen Ross for the first time last night and rewatched it to get everything.\n\nFor the amount of money they could make on a sale versus what they got for selling the leads really makes me wonder just how desperate they must've gotten if they really burgled their own office and sold all for allegedly five grand total. Seems like peanuts, kinda made Levene trying to bribe Williamson with $2,500 almost comical.",
        "upvotes": 168,
        "comments": 107,
        "media": null,
        "permalink": "/r/movies/comments/1gtfcwh/glengarry_glen_ross_they_really_stole_the_leads/"
    },
    {
        "id": "1gta7ss",
        "author": "blac_sheep90",
        "title": "Master and Commander: The Far Side of the World. ",
        "content": "What. A. Fantastic. Movie.\n\nSo I'm on rewatch number: ??? and once again I'm left entertained and satisfied by this wonderful movie from Peter Weir. \n\nI think this is Russell Crowes best role. Of course his performance as Maximus Decimus Meridius was iconic but his performance as Captain Jack Aubrey was, imo, on another level. I'll admit I haven't read the books so I'm not 100% sure he physically resembles his book counterpart.\n\nOpposite him is a wonderful Paul Bettany as Surgeon Stephen Maturin. Their friendship is the heat of the movie and Crowe and Bettany sold me on what is a living friendship between two rather different men. \n\nMy favorite character is Mr. Blakeney. His entire character arc is fantastic start to finish, post his arm surgery is some great story telling seeing as he leads a boarding party to great effect. \n\nThe best sequence is of course the expedition on the Galapagos island where Stephen intended name a tortoise after Aubrey. I do think using Prelude is cheating seeing as it's a excellent piece of music. \n\nWe also get a few haunting scenes.\n\nWe have a man over board situation where the Captain is forced to cut wreckage loose ultimately dooming the sailor...and that sailor's friend had to assist in the cutting.\n\n Mr. Holm being scapegoated as a Jonah ends up committing suicide in a terrifying way...we see his eyes fade into the inky darkness of the sea as Mr. Blakeney looks on helpessly. \n\nThe best scene is the higher ranking officers at dinner getting hammered and making weevil puns.\n\nIt's a 10/10 movie and a crying shame we didn't get any other movies from Weir.",
        "upvotes": 284,
        "comments": 99,
        "media": null,
        "permalink": "/r/movies/comments/1gta7ss/master_and_commander_the_far_side_of_the_world/"
    },
    {
        "id": "1gsqd9x",
        "author": "BunyipPouch",
        "title": "Zach Braff Announces ‘Garden State’ 20th Anniversary Benefit Concert With Soundtrack Artists - The event will feature The Shins, Iron &amp; Wine, Frou Frou, Colin Hay, Cary Brothers, Remy Zero, and more, all of whom appeared on the Grammy-winning film soundtrack. It will benefit homeless shelters.",
        "content": "",
        "upvotes": 5896,
        "comments": 336,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZtNNTtgFvO7uLqPP9_0tS-6cRVkxTHwcxnxOMWsz3us.jpg?auto=webp&amp;s=167389db8424cf18e515a2c95a8b8c6bbc84d825"
        },
        "permalink": "/r/movies/comments/1gsqd9x/zach_braff_announces_garden_state_20th/"
    },
    {
        "id": "1gtgfn7",
        "author": "bob1689321",
        "title": "Robert Downey Jr and Ben Stiller improvising a scene from Tropic Thunder - 10 minutes of un-edited camera footage",
        "content": "",
        "upvotes": 68,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HLLNbGKdtLXnZkonw13lEA802uHb0X189reysjBhX-o.jpg?auto=webp&amp;s=923ecd3658084b2d9c6470055682d29f58485a08"
        },
        "permalink": "/r/movies/comments/1gtgfn7/robert_downey_jr_and_ben_stiller_improvising_a/"
    },
    {
        "id": "1gt259f",
        "author": "BunyipPouch",
        "title": "I Like Movies - Official US Trailer - A socially awkward 17-year-old cinephile takes a part-time job at a local video store, where he forms a complicated friendship with his older store manager. He hopes to earn enough money to achieve his dream of attending film school at NYU.",
        "content": "",
        "upvotes": 597,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dXonZRplX6PLpWC0CXnFLuwmb1J5EGEa0vYQgj62z1I.jpg?auto=webp&amp;s=5b013a2ec63a0bf5e0a302ef4ac5d8bd8ccbc86c"
        },
        "permalink": "/r/movies/comments/1gt259f/i_like_movies_official_us_trailer_a_socially/"
    },
    {
        "id": "1gtfztb",
        "author": "BunyipPouch",
        "title": "How Neon Flipped Movie Marketing on Its Head to Make ‘Longlegs’ the Indie Hit of the Year - A guerrilla campaign involving cipher codes and a creepy hotline but no TV ads (and no Nick Cage) got horror fans hooked on Osgood Perkins' serial killer thriller.",
        "content": "",
        "upvotes": 37,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YNdG8bO3BOn4I9E0ojVXdhnwARmGQ-GKtGB5qoBOYEo.jpg?auto=webp&amp;s=6028ddef6d5e735a54bf8b297ad0b7c2c4358ce5"
        },
        "permalink": "/r/movies/comments/1gtfztb/how_neon_flipped_movie_marketing_on_its_head_to/"
    },
    {
        "id": "1gt1iwj",
        "author": "hukfin",
        "title": "Movies you love but don't recommend to your friends for fear they'll sh*t all over it...",
        "content": "Hey all,\n\nI'm sure this has been asked before...\n\nJust like the title says. Are there movies you absolutely love but don't recommend because you may not like the reaction you'll get? I'll start...Local Hero. I have a reputation among my circle for being very critical and this movie means to much to me to have someone run it down just to throw it in my face. \n\nWhat ya got?\n\nThanks!",
        "upvotes": 469,
        "comments": 1137,
        "media": null,
        "permalink": "/r/movies/comments/1gt1iwj/movies_you_love_but_dont_recommend_to_your/"
    },
    {
        "id": "1gtcuzk",
        "author": "PrintOk8045",
        "title": "Sergio Leone, ‘the Man with No English’, mimed directions to spaghetti western star Clint Eastwood",
        "content": "",
        "upvotes": 47,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qFiH_5b7mQL4dIkbaPO2b7WvfWnZa7oEKHDIe1DJhM4.jpg?auto=webp&amp;s=384f5d2b998ae3c138ae682984f95e5b166f8153"
        },
        "permalink": "/r/movies/comments/1gtcuzk/sergio_leone_the_man_with_no_english_mimed/"
    },
    {
        "id": "1gtgqji",
        "author": "Dragava",
        "title": "What director has only gotten better with age?",
        "content": "The circus surrounding Coppola and [Megalopolis](https://m.imdb.com/title/tt10128846/mediaviewer/rm1769630721/?ref_=tt_ov_i) got me thinking, there’s plenty of filmmakers who have worsened as their careers have progressed (the Wachowskis, as another instance) but I’m hard-pressed to think of one who has definitively improved with theirs.  \n\nI suppose an arguable example could be David Fincher, who began by directing music videos and commercials he himself loathed doing, but even the first half of his filmography I would say I would choose to watch over his second.  \n\nIs there a director, living or dead, you can think of that clearly has a superior latter half to their filmography? ",
        "upvotes": 25,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/obkXYpZN-Z9XnYSXmSxZyuCJtZTJEC4QPGHay9ll2y0.jpg?auto=webp&amp;s=e1f64d0941384a8951b302ca8b4160fe5bde8273"
        },
        "permalink": "/r/movies/comments/1gtgqji/what_director_has_only_gotten_better_with_age/"
    },
    {
        "id": "1gsyhm8",
        "author": "Odd_Advance_6438",
        "title": "The opening Black Friday scene from Thanksgiving (2024) was the stuff of nightmares. Great way to start the movie",
        "content": "I myself am not super familiar with a lot of Eli Roth’s work, but I really enjoyed Thanksgiving. From what I’m aware, that’s considered one of his few good ones. It was a very fun movie all around with some pretty wild and creative kills\n\nHowever, the Black Friday scene stuck out to me as the highlight of the movie, a hilariously grim opening of a violent shopping spree. Seeing people cruelty snatch waffle makers out of each others hands as they bleed from broken glass was pretty wild, then the scalp getting torn off when the woman’s hair was stuck to the customers shopping cart. Great opening",
        "upvotes": 462,
        "comments": 95,
        "media": null,
        "permalink": "/r/movies/comments/1gsyhm8/the_opening_black_friday_scene_from_thanksgiving/"
    },
    {
        "id": "1gt38fh",
        "author": "indiewire",
        "title": "'An Almost Christmas Story': How Disney+ Short Honors Stop Motion",
        "content": "",
        "upvotes": 169,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/z6jGuikFx93odIXNXkCaZO7Px5N0FYLi6cDST2kHxss.jpg?auto=webp&amp;s=4faa3610ee8130ebff41d298dac23792a10d2ed6"
        },
        "permalink": "/r/movies/comments/1gt38fh/an_almost_christmas_story_how_disney_short_honors/"
    },
    {
        "id": "1gtbsek",
        "author": "Impossible_Werewolf8",
        "title": "Favorite movie by european country: Latvia",
        "content": "Hello there,\n\nsince more than 20 days, I ask you for your most favorite movie set in a given european country once a day. For example, two days ago, it was Italy's turn in this little filmic journey and I have to say: While I'm a bit disappointed, that literally nobody mentioned *A Roman Holiday* or (if you want a genuine italian movie to win) any part of the *Don Camillo* series, I think we have another deserving winner here. It got really exciting again: At one point it looked as if  *Ladri di biciclette* (engl.: *Bicycle Thieves*) would be the first film from the 40s to make the list, and in between there was a real neck-and-neck race with *La Vita E Bella* (engl.: *Life is Beautiful*), but in the end ***Nuovo Cinema Paradiso*** (that was only called *Cinema Paradiso* in the English distribution for whatever reason) has brought it home.\n\nBecause I started the next round a bit earlier yesterday (in order to watch *Gladiator II*, another movie mostly set in Italy), I have another winner to announce. The victory here was very clear - the only controversy in some parts of the world might be that I see the region in question as a country in its own right. Nevertheless, I am happy to give ***Zgjoi*** (engl.: *Hive*) a spot in [our official Letterboxd list](https://letterboxd.com/lalunallena/list/reddits-favourite-movie-by-european-country/share/N58XneSCnjHwwiJw/detail/). before we move on to the next country: **Latvia**. For those of you who are still new here, here are the two rules of this game:\n\n* It's about where the movie is set plot-wise and not about where the movie was filmed. In case of historical movies, it's important that the bigger part of the movie takes place in a geogprahical territory, that is part of the given country today.\n* Winner movie is the movie with the most upvotes (minus the given downvotes) after 24 hours. Therefore, it's important that you only mention one movie per comment and that you check up if you're movie was mentioned in an earlier comment before you suggest it.\n\nI'm really looking forward to your film suggestions!\n\n# \n\n&gt;Day 24: Kosovo - Zgjoi (engl.: Hive)\n\n&gt;Day 23: Italia - Nuovo Cinema Paradiso (engl.: Cinema Paradiso)\n\n&gt;Day 22: Ireland - The Wind That Shakes the Barley\n\n&gt;Day 21: Iceland - Englar Alheimsins (engl.: Angels of the Universe)\n\n&gt;Day 20: Hungary - Sátántangó\n\n&gt;Day 19: Greece - Κυνόδοντας (engl.: Dogtooth)\n\n&gt;Day 18: Germany - Das Leben der Anderen (engl.: The Lives of Others)\n\n&gt;Day 17: Georgia - ცისფერი მთები ანუ დაუჯერებელი ამბავი (engl.: Blue Mountains)\n\n&gt;Day 16: France - La Haine\n\n&gt;Day 15: Finland - Mies vailla menneisyyttä (engl.: The Man Without a Past)\n\n&gt;Day 14: Estonia - Vehkleja (engl.: The Fencer)\n\n&gt;Day 13: Denmark - Jagten (engl.: The Hunt)\n\n&gt;Day 12: Czechia - Spalovač mrtvol (engl.: The Cremator)\n\n&gt;Day 11: Cyprus - Smuggling Hendrix\n\n&gt;Day 10: Croatia - Kako je počeo rat na mome otoku (engl.: How the War Started on My Island)\n\n&gt;Day 9: Bulgaria - Източни пиесиИзточни пиеси (engl.: Eastern Plays)\n\n&gt;Day 8: Bosnia and Herzegovina - Ničija zemlja (engl.: No Man's Land)\n\n&gt;Day 7: Belgium - In Bruges\n\n&gt;Day 6: Belarus - Иди и смотри (engl.: Come and See)\n\n&gt;Day 5: Azerbaijan - Yuxu (engl.: The Dream)\n\n&gt;Day 4: Austria - Funny Games\n\n&gt;Day 3: Armenia - Նռան գույնը (engl.: The Color of Pomegranates)\n\n&gt;Day 2: Andorra - El fred que crema (engl.: The Burning Cold)\n\n&gt;Day 1: Albania - Lulekuqët mbi Mure (engl.: Red Poppies on Walls)",
        "upvotes": 22,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jDGM4vmL8dGUfU2QeTEP1GJiB20Upc7gie089IBWF2w.jpg?auto=webp&amp;s=4d8dec2293dd383684c787452f1c2ac30560ac75"
        },
        "permalink": "/r/movies/comments/1gtbsek/favorite_movie_by_european_country_latvia/"
    },
    {
        "id": "1gsq2d5",
        "author": "cenrepute",
        "title": "Punk Drama 'Out Come the Wolves,' Based on Rancid Album, Finds Cast",
        "content": "",
        "upvotes": 723,
        "comments": 107,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j4ZZj-0FP-b3pQxQDoX-r8jfNc0uahTLK9PqmfLtmAU.jpg?auto=webp&amp;s=90566734593010b5f805e5a52bc14f2161537237"
        },
        "permalink": "/r/movies/comments/1gsq2d5/punk_drama_out_come_the_wolves_based_on_rancid/"
    },
    {
        "id": "1gtag5k",
        "author": "jjjrmd",
        "title": "Wyatt Earp (1994)",
        "content": "I'm a sucker for a good Western movie but somehow, mostly due to negative critical response, I had never watched Kevin Costner's Wyatt Earp. I finally watched it last night and I was blown away.\n\nI know it often gets unfavourably compared with Tombstone, and I love Tombstone, but to me it's far more absorbing and an all round better film. You get a far better understanding of the Earps, their flawed personalities and what led to the OK Corral shootout and consequent vendetta.\n\nI struggle to understand what the critics issue with it was? Yes it was long, at just over 3 hours, but it never felt bloated. I never felt that any of it was over indulgent. The shootout at the OK Corral was, as far as I'm aware, pretty much true to life. Far more abrupt and less Hollywood than it's usually depicted.\n\nAlso the performances were superb. I never thought anyone could surpass Val Kilmer as Doc Holliday, but Dennis Quaid was absolutely sensational and brought a dark, unhinged menace to the role that I really enjoyed. You can tell he's really struggling to hold his fraying will to live together.\n\nOverall, I absolutely loved this movie and highly recommend it to anyone who doesn't mind strapping in for a 3 hour biopic.",
        "upvotes": 18,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1gtag5k/wyatt_earp_1994/"
    },
    {
        "id": "1gt4xmo",
        "author": "-Clayburn",
        "title": "What do actors' production companies actually do?",
        "content": "I'm sure there's a range here, but generally when you see something like Seven Bucks for The Rock or Plan B for Brad Pitt, what can you expect the behind the scenes work to be to get this production credit?  In The Rock's case it almost seems like it's just a requirement for him appearing in the movie.  Does he actually get involved in getting the movie made beyond slapping his name on it?  Meanwhile I've seen a lot of Plan B movies that don't have Brad Pitt in them, so I'm guessing they're actually involved in getting the movie produced.\n\nSo what's the typical involvement like? What differentiates a movie Starring Dwayne Johnson from a movie Starring Dwayne Johnson &amp; Produced by Seven Bucks?  And why/how are these different than just \"Executive Producer Nicole Kidman\" or something?",
        "upvotes": 58,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1gt4xmo/what_do_actors_production_companies_actually_do/"
    },
    {
        "id": "1gt48cx",
        "author": "IKnowWhereImGoing",
        "title": "Miracle Mile (1988)",
        "content": "I watched this for the first time today, and now can't believe this film isn't mentioned more frequently.\n\nIt's fun and frankly...nuts. Starts as a sweet and gentle romance, and ends as a dark reminder of the impact of nuclear war.\n\nGreat performance from Anthony Edwards, with Mare Winningham as the woman he falls for, plus brilliant support from Mykelti Williamson and Kurt Fuller.\n\nA strange and entertaining ride, with about as much '80s' crammed into a film as is humanly possible.\n\nIt also has the sweet bonus of the two leads getting married IRL, over 30 yrs after they both starred in it.",
        "upvotes": 59,
        "comments": 32,
        "media": null,
        "permalink": "/r/movies/comments/1gt48cx/miracle_mile_1988/"
    },
    {
        "id": "1gsp1a8",
        "author": "Bennett1984",
        "title": "Heavenly Creatures at 30: The Story Behind Peter Jackson's Complex and Visually Stylish True Crime Drama",
        "content": "",
        "upvotes": 498,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2cP9mYiCUCPWyC8PHciX9wm0FXSWeUYCOsoYeLvAMwg.jpg?auto=webp&amp;s=f1826758271063d3c6a6ac478899595944345e5a"
        },
        "permalink": "/r/movies/comments/1gsp1a8/heavenly_creatures_at_30_the_story_behind_peter/"
    },
    {
        "id": "1gt7h7f",
        "author": "nightcitytrashcan",
        "title": "Favorite movies set in New York City? ",
        "content": "Inspired by [this](https://www.reddit.com/r/AllThatsInteresting/s/PRr3tzu2NM) post, I was reminded of how many of my favorite films are set in New York City, and also how many of those were made in the 70s and 80s.\n\nMy list:\n\n- Taxi Driver\n- Ghostbusters \n- Teenage Mutant Ninja Turtles\n- Maniac\n- The New York Ripper\n- Dog Day Afternoon\n- Escape from New York\n- Coming to America\n- Dressed to Kill\n\nWhat are your favorites? \n",
        "upvotes": 23,
        "comments": 100,
        "media": null,
        "permalink": "/r/movies/comments/1gt7h7f/favorite_movies_set_in_new_york_city/"
    },
    {
        "id": "1gs83ry",
        "author": "MarvelsGrantMan136",
        "title": "Disney Pulls 2026 ‘Star Wars’ Movie From Release Calendar",
        "content": "",
        "upvotes": 9832,
        "comments": 1511,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wrimKjD6M8Y-QdusR3mK5fJAVsmt9cEfFyZ9F_OdMFY.jpg?auto=webp&amp;s=718a7193097b8c13e37f9ca09298645121645736"
        },
        "permalink": "/r/movies/comments/1gs83ry/disney_pulls_2026_star_wars_movie_from_release/"
    },
    {
        "id": "1gsbw8o",
        "author": "UhohSantahasdiarrhea",
        "title": "Tarantino always sidesteps the most interesting part of the story, its his biggest strength.",
        "content": "He's such a strong writer he can come up with a story that would make a whole series on its own and totally ditch it, in favor of focusing on another part of the story that SHOULD be less interesting and make it all that matters.\n\nReservoir Dogs they skip the heist.\n\nPulp Fiction they skip over what Bret and his friends actually did, what made Vincent to run to Amsterdam, the conversation between Jules and Marcellus when Jules quit, Butch and Vincent's previous interactions, and the fight.\n\nJackie Brown may be the exception.\n\nKill Bill they skip over almost everything Faux Force 5 did as killers, even the discussion when they decided ***** needed to die.\n\nInglorious Basterds they skip almost everything they did on the ground.\n\nDjango, most of Hans Landa the First's backstory is glossed over.\n\nAnd such and such.",
        "upvotes": 4275,
        "comments": 441,
        "media": null,
        "permalink": "/r/movies/comments/1gsbw8o/tarantino_always_sidesteps_the_most_interesting/"
    },
    {
        "id": "1gsxg0e",
        "author": "Competitive_Pop9002",
        "title": "Requiem For A Dream",
        "content": "What a crazy movie. I have seen my fair share of psychologically bent flicks but damn, I would call it a cinematic masterpiece. Absolutely brilliant cinematography. Props for the BGM. Definitely nihilistic, but left me asking for *more* for some reason. The title couldn't have been better. And oh, Ellen Burstyn, you have my heart.",
        "upvotes": 76,
        "comments": 68,
        "media": null,
        "permalink": "/r/movies/comments/1gsxg0e/requiem_for_a_dream/"
    },
    {
        "id": "1gspuzi",
        "author": "MarkyGalore",
        "title": "Best Phone Call Scenes in Movies?",
        "content": "\"Hello Martha,\" Hannibal Lecktor, spelled with a \"K,\" in Manhunter. [https://www.youtube.com/watch?v=sAjSxdwwFbQ](https://www.youtube.com/watch?v=sAjSxdwwFbQ)\n\nA French movie called Red Lights.  A guy wakes up and while in a brutal hangover uses a phone at a cafe to try to locate his wife who booted him out of the car the night before.  The counter girl gets so involved in the conversation she give him a free sandwich as he desperately tries to gather information in a pre smart phone era.  [https://en.wikipedia.org/wiki/Red\\_Lights\\_(2004\\_film)](https://en.wikipedia.org/wiki/Red_Lights_(2004_film))\n\n  \nEthan Hunt, \"You're in Prague?\"  Phone call made to Kittridge. [https://getyarn.io/yarn-clip/9aad4c40-c28b-42f0-9b5f-e1a7a1d3f499](https://getyarn.io/yarn-clip/9aad4c40-c28b-42f0-9b5f-e1a7a1d3f499) Sorry I couldn't find the full conversation. \n\n",
        "upvotes": 153,
        "comments": 384,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/d_fEOCI2LjUKzVrffwmQgMNQd83B0agvwFSP0ZOWYvI.jpg?auto=webp&amp;s=82db230795f3ee3be154b034b5f295eaa792263b"
        },
        "permalink": "/r/movies/comments/1gspuzi/best_phone_call_scenes_in_movies/"
    },
    {
        "id": "1gt53ma",
        "author": "kitkat-9",
        "title": "Recommend me stuff to watch while recovering from surgery?",
        "content": "I’m having brain surgery in a little over a week and will just be sitting around for a while so I’m looking for some good movies and/or tv shows to put on my list. Preferably nothing that makes me think too hard lol. I like shows like schitt’s creek, Abbott elementary, and Ted lasso. For movies I like a pretty wide range, from Get Out to The Fall Guy to cheesy Hallmark type stuff for the holidays. I’m 31F btw if it matters. Thanks in advance!",
        "upvotes": 14,
        "comments": 51,
        "media": null,
        "permalink": "/r/movies/comments/1gt53ma/recommend_me_stuff_to_watch_while_recovering_from/"
    },
    {
        "id": "1gsvxsp",
        "author": "lawns",
        "title": "\"Werewolf Game\" trailer, Horror Movie starring Tony Todd as the villain, one of his last movies",
        "content": "",
        "upvotes": 66,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/B0MipkVFe40vsUJTO-O_QcPxH4Etl2AKHuwsjZ7lgPM.jpg?auto=webp&amp;s=1e5044a24f118b0f4e038e66f000c8e6dfeab160"
        },
        "permalink": "/r/movies/comments/1gsvxsp/werewolf_game_trailer_horror_movie_starring_tony/"
    },
    {
        "id": "1gsodyq",
        "author": "theatlantic",
        "title": "‘Emilia Pérez’ Review, by Shirley Li: A Film Impossible to Have Mild Feelings About",
        "content": "",
        "upvotes": 155,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TEj8rdk28W0EEkea37v0wuNV-tw6t1XHQcr_gAgRWwE.jpg?auto=webp&amp;s=4edc7a915abeed9bc6714ee7b3c035e0942f3ce7"
        },
        "permalink": "/r/movies/comments/1gsodyq/emilia_pérez_review_by_shirley_li_a_film/"
    },
    {
        "id": "1gt1ndv",
        "author": "Ok-Bar601",
        "title": "Thoughts on Nic Cage’s performance in Vampire’s Kiss",
        "content": "So I watched this movie yesterday not really knowing anything about it except that Nic Cage was in it. The movie itself was pretty average although I now understand it’s a cult classic having read up on it after watching.\n\nI gotta say, Nic Cage gives an incredibly wild performance which I’m still trying to determine if this was a classic case of Nic Cage overacting antics or he was in fact just brilliant. \n\nThe only thing I know for sure is he was 100% committed to the role, and I was there with him all the way despite the quality of the movie. It’s like watching someone who is way over the top, but he makes you believe that he believes in himself and what he is doing.\n\nHe’s a remarkable person, strange and fascinating, eccentric and spot on at times in his acting performances. The guy can act when he puts his mind to it, as witnessed in Pig where he was much more subtle. Then you see him in something like Colour Out Of Space, his performance was eccentric to say the least but still watchable all the same like you can’t take your eyes off of him. At times you cringe when he goes off the reservation and other times you’re in awe of his more memorable performances thinking “Is this the same guy??”\n\nWhat are your thoughts on his Vampire’s Kiss role?",
        "upvotes": 23,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1gt1ndv/thoughts_on_nic_cages_performance_in_vampires_kiss/"
    },
    {
        "id": "1gs2odv",
        "author": "Puzzled-Tap8042",
        "title": "Snow White has an estimated net budget of $214m\n",
        "content": "",
        "upvotes": 6581,
        "comments": 1693,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GJHCMTifjXmdrUz5PqKXVqjFknM8mVeQj0LPznVvTzw.jpg?auto=webp&amp;s=0ce35fed014e784838e64311c81af229e9b0df5c"
        },
        "permalink": "/r/movies/comments/1gs2odv/snow_white_has_an_estimated_net_budget_of_214m/"
    }
]