[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 494,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ia3wns",
        "author": "krazykatz911",
        "title": "Cancelling after 20 years",
        "content": "Price increase again.   $24.99 a month.  $300 a year.  Just plain ripoffs.  \n\nI’ve been a customer for 20 years.  Never again.  \n\nThe content is garbage.  \n\nA lot of the shows/movies are in different languages.  Which is fine but allow the user to select what languages they only want to see.  Not mix it all together and you have to start playing it to find out. \n\nA lot are old and available free on prime anyway.  \n\nThe keep raising the rates like it’s something people can’t live without. \n\nI got 4 streaming services for less than half of what Netflix wants a year. \n\nGoodbye greedy Netflix. ",
        "upvotes": 1374,
        "comments": 325,
        "media": null,
        "permalink": "/r/netflix/comments/1ia3wns/cancelling_after_20_years/"
    },
    {
        "id": "1iafu8x",
        "author": "johnppd",
        "title": "Netflix won the streaming wars, and we’re all about to pay for it",
        "content": "",
        "upvotes": 58,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1iafu8x/netflix_won_the_streaming_wars_and_were_all_about/"
    },
    {
        "id": "1iagsqk",
        "author": "cu_when_i_cu",
        "title": "Netflix will keep raising prices, they want you to downgrade because they make more money off ads.",
        "content": "Old DVD subscriber here, unsubscribed this weekend. Won't won't sign back up until there's a number of shows to watch, binge and then disconnect again.",
        "upvotes": 41,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1iagsqk/netflix_will_keep_raising_prices_they_want_you_to/"
    },
    {
        "id": "1ia2zgv",
        "author": "stellacampus",
        "title": "Anyone else think \"WTF is \"Emilia Pérez\"?\" when they saw 13 Oscar nominations?",
        "content": "Emilia Pérez got 13 Oscar nominations, more than any other movie, and I had never even heard of it until recently.  In all the time it's been on Netflix, I've never seen it suggested in any of the lists I've perused on my home page.  If I had seen it, I probably wouldn't have watched it - I mean it's a French movie, in Spanish only, about a trans gangster in Mexico, and it's a musical to boot.  Now of course I have to at least give it a shot!",
        "upvotes": 271,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1ia2zgv/anyone_else_think_wtf_is_emilia_pérez_when_they/"
    },
    {
        "id": "1ia2id7",
        "author": "HehroMaraFara",
        "title": "Night Agent Season 2 = Massive Disappointment",
        "content": "I loved the first season and did not expect much from it, which might have been key. \n\nI was hoping for more of the same understated approach with brief bursts of action and situational resolution. \n\nThis was not that. This was a convoluted mess of overly complicated ideas and plot lines, with random characters that are just an inch deep on development. I’m not even gonna mention the whole first couple of episodes of him being a basketball coach protecting a kid from an abduction. They sooooo loosely tied it in with the main story that they might as well of labeled it as the “Peter is a great guy, remember?” Prologue. \n\nThe story is generally boring. They made Rose sadly annoying and inexplicably demanding and entitled. It got so stupid and lost that the head of the program was forced to say, in literal dialogue “Night Agent missions often hit deadends” as if accidentally being caught on a hot mic trying to explain away why there are so many dumb unnecessary twists. \n\nWatch season one and pretend this doesn’t exist. ",
        "upvotes": 61,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1ia2id7/night_agent_season_2_massive_disappointment/"
    },
    {
        "id": "1iah0t1",
        "author": "Original2021",
        "title": "Night agent season 2 worked against the entire premise of the show",
        "content": "The entire show is built around a premise that a night agent is the most elite intelligence officer that exists. Yet Rose, with no training is running around meddling in highly sensitive missions. I couldn't even finish the season. Its obvious the writers wanted Rose to have a presence during the season but this made the plot unbelievable. It's too bad because the lead actor could  have easily carried the series without the other character helping him. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iah0t1/night_agent_season_2_worked_against_the_entire/"
    },
    {
        "id": "1iaj2rc",
        "author": "ZainVstar456",
        "title": "Netflix SpongeBob Glitch",
        "content": "I was watching SpongeBob, The Legend of Boo-kini Bottom in Netflix, when SpongeBob And Patrick were shaking, I paused it, so I saw SpongeBob had 4 eyes? And Patrick Had Three? And an Extra Mouth? And Hemet. So anyone discuss about it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iaj2rc/netflix_spongebob_glitch/"
    },
    {
        "id": "1iaeo5m",
        "author": "katheryn_gamer_girl",
        "title": "household questions",
        "content": "hii\n\nSo I used to live in Philippines for a year and half and setup my Netflix account there because I have a girlfriend and we share the account and I opened on June 2022\n\nI had to return home to the states in Nov 2023 and it didn't give my girlfriend a temporary access code until Nov or Oct 2024 and I gave it to her and I stopped using Netflix at that point and she is the one mainly using it now\n\nmy question is I logged in yesterday and started watching a movie I can only find on Netflix, will my girlfriend still get a temporary code again or will I or will the systems not even notice?\n\nI checked and she had logged in after I had watched last and the temporary code would be sent to me if she tried to log in for a temporary duration but that never happened \n\nThanks!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iaeo5m/household_questions/"
    },
    {
        "id": "1iaebol",
        "author": "luddecrous",
        "title": "Netflix changing age rating when changing profile picture",
        "content": "I have age restrictions on my kid’s profile, 10+ and down. Recently my kid discovered that when they change their profile picture, suddenly they have access to everything, no restrictions. I received an email from Netflix saying age restrictions had been removed and subsequently started digging into why this was. \n\nAfter some digging I realized that when a profile with age restrictions on changes their profile picture, the age restriction disappears. It didn’t fail once. Has anyone else had this bug/problem? I have an LG TV with WebOS if it makes a difference. I tried changing the profile picture on my kid’s profile on my phone and nothing happened, so it seems to be an LG problem perhaps?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iaebol/netflix_changing_age_rating_when_changing_profile/"
    },
    {
        "id": "1i9lgow",
        "author": "Whobitmyname",
        "title": "‘Pantheon’ Season 2 to Stream For The First Time on Netflix, All 8 Episodes Premiere February 21",
        "content": "",
        "upvotes": 107,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1i9lgow/pantheon_season_2_to_stream_for_the_first_time_on/"
    },
    {
        "id": "1iablph",
        "author": "Additional_Thanks927",
        "title": "Dragon ball daima",
        "content": "Dragon ball was released in English on crunchy roll and in theaters but netflix only has the Japanese version when can we expect them to release the English dub or are they only permitted to show the Japanese original?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iablph/dragon_ball_daima/"
    },
    {
        "id": "1iab2pa",
        "author": "Horror-Perception792",
        "title": "Unable to watch anime",
        "content": "Whenever i try to watch anime on netflix i always get pardon the interruption error .While other series work fine and i never get that error but this happens only while watching anime. Please help to resolve this is issue",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iab2pa/unable_to_watch_anime/"
    },
    {
        "id": "1ia6z3z",
        "author": "BearFluffy",
        "title": "Security breach and server down?",
        "content": "Was having trouble logging into my TV that's setup. Tried logging in but my account email couldn't be found, then saw I had an email that my email changed. I tried contacting but huge likes they're just redirecting...was I hacked or were a bunch of people?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ia6z3z/security_breach_and_server_down/"
    },
    {
        "id": "1ia2hfp",
        "author": "gullzway",
        "title": "When does the price increase happen?",
        "content": "My Standard no Ads plan renews on Feb. 7th. No indication that the price is increasing, nor communication from Netflix about it.  \n\nWill it just charge me $17.99 on 2/7?\nIf so I may change to the ads plan before then.",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ia2hfp/when_does_the_price_increase_happen/"
    },
    {
        "id": "1i9tqqv",
        "author": "AmericanFurnace",
        "title": "Are the Turning Point documentaries any good?",
        "content": "These documentaries look interesting to me, especially the 9/11 one. But I do know that Netflix documentaries don't have that good of a reputation. So I'd like to know if these Turning Point documentaries are good documentaries or just outright terrible.",
        "upvotes": 12,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1i9tqqv/are_the_turning_point_documentaries_any_good/"
    },
    {
        "id": "1i9o0kq",
        "author": "Practical-Creme-6025",
        "title": "Netflix hikes prices in the US, Croatia and Egypt",
        "content": "Price changes are as follows:\n\nUnited States \n\n- Standard with ads - $7.99 (up from $6.99)\n- Standard - $17.99 (up from $15.49)\n- Premium - $24.99 (up from $22.99)\n\nCroatia \n\n- Basic - €5.99 (up from €4.99)\n- Standard - €9.99 (up from €7.99)\n- Premium - €12.99 (up from €9.99)\n\n*No ad-supported plans available in Croatia\n\nEgypt \n\n- Basic - $1.99 (up from $1.39)\n- Standard - $3.39 (up from $2.39)\n- Premium - $3.99 (up from $3.29)\n\n*No ad-supported plans available in Egypt\n\nArgentina \n\n- Basic - $5.79 (up from $3.99)\n- Standard - $9.59 (up from $6.89)\n- Premium - $12.99 (up from $9.29)\n\n*No ad-supported plans available in Egypt\n",
        "upvotes": 19,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1i9o0kq/netflix_hikes_prices_in_the_us_croatia_and_egypt/"
    },
    {
        "id": "1iaim54",
        "author": "Hairy_Astronomer1638",
        "title": "Why are so many people acting like 24.99 is the only tier for Netflix?",
        "content": "I’m genuinely curious considering the influx of posts suggesting the latest price hike ($2 for the tier in question) is the straw that broke the camel’s back. Are the majority of us okay with prices at/below $23? I don’t mean for the question to sound as harsh as it does, more so trying to gauge where everyone’s at with the streaming industry. For example, I have the ad-tier Netflix/D+, but I’ll like cancel D+ if either service increases their price again. TIA for any datapoints!",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1iaim54/why_are_so_many_people_acting_like_2499_is_the/"
    },
    {
        "id": "1i9z1zg",
        "author": "Aware-Leg-6725",
        "title": "I need a show to watch",
        "content": "I have not watched much shows so there is lots for me to watch. I have seen the big hits of stranger things, Wednesday, and squid game plus a few miscellaneous reality shows like squid game the challenge. What are your top recommendations.",
        "upvotes": 2,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1i9z1zg/i_need_a_show_to_watch/"
    },
    {
        "id": "1iagivx",
        "author": "Deep-Jackfruit-5101",
        "title": "CANCEL NETFLIX",
        "content": "Guys, it’s time we take a stand and cancel this subscription. $300 a year? What were we even thinking? This isn’t just overpriced—it’s exploitation. They’ve been taking advantage of our loyalty, knowing we’d keep paying without questioning it. But enough is enough. There are other ways to access the same content for free, yet we chose to support them, believing it was the right thing to do. And how do they repay us? By squeezing us for every dollar, treating us like we’re fools. We can’t let them get away with this anymore. It’s not just about the money—it’s about principle. We deserve better than this, and it’s time we demand it. Canceling isn’t just saving your wallet; it’s sending a message. Let’s stop being taken advantage of.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iagivx/cancel_netflix/"
    },
    {
        "id": "1iac2zu",
        "author": "Klaasic_",
        "title": "What the hell is this?",
        "content": "https://preview.redd.it/pyl69ot4nbfe1.png?width=1901&amp;format=png&amp;auto=webp&amp;s=7ba75b83d818b52e1361833cb380c98b2a018502\n\nIt's literally just me on the account but I watch it from multiple locations (including work sometimes) and this pops up. 1. Why he hell am I paying for an extra member and 2. Does this mean I'm only able to watch it from one location now?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1iac2zu/what_the_hell_is_this/"
    },
    {
        "id": "1ia4n0f",
        "author": "DarkSoulCarlos",
        "title": "Question about show called \"freaks\"?",
        "content": "This is a long shot, but does anybody recall a show that was on Netflix called \"Freaks\"? I was going through my to watch list and I had written down \"Freaks\" but when I type in \"Freaks\", all I get are two movies, but no TV show. I tried searching on Google and all I find are the movies and Freaks and Geeks, except for one wiki which says that it was an HBO show about people with powers, but I can't find anything else about it. If anybody has any info, it would be greatly appreciated. Thank you for your time :)\n\n  \nEdit: [https://ideas.fandom.com/wiki/Freaks\\_(TV\\_Series)#Antagonists](https://ideas.fandom.com/wiki/Freaks_(TV_Series)#Antagonists) This seems similar to what I saw but I cannot find this credited on the IMDB page of any of the cast members mentioned on the Wiki. And there are some big names on that list. It makes no sense. What a mystery. ",
        "upvotes": 0,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1ia4n0f/question_about_show_called_freaks/"
    },
    {
        "id": "1ia4jd8",
        "author": "Senna2019",
        "title": "Active subscription - check please?",
        "content": "Can someone with an active subscription please confirm if the show A Discovery of Witches is on the platform? I don’t want to spend money on their service, as expensive as it is, and find that the show I want is not even there.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ia4jd8/active_subscription_check_please/"
    },
    {
        "id": "1i9gfsp",
        "author": "Witty-Two-343",
        "title": "Anybody know a fix around this ?",
        "content": "",
        "upvotes": 49,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1i9gfsp/anybody_know_a_fix_around_this/"
    },
    {
        "id": "1iagj2e",
        "author": "Deep-Jackfruit-5101",
        "title": "CANCEL NETFLIX",
        "content": "Guys, it’s time we take a stand and cancel this subscription. $300 a year? What were we even thinking? This isn’t just overpriced—it’s exploitation. They’ve been taking advantage of our loyalty, knowing we’d keep paying without questioning it. But enough is enough. There are other ways to access the same content for free, yet we chose to support them, believing it was the right thing to do. And how do they repay us? By squeezing us for every dollar, treating us like we’re fools. We can’t let them get away with this anymore. It’s not just about the money—it’s about principle. We deserve better than this, and it’s time we demand it. Canceling isn’t just saving your wallet; it’s sending a message. Let’s stop being taken advantage of.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1iagj2e/cancel_netflix/"
    },
    {
        "id": "1ia2dru",
        "author": "superpowers335",
        "title": "Did Netflix remove the season recaps?",
        "content": "Is it just me or do some of the season recaps seem to be missing? For example, Cobra Kai would often have recaps at the start of the seasons if it had been some time since you've watched. I checked the section that has the trailers and recaps and there don't appear to be any recaps listed. Not a big deal. It had just been a while since I've watched and it caught me by surprise. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ia2dru/did_netflix_remove_the_season_recaps/"
    },
    {
        "id": "1ia0auo",
        "author": "Shinola79",
        "title": "Question on Netflix with Ads",
        "content": "I would like to save money every month and go to the ad based service but what is holding me back are the types of ads. We have a 4 year old and I am amazed at the ads other services are showing during family shows and even kids shows. Heck even the banner at the top of Disney isn’t appropriate for their kids account…kid shows listed under a scary monster 🙄\n\nAnyone unhappy with the ad content their child might see?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ia0auo/question_on_netflix_with_ads/"
    },
    {
        "id": "1ia50wx",
        "author": "Ionenschatten",
        "title": "Removing game advertisement \"UNDERWATER-MELON\" from the front page?",
        "content": "Hey everyone!   \nFor months my front page has been blocked by this ginormous ad covering my entire screen.  \n\n\nhttps://preview.redd.it/llphzofwd9fe1.png?width=1849&amp;format=png&amp;auto=webp&amp;s=f82656d26988b68d241c9018cc518dc57b6e71d2\n\n\n\nDoes anybody know how to get rid of this? I'm a paying customer and downvoted this low-quality 1999 game already. It's still there and I haven't been getting any recommendations for months now because of this annoying game advertisement. It's so frustrating, I've found NOTHING online on how to deal with this. It's like a Computer Virus. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ia50wx/removing_game_advertisement_underwatermelon_from/"
    },
    {
        "id": "1i94kc3",
        "author": "mntgoat",
        "title": "Kevin Can F**k Himself",
        "content": "If you have some time to check out a very unique show, please give Kevin Can F**k Himself a chance. \n\nI don't want to spoil it for anyone, I feel it is best to just be surprised by the format.\n\nSmall warning, you must make it past the first scene before giving up. \n\nApologies if this has been posted before but I just haven't seen it mentioned here before. \n\n",
        "upvotes": 109,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1i94kc3/kevin_can_fk_himself/"
    },
    {
        "id": "1i94xib",
        "author": "Honest-Regular-9561",
        "title": "Is the Night Agent actually good man?",
        "content": "I’ve been seeing so much promotion for the new season and it’s starting to intrigue me. I need to know is this show good. Not average because I could watch other stuff if it’s just a regular show. With all the hype is it some of the best when it comes to Netflix shows? The name always threw me off.",
        "upvotes": 87,
        "comments": 115,
        "media": null,
        "permalink": "/r/netflix/comments/1i94xib/is_the_night_agent_actually_good_man/"
    },
    {
        "id": "1i9vddz",
        "author": "No-Cantaloupe2132",
        "title": "Sand Castle: When 'psychological' means 'nonsensical'",
        "content": "Spoiler alert!\n\nThe first half:  vibes of thrill and a beautiful family working together to survive. \n\nThen it all turns for the worse.  The mom delves into the water to save her drowning kid.  And from this point onwards, little to nothing made sense.  Suddenly Jana(?) turned out not to be in the water.  Then the mom drowned?  Although it was never clear, because they dragged her into the cabin(?).  \n\nYep — dead I guess?  She never appeared again, so.  But the brother (Adam) tells Jana nothing.  The dad asks for a cup of coffee.  Then a bit later he crawls out to the shore and appears to have some sort of strange seizure.  The son (Adam) puts on his headphones.  Is the dad dead now too?\n\n\"We'll see mom and dad soon,\" the son tells his sister.  Ehm . . . okay, is that a look back to when they were alone in the boat, before it capsized (mentioned in the beginning)?  Nope, they seem to be on the island still, so it's the present.  \n\nAnd then too much psychological randomness to handle.  Pictures flashing by, views into different places without context.  All kids in a school being bombed (seemingly on the island too?).  And Yara, which I thought was Jana's late sister, wearing that shoe.  \n\nSuddenly the island is covered with water, rising and rising, and from the lighthouse a blow-up boat suddenly unfolds — which had previously been underneath the sand on the shore. \n\nThat's right after they managed to communicate their location on the radio and saw help pass by, upon which Adam thought he could swin out to the boat with a short rope for safety. \n\nWhat am I missing?  \nWhy was it so incomprehensible to me?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1i9vddz/sand_castle_when_psychological_means_nonsensical/"
    }
]