[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 488,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i4djim",
        "author": "Zeroyhme",
        "title": "Squid Game: Season 1 vs Season 2 Comparisons",
        "content": "",
        "upvotes": 262,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1i4djim/squid_game_season_1_vs_season_2_comparisons/"
    },
    {
        "id": "1i40qdy",
        "author": "No_Order3035",
        "title": "Squid game in India! ",
        "content": "",
        "upvotes": 494,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/cvmk5oarvode1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1i40qdy/squid_game_in_india/"
    },
    {
        "id": "1i4fypb",
        "author": "Celebril63",
        "title": "Younger has become our new \"guilty pleasure\"",
        "content": "My wife was intrigued by the preview clip, so i popped the episode on for her. She laughed so hard, she peed.  We're now halfway through season 5, so getting into the home stretch.\n\nIf i had to describe it, I'd say Schitz Creek meets Hart of Dixie with Emily In Paris style.  \n\nIf you liked any of those, it might be worth giving it a go.  \n\nOh... I was also told that the Kdrama Romance Is A Bonus Book is loosely based on Youmger. And yes... I can see the connection, but definitely, \"Loosely.\"",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i4fypb/younger_has_become_our_new_guilty_pleasure/"
    },
    {
        "id": "1i4l3kz",
        "author": "Plenty-Celebration-5",
        "title": "Can I change Kids profile PG rating?",
        "content": "Hello, I have 4 friends/profiles on a Netflix account. I’m being asked if it’s possible to change the rating’s on the Kid profile so they can watch additional media on their own acc. Please advise if this is possible. It seems as if it’s restricted when I try changing the rating via settings on my browser.",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i4l3kz/can_i_change_kids_profile_pg_rating/"
    },
    {
        "id": "1i41pdh",
        "author": "Robemilak",
        "title": "Netflix Co-CEO Ted Sarandos says David Lynch was working on a new limited series that “would have been his last project” but Covid and his declining health got in the way.",
        "content": "",
        "upvotes": 49,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1i41pdh/netflix_coceo_ted_sarandos_says_david_lynch_was/"
    },
    {
        "id": "1i4d1op",
        "author": "Fit_Independence_124",
        "title": "How to change first person on the account",
        "content": "Somehow we receive emails where they adress to my daughter(s account). Apparently she’s the first one to adress to. Also, all the watch suggestions are for her. \n\nHow can we change this? \n\nShe’s also on top of the accounts but I thought it was because it’s in alphabetical order. ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i4d1op/how_to_change_first_person_on_the_account/"
    },
    {
        "id": "1i4ltn9",
        "author": "HuskeeDaCringe",
        "title": "Netflix in dish anywhere",
        "content": "A while ago I canceled my Netflix bc I got it with dish, but I don’t know how to watch Netflix on my phone now, how can I watch it, is it just not possible, I checked through the whole app",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i4ltn9/netflix_in_dish_anywhere/"
    },
    {
        "id": "1i3bxpg",
        "author": "Robemilak",
        "title": "Interstellar got an epic billboard to promote its release on Netflix",
        "content": "",
        "upvotes": 1503,
        "comments": 69,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/l8a16rg6mide1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1i3bxpg/interstellar_got_an_epic_billboard_to_promote_its/"
    },
    {
        "id": "1i44ulv",
        "author": "S4v1r1enCh0r4k",
        "title": " Gabriel Basso says he does his own stunts in 'The Night Agent' since he doesn't like \"lying\" to audiences and wants the experience to be as immersive as possible ",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i44ulv/gabriel_basso_says_he_does_his_own_stunts_in_the/"
    },
    {
        "id": "1i4js8e",
        "author": "FernSchmidt",
        "title": "Netflix Not Working but like it's really weird",
        "content": "So for some reason Netflix is only allowing me to watch Netflix original content. But what's even weirder that it's only on my specific profile and only while on wifi. The other profiles on our account work fine and my profile works fine on data. But what is also strange is that not all Netflix Original Content is available. For example Lucifer is gone. Maybe because it was acquired idk.\n\nI'm just very confused on what is happening. Can anyone explain what is happening?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i4js8e/netflix_not_working_but_like_its_really_weird/"
    },
    {
        "id": "1i3dd6d",
        "author": "EthanWilliams_TG",
        "title": "Adam McKay Reveals 'Don't Look Up' Was 'Hated' by Critics but Watched by 400 Million to 500 Million on Netflix",
        "content": "",
        "upvotes": 804,
        "comments": 173,
        "media": null,
        "permalink": "/r/netflix/comments/1i3dd6d/adam_mckay_reveals_dont_look_up_was_hated_by/"
    },
    {
        "id": "1i4itcg",
        "author": "SlendyFin",
        "title": "Phone app \"wondering what to watch next\" notification spam",
        "content": "As the title suggests, I keep getting the \"wondering what to watch next\" notification on my phone, every time I swipe it off (or tap the notification to open the app) it instantly reappears. It's been happening all day\n\nI'm using the OnePlus 13 and both it and Netflix are up to date",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i4itcg/phone_app_wondering_what_to_watch_next/"
    },
    {
        "id": "1i47gqk",
        "author": "MrPianoFox",
        "title": "The 8 Show",
        "content": "Minor spoilers ahead!! \n\nI'm pissed at the reaction to thos show; it feels like a lot of people hate on it because they think it's piggybacking off of Squid Game, and I really don't feel that way. Squid Game was cool but it didn't really have substance to me, it felt like a game for the most part, it felt like that's what the showrunners treated it as. \n\nBut The 8 Show, *I* believe, has such a fucking fantastic message that ot portrays so beautifully. I think the cruelty of 8th Floor and 6th actually shows you what it's like being in the shoes of someone poor going up against someone rich. I think 4th floor and 5th floor being 'slaves' to the upper floors, and, somewhat by choice, not helping the lower floors is also fucking spot on. The lower floors stick together -- except one of them really needs the money, and will do *anything* to get it, including hurting the people around them. \n\nI was bothered by some plot holes, but i can explain things like 2nd locking them all up by... Well, they didn't want more time, but now that they have it... And 5th being naive and delusional makes sense, too, to me at least. Lots of whacky shit, but it's so raw and intense that I think it did its job well. \n\nAnd with the ending, I think it tied things up well. I did NOT like the games, I did NOT like the brutality, as a matter of fact I was so disturbed i cried at some parts and the only reason i didn't skip things was cuz i didn't wanna miss story, or miss the emotions that came from things like 3 fucking HOME RUNNING 1'S HEAD. \n\nChills.\n\nIt's not for everyone. But I've been poor all my life, and i have had a lot of friends and family in different places. All the different systems of hierarchy and power that are put in place is what gets people killed. As an anarchist and anti-capitalist, the message resonated with me, not manhy shows or movies I've seen capture just how genuinely brutal and uncaring the *systems* are while somehow making sure to keep every character somewhat empathetic or understandable. Except 8. Fuck 8. \n\nGreat show, the hate is undeserved, i don't think it's really about the story so much as what it's trying to tell you. ",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i47gqk/the_8_show/"
    },
    {
        "id": "1i3qi0w",
        "author": "FradiTomi",
        "title": "Netflix’s Biggest Shows Will End This Year – What’s Next After 2025?",
        "content": "Stranger Things, Squid Game, You, Cobra Kai all ends this year with their final season and also we get Wednesday Season 2 this year, but let’s be real—it’ll probably be at least 2028 before we see Season 3 (if there is one). So apart from Bridgerton whats left for next 2-3 years after 2025 for Netflix? Yes there are couple of good series which I did not mention in this post, but these ones have their biggest viewership.",
        "upvotes": 87,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1i3qi0w/netflixs_biggest_shows_will_end_this_year_whats/"
    },
    {
        "id": "1i3kyrz",
        "author": "Rocknrollsk",
        "title": "American Primeval: as a Frenchman I’m offended.",
        "content": "No, I’m just kidding.  \n\nBut seriously, I’ve seen a lot of talk about how the Native Americans and Mormons are portrayed, but nobody’s talking about that crazy shit with the French.  What the fuck.",
        "upvotes": 158,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1i3kyrz/american_primeval_as_a_frenchman_im_offended/"
    },
    {
        "id": "1i3bpgb",
        "author": "Whobitmyname",
        "title": "Adam McKay Says ‘Don’t Look Up’ Was ‘Hated’ by ‘Critics and Cultural Gatekeepers’ but Seen by an Estimated ‘400 Million to Half a Billion’ People on Netflix",
        "content": "",
        "upvotes": 728,
        "comments": 111,
        "media": null,
        "permalink": "/r/netflix/comments/1i3bpgb/adam_mckay_says_dont_look_up_was_hated_by_critics/"
    },
    {
        "id": "1i4gle1",
        "author": "Internal_Opposite_48",
        "title": "Why I cant watch Breaking Bad with english subtitles",
        "content": "I recently started watching *Breaking Bad*, and I wanted to improve my English skills by watching it with English subtitles. However, I’ve encountered a problem I'm unable to access the English subtitles for the series. I’ve tried looking into the settings on the streaming platform I’m using, but the option for English subtitles doesn’t seem to be available, or maybe I’m missing something.\n\nCould this issue be related to regional restrictions or a technical error? I’m not sure if where I live is causing the limitation. If there’s a specific method or setting I should be using, I’d greatly appreciate your guidance.\n\nWatching the show with English subtitles would be really helpful for me, as I’m working on improving my language comprehension.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i4gle1/why_i_cant_watch_breaking_bad_with_english/"
    },
    {
        "id": "1i3s6ot",
        "author": "DiskoKittyy",
        "title": "Netflix to Release Greta Gerwig's Narnia Film in Theaters Before Streaming",
        "content": "",
        "upvotes": 15,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3s6ot/netflix_to_release_greta_gerwigs_narnia_film_in/"
    },
    {
        "id": "1i3yt51",
        "author": "lost_taco_cat818",
        "title": "Something Spooky w/the Netflix Roku app",
        "content": "I opened my Netflix app on a smart TV with Roku and the picture looks really weird. It’s very pixelated and there are random spots of black. It’s happening on every movie/show on the app. Is this happening for anyone else? ",
        "upvotes": 6,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vi6c98z2bode1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1i3yt51/something_spooky_wthe_netflix_roku_app/"
    },
    {
        "id": "1i45qtd",
        "author": "TraditionalAirport4",
        "title": "Netflix 4k in Edge on window 10 help?",
        "content": "I've tried everything and I can't get it to run in 4k?\n\nHas anything changed in the last few months that I don't know about?\n\nI have the paid for HEVC video extensions installed.  An RTX 4060 connected to a LG C2 TV via HDMI. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1i45qtd/netflix_4k_in_edge_on_window_10_help/"
    },
    {
        "id": "1i45mcc",
        "author": "pbbSnarker",
        "title": "Single’s inferno season 4",
        "content": "Is the season 4 worth watching? I watched the previous season and I used to get excited about every new season news, but this one doesn’t excite me as much as before. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i45mcc/singles_inferno_season_4/"
    },
    {
        "id": "1i4ce2t",
        "author": "hoeassxo",
        "title": "Recently saw this movie “Don’t Move” (2024), and I have so many questions ",
        "content": "Sorry, I watched this movie in a rush and missed most of Richard’s perspective. Help me comprehend these loops \n\n1. They didn’t delve deeply into Richard’s past or his reasons for doing the kind of “work” or leading his “secret life” I mean how does a car crash from when u were in grad school turn someone into a serial killer as they grow older? \n\n2. Speaking of his secret life, was Richard trying to build a relationship with Iris at first because he was searching for Chloe in all the girls or does he simply kill all of them to keep his mental health intact? \n\n3. In the past, did Richard accidentally kill Chloe while under the influence, or was he troubled and fully aware, considering the creepy “thank you” he said later?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i4ce2t/recently_saw_this_movie_dont_move_2024_and_i_have/"
    },
    {
        "id": "1i4570z",
        "author": "Vegetable-Lion-2152",
        "title": "How do you download movies / series on Netflix Windows?",
        "content": "So i just recently got a laptop and i got so confused and lost after not finding the download button on my netflix on web and on the app. Can you not download movies on pc?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i4570z/how_do_you_download_movies_series_on_netflix/"
    },
    {
        "id": "1i4enqe",
        "author": "Adventurous-Task-203",
        "title": "Back in action ..Did anyone else notice Jamie foxx slurred speech? ",
        "content": "I am currently watching Back in Action. I am  27 minutes in and he says \" yeah now that didn't make sense what she said \" his next line seems(is) slurred as he says \" but do you wanna mess with her after what she did to them human beings\". I wonder did anyone at all even notice this while filming...I know hindsight is 50/50 but just wondering.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1i4enqe/back_in_action_did_anyone_else_notice_jamie_foxx/"
    },
    {
        "id": "1i480qn",
        "author": "CableBeautiful4316",
        "title": "favourite series",
        "content": "here are my top 5 series:-\n\n1.prison break\n\n2.lost\n\n3.from\n\n4. house of cards\n\n5.succession\n\nwhich are your top 5????\n\natleast 3 seasons and no breaking bad please\n\n",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1i480qn/favourite_series/"
    },
    {
        "id": "1i2s8o0",
        "author": "CautionCurb",
        "title": "Black bars showing on side even though tv is correct size.",
        "content": "Tried finding something in the settings to adjust aspect ratio but couldn't find anything. Does anyone know how to get rid of the black bars on the side? I'm literally using a tv that would fit the exact size of the show.",
        "upvotes": 1303,
        "comments": 261,
        "media": null,
        "permalink": "/r/netflix/comments/1i2s8o0/black_bars_showing_on_side_even_though_tv_is/"
    },
    {
        "id": "1i3hohf",
        "author": "Robemilak",
        "title": "A DIFFERENT WORLD IS COMING TO NETFLIX. Get ready to head back to Hillman on February 7.",
        "content": "",
        "upvotes": 20,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3hohf/a_different_world_is_coming_to_netflix_get_ready/"
    },
    {
        "id": "1i3azrl",
        "author": "th3_pund1t",
        "title": "Netflix donating $10M towards LA wildfire relief",
        "content": "",
        "upvotes": 63,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3azrl/netflix_donating_10m_towards_la_wildfire_relief/"
    },
    {
        "id": "1i3yqmx",
        "author": "rebuil86",
        "title": "Create a dialogue audio boosted version so i can stop relying on subtitles",
        "content": "Netflix application on smart TVs. Even when selecting stereo, and removing 5.1 makign sure its as good as it can be, simply can not be watched. Its imppossible, My wife has watched me screaming at how stupid teh wrold has become becasue the days of pluggin in a red and white cable and being ab le to watch a movie, are gone. its a giant scam now. Forcing you to spend thousands to buy a dobly digital receiver with a center channel with special modes, jsut to watch the movie your paying for.  \nNow, im not a fool, i understand what im talking about. My TV only ahs optical output, ive tried a soundbar, hiopeless vocals, so i upgraded to all icould afford, a bookshelf monitor system., edifier r1280db. Im really angry becuase thay hasnt helped. It recieves PCM only, so i have the TV set to that, and even if i choose stereo in netflix, its unusable, at maximum volume, there is absolutely no way one could make out peopls voices, subtitles are required.   \nThis si so incredibly stupid for a time nearly 30 years after the year 2000. Humans are suypposed to get more inteligent, but this stupid nonsense, is destroying the entertainment industry. Yes, its THAT bad,. Ive searched the web, and found no asnwers, onyl countless individuals wiht teh same heartache.  \nSo here I am, telling netflix on a reddit cahnnel, they should remix the entirer catalogue and reupload it, remastered, wiht a vocal boost audio option.  \nI dont think anyone wiht enough brain capacity or intellect would read this though,. the onyl solution is if im somehow going to find myself working for Netflix and fix it myself.\n\nThis is nto a user or hardware issue. The moxies have been uploaded with 5.1 or stereo withi the vocals (center channel) too low. Simple as that.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i3yqmx/create_a_dialogue_audio_boosted_version_so_i_can/"
    },
    {
        "id": "1i3c8nb",
        "author": "S4v1r1enCh0r4k",
        "title": " Greta Gerwig managed to break Netflix's usual no-theaters rule. Her Narnia adaptation will receive a special theatrical release with an extended exclusivity window, coming on Thanksgiving Day 2026 ",
        "content": "",
        "upvotes": 31,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1i3c8nb/greta_gerwig_managed_to_break_netflixs_usual/"
    }
]