[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 38,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pw29y9",
        "author": "Unlucky_Monitor_9644",
        "title": "Millie Bobby Brown",
        "content": "I’ve watched a lot of TV over the years and I’ve really enjoyed Stranger Things, but I do not understand how people laud MBB for this role. \n\nTo me the acting is as one dimensional as it comes and perhaps it’s the writing, but there doesn’t seem to be anything truly challenging about 11’s character. \n\nThe endless praise for MBB’s portrayal just doesn’t sit right with me. ",
        "upvotes": 1995,
        "comments": 497,
        "media": null,
        "permalink": "/r/netflix/comments/1pw29y9/millie_bobby_brown/"
    },
    {
        "id": "1pwbt9u",
        "author": "Sudden_Pop_2279",
        "title": "I don't think I've ever seen such a switch-up towards a show as with Stranger Things after this new volume",
        "content": "But I can't deny the criticisms are justified.\n\nFor starter's, the \"too many main character's\" critcism 100% becomes clear in this episode. WHY are we now making Holly Wheeler a major character? Girl was like 3-4 in the first season but now she's been clearly aged up to be a part to be part of the main cast. It almost feels like there was no point of her and Max's story since she ended up getting caught anyways.\n\nAnd the lack of stakes, holy cow are they embarassing. \"Its gonna be a dark Christmas\" says the Duffers. \"Episodes 6 and 7 are emotional and always make us cry!\" meanwhile, not a single relevant character has died. \"But its not Games of Thrones\" I'm fine with no main character dying but the Nancy and Mike's parents surviving is just the icing on the cake. Ted has done NOTHING all season, he honestly could've just died and nothing would change.\n\nIts pretty cheap how they honestly do the same tatic every single season. Introduce likable character (Bob, Alexei, Eddie). Get th audience attached to them. Kill them in emotional scene. \n\nAnd the way how the Duffers need to come in confirming everything is so much worse. \"Yes, that was actually a break-up scene between Nancy and Jonathan\". \"Yes, that was actually Will coming out and Mike knew he was his crush\". Like the writing shouldn't leave this needing to be clarified.\n\nAnd what's the point of The Shadow Play and making Vecna \"actually a victim of the Mind Flayer, who's the real big bad\" and then the Mind Flayer doesn't even make a single apperance or do anyhting throughout the season? The ending for episode 8 of season actually had me tense and nervous. The ending for episode 7 of this season had no such reation from me.",
        "upvotes": 183,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1pwbt9u/i_dont_think_ive_ever_seen_such_a_switchup/"
    },
    {
        "id": "1pwbsi3",
        "author": "entcanta333",
        "title": "How do you feel about the three-part release of Stranger Things?",
        "content": "I was so excited for this last season and after watching part 2, I feel like I've almost lost interest. I'm just in it to see the ending at this point, I don't feel emotionally invested in the show. ",
        "upvotes": 124,
        "comments": 162,
        "media": null,
        "permalink": "/r/netflix/comments/1pwbsi3/how_do_you_feel_about_the_threepart_release_of/"
    },
    {
        "id": "1pwa2j8",
        "author": "stroh_1002",
        "title": "Sadie Sink teases the Stranger Things series finale: 'It feels like a homecoming of sorts. It feels complete'",
        "content": "",
        "upvotes": 46,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pwa2j8/sadie_sink_teases_the_stranger_things_series/"
    },
    {
        "id": "1pvqg9x",
        "author": "ChuckieDabs",
        "title": "Netflix “Spoilers Commercial” 2025",
        "content": "Netflix just released a commercial for themselves during this 2025 Christmas NFL game that contained legitimate spoilers for the newest seasons of their TV shows. I do not get what marketing executive thought it was a good idea to run that. It was genuinely annoying and the message was some generic corporate American pandering.",
        "upvotes": 518,
        "comments": 108,
        "media": null,
        "permalink": "/r/netflix/comments/1pvqg9x/netflix_spoilers_commercial_2025/"
    },
    {
        "id": "1pw9zix",
        "author": "bishtpd",
        "title": "Suspense, crime, detective series on Netflix",
        "content": "I’m looking for recommendations for a gripping suspense or crime series on Netflix, similar in tone and depth to The Fall, Broadchurch, or The Sinner—slow burn, strong characters, and a dark, psychological edge. \n\nAny suggestions?",
        "upvotes": 9,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1pw9zix/suspense_crime_detective_series_on_netflix/"
    },
    {
        "id": "1pwh06l",
        "author": "ALife_TimeModerater",
        "title": "More people need to watch to ronja the robbers daughter the two season show is perfect and is very sad at the end of the show",
        "content": "The show is a medieval fantasy about two lost friends who battle each other and two children who don’t want to follow in there parent’s footsteps and two sisters who hunt robbers for traumatic reasonings  and a nice old dude ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pwh06l/more_people_need_to_watch_to_ronja_the_robbers/"
    },
    {
        "id": "1pvqf6c",
        "author": "cancerman1120",
        "title": "What was with that commercial?",
        "content": "Watching football and Netflix runs a commercial on its own service spoiling a bunch of shows? Maybe it was a gag since I covered my eyes since I did not want anything spoiled for me. Anyone watch it? Were there spoilers?",
        "upvotes": 153,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1pvqf6c/what_was_with_that_commercial/"
    },
    {
        "id": "1pvk4u5",
        "author": "TheMirrorUS",
        "title": "Netflix viewers furious over streaming issues during NFL Christmas coverage",
        "content": "",
        "upvotes": 286,
        "comments": 305,
        "media": null,
        "permalink": "/r/netflix/comments/1pvk4u5/netflix_viewers_furious_over_streaming_issues/"
    },
    {
        "id": "1pwkxz6",
        "author": "TheAlex918",
        "title": "subtitles on iphone",
        "content": "hi i’ve always used and set subtitles on my phone with my font and it always worked on android, in both phone and tablet. i’ve now recently passed to ios with iphone 15 and the subtitles are totally different. the settings in the netflix’s site are still the same though, and i don’t know what to do. i tried setting them again but they’re always the same. anyone knows how to help me? thank you",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pwkxz6/subtitles_on_iphone/"
    },
    {
        "id": "1pvokbm",
        "author": "bogeynick28",
        "title": "The amount of ads on the NFL stream is insane",
        "content": "is it just me? I don't usually watch live broadcasts on Netflix but dang the number of ads are insane... tbh I don't remember which plan I have but it's about 25$ a month. I don't even know why I'm getting ads. Really want to cancel after this month..",
        "upvotes": 135,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1pvokbm/the_amount_of_ads_on_the_nfl_stream_is_insane/"
    },
    {
        "id": "1pvvbtb",
        "author": "Baapofmovies_123",
        "title": "Stranger Things Season 5 Volume 2 Review (2025): Strong Moments, Weak Payoff Before the Finale",
        "content": "It continued  Netflix’s flagship sci-fi saga and is carrying the weight of an ending that fans have waited years to see. However, with so much expectations, Volume 2 falls flat, as it ultimately feels like an extended bridge to the finale rather than a satisfying chapter on its own. ",
        "upvotes": 44,
        "comments": 190,
        "media": null,
        "permalink": "/r/netflix/comments/1pvvbtb/stranger_things_season_5_volume_2_review_2025/"
    },
    {
        "id": "1pvrbvh",
        "author": "smooothaseggs",
        "title": "NFL/sport coverage is abhorrent",
        "content": "Holy smokes…what a terrible product.  The commentary, the (type of) ads, the lack of “watch live” option, the poor stream rate/resolution, the netflix branding of a raw tomahawk steak (“that looks pretty good”, NOT!!)…all just terrible.  I’m pretty sure they’re begging me to end my subscription and stream illegally.  I wasn’t the biggest fan of Amazon prime NFL games, but at least they figured it out.  I should have known after being a sucker and watching some of the “fights” they’ve promoted over the last couple years.  I digress…if you enjoyed it, then kudos!  Just needed to vent, and I won’t be back here.  Drew Brees is a real one, tho, always.",
        "upvotes": 75,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1pvrbvh/nflsport_coverage_is_abhorrent/"
    },
    {
        "id": "1pvlzwd",
        "author": "Careless_Worry_7542",
        "title": "Spoilers Monster the Ed Gein Story is the worst show Ive ever watched, ever.",
        "content": "I'd never seen one of these series, maybe watched half an episode on the Menedezes. I gave this a chance because I like Charlie Hunnam and heard the Dahmer and Menedez ones were decent. First episode or two Hunnam and Metcalf do a fine job getting into character and the production value was good. Hell I even was on board when they added Psycho as a sort of meta analysis he had on popular culture to add some filler to an otherwise short story. Then it kept going and going and going. It ends with a parody of Mindhunter, Richard Speck's man tits, and Gein catching Ted Bundy, Gein dying, seeing his mother in heaven, what felt like 95 ending scenes later some kids desecrate his grave and are chased off by the movie monsters he inspired, then finally ends on a flashback with his mom again.   More endings than The Return of The King. Absolute trash. ",
        "upvotes": 165,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1pvlzwd/spoilers_monster_the_ed_gein_story_is_the_worst/"
    },
    {
        "id": "1pwj1u6",
        "author": "chompy_thompy",
        "title": "dimming issue- help",
        "content": "when i watch netflix on my phone, during especially bright scenes the screen will suddenly dim so muc it goes black, and when it comes back, it has an odd grey tone to it for a few seconds. This has really been bothering me, does anyone else have the same issue and know how to fix it? i’ve tried adjusting my brightness on both my phone and my netflix app, but i’m wondering if there’s a setting i’m missing. Thanks so much!!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pwj1u6/dimming_issue_help/"
    },
    {
        "id": "1pwilyz",
        "author": "Shot-Transition-2803",
        "title": "Netflix Windows App - volume slider does not work",
        "content": "Hi, \n\nI bought Netflix for first time, using Netflix Windows App from MS Store / Win 11. \n\nProblem is that volume slider do nothing.. does not change volume. \n\nI tried turn off exclusive mode.. etc but no help\n\nThanks for any help",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pwilyz/netflix_windows_app_volume_slider_does_not_work/"
    },
    {
        "id": "1pwhpnl",
        "author": "oloebaloe",
        "title": "What should I watch first",
        "content": "I struggle to keep up with series a lot, the only serie I got finished is gossip girl. I hear a lot of good stories about sex in the city or desperate housewives. which one should I watch first and which serie did you learn to most out of it? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pwhpnl/what_should_i_watch_first/"
    },
    {
        "id": "1pvlptr",
        "author": "mrstevegibbs",
        "title": "Your very very long interviews in the middle of football r annoying",
        "content": "Interview celebrities before or after the game, not during. If during, please shorten them by 80%. Too many uncalled plays are taking place. Maybe I’m the only one.  ",
        "upvotes": 111,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1pvlptr/your_very_very_long_interviews_in_the_middle_of/"
    },
    {
        "id": "1pwfif4",
        "author": "River_media",
        "title": "Series to watch?",
        "content": "I’m bored asf constantly and I’m looking for some new content to watch, preferably action based or mystery I can follow along with and solve before the answer is revealed. Any recommendations? Thank you",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pwfif4/series_to_watch/"
    },
    {
        "id": "1pwf51x",
        "author": "Elspackel",
        "title": "AMC, what is this?",
        "content": "A lot of AMC series has been dropped on Netflix, and I have tried watch some...\n\nBut the the ones I have looked at, has all been flat, and not very interesting.\n\nIs there any of them, that are better then the rest, with more depth, more real fealing, more complex characters, more involving storylines?\n\nI have looked a little on Talamaska, NOS4A2, and Moonhaven, but as I said, they all fell flat.\n\nWhere do they come from, all these AMC series?\n",
        "upvotes": 1,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1pwf51x/amc_what_is_this/"
    },
    {
        "id": "1pwepm6",
        "author": "Sufficient-Tip-4454",
        "title": "What is up with all these weird new kid shows?",
        "content": "Maybe this is the wrong sub since I didn't see any other kid based discussions... But what is the deal with all these seemingly new kid shows that have no speaking and are just characters doing silly things?? They drive me absolutely crazy &amp; my son always finds them and cackles incessantly at them 😵‍💫😵‍💫 maybe I'm the only one with this opinion lol but please make it stop!",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pwepm6/what_is_up_with_all_these_weird_new_kid_shows/"
    },
    {
        "id": "1pwemol",
        "author": "DiesIrae7",
        "title": "When you stop watching something early, how do you think about it?",
        "content": "Sometimes I’ll quit start a show or movie that Netflix recommends and still quit 10–15 minutes in.\n\nCurious to know, when that happens, do you usually feel like it just wasn’t for you, or you didn’t give it enough of a chance, or you picked the wrong thing that night?\n\nCurious how other people think about this.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pwemol/when_you_stop_watching_something_early_how_do_you/"
    },
    {
        "id": "1pwj2do",
        "author": "Klutzy_Belt_2296",
        "title": "What is like….the point of The Great Flood?",
        "content": "I’m just watching this moving and I’m so lost lmfao\n\nLike I’m halfway in and I have no idea what the plot even is at this point.\n\nJust when you think you understand what’s going on you jump back to the beginning and what? It was all a dream\n\nThis no lie reminds me a lot of A House of Dynamite\n\nI’ve never seen movies where the plot is so confusing to where you wonder wtf is this even about or why am I even watching this 💀💀💀\n\nAt least House of Dynamite semi made sense even though I was more so at a loss for like, who that movie is supposed to appeal to\n\nIdk these movies are weird ",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1pwj2do/what_is_likethe_point_of_the_great_flood/"
    },
    {
        "id": "1pwdmj9",
        "author": "Captain__Camp",
        "title": "Upgrade to Premium not visible on second account",
        "content": "Hey everyone,\n\nUntil about two weeks ago, we had the standard subscription (without ads) with an additional second account (second household since account sharing stopped working, so the standard subscription plus €4.99 for the second account).\n\nSince we've now bought a new TV, we switched to the premium subscription for 4K content via the main account. The change was immediately visible on the main account.\n\nHowever, over Christmas, we're now in the household with the second account, and the 4K content isn't visible. It's as if the switch to premium didn't happen.\n\nWhat's the problem here? Do we need to update something on the second account?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pwdmj9/upgrade_to_premium_not_visible_on_second_account/"
    },
    {
        "id": "1pvq9y7",
        "author": "Cannabaee",
        "title": "Terrible Netflix NFL Graphics",
        "content": "The graphics and informations displayed on the nfl games on Netflix were clearly created by someone that doesn’t watch football.\n\nThe teams don’t have their record displayed, don’t have distance for field goals, passes, runs, etc. \n\nThere’s basically no metrics or graphics on screen in general. Sucks especially when watching during a busy holiday w lots of noisy family in the room. ",
        "upvotes": 38,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pvq9y7/terrible_netflix_nfl_graphics/"
    },
    {
        "id": "1pw1ifz",
        "author": "Baapofmovies_123",
        "title": "Cashero Series Review (2025): Netflix’s Promising Korean Superhero Drama Undone by Messy Writing",
        "content": "This eight-episode series, which is led by Lee Jun-ho, introduces a refreshingly odd power system that is rooted in money and morality. But is it worth watching? Unfortunately, despite its compelling premise and capable cast, Cashero ends up being a below-average series.",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pw1ifz/cashero_series_review_2025_netflixs_promising/"
    },
    {
        "id": "1pwcpp2",
        "author": "GezginSirius",
        "title": "Missing Turkish Audio Description in Stranger Things S5E7 – Accessibility Issue",
        "content": "Hello everyone,\n\nI want to raise an accessibility issue on Netflix. In Stranger Things Season 5, Episode 7, the Turkish audio description option is missing. I am a visually impaired viewer, and I have been watching the entire series with Turkish audio description from the beginning. Since all the previous episodes include it, this seems like a technical issue specific to this episode. However, the result is that I cannot follow this part of the story and I am forced to stop watching the series midway.\n\nAudio description is not an “extra” for visually impaired people, it is the only way we can access visual storytelling. Without audio description, key elements such as character actions, facial expressions, scene changes, and silent visual cues are completely lost. When even one episode is missing audio description, it breaks the entire narrative and creates a serious sense of inequality in access.\n\nI have already reported this issue to Netflix customer support, and I wanted to share it here as well because collective awareness really matters. If you would like to support this, submitting feedback to Netflix can make a real difference.\n\nI also want to emphasize something important: compared to many other streaming platforms, Netflix is by far the most attentive and inclusive when it comes to providing Turkish audio descriptions for visually impaired users. I genuinely appreciate this effort. That is exactly why I believe this issue does not reflect Netflix’s usual standards and hope it will be resolved as soon as possible.\n\nIf you are willing to help, please consider sending feedback to Netflix requesting Turkish audio description for this episode. What may seem like a small detail is, for us, the only way to fully experience the story.\n\nThank you for reading and for your support.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pwcpp2/missing_turkish_audio_description_in_stranger/"
    },
    {
        "id": "1pwg5qy",
        "author": "No-Aside-3198",
        "title": "What the hell is the point of this",
        "content": "Netflix has a preview when you go on a show, a bit from a later season. Well I am on Season 2 of house of Cards and I went onto it to watch some. The first thing I see is a huge spoiler for the later seasons. What on earth is the point of this, giving away all of the pivatol information in 30 seconds",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pwg5qy/what_the_hell_is_the_point_of_this/"
    }
]