[
    {
        "id": "1ntdz4q",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 5,
        "comments": 230,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ntdz4q/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1nrzlx9",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Castilla - CD Tenerife | Primera Federación, Matchday 5",
        "content": "#FT: CASTILLA 1:3 TENERIFE\n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n0:1 Jesús de Miguel 17'\n\n0:2 Álvaro González 37'\n\n0:3 Jesús de Miguel 44'\n\n1:3 Roberto Martín 68'\n\nSecond yellow card: Lamini Fati (Castilla) 90'+6\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos\n\n7' - great free kick by Bruno Iglesias, but even better save to deny it\n\n⚽ 17' - goal for Tenerife - long kick by the keeper that Joan misjudges, leaving de Miguel free to convert 1v1 against Javi Navarro\n\n22' - big chance again after a long ball for de Miguel, but this time Javi Navarro makes a great 1v1 save\n\n⚽ 37 - corner for Tenerife, no one marks Álvaro González (ex Villarreal, Marseille...) so he can head it into the bottom corner with all his experience and physicality \n\n⚽ 44' - Tenerife are destroying Castilla like Atlético did with our first team - de Miguel toys with our defense on the box, Joan again looking awful, and curls it into the far corner \n\nHT - a horror first half against the best team in the division - this Castilla team is looking hopeless at the moment\n\n🔄 46' - 2nd half underway, Lamini and Roberto Martín on for Joan and Bruno Iglesias\n\n🔄 55' - Valdepeñas on for Manu Serrano \n\n🔄 67' - Dani Yáñez for Pol Fortuny, still no fight from this team... \n\n⚽ 68' - GOLLLL DEL CASTILLA - Roberto Martin loses the ball, but fights back and recovers it, and pulls the trigger immediately from outside the box to put it into the bottom right corner - this is the first final Tenerife have conceded this season \n\n73' - Castilla now really pushing, possibly the best minutes the team has played all season \n\n🔄 83' - last sub, Jacobo on for Manuel Ángel\n\n88' - incredibly save by the Tenerife keeper on a header by Jacobo. A potential foul afterwards in the box is challenged for review by Arbeloa\n\n90'+2 - after a very long review, the ref decides no penalty\n\n🟥 90'+6 - second yellow for Lamini who makes a stupid and unnecessary tactical foul while already on a yellow \n\nFT - a decent second half is too little after league leaders Tenerife had already decided the match in the first. A 1-3 loss against what is clearly the best team in the division is normally no shame, but with now 4 losses in a row and multiple players missing the next weeks due to the U20 World Cup + Fettal injured and Lamini now suspended, the situation is looking extremely dire and hopeless for Arbeloa's team. Solutions need to arrive quickly \n\n&amp;#x200B;\n\n**Kickoff:** 18:30 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid\n\n**Referee**: Gonzalo Romero Freixas\n\n**Competition:** Primera Federación, Grupo 1, Matchday 5\n\n**Viewing options:** \n[LaLiga+](https://www.laligaplus.laliga.com/) (subscription - 14.99€/month) (only available in Spain)\n\n&amp;#x200B;\n\n**Castilla XI** (5-2-3): Javi Navarro - Manu Serrano (55' Víctor Valdepeñas), Mario Rivas, Joan Martínez (46' Lamini Fati), David Jiménez - Jorge Cestero, Manuel Ángel (83' Jacobo Ortega), César Palacios - Bruno Iglesias (46' Roberto Martín), Loren Zúñiga, Pol Fortuny (67' Dani Yáñez) \n\nBench: Guille Súnico (GK), Alejandro Moya, Gabri Castrelo. \n\nUnavailable: Fran González (U20 World Cup), Sergio Mestre (first team call-up), Diego Aguado (U20 World Cup), Jesús Fortea (U20 World Cup), Cristian David (U20 World Cup), Hugo de Llanos (injury), Rachad Fettal (injury). \n\nCoach: Álvaro Arbeloa\n\n&amp;#x200B;\n\n**Castilla last five matches:** WWLLL\n\n**1ª RFEF stats:** 17th | 3pt | 1-0-3 | 2:4\n",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nrzlx9/match_thread_real_madrid_castilla_cd_tenerife/"
    },
    {
        "id": "1ntil6m",
        "author": "No-Independent2522",
        "title": "Fede: I’m a little frustrated. I know how I’m playing, I’m always the first to admit when things aren’t clicking. Players know when they’ve had a bad game. I’ll keep working. As captain, I’ll keep leading and showing up. I’ll keep pushing forward.",
        "content": "",
        "upvotes": 202,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aQhxoyIYcpZNdeCA-AfM4qIHzasiaSoOYUfK22YRMnM.jpeg?auto=webp&amp;s=9550055e09af0b4b0eafbb9e5d6f6a582cec8695"
        },
        "permalink": "/r/realmadrid/comments/1ntil6m/fede_im_a_little_frustrated_i_know_how_im_playing/"
    },
    {
        "id": "1nthqyi",
        "author": "No-Independent2522",
        "title": "Real Madrid will face Atlético de Madrid in the semifinals of Spanish Super Cup 2026",
        "content": "",
        "upvotes": 125,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nthqyi/real_madrid_will_face_atlético_de_madrid_in_the/"
    },
    {
        "id": "1nsy4xr",
        "author": "willi7lol",
        "title": "When we were 2-0 down at Anfield. This is what we are missing.",
        "content": "We lack leaders. We lack grit. We lack calmness. We lack heart. We lack fight. \n\nNot being reactionary, ever since Benzema left, followed by Kroos, followed by Modric droppedbfrom the starting XI to be a rotation player. This has been going on ever since Kroos left. No leaders on the pitch. \n\nLook at how Modric and Benzema led the team when we were trailing in a big game. No panic and no heads down. Completely focused on the task at hand and focused on making the comeback. Fast foward 2 years later, when we are struggling and things aren't going our way, what do we do ? The leaders of the dressing room tries to hide and hang their heads rather than leading the team and motivating them to make a comeback.",
        "upvotes": 1802,
        "comments": 99,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/d39oz7p8pyrf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nsy4xr/when_we_were_20_down_at_anfield_this_is_what_we/"
    },
    {
        "id": "1ntbeqe",
        "author": "Big-Swimmer7083",
        "title": "Bro y'all need to calm tf down",
        "content": "I know nobody likes a defeat, especially not by atletico and especially not by a margin of 3 goals, but calm down, xabi is new, he's only been here since august, and there has been a lot of improvements in the team since, I know it's nowhere near the best but it takes time, losses are a part of the game. I saw some people talking about benching or maybe even selling players like fede and jude and rodrygo. Jude came back from injury, yeah it was a bad decision for him to start, but we know the quality he brings to the team, he's a maestro on the ball, let's just give him some time to get adjusted again, and fede?? Holy, criticism is completely fair but this sub is filled with reactionary fans, what would happen to you if you supported your local team where they barely win anything.   \nI swear I'll lose my mind if I see another post on why some player should be benched or sold or that he's shit or doesn't fit the system, from what we know of xabi, he's not reluctant to change the system, he'll adapt with the players he has, you just gotta trust in him",
        "upvotes": 133,
        "comments": 59,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ntbeqe/bro_yall_need_to_calm_tf_down/"
    },
    {
        "id": "1ntj8qy",
        "author": "TheFeatherDiaries",
        "title": "Am I the only one who is done with this 4-3-3?",
        "content": "We dont have the players to play 4-3-3. Mbappe is not a traditional number 9. Carreras and Vini are often hugging the same space with Vini rarely linking up with Carreras or crashing the CF spot in the box like how CR7 did when Marcelo would make his daunting forward runs. Bellingham is almost always too far from Tchou and Fede. Tchou and Fede dont compliment each other as CM and DMs should do. Arda is not a traditional winger and if he leaves his RW spot to playmake or smooth out the possession distribution, the whole Right side structure collapses.\n\nI dont think this 4-3-3 is made for Real Madrid with the current profile of players we have.\n\nWhen we played against PSG in the CWC, the inclusion of Mbappe forced us into 4-3-3 with Gonzalo Garcia pseudo RW and the gaping holes were again there for them to exploit. In my opinion the distance between our three midfielders is almost always comical whenever we play from the back against a high pressing opponents.",
        "upvotes": 30,
        "comments": 82,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ntj8qy/am_i_the_only_one_who_is_done_with_this_433/"
    },
    {
        "id": "1nt3e53",
        "author": "faheemhassan",
        "title": "Real Madrid arriving at Almaty Hotel [OC]",
        "content": "",
        "upvotes": 342,
        "comments": 19,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wc43n58ntzrf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nt3e53/real_madrid_arriving_at_almaty_hotel_oc/"
    },
    {
        "id": "1ntbydp",
        "author": "Thomas7Shelby",
        "title": "Xabi knew the problem… but didn’t fix it.",
        "content": "It still  hurts. The biggest reason for the defeat was predictability. Xabi himself said a few days ago that we need to be less predictable, but when it came to the match nothing really changed.\n\nAt Leverkusen, one thing I loved about him was how balanced the attack was. Around 33% down the left and through the center and  on the right. Here with us it’s always the same pattern everything goes through the left, we were successful in previous matches when doing this but we can leave the center empty, and the right side barely exists. Opponents know exactly what’s coming.\n\nIn previous matches, when Mastantuono was starting, we actually had some balance because the kid gave us a real threat on the right. But taking that option away made us repeat the same mistake from last season. Rushing Bellingham back and sacrificing the RW just made things worse and honestly felt like a rookie mistake.\n\nThen came the bad luck too. No Trent, and Carvajal’s injury took away the last bit of threat we had on the right. With both out, we were way too one-dimensional.\n\nIt's good this happened this early, We’ll bounce back. Xabi learns fast, and he will fix these mistakes.\n\nHala Madrid.",
        "upvotes": 58,
        "comments": 27,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ntbydp/xabi_knew_the_problem_but_didnt_fix_it/"
    },
    {
        "id": "1nspzth",
        "author": "killorbekilled_",
        "title": "Atlético used to be light work for us when we had HIM, miss the GOAT at our club everyday.",
        "content": "For some reason, he was always especially lethal against them. He's directly responsible for snatching away at least two to three Champions league trophy from them. \n\nSimeone has coached Atlético Madrid in over 800 games, and they've only conceded 4 hat-tricks, all to Cristiano Ronaldo. \n\nGames truly felt like we were starting 1-0, when we had him. No matter how bad it got, you always had this confidence, this belief that it would all be okay, because we still had him on the field, he'd get us the victory somehow, and he did. It was like we had a nuclear weapon in our team, we could turn to if all else failed.\nAnd he also, never looked as beautiful he did, except for when he was wearing the white.",
        "upvotes": 1055,
        "comments": 54,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pqcjhlb93xrf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nspzth/atlético_used_to_be_light_work_for_us_when_we_had/"
    },
    {
        "id": "1nt8adw",
        "author": "ZebrawithStripe",
        "title": "Just an observation of the general state of this sub.",
        "content": "I swear I am not joking but most people in this sub literally wake up to just start doom posting whenever we lose 1 game after a 7 GAME WIN STREAK. Like cmon bro. And the fact that people are still trying to find a scapegoat is baffling honestly. WE DONT HAVE TIME FOR THIS. All we can do is reflect on this game, discuss mistakes and that's it. We can't change the outcome, we can't do what if's. We have another game that we have to focus on and it's on TUESDAY. We can't wallow like this. Some people posting and are talking about mentality, we can't have a mentality as a fanbase of pointing fingers and blaming one specific player or individual in this club. I'm not saying we can't point out mistakes, I'm saying that people are focusing too much on putting all the blame on one sole individual. \n\n  \nI was mad. I was frustrated. But I moved on. You people who haven't yet, should too. Just stop with the doomposting. The season just started ffs. ",
        "upvotes": 76,
        "comments": 43,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nt8adw/just_an_observation_of_the_general_state_of_this/"
    },
    {
        "id": "1nsszqo",
        "author": "axhp",
        "title": "it’s Xabi Alonsover.",
        "content": "",
        "upvotes": 594,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/anhlm421pxrf1.jpeg?auto=webp&amp;s=e65da936f8312f93fa8bc8f297d05335a9ab5095"
        },
        "permalink": "/r/realmadrid/comments/1nsszqo/its_xabi_alonsover/"
    },
    {
        "id": "1ntk9bm",
        "author": "IHereOnlyForTheMemes",
        "title": "Benzema - On how he kept the squad balanced",
        "content": "Benzema only started to play when Gonzalo Higuaín got injured. At the time, Mourinho wasn't considering Benzema a decent striker, calling Benzema a cat and saying that he preferred to hunt with dogs, not cats, and he had no choice. \n\nBenzema ended up being the second-highest goal scorer for Real Madrid with 354 goals, behind Ronaldo's 450 goals. And the numbers say that if he had taken the penalties that Ronaldo scored, he would've been the top scorer. However, Benzema wasn't as big as the CR7 Brand, which is why he couldn't take penalties. In the 2019-2020 season, if Benzema had taken the 11 La Liga penalties, he would've won the Pechichi, but Ramos was the first choice after Ronaldo left. And that's also why the squad didn't crumble. Benzema's disposition made him not chase stardom or seek the spotlight. \n\nOn the other hand, Perez preferred Benzema over Ronaldo, criticizing Ronaldo on multiple occasions, calling Ronaldo an \"Imbecile\" and Mourinho \"Abnormal.\" Of course, it would be natural to say that he would have preferred Benzema to take the penalties, but the CR7 halo effect was stronger, and the team needed Ronaldo to compete with Messi's Barcelona. \n\nBenzema settled as the second man; he assisted 14% of Ronaldo's goals, helping Ronaldo shine more, which solved the huge problem of having more than one star on the team. he had the confidence within him to become the shadow of Ronaldo. That's exactly what Zidane did during the Galacticos, when he played deeper, not to compete with the others on scoring. \n\n  \nWe can confidently say that Karim Benzema was the true hero working in the shadows. We need a Karim Benzema-like behavior. \n\nhttps://preview.redd.it/y46opzqi84sf1.jpg?width=736&amp;format=pjpg&amp;auto=webp&amp;s=62f19b459b929c4b2337a2df4ae8e42f86648da0\n\n",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ntk9bm/benzema_on_how_he_kept_the_squad_balanced/"
    },
    {
        "id": "1nt01wx",
        "author": "PlantComprehensive77",
        "title": "€1B squad that can’t defend crosses or score from crosses",
        "content": "It’s honestly impressive that we managed to build a €1B squad that literally cannot defend crosses or score from them. Doesn’t matter whether it’s high crosses for headers or low crosses for cutbacks. Mind you this is a club that was once feared in the entire football world for scoring from crosses with the likes of CR7, Ramos, Big Benz, etc. \n\nThis makes our attack so pathetically one-dimensional it’s hilarious. You got fans in this sub who think we’re going to win the league/CL by just having Guler spam a million through balls to Mbappe. Even Barcelona who has never been known for crossing the ball a lot, have an aerial threat in Lewandowski, and Raphinha is decent at scoring from crosses. \n\nOh, one more thing, can we sack our set piece coach asap? Atletico could have scored 3 goals from corners yesterday. Meanwhile, all our set pieces were absolute dogshit. ",
        "upvotes": 196,
        "comments": 51,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nt01wx/1b_squad_that_cant_defend_crosses_or_score_from/"
    },
    {
        "id": "1nsny1w",
        "author": "ContextDry9672",
        "title": "players leaving to Kazakhstan, lol the loss look like its affected them this time hope its get better hala-madrid",
        "content": "",
        "upvotes": 776,
        "comments": 135,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zph12r6anwrf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nsny1w/players_leaving_to_kazakhstan_lol_the_loss_look/"
    },
    {
        "id": "1nsztm7",
        "author": "sufferorignite",
        "title": "Modric is still owning and playing more than 80 minutes",
        "content": "This post shows up after every Serie A matchday, but someone always brings up the same argument about his age and contribution, how he supposedly blocks a midfield spot and stops the growth of players like Arda.\n\nBut after today’s Napoli match, I don’t care about any of that.  \nWE NEEDED MODRIC, AND HE’S SHOWING MILAN EXACTLY WHAT HE BRINGS TO THE TEAM.\n\nIf Valverde, Bellingham, Arda, and Ceballos don’t have those qualities, then they need to step up their game because a 40-year-old is outshining them.",
        "upvotes": 120,
        "comments": 31,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nsztm7/modric_is_still_owning_and_playing_more_than_80/"
    },
    {
        "id": "1nsx84b",
        "author": "RM-PostMatchSurveys",
        "title": "[Post-Match Survey Results] Real Madrid 2-5 Atletico Madrid",
        "content": "",
        "upvotes": 126,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m7p5i4jsiyrf1.png?auto=webp&amp;s=315a69c1289fef482c21f5797db1a4cab6d797a6"
        },
        "permalink": "/r/realmadrid/comments/1nsx84b/postmatch_survey_results_real_madrid_25_atletico/"
    },
    {
        "id": "1nt0r8e",
        "author": "Kraphomus",
        "title": "Real Madrid submit Barca ex-presidrnts' confessions to the judge of the Negreira Case",
        "content": "",
        "upvotes": 70,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nt0r8e/real_madrid_submit_barca_expresidrnts_confessions/"
    },
    {
        "id": "1nsbcmx",
        "author": "adnshrnly",
        "title": "idk man, Augsburg used to walk right into my system",
        "content": "",
        "upvotes": 3054,
        "comments": 128,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/iwqkaxjl1trf1.jpeg?auto=webp&amp;s=f8e41bffd6e70d687a5c65cd0f8e764310923bfc"
        },
        "permalink": "/r/realmadrid/comments/1nsbcmx/idk_man_augsburg_used_to_walk_right_into_my_system/"
    },
    {
        "id": "1ntgk18",
        "author": "KabiX2",
        "title": "Why do we always struggle when we play early?",
        "content": "This is no joke. Why when Real plays at 1PM local time we always play the worst football ever.\nAnd I mean always, I don't remember any good match played at this hour.\nSame with mondays.\nNot only it's inconvenient for the fans to watch the team the middle of the day and I feel like players are really unmotivated.\nIs there any logic reason behind this? I wonder what is the winrate of matches played at 1PM vs at 8PM.\n",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ntgk18/why_do_we_always_struggle_when_we_play_early/"
    },
    {
        "id": "1nsmrn7",
        "author": "ViniciusFastAF",
        "title": "Which player would you choose if both were at their absolute peak, free of injuries, R9 or CR7 ?",
        "content": "",
        "upvotes": 328,
        "comments": 202,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lu82p7kycwrf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nsmrn7/which_player_would_you_choose_if_both_were_at/"
    },
    {
        "id": "1nskwjd",
        "author": "redsenjui",
        "title": "Next month 😔 sorry Fede.....",
        "content": "",
        "upvotes": 370,
        "comments": 42,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/plc0499atvrf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nskwjd/next_month_sorry_fede/"
    },
    {
        "id": "1nt1c4e",
        "author": "Puzzleheaded_Tea8174",
        "title": "Simeone Just Tactically Dominated Alonso, Here’s How",
        "content": "",
        "upvotes": 35,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pmzT2lvdQqnAYMTBLS_YqhRqG0YL4P79maaEFBqc8ZE.jpeg?auto=webp&amp;s=bb121341bb323f6df88158de4bf184370d97795e"
        },
        "permalink": "/r/realmadrid/comments/1nt1c4e/simeone_just_tactically_dominated_alonso_heres_how/"
    },
    {
        "id": "1ntnjkf",
        "author": "Ineedhelpistaken",
        "title": "Thoughts on Huijsen after the 5-2 loss vs Atlético?",
        "content": "After the 5-2 loss to Atleti, what’s everyone’s take on Huijsen? He’s clearly talented and has shown glimpses of composure on the ball, but defensively he looked exposed today.Every aerial ball in the box was a goal. Do you think this game was more about his individual mistakes or a wider defensive collapse? Is he ready for Madrid minutes for big games?I really want him to succeed and hope he plays a lot this season",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ntnjkf/thoughts_on_huijsen_after_the_52_loss_vs_atlético/"
    },
    {
        "id": "1ntngp0",
        "author": "chunchunmaru1129",
        "title": "I'm gonna be real with you guy's but I want Xabi to use Güler in the deeper midfield role",
        "content": "I think Güler has the potential to evolve into a world class Deep lying playmaker.I think he has the talent to do it.We should be patient with him because these types of players peak at around 23-30 years old.Güler already has the passing range and playmaking ability and also a rocket foot to shoot from range.\n\nHis defensive and physicality game has improved quite a lot from last season.I think with given some more time he will become even better. \n\nRight now in our squad we only have a single Midfielder who could do those Deep Lying playmaking job that Kroos and Modric used to do.Valverde is a pure box to box monster.Bellingham is a world class Attacking midfielder whoose main threat is in the opposition box.Tchoumeni I think is better suited for that Libero role that Xabi was using him in the club world cup.Camavinga is also a box to box midfielder.\n\nThe only player who is capable of doing the same thing that Kroos and Modric used to do is Ceballos but there is always a injury risk and tension around him. \n\nI think we should be patient with Güler in that role and let him slowly evolve into the role.",
        "upvotes": 0,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/guagfiezw4sf1.png?auto=webp&amp;s=e8f1474312e7c80cc03c28453d445606db387e71"
        },
        "permalink": "/r/realmadrid/comments/1ntngp0/im_gonna_be_real_with_you_guys_but_i_want_xabi_to/"
    },
    {
        "id": "1nsjv1r",
        "author": "Grouchy-Support-1019",
        "title": "Almost 75 years since...",
        "content": "",
        "upvotes": 326,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qwug83fbhvrf1.png?auto=webp&amp;s=786cdf62a6f99073c9df4e217cc56cdb421820f7"
        },
        "permalink": "/r/realmadrid/comments/1nsjv1r/almost_75_years_since/"
    },
    {
        "id": "1ntn1kr",
        "author": "Traditional_Animal65",
        "title": "Management interference",
        "content": "It's quite puzzling that people will continue not pointing the finger where it should be pointed: squad planning.\n\nThe way I see it, this defeat and to a certain extent, the one against psg and the close call against Marseille, has a lot to do with not having a deep lying playmaker (DLP). Particularly one that can keep the ball under pressure, help build from the back, provide an outlet for the less technically gifted defenders and play through opponents' high pressure.\n\n* Guler plays too far forward to play fhat role, and he is easily dispossessed.\n* Tchouameni &amp; velverde are very limited passers and lack any vision or creativity or ability to retain the ball under pressure.\n* Bellingham might have what it takes but he wants to play forward and even when he did get that chance against atletico he didn't press high up the pitch like vini and mbappe and didn't bother to press their midfielders leaving the midfield completely open to Atlético.\n* Camavinga has an allergy towards playing the ball forward, he is also the most limited creatively among all our players including other positions, and his only somewhat decent attribute is his workrate (something we don't really need with valverde on the pitch). He offers nothing that the team needs and should be let go imo.\n\nThat leaves us with the only player who can actually offer what we need: Dani Ceballos. \nHe can retain the ball under pressure and force a foul if he's about to get dispossessed. He has a decent range of passing and forward passes. He presses the opposing midfielders well enough to give our defenders some much needed shielding and not give up the midfield to our opponents.\nThink of him as a modric-light kind of player with the obvious difference in level.\n\n\nNow, let's get to the issue at hand:\nDid xabi not know he needed a DLP? I think this is an unlikely notion. After all, he is one of the best DLPs to ever play the game and arguably one of the top 3 DLPs in Spanish football history. Not to mention the rumors in the summer about:\n1. Xabi asking for an additional midfielder, and the name being discussed was zubimendi, but the management vetoed that request.\n2. Xabi wanting modric to continue for one more season.\n3. Ceballos was about to leave to Marseille and even posted an Instagram picture about a farewell only for the deal to be halted somehow at the last minute. I'm willing to bet this was because of xabi.\n\nThis points me to this conclusion: xabi knew he needed a DLP, the management's answer was NO. Not only that, but they got rid of modric, tried to ship off ceballos and I wouldn't put it past them to have forced xabi to start bellingham instead of what we actually needed.\n\nIf this doesn't stop, there is little hope in the future of this club.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ntn1kr/management_interference/"
    },
    {
        "id": "1nsxk1b",
        "author": "Lekanswanson",
        "title": "Xabi Alonso cannot afford to be naive in the big games",
        "content": "Took a while to process the loss and I really had to try to not let it affect my whole weekend. In saying this, I fully blame the loss on Alonso because its obvious the team selection was dog shit and rushing back Bellingham even though we all are happy he's recovered from surgery but playing him in a match of that caliber was a huge mistake.\n\nI think what made it even more shocking was that Alonso has played in these derbies as a player and he should have 1000 percent know the type of intensity that simeone and Atletico were coming with and it seems he underestimated this and paid for it but ultimately defeats like this are totally unacceptable. If we had lost 3-2 it would have been a sad loss but an understandable one but a Madrid team should never lose any match against any team by more than a 2 goal margin. I don't care how good the team is, if we need to play Mourinho type football to get the win of stop the bleeding then the player should fucking do that.\n\nAlso why have we collectively as a club decided that Ceballos cannot be a regular for madrid, there seems to be this idea going on that he's not madrid quality but funnily enough I don't remember him ever playing and us losing by a huge margin and if places on the team are truly based on merit then he should be playing and deserves a chance to prove and cement his place in the starting lineup just like any other expensive signing.\n\nOverall, these humiliating defeats need to stop, losing is a part of the game that we can accept but losing 4 nil and 5-2 like this is just not acceptable for a club of this standard and we as a fanbase should not accept it because its a slippery slope.",
        "upvotes": 34,
        "comments": 32,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nsxk1b/xabi_alonso_cannot_afford_to_be_naive_in_the_big/"
    },
    {
        "id": "1nst4qe",
        "author": "Bunchdawg",
        "title": "Alright, we should build around Arda Guler..",
        "content": "For the rest of this season, our pieces on the field should be tailored to build on Guler’s strengths AND Weaknesses. Other players have had enough chance to make their marks in the mid, but what he’s shown with the limited time he’s had, has given him a head up to be our maestro. We have the pieces now to hide his defensive weaknesses and also to complement his strengths on offense. Xabi will have to make the call and get everyone on board sooner than later. Think early Messi or KDB. Passing geniuses who needed defensive help around them to keep their pocket open. He can have similar impact on the game if given the chance to control.  ",
        "upvotes": 46,
        "comments": 73,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nst4qe/alright_we_should_build_around_arda_guler/"
    },
    {
        "id": "1ns4ymk",
        "author": "FrrancondonaEra",
        "title": "U can't be a Real madrid player and do a pass like this its unacceptable",
        "content": "",
        "upvotes": 1502,
        "comments": 229,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/f9gyt8cwkrrf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ns4ymk/u_cant_be_a_real_madrid_player_and_do_a_pass_like/"
    }
]