[
    {
        "id": "1h4sgsc",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 18,
        "comments": 1708,
        "media": null,
        "permalink": "/r/realmadrid/comments/1h4sgsc/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1h5mobt",
        "author": "ThickWorldliness6895",
        "title": "VOTE for the FIFA Best award for our stars: Vinícius Jr, Bellingham, Carvajal, Kroos and Valverde.",
        "content": "",
        "upvotes": 72,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RMPmdKwdOtjNbmgc7LotsWx4vJyl1D2gms_DdtWW3hw.jpg?auto=webp&amp;s=4d3bca1794081db3e7f7a93f8cdc3f2786ebed9c"
        },
        "permalink": "/r/realmadrid/comments/1h5mobt/vote_for_the_fifa_best_award_for_our_stars/"
    },
    {
        "id": "1h7ydfa",
        "author": "Messmers",
        "title": "Sergio Ramos 2.0 is here",
        "content": "",
        "upvotes": 625,
        "comments": 67,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pcmo20jpf75e1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1h7ydfa/sergio_ramos_20_is_here/"
    },
    {
        "id": "1h82ctg",
        "author": "cyrusmancub",
        "title": "Real Madrid rumored third kit next year 🤩 ",
        "content": "",
        "upvotes": 125,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nnt9760tl85e1.jpeg?auto=webp&amp;s=ff57800a53eaf9ad6ccd6f5dd5cc3979758e2c62"
        },
        "permalink": "/r/realmadrid/comments/1h82ctg/real_madrid_rumored_third_kit_next_year/"
    },
    {
        "id": "1h7yhlr",
        "author": "TimothyX7",
        "title": "Alaba &amp; Vinicius have started training with the team. ",
        "content": "",
        "upvotes": 153,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3v-H5SFgseBgxM97nWyLKiDq_dKO3ZQB5Zo5SD2zS_4.jpg?auto=webp&amp;s=1bc357db829dcb30afcdf8865a251d1e39d8172e"
        },
        "permalink": "/r/realmadrid/comments/1h7yhlr/alaba_vinicius_have_started_training_with_the_team/"
    },
    {
        "id": "1h7zxg7",
        "author": "FuturisticLion37",
        "title": "Vinicius will return for the Champions League Game.",
        "content": "Amazing news.",
        "upvotes": 115,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FtXkl4IKN90DExifLEWk2gA08OmcVROczRO328Q34zA.jpg?auto=webp&amp;s=de4534b86989dcb5bf63b200bad6b7b71ed16fc3"
        },
        "permalink": "/r/realmadrid/comments/1h7zxg7/vinicius_will_return_for_the_champions_league_game/"
    },
    {
        "id": "1h810k6",
        "author": "TimothyX7",
        "title": "⚪️❗️ Ancelotti: “The criticism? There are some things that affect me. It’s when they touch my identity”. “When I made a wrong substitution, it’s fine. But when someone wants to touch your identity, that’s bad”.",
        "content": "",
        "upvotes": 89,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DvbZFVkuIEKNqUbsoCXfxoQaJOBCfPKtzIGT74Sh1iE.jpg?auto=webp&amp;s=bfb10b7440342249fd8a51a6a0b9d50269b30332"
        },
        "permalink": "/r/realmadrid/comments/1h810k6/ancelotti_the_criticism_there_are_some_things/"
    },
    {
        "id": "1h7gpgb",
        "author": "ThickWorldliness6895",
        "title": "Van der Vaart: “[At Madrid] if we won 6-0 and Ronaldo didn’t score, he wasn’t happy. He was selfish.” 🗣️ Cristiano: “Who is that guy.”",
        "content": "",
        "upvotes": 1024,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ujt89xdbu25e1.jpeg?auto=webp&amp;s=2b83cc8511cee8bfea36115973ed8425ba598305"
        },
        "permalink": "/r/realmadrid/comments/1h7gpgb/van_der_vaart_at_madrid_if_we_won_60_and_ronaldo/"
    },
    {
        "id": "1h84vny",
        "author": "Icy_Devz",
        "title": "What are thinking about next year's potential kits?",
        "content": "Saw a post about the rumoured third kit and decided to see for myself and found these. Our potential 25/26 kits, what do y'all think about it. It's not bad but it's abit eh",
        "upvotes": 19,
        "comments": 19,
        "media": null,
        "permalink": "/r/realmadrid/comments/1h84vny/what_are_thinking_about_next_years_potential_kits/"
    },
    {
        "id": "1h7uyab",
        "author": "Total_Escape_9778",
        "title": "Reuploaded this post because I didn't include all the data before. Player's stats before the age of 24",
        "content": "",
        "upvotes": 94,
        "comments": 31,
        "media": null,
        "permalink": "/r/realmadrid/comments/1h7uyab/reuploaded_this_post_because_i_didnt_include_all/"
    },
    {
        "id": "1h7hmg8",
        "author": "ManuMora98",
        "title": "Our opponents in the Club World Cup ",
        "content": "",
        "upvotes": 305,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/daxyxgs3135e1.jpeg?auto=webp&amp;s=8d2ec5f69d7487dc57a24d1a7ae85412be2e200f"
        },
        "permalink": "/r/realmadrid/comments/1h7hmg8/our_opponents_in_the_club_world_cup/"
    },
    {
        "id": "1h7kau1",
        "author": "Endlessly-Blonde",
        "title": "FIFA Club World Cup 2025 brackets",
        "content": "",
        "upvotes": 61,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2y5ejgxxk35e1.jpeg?auto=webp&amp;s=42e19853bc8668135590a2520bae3228054d9c31"
        },
        "permalink": "/r/realmadrid/comments/1h7kau1/fifa_club_world_cup_2025_brackets/"
    },
    {
        "id": "1h7eupe",
        "author": "PlantComprehensive77",
        "title": "Lack of off-ball movement is destroying chance creation ",
        "content": "I've been seeing a discussion on here and social media in general about our lack of creativity and chance creation, which is driving me insane. \n\nFor some reason, a lot of people have this image of creative players as these lazy geniuses who walk around the pitch for 90% of the match and then threads a through ball that goes past 5 defenders into the path of a striker who's just standing there smoking a cigar and puts it in the back of the net. \n\nThe reality is chance creation has just as much to do with the forwards as the creative midfielders. Go watch Ozil's highlights at Madrid, he made a lot of amazing passes, but those passes would never have existed if Ronaldo didn't make the right runs. That doesn't take away from Ozil's brilliance, but it highlights that chance creation is a two-way street. Btw, Ronaldo is still the best player I've ever seen of making runs into the box. \n\nThis is where Mbappe fails to deliver. He either runs offsides (almost about to break a record) or doesn't make any runs at all. There was a moment in the Liverpool match, where Brahim was looking to make a through ball to Mbappe, but he had to delay the pass because Mbappe was standing offside, resulting in us losing possession. That happens way too often. Meanwhile, Rodrygo has a tendency of asking for ball to feet a lot. Vini is the only forward who actually tries to make constant runs behind the defense and has elite movement. \n\nTldr: If our forwards, apart from Vini, don't improve their off-ball runs, we can have Wirtz, Bellingham, Musiala, and Palmer all playing together in the 10 and still create very little ",
        "upvotes": 113,
        "comments": 27,
        "media": null,
        "permalink": "/r/realmadrid/comments/1h7eupe/lack_of_offball_movement_is_destroying_chance/"
    },
    {
        "id": "1h7305u",
        "author": "cyrusmancub",
        "title": "Jude Bellingham has told Fede Valverde “No need to apologize, brother. We win together, we lose together.”",
        "content": "Jude Bellinghams has told Fede Valverde: “No need to apologize, brother. We win together, we lose together”.",
        "upvotes": 695,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NxGtBuBfARKg8Gq4GJIp8yI7jCB8Om8DDzGcr_UTSyw.jpg?auto=webp&amp;s=cc826e552eabeb205c759b5c7ec819972bfd1ead"
        },
        "permalink": "/r/realmadrid/comments/1h7305u/jude_bellingham_has_told_fede_valverde_no_need_to/"
    },
    {
        "id": "1h6rs2g",
        "author": "AestheticEvan23",
        "title": "Mbappe miss another penalty ",
        "content": "",
        "upvotes": 3777,
        "comments": 575,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9vpnn5hzgw4e1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1h6rs2g/mbappe_miss_another_penalty/"
    },
    {
        "id": "1h6u8ld",
        "author": "CushtyDelBoy",
        "title": "I love you Fede Valverde!",
        "content": "",
        "upvotes": 2454,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0obfp83bzw4e1.jpeg?auto=webp&amp;s=005fb72a899b630fb82db6477df0035ecc5e785f"
        },
        "permalink": "/r/realmadrid/comments/1h6u8ld/i_love_you_fede_valverde/"
    },
    {
        "id": "1h6tca0",
        "author": "InterestingCoffee954",
        "title": "Mbappe's story after the match",
        "content": "",
        "upvotes": 1576,
        "comments": 279,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hroz8wybsw4e1.png?auto=webp&amp;s=9ced2ab497a3ef4d4039cb11596ab494a855cf77"
        },
        "permalink": "/r/realmadrid/comments/1h6tca0/mbappes_story_after_the_match/"
    },
    {
        "id": "1h74v67",
        "author": "Total_Escape_9778",
        "title": "What exactly is going wrong for Mbappe???",
        "content": "He has been way beyond terrible for almost all the 20 games he has played here, even more so against stronger sides... Now I don't buy this 'finished' argument cz last season he had 52 goals + 21 assists, the highest goal scorer that season and the highest goal scorer in champions league too with 5 goals in knockout stages. In euros he wasn't at his best but I can discount that due to his nose injury which surely affect his overall gameplay. Even against spain in the semifinal he got a brilliant cross for kolo muani to open the scoring for their team. Had france won the euros, I would be sure that mbappe was gonna win this year's ballon d'or.\n\nThe second argument is that he is mentally exhausted which seems more realistic... Like we have seen his capability to handle pressure on the biggest stages. In all the three penalties against Emi Martinez (the best penalty saver after yashin for me), I had no doubt that he was gonna score all three of 'em the moment he walked to the penalty box by just looking at his confidence. But here he can't even score penalties in league games. He seems so under-confident even in his run-up.\n\nAlso I don't buy this argument that he only performed in farmer's league cz I have seen what he does in world cup (14 g+a in 14 games) and champions league (76 g+a in 78 games).... and his record in knockout stage is even better (9 g+a in 8 wc knockout games) and (28 g+a in 28 ucl knockout games). He is also the highest wc knockout goal scorer and 6th highest ucl knockout goal scorer with only 4 pens in total in both of them. And the only time we faced him in champions league he almost f\\*cked us over with 2 great goals.\n\nSo he has surely performed in past and this has to be something of a mental block... What do you think about the reason of his terrible performance??\n\nEdit: Also I don't wanna defend this shitty performance from Mbappe. He is getting paid for his job and definitely has the top level psychologists and therapists out there to help him out... He needs to way better!!!",
        "upvotes": 184,
        "comments": 198,
        "media": null,
        "permalink": "/r/realmadrid/comments/1h74v67/what_exactly_is_going_wrong_for_mbappe/"
    },
    {
        "id": "1h7hc8g",
        "author": "chui77",
        "title": "[Post Match Survey] Real Madrid 1-2 Athletic Bilbao",
        "content": "",
        "upvotes": 13,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ibs7sNHQ33MUYe0hnfqo9lbrukH-YlavhoPXIzUA56k.jpg?auto=webp&amp;s=933af07a95cfbf0dd61b038898e45dd9de5fc4e5"
        },
        "permalink": "/r/realmadrid/comments/1h7hc8g/post_match_survey_real_madrid_12_athletic_bilbao/"
    },
    {
        "id": "1h6t5ac",
        "author": "twogk",
        "title": "2009-2017 Bernabeu would've eaten Mbappe alive after these stinkers.",
        "content": "\nThe crowd made sure the players knew their performance was not up to standard and  that standard was pretty damn high, considering even the worst performance back then is 10 times better than what we're watching now. \n\n\"Support\" my ass...  the french fraud had 4 months of patience and support,  we're almost halfway through the season, he's playing in his  \"favorite position\", he's got the spotlight, yet he isn't showing any improvement.\n\nI'd deadass take a Cr7 for the french fraud swap in January, or even Joselu. ",
        "upvotes": 691,
        "comments": 109,
        "media": null,
        "permalink": "/r/realmadrid/comments/1h6t5ac/20092017_bernabeu_wouldve_eaten_mbappe_alive/"
    },
    {
        "id": "1h6s0cz",
        "author": "AestheticEvan23",
        "title": "Jude Bellingham scores 1-1",
        "content": "",
        "upvotes": 569,
        "comments": 22,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vp7otosmiw4e1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1h6s0cz/jude_bellingham_scores_11/"
    },
    {
        "id": "1h6wf8j",
        "author": "Endlessly-Blonde",
        "title": "My fear about Mbappé (from a Madrid fan) is that it seems like he is physically washed up at 25. His legs seem like they have absolutely GONE.",
        "content": "He has lost 50% of his pace in the past 12-18 months. I don’t know how that’s possible considering his age and that he’s never had a serious injury, but he’s so slow now. He can’t beat any fullback for pace, he can’t dribble past anyone, can’t cross, his legs honestly seem like they’re completely gone. That’s why we always see him cut inside everytime he’s on the left wing instead of knock it past the fullback and beat them for pace, I don’t think he even has the confidence in his pace to beat defenders anymore. \n\nHe physically seems similar to Ronaldo after his knee injury in 2014, except he hasn’t got the finishing, penalty box skills, or heading that Ronaldo possesses which lengthened his career for a long time. Mbappé relied heavily on his speed, and now it’s all dried up, he’s like a statue on the pitch. It’s so sad to see a player that less than 2 years ago was absolutely destroying defenders with incredible pace, and now can’t even outpace a single defender.\n\nIt begs the question of how has his physical abilities dropped so much at the young age of 25? He’s always trained everyday, he’s never had a serious injury, he’s not incredibly overweight, so it makes zero sense that he seems so incredibly washed up at 25. The only other cases I can think that were similar was Michael Owen and R9, although they both had serious injuries which explain their drops in performances. I can’t say the same for Mbappé.\n\nAll the footage of him I’ve seen with the ball boys, other players and staff has shown me he seems like a really good guy, which makes me really want him to do well. So it’s devastating when you see a player with his reputation have their level drop so much, especially when he was expected to be the best player of the new generation. \n\nHonestly, maybe he needs to go to Saudi and earn a lot of money before clubs start to realise how much he has declined. Madrid could turn a massive profit from him, and he could earn hundreds of millions, it’s sad, but it would probably be best for both parties.",
        "upvotes": 305,
        "comments": 178,
        "media": null,
        "permalink": "/r/realmadrid/comments/1h6wf8j/my_fear_about_mbappé_from_a_madrid_fan_is_that_it/"
    },
    {
        "id": "1h6u5vy",
        "author": "cyrusmancub",
        "title": "Fede Valverde: “ Today was a hard blow, but I take the blame… l face it, and I apologize. To my teammates and the fans. There is still a long way to go, many competitions, and I’m sure that there will be many joys.”",
        "content": "🚨⚪️ Fede Valverde: “Today was a hard blow, but I take the blame… I face it and I apologize. For my teammates and the fans”.\n\n“",
        "upvotes": 413,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TEVfyDnawhf1PTU7oqridsqCMMKuW8Yt3OQfBisbc24.jpg?auto=webp&amp;s=542e34ae0b19ad80a6b4386256a5bcb043ae2cbf"
        },
        "permalink": "/r/realmadrid/comments/1h6u5vy/fede_valverde_today_was_a_hard_blow_but_i_take/"
    },
    {
        "id": "1h74i0s",
        "author": "GlassTruth5080",
        "title": "Frustration with Carlo and his antics ",
        "content": "Once again Mbappe Disasterclass covered for Carlo's stupid antics. Right from line up, to tactics to substitutions. \n\n- Tchoumeni straight walking into 11 when he's just back from injury and not starting Arda/Modric/Brahim\n\n- Using 4-4-2 with 2 wingers up front? Mbappe is so glued to side line of left wing. Losing ball, and later fran/Bellingham winning and feeding mbappe and the story continues.\n\n- Subbing ceballos off when he was clearly better ball playing and guiding our CB's than not taking off tchoumeni for Modric\n\n- Subbing endrick and Arda at \"87\"th minute\n\n-mbappe stinking yet walking around, no press, nothing still kept him on for whole time.\n\n- Bellingham not taking penalty despite being under pressure of playing away and 1-0 down.\n\n- Starting Lucas as RCB despite him struggling to keep up. \n\n- Brought mendiddy when we needed goal\n\nCarlo is so big name pleaser guy. Bellingham and Vinicus with crew bailed him last season, got exposed a season before that by 4-0 cause Benzema got injured, and in first season, Benzema bailed his ass out with help of Vinicius.\n\nWhat's next? An unrealistic opinion but \n\n4-3-1-2 works better.\n\nOnce Vinicus is back, Vinicus and Rodrygo can take up front roles\nWith Bellingham, Ceballos, Modric and Valverde in midfielder and the back stays as it is apart from Lucas.",
        "upvotes": 57,
        "comments": 88,
        "media": null,
        "permalink": "/r/realmadrid/comments/1h74i0s/frustration_with_carlo_and_his_antics/"
    },
    {
        "id": "1h80nzz",
        "author": "Mackie26",
        "title": "An interesting take about Mboopi from someone that know A LOT more football than anyone here",
        "content": "# Before I start, I'll say this will be a long post, as I know there'll be the classic \"wall of text comment\". If you don't enjoy long readings, it's probably better for you to skip this post.\n\nHere's an 8 minute clip of a podcast called \"The Wild Project\", arguably the biggest Spanish speaking podcast in the world: [https://www.youtube.com/watch?v=1p4wQ1TbZXE](https://www.youtube.com/watch?v=1p4wQ1TbZXE)\n\nOn the latest installment Julio Maldonano \"Maldini\" was the guest. He's a legendary Spanish football commentator who has by far the biggest football knowledge I've ever seen. On the particular clip, they discuss about what the Mbappé signing has been for us so far. The clip is obviously on Spanish, but'll try to mention some of the most important points:\n\n1. They first acknowledge that Mbappé's level is far below what we've seen from him in previous years.\n2. They talk about the pressure that he has to be feeling, both from playing in Real Madrid, which is far superior than PSG, the expectations he has and his personal issues.\n\nNow here's the interesting take I was talking about:\n\n3. They talk about the absence of Kroos and how that completely changed the way the team plays. We all know this\n\n4. The most interest part comes next. \"Maldini\" mentions that when a player is caught offside, it's actually the passer's fault. He says that elite football and elite attackers always have to play on the edge of being offside, specially ones with the characteristics of Mboopi (being fast af) and that a lot of times, our passers don't see him making runs on time, take a lot more than they should to make the pass and thus he ends up being offside frecuently.\n\nI don't fully agree with this. I think a lot of the blame has to go to the passers, but a good portion is also on the poor level the turtle has displayed so far. I'd say it's something like 60% on the passer 40% on Mbappé.\n\nI've seen him make good runs in many of our matches and most of the times, those runs get ignored. It's a whole other story if we would be able to finish those chances, as 95% of the shots he's making go to either a defender or the GK, but if the good runs he makes get mostly ignored and in some other plays the passers just take a second or two too long to make the pass, then it's not entirely his fault either.\n\nWe don't have a player with the vision that Kroos had, and for me, that's the main issue. The closest we have are Modric, who can't play most matches nowadays and Arda, who needs more time to develop, and not even them really come close to the level of vision that Kroos had.\n\nI do believe that all of our midfielders have the technical ability to make the passes Kroos made, like if I tell Jude or Fede to make a crazy long pass or to change play from one side to the other, they can do it, sure, but elite passing is not only about being able to make the pass, but also \"seeing the pass\". That's what separates midfield maestros from great midfielders, you know Kross, Xavi, Zidane, Pirlo, KdB, etc. Those players were able to see passes no other players really saw, they knew how to send the ball on the proper timing to avoid their attackers being offside more than they should.\n\nThe amount of hate Mbappé is receiving is crazy, like even people from r/soccer seem more reasonable about it now, and that speaks volumes. I'm not saying we should praise him and make it like everything is great, but I've seen people saying he should be sold... ok. Not every player can be Jude last season, some take time to adjust. We can't compare anyone to Ronaldo, he's a top 1-4 player ever. Mbappé hasn't even played for us for 6 months. Remember what happened with Modric? Everyone hating on him and not supporting him sure as hell doesn't help him, paired with the pressure that playing here brings and his personal shit, I mean he was accused of raping someone and oh surprise! nothing came out of it and he can't even go out with his friends on his free time ffs.",
        "upvotes": 0,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nmh1YZENwEJmvOHandxt4UVQ5jkdj-TLKakmfyCLQIo.jpg?auto=webp&amp;s=9af4c4e773676446b5a7a1092482d16acaa9b87d"
        },
        "permalink": "/r/realmadrid/comments/1h80nzz/an_interesting_take_about_mboopi_from_someone/"
    },
    {
        "id": "1h6spva",
        "author": "Haamad_19",
        "title": "I wish “some” other player knows the meaning of playing to win. ",
        "content": "(Swap to see) ",
        "upvotes": 206,
        "comments": 49,
        "media": null,
        "permalink": "/r/realmadrid/comments/1h6spva/i_wish_some_other_player_knows_the_meaning_of/"
    },
    {
        "id": "1h6ya96",
        "author": "Novel-Economics8168",
        "title": "Rate the Home Kits 2025-2015",
        "content": "21/22 with blue and was Classy ",
        "upvotes": 98,
        "comments": 12,
        "media": null,
        "permalink": "/r/realmadrid/comments/1h6ya96/rate_the_home_kits_20252015/"
    },
    {
        "id": "1h6wgu0",
        "author": "complexvibess",
        "title": "Tchouameni is currently inept for our current midfield dynamics",
        "content": "He is so stale. So 1 dimensional. So stiff. So super slow. \n\nHe contributes nothing to our attack, which subsequently makes the link from midfield to attack completely disappear. It's not a coincidence that once he was subbed out against Athletic, we created, and eventually scored. Him being so slow and positionally stiff is what hinders our build-up. Add the fact that his passing has been horrid this season, and we're left with a rather glorified version of Ferland Mendy. Don't get me wrong, Bilbao played really well. They deserved the win. However, we played so bad before Tchouameni went out that we must speak about it. \n\nIn La Liga, before this match, we were on the up and up. There was more MOVEMENT, we were more COMPACT. and spaces were being exploited. With Tchouameni we sit too deep, and if at least he had pace to get us out quick it'd be justified to pick him, but he doesn't, so it's easy for teams to press us and eventually force a mistake. \n\nFede is understandably tired. However, Tchouameni's slowness forces Jude, Ceballos, and Fede to cover for him. Couple that with Mbappe being lazy and not covering ground that is left by the midfield so as to receive the ball and break in pace, and there's a huge gap created between midfield and attack. Let's not even get into how Tchou is already a liability, but adding Vazquez to the equation means that we have midfielders that have to cover for every other player. Therefore, greatly stunting our forward game.\n\nFede can easily play DM, and play it well enough that allows us to play actual football. It will go under the radar, but Tchou disrupted Raul Ascencio today. Yes, Raul could arguably be solely blamed for the first goal, but Tchou's lack of movement meant that, in general, throughout the game, Raul had to adapt to almost playing with a 3rd CB, and it wasn't pretty. Another alternative for the DM position so that Fede is rested is Modric and Ceballos paired together. They are not the fastest, so they can't do it individually and a pairing might more suitable. However, in spite of their slowness, they do have great passes on them. So, whilst they themselves can not break away fast, they can move the ball fast, and we can try breaking forward quickly with that. Otherwise, we just look in the academy and see what we find.\n\nMbappe is greatly costing Jude. That much we can all see. Between Arda, Endrick, Rodrygo, and Brahim our attack can be easily rotated, and SHOULD BE. When Perez said that at 21 Beckham had only played 51 games, but Jude is clocking in at over 200, it was pretty shocking to hear. I hope we don't act surprised when he becomes physically debilitated very soon if we don't care for him like we should (looking at you, Ancelotti). \n\nJust let Tchou play CB for the rest of the season. Rudiger needs rest, too!\n\n",
        "upvotes": 122,
        "comments": 100,
        "media": null,
        "permalink": "/r/realmadrid/comments/1h6wgu0/tchouameni_is_currently_inept_for_our_current/"
    },
    {
        "id": "1h6sie6",
        "author": "PlantComprehensive77",
        "title": "Kroos would have died in this current setup ",
        "content": "A lot of fans have pointed out that the loss of Kroos is one of our biggest issues this season. After watching today's match against Bilbao, I completely disagree. He wouldn't last one month playing in this current setup. \n\nAncelotti, because he's terrified of Lucas Vasquez and Fran Garcia/Mendy defending, has effectively turned both Bellingham and Valverde into two wingbacks (btw, Valverde's dip in form needs to be talked about, looks like he's playing injured). This leaves a gaping hole in the midfield for the other midfielders to cover. Someone like Kroos would have had a heart attack tracking back. \n\nNow, what about Kroos contributing to the attack? Wouldn't really make a difference either. The reason why Kroos had such a revival of a season last year was actually because of the chemistry between Vini, Bellingham, Joselu, and Rodrygo. With Bellingham playing in that central attacking midfielder role, he had the license to kill and a lot of freedom to do his magic, while Vini was in the form of his life. When things weren't clicking, Joselu would come on and add a different flavor by being an aerial threat and pulling defenders away with his runs, allowing Bellingham to find the open space. Now, Joselu is no longer here so we have zero aerial threat apart from Bellingham. Meanwhile, Mbappe has turned into a Segunda player, so Bellingham is basically carrying the attack at the moment, while having to defend like a dog. He'll probably burn out before Christmas.\n\nTldr: Kroos would help improve the tempo that we play at, but his legs would fall off  very quickly under Ancelotti's current tactics. ",
        "upvotes": 105,
        "comments": 33,
        "media": null,
        "permalink": "/r/realmadrid/comments/1h6sie6/kroos_would_have_died_in_this_current_setup/"
    },
    {
        "id": "1h6tn1r",
        "author": "InterestingCoffee954",
        "title": "Carlo's conference after the match",
        "content": "\"We cannot judge Mbappé's overall performance based on a missed penalty. We must give Mbappé time to adapt.\"\n\n\"We are still in the fight for La Liga. We deserved a draw.\"\n\n\"We are improving, but we must continue to work hard.\"\n\n\"Our last two defeats happened in very tough stadiums – Anfield and San Mamés.\"\n\n\"We will get Vinícius, Camavinga, and Alaba back and improve our level.\"\n\n\"Valverde is very sad.\"\n\n\"We are not as solid as last year. We need to keep working.\"\n",
        "upvotes": 91,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1h6tn1r/carlos_conference_after_the_match/"
    },
    {
        "id": "1h6k9ed",
        "author": "princesito",
        "title": "Ya ataca mi Madrid. ",
        "content": "",
        "upvotes": 223,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1wqawb3gzu4e1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1h6k9ed/ya_ataca_mi_madrid/"
    },
    {
        "id": "1h6sj5t",
        "author": "scoreboard-app",
        "title": "Post-Match Thread: Athletic Bilbao vs Real Madrid Live Score | La Liga (Spain) | Dec 4, 2024",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1h6sj5t)",
        "upvotes": 49,
        "comments": 563,
        "media": null,
        "permalink": "/r/realmadrid/comments/1h6sj5t/postmatch_thread_athletic_bilbao_vs_real_madrid/"
    }
]