[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 6,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1ns60by",
        "author": "Iaco_V8",
        "title": "Quanto è bello vedere le vie del centro così vive e piene di gente!",
        "content": "È bellissimo vedere il centro di Torino così vivo durante il Salone dell'Auto: le vie affollate, turisti che parlano inglese, francese, cinese, gente che scatta foto ai monumenti. Via Po, via Roma, via Garibaldi, via Lagrange brulicano di persone, e perfino zone più tranquille come via Palazzo di Città o le viuzze del quadrilatero sono piene di vita. È bello pensare che molti vengano anche dall’estero per venire a Torino, vedere persone scattare foto ai monumenti e sentire chiacchiere su tutto ciò che Torino ha da offrire: musei, piazze storiche, il parco del valentino, la Mole Antonelliana...\n",
        "upvotes": 61,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1ns60by/quanto_è_bello_vedere_le_vie_del_centro_così_vive/"
    },
    {
        "id": "1ns0dti",
        "author": "whos_there1234",
        "title": "How does tapping the bank card in the bus and metros work?",
        "content": "Hi guys, I'm new to turin and noticed that there's an option to tap your bank card. So i was wondering how long is it valid for. Is it valid for 1.5 hours like the tickets from tabacchi or is it valid for the entire day?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ns0dti/how_does_tapping_the_bank_card_in_the_bus_and/"
    },
    {
        "id": "1nrqq71",
        "author": "DirectInteraction825",
        "title": "Negozi abbigliamento in centro",
        "content": "Ciao a tutti, \nsono M25 e nuovo a torino, sto cercando negozi di abbigliamento in centro, non però i soliti zara o fast fashion, cerco qualcosa dove trovare bei capi, con bei materiali, stile streetwear o vintage. Budget medio/alto. \nGrazie!",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nrqq71/negozi_abbigliamento_in_centro/"
    },
    {
        "id": "1nrpgei",
        "author": "AndreLovera93",
        "title": "Avete mai partecipato ad un evento Swap Party?",
        "content": "Ho visto alcuni post, foto e video, ma non riesco a capire come possa essere, qualcuno c’è mai andato?",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1nrpgei/avete_mai_partecipato_ad_un_evento_swap_party/"
    },
    {
        "id": "1nrui1y",
        "author": "GhostGirl_34",
        "title": "Tatuatori in stile giapponese o Blackwork",
        "content": "Ciao ragazzi :)\nCome auto regalo per la mia laurea volevo fare il mio primo tatuaggio e vorrei chiedervi se conoscete qualche tatuatore bravo che si specializza negli stili giapponese o in blackwork sia a Torino che in zone limitrofe.\n\nVorrei fare un tatuaggio di massimo 25x20cm sulla superficie della mia coscia. Il soggetto sarà un serpente con dei fiori di ciliegio e delle rose\n\nSe sapete anche darmi indicativamente una ipotesi di costo mi farebbe molto piacere :)",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1nrui1y/tatuatori_in_stile_giapponese_o_blackwork/"
    },
    {
        "id": "1ns27kv",
        "author": "Sad_Presentation_497",
        "title": "ragazzi qualcuno riconosce questo palazzo?",
        "content": "",
        "upvotes": 0,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1kdfeqdx0rrf1.jpeg?auto=webp&amp;s=a8dc97bcb3aa422fff43a3391a96e1f06be1e623"
        },
        "permalink": "/r/torino/comments/1ns27kv/ragazzi_qualcuno_riconosce_questo_palazzo/"
    },
    {
        "id": "1nrtg3b",
        "author": "Adorable_Test399",
        "title": "Gruppo Whatsapp/Telegram",
        "content": "Esiste qualche gruppo whatsapp/telegram di ragazzi under 30 in cui si organizzano uscite a Torino per conoscere gente?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1nrtg3b/gruppo_whatsapptelegram/"
    },
    {
        "id": "1nrc5nb",
        "author": "logperf",
        "title": "La grandine a Ivrea sembrava della neve",
        "content": "Ieri sono andato in trasferta a Ivrea. Ho preso lo svincolo dalla SS26 e sull'erba di vedevano questi blocchi bianchi... ho pensato \"la neve a settembre? in pianura? non è possibile!\". Non si dovrebbe fermarsi su uno svincolo ma ero troppo curioso. Mi sono avvicinato e quando la \"neve\" era ai miei piedi la vedevo chiaramente, credevo di star allucinando perché non era possibile.\n\nhttps://preview.redd.it/0prllpqqjkrf1.jpg?width=3472&amp;format=pjpg&amp;auto=webp&amp;s=7563371745ddfc329714531de6f351620026e980\n\nAllora l'ho toccata con la mano e ho visto bene, in realtà erano palline di ghiaccio di circa mezzo cm di diametro. Allora mi sono ricordato di aver sentito nelle notizie del maltempo nel canavese.\n\nEvidentemente la grandinata è stata talmente abbondante che ha fatto questo effetto.\n\nhttps://preview.redd.it/kx27rza1kkrf1.jpg?width=3472&amp;format=pjpg&amp;auto=webp&amp;s=4b19be9dbbb99051f5db589af66307e0bd18c93a\n\n",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nrc5nb/la_grandine_a_ivrea_sembrava_della_neve/"
    },
    {
        "id": "1nqz3oi",
        "author": "Psi_ale",
        "title": "Ricerca partecipanti tesi",
        "content": "Ciao, sono una ragazza che studia Psicologia Clinica a Torino e sto cercando delle persone tra i 18 e i 63 anni che siano disposte a partecipare a un test per la mia tesi. Se siete interessati scrivetemi per più informazioni!",
        "upvotes": 11,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yu13kbz0yhrf1.jpeg?auto=webp&amp;s=6098f14feb8a4ce97f0945f7b17a8876c09778e6"
        },
        "permalink": "/r/torino/comments/1nqz3oi/ricerca_partecipanti_tesi/"
    },
    {
        "id": "1nqx48h",
        "author": "CelticKross",
        "title": "Usate davvero la parola \"madama\" per rivolgervi a una donna adulta?",
        "content": "Curiosità linguistica un po' a caso, ispirata da [questa definizione Treccani](https://www.treccani.it/vocabolario/madama).\nL'avrei chiesto nel sub r/piemonte, ma lì ci sono meno di mille persone. ",
        "upvotes": 13,
        "comments": 48,
        "media": null,
        "permalink": "/r/torino/comments/1nqx48h/usate_davvero_la_parola_madama_per_rivolgervi_a/"
    },
    {
        "id": "1nqyrn7",
        "author": "Interesting-Lie8720",
        "title": "[Social] Visiting from the US for 3 months – looking to meet people &amp; discover Turin 🎉",
        "content": "Hi everyone!\n\nI’m (24F) in Turin for the next couple months and would love to meet new people while I’m here. I’m a West African woman (from the US) and don’t speak Italian yet 😅, so if you speak English that would be a huge plus. I’m hoping to connect with locals or other internationals to explore the city, grab a coffee, or check out events together.\n\nA little about me:\n\n\t•\tInto tennis (sadly didn’t bring my racquets, but happy to talk ATP/WTA or even watch matches together).\n\n\t•\tLove music &amp; concerts — especially African music, Afrobeats, R&amp;B, gospel, hip-hop. Would really appreciate tips on bars/clubs in Turin that play those vibes or where young/black people hang out.\n\n\t•\tBig on travel (definitely want to explore beyond Turin on weekends).\n\n\t•\tI go to church, so if you know welcoming English-speaking communities here, I’d love to hear about them.\n\n\t•\tAlso into tech, reading, movies, and TV shows.\n\n\t•\tFitness is a part of my routine too — I usually do tennis, Pilates, and the gym, but haven’t figured where to do so here as an English speaker. \n\n\nIf you’ve got recommendations for:\n\n\t•\tplaces to meet people\n\n\t•\tspots with African/urban music\n\n\t•\tany upcoming concerts or cool events\n\n\t•\tor just want to hang out and chat about life in Turin\n\n…please reach out! Would be amazing to make some friends here 💕",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1nqyrn7/social_visiting_from_the_us_for_3_months_looking/"
    },
    {
        "id": "1nqumvt",
        "author": "NomeUtente86",
        "title": "Esame di Maturità, da privatista",
        "content": "Ho 39anni e non ho la possibilità di frequentare.(dovuto al mio lavoro ) \nHo preso informazioni sulla modalità e come si svolge la possibilità di candidarsi da privatista.\nIn sintesi la scuola viene assegnata a fine gennaio e ci sarà un esame a maggio (per ammissione al esame di maturità) ed poi se va tutto bene la maturità classica.\n\nQualcuno conosce in Torino un modo per prepararsi che non sia una scuola privata, essendo che non ho una disponibilità di 3500€/4000€ per un anno?  \nAnche perché solo e in pochi mesi vedo molto difficile o quasi impossibile riuscire a prepararmi.\nMi piacerebbe impostare un percorso già da adesso...\n\nSe avete anche contatti di persone sono ben accetti.\nIl percorso che vorrei intraprendere è l'indirizzo informatico. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nqumvt/esame_di_maturità_da_privatista/"
    },
    {
        "id": "1nquh83",
        "author": "JustASimple_Username",
        "title": "Treno Susa - Torino caselle non c'è sabato 27. Sapete come mai?",
        "content": "Praticamente il titolo.\nDevo prendere un volo domani se guardando i biglietti del treno Susa - Caselle ho visto che dopo le 12 circa mi dà solo bus con cambio a Rabadeugno. Sapete la causa? Su internet non trovo nulla.\nGrazie!",
        "upvotes": 2,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1nquh83/treno_susa_torino_caselle_non_cè_sabato_27_sapete/"
    },
    {
        "id": "1nr2olj",
        "author": "Fair-Panda8233",
        "title": "ive been scammed",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nr2olj/ive_been_scammed/"
    },
    {
        "id": "1nr2nuc",
        "author": "Intelligent-Bell-120",
        "title": "La stagione delle feste hard techno a Torino è iniziata!",
        "content": "Torino si prepara a vibrare… la prossima onda di rave arriva tra una settimana. Preparati a sentire il ritmo, info DM",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nr2nuc/la_stagione_delle_feste_hard_techno_a_torino_è/"
    },
    {
        "id": "1nquwjh",
        "author": "RichDragonfly4181",
        "title": "Weekend",
        "content": "Se c’è qualcuno che sta pianificando di fare serata all’astoria basement scrivetemi in dm che sono nuovo a Torino e cerco gente con cui andare ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nquwjh/weekend/"
    },
    {
        "id": "1nqu9x3",
        "author": "Formal_Cod3929",
        "title": "Ristorante",
        "content": "Buongiorno a tutti, domenica sarò a Torino con la mia fidanzata (vengo da Brescia) per esplorare la città e per visitare il museo del cinema.\nQualcuno sarebbe così gentile da consigliarmi ristoranti in cui gustare piatti tipici piemontesi (pranzo e cena) senza spendere una fortuna? (possibilmente evitando i trappoloni turistici) Grazie mille a tutti per la collaborazione!\n\nPs: parcheggio migliore per il museo del cinema?",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1nqu9x3/ristorante/"
    },
    {
        "id": "1nqu5g8",
        "author": "Ibrahimt51",
        "title": "Clothes for winter",
        "content": "Hey guys, I'm coming to Turin soon to study and I'd like to know if there's specific type of winter clothes that I need to get because I saw that it can get cold and snowy in Turin and I'm coming from a warm area, so we don't have special clothes for winter. I'm asking especially for boots, is there a useful type of boots you recommend and which brand? Any tips are welcomed, Thank you! ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nqu5g8/clothes_for_winter/"
    },
    {
        "id": "1nqu3cb",
        "author": "Nishinoyayu34",
        "title": "Permesso Di soggiorno",
        "content": "Hey guys\n\n What is the current wait time (in months) for the fingerprint permesso renewal appointment after sending the an application through poste Italian?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nqu3cb/permesso_di_soggiorno/"
    },
    {
        "id": "1nq2nq7",
        "author": "Bruno_Barbiere",
        "title": "Come fate la vostra versione di bagna cauda?",
        "content": "",
        "upvotes": 30,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7l9h1y6faarf1.jpeg?auto=webp&amp;s=3901a5d825a7575553864f1dc9e892d477b93c28"
        },
        "permalink": "/r/torino/comments/1nq2nq7/come_fate_la_vostra_versione_di_bagna_cauda/"
    },
    {
        "id": "1nqx9z1",
        "author": "Friendly-Army-7729",
        "title": "eventi queer Torino💕",
        "content": "\"Ciao! Mi sono trasferito da 2 anni a Torino e mi piacerebbe iniziare a frequentare gli eventi queer (Arcigay, Casa Arcobaleno ecc.). Però non ci sono mai stata/o e mi farebbe piacere conoscere qualcuno che vuole venire con me la prima volta. Se sei nella stessa situazione scrivimi☺️",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nqx9z1/eventi_queer_torino/"
    },
    {
        "id": "1nqcbj8",
        "author": "Giox2G3M",
        "title": "Affittare casa a Torino",
        "content": "Buon pomeriggio a tutti! \nSono uno futuro specializzando di pediatria che vorrebbe completare gli studi a Torino. \nSto riscontrando un enorme difficoltà a trovare un trilocale da condividere con la mia compagna. Venendo da un’esperienza universitaria di 6 anni a Ferrara (minuscola ed a portata d’uomo), non riesco a regolarmi sulla valutazione delle zone migliori dove cercare casa. Sono anche un po’ confuso su come funziona la metro/tram per raggiungere i principali luoghi, oltre che gli ospedali (come il regina Margherita). \nAvreste dei buoni consigli/dritte per agevolarmi in questo processo?\n\nEdit: ho un budget massimo di affitto (escluse spese di condominio ed utenze) di 1100€; non abbiamo un auto, ma abbiamo le bici. L’unica esigenza particolare é che ho una disabilità motoria lieve e fare tante scale mi pesa un pochino, perciò al di fuori del primo piano, preferirei ci fosse un ascensore. Per il resto i luoghi di lavoro sarebbero il centro per la mia compagnia (zona dipartimento studi umanistici dell’Università) e gli ospedali dotati di pediatria, oltre il Regina Margherita. \nGrazie a tutti per l’aiuto🤞🏽\n\nEdit 2: ho trovato una proposta in via Filadelfia… secondo voi è buona la zona? Sì riesce ad uscire la sera? È pericolosa? Poiché ho visto che si trova molto fuori centro. Grazie per l’aiuto!",
        "upvotes": 5,
        "comments": 29,
        "media": null,
        "permalink": "/r/torino/comments/1nqcbj8/affittare_casa_a_torino/"
    },
    {
        "id": "1nq1lrf",
        "author": "FreeAd8663",
        "title": "Sipario Prog Fest - 4 band per un concerto imperdibile fra Prog e Metal",
        "content": "Hexabrotband e Samaudio_, in\ncollaborazione con Morenica_net e\nAenimarecordings, presentano:\nSIPARIO PROG FEST - L'evento metal del Canavese!\nIn occasione della presentazione della stagione teatrale 2025/2026, il Teatro Bertagnolio di Chiaverano (TO) si trasformerà in una vera e propria venue concertistica, ospitando 4 band davvero eccezionali:\nTolimanband - female-fronted progressive metal dove sezioni pesanti ed atmosferiche si fondono in un\nsound molto personale\nHexabrotband - gruppo melodic death metal dalla vena progressive in grande ascesa nella scena underground torinese\nOnlyoneblack.band - giovanissima formazione dall'enorme potenziale contraddistinta da un elevato\nlivello tecnico\nMisleading.days - trio prog-metal strumentale dove riff djent si alternano a melodie coinvolgenti\nDurante la serata:\nInterventi dello staff di morenica_net\nStand ufficiale di @thelivesound - strumenti musicali\nServizio bar attivo!\nStart ore 21:00\nOfferta libera - Contributo consigliato: 8€ per supportare gli artisti che si esibiscono",
        "upvotes": 7,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/45r6f5vby9rf1.jpeg?auto=webp&amp;s=0c855795f23fa98e97b95416ce4d626feefefd0f"
        },
        "permalink": "/r/torino/comments/1nq1lrf/sipario_prog_fest_4_band_per_un_concerto/"
    },
    {
        "id": "1nqelnt",
        "author": "Silver-Ball-1599",
        "title": "Buisness bachlor degree in Italy?",
        "content": "Im a senior in high school in the United States and I am thinking about doing a buisness bachlor degree in Italy or another european country. I want to go abroad for my bachlor degree but still want to get a good education. Curently I am looking at the University of Turin's bachlor degree in buisness and management and Bologna University bachlor degree in Buisness and economics (Both of these bachlor degree would be in english). I want to get a buisness education that would give me the skills and information I would need to start my own buisness. However I also want to experience the culture, language, meet people, ect...\n\nIf you can tell me any information about studying buisness at either of these Universitys, school life, and quality of education I would be really greatful.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nqelnt/buisness_bachlor_degree_in_italy/"
    },
    {
        "id": "1nq0o43",
        "author": "Iaco_V8",
        "title": "Domanda sul salone dell'auto",
        "content": "Domani inizia il Salone dell’Auto e mi ricordo che l’anno scorso avevano allestito esposizioni anche in Piazza Arbarello, Piazza Carlo Felice e organizzato attività in Piazza Solferino e Piazza Vittorio. \n\nQuest’anno, però, dando un’occhiata alla mappa ufficiale, sembra che le aree coinvolte siano solo Piazza Castello, Piazzetta Reale e i Giardini Reali.  \nQualcuno sa se il Salone si è davvero ridotto di così tanto rispetto all’anno scorso o se ci sono altri eventi/aree non segnalati sulla mappa?",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nq0o43/domanda_sul_salone_dellauto/"
    },
    {
        "id": "1nqf2wj",
        "author": "carmelolg",
        "title": "Tempistiche InPost: quanto ci mette un pacco da Sona a Torino?",
        "content": "Ciao a tutti!  \nSto aspettando un pacco spedito con InPost: dopo essere partito da Mantova, è stato spostato a __Sona__ (in Lombardia). La consegna è prevista a Torino.  \nQualcuno ha avuto esperienze simili con InPost?  \nQuanto tempo ci ha messo il vostro pacco ad arrivare a Torino dopo essere passato da Sona?  \nChiedo solo per curiosità, giusto per farmi un’idea delle tempistiche. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nqf2wj/tempistiche_inpost_quanto_ci_mette_un_pacco_da/"
    },
    {
        "id": "1nq7ilh",
        "author": "anonimo_piemonte",
        "title": "Oggi mi hanno multato sul pullmam perché la roba per timbrare non funzionava",
        "content": "Sono rimasto li per mezz'ora a litigare con i controllori e tutti mi guardavano male, come se fossi io quello che non voleva timbrare per non parlare fhe c'erano moltissime persone davanti a cui nn hanno controllato (probabilmente perché sono ragazzine) , che ingiustizia! ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1nq7ilh/oggi_mi_hanno_multato_sul_pullmam_perché_la_roba/"
    },
    {
        "id": "1nq5dl8",
        "author": "Murky_Giraffe8700",
        "title": "Porta Susa bloccata",
        "content": "https://preview.redd.it/fiyojm980brf1.png?width=1173&amp;format=png&amp;auto=webp&amp;s=a70f61f262102ea860a7fd95cb585ec2da571064\n\nOggi ci ho messo **50 minuti** per arrivare in centro e ho pure perso la mia visita medica.\n\nIl motivo? La protesta per la Palestina. Ma lo **scoppio c’è stato giorni fa eppure la città è ancora ostaggio**, con blocchi che non si capisce perché non vengano rimossi. \n\nChe sta succedendo? O semplicemente un sistema incapace di gestire queste situazioni?\n\nOggi uscito di casa e tutto questo caos continuo, nei trasporti pubblici, che colpisce sempre le stesse persone: **chi va a piedi, chi prende autobus e treni, chi non ha un autista o un'auto aziendale**. Pendolari, studenti, lavoratori. Chi paga davvero il prezzo di questi disservizi non sono certo i milionari o i dirigenti di aziende: loro non sentono nulla di tutto questo.   \n  \nMa per chi vive la città ogni giorno, ogni blocco è tempo perso, appuntamenti saltati, frustrazione crescente.\n\n**quanto ancora dobbiamo sopportare che l’inefficienza ricada solo su chi non ha alternative?**",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1nq5dl8/porta_susa_bloccata/"
    }
]