[
    {
        "id": "1ltq8c0",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 15,
        "comments": 2467,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ltq8c0/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1lvu0p4",
        "author": "scoreboard-app",
        "title": "Post Match Thread: Real Madrid vs PSG, CWC Semifinal ",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1lvu0p4)",
        "upvotes": 181,
        "comments": 1616,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lvu0p4/post_match_thread_real_madrid_vs_psg_cwc_semifinal/"
    },
    {
        "id": "1lvtrio",
        "author": "imperador_passado14",
        "title": "2012/2025 Goodbye Luka",
        "content": "Titles:\n    LaLiga - 4x (2016-17, 2019-20, 2021-22 and 2023-24)\n    Copa del Rey - 2x (2013-14 and 2022-23)\n    Spanish Super Cup - 5x (2012, 2017, 2020, 2022 and 2024)\n    Champions League - 6x (2013-14, 2015-16, 2016-17, 2017-18, 2021-22 and 2023-24)\n    UEFA Super Cup - 5x (2014, 2016, 2017, 2022 and 2024)\n    FIFA Intercontinental Cup - 6x (2014, 2016, 2017, 2018, 2022 and 2024)\n\n",
        "upvotes": 2495,
        "comments": 61,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lvtrio/20122025_goodbye_luka/"
    },
    {
        "id": "1lvyejq",
        "author": "AdVaanced77",
        "title": "Asencio and Rüdiger mistakes",
        "content": "",
        "upvotes": 610,
        "comments": 185,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2txq9guhtxbf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lvyejq/asencio_and_rüdiger_mistakes/"
    },
    {
        "id": "1lw4r65",
        "author": "soccer_footballmania",
        "title": "Courtois defends Xabi Alonso after PSG loss- \"We Didn't Follow the Plan\"",
        "content": "",
        "upvotes": 195,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/s3jvH-lR6TUajYbSQtAqhCkb2Oxy2xiJKsb5_C2MeiU.jpeg?auto=webp&amp;s=b4b9764a8aa23f83287a4d28569e8deb2faec65e"
        },
        "permalink": "/r/realmadrid/comments/1lw4r65/courtois_defends_xabi_alonso_after_psg_loss_we/"
    },
    {
        "id": "1lvx4tv",
        "author": "Kick1O1",
        "title": "🤍 Lucas Vázquez leaves Real Madrid and he’s set for next move as free agent. Legend of the club.",
        "content": "",
        "upvotes": 604,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yCEskG7UcEqWa-kIzv7TXEpSsYwQ3WXxfZVsfac4SEY.jpg?auto=webp&amp;s=e707f03e5c907241b05bdfb76e40322d0c9ba9f3"
        },
        "permalink": "/r/realmadrid/comments/1lvx4tv/lucas_vázquez_leaves_real_madrid_and_hes_set_for/"
    },
    {
        "id": "1lw3fcr",
        "author": "Aggravating_Sport495",
        "title": "Why I think the 4-0 loss to PSG is a good thing (hear me out)",
        "content": "Yesterday’s 4-0 defeat to PSG was painful, no doubt. But honestly I think this loss might actually help us in the long run.\n\nThis game clearly exposed some of our weak spots  especially in defense and up front. I hope this pushes the club to fully utilize the transfer window. We need proper reinforcements not just backups, but solid starters.\n\nYes, we’ve got Vini and Mbappé, but let's be real: they’re not center-forwards. They thrive as wingers. Sure, Mbappé scored tons last season, but when did those goals come? Against who? When it mattered most  vs Liverpool,  Arsenal, and nowPSG  he went missing.\n\nDid you notice yesterday how PSG’s attackers pressed our keeper and center-backs constantly? Meanwhile, our front three were waiting for quick counters  but to counter, you need the ball first. PSG controlled possession and suffocated our build-up.\n\nThis isn’t about blaming individuals. The CB error? It happens. But the overall system looked off  (not xabi's fault) and that’s why I’m hoping the club realizes we need a true striker, more depth in defense, and maybe a few others with the hunger to fight in games like these.\n\nJust my take. I know some may disagree  and that’s totally fair. I just love this club and want us to improve from here.\n\nHala Madrid. 🤍",
        "upvotes": 161,
        "comments": 113,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lw3fcr/why_i_think_the_40_loss_to_psg_is_a_good_thing/"
    },
    {
        "id": "1lvxdv9",
        "author": "AdVaanced77",
        "title": "Xabi is not the problem",
        "content": "\nI keep seeing comments like  “you think acelotti was bad” or “xabi is worse than Carlo” and it’s crazy. I agree that this was not the time to experiment with formation, but how is Xabi meant to prevent mistakes like acensio and rudiger made? People are forgetting how much better we played for every match before this other than maybe the first one for obvious reasons because it was his first match with the team. He hasn’t been coaching them for long, and PSG is arguably the best team in the world right now and literally just won the champions league so it’s expected that they will play incredibly well. \n\nXabi can try his best to improve the team but if the players keep playing like this and making lazy mistakes then there is not much he can do, he’s not magic. Xabi isn’t the problem the players are, which should be obvious but apparently some people think no after one bad game Xabi is a bad coach and worse than Carlo and the team is back to how they were last season. \n\nOn a positive, at least we have a bit more time before laliga",
        "upvotes": 298,
        "comments": 160,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lvxdv9/xabi_is_not_the_problem/"
    },
    {
        "id": "1lvkwhp",
        "author": "VilleEricson",
        "title": "Kylian to Enrique when he scores tonight.",
        "content": "",
        "upvotes": 953,
        "comments": 107,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mgb3u83i4vbf1.png?auto=webp&amp;s=be8395919364e73b5fb3b60365fcff76e77747be"
        },
        "permalink": "/r/realmadrid/comments/1lvkwhp/kylian_to_enrique_when_he_scores_tonight/"
    },
    {
        "id": "1lvl4z0",
        "author": "Bellinghammmmmm",
        "title": "Throwback to the last time Real Madrid faced PSG and Karim Benzema scored a hattrick in 17 minutes after being 0-2 down",
        "content": "When PSG were drawn against Real Madrid, everyone expected a PSG win. They had prime Mbappe, Neymar, Messi, and Di María. And us? We had Karim, a developing Vinicius, Modric, and Courtois. Our squad had flaws. Kroos was struggling, Casemiro wasn’t sharp, and every time the ball neared Carvajal, we panicked. All our hopes were on Courtois, Modrić, Vini, and of course, Benzema, the man carrying our attack since Ronaldo's departure.\n\nBut when the scoreboard read 0–2 in the 60th minute, all hope seemed lost. Madrid fans were chanting Mbappe's name instead of chanting our own players. Then came the moment that changed everything: a 17-minute hat-trick from the best player in the world that night which launched a campaign of goals and elite playmaking. Everyone talks about the Manchester City game and rightfully so but this game against PSG was just as legendary.\n\nStill, the headlines from CBS with Jamie, ESPN etc focused on PSG’s collapse rather than the brilliance of Benzema, who scored a knockout-stage hat-trick while losing 0–2 in 17 minutes. He never got the praise he deserved, not even from Madrid fans, despite a better big-game resume than Suarez or Lewa without being the focal point of attack until 2019 and never being a traditional No. 9.",
        "upvotes": 706,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m25qftkj5vbf1.jpeg?auto=webp&amp;s=0f91ebcd2b168694fbf5bc5777f0a6ec88f42427"
        },
        "permalink": "/r/realmadrid/comments/1lvl4z0/throwback_to_the_last_time_real_madrid_faced_psg/"
    },
    {
        "id": "1lvxm80",
        "author": "Physical_Package_340",
        "title": "Is Asencio and Rudiger done in Alonso's book after this game?",
        "content": "Just wanted to see what you guys think about today's game. Extremely disappointing mistakes considering they are both professionals playing at the highest level in football and for one of the best teams to ever exist. \n\nRudiger was non existent in 3rd goal, apparently makes the same mistake in every pressure game . The mistake leading to 2nd goal , I don't even know what to say. \n\nEdit: A lot of people defending rudiger for what he did today? I have never seen a player miss a ball like that, NEVER let alone a starting CB for Real Madrid ! It shows how bad we have fallen! 🤦‍♂️ And if you think Rudiger was elite last season, go watch the matches where we actually played decent teams, and count how many times he was caught off position, how many times has he tried to press someone and left space where a boeing could pass through, and how many of those caused us to concede goals ! Then we can have a conversation on how elite he has been and how he carried us last season! \n\nAny average CB would get the job done against smaller teams when most of the game is played in the opponent's half. True test comes when you play against an actual decent team and Rudiger was exposed in every one of these games last season. ",
        "upvotes": 135,
        "comments": 121,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lvxm80/is_asencio_and_rudiger_done_in_alonsos_book_after/"
    },
    {
        "id": "1lvqepv",
        "author": "scoreboard-app",
        "title": "Match Thread: Paris Saint-Germain vs Real Madrid Live Score | FIFA Club World Cup 2025 | Jul 9, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1lvqepv)",
        "upvotes": 248,
        "comments": 8814,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lvqepv/match_thread_paris_saintgermain_vs_real_madrid/"
    },
    {
        "id": "1lvxodr",
        "author": "xxprprsmke",
        "title": "Rodrygo has only played 28 matches this season with 70 or more minutes. And has 25 G/A",
        "content": "He hasn’t been utilised properly for over half a year now, and people are only noticing now that he is unfairly getting no minutes, but for months he has either been getting subbed off 2/3 into the match, or subbed on with 30 minutes to go at best.\n\nI do think he should leave as he is my favourite player and he is rotting away. But xabi saying he needs to “earn his way” back into the team and will “be an important part of the team” is unfair to say with the little minutes he gets, how can he prove himself with these minutes.",
        "upvotes": 86,
        "comments": 63,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lvxodr/rodrygo_has_only_played_28_matches_this_season/"
    },
    {
        "id": "1lvous9",
        "author": "94Temimi",
        "title": "Our starting XI 🆚 PSG",
        "content": "",
        "upvotes": 234,
        "comments": 206,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/V5YcdKoWaAYx6Pn413YGmFvg7rpW_c5xwkbqf66K_z4.jpg?auto=webp&amp;s=85ba67c8fcdc1e5e9e3a7fb456c3e037e77aa00b"
        },
        "permalink": "/r/realmadrid/comments/1lvous9/our_starting_xi_psg/"
    },
    {
        "id": "1lw7dua",
        "author": "Ready_Ad_1353",
        "title": "Luka Modrić to AC Milan, here we go confirmed! Exclusive story from June and deal now in place for Croatian midfielder. Modrić counter signed one year contract at AC Milan valid until June 2026, arriving after Club World Cup as planned. Deal confirmed.",
        "content": "",
        "upvotes": 11,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NW1X5UVkzss2g58gq3uT464jCghj4flyhXSdxZhR2JA.jpg?auto=webp&amp;s=97ce7619c2428fded14359f95f8d990e9cd31d6c"
        },
        "permalink": "/r/realmadrid/comments/1lw7dua/luka_modrić_to_ac_milan_here_we_go_confirmed/"
    },
    {
        "id": "1lvas7j",
        "author": "ad-dick-ted-to-eggs",
        "title": "Also barca paid 15m fine",
        "content": "",
        "upvotes": 1191,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1ct9p4rlbsbf1.jpeg?auto=webp&amp;s=71e67e07df55a716a912ab6f37eca6d8571c58fa"
        },
        "permalink": "/r/realmadrid/comments/1lvas7j/also_barca_paid_15m_fine/"
    },
    {
        "id": "1lw4p0b",
        "author": "Plane-Protection4376",
        "title": "Maybe you guys area already saying this.",
        "content": "But I think this last game against psg is just telling that this team need to learn to play together. I don’t doubt the ability of this team and we saw the possibility in the earlier games but they are just not poised enough to play against a in form PSG \nI saw someone say last time real face psg Beni scored a hat trick in 17mins.\n\nI just think this team isn’t veteran enough to play at that high level yet but give it a year and they will show us. I hope lol \n\nPLEASE DONT SELL MODRIC’S SON RODRIGO. Thank you guys for reading \nHALA MADRID ",
        "upvotes": 13,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lw4p0b/maybe_you_guys_area_already_saying_this/"
    },
    {
        "id": "1lvk78s",
        "author": "Ikermagic",
        "title": "Spanish court sentences Carlo Ancelotti to one-year prison term for tax fraud",
        "content": "",
        "upvotes": 181,
        "comments": 44,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lvk78s/spanish_court_sentences_carlo_ancelotti_to/"
    },
    {
        "id": "1lvy4d5",
        "author": "RealMood8898",
        "title": "I’m glad it seems nobody is overreacting here which is the right mindset but I have some thoughts",
        "content": "I think something nobody has said yet as to why this team has been so bad this season is motivation because they players the past 3 season have won purely based on the passion they had that passion isn’t there rn either they are tired and ready to go on vacation or they don’t have the motivation to win more. Because the truth is the quality of player we have they would win if they really wanted it. Also I’d like to see camavinga take arda place for big games ",
        "upvotes": 32,
        "comments": 99,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lvy4d5/im_glad_it_seems_nobody_is_overreacting_here/"
    },
    {
        "id": "1lw2p1x",
        "author": "Toonboy03",
        "title": "Is Joan Martinez ready to train with first team? Where is he?",
        "content": "Read somewhere he recovered from injury but after that havey heard about him. He was impressive during last year's preseason. Unfortunately injury messes things up. I feel he will do great under Xabi's system.\n\nDoes anybody is he ready? Will he atleast train with first team? Will he fit in Xabi's system?",
        "upvotes": 11,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lw2p1x/is_joan_martinez_ready_to_train_with_first_team/"
    },
    {
        "id": "1lvgwc2",
        "author": "94Temimi",
        "title": "Alternative angle to Fran Garcia's goal against Borussia Dortmund.",
        "content": "",
        "upvotes": 215,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/v51w88dj8ubf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lvgwc2/alternative_angle_to_fran_garcias_goal_against/"
    },
    {
        "id": "1lv747k",
        "author": "Modo97",
        "title": "Mbappe on Instagram (story) 📸",
        "content": "Mbappe posting a pic of him wearing PSG jersey before the match.. honestly.. not sure how I feel about this.",
        "upvotes": 905,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ohq3oqw0crbf1.png?auto=webp&amp;s=83794e5164656473a26be485d7db7f0e104e513a"
        },
        "permalink": "/r/realmadrid/comments/1lv747k/mbappe_on_instagram_story/"
    },
    {
        "id": "1lw3fwc",
        "author": "keyurckp",
        "title": "Konate vs Saliba vs Any other top defender",
        "content": "We saw last night that we need one world class defender if not this season then next season. My question is who do you guys prefer and why? We have Konate who wants to join us. There was a also a buzz for Saliba but now it seems it has died down. There might be other options but at the moment i don't see anyone. ",
        "upvotes": 6,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lw3fwc/konate_vs_saliba_vs_any_other_top_defender/"
    },
    {
        "id": "1lv93my",
        "author": "Ghost-Ripper",
        "title": "We just landed in New York 🛬",
        "content": "",
        "upvotes": 414,
        "comments": 34,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lv93my/we_just_landed_in_new_york/"
    },
    {
        "id": "1lw76qc",
        "author": "Lost-Mention",
        "title": "I don't think we should panic.",
        "content": "I know we're all frustrated about last night's result but I don't think there's actually any need for panic stations\n\nWhat we saw last night was nothing we hadn't already known for the whole of this past season. We need ball players in order to play better and we cannot support a 3 attack formation against the elite teams.\n\nWe all knew when we lost both Trent and Dean that it was going to be an uphill battle to beat the PSG press (which is the best in the world). In fact it's likely that PSG pressed us harder than they would precisely because they knew we lacked those 2.\n\nWe also knew since at least last season that we don't have a balanced and deadly enough attack to justify playing 3 of them. The 3 attacker formation didn't work in the 22/23 season. In the 21/22 it didn't work (we played Valverde as a \"right winger\"). And even last year when we hardly lost we fastidiously played a 2 man attack. \n\nSo anyone with that knowledge of history already knew we had signed our death warrant by trying it against a team of PSG's calibre. And luckily for us Alonso admitted it openly in the press conference that it was a mistake.\n\nSo there's no need to panic. The team is still going to be trained and refined over the next few weeks and months. Camavinga will return and hopefully Ceballos will also get back to full fitness and readiness. Jude will have surgery and rest and hopefully will recover his best form in the latter half of next season.\n\nOur defense is a concern but it looks like we're a lock to get Carreras. One more CB and I think we'll be good. Rudiger needs proper rest. He's a great defender as we've seen over the first half of this season and the whole of last season. The new CB will also allow Militao to be eased back in cos if he can recover his best form we'll have one of the best CBs in the world again.\n\nAs for the attack, I am in support of not selling Rodrygo because I want him and Vini to really have to fight it out to show the coach they deserve to play. It will bring out the best in them. Whoever loses his place can then be sold next season probably for really good money. I'm not convinced as others are that it is Vini that is the best option to keep.\n\nAll in all we are just one CB and closing of the Carreras deal away from giving Xabi all the tools he needs to lead us to a great season. I firmly believe we're going to win the league next season and I think we'll once again be at the very latter stages of the UCL.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lw76qc/i_dont_think_we_should_panic/"
    },
    {
        "id": "1lw0zdc",
        "author": "andrewthenikka1",
        "title": "What we should do going foward",
        "content": "First I want to start off that none of this is xabis fault. He barely had any time with the players for this tournament.  His system can work very well for us if he has the full backing of the board and Perez.\n\nStarting off with the defense: Rudiger is clearly not what he used to be, knee injury or not, he is not Real Madrid level anymore and we need to accept that. Him and Alaba need to go. Send acensio on a loan for him to develop better and come back stronger. Fran is good against the mid teams but fumbles under giants, the Carreras signing is well needed. Militao and carvajal did more than what our entire defense did in 20 minutes. They should stay as backups. Huijsen is absolutely critical to have as he is the only defender that can build from the back and pass. We need to sign another CB ASAP. I was hoping we would get saliba but konate looks more realistic but I would not mind him either. I think he could compliment huijsen pretty well. \n\n\nMidfield: it is so evident that we NEED a creative midfielder. Right now arda is the closest thing we have to that but he still has a lot to learn. Bringing in someone like stiller or a profile similar to Kroos is crucial for breaking defensive lines. Valverde is NOT a RB and should never be placed there again. Even though he did well there last season, it won’t work with Alonso’s system. Bellingham should’ve gotten his shoulder surgery after we got knocked out the UCL so he could be fully ready for next season. \n\n\nAttack: Vini…. Oh Vini. He is absolutely useless. I know I will get hate for that but he can’t keep getting away with this. He doesn’t do anything. Doesn’t press, doesn’t track back, hogs the ball, tries to dribble like prime Messi, can’t pass etc etc.. I always defended Vini even after the 24/25 ended but I can’t defend him anymore. He needs to be sold, we will get no where with him. Ever since that ballon dor snub, he’s not been the same. Trust me I am grateful for everything he has done for this club but it’s time. Him and mbappe didn’t work and it never will work. We should put our full trust in mbappe in the attack. Put him alongside Gonzalo or Franco, and he’ll cook. Let him get the well needed rest. Gonzalo is the Joselu type profile that we needed. Not a good game today but he’s fresh and inexperienced, let him grow. I love how he presses and tracks back too. Rodrygo is clearly going to leave so I don’t want to say anything about him, especially since he barely got any minutes. \n\nOverall, we need to trust xabi because his system really works wonders. We just need to give him the players he needs and asks for. Players that works with his style of play and we will cook next season. I hope this was a wake up call for Perez and that we shouldn’t stop with Carreras. Sign sign sign, how ever many players he needs. Give him full backing. So far we got huijsen, Trent, Franco, and Carreras. Konate/Saliba and stiller will be perfect too. Maybe also another ST but I believe in Gonzalo. But most importantly, I believe in Xabi Alonso. Bring the treble home 🏆 🏆 🏆. \n\nEdit: I did not touch on mbappe much because I want to see how he plays without Vini first in this system. But yes, he is also very lazy and needs to work on that too but he’s still incredibly much better than Vini. And I do think we should build the team around him because right now we don’t and he feeds off that. He’ll get more goals that way and ultimately that’s what he’s here for. ",
        "upvotes": 6,
        "comments": 55,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lw0zdc/what_we_should_do_going_foward/"
    },
    {
        "id": "1lvfq78",
        "author": "BananaKetcup007",
        "title": "What do Madrid fans feel about tonight match against psg? Predictions?",
        "content": "If Madrid does well against psg(not necessarily win), we can officially say Madrid with xabi is gonna be something special as it will be first and final test for Xabi(psg being the final boss right now). \n\nAbence of Dean will be a major factor. If he was there, we could have seen the full potential for next season. ",
        "upvotes": 102,
        "comments": 142,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lvfq78/what_do_madrid_fans_feel_about_tonight_match/"
    },
    {
        "id": "1lvhf2e",
        "author": "No-Independent2522",
        "title": "La Liga rejects Real Madrid’s request to postpone their first match against Osasuna",
        "content": "",
        "upvotes": 66,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AHHKL2A03oXJTc2Ajt3qkZjiVMM-pfzLtYX8aPk_mDg.jpeg?auto=webp&amp;s=d055d46bee20abdf4c2ccb2d9ae4e8fc8b4cf1ed"
        },
        "permalink": "/r/realmadrid/comments/1lvhf2e/la_liga_rejects_real_madrids_request_to_postpone/"
    },
    {
        "id": "1lvbotv",
        "author": "Miserable-Subject-87",
        "title": "Rafael Obrador will sign in as new Benfica player from Real Madrid in the next days, as exclusively revealed. It’s all agreed also on player side… Álvaro Carreras will join Real Madrid right after the FIFA Club World Cup. 🤍",
        "content": "",
        "upvotes": 173,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vctAYQHFBODlcC5lLcVIDOnPUpyM7GJGKwAwyofQBQ4.jpg?auto=webp&amp;s=77a4770a98076bb165d511a60c950d1c92dc6bbf"
        },
        "permalink": "/r/realmadrid/comments/1lvbotv/rafael_obrador_will_sign_in_as_new_benfica_player/"
    },
    {
        "id": "1lvkak5",
        "author": "Aniket144",
        "title": "What performance of an opposing player do you look back and appreciate the most?",
        "content": "What performance of an opposing player do you look back and appreciate the most?  \nReferring to individual performance that were so good that you cannot complain that we lost and just give props to the opposing player.  \nNotable example:  \n1. Tadic vs Madrid in 2019 UCL   \n2. Ronaldinho vs Madrid in 2005 LaLiga where he received a standing ovation.",
        "upvotes": 32,
        "comments": 38,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lvkak5/what_performance_of_an_opposing_player_do_you/"
    },
    {
        "id": "1luv7u5",
        "author": "Dot-in-d-universe",
        "title": "Davide Anceloti appointed as Botafogo's manager.",
        "content": "",
        "upvotes": 1249,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zc62p5g7uobf1.jpeg?auto=webp&amp;s=f1a4bbe8fb3b770833b974ba5458c9a6e10b0c71"
        },
        "permalink": "/r/realmadrid/comments/1luv7u5/davide_anceloti_appointed_as_botafogos_manager/"
    },
    {
        "id": "1lw756c",
        "author": "Stock-Entrepreneur79",
        "title": "Who are your INS and OUTS for the upcoming season?",
        "content": "I don't know about the OUT but for IN we need another CB desperately. Rudiger does not look fully fit. We need a midfilder(Angelo stiller, Adam Wharton kind off) CB options we have Konate and we should also look for Hato from Ajax. He can play both LB and CB very good with the ball. What do u guys think??",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lw756c/who_are_your_ins_and_outs_for_the_upcoming_season/"
    }
]