[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 510,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1k71md4",
        "author": "nickbruckman",
        "title": "I’m Nicholas Bruckman — director of the new documentary on Netflix, MINTED: The Rise (and Fall?) of the NFT  — AMA on 4/28 @ 4pm ET!",
        "content": "What’s up r/netflix! I’m Nick, director of *MINTED*, now streaming on Netflix worldwide (well, North America, the UK, Australia/New Zealand, and Africa!)\n\nThe film is a front-row seat to the explosive rise of NFTs becoming a $40 billion digital gold rush, all the way through the market's dramatic crash. We spent years embedded in the digital art and crypto worlds, from NFT multimillionaires flipping JPEGs to the pioneering artists flipping the script on the traditional art market, plus the critics and journalists digging into the good, the bad, and bizarre of this new frontier.\n\nWhether you love or hate NFTs, I hope the film sparks some big questions about how art, tech, and finance are colliding. Beyond NFTs, it’s about pioneering artists trying to not just survive, but lead the way forward in how we use new technology as a society.\n\nWe premiered *Minted* at the Tribeca Film Festival, and its been a wild ride since. So whether you’re a collector, a skeptic, or just a fellow documentary nerd — AMA!\n\nproof: [https://www.instagram.com/p/DI12rZQz1BX](https://www.instagram.com/p/DI12rZQz1BX)\n\nnetflix: [https://www.netflix.com/title/81993558](https://www.netflix.com/title/81993558)",
        "upvotes": 16,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1k71md4/im_nicholas_bruckman_director_of_the_new/"
    },
    {
        "id": "1k9y0cj",
        "author": "theipaper",
        "title": "TV is better with subtitles - whether you need them or not",
        "content": "",
        "upvotes": 52,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1k9y0cj/tv_is_better_with_subtitles_whether_you_need_them/"
    },
    {
        "id": "1k9qon6",
        "author": "usmannaeem",
        "title": "There should be an option to completely remove a title that I am never going to watch.",
        "content": "There is only an option to hide a title but then, still Netflix will recommend titles similar to it as well. Would be nice if Netflix allowed me to completely remove a title that is never to be seen again and therefore the algorithm will never recommend something like it either.",
        "upvotes": 158,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1k9qon6/there_should_be_an_option_to_completely_remove_a/"
    },
    {
        "id": "1k9zdht",
        "author": "StardewValleyTrash",
        "title": "Anyone else?",
        "content": "Anyone else’s Netflix continuously crashing? This is the 2nd day in a row it keeps crashing on my TV. I know earlier this week it was down for a bit, but this is getting ridiculous. It’ll be fine for like 20 minutes then crash over and over. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k9zdht/anyone_else/"
    },
    {
        "id": "1k9y4u1",
        "author": "trevorandcletus",
        "title": "Can your tv influence your netflix experience much?",
        "content": "I have 2 available devices, with others being smartphones. My awol ltv 3500 provides clear vibrant visuals, whatever I am watching. On the other hand, I have been having issues with my Lg.                                                                        The settings are all off, can you tell me how to get similar visuals? The Lg in question is a bit old, like I got it back in 2016. Could that be the reason that I am not getting good visuals?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k9y4u1/can_your_tv_influence_your_netflix_experience_much/"
    },
    {
        "id": "1k9huca",
        "author": "Active_Taste9341",
        "title": "I loved Yellowstone and really wanted to like Ransom Canyon, but half of the series makes no sense - straight up stupid",
        "content": "theres barely going on anything along the whole season, but some things just made me frown:\n\n1: Lauren at the Football match realizing her bf not showing up - sad face. five minutes later Lucas shows up (as expected) and she get distracted so much she fails standing on a pyramid?\n\n2: Quinn doesnt seem like that stupid signing any contract without reading. austin water demanding money back (in absurd short time of 1 week) for something obviously never existed any kind of contract\n\n3: getting Staten proven of unaccountable for hitting someone in the face once for getting provoked under witnesses makes zero sense.\n\n\nand many more i won't waste time writing down.\n\nwhat are your thoughts?",
        "upvotes": 24,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1k9huca/i_loved_yellowstone_and_really_wanted_to_like/"
    },
    {
        "id": "1ka0vep",
        "author": "Somethingman_121224",
        "title": "Alice Osman Teases 'Heartstopper' Volume 6 and Finale Movie",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ka0vep/alice_osman_teases_heartstopper_volume_6_and/"
    },
    {
        "id": "1k9q7jv",
        "author": "S4v1r1enCh0r4k",
        "title": "What’s Coming to Netflix in May 2025: New Releases and Fan Favorites",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k9q7jv/whats_coming_to_netflix_in_may_2025_new_releases/"
    },
    {
        "id": "1k9ppps",
        "author": "SillyFlyGuy",
        "title": "Murder at Yellowstone City",
        "content": "Number 4 in US movies today. \n\nExcellent casting and acting, great sets and world building, some fascinating characters, interesting plot setup, decent twist..\n\nThen everybody just starts shooting everybody else. Ugh, what a letdown.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k9ppps/murder_at_yellowstone_city/"
    },
    {
        "id": "1k9oc2j",
        "author": "Outrageous-Dog-7249",
        "title": "Series recommendation",
        "content": "Pls recommend me a series which is not very attention grabbing (ie:thriller) and can watch while doing some other work as i am doing an internship where mostly i have to work on a computer so i can watch smth on the side, 1 ep shouldn’t be an hour long, most recommend are sitcoms and yes before you recommend me all the sitcoms i have watched friends, the big band theory, young Sheldon, the office, broklyn 99, two broke girls so pls recommend me smth new ",
        "upvotes": 4,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1k9oc2j/series_recommendation/"
    },
    {
        "id": "1k9woce",
        "author": "Greatest_Majeed",
        "title": "9.1. Glad to see the follow up is almost instant. I was totally in support of this show finishing in season 1 but I was so wrong about that. This season was so intense and I prefer this season's characters and dynamic. This season starts slow, but when the game starts it's totally worth the wait",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/825ldg8t3lxe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1k9woce/91_glad_to_see_the_follow_up_is_almost_instant_i/"
    },
    {
        "id": "1k9u68m",
        "author": "NathLWX",
        "title": "DAN DA DAN: Season 2 | Official Trailer | Netflix Anime",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k9u68m/dan_da_dan_season_2_official_trailer_netflix_anime/"
    },
    {
        "id": "1k9mto3",
        "author": "Damienisok",
        "title": "I really really really liked the apothecary diaries, I'd even go as far as to say I loved it",
        "content": "I want to know about other shows that are similar to it or if information has been released will it be getting a season 2? Or maybe it already has a season 2 but it's not on Netflix?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k9mto3/i_really_really_really_liked_the_apothecary/"
    },
    {
        "id": "1k9wb7d",
        "author": "it_is_what_it_is456",
        "title": "Can I share my Netflix account with someone in a different country?",
        "content": "I'm in the Philippines and my mom is in Hong Kong. We're planning to purchase a Netflix plan — is it possible to share the account between us without any hassle or problems? Will there be any additional fees? ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1k9wb7d/can_i_share_my_netflix_account_with_someone_in_a/"
    },
    {
        "id": "1k9hefd",
        "author": "FlashyPrinciple5196",
        "title": "YOU S5 - Spoiler up to Episode 6",
        "content": "I am sorry but I love Kate. She just SERVED JOE with taking the son away and having bodyguards ready to get him! I had a slow and loud clap by myself after she bossed up on him like that!",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k9hefd/you_s5_spoiler_up_to_episode_6/"
    },
    {
        "id": "1k8z00y",
        "author": "S4v1r1enCh0r4k",
        "title": "First Look at Liam Hemsworth as Geralt in The Witcher Season 5",
        "content": "",
        "upvotes": 62,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1k8z00y/first_look_at_liam_hemsworth_as_geralt_in_the/"
    },
    {
        "id": "1k94iij",
        "author": "Radiant-Agent-558",
        "title": "YOU S5",
        "content": "Kate should have died. She killed people and just gets to live happily ever after with HIS son (he’s a bad dad but still) Kate isn’t innocent and benefited from Joes kills. Henry could have been adopted by Maddie. \n",
        "upvotes": 19,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1k94iij/you_s5/"
    },
    {
        "id": "1k9n3l4",
        "author": "Hi_Im_Seizures",
        "title": "How do I remove the auto recommended preview right when I open Netflix?",
        "content": "So I guess Netflix is trying to show off this new reality TV show, called boot camp or something, and it's covering half of the screen right when I open the thing. Problem is, I have the worst arachnophobia and the first thing that pops up is a woman eating a tarantula. I'm guessing I'm clearly not the only one with a horrible fear of these things.\n\n  \nI tried turning on auto preview and it made it even worse, now it's just frozen on her about to take a bite on it.\n\n  \nAny way to get this the hell off of my screen? It's PMO crazy right now. They were SO smart about making one of the most common phobias the first thing on their preview screen.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k9n3l4/how_do_i_remove_the_auto_recommended_preview/"
    },
    {
        "id": "1k9ic7i",
        "author": "zoubisoubisoubisou",
        "title": "Where are we all gathering to discuss the social deduction games ?!",
        "content": "Everyday I thank SquidGame because without it, we wouldn’t have had the renaissance of social deduction games/reality tv challenge shows that Netflix is currently in the thick of (including many of the other actual Korean competition shows like Devil’s Plan - which I also love!) \n\nThe Mole was/is amazing, I loved The Trust, and Million Dollar Secret also was pretty decent!\n\nI didn’t know if there was a sub specifically for this genre of shows on Netflix *** . Anyone know ? ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k9ic7i/where_are_we_all_gathering_to_discuss_the_social/"
    },
    {
        "id": "1k8sdwu",
        "author": "BusinessBeetle",
        "title": "Havoc: Tom Hardy doesn't know how to act like a human being.",
        "content": "I'm a fan of Tom Hardy, but after watching Havoc, I'm not so sure anymore. \n\nGranted, this is off the heals of trying to watch Capone, which was a masterclasses in overacting. But going into Havoc, my expectations were reset, and I was ready to watch a mindless action movie. \n\nThe intro made me realize what I was in for: was I watching a movie or a video game intro? Everything looked fake, this is a movie that doesn't know how to act like a movie. And that's when Tom Hardy stepped in. An actor that isn't sure how a real human acts. \n\nYes, this movie is stylized and over the top. It's not trying to be realistic, but I think it's supposed to be a video game movie. From the hijacker's neon LED masks to the impossible camera action, this is a video game movie. \n\nBut at the heart is Hardy, whom I'd love to see him play an average Joe, who works as an electrician, but doesn't have a weird accent, a bizarre walk, or looks like he's acting. Because that's all I see now after Capone, Venom, and now Havoc: Tom Hardy is ACTING. But not like real human being. ",
        "upvotes": 101,
        "comments": 131,
        "media": null,
        "permalink": "/r/netflix/comments/1k8sdwu/havoc_tom_hardy_doesnt_know_how_to_act_like_a/"
    },
    {
        "id": "1k96v7l",
        "author": "TheMirrorUS",
        "title": "Netflix adding action thriller to rival Tom Hardy's Havoc",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k96v7l/netflix_adding_action_thriller_to_rival_tom/"
    },
    {
        "id": "1k98trw",
        "author": "Current-Blueberry-57",
        "title": "English voiceover",
        "content": "Other than going into the show, is there a way to know that is was originally recorded in a language other than English and it now has English voice overs?",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1k98trw/english_voiceover/"
    },
    {
        "id": "1k97pr5",
        "author": "composedmason",
        "title": "We need more simple movies like \"The Night Comes for Us\" which is 2 hours of nonstop martial arts action gore - low plot and nonstop high octane action",
        "content": "The Night Comes For Us (2018) is the most brutal movie ever made. I saw someone write that it asks \"What if we had a horror movie director (Timo Tjahjanto) make a martial arts film?\" \n\nThere is 15 minutes of story buildup before the movie kicks into high-gear. Then on you see limbs broken, bones being used to block bonesaws, intestines flying, glass flying, and waves of enemies get torn limb from limb, followed every so often by a boss battle. One of which is the most epic female battle in the history of cinema. The choreography is insane! The gore is 11/10. The martial arts is high-octane.\n\nIt's the martial arts gore equivalent to what \"Black Summer\" is for the zombie genre.\n\nIt's an open secret that Netflix is going to make more content for the \"Tik-Tok\" generation attention span. I think movies like \"Carter (2022),\" The Night Comes for Us (2018),\" and the series \"Black Summer (2019)\" are great examples of this.\n\n\"Havoc\" just released and given the name you'd expect \"The Night Comes of Us\" on steroids, but it doesn't kick into gear until like an hour in. The movie is fine.\n\nPlease, let Timo Tjahjanto direct more Netflix movies. Tell him \"5 minutes plot buildup\" is all you need, and let him do his thing.\n\n",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k97pr5/we_need_more_simple_movies_like_the_night_comes/"
    },
    {
        "id": "1k9f09w",
        "author": "ColesWork",
        "title": "Shot Transition Glitch?",
        "content": "I've found that when I'm watching a show, the image will sometimes glitch in the moment a shot moves to another shot. It looks like the image moves upward for a few frames before coming back down again. It's very distracting and might having something to do with my laptop screen size (which isn't 16x9), but that's just a guess. I've looked for a solution here, but haven't found one that works. What should I do?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k9f09w/shot_transition_glitch/"
    },
    {
        "id": "1k8ydrb",
        "author": "Informal-Purpose5979",
        "title": "Race for the Crown",
        "content": "Heya!\n\nBinged the series last night and was pleasantly surprised with what I've watched. I am not into horse racing, and generally speaking, do not approve of gambling. That being said I approached the first episode with an open mindset and that if the first 10-20 minutes suck, then I'll just turn it off.\n\nIt started off a bit slow on the horses side and pretty fast on the glamour and glitz side, with lots of great personalities larger than life. The dapper jockey, the self-proclaimed race horse investor, the billionaire (there were a few actually) and a colorful and multi-national cast from the stables. Man, the show runners narrative building game was spot on! I felt like I was right there and then despite knowing nothing about horses, like I mentioned already.\n\nI don't want to spoil too much, so I'm gonna stop talking about what happened in the show, but will leave some notes to compare.\n\n- **Biggest surprise of the season**: Kenny McPeek. Whoa. What a man. What a rock. I did not expect to like him as much as I did by the end of the season. The way he was nonchalantly introduced and the part he played later was astonishing. Kudos to the show runners again.\n\n- **Biggest disappointment of the season**: Michael Iavarone and Frankie Dettori, not because they disappointed me, but because I was very disappointed along them as their endeavors didn't exactly go as planned. Michael grew on me, although the dude is all show.\n\n- **Katie Davis** was adorable. Watch her rip her heart out on camera. \n\n- **Umberto Rispoli** had the most normal/sane and lovely family and I just couldn't help but feel happy for them. It's nice to see someone doing it right in these *interesting* times.\n\n- **Michael Repole**... yeah.\n\n- **Dornoch's team** were so so great and genuine. Loved every single person in there, but especially Jayson Werth's crew (that's how I am referring to his family). I honestly didn't expect to see such a healthy and functional unit until I read that he and his wife go way back to highschool, which explains a lot.\n\nAs a conclusion, I think for me, this show is on par with Full Swing in terms of immersion into the sport, and Tiger King in terms of suspense (just don't look up the results for 2024) and character/narrative building. Really loved it and hoping to see season 2!",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1k8ydrb/race_for_the_crown/"
    },
    {
        "id": "1k97fbx",
        "author": "Prestigious-Sail9406",
        "title": "The Diamond Heist",
        "content": "i dont know about yall, but watching the first 5mins, so many sounds effect and cant really clean to hear the character speaking, make me dont want to watch it",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k97fbx/the_diamond_heist/"
    },
    {
        "id": "1k9fo3x",
        "author": "CodedByGod",
        "title": "Double Thumbs Gone!",
        "content": "I just finished watching Jewel Thief on my smart TV. When I went to rate it, I saw they switched back to just a thumbs up or down — no more double thumbs up. Older double thumbs up ratings still show, but you can’t give them anymore!\n\nEdit\nJust relaunched the app and two thumbs are back. Sorry everyone.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k9fo3x/double_thumbs_gone/"
    },
    {
        "id": "1k9ed9z",
        "author": "Ciriuss925",
        "title": "Question(s) to.Techies with Netflix subscription",
        "content": "Just today I was checking my new ISP's first monthly billing and discovered I have racked up 727 GB of internet usage .  I switched to the new service just  last month (March 2025).  \n\n I set up autopay with Netflix for the longest time so I normally didn't pay attention to my Netflix  bill.  But after seeing the huge internet usage from my first bill from the new ISP service,  I checked my Netflix account and found that Netflix charged me $17 a month until  March 2025, when I got billed $24 (Netflix 4K Plan)  after switching to the faster ISP service.\n\n Thinking back I remember  when  I turned on the Netflix app *right after switching to the faster* ***I****SP  service*,  the Netflix TV app sends a pop-up message asking if I want to switch to 4K service.   I selected \"No\".  \n\n\n\n\\------Question 1: \n\n It seems like Netflix  detected that  I have high speed internet thus it prompted me if I wanted to upgrade to 4K service.  Has anyone else notice that as well?  \n\n\\------- Question 2  (internet usage from viewing 4K content):\n\nI am **NOT** a gamer.  I use internet primarily for work, internet,  and streaming.   We have two TVs - an old HDTV and a 6-mo old LG 4K TV.   We watch from the 4K TV for  about 6 hours a day.   Is it possible to rack up 727 GB with our viewing habit? \n\n\\------- Question 3 (those who own 4K TV but subscribe to a non-4K Netflix Plan:\n\nI noticed that the resolution quality  of Prime TV streaming content   is fantastic with the LG  4K TV (we get Prime TV for free from our annual Amazon subscription).   If I decide to downgrade our Netflix subscription from 4K Plan to the $17 Plan, I assume the quality shouldn't suffer from that, right?  \n\n  \nInputs are much appreciated.  \n\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k9ed9z/questions_totechies_with_netflix_subscription/"
    },
    {
        "id": "1k95n0w",
        "author": "curiousnerd08",
        "title": "Comparing SDR, HDR10+, and Dolby Vision on Xiaomi Pad 6 – Why Are HDR Versions So Dim and Washed Out?",
        "content": "Hey everyone,\nI’ve been testing HDR content on my Xiaomi Pad 6, and I’ve noticed some interesting things while comparing SDR, HDR10+, and Dolby Vision. I wanted to share my experience and hear your thoughts on a few issues I’ve encountered. I’ve had similar experiences with HDR on my LG CX OLED as well, so I’m wondering if this is just how HDR is implemented or if it’s something else.\n\nSDR (Standard Dynamic Range):\nSDR has much better brightness compared to HDR10+ and Dolby Vision. It doesn’t look dim at all, and the brightness feels natural and sharp. The colors are balanced, and overall, it provides a more comfortable viewing experience compared to the HDR formats.\n\nHDR10+ and Dolby Vision:\nHDR10+ and Dolby Vision are supposed to enhance brightness, color, and contrast, but on the Xiaomi Pad 6, both of these look surprisingly dim, especially in comparison to SDR.\n\nDolby Vision in particular appears washed out, with colors lacking vibrancy and saturation. I was expecting much richer colors, but it seems flat and dull. Even HDR10+ feels less bright than I imagined.\n\nA Few Questions I Have:\nWhy are HDR10+ and Dolby Vision versions so dim? I thought HDR content was supposed to have better brightness and contrast.\n\nIs Dolby Vision really a useful feature to have? The feature is hyped up as this premium viewing experience, but when compared to SDR I don’t really see the benefit.\n\nStreaming Issues:\nAlso you can’t turn Dolby Vision or HDR10+ off if you don’t like it. This is pretty frustrating, as I’d prefer to stick with SDR in some cases, but the app forces HDR formats regardless of my preference.\n\nFinal Thoughts:\nHonestly, I’m struggling to comprehend why HDR has become so popular and why it’s valued so highly as a premium feature. If it’s supposed to make content brighter and more vibrant, why does it often seem like it’s more of a dim, washed-out experience?\n\n\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k95n0w/comparing_sdr_hdr10_and_dolby_vision_on_xiaomi/"
    },
    {
        "id": "1k95d03",
        "author": "VoteCompModee",
        "title": "\"There appears to be a problem with the payment method you are trying to use\" HELP",
        "content": "I've been trying to subscribe to Netflix for the past 2-3 days and it keeps saying \"There appears to be a problem with the payment method you are trying to use\"\n\nI created a new account and tried, still the same result. I changed cards and still the same 🙃 tf do I do",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k95d03/there_appears_to_be_a_problem_with_the_payment/"
    },
    {
        "id": "1k90lj1",
        "author": "Fine-Delivery3518",
        "title": "How Do I Fix This",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/d13paohtqcxe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1k90lj1/how_do_i_fix_this/"
    }
]