[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 484,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 26,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1hcrn8m",
        "author": "AccurateInflation167",
        "title": "Netflix ‘walking back’ one-year parental leave after too many workers take year off",
        "content": "",
        "upvotes": 3372,
        "comments": 422,
        "media": null,
        "permalink": "/r/netflix/comments/1hcrn8m/netflix_walking_back_oneyear_parental_leave_after/"
    },
    {
        "id": "1hd4w9g",
        "author": "IamVBull",
        "title": "Is Lost worth a watch if you are going in completely blind?",
        "content": "I know absolutely nothing about the show, aside from the fact it's considered to have one of the worst endings in Television history. Knowing this, is Lost still worth a watch?",
        "upvotes": 21,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1hd4w9g/is_lost_worth_a_watch_if_you_are_going_in/"
    },
    {
        "id": "1hcyzwt",
        "author": "RainH2828",
        "title": "Will someone watch a movie with me?",
        "content": "   I’m feeling lonely tonight and I just want to be able to feel like I have some companionship tonight. Would anyone be willing to watch the same movie at the same time with me? Or if someone knows of a watch party thing we can do? We could do a tv show like Ultimatum or something that, too, so we can gossip about it over reddit PMs while we watch. I genuinely have no friends in person to invite over and my health has been iffy so if I had friends to come over, I’d feel awkward and just don’t want to deal with the social anxiety attached. Anyone? ❤️",
        "upvotes": 42,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1hcyzwt/will_someone_watch_a_movie_with_me/"
    },
    {
        "id": "1hclqqm",
        "author": "techfinpro",
        "title": "Christina Applegate Experienced “First Sign Of MS” While Filming ‘Dead to Me’ Pilot",
        "content": "",
        "upvotes": 88,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hclqqm/christina_applegate_experienced_first_sign_of_ms/"
    },
    {
        "id": "1hd2ruo",
        "author": "whatabouterysupreme",
        "title": "The Diplomat season finale!!",
        "content": "Just saw the The Diplomat S2 finale and what an ending. Won't give out any spoilers unless there's discussion, but Hal's just wild man. There's so many things he could have done wrong, but this was crazy!",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hd2ruo/the_diplomat_season_finale/"
    },
    {
        "id": "1hcll1p",
        "author": "peoplemagazine",
        "title": "Netflix Star José de la Torre Dies at 37, Months After He Was Reportedly Diagnosed with a 'Serious Illness’",
        "content": "",
        "upvotes": 51,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hcll1p/netflix_star_josé_de_la_torre_dies_at_37_months/"
    },
    {
        "id": "1hd0f2l",
        "author": "Jelly_Jess_NW",
        "title": "The Blue Drum? Short? ",
        "content": "I am so frustrated that that was on the recommendation row as a stand alone show. \n\nI really Hope the direction we are going is not all 15-20 minute shorts. That one barely even had a story in it. \n\nDid anyone watch this, and I over reacting? It just want good and felt like a waste of time. ",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hd0f2l/the_blue_drum_short/"
    },
    {
        "id": "1hcpigq",
        "author": "Simpleton_5654",
        "title": "Kings of Tupelo? ",
        "content": "Anyone else watch this and spend the entire time becoming increasingly frustrated with how frustrating these people are? I don't know, what did you guys think? ",
        "upvotes": 13,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1hcpigq/kings_of_tupelo/"
    },
    {
        "id": "1hd6nee",
        "author": "EthanWilliams_TG",
        "title": "Netflix Breaks Barriers with 'Squid Game' Video Game Open to All",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hd6nee/netflix_breaks_barriers_with_squid_game_video/"
    },
    {
        "id": "1hc243k",
        "author": "TheMirrorUS",
        "title": "Netflix teases 'dark truths' of Jerry Springer Show exposed in upcoming documentary",
        "content": "",
        "upvotes": 588,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1hc243k/netflix_teases_dark_truths_of_jerry_springer_show/"
    },
    {
        "id": "1hcwyi9",
        "author": "arianeariane",
        "title": "Million Yen Women: what episode does it get interesting/have juicy revelations?",
        "content": "I tried watching the show because according to the internet it is mystery driven. I'm on ep 5 and so far it's okay, not that great, but I think this is more like a harem show for boys so it's not appealing to me. However the reviews in reddit says otherwise. What episode does it start to get really good?",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hcwyi9/million_yen_women_what_episode_does_it_get/"
    },
    {
        "id": "1hd59xq",
        "author": "Complex-Fly-9782",
        "title": "Can you Suggest me some best horror psychological thriller/survival movies on Netflix? Need some best movies or series. Kindly suggest me. ",
        "content": "Hey guys.i hope you are doing well. I'm looking for some best horror psychological thriller / survival movies. I'm feeling bored and need some best movies or series. Please suggest me. Take care :) ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hd59xq/can_you_suggest_me_some_best_horror_psychological/"
    },
    {
        "id": "1hd0k17",
        "author": "saifyre_8",
        "title": "how do i get more subtitles?",
        "content": "so, i'm watching alice in borderland recently. i'm pretty sure there are english subtitles as i can get them on my tv, but i cant access them from my ipad. i can only get the subtitles of the show's language and chinese, even when i switched the app's language to english. does someone know how to get english subtitles?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hd0k17/how_do_i_get_more_subtitles/"
    },
    {
        "id": "1hd2cbf",
        "author": "lockdownsurvivor",
        "title": "Mindcage - thoughts from the community?",
        "content": "I just finished watching this movie with the honourable John Malkovich, who was amazing as usual.\n\nI won't give away any spoilers - there are many to give.\n\nThere were parts of the movie where I almost rolled my eyes but, as the credits were displayed, I realized I just watched one of the most original movies I've seen in a long time.\n\nSo, my opinion is I liked it.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hd2cbf/mindcage_thoughts_from_the_community/"
    },
    {
        "id": "1hd23yv",
        "author": "Spyke562",
        "title": "Netflix Shared Membership and Xfinity Netflix App",
        "content": "I have a family member who has a Netflix account (not linked with Xfinity).  They purchased a Shared Membership and added my [Comcast.net](http://Comcast.net) account as the address.  I went through the activation process and was able to sign into Netflix via my web browser and everything looks correct.\n\nHowever as soon as I attempt to sign into the Netflix app via my Xfinity set top box it prompts me to pick 1 of 3 plans and it looks like it wants to link with my Xfinity account.  If I cancel out of it and go back to my family members main account the shared account is removed.\n\nNext, I sent another Netflix Shared Membership Invite to my Gmail account.  Attempted to sign into the Netflix app via my set top box and it did the same thing.\n\nLastly, I had to create another invite to my Gmail, but this time signed into Netflix app on my Roku and it worked fine.\n\nDoes the Netflix app on the Xfinity set top box support Shared Membership Accounts?\n\nHas anyone else run into this?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hd23yv/netflix_shared_membership_and_xfinity_netflix_app/"
    },
    {
        "id": "1hcy23u",
        "author": "Educational-Fly-8153",
        "title": "Show started in the end of the series",
        "content": "So I've just watched The Haunting of Bly manor which ended abruptly for me were I expected a second season or something in the works. But when I checked the series information it showed I started on the **8th out of 9** episodes...  \n\n\n[Checked the ending of episode 7 and the first episode to see if I was crazy or not](https://preview.redd.it/prkdcbvk2i6e1.png?width=1242&amp;format=png&amp;auto=webp&amp;s=637f9288674bce0e954e88aef5bcb8dc2ff3ba13)\n\nWhen starting the series it was intriguing and I figured it was some 'in medias res' works for the pilot but no, what the f.\n\nI clicked the thumbnail, watching on second monitor and the show starts playing, never seen before, no previous watches and no foreign login logs. Is this common? I'm baffled, I don't even even understand how the program could set me up by mistake at the second to last episode..??",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hcy23u/show_started_in_the_end_of_the_series/"
    },
    {
        "id": "1hci3i9",
        "author": "thats-mint",
        "title": "PUMA drops some Squid Games inspired tracksuits in celebration of Season 2",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hci3i9/puma_drops_some_squid_games_inspired_tracksuits/"
    },
    {
        "id": "1hcpcm3",
        "author": "Horror_Effective12",
        "title": "Maria (2024) Ending Explained - Does Maria Callas get her singing voice back?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hcpcm3/maria_2024_ending_explained_does_maria_callas_get/"
    },
    {
        "id": "1hcn3w4",
        "author": "ExcellentPassenger49",
        "title": "Netflix 4k",
        "content": "I finally got a new 4k tv. I was curious if the premium plan is worth it. The guy at best buy suggested it but I forgot to ask how the options are. Is it select titles that are offered in 4k or is it everything? Thank you",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hcn3w4/netflix_4k/"
    },
    {
        "id": "1hcae9i",
        "author": "GoodWaves89",
        "title": "Help distract my 17yo friend in the hospital, series recommendations?",
        "content": "Hi all, my best friend is in the hospital right now, does anyone have recommendations on some light hearted series on netflix she could watch. She liked heartstoppers she also likes the marvel movies, poetry, and reading. Really anything with a really hooking plot, I'm thikning it would be good to her to have some sort of light hearted romance that she could binge for hours maybe?",
        "upvotes": 12,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1hcae9i/help_distract_my_17yo_friend_in_the_hospital/"
    },
    {
        "id": "1hbq29m",
        "author": "Thin_Marionberry5209",
        "title": "Did Anyone Else Catch Jamie Foxx’s Netflix Special: An Hour-Long Love Letter to Himself?",
        "content": "So, I just finished watching Jamie Foxx’s Netflix special, and...wow. Has anyone ever loved themselves more? I mean, the man literally sang and danced about himself for an hour straight. Don’t get me wrong, he’s talented, but this was next-level self-admiration.\n\nIt was like watching someone throw their own surprise party, and then spend the whole time giving a speech about how awesome they are—complete with choreography. By the end, I felt like I should’ve sent him a card that just said, *“Congrats on being you.”*\n\nIs this what peak self-confidence looks like? Should I be inspired or concerned?",
        "upvotes": 173,
        "comments": 246,
        "media": null,
        "permalink": "/r/netflix/comments/1hbq29m/did_anyone_else_catch_jamie_foxxs_netflix_special/"
    },
    {
        "id": "1hcy05j",
        "author": "boomerbudz",
        "title": "I hope Netflix gets their act together for Christmas day Football",
        "content": "After watching the disastrous Tyson fight live on Netflix, well actually I couldn't watch it due to buffering, I'm hoping to god Netflix gets their shit together on streaming the Christmas day football. Especially with Beyonce doing an extended half time. Who is optimistic?",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1hcy05j/i_hope_netflix_gets_their_act_together_for/"
    },
    {
        "id": "1hcex2d",
        "author": "Robust5000T",
        "title": "Looking for a new show to watch similar to the society",
        "content": "Idk if I'd say similar but I liked the society, I also liked the rain and the mist and also 3% idk if those r rlly similar but they have like a similar vibe ig? Anyways I'm looking for something like that",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hcex2d/looking_for_a_new_show_to_watch_similar_to_the/"
    },
    {
        "id": "1hcgp7a",
        "author": "evildomovoy",
        "title": "Series about liars getting caught.",
        "content": "There was a series a while ago about people cheating/lying etc and the real world consequences. It had episodes about Tim Donahgy, a University admissions lady that faked her qualifications, a lady that faked her address to get her kids into a better school and some guys that did some insider trading. Does anyone recall the series and remember what it was called?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hcgp7a/series_about_liars_getting_caught/"
    },
    {
        "id": "1hc810k",
        "author": "PunchBeard",
        "title": "Subtitles are \"All or None\"?",
        "content": "I'm in the mood for a cheesy war movie and figured I'd watch Midway but in order to understand the Japanese bits I either have to turn on English (CC), which turns on subtitles in English for everything, or turn subtitle Off which doesn't translate the Japanese bits to English. Is there something I'm missing here? Because I cannot figure out how to set it up so the English parts are not subtitled but the Japanese parts are. Google has been no help.",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hc810k/subtitles_are_all_or_none/"
    },
    {
        "id": "1hc6rk6",
        "author": "NaviFeed",
        "title": "Netflix January 2025 Originals, Movies and Series Announced",
        "content": "",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hc6rk6/netflix_january_2025_originals_movies_and_series/"
    },
    {
        "id": "1hbnbzz",
        "author": "Robemilak",
        "title": "Adam Sandler Teases Eminem Cameo in ‘Happy Gilmore 2,’ Says the Sequel Is Eyeing a July 2025 Release on Netflix",
        "content": "",
        "upvotes": 103,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1hbnbzz/adam_sandler_teases_eminem_cameo_in_happy_gilmore/"
    },
    {
        "id": "1hbz9hw",
        "author": "According-Sign-9587",
        "title": "Any tv show recommendations with secret service action?",
        "content": "I love watching White House, government or secret service shows - something about it gets me very interested. \n\nAnyone know any good ones? I don’t mind if it’s on Netflix or not but I need shows that give me the same interest as shows like night agent or designated survivor. \n\n",
        "upvotes": 11,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1hbz9hw/any_tv_show_recommendations_with_secret_service/"
    },
    {
        "id": "1hcq65j",
        "author": "OkImpression1223",
        "title": "My Unorthodox Life star Miriam Haart chops off hair, discusses gender identity",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hcq65j/my_unorthodox_life_star_miriam_haart_chops_off/"
    },
    {
        "id": "1hbwbzt",
        "author": "Potential_Loss6978",
        "title": "New to Netflix- Show Suggestions",
        "content": "After milking every series available on Disney Hotstar( from White Collar to Grey's Anatomy), I finally took a Netflix subscription for the first time in my life. What are the best shows that I should get started with? There are too many all time GOATed series like Friends and Office which seem like the obvious choice but they might have been outdated, that's why coming here for suggestions",
        "upvotes": 8,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1hbwbzt/new_to_netflix_show_suggestions/"
    }
]