[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 508,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1k1ejob",
        "author": "emmaemmaemma1",
        "title": "Does anyone else think that the new kid influencing docuseries is disgusting dramatic irony?",
        "content": "Netflix has released a new docuseries, \"Bad Influence\", about a kid who was exploited as a child influencer. Her mom posted her all over the internet as a kid with little / no regard for her safety, and made tons of money off of her.\n\nSo, Netflix are now using this kid's story to - you guessed it - make money off the documentary. \n\nHer full name is in it, her face is in it. I've watched the intro in which someone states \"predators were watching these videos\" AND IT SHOWS, with no censoring, the type of videos that predators would seek out - eg, of her dancing as a minor dressed in not a lot. \n\nThe real kicker is that this kid is STILL A KID. She's still 17. And even if she wasn't, I still feel this is exploitative. This is NOT the way to raise awareness of the dangers of child influencing. \n\nAlso - she's very active on social media and hasn't posted about the documentary, which makes me question whether this was even done with her consent. Imagine the mental toll this kind of thing would take on her. It seems to be an awful privacy violation for a child whose whole life has been a series of awful privacy violations. I hope she gets the help she needs and then sues the shit out of them.\n\nIt feels so disgustingly ironic to me. Gross on Netflix's part.",
        "upvotes": 44,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1k1ejob/does_anyone_else_think_that_the_new_kid/"
    },
    {
        "id": "1k17l30",
        "author": "TheNobleKiwi",
        "title": "USA productions seem so fake now??!",
        "content": "Anyone else finding the vast majority of American, shows, movies etc just seem really surface level and cliche??? \n\nIt's like the recent political landscape has exposed all of the fake, plasticy, tacky plots, predictable character arcs and repeated formulae. As if the veil has been lifted and exposed the cheap souless centre?  I can't immerse myself anymore I can just see through everything now.\n\nWondering if anyone else is experiencing this or if it's just because we watched Twister and Madam Web. ",
        "upvotes": 100,
        "comments": 113,
        "media": null,
        "permalink": "/r/netflix/comments/1k17l30/usa_productions_seem_so_fake_now/"
    },
    {
        "id": "1k1c8y9",
        "author": "johnppd",
        "title": "The Sandman: Season 2 | Date Announcement | Netflix | Volume 1 - July 3rd. Volume 2 - July 24th.",
        "content": "",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k1c8y9/the_sandman_season_2_date_announcement_netflix/"
    },
    {
        "id": "1k0wj21",
        "author": "jgonzalez418",
        "title": "Anyone getting repeatedly kicked off of their Netflix for \"not being a part of the same household\" though I'm literally using my home wifi?",
        "content": "Every week or so I'm kicked off of my netflix because \"This device isn't a part of your household\" though I'm quite literally using my home wifi where the account was created and all of the users reside an use the account. Genuinely just considering canceling netflix at this point because this is ridiculous. Quickly became one of the most irritating streaming services to deal with, and customer support hasn't been of any help. I have the option to \"watch temporarily\" but then I need to deal with sending a confirmation email to the account owner, which I am not. Like I said, I'm still a part of the household and watching netflix physically in the same household, using the same wifi that the account owner is using. Is this happening to anyone else?",
        "upvotes": 45,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1k0wj21/anyone_getting_repeatedly_kicked_off_of_their/"
    },
    {
        "id": "1k1dp9j",
        "author": "Atlast_2091",
        "title": "Ginny &amp; Georgia: Season 3 | Official Teaser | Welcome back to Wellsbury, Peaches! Here’s a peek at season 3 of Ginny &amp; Georgia, coming to Netflix June 5th",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1dp9j/ginny_georgia_season_3_official_teaser_welcome/"
    },
    {
        "id": "1k1fvkb",
        "author": "Radiant_Alchemist",
        "title": "Now that Maestro in blue (seems to be) concluded, what's your overall impression?",
        "content": "I was a bit late on discovering Maestro in blue as season 2 was already out when I started to watch it. I have to admit that season 1 amazed me and especially the two boys (Spyros and Antonis). I felt so sad about what they want through it felt as if I was experiencing these events. Well.. there's an explanation to that because I'm gay myself and to an extent I have experienced similar situations.\n\nOverall, I liked season 1. Season 2 not so much but it deepened the characters which was necessary but unfortunately it felt like the plot had kinda frozen.\n\nAnd then season 3.. well I didn't enjoy it. It focused too much on Klelia and Orestis but I really don't know why this relationship mattered that much. it felt as if the writer who is also playing Orestis just wanted more screen time for himself. A murder had happened and they didn't seem to care. \n\nAnd most importantly I didn't understand why the two boys went to the police department. I mean what for? It's as if they cancelled all the efforts of seasons 2 and 3. It also never made sense to me why Maria (Spyros' mother) did not give him some good money so he could study along with Antonis but they returned to their broke state. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1fvkb/now_that_maestro_in_blue_seems_to_be_concluded/"
    },
    {
        "id": "1k1adij",
        "author": "dailystar_news",
        "title": "New Netflix series sheds new light on Britain's most notorious serial killers Fred and Rose West",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1adij/new_netflix_series_sheds_new_light_on_britains/"
    },
    {
        "id": "1k0ftjr",
        "author": "Sweaty-Toe-6211",
        "title": "‘Adolescence’ Becomes 3rd Most-Watched Netflix Show Ever, Beating ‘Dahmer’",
        "content": "",
        "upvotes": 250,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1k0ftjr/adolescence_becomes_3rd_mostwatched_netflix_show/"
    },
    {
        "id": "1k1c9f1",
        "author": "jrjreeves",
        "title": "tvq-rnd-100",
        "content": "Hi all\n\nIn the last day or two, I've been getting error code tvq-rnd-100 when, on a series, selecting \"Episodes &amp; more\". I'm having no issues playing the latest episode of anything but yeah as soon as I try access previous episodes for example I'm getting that error code every time.\n\nI've reinstalled the app and still getting it. Works on other devices so why am I getting it all of a sudden on my TV?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1c9f1/tvqrnd100/"
    },
    {
        "id": "1k1apre",
        "author": "Hot_Narwhal_6038",
        "title": "The Residence : Lilly Schumacher",
        "content": "My wife and I just finished The Residence. From early on in the season, I said out loud that “I bet she did it”. \n\nI was pleasantly surprised by the finale, however, I want to know why I suspected her. I can’t put my finger on it, were there any telltale signs in the season or was my guess pure luck?\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k1apre/the_residence_lilly_schumacher/"
    },
    {
        "id": "1k1727e",
        "author": "EricJackson94",
        "title": "Netflix will stream Samurai Jack creator’s raunchy dog comedy in August | Polygon",
        "content": "Who's happy for Genndy and his collaborators?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k1727e/netflix_will_stream_samurai_jack_creators_raunchy/"
    },
    {
        "id": "1k0uzyb",
        "author": "SocialNetwooky",
        "title": "If you're through with 'Black Mirror' then check out 'Tomorrow + I'",
        "content": "It came out a couple of months ago, and there is an equally old thread about it here, but I'm sure many who are into Black Mirror haven't watched it yet. \n\nIt's not *exactly* \"BM, but in Thailand\" but there are a lot of parallels (dystopian SciFi shorts about the effects of technology), but 'Tomorrow + I' focus is on the clash of traditions and tech.\n\nThe show boast at least 3 very good stories (only 3/4 through 3 and haven't seen 4 yet), good acting, and some extremely nice visuals and production value. \n\nBeware that some content is particularly dark (though that's something it shares with Black Mirror)",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k0uzyb/if_youre_through_with_black_mirror_then_check_out/"
    },
    {
        "id": "1k16fam",
        "author": "Apart_Belt5394",
        "title": "Pop the balloon Netflix",
        "content": "I felt so bad for this host. She had a beautiful start, and then it all went to S”@-ts mannnnn. Also the purity of the classic YouTube show, I think had the most perfect formula. Why try to fix something that was perfectly good!?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k16fam/pop_the_balloon_netflix/"
    },
    {
        "id": "1k16ejb",
        "author": "just4cat",
        "title": "Star Trek video splits",
        "content": "Only Star Trek does this whenever I stream it to my chromecast, no other program has this happen. It stays like that the whole episode and occurs around 10 seconds in, no matter what I’m streaming it from (phone, iPad and laptop). Occurred multiple times over multiple days, but works fine when I’m watching at another house on the same account.\nAny ideas or has anyone had it happen anywhere else? ",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rzjv3df2dcve1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1k16ejb/star_trek_video_splits/"
    },
    {
        "id": "1k15037",
        "author": "Debajyoti26",
        "title": "Query regarding Home Page UI",
        "content": "I'm using the Android app. After opening the app I'm seeing the games recommendations all time, which I don't like. All time seeing games recommendations on home section,\n\nIs there any option to remove/ hide them..??\nI want content suggestions on home UI like previous.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k15037/query_regarding_home_page_ui/"
    },
    {
        "id": "1k0c9pr",
        "author": "TeaActual2487",
        "title": "bad influence doc",
        "content": "i can’t even finish this doc because of the lack of accountability from the parents. they are acting as if piper is apart of the problem when she is a victim of her mother here. is pipers mom evil and probably a pervert? yes absolutely. but i can’t stand to listen to them act like they were trapped and manipulated into this and they were “just letting their kids be happy” because let’s be honest here…they wanted money and fame. they did NOT want their kids happy. unless they are truly that dumb they were not manipulated into this whatsoever. \n\nzero accountability and a victim mentality. absolutely disgusting behavior from grown adults who have traumatized children for life. ",
        "upvotes": 68,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1k0c9pr/bad_influence_doc/"
    },
    {
        "id": "1k134rf",
        "author": "stellacampus",
        "title": "Project UFO Poppy Straw",
        "content": "In Episode 1 of Project UFO, at about the 39 minute mark, he has a bunch of poppy straw hanging on the wall.  As far as I know, this is only used for extracting opiates such as morphine.  Is anyone aware of another explanation for its use, perhaps specific to Poland?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k134rf/project_ufo_poppy_straw/"
    },
    {
        "id": "1k1224h",
        "author": "MrJebu",
        "title": "Brightness keeps adjusting.",
        "content": "This has been a recent thing where some movies and shows on mobile keep having the brightness automatically go down a bit for a second and then back to normal. It's been happening more frequently and it's annoying. Anybody have a solution?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1224h/brightness_keeps_adjusting/"
    },
    {
        "id": "1k1199k",
        "author": "noobknight87",
        "title": "Netflix Household?",
        "content": "I do not use Netflix on TV, only streaming from mobile devices, PC and laptop. What if we change my home address permanently within the same country (or relocate to a different country) and we don't return? Can we still watch Netflix? \n\nOr what if I need to be overseas for a number of years and I cannot return? Can we all still watch? What's going on? \n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k1199k/netflix_household/"
    },
    {
        "id": "1k1a3ws",
        "author": "simbaneric",
        "title": "Why does netflix stop supporting devices that we spent thousands on?",
        "content": "Do they think we'll stop using the devices and buy new ones and how inconsiderate is this.\n\nA friend of mine bought this tv about 6 months ago and the device already says it's unsupported. It workwd fine till two weeks ago. \n\nIs there anything they can do?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1k1a3ws/why_does_netflix_stop_supporting_devices_that_we/"
    },
    {
        "id": "1k0zlwm",
        "author": "TheBlackBird808",
        "title": "Rant about Cassandra Series (Spoilers)",
        "content": "In fiction not everything has to make sense, but somehow it has too in its own microverse. But nothing made sense in the Cassandra Series. \n\nWhy was the house empty for 50 years. \nWhy was Cassandra evil from the beginning. \nIf the switch was fake, then Fynn didn’t turn her on but she was on the whole time. \nWhy does no one tackle her, how are they afraid of a robot on wheels that can not climb stairs, just get on the stairs, she needs an elevator to follow you. \nWhy is everyone sooooo dumb. Believe your wife for once when she says something is up with the robo chique. A child listening to a robot to take a weapon and not telling their parents anything about it because a robot said so? \nThe whole story line with maggy also didn’t make sense, she could have provided for her or she could have left on her own. Why did she had to die there? \nThe husband trying to kill his wife in the end, without any hesitation? Eventhough she said that she will not harm the kids? And his best soulution in an hour free walking was to get a tree and scream at a women? No stop at the hardware store or anything? Finding the powerline to the house and disabling it? \n\nI liked the style, the basic idea and the story telling. But even if the logic does not have to be perfect, it should at least make sense in its own context. But what the heck was this, and how disappointing was the end??\n\nThey could have saved the whole series by changing one little thing: When Sam was in the clinic and hallucinating her sister, they should have focused more on this talk. And after it, plottwist: it was really her fault all the time. The robot was just a robot, everything was fine, but due to the loss of her sister she turned crazy and hallucinated all of this robot stuff. Her family was really on vacation over Christmas to enjoy some peace. And she realized it in the clinic. They would have avoided all the plotholes and made it a psycho drama showing how vulnerable we are in time of crisis. Brilliant! But this? Meh ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k0zlwm/rant_about_cassandra_series_spoilers/"
    },
    {
        "id": "1jzolud",
        "author": "Legitimate_Ad3625",
        "title": "'Black Mirror' gaslights viewers by releasing subtly different versions of 'Bête Noire'",
        "content": "",
        "upvotes": 930,
        "comments": 117,
        "media": null,
        "permalink": "/r/netflix/comments/1jzolud/black_mirror_gaslights_viewers_by_releasing/"
    },
    {
        "id": "1k0ym2b",
        "author": "ChampionshipMain7912",
        "title": "Streaming not in 4K",
        "content": "Hi guys,\nI just noticed that in the info of the series there is no anymore the 4K icon, but only hd and dolbi vision one.\nI have a premium account,4K display and very good connection and I always watched in 4k. \nOnly today I notice a worst quality and in fact there was not anymore the 4k icons.\nAny opinion on this?\nPs:I’m on iPad (trying both app and safari, but same results)\nThanks ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k0ym2b/streaming_not_in_4k/"
    },
    {
        "id": "1k0arzy",
        "author": "pr3ttyr3ckl3ss",
        "title": "Need some laughs",
        "content": "I am going through a rough spot in life and I am looking for something that will raise my spirits and keep me laughing and moving forward nothing scary/violent/anything that could be triggering. They usually don’t bother me but I don’t wanna test the waters lol. \n\nI love comedies! But if you have any romance suggestions those would work too! I also love historical &amp; science related documentaries too! ",
        "upvotes": 37,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1k0arzy/need_some_laughs/"
    },
    {
        "id": "1k0r3x1",
        "author": "Carakozabra",
        "title": "Question about 'Cassandra'",
        "content": "what song plays in the opening scene of episode 3 'endgame', it plays during when fynn &amp; steve are on facetime. \nshazam can't identify it &amp; it's not on any spotify playlists\nhttps://youtu.be/FPxw2q9zGFQ ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k0r3x1/question_about_cassandra/"
    },
    {
        "id": "1k13ywe",
        "author": "OneBeerTwoBeers",
        "title": "How did this slip by…",
        "content": "Used to be a graphic designer.  When I see stuff like this, it just bugs me. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k13ywe/how_did_this_slip_by/"
    },
    {
        "id": "1k0kqq3",
        "author": "Somethingman_121224",
        "title": "Netflix Releases Trailer for Upcoming True Crime Docuseries 'Fred and Rose West: A British Horror Story,' Premieres in May",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k0kqq3/netflix_releases_trailer_for_upcoming_true_crime/"
    },
    {
        "id": "1k11fm2",
        "author": "Pineappleplusone",
        "title": "Censoring passion of the christ?",
        "content": "Censoring passion of the christ?\n\nThere any reason why Netflix censored passion of the christ? They basically eliminated the beginning where it shows the prophecy from Isiah and since it's the same movie i don't get why they'd take the Bible verse out. It'd be like editing it for violence when it's Netflix. I'm just padding this now so it hits the required word count",
        "upvotes": 0,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1k11fm2/censoring_passion_of_the_christ/"
    },
    {
        "id": "1k0c3nk",
        "author": "SleeepyyyyGeniusss",
        "title": "Apple Cider Vinegar",
        "content": "So I watched Apple Cider Vinegar recently and I'd heard parts of the story before but one thing that surprised me was the way Clive was portrayed. Throughout the show my feelings about him so I wanted to ask what others thoughts on Clive? ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k0c3nk/apple_cider_vinegar/"
    },
    {
        "id": "1k0fb0c",
        "author": "Ze_farofa",
        "title": "Netflix HDR is soo dark and washed out",
        "content": "All HDR content on my Netflix looks washed out and dark, does all the picture settings and persists. In other streams like prime video, HDR is beautiful, but on Netflix it is horrible. \nI have TCL c645 and a fire tv 4k max 2nd gen.\nAll other streams work fine HDR, so beautiful, only Netflix is ​​washed out and dark.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k0fb0c/netflix_hdr_is_soo_dark_and_washed_out/"
    }
]