[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 136,
        "comments": 489,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mxc7io",
        "author": "smcneal",
        "title": "How KPop Demon Hunters Harnessed Girl Power To Become One of Netflix’s Biggest Hits Ever",
        "content": "Director Maggie Kang discusses inspo for the movie, including \"Buffy\" and her tween self:\n\n“I don’t think we see this kind of woman a lot in film, and there’s this kind of fear of showing women look ‘ugly’ and imperfect, especially in animation, and that message doesn’t sit well with me. So I hope girls can learn that there’s beauty in our imperfections, even in how we look on the outside.”",
        "upvotes": 54,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mxc7io/how_kpop_demon_hunters_harnessed_girl_power_to/"
    },
    {
        "id": "1mxia1h",
        "author": "marianinacob",
        "title": "Shameless on Netflix Greece",
        "content": "Shameless was added on the greek Netflix on August 1, and i have been watching like crazy since then, I'm already on season 6 as of today. As I was watching, and the episode ended, it suddenly popped an error saying that it's not available in my region. How could that happen when it was just added 3 weeks ago? This is very frustrating.",
        "upvotes": 24,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1mxia1h/shameless_on_netflix_greece/"
    },
    {
        "id": "1mxoe8c",
        "author": "Crafty-Ball9103",
        "title": "Can't stand how many of these exist.",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ih9x1a5l8okf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mxoe8c/cant_stand_how_many_of_these_exist/"
    },
    {
        "id": "1mxabaj",
        "author": "lobstersonskateboard",
        "title": "Watched Sneaky Pete after it moved to Netflix— underrated gem!",
        "content": "I was sad to see it got cancelled after 3 seasons, there was still so much it could explore. I absolutely loved every bit of it, the acting is phenomenal and the story's been the most engaging thing I've seen on Netflix in a long time. \n\nI wonder with it moving to Netflix that maybe, just *maybe*, there's a small chance it could get a renewal? Copium, I know, but I wonder if anyone else feels the same way. I'm not sure if David Shore even has the capacity to do something in the near future, since he's working on a new series at the moment... But a man can hope.",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mxabaj/watched_sneaky_pete_after_it_moved_to_netflix/"
    },
    {
        "id": "1mx5kju",
        "author": "hamptont2010",
        "title": "Long Story Short is phenomenal",
        "content": "Not the movie, because apparently there is a movie with the same name, but the new show from the people behind Bojack Horseman. I'm currently on episode, and it's everything you'd expect from the BoJack crew and more. It's funny, charming, witty, heart-breaking, and moving. The premise of jumping around to different timelines also allows it to tell some really interesting stories. If you like Bojack, it's definitely worth checking out!",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mx5kju/long_story_short_is_phenomenal/"
    },
    {
        "id": "1mwqc5q",
        "author": "ToonAdventure",
        "title": "Blue Eye Samurai: Season 2 | Official Start of Production | Netflix",
        "content": "",
        "upvotes": 126,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1mwqc5q/blue_eye_samurai_season_2_official_start_of/"
    },
    {
        "id": "1mxb2ah",
        "author": "Vast-Passenger-2620",
        "title": "Sense8 Sensational",
        "content": "From the makers of The Matrix this series from 2018 confounded marketing efforts and was cancelled after 2 seasons. It’s very difficult to explain but I think it’s more mind blowing than The Matrix. I have watched it 4 times already and continue to discover new profound insights. Sense8 explores the nature of Reality and Identity. What defines us? Name? Gender? Job? Expression of Love? If everyone is interconnected is that why we must be kept divided and dumbed down for the powers that be to keep us controlled?\nThis is in my Top 5",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mxb2ah/sense8_sensational/"
    },
    {
        "id": "1mxms1o",
        "author": "IGR777",
        "title": "What’s a good show that works mostly as background noise?",
        "content": "This might be an odd question, but sometimes I do some online work from home and I don’t like to just sit there and do the work so what’s a good show I can put on and not really pay attention to, but still understand so nothing with a  Deep story",
        "upvotes": 0,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1mxms1o/whats_a_good_show_that_works_mostly_as_background/"
    },
    {
        "id": "1mxdssi",
        "author": "Substantial-Use-1758",
        "title": "A strong recommendation for “Hostiles” with a superlative Christian Bale",
        "content": "Check out this 2017 new Classic on Netflix, also featuring Wes Studi and Rosalind Pike. \n\nIt’s a slow burning, beautiful western which portrays the violent, painful realities of life in the American West in the 1890’s. \n\nChristian Bale is the best of the best here. The music is also gorgeous, and the final scene — that final scene! Is maybe the most powerful and sublimely done finale in any film, of this or any age 🤷‍♀️🥹",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mxdssi/a_strong_recommendation_for_hostiles_with_a/"
    },
    {
        "id": "1mxchii",
        "author": "Less_Manufacturer218",
        "title": "HOSTAGE-great show but puzzling ending",
        "content": "When the parents are telling their daughter to put down the gun when a killer is approaching her armed with a knife was infuriating. Didn’t anyone writing or directing the show realize how backwards that scene was, especially to close out the show?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mxchii/hostagegreat_show_but_puzzling_ending/"
    },
    {
        "id": "1mw700m",
        "author": "BlackDoom_26",
        "title": "The most binge worthy Netflix show or movie you’ve ever watched",
        "content": "You ever start a show or movie on Netflix thinking you’ll just watch one episode, then suddenly it’s 3am and you’ve watched the whole thing? Just curious what people’s recommendations are for ones that really had you hooked.",
        "upvotes": 778,
        "comments": 1284,
        "media": null,
        "permalink": "/r/netflix/comments/1mw700m/the_most_binge_worthy_netflix_show_or_movie_youve/"
    },
    {
        "id": "1mxb4oa",
        "author": "fartingpopsicles",
        "title": "Does anyone else find it annoying that no one helps Wednesday in the series when she actually needs it?",
        "content": "\\[SPOILER ALERT BTW\\]\n\nts is pissing me off. like bro just help the poor girl. she keeps asking her mother for help. she keeps stressing over minimal clues and all that. she has proven herself worthy of belief regarding the crime scenes after that joseph crackstone and hyde incidents but somehow everyone keeps asking her to stop except probably uncle fester and recently, her grandmama. especially her mother!!! she keeps asking Wednesday to stop when she is clearly trying to prevent the goddamn death of her best friend??? in s2 episode 4 SHE SAW THEM GETTING ATTACKED BY THE BIRDS. but still she keeps pushing wednesday beyond the boundaries. let the girl breathe jeez\n\nalso, morticia can see how hiding the truth from wednesday does NO good whatsoever but she just has to protect her secrets and stuff. god this is stressing tf outta me",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mxb4oa/does_anyone_else_find_it_annoying_that_no_one/"
    },
    {
        "id": "1mwvq5p",
        "author": "BlueRose99x",
        "title": "Marco Polo",
        "content": "Well, for the longest time I refused to watch this show because I thought it wouldn’t be great. Genghis Khan grandson’s empire? Barely little facts to the actual Kublai Khan story? No thanks.\n\nBut I just finished it, and in reality it was amazingly good. Definitely kept me on the edge and wanting more. Too bad the series got canceled and left the last season on a cliffhanger. No closure, damn you Netflix. ",
        "upvotes": 21,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mwvq5p/marco_polo/"
    },
    {
        "id": "1mwgfil",
        "author": "bbqchef_nyc",
        "title": "Which cancelled Netflix show do you wish would come back?",
        "content": "Same as the question.\n\nIf you had the power to bring ONE cancelled Netflix series back for at least one more season, which show would you pick and why?",
        "upvotes": 129,
        "comments": 1037,
        "media": null,
        "permalink": "/r/netflix/comments/1mwgfil/which_cancelled_netflix_show_do_you_wish_would/"
    },
    {
        "id": "1mxf4p9",
        "author": "BoringBot123",
        "title": "Netflix changed GUI on Apple TV and it looks horrible.",
        "content": "Did anyone else just get the new Netflix interface on Apple TV?\nIt’s clunky, harder to navigate, and feels way less intuitive than before. The old layout wasn’t perfect, but at least it was clean and easy to use.\n\nNow everything looks oversized, categories are harder to browse, and it feels like Netflix is trying to copy something. It is just not Netflix style anymore.\n\nIs it just me, or does this update make the whole experience worse?",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1mxf4p9/netflix_changed_gui_on_apple_tv_and_it_looks/"
    },
    {
        "id": "1mx0zig",
        "author": "Ok_Let_893",
        "title": "Hostage",
        "content": "ANOTHER DISAPPOINTING LIMITED SERIES. The story doesn’t make sense. The negotations, the military/ security tactics. Script and dialogues feel like Chatgpt made it. I am on ep 5. Just gotta finish it for closure.",
        "upvotes": 6,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1mx0zig/hostage/"
    },
    {
        "id": "1mx34cl",
        "author": "Sun_Flower11",
        "title": "Sophia in Greenleaf",
        "content": "In the show Greenleaf, why didn’t they just take some of Sophia’s eggs? They could’ve frozen them for the future and she could’ve gotten a surrogate to carry. Strange this was never an option given.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mx34cl/sophia_in_greenleaf/"
    },
    {
        "id": "1mxcqje",
        "author": "Foreign-Machine4160",
        "title": "Netflix video quality",
        "content": "I have netflix best plan and a very good internet, but i can feel many time the video quality is not 1080p. And there is no option available like in other ott application to control video quality. That basic feature is still not available even when you pay so much money.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mxcqje/netflix_video_quality/"
    },
    {
        "id": "1mxi8f6",
        "author": "ToonAdventure",
        "title": "Nobody 2 Duo Talk Gears of War Movie, Passing on Jurassic World",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mxi8f6/nobody_2_duo_talk_gears_of_war_movie_passing_on/"
    },
    {
        "id": "1mwr9ek",
        "author": "ToonAdventure",
        "title": "Devil May Cry: Season 2 | First Look | Netflix",
        "content": "",
        "upvotes": 18,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mwr9ek/devil_may_cry_season_2_first_look_netflix/"
    },
    {
        "id": "1mx4mle",
        "author": "Sweaty-Toe-6211",
        "title": "‘Death By Lightning’ Starring Michael Shannon &amp; Matthew Macfadyen Gets Netflix Premiere Date (November 6)",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mx4mle/death_by_lightning_starring_michael_shannon/"
    },
    {
        "id": "1mx3if4",
        "author": "No-Muffin-874",
        "title": "Need help with an older animated kids show",
        "content": "I need help trying to find an animated kids show that was on Netflix, somewhere around 2016. It was circus themed, and was mostly musical. I specifically remember a tiger singing, but there were other animals. It seems like the songs were set to classical music, but I may be wrong. Any help figuring this out would be very appreciated, as I have been unsuccessful. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mx3if4/need_help_with_an_older_animated_kids_show/"
    },
    {
        "id": "1mwe7u7",
        "author": "peoplemagazine",
        "title": "First Look at Emily in Paris Season 5 | 📷: Netflix",
        "content": "Netflix shared first-look images of the fifth season of 'Emily in Paris' on Wednesday, which sees the titular character, played by Lily Collins, continuing her journey in Venice, Italy — and the return of Lucas Bravo as Gabriel. More details [here](https://people.com/emily-in-paris-season-5-first-look-lily-collins-continues-italian-adventure-lucas-bravo-returns-11794241?utm_campaign=peoplemagazine&amp;utm_medium=social&amp;utm_source=reddit.com&amp;utm_content=post).",
        "upvotes": 69,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1mwe7u7/first_look_at_emily_in_paris_season_5_netflix/"
    },
    {
        "id": "1mxmx5f",
        "author": "SuspicuousQueef",
        "title": "Not again, what  is wrong with netflix",
        "content": "It was fine for a week, but now it’s back to the same BS again. Is there any way to get through this without having to buy a subscription? \n\nhttps://preview.redd.it/0wqokjm6wnkf1.png?width=2532&amp;format=png&amp;auto=webp&amp;s=44dba61fcf0525c546d61d0996366d43933954af\n\n",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mxmx5f/not_again_what_is_wrong_with_netflix/"
    },
    {
        "id": "1mx6gnx",
        "author": "paintednature",
        "title": "account sharing (without actually sharing)",
        "content": "hey,\nits my siblings' 16th birthday on sunday and i wanted to gift them a netflix subscription. however i moved out and have my own subscription with my partner, i wanted to make a netflix sub where they each have an account for themselves.\n\ntheres this household-sharing rule, how do i set up this subscription? do i need to be in their wifi and set it up because of the ip-adress? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mx6gnx/account_sharing_without_actually_sharing/"
    },
    {
        "id": "1mxed1s",
        "author": "peoplemagazine",
        "title": "Olivia Culpo Will Host Netflix's Next Gen Chef: 'Could Not Be More Excited'",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mxed1s/olivia_culpo_will_host_netflixs_next_gen_chef/"
    },
    {
        "id": "1mxje57",
        "author": "Douchnaw",
        "title": "Is anyone else sick of New Netflix?",
        "content": "(SIDE NOTE: im not racist, i would like to make that perfectly clear). I hate the route netflix is focusing on, with the success of \"Squid Games\", all I seem to see on Netflix are shitty K/J-drama/comedies, along with the \"Bollywood\" stuff they've made. I just wish that they'd work on stuff for all the audiences, not just the fucking K/J-stans.\nDoes anyone else agree or disagree? I wanna know if im the only one that hates this era of Netflix.",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1mxje57/is_anyone_else_sick_of_new_netflix/"
    },
    {
        "id": "1mwqk4m",
        "author": "ToonAdventure",
        "title": "Splinter Cell: Deathwatch | Official Teaser | Netflix",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mwqk4m/splinter_cell_deathwatch_official_teaser_netflix/"
    },
    {
        "id": "1mwyl6e",
        "author": "Uraqtae",
        "title": "extra member for $8 dollars thinks its main household member?",
        "content": "i’m just gonna out my family. My aunt is broke so she borrows our streaming accounts all the time no problem shes family who cares so we added an extra account through our Netflix for the extra $8  but it kicked my entire family off the Netflix and the only way to bypass it with another device (or my moms email) cool i can use my phone or living room tv right NAH it thinks the main household device (id use my moms email to fix it but its the middle of the night shes sleeping i dont know her password and im a night owl ill get it tomorrow) is my aunts Roku top box and what I find annoying is I thought that buying the extra account would cancel out the not a part of the household error we keep getting but it doesnt??",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mwyl6e/extra_member_for_8_dollars_thinks_its_main/"
    },
    {
        "id": "1mwx05t",
        "author": "Horror-Internet-9601",
        "title": "Biggest plot hole in Damsel",
        "content": "I’m rewatching it for like the fourth time (it’s a good background noise movie) and I’ve finally had enough with this plot hole: who the fuck drew the map? V was the only one who seems to make it past the crystal cave and she clearly died at the top, and even if she’d lived how and why would she climb back down to make that map😭 am I missing smth or is this just a massive plot hole that none of the creators thought of ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mwx05t/biggest_plot_hole_in_damsel/"
    }
]