[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 46,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 18,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qo513x",
        "author": "Illrollonshabbos",
        "title": "Watch Secret Mall Apartment …",
        "content": "I went by this several times before I finally had to stop and see what it was about. The trailer doesn’t do it justice. Just when I think I’ve seen everything a gem like this appears. ",
        "upvotes": 76,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qo513x/watch_secret_mall_apartment/"
    },
    {
        "id": "1qo6f7b",
        "author": "TriggeredEvil",
        "title": "How did you feel about His &amp; Hers?",
        "content": "Did anyone else feel kind of bored or confused at first watching His &amp; Hers?\nThe first couple episodes felt slow and a bit odd to me and I almost stopped watching, but I’m glad I didn’t because I actually really liked the ending. It was so unexpected.\nI just wish the earlier episodes had done more to keep my attention. Curious what everyone else thought about it.",
        "upvotes": 20,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1qo6f7b/how_did_you_feel_about_his_hers/"
    },
    {
        "id": "1qnvoz0",
        "author": "Klutzy_Hand_132",
        "title": "Harlan Coben",
        "content": "Is anyone else obsessed with Harlan Coben.\nI watched all his Netflix series ...read his books.. and now im watching his new true crime series.\nLike I just cant get enuff\nI cant be the only one right ? ",
        "upvotes": 64,
        "comments": 149,
        "media": null,
        "permalink": "/r/netflix/comments/1qnvoz0/harlan_coben/"
    },
    {
        "id": "1qo1zuo",
        "author": "Danaeger",
        "title": "Why are there never any subtitles when characters are speaking in foreign languages?",
        "content": "Watching Homeland right now and whenever anyone speaks Arabic zero subtitles.\n\nI suppose you’d expect this to be included in the original media, but still annoying as fuck.\n\nAlso for Homeland specifically, enabling subtitles changes the position depending on the scene.\n\nBottom left, bottom right, some text on the left and some text on the right? WTF?! Why not keep it centred?\n\nI would upload a photo but I can’t here.. check it out for yourselves.. strange as fuck.",
        "upvotes": 23,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1qo1zuo/why_are_there_never_any_subtitles_when_characters/"
    },
    {
        "id": "1qnx9gm",
        "author": "healthy-outdoors-",
        "title": "Anyone have any good thriller/ action/ crime / mystery movies out right now? Even shows honestly.",
        "content": "What the title says struggling to find something good to watch lol. Any recommendations would be appreciated thank you. Could be a show or movie either one. ",
        "upvotes": 19,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1qnx9gm/anyone_have_any_good_thriller_action_crime/"
    },
    {
        "id": "1qnd3j3",
        "author": "Global_Ninja_4485",
        "title": "Just watched a movie that actually hit me in the feels",
        "content": "I am not into anime but recently I watched \"Your Name\" on Netflix and ... wow. The story, the music, the way it captures connection- it stuck with me long after the credits. Rarely cry at movies, but this one got me.\n\nAny other Netflix gems that hit this hard emotionally?",
        "upvotes": 86,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1qnd3j3/just_watched_a_movie_that_actually_hit_me_in_the/"
    },
    {
        "id": "1qo8cxu",
        "author": "Ashtxns",
        "title": "What is this bro",
        "content": "For some reason my netflix now has random letters bigger than others on all the stuff on there, Is anyone else's netflix doing this? I'm in Australia if that's relevant",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qo8cxu/what_is_this_bro/"
    },
    {
        "id": "1qn3nd9",
        "author": "DemiFiendRSA",
        "title": "Alex Honnold Says Netflix Paid “Embarrassingly Small Amount” For Taipei 101 Climb: “I Would Do It For $0”",
        "content": "",
        "upvotes": 125,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1qn3nd9/alex_honnold_says_netflix_paid_embarrassingly/"
    },
    {
        "id": "1qo3rrf",
        "author": "FreshOffTheBed",
        "title": "Indian movies english dubbed",
        "content": "Im tryna get jnto the hindu movie genre bollywood and such and was wondering how come netfix doesnt have a lot of indian movies with english dubbed; im only really searching for english dubbed bollywood movies any suggestions preferably action comedy drama or thriller",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qo3rrf/indian_movies_english_dubbed/"
    },
    {
        "id": "1qo37w1",
        "author": "FriendlyWorldArt",
        "title": "Five Star Chef",
        "content": "I know these reality shows love a sob story, but how freaking weird that Jordan was talking about sleeping in the woods and being told he would never be anything in life, and Adria was saying how she has never been good enough for her parents and they never tell her they love her…and then they invite the parents to the finale! \n\nWtf ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qo37w1/five_star_chef/"
    },
    {
        "id": "1qn1uh2",
        "author": "WolfinBoy",
        "title": "Train Dreams was buried?",
        "content": "This movie just got nominated for Best Picture and yet I signed into my Netflix account thinking it would be right there blown up right there next to Frankenstein…but it wasn’t. In fact, I had to search for it. Multiple rows of other categories…I started to even doubt it was on the platform. \n\nWhat is Netflix even doing. They have two **beautiful** films that deserve more eyes and they are not prioritized at all. Instead I get The Circle and whatever other drivel is on there. \n\nMaybe my algorithm (from a sparsely used account) caused it to be buried. Is this the case for anyone else?",
        "upvotes": 131,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1qn1uh2/train_dreams_was_buried/"
    },
    {
        "id": "1qnvrwn",
        "author": "WoodenOperation5999",
        "title": "Run away",
        "content": "what happened deedee when ash was in the tent and he could hear her screaming? the old woman muttered something about getting his turn but subsequently she put a note in his shoe ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qnvrwn/run_away/"
    },
    {
        "id": "1qo0yyo",
        "author": "bahe2018",
        "title": "Does 3 Body Problem get better after the first episode?",
        "content": "I really wanted to like this one! But if the rest of it is as slowwwww moving as the first episode….idk if I’m going to make it!\nIt just dragged the whole time &amp; barely gave any insight into what the series will even be about?  What does everyone think?",
        "upvotes": 0,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1qo0yyo/does_3_body_problem_get_better_after_the_first/"
    },
    {
        "id": "1qnyw74",
        "author": "goatlax96",
        "title": "Shoes playing on different qualities.",
        "content": "So my shows are playing on different qualities. One show shows plays in perfect hd or whatever and the next show is like 480p or something. Does anyone know the reason for this and how to fix it. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qnyw74/shoes_playing_on_different_qualities/"
    },
    {
        "id": "1qnhjs2",
        "author": "carboard_raccoon",
        "title": "Show recommendations?",
        "content": "Me and my mom have been watching shows together for a while now and really enjoy it, unfortunately we can't really find anything interesting atm :( So far we've watched Sweet Tooth, Young Royals, Beauty in Black, Shameless, Anne with an E and we're currently watching 13 Reasons Why but idk how I feel about it yet (so basically older teen and young adult stuff). We especially liked Sweet Tooth, Shameless and Anne with an E! Unfortunately I much prefer animated shows but my mom refuses to watch anything animated so anything animated probably won't go far 💔\n\nAny recommendations are much appreciated!! :D",
        "upvotes": 7,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1qnhjs2/show_recommendations/"
    },
    {
        "id": "1qnl23s",
        "author": "Superb_State8245",
        "title": "Is there a limit on how often I can change my Netflix primary household?",
        "content": "I live in one house for the majority of the year and another home over the colder months (usually November-March, staying with family). My primary location for Netflix is the main house and whilst I can watch Netflix on my phone here in the winter home, I'd like to watch it on the smart TV.\n\nIf I update my primary location on Netflix to the winter home now, will I still be able to change it back to my main house when I move back in the spring?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qnl23s/is_there_a_limit_on_how_often_i_can_change_my/"
    },
    {
        "id": "1qmvzkb",
        "author": "RiskAndReason",
        "title": "What’s at the top of your Netflix watchlist right now?",
        "content": "Just curious 👀\n\nBecause I’m stuck scrolling again 😅 What’s the one show or movie at the top of your Netflix list that you actually plan to watch next?\n\n\n\nLooking for ideas on what to start next.",
        "upvotes": 91,
        "comments": 210,
        "media": null,
        "permalink": "/r/netflix/comments/1qmvzkb/whats_at_the_top_of_your_netflix_watchlist_right/"
    },
    {
        "id": "1qm64ef",
        "author": "steal_your_thread",
        "title": "Skyscraper Live is all wrong",
        "content": "Netflix have gotten this wildly wrong, they don't seem to remotely understand what we wanted from this. I straight up couldnt care less about this random commentator having a crack at a part of the climb, or a prerecorded clip of Alex talking about not wanting to die. \n\nWE WANT TO WATCH THE CLIMB.\n\nShut up, keep the climb on the large screen and put all your stupid nonsense filler in that mini screen, if on at all, and STOP TALKING OVER ALEX. They are adding absolutely nothing to this, no commentary at all would be significantly better than these terrible commentators saying how 'scary and dangerous' for the 100th time.",
        "upvotes": 3009,
        "comments": 541,
        "media": null,
        "permalink": "/r/netflix/comments/1qm64ef/skyscraper_live_is_all_wrong/"
    },
    {
        "id": "1qmwpcq",
        "author": "Longjumping_Land_977",
        "title": "Why Elizabeth Smart’s mother Lois wasn’t in the Netflix documentary, and where she is now",
        "content": "",
        "upvotes": 77,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qmwpcq/why_elizabeth_smarts_mother_lois_wasnt_in_the/"
    },
    {
        "id": "1qnim38",
        "author": "DuxxieDings",
        "title": "i need more adult animation like arcane and wolf king",
        "content": "the adult animation 3d animation but its very stylized and they are allowed to be mature and take the story to its fullest! \n\ni hope netflix has more shows like that coming out. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qnim38/i_need_more_adult_animation_like_arcane_and_wolf/"
    },
    {
        "id": "1qnq0gt",
        "author": "BackstageCast",
        "title": "What's your favorite monologue from \"Bridgerton\"?",
        "content": "From Daphne’s early-season awakenings to Kate and Anthony’s tension-soaked speeches to Penelope revealing her true identity to the Ton, “Bridgerton” has given us some unforgettable moments that we truly burn for.\n\nBefore Season 4 graces our screens this week, we’re curious: which monologue shattered you, stayed in your mind, or demanded an immediate rewind? Your favs might be added to a Backstage article. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qnq0gt/whats_your_favorite_monologue_from_bridgerton/"
    },
    {
        "id": "1qnn9e6",
        "author": "wooodsky",
        "title": "Why does Netflix basic with ads feels like 4k to me?",
        "content": "I have Apple TV + and prime which to my understanding supports 4k and I have a 1Gpbs ethernet connected to an Apple TV. I noticed no difference in video quality when compare these services to Netflix basic with ads which supports up to 1080p?\n\nAm I tripping or they secretly give 4k streaming for free which seems highly unlikely?",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qnn9e6/why_does_netflix_basic_with_ads_feels_like_4k_to/"
    },
    {
        "id": "1qnfzf2",
        "author": "clasprea",
        "title": "How to cancel/pause subscription with prepaid credit?",
        "content": "Hi, I received a 25eur gift card for christmas and I activated the 6.99eur/month subscription on Dec 28th. Today I see I have 18.01 eur left on my account balance, and that's ok.\n\nI wanted to cancel for now and activate again the subscription in a couple of months, since I know I won't have much time to watch netflix in the next months. So I went and cancel my subscription, and now I am completely lost on what will happen... I received two mails just after cancelling: one email says that my subscription will end on 15th april, the second email says I will be able to watch until 27th January!\n\nI tried to contact netflix customer care by phone and chat, to understand when my sbcription will end: the girl on the phone wasn't sure about the answer, but in the end she told me the subscription will and tomorrow, and my 18.01 eur will remain in my balance and I can restart when I want. Since she wasn't sure, I tried also the chat: the girl on the chat wrote me the opposite: even if when I enter nexflix it says \"You can use Netflix until the of subcription on 27th january 2026\", she confirmed that with prepaid card the subcription will go on unil the credit ends, on april 15th\n\nI am so confused and I am also afraid that if I don't do anything now I risk to lose the vision AND the prepaid credit, and of course I cannot trust their customer care operators that told me two different things. Could someone help me understand how it works? Thanks",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qnfzf2/how_to_cancelpause_subscription_with_prepaid/"
    },
    {
        "id": "1qnl4wq",
        "author": "Easy-Ad589",
        "title": "Need a show recomendation! I feel like I've watched them all. 😭",
        "content": "Here's a list of shows I've watched (and enjoyed)\n\n1: 18 seasons of Grey's Anatomy\n\n2: Ginny &amp; Georgia\n\n3: Heartbreak High\n\n4: All of OBX, but only liked the first season\n\n5: Never have I ever\n\n6: Young Sheldon, Georgie and Mandy's First Marriage, The Big Bang Theory\n\n7: Santa Clarita Diet\n\n8: The Good Place\n\n9: Squid Game and Squid Game the Challenge\n\n10: TADC (I know it's cringe, but it's a fun watch)\n\n11:Interview with a Vampire\n\n12: A Series of Unfortunate Events\n\n13: Inside Job\n\n14: The Babysitters Club\n\n15: No Good Nick\n\nThat's all I can think of! I can't find any new shows. I'm good with any maturity rating. Thanks!  \n",
        "upvotes": 0,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1qnl4wq/need_a_show_recomendation_i_feel_like_ive_watched/"
    },
    {
        "id": "1qnifkh",
        "author": "Ok-Acanthaceae-813",
        "title": "Plss Recommend me some good romance + action or thriller or mystery show or movie like stranger things (if have a teen cast)",
        "content": "Please recommend me some good romance mixed with action, thriller, or mystery, similar to Stranger Things, preferably with a teen or young-adult cast. I really enjoy stories where friendship, first love, and emotional bonds grow while dangerous or mysterious things are happening in the background. Shows or movies with suspense, secret organizations, supernatural elements, or crime investigations are totally my vibe, as long as there is also a soft romantic angle that develops naturally. I like characters who are around school or college age, dealing with crushes, loyalty, jealousy, and growing up while facing big threats. It would be amazing if the story has strong chemistry between the leads, slow-burn romance, and moments that make your heart race, both because of action and because of feelings. The overall mood can be dark, adventurous, or emotional, but not too graphic. Basically, I’m looking for something that combines excitement, mystery, and love in a way that feels youthful, intense, and binge-worthy.\n\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qnifkh/plss_recommend_me_some_good_romance_action_or/"
    },
    {
        "id": "1qnnroh",
        "author": "pumpkinspice1477",
        "title": "His and hers questions",
        "content": "Watched this show recently and… wow. I think this was a show equivalent of the phrase ‘that escalated quickly’. I did have a lot of questions which are probably just plot holes:\n\n1. What was the point of her tooth infection? I thought it would come back to make sense at some point and other than her losing the tooth when Catherine/Lexie hit her, it was just- meaningless?\n\n2. Why did they have all that plastic tarp, bleach, and other torture weapons laid out in that lake house if they were not planning anything sinister? \n\n3. How is it even possible that Anna, who used to hang out allll the time with Catherine when they were kids, couldn’t recognize her at all (despite the weight loss and change in hair color), not even an inkling, when working in the same office BUT her mother for some reason immediately picked up on who it was???\n\n4. How is it also possible that Anna married the brother of the girl who watched (and helped) her get raped- and it NEVER came up? How does that dynamic work? Why? How? What?\n\n5. Why did she never tell Jack about the rape? What his sister did? Additionally, in the end after Catherine got arrested WHY did she lie about what happened? What was the point of telling him Catherine got assaulted and not her, if she genuinely believed that Catherine was the killer and the whole thing was solved? Why the lie now?\n\n6. Why the hell was Catherine saying Anna ‘laughed in my face’ when SHE was the one that abandoned her there to get raped? Anna very clearly saved her from that trauma and she repaid her by letting her suffer what she was about to- so why was she acting all angry about it? \n\n I feel like there were more question marks for me after watching the show than there were any answers. I also feel like, with the whole lake house scene and the way it was shot, that the writers originally planned to do one thing and then just pivoted to make it twistier. Idk.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qnnroh/his_and_hers_questions/"
    },
    {
        "id": "1qm5w0n",
        "author": "bh4v1_",
        "title": "Netflix, you should have done better on skyscraper live",
        "content": "People inside the buildings coming up and waving, the constant commentary over Alex speaking, the unnecessary conversations with him while he’s over a building and getting the crowd to shout at him whilst he’s up there. Having his wife appear from inside - it’s like they’re doing everything they can to throw him off his game. This is incredibly anxiety inducing as it is, and it’s like the production team have instructed certain behaviours to make it borderline unbearable. It just feels so performative which is not what his climbs are usually about. \n\nI get it’s fun for the show, and looks cool, but the guy is climbing a skyscraper ffs. \nHe’s doing enough to get you your views, please just let us watch him climb and PLEASE LET US HEAR HIM. I’m so sick of the constant yapping from the panellists; it’s like they’ve been told not to come up for air. Stop doing weird commentary and playing these videos when he’s talking, we want to hear his thoughts, his process, his funny quips. \n\nFeels really irresponsible of Netflix to allow this tbh; like the marvellousness of a free solo climb is just being made a mockery of tbh and this is a real person up there. A huge disservice to climbing, and to Alex. Props to him for absolutely giving the crowd what they’re after though. Couldn’t be me! \n",
        "upvotes": 605,
        "comments": 114,
        "media": null,
        "permalink": "/r/netflix/comments/1qm5w0n/netflix_you_should_have_done_better_on_skyscraper/"
    },
    {
        "id": "1qnsmzu",
        "author": "Gdpedro",
        "title": "Skyscraper live? WTF?i",
        "content": "I mean, ok, this guy should be a star of climbing but… what would netflix do if he wouldnt make it? Like giving up was ok, but what if he was actually falling? Was netflix ok to show LIVE someone dying?\n\nAnd this is normalising this kind of challenges, what if there is gonna be some scapegoats?\n\nCome on, are we such a shitty society where we need to get our adrenaline pumped by someone risking their life for our entertainment\n\n",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qnsmzu/skyscraper_live_wtfi/"
    }
]