[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1ouysri",
        "author": "_L_-",
        "title": "Mr Orologio sul tram",
        "content": "",
        "upvotes": 14,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7oj9twiz2s0g1.jpeg?auto=webp&amp;s=ae9d23f121bfa3e2ffa53822c1a5d178e229617a"
        },
        "permalink": "/r/torino/comments/1ouysri/mr_orologio_sul_tram/"
    },
    {
        "id": "1oufk02",
        "author": "Emyfour",
        "title": "Subway Torino: la verità trionfa",
        "content": "Una ventina di giorni fa, ho lanciato [un accorato appello](https://www.reddit.com/r/torino/comments/1oe0ik1/subway_torino_chiuso_da_anni_ma_aperto_su_maps/) per portare all'attenzione di tutti un problema drammatico: il noto ristorante Subway in Via Garibaldi 55/D, caduto vittima della pandemia nel 2020, era ignobilmente mantenuto aperto su Google Maps.\n\nOggi, dopo anni di inganni e false speranze, ho ricevuto il messaggio che annuncia la fine della lotta.\n\nhttps://preview.redd.it/xett2qnkwn0g1.jpg?width=576&amp;format=pjpg&amp;auto=webp&amp;s=7dd2004b51774cccfc7cbf4d6ee6a4155d6ecc4c\n\nhttps://preview.redd.it/2phtae0lwn0g1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=f72e0820605eee30829920205fd913e1199b9985\n\nIl falso è stato sconfitto, la mappa è stata purificata, e Subway Torino può finalmente riposare in pace.\n\nRingrazio solennemente gli eroici segnalatori che hanno contribuito a combattere l'ingiustizia cartografica. Uniti, abbiamo ripristinato la verità.\n\n\n\nGrazie per aver reso Torino un posto migliore.",
        "upvotes": 128,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1oufk02/subway_torino_la_verità_trionfa/"
    },
    {
        "id": "1ouohmu",
        "author": "Top-Analysis-887",
        "title": "Via Roma pedonale, in centro a Torino riapre il primo tratto: \"Diventerà un unico lungo boulevard",
        "content": "A Torino martedì 11 novembre è stato riaperto il primo tratto della nuova via Roma pedonale, tra piazza San Carlo e via Bertola.",
        "upvotes": 16,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/B7HpNn-lANBPeByazbk5mn4dYamnFGDClLhvhwqVUrM.jpeg?auto=webp&amp;s=cbb98129032e000781b9001b0a58e759a0ddffe3"
        },
        "permalink": "/r/torino/comments/1ouohmu/via_roma_pedonale_in_centro_a_torino_riapre_il/"
    },
    {
        "id": "1oujn1s",
        "author": "Vic4ri0us",
        "title": "Qualcuno è mai andato al museo con le pere di resina?",
        "content": "Sono qui da poco e ogni volta che racconto alle persone che voglio andare al museo della frutta (pomologico) mi guardano come se fossi pazza. \nForse le persone non colgono l'ironia del tutto non lo so, forse fa realmente cagare come tutti suppongono. \nTorinesi chiedo a voi, meritano 800+ sculture in resina a forma di frutta dietro teche di vetro? ",
        "upvotes": 15,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1oujn1s/qualcuno_è_mai_andato_al_museo_con_le_pere_di/"
    },
    {
        "id": "1ouq5ci",
        "author": "Effect-Imaginary",
        "title": "Che cosa sarebbe: \"Gentile utente siamo passati presso la vostra abitazione per consegnare lo starter kit della raccolta differenziata \"porta a porta\" ma non vi abbiamo trovato.\"?",
        "content": "Mi sono trovato una sorta di volantino dell'amiat fuori casa (fra l'altro non hanno suonato).",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ouq5ci/che_cosa_sarebbe_gentile_utente_siamo_passati/"
    },
    {
        "id": "1ou98ka",
        "author": "bookbookitaita5",
        "title": "Ci sono altri posti in città come \"200 lire\" dove puoi giocare arcade games o giochi da tavolo mentre si fa aperitivo?",
        "content": "",
        "upvotes": 13,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ou98ka/ci_sono_altri_posti_in_città_come_200_lire_dove/"
    },
    {
        "id": "1ou9our",
        "author": "Virtual-Marzipan9664",
        "title": "gruppi/collettivi a Torino?",
        "content": "Ciaoo!   \nHo 21 anni, studio Psicologia e mi sono da poco trasferita a Torino.  \nMi piacerebbe iniziare a fare un po’ di volontariato o entrare in qualche associazione/collettivo per conoscere persone nuove, dare una mano e sentirmi un po’ più parte di questa città.  \nSono una persona piuttosto timida, quindi mi piacerebbe trovare un ambiente aperto e accogliente 🌿  \nMi interessano soprattutto i progetti legati al sociale, all’educazione o al benessere psicologico, ma sono curiosa anche di scoprire altri ambiti!  \nSe avete consigli o conoscete realtà attive in città, ve ne sarei super grata :-):-)",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ou9our/gruppicollettivi_a_torino/"
    },
    {
        "id": "1oug8pm",
        "author": "asilorepublic95",
        "title": "Dove comprare dell erba light buona ?",
        "content": "Sapete indicarmi dove trovare dell hashish light buono o dell erba. Quali distributori ? Zona santa Rita ,crocetta mirafiori .",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1oug8pm/dove_comprare_dell_erba_light_buona/"
    },
    {
        "id": "1oug1ez",
        "author": "sakurarat",
        "title": "ciaoo!!",
        "content": "gente con cui andare ai museii? possibilmente tra i 17 e 19 anni, ho fatto l’abbonamento musei ma non voglio andare da sola😞",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1oug1ez/ciaoo/"
    },
    {
        "id": "1ouoxma",
        "author": "Icy_Sand_1453",
        "title": "Pasticceria a Torino",
        "content": "Quali sono i migliori, e quali sono i dolci tipici di Torino? Ho visto che i bacci di dama sono del nord e che anche la torte di gianduja che è di Torino. Qualche dolce di fine anno? Qualcuno lo sa?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ouoxma/pasticceria_a_torino/"
    },
    {
        "id": "1ouoet2",
        "author": "Effective_Excuse_667",
        "title": "Parcheggio bianco per lavoro piazza statuto",
        "content": "Ciao,\n\nLavoro in zona piazza statuto/porta Susa, praticamente all'inizio di corso Francia.\n\nQuali sono i parche gratis più vicini per lasciare la macchina senza rimetterci lo stipendio? In corso Francia e limitrofi è costosissimo :( \n\nGrazie in anticipo ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ouoet2/parcheggio_bianco_per_lavoro_piazza_statuto/"
    },
    {
        "id": "1ou3es3",
        "author": "xBlenderman",
        "title": "my passport was stolen",
        "content": "Is there anything to do at all? I have a police report, but the police were extremely unhelpful... there were cameras pointing directly at the car but I was told I can't look at them only police can.\n\nI am US Citizen and if there's no hope I have to travel all the way down to Rome for an emergency passport...\n\nWould love any thoughts anyone has...\nIt was in a bag with my laptop, which, I know should har been with me, but I wasn't thinking for some reason.\n\nThanks",
        "upvotes": 15,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1ou3es3/my_passport_was_stolen/"
    },
    {
        "id": "1oumch1",
        "author": "Ganzalf_the_grey",
        "title": "Evento oggi ai giardini Lamarmora?",
        "content": "Sono passato questa sera verso le 21:30 da Corso Ferrucci e ho visto un sacco di ragazz* ai giardini Lamarmora, zona via Nino Bixio. C’era veramente molta gente e sembravano soprattutto universitari. Ai miei tempi (20 anni fa) non si usava per nulla andare da quelle parti per fare serata o uscire, che voi sappiate è diventata una zona di “movida” (che termine orrendo) o era solo un evento estemporaneo questa sera?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oumch1/evento_oggi_ai_giardini_lamarmora/"
    },
    {
        "id": "1oua4tp",
        "author": "Kalifla88",
        "title": "Trovare lavoro ima Torino",
        "content": "Salve, ho 30 anni e cerco lavoro a Torino, ho \"provato\" agenzie per trovare lavoro ma sembra più serva a loro che a me(anzi è così lol). Sapete se negozi in centro cerchino tramite curriculum a mano? O per favore consigliatemi altri modi, grazie.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oua4tp/trovare_lavoro_ima_torino/"
    },
    {
        "id": "1oujnbm",
        "author": "FitResort2371",
        "title": "Gruppi lettori/scrittori informali?",
        "content": "Ciao! Nuovo a Torino, con un forte interesse per lettura e scrittura, mi chiedevo se esistesse qualche gruppo/circolo informale che affrontasse queste attività in compagnia, o anche come semplice spazio di condivisione.\n\nAvete qualche idea?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oujnbm/gruppi_lettoriscrittori_informali/"
    },
    {
        "id": "1ouisgi",
        "author": "DriestLearner",
        "title": "Viale e controviale su Corso Unione Sovietica.",
        "content": "Ciao, da tempo mi sorge un dubbio, premetto che non ho guidato tanto a Torino, sono più abituato ad altre città e paesini. andando all'uni vedo spesso persone che prendono il controviale spostandosi dal viale principale, anche se hanno l'obbligo di proseguire dritto. Parlo di Corso Unione Sovietica e di Via Sacchi.\nDato che ogni viale ha la sua regola, in questo caso specifico come si ci comporta? Mettendo caso che sono sul viale principale di Corso Unione, posso spostarmi quando voglio sul contriviale? Anche se ho l'obbligo di proseguire dritto? \nA scuola guida mi hanno sempre detto che il cambio da viale a controviale è da trattare come un cambio di corsia, ma se ci aggiungi l'obbligo di andare dritti, le corsie riservate di intralcio, e la gente che spesso è alquanto confusa, cosa sarebbe giusto da fare ? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ouisgi/viale_e_controviale_su_corso_unione_sovietica/"
    },
    {
        "id": "1ott7y2",
        "author": "Travelwanderlust5",
        "title": "La miglior gelateria in città è la Romana e provate a farmi cambiare idea!!!",
        "content": "",
        "upvotes": 37,
        "comments": 140,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/winwrtfwhi0g1.jpeg?auto=webp&amp;s=a10d57409dca9aba4ad8d688b913fb33eb0b831b"
        },
        "permalink": "/r/torino/comments/1ott7y2/la_miglior_gelateria_in_città_è_la_romana_e/"
    },
    {
        "id": "1ougqnk",
        "author": "frisk99",
        "title": "Corsi di nuoto",
        "content": "Ciao a tutti, conoscete per caso qualche piscina che fa corsi di nuoto per chi non sa nuotare e non solamente corsi agonistici? Non riesco a trovare sui siti delle piscine qualcosa di specifico e non credo che il corso generico per adulti parta da un livello adatto per chi ha paura dell'acqua. \nSe qualcuno ha esperienza e avesse voglia di condividere, mi farebbe un enorme favore.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ougqnk/corsi_di_nuoto/"
    },
    {
        "id": "1oug4rq",
        "author": "Turning_The_Corner",
        "title": "Will it be crazy Nov 15 to 18 due to film festival?",
        "content": "I am landing in Milan on 15th. I was hoping to spend 3 nights in Torino. I was there 10 years ago and have wonderful memories. Prices of airbnb seemed expensive and then I found out that there is film festival. I can figure out prices. I have a rental car so I can even stay a bit outside centro, but will it be crazy rush in the city, will it be hard to find reservations in restaurants ?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1oug4rq/will_it_be_crazy_nov_15_to_18_due_to_film_festival/"
    },
    {
        "id": "1ouex9a",
        "author": "sammysammy98",
        "title": "Quakcuno ha esperienza con l'autoscuola matricardi?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ouex9a/quakcuno_ha_esperienza_con_lautoscuola_matricardi/"
    },
    {
        "id": "1oueqdt",
        "author": "CowEnvironmental3401",
        "title": "Migliori Panettoni",
        "content": "Migliori panettoni artigianali e quindi pasticcerie dove prenderli ?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oueqdt/migliori_panettoni/"
    },
    {
        "id": "1oudvvb",
        "author": "Individual_Living_54",
        "title": "Casa in corso Giulio Cesare, è pericoloso?",
        "content": "Ciao a tutti.  Mi sto per trasferire a Torino per la magistrale e ho trovato una stanza molto graziosa in via Giulio Cesare, intorno al civico 50, quartiere Aurora. Qualcuno mi ha sconsigliato questa zona definendola molto pericolosa, mentre altri non sono d'accordo e invece la considerano semplicemente più popolare, ma non davvero pericolosa. Cosa ne pensate? Dovrei preferire questa casa, che come dicevo mi piace molto, o altrimenti, a parità di prezzo, una casa meno bella ma in una zona considerata più sicura? ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1oudvvb/casa_in_corso_giulio_cesare_è_pericoloso/"
    },
    {
        "id": "1ou9198",
        "author": "oscartistol",
        "title": "ATP Finals 2025 - N°2 biglietti 13/11/2025 - Tribuna Nord - sessione pomeridiana",
        "content": "IN VENDITA 2 BIGLIETTI EVENTO NITTO ATP FINALS 2025\n\nLUOGO: Torino, Inalpi Arena\n\nDATA: Giovedì 13 Novembre 2025 - Sessione pomeridiana (inizio ore 11:30 - un incontro di doppio + un incontro di singolare)\n\nTribuna NORD 201, Fila 9, posti 12 e 13\n\nOttima visibilità, senza ostacoli.\n\nN.B. l'ingresso alla Tribuna Nord dà anche l'accesso al campo di allenamento.\n\nBiglietti in formato PDF, da stampare su foglio A4 o da caricare su dispositivo mobile (telefono cellulare) per essere mostrati ai varchi d'ingresso.\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8sifvbudnm0g1.jpeg?auto=webp&amp;s=c2f062edadbc7ebf3f924ab1025a2e3ed3191adf"
        },
        "permalink": "/r/torino/comments/1ou9198/atp_finals_2025_n2_biglietti_13112025_tribuna/"
    },
    {
        "id": "1ou2ovg",
        "author": "epico73",
        "title": "Problema con la scelta della tariffa sull'app della GTT",
        "content": "Ciao, sa qualche giorno sto avendo problemi con l'app della GTT con la scelta della tariffa dei biglietti; non mi fa visualizzare le scelte di acquisto, mi compare \"ops, qualcosa è andato storto\" su una banda rossa. Qualcuno ha riscontrato questo problema? Come posso risolvere? Ho provato a disinstallare ed reinstallare l'app più volte oppure togliere la connessione e i dati di navigazione internet, ma niente da fare.\n",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ou2ovg/problema_con_la_scelta_della_tariffa_sullapp/"
    },
    {
        "id": "1ots0j1",
        "author": "Outrageous_Lab_7106",
        "title": "Consigli techno torino",
        "content": "Non ho la più pallida idea di dove andare per una serata techno decente, qualcuno consiglia posti o anche serate questo weekend ?? ",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1ots0j1/consigli_techno_torino/"
    },
    {
        "id": "1ou4cmm",
        "author": "FriendlyRaisin3789",
        "title": "Posto auto in Corso Dante o limitrofe?",
        "content": "Ciao a tutti,\n\nMi trasferirò a breve a Torino e sto cercando, senza sorte per ora, un posto auto in zona Corso Dante (verso il Ponte Balbis) ma anche limitrofe, tipo Corso Bramante.\n\nL'idea iniziale era quella di lasciare l'auto per strada, ma la cosa mi spaventa un po'.\n\nHo provato su Immobiliare ma nulla, quindi mi rivolgo a Reddit come ultima spiaggia.\n\nDove cercare posto auto in affitto a Torino oltre a Immobiliare.it?\n\nGrazie mille",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ou4cmm/posto_auto_in_corso_dante_o_limitrofe/"
    },
    {
        "id": "1otdj0w",
        "author": "Top-Analysis-887",
        "title": "“È stato l'appuntamento più folle e romantico di sempre”: sospesi nel vuoto a 85 metri di altezza in cima alla Mole Antonelliana!",
        "content": "Kasia Smutniak e Domenico Procacci sospesi a 85 metri d'altezza, lo scatto sulla Mole Antonelliana! La fotografia inaugura la mostra “Piano sequenza. La Mole”, dal 12 novembre 2025 al 1 marzo 2026 alle Gallerie d’Italia di Torino, in occasione dei 25 anni del Museo Nazionale del Cinema. Voi ci andrete?",
        "upvotes": 31,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g9acd4l5kf0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/torino/comments/1otdj0w/è_stato_lappuntamento_più_folle_e_romantico_di/"
    },
    {
        "id": "1ot88qf",
        "author": "Kernel_907",
        "title": "Se ci sei batti un colpo",
        "content": "Ciao a tutti, Torinesi e/o Torinesi adottati. Sono arrivata da poco e miei amici storici sono sparsi per il mondo... Comincio a sentire un po' la solitudine, c'e qualcuno nella mia stessa imbarazzante condizione che avrebbe voglia di un caffè random e qualche chiacchiera, oppure participare insieme a eventi/giochi, escursioni, random boh? Sembra ci sia molta gente qua che lamenta la stessa cosa, magari ci si puó dare una mano a vicenda! \nA bit of info about me: \nF37 , adoro natura ed aria aperta, sport, yoga, gochi da tavolo, parlare a vanvera di filosofia, psicologia, misteri criminali irrisolti, ridere molto, enigmi, escape room, sto andando a caso ora mi viene in mente questo. \nE non ho il dono della sintesi, come è facile capire da questo post.\nQuindi.. non abbiate paura dite amico ed entrate (cit) 🪷",
        "upvotes": 37,
        "comments": 32,
        "media": null,
        "permalink": "/r/torino/comments/1ot88qf/se_ci_sei_batti_un_colpo/"
    }
]