[
    {
        "id": "1r0azeg",
        "author": "EmmaHigginsAMA",
        "title": "Hi /r/movies, I'm Emma Higgins, director &amp; writer of SWEETNESS. Ask me anything!",
        "content": "Hi reddit. I'm Emma Higgins, writer-director of SWEETNESS. It's a horror-thriller coming out this Friday 2/13.\n\nIt premiered at SXSW last year and stars Kate Hallett, Herman Tømmeraas (Ragnarok), Steven Ogg (The Walking Dead), Justin Chatwin (Shameless), Amanda Brugel (The Handmaid’s Tale), and Aya Furukawa (The Midnight Club)\n\n**Synopsis:**\n\nWhen a superfan learns that her rock-star idol is spiraling into addiction, she makes it her mission to save him, whether he wants her help or not. However, when her desperate plan spins out of control, she kidnaps him in a delusional attempt to fix him. What started as compassion soon turns into captivity as she locks him away in the name of love.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=Y7NBgr1mEZk](https://www.youtube.com/watch?v=Y7NBgr1mEZk)\n\n**Other:**\n\n* [https://www.tiktok.com/@sweetnessthemovie](https://www.tiktok.com/@sweetnessthemovie)\n* [https://www.instagram.com/sweetnessthemovie/?hl=en](https://www.instagram.com/sweetnessthemovie/?hl=en)\n\nAsk me anything! I'll be back at 5 PM ET today to answer your questions.\n\n",
        "upvotes": 221,
        "comments": 93,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tqp5c93uaiig1.png?auto=webp&amp;s=8513951fda491fd86a63718500ffaf688324f0cd"
        },
        "permalink": "/r/movies/comments/1r0azeg/hi_rmovies_im_emma_higgins_director_writer_of/"
    },
    {
        "id": "1r0kbg3",
        "author": "SanderSo47",
        "title": "February 6-8 Box Office Recap – For Super Bowl weekend, 'Send Help' stays at #1, crossing $50M worldwide. 'Solo Mio', 'Stray Kids' and 'Dracula' over-perform projections, while 'The Strangers: Chapter 3' flops with just $3.4M. 'Zootopia 2' crosses $1.8 billion worldwide.",
        "content": "https://preview.redd.it/4yvcbealzjig1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=76d25ee74fc4519f704c3e2c507dd33a48f84d00\n\nThe Super Bowl weekend is always quiet at the box office, as studios avoid releasing big stuff here. As such, ***Send Help*** got to repeat at #1 for the second week in a row. Despite that, some films got to over-perform projections, including ***Solo Mio***, ***Stray Kids***, and ***Dracula***. The only big loser was ***The Strangers: Chapter 3***, which flopped to the surprise of absolutely no one.\n\nThe Top 10 earned a combined $49 million this weekend. That's up 5.9% from last year, when ***Dog Man*** repeated at #1, and ***Heart Eyes*** and ***Love Hurts*** opened.\n\n20th Century Studios' ***Send Help*** remained at #1 with $9 million. That's a 53% drop, which isn't quite terrible considering Super Bowl deflated the weekend. Through 10 days, the film has earned $34.8 million, and it seems like it should hit over $50 million domestically by the end of its run.\n\nFrom time to time, Angel Studios has a film that over-performs projections. It rarely happens, but this was that occassion, as the Kevin James-led ***Solo Mio*** managed to hit second place with $7 million in 3,052 theaters. Quite impressive, to be honest. Given strong reception, this could hit $20 million, assuming it's not consumed by the incoming releases.\n\nUnsurprisingly, Markiplier's ***Iron Lung*** saw a steep drop in its second weekend. It collapsed 63%, earning $6.7 million this weekend. Nevertheless, that's not actually a bad drop, considering other titles could drop as high as 70%. Through 10 days, the film has earned $31.5 million so far.\n\nBleecker Street's ***Stray Kids: The DominATE experience*** managed to hit fourth place with a great $5.6 million in 1,724 theaters. That's one of the studio's biggest ever debuts. Nevertheless, it's not gonna last long, given how front-loaded it was: 54% of the weekend's gross came from Friday.\n\nIn fifth place, Vertical's release of Luc Besson's ***Dracula*** debuted with $4 million in 2,050 theaters. That's not a lot of money, but it's Vertical's biggest ever debut. In fact, with just this weekend, ***Dracula*** is already Vertical's biggest film domestically, finally overtaking ***Gotti*** ($4.2 million). Although with some competition, it'd be a surprise if it lasted long in theaters.\n\n***Zootopia 2*** had the best drop in the Top 10, despite the Super Bowl's presence. It eased just 32% this weekend, adding $4 million. The film has earned a crazy $414.5 million domestically, and it's definitely gonna pass ***A Minecraft Movie*** ($424 million) to become 2025's highest grossing film.\n\nIn seventh place, Lionsgate's ***The Strangers: Chapter 3*** flopped with just $3.4 million in 2,565 theaters. That's a rough 41% drop from ***Chapter 2*** ($5.8 million), which was already 51% below ***Chapter 1*** ($11.8 million). \n\nAnother unsurprising result. For some reason, Lionsgate really believed that a ***Strangers*** trilogy would be an easy profit. And to be fair, they were correct; they're ultra-cheap films (a combined $20 million for the whole trilogy), so they'll probably make some slight profit. But what's clear is that there's absolutely zero good will left on this franchise. Each passing film has been worse received than the prior film, and it looks like they saved the absolutely worst for last.\n\nAccording to Lionsgate, 53% of the audience was male, and 32% was in the 25-34 demographic. Critics destroyed the film with a brutal 16% on RT, and the audience pretty much agreed. The audience gave the film a horrible \"D\" on CinemaScore, the worst in the franchise. Even for horror, that's a terrible grade. Given its low debut and the fact that it will be facing severe competition, it'd be a surprise if it made it past $8 million domestically. But at least this left a mark, for it'll be named in the \"worst trilogies of all time\" lists.\n\n***Avatar: Fire and Ash*** dropped 39%, adding $3.4 million this weekend. That takes its domestic total to $391.5 million.\n\nIn ninth place, Black Bear's ***Shelter*** dropped 55%, adding $2.4 million. Through 10 days, the film has earned a weak $10 million, and it doesn't have much left in the gas tank.\n\nRounding out the Top 10 was Amazon MGM's ***Melania***, falling all the way from the third spot. After its poor debut last week, the film also had the worst drop in the Top 10. It collapsed a poor 67%, earning just $2.3 million this weekend. Seems that despite the \"glowing\" word of mouth from its niche fans, the rest of the world was just fine ignoring it. Through 10 days, the film has earned a poor $13.3 million, and it will miss $20 million.\n\nJust outside the Top 10, another Amazon MGM title. ***Mercy*** continues fizzling out, dropping 59% and earning just $1.8 million. The film has earned a meager $22.6 million so far.\n\n***The Housemaid*** dropped 51% for a $1.7 million weekend. That takes its domestic total to $123.5 million.\n\nA24 expanded the Charli XCX mockumentary ***The Moment*** to 581 theaters, and it earned $1.6 million. That takes its domestic total to $2.2 million. \n\nA24's ***Marty Supreme*** dropped 51%, adding $1.3 million. The film has amassed $93.2 million, and it looks like it might fall short of hitting $100 million domestically.\n\nA24 released ***Pillion*** in 4 theaters, where it earned $241,769. That translates to a very strong $60,442 per-theater average. The film has already earned $1.5 million in the UK back in November, and it will continue expanding over the next few weeks.\n\n#**OVERSEAS**\n\n***Stray Kids: The dominATE Experience*** debuted with $14.2 million overseas, for a $19.9 million worldwide debut. The best debuts were in Mexico ($2.1M), Germany ($1.6M), the UK ($1.4M), Italy ($800K), Spain ($600K), Brazil ($600K), France ($500K), Peru ($400K), Chile ($400K), Australia ($400K), Argentina ($300K), and Poland ($300K). These are very impressive debuts, considering it didn't have a lot of screenings in some markets. If there's one place where it surprisingly flopped was Korea, with just $227K. \n\nWith $14.7 million overseas, ***The Housemaid*** has crossed $350 million worldwide. It's nearing $40 million in the UK, and $35.8 million in France.\n\n***Zootopia 2*** has hit another milestone. With $12.8 million overseas, it has crossed the $1.8 billion milestone worldwide. It's already the ninth highest grossing film worldwide, and the fifth biggest overseas.\n\n***Avatar: Fire and Ash*** added $12.2 million overseas, taking its worldwide total to $1.439 billion.\n\n***Hamnet*** has added $6.8 million overseas, taking its worldwide total to a dazzling $70.6 million. Unsurprisingly, the UK has been its biggest market with $22.7 million, overtaking the domestic market. Given that it still has some markets left and with great holds, it definitely looks like the film has a chance to cross $100 million worldwide. A huge win for adult dramas.\n\n***Send Help*** has added $6.3 million overseas, crossing $50 million worldwide in the process. It debuted in the UK with a pretty good $2.2 million. Best markets are Mexico ($2.3M), the UK ($2.2M), Australia ($1.6M), Germany ($900K), Japan ($800K), Italy ($800k), Saudia Arabia ($700K), Spain ($700k), Netherlands ($600K) and Korea ($500K).\n\nWith $147 million worldwide, ***Marty Supreme*** has surpassed ***Everything Everywhere All At Once*** to become A24's highest grossing film. Let's see how high it can go.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Greenland 2: Migration* | Jan/9 | Lionsgate | $8,401,148 | $17,770,308 | $25,841,231 | $90M\n\n- Did you know there was a ***Greenland*** sequel in theaters? Or that there was a first ***Greenland*** movie in the first place? Cause ***Greenland 2: Migration*** has closed after just 4 weeks with an abysmal $25 million worldwide, failing to come anywhere close to its $90 million budget. Gerard Butler may be a recognizable name, but he sure has a lot of big flops to his name.\n\n#**THIS WEEKEND**\n\nIt's a very busy weekend, with FOUR films opening in wide release.\n\nThe buzziest title is WB's ***Wuthering Heights***, the new film from Emerald Fennell and starring Margot Robbie and Jacob Elordi. An adaptation of the novel by Emily Brontë, although this will clearly take a lot of liberties with the story (after all, the title is in quotation marks). So far, everything has looked pretty good, and it's the kind of film that could strike a chord with audiences over St. Valentine's Day. Whatever happens after the weekend, however, it's up to word of mouth.\n\nSony is releasing their new animated film ***Goat***, following an anthropomorphic goat named Will Harris who aspires to become the greatest of all time at a basketball-like sport known as roarball. It marks Sony Pictures Animation's first theatrical release since ***Across the Spider-Verse***, and it should benefit from a 2-month absence of notable animated films. \n\nAmazon MGM is releasing crime thriller ***Crime 101***, starring Chris Hemsworth, Mark Ruffalo, Barry Keoghan, Monica Barbaro, Corey Hawkins, Jennifer Jason Leigh, Nick Nolte, and Halle Berry. The movie looks like slick fun, but it remains to be seen if Hemsworth will turn his luck around, given that he has starred in a lot of failures outside the MCU.\n\nAnd finally, Gore Verbinski is returning after almost a decade with a new film, ***Good Luck, Have Fun, Don't Die***. The film stars Sam Rockwell, Haley Lu Richardson, Michael Peña, Zazie Beetz, Asim Chaudhry, Tom Taylor, and Juno Temple, and follows a man from the future who travels to the past and recruits the patrons of a Los Angeles diner he arrives in to help combat a rogue artificial intelligence. The film has great reviews on its side (93% on RT), but Briarcliff is not a great distributor for films.\n\n#**STREAMING DATA**\n\nHow did Netflix do last week?\n\nFigures for the week of January 26 to February 1:\n\nNo. | Movie | Year | Studio | Weeks in Top 10 | Views | Runtime | Hours Viewed\n----------|----------|:--------:|:--------:|:--------:|:--------:|:--------:|:--------:\n1 | *The Rip* | 2026 | Netflix | 3 | 14,600,000 | 1:53 | 27,500,000\n2 | *Kidnapped: Elizabeth Smart* | 2026 | Netflix | 2 | 9,600,000 | 1:31 | 14,500,000\n3 | *Dhurandhar* | 2025 | Jio Studios | 1 | 7,600,000 | 3:26 | 26,100,000\n4 | *KPop Demon Hunters* | 2025 | Netflix | 33 | 6,800,000 | 1:40 | 11,400,000\n5 | *The Big Fake* | 2026 | Netflix | 1 | 6,600,000 | 1:56 | 12,800,000\n6 | *Max* | 2015 | Warner Bros. | 2 | 6,200,000 | 1:51 | 11,400,000\n7 | *Trap* | 2025 | Warner Bros. | 1 | 5,400,000 | 1:45 | 9,400,000\n8 | *M3GAN 2.0* | 2025 | Universal | 1 | 5,000,000 | 2:00 | 10,000,000\n9 | *People We Meet on Vacation* | 2026 | Netflix | 4 | 4,500,000 | 1:58 | 8,900,000\n10 | *Tere Ishk Mein* | 2025 | AA Films | 2 | 4,400,000 | 2:45 | 12,100,000\n\nFor the third week in a row, ***The Rip*** has stayed at #1, with 14.6 million views. That takes its 17-day total to 96.6 million views. It's nearing 100 million views, although it seems cracking the all-time Top 10 will be a bit complicated.\n\nThe documentary ***Kidnapped: Elizabeth Smart*** kept the second spot with 9.6 million views, for a running total of 25.5 million views.\n\nIndeed, ***KPop Demon Hunters*** is not showing any signs of stopping. On its 33rd week, the film is still in the Top 10, barely even dropping from last week. Last Sunday, the film won the Grammy for Best Song Written for Visual Media, becoming the first K-pop song to win a Grammy. Next sight: the Oscar.\n\nIn ninth place, rom-com ***People We Meet on Vacation*** added 4.5 million views, taking its 24-day total to 54.3 million views.",
        "upvotes": 28,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1r0kbg3/february_68_box_office_recap_for_super_bowl/"
    },
    {
        "id": "1r0dk90",
        "author": "MarvelsGrantMan136",
        "title": "‘Sinners’ Exhibit Featuring Props, Costumes and Set Pieces Is Now Part of Warner Bros. Studio Tour",
        "content": "",
        "upvotes": 3955,
        "comments": 210,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Gs_D4p-7k3YOR4djSbmYDoop1xCFw2d-IKq4hAWsb4I.jpeg?auto=webp&amp;s=c524189a654b8f7d86e078524e183b5b7403f6ca"
        },
        "permalink": "/r/movies/comments/1r0dk90/sinners_exhibit_featuring_props_costumes_and_set/"
    },
    {
        "id": "1r0eqhn",
        "author": "ChiefLeef22",
        "title": "'Wuthering Heights' - Review Thread",
        "content": "*Tragedy strikes when Heathcliff falls in love with Catherine Earnshaw, a woman from a wealthy family in 18th-century England.*\n\nDirector: Emerald Fennell\n\nAdapted from: 'Wuthering Heights' by Emily Brontë (1847)\n\nCast: Jacob Elordi, Margot Robbie, Owen Cooper, Alison Oliver\n\n**Rotten Tomatoes:** [71%](https://www.rottentomatoes.com/m/wuthering_heights_2026)\n\n**Metacritic:** [60 / 100](https://www.metacritic.com/movie/wuthering-heights-2026/)\n\nSome Reviews:\n\n[Variety](https://variety.com/2026/film/reviews/wuthering-heights-review-1236651546/) \\- Peter Debruge\n\n&gt;While not as salacious as ‘Saltburn,’ the director’s operatic Emily Brontë adaptation allows its tragic couple — played by Margot Robbie and Jacob Elordi — to consummate their passions, to a degree.\n\n[The Guardian](https://www.theguardian.com/film/2026/feb/09/wuthering-heights-review-emerald-fennell-margot-robbie-jacob-elordi) \\- Peter Bradshaw - 2 / 5\n\n&gt;Wuthering Heights doesn’t have the live-ammo impact of Fennell’s earlier films, or indeed Andrea Arnold's primitivist take on Brontë’s novel from 2011, which really did believe in the passionate truth of Cathy and Heathcliff’s love. For Fennell, it looks like a luxurious pose of unserious abandon. It’s quasi-erotic, pseudo-romantic and then ersatz-sad, a club night of mock emotion.\n\n[USA Today](https://www.usatoday.com/story/entertainment/movies/2026/02/09/wuthering-heights-2026-movie-review/88556199007/) \\- 3.5 / 4\n\n&gt;Emerald Fennell’s take on the literary classic isn’t exactly a Valentine’s Day pick-me-up. Yet it’s awfully stunning to look at with all sorts of toxic obsession, forbidden lust and gothic sauciness.\n\n[RogerEbert](https://www.rogerebert.com/reviews/wuthering-heights-film-review-2026) \\- Tomris Laffy - 2 / 4\n\n&gt;It’s hard to feel freely when you are constantly and loudly reminded by every aspect of the movie that you are supposed to feel things.\n\n[AVClub - Natalia Keoghan](https://www.avclub.com/wuthering-heights-review) \\- 'C-'\n\n&gt;Overlong and undersexed, Fennell’s version of Wuthering Heights betrays her audience of edgelords and perverts. Even stranger, those who have fostered a distaste for the filmmaker’s sensibility will similarly find themselves disappointed. It’s one thing to make art that can be read as indulgent, ill-conceived, and tasteless—it’s another to turn around and make something that’s just boring in comparison.\n\n[Slash Film - BJ Colangelo](https://www.slashfilm.com/2097045/wuthering-heights-2026-movie-review/) \\- 5 / 10\n\n&gt;This is not an adaptation of \"Wuthering Heights,\" but the result of what happens when you're playing an approximation \"Wuthering Heights\" without a full grasp on the material but all the money in the world to bring your questionable imagination to life.\n\n[Consequence - Liz Shannon Miller](https://consequence.net/2026/02/wuthering-heights-review-margot-robbie/) \\- 'A-'\n\n&gt;As soon as this project was announced, it was easy to assume that Fennell would show as much reverence for the classic text as she showed for the sanctity of a man’s grave in *Saltburn*. Except she defies that assumption by making sure that although *“Wuthering Heights”* remains a deliciously horny film, it does summon a certain degree of pure romance, especially in the few moments when its leads are able to see past their misunderstandings and actually connect. It’s a movie about how ugly people can be to each other, but also about the beauty they’re capable of — a message that, like the original text itself, remains timeless.\n\n[The Telegraph - Robbie Collins](https://www.telegraph.co.uk/films/2026/02/09/margot-robbie-jacob-elordi-wuthering-heights/) \\- 5 / 5\n\n&gt;Style over substance? Not at all – it’s more that Fennell understands that style can be substance when you do it right. Cathy and Heathcliff’s passions vibrate through their dress, their surroundings, and everything else within reach, and you leave the cinema quivering on their own private frequency.\n\n[BBC - Caryn James](https://www.bbc.com/culture/article/20260209-wuthering-heights-review) \\- 4 / 5\n\n&gt;Emerald Fennell's Wuthering Heights is *not* very faithful to Emily Bronte's novel, but we knew that. The trailer alone evoked so much hand-wringing from Brontë purists that the film became divisive sight unseen. This Wuthering Heights *is* very true to Fennell, the director of the scathing revenge drama Promising Young Woman and the lush, bitter story of class and obsession, Saltburn.\n\n[Collider - Therese Lacson](https://collider.com/wuthering-heights-review-margot-robbie-jacob-elordi-emerald-fennell-emily-bronte/) \\- 2 / 10\n\n&gt;What makes the original Wuthering Heights so powerful is the dizzying story at its core. The Earnshaws and Lintons have a complicated family tree, and Heathcliff comes in like a wrecking ball to blow everything up. On one hand, we want to believe that Heathcliff can change from his wicked ways with enough love from Cathy, but on the other hand, his actions are so cruel that it feels like Brontë is pushing us to the very brink of what is acceptable before ultimately redeeming him in his final moments. Emily Brontë's novel is about characters who are hateful and pitiable but still full of enough charm and complexity that we are desperate to learn their full, messy tale. Emerald Fennell's film is merely telling a shallow story about two people overcoming all obstacles to fall in love — not necessarily awful on paper, but it's an adaptation that feels like a 14-year-old skimmed the book and jumped to her own conclusions without any true understanding of the novel.",
        "upvotes": 1608,
        "comments": 565,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yFy-h5bIqS5lzea-2RFD6_7teNrEbthW6xn62vhwnJU.jpeg?auto=webp&amp;s=7aa179e052953a8f84d17b3f67d802e63418f0bb"
        },
        "permalink": "/r/movies/comments/1r0eqhn/wuthering_heights_review_thread/"
    },
    {
        "id": "1r0ibd7",
        "author": "Giff95",
        "title": "Ice Dance - \"Edward Scissorhands\" (1990)",
        "content": "",
        "upvotes": 819,
        "comments": 60,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/u6zwl0vuljig1/CMAF_270.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1r0ibd7/ice_dance_edward_scissorhands_1990/"
    },
    {
        "id": "1r0kz9j",
        "author": "The-Perfect-Username",
        "title": "Heartbreaking scenes in otherwise unremarkable films?",
        "content": "What’s an example of a scene in a film that would otherwise be forgettable if not for one moment that absolutely punches you in the gut?\n\nThe one that springs to mind for me is the scene in Fantastic Four (2005) when Ben’s fiancée breaks up with him and then he tries to pick up the ring but can’t. As a kid that scene made me cry and as an adult I still get a lump in the throat.",
        "upvotes": 391,
        "comments": 280,
        "media": null,
        "permalink": "/r/movies/comments/1r0kz9j/heartbreaking_scenes_in_otherwise_unremarkable/"
    },
    {
        "id": "1r07j58",
        "author": "ICumCoffee",
        "title": "Roger Deakins on 50 Years Behind the Camera, His Fears for Film’s Future and Why He Believes the Art of Visual Storytelling is in Decline",
        "content": "",
        "upvotes": 1161,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qYwgV-h5W1Kky2iyKFgDKDp1vomFwj7L_BB6UZfyscU.jpeg?auto=webp&amp;s=0a3d8d00e8a7d0ad6eac2ca014bbceefcb08144e"
        },
        "permalink": "/r/movies/comments/1r07j58/roger_deakins_on_50_years_behind_the_camera_his/"
    },
    {
        "id": "1r0iguz",
        "author": "killrobot",
        "title": "'Crawl 2' - Sam Raimi Provides an Update on the New York City-Set Sequel",
        "content": "",
        "upvotes": 343,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HHM7BAih3MoDygbUvigknVPw2FfvYziUi_UZYub1YeE.jpeg?auto=webp&amp;s=cc6b7b47862c5397591baa87abcb320c8046c1a0"
        },
        "permalink": "/r/movies/comments/1r0iguz/crawl_2_sam_raimi_provides_an_update_on_the_new/"
    },
    {
        "id": "1r0f7ma",
        "author": "DemiFiendRSA",
        "title": "Laura Dern’s Criterion Closet Picks",
        "content": "",
        "upvotes": 359,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dAjggglB8RcrNRbF7-QHovuRMaoW2IJdxJyu_SUGo3M.jpeg?auto=webp&amp;s=27ec1ceb8738beac9387c8546ea1f682e19b8f6b"
        },
        "permalink": "/r/movies/comments/1r0f7ma/laura_derns_criterion_closet_picks/"
    },
    {
        "id": "1r0gqot",
        "author": "StillStanding_96",
        "title": "Silliest Bond Villain scheme?",
        "content": "What do we all think? There’s definitely a spectrum of schemes in the Bond series, from the sensible to the absurd. \n\nI think \\*From Russia with Love\\*’s Kronsteen has a fairly reasonable plan: Spectre wants a Soviet code-breaking machine and James Bond dead, they play British and Soviet intelligence against each other, have Bond steal the machine and stage his and his Russian accomplice’s deaths. Classic spy stuff.\n\nThere’s plenty of silly schemes to choose from, like Drax’s plan in \\*Moonraker\\* to create a genetically perfect human race on a space station… from a few dozen men and women 🤦‍♀️\n\nBut I think \\*License to Kill\\* takes the silly cake. The plan basically revolves around a cocaine smuggling operation. While giving a tour of his facilities to potential investors, he demonstrates his method for transporting thousands of kilos of cocaine completely undetectably: dissolve it in gasoline, truck it to the destination, and recover the cocaine by running the gas through a coffee filter. This is the plan. Just… wow.\n\nBut what do you think? Is there another movie with an even sillier plan?",
        "upvotes": 285,
        "comments": 382,
        "media": null,
        "permalink": "/r/movies/comments/1r0gqot/silliest_bond_villain_scheme/"
    },
    {
        "id": "1r02k6q",
        "author": "MoneyLibrarian9032",
        "title": "HBO Max Sets U.K. Launch Date The platform will be available from March 26, with content from HBO, Warner Bros. Pictures, Warner Bros. Television, DC Studios and Max Originals.",
        "content": "",
        "upvotes": 1382,
        "comments": 375,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8EFUPZvXXmBdRoQDbkNjY7ylaP3QL241cVUCI41VMOA.jpeg?auto=webp&amp;s=6c949a25c5b6cb7683de0d35976a11cac383713e"
        },
        "permalink": "/r/movies/comments/1r02k6q/hbo_max_sets_uk_launch_date_the_platform_will_be/"
    },
    {
        "id": "1r0kh35",
        "author": "NixsatFramestore",
        "title": "Behind the Scenes of F1 the Movie's visual effects",
        "content": "",
        "upvotes": 165,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MdponWrjXiVyUyWa_PHMlsk4E9_iD09uqbZExvf78Ok.jpeg?auto=webp&amp;s=de1c7076e62bb081a0ca850fe41325a5f22063f7"
        },
        "permalink": "/r/movies/comments/1r0kh35/behind_the_scenes_of_f1_the_movies_visual_effects/"
    },
    {
        "id": "1r0dxpl",
        "author": "darth_vader39",
        "title": "Film Academy Will No Longer Show Oscar-Nominated Films to Members on Big Screen",
        "content": "",
        "upvotes": 269,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/46Hf7QL1RVBNmzLq8C_GIL7Qvm4lpDR_iYN0BP4yWbA.jpeg?auto=webp&amp;s=e33ab2730e20aa9e2dbb815e3947612312482c47"
        },
        "permalink": "/r/movies/comments/1r0dxpl/film_academy_will_no_longer_show_oscarnominated/"
    },
    {
        "id": "1r0qgom",
        "author": "PeneItaliano",
        "title": "Poster for ‘The Blood Countess’ starring Isabelle Huppert",
        "content": "",
        "upvotes": 52,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a5efyrxpblig1.jpeg?auto=webp&amp;s=66f584d0e87d9effc46700e5d3c9c869c51367c8"
        },
        "permalink": "/r/movies/comments/1r0qgom/poster_for_the_blood_countess_starring_isabelle/"
    },
    {
        "id": "1r0a8qa",
        "author": "MarvelsGrantMan136",
        "title": "Authorized Bob Saget Documentary From Don Argott &amp; Sheena M. Joyce’s 9.14 Pictures In Works",
        "content": "",
        "upvotes": 309,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CRTvs1NF3IHVWG6xH2OiF-yK028GQMpEEuAZrSj8xjQ.jpeg?auto=webp&amp;s=61a86b274bbcc37b46fc6f2c0072a109b9024ff8"
        },
        "permalink": "/r/movies/comments/1r0a8qa/authorized_bob_saget_documentary_from_don_argott/"
    },
    {
        "id": "1r0v4xt",
        "author": "joesen_one",
        "title": "Briarcliff is giving away 2,000 tickets for ‘Good Luck, Have Fun, Don’t Die’ for free to those who lost their jobs to AI",
        "content": "",
        "upvotes": 21,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BOycAMi_eTPIIF2VjsR_KXWn6P9MKfBbn2_JGV7CiSA.jpeg?auto=webp&amp;s=0e998783aa618a1dce75c7650eb3364d980e78e9"
        },
        "permalink": "/r/movies/comments/1r0v4xt/briarcliff_is_giving_away_2000_tickets_for_good/"
    },
    {
        "id": "1r0gpyv",
        "author": "GoldDerby",
        "title": "‘Taxi Driver’ at 50: Paul Schrader on the controversial film’s enduring legacy",
        "content": "",
        "upvotes": 128,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0KW0FcQu9fv5BcjWGM4i7XznOA8geCJCGfyfVz_zEVk.jpeg?auto=webp&amp;s=51a7775b3fae55d0859529613b214a5e12931c23"
        },
        "permalink": "/r/movies/comments/1r0gpyv/taxi_driver_at_50_paul_schrader_on_the/"
    },
    {
        "id": "1r0mmzj",
        "author": "jaystats2",
        "title": "Films that would completely fall apart if the lead actor were recast",
        "content": "Not just “they did a great job,” but cases where the actor’s presence, voice, or energy is the movie, and a recast version is basically unthinkable.\n\nTwo that come to mind for me are Taxi Driver, with De Niro’s specific mix of menace, vulnerability, and vacancy as Travis Bickle. Recasting Bob turns the character into either a cartoon or a cliché. \n\nThe other obvious choice is ‘Being John Malkovich’. This one barely works because it’s Malkovich. The entire conceptual joke collapses if the actor isn’t instantly recognizable but still kind of mysterious.",
        "upvotes": 60,
        "comments": 224,
        "media": null,
        "permalink": "/r/movies/comments/1r0mmzj/films_that_would_completely_fall_apart_if_the/"
    },
    {
        "id": "1r0o0kd",
        "author": "Defiant-Ad7732",
        "title": "Finished watching arrival.....",
        "content": "my god, what a movie, one of the best movies I've ever watched, I went into the movie expecting a nice solid 7.8/10 movie with some good acting and plot and visually stunning as it is Dennis Villeneuve, but it exceeded all my expectations, the tension was relentless for me personally, it kept getting escalated, the pacing was perfect imo\n\ncoming to the climax, I was not ready for this revelation, this gift by aliens, Louise's choice of continuing to conceive Hannah was such a huge moral and Philosopically charged question \n\nI absolutely loved the way the movie told the viewers what happened to Ian after their girl was born, that Louise told him the reality \n\nDennis Villeneuve continues to be AMAZING, bro has only masterpieces in his pocket. 9.3/10 for me, it not only has amazing concept and twist but a heart touching twist that really makes me emotional and rank this movie very high",
        "upvotes": 49,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1r0o0kd/finished_watching_arrival/"
    },
    {
        "id": "1qzpcru",
        "author": "Giff95",
        "title": "The Adventures of Cliff Booth | Big Game Spot",
        "content": "",
        "upvotes": 5281,
        "comments": 754,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lgdk5oh73dig1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qzpcru/the_adventures_of_cliff_booth_big_game_spot/"
    },
    {
        "id": "1r04kb5",
        "author": "Potore5",
        "title": "First official poster for “FUZE”",
        "content": "",
        "upvotes": 404,
        "comments": 182,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/d51c5dkl3hig1.jpeg?auto=webp&amp;s=30f917223c7e4b740fe7bbbb42b058fb86bd8766"
        },
        "permalink": "/r/movies/comments/1r04kb5/first_official_poster_for_fuze/"
    },
    {
        "id": "1qzmihv",
        "author": "MarvelsGrantMan136",
        "title": "‘Marty Supreme’ Becomes A24’s Highest-Grossing Worldwide Release With $147 Million, Overtaking ‘Everything Everywhere All at Once’",
        "content": "",
        "upvotes": 6841,
        "comments": 392,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cjtomhyzToNmgeM6-kSXlU5fJi5ddLj49Ws8rS05mfQ.jpeg?auto=webp&amp;s=d119cfab891aa1aca7a06db070e1bd9e62016ffe"
        },
        "permalink": "/r/movies/comments/1qzmihv/marty_supreme_becomes_a24s_highestgrossing/"
    },
    {
        "id": "1r0revg",
        "author": "PeneItaliano",
        "title": "Naomi Watts And Odessa A’zion Join Sarah Paulson and Dianne Wiest In Cody Fern Movie",
        "content": "",
        "upvotes": 18,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xJFx_jP85sfAmwzPxyBUxug7f5sYuWV8HSwVvlhNOQY.jpeg?auto=webp&amp;s=e0869edeb8cb85280dba6a602b5b65a1c9f62aa7"
        },
        "permalink": "/r/movies/comments/1r0revg/naomi_watts_and_odessa_azion_join_sarah_paulson/"
    },
    {
        "id": "1r0o6q8",
        "author": "Top_Report_4895",
        "title": "TOMORROW NEVER DIES | Escape from Carver's HQ (1997, dir. Roger Spottiswoode)",
        "content": "",
        "upvotes": 24,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pAZNVf2znLlWoCenSYJUc6O17_BsPRk1O5elysO39VI.jpeg?auto=webp&amp;s=8fea4963206bcb7940f6304797c2acfda48c918b"
        },
        "permalink": "/r/movies/comments/1r0o6q8/tomorrow_never_dies_escape_from_carvers_hq_1997/"
    },
    {
        "id": "1r09yoc",
        "author": "rematar",
        "title": "The movie Jaws put a \"little person\" in a scaled down shark cage to make real shark footage look larger",
        "content": "&gt;**Speilberg:** I had this idea of doing a miniature cage and putting a little person into a miniature cage. That would have effectively scaled the shark up and added another, you know, nine feet to the overall length of the shark.  \n  \n&gt;**Valerie Taylor:** And Hollywood sent us this little man, he couldn't dive, he had spent most of his life riding horses, doubling for children in films like National Velvet, he'd doubled for Elizabeth Taylor. And, we had to take him out and stuff him into a cage and dangle him into the cold southern ocean. And have sharks - big, huge, monstrous sharks - swimming around him. And he was very much afraid and we had a lot of difficulty getting him into the cage which is probably quite understandable. We did have two little dummies because we were supposed to have somebody in the cage when the shark broke it up. But we had Carl, and he was much better, he looked better in the cage, he moved around a bit.\n\n[https://year11media2010.blogspot.com/2010/07/jaws-making-of-transcript.html](https://year11media2010.blogspot.com/2010/07/jaws-making-of-transcript.html)\n\nLittle part about the little person starts around 17:50 (until 25:00) of the Making of Jaws video.\n\n[https://www.youtube.com/watch?v=EZj5EHGrQII](https://www.youtube.com/watch?v=EZj5EHGrQII)",
        "upvotes": 146,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SaP3DXOcr7Zu0AUabbMV0NqYAGUAmiBAlH5X2kdO4co.jpeg?auto=webp&amp;s=95e2596d8c4a586ac801fe21b311ed3008ca8356"
        },
        "permalink": "/r/movies/comments/1r09yoc/the_movie_jaws_put_a_little_person_in_a_scaled/"
    },
    {
        "id": "1r0iejz",
        "author": "Southern-Brother5693",
        "title": "Black Rain (1989) - Michael Douglas in Osaka",
        "content": "Caught this on Netflix last night. Aka THE ADVENTURES OF NICK SAN!\n\nI like how noir Ridley Scott makes Osaka look. The industrial buildings look almost Blade Runner-like in some shots. Michael Douglas and Andy Garcia make a good pair. Al Leong even has a cameo in the finale as a Yakuza hitman.\n\nIs it just me, but I don't think this film gets mentioned enough as part of Ridley Scott's work?\n\n  \nP.S - The version I saw didn't have any subtitle translations during the Japanese scenes. Which is weird because I seem to remember them when i watched this on cable long ago.",
        "upvotes": 57,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1r0iejz/black_rain_1989_michael_douglas_in_osaka/"
    },
    {
        "id": "1qzh44d",
        "author": "BunyipPouch",
        "title": "Quentin Tarantino’s New Beverly Cinema Going Back to Its Porno Roots - The cinema spent most of the 1970s as an adult movie theater, and starting this month, it'll screen hardcore and softcore porn in celebration of the theater's history.",
        "content": "",
        "upvotes": 8274,
        "comments": 645,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/K2DgnOURVAu0WSfkx7iz_jCVor5imG5m7MW9jVbSqLI.jpeg?auto=webp&amp;s=d7da63a3a04a0e011dfca84be8299ac1bb7f6e1e"
        },
        "permalink": "/r/movies/comments/1qzh44d/quentin_tarantinos_new_beverly_cinema_going_back/"
    },
    {
        "id": "1r0ih8i",
        "author": "KevinLewisAMA",
        "title": "Hi /r/movies! I'm Kevin Lewis. I directed WILLY'S WONDERLAND, starring Nicolas Cage. My newest film, MISDIRECTION, stars Frank Grillo &amp; Olga Kurylenko, and it's out now. Ask me anything!",
        "content": "Hi Reddit! I'm filmmaker Kevin Lewis. My latest directorial effort starring Frank Grillo, Olga Kurylenko, and Oliver Treyvana - ***Misdirection*** is now streaming on your favorite PVOD platforms courtesy of Cineverse (the maniacs behind Terrifier 3 and The Toxic Avenger).\n\nWe AMA'd last month with I unleashed ***Pig Hill***, starring Rainey Qually and Shane West (also from Cineverse). And don't forget ***Willy's Wonderland*** starring Nic Cage!\n\nSynopsis for ***Misdirection***:\n\n&gt;A couple's trust is tested on their last \"big job\", as their victim reveals a hidden agenda resulting in murder.\n\n**Trailer**: [https://www.youtube.com/watch?v=lJvxW4V9wYc](https://www.youtube.com/watch?v=lJvxW4V9wYc)\n\n**Instagram**: [https://www.instagram.com/kevinlewisofficial/](https://www.instagram.com/kevinlewisofficial/)\n\n**Bio**: Filmmaker Kevin Lewis planted his cult flag on planet horror with Willy’s Wonderland (starring Nicolas Cage in a dialogue free performance) and quickly followed it up with the horror film The Accursed starring Mena Suvari. Cineverse (Terrifier 3, The Toxic Avenger) just released the action thriller Misdirection, and the Southern Gothic tale Pig Hill which premiered at FrightFest earlier this year. After almost succumbing to Covid back in 2021 (two weeks before Willy's release), Kevin has committed himself to not stop doing what he loves... making genre movies. Look for his upcoming films Oak and I Am Your Driver starring Jeremy Piven.\n\nAsk me anything! I'll be back tomorrow (Tuesday 2/10) at 6:30 PM ET to answer your questions.",
        "upvotes": 42,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7u4hidirgjig1.png?auto=webp&amp;s=3b07a679ee481cd42a2716f672fe90de727f573d"
        },
        "permalink": "/r/movies/comments/1r0ih8i/hi_rmovies_im_kevin_lewis_i_directed_willys/"
    },
    {
        "id": "1qziyyy",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Project Hail Mary'",
        "content": "",
        "upvotes": 5530,
        "comments": 598,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/inevnoywsbig1.jpeg?auto=webp&amp;s=b88d9397b73afdc38f0c97e9c67e13e4449b8038"
        },
        "permalink": "/r/movies/comments/1qziyyy/new_poster_for_project_hail_mary/"
    },
    {
        "id": "1qzjgnv",
        "author": "TheGirlWithTheLove",
        "title": "*Update!* Last year, Danny Boyle did an ama. I commented and told him about how much 127 Hours means to me. He responded and said he sent me a card.",
        "content": "In case If anyone reading this isn’t familiar with what happened, I’m autistic and 127 Hours has been my special interest for nearly 15 years. I’ve watched it over a thousand times. I’m known as the 127 Hours girl on Letterboxd and the Letterboxd subreddit.\n\nDanny did an ama for 28 Years Later. I knew if I had an opportunity to tell him about 127 Hours, this would be it.\n\nWhen I saw that Danny responded to my comment, I was shocked. I didn’t think he’d see it, let alone respond to it. He also said that he knew about me. That alone blew my mind.\n\nI was waiting months and months to receive the card, but it never arrived. A few weeks ago, a Reddit employee noticed that I never got it, so they messaged me and said that they contacted Danny’s team, and they wanted me to get the card. I felt hopeful that I’ll receive it this time.\n\nOn Friday, a package arrived from Danny. I had a huge smile on my face the second I realized what it was. I was so excited to open it!\n\nWhat he sent me was absolutely amazing. He sent me a very sweet handwritten note, and an amazing bonus. This is what Danny wrote me.\n\n“Jess,\n\nIn making a film the director watches it hundreds of times. I was so delighted-and continue to be so-that you have done the same!\n\nWe’d had a big success with Slumdog Millionaire, and it was only that success that brought the finance to 127-no one wants to watch a film about a man cutting his own arm off-they said.\n\nThe film holds a very special place for me and I’m honoured it does for you too.\n\nAll best always\n\nDanny Boyle”\n\nI never thought I’d one day receive a handwritten note from Danny himself. I’m still in shock!\n\nAs for the bonus, he also sent me a 127 Hours film crew t-shirt. It’s exactly like the shirt James Franco wears in the film.\n\nDanny truly has made my life! 127 Hours is my favorite thing in the world and it brings me so much joy. And to be recognized for that by the film’s director is beyond amazing. I never thought something like this would ever happen to me. I’ve been so emotional and my happiness levels have been through the roof! I’m over the moon.\n\nI wanted to share this with you guys because some of the members of this sub wanted an update. None of this would’ve happened if not for this sub and the ama. Thank you,  r/movies ! ❤️",
        "upvotes": 4660,
        "comments": 98,
        "media": null,
        "permalink": "/r/movies/comments/1qzjgnv/update_last_year_danny_boyle_did_an_ama_i/"
    }
]