[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 38,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qczq84",
        "author": "sfomonkey",
        "title": "Need light and uplifting show please. Long/many seasons would be great!",
        "content": "I'm struggling with my mental health RN, and concerned my depression will deepen. \n\nLooking for something light, uplifting, no cliffhangers, no bereavement/grieving please.   \n\nShows that ive seen that would fit the bill. Many  on the Inside, North of North, a Resident Alien were great.  The Good Place would be great, except I'm experiencing new grief and bereavement.\n\nNon Netflix shows that would work Mandalorian, Righteous Gemstones. Anime with good dub would be fine too. (Can't be bothered with subtitles ATM)\n\nA show that's uplifting, no violence would be so welcome. TIA ",
        "upvotes": 69,
        "comments": 186,
        "media": null,
        "permalink": "/r/netflix/comments/1qczq84/need_light_and_uplifting_show_please_longmany/"
    },
    {
        "id": "1qd8h57",
        "author": "purely_unbothered",
        "title": "Peak on Netflix?",
        "content": "What's the peak movie/series you've watched on Netflix? Till date it is breaking bad for me but want to explore more so drop your peak shows/movies/anime.",
        "upvotes": 9,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1qd8h57/peak_on_netflix/"
    },
    {
        "id": "1qdds0t",
        "author": "Wild-Display-765",
        "title": "Is Southland coming to NF?",
        "content": "I thought I saw a very fast shot of Ben McKenzie in a cop uniform and it disappeared. I looked through New on NF but didn’t see it.  Is this just wishful thinking on my part? Thanks. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qdds0t/is_southland_coming_to_nf/"
    },
    {
        "id": "1qd4avi",
        "author": "bludhavengabagool",
        "title": "Netflix is making a new show with Squid Game creator called The Dealer",
        "content": "\"[Netflix confirmed early this morning](https://www.hollywoodreporter.com/tv/tv-news/squid-game-hwang-dong-hyuk-netflix-the-deal-1236472053/) in South Korea that production is currently underway on The Dealer, the next original series produced by Squid Game creator Hwang Dong-hyuk. Hwang is producing the series, which has been described as a 'high-stakes casino crime drama,' but there is at least one element in the description that sets this new series apart from Hwang’s most well-known work.\n\nIn The Dealer, Geonhwa is a casino dealer who has to return to the shadowy world of illegal gambling after she falls victim to a scam and has to put her wedding plans on hold. However, to give her an edge at the tables, she 'is compelled to tap long-suppressed supernatural abilities,' which sounds like such a fun spin on the Squid Game formula of high-stakes tension and uneasy alliances with huge sums of money on the line.\" -full article [here](https://www.thepopverse.com/tv-squid-game-netflix-creator-next-project-the-dealer-supernatural-twist)",
        "upvotes": 11,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qd4avi/netflix_is_making_a_new_show_with_squid_game/"
    },
    {
        "id": "1qd4xnc",
        "author": "poppunkangel",
        "title": "His &amp; Hers. Where is the banana?",
        "content": "I’m only 7 minutes in and all I can think about so far is where the heck did this man’s banana go😭 He has it in his hand like 1/4 of the way eaten and then they’re pulling up to the crime scene (shot from behind as they’re pulling up shows his one hand driving but banana is nowhere to be seen any longer). \n\nHe gets out of the car and… NO BANANA? WHERE DID IT GO? Surely he didn’t eat it that fast. ",
        "upvotes": 8,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1qd4xnc/his_hers_where_is_the_banana/"
    },
    {
        "id": "1qcqwi7",
        "author": "Tricky-Anywhere5727",
        "title": "Why the hell can't we just see subtitles in all languages?",
        "content": "The \"select language\" section has no effect at all, that's no secret. Even after LITERALLY REMOVING GERMAN ENTIRELY from netflix, setting my phone to English and removing German from my phones keyboard, they still only give me German subtitles or none. I don't know what to do anymore, what even is the reason why they don't show us all the languages? Most movies don't have that many dubs and subs anyways, it can't be that hard to display ~20 languages. That's the least I expect from a multimillion dollar company that I am paying a rising fortune every year.\n\n\nGet your app in order, for fucks sake ",
        "upvotes": 41,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1qcqwi7/why_the_hell_cant_we_just_see_subtitles_in_all/"
    },
    {
        "id": "1qddfid",
        "author": "Paranoidgf88",
        "title": "Netflix looks so grainy ???",
        "content": "Before the comments say it’s my internet, every other service is showing perfect quality, but Netflix is so grainy / blurry. I’m watching on Samsung smart tv. Never had this issue before tonight, I’ve restarted the app &amp; the tv, what else can I do? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qddfid/netflix_looks_so_grainy/"
    },
    {
        "id": "1qdclf9",
        "author": "NaiveNeck984",
        "title": "HIS &amp; HERS",
        "content": "So... why exactly did Richard lead Anna to the lakehouse???? and Why exactly did Lexy try to kill Anna... if Lexy didn't kill any of the other girls? Was she literally just going to kill Anna and call it a day? The whole Mom twist ruined the entire thing. It opened a new fold without connecting all the other dots",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qdclf9/his_hers/"
    },
    {
        "id": "1qdbxfs",
        "author": "Few_Pipe_9933",
        "title": "Need a must watch movie",
        "content": "Looking to watch somthing before bed. Anybody have any must watch movies that have stuck with you? I prefer suspense kind of movies really love the work of Harlan coben. Not looking for a series ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qdbxfs/need_a_must_watch_movie/"
    },
    {
        "id": "1qde2pu",
        "author": "Kshiti_salman",
        "title": "Whenever I watch a web series (not anime) near sunlight, even at good brightness why i can't see it properly? Does sunlight affect the brightness ??",
        "content": "Just noticed, in anime it's bright colors so even at sunlight I can see the episode properly but in web series it just appears darker. I just wanted to know this",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qde2pu/whenever_i_watch_a_web_series_not_anime_near/"
    },
    {
        "id": "1qcnko1",
        "author": "Ordinary_Mango9815",
        "title": "Why do I do this to myself??",
        "content": "I started Mindhunter again because it’s one of my favorite shows to have ever been released on Netflix. I’m frustrated that it will never have the proper ending it deserves 😩😭😭😭\n\nJust wanted to rant about this!! Unsure why I am torturing myself by watching this over again but it’s a great show, with great acting and provides such an amazing depiction of the early days of criminal profiling. ",
        "upvotes": 29,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qcnko1/why_do_i_do_this_to_myself/"
    },
    {
        "id": "1qdbpok",
        "author": "lleonard88",
        "title": "Fear Street",
        "content": "I’ve heard about Fear Street and I’m interested in watching it, but I really don’t like spiritistic/demonic shows. I started the first episode and I keep hearing mention of a witch. Can anyone confirm without a spoiler if this show is demonic/spiritistic? I do appreciate when shows don’t take the easy out with spiritism/demons and do actual creative writing for thrillers.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qdbpok/fear_street/"
    },
    {
        "id": "1qcvnum",
        "author": "geologic-moose",
        "title": "Bridgerton S4 Netflix Tudum live stream BROKEN?",
        "content": "The Netflix Tudum live stream for the premier of Bridgerton Season 4 isn’t working? I’ve seen no announcement or comment from Netflix besides “We’ll Be Right Back” on the live stream page. \n\nSeems unprofessional to leave dedicated fans waiting with no knowledge of what’s going on with the event… thankfully I switched to YouTube to see cast interviews.\n\nWill we still get to see Episode 1 of Season 4? What about the special performance? So frustrating… at least tell us something!!",
        "upvotes": 8,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1qcvnum/bridgerton_s4_netflix_tudum_live_stream_broken/"
    },
    {
        "id": "1qdamsa",
        "author": "daretoeatapeach",
        "title": "What are the most quotable Netflix shows/movies worth rewatching?",
        "content": "I like to rewatch shows with Spanish subtitles or audio to help me practice my Spanish. I used to rewatch Marvelous Mrs. Maisel, but now that Amazon Prime video has ads on their own original shows I'm looking to Netflix. With Mrs. Maisel I had dozens of lines I had translated onto post-it notes, but Bridgerton not so much. \n\nI know Arrested Development has language support (both audio and subtitles in various languages) so that's on my list. All Netflix originals have good language support but which ones can you watch over and over? Which ones have you quoted to your friends? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qdamsa/what_are_the_most_quotable_netflix_showsmovies/"
    },
    {
        "id": "1qcliu6",
        "author": "Sweaty_Parfait8251",
        "title": "Dead To Me",
        "content": "I started watching Dead To Me on Netflix this week, and it wasn’t until episode two that I found myself saying, Okay, now we have a story… IYKYK. Still wondering though, is it worth continuing, or should I find a better show to binge?",
        "upvotes": 17,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1qcliu6/dead_to_me/"
    },
    {
        "id": "1qcpwxz",
        "author": "MissMystery11",
        "title": "The third season of Girl From Nowhere might have apparently yet sadly been canceled already. There is an unexpected reboot with a new actress instead.",
        "content": "8 years of our hopes is officially crushed. ",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qcpwxz/the_third_season_of_girl_from_nowhere_might_have/"
    },
    {
        "id": "1qbyn8g",
        "author": "rwaggoner",
        "title": "Can't watch Netflix at work on planning period since \"not in household\"",
        "content": "Well, I have never experienced this. I was aware of the household requirement in place for years, but I will watch shows at work for background noise during my planning/conference period at school using an Apple TV, which I use to share my computer screen to the projector. It now mandates I update my household to this location, which I won't do since it's not my home. It doesn't let me watch anything.\n\nThis is nuts. I get their concern with sharing, but there are better ways to verify identity, maybe using facial recognition or something similar. The concept that you can only ever use one IP address is ridiculous.\n\nAre there any workarounds? No option for a temporary code...\n\nI have done this for 5 years and never had a problem. No other apps have this issue.\n\nJust Netflix.\n\nIt's enough to make me consider cancellation.",
        "upvotes": 347,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1qbyn8g/cant_watch_netflix_at_work_on_planning_period/"
    },
    {
        "id": "1qd001z",
        "author": "Midnightlune_",
        "title": "Suggest some good series :)",
        "content": "Hey guys would you suggest me some series or movie like , \"Anne with an e\" or \"Enola homles,\" i really like those series and I'm looking for similar genre so please suggest some..",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qd001z/suggest_some_good_series/"
    },
    {
        "id": "1qdb2kt",
        "author": "Time_Plantain4033",
        "title": "Emily in Paris s5 is a clusterf!*k…let’s discuss (SPOILERS!!!)",
        "content": "Talk about a waste of time. I never thought watching this show would be EXHAUSTING! If they don’t get a new writer’s room and switch up the cast, I hope this is the end of this show…my favorite YT reactor often uses the phrase “they reheating their nachos,” and that about sums the entire season up. I could tell from the trailer there were certain things I wasn’t going to like, but I tend to think of EIP as a fun, lighthearted show that I don’t have to overly invest myself in. Now, it’s like I’m begging to be removed from the group chat.\n\n\nThings I strongly disliked(which I totally blame the writers for)\n1. Makes me feel like a prude, but I’m tired of seeing Sylvie in sheer clothing and sleeping with younger men. Mind you, I love the actress! Don’t know her age, but she’s lithe &amp; trim, and I love how she/her character seems to embrace her divine femininity. But it just feels like enough is enough, idk 🤷🏽‍♀️\n\n2. Love Lucien Laviscount, though I haven’t seen him in many things. Last season I felt like he was ill used. This season he gave me the absolute ick(for which I blame the writers.) Alfie as a character was kind of, idk hesitant about relationships, a little aloof, but serious about love. He deserved to be able to love someone fully and have that returned. In what world, would him &amp; Mindy even begin to make sense? They could have at least made the attraction/obsession plausible.\n\n3. I didn’t like whatever was going on with Gabriel’s hair. Looked like a toupee or something\n\n4. For the love of all that is holy, PLEASE let Emily be single. That girl hands out “I love you” like it’s a business card. Did she actually love any of her boyfriends to date? Does she even want to be in love? Contrary to the words spilling out of her mouth to poor Marcelo, she was not serious about him and she did not think he was the one 🙄 atp Mr Muratori dodged a bullet with her\n\n5. Why did they randomly throw Bryan Greenberg  in there? I’m convinced he’s dating somebody from the cast, and just so happened to be on set that day when they needed someone. Nothing else makes sense. LOVE Jake Jagielski btw\n\n6. Then we get to Mindy, who suddenly has serious feelings for Alfie 🙄 PLEASE! Wasn’t she just having lingering feelings for Benoit while in a relationship with Nico? Which is understandable since everyone on this show hops from one bed to the next without talking a second to I 🧼 their hoo ha. Now she’s sleeping with her friends ex behind her back, in her bed, and somehow it was on Emily to get over it 🫩 then, after she discards Alfie like dirty underwear (which at the time he didn’t deserve) she gets back with Nico, but allows Alfie to keep coming around being disrespectful to her relationship. Is this who her character always was &amp; I missed it?\n\n7. I also don’t like that that stepdaughter didn’t get a comeuppance for her snakelike behavior \n\n8. Lastly, Sylvia’s marriage. Was she working on it or not? Was she going to take it serious or not? Because her words and her actions never quite met up.\n\n9. I also think the DIVINE Minnie Driver was ill used, and most of her outfits looked a hot mess\n\n10. To me, the whole Rome excursion was pointless. They just wanted to give us new scenery\n\n\n\nThings I enjoyed!!!\n1. Marcelo Muratori\n\n2. Emily’s improved fashion, or maybe it was the show’s budget that improved. Well no, because Cami, Mindy, and Sylvie always had a good wardrobe. \n\n3. The bob 💁🏻‍♀️ Lily Collin’s looked like she had a short cut for a couple seasons now, but they were making her wear a hairpiece. LOVED the new look\n\n4. Julien &amp; Luc did not disappoint, though Julien had less sassy moments this season ☹️\n\n5. I liked all of Gabriel’s scenes, though they were few and far between. He was also looking pretty beefy 👀🥰 I may have seen him in a movie trailer or something, which would explain the choice of hair.\n\n6. I liked how Emily &amp; Sylvie’s relationship has grown. I especially loved Sylvie giving Emily her blessing &amp; encouragement to move on. That was beautiful\n\n7. It might be petty of me, but I feel like Sylvie’s financial troubles is deserved for participating in that farce of a marriage. What a mess. She should’ve divorced that man long ago. Sucks for her mother though. \n\n8. Mindy never fails to give good performance! She’s a 💫 \n\nOverall, I just don’t feel the show had enough to it to make people want to keep watching. I also think if they can’t bring anything new to the storyline, and keep recycling relationships/behaviors, they should just let the show go.\n",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1qdb2kt/emily_in_paris_s5_is_a_clusterfklets_discuss/"
    },
    {
        "id": "1qcw57o",
        "author": "yo-caesar",
        "title": "Is netflix down in India?",
        "content": "Unable to sign in on a android. Able to sign in on web, but unable to play any movie or show. Don't know what's wrong. Reinstalled the app too. Still no result.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qcw57o/is_netflix_down_in_india/"
    },
    {
        "id": "1qckcol",
        "author": "DuxxieDings",
        "title": "i hope netflix has more adult animation shows like arcane, wolf king and blue eye samurai in 2026",
        "content": "any news on 2026 shows or future shows like arcane, wolf king and blue eye samurai. i know theres s2 of blue eye, but i want more shit like wolf king, blue eye and arcane to look forward too. \n\nArcane and Wolf King finished up in 2 seasons. it seems like adult cartoons get 2 seasons at least. Blue Eye is a masterpiece and i cant wait for s2 but i hope its not the last because i like it and its the last good adult animation on netflix thats currently airing.",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qckcol/i_hope_netflix_has_more_adult_animation_shows/"
    },
    {
        "id": "1qd62vz",
        "author": "bimiki_",
        "title": "Boots é tão good vibes",
        "content": "Faz tempo que nao me divertia tanto vendo uma série, os personagens super engraçados, fiquei puta que vão cancelar.\nllllllllllllllllllllllllllllllllllllll",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qd62vz/boots_é_tão_good_vibes/"
    },
    {
        "id": "1qcud5l",
        "author": "Cal_PCGW",
        "title": "Looking for recs on short (half hour max) shows.",
        "content": "I'm looking for a short, tea time show - ideally 20-30 minute episodes. I'm UK-based and have Netflix but also iPlayer and Sky so I don't mind recs from those, but I don't have access to other services. Can be drama, comedy or animation.\n\nLoved (and recently finished) The Good Place. Currently finishing What We Do in the Shadows (iPlayer). Previously enjoyed Barry (Sky Comedy).\n\nAnimated shows I've seen: Cyberpunk Edgerunners (enjoyed - watched because I loved the game), Neon Genesis Evangelion (weird), Delicious in Dungeon (loved), the Terminator anime (forget the exact name - it wasn't bad), Cowboy Bebop (loved), Vinland Saga (liked the Viking stuff but the monologues and all the crying drove me up the bloody wall), Monster (didn't finish - liked the concept but lord it was slow), DanDanDan (puerile - quit after one episode), Scavenger's Reign (liked).\n\nFor the record, I am a nerd and a gamer, like sci-fi, fantasy, thrillers and basically anything imaginative. I am also a 58yo woman so I'm probably not going to enjoy anything aimed at kids and young adults.\n\nCheers.",
        "upvotes": 2,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1qcud5l/looking_for_recs_on_short_half_hour_max_shows/"
    },
    {
        "id": "1qdbjxz",
        "author": "Few_Pipe_9933",
        "title": "I finally decided to try to watch Behind her eyes. 0/10",
        "content": "I don’t understand the hype around it. I watched the first 3 episodes and i couldn’t continue. The production feels low quality as well. Would not recommend ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qdbjxz/i_finally_decided_to_try_to_watch_behind_her_eyes/"
    },
    {
        "id": "1qcvg3j",
        "author": "Stamina666",
        "title": "Resident Alien just removed?",
        "content": "I’m in NA and was watching Resident Alien and it cut off in the middle of the episode. Searched for it and now it’s just gone, where there any plans to actually remove it?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qcvg3j/resident_alien_just_removed/"
    },
    {
        "id": "1qc6dm7",
        "author": "Few_Pipe_9933",
        "title": "Any recommendations I enjoyed His&amp;Hers looking for similar movie/shows",
        "content": "Anything helps! I like movies/shows with plot twist or elements that make you feel like there’s something your missing. Also like suspense/thriller! Any recommendations?",
        "upvotes": 23,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1qc6dm7/any_recommendations_i_enjoyed_hishers_looking_for/"
    },
    {
        "id": "1qbbq72",
        "author": "Secretly_Wealthy90",
        "title": "11.22.63 IS SOOOO Good!!! highly recommended",
        "content": "how did i not know about this until now, 10 years later after it came out. Hulu did not do a good job at promoting it, Netflix put this at the top. \n\nall other streaming services should just shut down and license their content to Netflix IMO.\n\n\n\n",
        "upvotes": 1531,
        "comments": 405,
        "media": null,
        "permalink": "/r/netflix/comments/1qbbq72/112263_is_soooo_good_highly_recommended/"
    },
    {
        "id": "1qcvhgh",
        "author": "rasberrymateria",
        "title": "Ads on Monday Night Raw replay",
        "content": "Is anybody else getting ads now while watching replays? I just wanted to skip to the part I missed out on and now I'm seeing unskippable ads during it. I have the Premium plan and I wasn't seeing ads before while watching a replay. Is this happening to anybody else? I'm really bummed out by this now if this is permanent ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qcvhgh/ads_on_monday_night_raw_replay/"
    }
]