[
    {
        "id": "1if0swi",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1if0swi/la_piola_friends_meetup/"
    },
    {
        "id": "1if0swb",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1if0swb/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1iyi4np",
        "author": "Top-Text-7727",
        "title": "La gente non sa stare sui mezzi pubblici",
        "content": "Perché se i corridoi dei bus e dei tram sono liberi, non vi mettete li? Eppure ci sono anche le corde di appoggio.\n\nPoi perché vi mettete davanti la porta se non dovete scendere?\n\n\nScusate lo sfogo, torno al lavoro. Buon inizio giornata a tutti.",
        "upvotes": 12,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1iyi4np/la_gente_non_sa_stare_sui_mezzi_pubblici/"
    },
    {
        "id": "1iy8uf6",
        "author": "KeyTree687",
        "title": "Am so lost",
        "content": "Hello I am international student here , in Torino am trying to learn Italian but it’s so difficult for me. I am feeling so lost and sad about my professional life as am not able to find any job here in Italy. Does anyone have any leads ? Or some job that I can do ? Also some interesting things to do in Torino? Just feeling like am not doing anything lately and am a fun person I don’t want to turn into a boring person like this ",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1iy8uf6/am_so_lost/"
    },
    {
        "id": "1iy955w",
        "author": "Comfortable-Key4316",
        "title": "medico di base per fuorisede",
        "content": "ciao a tutti! sono una studentessa fuorisede al terzo anno, vorrei sapere se qualcuno di voi ha fatto il passaggio al medico di base qui a torino. mi hanno detto che é possibile scegliere il medico temporaneo per un anno previa rinuncia al medico di giù, cosa che ho fatto, ma ora non so come scegliere il nuovo qui. ho provato sul sito di Salute Piemonte ma non riesco perché mi da errore, forse perché non ho la residenza?\nqualcuno di voi lo ha fatto e può darmi una mano?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1iy955w/medico_di_base_per_fuorisede/"
    },
    {
        "id": "1iy2xjs",
        "author": "athousandpiece",
        "title": "locker bagagli porta nuova",
        "content": "qualcuno sa consigliarmi dove lasciare un bagaglio a mano in zona porta nuova che non chiuda presto? cercavo un 24/7 ma non riesco a trovarne uno, mi segna solo porti aperti fino alle 19/20",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1iy2xjs/locker_bagagli_porta_nuova/"
    },
    {
        "id": "1ixpmto",
        "author": "No-Bit-2036",
        "title": "Cenare sul tram. Buona idea o trappola pigliaturisti?",
        "content": "A Pasqua i miei genitori verranno a trovarmi a qui a Torino, perciò stavo pensando di fare qualcosa con loro. Ho scoperto che esiste \"cene in movimento\", dove praticamente si consuma il pranzo o la cena a bordo di un tram. Come vi è sembrata, se avete provato questa esperienza (a Torino o in altre città)? A me incuriosisce un pochino ma ho paura di beccare un inculata.",
        "upvotes": 23,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1ixpmto/cenare_sul_tram_buona_idea_o_trappola/"
    },
    {
        "id": "1iy9n59",
        "author": "Onwardsorupwards",
        "title": "Brief Visit!",
        "content": "Hi I'm briefly visiting turin and looking to go to a juventus game / get the most out of my trip! Let me know if any hidden gems or if you fancy grabbing a beer.\nBritish, Male, mid-20s",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1iy9n59/brief_visit/"
    },
    {
        "id": "1ixx23v",
        "author": "Repulsive-Yak-126",
        "title": "Electrician",
        "content": "Yesterday I posted in order to find an electrician in Torino. I was recommended one guy but he wasn't in town. I need another phone number, it's rly fucking cold at night in an uptown",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ixx23v/electrician/"
    },
    {
        "id": "1ix3sf3",
        "author": "AppropriateSelf8827",
        "title": "Cost of living in Torino",
        "content": "Hi guys! Sorry I don’t have any knowledge on Italian.\nI have a question for you\n\n\nToday I got a job offer in Torino which is 52k€/year. I am living in Germany my salary is around 4000€ after tax.\n\nHow this salary sounds for Torino? Does it worth to move from Germany to Italy? I mean job in Italy look more satisfying than job that I have in Germany right now. \n\nIs there a tax advantage for “newcommers” in Italy or is there anyone who recently relocated?\n\nI am thanking you in advance have a nice day!\n\n",
        "upvotes": 16,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1ix3sf3/cost_of_living_in_torino/"
    },
    {
        "id": "1ixdc5g",
        "author": "Repulsive-Yak-126",
        "title": "Electrician",
        "content": "Do u have phone numbers of any electricians in torino? My electricity just isn't working and I was eager to find some professional to fix it tomorrow morning ( 8-10 am) I live near the uptown.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ixdc5g/electrician/"
    },
    {
        "id": "1ixiiiw",
        "author": "lollosenzakappa",
        "title": "Dove sviluppare rullini fotografici?",
        "content": "Mi sono trasferito da poco a Torino e cerco un laboratorio che sviluppi rullini, possibilmente economico, veloce e con una buona qualità (a Bologna me li sviluppavano in giornata per 12€ a rullino, cerco qualcosa del genere). Avete suggerimenti? Grazie!",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ixiiiw/dove_sviluppare_rullini_fotografici/"
    },
    {
        "id": "1iwxnpt",
        "author": "allfearisgone",
        "title": "aiuto? Ho delle domande",
        "content": "Ciao a tutti, l'ho fatto ieri. Ho aspettato tutta la notte per il link e ancora nessun link mi è stato inviato. Cosa faccio? Sono americano. Non ho un PagoPA, perché non sono cittadino dell'UE. non è disponibile o possibile per me utilizzare questo, quindi non sono in grado di pagare immediatamente la tassa di iscrizione con esso, come la maggior parte. Ho mandato un'e-mail a UniTo, ma non ho risposto. Neanche io posso chiamarli, visto che sono negli Stati Uniti e chiamare è costoso. Tutto quello che voglio fare è pagare la tassa di 60 euro per inviare la mia domanda, ma il link non è ancora arrivato. c'è un'altra soluzione per pagare la tassa senza utilizzare PagoPA? grazie",
        "upvotes": 5,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g0aj7b3iw1le1.png?auto=webp&amp;s=6220a2a6932029868a37048a3e24c782e79b774b"
        },
        "permalink": "/r/torino/comments/1iwxnpt/aiuto_ho_delle_domande/"
    },
    {
        "id": "1ix00hb",
        "author": "evinru_de",
        "title": "Impossibile prenotare revisione veicolo alla Motorizzazione Civile",
        "content": "Ciao a tutti, dovrei fare la revisione della mia auto e vorrei provare il servizio presso la Motorizzazione Civile a Torino (se non dovessi riuscire, ovviamente mi rivolgerò ad un Centro Privato Autorizzato).\n\nSto provando a prenotare tramite il portale ( [https://www.ilportaledellautomobilista.it/arpr/spa/](https://www.ilportaledellautomobilista.it/arpr/spa/) ) ma non riesco a selezionare la pratica da aprire:\n\nhttps://preview.redd.it/srbwtmfip2le1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=190d162a72b3662a1909494b034f307889200efd\n\nAnche voi avere lo stesso problema?\n\nGrazie  \n",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ix00hb/impossibile_prenotare_revisione_veicolo_alla/"
    },
    {
        "id": "1iwvh3q",
        "author": "gwelloween",
        "title": "Tessera bip?",
        "content": "Ciao a tutti! \nStarò qui quasi due mesi e mi servirà la tessera bip abbonamenti under 26.\nCome posso farlo sulla stazione della metropolitana? Ci ho provato ieri ed era davvero confuso :( \nAiuto",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1iwvh3q/tessera_bip/"
    },
    {
        "id": "1iwhgxp",
        "author": "GD1AL",
        "title": "Mercato San Secondo",
        "content": "Ciao a tutti! Sto prendendo in considerazione un immobile che affaccia sul mercato di San Secondo, qualcuno sa dirmi come siano i livelli di rumore e più o meno a che ora iniziano a montare il tutto? Grazie!",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1iwhgxp/mercato_san_secondo/"
    },
    {
        "id": "1iwdsfo",
        "author": "Classic-Newspaper851",
        "title": "Consigli su ricerca lavoro",
        "content": "Ciao a tutti, sono un ragazzo con un forte senso di indipendenza e perciò sto parallelamente cercando un monolocale economico E un lavoro che pagarmi il suddetto affitto. Il problema risiede nel fatto che avendo una triennale in chimica, le offerte di lavoro che trovo sono tutte fuori torino. Mi piacerebbe fare controllo qualità. Vi chiedo se per caso sapete di qualche azienda non troppo fuori città dove cercano figure simili, o qualche azienda dove mi consigliate di fare un tentativo con candidatura spontanea. ",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1iwdsfo/consigli_su_ricerca_lavoro/"
    },
    {
        "id": "1iwutpz",
        "author": "jobolix2",
        "title": "Esiste davvero?",
        "content": "Sono un ragazzo di 14 anni e cerco qualcuna sulla mia età che ami il metal e i videogiochi.\nScrivetemi in privato se vorreste uscire con me",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1iwutpz/esiste_davvero/"
    },
    {
        "id": "1iw2e8a",
        "author": "tnndaboss1",
        "title": "What’s the meaning behind “VPN” and why is it spray painted everywhere?",
        "content": "Everywhere I go there’s “VPN” vandalized on the walls. What does it mean?",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1iw2e8a/whats_the_meaning_behind_vpn_and_why_is_it_spray/"
    },
    {
        "id": "1ivp5ih",
        "author": "InternationalLion444",
        "title": "Si",
        "content": "",
        "upvotes": 55,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lv6zsgi9fqke1.jpeg?auto=webp&amp;s=78f6f53870300ceb277784bba0da1303911d25c8"
        },
        "permalink": "/r/torino/comments/1ivp5ih/si/"
    },
    {
        "id": "1iw8wcx",
        "author": "Quick-Gas9009",
        "title": "Trasferirsi a Torino e trovare casa",
        "content": "Ciao, domanda probabilmente \"banale\" ma a fine marzo/inizio aprile vorrei spostarmi a Torino (al momento abito in Toscana).\nSto cercando lavoro già da qui ma mi rendo conto che sarebbe più semplice essere già sul luogo per venir presa in considerazione. \n\nLa mia domanda sorge qui, come posso muovermi per trovare una stanza senza risultare studente e in caso senza avere precedentemente lavoro?\n\nSto monitorando i vari gruppi Facebook ma ovviamente richiedono studenti o un contratto. Premetto che ho una \"buona\" somma di risparmi da parte e so che potrebbe in caso essere da garanzia.",
        "upvotes": 1,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1iw8wcx/trasferirsi_a_torino_e_trovare_casa/"
    },
    {
        "id": "1iw885s",
        "author": "LeviAckermoan",
        "title": "English/ Looking for an affordable and quality shoe repair shop",
        "content": "Buongiorno! I just recently moved to Torino so I don't know the local areas all too well, however I had a situation were the buttons that hold the lace of my shoe broke. Is there a shoe repair shop that is affordable and provides good service that you can recommend? \n\n  \nClarification- anything within the range of 10-20eu is what I am aiming to spend since I am on a tight budget.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1iw885s/english_looking_for_an_affordable_and_quality/"
    },
    {
        "id": "1ivgwch",
        "author": "CryingAlwaysCrying",
        "title": "Cosa sta succedendo?",
        "content": "Ciao a tutti, l’altro giorno siamo passati con un paio di amici lungo la strada per la Gran Madre, quella attualmente in lavori, e la situazione era impressionante: graffiti ovunque, strade devastate, edifici in rovina… un completo degrado.\n\nAddirittura, alcuni ragazzi stranieri hanno cercato di aggredire me e mia moglie.   \n  \nCome è possibile che una città come questa sia ridotta così?\n\nAllora, Io amo Torino, ma non è solo una mia impressione: il 99% dei muri è coperto di graffiti, c’è sporcizia ovunque, e per quanto paghiamo in tasse, questa situazione è semplicemente scandalosa.\n\n**Dov’è il sindaco? Dov’è la polizia? Qualcuno ha intenzione di fare qualcosa?** Mi chiedo persino se ci sia qualcosa che non viene riportato nelle notizie, o se l’amministrazione comunale sia minimamente interessata a risolvere il problema.   \n  \nP.S. Non iniziamo con “Stellantis,” “Fiat” o i soliti discorsi su come Torino fosse un tempo meravigliosa… non si tratta di nostalgia, si tratta di ora.",
        "upvotes": 59,
        "comments": 115,
        "media": null,
        "permalink": "/r/torino/comments/1ivgwch/cosa_sta_succedendo/"
    },
    {
        "id": "1iwilge",
        "author": "porcone01",
        "title": "Coppia cerca F",
        "content": "\nCiao a tutti! Siamo una coppia FM persiana/italiana di 27 e 23 anni. Cerchiamo una ragazza per la nostra prima esperienza a tre... aperti a tutto e molto kinky! \nScriveteci senza problemi!",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1iwilge/coppia_cerca_f/"
    },
    {
        "id": "1ivyfmq",
        "author": "The-Grado",
        "title": "Locali Reggae/Jungle",
        "content": "Ciao a tutti, conoscete dei locali o eventi ricorrenti in cui ascoltare musica reggae o jungle? \n\nPremetto che non ho la macchina, ma vanno bene anche nei dintorni di Torino se sono dei posti facilmente raggiungibili",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ivyfmq/locali_reggaejungle/"
    },
    {
        "id": "1ivuvq2",
        "author": "Electronic_Help_6054",
        "title": "Via Ravenna, com’è come zona?",
        "content": "Ciao a tutti. Mi sto trasferendo a Torino con la mia ragazza. Cosa pensate di via ravenna come zona? Ho sentito opinioni contrastanti al riguardo. Per una ragazza è sicuro? Grazie mille!",
        "upvotes": 2,
        "comments": 32,
        "media": null,
        "permalink": "/r/torino/comments/1ivuvq2/via_ravenna_comè_come_zona/"
    },
    {
        "id": "1ivhfc8",
        "author": "Less-Animator-4648",
        "title": "Qualcuno può aiutarmi a praticare l'italiano?",
        "content": "Sono una donna di 30 anni. Vivo a Torino. Sto imparando l'italiano. Vorrei trovare qualcuno con cui trascorrere del tempo di qualità e praticare l'italiano e magari fare amicizia. La mia lingua madre è il persiano e parlo fluentemente inglese. Posso aiutare quella persona a praticare l'inglese. ",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1ivhfc8/qualcuno_può_aiutarmi_a_praticare_litaliano/"
    },
    {
        "id": "1ivilf1",
        "author": "fabioamd87",
        "title": "Appassionati di ciclismo da divano ci sono?",
        "content": "Ciao a tutti,\n\nqualcuno di voi segue il ciclismo? Sapete se ci sono dei locali che trasmettono le classiche monumento?\n\nCi si potrebbe organizzare per guardarle insieme.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ivilf1/appassionati_di_ciclismo_da_divano_ci_sono/"
    },
    {
        "id": "1iveau2",
        "author": "Ok_Entrepreneur7127",
        "title": "Infissi indecenti",
        "content": "Buongiorno, sono qui per chiedervi un consiglio. Mi sono trasferito a settembre qui a Torino, tutto meraviglioso ma una cosa che mi manda letteralmente fuori di testa sono gli infissi.\n\nNon è cristo possibile che io la mattina pur essendo al secondo piano senta completamente tutto fuori, voci, camion, ambulanze… tutto come se fossero praticamente con me in camera. Questo quindi mi rende impossibile dormire negli unici due giorni in cui lo posso fare, sabato e domenica.\n\n\nNon riesco a trovare una soluzione, stavo cercando per dei pannelli fonoassorbenti da applicare alla porta finestra ma dopo non entrerebbe più la luce.\n\n\nQualcuno che ha ideato una soluzione che non implichi lo smontaggio e buchi di qualcosa visto che sono in affitto?",
        "upvotes": 6,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1iveau2/infissi_indecenti/"
    },
    {
        "id": "1ivnx0n",
        "author": "Erleyx",
        "title": "Looking for a gym",
        "content": "Hey guys, i just moved out here near Nichelino and I'm looking for a gym, preferably a gym that does monthly subscriptions, any help is appreciated. Grazie",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ivnx0n/looking_for_a_gym/"
    },
    {
        "id": "1ivfhl0",
        "author": "Sunstealer85",
        "title": "Renting in Torino from overseas",
        "content": "Ciao a tutti, my family and I are moving to Torino for about a year in August. We are looking to rent a house/apartment in the North West of the city. \nStill a bit of time but we are looking for a contact or recommendation for a real estate that can assist us whilst we are still overseas. \n\nI know there's another sub for looking for apartments but we need a contact for organising things before we get there. \n\nLooking around Vallette and Lucento. \n\nGrazie mille",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ivfhl0/renting_in_torino_from_overseas/"
    },
    {
        "id": "1ivew1j",
        "author": "TZ12a",
        "title": "Francesi a Torino",
        "content": "C'è qualcuno che parla/studia francese a Torino centro?",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1ivew1j/francesi_a_torino/"
    }
]