[
    {
        "id": "1icviop",
        "author": "Eudmovie",
        "title": "Hey r/movies! We are Harrison Xu and Ivan Leung, the director/writer/producers/stars of EXTREMELY UNIQUE DYNAMIC and the idiots behind the keyboard of Winnie-the-Pooh: Blood and Honey. AMA!",
        "content": "",
        "upvotes": 7,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/v3a8r14ndwfe1.png?auto=webp&amp;s=24bb685e8ab2cbf92ac14035888932becf6b3a00"
        },
        "permalink": "/r/movies/comments/1icviop/hey_rmovies_we_are_harrison_xu_and_ivan_leung_the/"
    },
    {
        "id": "1id8vew",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement: Matt Walsh - Comedian &amp; Actor - Friday 1/31 at 4:00 PM ET - Veep, Road Trip, Bad Santa, Role Models, The Hangover, The Do-Over, The Daily Show, Upright Citizens Brigade.",
        "content": "",
        "upvotes": 181,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0jnu8f11w0ge1.png?auto=webp&amp;s=ba7063b98a17b6ccc91cb4eafc56e269b26f496a"
        },
        "permalink": "/r/movies/comments/1id8vew/amaqa_announcement_matt_walsh_comedian_actor/"
    },
    {
        "id": "1id2zgs",
        "author": "Bullingdon1973",
        "title": "‘You Have to Keep Proving That You Exist’: An interview with 97-year-old Michael Roemer, who fled the Nazis as a child, landed at Harvard, and became one of America's first independent filmmakers. His movies were all initially neglected or unreleased, and have only recently begun to be rediscovered.",
        "content": "",
        "upvotes": 7807,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/r7ilL0UZICDbv5hGb-MF5OUYCkCzt5U8v5FxEOQYDpw.jpg?auto=webp&amp;s=e015a052995b699933e242ce8a8ed1487a510f62"
        },
        "permalink": "/r/movies/comments/1id2zgs/you_have_to_keep_proving_that_you_exist_an/"
    },
    {
        "id": "1icsd4p",
        "author": "BiscottiPatient824",
        "title": "Movies that are peaceful with almost no tension",
        "content": "Hello\nI'm pretty stressed lately and I'm looking for movies that are, in all aspects, calm and peaceful. It's okay if its a little sad or bittersweet or even funny—but I'm looking for something with almost no tension.\n\nMost movies, even really calm ones like howl's moving castle, have an act with a lot of tension and fighting, i'm looking for a movie without that. The first examples I come up with are where is marnie, which has beautiful scenery but is essentially devoided of big tension acts—and it's still great. Another example is lady bird, which even though had some tension with the mom plot, is pretty easy and not stressful to watch. For a show counterpart i'd say adventure time, midnight ghospel, gumball or hilda, since they are mostly quacky adventures that get resolved easily (I've watched those like a 100times though so thats why im looking now xD)\nIf you have ideas for series/shows too im up to it!\nI hope yall have some good ideas! Have a beautiful day everyone!\n\n\nEdit: Wow so many answers! I didnt expect it im so thankful for all I've received so far but I might not be able to answer to everything 😅. I'll watch them over the next few days. Thanks again!",
        "upvotes": 10786,
        "comments": 6496,
        "media": null,
        "permalink": "/r/movies/comments/1icsd4p/movies_that_are_peaceful_with_almost_no_tension/"
    },
    {
        "id": "1id0n6n",
        "author": "MarvelsGrantMan136",
        "title": "Jake Gyllenhaal To Star In New Original Film From M. Night Shyamalan And Nicholas Sparks",
        "content": "",
        "upvotes": 2283,
        "comments": 433,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0sESUNGuVTjMxAf3DTls-L2Qqu2LQyIQKjvjtUK-cGY.jpg?auto=webp&amp;s=180cdafb7a84a84565e8ede8ac233fa66568af00"
        },
        "permalink": "/r/movies/comments/1id0n6n/jake_gyllenhaal_to_star_in_new_original_film_from/"
    },
    {
        "id": "1id3kcc",
        "author": "MarvelsGrantMan136",
        "title": "Benny Safdie Reuniting with Christopher Nolan for ‘The Odyssey’",
        "content": "",
        "upvotes": 1355,
        "comments": 177,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Vx3Ynv52KCv3O0yC8W84h71qBcsnfQklDebh7YZ5Tsw.jpg?auto=webp&amp;s=400faa88809ea68f46ea9efa558d841ad12c031a"
        },
        "permalink": "/r/movies/comments/1id3kcc/benny_safdie_reuniting_with_christopher_nolan_for/"
    },
    {
        "id": "1id4uhq",
        "author": "LunchyPete",
        "title": "Romy and Michele’s High School Reunion Sequel Is a Go at 20th Century",
        "content": "",
        "upvotes": 934,
        "comments": 129,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LEw-KaFr86Ulg454C5hbaLkh38uNH4nUpfb-rX3MLmQ.jpg?auto=webp&amp;s=3539e989063ba56588c3ae415b010bbb2398f27d"
        },
        "permalink": "/r/movies/comments/1id4uhq/romy_and_micheles_high_school_reunion_sequel_is_a/"
    },
    {
        "id": "1id2b4y",
        "author": "Davis_Crawfish",
        "title": "Rebecca DeMornay was something special back in the 90s. Why do you think her career didn't turn out as well as expected?",
        "content": "I was obsessed with The Hand That Rocks the Cradle, the character of Peyton fascinated me so much, a psychopath bent on revenge after she feels her life was ruined after her husband kills himself over being outed by one of his patients as an sexual abuser. Hs death causes her to lose her baby and after she finds out who outed her husband to the cops, she poses as a babysitter to the woman who's given birth and needs a nanny. DeMornay's Icy Blonde look and cold expressions switching from a sunshine smile to a menacing foul-mouthed threat, she's just perfect in this movie. \n\nI am disappointed she never got a part as good as this one. I saw her in Feds, unrecognizable in Runaway Train, moving in Testament, a brief but warm presence in The Trip to Bountiful, she was my favorite version of Milady De Winter in \"The Three Musketeers\" (I haven't seen Eva Green's take, though). \n\nShe was also the original choice for Tinkerbell in Steven Spielberg's Hook and I can't help but think she probably would have been a more faithful and intriguing choice than Julia Roberts' boyish turn. Girlfriend looked more like one of the Lost Boys than an actual fairy.",
        "upvotes": 387,
        "comments": 256,
        "media": null,
        "permalink": "/r/movies/comments/1id2b4y/rebecca_demornay_was_something_special_back_in/"
    },
    {
        "id": "1id7o9u",
        "author": "These_Feed_2616",
        "title": "Nicholas Hoult",
        "content": "I discovered him fairly recently but I’m glad at how big his career is becoming, he was in Clint Eastwood’s Juror 2 and Nosferatu in 2024, which he was great in both, and he was also in big films in recent years such as The Menu, and Renfield, and now, he is going to be playing Lex Luthor in Superman 2025, he is a really likeable guy and a great actor, I’m happy to see his career really taking off in recent years!",
        "upvotes": 171,
        "comments": 121,
        "media": null,
        "permalink": "/r/movies/comments/1id7o9u/nicholas_hoult/"
    },
    {
        "id": "1idg6sp",
        "author": "Nearby_Court_3730",
        "title": "What DVD movie has the best special feature that you can't see on streaming services?",
        "content": "I do feel like the obvious answer has to be Lord of the Rings: Extended Edition DVD special features, but when I think back I can't remember a time I wouldn't bring up the Shrek DVD special features either. Clerks special edition had a lot of cool extra content and feature too, pretty much any Kevin Smith project had great feautres. I would say anything with Kevin Smith, PTA, Wes Anderson, Tarantino, and Cohen Brothers I was always super into.\n\nGrowing up I would take an 8th of shrooms and bring 3 DVDs up to my room and just have a marathon while I couldn't sleep. \"Lord of the Rings: The Two Towers\" was always a go-to for me, \"Life Aquatic with Steve Zisou\" was an amazing film that I liked a lot more on rewatch (definitely recommend an 8th to get very detail oriented for themes and even fun easter eggs), and usually a fight between \"Kung Pow:Enter the Fist\" if I wanted to just laugh my ass off, or \"O' Brother Where Art Thou\" if I really wanted to take my brain away and enjoy a masterpiece. \n\nIs there one in particular that comes to mind? It doesn't need to be pigeon-holed to just a movie I guess, DVDs for shows have great special features as well. \n\nThank you for commenting and keeping things respectful! ",
        "upvotes": 47,
        "comments": 128,
        "media": null,
        "permalink": "/r/movies/comments/1idg6sp/what_dvd_movie_has_the_best_special_feature_that/"
    },
    {
        "id": "1idbqpl",
        "author": "BunyipPouch",
        "title": "Darren Aronofsky's Crime-Thriller ‘Caught Stealing’ (Starring Austin Butler &amp; Zoë Kravitz) Gets August 29 Release Date, ‘Insidious 6’ Delayed to 2026",
        "content": "",
        "upvotes": 75,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HXjMSCGAE4FRW0zwVELC1Lj6Hh1k1tMPZAhPhwKr6TA.jpg?auto=webp&amp;s=00a900861e667bff1f53e6279ff78d53404c4a11"
        },
        "permalink": "/r/movies/comments/1idbqpl/darren_aronofskys_crimethriller_caught_stealing/"
    },
    {
        "id": "1id167a",
        "author": "Sufficient_Muscle670",
        "title": "The March of the Dead in J'Accuse(1919). Many of the actors portraying risen French soldiers were real soldiers who died before the end of the war.",
        "content": "",
        "upvotes": 260,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/k-vylZEb_k0SNorm3MQSS_siEUPmT1PA44zc2vLFplo.jpg?auto=webp&amp;s=b8e3ed2730b4733c547fae82145df6972ac0fc0a"
        },
        "permalink": "/r/movies/comments/1id167a/the_march_of_the_dead_in_jaccuse1919_many_of_the/"
    },
    {
        "id": "1id29j2",
        "author": "WaterMargin108",
        "title": "Johnnie To Will Direct Tony Leung in Gangster Feature Eyeing 2027 Release",
        "content": "",
        "upvotes": 217,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uFADGUm0UFYmuDtoH-fIj6tcR7WpRSsnwpqNXgFUwVM.jpg?auto=webp&amp;s=47c57c779fd64a4e9be94f40e0ff36d4da7203fc"
        },
        "permalink": "/r/movies/comments/1id29j2/johnnie_to_will_direct_tony_leung_in_gangster/"
    },
    {
        "id": "1ictbnx",
        "author": "SafeBodybuilder7191",
        "title": "The Sundance Film Festival failed to heat up, with few deals even for titles like Jennifer Lopez's \"Kiss of the Spider Woman\" and the acclaimed \"Twinless.\"",
        "content": "",
        "upvotes": 650,
        "comments": 194,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aQMDaz4VAlPLQWfrjAk72cdVN__md3DLxzy_V_Uza-A.jpg?auto=webp&amp;s=35862db8d0b3ab4a7fb90eb51736bd1a27fe537c"
        },
        "permalink": "/r/movies/comments/1ictbnx/the_sundance_film_festival_failed_to_heat_up_with/"
    },
    {
        "id": "1icvigf",
        "author": "Lionel_Hislop",
        "title": "How did such a bad actor like Steven Seagal made so many popular action movies in the 90s?",
        "content": "Under Siege 1 and 2, Hard to Kill, Exit Wounds, The Glimmer Man, On Deadly Ground (this one works best as a comedy and Michael Caine is highlarious as a bitchy evil businessman, Mr Burns meets Alfie), the other one which was about the Environment and had Marg Helgenberger. \n\nSeagal never changed his expressions, he was always filmed from the waist up when he got too fat and the fight scenes were often over the top in their violence. \n\nSeagal's characters weren't even likable, they always came off as ice cold psychos who just so happened to be on the good side. If you ever watched the Mad TV parodies, they only exaggerated a tiny bit. \n\nThank god for Tommy Lee Jones and Gary Busey in Under Sieger who were so crazy they managed to make Seagal seem subtle by comparison. And Kelly LeBrock had Daffy Duck lips while playing a medical surgeon (laugh!!!). \n\nHis movies were SOOOOOOOOOOO dumb!!!!!",
        "upvotes": 362,
        "comments": 579,
        "media": null,
        "permalink": "/r/movies/comments/1icvigf/how_did_such_a_bad_actor_like_steven_seagal_made/"
    },
    {
        "id": "1icw2qo",
        "author": "indiewire",
        "title": "'Virtuosity' New 4K Restoration Shows Influence on 'The Matrix'",
        "content": "",
        "upvotes": 335,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/h3AJFuhXeubzqrl9Y-jCX85RRLmyxe92m8BncoQRXzs.jpg?auto=webp&amp;s=ed5e286778db4ff4b1de83d884290ad2433dd9d5"
        },
        "permalink": "/r/movies/comments/1icw2qo/virtuosity_new_4k_restoration_shows_influence_on/"
    },
    {
        "id": "1icuo16",
        "author": "KillerCroc1234567",
        "title": "Body Horror Film ‘Together’ Lands at NEON",
        "content": "",
        "upvotes": 268,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/C5g_weUkVqEWU8RGwoZ6CmmZEDMiw13n1_euUzSCfXc.jpg?auto=webp&amp;s=5ce4c4e9590ffde065ed5c5c275bdb56b20484a1"
        },
        "permalink": "/r/movies/comments/1icuo16/body_horror_film_together_lands_at_neon/"
    },
    {
        "id": "1idil6j",
        "author": "MrExist777",
        "title": "Is The Usual Suspects still worth watching even if it’s been spoiled for me?",
        "content": "I heard that one of the main draws for The Usual Suspects was its main twist/twist character. Without realizing it, though, I had the twist spoiled for me from watching other shows make jokes about the twist (I think Bojack Horseman made a reference to the fact that Kevin Spacey is Kaiser Soze [or however you spell it]). So, even with this knowledge, is it still worth watching? Will there still be some kind of impact after gaining the full context?",
        "upvotes": 7,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1idil6j/is_the_usual_suspects_still_worth_watching_even/"
    },
    {
        "id": "1icvcmd",
        "author": "Inside-Range9647",
        "title": "Finally saw Apocalypse Now last night",
        "content": "The horror.... First time watch. All I can really say, is that I didn't know what I expected, but if there were any kind of expectations, they were blown out of the water. It was more psychedelic than I expected but I was all here for it. I thought it was fantastic and I threw it in my top 4 on letterboxd for now. Should I watch the redux cut at some point? I don't know the general consensus on if its worth it or not.",
        "upvotes": 151,
        "comments": 116,
        "media": null,
        "permalink": "/r/movies/comments/1icvcmd/finally_saw_apocalypse_now_last_night/"
    },
    {
        "id": "1id746h",
        "author": "Low-Way557",
        "title": "From Kingslayer to Delta Force: Nikolaj Coster-Waldau on Training with Special Forces for Black Hawk Down",
        "content": "",
        "upvotes": 32,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/J7k8UdKQf74l9qa_X3Lg9rPKZAjGtHoqRqrYLIX071k.jpg?auto=webp&amp;s=f811a246c94d8093a4c0ded35f235558e19562f5"
        },
        "permalink": "/r/movies/comments/1id746h/from_kingslayer_to_delta_force_nikolaj/"
    },
    {
        "id": "1icmfdi",
        "author": "EggsyBenedict",
        "title": "What makes some actors look \"period\" or \"modern\"?",
        "content": "The other day I read someone saying that Ben Affleck has \"a face that knows about emails\", which I though was hilariously apt. He was excellent in The Last Duel, but I definitely feel his look doesn't lend to roles in period films. \n\nOn the other end of the spectrum, actors like Tobias Menzies and Mark Rylance seem to blend into period settings more than contemporary ones. \n\nThis makes me wonder, what makes some actors look more \"period\" than others? I think super neat dental veneers and plastic surgeries play a role here (for example, Nicole Kidman in The Northman looked distinctly modern), but I don't think that's the full answer. What are your thoughts? ",
        "upvotes": 717,
        "comments": 253,
        "media": null,
        "permalink": "/r/movies/comments/1icmfdi/what_makes_some_actors_look_period_or_modern/"
    },
    {
        "id": "1icjxk8",
        "author": "Aqueraventus",
        "title": "What do you think was the most snubbed non-nominee for the Oscar’s ever?",
        "content": "Personally for me it was Hereditary.\n\nToni Collette delivered one of the most Oscar worthy performances I have ever seen, all of the actors were fantastic, the music, the direction, the symbolism, it all worked in perfect harmony to create one of the best movies ever made.\n\nBut also horror movies are traditionally overlooked and snubbed at the academy awards.\n\nWhat would some of your picks be? ",
        "upvotes": 970,
        "comments": 802,
        "media": null,
        "permalink": "/r/movies/comments/1icjxk8/what_do_you_think_was_the_most_snubbed_nonnominee/"
    },
    {
        "id": "1id2024",
        "author": "rekemball",
        "title": "Another Meaning of “A Real Pain.”",
        "content": "I just want to put this out there, because I haven’t seen it discussed anywhere and want to see what people think. Benji represents David’s repressed pain in this movie. Literally, his pain made real. It’s been a while since I’ve seen it, so I can’t remember every detail but I’m going to do my best to make my case.  \n\n\nWhen they were younger, David was a boy would cry at everything, and the two characters were constantly together, but as David grew older, he left his pain (Benji) behind in order to create a life for himself. David never goes to visit his cousin, and although he’s open to short visits from Benji in NYC, it is one thing to allow yourself to feel bits and pieces of your trauma as though it’s a visitor in your home, it isnt the same as fully engaging with it on its own terms. When their grandmother dies, David arrives at the airport and finds his cousin waiting for him. They go to Poland and, as David sees the horrors that his people went through, he reconnects with his repressed pain (Benji). Benji, literally an emotion in human form, is difficult to deal with for the tour group, embarrassing to David, who constantly tries to tamp him down, but ultimately binds the group together through their shared experience of him. David becomes a fuller version of himself for having embraced that part of his identity, and when they return home, he offers to come see Benji, who refuses the offer. The lesson is that once you open yourself up to your trauma, it loses much of its power and urgency. Benji sits back down in the airport where he started, waiting for the next time David needs him.\n\nAlso significant, but couldn’t find a place for it here: Benji lived with their grandmother until her death, a woman who, as a Holocaust survivor, could never have lived without the pain of that experience.\n\n",
        "upvotes": 46,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1id2024/another_meaning_of_a_real_pain/"
    },
    {
        "id": "1icw10w",
        "author": "JonnyBunning",
        "title": "Riff Raff trailer - crime-comedy with Jennifer Coolidge",
        "content": "",
        "upvotes": 84,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CK8EviC2ZgLGSts3iB6Yx_SF2mEb1zMfy96QBbpSGks.jpg?auto=webp&amp;s=dd68c2e1ef2fce820b74b10e37b9ba1f7d7cb425"
        },
        "permalink": "/r/movies/comments/1icw10w/riff_raff_trailer_crimecomedy_with_jennifer/"
    },
    {
        "id": "1ic5vtg",
        "author": "NoYoureACatLady",
        "title": "In the Jumanji universe, it's entirely possible that if you die in the game, you're simply returned to reality unharmed and escape. We never find out because all characters assume that you die IRL if you die in the game.",
        "content": "In the Jumanji universe, it's entirely possible that if you die in the game, you're simply returned to reality unharmed and escape. We never find out because all characters assume that you die IRL if you die in the game.\n\nIt's funny to think that in the reboot movies, they could possibly have escaped the game in a few seconds by simply dying a few times. Of course the original movie required going through the entire gameplay sequence but it's still possible that dying wouldn't have killed you in real life.",
        "upvotes": 5134,
        "comments": 407,
        "media": null,
        "permalink": "/r/movies/comments/1ic5vtg/in_the_jumanji_universe_its_entirely_possible/"
    },
    {
        "id": "1icdqgg",
        "author": "soalone34",
        "title": "‘No Other Land’ receives Best Documentary Oscar nomination despite no U.S. distribution deal",
        "content": "",
        "upvotes": 1701,
        "comments": 96,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/be7E0Dx5evEzFbtwaOC2_966xrb2hviV_QmnAmf2l_U.jpg?auto=webp&amp;s=08f62270c15a8351ff99b6951e6e879c4ee87019"
        },
        "permalink": "/r/movies/comments/1icdqgg/no_other_land_receives_best_documentary_oscar/"
    },
    {
        "id": "1idih5e",
        "author": "geeseherder0",
        "title": "Big Night",
        "content": "Saw Big Night tonight at the New Beverly Cinema.  I had forgotten just how great this movie is. The writing, directing, cast, production design, cinematography. It’s all there, and all are strong. Plus the mood that Campbell Scott and Stanley Tucci put together, it’s just a great work of filmmaking.  One of the few movies without a happy ending that is better off.  The other half of the double feature was Tampopo, another fab film itself.  All in all, a great night at the theater.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1idih5e/big_night/"
    },
    {
        "id": "1id0j9s",
        "author": "KillerCroc1234567",
        "title": "Eddie Murphy To Star As Former Superspy In ‘Blue Falcon’ As Sony Acquires Chad St. John Script",
        "content": "",
        "upvotes": 44,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TVQwsY1Aj8vG3gEjf9U4_WJfczUCzW5dsU_-U7icuq0.jpg?auto=webp&amp;s=be8809e9da3f781cac04a55325a1a809e6d52c32"
        },
        "permalink": "/r/movies/comments/1id0j9s/eddie_murphy_to_star_as_former_superspy_in_blue/"
    },
    {
        "id": "1id01u6",
        "author": "LoneWolfIndia",
        "title": "50 Years of One Flew Over the Cuckoo's Nest, a bitter sweet tale set in the backdrop of a lunatic asylum, that to date remains one of my personal favorites.",
        "content": "https://preview.redd.it/4tqtvotswyfe1.png?width=201&amp;format=png&amp;auto=webp&amp;s=f6468c0f9369eb3a90cd3e4b1163a3fa353b8ebb\n\nBased on a novel by Ken Kesey,  it  was first  dramatized by  Broadway in 1963   with Kirk Douglas starring in lead role.  He also bought the movie rights,  however  none of  the studios  were interested  in the subject,  as they felt it did not have much commercial value.  Later on  Kirk’s  son,  Michael Douglas  co produced the movie along with Saul Zentz.\n\nMilos Forman, had made a reputation for himself in his native Czechoslovakia,  with  many Czech movies,  and  after the aborted  Prague Spring  of  1968,  he fled to US.  \n\nhttps://preview.redd.it/hmdg7g57xyfe1.png?width=1024&amp;format=png&amp;auto=webp&amp;s=727cc1f9178a9671093f9d2d715b99804daf5789\n\n**Randle McMurphy( Jack Nicholson),** a convict is admitted to a mental asylum in Oregon, run by a stern, dicatorial matron **Nurse Ratched( Louise McFletcher).** The prison authorities feel that Murphy feigned insanity to escape from prison. \n\nhttps://preview.redd.it/cxwplh13yyfe1.png?width=2048&amp;format=png&amp;auto=webp&amp;s=93f0286b1bfd94a3582ed22763fe585c019f80d7\n\nHowever for Murphy, its more a case of frying pan into the fire, Nurse Ratched, is a control freak, who loves to dominate and emasculate the patients, making them feel worthless. And that sets the conflict between the rebellious Murphy and Nurse Ratched, the former aiming to brighten the otherwise depressing atmosphere of the asylum, while the latter tries everything to establish her authority.\n\nInto this conflict, are thrown a motley bunch of characters\n\n**Chief Bromden, aka Broom( Will Sampson**)- Deaf and dumb, with an imposing physique.\n\nhttps://preview.redd.it/76q6z15nyyfe1.png?width=2560&amp;format=png&amp;auto=webp&amp;s=4ee71b376e68568687758f675a836fec5bdfa0cf\n\n**Billy  Bibbit( Brad Dourif)**– a shy, stuttering individual, affected by his mother's domineering nature.\n\nhttps://preview.redd.it/tmjuby8syyfe1.png?width=1024&amp;format=png&amp;auto=webp&amp;s=99dcdd38da3f66d1aa9da34fbc72e3b7a1b1d00f\n\n**Dale Harding( William Redfield)**\\- Soft spoken intellectual, who has been affected by his wife's adultery.\n\nhttps://preview.redd.it/4qo6aekyyyfe1.png?width=200&amp;format=png&amp;auto=webp&amp;s=c0cb88be465efd6e499b50dabcea87762ae48cde\n\n**Charlie Cheswick( Sydney Lassik)**– a  neurotic  with no self  confidence\n\nhttps://preview.redd.it/90ui7nk2zyfe1.png?width=560&amp;format=png&amp;auto=webp&amp;s=b7722cd74d0105c5a9b4c673cf36ed4f46835d3d\n\n**Martini( Danny De Vito**) -Utterly immature\n\nhttps://preview.redd.it/2ckfk7y6zyfe1.png?width=640&amp;format=png&amp;auto=webp&amp;s=3208cf72baf86e8ceb2def41e3be411fe136eef3\n\nAnd **Taber( Christopher Lloyd)**, the trouble maker.\n\nhttps://preview.redd.it/g3aphbmczyfe1.png?width=736&amp;format=png&amp;auto=webp&amp;s=de796e2c13c64862aaf7689ce72403d8a70ff0e1\n\nThe movie delves into the age old conflict of a rebellious individual vs an oppresive system, as both Murphy and Ratched try to establish their authority.  Murphy prides in his rebellious nature, in his own words.\n\n*I’m a god-damn marvel of modern science*\n\nOne of my favorite scenes is when Murphy requests Ratched for a small change in the schedule, so that the inmates can watch opener  of   the  1963 World  Series, saying a little change never hurts. To which she retorts.\n\n *Some men on the ward take a long, long time to get used to the schedule. Change it now and they might find it very disturbing*.\n\nAnd that is when she calls for a poll, however when Murphy gets 9 members to support him, she immediately changes rules saying he needs support  of  at least  18 members.\n\nhttps://preview.redd.it/0063iwjq0zfe1.png?width=400&amp;format=png&amp;auto=webp&amp;s=f509f0b4edb31dff56423b09359e91936272fcb5\n\nBut then Murphy recreates the entire World Series game, play by play, using inventive techniques, in one memorable scene. Another superb scene is when he sneaks out the inmates on a fishing trip, and then introduces them as doctors.\n\n*This is Dr. Cheswick, Dr. Taber, Dr. Frederickson, Dr. Scanlon, the famous Dr. Scanlon, Mr. Harding, Dr. Bibbit, Dr. Martini, and Dr. Sefelt (William Duell)…Oh, I’m Dr. McMurphy, R. P. McMurphy.*\n\nThe movie is kind of a bitter sweet experience, with some delightfully comic scenes like these, and the really disturbing ones later on. Forman balances the pathos with the comic superbly, and when you see the ending, it just hits you so hard.\n\nThis is the kind of role that is right up Jack's alley, and he just digs into it with relish, that scene where he recreates the World Series with his expression is pure gold, and he deserved the Oscar.\n\nAs did Louis Fletcher as Nurse Ratched, conveying cold menace with her expressions, you just end up detesting her, no wonder she was among the top villians in movie history.\n\nApart from these two the supporting cast is equally brilliant too, especially Brad Dourif as Billy in his debut movie, who is brutally exploited by Ratched.  All the other inmates do a faboulous job especially Will Sampson, Danny De Vito and Christopher Lloyd.\n\nThis was one of the few movies that won all the Big 5 Oscars- Picture, Director, Actor, Actress and Screenplay, and it deserved all.\n\n",
        "upvotes": 41,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1id01u6/50_years_of_one_flew_over_the_cuckoos_nest_a/"
    },
    {
        "id": "1icruo0",
        "author": "verissimoallan",
        "title": "France’s Cesar Awards Nominations: ‘The Count of Monte Cristo,’ ‘Beating Hearts,’ ‘Emilia Perez’  Lead the Race",
        "content": "",
        "upvotes": 107,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8MuD2MnKwVKUVhF5cXyGvbF0pv0f0D9mYtb-HoTQpDQ.jpg?auto=webp&amp;s=770b11da8a3c7c27d081802f4abea0319758fdb0"
        },
        "permalink": "/r/movies/comments/1icruo0/frances_cesar_awards_nominations_the_count_of/"
    },
    {
        "id": "1icx3x1",
        "author": "NoCulture3505",
        "title": "Prime Video, Lionsgate Sign Multiyear Theatrical Movie Deal",
        "content": "",
        "upvotes": 44,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZT8Fn84juDFH9_gWOTRy9ZXU4TGdwJvaHhz_w3y8sRk.jpg?auto=webp&amp;s=4325ff2e67fa979ba753453bdf081031e912883e"
        },
        "permalink": "/r/movies/comments/1icx3x1/prime_video_lionsgate_sign_multiyear_theatrical/"
    },
    {
        "id": "1idabul",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement: Alexi Pappas - Director, Actress, Screenwriter, and Former Olympian - Friday 1/31 at 3:00 PM ET - Her new film, Not An Artist, is out this week. She's previously written Olympic Dreams and co-directed Tracktown.",
        "content": "",
        "upvotes": 9,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/38sy7bnl71ge1.jpeg?auto=webp&amp;s=35b5b4bb01a1664e4bc0f05a5d29b1b391b2c1c3"
        },
        "permalink": "/r/movies/comments/1idabul/amaqa_announcement_alexi_pappas_director_actress/"
    }
]