[
    {
        "id": "1qof7n3",
        "author": "RabbitTrapAMA",
        "title": "Hi /r/movies! I'm Bryn Chainey, writer/director of RABBIT TRAP, a folk-horror starring Dev Patel &amp; Rose McEwen that's out in UK cinemas this weekend. Ask me anything!",
        "content": "Hi r/movies, I'm Bryn Chainey. I wrote and directed RABBIT TRAP, a psychological folk-horror that premiered at Sundance last year and that will be out in UK cinemas this weekend via Picturehouse Entertainment. It stars Dev Patel &amp; Rosy McEwen, (please excuse the autocorrect typo in the title, it's Rosy not Rose!) and I'm here to answer your questions.\n\n**Synopsis:**\n\nIn 1976, married musicians Daphne (Rosy McEwen) and Darcy Davenport (Dev Patel) move to the Welsh countryside to finish their new record. While making field recordings in the ancient woodlands, Darcy captures a forbidden sound not meant for human ears. This brings a strange boy to their doorstep who draws them into an enigmatic realm where the line between reality and myth begins to blur.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=y953Fl\\_BdWM](https://www.youtube.com/watch?v=y953Fl_BdWM)\n\nStarring Dev Patel &amp; Rosy McEwen. In UK cinemas January 30.\n\nAsk me anything! I'll be back Thursday 1/29 at 8 AM ET to answer your questions!",
        "upvotes": 67,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rdm685dpiwfg1.png?auto=webp&amp;s=a08a1aaf1be4aaae83c83affa9664012b165f07b"
        },
        "permalink": "/r/movies/comments/1qof7n3/hi_rmovies_im_bryn_chainey_writerdirector_of/"
    },
    {
        "id": "1qnurzw",
        "author": "MelBrooks99AMA",
        "title": "Hey r/movies, I’m Michael Bonfiglio. I directed and exec. produced Mel Brooks: The 99 Year Old Man! alongside Judd Apatow — available now on HBO Max. I’ve also directed George Carlin’s American Dream and other stuff. Ask me anything!",
        "content": "Hey r/movies, I’m Michael Bonfiglio. I directed and exec. produced Mel Brooks: The 99 Year Old Man! alongside Judd Apatow — available now on HBO Max. I’ve also directed George Carlin’s American Dream and other stuff. Ask me anything!\n\nSynopsis: \n\n&gt;Mel Brooks: The 99 Year Old Man! explores the life, career, friendships, and loves of legendary writer, director, producer, and performer, Mel Brooks. One of Hollywood’s most daring satirists from the early years of television sketch comedy through his film and stage hits, Brooks has held a funhouse mirror up to the human condition and used laughter as a path to resilience, connection, and joy for nearly a century. \n\nFilmmakers: Judd Apatow &amp; Michael Bonfiglio - Streaming on HBO Max\n\n[Trailer](https://www.youtube.com/watch?v=eKo_urZAm9o&amp;embeds_referring_euri=https%3A%2F%2Fpress.wbd.com%2F&amp;source_ve_path=MjM4NTE)\n\nAsk me anything! Back Tuesday 1/27 at 3 PM ET to answer questions. ",
        "upvotes": 148,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/as4hvzp6prfg1.jpeg?auto=webp&amp;s=5901eaca67d3738c4075cfecf3b944bb6bd6eda2"
        },
        "permalink": "/r/movies/comments/1qnurzw/hey_rmovies_im_michael_bonfiglio_i_directed_and/"
    },
    {
        "id": "1qp28hv",
        "author": "Living_Tune_1428",
        "title": "What is a movie plot twist that was cleverly hidden in plain sight..?",
        "content": "I watced a video recently about a Korean war horror movie called R Point, which is about a group of Korean soldiers being sent to find and rescue a group of missing soldiers from a place called R Point during the war...\n\nThey reach the place, and soon weird things begin to happen. A giant factory like building appears out of nowhere one morning, one soldier sees the ghosts of another platoon, while a few American soldiers warn the troop that the place is haunted, and their radio begins to play weird screams...\n\nOne morning, they find one of the members of the troop dead and report it to HQ. But in response they're informed that &gt;! this \"dead troop member\" is actually one of the guys from the missing troop that they were sent to find!&lt; \n\nThe twist isn't grand or whatnot, but it's the way they hide it right in front of the audience that amazed me. For over 50 minutes they showed the twist and nobody could've guessed it. A good example of how atmosphere and execution can make even a predictable twist unpredictable...\n\nWhat are some other plot twists cleverly hidden in plain sight..?",
        "upvotes": 744,
        "comments": 641,
        "media": null,
        "permalink": "/r/movies/comments/1qp28hv/what_is_a_movie_plot_twist_that_was_cleverly/"
    },
    {
        "id": "1qotnlb",
        "author": "BunyipPouch",
        "title": "Olivia Wilde’s Sexual-Comedy ‘The Invite’ Sparks Up Bidding War at Sundance with A24, Focus Features, and Warner Bros - Starring Penelope Cruz, Seth Rogen, Edward Norton, and Olivia Wilde - A dinner party with neighbors reveals deeply-repressed emotions and unexplored sexuality.",
        "content": "",
        "upvotes": 1605,
        "comments": 223,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HD36CMGMhAo4VUa1MZz7LE5QNngpCtdtJW6imkM9Qdg.jpeg?auto=webp&amp;s=e4c58ccc513401f1760a0f9a0f35f071025ae1f9"
        },
        "permalink": "/r/movies/comments/1qotnlb/olivia_wildes_sexualcomedy_the_invite_sparks_up/"
    },
    {
        "id": "1qoe7m8",
        "author": "Morgan-Moonscar",
        "title": "\"Throne of Blood\" (1957, Akira Kurosawa) - Lord Washizu (Toshiro Mifune) is betrayed by his own soldiers after the tide of battle turns to certain defeat",
        "content": "",
        "upvotes": 4270,
        "comments": 317,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7l4jbuyebwfg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qoe7m8/throne_of_blood_1957_akira_kurosawa_lord_washizu/"
    },
    {
        "id": "1qolck0",
        "author": "OverPotato2322",
        "title": "Paramount outlines plans for Warner Bros. cuts",
        "content": "",
        "upvotes": 1458,
        "comments": 236,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2pLr5armBTvAdtzJ-OQJmFO6uuuNjJsDzn7mk2RaJJg.jpeg?auto=webp&amp;s=bd92ee0832f71552ddc45dc67b4be24ceeb4e7ca"
        },
        "permalink": "/r/movies/comments/1qolck0/paramount_outlines_plans_for_warner_bros_cuts/"
    },
    {
        "id": "1qon7t6",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'The Mortuary Assistant' - Follows Rebecca Owens, a mortuary science graduate who takes a night job at River Fields Mortuary. What begins as a routine job soon turns sinister as she faces terrifying supernatural forces.",
        "content": "",
        "upvotes": 1107,
        "comments": 145,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a8ryeqy0xxfg1.jpeg?auto=webp&amp;s=4e1078a3d64898a96ee877fef549d7ab9b7b786f"
        },
        "permalink": "/r/movies/comments/1qon7t6/official_poster_for_the_mortuary_assistant/"
    },
    {
        "id": "1qokvmi",
        "author": "MarvelsGrantMan136",
        "title": "Diane Lane Joins Scarlett Johansson in Mike Flanagan’s ‘The Exorcist’",
        "content": "",
        "upvotes": 1397,
        "comments": 122,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ORD5bVuu3qqiq79SvZqw6zu3hCr1yR7C4_f6lcfT7II.jpeg?auto=webp&amp;s=6b817fe024dee6fe2e9715d7c8980ec8644d0ba0"
        },
        "permalink": "/r/movies/comments/1qokvmi/diane_lane_joins_scarlett_johansson_in_mike/"
    },
    {
        "id": "1qosyy0",
        "author": "MarvelsGrantMan136",
        "title": "Guy Ritchie’s ‘In the Grey’ Sets April 10 Theatrical Release; Starring Jake Gyllenhaal, Henry Cavill and Eiza González",
        "content": "",
        "upvotes": 561,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/T8m716UgJAV4Ac4thSNPmk_gTUEoWi0rTH5wax9iA9o.jpeg?auto=webp&amp;s=a7f98f5c31df0c4c79d776998e6919783b710b10"
        },
        "permalink": "/r/movies/comments/1qosyy0/guy_ritchies_in_the_grey_sets_april_10_theatrical/"
    },
    {
        "id": "1qonz00",
        "author": "herequeerandgreat",
        "title": "galaxy quest laughs WITH geeks, not AT them.",
        "content": "i recently watched 1997's galaxy quest. since i'm a star trek fan, my older relatives have been recommending that i watch this movie for quite some time. i've always heard that galaxy quest was ahead of it's time in it's portrayal of geek culture and i was reluctant when i heard that it was a satire of geek culture. when i hear the words \"satire of geek culture\", i imagine a work that portrays geeks as pathetic man children who take media way too seriously and need to get a life. sure, there's plenty of that in geek culture but that's a minority and not the rule.\n\nhowever, my curiosity finally peaked and i decided to give it a watch. and it's a very funny movie with a fascinating story(even if it is just the plot of three amigos but with a star trek expy). and, despite my fears, the film's portrayal of geek culture is one of my favorite aspects of the film.\n\nlike i said, the film is a satire of geek culture, specifically trekkies. and the film largely portrays geek culture very positively. the geeks in the film are passionate about galaxy quest and knowledgeable about the lore. and, in the end, it's both of those things that end up saving the day. the film also does take lighthearted jabs at geeks, such as mocking the social awkwardness of some nerds and the intense obsession that some of them have. however, as i watched the film, i got the vibe that the filmmakers were laughing WITH me and not AT me. of course, it also helps that i have a pretty thick skin when it comes to jokes at my expense.\n\nif you think about it, the film is less of a satire of geek culture and more of an affectionate parody that's more than willing to make fun of it but is also willing to acknowledge the good parts and that, at the end of the day, geek culture is a good thing.",
        "upvotes": 695,
        "comments": 182,
        "media": null,
        "permalink": "/r/movies/comments/1qonz00/galaxy_quest_laughs_with_geeks_not_at_them/"
    },
    {
        "id": "1qon9vg",
        "author": "LooseDistance1059",
        "title": "“That Thing You Do!” Songs That Didn’t Make The Cut Revealed 30 Years Later",
        "content": "",
        "upvotes": 701,
        "comments": 99,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2ir5zYCR90AVYvLsBVJpjyS8tHCnKwtfFs-WM_KwvxI.png?auto=webp&amp;s=bbdd65d5fd2f3f599785c2d84e900b061ace5204"
        },
        "permalink": "/r/movies/comments/1qon9vg/that_thing_you_do_songs_that_didnt_make_the_cut/"
    },
    {
        "id": "1qofsho",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Brian Cox’s Directorial Debut ‘Glenrothan’ - After 35 years in America, a man (Alan Cumming) returns to the Scottish Highlands following a personal crisis to reconcile with his estranged brother (Cox) and save their family’s struggling whisky distillery",
        "content": "",
        "upvotes": 1224,
        "comments": 100,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0sfyoqvvmwfg1.jpeg?auto=webp&amp;s=a5e47df0fd2c5f21cc6ce0eae2e07ff2b4ef53bd"
        },
        "permalink": "/r/movies/comments/1qofsho/official_poster_for_brian_coxs_directorial_debut/"
    },
    {
        "id": "1qon8vx",
        "author": "JuniorPlastic3562",
        "title": "Duet from Anger Management (2003) between Dave Buznik (Adam Sandler) &amp; Dr. Buddy Rydell (Jack Nicholson). Dir- Peter Segal.",
        "content": "",
        "upvotes": 465,
        "comments": 67,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/knx90hsmwxfg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qon8vx/duet_from_anger_management_2003_between_dave/"
    },
    {
        "id": "1qoladt",
        "author": "ChiefLeef22",
        "title": "I LOVE BOOSTERS - Official Teaser Trailer - In Theaters May 22",
        "content": "",
        "upvotes": 567,
        "comments": 109,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hhvupU6xTOKWHWJBAh7xjL-SwMWPr_TiuHCRg6AKXLc.jpeg?auto=webp&amp;s=5ebc3b2c6cedbd689e7fc9dd002e00dfe8c02a25"
        },
        "permalink": "/r/movies/comments/1qoladt/i_love_boosters_official_teaser_trailer_in/"
    },
    {
        "id": "1qoh8lk",
        "author": "SandersSol",
        "title": "Arrival (2016) hits so, much, harder, after having children. I'm glad I got to watch it on both sides of the coin.",
        "content": "\n\nThe relationship being a parent creates a natural dichotomy between love and loss because you get to go through those things as milestones in your life after having children.\n\nIn many ways you lose your life and who you were before you had them, but the love you gain after is really immeasurable but present. So would that loss Louis and Ian experience be worth the journey? You never know until youre there in that moment of time.\n\nYoull always have those memories, but they become moments in the stream of life that you remember. Not a linear path, because youll recall them at different times and phases of your life. What a wonderful way to approach it.\n",
        "upvotes": 806,
        "comments": 137,
        "media": null,
        "permalink": "/r/movies/comments/1qoh8lk/arrival_2016_hits_so_much_harder_after_having/"
    },
    {
        "id": "1qp1azp",
        "author": "SanderSo47",
        "title": "A24 Wins ‘The Invite’ For Eight Figures In Sundance Bidding War; Starring Olivia Wilde, Seth Rogen, Penélope Cruz, and Edward Norton.",
        "content": "",
        "upvotes": 54,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e8UshZKi9VVR4ORstK4IDYM5KITA8bHKM--_7ZwEO9I.png?auto=webp&amp;s=3032af2e4aae530ed42378935e079911a1883644"
        },
        "permalink": "/r/movies/comments/1qp1azp/a24_wins_the_invite_for_eight_figures_in_sundance/"
    },
    {
        "id": "1qonokp",
        "author": "No-Description-2138",
        "title": "Halle Berry To Star In 'The President Is Missing' At Apple, HBO Series",
        "content": "",
        "upvotes": 216,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hrbwvMFAOMsLf2lzD8_dnptWf95SfbEBPNT7PfxUOv0.jpeg?auto=webp&amp;s=227a722c758a0dc1006c610ad235a649501b511e"
        },
        "permalink": "/r/movies/comments/1qonokp/halle_berry_to_star_in_the_president_is_missing/"
    },
    {
        "id": "1qogg0v",
        "author": "joesen_one",
        "title": "Neon acquires conversion therapy horror film 'LEVITICUS' from 2026 Sundance Film Festival - Two teenage boys must escape a violent entity that takes the form of the person they desire most: each other",
        "content": "",
        "upvotes": 430,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UXNwFa292Gn6QUelL0oEfNGOu-OwwlthKG3A7PWbq_8.jpeg?auto=webp&amp;s=5d680eb56a172af347ad16fe84be18f165be54a8"
        },
        "permalink": "/r/movies/comments/1qogg0v/neon_acquires_conversion_therapy_horror_film/"
    },
    {
        "id": "1qnz0r6",
        "author": "latchkey_adult",
        "title": "Sidney Kibrick, the last remaining kid actor from the Little Rascals/Our Gang short films, died a couple of weeks ago at age 97.",
        "content": "It didn't get a lot of attention in the news so I'm posting it here.  He played the character \"Woim\" which is \"Worm\" with a Brooklyn accent. He was Butch's buddy and therefore the enemy to Spanky and Alfalfa. He was the last of them that actually had a featured role (non extra). Sad for classic film and comedy fans. \n\n[Here's a short featuring Woim and Butch and the rest of the gang](https://youtube.com/watch?v=Xk2aF8RbW04&amp;si=9kcHqwVNEhLK4rV5)",
        "upvotes": 6279,
        "comments": 173,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_PwH1lwh0dM8SSnkJIJnoC9JrEI-j9lENxFEIUrbVDU.jpeg?auto=webp&amp;s=ce79e5c595eee7699af4f52be84ab6d097448ec9"
        },
        "permalink": "/r/movies/comments/1qnz0r6/sidney_kibrick_the_last_remaining_kid_actor_from/"
    },
    {
        "id": "1qoao74",
        "author": "Such-Worldliness-655",
        "title": "Documentaries that are hated by their subjects?",
        "content": "I’m curious to hear about documentaries rejected or disliked by their subjects. It’s especially interesting when the subject participated heavily in the film and accused the filmmaker of misrepresenting them. \n\nA few examples include TV series’ The Jinx and Tiger King. \n\nA different and more complex case is Paris is Burning’s participants. Some were very happy with the documentary while others felt exploited and misrepresented. \n\nDoes anyone have more examples of documentaries whose subjects disliked the final product?",
        "upvotes": 659,
        "comments": 487,
        "media": null,
        "permalink": "/r/movies/comments/1qoao74/documentaries_that_are_hated_by_their_subjects/"
    },
    {
        "id": "1qnzly7",
        "author": "PeneItaliano",
        "title": "The Red Sea parting in The Ten Commandments (1956) took six months and $1 million to film. DeMille’s team flooded a massive tank with 360,000 gallons of water and reversed the footage",
        "content": "",
        "upvotes": 3891,
        "comments": 410,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pxsvfkzknsfg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qnzly7/the_red_sea_parting_in_the_ten_commandments_1956/"
    },
    {
        "id": "1qo9u30",
        "author": "MrGittz",
        "title": "Dan Aykroyd has this amazing talent where he makes exposition sound super interesting &amp; believable. Even in a not great movie like Pearl Harbor I can’t help but be interested in what he’s saying.",
        "content": "I’ve always really loved Dan Aykroyd. Ever since I saw that cigarette dangle off his lip in Ghostbusters? This dude interested me. \n\nAnd even tho he’s been in more than a few turkeys, he is never not good. But where he really shines is delivering information and exposition. \n\nGhostbusters has made up mythology but the two scenes I LOVE are with him and Winston where he quotes the bible and then when they are in jail and he tell us what the building of Dana is meant for. \n\nEven in a movie like Pearl Harbor. My ex LOVED that frigging movie. And during all the lovey dovey stuff I always thought “cut back to Dan Aykroyd breaking codes!” \n\nI don’t know if it’s the sound of his voice or the way he talks.",
        "upvotes": 681,
        "comments": 219,
        "media": null,
        "permalink": "/r/movies/comments/1qo9u30/dan_aykroyd_has_this_amazing_talent_where_he/"
    },
    {
        "id": "1qp3o8c",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Sook-Yin Lee - Thursday 1/29 at 3:00 PM ET - Star of 'Shortbus', Actress in 'Hedwig and the Angry Inch', Director of 'Year of the Carnivore' &amp; 'Paying For It', Musician, and Broadcaster",
        "content": "",
        "upvotes": 15,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/b5vq7bkda1gg1.png?auto=webp&amp;s=0dfe9e512e63b5733149bf14a8d99bfa4da1f166"
        },
        "permalink": "/r/movies/comments/1qp3o8c/amaqa_announcement_sookyin_lee_thursday_129_at/"
    },
    {
        "id": "1qoou5w",
        "author": "No-Description-2138",
        "title": "Julianne Nicholson Joins Brad Pitt In Ed Berger's Next Film 'Riders'",
        "content": "",
        "upvotes": 102,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/55uCyyEQK1mnksnoJ1BWZEmF_ifzkmnPgEAaB5qRKNI.jpeg?auto=webp&amp;s=8ed37afa0a01bebace19a38fb96d8ae23378818c"
        },
        "permalink": "/r/movies/comments/1qoou5w/julianne_nicholson_joins_brad_pitt_in_ed_bergers/"
    },
    {
        "id": "1qox7xv",
        "author": "fungobat",
        "title": "Peter Farrelly’s ‘I Play Rocky’ Lands Coveted Thanksgiving 2026 Release in Theaters (Exclusive)",
        "content": "",
        "upvotes": 31,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/a9r85P6FhwlR_saS6ih3x00IeiymSSqUZYfWOZJw_LI.jpeg?auto=webp&amp;s=922e1206274ec8c804836e57ee86bf26e532b8af"
        },
        "permalink": "/r/movies/comments/1qox7xv/peter_farrellys_i_play_rocky_lands_coveted/"
    },
    {
        "id": "1qosekc",
        "author": "ham_solo",
        "title": "Mississipi Burning (1988)",
        "content": "A thriller based on the real-life murder of Civil Rights activists in 1964 Mississipi. Gene Hackman and Willem Dafoe play two FBI agents assigned to a missing persons case. They find themselves in a community terrorized by the Ku Klux Klan. Both agents fight for the truth while butting heads over different tactics to bring the Klan to justice. \n\nThis movie hits home at the moment. What really struck me is some of the language the more bigoted characters use to describe the murder of the activists, e.g. \"they shouldn't have been there in the first place\". Absolutely relevant to what is happening right now. Some of the messages of the movie can come across a bit heavy-handed, but it's necessary given the subject matter. Hackman delivers a knockout performance. Frances McDormand also stars. This film is a goldmine for character actor nerds, featuring R. Lee Ermey, Stephen Tobolowsky, Kevin Dunn, Frankie Faison, and Brad Dourif, among others. ",
        "upvotes": 53,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1qosekc/mississipi_burning_1988/"
    },
    {
        "id": "1qocila",
        "author": "ICumCoffee",
        "title": "2026 BAFTA Film Awards Nominations: ‘One Battle After Another’ (14 Noms) Leads ‘Sinners’ (13 Noms) by One Nomination While ‘Hamnet’ and ‘Marty Supreme’ Earned 11 Noms Each",
        "content": "",
        "upvotes": 256,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fXQhuO1dFUL67qGFbgGlJhXr1vmWJS-Ri54v8dr4CC0.jpeg?auto=webp&amp;s=4f3bfdf28c268c591341f7242f020bb1538d3840"
        },
        "permalink": "/r/movies/comments/1qocila/2026_bafta_film_awards_nominations_one_battle/"
    },
    {
        "id": "1qnnjbc",
        "author": "MarvelsGrantMan136",
        "title": "Israeli Police Shut Down Jerusalem Screenings of Oscar Entry ‘Palestine 36’",
        "content": "",
        "upvotes": 8720,
        "comments": 257,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MIEaF_Xt4d1XK71uIIgyFIjE9LDe77-ov_O4-OfL5hc.jpeg?auto=webp&amp;s=a711bc2255c7f5b5a4095c5847996064b4c61c3c"
        },
        "permalink": "/r/movies/comments/1qnnjbc/israeli_police_shut_down_jerusalem_screenings_of/"
    },
    {
        "id": "1qp4uk0",
        "author": "Money_Gas_4761",
        "title": "Interstellar confusion",
        "content": "So I just watched Interstellar for the first time, yes I understand it’s 2026, I just now got around to it. I was completely hooked on it, I loved everything about it and was super interested as I’ve always been quite intrigued by physics, however, him in the black hole and everything after that kind of messed it all up for me. My main thing is that, if we see him communicating with his past daughter (and his past self), then wouldn’t this entire thing all just be a loop anyways? He’s communicating with the past, so then that past version of himself would continue on to go on the same journey, and then communicate with ANOTHER past version of himself. I understand that the past watch he tinkered with led his present daughter to solving everything (which I wish we got more of an explanation of), but what about the past daughter he had communicated with? Is that just its own alternate timeline that will lead to the same result? And then also, was the tesseract in the black hole created by a whole other future civilization for the sole purpose of allowing him to communicate with his past daughter, allowing her to save humanity?? So, a future 5 dimensional civilization builds a structure for a past 3 dimensional civilization so that a man can communicate even further into the past to allow for the future existence of their own civilization. Sorry I’m a bit slow.",
        "upvotes": 7,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1qp4uk0/interstellar_confusion/"
    },
    {
        "id": "1qoreab",
        "author": "Lt_Green_Smoke",
        "title": "Suggest me some Noir and Neo-Noir movies for a beginner.",
        "content": "I am going to watch a show which is kind of a parody of the noir and neo-noir films and I would love to understand the jokes on all the tropes related to the movies.\n\nSuggest movies that would make me recognize the tropes, really good movies always appreciated and some movies that put a twist on the tropes.",
        "upvotes": 32,
        "comments": 120,
        "media": null,
        "permalink": "/r/movies/comments/1qoreab/suggest_me_some_noir_and_neonoir_movies_for_a/"
    }
]