[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 37,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pr6ly8",
        "author": "TheMirrorUS",
        "title": "Anthony Joshua slammed as Netflix viewers claim Jake Paul fight was 'rigged'",
        "content": "# Anthony Joshua secured a sixth-round victory over Jake Paul, but fans claimed that the fight was rigged after barely any punches landed in the opening three rounds. Thoughts? ",
        "upvotes": 319,
        "comments": 149,
        "media": null,
        "permalink": "/r/netflix/comments/1pr6ly8/anthony_joshua_slammed_as_netflix_viewers_claim/"
    },
    {
        "id": "1pr08s8",
        "author": "Southern-Brother5693",
        "title": "James Bond Films To Air On Netflix As Part Of Shock Deal With Amazon",
        "content": "",
        "upvotes": 232,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1pr08s8/james_bond_films_to_air_on_netflix_as_part_of/"
    },
    {
        "id": "1pqpo4u",
        "author": "ConversationHairy606",
        "title": "Looking for Netflix recommendations around crime, cybercrime, or privacy",
        "content": "I have been on a bit of a kick watching shows and documentaries about crime, cybercrime, hacking, data leaks, and privacy related topics.\n\nI have already seen a lot of the obvious ones, so I am hoping to find things that might be a bit less mainstream. Could be documentaries, docuseries, or even fictional shows that feel grounded in reality. Anything that explores how data is abused, how scams work, or how technology intersects with crime would be great.\n\nWhat are some good Netflix titles that fit that space",
        "upvotes": 60,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1pqpo4u/looking_for_netflix_recommendations_around_crime/"
    },
    {
        "id": "1pr9cpj",
        "author": "angryrobot5",
        "title": "What are the best Korean films and movies to watch?",
        "content": "I'm going to be doing a computer science internship in Seoul in the upcoming summer, so I wanted to ask if anyone here had any good recommendations for Korean media on Netflix so I can get an idea of how Korea is before the summer!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pr9cpj/what_are_the_best_korean_films_and_movies_to_watch/"
    },
    {
        "id": "1pqx2tt",
        "author": "ala_lala",
        "title": "Murder in Monaco: HELP",
        "content": "Just watched murder in monaco and there was no evidence presented. It was all people's personal opinions. Huge documentary watcher and typically we get evidence and facts but the only thing that was played was recorded calls with the nurse. Shout if you disagree but this was super subjective and I even tried to research after to no avail. Reddit pls do your thing and enlighten me 😭😭🙏🙏 (also tell me if you disagree, here for opposing viewpoints) ",
        "upvotes": 7,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1pqx2tt/murder_in_monaco_help/"
    },
    {
        "id": "1pqb7hx",
        "author": "Notoriously_So",
        "title": "‘Last Samurai Standing’ Renewed for Season 2 at Netflix",
        "content": "",
        "upvotes": 204,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1pqb7hx/last_samurai_standing_renewed_for_season_2_at/"
    },
    {
        "id": "1pr2b9t",
        "author": "hi5orfistbump",
        "title": "Harvey vs Cervantes",
        "content": "Why does it look like Cervantes shouldn't be in the same ring as Harvey? He looks timid, he spends more time tanking Harvey, not responding. Throwing swings after Harvey has moved out of his strike zone. I haven't followed combat sports for years, so I have no clue who either one is. But whoever put Cervantes in that ring should be fired. Harvey literally walked all over him.",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pr2b9t/harvey_vs_cervantes/"
    },
    {
        "id": "1pqsryt",
        "author": "starmaxeros",
        "title": "Netflix acquires gaming avatar maker Ready Player Me | TechCrunch",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pqsryt/netflix_acquires_gaming_avatar_maker_ready_player/"
    },
    {
        "id": "1ppykae",
        "author": "Alternative-Gear3945",
        "title": "Mindhunter",
        "content": "I genuinely feel Mindhunter is such a well put show with the right story and the right pace. I don’t understand why the show was cancelled. If there is anyone from Netflix reading this please get the show back!!!!",
        "upvotes": 255,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1ppykae/mindhunter/"
    },
    {
        "id": "1pr0tbp",
        "author": "L0v3_1s_War",
        "title": "STEEL BALL RUN JoJo’s Bizarre Adventure | Official Trailer | Netflix | Premieres March 19, 2026",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pr0tbp/steel_ball_run_jojos_bizarre_adventure_official/"
    },
    {
        "id": "1pqzkvb",
        "author": "Chuckyfan666",
        "title": "Favorite episode and why?",
        "content": "what's your Favorite episode of Stranger Things and why? Just curious as we approach the 2nd volume of the highly anticipated Season 5 which contains EPISODES 5 6 and 7. Also what's your predictions and theories for the Series finale? Would love to hear your thoughts on it anytime. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pqzkvb/favorite_episode_and_why/"
    },
    {
        "id": "1pqzhpr",
        "author": "Best-Farmer6505",
        "title": "What your opinion on the Roblox games",
        "content": "I don't know if people know about them but there where (still are) Roblox games based on different popular Netflix stuff for an example Netflix nextworlds basically a crossover slop also rebel moon and one piece and a newer one squid game one that kinda sucks idk if people know of them the games mostly sucked",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pqzhpr/what_your_opinion_on_the_roblox_games/"
    },
    {
        "id": "1pqytov",
        "author": "KennethBlockwalk",
        "title": "61st Street - Why the Dislike?",
        "content": "Based on critics aggregation (which, IMO, doesn’t mean all that much) and audience reviews. \n\nRealized its creator made Criminal Justice, the British show that became The Night Of—which I (and seemingly most) loved. That tracked for me; this show gave me similar vibes. \n\nThere’s no accounting for taste. I’m just curious what people don’t like about it. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pqytov/61st_street_why_the_dislike/"
    },
    {
        "id": "1pqydwb",
        "author": "Boring_Potato2858",
        "title": "Netflix on PS3 freezes at the end of every episode/movie",
        "content": "It has happened to us a couple times now. We've been using Netflix on our Playstation 3 with no issues for a very long time (we've even watched the first part of Stranger Things season 5!), but now we're getting freezes for every movie we watch, and it always happens at the 10 last minutes of the movie or so.\n\nIs anyone else having the same issue?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pqydwb/netflix_on_ps3_freezes_at_the_end_of_every/"
    },
    {
        "id": "1pq9o2x",
        "author": "CalebOnPoint",
        "title": "Netflix running ads on Reddit that spoil 2025 movies in a montage?",
        "content": "Has anybody seen the new ads on Reddit (might be other places too) where Netflix spoils all the movies from 2025? It's like a one minute spoil montage that's I guess trying to be funny or cool? What's your opinion on that? IMO seems kind of disrespectful but might just be me.",
        "upvotes": 34,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1pq9o2x/netflix_running_ads_on_reddit_that_spoil_2025/"
    },
    {
        "id": "1pr1kob",
        "author": "Sahafresh",
        "title": "AJ and Jake Paul — commentator lag?",
        "content": "Watching the AJ and JP fight right now and noticing some lag between when the commentators speak and the audio.\n\nAnyone worried about a terrible experience like the Tyson and JP fight? \n\nYikes #netflix learn your lesson\n",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1pr1kob/aj_and_jake_paul_commentator_lag/"
    },
    {
        "id": "1pqwdab",
        "author": "JoeDerus",
        "title": "Has anyone been able to get their old account info/watch history back?",
        "content": "So haven't had Netflix in a while and was thinking about signing up again but was just wondering if there's any possible way to get your old info (watch history, etc) back? From what I've read they delete it after 10 months (one person said 2 years?) of inactivity. Just didn't know if was any tips or tricks or anything that can be done. Really bummed about losing all that stuff and figured couldn't hurt to ask. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pqwdab/has_anyone_been_able_to_get_their_old_account/"
    },
    {
        "id": "1pq00zv",
        "author": "IntelligentYinzer",
        "title": "First Look at Sarah Paulson as Serial Killer Aileen Wuornos in 'Monster' Season 4",
        "content": "",
        "upvotes": 101,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1pq00zv/first_look_at_sarah_paulson_as_serial_killer/"
    },
    {
        "id": "1pqtya7",
        "author": "Solvetunion",
        "title": "Have you seen this new game show called What's in the Box?",
        "content": "I've seen the first episode, and it looked really good. Neil Patrick Harris was a good host. Game shows on netflix are really good in my opinion. If want to know my ranking about it, I give it a 10/10.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pqtya7/have_you_seen_this_new_game_show_called_whats_in/"
    },
    {
        "id": "1pqnllf",
        "author": "Queasy-Cantaloupe783",
        "title": "Forgot the plot of night agent",
        "content": "Just heard s3 is premiering in febuary and now i just realised i don’t remember what happened in the show  because i was watching tons of other shows at the same time 😔",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pqnllf/forgot_the_plot_of_night_agent/"
    },
    {
        "id": "1pq7tkg",
        "author": "GlumBodybuilder4395",
        "title": "Why Did They Stop Doing Production For Nailed It??",
        "content": "Nailed it is one of my favorite comfort shows of all time what the hell happened?? Like why did they stop making new seasons was it a budget issue? I watched other baking shows but none of them hit the same like nailed it did.",
        "upvotes": 30,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1pq7tkg/why_did_they_stop_doing_production_for_nailed_it/"
    },
    {
        "id": "1pqy1gm",
        "author": "AssociateLittle1487",
        "title": "So now that both shows are over, do you prefer Alice in Borderland or Squid Game?",
        "content": "There’s no doubt the final seasons of both shows are highly controversial, but between the two as a whole, which is better? You may also opt to rank all the seasons individually. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pqy1gm/so_now_that_both_shows_are_over_do_you_prefer/"
    },
    {
        "id": "1pq5xra",
        "author": "moviefullfrontal",
        "title": "I love the Anthony Jeselnik standup comedy specials on Netflix.",
        "content": "Anthony Jeselnik is a funny controversial comedian who has no filter. It reminds me of Mad Tv and how Mad Tv was so great because no joke was off limits.  \n\nI watched the other comedy specials too, Anthony Jeselnik is the best edgiest most savvy savage in my opinion.",
        "upvotes": 32,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1pq5xra/i_love_the_anthony_jeselnik_standup_comedy/"
    },
    {
        "id": "1ppp9um",
        "author": "Fun_Molasses5215",
        "title": "Simon Cowell’s new boyband December 10 faces heated legal battle over name",
        "content": "",
        "upvotes": 239,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1ppp9um/simon_cowells_new_boyband_december_10_faces/"
    },
    {
        "id": "1pqrm7z",
        "author": "Spare_Perspective972",
        "title": "Just watched Ed Geins and Adaline Watkins character shift was the weirdest thing, any discussion on this?",
        "content": "So part way through the show in one episode her voice, mannerisms, motivations, the entire way she was written and acted just changed. What? I can’t make sense of this. Was it intentional and she was using Ed to get photos and was done with the act? Or was it poor writing where they just needed her motivations to be different for the plot?\n\nEither way if confirmed BPD is the most disturbing thing to me. I already have Asperger’s so dishonest personalities are my bane. ",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pqrm7z/just_watched_ed_geins_and_adaline_watkins/"
    },
    {
        "id": "1pr65ud",
        "author": "fastest_slowest",
        "title": "Who here after Jake Paul vs Anthony Joshua?",
        "content": "Bro. Jake lasting 6 rounds is already impressive but my boy AJ said what he said he’d do: “not settle”. I love that he wasn’t playing the running rings game with JP. Took all the jewelry and the bread…and the win!",
        "upvotes": 0,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1pr65ud/who_here_after_jake_paul_vs_anthony_joshua/"
    },
    {
        "id": "1pq8mu9",
        "author": "Upstairs-Brain1987",
        "title": "Do I need to watch Knives out Glass onion before Wake up Dead Man?",
        "content": "Me and my girlfriend were in for a movie night. I have already watched knives out and knives out glass onion before but my girlfriend has only watched the 1st movie. I am thinking that she should watch it in the order it was released ( Thats just how I prefer to watch movies in general) but I also realllly want to watch the third one. She doesnt really care about the order as long as its not heavily dependent. So to my original question. Does it matter?\n\n\nUpdate: Watched “Wake up Dead man”. Both of us absolutely loved it.",
        "upvotes": 18,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1pq8mu9/do_i_need_to_watch_knives_out_glass_onion_before/"
    },
    {
        "id": "1pr4dpk",
        "author": "spatchcocked-ur-mum",
        "title": "before jake pauls fight i making a bet right now. the fight will end up being the fight from ROCKY 1",
        "content": "why? well if he wins, everyone will think its fixed and rigged. and what does he want the most? he wants to be seens a real fighter.\n\nso this fight aj will win but it will leave a bunch of people saying \"wow i know he lost but jake really held his own\" \n\nits the only option i can see, that has jake winning in the pr war. so thats why i think its going to play out like rocky 1\n\nits 3:29 am in the uk",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pr4dpk/before_jake_pauls_fight_i_making_a_bet_right_now/"
    }
]