[
    {
        "id": "1pyji4s",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 13,
        "comments": 1130,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pyji4s/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1q201a0",
        "author": "BowlPractical2917",
        "title": "The greatest club with no doubt 🤫",
        "content": "",
        "upvotes": 88,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ppgybai75yag1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1q201a0/the_greatest_club_with_no_doubt/"
    },
    {
        "id": "1q1wd4e",
        "author": "wahnzig",
        "title": "Another reason watching RMA hasn't been exciting lately",
        "content": "Other than how uninspiring our games have been in the past few years, how much we've relied on pure vibes and individual brilliance to win games/titles, I've just realised another reason I've been losing interest in the current crop of Madrid players....\n\n  \nEndrick.\n\nFor a long time, we didn't have a long-term solution for Benzema's successor. Then we got Endrick, signed two years(2022 to 2024) before he actually started. Two years waiting for this young talent to arrive, while relying on false #9s! I watched Palmeiras games to track his progress. In that time he made a debut for the Brazilian NT and also got handed the NT #9 shirt! \n\n  \nRough but a decent start with good goals for Madrid. I was super excited looking forward to his second season. He was even handed our #9 shirt. \n\n  \nNow where is he? Lyon.\n\nWho do we have in his place? Masty and GG. Both decent players but what's their RMA story, compared to Endrick?\n\n  \nSame with Odegaard - tracked him through many loan spells, watched him grow wonderfully, only for him to land in Arsenal. In his place? Arda, who is a brilliant player but a last-minute signing. Can't compare both players' histories on Madrid's books before their debuts.\n\nWon't be surprised if Nico Paz follows a similar arch.\n\n\nCurrent crop of players just give me meh vibes. Mishmash RMA history. Only recently started to seriously admit academy players, too. \n\n  \nI'm a case study of one obviously. But, so much fan loyalty is being flushed down the drain by this club.\n\n  \nHoping for a better turnout in 2026.",
        "upvotes": 45,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q1wd4e/another_reason_watching_rma_hasnt_been_exciting/"
    },
    {
        "id": "1q1e8va",
        "author": "ContextDry9672",
        "title": "No way, this is real.",
        "content": "",
        "upvotes": 411,
        "comments": 40,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/quz45vknssag1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1q1e8va/no_way_this_is_real/"
    },
    {
        "id": "1q1aawj",
        "author": "urs_romeo007",
        "title": "BBC IS THE HISTORY❤️💀",
        "content": "▪️ Journalist in 2016: \"MSN looks more happy together than BBC. Why is that?\"\n\n🗣️ Ronaldo: \"I'm not here to have dinners with Bale and Benzema. Im here to win trophies with them. Hugs and kisses are not important to me.\"\n\nA few years later:\n🤯 BBC: 4 Champions Leagues 🏆🏆🏆🏆\n👍 MSN: 1 Champions League 🏆",
        "upvotes": 525,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/465sixoy0sag1.jpeg?auto=webp&amp;s=a8d8fe16c8b0f0a648f7777d955d833d812b7a8b"
        },
        "permalink": "/r/realmadrid/comments/1q1aawj/bbc_is_the_history/"
    },
    {
        "id": "1q11nqo",
        "author": "landofphi",
        "title": "Luka Modrić: \"I was 100% convinced I'd retire at Real Madrid, but life is unpredictable. Jose Mourinho was the toughest coach I had. I saw him make Cristiano Ronaldo cry in the locker room because he didn't chase the opposing full-back. If it wasn't for Jose, I would've not been able to join Madrid\"",
        "content": "",
        "upvotes": 891,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TsSWlKc_ofkXTP_9wEFFoqdi1BlUYp2T2MFmR8u3Iv0.jpeg?auto=webp&amp;s=4ffc15a9678f63e6bf44a595caf08e95eeb23622"
        },
        "permalink": "/r/realmadrid/comments/1q11nqo/luka_modrić_i_was_100_convinced_id_retire_at_real/"
    },
    {
        "id": "1q11xcm",
        "author": "8Nakul",
        "title": "Kylian Mbappé has the most G/A (79) in 2025 for Club and Country.",
        "content": "",
        "upvotes": 755,
        "comments": 88,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/t841s0o41qag1.jpeg?auto=webp&amp;s=a0f0df00a6b80e26b5a26017963f459b9cf8d992"
        },
        "permalink": "/r/realmadrid/comments/1q11xcm/kylian_mbappé_has_the_most_ga_79_in_2025_for_club/"
    },
    {
        "id": "1q117ia",
        "author": "chunchunmaru1129",
        "title": "Arda: With mom and dad",
        "content": "",
        "upvotes": 636,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ya0oeyewspag1.jpeg?auto=webp&amp;s=de596eb5e69dd3cf5d8577273bfc28aacc0918c3"
        },
        "permalink": "/r/realmadrid/comments/1q117ia/arda_with_mom_and_dad/"
    },
    {
        "id": "1q1ax1w",
        "author": "mr-zeus-",
        "title": "With Kylian injured, I hope Xabi implements his high press now",
        "content": "Our pressing has been a half press at best, exposing our defensive line like crazy. Two main reasons are Kylian's lack of pressing and Vini's semi pressing. Now that Kylian is injured, I hope Xabi does the high press. We are also playing against teams that are in the top half of the table. So no better time than implement them now.\n\nIdeally I would want Xabi to start every player he would want to start to implement a high press if Kylian was available and just replace Kylian with Garcia(or Rodrygo if\\* he is not the preferred RW). By this way, if we are playing better, he has a better chance of convincing Kylian to press and doesnt have to change tactics later.",
        "upvotes": 125,
        "comments": 78,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q1ax1w/with_kylian_injured_i_hope_xabi_implements_his/"
    },
    {
        "id": "1q15717",
        "author": "Such-Explanation1705",
        "title": "Very dumb and stupid question, why is it that Real madrid's been so consistent in winning the UCLS but struggles to win Laliga?",
        "content": "Very dumb and stupid question, why is it that Real madrid's been so consistent in winning the UCLS but struggles to win Laliga ? I don't get it, why's Barca winning Laligas consistently even though they've barely won any Ucls over the last decade? it's not like the starting players for Laliga is any different from the starting players for the UCL matches",
        "upvotes": 69,
        "comments": 96,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q15717/very_dumb_and_stupid_question_why_is_it_that_real/"
    },
    {
        "id": "1q1iyhu",
        "author": "Galego_ACB",
        "title": "La gran decisión del Real Madrid: ¿renovar con la Euroliga o esperar a la nueva competición europea que van a crear la NBA y FIBA?",
        "content": "",
        "upvotes": 11,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/l0krPOnMj5QAhfKgeobVqrAdO9U83RgO_y0r8OyCpxw.jpeg?auto=webp&amp;s=4f8b5a372833f0eea75897ad77f253321d29265f"
        },
        "permalink": "/r/realmadrid/comments/1q1iyhu/la_gran_decisión_del_real_madrid_renovar_con_la/"
    },
    {
        "id": "1q0l40k",
        "author": "ch1nkkyy",
        "title": "A new year, the same faith. May 2026 be better. Hala Madrid, hasta el final🤍.",
        "content": "",
        "upvotes": 678,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vij0z010blag1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1q0l40k/a_new_year_the_same_faith_may_2026_be_better_hala/"
    },
    {
        "id": "1q0t5nf",
        "author": "Jona113d",
        "title": "OMG! New Leaks of next seasons home jersey",
        "content": "",
        "upvotes": 108,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fa3dgr95bnag1.png?auto=webp&amp;s=93ba6425956c988caed669c731ecdee97a93dfb6"
        },
        "permalink": "/r/realmadrid/comments/1q0t5nf/omg_new_leaks_of_next_seasons_home_jersey/"
    },
    {
        "id": "1q0m3y0",
        "author": "SaFari833",
        "title": "Jersey wall has been updated, one last update left",
        "content": "One more update (or two if lucky) and then I’m done! \n\nThank you everyone for the players that were added. Got a lot of direct messages of request and players and suggestions and really appreciate that! \n\nI can add four more jerseys to the right! Under the last row \n\nAnd to be able to be added they must \n- have played for Real Madrid or the academy \n- I must have seen play in any game whether Madrid a new club or internationally ( 06-onward) \n\n\nCurrently I have a few players I can add that were recommended from last time and I’ll add them again, \n\nBut I’ll let Reddit pick the last four (if lucky maybe 8). \n\nCurrently the players mentioned that are on my mind \n\n- di Maria \n- camvinga\n- higuain \n- chicharito\n- essien \n- chema (I REALLY RATE HIM) \n- hermoso \n- Roberto Carlos \n- guti \n- Danilo \n- endrick \n- sahin \n- carvalho \n\n\nOverall I try to add color to the wall with different jerseys. Any other players ope to suggestion! Top three will win and I will pick the last one ",
        "upvotes": 295,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kwg59wvzilag1.jpeg?auto=webp&amp;s=df5d7cec52ef5f787699c37b4d2c7aad49b46495"
        },
        "permalink": "/r/realmadrid/comments/1q0m3y0/jersey_wall_has_been_updated_one_last_update_left/"
    },
    {
        "id": "1q18z8i",
        "author": "philispoy",
        "title": "Spanish Super Cup 2026 in Jeddah, Saudi Arabia",
        "content": "Anyone looking for two(2) side-by-side tickets for the Atletico Madrid- Real Madrid semi-final, you can dm me. Certain circumstances have led me to let them go. We can discuss them thru dm if anyone’s interested.\n\nThis could have been a dream come true for us to watch but we’ll have to forego it for next time.",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q18z8i/spanish_super_cup_2026_in_jeddah_saudi_arabia/"
    },
    {
        "id": "1q0aqjx",
        "author": "landofphi",
        "title": "Iñaki Williams: \"I have no hesitation in telling the truth. Playing the Spanish Super Cup in Saudi Arabia is very bad. It feels like we’re playing away games because we don’t have fans there. I’m also about to become a father and I won’t be able to be with my wife\"",
        "content": "",
        "upvotes": 1327,
        "comments": 43,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ssqj4lvbxiag1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1q0aqjx/iñaki_williams_i_have_no_hesitation_in_telling/"
    },
    {
        "id": "1q0cnga",
        "author": "Messmers",
        "title": "[L'EQUIPE] Kylian Mbappé injured his knee and will be out for three+ weeks",
        "content": "",
        "upvotes": 635,
        "comments": 218,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/z0wJAGWxdmrRuYfqJDExrE_OCt0397OZg4YPWFsMx5A.jpeg?auto=webp&amp;s=bb6cf0f5400481392efac3c10eb5d457526489a1"
        },
        "permalink": "/r/realmadrid/comments/1q0cnga/lequipe_kylian_mbappé_injured_his_knee_and_will/"
    },
    {
        "id": "1q121m2",
        "author": "Critical-Remove-1878",
        "title": "Is Summer 2026 the time for a complete squad overhaul?",
        "content": "Happy New Year everyone!\n\nIt's no secret that our current squad has had some obvious gaps and problems for a while. Some players are aging, others are too injury prone, others are too young and not ready to help the team on a consistent basis and others have been simply underperforming for a while now.\n\nRecently I was looking atother UCL winning squads of recent years to see how much they have transformed since winning the trophy:\n\n1. Two years after Manchester City won the treble in 2023, all of these players have left the club: Ederson, Walker, Laporte, Akanji, Cancelo, Gundogan, De Bruyne, Grealish, Mahrez and Alvarez. That's of course without including players that barely played like Palmer, Phillips, Carson etc. From the 13 players that played in the 2023 final, only 7 are still there, with Stones (out of contract), Bernardo (out of contract) and Ake also being likely to leave at the end of this season.\n2. Chelsea won the UCL in 2021 and by the end of summer 2023 all of these players were gone: Mendy, Azpilicueta, Rudiger, Christensen, Zouma, Alonso, Kovacic, Kante, Jorginho, Ziyech, Mount, Pulisic, Havertz, Werner, Giroud, Abraham etc. Again, excluding players with very minimal minutes. From the 14 players who participated in the 2021 final, the only ones who were still there in September 2023: James (still a starter), Chilwell (barely played since 2023, left on loan and then permanently) and Thiago Silva (left in 2024).\n3. Bayern 2020 were a bit more \"stubborn\" compared to the other two. By 2022, Javi Martinez, Alaba, Boateng, Sule, Thiago, Tolisso and Lewandowski had left the club. Out of the 15 players that participated in the 2020 final, 7 were still there in September 2022, but a couple of them were loanees (Coutinho, Perisic).\n\nComparing these to our own 2024 winning squad:\n\nWe're entering the 4th transfer window since that final and the only (important) players who have left are Nacho, Vazquez, Kroos (retired), Modric and Joselu (technically didn't leave as a loanee, so I'll include him). The ironic thing is that 4/5 could have been really useful for our current squad.\n\nIt's worth noting that we've made a combined... 1.5 million from these 5 players leaving. Manchester City in 2023-25 made around 280 million Euros on sales. Chelsea made around 200 million in the next two years, while they made 282m on sales in 23/24 season alone! Bayern made far less in the first two seasons (around 25m), but it was also the COVID period. In 22/23 they made more than 120m and the season after, more than 170m.\n\nWith this little \"research\" you can see that we've been pretty inactive in the market, both when it comes to buying, but also selling.\n\nWhile other teams sell and buy many players every window, we have too many players sitting on their contracts and just waiting for them to end, while we also wait for world class from other clubs to be out of contract, so maybe we can sign them. Right now we have a whole... back 5 of players who are past their respective primes and they're constantly injured and can barely offer anything to this team consistently (Carvajal, Militao, Rudiger, Alaba, Mendy). It's no disrespect to try to sell them somewhere. Mendy has a contract until 2028, is our 3rd choice LB and has played 1 game this season. Alaba has started 2 games and in one of them he was subbed off injured. Alaba and Rudiger are out of contract this summer, let's see what happens to the other 3.\n\nWe should also start consider selling some players on their \"prime\" years. Ever since Mbappe joined, the big question was what's gonna happen to Rodrygo and Vini. 1 year later, Rodrygo lost his place in the line-up, had the worst goal drought ever by a RM attacker and now his market value has been HALVED. Pretty much ALL of our players are losing value compared to previous seasons.\n\nDisclaimer: I'm not saying that we should sell our whole team for no reason, nor that we can compete financially with an oil club like Man City or Chelsea's... 40-man squad. But our current transfer strategy is simply not sustainable, we can't keep holding a whole squad, because they've been succesful IN THE PAST. Or relying on getting free agents and waiting for 18 year olds to turn world class. Imo we should start buying AND selling a lot more than what we've been doing recently.",
        "upvotes": 9,
        "comments": 55,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q121m2/is_summer_2026_the_time_for_a_complete_squad/"
    },
    {
        "id": "1q0efiz",
        "author": "No-Independent2522",
        "title": "Real Madrid Legend and Global Ambassador Roberto Carlos Rushed in for Emergency Heart Surgery. He is fine and under surveillance",
        "content": "\\&gt; Real Madrid and Brazil legend Roberto Carlos was rushed in for emergency surgery on his heart during a trip to his homeland\n\n\\&gt; According to EL MUNDO , Carlos had traveled to São Paulo for a family vacation when he underwent a routine check-up for a possible blood clot in his leg. During those tests, it was discovered that the World Cup winner’s heart was not functioning properly.\n\n\\&gt; Carlos was quickly rushed in for what is described as emergency surgery to address the issue.\n\n\\&gt; AS add that a complication extended the procedure from 40 minutes up to three hours but, thankfully, all appears to be well.\n\n\\&gt; Due to the complication, MARCA predict Carlos will be kept in hospital for the next two days for monitoring.\n\n\\&gt; Contacted for comment by the Spanish paper, Carlos is quoted as saying: “I’m fine now and under close surveillance.”",
        "upvotes": 322,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/m8NGye_ULCLyrEqAe97STuNgslf50E57i5XR2fszDAw.jpeg?auto=webp&amp;s=37f0406236bbc4339fd4e919b0d3203811c62ecf"
        },
        "permalink": "/r/realmadrid/comments/1q0efiz/real_madrid_legend_and_global_ambassador_roberto/"
    },
    {
        "id": "1q0gsyt",
        "author": "FlyingWaterMen",
        "title": "[DataFootball] Players with the most actions that led to a goal in the top 5 leagues",
        "content": "",
        "upvotes": 124,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/09zo15loekag1.jpeg?auto=webp&amp;s=b6f005dcdc2f8aa72ed2c06dfc547fbc56726b76"
        },
        "permalink": "/r/realmadrid/comments/1q0gsyt/datafootball_players_with_the_most_actions_that/"
    },
    {
        "id": "1q0dj6k",
        "author": "No-Independent2522",
        "title": "Parte médico de Mbappé",
        "content": "",
        "upvotes": 134,
        "comments": 34,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q0dj6k/parte_médico_de_mbappé/"
    },
    {
        "id": "1q0d54w",
        "author": "AlekhineAl",
        "title": "False 9 Bellingham, Number 10 Arda now that Mbappe is officially out of 3 weeks. What say?",
        "content": "Best of both worlds? Bellingham gets to poach the box and hunt crosses. Arda gets to create in the final third and liberate Vini and Rodrygo. Camavinga and Valverde can get back to midfield. Sounds sorted on paper. I don’t trust Gonzalo Garcia in the box more than Bellingham. And Vini and Jude have great chemistry together. Literally a golden chance to recreate the early season 23- 24",
        "upvotes": 88,
        "comments": 54,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q0d54w/false_9_bellingham_number_10_arda_now_that_mbappe/"
    },
    {
        "id": "1pzma4y",
        "author": "Ineedhelpistaken",
        "title": "Mbappe is the leader of touches in box in la liga with 347",
        "content": "",
        "upvotes": 248,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/amweigmz9dag1.jpeg?auto=webp&amp;s=a59f5841f7738ea2179dd53aab8cd4ae1ff67480"
        },
        "permalink": "/r/realmadrid/comments/1pzma4y/mbappe_is_the_leader_of_touches_in_box_in_la_liga/"
    },
    {
        "id": "1q0ysy5",
        "author": "Additional-Bear-8121",
        "title": "HOT TAKE (please don't hate, just an opinion)",
        "content": "I'm a Barça fan, but respect RM as long as their fans respect FCB, and only disrespect RM if I see disrespect to FCB. My hot take is that if Real Madrid had a better manager during the three-peat period, they would've won at least 2 trebles out of 3. That team was way to good not to have won a treble, and I think it's because Zizou's team lacked tactical identity, it was just talent, which is why they couldn't win the treble. Take Pep's Barca of 2009 or Enrique's Barca of 2015 as an example. They had talent and identity which was key to their success. I am not downplaying the three-peat, I'm just saying if a manager like Mourinho or Pep was in charge of that team, they'd have a clear style of play and could've done a thee-peat of trebles. No hate, just a hot take, and I'm interested to see the perspective of a Real Madrid fan on this.",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q0ysy5/hot_take_please_dont_hate_just_an_opinion/"
    },
    {
        "id": "1pzfymc",
        "author": "repsimons",
        "title": "Which Real Madrid Jersey is this?",
        "content": "Hey Real Madrid fans! I’ve been looking for this tee for ages now, but haven’t been able to find it. Does anyone know what year or season it’s from? If so, could you please provide a link 🙏",
        "upvotes": 156,
        "comments": 28,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/11d4ak5tvbag1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pzfymc/which_real_madrid_jersey_is_this/"
    },
    {
        "id": "1pzc5p8",
        "author": "Shelly_Beats23",
        "title": "Kylian Mbappe - Playmaking/Chance Creation 25/26",
        "content": "",
        "upvotes": 246,
        "comments": 40,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/n5fon83kqaag1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pzc5p8/kylian_mbappe_playmakingchance_creation_2526/"
    },
    {
        "id": "1pyvrtm",
        "author": "ContextDry9672",
        "title": "Brahim Diaz third goal in AFCON",
        "content": "",
        "upvotes": 1444,
        "comments": 44,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/gkvd20ns37ag1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pyvrtm/brahim_diaz_third_goal_in_afcon/"
    },
    {
        "id": "1q09gni",
        "author": "Hisense_Sports1",
        "title": "As 2025 Comes to an End – Your Most Unforgettable Real Madrid Moment?",
        "content": "As we look back at 2025, Real Madrid gave us so many moments worth remembering.  \nThere were nights full of passion, tense matches that tested our nerves,  \ndecisive goals that shaped the season, and comebacks that reminded us what this club is all about.  \nFrom experienced leaders to rising stars, this year once again showed the unique identity and mentality of Real Madrid.\n\nMaybe it was a classic match that left you staring at the screen long after the final whistle.  \nMaybe it was a player stepping up at the perfect moment and changing the course of the season.  \nOr maybe it was a small, subtle moment that made you think: *this is Real Madrid*.\n\nIf you had to choose **one single moment**,  \n👉 what was the most memorable Real Madrid moment of 2025 for you?  \nFeel free to share your story, your reasoning, or how that moment made you feel.",
        "upvotes": 0,
        "comments": 35,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q09gni/as_2025_comes_to_an_end_your_most_unforgettable/"
    },
    {
        "id": "1pz2duu",
        "author": "tfou79",
        "title": "Brahim Highlights In Today's Game AFCON",
        "content": "",
        "upvotes": 502,
        "comments": 48,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/x83fvp1ee8ag1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pz2duu/brahim_highlights_in_todays_game_afcon/"
    },
    {
        "id": "1pzcfua",
        "author": "Hisense_Sports1",
        "title": "67 Games, 80 Goals Conceded: Is defense becomes a Serious Problem?",
        "content": "In 2025, Real Madrid conceded **80 goals in 67 matches across all competitions**.  \nAmong all teams in Europe’s top five leagues, only **Tottenham Hotspur** conceded more goals this year (83 goals in 59 matches), while **Brest** also conceded 80.\n\nThe decline of key defenders due to **age, loss of pace, and recurring injuries** has been impossible to ignore.  \nDavid Alaba, for example, suffered seven separate injuries in a single season, missing a total of 520 days.  \nÉder Militão, after suffering a second ACL rupture in 2024, has only returned to around 70% of his previous level.  \nAntonio Rüdiger played through persistent knee issues before ultimately opting for surgery at the end of the season.\n\nWith the defensive core constantly unavailable, Real Madrid were forced to rely on non-defenders like Tchouaméni and Lucas Vázquez to fill in at the back, leading to a dramatic drop in stability and cohesion.\n\nThe collapse of Madrid’s defense is not only the result of bad luck with injuries or an aging back line — it also exposes flaws in recruitment strategy and tactical planning.  \nHistorically, Madrid managed to pull themselves out of defensive crises with partnerships like Pepe and Sergio Ramos.  \nThe question now is: **how long will it take before we see defenders of that level again at the Bernabéu?**",
        "upvotes": 87,
        "comments": 59,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pzcfua/67_games_80_goals_conceded_is_defense_becomes_a/"
    }
]