[
    {
        "id": "1le84ss",
        "author": "scoreboard-app",
        "title": "Match Thread: Real Madrid vs Al Hilal SFC Live Score | FIFA Club World Cup 2025 | Jun 18, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1le84ss)",
        "upvotes": 54,
        "comments": 35,
        "media": null,
        "permalink": "/r/realmadrid/comments/1le84ss/match_thread_real_madrid_vs_al_hilal_sfc_live/"
    },
    {
        "id": "1lcovgx",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 22,
        "comments": 938,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lcovgx/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1le92ey",
        "author": "soldier101br",
        "title": "Real Madrid Captain and Legend, Sérgio Ramos was awarded the Superior Player of the Match Award for his performance against Inter",
        "content": "On today Match for Monterrey versus Internazionale,our Former Captain and Club Legend, Sérgio Ramos,scored and made one of the Amazing performance against a Champions League finalist side,showcasing not only How much of a great athlete he is,but why he's on the hall of game of the greatest Defenders Ever. 🥹🤍🤍🤍",
        "upvotes": 490,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pys9zoxafm7f1.png?auto=webp&amp;s=a8630d36331d786f2ffa7ae203eba691a24598d7"
        },
        "permalink": "/r/realmadrid/comments/1le92ey/real_madrid_captain_and_legend_sérgio_ramos_was/"
    },
    {
        "id": "1le9u94",
        "author": "No-Dentist-9241",
        "title": "Madrid Information be like:",
        "content": "",
        "upvotes": 164,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c8cjybr1om7f1.jpeg?auto=webp&amp;s=faa155107ce40759fddc2a417f47e99570cd4acd"
        },
        "permalink": "/r/realmadrid/comments/1le9u94/madrid_information_be_like/"
    },
    {
        "id": "1leamig",
        "author": "DoriOli",
        "title": "Carvajal trying to remember the First XI he debuted with",
        "content": "",
        "upvotes": 124,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9qcbkmt0xm7f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1leamig/carvajal_trying_to_remember_the_first_xi_he/"
    },
    {
        "id": "1le6egh",
        "author": "AjVine",
        "title": "Ramos scoring headers against top teams. Class is permanent.",
        "content": "",
        "upvotes": 215,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/f7ET_7JI182GQaGyrZfnt1MxJQ1YwYYM6AZlqzfUewk.jpeg?auto=webp&amp;s=983bdb97ffd91ea7e615220ecea64dd24a5aee0a"
        },
        "permalink": "/r/realmadrid/comments/1le6egh/ramos_scoring_headers_against_top_teams_class_is/"
    },
    {
        "id": "1lebjsc",
        "author": "Domesticated_Cum",
        "title": "Real Madrid golden generation players longevity is ridiculous",
        "content": "We saw Ronaldo score in Nations at 40\nModric balling at highest stages at 39\nRamos scoring vs Inter at 39\nBenzema Ballon D'Or and legendary UCL run at 34\nKroos was performing at the highest at 34 winning a UCL with assist in final\n\nMeanwhile:\n\nSuarez 36 - Inter Miami\nPiqué 34 - retired\nXavi 35 - Al Sadd and retired from international \nIniesta 33 - J1 league and retired internationally \nBusquets 34 - Inter Miami and retired internationally ",
        "upvotes": 53,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lebjsc/real_madrid_golden_generation_players_longevity/"
    },
    {
        "id": "1le4r1s",
        "author": "Ra_Re_7",
        "title": "Xabi - on Mbappe and team's pressing",
        "content": "\n“Well what I know is that nowadays you need a team that presses like a unit. We have 11 individuals, we have to make them work together and do defensive work. Nowadays it’s so important and for sure it’s something we have to address. And so far in just a few days, we have tried to do it. And, for the short term, and for sure in the long term, it’s going to be very decisive in our performance”\n\nCredits : @KiyanSo.\n\nGuess , we need to see in the CWC matches how everybody presses , including vini and Mbappe. Hopefully, we do as a unit instead of disjointed press.",
        "upvotes": 135,
        "comments": 21,
        "media": null,
        "permalink": "/r/realmadrid/comments/1le4r1s/xabi_on_mbappe_and_teams_pressing/"
    },
    {
        "id": "1le9nvn",
        "author": "Ready_Ad_1353",
        "title": "Xabi Alonso on CWC: “Sometimes we focus too hard on Europe and believe there’s nothing else, but we’re very wrong about that.”",
        "content": "",
        "upvotes": 52,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e4R4DQG2j2XIipcxXNjlQNJMFXmoQXMUz_5NMZdP3So.jpeg?auto=webp&amp;s=fe045ee757c7c683ab00e9ea1a0073cead3cde0c"
        },
        "permalink": "/r/realmadrid/comments/1le9nvn/xabi_alonso_on_cwc_sometimes_we_focus_too_hard_on/"
    },
    {
        "id": "1ldv9yq",
        "author": "AestheticEvan23",
        "title": "Some training footage from today",
        "content": "",
        "upvotes": 377,
        "comments": 28,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/r7aojax49j7f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ldv9yq/some_training_footage_from_today/"
    },
    {
        "id": "1le2ov4",
        "author": "stoner_prime",
        "title": "Franco Mastantuono - what a talent",
        "content": "Watched him play for the first time today. I was surprised they played him the whole game considering he’s leaving but I’m not complaining.\n\nHe seems technically gifted and loved how much ground he covered but noticed how he plays in a more Inside Forward position than a Right Winger. I get that his age is a positive factor and I’m sure if he stays with the first team Xabi will make sure his development is not hindered.\n\nIf you’ve seen him play in the league please share your thoughts about him.",
        "upvotes": 148,
        "comments": 43,
        "media": null,
        "permalink": "/r/realmadrid/comments/1le2ov4/franco_mastantuono_what_a_talent/"
    },
    {
        "id": "1ldjhme",
        "author": "Imetanga",
        "title": "“Vini doesn't press or track back, do you think Xabi would tolerate that?”",
        "content": "It’s incredible how people try to link Vini to everything negative at Real Madrid. No matter what goes wrong, somehow his name gets dragged into it. A few seasons ago, we all saw him pressing high, winning the ball back, being active defensively. Now they act like all of that never happened, like it was a lie. It’s frustrating how quickly narratives shift when fans need a scapegoat. Vini has flaws like any player, but pretending he doesn’t work or press is pure fiction.",
        "upvotes": 833,
        "comments": 124,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ocep1l76rg7f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ldjhme/vini_doesnt_press_or_track_back_do_you_think_xabi/"
    },
    {
        "id": "1ldyypo",
        "author": "94Temimi",
        "title": "[Basket] Real Madrid Basket QUALIFIES to the League Final after beating Unicaja (86-79)",
        "content": "",
        "upvotes": 107,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oqhu6fbvyj7f1.png?auto=webp&amp;s=cf290c11d13c6fdc887f8ca96e2d5ceca3382b93"
        },
        "permalink": "/r/realmadrid/comments/1ldyypo/basket_real_madrid_basket_qualifies_to_the_league/"
    },
    {
        "id": "1ldvifj",
        "author": "94Temimi",
        "title": "Summary of Real Madrid's final training session before our match against Al Hilal",
        "content": "*Real Madrid completed their final training session at The Gardens North County District Park in Palm Beach ahead of their Club World Cup debut against Al Hilal at the Hard Rock Stadium in Miami (Wednesday, 9pm Spanish time; 3pm local time).*\n\n*Xabi Alonso's side began with warm-up exercises on the pitch with and without the ball, before moving on to passing drills. They then played a series of small-sided games and finished the session with shooting practice. Mbappé, who is suffering from a fever, did not take part in training. Camavinga continues his recovery process.*\n\n\\-Official Real Madrid statement",
        "upvotes": 144,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qsur0sajaj7f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ldvifj/summary_of_real_madrids_final_training_session/"
    },
    {
        "id": "1lea0wk",
        "author": "Specialist-Mixx",
        "title": "Sergio Ramos scores for Monterrey vs Inter - holding the line vs Europes second best",
        "content": "Sergio Ramos not only holding the line vs the current UCL runnerups for 95min, but also scoring against them as a goddamn CB, highlights yet again what a tremendous mistake it was to let the man go. \n\nCoupled with our injury patterns the past few years, we could have squeezed far more football out of him. \n\nAt some point, one has to call it for what it was. A massive error in judgement on Perez part. \n\nYeah, I get it, he played ego chicken with Perez, and lost, but we all lost alongside him. Same with CR7. \n\nWealthiest club in the world could have afforded some appreciation money for our legends, and I’m certain it would have paid off. \n\nPisses me off to see Ramos still wreck teams, without the Madrid logo on his chest. ",
        "upvotes": 16,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lea0wk/sergio_ramos_scores_for_monterrey_vs_inter/"
    },
    {
        "id": "1ldbdxd",
        "author": "Manto12FC",
        "title": "How do I tell my kids that Sergio Ramos in 2019/20 season scored more Laliga goals than the current \"Ballon D'or favourite\" 😭",
        "content": "",
        "upvotes": 3060,
        "comments": 164,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mvnr87m4be7f1.jpeg?auto=webp&amp;s=29218df7ffcda6ddf92a13aa198a5993864f1b17"
        },
        "permalink": "/r/realmadrid/comments/1ldbdxd/how_do_i_tell_my_kids_that_sergio_ramos_in_201920/"
    },
    {
        "id": "1ldeyin",
        "author": "EngLitIsLit",
        "title": "Arda’s left foot &amp; Lukita’s love 🥹",
        "content": "I will forever miss Luka. What a legend. Seeing his full support and love here makes me really think he trained and supported Arda so well.\n\nFootball is a sport that is beyond shooting, passing, goals and assists.\n\nThese two went through so many hardships during their childhood; Arda saw poverty just like Luka when he was facing hardship during a war-flee. The connection and bond through this sport will last forever and I truly hope Arda carries the legacy.\n\nApologies for the long body, however, the love here just seemed way too authentic and has me 🥹.",
        "upvotes": 1184,
        "comments": 29,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6ze38eef9f7f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ldeyin/ardas_left_foot_lukitas_love/"
    },
    {
        "id": "1ldt2zi",
        "author": "Consistent-Bit7574",
        "title": "Four Convicted for Hate Crime Targeting Vinicius Jr. Before Copa del Rey Match [Official Announcement]",
        "content": "https://preview.redd.it/bx5vhvy4ui7f1.png?width=1010&amp;format=png&amp;auto=webp&amp;s=96bf96628daa405fc691f68366682ed48eef5f3c\n\n[https://www.realmadrid.com/en-US/news/club/announcements/comunicado-oficial-16-06-2025](https://www.realmadrid.com/en-US/news/club/announcements/comunicado-oficial-16-06-2025)\n\nOFFICIAL ANNOUNCEMENT. 16/06/2025\n\nReal Madrid C.F. wishes to announce that the 23rd Section of the Provincial Court of Madrid has today issued a guilty verdict against the four radical fans who, in the early hours of the morning of 25 to 26 January 2023, hours before the quarter final match of the Copa del Rey between Real Madrid C.F. and Club Atlético Madrid, S.A.D., hung a black inflatable doll from a bridge in the vicinity of Real Madrid City, simulating his hanging.  \n  \nThe defendants also unfurled a large banner at the site in which they publicly expressed their hatred of Real Madrid C.F. One of them also posted their actions on social media.  \nThe defendants have acknowledged the events, expressed their remorse and publicly apologised. Each of them has been found guilty of a hate crime and a threat against our player Vinicius Jr.  \nThe court sentenced one of the defendants to one year and ten months in prison and the others to one year and two months.  \n  \nThe defendants will also have to pay the fines handed down, will be banned from exercising professions related to education and sport for a further three years, and have been banned from approaching Vinicius Jr. within 1,000 metres and from communicating in any way with him for four years.  \n  \nIn addition, they will not be allowed to attend or go near any football stadiums where sporting events are taking place during this period of time, and they will have to complete a training programme on equal treatment and non-discrimination.  \n  \nThis criminal conviction comes in addition to the several already handed down in recent months for racist insults received by Real Madrid C.F. players at the stadiums of Zorrilla (Valladolid), Mestalla (Valencia), Son Moix (Palma de Mallorca) and Vallecas (Madrid), including in digital forums. In total, fourteen people have now been criminally convicted of racist attacks against players of our club.  \n  \nReal Madrid has joined its player in prosecuting this case, and in many others currently underway, and will continue to work to protect the values of our club and to eradicate any racist behaviour in the world of football and sport.",
        "upvotes": 100,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ldt2zi/four_convicted_for_hate_crime_targeting_vinicius/"
    },
    {
        "id": "1ldlaxm",
        "author": "AestheticEvan23",
        "title": "Trent Alexander Arnold  player cam",
        "content": "",
        "upvotes": 191,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1vids7va9h7f1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ldlaxm/trent_alexander_arnold_player_cam/"
    },
    {
        "id": "1le1ta7",
        "author": "vkmsd1807",
        "title": "Going to CWC‘25 Real Madrid vs Pachuca match in Charlotte on June 22nd. Any fan events or chances to meet the players?",
        "content": "Hey Madridistas. I’ll be attending my very first Real Madrid match, the Club World Cup 2025 game against Pachuca in Charlotte! Super excited😍\n\nJust wondering… are there any official events, open training sessions, or chances to meet the players around that time? Would love to make the most of the experience.\n\nAlso, is anyone else here going to the match? Would be fun to connect with fellow fans!\n\n¡Hala Madrid! 🤍\n",
        "upvotes": 16,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1le1ta7/going_to_cwc25_real_madrid_vs_pachuca_match_in/"
    },
    {
        "id": "1le0z1m",
        "author": "InitiativeLife6145",
        "title": "Visiting Miami for Madrid vs Hilal - anyone else going?",
        "content": "Posting for my friend u/obeiruty:\n\nHey all! I'm visiting Miami from NYC to watch the Real Madrid vs Al Hilal game tomorrow (June 18) at Hard Rock Stadium. \n\nI'm going solo and would love to link up with some fellow fans - whether it’s to carpool, share an uber, grab a drink before the game, etc. \n\nIf anyone’s going from the Miami area and wants to meet up, please let me know! \n\nHala Madrid!",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1le0z1m/visiting_miami_for_madrid_vs_hilal_anyone_else/"
    },
    {
        "id": "1ldbi6j",
        "author": "94Temimi",
        "title": "Flo meets the team in Florida ahead of our first match in CWC against Al Hilal",
        "content": "More on the official website",
        "upvotes": 503,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qM4ka5Gl28T_p84c0GeDwqvyjWiFyzLCa5fT3YfS-fg.png?auto=webp&amp;s=b37a2d99b35104b3beb2baeda432ee501c1a560e"
        },
        "permalink": "/r/realmadrid/comments/1ldbi6j/flo_meets_the_team_in_florida_ahead_of_our_first/"
    },
    {
        "id": "1ldfa56",
        "author": "AshRyes",
        "title": "Xabi's message to players from club sources",
        "content": "'Those who do not run and not make an effort will not play' \n\n\"You don’t have to run like defenders,” he said, “but you have to constantly pressure the defence.”\n\nIs it possible for a team to adapt to such a system in such less time, or this is just prep for the next season.\nWe might see good press from this team this season.",
        "upvotes": 262,
        "comments": 57,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ldfa56/xabis_message_to_players_from_club_sources/"
    },
    {
        "id": "1ldf618",
        "author": "EffectiveTie3144",
        "title": "OTD june 17 2007, Real Madrid beat 3-1 RCD Mallorca and won the 30-th La Liga title. José Antonio Reyes scored a brace (68', 82') and as M. Diarra scored once 79'",
        "content": "",
        "upvotes": 181,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/deLT400n0stWUHKIPFVN5j__tIVMhODGPW3uvJvxUrc.jpeg?auto=webp&amp;s=bdd6e57ad259d97075a8d1f3d95b81df94d63b9a"
        },
        "permalink": "/r/realmadrid/comments/1ldf618/otd_june_17_2007_real_madrid_beat_31_rcd_mallorca/"
    },
    {
        "id": "1lcw3bh",
        "author": "94Temimi",
        "title": "Bale's acceleration was truly something else!",
        "content": "",
        "upvotes": 2254,
        "comments": 74,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/x2p2jppy6b7f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lcw3bh/bales_acceleration_was_truly_something_else/"
    },
    {
        "id": "1le4qhm",
        "author": "channan2002",
        "title": "Madrid vs. Salzburg in Philly",
        "content": "For the Madrid vs. Salzburg game in Philly, does anyone know if there will be a madridista meet up spot, fan zone, or anything like that? It’d be fun to be a part of the energy with the other madridistas before the game? \n\nI haven’t seen anything on twitter but I have to think there is something at least in one of the parking lots before walking into the stadium. \n\nIf anyone else is going and knows of something, please let me know. ¡Hala Madrid!",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1le4qhm/madrid_vs_salzburg_in_philly/"
    },
    {
        "id": "1ld7h0e",
        "author": "AestheticEvan23",
        "title": "Top scorers in a single season and their amount of goals",
        "content": "",
        "upvotes": 462,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jiz8t1dtdd7f1.jpeg?auto=webp&amp;s=81a6a1a8c271da5db90ee00c18157065aadfaebc"
        },
        "permalink": "/r/realmadrid/comments/1ld7h0e/top_scorers_in_a_single_season_and_their_amount/"
    },
    {
        "id": "1ld35ke",
        "author": "Nyghl",
        "title": "It seems like they are vibing :D | Arda Guler, Posted on IG",
        "content": "",
        "upvotes": 738,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-q5TOvYRlFuf91ArieT6RTw59gYULBgUy_mVdLo5wTs.png?auto=webp&amp;s=0703ba96e3eb11e0c5b3a50e7ec0d9c2d5e5fc7b"
        },
        "permalink": "/r/realmadrid/comments/1ld35ke/it_seems_like_they_are_vibing_d_arda_guler_posted/"
    },
    {
        "id": "1ldnld8",
        "author": "ManuMora98",
        "title": "[Fem - Official] Pau Quesada is the new coach of Real Madrid until 2027",
        "content": "",
        "upvotes": 25,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ldnld8/fem_official_pau_quesada_is_the_new_coach_of_real/"
    },
    {
        "id": "1le757y",
        "author": "blueXwho",
        "title": "Anybody knows the Real Madrid itinerary for today's game?",
        "content": "I'm wondering if they're still staying in West Palm Beach and will travel by bus during the day or if they moved to a hotel closer to the stadium.\n\nI wanted to take my chances and try to catch them before they go to the stadium. Did anyone here go to their hotel when they arrived? Did they allow fans in a specific area?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1le757y/anybody_knows_the_real_madrid_itinerary_for/"
    },
    {
        "id": "1ld2hau",
        "author": "94Temimi",
        "title": "Summary of Real Madrid's second training session in Florida",
        "content": "*Real Madrid continued their preparations at The Gardens North County District Park in Palm Beach ahead of their opening game of the Club World Cup against Al Hilal at the Hard Rock Stadium in Miami (Wednesday, 9 pm CEST; 3 pm local time).*  \n  \n*The players got the session underway in the gym. They then completed general warm-up exercises on the pitch with and without the ball, followed by a tactical stage. Afterwards, they played a series of 6 vs. 6 games and finished the session with shooting practice. Camavinga continued with his recovery programme.*\n\n  \n\\-Official Real Madrid statement",
        "upvotes": 206,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9e1vs90sdc7f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ld2hau/summary_of_real_madrids_second_training_session/"
    },
    {
        "id": "1lcwd80",
        "author": "Pebbledthoughts",
        "title": "Real Madrid's Through-Ball leaders 2024/2025 La LIGA",
        "content": "",
        "upvotes": 350,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pb7bwzgy8b7f1.jpeg?auto=webp&amp;s=fd4d632f76666a1a7724d7b89679fa60d68cecf7"
        },
        "permalink": "/r/realmadrid/comments/1lcwd80/real_madrids_throughball_leaders_20242025_la_liga/"
    }
]