[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 486,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gsenwg",
        "author": "AutoModerator",
        "title": "JAKE PAUL v. MIKE TYSON Fight Megathread",
        "content": "&amp;#x200B;\n\nhttps://preview.redd.it/w8ywthvqp61e1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=95e740ea33c09fcd4e8c898ea8b46958cd88635d",
        "upvotes": 115,
        "comments": 5797,
        "media": null,
        "permalink": "/r/netflix/comments/1gsenwg/jake_paul_v_mike_tyson_fight_megathread/"
    },
    {
        "id": "1gvu8jm",
        "author": "Adamant_TO",
        "title": "Lawsuit Has Been Filed Against Netflix For Jake Paul vs. Mike Tyson Fight",
        "content": "",
        "upvotes": 457,
        "comments": 141,
        "media": null,
        "permalink": "/r/netflix/comments/1gvu8jm/lawsuit_has_been_filed_against_netflix_for_jake/"
    },
    {
        "id": "1gwhfzy",
        "author": "Atlast_2091",
        "title": "Wallace &amp; Gromit: Vengeance Most Fowl | Official Trailer | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gwhfzy/wallace_gromit_vengeance_most_fowl_official/"
    },
    {
        "id": "1gwjgy3",
        "author": "BunyipPouch",
        "title": "Malcolm Washington, the director and co-writer of Netflix's upcoming 'The Piano Lesson' is doing an AMA/Q&amp;A today in /r/movies. It stars Samuel L. Jackson, John David Washington (his brother), Danielle Deadwyler, Ray Fisher, and Corey Hawkins. It's live now, answers at 5 PM ET.",
        "content": "It's live here for anyone interested, Malcolm will be back for answers at 5 PM today:\n\nhttps://www.reddit.com/r/movies/comments/1gwhu40/hi_rmovies_i_am_malcolm_washington_director_and/",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gwjgy3/malcolm_washington_the_director_and_cowriter_of/"
    },
    {
        "id": "1gwjd3z",
        "author": "MovieGuyTravis",
        "title": "New Trailer for Netflix’s Black Doves with Keira Knightley",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gwjd3z/new_trailer_for_netflixs_black_doves_with_keira/"
    },
    {
        "id": "1gwi5es",
        "author": "madahitorinoyuzanemu",
        "title": "is it possible to search for orig + dub language?",
        "content": "I know from web browser I can search either for original language or for dubbed language, but is it possible to search for both? I wish to search for lets say Indian movies that have italian dubbing, or korean original language series with japanese dub. etc. I'm ok even with 3rd party sites that have such search, because I find it annoying to search for dub language but still have to check everything within dubbed versions",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gwi5es/is_it_possible_to_search_for_orig_dub_language/"
    },
    {
        "id": "1gwhk4o",
        "author": "indiewire",
        "title": "'Monsters' Star Cooper Koch Says Filming Episode 5 Required 'Having Two Brains'",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gwhk4o/monsters_star_cooper_koch_says_filming_episode_5/"
    },
    {
        "id": "1gvqu8y",
        "author": "BorvuxVI",
        "title": "Thoughts on Buy Now: The Shopping Conspiracy documentary? ",
        "content": "What are your thoughts after you've seen it? Does it make you rethink your own consumption habits?\n\nThe CEO of iFixIt (can't recall his name) mentioned that earbuds intentionally have a shelf life of around 18 months, which makes me reconsider buying them in the future, even though the earphone jack on my phone is gone.. ",
        "upvotes": 67,
        "comments": 134,
        "media": null,
        "permalink": "/r/netflix/comments/1gvqu8y/thoughts_on_buy_now_the_shopping_conspiracy/"
    },
    {
        "id": "1gwei87",
        "author": "FurgyKrueger",
        "title": "[Comedy] The S1E1 Podcast | Episode 189 - Unbreakable Kimmy Schmidt | Rating and reviewing the first televised episodes of the best &amp; worst sitcoms of all time | This week the boys took a look at Unbreakable Kimmy Schmidt, a 2015 Netflix original series | Available on all platforms | S1E1Pod.com",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gwei87/comedy_the_s1e1_podcast_episode_189_unbreakable/"
    },
    {
        "id": "1gwaqvj",
        "author": "Connect-Chemistry569",
        "title": "Suggest Some Amazing Documentaries!",
        "content": "I’m on the hunt for some truly incredible documentaries to watch! I’ve been exploring this genre lately and the ones I’ve seen so far have been nothing short of extraordinary—both technically brilliant and deeply insightful.\n\nFrom stunning visuals to thought-provoking narratives, I’ve been blown away by how documentaries can educate, inspire, and even challenge perspectives. Now I’m looking to expand my list and dive into more masterpieces.\n\nIf you have any recommendations that you feel are must-watch, whether they’re about nature, history, technology, human stories, or anything else, I’d love to hear them!\n\nThanks in advance for your suggestions!",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1gwaqvj/suggest_some_amazing_documentaries/"
    },
    {
        "id": "1gw1cmg",
        "author": "DA_9211",
        "title": "Hot frosty appreciation post",
        "content": "Can we talk about Hot Frosty and how it's Netflix's best movie?\nI thought it would be just another Christmas movie but it's full of surprises and effortlessly jumps from being somewhat of a classic fairy tale to experimental and existential with the snow man coming to live and all.\nIt was funny, sweet and a little scary and hot and an instant classic for me. \n\nTell me what you loved most about Hot Frosty?",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gw1cmg/hot_frosty_appreciation_post/"
    },
    {
        "id": "1gvlq7w",
        "author": "Whobitmyname",
        "title": "‘Alice in Borderland’ Season 3 To Return to Netflix in 2025",
        "content": "",
        "upvotes": 91,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1gvlq7w/alice_in_borderland_season_3_to_return_to_netflix/"
    },
    {
        "id": "1gwcxwv",
        "author": "bydevilz1",
        "title": "Are there any others similar? Squid Game / 8 Show / Alice in Borderland",
        "content": "Re watched Squid Game 2 weeks ago in preparation for season 2 which then had me rewatching Alice in Borderlands and then eventually finding The 8 Show and honestly i love them, great shows. \n\nI guess I like that genre of Game Show Horror / Thriller, I don't particularly think the entire appeal is because theyre Asian shows, more that they are well made shows in a concept that is quite interesting and relevant to the real world but isnt explored that well by western media, is there any shows or movies you would recommend? \n\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gwcxwv/are_there_any_others_similar_squid_game_8_show/"
    },
    {
        "id": "1gw73rd",
        "author": "HeliumRhenium",
        "title": "did anyone else catch this reference in hot frosty?",
        "content": "when Kathy and Jack are watching a movie that stars Lindsay Lohan and Kathy says \"she looks like a girl I went to high school with,\" it's a Mean Girls reference hahaha\n\nLacey Chabert was Gretchen Weiners in Mean Girls",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gw73rd/did_anyone_else_catch_this_reference_in_hot_frosty/"
    },
    {
        "id": "1gw9crn",
        "author": "norman3355",
        "title": "Seven Seconds",
        "content": "Netflix offering that matches the best that HBO had to offer. Good writing, great cast, cinematography to match. And the first two eps directed by A list directors, Jonathon Demme and Jon Amiel. My view: great directors sign on to great screenplays regardless of distribution. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gw9crn/seven_seconds/"
    },
    {
        "id": "1gwc08n",
        "author": "HH__Toronto",
        "title": "Anything Like “The Substance”",
        "content": "Just watched The Substance on a different platform and had my mind blown on how crazy and insane but how great the movie was. Anyone know of any similar movies that Might be on Netflix, or in general. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gwc08n/anything_like_the_substance/"
    },
    {
        "id": "1gw420c",
        "author": "HehroMaraFara",
        "title": "Daddio (2024)",
        "content": "I had no preconceptions or foreknowledge about the movie. I added it to “remind me” because of the names. \n\nThat being said, here’s my unfiltered view. First off, presenting Sean Penn as “middle aged man” is like saying Donald Trump is a centrist. It’s a gross mischaracterization and immediately sets the wrong vibe. While I get he’s not supposed to ultimately be sinister, it’s impossible to not see the red flags that any sane woman alone at night in a car with him would not have waving in her face furiously. \n\nThe conversation is interesting and not dissimilar from some I have had in my many (mostly Uber) rides with a driver. I generally prefer dead silence, but if the ride is longer than 30 or 45 minutes it’s almost impossible to avoid. \n\nIn my experience through a variety of avenues, guys that tend to be this blunt and aggressively open right off the bat end up having not great intentions. It’s the “fly off the handle” type that expects some result that if it does not go right to plan it’s the nuclear option. \n\nThe movie is ok, the scenario is hard to keep realistic in your head and the casting is bad. Someone like Ruffalo or Renner would have been far more palatable because, you know, they are actually middle aged and not 60+ year old men with sexual violence histories in real life. \n\nWatchable but not award worthy by any means. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gw420c/daddio_2024/"
    },
    {
        "id": "1gwgd8b",
        "author": "Away-Explanation8648",
        "title": "„Unbelievable” series on Netflix - wtf",
        "content": "I finished this series yesterday and I can’t get over it. The man that raped Marie was definitely the other brother!!! \n- the convicted brother had the oval, full face and his body was shown full for a reason - the guy who raped Marie has triangle shaped face and was much slimmer\n- he said to her after the rape „I thought it would feel better” - it was his first time. Marie’s rape wasn’t the first one\n- he didnt make her shower - it was his always routine \n- the pictures of her were on a totally different pendrive and they said the „he” tried to delete them - why only hers when he was having all of other victims and why they were on a different pendrive? \n\nIts so obvious for me that it was this second brother. I can’t google anyone who catched it too. \n\nPlease, anyone?\n\n\n",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1gwgd8b/unbelievable_series_on_netflix_wtf/"
    },
    {
        "id": "1gvr51g",
        "author": "misana123",
        "title": "‘A Good Girl’s Guide to Murder’ Renewed for Season 2 at Netflix",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gvr51g/a_good_girls_guide_to_murder_renewed_for_season_2/"
    },
    {
        "id": "1gvzux0",
        "author": "CowsAreCool87",
        "title": "“Nobody Wants This” features some narcissistic leads ",
        "content": "Morgan crashing the bar mitzvah knowing she was not invited and knowing the family did not want her there, and that a grieving woman would suffer by her presence is a good example. Or at the very least they knew that Morgan’s presence would stir up drama. This event was an important rite of passage for the teenage niece and should have been a time for the family to focus on her. It was not about Morgan or her drama. It was not about Joanna or her drama. \n\nJoanna crashes Noah’s sermon unannounced (place of work) and is pissed she has to wait 15 minutes for him. He did his absolute best to rush out of there, but by the time he finds Joanna, she has already had her sister show up to bitch and *rescue* her. Maybe this isn’t narcissistic as much as a weird combo of needy, insecure and demanding. \n\nYes, Joanna confessed to going through the private box. But she failed to mention that it wasn’t just her snooping, but she was with her mom and her sister, all of them sitting around mocking Rebecca and laughing and making a show out of looking through somebody’s private belongings. That is more than just letting insecurities get the best of her, this came across as a symptom of a pathological lack of empathy and a casual disregard for personal boundaries, two signs of narcissism. \n\nIn the ick episode, Joanna leaves Noah alone with her nutty parents because she gets the ick. When you are introducing a new dating partner to your family, your role is to make that person feel comfortable around all these new people and support them. But she disappears, leaving him to wonder what the hell happened and then he eventually finds her out by the pool, where she’s in some sort of crisis about his blazer. If someone I was newly seeing did that to me, I’m sorry, but there’d be some boundaries drawn. \n\nThis last example is a bit harder to explain, but I’ll try. Why was Morgan completely morally expunged once Joanna finds out she had “told the truth” about what Rebecca had told her at the bar? Morgan’s behavior itself was callous and cruel. That is what should have been addressed. \n\nObviously characters shouldn’t be perfect, but the lack of awareness from the writers is what bothered me. They seemed to think that Morgan and Joanna were the quirky, sassy, loveable kind of flawed, not like an untreated personality disorder kind of flawed. \n\nI wouldn’t give a shit, except for the fact that I just keep hearing about what an emotionally aware show this is, how healthy the relationship is, how much people identify with Joanna. I feel alone in this and so I thought I’d throw it out there to see if anyone feels the same way. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gvzux0/nobody_wants_this_features_some_narcissistic_leads/"
    },
    {
        "id": "1gvxo5k",
        "author": "Horror_Effective12",
        "title": "'A Virtuous Business' (K-drama) Review - Empowering or rushed?",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gvxo5k/a_virtuous_business_kdrama_review_empowering_or/"
    },
    {
        "id": "1gvn2ty",
        "author": "bronzegods",
        "title": "Premiere of Tyler Perry’s Netflix Special \"The Six Triple Eight\" - Premiering Now",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gvn2ty/premiere_of_tyler_perrys_netflix_special_the_six/"
    },
    {
        "id": "1gvolpw",
        "author": "indiaweekly",
        "title": "Robert De Niro to star in Netflix drama 'Zero Day'",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gvolpw/robert_de_niro_to_star_in_netflix_drama_zero_day/"
    },
    {
        "id": "1gvof84",
        "author": "Robemilak",
        "title": "Genesis Rodriguez in Talks to Join Netflx's ‘The Night Agent’",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gvof84/genesis_rodriguez_in_talks_to_join_netflxs_the/"
    },
    {
        "id": "1gv8rhd",
        "author": "Metro-UK",
        "title": "Joy actor James Norton says he 'took IVF for granted' before starring in Netflix's historical drama",
        "content": "James Norton admits he knew very little about IVF before playing Robert ‘Bob’ Edwards in Joy.\n\nJoy tells the tale of three British pioneers who transformed the lives of millions of families around the world with the invention of in vitro fertilisation — or IVF.\n\nThe actor had encountered couples going through the IVF process, which marked the beginning and end of his understanding. \n\nHe said: ‘I know some very beautiful children who have been gifted to us through this amazing science so that was my knowledge of it and I took it for granted,’ he continued.\n\nBut learning about IVF’s origin story, he said, was a ‘really lovely journey’\n\nWhen you Google ‘who invented IVF?’ two names appear in bold at the top of the search box. Dr Patrick Steptoe (played by Bill Nighy) and scientist Robert ‘Bob’ Edwards. \n\nBut Google's results leave a gaping hole in the history of the creation of IVF – the vital contributions of nurse and embryologist Jean Purdy (Thomasin McKenzie) who was only commemorated by the Royal Society of Biology in 2015. \n\nIn the end, it was Jean who provided not only the ‘last piece of the puzzle that made IVF possible’ but also the voice desperately needed to bring this ‘incredible’ part of British history to the big screen.\n\n‘If this film is a reminder of the sacrifices that have been made by women, some good men, but mostly women, and how therefore we should protect that progress at every cost, then fantastic,' said Norton.\n\nYou can [**read the full article here**](https://metro.co.uk/2024/11/19/james-norton-i-took-ivf-granted-learned-shocking-truth-21940171/)",
        "upvotes": 37,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gv8rhd/joy_actor_james_norton_says_he_took_ivf_for/"
    },
    {
        "id": "1gvt1v8",
        "author": "Atlast_2091",
        "title": "Pokémon Horizons: Season 2 | Coming February 7 to Netflix | Official Trailer",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gvt1v8/pokémon_horizons_season_2_coming_february_7_to/"
    },
    {
        "id": "1gw6pat",
        "author": "Glittering-Tax-2734",
        "title": "I feel betrayed that never have I ever made the build up to Devi losing her vir**n*ty completely pointless. ",
        "content": "I may be a person that likes some pieces of mature media but the issue I have with never have I ever is that they built up Devi doing you know what but they made it age like gross milk, instead of showing Devi and Ben ***king it just cut to them in bed. Why would they build it up for 3 season only to have them throw it all in the trash? I feel upset because 1.they made all that built up completely pointless, and 2.because that was there only chance to show maitrey ramakirshnans n*de butt and they waisted it. If she said that filming those scenes was no big deal then why not show it? they built up Devi doing you know what and even one of the posters for the series shows Devi in some blankets. They made it seem important but instead they pulled a megamind 2 and made everyone angry, and the worst part is the creator of the show Mindy kaling confirmed we won’t get any new content with Devi meaning we’ll be stuck longing for an important plot line that never happened and also seeing devis a**. you’re telling me you can show a deer man becoming a black goopy eldritch horror straight out of Trevor Henderson with an unsettling lullaby but you can’t show two friends getting romantic? hopefully Mindy kaling makes up for this. Thoughts?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1gw6pat/i_feel_betrayed_that_never_have_i_ever_made_the/"
    },
    {
        "id": "1gw1kls",
        "author": "Away-Explanation8648",
        "title": "Unbelievable - something is not right ",
        "content": "Hey, \n\nI just finished Unbelievable serie.\n\nI can’t find anyone thinking about it too but I just can’t get over it.\n\nWhen Marie was raped she said that the rapist told her that he thought it will feel better. So he did this for the first time. Her rape wasn’t the first one. Also the rapist looked much more slimmer than the convicted McCarthy brother. The other thing, the Marie’s photos were on completely different pendrive and were deleted (tried to be). For me it’s pretty sure it was the other brother. . The room of convinced one with all his photos and stuff and camera was completely open, he could easily came there and saw all this stuff. They shared the car also. Anyone?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gw1kls/unbelievable_something_is_not_right/"
    },
    {
        "id": "1gvgxl6",
        "author": "messengers1",
        "title": "Netflix Showcases Its Upcoming International Programs.",
        "content": "[https://deadline.com/2024/11/netflix-international-tv-series-2025-1236181090/](https://deadline.com/2024/11/netflix-international-tv-series-2025-1236181090/)\n\n[https://deadline.com/2024/11/netflix-international-movies-2025-1236180976/](https://deadline.com/2024/11/netflix-international-movies-2025-1236180976/)\n\nThis is what I like about Netflix for international programs in drama side. We could see more new faces around the world.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gvgxl6/netflix_showcases_its_upcoming_international/"
    },
    {
        "id": "1gvfima",
        "author": "ExpensiveKoala1303",
        "title": "KAOS",
        "content": "I know I’m late to the KAOS party, but I just finished it and I’m speechless. What a well executed, beautifully shot, incredibly provoking, and emotionally heavy show. From the characters, to the music, to the dialogue, I am blown away. There are so many parallels between their world and our world today that were so meaningful. I am so, so heartbroken that it was cancelled. I didn’t know where else to post this, but I just didn’t want to be alone with my thoughts. I’m so upset, what a mistake that it ended.",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1gvfima/kaos/"
    },
    {
        "id": "1gvn0r8",
        "author": "thaman05",
        "title": "Is a Netflix subscription required to play games on mobile?",
        "content": "Me and some friends want to play the new Squid Game Unleashed game on Android and iPhone. But when opening the game, it asks to login to Netflix account or create an account. Some people in our group don't have Netflix subscriptions. Is a subscription required or can anyone just create a free Netflix account? Or is there a way to play through in-app purchase? The app store description doesn't mention that a subscription is required.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gvn0r8/is_a_netflix_subscription_required_to_play_games/"
    }
]