[
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 24,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lz2vux",
        "author": "PulIthEld",
        "title": "Stop showing me games, I have never interacted with one.",
        "content": "Every time I open Netflix now its some stupid game.  Why?  That's not what I go to Netflix for.  I dont want their ads blaring every time I open Netflix.",
        "upvotes": 202,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1lz2vux/stop_showing_me_games_i_have_never_interacted/"
    },
    {
        "id": "1lz3wrl",
        "author": "itsnobigthing",
        "title": "14 hour car journey; need a series that’s so addictive I’ll be glad I’m not there yet",
        "content": "Ideally seeking one of those shows where it would take a physical intervention to stop you watching the next episode. Like Severance, or early Lost, or similar.\n\nBut I’m down for pretty much anything except horror, or things about gangs of men doing crime). Just something compelling and bingeable that I haven’t seen! 🙏🏻\n\nNo subtitles pls as I get car sick if i read them\n\n\n\n",
        "upvotes": 27,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1lz3wrl/14_hour_car_journey_need_a_series_thats_so/"
    },
    {
        "id": "1lz6nrx",
        "author": "Timely-Hovercraft-76",
        "title": "I actually enjoyed the waterfront.",
        "content": "I actually enjoyed waterfront quite a bit. I made a post about a month ago or so asking how it is and I got some mixed inputs. It took like 2 episodes to get into it but after that, I quite enjoyed it. I liked the setting, the overhead shots of the area, the action was pretty good, son was a realistic character imo, I liked seeing Holt McCallany back in action and the plot was basic in ways but easy to follow and fun to watch. It’s not ozark but it’s only 1 season compared to like 5. I would give it a 7-8 out of 10. Topher grace’s character was pretty fun as well, he’s a good actor. All in all, a pretty fun watch. ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lz6nrx/i_actually_enjoyed_the_waterfront/"
    },
    {
        "id": "1lzh4sh",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix’s Top Movie Right Now Is a Sci-Fi Thriller With Just a 22% Critics Score on Rotten Tomatoes",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lzh4sh/netflixs_top_movie_right_now_is_a_scifi_thriller/"
    },
    {
        "id": "1lzct7o",
        "author": "stravocadomf",
        "title": "Ziam movie",
        "content": "I’m gonna be completely honest. I love anything zombie related but MAN, this movie really let me down.\n\nFor starters you don’t even understand why this is all happening. you just just some bs infected fish plot?\n\nThen the whole movie is all plot armor. (I know I know it’s literally zombies anyways, but still). besides the main character everyone else is really annoying bahaha. \n\nI repeat: literally half this movie doesn’t make any sense. barely any context to half the stuff going on lmao. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzct7o/ziam_movie/"
    },
    {
        "id": "1lzhfwd",
        "author": "jonhahaha_1",
        "title": "movies keep displaying in 480p",
        "content": "Hello, I am a PC user and use Chrome primarily to watch Netflix. Some movies keep only displaying in 480p. I'm on the Netflix standard plan. I've tried restarting the browser, reloading the website, signing out and back in, switching to Microsoft Edge, and none of this has solved this issue. I've only started experiencing this issue within the last two months and it only happens with some movies while other movies will show the full 1080p. I'm also sure it's 480p because I checked using the Ctrl + Alt + Shift + D shortcut to see more information. I'm also quite certain it's not my internet as my download speed ranges anywhere from 30mbps to 120mbps. Has anyone else experienced this and/or know how to fix it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzhfwd/movies_keep_displaying_in_480p/"
    },
    {
        "id": "1lzgyvw",
        "author": "BIxnco",
        "title": "How to bypass ‘Your device isn’t part of the netflix household for this account’ for iphone",
        "content": "I was watching on data earlier when I was out and it was fine but when i got home and connected to wifi and tried to watch, i got hit with that. Tried to use data to watch and it still doesn’t work. \n\nAnyway to bypass it on mobile? I’m sharing with my friend so it’s not my account",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzgyvw/how_to_bypass_your_device_isnt_part_of_the/"
    },
    {
        "id": "1lzgowe",
        "author": "DiamondDoge11",
        "title": "Oa",
        "content": "With a huge fan base why would Netflix not bring back the show Oa? From what I understand and viewed myself it was a pretty darn good show. I’ve tried to do a little research, but have not found a reason why they discontinued to show.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzgowe/oa/"
    },
    {
        "id": "1lzgkhv",
        "author": "randomnoob22",
        "title": "Bullet Train Explosion",
        "content": "This is honestly the best movie I’ve watched in a long time. The acting on this was insane, and the plot was deep and the tactics used in the rescue operations were crazy. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzgkhv/bullet_train_explosion/"
    },
    {
        "id": "1lzgadk",
        "author": "thewaterboi241",
        "title": "live streaming",
        "content": "so I want to live stream Netflix for a few friends but Netflix's terms of services say that i can't legally do that without permission.\n\nSo how do I get this permission, is there a form, application, or something I fill out, to get the rights to live stream it?\n\nI'm not gaining any financial benefit to it I just want to watch movies with friends who don't live near me",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lzgadk/live_streaming/"
    },
    {
        "id": "1lzfgsx",
        "author": "Xerasi",
        "title": "Netflix lowering resolution to 140P on windows in the Netflix app and Edge",
        "content": "It starts the video fine and then slowly lowers it over like a minute. I don't understand why. I have 1gig internet and connected with ethernet. It just randomly started doing this (granted I haven't used Netflix on windows in the last 6 months) but it was fine before that. netflix on my phone is fine though.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lzfgsx/netflix_lowering_resolution_to_140p_on_windows_in/"
    },
    {
        "id": "1lyb0yq",
        "author": "Altruistic_Lad",
        "title": "Dear Netflix: Registering Is Now Worse Than Tedious",
        "content": "Netflix apparently has never heard that folks can have more than one residence. Does it learn that you visit the same places over and over. Oh no. You have to jump through all the registration and security hoops OVER AND OVER despite the fact that you've paid for unlimited use. Wake up, Netflix. You're not irreplaceable. ",
        "upvotes": 454,
        "comments": 92,
        "media": null,
        "permalink": "/r/netflix/comments/1lyb0yq/dear_netflix_registering_is_now_worse_than_tedious/"
    },
    {
        "id": "1lzdf0e",
        "author": "lmmk",
        "title": "the squid game cast are so sweet!!",
        "content": "I interviewed some of the cast of Squid Game for work and it’s been such a wild journey to follow how this show has blown up over the past few years. When I first got into entertainment journalism, I never imagined I’d be able to interview people from my own cultural heritage in a show that’s so deeply embedded in South Korean culture, yet soooo insanely popular all over the world. Hoping to get even more K-content coverage out there and I want to it justice considering its immense global popularity. (Also if you’re Korean too, please don’t come for my dodgy Korean at the beginning. Ya girl is trying to get better!!)\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzdf0e/the_squid_game_cast_are_so_sweet/"
    },
    {
        "id": "1lz8or5",
        "author": "SlateAlmond90",
        "title": "Is there a way to set a profile on an account to only show movies and shows that are in English?",
        "content": "My mom doesn't like watching movies and shows that she has to read (me and my dad keep telling her she missing out on some great ones). Is there a way to set her profile to only show movies and shows that are primarily in English (I say primarily because she will watch ones that have some subtitles, so long as they're not all full of subtitles she has to be constantly reading).",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lz8or5/is_there_a_way_to_set_a_profile_on_an_account_to/"
    },
    {
        "id": "1lzd3z1",
        "author": "yadayodayada",
        "title": "The alpinist not on Netflix?",
        "content": "Wasn’t the Alpinist originally on Netflix? I guess I thought it was an original but it’s not on there anymore.  I wanted to watch it. \nWhen did it leave? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lzd3z1/the_alpinist_not_on_netflix/"
    },
    {
        "id": "1lzcgnt",
        "author": "Main-Low741",
        "title": "Can you tell which game this song is from? 🎵🌀",
        "content": "Season 3 is finally out! I’m currently watching the jump rope game. But honestly... I still think the spinning game in Season 2 was way more intense and fun to watch!\n\nhttps://reddit.com/link/1lzcgnt/video/a5nocw67ircf1/player\n\n(This song is from the Muro Box app’s library, arranged by Jeffwong.)\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lzcgnt/can_you_tell_which_game_this_song_is_from/"
    },
    {
        "id": "1lz7she",
        "author": "BigRecommendation709",
        "title": "Ozark?",
        "content": "What shows are similar to ozark? I really loved the plot of ozark and the characters. Since then I’ve watched the show three times. lol. Need something else.  ",
        "upvotes": 2,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1lz7she/ozark/"
    },
    {
        "id": "1lysljv",
        "author": "Thin_Smile2722",
        "title": "Need recommendations to watch",
        "content": "I am currently having free time with no pending work or anything and thinking to start a new series/movie. \n\nPs: recommend series other than squid games ",
        "upvotes": 14,
        "comments": 100,
        "media": null,
        "permalink": "/r/netflix/comments/1lysljv/need_recommendations_to_watch/"
    },
    {
        "id": "1lza5tf",
        "author": "Shapeshiftergaming",
        "title": "Show \"Lost In Space\" doesn't load.",
        "content": "Whenever we try to start watching this specific show on our living room TV or one of our phones, it simply will not work and asks us to unplug our TV for 30 seconds. Yet for some reason the show will load on the TV in the bedroom. Any ideas?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lza5tf/show_lost_in_space_doesnt_load/"
    },
    {
        "id": "1lyznkg",
        "author": "doorguy8888",
        "title": "Carry-On review",
        "content": "Hello! I just watched the Carry-On movie. I just got netflix again and it was one of the first movies that popped. I was interested because I'll be flying for the first time in a couple of months, hahaha. Crazy right? Watch a movie about airport devastation before my first flight ever 😂.\n\nI saw Jason Bateman's face, and I still can't picture him as a serious role actor. I think of him more from movies like \"Office Christmas Party\" or \"Identity Thief\". Goofy movies. But he did an amazing job acting and I was thoroughly impressed.\n\nI liked the suspense that the movie carried and all the twists it presented.\n\nHave you watched Carry-On? How did you like it?",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lyznkg/carryon_review/"
    },
    {
        "id": "1lyi1um",
        "author": "Beastmaster122810",
        "title": "It has no right to be as good as it is",
        "content": "",
        "upvotes": 60,
        "comments": 12,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/p0n96mk91kcf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lyi1um/it_has_no_right_to_be_as_good_as_it_is/"
    },
    {
        "id": "1lz8rok",
        "author": "Chromium4",
        "title": "Almost Cops",
        "content": "Almost Cops or Bad Boa's is Netflix's latest Norwegian import in a seemingly never ending series of them. Some have been good like the sci-fi disaster films like The Wave but most have been not very watch worthy which is the case with Almost Cops. The humor is lacking and the script/plot is almost not there. Netflix, if you're going to flood the site with Norweigian-language films then at least give us some good ones. No matter your native tongue a bad movie is a bad movie.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lz8rok/almost_cops/"
    },
    {
        "id": "1lzemyf",
        "author": "Individual_Let8998",
        "title": "F  you Netflix",
        "content": "https://preview.redd.it/2ruwaa654scf1.png?width=1119&amp;format=png&amp;auto=webp&amp;s=66749aad4a418dd3e138b17c8c0864fdc57de053\n\nI know, I was there to cancel it, this is not a reminder, its a deliberate attempt at annoying because we cancelled their subscription",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lzemyf/f_you_netflix/"
    },
    {
        "id": "1lz6pd9",
        "author": "alienboy222",
        "title": "How to add profile?",
        "content": "My parents are allowing me to use their account, and I wanted to set up my own profile. However on the profile screen, I don’t see an Add Profile selection. This is on a Roku if that matters. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lz6pd9/how_to_add_profile/"
    },
    {
        "id": "1lz64p0",
        "author": "ArcherIll6233",
        "title": "Adding members",
        "content": "So I'm from the UK but set up my Netflix account while living in Germany. I moved back to the UK a while ago but haven't changed anything since the billing goes through my PayPal. My parents have been using my account for years but have finally been locked out so I said I'd add them as members to my account. I tried this but we found that they can't join as they're not in Germany (where I set up the account) and they receive the error \"you must be in the same country to activate. Extra member slots need to be activated in the same country where the person who invited you started their membership\"\n\nI saw on the Netflix website that you could cancel your membership and restart your membership again in the next billing period to change your country. Just wanted to confirm whether this would work to get my parents added to my account and whether the UK would be the country where I (re)started my membership.\n\nAny help would be appreciated",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lz64p0/adding_members/"
    },
    {
        "id": "1lz5l57",
        "author": "Even-Jury-4552",
        "title": "Compression and color",
        "content": "I was watching bullet train on netflix and the compression was so bad I decided to switch the streaming platform and I noticed that : \n\n[Netflix](https://preview.redd.it/e9fye7rqupcf1.png?width=3452&amp;format=png&amp;auto=webp&amp;s=0d12dfd83bcdfdf5491f8bd4c53933aa68628d66)\n\n[Prime](https://preview.redd.it/ddml97rqupcf1.png?width=3456&amp;format=png&amp;auto=webp&amp;s=18d5cd8736e8ce6917edd0f30a1fe4e9a323003b)\n\n1- The compression is less in Prime \n\n2- Why is the color grading is so different from Prime ? \n\n  \nSettings are set for the highest quality on both platform, why is netflix doing that ? Or is it a completely different file ?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lz5l57/compression_and_color/"
    },
    {
        "id": "1lz03du",
        "author": "PAPAmagdaline",
        "title": "show similar to the survivors?",
        "content": "Okay just finished it, does anyone else know show with similar vibe ? Small island, thriller, secrets that’s been hushed hushed. the scenery was beautiful.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lz03du/show_similar_to_the_survivors/"
    },
    {
        "id": "1lz5eax",
        "author": "Sufficient-Pickle632",
        "title": "Is there a way to filter by Country of Origin?",
        "content": "Are there any fantastic ways to sift through films that were specifically produced in South Korea, India, or the United States? I'm eager to discover some gems from these vibrant film industries!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lz5eax/is_there_a_way_to_filter_by_country_of_origin/"
    },
    {
        "id": "1lyvc9p",
        "author": "Wonderful-Wafer-5874",
        "title": "Subtitles for English dialogue on foreign shows",
        "content": "So I'm watching squid game in the original Korean language of course but when it comes to the vips who are speaking English there are no subtitles which is annoying because i need subs for everything! Is there an option to add this on? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lyvc9p/subtitles_for_english_dialogue_on_foreign_shows/"
    },
    {
        "id": "1ly50vd",
        "author": "STARRIMS",
        "title": "LUPIN is my most favorite series ever.",
        "content": "I have tried so many series in Netflix, and I don't even last one episode; from Money Heist to House of Cards to Dark. Whereas I was so Intrigued to Lupin in 2023, I login Netflix just to Re-Watch LUPIN again and again.\n\nI even stared reading Arsene Lupin and love my time in it. Eagerly waiting for Lupin part 4.\n\n  \nI am just asking who explore Netflix a lot, is there anything alike LUPIN?",
        "upvotes": 63,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1ly50vd/lupin_is_my_most_favorite_series_ever/"
    }
]