[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1qf6srx",
        "author": "SensitiveWeb2571",
        "title": "Femboy",
        "content": "Femboy a Torino? Per amicizia/chat. \nM20, amico di una sissy ma non sono un femboy",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qf6srx/femboy/"
    },
    {
        "id": "1qersct",
        "author": "boluslai",
        "title": "Bere, ballare, uscire a Torino",
        "content": "Ho bisogno di un po' di consigli.\n\nPer ragioni di lavoro ho girato un bel po' per città italiane ed europee. Ora sono a Torino e ci rimarrò per molto tempo.\n\nSono abituato a frequentare posti molto informali dove poter bere, conoscere gente, magari con musica dal vivo o dj set attorno alla mezzanotte. Insomma, in Italia ho sempre frequentato i circoli Arci e strutture simili. Ma su Torino sono ancora disorientato essendo arrivato da poco.\n\nAvete consigli? In quali zone si raduna la \"movida\" (parola orrenda) un po' più alternativa? Quali sono i posti migliori per sentirsi un po' più in compagnia o conoscere qualcuno? Grazie!",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qersct/bere_ballare_uscire_a_torino/"
    },
    {
        "id": "1qeqjl7",
        "author": "flor3ncia",
        "title": "Cerco edicole sacre in maiolica per esterno – Madonna di Superga / Consolata",
        "content": "Ciao a tutti!\n\nNon vivo in Italia, ma sto cercando edicole sacre in maiolica o ceramica smaltata per esterno raffiguranti la Madonna di Superga (Madonna delle Grazie) oppure la Madonna della Consolata.\n\nConoscete artigiani o botteghe che le realizzano su commissione o che le vendono già pronte?\n\nAllego alcune foto come riferimento.\n\nGrazie mille",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pax7h5f7prdg1.jpeg?auto=webp&amp;s=c502278699d01c2191d3c128d9e4352be1c2073e"
        },
        "permalink": "/r/torino/comments/1qeqjl7/cerco_edicole_sacre_in_maiolica_per_esterno/"
    },
    {
        "id": "1qebkfj",
        "author": "happy_arounding15",
        "title": "Quali sono i cinema più belli in cui vedere un film o che vale la pena visitare a Torino?",
        "content": "",
        "upvotes": 9,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3xhace1vvhdg1.jpeg?auto=webp&amp;s=d8229bdb4bbc69e17f54c01050df20607d99e41f"
        },
        "permalink": "/r/torino/comments/1qebkfj/quali_sono_i_cinema_più_belli_in_cui_vedere_un/"
    },
    {
        "id": "1qepyff",
        "author": "hardymary2000",
        "title": "ciao! scam?",
        "content": "Qualcuno ha esperienza con l'agenzia Turin Loft &amp; Apartments a Torino? Ha un sito web e un account su diverse piattaforme, ma è stato molto facile trovare l'appartamento.\n\nHo fatto una videochiamata ed è andato tutto bene, ma no, mi chiedo.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1qepyff/ciao_scam/"
    },
    {
        "id": "1qekm4y",
        "author": "Small-Cap-2827",
        "title": "🎓 Looking for students preparing for CENT-S (Italy) — let’s study together on Zoom",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qekm4y/looking_for_students_preparing_for_cents_italy/"
    },
    {
        "id": "1qdg8ka",
        "author": "Minestrellow",
        "title": "Una fetta di limone vale 1,50 euro in più sullo scontrino, da Starbucks a Torino",
        "content": "",
        "upvotes": 33,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6qr9np4drhdg1.jpeg?auto=webp&amp;s=6d4c40dd628fb2014fee35de174970e68c639d3c"
        },
        "permalink": "/r/torino/comments/1qdg8ka/una_fetta_di_limone_vale_150_euro_in_più_sullo/"
    },
    {
        "id": "1qdhbw3",
        "author": "TraditionMassive4244",
        "title": "TEMPOCASA",
        "content": "Ho una domanda, qualcuno ha lavorato per tempocasa?  \nCosa ne pensate degli orari di lavoro 6 giorni su 7 dalle 9/19:30 con due ore di pausa, ed eventi obbligatori fuori dagli orari di lavoro, a me sinceramente sembra una setta.\n\nE' legale che mi obblighino a partecipare a degli eventi fuori dall'orario di lavoro?  \nCioè venissi pagato almeno, mi sembra assurdo, voi che ne pensate?",
        "upvotes": 20,
        "comments": 33,
        "media": null,
        "permalink": "/r/torino/comments/1qdhbw3/tempocasa/"
    },
    {
        "id": "1qdps6h",
        "author": "DryTumbleweed2455",
        "title": "Dove ritiro il kit per la raccolta differenziata?",
        "content": "Sul volantino dell'amiat iren a cui fare riferimento c'è scritto di andare dalla sala \"Antico Macello sul Po\" in via Matteo Pescatore 7, ma io ho trovato solo una palestra di yoga (?). E non trovo informazioni utili su dove sia effettivamente un punto di ritiro per il kit. Per favore scade il 29 gennaio la facoltà di ritirare questo kit, aiutatemi :(",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1qdps6h/dove_ritiro_il_kit_per_la_raccolta_differenziata/"
    },
    {
        "id": "1qdepu8",
        "author": "Gloomy_Sky1381",
        "title": "Come migliorare la SEO del mio sito a Torino?",
        "content": "Sto cercando di aumentare la visibilità del mio sito a Torino, ma non so da dove iniziare. La SEO mi sembra un casino complicato e sono indeciso se prendere un consulente freelance o un’agenzia più grossa. Quali sono i vantaggi di un consulente SEO freelance rispetto a un’agenzia grande? Avete qualche consiglio o raccomandazione?",
        "upvotes": 19,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1qdepu8/come_migliorare_la_seo_del_mio_sito_a_torino/"
    },
    {
        "id": "1qdgbl0",
        "author": "Few-Cheetah8476",
        "title": "Diabetologo per insulino resistenza",
        "content": "Sto cercando unə diabetologə che mi segua per una questione specifica: PCOS e insulino resistenza. Sto avendo molte difficoltà a trovarne uno, perché mi è capitato che mettessero in dubbio la diagnosi guardandomi a occhio (sembro apparentemente magra, perché sono alta) senza controllare le analisi che comprovano la situazione. Ora, sono anni che vado avanti solo con l'aiuto della ginecologa, la quale ha detto che è il momento di essere seguita da un diabetologo seriamente, prima che la l'insulino resistenza non trattata mi faccia sviluppare il diabete. \nVorrei quindi il nome di unə specialista che sia formato su questa situazione, perché ho già speso molti soldi in giro con dottori che non sapevano trattare l'argomento.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qdgbl0/diabetologo_per_insulino_resistenza/"
    },
    {
        "id": "1qcjogw",
        "author": "PreviousPassage3274",
        "title": "Il sistema sanitario Torinese è in bug. Aiutatemi!",
        "content": "Venerdì mi sono rotto la caviglia, così sono andato al pronto soccorso del CTO. In tempi relativamente brevi mi hanno fatto una lastra e mi hanno ingessato. Devo tenere il gesso due settimane e poi fare nuovi controlli ai legamenti.\n\nEcco. Prima di dimettermi mi hanno dato un plico di fogli, tra cui c’era l’impegnativa per prenotare la visita per rimuovere il gesso e controllare la caviglia. Mi hanno inoltre spiegato come fare a prenotare tramite impegnativa e fatto capire che sarebbe stato difficile.\n\n**Non è difficile, è impossibile**. Sul sito del CUP (così come anche dall’app), non ci sono posti disponibili MAI. Inteso che io dovrei toglierlo il 23 gennaio, ma se metto come range di date, per esempio, dal 22 gennaio al 15 febbraio comunque non esce nessuno slot. Non ci sono slot neanche a Marzo, per dire.\n\nAllora tento per via telefonica al numero indicato. Si può chiamare solo dal lunedì al venerdì dalle 13 alle 14.45. Ieri e ieri l’altro, durante quella ora e quarantacinque, ho chiamato a ripetizione ma ogni volta spunta una voce automatica che dice “nessuno dei nostri operatori è disponibile, la preghiamo di riprovare più tardi.\n\nOra. Non è una novità per me. In passato avevo bisogno piuttosto urgente di una visita al CEMUSS e avevo passato così tante ore in attesa al telefono che alla fine avevo deciso di andare da privato.\n\nIn questo caso vorrei continuasse a seguirmi la dottoressa che mi ha seguito all’inizio. \n\n**Qualcuno che ci è già passato, o passata, mi sa dire come ha fatto?** \n\nPs. so che una possibile soluzione è andare di persona al CUP, ma purtroppo sono solo e (almeno adesso) molto molto dolorante, quindi impossibilitato a muovermi.",
        "upvotes": 58,
        "comments": 38,
        "media": null,
        "permalink": "/r/torino/comments/1qcjogw/il_sistema_sanitario_torinese_è_in_bug_aiutatemi/"
    },
    {
        "id": "1qcxmsu",
        "author": "SgombroMan",
        "title": "25enne in cerca di un'occupazione manuale",
        "content": "Buonasera a tutti, sono un 25enne che ha conseguito una laurea triennale inutile e ha svolto un corso regionale (simile ad un master) in un settore ultrasaturo. Se non dovessi trovare nessun tirocinio decente, vorrei avvicinarmi all'apprendimento di qualche mestiere manuale, per schiarirmi un po' le idee e per cimentarmi in qualcosa che non sia stare 10 ore in ufficio a rompersi le palle (e il fegato), venendo sottopagato. Mi piace imparare ma sono una chiavica nelle materie scientifiche. Cosa mi consigliate di fare? Un IFTS o rivolgermi direttamente a qualche azienda/professionista? So che non sono giovanissimo ma sinceramente preferisco spezzarmi la schiena anziché arrivare a 30 anni con la voglia di ammazzarmi perché ancora disoccupato.\n\nChe consigli avreste per me?",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1qcxmsu/25enne_in_cerca_di_unoccupazione_manuale/"
    },
    {
        "id": "1qd3bzh",
        "author": "Effective_Excuse_667",
        "title": "Meccanico in zona san Salvario",
        "content": "Ciao,\n\nMi sono trasferito da poco in zona san salvario, vicino la metro dante.\n\nVi chiedo gentilmente se avete un meccanico di fiducia (possibilmente onesto) a cui vi rivolgete.\nNon mi serve nell'immediato ma sicuramente capiterà.\n\nGrazie in anticipo ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qd3bzh/meccanico_in_zona_san_salvario/"
    },
    {
        "id": "1qcy9at",
        "author": "Intrepid-Routine-875",
        "title": "Ma la tessera elettorale non si può richiedere per via telematica?",
        "content": "",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qcy9at/ma_la_tessera_elettorale_non_si_può_richiedere/"
    },
    {
        "id": "1qd2baz",
        "author": "NoAdagio2664",
        "title": "Non-EU Applicant for UniTo Global Law (2026) – Can I apply in the first window without a TOLC score?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qd2baz/noneu_applicant_for_unito_global_law_2026_can_i/"
    },
    {
        "id": "1qclc13",
        "author": "Status-Lychee7699",
        "title": "Im visiting. ToMove app is it legit?",
        "content": "Im travelling to torino next month, i saw online that there’s a few apps offering all day metro and bus tickets. however on the app store its showing me the app has a 1 star rating… Is it a real app that i can use or is there better alternatives?",
        "upvotes": 5,
        "comments": 41,
        "media": null,
        "permalink": "/r/torino/comments/1qclc13/im_visiting_tomove_app_is_it_legit/"
    },
    {
        "id": "1qck40d",
        "author": "CardiologistSea9595",
        "title": "Comprare appartamenti in edifici anni ’60/’70 a Torino (Santa Rita): sì o no?",
        "content": "Ciao a tutti, sto valutando l’acquisto di un appartamento a Torino, zona Santa Rita.  \nMi chiedevo: gli edifici costruiti negli anni ’60/’70 sono da evitare? Ho sentito che in quegli anni si usavano materiali e tecniche non sempre al top (cemento armato con vita utile limitata, isolamento scarso, impianti vecchi, ecc.).  \nQualcuno sa se in Santa Rita la situazione è diversa?  \nE soprattutto: **in fase di acquisto, come posso capire se un appartamento in uno di questi palazzi è “ok”**? Ci sono controlli o certificati da chiedere?",
        "upvotes": 6,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1qck40d/comprare_appartamenti_in_edifici_anni_6070_a/"
    },
    {
        "id": "1qcpg9l",
        "author": "Original-Mark-2173",
        "title": "Sapete dove trovare orecchini in questo stile in citta?",
        "content": "Grazie in anticipo per il vostro aiuto!",
        "upvotes": 2,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w8gxu759xbdg1.jpeg?auto=webp&amp;s=b67fe40dfa7e742d570aaa2efaea718f12219eb7"
        },
        "permalink": "/r/torino/comments/1qcpg9l/sapete_dove_trovare_orecchini_in_questo_stile_in/"
    },
    {
        "id": "1qcosoe",
        "author": "DaMieleMiao",
        "title": "Magic",
        "content": "Qualcuno per caso svende o regala carte di magic ? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qcosoe/magic/"
    },
    {
        "id": "1qckxyy",
        "author": "asilorepublic95",
        "title": "Parrucchieri cinesi Torino uomo",
        "content": "Cercavo parrucchieri cinesi zona santa Rita , mirafiori..che possa pagare anche con satispay se possibile.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qckxyy/parrucchieri_cinesi_torino_uomo/"
    },
    {
        "id": "1qc48y4",
        "author": "papa_commie",
        "title": "Qualcuno a Settimo Torinese disponibile per scambiare figurine Panini?",
        "content": "Non mi fido particolarmente della gente su Facebook che vuole spedire quindi preferisco fare dal vivo. ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qc48y4/qualcuno_a_settimo_torinese_disponibile_per/"
    },
    {
        "id": "1qcb5ie",
        "author": "Correct_Seaweed2466",
        "title": "University of turin",
        "content": "Im thinking of applying to economic and finance with data science. I am currently enrolled in IB program and GPA of 3.9. What should I prepare for? I really want to get in. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qcb5ie/university_of_turin/"
    },
    {
        "id": "1qbwzgp",
        "author": "Bru_91",
        "title": "Cerco musicisti jazz",
        "content": "Ciao! Ho 34 anni, da tanto tempo suono il piano ma da circa 3 anni ho ripreso a studiare più seriamente jazz. Mi piacerebbe trovare qualcuno con cui suonare, l'ideale sarebbe bassista e batterista con cui formare ritmica, con l'idea principalmente di studiare insieme senza finalizzare gli incontri esclusivamente a esibizioni/serate. Il mio non é un livello professionistico, assolutamente, ma non sono nemmeno proprio agli inizi. Frequento già una scuola di musica ma lì non ho incontrato altre persone di Torino o con la stessa esigenza. Avete consigli o indicazioni? Grazie!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qbwzgp/cerco_musicisti_jazz/"
    },
    {
        "id": "1qbof63",
        "author": "Waste-Helicopter-460",
        "title": "Trasferimenti e acquisto casa Torino",
        "content": "Salve a tutti, sono under 30, vivo a Milano, ma ormai non la sopporto più. Vorrei trasferirmi a Torino, città che visiti spesso e mi piace, comprando casa (Max 200-250K).\nSarebbe bello che casa fosse un bilocale-trilocale (stanza, sala-cucina, bagno, e nel caso seconda stanza)\nQuali zone consigliereste per la ricerca a chi ama vivere in zone residenziali, pulite, ma vicine al centro (possibilmente a piedi o in metro)?",
        "upvotes": 2,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1qbof63/trasferimenti_e_acquisto_casa_torino/"
    },
    {
        "id": "1qbpewy",
        "author": "solailes",
        "title": "Come si vive a Borgo Po?",
        "content": "Ciao a tutt\\*, vivo da 4 anni in San Salvario ma a breve un'amica potrebbe lasciarmi un appartamentino carino e non carissimo da affittare in Borgo Po. \n\nQualcuno che ci vive o lo frequenta mi sa dire come si trova? Ci sono delle belle realtà? Personalmente mi piace vivere in San Salvario perché c'è sempre vita e qualcosa da fare, gente per strada, mercati, baretti, casa del quartiere ecc.. e ho un po' paura che quella zona sia un po' troppo tranquilla o più frequentata da gente tanto più grande, ma non ho molta esperienza a riguardo. Allo stesso tempo è un quartiere oggettivamente bellissimo e più verde. Grazie! ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qbpewy/come_si_vive_a_borgo_po/"
    },
    {
        "id": "1qat646",
        "author": "BrutalSock",
        "title": "Ma perché?",
        "content": "Cestino a 3 metri. La città è un campo minato di vetri rotti.\n\nMa perché?",
        "upvotes": 143,
        "comments": 68,
        "media": null,
        "permalink": "/r/torino/comments/1qat646/ma_perché/"
    },
    {
        "id": "1qb56ni",
        "author": "boluslai",
        "title": "Satispay: conviene?",
        "content": "Grande domanda che ho maturato da quando mi sono trasferito a Torino.\n\nVedo che in molti usano Satispay. La domanda è: conviene?\n\nMi sembra di aver capito che vada ricaricato, un po' come PayPal. Ma il vantaggio concreto qual è? Pagare direttamente senza fare la fila?",
        "upvotes": 27,
        "comments": 37,
        "media": null,
        "permalink": "/r/torino/comments/1qb56ni/satispay_conviene/"
    }
]