[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 36,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1krstm5",
        "author": "surveypoodle",
        "title": "Just started watching Manifest and I'm loving it.",
        "content": "https://preview.redd.it/sw4almgyh32f1.jpg?width=426&amp;format=pjpg&amp;auto=webp&amp;s=6e6c2b2780cdb0f9df5f6d7f6ab446de46425956\n\nSo I randomly came across this show. Half way through the show I thought this was sci-fi and then it got weirder and weirder. I skipped through most of the family scenes  to save some time and I was mostly curious where they're going with this. Then came people dying mysteriously, cartoon villians from the government performing medical experiments on people searching for \"the Holy Grail\", \"The Major\" who's way up the ranks to conduct large operations that even the NSA is not aware of. The scientist who's there to explain shit to people with psychic powers called \"the calling\".\n\nI got even more excited when I realized there's 4 seasons of this. I don't know how it was even possible to stretch this for that many seasons and this got my curiosity even more. Most of the time I'm just skipping through the episodes until I get to see Michaela's pretty face but everything's all connected. Wow.\n\nTwenty years from now, this is gonna be a cult classic. Calling it now.",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1krstm5/just_started_watching_manifest_and_im_loving_it/"
    },
    {
        "id": "1kr7ip1",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Is Making a 'Clash of Clans' Animated Series",
        "content": "",
        "upvotes": 56,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1kr7ip1/netflix_is_making_a_clash_of_clans_animated_series/"
    },
    {
        "id": "1kqzy3f",
        "author": "Then-Scholar1748",
        "title": "A Deadly American Marriage: Sarah Corbett believes there's a secret recording of her dad's death",
        "content": "She says there was a recording device in a nightstand in her dad's bedroom but that it was not recovered by the police. She also says it was seen at Molly Martens' brother's house. ",
        "upvotes": 191,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1kqzy3f/a_deadly_american_marriage_sarah_corbett_believes/"
    },
    {
        "id": "1krfmpm",
        "author": "incredible26069",
        "title": "Netflix not letting me use in my own house!",
        "content": "About six months ago I got a message from Netflix asking me to sign into my Wi-Fi or enter a code for 14 days of use. I am in my own house using my own account and network. I do not share my account outside my household. Last night it happened again but only on my PC.\n\nI do not have location hidden. I am using a wired connection through the same Wi-Fi box it wants me to sign into. I have a high-end PC and use Ethernet because it gives the best connection. I have Comcast for internet and cable. Netflix is part of my plan and I pay extra for an upgraded version through Comcast.\n\nThis only happens on my PC. It does not happen on the TV, Fire Stick, or Comcast box. My PC is in a different room and I like to play shows while I work.\n\nWhat made it more frustrating is that Netflix sends a code by email that expires in 15 minutes. Each time the email took around 20 minutes to arrive. After five failed tries it made me wait 24 hours before I could try again.\n\nI checked and the only devices connected are inside the house. Does anyone else have to deal with this nonsense.   ",
        "upvotes": 20,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1krfmpm/netflix_not_letting_me_use_in_my_own_house/"
    },
    {
        "id": "1kqjuet",
        "author": "New-Talk3039",
        "title": "Thoughts on Netflix’s Sex Education?",
        "content": "Now that the show’s over, what did you think of Sex Education overall? Loved it or overrated?",
        "upvotes": 1492,
        "comments": 279,
        "media": null,
        "permalink": "/r/netflix/comments/1kqjuet/thoughts_on_netflixs_sex_education/"
    },
    {
        "id": "1krotjr",
        "author": "Boring-Shallot3096",
        "title": "Kdrama - Extracurricular",
        "content": "If you’ve just watched Weak Hero Class 1 and you’ve been recommended Extracurricular because people say it’s similar, it’s not at all.\n\nDon’t know why people are saying it is, personally, I actually kind of hated it. I found it painfully boring and I regret watching it.\n\nI don’t think any of the characters are likeable and you really root for no one… just my opinion though.\n\nI will say the acting was very good but that’s not enough to keep me if the story sucks.\n\nNow, I’m in the minority here - a lot of people actually really like this show so take my opinion as an opinion, just letting you know that if you’re looking for another Weak Hero like I was, I don’t think this will satisfy you.\n\nIf you’re looking for something like Weak Hero in terms of action and fighting: Bloodhounds has got all that, and in terms of inter-friendship dynamics and characters with hero complexes: All of Us Are Dead explores that a bit.\n\nI think there’s also another show that’s supposed to be similar called The King of Pigs but I haven’t watched that so I don’t know too much about it, but give it a go if you please.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1krotjr/kdrama_extracurricular/"
    },
    {
        "id": "1krs8vn",
        "author": "sterrono",
        "title": "Looking for series....",
        "content": "Hey, I watched a series like 2-3 years ago I can't exactly\nremember it was on polish Netflix series if I'm not\nwrong, or prime video mayb e Hulu but highly netflix\nshow/series I can't fully recall the country as well but it\nwas eu series polish french norveigan idk, and the plot\nwhat I remember is it had main character poor guy from\nvillage looks after horses I guess enrers into university or\ncollege and it's full of rich people and there's a guy with\ncurly hair and mustache he is rich and they kinda seem\nto fall in love with each other and also mid show they go\non vocation or trip to snowy mountain places it's dark\nelite like show I can't Remember anything else maybe\nmain character name was Philippe or Victor I don't know I\ndidn't finish and I can't find it, at that time I even watched\ntrailers and checked actors profile my God now I can't\nfind anything tried ChatGpT and ai I think it's less popular\nshow or I misinterpreted the details and storylineif\nanyone knows please help!!!! I'm ready to elaborate or\ndiscuss more details....",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1krs8vn/looking_for_series/"
    },
    {
        "id": "1kqx842",
        "author": "tmhowzit",
        "title": "The secret recordings / Deadly American Marriage",
        "content": "Molly placed recording devices around the house to capture the alleged abuse. Yet the best example we're given is her and Jason fighting over who the kids have dinner with and when. It just sounded like a run-of-the-mill argument between parents. That was the big gotcha moment?",
        "upvotes": 119,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1kqx842/the_secret_recordings_deadly_american_marriage/"
    },
    {
        "id": "1krrjuj",
        "author": "ConversationKey276",
        "title": "American Son- How did yall feel?",
        "content": "I just watched American Son and I really enjoyed it. I saw a lot of people saying it was unrealistic, and I couldn’t disagree more. The black policeman pissed me off, but I also understood where he came from, bc my grampa used to say similar things. The white police officer made me mad also, cuz why was he so racist for? The husband was saying slick ish too🙄\nI just wish it was a bit longer to show the aftermath. But overall it was an 8/10.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1krrjuj/american_son_how_did_yall_feel/"
    },
    {
        "id": "1krix1c",
        "author": "Valuable_Ad8608",
        "title": "Keep Sweet Pray &amp; Obey- I have a question",
        "content": "I just finished watching keep Sweet pray obey on Netflix and first of all what the fuck obviously it’s totally insane but one of the most random things I noticed was on the last episode in the white room on the ceiling. There’s shit tons of AC vents or some sort of vent at the top- like the ceiling is totally covered. What the fuck is that",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1krix1c/keep_sweet_pray_obey_i_have_a_question/"
    },
    {
        "id": "1kr4hc2",
        "author": "FuturistAnthony",
        "title": "Wednesday: Season 2 | Sneak Peek: Addams Family | Netflix",
        "content": "",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kr4hc2/wednesday_season_2_sneak_peek_addams_family/"
    },
    {
        "id": "1kr4gzq",
        "author": "ReplayJutsu",
        "title": "Netflix Just Revealed a Clash of Clans Animated Show Is Happening - Waifu Pulse",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kr4gzq/netflix_just_revealed_a_clash_of_clans_animated/"
    },
    {
        "id": "1krdwic",
        "author": "Dense-Blueberry-6249",
        "title": "A lot of buttons on screen are not working (skip intro, next episode, etc.)",
        "content": "I need some advice on how to solve the issue.  \nWhen watching series some buttons on the screen are not working (specifically laptop (more specifically google since it works fine on safari); works fine on my phone too):  \n\\- skipping to next episode  \n\\- skipping intro  \n\\- seeing list of seasons and episodes  \n\\- at the end of the ep. to forward to next episode\n\nIt's been going on for a few days now so I doubt it'll resolve on its own.   \nMy computer is up to date, there are no browser updates.  \nHas anyone experience anything similar, if so how did you solve it?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1krdwic/a_lot_of_buttons_on_screen_are_not_working_skip/"
    },
    {
        "id": "1krcx7r",
        "author": "GoGoGoGodzilla",
        "title": "Netflix (Windows App) keeps moving around the video on fullscreen when there is subtitles.",
        "content": "Been trying to fix the issue to no avail. I try to tolerate it but it starts hurting my eyes. It only happens when there is subtitles.\nLaptop screen is 16:10 and 1800p in case it helps.",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jnv57q43hz1f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1krcx7r/netflix_windows_app_keeps_moving_around_the_video/"
    },
    {
        "id": "1krny1a",
        "author": "MugenSDK",
        "title": "Adolescence: Is the representation of UK students accurate?",
        "content": "They are all so rude and given infinite amount of leeway, literally walking over any form of adult authority. Even walking away from cops during interrogation like they own the place. I literally want the students to form a line so i could slap respect into them. \n\nI understand high school students are probably more rude these days given the climate we live in and the show probably tried portraying that. But is it really to that extent? Or this is all absolutely fictitious?\n\nIt's obvious a fictional story but the setting feels very grounded so having students behaved that way seem so crazy to me.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1krny1a/adolescence_is_the_representation_of_uk_students/"
    },
    {
        "id": "1krmmtz",
        "author": "treessimontrees",
        "title": "Ads during the Fred &amp; Rose West documentary..",
        "content": "Which advertising agency in their right mind wants their product associated with a documentary about a mass torture and murder couple (responsible for at least 12 murders)??? \"...At least eight of the murders involved the Wests' sexual gratification and included [rape](https://en.wikipedia.org/wiki/Rape), [bondage](https://en.wikipedia.org/wiki/Bondage_(BDSM)), [torture](https://en.wikipedia.org/wiki/Torture), and [mutilation](https://en.wikipedia.org/wiki/Mutilation).\"\n\nJump into summer with Target... unbelievable. \n\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1krmmtz/ads_during_the_fred_rose_west_documentary/"
    },
    {
        "id": "1kqwosk",
        "author": "Admirable_Jelly_9303",
        "title": "American Manhunt : Osama Bin Laden",
        "content": "Why did the military/ on ground forces refuse to send their people to catch Osama in Tora Bora? Not able to wrap my head around it! Just that could have prevented all the subsequent events for the next decade!",
        "upvotes": 8,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kqwosk/american_manhunt_osama_bin_laden/"
    },
    {
        "id": "1krmtnq",
        "author": "HappyPerson20",
        "title": "Kicked off of Netflix because of new Household Rules - Wtf are university students supposed to do??",
        "content": "I'm really frustrated, I'm in the middle of watching a show that I can no longer continue because I am living away from home at university... and the solution is that I have to get a code resent to me every 14 days? Not only that but my 2 siblings who are also out at university have to ask for a code, so my mom will just have to send a code out every 5 days, that's annoying... Anyone know where I can complain to Netflix? Because I couldn't find anything and have resulting in complaining to reddit. \n\nCome on Netflix... you can do better. ",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1krmtnq/kicked_off_of_netflix_because_of_new_household/"
    },
    {
        "id": "1krk2wk",
        "author": "Vivid_Reaction2830",
        "title": "Anyone have any idea how to fix this glitch?",
        "content": "I turned off my subtitle shadows and put my laptop into performance mode but the frame jumps around. I genuinely dont know if this is a glitch or bad video fx but has anyone else had this issue? ",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/05ozyqwtz02f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1krk2wk/anyone_have_any_idea_how_to_fix_this_glitch/"
    },
    {
        "id": "1kqed7r",
        "author": "AlwaysBlaze_",
        "title": "Netflix Picks Up ‘Sesame Street’ Worldwide Streaming Rights After Max Deal Ends",
        "content": "",
        "upvotes": 77,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1kqed7r/netflix_picks_up_sesame_street_worldwide/"
    },
    {
        "id": "1kr6c6s",
        "author": "st2826",
        "title": "What is your fave apocalypse film/series?",
        "content": "Its my favourite type of thing to watch but i feel like I’ve seen the majority of stuff so am looking to see if theres any I’ve missed. No foreign language or dubbed though please ",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1kr6c6s/what_is_your_fave_apocalypse_filmseries/"
    },
    {
        "id": "1kqmlxs",
        "author": "Connect-Hall1349",
        "title": "How often do you guys struggle to find movies to watch?",
        "content": "What I mean is that sometimes I have the time to watch a movie but can't find something that I want to watch. Is this a common problem or just me really? If any of you guys face this what are the ways you have tried to solve this?",
        "upvotes": 23,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1kqmlxs/how_often_do_you_guys_struggle_to_find_movies_to/"
    },
    {
        "id": "1kr9z9u",
        "author": "JajtaKrajta78",
        "title": "What should I do now, since netflix isn't capable of refunding me",
        "content": "Over two months ago, netflix issued a refund to my card (as seen in photo), after that time window was up, I contacted support again. They told me the money would be in my account within 8 days. Now almost two weeks later, I still don't have my money. What should I do now?\n\nhttps://preview.redd.it/6tgu2tsfwy1f1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=94f809b86af2c4ec68f540592dd70b64fe8e144a\n\nwhy does netflix keep removing my post?",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kr9z9u/what_should_i_do_now_since_netflix_isnt_capable/"
    },
    {
        "id": "1kr4ba9",
        "author": "shyakkuri",
        "title": "Downloads on old device",
        "content": "Hi all, I got a new phone recently and factory reset my old one, which had Netflix downloads. Now it won't let me download stuff on my new phone because of it. I tried removing access to my old device but it still says i have too many devices with downloads. Anyone know a solution?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kr4ba9/downloads_on_old_device/"
    },
    {
        "id": "1kr36oy",
        "author": "bilingual_european",
        "title": "To all the arcane dislikers: what would you change about the show?",
        "content": "I recommended the show to a friend and after much questioning as to why she didn’t like the show, i decided to look it up seeing as how she couldn’t be the only one. Found [this reddit thread](https://www.reddit.com/r/netflix/s/uH6jgRX3ST) and if people thought enough about what they don’t like, they must’ve rewritten it to better fit their expectations. (i am personally not taking any animation design hate so i don’t want to see anything about that, but in the end this is the internet)",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kr36oy/to_all_the_arcane_dislikers_what_would_you_change/"
    },
    {
        "id": "1kqyxtv",
        "author": "Inevitable_Grape_950",
        "title": "Romantic with a funny ending reccs",
        "content": "I am feeling bored af. I don't have anything to watch. Can you suggest any rom-com with a happy ending?\n\nI have literally watched all Kdramas and Cdramas. So it would be better to try english ones now. Thanks in Advance.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kqyxtv/romantic_with_a_funny_ending_reccs/"
    },
    {
        "id": "1kqy5y6",
        "author": "steppy2712",
        "title": "I need to know what show this is",
        "content": "Ok so I used to have Netflix and this show was about a girl who was in her twenties and she was rich and famous then went on parole and had to teach at a school and I think the main characters name is Kylie or something can someone help me ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kqy5y6/i_need_to_know_what_show_this_is/"
    },
    {
        "id": "1krhsno",
        "author": "Hastafari",
        "title": "The perfect cast for the Netflix Clash adaptation",
        "content": "I hope I'm right.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1krhsno/the_perfect_cast_for_the_netflix_clash_adaptation/"
    },
    {
        "id": "1kqdg0d",
        "author": "Top-Three-USA",
        "title": "'Sesame Street' moves to Netflix and PBS for streaming, with new episodes and games. Library stays on HBO/Max until 2027. Season 56 gets a format refresh.",
        "content": "",
        "upvotes": 35,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kqdg0d/sesame_street_moves_to_netflix_and_pbs_for/"
    },
    {
        "id": "1kriqnc",
        "author": "Old_Engineer_9176",
        "title": "Goodbye, Adiós, Auf Wiedersehen, Au revoir, さようなら, 再见, Netflix—after ten years.",
        "content": "Goodbye, Adiós, Auf Wiedersehen, Au revoir, さようなら, 再见, Netflix—after ten years.\n\nAs your subscription costs climbed and the quality of your content plummeted, I found myself shouldering your failures and misjudgments. Enough is enough. I downgraded from the $18.99 plan to the $7.99 ad-supported version, expecting a seamless transition. Everything seemed fine—until I tried to cast to my TV via Chromecast, only to discover that I couldn’t.\n\nNowhere in your advertising did you warn about this restriction. Why would I even suspect it, when casting worked perfectly with the standard plan?\n\nMy frustration was only amplified by the **sassy** response from your help desk, which sealed my decision to cancel. Other platforms manage to stream with ads via Chromecast—so why can’t Netflix? Seriously??\n\nToo bad—I’m voting with my feet. No more Meghan and Harry nonsense. No more disappointing rollouts. I might have tolerated ads, but now I’ll never know. You’ve lost out on revenue, and I feel liberated.\n\n**Ciao, arrivederci, aloha, Netflix.** I'm out.",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kriqnc/goodbye_adiós_auf_wiedersehen_au_revoir_さようなら_再见/"
    }
]