[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 492,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iirj71",
        "author": "Impossible-Will-8414",
        "title": "Kinda Pregnant -- Wow",
        "content": "OK, I know Amy Schumer can be a complicated figure, but she has done some decent work lately, including in the Hulu series Life and Beth -- not amazing or anything, but a mix of quiet humor and heartfelt plot lines. And movies like Trainwreck, while not great, still have had some merit. But my GOD -- Kinda Pregnant, which debuted today on Netflix, is fully unwatchable -- it's like a Z-grade Adam Sandler movie (and funnily enough, Adam Sandler's nephew, Tyler Spindel, directs this atrocity!), with a \"wild and wacky\" plot that is completely over the top and characters who are not in any way recognizably human. And Schumer actually co-wrote the script, so she can't blame this on bad writing. It is ATROCIOUS. Watched about 30 minutes and flipped it off, both literally and figuratively. Schumer really seems to be in a very bad place if this garbage is any indication.",
        "upvotes": 99,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1iirj71/kinda_pregnant_wow/"
    },
    {
        "id": "1iiew2n",
        "author": "EthanWilliams_TG",
        "title": "Netflix Cancels Six Announced Games Before Release",
        "content": "",
        "upvotes": 326,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1iiew2n/netflix_cancels_six_announced_games_before_release/"
    },
    {
        "id": "1ii1bwp",
        "author": "AccurateInflation167",
        "title": "Netflix drops Emilia Pérez star from Oscars campaign over tweets",
        "content": "",
        "upvotes": 1085,
        "comments": 138,
        "media": null,
        "permalink": "/r/netflix/comments/1ii1bwp/netflix_drops_emilia_pérez_star_from_oscars/"
    },
    {
        "id": "1iirlph",
        "author": "SodaPopinski6",
        "title": "Home Improvement.",
        "content": "Feeling old. Been binging Home Improvement and haven’t laughed like this in a long time. Also brings back memories of the whole family sitting down to watch TGIF. ",
        "upvotes": 11,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iirlph/home_improvement/"
    },
    {
        "id": "1iixcgp",
        "author": "creepywolf1090909",
        "title": "Question about Netflix",
        "content": "So, my Netflix Icon use to be Lucifer from Lucifer but all of a sudden it changes when I went on Netflix on my tv and so I went to change it back but couldn't find the Lucifer icons.\n\nWas the Lucifer icons removed or something???",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iixcgp/question_about_netflix/"
    },
    {
        "id": "1iiqt4a",
        "author": "Several-Archer4786",
        "title": "Rewatching \"The Wiz\"",
        "content": "I remember watching this several times on network television as a kid growing up. My wife has never seen it so we're watching it together for the first time. Just the era of the film brings back memories.",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iiqt4a/rewatching_the_wiz/"
    },
    {
        "id": "1ii549c",
        "author": "gomi-panda",
        "title": "Anyone know what show this comedy came from? It looks hilarious",
        "content": "",
        "upvotes": 127,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o10p0nk31ahe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ii549c/anyone_know_what_show_this_comedy_came_from_it/"
    },
    {
        "id": "1iivpyp",
        "author": "TreeThink5214",
        "title": "Netflix travel work around?",
        "content": "Does anyone know of a workaround for traveling with Netflix? I have used it while traveling for the past two months, but suddenly I received a message saying that I'm outside the main household and can no longer access it. Is there a solution for this, or does it randomly work and then not work?",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1iivpyp/netflix_travel_work_around/"
    },
    {
        "id": "1iitybo",
        "author": "Express-Temporary464",
        "title": "cant watch anything that isn’t a netflix original?",
        "content": "is netflix having issues? it started happening yesterday, first my “continue watching” category went back to a queue i was watching months ago, now everything that isnt a netflix original is giving me and “remind me button” instead of a play button. confused pls help.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iitybo/cant_watch_anything_that_isnt_a_netflix_original/"
    },
    {
        "id": "1iiqk0i",
        "author": "Fuzzy-Step-4064",
        "title": "AirPods Quiet But fine on everything else",
        "content": "I currently have the 1st gen airpods. The volume is perfect when I’m listening to music, however when watching Netflix on my iPhone on full volume, the airpods are substantially quieter. Is there a fix to this at all?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iiqk0i/airpods_quiet_but_fine_on_everything_else/"
    },
    {
        "id": "1ii0clu",
        "author": "Somethingman_121224",
        "title": "Insider Claims Netflix's 'Assassin's Creed' Series Is On Hold, But A New Live-Action Movie Is In The Works",
        "content": "",
        "upvotes": 53,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ii0clu/insider_claims_netflixs_assassins_creed_series_is/"
    },
    {
        "id": "1iimjbz",
        "author": "drdodo-88",
        "title": "Automatic sign out device",
        "content": "Hi! \nI hope this question belongs in this sub! \nIs it possible for my smart tv to automatically sign out after a certain period? This is for a rental property and I would like people staying to use their account and automatically sign out so others won’t use the account. \n\nThanks! \n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iimjbz/automatic_sign_out_device/"
    },
    {
        "id": "1ii5y54",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Reveals New Indonesian Originals: 'The Actor' and Zombie Thriller 'The Elixir'",
        "content": "",
        "upvotes": 13,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ii5y54/netflix_reveals_new_indonesian_originals_the/"
    },
    {
        "id": "1ihevjl",
        "author": "Whobitmyname",
        "title": "‘PARASITE’ is now streaming on Netflix, ahead of the 5th anniversary of the film winning Best Picture at the Oscars.",
        "content": "",
        "upvotes": 567,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1ihevjl/parasite_is_now_streaming_on_netflix_ahead_of_the/"
    },
    {
        "id": "1ii7078",
        "author": "Moh-2-Da-Game",
        "title": "shows and movies dissapears from my profile but present on others.",
        "content": "like I said, and yes on the same device even. why's this happening? last year someone made the exact same post and netflix still hasn't addressed this. Like half my list is gone.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ii7078/shows_and_movies_dissapears_from_my_profile_but/"
    },
    {
        "id": "1iirrof",
        "author": "baeblade93",
        "title": "Riverdale Trivia!",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iirrof/riverdale_trivia/"
    },
    {
        "id": "1ii9cjy",
        "author": "Complex_Common2808",
        "title": "Old show name????",
        "content": "When I was about 7 I remember watching this show on Netflix and all I remember is it had something to do with some sort of mutant creature that this kid created in a out house in his backyard and he would become friends with it and they would do just random things together.  the show would’ve been aired around 2011-2015. I vividly remember it only being 2 seasons as-well. ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ii9cjy/old_show_name/"
    },
    {
        "id": "1iijvu3",
        "author": "artmalique",
        "title": "Subscription availability list for every Netflix show?",
        "content": "Newbie (so apologies if this has been answered before). There are lots of shows I want to watch on Netflix, but I don't know if they are available on Standard with ads, Standard or Premium only (I have heard others say that some things can only be watched on Premium...).\n\nIs there a list online that tells us the availability of every Netflix show with each subscription option? Or is there some other easy way to find out? I don't want to find out the hard way of paying then not being able to watch...",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iijvu3/subscription_availability_list_for_every_netflix/"
    },
    {
        "id": "1iidzwh",
        "author": "previouslyontheflash",
        "title": "If 'YOU' was a Rom-Com",
        "content": "With the Final season of YOU releasing soon I thought why not an edit 😄😂! Love the show and making edits so here we are.",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/sley53rljche1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1iidzwh/if_you_was_a_romcom/"
    },
    {
        "id": "1iilbz6",
        "author": "Rykrider",
        "title": "subtitle discrepancies?",
        "content": "I’m watching Parasyte: The Grey on Netflix. I had to step out to run some errands for my parents, and ended up staying at theirs, so I went back to where I was and started watching it a few minutes earlier. But I noticed that the subtitles, while still saying the same things, were phrased differently. I think there was about an hour or two hour gap between when I stopped watching and now, so the first phrasing is still pretty fresh in my mind.\n\nAnyone have any familiarity with this? Could it be just a quirk or some regional/account testing feature?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iilbz6/subtitle_discrepancies/"
    },
    {
        "id": "1ii6f0h",
        "author": "doshas_crafts",
        "title": "AUD12.99 plan resolution",
        "content": "is anyone on the AUD$12.99 plan ? I can't find the resolution streamed for this plan anywhere. suspect its only a SD and only realised recently how bad it looks on my 4k TV.  But am also concerned about the NBN tier I need if I were to upgrade Netflix plan. I'm only on 25mbps plan. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ii6f0h/aud1299_plan_resolution/"
    },
    {
        "id": "1ii8701",
        "author": "StockholmSyndromePet",
        "title": "Why Oh Why?",
        "content": "Why does netflix australia show me the same content repeatedly as suggested viewing over and over.\n\nIf I'mn scrolling past your content it means i'm not interested.\n\nStop trying to bully people into watching what you ant us to watch.\n\nIf we keep scrolling show us literally anything else.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ii8701/why_oh_why/"
    },
    {
        "id": "1iieqdk",
        "author": "daily_mirror",
        "title": "Netflix make drastic move amid Emilia Perez star scandal",
        "content": "",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1iieqdk/netflix_make_drastic_move_amid_emilia_perez_star/"
    },
    {
        "id": "1ii2icb",
        "author": "random1211312",
        "title": "Squid game (S1 E8 dub) only playing audio in my left ear.",
        "content": "Watching Squid Game S1 E8 in dub, and for some weird reason it's only playing audio in my left ear, music excluded. Is there any way I could possibly fix this? Idk what's going on",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ii2icb/squid_game_s1_e8_dub_only_playing_audio_in_my/"
    },
    {
        "id": "1ii2dro",
        "author": "masterluke19",
        "title": "You are what you eat: A twin experiment",
        "content": "I just watched this 4 episode series. I understand the benefits of vegan food. But I couldn’t stop thinking about - Why do I feel like this is a big commercial for vegan foods. I see lot of founders and their brands getting advertised in the show. In the end they lost all the vegan food brands. \nIs this a vegan brand collab? \nAnyone else felt like this?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ii2dro/you_are_what_you_eat_a_twin_experiment/"
    },
    {
        "id": "1ih14np",
        "author": "HarperLovey",
        "title": "Any one else canceling due to price increases?",
        "content": "Had to cancel this month as rate went up to just shy of $30/mo (with taxes added in)!  I remember paying something like $12.99/mo.  Even that was a stretch back then. I've always enjoyed Netflix programming, but just can't justify the price anymore. $300/year is just not realistic. ",
        "upvotes": 260,
        "comments": 188,
        "media": null,
        "permalink": "/r/netflix/comments/1ih14np/any_one_else_canceling_due_to_price_increases/"
    },
    {
        "id": "1ii1dml",
        "author": "supercarrier78",
        "title": "Preview in fast forward not working",
        "content": "Trying to watch RAW from earlier this week and cannot get it to preview while fast forwarding (iPad and FireTV). For a show without ad breaks or pre-announced schedules in broadcast the ability to see where you are is essential. Is anyone else experiencing this problem? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ii1dml/preview_in_fast_forward_not_working/"
    },
    {
        "id": "1iiia7h",
        "author": "KarinsDogs",
        "title": "Are locked titles an issue on STD plan? New to streaming.",
        "content": "I’m newer to Netflix.  My Sister and Brother in Law added me last year for my “ birthday “.  I never realized how streaming worked.  I was in a terrible car accident in 2017. I had to relearn everything due to a traumatic brain injury - So please be kind.  My sister is getting a divorce.  I need to get my own plan now.  I’m reading the STD plan has locked programming.  But I only need 1 tv.  I’m on a pretty tight budget.  I’m no longer able to work\nI was forced to retire from my career as a Dog Trainer.  Do I find the extra $$ for the better Netflix plan?  Thoughts?  Ty.  Pic of my Jeep for context my best friend who also survived.  😊",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1iiia7h/are_locked_titles_an_issue_on_std_plan_new_to/"
    },
    {
        "id": "1ii5ms4",
        "author": "cuppachuppa",
        "title": "It seems inevitable that Netflix's next step will be annual subscriptions rather than monthly. Will you sign-up for 12 months at a time?  Or will that be your cue to cancel?",
        "content": "Same as Apple TV, Disney Plus etc., we sign up to Netflix for a few months, watch what we want and then cancel.\n\nI don't think it'll be long until streamers stop this by having 12 month subscriptions.  I think that would be the final straw for me and I'd just cancel them all.",
        "upvotes": 0,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1ii5ms4/it_seems_inevitable_that_netflixs_next_step_will/"
    },
    {
        "id": "1ihvojk",
        "author": "VesnaKostic",
        "title": "I need a recommendation for a series like Holy Family",
        "content": "I want to watch a series like Holy Family where I watched 16 episodes in 2 days. A family on the run, they stole a child, they change identities and kill, lots of mystery and intrigue 😂😂😂 Please helppp ❤️",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ihvojk/i_need_a_recommendation_for_a_series_like_holy/"
    }
]