[
    {
        "id": "1let7b6",
        "author": "scoreboard-app",
        "title": "Post Match Thread: Real Madrid vs Al Hilal, CWC",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1let7b6)",
        "upvotes": 23,
        "comments": 247,
        "media": null,
        "permalink": "/r/realmadrid/comments/1let7b6/post_match_thread_real_madrid_vs_al_hilal_cwc/"
    },
    {
        "id": "1lcovgx",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 31,
        "comments": 2085,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lcovgx/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1lf77qw",
        "author": "ranger_ronaldo",
        "title": "THIS THING IS SO REAL",
        "content": "",
        "upvotes": 1176,
        "comments": 61,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/94p20un70v7f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lf77qw/this_thing_is_so_real/"
    },
    {
        "id": "1lfapef",
        "author": "Chico813",
        "title": "Blessed to have been able to photograph this club yesterday... ON the sun",
        "content": "What's up, y'all. I'm a local photographer in Miami and I was lucky enough to get a chance to cover such an incredible club. I love the way Real Madrid came out in the second half and there were several solid sequences of play. Unfortunate that they didn't capitalize on an Al-Hilal that was on its heels. Hope to see you in one of the knockouts here. \n\nAll photos here are mine and if you wish to use any, please reach out to me about photo credits and such. Be well and good luck. ",
        "upvotes": 351,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/64XTyJi3-SdkufhreShxpgxAANYV8GLpqPkTW8khEKE.jpeg?auto=webp&amp;s=29013e3fee47271a196c4c8d3aff095fea18548e"
        },
        "permalink": "/r/realmadrid/comments/1lfapef/blessed_to_have_been_able_to_photograph_this_club/"
    },
    {
        "id": "1lf53du",
        "author": "yuukiro",
        "title": "Arda's \"eyes on the back\" pass",
        "content": "A good pass from Arda in yesterday's match against Al-Hilal. RM has elite open space players and its nice to see these kind of plays where a player can unlock a narrow space position.\n\nI also realized from the recent games of the last season that Arda and Mbappe get along very good in these narrow space link ups near the box.",
        "upvotes": 389,
        "comments": 38,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9j6tgjhwau7f1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lf53du/ardas_eyes_on_the_back_pass/"
    },
    {
        "id": "1lfaggi",
        "author": "TimothyX7",
        "title": "Kylian Mbappé is suffering from acute gastroenteritis and has been hospitalized for various tests and treatment.",
        "content": "",
        "upvotes": 121,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mR5Rmhm-MrRPIxViDT15rYhTU1auS0ds-ujKRpBN990.jpg?auto=webp&amp;s=3d6c6a895bbbf69bd8b21cf848d9a723b3880bb6"
        },
        "permalink": "/r/realmadrid/comments/1lfaggi/kylian_mbappé_is_suffering_from_acute/"
    },
    {
        "id": "1lfcu4b",
        "author": "Ok-Equipment-440",
        "title": "I Love You Fede my child is gonna be named after you",
        "content": "",
        "upvotes": 87,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7puemx0ydw7f1.png?auto=webp&amp;s=bafa42d68537a15a7b3b5149b0cbeb851dac405b"
        },
        "permalink": "/r/realmadrid/comments/1lfcu4b/i_love_you_fede_my_child_is_gonna_be_named_after/"
    },
    {
        "id": "1lfakjs",
        "author": "WhySoWeirdUsername",
        "title": "Parte médico de Mbappé.",
        "content": "",
        "upvotes": 106,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lfakjs/parte_médico_de_mbappé/"
    },
    {
        "id": "1lfa207",
        "author": "Any_Warthog_5655",
        "title": "Modric subbing on vs Alhilal yesterday",
        "content": "",
        "upvotes": 102,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o0ozigf1sv7f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lfa207/modric_subbing_on_vs_alhilal_yesterday/"
    },
    {
        "id": "1lf2ayt",
        "author": "More-Judgment-9253",
        "title": "Anyone else think Camavinga would be the difference maker for our midfield once he fixes his reckless tackles and gets better decision making?",
        "content": "",
        "upvotes": 400,
        "comments": 76,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3wldjez2ft7f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lf2ayt/anyone_else_think_camavinga_would_be_the/"
    },
    {
        "id": "1lf4s0u",
        "author": "Ok-Cardiologist1922",
        "title": "El Capitano, El Muro, El Guerriero, El Salvatore.🧱⚔️",
        "content": "",
        "upvotes": 222,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tf51q7a17u7f1.jpeg?auto=webp&amp;s=b66b4025e50436856ae97130fbd496266a3649a5"
        },
        "permalink": "/r/realmadrid/comments/1lf4s0u/el_capitano_el_muro_el_guerriero_el_salvatore/"
    },
    {
        "id": "1lf7xp8",
        "author": "redondo-inOldTraford",
        "title": "Simply the team is destroyed physically. Stop overreacting.",
        "content": "**Look, these critics have gotten out of control.**\n\nSuddenly people doubt Xabi (who has already win a bundesliga playing great) or people is doubting our players (who are 2 times CL winners).\n\nAre you in your mind?\n\nDo you really think that all of them forgot how to player football? No, they are destroyed physically. and mentally. They need rest and a preseason.\n\nIt is not by chance that our best players yesterday were Huijsen, Gonzalo and Guler. The ones who come from other teams or that barely player.\n\nI am not sure if it was Pintus, some failure in the preparation, the accumulation of fatigue due to lack of rotation or mental exhaustion due to the bad season but our players are literally destroyed.\n\nStop judging Bellimgham, Vini, Rodrygo, Valverde, Tchoanami (even if I am not a big fan of him) and even Fran Garcia.\n\nThey are not playing in their real level and they will not play that level during this CWC. It is simply not possible. But the next season they will be recovered. With fresh mind and body. Do you think a fresh Valverde would fail such penalty?\n\nAnd most of all stop blaming Xabi, who has trained them literally 4 days. Friday, Sunday, Monday, Tuesday. Do you believe he can do miracles? Do you have the minimum knowledge of how much time takes to learn new patterns? Have you ever played football or any other team sport?\n\nAlso respect Al Hilal, they are the best team in Asia, full of european players, adapted to heat, and they expended 400 million last 2 years. They would be in the 10 first teams of LaLiga without problems.\n\nOf course there are some issues, I still think we MUST sign Stiller or someone with that profile. We also need a Left Back because Fran Garcia positioning is nasty (although he provoked a penalty).\n\nBut we have a great team and a excellent trainer that is additionally a legend of the club in his own.\n\nPD: It is obvious our chances of winning the tournament are really slim. We should stop charging with minutes the stars and give time to all the rest.\n\nPut as a starters Gonzalo (again), Guler, Brahim, Chema (a 5 from the academy), victor munoz, diego aguadao (as left back)... and only play 1 or 2 real starters per game. And send bellimgham to the operation NOW.\n\nPD2: Focus on the good things also. Huijsen is majestic as a CB. I do not lie if I say that never in my life I saw so much potential in a CB",
        "upvotes": 98,
        "comments": 58,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lf7xp8/simply_the_team_is_destroyed_physically_stop/"
    },
    {
        "id": "1lf3rgl",
        "author": "choker_18",
        "title": "Why so much hate against Alexander Arnold?",
        "content": "I agree,he was not \"spectacular\"  in last match but it was his first match and he is adopting with the team.\n\nWhy are they hating and laughing on him? (Especially a particular fan base) If he was that bad then why u guys were literally \"begging\" him to stay at the club.\n\n\"THE GRAPES WERE SOUR.IF I EAT THEM,I MIGHT FALL ILL.....\"",
        "upvotes": 195,
        "comments": 111,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lf3rgl/why_so_much_hate_against_alexander_arnold/"
    },
    {
        "id": "1letift",
        "author": "Ready_Ad_1353",
        "title": "Gonzalo Garcia has been voted the Superior Player of the Match",
        "content": "",
        "upvotes": 937,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/u56cihxw9r7f1.jpeg?auto=webp&amp;s=740050410a78e69d8b71efa6da9fe2c3f74d7d9e"
        },
        "permalink": "/r/realmadrid/comments/1letift/gonzalo_garcia_has_been_voted_the_superior_player/"
    },
    {
        "id": "1lf7tra",
        "author": "Ghost-Ripper",
        "title": "FIFACWC ⚽️🏟️ Hard Rock Stadium, Miami…",
        "content": "",
        "upvotes": 78,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1yPuvaFyWkLysGsDy-DyEBM1F1f1tIQpwXktSp2frCY.jpeg?auto=webp&amp;s=be7087f82fe89105be6c2f85a2dffb79b1ecb36d"
        },
        "permalink": "/r/realmadrid/comments/1lf7tra/fifacwc_hard_rock_stadium_miami/"
    },
    {
        "id": "1letja5",
        "author": "BdBoss_777",
        "title": "🚨Thibaut Courtois: “We still have Ancelotti's automatisms and that CANNOT be changed in four days”.",
        "content": "",
        "upvotes": 740,
        "comments": 108,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L_gmpA-Baop0I9oKcS0vDGxNQ-TzAYjrO2nO4M3P4HQ.jpg?auto=webp&amp;s=28247857c64e9ab25fc1dceaddf4483b8ab67c7a"
        },
        "permalink": "/r/realmadrid/comments/1letja5/thibaut_courtois_we_still_have_ancelottis/"
    },
    {
        "id": "1lf0xze",
        "author": "More-Judgment-9253",
        "title": "I think not renewing Modric is a big mistake",
        "content": "I know there's basically nothing we can do about it but I just have to get this off my chest. Modric is still one of the best midfielders in the world at 39 years old. One of the common criticisms people make against him is that he doesn't have much stamina anymore but I think that's the opposite of the truth. When you look at the games where he started and played for the full 90 this season he didn't even really look that gassed and he's still always running up and down the field, of course he's had a few average performances but that doesn't change the fact that he has the most big chances created on the team. There are literally moments where he outpaces people that are like 10 years younger than him to make it back to the defense like today when he saved us twice😭, and players like guler could still learn a lot from him so I think it's really sad to see him go right now.",
        "upvotes": 196,
        "comments": 81,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lf0xze/i_think_not_renewing_modric_is_a_big_mistake/"
    },
    {
        "id": "1leqhd4",
        "author": "AestheticEvan23",
        "title": "Gonzalo scores 1-0 now",
        "content": "",
        "upvotes": 802,
        "comments": 48,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rfzae9axnq7f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1leqhd4/gonzalo_scores_10_now/"
    },
    {
        "id": "1lfajdz",
        "author": "Leekeew",
        "title": "Vini is very much in his Carlo Coded era still.",
        "content": "It's too early to criticise anyone honestly, be it Xabi or the players, but from what I watched yesterday. truly there's a lotta work to be done in the team and it's gonna take a little while, even months before Xabi has an answer for it all. \n\n\nWith Vini btw, we all saw how much out of form he was towards the end of the season. Altho he's had his moments yesterday yet again it's nothing like the Vini we've once known. \n\n\nWhat do you think needs to be changed? I speak of Vini coz he's a player that could literally be the deciding factor and it's sad to see him rather become a liability. Truly there's something wrong with him, not sure if he's in his head or what, something needs to be changed, he's literally our stardom player. \n\nThoughts?",
        "upvotes": 27,
        "comments": 69,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lfajdz/vini_is_very_much_in_his_carlo_coded_era_still/"
    },
    {
        "id": "1lesqqq",
        "author": "RetroSpective-Dawg",
        "title": "TRUST THE PROCESS. This is just the beginning.",
        "content": "To all fellow madridistas, I don't think there's any reason to be mad about the game. The players are clearly not at their best because it's a transition period - there is clear confusion amongst the players as the playstyle of Ancelotti and Xabi is drastically different, and even Man City suffered in the start under Pep Guardiola, and so did Allegri with Juventus. Good things take time and I believe Xabi's the man. Let's hope with Mbappe back we'll be stronger. ",
        "upvotes": 458,
        "comments": 169,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lesqqq/trust_the_process_this_is_just_the_beginning/"
    },
    {
        "id": "1lesacy",
        "author": "AestheticEvan23",
        "title": "Luka Modrić is coming on",
        "content": "",
        "upvotes": 455,
        "comments": 19,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/x0eue9ou0r7f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lesacy/luka_modrić_is_coming_on/"
    },
    {
        "id": "1lejx83",
        "author": "WhySoWeirdUsername",
        "title": "Dear Xabi, Please follow Madrid's tradition or leave",
        "content": "",
        "upvotes": 1271,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a8h4k2b9ep7f1.jpeg?auto=webp&amp;s=dda3a2631b594c739b2cf2b70b275d9ebd3f3d51"
        },
        "permalink": "/r/realmadrid/comments/1lejx83/dear_xabi_please_follow_madrids_tradition_or_leave/"
    },
    {
        "id": "1lewklh",
        "author": "AjVine",
        "title": "Think the game ruined your day?",
        "content": "I bought tickets to go to the game with my grandfather. He is a huge fan and had never seen the team play in person and he is 91. I drove to Orlando (3.5h one way) the day before to get him. Bought parking ($50) to be sure I didn’t have to be looking last minute and waste time. \n\nArrived 1.5 hour earlier cause I knew there would be traffic no matter what - and there was. There was no way to ask for information and I would be moving a car length every 3 -4 minutes. I kept looking at the  parking lots for mine and I kept passing by lot 18-17-16-15 and suddenly there was no 14. Still at the same moving rate. I saw someone directing traffic and told me to turn around and it would be on my left. And well when I did the lot was closed as all of the same colored ones were. After moving that slow I found someone else and told me to go to lot 6 which took at least 20 minutes to get there from where I was. The game had already started at that point. My grandfather wasn’t feeling too well either. After I got to lot 6.. it was closed. Parking was full everywhere. I asked the next person I saw and told me to do a U turn and it would be on my right (BS I just came from there and everything was closed) I then decided to find parking on my own in another plaza which were all full and you could see tow trucks left and right. After an extra 10 minute I found parking (free btw). \n\nThe it was a 20 minute walk to the stadium gate under 92 f sun. Finally arrived to the gate the game was in around minute 67. Finally walking in I was told I couldn’t walk in with my small bag (that I had brought and was let in without problems for the Inter Miami - Al Ahly game on Saturday) so they made me lay 18 to put it in a locker room for basically the 20min left of the game. My grandfather wasn’t feeling well and almost fainted, I had to hold him. The heat, the stress, no being able to have water for so long. Someone came to help but he said he doesn’t need help, he’ll brave through it to watch as much time as he could. Until we got to the seats. It was about minute 74. Got there to watch Valverde miss a penalty and at least we watched Modric go in (his favorite player) and hear the stadium chant his name. \n\nBesides that, nightmare and piss job from hard rock stadium. Made me miss the whole game, my grandpa faint and made me pay extra for shit because they felt like it. Oh it also took us 2 hours to get out of the parking because Miami drivers and traffic officers and organizers are ass. That was my experience today. $485 gone to waste with extra unpleasantness. FUCK Hard Rock Stadium. ",
        "upvotes": 254,
        "comments": 29,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lewklh/think_the_game_ruined_your_day/"
    },
    {
        "id": "1lfastt",
        "author": "antoonioo7",
        "title": "What would you say is Vinicius Jr's best performance for Real Madrid?",
        "content": "What would you say is Vinicius Jr's best performance for Real Madrid? For me there are a few that come to mind, but if I had to pick one out it would be his performance against **Bayern Munich in the 2023/2024 UCL Semi-Finals**. He was dribbling past every defender and creating great chances. Kimmich i think has nightmares to this day about Vini lol. The only reason he didnt have as much end production as he could have had, is because Manuel Neuer decided to have one of his best performances of the 2020s. ",
        "upvotes": 16,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lfastt/what_would_you_say_is_vinicius_jrs_best/"
    },
    {
        "id": "1leygcz",
        "author": "Bunchdawg",
        "title": "Pressing this, pressing that... when did we forget midfield matters?",
        "content": "Real Madrid has won multiple UCL titles with attacking players who aren’t known for relentless pressing. Mbappe won a damn World Cup. Vini has two Champions Leagues, same with Rodrygo. Why can’t pundits see the real issue is in midfield? Blaming Vini and Mbappe for everything is getting as tired as last season’s obsession with the “high line.”",
        "upvotes": 133,
        "comments": 78,
        "media": null,
        "permalink": "/r/realmadrid/comments/1leygcz/pressing_this_pressing_that_when_did_we_forget/"
    },
    {
        "id": "1lefefg",
        "author": "ranger_ronaldo",
        "title": "REAL MADRID QUOTE THAT GOES HARD 🔥",
        "content": "",
        "upvotes": 1289,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IcKwHjUQV_T4Blt9r3zXdUQ1uIF1aOJ1I_OzyYfnD_M.jpeg?auto=webp&amp;s=3d309ce0e4893912a73c527fa9930229db06143d"
        },
        "permalink": "/r/realmadrid/comments/1lefefg/real_madrid_quote_that_goes_hard/"
    },
    {
        "id": "1lfdvmu",
        "author": "Proof-Pollution454",
        "title": "Yesterday’s match proves that we as fans have to be patient with Xabi and the squad as you can’t always win every match. We all need to trust in Xabi",
        "content": "I’ve been a real Madrid since the galácticos era to this day. Supported the club through great and rough times. It really upsets me how many madridistas are upset over the result when this is Xabi’s first match along with the squad playing to his style. Also with it being Trents game the other players too we have to trust In them. Ontop of that the squad still needs to sign more players to cover important roles of the team. I may get downvoted but it’s very important to be objective as football is like a roller coaster and there will always be highs and lows. I trust in Xabi and the squad that things will improve. Nonetheless , Hala Madrid. ",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lfdvmu/yesterdays_match_proves_that_we_as_fans_have_to/"
    },
    {
        "id": "1lfd879",
        "author": "Kalpesh_K",
        "title": "It’s difficult to watch at times, especially because we know the amazing talent we have and what we're capable of.",
        "content": "",
        "upvotes": 8,
        "comments": 11,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/x4lnx5hqgw7f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lfd879/its_difficult_to_watch_at_times_especially/"
    },
    {
        "id": "1leotro",
        "author": "AestheticEvan23",
        "title": "A picture of a young Gonzalo",
        "content": "",
        "upvotes": 352,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/legxxdvacq7f1.jpeg?auto=webp&amp;s=aee17ac7c315965f44dea7a6d163c998a159f558"
        },
        "permalink": "/r/realmadrid/comments/1leotro/a_picture_of_a_young_gonzalo/"
    },
    {
        "id": "1len93a",
        "author": "94Temimi",
        "title": "Our starting XI 🆚 Al Hilal",
        "content": "",
        "upvotes": 334,
        "comments": 232,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LFiPlOfFicgNvqlnPmZARZexEbWBfzvxo22l3pn-EKQ.jpg?auto=webp&amp;s=0d57e21c7efc9534857d55194f1c6ead998c4c9b"
        },
        "permalink": "/r/realmadrid/comments/1len93a/our_starting_xi_al_hilal/"
    },
    {
        "id": "1lf53z3",
        "author": "AffectionateGift3560",
        "title": "I overanalyze yesterday game .",
        "content": "There's is some good and quite a few bad \nI'll start with good.\n\n1. We saw the first offside goal I've seen in a while for us (has implications)\n\n2 . (Linked to point 1 ) We saw a more higher line and better communication across the backline for at least the first half .\n\n3 . In the first half we so almost an equal amount of play on the right wing and left wing Trent was making the right side look dangerous again.\n\n4 . Huijsen is a baller and was definitely a W signing.\n\n5 . Gonzalo Garcia not that but his heading abilities is clearly on track and could be the joselu we lost.\n\n\nNow for the bads and I can tell you there's no shortage.\n\n1.we were outnumbered in midfield we have this idea of passing the ball to winger they pas back then pass to defence then pass to midfield who is going to pass to the winger on the other side, that's just premium time wasting nothing is happening, \n\nMy idea 💡 to improve is that : \nwe need to go through the middle somehow , I think opponent's midfielder should be all marked \nAnd possibly outnumbered.\n\n2 . I don't like Lucas Vasquez came on . Trent is better and I know Xabi may want to get everything out of Lucas before he leaves but not in a game like this.\n\n3 . We should just stop using wingers in general \nVini and Rodrygo are too close to the edge of the pitch, far away from the team, waiting for the ball , normally that would stretch opponent defence but it isn't working,\n\nMy 💡 idea :\nthey need to be moving , rotating making it more unpredictable for opponents. they  need to sneak behind defence more often and not force themselves into having to make difficult dribbles.\n\n4. I'll end it quick but why was Rodrygo subbed off first he arguably played better plus he has trained with Xabi the most and would probably understand he's tactics better, and no hate on Vini they both didn't play well but I'd say Vini was worse \nMy idea 💡: \nXabi could have tried Rodrygo on the left wing to see how he performs .\n\n5 . We need more forward passes and we should get to the final third faster we have the quality.\n\n6 . Lastly Mbappe i hate you bro 😭 😭 😭💔💔 why ditch us like this . you could have made good use of Trent sill set and shut the haters but that's fine get better soon .\n\n                              HALA  MADRID !!!",
        "upvotes": 26,
        "comments": 27,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lf53z3/i_overanalyze_yesterday_game/"
    },
    {
        "id": "1legb7v",
        "author": "ranger_ronaldo",
        "title": "🚨⭐️ 𝐎𝐅𝐅𝐈𝐂𝐈𝐀𝐋: Toni Kroos receives the Seven Stars of Sports Award from the Community of Madrid",
        "content": "",
        "upvotes": 712,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tWhgb0oVpEOxpEjyU2W4A1wewpISMAtPWr9COYGdy14.jpeg?auto=webp&amp;s=d8916943824db373ccfd0f6de87264e6e03f687f"
        },
        "permalink": "/r/realmadrid/comments/1legb7v/𝐎𝐅𝐅𝐈𝐂𝐈𝐀𝐋_toni_kroos_receives_the_seven_stars_of/"
    }
]