[
    {
        "id": "1if0swi",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1if0swi/la_piola_friends_meetup/"
    },
    {
        "id": "1if0swb",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1if0swb/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1if1jhs",
        "author": "Sepp7",
        "title": "Controviali e traverse a destra",
        "content": "C'è un dubbio che mi assale sui controviali e le traversine a destra a senso unico. Se sono nel contro viale e vado dritto teoricamente dovrei dare la precedenza a destra a quelli che vengono da una traversa a destra. Però loro si stanno immettendo in una via principale mentre io sto andando dritto. Chi ha ragione in questi casi? Sono confuso ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1if1jhs/controviali_e_traverse_a_destra/"
    },
    {
        "id": "1ieom3x",
        "author": "Francigarla03",
        "title": "Nuovi Amici a Torino",
        "content": "Ciao a Tutti , siamo due ragazzi in cerca di nuovi amici :\n\n-Abbiamo entrambi 21 anni\n\n-Siamo persone che amano parlare di tutto e tendiamo molto a essere filosofeggianti\n\n-siamo Neurodivergenti ( io AuDHD , lui solo autistico)\n\n-siamo aperti ad ogni tipo di persona ma astenersi persone eccessivamente giudicanti\n\nNon vediamo l’ora di conoscervi 🤗 ( ah scrivetemi tranquillamente in privato ;)",
        "upvotes": 9,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ieom3x/nuovi_amici_a_torino/"
    },
    {
        "id": "1iesvre",
        "author": "_Mini_Hulk_",
        "title": "Cerco giocatori per una campagna Dnd dal vivo a Torino",
        "content": "So che non è un gruppo lfg ma ci provo lo stesso \n\n\nCampaign: The dragon of icespire peak 🐉\n\nI am a NEW DUNGEON MASTER running my first ever campaign (please be nice to me hahaha) and I'm looking for players (4 players) \n\n👁️‍🗨️ Campaign info\n\n🗣️Language: English 🇬🇧 (cz I'm not italian and am more comfortable DMing in English) \n📍Location: Torino, Italia (details later) 🇮🇹\n\n🗓️ Start date: around March 2025\n⏰ Duration: 8 to 15 sessions for part 0 (depending on the pace of the group) and if we enjoy it then we could do part 1, 2 and 3 (you can opt out between parts but please not in the middle of the campaign) \n⏳ Pace: once a week on Saturday or Sunday \n⌚Session length: 3-4 hours\n\n🗂️ Campaign parts\nPart 0: Dragon of icespire peak\nPart 1: Storm Lord’s Wrath: 7–10 sessions\nPart 2: Sleeping Dragon’s Wake: 6–9 sessions\nPart 3: Divine Contention: 8–12 sessions\n\n📃 To potentially join the campaign, please fill the form!\n\nhttps://forms.gle/Rh8exc49WLmxtmw56",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p-0aM718ODS2HCmIna9P0qjwhUIWA3jlXAV9O1s5Jvo.jpg?auto=webp&amp;s=0eeb7363e205cb44fe66fc2d05cb1e34d29200f2"
        },
        "permalink": "/r/torino/comments/1iesvre/cerco_giocatori_per_una_campagna_dnd_dal_vivo_a/"
    },
    {
        "id": "1iel0ye",
        "author": "Dear_Following5665",
        "title": "Gruppo di lettura a Torino!",
        "content": "Ciao!\n\nSono Federico di Romanzoapranzo, un blog in cui ogni venerdì, all'ora di pranzo, parlo dei libri che sto leggendo ☺️📚\nHo aperto un gruppo di lettura in presenza, a Torino: se sei interessat* e vuoi partecipare, scrivimi! ☺️",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1iel0ye/gruppo_di_lettura_a_torino/"
    },
    {
        "id": "1ievknv",
        "author": "CarpenterCritical63",
        "title": "Qualcun altro qui piace truccarsi da clown? 🎪🤡 (M21)",
        "content": "Ciao a tutti! Qualche tempo fa mi hanno truccato da clown e, anche se prima li vedevo come personaggi un po' strani, l’esperienza mi ha fatto scoprire un lato divertente e liberatorio che non mi aspettavo. Per ora ho provato solo lo stile classico, ma sono curioso di esplorare altri tipi di trucco. C’è qualcun altro qui a cui piace questo hobby?  \n\nA parte il trucco da clown, mi piacciono un sacco di altre cose. Ad esempio, sono un grande fan del fantasy, sia nei libri che nei film, anche se ultimamente faccio fatica a trovare qualcosa di nuovo che mi prenda. Nel frattempo, mi tengo occupato con i videogiochi: sto rigiocando a Monster Hunter World in attesa di Wilds, ma ogni tanto mi lascio tentare da League of Legends.\n(piccola parentesi ci sono Sonic e Garfield, due icone che adoro).\n\nE poi c’è la musica: passo da Hatsune Miku agli Smiths, dai Radiohead ai Prozac… insomma, un po’ di tutto!  \n\nSe anche voi avete hobby simili o volete semplicemente chiacchierare, scrivetemi pure!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ievknv/qualcun_altro_qui_piace_truccarsi_da_clown_m21/"
    },
    {
        "id": "1ien9qz",
        "author": "Adsodamelk17",
        "title": "Dove alloggiare bene a prezzi modici",
        "content": "Salve a tutti, a fine mese verrò per un weekend a Torino a trovare un amico e mi chiedevo se qualcuno potesse consigliare un posto per alloggiare senza spendere troppo ma che non sia una topaia. Per quanto riguarda la zona non conosco molto la città ma cercherei qualcosa di non troppo decentrato e/o comunque ben connesso con il resto della città. Grazie in anticipo a tutti quelli che mi vorranno dare una dritta",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ien9qz/dove_alloggiare_bene_a_prezzi_modici/"
    },
    {
        "id": "1idyfb7",
        "author": "NamelessNiner",
        "title": "GTT, perché?",
        "content": "\"A seguito del proseguimento dei lavori di migrazione al nuovo sistema digitale operati da Infra.To, il servizio della metropolitana modifica gli orari dal 2 febbraio al 16 aprile 2025\"\n\nE tornano agli orari di sempre, chiusura alle 21:30 in settimana. I turnisti che staccano alle 23? Possono fottersi. Era così bello poter credere di avere una metropolitana funzionante, degna di questa nome.\n\nUn mese è durato, ora torniamo alla barzelletta di sempre. &gt;!E hanno il coraggio di scioperare.!&lt;",
        "upvotes": 57,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1idyfb7/gtt_perché/"
    },
    {
        "id": "1iegos1",
        "author": "Nearby-Tea1646",
        "title": "Can I sue my company?",
        "content": "Hello lovely people, I am in a weird situation. I work as a consultant for company, and I had discussions with them last year, October to have my salary increased. And I got a confirmation in written from them that they will increase my salary from January 2025. Low and behold, I got my pay slip and nothing changed. I really don't know the law here in Italy, but can I sue them for not keeping their promise?",
        "upvotes": 2,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1iegos1/can_i_sue_my_company/"
    },
    {
        "id": "1iejipa",
        "author": "Odd-Touch5683",
        "title": "Colloquo",
        "content": "Ciao a tutti! Vorrei chiedere dei consigli per un colloquio. Qualcuna ha fatto un colloquio con Altea Up per una posizione junior SAP? \nSapete dirmi quanti colloqui avete fatto oltre a quello con l’HR e cose è stato chiesto?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1iejipa/colloquo/"
    },
    {
        "id": "1iea492",
        "author": "MarTruf",
        "title": "Negozio di biciclette",
        "content": "Buogiorno a tutti ragazzi!\n\nDopo tanti anni di prestante servizio, è arrivato il momento di mandare in pensione la mia vecchia mountain bike. Ora devo sostituirla, e pensavo di comprarmi qualcosa di un po' più serio (ma non troppo), con budget di 700-800€.\n\nVolevo chiedervi se mi sapreste consigliare un negozio di biciclette, possibilmente dentro Torino, con cui avete avuto buone esperienze.",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1iea492/negozio_di_biciclette/"
    },
    {
        "id": "1idql37",
        "author": "No-Bit-2036",
        "title": "Le venti giornate di Torino",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3yk0ubffm5ge1.png?auto=webp&amp;s=15b1a2a03350cf03724957325a29638c968f2cac"
        },
        "permalink": "/r/torino/comments/1idql37/le_venti_giornate_di_torino/"
    },
    {
        "id": "1idvz9u",
        "author": "Alarmed_Lawyer400",
        "title": "Avete contatti di idraulici con prezzi onesti?",
        "content": "Ne approfitto per chiedere i prezzi medi per un intervento di spurgo qua a Torino.\n\nHo gli scarichi che non riescono più a tirare giù e ogni lavatrice mi si riempie la doccia di schifo (probabilmente per un problema di inclinazione degli scarichi o boh).",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1idvz9u/avete_contatti_di_idraulici_con_prezzi_onesti/"
    },
    {
        "id": "1idy97h",
        "author": "mandrake_55",
        "title": "Consiglio affitto stanza singola",
        "content": "Ciao ragazzi, secondo voi com'è come prezzo 400€ all-inclusive per una casa a mirafiori-sud (via quarello).\nLa casa è nuova e ben tenuta, la stanza carina ma non grandissima, con letto singolo.\nAttualmente vivo a mirafiori ma pago 350 per una situazione simile, non ho trovato peró nulla a questo prezzo, c'è stato un aumento generale?\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1idy97h/consiglio_affitto_stanza_singola/"
    },
    {
        "id": "1icq494",
        "author": "iannezluke79",
        "title": "Five Guys",
        "content": "Sicuramente lo saprete già ma non si sa mai\nSta aprendo a Porta Nuova",
        "upvotes": 384,
        "comments": 133,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jzwypgv8kwfe1.jpeg?auto=webp&amp;s=0cdc82f57bd30bde68d91c039c3cd9af69a0170d"
        },
        "permalink": "/r/torino/comments/1icq494/five_guys/"
    },
    {
        "id": "1idp0h0",
        "author": "Samsri719",
        "title": "Quanto costa la prima offerta per l'acquisto di una casa a Torino?",
        "content": "Voglio comprare una casa a Torino ma non sono sicuro di come funziona. Sono per metà italiano e per metà inglese, ma sono cresciuto nel Regno Unito. So che si può fare un'offerta inferiore al prezzo di vendita, ma cosa è normale per una prima offerta? Se l'appartamento è in vendita da più di 8-9 mesi? \nHo ricevuto un'eredità da mia nonna e voglio solo un piccolo appartamento, tra i 40 e i 60 metri, per viverci... cerco qualche consiglio.",
        "upvotes": 1,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1idp0h0/quanto_costa_la_prima_offerta_per_lacquisto_di/"
    },
    {
        "id": "1idsba5",
        "author": "No-Ant-9038",
        "title": "Insegnatemi a rollare",
        "content": "Qualcuno a Torino mi vuole insegnare a rollare, in cambio ci smezziamo una j. ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1idsba5/insegnatemi_a_rollare/"
    },
    {
        "id": "1iczmfw",
        "author": "Extra-Window7021",
        "title": "amicizie (si di nuovo)",
        "content": "avevo già fatto un post un pochetto di tempo fa, ma a causa di problemi miei ho lasciato tutto in standby e ho smesso di rispondere. cerco sempre amicizie qui a torino visto che da quando mi sono trasferita qui cinque anni fa non sono ancora riuscita a trovare una compagnia decente con cui uscire.\n\nsono una ragazza di 19 anni (al momento in cui sto facendo il post, mancano due giorni al mio compleanno), mi sono recentemente appassionata al mondo del cinema, mi piace vedere film di qualsiasi tipo purché abbiano una trama ispirante. ascolto moltissima musica, soprattutto musica latina, pop americano e k-pop (non è così male posso assicurarlo). mi piace molto anche studiare lingue, attualmente sto studiando lo spagnolo ma prossimamente inizierò anche con il portoghese e coreano. \n\nall’inizio sono una persona abbastanza silenziosa e riservata, ma appena prendo confidenza veramente sono molto più aperta e parlo con molta più facilità. ",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1iczmfw/amicizie_si_di_nuovo/"
    },
    {
        "id": "1iczjth",
        "author": "backdunflip",
        "title": "Consiglio ginecologa",
        "content": "Ciao a tutte, sapreste consigliarmi una ginecologa con cui vi siete trovate bene?   \nNel mio caso starei cercando una dottoressa con cui valutare una terapia ormonale per gestire meglio la sindrome premestruale",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1iczjth/consiglio_ginecologa/"
    },
    {
        "id": "1id5u7v",
        "author": "Mistybluecat",
        "title": "Gift basket",
        "content": "Hi Turin locals.\nMy friend has just had a baby and I would love to send her a gift basket.  She lives in Torino. Does anyone have any suggestions of local places where I can purchase this from online? \nTIA ",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1id5u7v/gift_basket/"
    },
    {
        "id": "1icsqh3",
        "author": "goodbyejimmy",
        "title": "Calzolaio per riparare dr Martens?",
        "content": "Ciao! Avrei bisogno di riparare le suole platform delle dr Martens, in particolare si tratta di sigillare la spaccatura. Conoscete qualche calzolaio in grado  di farlo o con esperienza con questo tipo di scarpe? ",
        "upvotes": 4,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vyjjnwt8gxfe1.jpeg?auto=webp&amp;s=66df80ff5d13ab733af112efe62903c8c8fd3a65"
        },
        "permalink": "/r/torino/comments/1icsqh3/calzolaio_per_riparare_dr_martens/"
    },
    {
        "id": "1id3ll4",
        "author": "tnndaboss1",
        "title": "What's a popular bar/club that is open on a wednesday night?",
        "content": "I'm about to head out to maybe bar hop. Any good recommendations? I'd prefer younger bars, as I am in my early 20's",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1id3ll4/whats_a_popular_barclub_that_is_open_on_a/"
    },
    {
        "id": "1ict9wg",
        "author": "Lindanineteen84",
        "title": "cassette della posta per imbucare lettere e cartoline",
        "content": "Ho comprato una cartolina da spedire a dei miei amici in Inghilterra, cosa che non facevo veramente da anni, infatti mi sono accorta solo così che tutte le cassette della posta della mia zona, quelle rosse, sono sparite. Quindi ora mi chiedo, come la spedisco la cartolina? Devo per forza andare all'ufficio postale, o ne sono rimaste ancora in giro per Torino? Se ci sono, qualcuno sa indicarmi dove?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ict9wg/cassette_della_posta_per_imbucare_lettere_e/"
    },
    {
        "id": "1icwo48",
        "author": "_lostinthisworld_",
        "title": "Bollette elettriche",
        "content": "Ciao a tutti, ho una domanda riguardo l'elettricità in Italia. La bolletta del mese scorso è stata quasi 180 euro, e tra l'altro sono stato fuori casa per 10 giorni per motivi di viaggio. È normale per un appartamento di circa 25 metri quadrati?\n\n",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1icwo48/bollette_elettriche/"
    },
    {
        "id": "1icvw9y",
        "author": "Stock-Ad-4995",
        "title": "Sostituzione porta e allarme causa furto",
        "content": "Ciao a tutti, mi servirebbe se possibile un consiglio su chi chiamare per fare urgente sostituzione della porta di casa, ho avuto un furto in casa e la serratura è stata completamente sfondata, quindi immagino serva sostituire tutta la porta. \n\nConoscete qualcuno di affidabile e rapido? In questo momento ho la porta praticamente aperta. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1icvw9y/sostituzione_porta_e_allarme_causa_furto/"
    },
    {
        "id": "1icq6rp",
        "author": "LearnSodas",
        "title": "Scambi carte pokemon zona Santa Rita",
        "content": "Ciao a tutti! Ho iniziato a collezionare carte pokemon da pochissimo e già mi ritrovo con un po’ di doppioni. Volevo sapere se ci fosse un luogo in zona Santa Rita dove ci si incontra con altri collezionisti per poter scambiare carte e rendere più semplice completare i set\n\nNe conoscete?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1icq6rp/scambi_carte_pokemon_zona_santa_rita/"
    },
    {
        "id": "1icnzmm",
        "author": "bora907",
        "title": "Rowing in Torino",
        "content": "Hi! I will be in Torino for about 6 months. I know people do rowing in river Po, is there any rower here? I wonder how to join a club or do rowing in Torino.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1icnzmm/rowing_in_torino/"
    },
    {
        "id": "1icx3xi",
        "author": "Formal_Leadership_69",
        "title": "Consiglio di",
        "content": "Sono stato insieme 2anni  a una donna più grande di me di 16 anni e a letto non mi faceva impazzire ci vedevamo anche poco solo nei week, però ora che ci siamo lasciati ho ancora un po' di malessere generale. Potrebbe essere solo l abitudine o c'è dell altro? Cosa ne pensate? Ora io da che ci sentivamo molto giornalmente, ho iniziato a evitare di chiamarla e a volte è lei che mi cerca con la consapevolezza che nn va bene perché continuiamo a farci del male. La rottura è stata proprio per la questione della età perché lei è sempre stata molto bloccata (così dice) quindi nn si è mai lasciata andare più di tanto. Cmq io 47 anni e lei 63 portati ovviamente benissimo. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1icx3xi/consiglio_di/"
    },
    {
        "id": "1icbuzx",
        "author": "matbordaRnB",
        "title": "Revisione caldaia",
        "content": "Ciao\n\nMi consigliereste qualche revisore di caldaie di fiducia?\n\nGrazie!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1icbuzx/revisione_caldaia/"
    },
    {
        "id": "1ib3hq4",
        "author": "nullstuff",
        "title": "Ormea's loophole",
        "content": "",
        "upvotes": 729,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w1bnwdjzxhfe1.jpeg?auto=webp&amp;s=3f44d7005fd50397c4d8633d1354fedfec2f5dad"
        },
        "permalink": "/r/torino/comments/1ib3hq4/ormeas_loophole/"
    },
    {
        "id": "1ibqwvq",
        "author": "UccioDago",
        "title": "Carrefour corso Turati 75 Torino",
        "content": "Che si sappia: \n\nNel parcheggio del #Carrefour di corso Filippo Turati 75\nc'è un controllo all'ingresso mediante telecamere.\nSe superi le due ore di sosta arriva a casa un multone di 40€\n25€ di multa e 15€ per la gestione della stessa. La multa la emette una ditta tedesca con sede a Bolzano Parkdepot, la stessa che gestisce l'impianto di fotocamere. \n\nIo ne ho ricevute due oggi via posta. Non sono in grado di stabilire se sia lecito che un'azienda possa emettere multe.\n\nPer ora voglio ringraziare sentitamente  il Carrefour ",
        "upvotes": 26,
        "comments": 45,
        "media": null,
        "permalink": "/r/torino/comments/1ibqwvq/carrefour_corso_turati_75_torino/"
    }
]