[
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 74,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lsmlz5",
        "author": "Fragrant_Peanut_9661",
        "title": "Mr Robot",
        "content": "So I'm just about to start this. Mr Robot. I'm doing it based off recommendations from here. Is it really as good as I've heard? I'm like horror/thriller normally. But I've heard a fuck-ton of ranting and raving over it. So I'm gonna give it a shot! 🤞🏻📺",
        "upvotes": 34,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1lsmlz5/mr_robot/"
    },
    {
        "id": "1lsie08",
        "author": "ToonAdventure",
        "title": "Cyberpunk: Edgerunners 2 | Official Teaser | Netflix",
        "content": "",
        "upvotes": 24,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lsie08/cyberpunk_edgerunners_2_official_teaser_netflix/"
    },
    {
        "id": "1lsi9o5",
        "author": "RunPowerful468",
        "title": "Adolescence",
        "content": "I believe that by trying to break a generational curse, the dad unintentionally creates a new one.\n\nAt the end he talks about how his dad used to beat him so he promised himself that he wouldn’t do the same to his kids so my assumption is that throughout Jaime’s life whenever the dad saw himself in Jaime he chose to ignore it because he didn’t know how to handle it and just let Jaime be. By doing that jaime doesn’t know how to regulate his feelings so he holds it in and lashes out when the pressure becomes too much. One thought that crossed my mind, is when the dad is mentioning all the things he did to help Jaime, was the same exact reasons Jaime did what he did.",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lsi9o5/adolescence/"
    },
    {
        "id": "1lsbeqy",
        "author": "WinAdmirable5400",
        "title": "Have the small pictures been removed when rewinding?",
        "content": "When I try to rewind or fast forward there used to be an image of each 5-10 second increment on the bottom. Now there’s only a blank grey square. Is this a new thing? It feels like it’s intentional and not a bug. I don’t like it.",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lsbeqy/have_the_small_pictures_been_removed_when/"
    },
    {
        "id": "1lsptuc",
        "author": "Outside_Way_9676",
        "title": "Is this normal?",
        "content": "Is in normal for chat support to hang up after you ask for a refund after informing them that you don't live in the same country as where they said I AM ACTIVELY USING NETFLIX ON A BRAND OF TV I DON'T OWN??? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lsptuc/is_this_normal/"
    },
    {
        "id": "1lsl531",
        "author": "Chance_Excitement_63",
        "title": "If you have seen the amazing new film K-Pop Demon Hunters, what was your favorite song(s) from the film?",
        "content": "For a fictional boy band, they were heard to have broken several Spotify records, including best song or something that overtook BTS! This is the best animated film I've seen in a while since Ladybug &amp; Cat Noir: The Movie!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lsl531/if_you_have_seen_the_amazing_new_film_kpop_demon/"
    },
    {
        "id": "1lsox1p",
        "author": "ChipsnGiggles23",
        "title": "Show I can’t remember the name of",
        "content": "I’m pretty sure it was Netflix and this was years ago, but the scene that really stuck out to me was a husband and wife. We’re having a barbecue of some sort of possibly a birthday party for him and his wife goes to the trunk of his car and finds a second phone in the trunk and that their family friend is having an affair with him she is looking at the phone as well as all of the people in their lives at the party who knew about the affair",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lsox1p/show_i_cant_remember_the_name_of/"
    },
    {
        "id": "1lsok0r",
        "author": "Jason13v2",
        "title": "The subtitles' shadow disappeared after the most recent app UI update.",
        "content": "What can I do? When I go into the subtitle settings, the shadow option is still there, but even after disabling and re-enabling it, the shadow doesn't appear.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lsok0r/the_subtitles_shadow_disappeared_after_the_most/"
    },
    {
        "id": "1lsoez3",
        "author": "Agitated_Stable992",
        "title": "Does anyone know anything about this old tv show?",
        "content": "I dont have a good description but I know that it was 1. On netflix kids, and 2. Removed\n\nThe main details that I remember is last watching it in around 2017, the characters had powers that could be activated by shouting something? Sorry I don't remember much, but on plot point is the main characters dad is missing but was part of the organization that had the powers. The organization would fight crime stuff like that\n\nSorry guys I don't remember much, but also if anybody has a list of the shows removed from netflix it would help a ton, and also it wasn't a Netflix Original\n\n\\-just posted this on r/tipofmytongue will update this post and that one with any new info",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lsoez3/does_anyone_know_anything_about_this_old_tv_show/"
    },
    {
        "id": "1lso0c5",
        "author": "revveduplikeaduece86",
        "title": "Old Guard 2",
        "content": "# FIRST, It Wasn't That Bad\n\nWe have to give credit where it's due for developing an original franchise with a mostly unique story. We don't get a ton of film sequels from Netflix, so I'm glad thidls looks like it's shaping up to be a trilogy. \n\nThat said, I think they could've done better on a few points. I think they overplayed the healing ability. I think dumping us straight into action was different and brave, but the time skip to a fully formed team was a little jarring, and I think they missed out on what makes \"immortal\" films interesting--but more on that later. \n\nMost of the action was good, let's be honest here. Solid sequences, great cast, and I can't say any single performance was *bad,* per se. After all, the actors can only work with that they were given. \n\nThe story fell a little short because what makes immortal films interesting is the back story. So we get Discord dropped into the mix with zero backstory. We get Tuah dropped in. Tuah's decision to never tell Andy about Discord isn't entirely clear. Why wouldn't Discord have reached out after Tuah saved Andy? Why is Nile \"the last immortal?\" Is their power genetic (as the first film suggested) or magic (a blade strike from *The Destroyer* says \"eff those genetics\"). \n\nI feel like they chased an idea before fully fleshing it out, and now we're kinda stuck on this path. \n\nMonday morning quarterbacking is always easy. But what ia a shitty Internet review without one? \n\nI think within the immortal genre \"going back\" is very common... Think, Highlander.\n\nPerhaps an interesting place to take the story might be the future. What if, perhaps in a spin-off show, Nile really is the last. She lives quietly, alone, for thousands of years believing she is the last until a \"new generation\" of immortals emerge. We learn about her history (still our future) through her recounting to her protege, her path through time. Ultimately giving said protege the lesson of the dangers of \"corrupt\" immortals, setting him/her on a journey through space and time to defend the galaxy against the threat. \n\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lso0c5/old_guard_2/"
    },
    {
        "id": "1lsnrrt",
        "author": "farahisweird",
        "title": "Need recommendations",
        "content": "Hello \nPlease recommend films like popstar don’t stop stopping and Eurovision. I would love yo watch something like these masterpieces on Netflix. \n\nThank you in advance ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lsnrrt/need_recommendations/"
    },
    {
        "id": "1ls40hy",
        "author": "BUckENbooz91",
        "title": "Is Kingdom worth the investment to watch?",
        "content": "I've always loved zombie films. There's a lot of Korean films I've enjoyed, as well as series like Squid Game, All of Us Are Dead, Train to Busan, Sweet Home and much more. I won't lie when I tried to watch the first episode I was dosing off to sleep almost. It was pretty late, but I remember it feeling like it was just dragging on. I started the second episode and about half way got distracted. I'm considering starting over again as I'm looking for something to watch. Please let me know what you guys thought of Kingdom, and no spoilers for me, please! ",
        "upvotes": 21,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ls40hy/is_kingdom_worth_the_investment_to_watch/"
    },
    {
        "id": "1lrzxxf",
        "author": "Blitzo-with-silent-O",
        "title": "Netflix better be making the third The Old Guard movie.",
        "content": "I will be so upset if they do not make another one.  Especially after the ending of the second movie left us hanging like that. They better be giving us a third one or I will quit Netflix for good.",
        "upvotes": 44,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1lrzxxf/netflix_better_be_making_the_third_the_old_guard/"
    },
    {
        "id": "1lshl0r",
        "author": "Siluncd",
        "title": "Infinite on Netflix?",
        "content": "So ive read several articles that say the Mark Wahlberg movie, infinite, is now out on Netflix and headed for no.1. but when I search, it doesn't find the movie. Is the articles bogus or anyone else not being able to find the movie?",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1lshl0r/infinite_on_netflix/"
    },
    {
        "id": "1ls96gx",
        "author": "nee_m_d",
        "title": "Any way of NOT getting suggested movies/series in foreign language",
        "content": "Hi, I'm relatively new to Netflix. I've set English as my preferred language in my profile, but I keep getting suggestions for movies that aren't in English. It's frustrating, especially since the language or country of origin often isn't shown until you actually start watching. I mostly want to watch US or UK-made movies. Is there a way to set my preferences so that only those kinds of movies are suggested?",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ls96gx/any_way_of_not_getting_suggested_moviesseries_in/"
    },
    {
        "id": "1lskpl2",
        "author": "Sad-Eggplant6933",
        "title": "Dracula (2020) - the ending",
        "content": "Spoilers ahead:\nHello. I’ve just finished watching the show. I enjoyed it SO much and I was shocked to see how good the ending is.\n\nOne thing I don’t understand though is — “after all this time, did you think I would let it hurt?”\nIs he referring to him dying, or Agatha? From my first understanding he was talking to her, so I thought he meant both of their deaths. The more I watch it, the more it seems like he’s talking about his death — but it DOES hurt him. It’s a poison, he was choking.\n\nAlso there’s this tone in his voice, it seems affectionate. I don’t romanticise them but I think (and it’s well portrayed the whole time, especially at the end) they are interlinked. Their relationship is deep and I totally love it. I wonder if there’s any deeper meaning in the last conversation (the blood drinking).\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lskpl2/dracula_2020_the_ending/"
    },
    {
        "id": "1lsjdr2",
        "author": "Extra-Neat-3073",
        "title": "K-Pop demon hunters, what sort of expansion are you rooting for?",
        "content": "For context I think there are multiple routes that they could go for expansion. They could do a prequel, sequel, and even a series (maybe how to train your dragon style) just wanted to know everybody's thoughts on what they should do next.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lsjdr2/kpop_demon_hunters_what_sort_of_expansion_are_you/"
    },
    {
        "id": "1lrwuqw",
        "author": "StarMasterAdmiral",
        "title": "Just got the new interface and it's horrible!",
        "content": "Like many others, we just got the new interface. One of the worst I've used. I have no clue how Netflix can say that this was preferred by users. I'm considering cancelling. Worst of all, why don't any of the major streaming providers just give users their choice? ",
        "upvotes": 41,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1lrwuqw/just_got_the_new_interface_and_its_horrible/"
    },
    {
        "id": "1lsj225",
        "author": "indiewire",
        "title": "The 7 Best New Movies Streaming on Netflix in July 2025",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lsj225/the_7_best_new_movies_streaming_on_netflix_in/"
    },
    {
        "id": "1lsikh3",
        "author": "ToonAdventure",
        "title": "My Melody &amp; Kuromi | Official Clip | Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lsikh3/my_melody_kuromi_official_clip_netflix/"
    },
    {
        "id": "1ls47fp",
        "author": "Z0CH0R",
        "title": "Dept Q - Were Carl being followed during his investigation ?",
        "content": "Hi guys,\n\nWhen I first watched the show, upon episode 6, when Carl and Akram go into questioning Fergus about the investigation, he was beaten by some guy.\n\nWhen Carl returns to the precinct, he pulls over and the camera then stays for a full frame on this dark red Mercedes slowing down and then stopping after his Ford.\nFor me this was not some useless detail because it seemed the camera followed this car on purpose, also it caught my eye because it was the same color as Carl's car. \n\nI found it quite bizarre and decided to remember this bit if it comes back later.\nFor me, this car seemed to have followed Carl. Especially after Fergus told them that he was beaten by someone who they suspect is hurting him for cooperating with the investigation.\nThis seemed very odd.\n\nThen episode 9, revelation : we see Ailsa, Lyle's mother, trying to run away on the ferry with the same burgundy red Mercedes. The license plate matches the one following Carl in ep 6. So it was the same Mercedes who stopped behind Carl. It's not possible to see exactly who the driver is... \n\nSo I'm just wondering :\n* Do you think Lyle and his mother were following Carl and Akram during their investigation?\n* Were they the one hurting Fergus to silence him?\n* What this not extremely stupid since \"Sam\" was supposed to be dead? Being caught still alive is risky? \n\nMy take is that it must have been Lyle following Carl but it throws everything upside down knowing that Lyle was following the investigation... \nLyle has the capabilities to spy and stalk since he did that to Merritt. (like the scene where he is behind the window watching from outside before William, Merritt's brother sees him and  screams, to later recognize him on the boat).\nHe was also not always guarding Merritt and not always on the island, her mother did most of the job of keeping her enclosed.\nSo maybe, he was spending his time following Carl?\nBut for what? Taking this chance of being discovered is for me really risky, what is the point? \nAlso, if you're a cop, normally you can spot someone tailing you. \n\nDid you also catch this detail or is this new to you ?\n\nLet me know, I'd love to hear your theories! :) ",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ls47fp/dept_q_were_carl_being_followed_during_his/"
    },
    {
        "id": "1lrhmhg",
        "author": "Maison-Ikkoku",
        "title": "The horrific new Netflix user interface … venting",
        "content": "I am just venting here out of frustration with the not so new anymore Netflix user interface. Many of you probably like it or have adjusted to it, as Netflix’s own research would suggest, but I could not. I tried, I really tried. \n\nA discussion on the drawbacks of the interface has been exhausted so I will not get into it. What I would add is that I noticed that I have been recently spending more time on Apple TV and HuLu. Not out of stubbornness or revenge, but it came organically. The interface of all three platforms is now very similar with the Netflix one being mid pack. I can no longer tell the difference so I would watch whatever is good. I think the new Netflix interface is an opportunity for other streaming platforms to catch up with Netflix and get new subscribers. It might also be the beginning of Netflix’s decline or at best plateau.",
        "upvotes": 280,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1lrhmhg/the_horrific_new_netflix_user_interface_venting/"
    },
    {
        "id": "1lsozyn",
        "author": "confusedalgerien",
        "title": "How did Netflix manage to do this?",
        "content": "In April of this year, my old Netflix account got hacked. Didn't know until I received two emails saying my email, password &amp; payment method were changed. And I know it was a hack because no one else has ever had access to my account. So silly me decided to just cancel my debit card &amp; create a new Netflix account with my new card information instead of going through the whole customer support hassle. In May, I got an unexpected charge of $13 from Netflix which had me confused bc I have always had the most basic with ads plan ever since I joined Netflix. But I shrugged it off (no clue why). June was normal. Then today, I got a charge for $26.50 from Netflix. And that’s when the alarm bells went off. I realized the hackers were still using my account, increased the plan, and I was still getting charged for it despite cancelling the card that was on file for that account. Today I called Netflix support, they looked into my old account information, and they saw it. They cancelled and closed the account. And now I have to dispute the past 2 charges with the bank.\n\nHow in the world was I still being charged? Did they automatically enter the new information from my new account back to the old one? Did the bank just update it automatically? Whole situation has driven me crazy ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lsozyn/how_did_netflix_manage_to_do_this/"
    },
    {
        "id": "1lsabak",
        "author": "ArcticSnow85",
        "title": "Detective Conan!",
        "content": "I’m so excited they picked up one of my favorite anime! It’s been years since the last English dub, and now tubi and Netflix are dropping new episodes (New to English dubbed)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lsabak/detective_conan/"
    },
    {
        "id": "1ls7s4y",
        "author": "Friedspam808",
        "title": "Sequel for Kpop Demon Hunters???",
        "content": "Personally I loved it!!!!! Tbh my boss even recommended this to me even though she only exclusively watch murder-mistery/thriller shows. \n\nI love their friendship, it feels silly and genuine, like my own in real life.\n\nI loved Jinu too, I hope he can come back for the sequel (somehow) an I kind of home they add a little romance too.\n\nI also hope they don't rush the makings of a sequel and botch it though. That's the last thing I want.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ls7s4y/sequel_for_kpop_demon_hunters/"
    },
    {
        "id": "1ls4ru5",
        "author": "Lunally",
        "title": "Help me understand this scam",
        "content": "So my partner just noticed that there was a subscription charge from netflix coming out of his personal bank account, when our netflix account has been linked to our joint bank card for a while now (but used to be coming out of his personal card). I searched on our account and there were no trace of this in our payment history.\n\nI called Netflix and within minutes they found the scam and said this will be blocked and we won't have any more issues.\n\nWe also got an email from Netflix addressed to someone else saying the subscription had been cancelled, and to contact them if we didn't request this change.\n\nWhat exactly happened here? Did someone create a different account with my partner's email and bank card? I don't understand how they could get both his card details and his email address, and how could Netflix see that it was a scam so quickly without asking us any security questions or anything else? Thanks!",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ls4ru5/help_me_understand_this_scam/"
    },
    {
        "id": "1ls8z5i",
        "author": "VesnaKostic",
        "title": "Recommendation for a TV show where a person imagines a relationship with someone \nand has its own reality that has no relation to the real world",
        "content": "\n\nRecommendation for a TV show where a person imagines a relationship with someone. As if they are in a serious relationship, but they are not. But not Baby Reindeer, that's what I watched, and I would like something darker and more twisted. It doesn't even have to be a relationship, but a series where a person has his OWN REALITY that has nothing to do with real life.\n\n\n\nSPOILERS!!! \n\nLike Emma Beesly in Clicbait",
        "upvotes": 2,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1ls8z5i/recommendation_for_a_tv_show_where_a_person/"
    },
    {
        "id": "1lsi9pq",
        "author": "ToonAdventure",
        "title": "Anime Expo 2025 | You're' Not Ready | Netflix Anime &amp; Games",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lsi9pq/anime_expo_2025_youre_not_ready_netflix_anime/"
    },
    {
        "id": "1ls6uyk",
        "author": "Top-Three-USA",
        "title": "Squid Game creator Hwang Dong-hyuk says Season 3’s ending cameo isn’t linked to the U.S. spin-off and confirms no official talks with Netflix yet",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ls6uyk/squid_game_creator_hwang_donghyuk_says_season_3s/"
    },
    {
        "id": "1lsawq0",
        "author": "Averyhandsonuncle",
        "title": "Continue watching plays a show i watched days ago!",
        "content": "I was watching supernatural few days ago and i saw old guard 2 is out and when I clicked watch now, it went to a random supernatural episode! I've noticed this is happening a lot. I clicked sienfeld and it went to a movie i watched last month on a random scene! Sometimes when I play a supernatural episde it'll toss me like 2 episodes to a while season back. Please help this is beginning to frustrate my why pay for borderline torture netflix ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lsawq0/continue_watching_plays_a_show_i_watched_days_ago/"
    }
]