[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 6,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1mkrixt",
        "author": "sw1nky",
        "title": "Pet rescue/shelter volunteering",
        "content": "Anyone know of some animal shelters where I can volunteer, specifically driving, like picking up fosters to bring to foster families etc? Grazie 🙏",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mkrixt/pet_rescueshelter_volunteering/"
    },
    {
        "id": "1mkykam",
        "author": "G14NP13R0",
        "title": "EDISU",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mkykam/edisu/"
    },
    {
        "id": "1mkujxn",
        "author": "GlezIsBauk",
        "title": "Pallavolo?",
        "content": "M18\n\nSono nuovo qua a torino e sarò qua fino al 25, qualcuno sa dove posso giocare? (Implicito: qualcuno ha voglia di giocare con me?)",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1mkujxn/pallavolo/"
    },
    {
        "id": "1mjzplc",
        "author": "carmelolg",
        "title": "Qualcuno a Torino che scatta ancora in analogico? Consigli per risparmiare?",
        "content": "Ciao a tutti!\n\nVolevo chiedere se c’è qualche appassionato di fotografia analogica qui su Torino che scatta ancora con le vecchie pellicole.  \nNegli ultimi tempi mi sto chiedendo se abbia ancora senso continuare, almeno dal punto di vista economico (la passione ovviamente resta!).\n\nI prezzi delle pellicole e dello sviluppo sono aumentati tantissimo: una pellicola 35mm da 36 pose (tipo Kodak ColorPlus) costa tra i 10 e i 15 euro e lo sviluppo, senza stampe, parte da almeno 10 euro. In pratica, per ogni rullino, si arriva facilmente a spendere 20 euro o più.  \nPer chi, come me, vorrebbe scattare con una certa regolarità, diventa una bella spesa.\n\n**La mia attrezzatura attuale è:**\n\n* Pellicole: Kodak ColorPlus 35mm\n* Fotocamere: Minox 35GL e Praktica BC1\n\nC’è qualcuno qui che continua a utilizzare le analogiche a Torino?  \nAvete qualche consiglio per risparmiare, magari laboratori economici in città, posti dove prendere le pellicole a prezzi migliori, oppure dritte su come sviluppare a casa?  \nMi piacerebbe confrontarmi con altri appassionati della zona e magari scoprire qualche trucco per continuare a scattare senza spendere una fortuna!\n\n",
        "upvotes": 11,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1mjzplc/qualcuno_a_torino_che_scatta_ancora_in_analogico/"
    },
    {
        "id": "1mk6hqh",
        "author": "akkyuz",
        "title": "Tecnico gas",
        "content": "Ciao,\nDato che vorrei sostituire il mio attuale piano cottura a gas con uno a induzione (che già possiedo), avrei bisogno di un tecnico che mi venga a chiudere il tubo del gas collegato al piano. È un'operazione che potrei anche fare da solo ma visto che si tratta di gas preferirei farlo fare a un tecnico specializzato. Avete consigli?\n\nGrazie!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mk6hqh/tecnico_gas/"
    },
    {
        "id": "1mk6lyk",
        "author": "Tony_zer0five",
        "title": "Bakugan",
        "content": "Sapete se c'è un posto dove vendere carte bakugan a Torino o in provincia, Ho a qualcuno interessa comprare o scambiare carte bakugan?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mk6lyk/bakugan/"
    },
    {
        "id": "1mk7lbu",
        "author": "DamDesigns11",
        "title": "Aiuto.",
        "content": "\nVorrei dei consigli sul lavoro e sull'alloggio nella zona di Torino. Andrò all'Università di Torino per studiare e ho bisogno di trovare un alloggio per due persone, preferibilmente il più vicino possibile all’università. Inoltre, vorrei dei consigli su come o dove posso trovare un lavoro part-time dopo le lezioni, per guadagnare qualche soldo extra. Non parlo ancora italiano, ma mi iscriverò a dei corsi non appena arriverò a Torino, quindi al momento sarebbero preferibili delle opzioni di lavoro in inglese (o in russo).\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mk7lbu/aiuto/"
    },
    {
        "id": "1mjtd8t",
        "author": "Nurgus",
        "title": "Parking confusion",
        "content": "We just arrived in Torino, parked in a blue line space and went to a parking machine to pay. A chap rushed over to tell us that we did not need to pay, it's free all day every day at the moment.\n\nEveryone else we ask tells us we have to pay.\n\nDo we have to pay? We'll be here a few days.",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1mjtd8t/parking_confusion/"
    },
    {
        "id": "1mk1s67",
        "author": "ErTeo21",
        "title": "Campus sanpaolo",
        "content": "Ciao, qualcuno è / è stato al campus sanpaolo? Come vi siete trovati? \nChiedo perché vorrei alloggiare li e frequentare lezioni al politecnico, è fattibile ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mk1s67/campus_sanpaolo/"
    },
    {
        "id": "1mk0nq8",
        "author": "Flashy-Ostrich-8673",
        "title": "travel tips to torino!",
        "content": "hi there - me and some girlfriends are travelling to Torino in late summer. we are looking at options of where to stay and have narrowed it down to the Campidoglio district or more central near Porta Susa. Does anyone have any ideas on what would be safer for young women? i've read up about the city and know it is generally safe, but we want to be cautious as travelling as women",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mk0nq8/travel_tips_to_torino/"
    },
    {
        "id": "1mj7upw",
        "author": "Wide-Scientist-659",
        "title": "mi trasferisco a Torino per l’università: consigli?",
        "content": "Ciao a tutti! Tra un paio di settimane mi trasferirò a Torino per iniziare l'università e volevo chiedervi qualche consiglio. È la prima volta che vivo in città, quindi mi piacerebbe sapere cosa fare e cosa evitare, zone carine dove uscire, consigli pratici per chi arriva da fuori città o altri suggerimenti utili per ambientarmi. Grazie mille in anticipo!",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1mj7upw/mi_trasferisco_a_torino_per_luniversità_consigli/"
    },
    {
        "id": "1mix31m",
        "author": "telespalla-iba",
        "title": "Cosa sono queste strutture in corso Principe Oddone?",
        "content": "",
        "upvotes": 44,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8m69oztldchf1.jpeg?auto=webp&amp;s=5033d5a6bb4a72f79aa7ace4687af97922a2f037"
        },
        "permalink": "/r/torino/comments/1mix31m/cosa_sono_queste_strutture_in_corso_principe/"
    },
    {
        "id": "1mjfzgg",
        "author": "No_Crab4025",
        "title": "TORNEI PADEL A TORINO",
        "content": "Buonasera a tutti, sono un ragazzo specializzato nell'organizzazione di eventi e tornei padel, lavoro già presso un circolo di padel ma pensavo di mettermi in proprio come organizzatore di tornei padel nei circoli di torino e provincia. Volevo chiedervi se secondo voi servirebbe una figura come me nei circoli di torino, oppure i circoli organizzano già abbastanza eventi? grazie",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mjfzgg/tornei_padel_a_torino/"
    },
    {
        "id": "1miejrw",
        "author": "guigbd",
        "title": "Expat students in Turin",
        "content": "🌆Are you a new student in Turin and don't know where to start to get around the city? \n\nWe are an international group of young people who organize events over the weekend, appointments for an aperitif and why not, some practical workshops to increase their skills and be more attractive on the market. \n\nCurrently this is our second year and everything is in development, so if you like feel free to leave me your email or a contact below to be added\n\nSee you soon 🔜 ",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1miejrw/expat_students_in_turin/"
    },
    {
        "id": "1mikipe",
        "author": "PumpkinPunk96",
        "title": "Consigli per corsi di cucito a Torino?",
        "content": "Ciao a tutti! 👋  \nSono una studentessa internazionale che vive a Torino e mi piacerebbe iniziare a prendere lezioni di cucito 🪡.  \nQualcuno conosce corsi o insegnanti bravi in città?  \nGrazie in anticipo per qualsiasi consiglio! 🙏",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mikipe/consigli_per_corsi_di_cucito_a_torino/"
    },
    {
        "id": "1mi46zg",
        "author": "Shot-Presentation250",
        "title": "Piscine Torino?",
        "content": "Ciao ragazzi , mi chiedevo se ci fossero piscine in città,  io sono a Santa Rita / borgo cina , non automunito , esistono piscine balneari qui vicino o poco distanti? \nGrazie ",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1mi46zg/piscine_torino/"
    },
    {
        "id": "1mh8fov",
        "author": "P0lpett0n3",
        "title": "Come posso fare volontariato in modo saltuario e flessibile?",
        "content": "Ciao, mi piacerebbe fare volontariato e magari sfruttare questa esperienza anche per conoscere nuove persone.\n\nPerò impiego già molto tempo nel lavoro e mi sembra che le associazioni più famose che ho guardato online abbiamo come requisito un minimo di ore giornaliere da non sottovalutare, quasi paragonabili a quelle di un impiego full time o part time. Ma probabilmente ne conosco poche.\n\nHo più di 30 anni quindi non posso usufruire del servizio civile, mi consigliate altre opportunità che siano flessibili per quanto riguarda il tempo impiegato?",
        "upvotes": 16,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1mh8fov/come_posso_fare_volontariato_in_modo_saltuario_e/"
    },
    {
        "id": "1mhau2a",
        "author": "ivlia-x",
        "title": "Tatuaggi nello stile B&amp;W american traditional, consigliereste qualcuno?",
        "content": "Ciauuu\nSto cercando un artista che lavora in questo stile, conoscete qualcuno a Torino? Non mi interessa il lavoro di bassa qualità perciò volevo sentire le vostre opinioni\n\nHo già uno sleeve e un paio di altre cose ma voglio finalmente cominciare anche sulle gambe",
        "upvotes": 6,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1mhau2a/tatuaggi_nello_stile_bw_american_traditional/"
    },
    {
        "id": "1mgj9rw",
        "author": "BrutalSock",
        "title": "Questi sono due euro di “brioche farcita” da Berlica Barbis",
        "content": "Quella roba minuscola evidenziata nella terza foto è la teorica farcitura. ",
        "upvotes": 224,
        "comments": 33,
        "media": null,
        "permalink": "/r/torino/comments/1mgj9rw/questi_sono_due_euro_di_brioche_farcita_da/"
    },
    {
        "id": "1mhdcv1",
        "author": "Illustrious_Rule_593",
        "title": "Biking In Turin",
        "content": "Hey Guys! From a bike lover who likes riding in city, parks and extra urban areas of Turin, is there anyone would like to join for bike riding? for sure any level are welcomed but I am not professional, it's just chilling and riding hahaha",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1mhdcv1/biking_in_turin/"
    },
    {
        "id": "1mh6i6t",
        "author": "DanielFHD4K",
        "title": "Autolavaggi",
        "content": "Ciao a tutti, mi chiedevo, esistono autolavaggi in dove si possano utilizzare le proprie spugne e i propri detergenti?\n\nHo provato una rapida ricerca online ma non ne sono venuto a capo. Grazie mille!",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1mh6i6t/autolavaggi/"
    },
    {
        "id": "1mgo2mx",
        "author": "MatteVat25",
        "title": "Tennis solo per ricchi",
        "content": "Raga, ma è normale pagare 28 euro per un'ora  un campo in cemento all'aperto di giorno...quindi niente luci. Mi sembra davvero esagerato. Quanto pagate dove andate voi?",
        "upvotes": 17,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1mgo2mx/tennis_solo_per_ricchi/"
    },
    {
        "id": "1mh6sjf",
        "author": "SamPorterBridges2025",
        "title": "Com’è il treno Regionale Veloce da Santhià o Vercelli a Milano Porta Garibaldi e ritorno?",
        "content": "Ciao a tutti!\nDovrò iniziare a viaggiare spesso sulla tratta Rivarolo → Milano Porta Garibaldi, e stavo cercando la soluzione migliore, treni compresi￼.\nQualcuno sa se i treni Regionali Veloci sono umanamente accettabili?\n\nMi serve saperlo perché vorrei lavorare a bordo con PC e hotspot, e non so se è praticabile.\nMi chiedevo anche se la situazione ritardi sia migliorata negli anni, oppure se i treni sono ancora spesso in ritardo.\n\nGrazie mille a chi può aiutare!",
        "upvotes": 1,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1mh6sjf/comè_il_treno_regionale_veloce_da_santhià_o/"
    },
    {
        "id": "1mgicz8",
        "author": "vah_man_",
        "title": "Turin Tram",
        "content": "",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mgicz8/turin_tram/"
    },
    {
        "id": "1mgmwg3",
        "author": "Goddess1802",
        "title": "Places to visit",
        "content": "Hii! I'm going to visit Turin during 12-19 august. What places do you recommend visiting?   \nWhat are some good and affordable places to eat and what club would you recommend for students?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mgmwg3/places_to_visit/"
    },
    {
        "id": "1mglhye",
        "author": "murrayland",
        "title": "Coming Torino in a week. Any advice for club nights on the Saturday?",
        "content": "LGBT / LGBT friendly. Enjoy any music but not anything too pop / cheesy. Techno disco house etc works well. Bunker looks good but not sure if any nights are running? \n\n\nAppreciate it's a quiet time of year so any advice appreciated! \n\n\nWhile I'm here, any cool cocktail / rooftop bars and vegan restaurants would be good. And any events for the 9th - 16th August.\n\nThanks ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1mglhye/coming_torino_in_a_week_any_advice_for_club/"
    },
    {
        "id": "1mgezs4",
        "author": "Frengo_17",
        "title": "informazioni",
        "content": "Ciao a tutti, volevo sapere se conoscete un negozio a torino che vede articoli punk rock tipo magliette, spille e stickers ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mgezs4/informazioni/"
    },
    {
        "id": "1mfyljz",
        "author": "xXCyb3rBu11yXx",
        "title": "Perché dicono “entra in Parella, esci in barella”?",
        "content": "Mi sono trasferito in Parella un paio di mesi fa e ho sentito quella frase  ",
        "upvotes": 21,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1mfyljz/perché_dicono_entra_in_parella_esci_in_barella/"
    },
    {
        "id": "1mfwjyl",
        "author": "PsychologyCorrect152",
        "title": "amiche a torino",
        "content": "Ciao a tutti sono una ragazza di 36 anni in cerca di amicizie preferibilmente femminili.Sono molto sociale però da quando vivo qua a torino non sono riuscita a farmi molti amici...\nParlo anche perfettamente inglese se qualcuno vuole praticarlo ^^\nMi piace fare camminate,amo i gatti,mi piace cucinare e ho una passione molto grande per la Korea del sud.\nSpero di trovare qualche buon amica qua ^^",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mfwjyl/amiche_a_torino/"
    },
    {
        "id": "1mg3loy",
        "author": "Effective_Device_356",
        "title": "Geopolitica Amatoriale",
        "content": "Ciao, ultimamente sono fissato con conferenze di Dario Fabbri, Lucio Caracciolo in alcuni si parla di Geopolitica (seguite il Podcast Imperium Areum). Mi piacerebbe scambiare qualche chiacchiera tipo: Perché il nazionalismo sembra torni sempre nei momenti di crisi? L'Italia ha bisogno di una politica alla Milei? La Cina è in crisi o ascesa? \n\n",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1mg3loy/geopolitica_amatoriale/"
    }
]