[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 48,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1rcrmc8",
        "author": "lingeringneutrophil",
        "title": "Gordon Ramsey documentary: an overly long advertisement",
        "content": "In general, I like Gordon and have eaten at two of his restaurants in London. The food was very good. He can cook, he is a competent chef no doubt.\n\nHe is also a brand rather than a chef these days, and he works with media very well.\n\nThis whole documentary could have been half its length very easily. A lot of it felt very repetitive.\n\nYes, there are always some growing pains when opening a new restaurant. Yes, the food looks fabulous and influencers are gonna love it. Is it sustainable? Is it nutritious?! What about the overall environmental impact of serving this kind of food during the winter in London. Nobody asks these questions that matter more and more.\n\nWhat honestly bothered me was his empty-eyed wife having so much space where she didn’t really say anything too interesting. If you cut her bits out nothing of substance would be missing.\n\nHe brings up the wedding of his daughter so many times yet it is not a part of this documentary so we don’t even get to see the dress, flowers or food. Just an engagement party that feels a bit forced as the cameras are there.\n\nIt is an ad for his new restaurant in London, and the bits about him being a family man felt incredibly disingenuous and staged. He does a lot of cuddling with the kids but very little parenting. He doesn’t even cook for them in the show.\n\nHe says he loves his kids so much yet is gone easily six weeks at a time. His whole arrival in a helicopter to their country house in Cornwall was just silly and wasteful. He honestly comes across an absent father no matter the editing.\n\nHim talking about fitness? Bro I was a volunteer at London Marathon in 2009 and you didn’t even make it past 10 km. I was waiting to snap your photo yet you never made it to my mark (mile 15). Like give me a break. You travel, take photos with fans, shake hands, make TV shows, you have zero time for fitness or your kids so you’re in no position to lecture anyone about buying iPads for their kids.\n\nOverall, there was very little food shown, too much disingenuous family moments that weren’t even interesting, too much talking by his wife saying absotely nothing, and all those emotional reveals were spoken about many times before.\n\nA total meh for me",
        "upvotes": 57,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1rcrmc8/gordon_ramsey_documentary_an_overly_long/"
    },
    {
        "id": "1rcjq44",
        "author": "Competitive_Gene_898",
        "title": "‘Wednesday’ Season 3 Welcomes Winona Ryder to the Cast",
        "content": "",
        "upvotes": 126,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1rcjq44/wednesday_season_3_welcomes_winona_ryder_to_the/"
    },
    {
        "id": "1rcmiyx",
        "author": "amarainn",
        "title": "What is your favorite show or movie that isn't in English?",
        "content": "I love that Netflix has so much content that isn't in English, but I get the feeling I don't see all the options that are available when it comes to non-English language content, so I would love to know some of your favorite recommendations!",
        "upvotes": 25,
        "comments": 163,
        "media": null,
        "permalink": "/r/netflix/comments/1rcmiyx/what_is_your_favorite_show_or_movie_that_isnt_in/"
    },
    {
        "id": "1rcv428",
        "author": "Crafty_Two5432",
        "title": "Documentaries/reenactments not about murders:",
        "content": "I loved Fyre, Unknown Number, Poop Cruise, Tinder Swindler, Bad Vegan, Woodstock 99’. \n\nI know I said no murders but I also reaaally liked docuseries that aren’t too murdery like The Thing About Pam and Dr Death and The Act. I’m not really into anything about prisons or abductions. ",
        "upvotes": 8,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1rcv428/documentariesreenactments_not_about_murders/"
    },
    {
        "id": "1rcs2m4",
        "author": "Edexote",
        "title": "Extremelly low bitrate on Netflix",
        "content": "I recently saw Dune Two on 1080p Blu-Ray and I decided to compare the image with Netflix. I was greeted with an AV1 1080p stream of 0.49 Mbps. I was shocked. It's a brand new TCL TV running Google TV and the info showed this. Of costumer support doesn't fix this, I'll cancel. This is what they serve to paying customers?",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1rcs2m4/extremelly_low_bitrate_on_netflix/"
    },
    {
        "id": "1rcxmwg",
        "author": "Pemberly21",
        "title": "Looking for Teen Dramas",
        "content": "I want to find more teen dramas that have good romance, suspense, and keeps you on your heels, intense moments. I have already seen a lot of drama some of which are School Spirits, Panic, Motorheads, Outer Banks, Riverdale, TVD, Teen Wolf, and more I just can’t think of right now.\n\nAny suggestions???",
        "upvotes": 5,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1rcxmwg/looking_for_teen_dramas/"
    },
    {
        "id": "1rcmtga",
        "author": "green9206",
        "title": "Netflix requires I connect to home WiFi every once in a while to keep using it even on my phone",
        "content": "So my question is what if I decide I don't want home WiFi anymore? My mobile plan offers unlimited 5G data and I prefer to use that rather than home wifi because coverage is spotty in some parts of the house. So if I theoretically cancel my broadband will Netflix one day stop working since there will not be any home wifi to connect to? I don't really understand the logic behind this. ",
        "upvotes": 15,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1rcmtga/netflix_requires_i_connect_to_home_wifi_every/"
    },
    {
        "id": "1rcz3p9",
        "author": "equalitylove2046",
        "title": "Gift card for Netflix question?",
        "content": "Yes I was just curious if the gift card is more cost effective?\n\nI was thinking about maybe trying it again but the premium subscription is pretty pricey.\n\nDo the amount on gift cards go down pretty fast?\n\nJust curious I saw a lot that intrigued me recently that’s now on Netflix so I was just wondering.\n\nThanks all. 🤗👏",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1rcz3p9/gift_card_for_netflix_question/"
    },
    {
        "id": "1rcrhz7",
        "author": "Sad-Diamond501",
        "title": "Documentaries to listen to during work",
        "content": "Hi looking for recommendations for shows or documentaries on Netflix that I can listen to during work. These would be things where I would not be able to watch but only listen to. Any recommendations would be appropriated. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1rcrhz7/documentaries_to_listen_to_during_work/"
    },
    {
        "id": "1rd29mx",
        "author": "Embarrassed_Love7360",
        "title": "Finding Her Edge",
        "content": "I am a little late to the show, but I absolutely detest Brayden. He is so selfish that it bothers me that he could even be considered as a love interest. The only characters I like are the little sister, Freddie, and freddie’s partner. Are there any Adriana &amp; Freddie shippers here?? 😭",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rd29mx/finding_her_edge/"
    },
    {
        "id": "1rcnxx3",
        "author": "RiskAndReason",
        "title": "Winona Ryder is joining the cast of Wednesday Season 3!",
        "content": "Not gonna lie, seeing Winona Ryder join Wednesday after loving her in Stranger Things feels kind of surreal.\n\nShe’s already such an icon in darker, gothic-leaning roles, so this casting actually makes so much sense.\n\nAnyone else excited to see her back in another spooky universe?",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rcnxx3/winona_ryder_is_joining_the_cast_of_wednesday/"
    },
    {
        "id": "1rcy5av",
        "author": "Skateboardingcow",
        "title": "PACIFIC RIM: THE BLACK",
        "content": "Will NETFLIX ever release PACIFIC RIM: THE BLACK on DVD or Blue-Ray? I love the series and I’d love to have it on DVD or Blu-Ray. I have an Xbox so I buy DVD’s so I won’t won’t chase down the series and constantly pay for subscriptions",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rcy5av/pacific_rim_the_black/"
    },
    {
        "id": "1rbrv9l",
        "author": "StunningComment6064",
        "title": "Guys, can you recommend a comedy show on Netflix that’s actually funny?",
        "content": "It’s very difficult to find a comedy TV show that makes me laugh. I mean, new TV shows seem to be running out of ideas. So could you recommend some comedy shows that you actually find funny? ",
        "upvotes": 169,
        "comments": 628,
        "media": null,
        "permalink": "/r/netflix/comments/1rbrv9l/guys_can_you_recommend_a_comedy_show_on_netflix/"
    },
    {
        "id": "1rcht52",
        "author": "hyyh_o7",
        "title": "Finally watched The Great Flood everyone was talking about",
        "content": "It was confusing at first. The movie starts as this intense disaster survival story, and I’m fully invested… then suddenly it flips into a wild sci‑fi twist with AI and simulations!\n\nI actually watched a YouTube video afterward and finally understood the explanation. Who else has seen it? What did you think of the twist?",
        "upvotes": 5,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1rcht52/finally_watched_the_great_flood_everyone_was/"
    },
    {
        "id": "1rc1mfu",
        "author": "Acceptable_Sell3455",
        "title": "Animal Kingdom",
        "content": "I discovered this series only recently and binged through all 6 seasons in under 2 weeks. Best series I've watched in ages. The characters were not all great, but my favourite was poor psycho Pope, the jobs were carried out fantastically, Mother a true horror show, on the whole much of it rather unrealistic, but I didn't care, I loved it.\n\nAnd yet ... no-one seems to speak of it. \n\nWhy? \n\nWas it not popular? ",
        "upvotes": 37,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1rc1mfu/animal_kingdom/"
    },
    {
        "id": "1rcqety",
        "author": "honeyyyyyyy________",
        "title": "Prediction",
        "content": "I'm hundred and ten percent sure that bhuvan bam is going to come for promotion of Dhindora s2 on kapil sharma s5. I think he will come in the first half of the season. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rcqety/prediction/"
    },
    {
        "id": "1rcnoqw",
        "author": "amarainn",
        "title": "De Fabeltjeskrant (“The Fables Newspaper”)",
        "content": "**De Fabeltjeskrant** (“The Fables Newspaper”) is a Dutch children’s television series that used puppetry and stop-motion techniques to bring anthropomorphic animal characters to life. In each short episode, the owl narrator Meneer de Uil (Mr. the Owl) reads a story from the *Fabeltjeskrant*, usually based on classic fables and original scripts set in the animal forest of Fabeltjesland.\n\nIt has a total of 1,640 episodes, and it now also has (new) episodes on Netflix",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rcnoqw/de_fabeltjeskrant_the_fables_newspaper/"
    },
    {
        "id": "1rd1p2u",
        "author": "ShutUpForMe",
        "title": "ACCOUNT LOCKED OUT IN SMOWSTORM",
        "content": "Ok in good weather sure ok you want to do this “household” or “vacation” data and let or not let us login. Well if only one of us has access to electricity or internet, and we need to contact the other person to get into the account im NOT trying to waste their phone battery or celular to force a text or email in order to get into the account.\n\n\nHOW HOW hard is it for you to just monitor the weather AND our location data you scrape to not lock us out of our account during the snowstorm when some of us already don’t have internet or electricity to watch.\n\n",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1rd1p2u/account_locked_out_in_smowstorm/"
    },
    {
        "id": "1rcn3wp",
        "author": "IsuzuCrewCab",
        "title": "In Absentia, what is the source of Emily's money?",
        "content": "During the first 3 - 4 episodes of Absentia we see here booking a room at a hotel (which usually requires a credit card) and buying various items with cash.\n\nGiven that she had been declared dead 6 years prior, what's the source of this money?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1rcn3wp/in_absentia_what_is_the_source_of_emilys_money/"
    },
    {
        "id": "1rckitw",
        "author": "Extension-Humor-7319",
        "title": "Please suggest comedy shows",
        "content": "Hello, can you suggest some laugh out loud shows that i can watch to destress after work.\nShows that i enjoyed previously  (in no particular order) - brooklyn99, schitt's creek, modern family, derry girls, silicon valley ",
        "upvotes": 1,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1rckitw/please_suggest_comedy_shows/"
    },
    {
        "id": "1rccrm5",
        "author": "Own_Paper3871",
        "title": "Windows 11 Netflix stuck on AVC for 1080p SDR despite HEVC/AV1 support",
        "content": "Hi everyone,\n\nI’ve been trying to understand how Netflix classifies Windows devices and chooses codecs, and I’m hoping someone here might have deeper insight into what’s happening.\n\nSystem:\n\nASUS VivoBook X515EA\n\ni3-1115G4 (Intel UHD / Xe-LP, Gen 12)\n\n8GB RAM\n\nWindows 11\n\nInternal 1920×1080 panel (~200 nits)\n\n200 Mbps internet\n\nMicrosoft Edge (latest stable)\n\n\n\n---\n\nBackground (briefly)\n\nInitially I experimented quite a bit trying to get Netflix to stream 4K to my 1080p panel for the higher bitrate and let it downscale. I now understand that without a certified 4K HDCP 2.2 display attached, Netflix won’t send the UHD ladder. I’ve accepted that and moved on.\n\nDuring that process I also tried various “Netflix 4K” / codec-related browser extensions and other tweaks. None of them changed the actual codec ladder being served.\n\nAt this point I’m not chasing 4K anymore.\n\n\n---\n\nCurrent goal: HEVC or AV1 for 1080p SDR\n\nWhat I’m trying to achieve now is much simpler:\n\nI just want Netflix to use HEVC or AV1 for 1080p SDR instead of AVC (H.264).\n\nHere’s the consistent behavior:\n\nHDR OFF → always avc1 (H.264), ~3 Mbps at 1920×1080\n\nHDR ON → switches to HEVC (Main10 HDR ladder works correctly)\n\n\nSo clearly:\n\nHEVC decoding works on this system\n\nAV1 decoding is supported (confirmed in edge://gpu)\n\nHardware video decode is active\n\nPlayback is smooth, no dropped frames\n\n\nHowever, in SDR mode Netflix never selects HEVC or AV1. It always falls back to AVC.\n\n\n---\n\nDRM detail (important part)\n\nFrom the Netflix debug overlay:\n\nIn SDR mode → KeySystem: com.widevine.alpha.SW_SECURE_DECODE\n\nPlayReady Hardware DRM is not disabled, but SDR sessions appear to use Widevine software secure decode.\n\n\nThis makes me wonder whether the codec ladder selection is tied to DRM path classification.\n\nWhen HDR is enabled, the ladder changes and HEVC is used.\nWhen HDR is disabled, it falls back to Widevine SW secure decode + AVC.\n\n\n---\n\nWhat I’ve verified\n\nHardware acceleration enabled in Edge\n\nHEVC and AV1 decode supported by GPU\n\nVideo decode shows as hardware accelerated\n\nPlayReady not disabled\n\nOnly internal display active\n\nVirtual display drivers removed (used earlier while experimenting with 4K)\n\nClean system state\n\nTested multiple recent Netflix originals\n\n\nStill locked to AVC for 1080p SDR.\n\n\n---\n\nWhat I’m trying to understand\n\nIs Netflix assigning certain Windows laptop device classes to an “HD SDR AVC” tier regardless of decode capability?\n\nEven if the GPU supports HEVC and AV1, does server-side device classification override that and force AVC for SDR under Widevine SW secure decode?\n\nHas anyone with a similar Intel Gen 11 UHD system managed to get HEVC or AV1 for 1080p SDR on Windows?\n\nI’m trying to determine whether this is:\n\nA configurable limitation\n\nA DRM / pipeline limitation\n\nOr purely server-side policy\n\n\nAny technical insight would be appreciated.\n\nAnd yes, I did use AI to get this post written since I’ve been troubleshooting this for a while and wanted to present the details clearly. At this point I’m just hoping someone here might have insight I’ve missed.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1rccrm5/windows_11_netflix_stuck_on_avc_for_1080p_sdr/"
    },
    {
        "id": "1rcax8a",
        "author": "Inthetreesinpnw",
        "title": "Any see “Playing Gracie Darling” ?",
        "content": "Just finished the series. Not a bad show and interesting concept. Anyone else see it, thoughts ? I never see it mentioned anywhere for discussion. It’s Australian series. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1rcax8a/any_see_playing_gracie_darling/"
    },
    {
        "id": "1rcw72n",
        "author": "Neezurft",
        "title": "Being Gordon Ramsey - car scenes",
        "content": "How come in all car scenes where Gordon is being taken somewhere (in the back seat) he seems to not be using a seatbelt? That also seems to be case for his daughter and wife in all scenes 🤔 \n\nDid a quick online search and found articles about him promoting helmets for bikes, etc so I don't think he would be against using them? \n\nI wonder if these fancy cars have some tech that make seatbelt optional or something like that? \n\nAm I missing something here, I'd think seatbelts are a legal requirement in London, no?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1rcw72n/being_gordon_ramsey_car_scenes/"
    },
    {
        "id": "1rbq6wm",
        "author": "DeputyDawe",
        "title": "Stranger Things",
        "content": "Just started watching Stranger Things on Netflix and I’m really enjoying it. I love anything set in the nineteen eighties because that was when I just came into my teenage years so the music, the fashions, even the rotary phone on the wall brings back some wonderful memories of a bygone time. The kids are really likeable and goofy much like the kids I grew up with. Would definitely recommend it to anyone who hasn’t already stumbled upon it ",
        "upvotes": 33,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1rbq6wm/stranger_things/"
    },
    {
        "id": "1rbrypo",
        "author": "ekat12",
        "title": "Account hacked—for what goal?",
        "content": "It appears my Netflix account got hacked about 4 days ago at 2am. No one else has access to my account. \n\nGot an email from Netflix confirming my email address change &amp; that I would receive no more emails at that address. Called Netflix, they confirmed someone changed both the email AND credit card billing—to what end? Why would they not just use the credit card that I had stored?\n\nAlso odd (and frustrating), tech support asked to confirm the payment method I’ve been using for that account in order to verify my identity since name &amp; everything else was changed, and they can’t find any record of billing with that credit card. I’m sitting here staring at my credit card statement with 5+ years of Netflix payments on it.\n\n \n\nThey weren’t able to give me my account back since I “couldn’t confirm” my payment method, so now they’ve just cancelled the account &amp; I have to make a new one. Went ahead &amp; changed my password on that email &amp; ordered a new credit card number.\n\nAnything else I need to do? What was the point of hacking my account just to enter their own payment info? ",
        "upvotes": 27,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1rbrypo/account_hackedfor_what_goal/"
    },
    {
        "id": "1rc8hm3",
        "author": "Brimoe18",
        "title": "Screensaver options",
        "content": "It’s 2026, is there FINALLY options for the screensaver?? It drives me absolutely nuts that it turns on after just five minutes, and then quickly flashes through promos for other shows the whole time. Plus it being three buttons to get back to playing my show once I’m ready. As someone that hates flashing images (especially in the background) and pauses frequently, it gets very annoying so I thought I’d finally ask. I tried to look for settings within the Netflix app on my tv, but there’s nothing there. Perhaps I need to gain access to a desktop computer if there’s a setting to change it there? ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1rc8hm3/screensaver_options/"
    },
    {
        "id": "1rcea7o",
        "author": "Dogzombies3",
        "title": "Shouldn't a season 2 of the unlisted be released?",
        "content": "The ending where the infinity group spiders go into kal and dru's ears show that infinity group is up to something. Because before Emma ainsworth got arrested, she mentions that infinity group has tons of backup plans. the intro shows children looking somewhat like robots (link this to the spiders), indicating that this is not the end.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rcea7o/shouldnt_a_season_2_of_the_unlisted_be_released/"
    },
    {
        "id": "1rc3ad8",
        "author": "BlackHole2048",
        "title": "There was a horror series I saw like 5-6 years ago. I thought it was goosebumps but apparently not. Does anyone remember what it is? Description of the first episode below",
        "content": "The first episode were these 2 high school boys who investigated their school mascot (which kinda looked like big bird, just big and yellow but I don’t remember if it was actually a bird). Turns out it was a living thing. At one point they ended up trapped in the basement, almost gassed, and they escaped to the gymnasium. Somehow they looked into the mascots mouth and it ate them, and the episode ended with them trapped in its stomach. Sounds like a fever dream now that I think about it.",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1rc3ad8/there_was_a_horror_series_i_saw_like_56_years_ago/"
    }
]