[
    {
        "id": "1kebneh",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Duncan Skiles - Monday 5/5 at 7:00 PM ET - Director of 'The Clovehitch Killer' (Starring Dylan McDermott and Charlie Plummer) and 'Neighborhood Watch' (Starring Jack Quaid and Jeffrey Dean Morgan)",
        "content": "",
        "upvotes": 4,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c3pae1at1pye1.png?auto=webp&amp;s=1a37a17984fb915d19764b754dfded8a9637337b"
        },
        "permalink": "/r/movies/comments/1kebneh/amaqa_announcement_duncan_skiles_monday_55_at_700/"
    },
    {
        "id": "1kcpxna",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Thunderbolts* / The Surfer) Plus Throwback Discussions",
        "content": "# New Theatrical Releases\n\n[Thunderbolts*](https://old.reddit.com/r/movies/comments/1kcpug8/official_discussion_thunderbolts_spoilers/?)\n\n[The Surfer](https://old.reddit.com/r/movies/comments/1kcpuhw/official_discussion_the_surfer_spoilers/?)\n\n# 25th Anniversary Throwback Discussion Threads\n\n[The Flintstones in Viva Rock Vegas](https://old.reddit.com/r/movies/comments/1kcpumj/official_throwback_discussion_the_flintstones_in/?)\n\n[Frequency](https://old.reddit.com/r/movies/comments/1kcpunu/official_throwback_discussion_frequency_spoilers/?)\n\n[Where the Heart Is](https://old.reddit.com/r/movies/comments/1kcpupt/official_throwback_discussion_where_the_heart_is/?)\n\n\n\n\n# Still in Theaters\n\n[The Accountant 2](https://old.reddit.com/r/movies/comments/1k79o5r/official_discussion_the_accountant_2_spoilers/?)\n\n[The Legend of Ochi](https://old.reddit.com/r/movies/comments/1k79o78/official_discussion_the_legend_of_ochi_spoilers/?)\n\n[Until Dawn](https://old.reddit.com/r/movies/comments/1k79o90/official_discussion_until_dawn_spoilers/?)\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n[The Wedding Banquet](https://www.reddit.com/r/movies/comments/1k1tsqm/official_discussion_the_wedding_banquet_spoilers/?)\n\n[Warfare](https://www.reddit.com/r/movies/comments/1jwev1e/official_discussion_warfare_spoilers/)\n\n[The Amateur](https://www.reddit.com/r/movies/comments/1jwev63/official_discussion_the_amateur_spoilers/)\n\n[Drop](https://www.reddit.com/r/movies/comments/1jwevax/official_discussion_drop_spoilers/)\n\n[Freaky Tales](https://www.reddit.com/r/movies/comments/1jwevev/official_discussion_freaky_tales_spoilers/)\n\n[A Minecraft Movie](https://www.reddit.com/r/movies/comments/1jr0qff/official_discussion_a_minecraft_movie_spoilers/?)\n\n\n\n\n# On Streaming\n\n[Another Simple Favor](https://old.reddit.com/r/movies/comments/1kdg7p5/official_discussion_another_simple_favor_spoilers/?)\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)\n\n[G20](https://old.reddit.com/r/movies/comments/1k7zfzp/official_discussion_g20_spoilers/?)\n\n[2073](https://old.reddit.com/r/movies/comments/1k7zg0y/official_discussion_2073_spoilers/?)\n\n[Holland](https://old.reddit.com/r/movies/comments/1k7zg30/official_discussion_holland_spoilers/?)",
        "upvotes": 52,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1kcpxna/official_discussion_megathread_thunderbolts_the/"
    },
    {
        "id": "1kes7p8",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Tim Heidecker in 'Fior Di Latte' - A playwright, hooked on sniffing perfume to relive memories from an Italian vacation, spirals into obsession as his life falls apart.",
        "content": "",
        "upvotes": 5303,
        "comments": 246,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hlkq1hw1htye1.png?auto=webp&amp;s=ef9272576e1b0e3103f2a096c8960be4e34393a2"
        },
        "permalink": "/r/movies/comments/1kes7p8/first_image_of_tim_heidecker_in_fior_di_latte_a/"
    },
    {
        "id": "1kep590",
        "author": "ForeverBlue101_303",
        "title": "California, Once a Mecca for Animation Work, Is Rapidly Losing Ground, Report Claims",
        "content": "",
        "upvotes": 2890,
        "comments": 139,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-bCJr2z4oJZUxKnlIF0fN-sEAhvoLhtaWCpaWcAHLjg.jpg?auto=webp&amp;s=8a672f6ccb6737bdf0805ccf4a329b2c429a43e4"
        },
        "permalink": "/r/movies/comments/1kep590/california_once_a_mecca_for_animation_work_is/"
    },
    {
        "id": "1kezfs7",
        "author": "AaronRodgersVaxCard",
        "title": "What’s a movie you want a sequel to but know you’ll never get?",
        "content": "Mine is and always will be BASEKETBALL. Even with Zucker not producing and directing anymore, Matt and Trey have proved to be smart enough to take on satire of anything and make it worthwhile. Plus they’re actually sports fans so you know they know about all the scandals that have been happening across all sports that are ripe for parodying.",
        "upvotes": 511,
        "comments": 1007,
        "media": null,
        "permalink": "/r/movies/comments/1kezfs7/whats_a_movie_you_want_a_sequel_to_but_know_youll/"
    },
    {
        "id": "1kf0a6f",
        "author": "_kevx_91",
        "title": "Two years late but finally got around watching They Cloned Tyrone and to me, it's the best racial satire to come out since Get Out.",
        "content": "\n\nThe whole premise is bonkers but so clever it how it serves as a metaphor for how ethnic minorities, black people in this case, are utilized as drones of consumption and how this perpetuates negative stereotypes (e.g. Fried chicken, obsession with hair products, selling drugs, etc.). It shows how to be critical of those consumer goods we're obsessed with. What makes us feel good or \"look cool\" to others isn't necessarily good for us. \n\nI also love the point it made when Fontaine almost gave up and accepted his fate as a mere clone living in a vicious cycle. Even after people figure out the trap, that knowledge alone won't keep you from falling into it again and again. We might be products of our environment and even our genetics, but at the end of the day, we have free will, and it's up to us to break free from the cycle we are stuck in.\n\n\nI myself am Latino (Puerto Rican to be exact) and I feel like many points made in the film apply to my culture as well. In recent years, Puerto Rican culture has become a bit more known internationally, thanks to things like Bad Bunny and the Despacito song. While there is nothing wrong with people being curious of and being entertained by the culture, there is also a concerted effort to perpetuate pretty offensive and harmful stereotypes about my people: From sexual promiscuity thanks to reggaeton music to the idea that we all live in slums next to the beach. And many fellow Puerto Ricans end up internalizing these stereotypes and thinking it makes us \"cool\". \n\nThe film just really spoke to me this way, and feel it even applies to other ethnicities or minority groups. Great film. It was like Us, but actually good. Also had no idea Boyega had such range in acting. He was phenomenal.",
        "upvotes": 417,
        "comments": 31,
        "media": null,
        "permalink": "/r/movies/comments/1kf0a6f/two_years_late_but_finally_got_around_watching/"
    },
    {
        "id": "1kewtab",
        "author": "BunyipPouch",
        "title": "Chloë Sevigny Pitched Herself to Luca Guadagnino to Play Jean (Patrick Bateman’s Secretary) Again in New ‘American Psycho’ Film",
        "content": "",
        "upvotes": 707,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kc9gusKjU34ghTDefjPcB1za1e7F0_aVdlW2eTfnBaI.jpg?auto=webp&amp;s=3bc818dd139c2e6fec692b7bbbd0f2d97578d417"
        },
        "permalink": "/r/movies/comments/1kewtab/chloë_sevigny_pitched_herself_to_luca_guadagnino/"
    },
    {
        "id": "1kf1tav",
        "author": "today_okay",
        "title": "Are films becoming too literal and heavy-handed these days?",
        "content": "I read an interesting piece in The New Yorker by Namwali Serpell, where she points out a growing trend in movies toward excessive literalism, leaving little room for audiences to interpret meaning on their own. Films now seem to patronize viewers by relying on overly explicit metaphors and heavy-handed commentary. For instance, The Substance shows Demi Moore literally giving birth to her younger self through her back. She points out The Brutalist for visualizing its metaphors too explicitly: immigrants' lives being depicted as literally turned upside down and showing the American Dream as something that, \"literally fucks you.\" Did anyone else read it and just curious about thoughts about whether they feel that movies are spelling out symbolism instead of trusting the audience's intelligence.",
        "upvotes": 318,
        "comments": 171,
        "media": null,
        "permalink": "/r/movies/comments/1kf1tav/are_films_becoming_too_literal_and_heavyhanded/"
    },
    {
        "id": "1kelwmu",
        "author": "BunyipPouch",
        "title": "First Image of Maika Monroe ('It Follows') in Crime-Thriller 'In Cold Light' - Ava attempts to go straight after prison, but after witnessing her twin brother's murder, she is forced to run for her life. - Also Starring Troy Kotsur &amp; Helen Hunt",
        "content": "",
        "upvotes": 1953,
        "comments": 96,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y8syj6q65sye1.png?auto=webp&amp;s=c6b658543c736c897b32d198a06f80eb7f1f2143"
        },
        "permalink": "/r/movies/comments/1kelwmu/first_image_of_maika_monroe_it_follows_in/"
    },
    {
        "id": "1kf0z1y",
        "author": "BobbyThrowaway6969",
        "title": "Who else bawled like a baby during The Wild Robot?",
        "content": "I don't have the words to describe how that movie made me feel. I've seen sad movies before and cried during them, but nothing ever came close to this. It wasn't just sadness.   \n   \nIt gave me such a powerful sense of longing and nostalgia that I can't describe. Made ke hyper aware of how much I love my family, especially mum. All the sacrifices she's made (and dad) raising and protecting us, all that time passed and how fleeting it all is. Made me think of how tired they look now, how proud they are of us that we've made it. And I know that will be me in time, like passing the torch. I can't handle it. Suckerpunched right in the heart. \n\nThat movie moved me in ways nothing else ever has. I can't stop thinking about it and I'm listening and crying to the score on repeat now. Please send help.\n\nWho else had such a devastating emotional response to that film?   \n   \nEdit: And with that, how many of you get frission? I think there's some correlation there.",
        "upvotes": 142,
        "comments": 75,
        "media": null,
        "permalink": "/r/movies/comments/1kf0z1y/who_else_bawled_like_a_baby_during_the_wild_robot/"
    },
    {
        "id": "1ketrs3",
        "author": "LukeGuyFrotter",
        "title": "What are the new movies cliche one-liners?",
        "content": "We all know the ones from movies that came out from like, the 80s-2000s, ones like \"He's right behind me, isn't he?\", \"Are you thinking what I'm thinking?\", \"Nobody gets to bully [BLANK] but me!\", \"I can explain!\", etc etc. you know the list goes on.\nBut what are some newer cliches that are popping up in more recent movies? \n\nMy submission: when someone goes \"We only have *one* chance to do this.\" ",
        "upvotes": 294,
        "comments": 300,
        "media": null,
        "permalink": "/r/movies/comments/1ketrs3/what_are_the_new_movies_cliche_oneliners/"
    },
    {
        "id": "1keprc0",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Kevin Bacon &amp; Kyra Sedgwick in 'The Best You Can' - Two halves of an unlikely friendship between a security guard and a urologist whose chance encounter blooms into something deeper.",
        "content": "",
        "upvotes": 408,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3mu6hyfuysye1.png?auto=webp&amp;s=a8bcbb9e4a1f751fe1dab84ae3c60749fdea3102"
        },
        "permalink": "/r/movies/comments/1keprc0/first_image_of_kevin_bacon_kyra_sedgwick_in_the/"
    },
    {
        "id": "1kebyi8",
        "author": "BunyipPouch",
        "title": "Employees at Austin Alamo Drafthouse Location Vote to Unionize - The group went public with its unionization efforts in March after company-wide layoffs impacted the Austin location. Unionization efforts have quickly spread within the theater chain in recent months.",
        "content": "",
        "upvotes": 4324,
        "comments": 189,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fY3PxsGQQJ7KZRxxLEjdAx8c8JoFlxqN-xwaZCDr7QI.jpg?auto=webp&amp;s=2b7345bd79d43a12b52c5a88fd174329c720ccf8"
        },
        "permalink": "/r/movies/comments/1kebyi8/employees_at_austin_alamo_drafthouse_location/"
    },
    {
        "id": "1kf323f",
        "author": "sureasyoureborn",
        "title": "Rewatching 4 weddings and a funeral",
        "content": "I was thinking how if they made it today some people would say it was “too woke”. It was made in the early 90’s, it heavily feature a gay couple that were refers to as soulmates. It had a deaf character and featured BSL. It’s interesting how things that were once just part of telling an interesting story have been so politicized.",
        "upvotes": 50,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1kf323f/rewatching_4_weddings_and_a_funeral/"
    },
    {
        "id": "1keyhsy",
        "author": "leftnotracks",
        "title": "Movies that were juuuust a bit too long.",
        "content": "I love movies with ambiguous endings. Roger Dodger and 25th Hour spring to mind. If you like you can include Thelma and Louise or Butch Cassidy and the Sundance Kid, although I doubt thre’s much debate about the fate of those characters.\n\nWhat movies do you think should have ended just before they did, making for an improved and ambiguous ending? I’ll nominate Shawshank Redemption, by about 40 seconds.",
        "upvotes": 88,
        "comments": 369,
        "media": null,
        "permalink": "/r/movies/comments/1keyhsy/movies_that_were_juuuust_a_bit_too_long/"
    },
    {
        "id": "1keq5em",
        "author": "alienleader57",
        "title": "I rewatched live free or die hard",
        "content": "This is my third time watching this film and i have to say. Whoever says the PG-13 rating ruined this movie is absolutely wrong. \n\nJohn McClanes character was not lost in this film as at this point in time Bruce Willis still cared about his job. John McClane feels like John McClane.\n\nThis film always feels to me like it is pushing John from 80s-90s style action to a more modern style action, while maintaining the franchises roots. \n\nThe main villain is very good in this movie. Definitely the best villain whose surname isn't Gruber in this franchise. \n\nSo over all this movie is like a 7/10. ",
        "upvotes": 200,
        "comments": 125,
        "media": null,
        "permalink": "/r/movies/comments/1keq5em/i_rewatched_live_free_or_die_hard/"
    },
    {
        "id": "1kf6j1r",
        "author": "loudimage1",
        "title": "What’s a movie you hated the first time, but later came to love — and why?",
        "content": "For me the first movie that comes to mind here is Blade Runner (82’). First watched it when I was very young and found it slow and confusing. I Revisited it a few years later and paid more attention to the cinematography, atmosphere, and theme; now I consider it one of the best sci fi films ever. Curious if anyone else had a similar experience with a film they originally didn’t like.",
        "upvotes": 14,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1kf6j1r/whats_a_movie_you_hated_the_first_time_but_later/"
    },
    {
        "id": "1kefv07",
        "author": "AvailableReality557",
        "title": "Which actor shocked you with an unexpectedly great performance?",
        "content": "I have seen actors performance performances that completely changed how I saw them in ways I didnt expect. Maybe it was a comedic actor suddenly showing the dramatic talent, or a side character stealing the spotlight. Im always fascinated by those moments when an actor breaks free of what we expect and delivers something raw, powerful, and unforgettable. Which performance truly shocked you and why ? I would love to hear examples that made you rethink everything you thought you knew about that actor.",
        "upvotes": 873,
        "comments": 1745,
        "media": null,
        "permalink": "/r/movies/comments/1kefv07/which_actor_shocked_you_with_an_unexpectedly/"
    },
    {
        "id": "1kf4ycn",
        "author": "Useful-Project-2307",
        "title": "What are some underground movies that are 10/10s?",
        "content": "I’m looking for a movie — any genre — that is lesser known but is still really really good. Lately I’ve been having a harder time finishing movies because they just don’t seem to pique my interest. I’d be happy to read all of your opinions :) some lesser known movies I watched recently and liked were shiva baby and Celeste and Jesse forever",
        "upvotes": 19,
        "comments": 81,
        "media": null,
        "permalink": "/r/movies/comments/1kf4ycn/what_are_some_underground_movies_that_are_1010s/"
    },
    {
        "id": "1kel088",
        "author": "JohnHamFisted",
        "title": "What are examples of movie franchises where the sequels were already written as separate films but had to be linked retroactively?",
        "content": "I'm thinking of cases like the Cloverfield trilogy, where Cloverfield Lane and Cloverfield Paradox are clearly just separate horrorfilms with the tiniest connection added (usually in the final shot) to create the illusion of connective tissue.\n\nI also remember learning that The Raid 2 was a film that was already written as a standalone but couldn't find the money to produce it, so they decided to re-frame it as the new case for the main character of The Raid.\n\nWould love to learn about more examples like that.",
        "upvotes": 285,
        "comments": 146,
        "media": null,
        "permalink": "/r/movies/comments/1kel088/what_are_examples_of_movie_franchises_where_the/"
    },
    {
        "id": "1kesmej",
        "author": "Htanbed",
        "title": "Apu trilogy by Satyajit Ray",
        "content": "",
        "upvotes": 73,
        "comments": 7,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6c2tiokhktye1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1kesmej/apu_trilogy_by_satyajit_ray/"
    },
    {
        "id": "1kf57x5",
        "author": "Useful-Project-2307",
        "title": "Movies that capture the vibe/history of Argentina",
        "content": "Specific request but I really like learning about places through movies and books. Recently I watched Minamata and really liked its portrayal of the disease in Japan — I also think a lot of anime does a good job of reflecting the various cultural aspects of Japanese life. Anyway, I’d like to find similar movies that have something to say about Argentine culture :) Thanks!",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1kf57x5/movies_that_capture_the_vibehistory_of_argentina/"
    },
    {
        "id": "1keo3pd",
        "author": "Davis_Crawfish",
        "title": "Scarface (1983): Was Elvira genuinely in love with Tony or was she just using him?",
        "content": "I think Elvira didn't know what love was, even if she tried to. Let's be honest, she left Tony because she could see the writing on the wall, he was headed to a tragic end and she wasn't going to stay and end up made into swiss cheese alongside the self destructive Tony.\n\nEvery relationship she had was a business exchange with the purpose of leaving her protected and safe. That was her arrangement with Frank and it was now Tony and Tony knew that and that's why he treated her like crap because he wanted her to be like Gina but she was just a tramp looking to be a kept woman. \n\nThe sad thing is that Tony ended up losing the two people who loved him for who he was: Manny, his best friend, whom he killed out of a sense of betrayal, and Gina, who hated his guts before dying. \n\nElvira was the smart one because she got off the bus before the crash but not before telling Tony off for how he treated her.",
        "upvotes": 125,
        "comments": 48,
        "media": null,
        "permalink": "/r/movies/comments/1keo3pd/scarface_1983_was_elvira_genuinely_in_love_with/"
    },
    {
        "id": "1kej05j",
        "author": "GrandManSam",
        "title": "If you were to retroactively award Oscars for best stunts, what movie should be awarded?",
        "content": "Exactly as the title says. They're apparently giving out Oscars for best stunt performance, a hard and critically thankless job. If this category were to have existed prior to its implementation now, what would previous year's Oscars best stunt winners? Are there any individual stunt performers that should be recognized, such as Buster Keaton?",
        "upvotes": 215,
        "comments": 341,
        "media": null,
        "permalink": "/r/movies/comments/1kej05j/if_you_were_to_retroactively_award_oscars_for/"
    },
    {
        "id": "1kf6vtd",
        "author": "FilmWaffle-FilmForum",
        "title": "What movies pulled the ultimate “uno reverse” card?",
        "content": "Recently watched a movie called Stranger Darling (2023) expecting your typical run of the mill slasher. The non-linear storytelling made me think the guy was the serial killer, turns out it was the supposed “damsel in distress” the whole time. \n\nWhat other movies tricked you into believing something only to do a complete 180? ",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1kf6vtd/what_movies_pulled_the_ultimate_uno_reverse_card/"
    },
    {
        "id": "1kepijt",
        "author": "FreshmenMan",
        "title": "Do you wish Peter Jackson's Halo got made?",
        "content": "Question, Do you wish Peter Jackson's Halo got made?\n\nIn the 2000s, Peter Jackson attempted to make a Halo film with him as Producer and Neil Blomkamp was going to direct it &amp; Alex Garland was going to write the script. However, the film wasn't made due to several reasons. 1 was that Microsoft had very strict terms, demanding $10 million against 15 percent of gross. 20th Century Fox &amp; Universal both decided to partner on the film. However after awhile, 20th Century Fox threaten to pull, &amp; Universal demanded Jackson to reduced his first dollar revenue deal, which he refused, thus, Halo was cancelled. Another was that the production was plagued with problems with pre-production being re-started multiple times.\n\nI kinda wish the film got made, but one thing that came out of this was that Peter Jackson decided to help Blomkamp make District 9, which I enjoyed. However, I do think if the film did get made, if probably would of been a disaster given that Microsoft was micro-managing the hell out of the project and that fact the production was really on shaky ground with the multiple studios teaming up.\n\nOverall, Do you wish Peter Jackson's Halo got made?",
        "upvotes": 81,
        "comments": 75,
        "media": null,
        "permalink": "/r/movies/comments/1kepijt/do_you_wish_peter_jacksons_halo_got_made/"
    },
    {
        "id": "1kezauy",
        "author": "Playful_Fly_6542",
        "title": "Did You See Don Bluth’s animated Classics “The Secret of Nimh”, “An American Tail” and “The Land Before Time” in Theaters? Share Your Memories!",
        "content": "Has anyone seen Don Bluth’s animated films—like The Secret of NIMH, An American Tail, or The Land Before Time in theaters when they first came out?\nIf so, what was the experience like? I’d love to hear how it felt watching those movies on the big screen. What were movie theaters like back then compared to now? And if you remember, which theater did you see them at?",
        "upvotes": 18,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1kezauy/did_you_see_don_bluths_animated_classics_the/"
    },
    {
        "id": "1kf73k8",
        "author": "truth-4-sale",
        "title": "David Lean's unmade epic 'NOSTROMO'",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xjbqskZ007sl6m-7_JVGgFM6PVu4dHjUe8TpnDlEqec.jpg?auto=webp&amp;s=3f5f208b750a6fef196fc67deaef1b4830cf561b"
        },
        "permalink": "/r/movies/comments/1kf73k8/david_leans_unmade_epic_nostromo/"
    },
    {
        "id": "1kf63pe",
        "author": "Davis_Crawfish",
        "title": "Appallingly bad decisions made by characters in horror films",
        "content": "I remember watching \"Wolf Creek\", a movie I had seen years ago. It's really great for the first hour—slowgoing, ominous, suspenseful, believable acting. Three backpackers in Australia unwittingly end up at an abandoned mining camp in the outback with a loon who tortures and kills people. However, around the hour mark, when shit goes south, one of the girls tries to save her friend who is being assaulted by the maniac, and ends up shooting him and grazing his neck. He falls apparently unconscious, but rather than ensuring he is actually dead, she hits him in the back with the butt end of the rifle twice, and the two drive off in one of his vehicles. This in and of itself is absurd.\n\nTo add insult to injury, the two women soon reach a cliff, and instead of trying to steer a different direction and avert their tormentor (he is now pursuing them in another car), they end up getting out and pushing the fucking car over the cliff—mind you, it is the middle of the night, they are hundreds if not thousands of miles away from civilization, and will inevitably die of heat exhaustion/dehydration because it's the fucking outback.\n\nIt is maybe the most egregious \"bad choice\" I've ever seen in a horror movie. Both of the characters end up dying, and in a way, they kind of deserve it. What is particularly frustrating about it is that this is not a popcorn horror flick by any means. It's serious in tone, and really uncompromising, but that stroke of bad writing derails the whole damn thing.",
        "upvotes": 6,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1kf63pe/appallingly_bad_decisions_made_by_characters_in/"
    },
    {
        "id": "1kecxi6",
        "author": "the_Celestial_Sphinx",
        "title": "The Conclave is a quiet and powerful movie",
        "content": "I just watched The Conclave and I really liked it. It is not a fast or loud film, but it slowly pulls you in with its story and mood. It shows the pressure, secrets, and power struggles that happen behind closed doors during an important religious event.\n\nSome people might say the ending is easy to guess, but that did not bother me. The journey is more important than the surprise. The movie does a good job showing the weight of each choice the characters make.\n\nRalph Fiennes was amazing in this movie. He did not need big speeches or action scenes. His face, his voice, and his small movements said a lot. He made his character feel real and thoughtful.\n\nThis film may not be for everyone, but if you enjoy serious stories and good acting, I think you will enjoy The Conclave.\n\nCan anyone recommend some similar movies ?",
        "upvotes": 556,
        "comments": 207,
        "media": null,
        "permalink": "/r/movies/comments/1kecxi6/the_conclave_is_a_quiet_and_powerful_movie/"
    },
    {
        "id": "1ketpkd",
        "author": "Brilliant_Part5434",
        "title": "The best movie villains are the ones who believe they are the hero of their own story.",
        "content": "I think the best movie villans are those that think they are justified in their actions. Whether it is Anton Chigurh in No Country for Old Men, or even Walter White(at least initially) in Breaking Bad, the most compelling antagonists are the ones who view themselves as the protagonists of their narrative. It makes them more complex and, in some cases, more relatable.\n\nWhat is your favorite villain who truly believes they’re in the right? Do you think this makes them more dangerous or appealing perhaps?",
        "upvotes": 39,
        "comments": 76,
        "media": null,
        "permalink": "/r/movies/comments/1ketpkd/the_best_movie_villains_are_the_ones_who_believe/"
    },
    {
        "id": "1kepss7",
        "author": "LagarretsBlount",
        "title": "Bone tomahawk?",
        "content": "I rewatched bone tomahawk. I think the move was brilliantly made. The movie was not very long but still had great character development. \n\nIt kept you intrigued and made you need to see the ending. The sheriff was a great leader and selfless man. The way he treated the old man with respect and trusted his experience and skills even though he had clear deficiencies was amazing. \n\nThe way he said goodbye to the old man in the end was emotional for a horror movie as well. \n\nI think overall this movie was better than its reviews. \n\nWhat is everyone's opinion about it? \n\nAlso, I like how it gives some insight to the old man's past, leaving it ambiguous to the viewer to make up in their minds what the old\nMan has seen. \nIt also doesn't give much back story about Bright Hope or the people who live there or how it was established. \n\nAlso, what do you guys think about the ending when the old\nMan throws the rock? Does the sheriff survive? All good things to think about. ",
        "upvotes": 40,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1kepss7/bone_tomahawk/"
    }
]