[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 37,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pxmcdo",
        "author": "akssh_art",
        "title": "“Stranger Things is just supposed to be a fun sci-fi show” cannot be an excuse for Season 5’s mediocre writing",
        "content": "There’s a part of the fandom that’s using the argument that Stranger Things is just supposed to be a fun sci-fi, with fun cast and emotions, but this does not sit right with me at all. \n\nThe show not only has taken so long to finish, but has also been (I think?) Netflix’s biggest show till date, bringing in a new Sci-Fi IP which demands quality in its storytelling given its scale. Till Season 4, I thoroughly enjoyed the lore of the universe. I felt like the sci-fi elements were the priority (if there was any) and the “fun” stuff was sort of secondary. Season 5 feels like the writers turned into a bunch of teenagers and wrote up some BS to finish the plot.\n\nThe only thing I have liked is the Upside Down being a wormhole. Apart from that, from The Crawl to The Bridge, almost all elements of the lore have insane number of loopholes. Plus, the actors have such cringe dialogues. This wasn’t the show I fell in love with.\n\nSaying “this is just supposed to be a fun sci-fi” screams of calling a superhero movie “just a fun movie” or a shonen anime “just a shonen.”\n\nThe world you build has to make sense, the rules you establish have to matter, and the way you make these stories into a reality has to be upto the mark man. \n",
        "upvotes": 888,
        "comments": 403,
        "media": null,
        "permalink": "/r/netflix/comments/1pxmcdo/stranger_things_is_just_supposed_to_be_a_fun/"
    },
    {
        "id": "1pxzsjl",
        "author": "Able_Milk521",
        "title": "Enjoying Stranger Things Season 5",
        "content": "Just countering all the hate online for the new season. It's a show. Not real life. \n\nBut like real life sometimes it's more about the journey than the destination. ",
        "upvotes": 54,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1pxzsjl/enjoying_stranger_things_season_5/"
    },
    {
        "id": "1py8zyt",
        "author": "Mandingy",
        "title": "Recommendations Terrible",
        "content": "Why does Netflix recommend things I’ve already watched or rated? Especially things I just watched. They have a huge catalog but I feel like I only see so little for seeing the same things over and over.",
        "upvotes": 14,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1py8zyt/recommendations_terrible/"
    },
    {
        "id": "1px7c2n",
        "author": "Tricky-Bat-2638",
        "title": "Anyone else Disappointed with season 5 of stranger things?",
        "content": "Finding it a little disappointing considering how amazing the first 4 seasons were. \n\nDustin’s character is starting to really grate on me and will has spend most of seasons 1-5 sleeping. Joyce’s voice has just got more irritating as the seasons have gone on. \n\nAnd Millie Bobby brows face barely moves. I’m not judging her for having work done to her face but I do feel like there should be rules in long term series about having a large amount of plastic surgery. Her top lip is huge and barely moves and there’s  minimal expression on her face due to Botox. Some dramatic scenes are ruined from the lack of movement &amp; expression in her face.\n\nOverall I’m a little disappointed",
        "upvotes": 1419,
        "comments": 687,
        "media": null,
        "permalink": "/r/netflix/comments/1px7c2n/anyone_else_disappointed_with_season_5_of/"
    },
    {
        "id": "1py7gbx",
        "author": "Watchhistory",
        "title": "Peaky Blinders - Season 6 (2022) - Rewatch",
        "content": "*Peaky Blinders* (2022) Season 6, supposedly final season. Film sequel, *The Immortal Man*,  coming in March 2026.\n\nGods, this is good - the fascist movement, Mosley, etc. in England, the connections with it, gangster and political in the US. \n\nRe-watching for the first time since it came out, season 6 of *Peaky Blinders* (2022). I'm being deeply impressed with it, I think, more so, than first time around. In other words, this series is aging very well, becoming every more relevant to our own time than even when it released initially. Which is both good, for viewing, and bad, for we *living* in this time.\n\nDiana Mitford is a prominent character due to her intimate relationship with Mosley, the proud Brit fascist/racist would-be prime minister, and her fan girl relationship with Hitler. Watching this in the same year UKTV-Britbox put out another period drama series on the Mitford sisters (*Outrageous,* adapted from a book by Mary Lovell), is disturbing in exactly the way the history of that bundle of sisters always is. How could a family produce both a fascist racist like Diana and a progressive like Jessica?\n\nI am guessing many of those who found season 6 an inferior season, \"not like what it used to be\", is because the season dramatized so specifically how capitalism, class, crime and politics are history's quartet, connected in time's womb. Along with Mosley, a Boston Irish crime boss, Jack Nelson, is Tommy Shelby's antagonist. Nelson is another fascist opportunist-sympathizer, playing both sides against his middle, wired into D.C. political hierarchy at the highest levels, including having easy access to the POTUS. He's a fictional Joe Kennedy.\n\nWhat I like best about this period drama, and so far, particularly, this season, is the range of strong female characters -- and there are many! Again, it seems many viewers couldn't move on without Polly. They loved her strong character -- it had been there from the beginning. These newer women having so much influence on the Shelby family's growth moving into WWII era, seemed not to be to the liking of many viewers either.\n\nIt's so interesting too, seeing other characters hewing in their individual cases back to their cultural roots in many ways, as the world they'd been navigating successfully as crime bosses is changing again, and they look in their own ways to survival and success in their future, particularly Tommy with his Romany imagination, and Alfie Solomons. Sure and they'd be in alliance now and again, both always forever outsiders to Britain's ruling class, no matter how useful, how necessary, they are to it..",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1py7gbx/peaky_blinders_season_6_2022_rewatch/"
    },
    {
        "id": "1pxibja",
        "author": "fluffnubs",
        "title": "The video quality on Netflix is total garbage, and has gotten progressively worse since 2020.",
        "content": "It’s almost unwatchable. We watched the latest Knives Out movie last night and it was like there was a static overlay. If you stared at any characters forehead for more that half a second you’d think it was almost \\*moving\\*. It’s terrible. We have the premium 4K package, a newer 4K TV with full HDR etc etc. Netflix has the highest subscription price of the major streaming services and the video quality - \\*even of their own in-house produced films/shows\\* - is a total, complete compressed mess. We watched Weapons on Crave immediately after and the quality was 1000% better. It was insane the difference. \n\nI remember during the Covid pandemic, they sent out a notice saying they were further compressing the streams to conserve bandwidth under high demand, but it’s never come back. \n\nI’ve been on the fence about even keeping my subscription, and I think this is the final straw. ",
        "upvotes": 85,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1pxibja/the_video_quality_on_netflix_is_total_garbage_and/"
    },
    {
        "id": "1py7zpr",
        "author": "Level_Investigator_1",
        "title": "Moonhaven - would love to see it renewed on Netflix",
        "content": "Just watched the AMC show and have been pleasantly surprised with how unique it is even if there are some aspects that feel a bit campy. I thoroughly loved it and it would be amazing if they could continue the story given this is essentially a prologue.\n\nThe exploration of human somewhat plausible and non-cynical future human culture and.\n\nIt’s rare that a show explores these aspects of human nature and culture in a sci-fi setting and I loved it. Anyone else feel the same?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1py7zpr/moonhaven_would_love_to_see_it_renewed_on_netflix/"
    },
    {
        "id": "1py48oo",
        "author": "Texanlivinglife",
        "title": "Night Always Comes",
        "content": "This is a crazy good movie!!! Looking for something else now. Thanks for the heads up on some great movies to binge. Does anyone have some suggestions for evening entertainment?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1py48oo/night_always_comes/"
    },
    {
        "id": "1pxv4u6",
        "author": "Yuck_Few",
        "title": "Black Rabbit",
        "content": "Since Reddit unfortunately doesn't let you edit a title when you make a typo, I just had to scrap the whole thing and start over... anyway \n\n\nI went into it already expecting it to be good just because it's Jason Bateman and I was not disappointed \n\nBasically first two episode set up the premise, this is the situation they're in and this is how screwed they are if they don't find a solution and then starting it episode 3, the writers do a really good job of snowballing and escalating the tension with each episode. \n\nIn my opinion, Bateman is underutilized as an antagonist character who doesn't think he's the villain.\nHe's really talented at that casual dry situational cruelty. \n\nthat's why he was good and carry on also\n",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pxv4u6/black_rabbit/"
    },
    {
        "id": "1pxweik",
        "author": "itsBlissBunny",
        "title": "Spoiler Ad",
        "content": "Everyone’s talking about stranger things, so can we talk about that new spoiler ad?! When I saw the “spoiler ahead” line, I didn’t think they’d literally be spoiling the endings of all their most popular shows?!? Who would want this? You’ll either ruin the show for someone. Or fill people with a redundancy to watch it in the first place. In the end just to promote Stranger Things 5 and make you believe there’s a possibility one of them will die. \n\nI just need to know who the marketing genius was who went  “no trust me, people LOVE spoilers.” 😒",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pxweik/spoiler_ad/"
    },
    {
        "id": "1py6z7e",
        "author": "Yendis4750",
        "title": "The Watcher in 2026?",
        "content": "Did season two get renewed? I haven't heard anything about it and can't find any details. Any word on a release date? \n\n(Repeating)\nDid season two get renewed? I haven't heard anything about it and can't find any details. Any word on a release date? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1py6z7e/the_watcher_in_2026/"
    },
    {
        "id": "1pwqjqs",
        "author": "justameesa",
        "title": "Stranger Things might crash as hard as GOT",
        "content": "The writing is not doing any favors to the plot or the characters. At this point of time listing things from the 80s is the only \"appeal\" to this nostalgia driven show.\n\nD&amp;D curse much? ( Duffer and Duffer)",
        "upvotes": 1890,
        "comments": 999,
        "media": null,
        "permalink": "/r/netflix/comments/1pwqjqs/stranger_things_might_crash_as_hard_as_got/"
    },
    {
        "id": "1pxk2z3",
        "author": "Neverendingstory1-",
        "title": "What’s a show you’re still mad that it got canceled?",
        "content": "I’ll start Black AF I liked the show. I thought it was funny and I related to the show. I grew up black and from the same area. It was good to see a show I kind of related too. I thought it was way better than blackish and was sad it got cancelled after one season.",
        "upvotes": 22,
        "comments": 231,
        "media": null,
        "permalink": "/r/netflix/comments/1pxk2z3/whats_a_show_youre_still_mad_that_it_got_canceled/"
    },
    {
        "id": "1px8qwn",
        "author": "stroh_1002",
        "title": "Sadie Sink on her Stranger Things hair for season five: 'You have all this stuff in your cave, and you couldn’t find a hair tie or a hairbrush? It was a huge jump scare when I was watching the season for the first time'",
        "content": "",
        "upvotes": 98,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1px8qwn/sadie_sink_on_her_stranger_things_hair_for_season/"
    },
    {
        "id": "1px72yu",
        "author": "SirLiftsalot0",
        "title": "Anyone else struggling to finish the new Stranger Things season?",
        "content": "I loved Stranger Things earlier, but honestly this season felt more like a task than something I wanted to watch.\nThe pacing was slow, the tension didn’t land, and a lot of the episodes felt stretched without real payoff.\n\nIt wasn’t exactly boring, but it definitely lacked the thrill and “can’t wait for the next episode” feeling the show used to have.\nCurious if I’m alone here or if others felt the same.",
        "upvotes": 94,
        "comments": 169,
        "media": null,
        "permalink": "/r/netflix/comments/1px72yu/anyone_else_struggling_to_finish_the_new_stranger/"
    },
    {
        "id": "1py0p6l",
        "author": "thicc_beerd",
        "title": "Extra extra member?",
        "content": "I have an account. I have for years.  My Dad used to live in our inlaw apartment, on our wifi, so sharing was never an issue.\n\nWe all moved. He now lives in another families inlaw apartment. I added the extra member for him to be able to keep using Netflix.  Its fine.\n\nThe issue. The other occupant of the house my dad lives in, on the same wifi, trying to use my dad's email/login on a different tv.  Its telling him he's not on the account and to be added to the home network.\n\nHow can I add him as an extra account if he is using the account of a person who IS THE EXTRA ACCOUNT, in the same house.  ",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1py0p6l/extra_extra_member/"
    },
    {
        "id": "1pwzt7w",
        "author": "TurnipYadaYada6941",
        "title": "The new Netflix UI is atrocious!",
        "content": "Which idiot put the top level menu at the top, where you cannot reach it without scroll for eternity!\n\n  \nDid the same idiot make it impossible to filter films by genre easily?\n\nis there any way to get Netflix to provide a usable II?",
        "upvotes": 192,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1pwzt7w/the_new_netflix_ui_is_atrocious/"
    },
    {
        "id": "1pxmggp",
        "author": "Klutzy_Belt_2296",
        "title": "Relay is a pretty decent movie",
        "content": "I know a lot of times people many times are looking for recommendations, and I know the struggle of trying to find a movie or show that will actually appeal to you on here.\n\nAnd I already left my thoughts on another movie on here so I thought, why not leave my thoughts on some of the good ones too.\n\nAnd the most recent one for me was Relay. I just watched it today and it is honestly pretty decent! It had its fair share of surprises and the action scenes were very fun to watch. If you are looking for something to watch, I definitely would recommend it if you like action-y type of movies.",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pxmggp/relay_is_a_pretty_decent_movie/"
    },
    {
        "id": "1pwtmvv",
        "author": "Normal_Comfort_5847",
        "title": "So we’re just supposed to know Stranger Things lore from a stage play (The First Shadow) now?",
        "content": "I get that Stranger Things: The First Shadow (Broadway / West End) is meant to deepen the lore, but honestly it feels like it introduces major information that should not be locked behind a stage play that most fans will never see.\n\nThere are things in the show that already felt like loose threads, and now it turns out they are “explained” in the play:\n\n1. Henry’s cave memory in Season 5, where he’s clearly interacting with / absorbing Mind Flayer-like particles. In the show, this is presented as something mysterious and significant… but never really followed up on in a satisfying way. Apparently the play adds context, but the series itself doesn’t.\n\n2. The Oklahoma poster in Max’s hand during one of Henry’s memories strongly suggests Joyce, Hopper, and Henry all went to school together. That’s a huge implication; yet across four seasons, Joyce and Hop never say a single word about knowing Henry Creel? Not even a hint?\n\n3. Henry’s early connection to the Upside Down, Brenner’s involvement, and the timeline of how everything starts are apparently much clearer in the play but on screen, it still feels incomplete or oddly rushed.\n\nThe problem isn’t expanded lore. It’s that the main TV series feels like it’s missing chapters unless you’ve seen a West End/ Broadway show that:\n\nA. isn’t accessible worldwide,\n\nB. isn’t cheap,\n\nC. and won’t be seen by the vast majority of viewers.\n\nAt this point, it feels like they should’ve done a limited prequel season or special between Season 4 and 5 to properly set this up. Relying on a stage production to carry essential canon just makes Season 4 feel retroactively unfinished.\n\nWith only one episode left, I’m worried the finale will have too much ground to cover, and that casual viewers will never even realize why certain things don’t quite add up.\n\nEnd rant. Curious if this bugs anyone else or if I’m just overthinking it. \n\n\nEdit: No, I’m not saying anyone should fly to New York or London to see the play. Yes, the play exists, and the creators have stated it’s important for understanding the show’s ending. Yes, it might be addressed in the finale, and yes, I’m waiting for the last episode. No, discussing a TV series on a TV subreddit isn’t a “life crisis” or proof that I have nothing better to do; it’s simply something I wanted to talk about.\n",
        "upvotes": 491,
        "comments": 164,
        "media": null,
        "permalink": "/r/netflix/comments/1pwtmvv/so_were_just_supposed_to_know_stranger_things/"
    },
    {
        "id": "1pwtfiu",
        "author": "job_hunter101",
        "title": "Any one else hate these batch releases?",
        "content": "Either release it all at once so we can binge it, or release it weekly so people can enjoy discussing it each week. Instead, these batch releases make me hate it entirely. You usually wouldn’t know when these get released and sometimes it’ll be days before you even know it, unless you don’t have any life. \n\nIt’s bad enough as it is with the yearly gaps between each season and to add these batch releases to it just makes my interest go down the drain. ",
        "upvotes": 337,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1pwtfiu/any_one_else_hate_these_batch_releases/"
    },
    {
        "id": "1pxsup4",
        "author": "Illustrious_Salt_569",
        "title": "Streaming quality downgrade",
        "content": "I don't know if it's the internet where I live (maybe because of bad weather conditions?) or something is up on their end. But watching a show at the moment currently looks staticy in some scenes right now. Even though last night it looked perfectly fine with no issues whatsoever. It's not unwatchable by any means, but definitely noticeable. Anyone else having this problem or just me?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pxsup4/streaming_quality_downgrade/"
    },
    {
        "id": "1pxe1k7",
        "author": "ReneKiller",
        "title": "What are some good but lesser known shows?",
        "content": "What are some good but lesser known shows on Netflix, preferably with an actual ending or a confirmed continuation?\n\nI've just watched 1899, which I really liked, only to learn that season 1 ends in a massive cliffhanger and of course Netflix cancelled season 2.\n\nI don't really have a genre preference except I'm not really interested in romantic shows.\n\nEDIT: Thanks for all the answers. I've seen a few of them but most are new to me. I'll check them out.",
        "upvotes": 11,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pxe1k7/what_are_some_good_but_lesser_known_shows/"
    },
    {
        "id": "1pxk58h",
        "author": "Vettechjen",
        "title": "Pretty disturbing show",
        "content": "I just finished Delirium on Netflix and it was a little hard to follow at first but I must say it turned out to be a little disturbing. I don’t usually find shows that I would consider disturbing but this one had it.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pxk58h/pretty_disturbing_show/"
    },
    {
        "id": "1py45jf",
        "author": "matbonucci",
        "title": "2017 account cancelled by Netflix for no reason",
        "content": "I called support and they say it is for unusual activity and won't explain further, no unusual activity on it just as usual 😤\n\nNo travel\nNo delayed pays\n\nRequested a manager and after being on hold for a long time they dropped the call. Tomorrow will try again.\n\nRefuse to lose my relatives account and mine for no reason \n",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1py45jf/2017_account_cancelled_by_netflix_for_no_reason/"
    },
    {
        "id": "1pxr62c",
        "author": "Vesimelooniz",
        "title": "Hi could somebody help me with this error message?!",
        "content": "So when i try to download netflix on my PC it gives me this error message: \"The application was unable tto start correctly (0xoOOOO142)\".  So if anybody has any idea why does it do this i would really appriciete if you could help me!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pxr62c/hi_could_somebody_help_me_with_this_error_message/"
    },
    {
        "id": "1pxw0t6",
        "author": "Hot-Slide-7305",
        "title": "YouTube video",
        "content": "Does anyone know who creates the YouTube video called \"The Story of Mike and Eleven\" season 1-4 \nI think it literally is incredible.\nI know it is not finished yet but Im hoping they'll be another one made about their story with season 5 added onto it. \nIt's absolutely beautiful video. Id love to know who made it. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pxw0t6/youtube_video/"
    },
    {
        "id": "1pxq2s3",
        "author": "Twan88mot",
        "title": "Series en films in Nederland",
        "content": "Hi!\nOndanks de nieuwe ui kan ik niet goed zoeken, maar welke series of films (beschikbaar in Nederland) zijn het kijken waard?\nHet moet niet de meest gewelddadige en bloederige onderwerpen hebben maar een beetje actie is helemaal leuk!\nIk hoor graag opties, misschien een kleine rode draad erbij? Scheelt vast veel trailers kijken!\nThnx!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pxq2s3/series_en_films_in_nederland/"
    },
    {
        "id": "1pxfeuz",
        "author": "Infinite-Albatross44",
        "title": "The Threesome",
        "content": "If you’re going into this expecting something sexy, don’t. I’m all for drama and real-life, grounded storytelling, but with the title and the insinuation, it really underdelivers. The acting wasn’t great either, and honestly, it just fell flat. I wouldn’t recommend wasting your time.",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pxfeuz/the_threesome/"
    }
]