[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 34,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1plbq9a",
        "author": "arkelangel",
        "title": "I'm done.",
        "content": "I'm done. Years of subscriptions. Netflix has decided to remove casting. My tvs using chrome cast. I don't have a Netflix ap on my tv. I don't want to buy a new tv. I want to be able to cast when I go to friends houses, or when I'm in a hotel. Like.... This was a great feature. Netflix isn't useful to be if i can't watch it on my tv. I'm just so frustrated. I know it isn't customer services fault but omg ....",
        "upvotes": 273,
        "comments": 76,
        "media": null,
        "permalink": "/r/netflix/comments/1plbq9a/im_done/"
    },
    {
        "id": "1pl7nz3",
        "author": "Impressive_Gain_3385",
        "title": "I'm having a hard time finding a good show to watch, can you recommend some?",
        "content": "I have watched breaking bad, game of thrones, sopranos, stranger things, narcos, are there any other good ones? I have tried watching a couple of shows but some of them are just difficult to watch like mindhunter for some reason I just had a hard time getting through it especially the first two episodes I just stopped it. I started watching dark and I just couldn't get through the show after the first two episodes due to the translation of English for the German actors that are provided.",
        "upvotes": 96,
        "comments": 370,
        "media": null,
        "permalink": "/r/netflix/comments/1pl7nz3/im_having_a_hard_time_finding_a_good_show_to/"
    },
    {
        "id": "1pkz0r3",
        "author": "dailymail",
        "title": "Netflix cancels Billionaires' Bunker just three months after release on the streaming platform",
        "content": "",
        "upvotes": 214,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1pkz0r3/netflix_cancels_billionaires_bunker_just_three/"
    },
    {
        "id": "1pl4920",
        "author": "MainEntrance7413",
        "title": "Wake up dead man is absolutely Cinema loved every second of it ✋🏽😤🤚🏽",
        "content": "What a stellar ensemble cast and god damn, that camerawork and cinematography were magnificent. I've gotta say, this is the best one out of the three. A true masterpiece in the crime-thriller-mystery genre.\n\nDaniel Craig has aged like fine wine.The whole thing had me on the edge of my seat. Brilliantly written, gracefully directed, mysteriously told, perfectly casted, visually mastered, and carried by haunting, atmospheric music that gave the film its entire atmosphere.\n\nOverall... just wow. What a movie.",
        "upvotes": 91,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1pl4920/wake_up_dead_man_is_absolutely_cinema_loved_every/"
    },
    {
        "id": "1pl1j5n",
        "author": "ComradeRedsky",
        "title": "Mr Mercedes",
        "content": "Worth starting this, anyone got opinion on this, have to say looks promising, I'm sure it's been out a while, just noticed it's showing up. Looks right up my street. ",
        "upvotes": 36,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1pl1j5n/mr_mercedes/"
    },
    {
        "id": "1pkwtbw",
        "author": "mr_the_boilermaker",
        "title": "What's with the non-stop music in documentaries?",
        "content": "I almost had to turn off the Charlie Sheen doc because of the annoying, non-stop background music. \n\nI DID turn off the hunt for Bin Laden doc because of the annoying, non-stop background music. \n\n  \nNetflix documentary film makers, pump the brakes on the music! It makes these shows unwatchable!\n\n/rant",
        "upvotes": 46,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1pkwtbw/whats_with_the_nonstop_music_in_documentaries/"
    },
    {
        "id": "1plaojf",
        "author": "According_Time5120",
        "title": "Netflix Drops New Crypto Comedy About Forgotten Bitcoin Password Worth $35 Million Stash",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1plaojf/netflix_drops_new_crypto_comedy_about_forgotten/"
    },
    {
        "id": "1pks9y4",
        "author": "T00dd",
        "title": "All The Classic Star Trek TV Shows To Exit Netflix Globally In January",
        "content": "",
        "upvotes": 44,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1pks9y4/all_the_classic_star_trek_tv_shows_to_exit/"
    },
    {
        "id": "1pkkf0k",
        "author": "Plushie-Queen254",
        "title": "\"This movie/is not available with your current subscription\"- why is this a thing now?",
        "content": "\nA few days ago, I was wanting to watch Annie (2014), but I didn't know what streaming service it was on, so I asked Alexa on my FireStick and it told me it was on Netflix.  In fact both the 2014 version and the original 1980s Annie was available on Netflix. I thought *great!* and clicked on the thumbnail for the 2014 Annie. \n\n\nI was taken to Netflix and when I tried to watch the film, it said I couldn't watch this movie with my current subscription. \n\nMind you, I have the basic subscription, but when I first got Netflix, it originally was that even the basic subscription could get you any movie or show they have available. So this is new to me.  \n\n\nWhen did Netflix start doing this and why? ",
        "upvotes": 156,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1pkkf0k/this_movieis_not_available_with_your_current/"
    },
    {
        "id": "1pl81yj",
        "author": "Unlikely_Ebb_866",
        "title": "bittersweet feeling?",
        "content": "whenever i watch a movie or a show, i always am at a peak of emotions, sad or happy. i'm usually happy, because i'm a very emotional person and i feel like i have a connection to everything lol but anyways my main point is that whenever i finish the show, whether i started it and finished it in a week, or watched it for years, i feel so incredibly sad. it's like i'll never be able to feel like how i was when i first watched it. does literally ANYBODY have ANY method of thinking or mindset to make this feeling not happen as strong? it's very bittersweet and sad, and sometimes i can't even bear to watch the show twice, or see edits or anything of the show. not sure if i'm just dramatic or what, it's like i feel really empty and lost.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pl81yj/bittersweet_feeling/"
    },
    {
        "id": "1pknp0e",
        "author": "Achyut_78",
        "title": "Dexter Might Be One Of The Best Tv Series On Netflix !!!",
        "content": "I started this series not knowing what to\n expect from it. I thought oh yea another serial killer series with the main character having daddy issues. But oh boy how wrong was I.\n\nThis series might just be one of the best serial killer shows, now I have seen multiple great series like Dahmer, Hannibal, You. But the consistency that Dexter maintains is unreal.\n\nIn fact it's still airing and having one of the best tv ratings ever. This series dominated the genre of serial killers.\n\nAnd the character Dexter Morgan has been played so well by Micheal C Hall, truly amazing. It's just simply lovely.\n\nThe progression of season and new serial killers introduced in each season keep you hooked with the series.\n\nI am currently on the final season of Dexter and I must say it did not miss any aspect whatsoever.\n\nI am sure most of you have already seen it but, of you haven't, then I must say it's a must watch.",
        "upvotes": 41,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1pknp0e/dexter_might_be_one_of_the_best_tv_series_on/"
    },
    {
        "id": "1plc43r",
        "author": "Affectionate-Bus927",
        "title": "Netflix automatically activates subtitles",
        "content": "when the volume is muted. tested on samsung smartphone galaxy s24   watching black doves  \n\nis this new and does it work on all shows / series  and/ or devices ?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1plc43r/netflix_automatically_activates_subtitles/"
    },
    {
        "id": "1pkb136",
        "author": "Wonderful_Highway629",
        "title": "Director convicted of scamming $11M from Netflix and going on lavish spending spree",
        "content": "600k for mattresses really gets me.  This guy went on a shopping spree and never finished the show.  He will probably never work in Hollywood again.  I wonder what he was thinking!!??",
        "upvotes": 195,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1pkb136/director_convicted_of_scamming_11m_from_netflix/"
    },
    {
        "id": "1pl97f8",
        "author": "conniewanders",
        "title": "Owning Manhattan - is Jordan Hurt being a little too butt hurt over being dropped off the listing?",
        "content": "So I’m really enjoying Owning Manhattan s2. I like the fact that it doesn’t pretend to be full reality. There’s obviously a lot of scripted elements but I do think that the way they do the Real Estate and the sales and stuff like that are much more authentic than Selling Sunset, of which I used to be a really big fan of, but I  digress. \n\nThis whole thing with Jordan Hurt being taken off the 15 West 96th Street listing…. I just feel like he’s being being over the top about it. I get that obviously you don’t want to lose listings and commission, however, at the end of the day how is he pissed off at Ryan for being taken off of the listing? If the fucking developer is not happy because nothing has sold that’s on you it’s not on Ryan. \n\nyes you’re doing the best you can in a tough market, but the developer is looking for a pat on the back good job. They want the money. They want their return. \n\nI haven’t seen any eps past this (s2 ep3), so maybe he gets over it. But this episode annoyed me 😅",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pl97f8/owning_manhattan_is_jordan_hurt_being_a_little/"
    },
    {
        "id": "1pkxy3w",
        "author": "vishesh_07_028",
        "title": "Any good thriller series available on Netflix?",
        "content": "I want to watch a good thriller web series available on Netflix. Series should be good in making thrills to me. Do suggest me some list of good thriller based web series available on Netflix.",
        "upvotes": 5,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1pkxy3w/any_good_thriller_series_available_on_netflix/"
    },
    {
        "id": "1pk2mjf",
        "author": "vishesh_07_028",
        "title": "Quality Over Quantity was a LIE.",
        "content": "We paid more, lost password sharing, and the catalog shrank. They promised quality, but I'm still scrolling through mediocrity and re-watching Ozark. Netflix has replaced content with controversy. Where is the value for $20/month?",
        "upvotes": 208,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1pk2mjf/quality_over_quantity_was_a_lie/"
    },
    {
        "id": "1pk9840",
        "author": "Spagetti13",
        "title": "Decades later, people are still celebrating Festivus in real life -- the made-up holiday from a sitcom that I learned about by watching \"Seinfeld\" on Netflix",
        "content": "",
        "upvotes": 81,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1pk9840/decades_later_people_are_still_celebrating/"
    },
    {
        "id": "1pl31gr",
        "author": "daddydave",
        "title": "The Residence: Does anyone else think that more shows should go to a quick cutaway to any character mentioned, with them holding up a sign identifying them?",
        "content": "It was a helpful device for the audience as well as making sense in the context of the plot. If they did that for other shows, even though it probably would make no sense plotwise, it would make it easier to keep track of the characters in something complicated. I might get the courage to try Dark again. Make it something you can turn off and on like closed captions! \n\nAlthough now that I've written that out, it's not that far from Amazon Prime's X-Ray feature, although they're not holding up signs in that case.\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pl31gr/the_residence_does_anyone_else_think_that_more/"
    },
    {
        "id": "1pl2ga0",
        "author": "Fit_Bee367",
        "title": "I Need a romance series asap",
        "content": "I want English romantic TV shows, but not long ones, just one or two seasons.\nI watched Bridgerton and I loved it. It doesn’t have to be the same historical era, but I want the same passion and emotions.\nI like **slow-burn** romance, and it doesn’t have to be on Netflix.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pl2ga0/i_need_a_romance_series_asap/"
    },
    {
        "id": "1pl8b4t",
        "author": "OliveEffective1836",
        "title": "What movie do you recommend I watch at 2 in the morning?",
        "content": "I don't want to go to bed, I'm bored, and I recently bought a Netflix subscription. I want to make the most of it and watch a movie, but I can't find any. Help!",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pl8b4t/what_movie_do_you_recommend_i_watch_at_2_in_the/"
    },
    {
        "id": "1pkurmd",
        "author": "Regular-Bite-7553",
        "title": "Netflix quality issue",
        "content": "I upgraded my plan to premium which is the highest plan available in India and I'm still not able to view with higher quality on my android tablet. I contacted netflix support they told me to change playback quality to high from auto i did that but still no change in quality. Any help here please ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pkurmd/netflix_quality_issue/"
    },
    {
        "id": "1pk3ps9",
        "author": "businessinsider",
        "title": "Guilty on all counts: Jury convicts Netflix director Carl Rinsch in $11 million fraud case",
        "content": "",
        "upvotes": 53,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pk3ps9/guilty_on_all_counts_jury_convicts_netflix/"
    },
    {
        "id": "1pkq9zf",
        "author": "MutantReaperX",
        "title": "Issue with adding payment method and not receiving code.",
        "content": "Anyone else having major issues with adding payment method? It's either it can't complete the action or when it does successfully go to the next page which is send code to phone i don't receive any code at all. If Netflix doesn't want my money i mean.. cool i can find other means of viewing their content lol but is there any fix at all or do i just wait it out until the issue resolved itself withing the next few days or something idk..",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pkq9zf/issue_with_adding_payment_method_and_not/"
    },
    {
        "id": "1pkp9dd",
        "author": "NothingDizzy239",
        "title": "Help",
        "content": "Can someone tell me who gabby from free rein looks like? Her acting and face looks so familiar but looked her up and she’s not from any other show I have seen. I bugging me so much 🤦🏻‍♀️",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pkp9dd/help/"
    },
    {
        "id": "1pk7kz6",
        "author": "RiskAndReason",
        "title": "Which show’s new season are you waiting for the most?",
        "content": "There are so many ongoing series on Netflix right now that it feels like I’m always waiting for *something* to come back.\n\nWhich show are you most excited to get a new season for?  \n",
        "upvotes": 11,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1pk7kz6/which_shows_new_season_are_you_waiting_for_the/"
    },
    {
        "id": "1pkwanu",
        "author": "NotKatiee",
        "title": "Netflix resubscribing me without me asking?",
        "content": "I canceled Netflix in August because I like to switch back and forth between Hulu and Netflix. I was just checking my email and I had an email thanking me for resubscribing. I didn't do that. I'm wondering what could have caused this? I already changed all my passwords. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pkwanu/netflix_resubscribing_me_without_me_asking/"
    },
    {
        "id": "1pjt9bt",
        "author": "Fun_Smile3175",
        "title": "What's your favorite Netflix movie?",
        "content": "I spend roughly three to four hours watching Netflix every day, but lately I can’t seem to find any content that’s particularly interesting—most of it feels boring to me. That’s why I want to see what everyone’s favorite movies are, to make my spare time more enjoyable!",
        "upvotes": 25,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1pjt9bt/whats_your_favorite_netflix_movie/"
    },
    {
        "id": "1pj49p1",
        "author": "AnotherDarnDay",
        "title": "What did I Just watch?",
        "content": "The sean combs doc. Now to be clear I've never been a fan of Diddy. My first memory of seeing him on TV was when he did the video with faith Evans as a tribute to Biggie. \n\nBut omg, that doc just sheds a lot of things. Like he \"allegedly\" had a part in Tupac and biggies deaths. And he wanted to throw biggie the biggest funeral, made it all about him and made biggies estate pay for the entire thing? How low can a person go. \n\nNot to mention, how stupid were those jurors? They dropped the ball completely. \n\nIts nice to know he likes his \"fans\" so much he needs to shower with peroxide after greeting them. \n\nHe's a vile person.\n\nWhat's your opinion of the doc or the person its about? \n\nOn the upside sting got richy rich from Diddy over that song. Sting earns two thousand dollars a day on it from what I understand. \n\n",
        "upvotes": 817,
        "comments": 206,
        "media": null,
        "permalink": "/r/netflix/comments/1pj49p1/what_did_i_just_watch/"
    }
]