[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 483,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 28,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1hfoujk",
        "author": "anonRedd",
        "title": "'A Man On The Inside' Renewed For Season 2 By Netflix",
        "content": "",
        "upvotes": 519,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1hfoujk/a_man_on_the_inside_renewed_for_season_2_by/"
    },
    {
        "id": "1hfyjzs",
        "author": "Lucky-bottom",
        "title": "Kings of Tupelo vs Tiger King",
        "content": "I just watched Kings of Tupelo and holy shit, my brain is still tweaking. WTF did I just watch? Are there any normal people in Tupelo?? \n\nAnyway, Kings of Tupelo vs Tiger King - which one takes the cake of WTF for you? ",
        "upvotes": 15,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hfyjzs/kings_of_tupelo_vs_tiger_king/"
    },
    {
        "id": "1hg1ssi",
        "author": "Coastal_Tide",
        "title": "Tv shows to binge to dissociate from my mom’s terminal illness? ",
        "content": "My mom recently received a terminal diagnosis  and I am not ok. \n\nLooking for shows to watch that DO NOT focus on death or mother / daughter relationships. (No greys anatomy or Gilmore girls)\n\nRecent shows that helped: sex lives of college girls and inventing Ana. \n\nPrevious shows I loved: OITNB, PLL, gossip girl, once an upon a time, XO kitty, heart stopper, you, Emily in Paris. \n\nBonus points for lesbian content ",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hg1ssi/tv_shows_to_binge_to_dissociate_from_my_moms/"
    },
    {
        "id": "1hg5xky",
        "author": "Robemilak",
        "title": "Netflix Releases Trailer for Japanese Drama Remake ‘Asura’",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hg5xky/netflix_releases_trailer_for_japanese_drama/"
    },
    {
        "id": "1hfou2k",
        "author": "Cheersscar",
        "title": "Can someone explain why Netflix originals leave the service?",
        "content": "I don't get it.  Why are some Netflix original shows leaving the service? Don't Netflix own this content? Worth more to license them elsewhere?  Disney style lock it in a box? What's the story?",
        "upvotes": 35,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1hfou2k/can_someone_explain_why_netflix_originals_leave/"
    },
    {
        "id": "1hg2n57",
        "author": "Machoricardo",
        "title": "Help with netflix app",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hg2n57/help_with_netflix_app/"
    },
    {
        "id": "1hg4fwm",
        "author": "iloveowls23",
        "title": "Apple TV App Keeps Logging Me Out",
        "content": "So I debated about posting here about this, but unfortunately Netflix Customer Service has offered absolutely no solution and they don’t seem to care at all about this.\n\nMy Apple TV 4K (latest iteration) and 4K 1st Gen both keep logging me out of my user account and Netflix only says “they have no issue reported about this” which is like saying nothing, basically.\n\nI’ve been using the same network, I live alone, I’m using a Premium account and have never shared my account with anyone else, also I never turn off my devices. In fact, I turned off both App &amp; System updates and this keeps happening still. I wonder if this has happened (is happening) to anyone else?\n\nI understand that they’re cracking down on shared accounts, accounts being used outside of the primary residence (which has proved quite flawed recently), but this is a new low for me. It’s rendering my account almost unusable at this point. I also use Disney, Max, Prime, Apple TV+ and Paramount and have yet to encounter this problem with either one of those.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hg4fwm/apple_tv_app_keeps_logging_me_out/"
    },
    {
        "id": "1hg67sa",
        "author": "ellie04jane",
        "title": "Netflix Work Culture - Experimentation Team",
        "content": "I’m currently working as a Data Analyst in Experimentation and A/B testing. While I’ve enjoyed my work, I’m not entirely happy with my current pay ($120K). For context, I have a master’s degree in Data Science from Tier 1 US University and over 10 years of experience spanning data analysis, software development, and analytics.\n\nI’m considering applying to Netflix, particularly in their Experimentation team, as I’ve heard they offer competitive salaries and challenging work. However, I want to understand more about their work culture, especially from people who’ve worked or currently work there.\n\nI’ve read about Netflix’s emphasis on “freedom and responsibility” and radical candor, which sounds appealing but also potentially intense. I thrive in high-performance environments but would like to avoid a culture similar to Amazon’s (which I’ve heard can be cutthroat and overly demanding).\n\nIf you’ve worked in Netflix’s Experimentation team, could you share:\n\n1. What’s the day-to-day work like?\n2. How’s the work-life balance?\n3. Are teams collaborative or highly competitive?\n4. What are the best and most challenging aspects of the culture?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hg67sa/netflix_work_culture_experimentation_team/"
    },
    {
        "id": "1hg200m",
        "author": "Potential-Plenty7318",
        "title": "[REQUEST] [US] 10 Days Of A Curious Man (2024) - Need help to identify the name of the music/song\n",
        "content": "",
        "upvotes": 1,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/y5iuvgl8zb7e1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1hg200m/request_us_10_days_of_a_curious_man_2024_need/"
    },
    {
        "id": "1hg372q",
        "author": "Sudden_World_8633",
        "title": "Two home family",
        "content": "My family has two homes. We have 3 Netflix profiles on our account. All three accounts are used at both locations at different times. Sometimes we're all in one house, sometimes we split up between the two. \n\nI am totally willing to pay for the extra location but when you do that, they separate the profiles so you can't access all the profiles in each location. I wish there was a way to add a location to your account vs. having to split your account.\n\n",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hg372q/two_home_family/"
    },
    {
        "id": "1hfa77v",
        "author": "lauren22zo",
        "title": "Santa Clarita Diet rewatch",
        "content": "I loved this show when it was on originally and was devastated when they cancelled it. I decided to do a rewatch and it’s just as good as I remember and I want a follow up to the ending so bad! Ending this show prematurely was a huge misstep for Netflix, but this was when they were cancelling everything 😭",
        "upvotes": 72,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hfa77v/santa_clarita_diet_rewatch/"
    },
    {
        "id": "1hfhpat",
        "author": "Remorse_123",
        "title": "Asterix &amp; Obelix: The Big Fight | Official Teaser | Netflix",
        "content": "",
        "upvotes": 15,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hfhpat/asterix_obelix_the_big_fight_official_teaser/"
    },
    {
        "id": "1hf9roo",
        "author": "Sanzio-G",
        "title": "Netflix AI mouth replacement on dubs looks terrible",
        "content": "Has anyone else noticed the weird AI mouth replacements on dubbed content that morphs actor's mouths to match the dubbing? Was trying to kill some time watching La Palma, and I noticed the actors mouths just seemed to look... wrong. Half the time it tracked with the english spoken word, then sometimes it didn't. When I switched back to Norwegian with subtitles, the actors' mouths and teeth looked VERY different.\n\nAs far as I can tell, there doesn't seem to be an option to turn this \"feature\" off... Netflix, if you're listening, please add the option to remove this cuz it's just extremely off-putting... we already lose a ton of emotion and context with dubs, but at least the physicality of an actor's face would make up for it somewhat. But now... we've even lost those minute facial expressions from actors with this terrible AI replacement feature... please make it an option and not a forced (bug) feature.",
        "upvotes": 36,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1hf9roo/netflix_ai_mouth_replacement_on_dubs_looks/"
    },
    {
        "id": "1hftb16",
        "author": "Significant-Side-222",
        "title": "Reasons for Santa not being real in That Christmas",
        "content": "- Santa is not by any other characters therefore is merely symbolic throughout \n- The note left for Danny to look outside is very similar to the notes Danny receives from his mum throughout the film.\n- As Danny's mum is leaving the room it avoids showing the presents at the bottom of the bed \n-The looks exchanged by Sam and Charlies parents after Santa's has been are very telling\n- The children of the adults who are stranded don't receive proper presents from Santa, this is because Bernie (who is old enough to know Santa isn't real, the writers make it clear she is nearly an adult) has carried out Santa's duties, and knows what each gift is going be used for\n\nI would love to hear about any other aspects that people have picked up on\n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hftb16/reasons_for_santa_not_being_real_in_that_christmas/"
    },
    {
        "id": "1hft57k",
        "author": "betsybotts",
        "title": "Is Netflix down for anyone?",
        "content": "I’m trying to login to Netflix on my Xfinity Stream device and all I’m getting is a black screen of nothing. No other network issues &amp; other apps are functioning without issue. \n\nLocated in Massachusetts, USA",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hft57k/is_netflix_down_for_anyone/"
    },
    {
        "id": "1hfsefd",
        "author": "ModerateOsprey",
        "title": "No subtitles in English movies/TV",
        "content": "Netflix is terrible for this. I am watching Terminator: Dark Fate. I am in 10 minutes into the film and everyone has been speaking spanish. No subtitles.\n\nI could turn subtitles on, but then I have to see english subtitles for the english speaking parts. \n\nEvery other streaming service can manage this, but not Netflix it seems.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hfsefd/no_subtitles_in_english_moviestv/"
    },
    {
        "id": "1hflo1y",
        "author": "Rtccalvin",
        "title": "4K HDR doesn't work on Safari on macOS (14\" MacBook Pro M4)",
        "content": "Hi all. I recently purchased a 14\" MacBook Pro M4 and I'm testing out the capabilities of the built-in screen.   \n  \nThe display looks wonderful with 4K HDR content on YouTube on Chrome and has no playback issues.\n\nI opened Safari just to test Netflix because apparently it's the only browser that supports 4K HDR playback on that site.\n\nI've encountered a couple of serious and annoying issues.\n\n1. The player defaults to 1920x1080 and needs a bit of \"scrubbing\" for the 3840x2160 resolution to kick in.\n\n2. HDR seems to be completely broken. At first glance, it doesn't seem to work at all even though the debug window says it is working (tested with Arcane and One Piece live action). By sheer luck I managed to observe that in some very specific cases (credits and pictures) the static video content weirdly renders correctly in HDR.\n\ne.g. HDR works here: [https://www.netflix.com/title/81014625](https://www.netflix.com/title/81014625)\n\nAny idea how to fix this?\n\nFYI I have a Premium (sky) subscription and I live in Italy if this info helps at all.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hflo1y/4k_hdr_doesnt_work_on_safari_on_macos_14_macbook/"
    },
    {
        "id": "1hg235b",
        "author": "Fake_Nz",
        "title": "Is there another way to watch Netflix in TVs older than 2015?",
        "content": "So, I know that Netflix won't support anymore its app on TVs from before 2015, but I wanted to ask if there are any options to install it. I’m aware you can use an Xbox One, but I don’t have one. I was thinking, like Android phones do, that maybe I could install an APK from a PC to the TV. But I’m not sure if that’s possible.\n\nI’d appreciate it if you could let me know if it is possible and how to do it. (Just in case, it’s a Samsung TV, not an Android TV.)",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hg235b/is_there_another_way_to_watch_netflix_in_tvs/"
    },
    {
        "id": "1hfpdbg",
        "author": "killwish_",
        "title": "What do you think about \"the blacklist\"",
        "content": "Okay so i started watching blacklist and i finished Frist 3 episodes of season 1 i wanna definitely continue watching it it's interesting thrilling and it's like an anthology series so i like it !\nBut before i continue watching it i wanna ask you how is it.   is it as good as Frist 3 episodes or it gets boring as the episode continues?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hfpdbg/what_do_you_think_about_the_blacklist/"
    },
    {
        "id": "1hfvrzg",
        "author": "CaptainWaggett",
        "title": "MOSUL - watch again in light of Syria",
        "content": "Mosul is the best Netflix original I've ever seen. Just watched it for the third time in light of what is happening in Syria. If you only semi-remember the struggle against ISIS, or don't know much about it, watch this. All in Arabic. Stellar cast. Then look shit up on Wikipedia. It works as an action movie so you won't be bored. But you will learn a lot.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hfvrzg/mosul_watch_again_in_light_of_syria/"
    },
    {
        "id": "1hf4a46",
        "author": "Gullible-Arm2702",
        "title": "what is your favorite show on netflix? ",
        "content": "hi everyone! i am looking for something to watch right now. i would love any recommendations you have. some shows i love: outer banks, grey’s anatomy, gilmore girls, summer i turned pretty. i would love similar recommendations. thank you in advance!!!",
        "upvotes": 26,
        "comments": 101,
        "media": null,
        "permalink": "/r/netflix/comments/1hf4a46/what_is_your_favorite_show_on_netflix/"
    },
    {
        "id": "1hezcl7",
        "author": "peachykeencandy",
        "title": "“Subservience” mom Maggie, was also Emma in “The Hand That Rocks The Cradle” Discussion",
        "content": "I don’t know if anyone noticed this, but I just found it ironic that she's playing the mother in a film that has a similar story line in a different format, to a film she starred in as a child.\n",
        "upvotes": 49,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hezcl7/subservience_mom_maggie_was_also_emma_in_the_hand/"
    },
    {
        "id": "1hfwiz1",
        "author": "Proeliator2001",
        "title": "Netflix, please please please copy Apple TV's subtitle handling",
        "content": "I have ended up not watching quite a number of shows and films on Netflix where they have more than one language but only bother to include translated text as part of the audio description subtitles. I can't get past the (to me) incredibly distracting text lined of, for example, \"a door slams shut\" that is constantly on screen when I only need a few lines of text to translate foreign dialogue.  \n\nApple handle this very elegantly by having an option for subtitles only for foreign language dialogue (and it uses the main chosen dialogue for the app to be default and all other languages to be classed as foreign and thus get shown on screen). It's the work of a couple hours to code in subtitle tracks like this so please adopt it - and it really is minor work as Netflix carries subtitles for a ton of languages so it should be easy to strip out the relevant parts into standalone foreign dialogue tracks(*)\n\nAlso, I only just noticed this week in the apple TV app, you can select subtitles to appear in your own language then you rewind between 10 and 30 seconds. So that garbled line you missed? Easy, rewind to try and listen again AND have it come up as subtitles. It's such a great feature given how so many modern programmes have very low dialogue levels (I already use dialogue boost on my app but that still doesn't help sometimes).\n\n(* - I've seen people say before on this subject \"What's so hard about having subtitles on all the time\" or \"why don't you just put subtitles on when the foreign language bits come on?\". I'm amazed at what a shit level of service they have come to expect to think like that. These programmes have cost significant money to make, to obtain the rights to, to stream, yet Netflix can't be arsed to spend a day or two creating foreign language subtitle tracks that will benefit thousands to millions of streamers. It's not a free service so why shouldn't they do it?  I watch the programmes to be entertained, to lose myself in for an hour or 2. Every time I have to rewind to turn subtitles on the immersion is broken. It's an easy fix to an annoying issue. It's not just Netflix but they are easily the worst offenders for this).",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hfwiz1/netflix_please_please_please_copy_apple_tvs/"
    },
    {
        "id": "1hftdx4",
        "author": "MatttheBatPodcast",
        "title": "Carry On - Movie Review",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hftdx4/carry_on_movie_review/"
    },
    {
        "id": "1hfsee8",
        "author": "TheArabSamurai",
        "title": "Netflix Profile Targeted After Travelling",
        "content": "Hi all, let me explain the situation I'm currently facing. I had recently traveled on holiday for a few days and used Netflix while traveling. Upon returning to my home country, after a day or so, my continued watching tab just disappeared. When I search for the shows I am watching, they do not appear. I have logged out and back in again, but the issue persists.\n\nI have changed browsers, same problem. I restarted my computer, same problem. I restarted my router, same problem.\n\nI contacted Netflix support, they said it could be due to using a proxy (which I wasn't and never have while using Netflix)&gt; I told them that wasn't the case and I was travelling. They said that I can't use Netflix while traveling (funny response, I've used Netflix while travelling for YEARS, and never had an issue).\n\nWhen I switch to a different profile on the account, everything is fine, and the shows that I couldn't search on a different profile appear! I had told Netflix Support that it seems like Netflix is targeting my profile in the account /specifically/, and I have no clue why.\n\nThey had told me to contact my ISP to reset my IP address. I did that, the issue did not resolve. We have multiple networks at home, I've connected to all of them and STILL nothing solved the issue.\n\nFunnily enough, whenever I connect my laptop to roaming data, everything functions fine. Is my profile just a lost cause? I don't wanna start a new profile from scratch again and lose all the progress I have on the shows I've watched. I like the way my Netflix homepage has curated my account. I really don't want to lose that.\n\nDoes anyone have any guidance/faced a similar issue before?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hfsee8/netflix_profile_targeted_after_travelling/"
    },
    {
        "id": "1hfi55m",
        "author": "WorriedAd870",
        "title": "Squid Game Video Game to Be Offered For Free for a Limited Time",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hfi55m/squid_game_video_game_to_be_offered_for_free_for/"
    },
    {
        "id": "1hfxjre",
        "author": "qputoo",
        "title": "Seriously???",
        "content": "So I was planning on watching a show at my grandparents house, and I just decided to cast to their TV, when I realized that you can’t cast anymore without paying for a Ad Free subscription…\nI just wanna know how desperate these corporations are becoming?? I’m seriously considering canceling my subscriptions to these streaming platforms because I’m seriously becoming annoyed with how much of a scam this is becoming.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hfxjre/seriously/"
    },
    {
        "id": "1hfoiny",
        "author": "Katpaingg",
        "title": "Im going crazy. I hate the quality on PC so much. Please anyone help",
        "content": "I have messaged netflix support on this too, unfortunatly it did not help.\n\nThe quality on watching a movie or show on computer is insanely bad.   \nQuality on TV, phone works great, except on PC. I dont understand why? [fast.com](http://fast.com) says i have 960mbps internet. My PC is up-to-date and high spec. There should be no reason for it to be 480p(ish) \n\nYoutube allows me to play 4k video with no problems, why is it only netflix. Stupid company",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hfoiny/im_going_crazy_i_hate_the_quality_on_pc_so_much/"
    },
    {
        "id": "1hffl9t",
        "author": "EthanWilliams_TG",
        "title": "Netflix Streams 2018 Captain Tsubasa Anime",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hffl9t/netflix_streams_2018_captain_tsubasa_anime/"
    },
    {
        "id": "1hfmwae",
        "author": "gruffnutz",
        "title": "Wild idea for Netflix - less series, more movies!",
        "content": "OK, I know this kinda goes against what Netflix does these days, kinda. But with all the series they've cancelled recently (Kaos, MindHunter, Sense8, the OA, Luke Cage etc etc etc) they should just focus on making these high concept ideas into feature length movies - the way entertainment used to be. Then... If it went well, make a sequel!   \n  \nAnyone from Netflix read this sub? Cos this seems like the obvious fix to me...",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1hfmwae/wild_idea_for_netflix_less_series_more_movies/"
    }
]