[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p2nbaj",
        "author": "RiseDelicious3556",
        "title": "This Is Going To Hurt",
        "content": "Ben Wishaw is excellent in this series. I hope it gets renewed by Netflix. This is the first medical  series that is somewhat realistic while also portraying good drama/comedy.   It's British, so it involves an NHS hospital setting background, but nonetheless realistic from my perspective as a former healthcare provider. Excellent acting, good story line. Bravo, netflix. \n\nNow if I could just find a good thriller series that doesn't jump the shark ",
        "upvotes": 14,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p2nbaj/this_is_going_to_hurt/"
    },
    {
        "id": "1p1suvv",
        "author": "chunkybonks",
        "title": "The Beast in Me - Matthew Rhys is perfection",
        "content": "I have been a huge fan of Matthew Rhys for years. Hello Brothers and Sisters and The Americans. He usually plays the good guy. What a departure this role was. His facial expressions alone are so telling. He definitely pulled off the suave sociopathic part hands down. \n\nNow Claire Danes was something else. I kept wishing she would have reined her face in at least 50%. It was just too much. Too much quivering. Too much warbling. Get it together woman. \n\nBrittany Snow is in everything these days. \n\nThis was one of the best Netflix original series in awhile. They’ve been pumping out a lot of junk lately. I was genuinely excited to hit play on the next episode and see how this all ended up. ",
        "upvotes": 482,
        "comments": 154,
        "media": null,
        "permalink": "/r/netflix/comments/1p1suvv/the_beast_in_me_matthew_rhys_is_perfection/"
    },
    {
        "id": "1p2rvzy",
        "author": "Plane-Web-7158",
        "title": "Recommendations for tv-14 shows on Netflix?",
        "content": "I love any shows that are from the early 2000s. I watched Gilmore girls, Gossip Girl, Ginny and Goergia, How I Met Your Mother, Greys Anatomy, Brooklyn 99, xoxo kitty and I'm probably missing a few but I'll edit it if I remember. I don't like k-dramas. I'm not a big fan of Netflix shows (ex: Never have I Ever, xoxo kitty) but if it's really good then I might give it a try!",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p2rvzy/recommendations_for_tv14_shows_on_netflix/"
    },
    {
        "id": "1p2oiri",
        "author": "LankyCheck9603",
        "title": "Shows and movies similar to Orphan Black or any thriller/mystery/sci-fi Thanks !",
        "content": "Just finished the entire series of Orphan Black and need some recs please and thanks! I like psychological thrillers , mysteries and suspense and shows and movies with plot twists ..... help me out y'all !!! Thank you !!!! ",
        "upvotes": 6,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1p2oiri/shows_and_movies_similar_to_orphan_black_or_any/"
    },
    {
        "id": "1p2n4pm",
        "author": "Particular_Cow_9302",
        "title": "Don’t Look Up",
        "content": "One thing that isn’t talked about enough is Jennifer Lawrence’s and Leonardo DiCaprio’s chemistry in Don’t  Look Up. \n\nWhat was so great about it is their team dynamic. For example, Mindy allowed named the asteroid after her, Dibiask, and she always followed his lead in meetings. Then,  they share a mutual care for each other even when she’s erratic and he’s being a sleaze with the whole affair. I feel they conveyed a real “bud” relationship. I hope one day they can work together again. ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p2n4pm/dont_look_up/"
    },
    {
        "id": "1p2h5mj",
        "author": "Original2021",
        "title": "The Beast in Me has near perfect casting",
        "content": "Thiis how you cast a drama series! I’ve been a fan of Claire Danes since Homeland and Matthew Rhys since the Americans. They both carried the series for all episodes. I’m hoping Homeland comes back in some form as well.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p2h5mj/the_beast_in_me_has_near_perfect_casting/"
    },
    {
        "id": "1p1w5jd",
        "author": "TwlightPrincess",
        "title": "Looking for something not depressing to watch on Netflix",
        "content": "Any suggestions for something to watch that is not depressing on Netflix? Could be a show or movie. I’m depressed so I need to find something interesting, possibly funny just not depressing please",
        "upvotes": 69,
        "comments": 224,
        "media": null,
        "permalink": "/r/netflix/comments/1p1w5jd/looking_for_something_not_depressing_to_watch_on/"
    },
    {
        "id": "1p1uzt4",
        "author": "CheesecakeExotic5713",
        "title": "The beast in me",
        "content": "I finished the whole season in my 8 hour overnight shift 😭 i was so into it and honestly i kept flip flopping between Nile being guilty or not. I also keep seeing a lot of Aggie hate but i thought the role was played very well and i would also be freaking out is a presumed murderer brought me out to his “running path”",
        "upvotes": 75,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1p1uzt4/the_beast_in_me/"
    },
    {
        "id": "1p250yu",
        "author": "SisterPERIOD",
        "title": "TV isn't apart of the household?? We're in the same house",
        "content": "For the past two days, when I try to watch it says my TV isn't apart of the household. It's my mom's account but I live with her?? \n\nI looked it up and all I got was you have to live together and be on the same wifi. We do have two wifi boxes but I've tried connected to both and still nothing. \n\nAlso, it's just us. Only three TVs are logged into the account. Idk what plan we have but it was literally just fine so?\n\nI just wanna watch demon slayer bro 😭😭",
        "upvotes": 12,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1p250yu/tv_isnt_apart_of_the_household_were_in_the_same/"
    },
    {
        "id": "1p1w1bd",
        "author": "Mustard-cutt-r",
        "title": "Carman Family Deaths",
        "content": "This documentary that has it all: money, murder and autism! Did he do it? He’s definitely Autistic as all get out, but that doesn’t make him psycho- but it doesn’t make him not psycho either. If he needed to be on meds and he wasn’t on them, especially with so much childhood trauma, I could see him cracking. And from what I understand, physical oceanography and the study of currents is not “junk science” and has led to many rescues and sunken boats for a long time now. I feel his defense was reaching pretty hard to bring in one random navy seal to counter a bulk of the marine scientist’s claims. ",
        "upvotes": 30,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1p1w1bd/carman_family_deaths/"
    },
    {
        "id": "1p28i4p",
        "author": "fvcklight",
        "title": "who would have ended up with who? THE SOCIETY",
        "content": "\nugh. i just rewatched this show and im so dissappointed in netflix. like come on atleast give us a proper ending man :(\n\nanyway i was thinking about it and lowk i feel like im kinda dissappointed in the allie/will dynamic. like i get she liked him but him liking her out of nowhere is js like weird. i mean personally i wouldn't wanna be with someone who slept with a girl he's liked for a long time and automatically like me out of nowhere. \n\ni personally think allie and harry were a much better fit. trust me ik harry's problematic, but when they were playing fugitives he was really worried about allie and i lowk think they would be a very good couple. solid endgame couple. i think they balance each other out in the best way possible.\n\nsam and grizz. omg i love them. honestly wish they had more screen time as a couple. i love them sm. they are the cutest. definately endgame couple. also, helena and luke. i love them too. i wish we got to see their wedding :(\n\nnext one is js my personal opinion (very unpopular or popular idk) i was watching ep 9 and the conversarion between gordie and kelly had some vibes? idk i feel like they'd be a great couple or friends who knows? i wish we got more of that dynamic. but if i wanted kelly to end up with someone it would probably be gordie, i really like their dynamic.\n\nwhat do you guys think? who would have ended up with who?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p28i4p/who_would_have_ended_up_with_who_the_society/"
    },
    {
        "id": "1p29v2y",
        "author": "Adventurous_Bus_3783",
        "title": "I’m the director of the new Albanian feature film Vlog#13 (now on VOD). AMA + free screener for anyone who wants to review it!",
        "content": "Hey everyone!\n\nI’m an indie filmmaker from Albania, and my new feature film **Vlog#13** just released on VOD after premiering in Albanian cinemas on September 17th.\n\nI’m reaching out to this community because I’d love to hear **thoughts, reactions, and reviews from international film lovers**. The film is in Albanian (which might be unusual for many viewers here), but it comes fully translated and subtitled in English. I’m very curious how the movie plays for foreign audiences and how it compares to other indie films from around the world.\n\n**If anyone would like to watch it, I’m giving away free screener links.**  \nJust comment or DM me — all I ask is that you share your honest feedback after viewing.\n\nA little about the project:\n\n**The Film:** *Vlog#13* follows a travel vlogger who heads into the wild nature and deep caves of Përmet, in southern Albania. What starts as an adventure gradually turns into something much darker. The movie blends raw natural environments with a tense, intimate style.\n\n**Production:** We shot everything on real locations — forests, rivers, mountains, and underground cave systems — with a very small team and zero sets. It was demanding, unpredictable, and one of the most challenging creative experiences of my career.\n\n**Ask Me Anything:**  \nI’m open to any questions about:\n\n* Independent filmmaking\n* Shooting in difficult natural environments\n* Working full-time as an indie director/producer\n* International distribution and VOD release\n* The story and process behind *Vlog#13*\n* Cinema in Albania\n* Anything else you’re curious about!\n\nThanks for having me, and I’m excited to share the film with anyone interested!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p29v2y/im_the_director_of_the_new_albanian_feature_film/"
    },
    {
        "id": "1p2qbef",
        "author": "No-Honeydew112",
        "title": "Why is Netflix removing shows early?",
        "content": "There’s several movies on Netflix that were supposed to go away on November 21st or November 30th but when I tried to find the movies I wanted to watch were gone (it’s only November 20th and one of the series I was in the middle of was gone on November 19th). Why are the movies disappearing before they say they were supposed to disappear? (Examples being John wick 1-3 and starsky and hutch)",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p2qbef/why_is_netflix_removing_shows_early/"
    },
    {
        "id": "1p2ikjf",
        "author": "TTVCarlosSpicyWinner",
        "title": "Picture Tearing / Motion Blur",
        "content": "Title basically. I have a brand new Google TV with fiber 1 gig internet. Every app (even Pluto) works fine. The Netflix app has vertical tearing and anytime the camera or people move the picture is blurry. I have already gone into the account in the able browser and maxed out the playback quality, I cleared the cache, closed the application, and opened it again. I went into the tv settings and tried every single quality and motion setting. Nothing improves it. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p2ikjf/picture_tearing_motion_blur/"
    },
    {
        "id": "1p2nji3",
        "author": "[deleted]",
        "title": "Just bored at work... Any recommendations of good shows to watch",
        "content": "Just looking for some good shows or movies to watch while at work. Enjoy comedy action mystery. I have already seen the Frankenstein movie which was actually pretty good. I started to watch Wednesday season 2 but I couldn't get into it. ",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1p2nji3/just_bored_at_work_any_recommendations_of_good/"
    },
    {
        "id": "1p2i5hx",
        "author": "Serious-Drummer-2071",
        "title": "The Beast in Me - Final Interview",
        "content": "What do you think about the ending of that prison interview? Was Aggie admitting she’s also a psychopath? Her whole demeanor changes when she asks Niles to tell her what it feels like. Can’t decide if I’m just over thinking or if there was any meaning behind it. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p2i5hx/the_beast_in_me_final_interview/"
    },
    {
        "id": "1p2i4pj",
        "author": "ThighGapAF",
        "title": "No Grey's Anatomy except on app?",
        "content": "As of yesterday, I can only access Grey's Anatomy on the Netflix app. Not appearing on \"my list\" on fire TV and nothing when I search for it by title.  Anyone have a guess as to why?? \n\nHow am I supposed to turn my brain off after work now?!?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p2i4pj/no_greys_anatomy_except_on_app/"
    },
    {
        "id": "1p2e7ra",
        "author": "atariimae",
        "title": "s1 ep18 the wood cut?",
        "content": "im watching victorious on netflix and im on ep18, and the whole dialogue scene with trina and robbie where they're being told that they have to run the food truck since they pulled festus out of the truck on accident got cut out? the subtitles were still there, but not the scene, it just cut from tori answering her phone call w her aunt sonya directly to people outside of the food truck fighting over the wait. whyd they cut THAT out??\n\nand the freak shit's still on netflix?? i've never seen more feet in my life😭 they removed that scene for no damn reason. and i just checked the kesha episode, and they didn't cut out trina eating that damn pickle so what the hell did they cut that scene for",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p2e7ra/s1_ep18_the_wood_cut/"
    },
    {
        "id": "1p220wy",
        "author": "quitofilms",
        "title": "The Carmen Family Deaths",
        "content": "Interesting, on one hand the police acknowledge his autism diagnosis but on the other hand they skip over it in making their case and make him out to be a criminal mastermind. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p220wy/the_carmen_family_deaths/"
    },
    {
        "id": "1p2b8zu",
        "author": "montegofd3s",
        "title": "Netflix Black Screen \"Flicker\" on LG OLED",
        "content": "I recently bought a LG B5 77\" which has been great, except with Netflix content.  The screen will go black for about a second and then come back.  The sound does not cut out.  \n\nThis seems to be something directly with Netflix, and happens most often when camera angles change.  Sometimes it will go an hour between happening again, and during other parts of the movie/show it can be rapid.  The example linked is it happening rapidly.  I went back to catch it, and it always happens during the same parts/camera angle cuts.\n\nIt's not every show, but with a lot of newer movies it happens.  Does anyone have experience with this or know how to fix it?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p2b8zu/netflix_black_screen_flicker_on_lg_oled/"
    },
    {
        "id": "1p27z2w",
        "author": "Korkova_Zatka",
        "title": "why doesnt changing my resolution preference work??",
        "content": "so i go into profile settings, all that, set the resolution to high, then return back to my show and its fine, 10 seconds later its back in 144p for some reason. help",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p27z2w/why_doesnt_changing_my_resolution_preference_work/"
    },
    {
        "id": "1p25lmn",
        "author": "RioDeIdeas",
        "title": "Frankenstein",
        "content": " 62 millones de vistas en sus primeros 10 días en Netflix!  \r\nGrande Guillermo del TORO!! Frankenstein”  es hermosa 🥰\nMuchas felicidades, que viva el cine! \r\n\r\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p25lmn/frankenstein/"
    },
    {
        "id": "1p1hlnq",
        "author": "Emergency_Air4575",
        "title": "Am I the only one…",
        "content": "Am I seriously the only human left out here crossing my fingers and hoping, praying even, that LOUDERMILK gets a fourth season? Because I’m not ready to let this show go just yet.",
        "upvotes": 30,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1p1hlnq/am_i_the_only_one/"
    },
    {
        "id": "1p248iu",
        "author": "KeysEffect",
        "title": "Verification BS",
        "content": "With all of the internet security issues going on in the world, it's not a good idea to email for verification and FORCE YOUR CUSTOMERS TO CLICK AN EXTERNAL LINK TO GET A TEMPORARY CODE!!!! I don't mind being asked for verification, but doesn't look legit and makes us question if we're getting scammed.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p248iu/verification_bs/"
    },
    {
        "id": "1p1w5z8",
        "author": "MysteriousAd3954",
        "title": "Can’t remember the title of this strange show",
        "content": "I swear about a year or two ago Netflix had this ambiance “show” that was just really strange almost trippy visuals to music and I can’t remember what it was called or if it still exists I swear it was called like “ambiance TV” or something. Any help would be amazing ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p1w5z8/cant_remember_the_title_of_this_strange_show/"
    },
    {
        "id": "1p2b4io",
        "author": "Intelligent_Entry377",
        "title": "What's a super good non boring horror movie to watch..(sleepover..preferably bollywood so that we don't sleep)",
        "content": "Like smth not boringgg so that we won't sleeppp cz we got schl tmrww..should be available in India tho \n\nFiller What's a super good non boring horror movie to watch..(sleepover..preferably bollywood so that we don't sleep)",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p2b4io/whats_a_super_good_non_boring_horror_movie_to/"
    },
    {
        "id": "1p2aks6",
        "author": "wugi007",
        "title": "Are yall excited for this",
        "content": "",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1p2aks6/are_yall_excited_for_this/"
    },
    {
        "id": "1p1hrkr",
        "author": "Playful_Copy_4255",
        "title": "the Beast in Me - props",
        "content": "No spoilers, but super random question- currently on ep 4; anyone know where that blue tea/coffeepot set that Madison’s family has is from? I love it lol ",
        "upvotes": 9,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p1hrkr/the_beast_in_me_props/"
    }
]