[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 504,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 23,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1k26r5x",
        "author": "indiewire",
        "title": "Netflix CEO Ted Sarandos Says That AI Can Make Films 10% Better, Not Just Cheaper",
        "content": "",
        "upvotes": 88,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1k26r5x/netflix_ceo_ted_sarandos_says_that_ai_can_make/"
    },
    {
        "id": "1k2odua",
        "author": "Strawberri-Bliss",
        "title": "Any series/movie recommendations?",
        "content": "I'm looking for something to watch like Fier Street, or Stranger Things. I like not too scary shows, with kind of mystery topics. I dont mind if it gets crazy unrealistic or too realistic.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k2odua/any_seriesmovie_recommendations/"
    },
    {
        "id": "1k2k2pe",
        "author": "MLP_QT",
        "title": "What is this show????",
        "content": "Someone PLEASE help I can’t remember what show this is. It was a house flipping show, I think it was on Netflix but I’m not positive. It’s fairly recent, I’d guess after 2018 and was hosted by a couple. There was an uncomfortable undertone between them and the show was only on for one or two seasons and they got divorced and it was cancelled. Also, the wife’s dad was weirdly involved and grouchy it was weird. The wife’s designs were all very colorful as well. Please help me find it!!!",
        "upvotes": 7,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1k2k2pe/what_is_this_show/"
    },
    {
        "id": "1k2raaz",
        "author": "Pinky_devil1",
        "title": "Help! Trying to Find a Goofy Comedy Netflix Movie (2016-2018)",
        "content": "Hey everyone! I'm on a years-long quest to find a goofy comedy movie I watched on Netflix sometime between 2016 and 2018. The main character was a teenage guy who was always getting into trouble and secretly lived in an unused upstairs room without his parents knowing. I vividly remember a scene where he did something that involved the police, and his younger brother was always helping him out. There was also a scene where he ordered a pizza and had a crush on the delivery girl, and he ended up sitting on the roof while she was there. Does this sound familiar to anyone? I've been trying to remember the title forever!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k2raaz/help_trying_to_find_a_goofy_comedy_netflix_movie/"
    },
    {
        "id": "1k23hmh",
        "author": "TheMirrorUS",
        "title": "Four-time major winner Brooks Koepka and his wife Jena Sims have rejected Netflix series 'like 30 times' due to 'safety'",
        "content": "",
        "upvotes": 56,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k23hmh/fourtime_major_winner_brooks_koepka_and_his_wife/"
    },
    {
        "id": "1k2s5wy",
        "author": "s853772",
        "title": "A show about mice?",
        "content": "I don't remember if it was on Netflix but I saw a show it was four short stock motion films featuring anthropomorphic rats or mice. I only remember two of the four films the first one was about a rat buying a place only to discover it was filled with squatters which I believe were bugs. And the last one was about a mouse building a flying aircraft of some kind in order to escape some type of flooding. If anyone knows what this show is and if it was on Netflix or not please let me know ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k2s5wy/a_show_about_mice/"
    },
    {
        "id": "1k2ribm",
        "author": "HighlyPossible",
        "title": "Just realized UHD contents on Netflix look MILES better on Samsung than on iPhones!",
        "content": "I just jumped ship from iPhone 15 pro max to Samsung s25 ultra. Today I started watching 4k content from Netflix on the s25, and omg! It looks so good! I can't even tell there are pixels! It looks as good as 4k on a 4k monitor! Then I watched the same content on my iPhone, it looks like 720p! Not even 1080p..... But the content title says \"Dolby Vision\" on my iPhone, and \"HDR+\" on my samsung phone. \n\niPhone won't tell me what the max resolution it was playing, but it looks like 720p; samsung tells me it was playing in 1080p in HDR+. \n\nI am 100% sure both phones were on the same wifi, with media quality switched to \"High\".\n\nWhy is that? I even tried it on my iPad Air ( newest gen), still the same thing! Like where have I been all these years paying for the Premium plan for nothing.... (other than the times I watch it in Safari on macbook). ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k2ribm/just_realized_uhd_contents_on_netflix_look_miles/"
    },
    {
        "id": "1k2phxa",
        "author": "darkraven2116",
        "title": "A show advertised on Insta",
        "content": "I was scrolling on instagram about a month or so ago and saw a trailer for a what looked like a new show coming to Netflix. \n\nThe only scene I remember is that there was a girl sitting in the dean’s office talking to the dean about something. I can’t even remember what. But I remember thinking it was interesting and that I’d “definitely remember this for later”. \n\nWell now it’s later and I can’t find this trailer on any Netflix page and have nothing to go on. \n\nHas anyone else seen this or know what I’m talking about? I know it’s a long shot. \n\nThanks!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k2phxa/a_show_advertised_on_insta/"
    },
    {
        "id": "1k2n9i0",
        "author": "SLumpHUmpp13",
        "title": "I’m traveling work around",
        "content": "Hello! I built a small tiny house on my parents property probably 1000 ft away. I’m trying to use my mom’s Netflix off my firestick (with perms) but is there a way I can get around this? I’m not close enough to connect to her WiFi so I can’t restart the traveling thing. Is there a way to get around this?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k2n9i0/im_traveling_work_around/"
    },
    {
        "id": "1k2d5lk",
        "author": "pixelgeekgirl",
        "title": "Account hacked. Data breach on their end? Or is it an hack through my account somehow?",
        "content": "Important info: I use last pass exclusively, I have complex passwords. My last pass has google authenticator on it, and I have a complex password. I have a complex password for both my Netflix and my email account.\n\nI tried to log into my Netflix account this morning and it told me that I didn't have an account associated with my email. Checked my login in last pass and it was the correct email / pass, so I went to my email and found that this morning I had two emails saying my email had been updated and a new payment method was added. Note: these emails have times for only a few minutes ago at that point - like when I was literally trying to log in. Hmm. So, I try to log in again and this time it lets me use my email but says my password is wrong - which means it's changed, because I *know* my password. I go through the change passwords steps which of course goes through my email with a change password link. I get into my account and there's nothing there, no subscription, no profiles, nada. \n\nThus I get on support chat with Netflix, explain the situation, they verify me and ultimately get me my account back. They say that the email had been changed, won't tell me what that was changed to, I can see the new card info that was added, which I removed. I once again change my password.\n\nI asked if they could give me any idea what happened because I need to know how severe of a breach this was on my end and they were very \"we can't tell you anything for security purposes\" no matter how much I told them I feel like I really need to have some sort of idea of what happened. I feel like this could be a their end something that happened - but... I wish I could tell so I know what to do on my end. I guess I can switch it to a different email? ",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1k2d5lk/account_hacked_data_breach_on_their_end_or_is_it/"
    },
    {
        "id": "1k1o962",
        "author": "jayjaytlk",
        "title": "Netflix Earnings: Record Profits And Sales Send Stock To Nearly $1,000",
        "content": "",
        "upvotes": 117,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1k1o962/netflix_earnings_record_profits_and_sales_send/"
    },
    {
        "id": "1k1ejob",
        "author": "emmaemmaemma1",
        "title": "Does anyone else think that the new kid influencing docuseries is disgusting dramatic irony?",
        "content": "Netflix has released a new docuseries, \"Bad Influence\", about a kid who was exploited as a child influencer. Her mom posted her all over the internet as a kid with little / no regard for her safety, and made tons of money off of her.\n\nSo, Netflix are now using this kid's story to - you guessed it - make money off the documentary.\n\nHer full name is in it, her face is in it. I've watched the intro in which someone states \"predators were watching these videos\" AND IT SHOWS, with no censoring, the type of videos that predators would seek out - eg, of her dancing as a minor dressed in not a lot.\n\nThe real kicker is that this kid is STILL A KID. She's still 17. And even if she wasn't, I still feel this is exploitative. This is NOT the way to raise awareness of the dangers of child influencing.\n\nAlso - she's very active on social media and hasn't posted about the documentary, which makes me question whether this was even done with her consent. Imagine the mental toll this kind of thing would take on her. It seems to be an awful privacy violation for a child whose whole life has been a series of awful privacy violations. I hope she gets the help she needs and then sues the shit out of them.\n\nIt feels so disgustingly ironic to me. Gross on Netflix's part.\n\n(EDIT: I did watch an episode to make sure I was along the right lines after I posted this. just want to say I 100% agree with anyone saying that the other kids deserve to tell their stories, especially now they're adults. What an awful, disgusting situation all around. My heart breaks for all these kids. We must have better laws to protect our children from the internet. However, I do believe the publishing of the doc could make things worse for the \"main\" child in question, and I don't believe it was published with her best interests at heart. I'm also uncomfortable with Netflix monetising the situation. Thanks to everyone who's discussed this in the comments.)",
        "upvotes": 364,
        "comments": 111,
        "media": null,
        "permalink": "/r/netflix/comments/1k1ejob/does_anyone_else_think_that_the_new_kid/"
    },
    {
        "id": "1k2f0hg",
        "author": "_Leanaz_",
        "title": "Problem with Chinese font",
        "content": "I'm trying to learn Chinese watching shows with CN subs but the font keeps changing like a chameleon even mid-sentence and it's super distracting. Tweaking the font options doesn't change anything. Has anyone had a similar problem?\n\nhttps://preview.redd.it/jwk1g75nmnve1.png?width=623&amp;format=png&amp;auto=webp&amp;s=60e6a2d67c3a8472975488dd6b6aa04f1711b198\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k2f0hg/problem_with_chinese_font/"
    },
    {
        "id": "1k17l30",
        "author": "TheNobleKiwi",
        "title": "USA productions seem so fake now??!",
        "content": "Anyone else finding the vast majority of American, shows, movies etc just seem really surface level and cliche??? \n\nIt's like the recent political landscape has exposed all of the fake, plasticy, tacky plots, predictable character arcs and repeated formulae. As if the veil has been lifted and exposed the cheap souless centre?  I can't immerse myself anymore I can just see through everything now.\n\nWondering if anyone else is experiencing this or if it's just because we watched Twister and Madam Web. ",
        "upvotes": 250,
        "comments": 156,
        "media": null,
        "permalink": "/r/netflix/comments/1k17l30/usa_productions_seem_so_fake_now/"
    },
    {
        "id": "1k25rlg",
        "author": "Terrible_Vehicle8046",
        "title": "Search up button isn't showing many great titles???",
        "content": "I was watching anime, oshi no ko and bleach yesterday. Now i cant search their  and many other great animes names which iam certain were on Netflix yesterday. Is there a problem with server or did just suddenly removed tons of anime from my region?? Im from Pakistan btw. Kindly help",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k25rlg/search_up_button_isnt_showing_many_great_titles/"
    },
    {
        "id": "1k1z4gj",
        "author": "Yana123723",
        "title": "Why did Tiny Pretty Things had to be cancelled🙁",
        "content": "I go back to that show every single year basically torturing myself bc it was truly a good well paced show that I actually wanted to see the ending to but it was just a cliffhanger and was quietly cancelled 😭",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k1z4gj/why_did_tiny_pretty_things_had_to_be_cancelled/"
    },
    {
        "id": "1k2i355",
        "author": "LappLancer",
        "title": "FFS why is there still no way to disable the spoilers when you pause?",
        "content": "You know what i'm talking about, when you pause, you get insane spoilers from the episode you are watching, including stuff that happens at the end of it. It's hard not to reflexively read a short sentence in the middle of the screen when you tab back to netflix.\n\nI've seen people complain about this r\\*tarded \"feature\" for year and it's still there, and as far as I can tell there's no way to disable it.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k2i355/ffs_why_is_there_still_no_way_to_disable_the/"
    },
    {
        "id": "1k1nrqi",
        "author": "Alan_Stamm",
        "title": "Frank Bruni (NYT columnist) on 'Black Mirror,' briefly",
        "content": "From his weekly New York Times newsletter April 17:\n\n&gt;A new season of the Netflix series \"Black Mirror\" is upon us, and as in all the seasons before it, the quality of its episodes is erratic. Also per usual, different viewers and critics have very different opinions about which ones soar and which don't.  \n  \nSo I may be an outlier in my particular affection for the first episode, \"Common People.\" I like how its plot takes simultaneous swipes at the gig economy, the insidious omnipresence of advertising and — a particular fascination of mine — the relentless micro-tiering of every service in our lives.",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k1nrqi/frank_bruni_nyt_columnist_on_black_mirror_briefly/"
    },
    {
        "id": "1k20b1x",
        "author": "Lord_AIZEN310",
        "title": "Does moonrise end on a cliffhanger?",
        "content": "Saw the trailer. Wit studio does some creative things with their animation.. Really want to know whether the show ends on a cliffhanger or is it a complete story? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k20b1x/does_moonrise_end_on_a_cliffhanger/"
    },
    {
        "id": "1k1vmhi",
        "author": "Striking-Border-3625",
        "title": "Seeing same language subtitles despite them being turned off",
        "content": "So I recently started rewatching Dr. House and the first 7 episodes I didnt have this problem but from one second to the next It started having subtitles. So I went to disable them but saw that it was already disabled. More Info: Im watching it in German and the subtitles were also german so it wasnt like a scene where someone spoke in a foreign language. I also checked other shows like Brooklyn 99 or movies like The Untouchables and both of those did not have this issue. Im using my Computer and havent tested it yet on my PS4. I restarted it and that also didnt help. Anyone knows what the issues is?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1vmhi/seeing_same_language_subtitles_despite_them_being/"
    },
    {
        "id": "1k1c8y9",
        "author": "johnppd",
        "title": "The Sandman: Season 2 | Date Announcement | Netflix | Volume 1 - July 3rd. Volume 2 - July 24th.",
        "content": "",
        "upvotes": 26,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k1c8y9/the_sandman_season_2_date_announcement_netflix/"
    },
    {
        "id": "1k1adij",
        "author": "dailystar_news",
        "title": "New Netflix series sheds new light on Britain's most notorious serial killers Fred and Rose West",
        "content": "",
        "upvotes": 27,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1k1adij/new_netflix_series_sheds_new_light_on_britains/"
    },
    {
        "id": "1k1j6gq",
        "author": "Historical-Phrase106",
        "title": "Ransom Canyon",
        "content": "Just released today… I’m loving it!  They do a great job of character development, it’s as if we’ve known these characters for some time.  Great cast… Josh Duhamel, James Brolin, Minka Kelly and many others.. ",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k1j6gq/ransom_canyon/"
    },
    {
        "id": "1k1x2h4",
        "author": "SunbroSteve",
        "title": "Video suddenly appering to be lower quality",
        "content": "Suddenly video quality on my PC seems to be lower than it used to be, and I haven't changed any settings, and I'm on a wired stable connection with higher than average speeds. Any ideas would be greatly appreciated, I would relaly just like to watch Pantheon and not have it look like crap. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1x2h4/video_suddenly_appering_to_be_lower_quality/"
    },
    {
        "id": "1k1hher",
        "author": "S4v1r1enCh0r4k",
        "title": "Camille Razat won't return for season 5 of Emily in Paris, season 5 production is now underway",
        "content": "",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k1hher/camille_razat_wont_return_for_season_5_of_emily/"
    },
    {
        "id": "1k1tqzq",
        "author": "astraea_str",
        "title": "Not receiving one-time code for completing payment process on a new account",
        "content": "Does anyone know how to fix it? I tried other devices and numbers but still it’s not giving me any one-time code despite having strong signal. I thought it was just a problem with the bank but turns out it was not. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1tqzq/not_receiving_onetime_code_for_completing_payment/"
    },
    {
        "id": "1k1dp9j",
        "author": "Atlast_2091",
        "title": "Ginny &amp; Georgia: Season 3 | Official Teaser | Welcome back to Wellsbury, Peaches! Here’s a peek at season 3 of Ginny &amp; Georgia, coming to Netflix June 5th",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1dp9j/ginny_georgia_season_3_official_teaser_welcome/"
    },
    {
        "id": "1k1zhtl",
        "author": "Free-Toe-3411",
        "title": "Netflix augmente généreusement ses tarifs en France : gare à votre prochaine facture",
        "content": "* Standard avec pub : 7,99 € (+2 €, anciennement 5,99 €)\n* Standard : 14,99 € (+1,5 €, anciennement 13,49 €)\n* Premium : 21,99 € (+2 €, anciennement 19,99 €)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k1zhtl/netflix_augmente_généreusement_ses_tarifs_en/"
    },
    {
        "id": "1k1nyoq",
        "author": "ICantDive",
        "title": "Sound issue",
        "content": "Hello, I just bought a TV. The sound works on all applications except netflix, it becomes delayed compared to the video itself and static sounding, so the mouth moves on characters but the sound comes after. \n\nI’ve tried resetting the TV, I checked my internet &amp; I’ve tried different hdmi outputs, could use some help thanks.\n\nIts a hitachi TV with google add on ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k1nyoq/sound_issue/"
    },
    {
        "id": "1k0wj21",
        "author": "jgonzalez418",
        "title": "Anyone getting repeatedly kicked off of their Netflix for \"not being a part of the same household\" though I'm literally using my home wifi?",
        "content": "Every week or so I'm kicked off of my netflix because \"This device isn't a part of your household\" though I'm quite literally using my home wifi where the account was created and all of the users reside an use the account. Genuinely just considering canceling netflix at this point because this is ridiculous. Quickly became one of the most irritating streaming services to deal with, and customer support hasn't been of any help. I have the option to \"watch temporarily\" but then I need to deal with sending a confirmation email to the account owner, which I am not. Like I said, I'm still a part of the household and watching netflix physically in the same household, using the same wifi that the account owner is using. Is this happening to anyone else?",
        "upvotes": 54,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1k0wj21/anyone_getting_repeatedly_kicked_off_of_their/"
    }
]