[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1ovjlrj",
        "author": "Mindless-Platypus-75",
        "title": "Death by Lightning Thread",
        "content": "",
        "upvotes": 79,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1ovjlrj/death_by_lightning_thread/"
    },
    {
        "id": "1ovfgtu",
        "author": "RiskAndReason",
        "title": "Just watched Netflix’s Frankenstein last night",
        "content": "Didn’t expect it to hit that hard. Beautiful cinematography, haunting score, and a surprisingly human story beneath all the darkness. What did you all think of it? What should I watch after this? ",
        "upvotes": 110,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1ovfgtu/just_watched_netflixs_frankenstein_last_night/"
    },
    {
        "id": "1ov4re6",
        "author": "Optimal_Bet_5243",
        "title": "Best show u ever watched ❤️.",
        "content": "Kindly tell me the best show(s) u have ever watched that u wish u could forget just to watch again with awe, i m looking for some fast paced thriller which ll keep me hooked in every episode.(But all the genres r welcome)",
        "upvotes": 101,
        "comments": 647,
        "media": null,
        "permalink": "/r/netflix/comments/1ov4re6/best_show_u_ever_watched/"
    },
    {
        "id": "1ovubpx",
        "author": "rajaero",
        "title": "Balamullah (2025) is almost a realisation for the viewer 🎯🙏",
        "content": "Finally experienced Bharat’s 🇮🇳 aka India’s Baramulla (2025) … it is a brilliant movie which shall I say blends almost mystically the unfathomable events and thriller genre like never before…\n\nIt stars as a regular investigative thriller genre with shock supernatural drama and unfolds in to almost a realisation for the viewer.\n\nKudos to the honest and inventive attempt of magically Genre blending by the film makers … take a bow 🙇‍♂️🙏\n\nBeing on the most popular OTT streaming platform Netflix in the world shall introduce this shining gem 💎 to millions if not billions to marvel upon its technical brilliance and core subject matter which (based on real bloody historical events unfortunately happened in Bharat 🇮🇳 aka India) rightly deserves to be heard so that such abhorrent acts are not allowed 🚫 to unfold in future of the world 🗺️\n\nSuch movies are given not rating  as its core subject is above those trivial critique things of human intellect.\n\nOnly I can beseech to experience Baramullah in all its entirety… I wish you well in that journey 😊👍\n\nI am not known for unsolicited advice.\n\n\nBelow video is for all critics ! \n\n\n\n[Why critics don’t have statues?](https://youtu.be/oUuXpG4_fZo)\n\nNamaskaram 🙏\n",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ovubpx/balamullah_2025_is_almost_a_realisation_for_the/"
    },
    {
        "id": "1ovnk6f",
        "author": "Financial-Flamingo62",
        "title": "comedy show recommendations",
        "content": "i have rewatched b99 and the good place like 10 times and just finished Girls5eva, and I need some more suggestions of shows like that, whats some other ones i can add that you have enjoyed?",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ovnk6f/comedy_show_recommendations/"
    },
    {
        "id": "1ovvvqf",
        "author": "Competitive_Carob927",
        "title": "What if Netflix invested in VR hardware to simulate the theatrical experience by producing first party hardware or by partnering with third party companies?",
        "content": "A common complaint among movie watchers is that a Netflix release often results in a limited or no theatrical release. What if Netflix were to adopt the Sony model of releasing hardware, like the PS5, at a loss but using their media library and subscription revenue to recoup costs or partner with third party companies to allow for a greater expansion to the VR theatrical experience within the Netflix app? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ovvvqf/what_if_netflix_invested_in_vr_hardware_to/"
    },
    {
        "id": "1ovvorc",
        "author": "headcow0304",
        "title": "Delhi Crime season 3",
        "content": "Where’s Delhi Crime season three? It’s already Nov 13 and it was supposed to drop today, but it’s nowhere to be found on Netflix USA. Is anyone actually able to access it, or is it delayed?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ovvorc/delhi_crime_season_3/"
    },
    {
        "id": "1ovruuc",
        "author": "Jason2648",
        "title": "need some good psychological horror movies",
        "content": "i tried searching for a bunch of directors ive heard of on netflix but nothing really showed up im talkin stuff like hostel,hannibal,possessor,etc\n\n  \npretty much anything disturbing and gory",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ovruuc/need_some_good_psychological_horror_movies/"
    },
    {
        "id": "1ovv6vk",
        "author": "Kingspreez",
        "title": "I recently saw a poll about \"Best Netflix show\" and many people kept talking about Dark. I checked and it has 3 seasons. So my main question is: Has it been concluded or axed/rushed? Because for a show that is praised to be on Netflix and has only 3 season makes me feel like it got axed/canceled.",
        "content": "I don't know, Netflix always gave me the feeling that either good shows get cancelled after 1 season or that the show is so good it keeps milking it until it becomes an empty vessel compared to its previous self. \n\n  \nSo does Dark has a complete and fulfilling story or does it feel like it got axed and rushed conclusion? \n\n  \nThanks ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ovv6vk/i_recently_saw_a_poll_about_best_netflix_show_and/"
    },
    {
        "id": "1ovouqc",
        "author": "WhatKindaDay",
        "title": "A Way to Auto Play All Intros OR Make Button Quickly Leave?",
        "content": "Currently rewatching Stranger Things from the beginning before the S5 release. But \\*every single episode\\* the Skip Intro button pops up and interrupts the theme music. The theme is part of the ambiance! \n\n\n\nThe button sits there, decidedly \\*not\\* in keeping with the aesthetic and vibe, and I can't figure out how to make it either never show up. Or \\*at least\\* what button to click so I can say, \"yes for the love of god, let me watch this intro for this episode.\" The distraction every 50 minutes is driving me bonkers.\n\n  \nI'm happy for any advice, and if it helps, I'm watching via a Roku device. Thanks y'all.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ovouqc/a_way_to_auto_play_all_intros_or_make_button/"
    },
    {
        "id": "1ovqq9h",
        "author": "a_fan_i_am",
        "title": "The One vs. Soulmates",
        "content": "The show “Soulmates” absolutely copied “The One”! Have others talked about this or noticed it? I loved “The One” and was very sad that it was not renewed for another season. How do you all think the “Soulmates” compared to “The One” and why do you think The One wasn’t renewed for Season 2? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ovqq9h/the_one_vs_soulmates/"
    },
    {
        "id": "1ov8c5j",
        "author": "layinlow-playinslow",
        "title": "I need new tv shows to binge",
        "content": "Please tell me atleast 1 or 2 shows I can binge , I'm into crime drama , italian mob shows like sopranos, gangster tvs shows and horror if anybody has anything good lmk!",
        "upvotes": 9,
        "comments": 106,
        "media": null,
        "permalink": "/r/netflix/comments/1ov8c5j/i_need_new_tv_shows_to_binge/"
    },
    {
        "id": "1oulle8",
        "author": "Interesting_Lab5792",
        "title": "Netflix Might Finally Be Forced To Put Its Movies In Theaters",
        "content": "",
        "upvotes": 252,
        "comments": 139,
        "media": null,
        "permalink": "/r/netflix/comments/1oulle8/netflix_might_finally_be_forced_to_put_its_movies/"
    },
    {
        "id": "1oven6e",
        "author": "AliveAd8736",
        "title": "[Spoilers] I feel like Elordi’s Frankenstein would have an easier time blending into society than all of the other versions",
        "content": "At the end of the most recent movie, it is implied that the creature is immortal. Hypothetically, if he survived into the current era, I feel like he could walk around in public without much more than a few quick glances from people trying to get a better look at him without looking like they’re starring. Nowadays, people are a lot more conscious of not appearing rude, especially in public, and are generally a lot more accepting of people who look different. Let’s say Jacob Elordi’s creature went walking down the street in somewhere like Town Square. As long as he was dressed relatively normally and had his hair grown out, most people would probably assume he had gigantism and some scars from a really bad plastic surgeon.\n\n",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1oven6e/spoilers_i_feel_like_elordis_frankenstein_would/"
    },
    {
        "id": "1ovlsv7",
        "author": "Ok-Scale-6575",
        "title": "Fave stuff to watch with your kids (late elementary/middle school age)?",
        "content": "Anyone got any good recommendations for fun movies and series to enjoy with your kids, thank you! Need new ideas, feel like we’ve seen it all and why am I still paying for this?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ovlsv7/fave_stuff_to_watch_with_your_kids_late/"
    },
    {
        "id": "1ovs2xw",
        "author": "Spiritual_Check_2461",
        "title": "Does Netflix pay shows to be on their platform, or do shows pay Netflix to be on their platform?",
        "content": "Does Netflix pay shows to be on their streaming platform to attract subscribers? Or do shows pay Netflix so that they can get advertising via the streaming platform?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ovs2xw/does_netflix_pay_shows_to_be_on_their_platform_or/"
    },
    {
        "id": "1ovcsqh",
        "author": "dave48706",
        "title": "Are there differing \"with ads\" subscriptions?",
        "content": "* Some Verizon customers can add Netflix w/ads for $10 (but not all customers)\n* Some Directv customers can add Netflix w/ads for $7.99  (again, not all customers can).\n* Everyone can get Netflix w/ads for $7.99.\n\nIf all \"with ads\" subscriptions are the same, why not do it separately??  Am I missing something?  At the moment, I'm only interested int he with ads options.  ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ovcsqh/are_there_differing_with_ads_subscriptions/"
    },
    {
        "id": "1ov3jb0",
        "author": "niketax_",
        "title": "Frankenstein (2025): Conversation between God and Human",
        "content": "Before anything else, it is a complete feast for the eyes and the soul. The cinematography, costumes, locations, atmosphere, and characters were grotesquely beautiful. In the words of Kant — beauty moves us deeply without desire or obsession. That’s exactly what I felt after watching this fantasy film.\n\nI’m not qualified to assess the actors’ performances, because they were simply magnificent and magical. It’s pure Guillermo del Toro — his signature way of storytelling and visual poetry.\n\nHowever, what truly jolted me was the conversation between Victor the human and Victor the creature. It felt like a juxtaposition of God speaking with man. The arguments, the rejection, and the final acceptance without humiliation reflect the entire lifespan of the relationship between God and humankind.\n\nIt all ends, fittingly, with Nietzsche’s words — “God is dead.”\n",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ov3jb0/frankenstein_2025_conversation_between_god_and/"
    },
    {
        "id": "1ovnax7",
        "author": "Peace_negotiator25",
        "title": "Am I the only one who confuses these 2 actors?",
        "content": "So shea Whigham and steve Zahn it was today where I found out shea ehigham isn’t steve zahn . I was watching death my lightning and I always thought shea played frank Heffley it was until I was looking at his movies that I found out he didn’t play frank Heffley and it was steve zahn . Also is it me or does shea whigham play in a lot of historical shows? I’ve seen him in like 4 historical shows lol ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ovnax7/am_i_the_only_one_who_confuses_these_2_actors/"
    },
    {
        "id": "1oui0dv",
        "author": "GlasgowRose2022",
        "title": "The Perfect Neighbor - Susan Lorincz sues AJ’s family",
        "content": "Because of course she has to torture this poor family even more…\n\nhttps://thetab.com/2025/11/11/susan-lorincz-threatens-to-sue-ajike-owens-children-and-family-in-shocking-handwritten-letter",
        "upvotes": 50,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1oui0dv/the_perfect_neighbor_susan_lorincz_sues_ajs_family/"
    },
    {
        "id": "1ov8alw",
        "author": "Qu4ckAttack",
        "title": "Netflix subs jumping about top and bottom.",
        "content": "I get why they move subs up and down position if the screen is darker or lighter, but why can't they keep them at the bottom of the screen and just change the colour of text instead for readability. I feel like I'm constantly chasing subs around a screen, especially if in PT or ES that can speak quickly and you miss the EN text. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ov8alw/netflix_subs_jumping_about_top_and_bottom/"
    },
    {
        "id": "1ovdsg0",
        "author": "Ok-Bee219",
        "title": "Wednesday s2 all time top 10 not right.",
        "content": "When you look at the Netflix all time top 10 l, Wednesday is at 4 with less than 120 million streams. But if you look back and add up all the numbers, it’s actually supposed to be the second most watched and I was waiting for it to be like updated but it’s been a week since their 91 days has ended so will they update it soon or are they just gonna leave it there cause it should have over 162 million.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ovdsg0/wednesday_s2_all_time_top_10_not_right/"
    },
    {
        "id": "1ov6705",
        "author": "ashleycat720",
        "title": "Does netflix increase ad frequency/ duration after first month?",
        "content": "I purchased netflix ad plan last month to watch Wednesday. I have not had netflix in years. I didnt think the ads were too bad but now that its the second month of netflix, im getting commercials more frequently, some breaks its 1.5 minutes. A 40 minute show will have 4 commerical breaks. It doesnt seem worth it; there are free steaming channels with commericals. Did you notice an increase in commericals? ",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ov6705/does_netflix_increase_ad_frequency_duration_after/"
    },
    {
        "id": "1ouz8gm",
        "author": "CM-Edge",
        "title": "New WWE content from this week on 720p only?",
        "content": "I noticed with Monday Night Raw yesterday and now with NXT on Netflix, that both shows only go up to 720p and not higher under any circumstances. However, if I just put on any episode from last week or older it's immediately 1080p.\n\nWhat's going on? Anyone noticed that?\n\n[https://a.l3n.co/fAQwg9.jpg](https://a.l3n.co/fAQwg9.jpg)  \n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ouz8gm/new_wwe_content_from_this_week_on_720p_only/"
    },
    {
        "id": "1ov2eav",
        "author": "bottlecoco",
        "title": "Suggest me some informative shows on Netflix",
        "content": "Hey guys,\nI’m looking for some informative shows or docuseries on Netflix — something I can actually learn from.\nIt could be about space, psychology, history, science, or anything interesting and educational.\nBasically, I don’t want fiction right now — only stuff that teaches or expands knowledge.\n\nWhat are your best recommendations?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ov2eav/suggest_me_some_informative_shows_on_netflix/"
    },
    {
        "id": "1ov16a1",
        "author": "dumerthanaglobe",
        "title": "Where to buy physical FYC dvds",
        "content": "So I’m wondering if Netflix still releases some shows on dvd and I’m reading that target was the place to get them but since target no longer sells dvds, where would I go to get new fyc copies? Thanks. ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ov16a1/where_to_buy_physical_fyc_dvds/"
    },
    {
        "id": "1ovlfs2",
        "author": "astral004",
        "title": "Release all Stranger Things episodes at the same time!",
        "content": "Can we get Netflix to release all episodes of ST on the same day or we basically cancel our subscriptions like people did with Disney? We’ve seen that this works. Let’s put the power back in the hands of the consumer!",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ovlfs2/release_all_stranger_things_episodes_at_the_same/"
    },
    {
        "id": "1ounfnf",
        "author": "Imblurryfaced",
        "title": "The Diplomat plot hole",
        "content": "I'm watching episode 6 of S3, and I can't get over the plot hole. I binged from s1e1 to s3e2 within like 2-3 days. I loved the show! S3 wasn't feeling too good, and now it's unwatchable \n\nIn what world would Roylin tell Lenkov about the American involvement? Hal and Kate would be the only 2 people she would've ever told, that too because they threatened to turn her in to the police. Even the other British MPs in on the attack wouldn't know about it. If anything, members of Lenkov's group could know about British involvement, and a leak about that would make sense. I can't get past this, and I don't even want to watch the rest of the episodes anymore",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ounfnf/the_diplomat_plot_hole/"
    }
]