[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 490,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i4djim",
        "author": "Zeroyhme",
        "title": "Squid Game: Season 1 vs Season 2 Comparisons",
        "content": "",
        "upvotes": 817,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1i4djim/squid_game_season_1_vs_season_2_comparisons/"
    },
    {
        "id": "1i4poc6",
        "author": "Wildflowers4me",
        "title": " So annoying ",
        "content": "Does anyone else think it’s annoying of Netflix that if you’re in the cheaper plan that watches comercials, they also block you from watching content like some of the newer movies? Isn’t it enough that we watch comercials? ",
        "upvotes": 27,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1i4poc6/so_annoying/"
    },
    {
        "id": "1i52odk",
        "author": "Andoppy18",
        "title": "Streaming Wars: The Advertisements Strike Back!",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i52odk/streaming_wars_the_advertisements_strike_back/"
    },
    {
        "id": "1i40qdy",
        "author": "No_Order3035",
        "title": "Squid game in India! ",
        "content": "",
        "upvotes": 578,
        "comments": 25,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/cvmk5oarvode1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1i40qdy/squid_game_in_india/"
    },
    {
        "id": "1i4fypb",
        "author": "Celebril63",
        "title": "Younger has become our new \"guilty pleasure\"",
        "content": "My wife was intrigued by the preview clip, so i popped the episode on for her. She laughed so hard, she peed.  We're now halfway through season 5, so getting into the home stretch.\n\nIf i had to describe it, I'd say Schitz Creek meets Hart of Dixie with Emily In Paris style.  \n\nIf you liked any of those, it might be worth giving it a go.  \n\nOh... I was also told that the Kdrama Romance Is A Bonus Book is loosely based on Youmger. And yes... I can see the connection, but definitely, \"Loosely.\"",
        "upvotes": 25,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1i4fypb/younger_has_become_our_new_guilty_pleasure/"
    },
    {
        "id": "1i4sviy",
        "author": "Speckled_Bird2023",
        "title": "Suddenly, my netflix program on my tablet won't allow me to watch my shows...",
        "content": "Context: I have a tablet for both reading and watching Netflix. My son uses it also for his learning games. Now I do have the parental controls set on his side of netflix for nothing above a G rating. But my side is admin, and I went under the manage profiles tab and my side shows no viewing restrictions but anytime I go back and try to go into my continue watching, I keep getting the error message: this title cannot be played because it exceeds the max maturity rating...when it shouldn't. Now also I checked my mother's profile too, and hers is set like mine= no restrictions, and hers is working fine. I have cleared the cache and have even restarted the tablet and it still isn't clearing this issue. Has anyone else had this happen to them? Should I just uninstall the app &amp; reinstall it?",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i4sviy/suddenly_my_netflix_program_on_my_tablet_wont/"
    },
    {
        "id": "1i4tlhh",
        "author": "vismur",
        "title": "Not all shows appearing",
        "content": "Hi! I saw this issue popping up for other people as well while I was googling it but I couldn’t find anywhere any solution. \nMy boyfriend and I are using the same Netflix account. He doesn’t have any issue on his profile, he sees all shows, doesn’t matter if it’s on the laptop, phone, on WiFi, on mobile data. \nFor me, however, on my profile, no matter if it’s my laptop or phone, if I am on WiFi, wherever (work, home, at parents), I don’t see all the shows - only if I use my mobile data, I can see everything. \nDoes anybody have any suggestion? It can’t be the WiFi network, cause it’s working from my boyfriend. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i4tlhh/not_all_shows_appearing/"
    },
    {
        "id": "1i4v2yf",
        "author": "babicko90",
        "title": "What happened to the netflix stream quality on devices???",
        "content": "I did not play anything on my tablet or s22 ultra for a long time. I got sick and wanted to watch american primeval and holy crap, does it look pixelated. Stream qaulity limited to 1080p??? With a 500mbs wifi? Did they purposefully reduce it for all 1440p devices? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i4v2yf/what_happened_to_the_netflix_stream_quality_on/"
    },
    {
        "id": "1i4raaz",
        "author": "MaNeme_Jeff",
        "title": "Shows/movies are too dark on TV (bug)",
        "content": "When I open the Netflix app on my RCA TV all the previews, UI, thumbnails, and trailers are all a normal brightness, but when I actually press play on a show, the show turns dark due to a filter that darkens the screen to show certain UI elements like the play button and red line. This is expected, but then the UI elements fade away (as they are supposed to) but the dark filter stays and does not go away, so basically I am stuck watching a show with that dark filter permanently on, making the show very dark. Has anyone experienced this before ? Does anyone know how to fix this?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i4raaz/showsmovies_are_too_dark_on_tv_bug/"
    },
    {
        "id": "1i4l3kz",
        "author": "Plenty-Celebration-5",
        "title": "Can I change Kids profile PG rating?",
        "content": "Hello, I have 4 friends/profiles on a Netflix account. I’m being asked if it’s possible to change the rating’s on the Kid profile so they can watch additional media on their own acc. Please advise if this is possible. It seems as if it’s restricted when I try changing the rating via settings on my browser.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i4l3kz/can_i_change_kids_profile_pg_rating/"
    },
    {
        "id": "1i4ntfs",
        "author": "Historical_Cress8562",
        "title": "Looking for a specific show",
        "content": "It was about fishing, and the first episode was about catching a specific fish that had a type of medicine, and the fisherman was trying to catch it to heal a sick person",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i4ntfs/looking_for_a_specific_show/"
    },
    {
        "id": "1i4q0yt",
        "author": "mayatalluluh",
        "title": "Top 10 movies in the U.S today aren’t showing up - is anyone else having this problem? ",
        "content": "I’m only getting the top 10 tv shows and the top  movies aren’t showing up anywhere I’ve looked. \nIs this just a me problem? I don’t know why it would be. I feel like the top 10 movies are always there?!\n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i4q0yt/top_10_movies_in_the_us_today_arent_showing_up_is/"
    },
    {
        "id": "1i4yelg",
        "author": "amajin3980",
        "title": "I used my account overseas while on vacation and they can still access its contents even after I left the country",
        "content": "I went overseas (parents’ home) during the holiday season and was able to access my account. After returning to my current country, I got curious and asked my family if they can still access my account and they still can! I don’t mind sharing my account with them but how long will this keep? Thanks!",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1i4yelg/i_used_my_account_overseas_while_on_vacation_and/"
    },
    {
        "id": "1i4r1zh",
        "author": "Birinbaldo",
        "title": "Household pop-up came back after not showing up for a while",
        "content": "I have a profile in my family members' account, so the household pop-up kept appearing every time i opened the app (though i had my ways of getting around it), but after a while, the pop-up simply stopped appearing, even when i was using mobile data and my own tv, it was like that for quite some time, however, it came back again... Does anyone know what i (or they) did and how can i do this again?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i4r1zh/household_popup_came_back_after_not_showing_up/"
    },
    {
        "id": "1i4y5gv",
        "author": "riquelmeone",
        "title": "Netflixhaushalt aktualisieren endet in Endlosschleife",
        "content": "Kurze Frage zum Altualisieren des Haushalts.\nUnser Fernseher ist seit kurzem leuder nicht mehr Netflix-faehig und wir haben uns daher fuer einen Fire-Stick entschieden.\nHat auch alles wunderbar funktioniert bis ein paar Tage spaeter die Meldung kam, dass der “Fernseher nicht zum Netflixhaushalt gehoert”. Diese Meldung kommt vom Stick.\nWir sind am selben Standort im selben W-Lan. Wir nutzen noch ein Tablet, aber auch das nur zu Hause.\nJetzt haben wir auf aktualisieren geklickt und der naechste Bildschirm fragt “nicht …@…de? erstellen sie ihr eigenes Konto”.\nDas wollen wir natuerlich nicht, denn wir sind ja genau dieses Benutzerkonto. Nun koennen wir wieder “Haushalt aktualisieren” druecken was in einer Endlosschleife resultiert.\nWarum?\nAlles imselben Wlan. Warum denkt Netflix ueberhaupt, dass der Stick in einem anderen Haushalt ist und warum kann ich Netflix nicht davon ueberzeugen, dass das unser Benutzerkonto ist?\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i4y5gv/netflixhaushalt_aktualisieren_endet_in/"
    },
    {
        "id": "1i41pdh",
        "author": "Robemilak",
        "title": "Netflix Co-CEO Ted Sarandos says David Lynch was working on a new limited series that “would have been his last project” but Covid and his declining health got in the way.",
        "content": "",
        "upvotes": 50,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1i41pdh/netflix_coceo_ted_sarandos_says_david_lynch_was/"
    },
    {
        "id": "1i4oxzj",
        "author": "xD3m3nTuL",
        "title": "Free stuff?",
        "content": "It’s out there some sort of promo code for my first experience? I got Netflix for like 9-10 months and the price really started to be a problem, at first I was paying no more than 14$ and now it’s close to 20$ with only one member who doesn’t live with me. Should I move to prime? ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i4oxzj/free_stuff/"
    },
    {
        "id": "1i4z60d",
        "author": "BVAcupcake",
        "title": "Remove payment method",
        "content": "Who even came up with this, add another paymeny method to remove payment method, a 4 year old baby could think better than that, how the fuck am i supposed to remove my card now?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1i4z60d/remove_payment_method/"
    },
    {
        "id": "1i4d1op",
        "author": "Fit_Independence_124",
        "title": "How to change first person on the account",
        "content": "Somehow we receive emails where they adress to my daughter(s account). Apparently she’s the first one to adress to. Also, all the watch suggestions are for her. \n\nHow can we change this? \n\nShe’s also on top of the accounts but I thought it was because it’s in alphabetical order. ",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i4d1op/how_to_change_first_person_on_the_account/"
    },
    {
        "id": "1i44ulv",
        "author": "S4v1r1enCh0r4k",
        "title": " Gabriel Basso says he does his own stunts in 'The Night Agent' since he doesn't like \"lying\" to audiences and wants the experience to be as immersive as possible ",
        "content": "",
        "upvotes": 14,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i44ulv/gabriel_basso_says_he_does_his_own_stunts_in_the/"
    },
    {
        "id": "1i3bxpg",
        "author": "Robemilak",
        "title": "Interstellar got an epic billboard to promote its release on Netflix",
        "content": "",
        "upvotes": 1555,
        "comments": 69,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/l8a16rg6mide1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1i3bxpg/interstellar_got_an_epic_billboard_to_promote_its/"
    },
    {
        "id": "1i4tfyp",
        "author": "Dense-Gap3879",
        "title": "Castlevania Nocturne Season 2 is BRUTAL... fan review ",
        "content": "Here's my general overall impression  of episode 1: https://youtu.be/dhm7n-Le_EA\n\nI'll be cooking on of these videos for all of my fav scenes in season 2",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i4tfyp/castlevania_nocturne_season_2_is_brutal_fan_review/"
    },
    {
        "id": "1i47gqk",
        "author": "MrPianoFox",
        "title": "The 8 Show",
        "content": "Minor spoilers ahead!! \n\nI'm pissed at the reaction to thos show; it feels like a lot of people hate on it because they think it's piggybacking off of Squid Game, and I really don't feel that way. Squid Game was cool but it didn't really have substance to me, it felt like a game for the most part, it felt like that's what the showrunners treated it as. \n\nBut The 8 Show, *I* believe, has such a fucking fantastic message that ot portrays so beautifully. I think the cruelty of 8th Floor and 6th actually shows you what it's like being in the shoes of someone poor going up against someone rich. I think 4th floor and 5th floor being 'slaves' to the upper floors, and, somewhat by choice, not helping the lower floors is also fucking spot on. The lower floors stick together -- except one of them really needs the money, and will do *anything* to get it, including hurting the people around them. \n\nI was bothered by some plot holes, but i can explain things like 2nd locking them all up by... Well, they didn't want more time, but now that they have it... And 5th being naive and delusional makes sense, too, to me at least. Lots of whacky shit, but it's so raw and intense that I think it did its job well. \n\nAnd with the ending, I think it tied things up well. I did NOT like the games, I did NOT like the brutality, as a matter of fact I was so disturbed i cried at some parts and the only reason i didn't skip things was cuz i didn't wanna miss story, or miss the emotions that came from things like 3 fucking HOME RUNNING 1'S HEAD. \n\nChills.\n\nIt's not for everyone. But I've been poor all my life, and i have had a lot of friends and family in different places. All the different systems of hierarchy and power that are put in place is what gets people killed. As an anarchist and anti-capitalist, the message resonated with me, not manhy shows or movies I've seen capture just how genuinely brutal and uncaring the *systems* are while somehow making sure to keep every character somewhat empathetic or understandable. Except 8. Fuck 8. \n\nGreat show, the hate is undeserved, i don't think it's really about the story so much as what it's trying to tell you. ",
        "upvotes": 7,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1i47gqk/the_8_show/"
    },
    {
        "id": "1i3dd6d",
        "author": "EthanWilliams_TG",
        "title": "Adam McKay Reveals 'Don't Look Up' Was 'Hated' by Critics but Watched by 400 Million to 500 Million on Netflix",
        "content": "",
        "upvotes": 888,
        "comments": 186,
        "media": null,
        "permalink": "/r/netflix/comments/1i3dd6d/adam_mckay_reveals_dont_look_up_was_hated_by/"
    },
    {
        "id": "1i4itcg",
        "author": "SlendyFin",
        "title": "Phone app \"wondering what to watch next\" notification spam",
        "content": "As the title suggests, I keep getting the \"wondering what to watch next\" notification on my phone, every time I swipe it off (or tap the notification to open the app) it instantly reappears. It's been happening all day\n\nI'm using the OnePlus 13 and both it and Netflix are up to date",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i4itcg/phone_app_wondering_what_to_watch_next/"
    },
    {
        "id": "1i4quhi",
        "author": "Wonderful-Strain-436",
        "title": "Help finding this show!!",
        "content": "Hey guys I have very minimal information on this show but I kept seeing it on TikTok before it was banned here in the U.S. \n\nIt was a brown girl dating a white guy. One scene was them in bad and she made him cuddle her. The next was him alone in bed and the room was dark. I think I remember seeing her crying from one trailer ? Idkkkk!! \n\nI didn’t finish it because I didn’t want to see a spoiler but everyone seems to really like this show! I think it has the word “stuff” in the title?? Sorry I know this isn’t a lot of info ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i4quhi/help_finding_this_show/"
    },
    {
        "id": "1i3qi0w",
        "author": "FradiTomi",
        "title": "Netflix’s Biggest Shows Will End This Year – What’s Next After 2025?",
        "content": "Stranger Things, Squid Game, You, Cobra Kai all ends this year with their final season and also we get Wednesday Season 2 this year, but let’s be real—it’ll probably be at least 2028 before we see Season 3 (if there is one). So apart from Bridgerton whats left for next 2-3 years after 2025 for Netflix? Yes there are couple of good series which I did not mention in this post, but these ones have their biggest viewership.",
        "upvotes": 90,
        "comments": 99,
        "media": null,
        "permalink": "/r/netflix/comments/1i3qi0w/netflixs_biggest_shows_will_end_this_year_whats/"
    },
    {
        "id": "1i3kyrz",
        "author": "Rocknrollsk",
        "title": "American Primeval: as a Frenchman I’m offended.",
        "content": "No, I’m just kidding.  \n\nBut seriously, I’ve seen a lot of talk about how the Native Americans and Mormons are portrayed, but nobody’s talking about that crazy shit with the French.  What the fuck.",
        "upvotes": 157,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1i3kyrz/american_primeval_as_a_frenchman_im_offended/"
    },
    {
        "id": "1i4gle1",
        "author": "Internal_Opposite_48",
        "title": "Why I cant watch Breaking Bad with english subtitles",
        "content": "I recently started watching *Breaking Bad*, and I wanted to improve my English skills by watching it with English subtitles. However, I’ve encountered a problem I'm unable to access the English subtitles for the series. I’ve tried looking into the settings on the streaming platform I’m using, but the option for English subtitles doesn’t seem to be available, or maybe I’m missing something.\n\nCould this issue be related to regional restrictions or a technical error? I’m not sure if where I live is causing the limitation. If there’s a specific method or setting I should be using, I’d greatly appreciate your guidance.\n\nWatching the show with English subtitles would be really helpful for me, as I’m working on improving my language comprehension.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i4gle1/why_i_cant_watch_breaking_bad_with_english/"
    },
    {
        "id": "1i3bpgb",
        "author": "Whobitmyname",
        "title": "Adam McKay Says ‘Don’t Look Up’ Was ‘Hated’ by ‘Critics and Cultural Gatekeepers’ but Seen by an Estimated ‘400 Million to Half a Billion’ People on Netflix",
        "content": "",
        "upvotes": 744,
        "comments": 111,
        "media": null,
        "permalink": "/r/netflix/comments/1i3bpgb/adam_mckay_says_dont_look_up_was_hated_by_critics/"
    }
]