[
    {
        "id": "1lw9k8l",
        "author": "NishinosanTV",
        "title": "KPop Demon Hunters directors and music supervisor is doing an AMA on r/kpop today at 9 AM PT.",
        "content": "Hey r/netflix \n\nWe're being visited by some of the people behind KPop Demon Hunters today for an AMA on [r/kpop](https://www.reddit.com/r/kpop/). Notably the directors Maggie Kang and Chris Appelhans alongside the music supervisor Ian Eisendrath. The AMA starts at 9 AM PT.\n\nYou can send your questions in the thread attached to this post. Or, you can head on over directly to [r/kpop](https://www.reddit.com/r/kpop/) now, it'll be pinned at the top.\n\nNish\n\n[r/kpop](https://www.reddit.com/r/kpop/) modteam",
        "upvotes": 13,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lw9k8l/kpop_demon_hunters_directors_and_music_supervisor/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lx24tv",
        "author": "jenkinsvr",
        "title": "I just want to say... Thank You Netflix",
        "content": "Wow, thank you so much Netflix. I just recently got into the show, Into the Night. I was hooked from the first episode, fully invested, and halfway through, I had that creeping realization: “Oh no… this feels canceled.” And of course, I was right!\n\n No official announcement, no goodbye, just radio silence. Honestly, it’s such a bold move to lure viewers in with such great storytelling only to pull the plug without warning. Truly inspiring.\n\nWho needs closure or a satisfying conclusion when you can just leave characters and audiences dangling in a void of unfinished arcs? The way you cancel shows based purely on streaming data instead of giving them time to grow? Absolutely visionary. \n\n\nNothing says “we value your time” like pulling the rug mid-binge. Really, Netflix, thank you for reminding me not to get emotionally attached to anything on your platform ever again. Great job keeping disappointment fresh and consistent!\n\n",
        "upvotes": 59,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lx24tv/i_just_want_to_say_thank_you_netflix/"
    },
    {
        "id": "1lx3qfs",
        "author": "Bamtastic56",
        "title": "Bring back G.L.O.W",
        "content": "This show still to this day in 2025 has such a loyal fan base, of which I, a subscriber, am apart of and have been since the first season. Not only does it still have fans who have been left on an unsatisfying cliff hanger but so much of the cast is still willing and wanting to be part of it and give this masterpiece of a show a deserving ending. Treat the cast right, they are the backbone and the faces we know that contribute to our love and adoration of G.L.O.W, and we fans of this series hold them dear in our hearts for that. In giving us one last season, movie, or even a mini season to truly end this story with the intention we know the incredibly talented and creative writers and directors had wanted to make would give Netflix subscribers not only hope in the platform we continue to choose to spend our money on month after month but would make, for sure this long time subscriber, feel as though Netflix gained their integrity back as a streaming platform that was above all the rest like you were through the 2010’s decade. I doubt anyone with decision-making power with this company will see this, let alone read it in it’s entirety, but this is my plea to give a show that has gotten me through so much by letting me escape into the decade I have always loved most, a proper ending that it has always deserved",
        "upvotes": 35,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lx3qfs/bring_back_glow/"
    },
    {
        "id": "1lwrkhp",
        "author": "Sudden_Pop_2279",
        "title": "‘Squid Game’ Season 3 Achieves Netflix’s Best 10-Day Viewership Ever With 106.3 Million Views",
        "content": "",
        "upvotes": 224,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1lwrkhp/squid_game_season_3_achieves_netflixs_best_10day/"
    },
    {
        "id": "1lxbzv6",
        "author": "adele28",
        "title": "Does anyone know the documentary I am talking about?",
        "content": "I watched this a while ago and barely remember it now. What I do remember is that it's a kind of documentary series about a conman. One of the scams was the guy claimes to join a marathon (I think) and he is sponsored by someone who was from the same country that the conman claimed to be from. After receiving the money, he keeps making excuses, gets disqualified from the marathon, etc. My description could be wrong, I watched this quite a while ago 😬",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lxbzv6/does_anyone_know_the_documentary_i_am_talking/"
    },
    {
        "id": "1lxbhl6",
        "author": "corrupted0088",
        "title": "Thank you Netflix for animal kingdom!!!",
        "content": "What should my next show be? I enjoyed animal kingdom and waterfront. I liked ozark so something similar to that ? I have watched the outer banks it was pretty good more for the younger crowd but I enjoyed it.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lxbhl6/thank_you_netflix_for_animal_kingdom/"
    },
    {
        "id": "1lwugb2",
        "author": "Key-Monk6159",
        "title": "Old Guard 2",
        "content": "I can't think of a show I more looked forward to continuing after One and was thrilled when Two finally showed up.\n\nAnd it Really SUCKED!\n\nThey spent the money. Hired the actors. Got the crew together. And this is what they come with?\n\nThat is all.",
        "upvotes": 14,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1lwugb2/old_guard_2/"
    },
    {
        "id": "1lx9cxs",
        "author": "indiewire",
        "title": "'Too Much' Cameo Guide: Lena Dunham's Life Story, Fact vs. Fiction",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lx9cxs/too_much_cameo_guide_lena_dunhams_life_story_fact/"
    },
    {
        "id": "1lx994e",
        "author": "BunyipPouch",
        "title": "Callie Hernandez, actress in Netflix's 'Soundtrack' (and 'La La Land', 'Alien: Covenant', 'Blair Witch', 'The Endless', 'Under the Silver Lake', 'The Flight Attendant'), is doing an AMA/Q&amp;A in /r/movies today for anyone interested. It's live now, she'll be back for answers at 3 PM ET.",
        "content": "I organized an AMA/Q&amp;A with actress &amp; filmmaker Callie Hernandez, who has been in films/TV such as **La La Land**, **Alien: Covenant**, **Blair Witch**, **The Endless**, **Under the Silver Lake**, **The Flight Attendant**, **Graves**, **Soundtrack**, and more.\n\nIt's live here now in /r/movies:\n\nhttps://www.reddit.com/r/movies/comments/1lx8haf/hey_rmovies_were_courtney_stephens_and_callie/\n\nShe'll be back at 3 PM ET to answer questions. I recommend asking in advance. Any question/comment is much appreciated :)\n\nShe's joined by the director and co-writer of her new film, **Invention**, an experimental-drama.\n\nHer verification photo:\n\nhttps://i.imgur.com/o7RTsrp.png",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lx994e/callie_hernandez_actress_in_netflixs_soundtrack/"
    },
    {
        "id": "1lx2v2w",
        "author": "Twikkilol",
        "title": "No obvious way to contact Netflix support",
        "content": "So I cannot log into my account both on my phone and computer(s) and it just gives me \"technical error\" reason. Looking through support, th ere is no obvious reason how to contact support, no phone number listed, no live chat, no email. \n\nHow can such a large company have such a poor service quality? ",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lx2v2w/no_obvious_way_to_contact_netflix_support/"
    },
    {
        "id": "1lx6wqj",
        "author": "leyy_pink1997",
        "title": "What documentaries is the best to watch ?",
        "content": "Like napanood KO Yung Man on Wire where is\nJames Marsh's doc about artist Phililppe Petit's artful caper brings you every ounce of suspense that can be wrung from a man on a (suspended) wire. The stories was Using actual footage from the event seamlessly mingled with new re-enactments, filmmaker James Marsh masterfully recreates high-wire daredevil Philippe Petit's",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lx6wqj/what_documentaries_is_the_best_to_watch/"
    },
    {
        "id": "1lx3zbd",
        "author": "Important-Tell-1178",
        "title": "Jenna Ortega Returns in 'Wednesday' Season 2: Enid in Danger!",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lx3zbd/jenna_ortega_returns_in_wednesday_season_2_enid/"
    },
    {
        "id": "1lwwepm",
        "author": "Expensive-Baby-1391",
        "title": "Question for Penville Season 5 Episode 6",
        "content": "There is a song playing in the credits of Season 5 Episode 6 of Penville and I desperately want to know what it is. I tried everything from Shazam to watching the credits to find the name of the song. Does anyone know what its called?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lwwepm/question_for_penville_season_5_episode_6/"
    },
    {
        "id": "1lx0lqu",
        "author": "Kiwimati",
        "title": "Battle camp - spelling",
        "content": "Don't really like reality tv but started watching battle camp because I like to see the games they have to play. \nI know reality tv is often scripted and I hope BC is as well. \n\nBecause no way is it possible that the spelling game is real? Words like ocean, steam, revenge?! Seriously... English is not my first language (it's not even my second) and I know perfectly how to spell these super easy words. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lx0lqu/battle_camp_spelling/"
    },
    {
        "id": "1lvzgbo",
        "author": "MaxwellSmart07",
        "title": "Nominations for the worst series currently playing on Netflix?",
        "content": "I’ve seen a lot of losers, well actually I’m mostly on Reddit while my wife watches. Currently she is watching Blindspot, a ridiculous the world’s going to blow up every day FBI drams (um, farce). That’s my nomination. Any others anyone wants to warn me about. Thanks.",
        "upvotes": 206,
        "comments": 295,
        "media": null,
        "permalink": "/r/netflix/comments/1lvzgbo/nominations_for_the_worst_series_currently/"
    },
    {
        "id": "1lvsll9",
        "author": "grasskisser",
        "title": "Netflix cancels The Residence",
        "content": "I just read this and I am so upset! I really enjoyed this show, so did everyone else I know who watched it. It was about a murder in the White House, and it really kept me guessing the whole time. Cordelia  Cupp, a modern day Columbo, and bird watcher was riveting!  I am so sad because Netflix, in my opinion, does this with so many shows. I wish they would at least commit and do less shows for production. They have so much junk on the platform that is no good, but this was, it really was! Tell me what you ladies and gentleman think below. Am I the only one? I would love to hear your thoughts. ",
        "upvotes": 355,
        "comments": 112,
        "media": null,
        "permalink": "/r/netflix/comments/1lvsll9/netflix_cancels_the_residence/"
    },
    {
        "id": "1lwwinc",
        "author": "Muppet885",
        "title": "Trainwreck: The Real Project X",
        "content": "I really thought this story was going to be based on the Corey Worthington party in Australia that was the movie Project X's inspiration but no this was even more insane then Corey's party. \n\nTrainwreck does these documentaries so damn well! I have watched every single documentary now! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lwwinc/trainwreck_the_real_project_x/"
    },
    {
        "id": "1lwo7gv",
        "author": "KixAss37",
        "title": "Building The Band Subreddit!",
        "content": "If you're into the Netflix show \"Building The Band\"come check out r/BuildingTheBandSeries! We're chatting about the singers, band drama, songs, and everything else related to the series. All appropriate posts and comments are welcome. So feel free to jump in and share your thoughts and opinions, no pressure! 🙈",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lwo7gv/building_the_band_subreddit/"
    },
    {
        "id": "1lx55l9",
        "author": "Minimum_Way2086",
        "title": "Are there any non-violent, non-intense shows on Netflix?",
        "content": "I like having background sound basically when I go to sleep - typically been doing YouTube videos of late night celebrity interviews, but I’d like to actually watch a bit of a show before falling asleep. \n\nBut it feels like everything on Netflix is either too intense or too violent to watch right before going to sleep 😂 Or maybe my algorithm is too influenced by my daytime documentary watching, lol. \n\nAny recommendations for a show that is suitable to watch before going to sleep? Bonus points if the episodes are around 30 minutes each. ",
        "upvotes": 0,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1lx55l9/are_there_any_nonviolent_nonintense_shows_on/"
    },
    {
        "id": "1lwn1md",
        "author": "Holiday-Chipmunk-378",
        "title": "Show suggestions",
        "content": "I am just finishing “Animal Kingdom” season 6 -  can anyone suggest my next watch ??  Fan of crime / thriller / anything gripping .  Thanks in advance !!! ",
        "upvotes": 3,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1lwn1md/show_suggestions/"
    },
    {
        "id": "1lwibs6",
        "author": "Right_Carpenter_7418",
        "title": "Where is the “coming soon” tabs of Netflix in it’s new UI",
        "content": "Before the Ui change, there were sections called “coming this week”, “coming next week”, and “coming soon”. But ever since the new Ui came, it only shows “coming soon”, and my problem with that is that it doesn’t even show ALL of the soon to be released shows/movies. The way I know is that in the “top searches” section, it shows “The Fragrant Flower Blooms with Dignity”, but it states it’s releasing soon.\nAnyone know where I can find the “coming next week”, “coming this week” sections?",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lwibs6/where_is_the_coming_soon_tabs_of_netflix_in_its/"
    },
    {
        "id": "1lwqjk1",
        "author": "Blink_Flashpoint",
        "title": "KPop Demon Hunters 4K Availability?",
        "content": "Hi, didn’t know where else to ask this\n\nI just wanted to ask if people on the premium Netflix plan have the option to see the movie in 4K? Or is HD the highest option available? If the movie is not available in 4k on Netflix, does Sony ever release movies to blu ray later?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lwqjk1/kpop_demon_hunters_4k_availability/"
    },
    {
        "id": "1lwkt6d",
        "author": "Illustrious_Cut1730",
        "title": "Miss Italia mustn’t die",
        "content": "I found this documentary on Netflix! \n\nMiss Italia is part of my childhood, I used to watch it with my grandma and it marked the end of the summer and the beginning of the school (I think the final was a couple of days before the school start). \n\nAside from the sweet memories with my nonna, I always thought it was a bleak context and quite toxic. \n\nBut then you have Aurora, who is an absolute gem and has no fear of being unapologetically herself. She even stood up for the winner of one pageant, that her mom was fat-shaming.\n\nAurora, we need more people like you! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lwkt6d/miss_italia_mustnt_die/"
    },
    {
        "id": "1lx28xw",
        "author": "CrAzY-GEMU-OKAMI96",
        "title": "Is the Squid Game finale as as as people say it is?",
        "content": "I hear people constantly complaining about the ending to the show. I'm only on S2 ep2. So I don't want to waste my time watching something that will end poorly. (I already did that with The Promised Neverland, never again)",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lx28xw/is_the_squid_game_finale_as_as_as_people_say_it_is/"
    },
    {
        "id": "1lwo0k8",
        "author": "prettyfillygirlone",
        "title": "Horse person watching free rein?",
        "content": "I’m on season 3 and Zoe’s acting is getting worse. I hate it but I can’t stop watching. As a horse girl, I hate that they didn’t even TRY to make it a little more realistic. I know it’s a show but that, on top of the horrible acting it ruined a show with the potential to be good lol ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lwo0k8/horse_person_watching_free_rein/"
    },
    {
        "id": "1lw3x3t",
        "author": "LightZapper",
        "title": "Building The Band Thoughts",
        "content": "I am currently on Episode 4 right now, and wanted to hear everyones opinion on the current bands formed. \n\nBand 4: Mason, Conor, Shane, and Zach I feel has a lot of potential for the standard pop band. Alone I felt Conor was the strongest so far, maybe the first performance song just fit his voice best but when they came in together the harmonies were out of this world. It almost reminded me of one direction when they came together they blended amazingly together for their first performance. Id love to hear others thoughts on the current bands. \n\nBand 2: Landon, Shade, Malik, and Bradley could be an amazing soul/R&amp;B group and I see the potential, loved their auditions and could definitely see them going far!! \n\nBand 1: Donzell, Aaliyah, Cameron, and Katie I dont have too many thoughts on this first group but they had have a lot of powerful voices here and im interested in seeing what direction this group heads in\n\nBand 3: Nori, Wennley, and Brianna \nI think this group needs a fourth, but were quick to rush and form a three piece. It feels like something is missing or out of place to blend all their voices together\n\nOne more band is currently forming but Id love to hear everyones opinions so far! ",
        "upvotes": 19,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1lw3x3t/building_the_band_thoughts/"
    },
    {
        "id": "1lw6nfm",
        "author": "No_Gold_4554",
        "title": "Building The Band",
        "content": "The first four episodes were great television. It's all about the singers voting for each other (that's what they want us to think anyway) and forming groups of their own volition. Such fun.\n\nBut watching the trailer, it would inevitably devolve into an x-factor style show where it's all about the judges and the judges making up non-sensical advice for the drama. \n\nI wish there were more english talent shows that are not centered around the celebrity judges.",
        "upvotes": 11,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1lw6nfm/building_the_band/"
    },
    {
        "id": "1lwkmwn",
        "author": "Monztamash",
        "title": "How do you check new and upcoming shows with the new UI (on TV) ?",
        "content": "I think the UI changed about a month ago, but I still haven't found how to go about checking shows/movies coming up in the next week, and also those planned for future.\n\nThere was a feature for it in the previous version, but not sure if they removed it , or moved it somewhere else.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lwkmwn/how_do_you_check_new_and_upcoming_shows_with_the/"
    },
    {
        "id": "1lwj09y",
        "author": "ZealousidealWin7360",
        "title": "I'm here to look for a show I used to watch",
        "content": "I can't for the life of me remember the title but I'm pretty sure from what I remember this show was about this girl who could travel to another world using a book(?) I genuinely don't remember almost anything else I'm pretty sure there was a common theme of butterflies. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lwj09y/im_here_to_look_for_a_show_i_used_to_watch/"
    },
    {
        "id": "1lwig29",
        "author": "Expensive_Meow",
        "title": "Please help me change subtitle size on chromecast",
        "content": "Changing them in the Netflix app does not work, and Chromecast 2.0 doesn't have any options in the Home app to change subtitle size.  What am I doing wrong? The standard subtitle size is so hard to read, especially because the border is so grey it makes the font almost appear white when the background is light. A year or so back or worked fine to change the subtitles in the app",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lwig29/please_help_me_change_subtitle_size_on_chromecast/"
    },
    {
        "id": "1lwqg6l",
        "author": "CerbSideCombo",
        "title": "Baby Saja kinda look like..",
        "content": "When I watched the movie and saw baby Saja I just thought of nerd from boyfriends I'm so sorry askdjfieb. I think the movie was awesome tho. 10/10 ‎‎‎‎‎‎",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lwqg6l/baby_saja_kinda_look_like/"
    }
]