[
    {
        "id": "1quu150",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Juvenil 'A’ - Olympique de Marseille U19 | UEFA Youth League, Round of 32",
        "content": "#FT: JUVENIL A 5:2 OM\n\n&amp;#x200B;\n\n#UEFA YOUTH LEAGUE \n\n&amp;#x200B;\n\n**Scorers/replays:**\n\n1:0 Thiago Pitarch 17'\n\n1:1 Mohamed Baradji 25'\n\n2:1 Anis Doubal (own goal) 27'\n\n2:2 Tadjidine Mmadi (penalty) 42'\n\n3:2 Dani Yáñez (penalty) 53'\n\n4:2 Diego Martínez 'Beto' 80'\n\n5:2 Adri Pérez 90'\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n⚽ 17' - GOLLLLLL DEL JUVENIL A - Arnu steals the ball from their defensive midfielder, and quickly plays it to Thiago at the edge of the box. He takes a few quick touches to create space, and then cuts his shot across, low into the far corner\n\n⚽ 25' - goal for OM - Illia punches away a free kick poorly, then their player takes a shot and it hits the post - the ball bounces to Baradji, who takes a little touch, and Joan Martínez can't clear it off the line in time (and even then it would've bounced back into the net again), what a crazy and unfortunate goal\n\n⚽ 27' - GOLLLLLL DEL JUVENIL A - and right in the next attack, Fortea advances on the right wing - his powerful and low cross gets deflected into the near corner by Marseille's Doubal! \n\n42' - penalty for OM after a foul by Rivas \n\n⚽ 42' - Mmadi converts\n\nHT - half time in a very open match where most dangerous situations ended up being goals on both ends - the goals we conceded were entirely avoidable, and the team needs to pay special attention to defending set-pieces better or preventing them from happening in the first place\n\n46' - 2nd half underway \n\n51' - penalty for Juvenil A after Yáñez gets tripped in the box! \n\n⚽ 53' - GOLLLLLL DEL JUVENIL A - Yáñez takes it himself and converts! \n\n🔄 59' - Rivas and Cestero off for Valde and Beto \n\n🔄 71' - Yáñez off for Gabri Valero\n\n⚽ 80' - GOLLLLLL DEL JUVENIL A - golazo de Beto! free kick from around 20 metres out, and Diego Martínez strikes it right into the top corner on the goalkeeper's side of the goal! \n\n🔄 83' - last subs, Ciria and Arnu off for Adri Pérez and Jacobo\n\n⚽ 90' - GOLLLLL DEL JUVENIL A - and the cherry on top, after a dribble by Gabri Valero, he crosses the ball low into the box - it gets deflected towards the far post by the defender, where Adri appears to head it into the net\n\nFT - a calm and controlled second half by the team makes the match end with a comfortable scoreline - they had OM under control defensively much more than in the first half and pounced in the decisive moments in attack. We will get to know the opponents in the Round of 16 and the possible path through the rest of the tournament on Friday\n\n&amp;#x200B;\n\n**Kickoff:** 16:00 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid\n\n**Referee:** Sam Barrott (ENG) \n\n**Competition:** UEFA Youth League, Round of 32\n\n**Viewing options:** [RMTV/RM PLAY](https://play.realmadrid.com/home)\n\n&amp;#x200B;\n\n**Juvenil A XI (4-3-3):** Illia Voloshyn - Diego Aguado, Mario Rivas (59' Victor Valdepeñas 'Valde'), Joan Martínez, Jesús Fortea - Jorge Cestero (Diego Martínez 'Beto'), Carlos Díez, Thiago Pitarch - Alexis Ciria (83' Adri Pérez), Adrián Arnuncio ‘Arnu’ (83'' Jacobo Ortega), Dani Yáñez (71' Gabri Valero)\n\nBench: Álvaro González (GK), Melvin Ukpeigbe, Álvaro Lezcano, Pol Durán. \n\nCoach: Álvaro López\n",
        "upvotes": 9,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wUOMl6hwPl_tsdwHAtAtno0xMvZE8h1UdSt0wFAsSbg.jpeg?auto=webp&amp;s=da678670992586a213164525827e56adb279d53a"
        },
        "permalink": "/r/realmadrid/comments/1quu150/match_thread_real_madrid_juvenil_a_olympique_de/"
    },
    {
        "id": "1qts1ud",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 10,
        "comments": 1126,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qts1ud/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1qwoj73",
        "author": "TheFeatherDiaries",
        "title": "Arda Güler; Real Madrid’s best in Pintus’ fitness test. Finished FIRST in the demanding physical assessments on Wednesday. He even increases intensity after halftime: +8% sprints and +6% sprint distance compared to first half showing elite recovery, explosiveness, and energy management.",
        "content": "",
        "upvotes": 380,
        "comments": 67,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qwoj73/arda_güler_real_madrids_best_in_pintus_fitness/"
    },
    {
        "id": "1qw1adt",
        "author": "soldier101br",
        "title": "Endrick Goal against Laval on Coup de France",
        "content": "",
        "upvotes": 3737,
        "comments": 230,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/r30yq9nznjhg1/CMAF_270.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qw1adt/endrick_goal_against_laval_on_coup_de_france/"
    },
    {
        "id": "1qwafcg",
        "author": "soldier101br",
        "title": "Alternative angle of Endrick's Golazo on Coup de France",
        "content": "",
        "upvotes": 841,
        "comments": 51,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t3zspxjsjlhg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qwafcg/alternative_angle_of_endricks_golazo_on_coup_de/"
    },
    {
        "id": "1qwo77y",
        "author": "AlekhineAl",
        "title": "Still in awe of this goal. Every player showcasing his best trait.",
        "content": "",
        "upvotes": 91,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6s5u6b052phg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qwo77y/still_in_awe_of_this_goal_every_player_showcasing/"
    },
    {
        "id": "1qwgrre",
        "author": "itooamahuman",
        "title": "Endrick's performance makes me angry , what are we even doing?",
        "content": "Because we have this gem of a a player and he will never, ever perform for us! We would have to sell Vinicius or Mbappe to make space for Endrick, and this will never happen. We bought Endrick and we won't play him! He will either rot on the bench or be sold somewhere for pennies. This is criminal, and I just cannot believe how poorly this squad is being built. Like seriously what's the plan with Endrick? To wait for Mbappe's retirement? \n\nNot to mention when he was with us, neither Ancelotti nor Xabi gave him much playtime, he goes out and he suddenly is one of the best players in France, this is horrible mismanagement and I don't get how is it even possible, why buy young talent when you don't want to let them play?   \n",
        "upvotes": 213,
        "comments": 115,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qwgrre/endricks_performance_makes_me_angry_what_are_we/"
    },
    {
        "id": "1qwrcrw",
        "author": "InspectorExact3836",
        "title": "Real Madrid has uploaded all 451 Goals scored by Ronaldo for club on its youtube channel on his 41st birthday",
        "content": "",
        "upvotes": 29,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qwrcrw/real_madrid_has_uploaded_all_451_goals_scored_by/"
    },
    {
        "id": "1qwpejw",
        "author": "asensia-kopfschmerz",
        "title": "[Cadena SER] \"The club believes Xabi Alonso's legacy was a disaster in physical aspect\" Los blancos is betting everything on physical fitness.",
        "content": "",
        "upvotes": 29,
        "comments": 26,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qwpejw/cadena_ser_the_club_believes_xabi_alonsos_legacy/"
    },
    {
        "id": "1qw2xtb",
        "author": "Modo97",
        "title": "Just a reminder: we signed Reinier for €30 million, and he didn’t play a single minute with the first team.",
        "content": "It’s insane how forgotten this transfer is. When people talk about Real Madrid’s worst signings, they mention Hazard, Jovic, Illarramendi, Woodgate, Danilo, Kaka, James, etc — but never Reinier. Not out of ignorance, but because the player is forgotten to that extent.\n\n€30 million for a player who never played a single minute for the first team is embarrassing and almost comical. Easily a top-five worst signing in the club’s history.\n\nAnyways.. he’s still only 24. I hope he manages to find himself again. Maybe he’ll get another chance to play in Europe.",
        "upvotes": 792,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5tby0jtyyjhg1.jpeg?auto=webp&amp;s=1702ce80c7ba02024ad30a7b200cc9f312ed94f9"
        },
        "permalink": "/r/realmadrid/comments/1qw2xtb/just_a_reminder_we_signed_reinier_for_30_million/"
    },
    {
        "id": "1qw9qgw",
        "author": "Maravilla_23",
        "title": "And this exactly why we need the Special One back at the Bernabeu!",
        "content": "",
        "upvotes": 203,
        "comments": 26,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/umwhqzw2elhg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qw9qgw/and_this_exactly_why_we_need_the_special_one_back/"
    },
    {
        "id": "1qvyuys",
        "author": "Resident-Stretch9723",
        "title": "Happy 41st Birthday!!",
        "content": "",
        "upvotes": 724,
        "comments": 46,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dt010ecu7jhg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qvyuys/happy_41st_birthday/"
    },
    {
        "id": "1qw1d1k",
        "author": "Goat23231",
        "title": "Mbappe watching Endrick",
        "content": "",
        "upvotes": 460,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xjbdbp1hojhg1.jpeg?auto=webp&amp;s=588e6c9ee881fdf72ccbffbf44440bc57feb218e"
        },
        "permalink": "/r/realmadrid/comments/1qw1d1k/mbappe_watching_endrick/"
    },
    {
        "id": "1qwdw1d",
        "author": "asensia-kopfschmerz",
        "title": "\"The club doesn't approve of players changing positions so much.\" \"The other day, with two left-backs, Camavinga played...\" \"Florentino blocked Fran García's departure\"",
        "content": "",
        "upvotes": 65,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qwdw1d/the_club_doesnt_approve_of_players_changing/"
    },
    {
        "id": "1qvvtz5",
        "author": "asensia-kopfschmerz",
        "title": "[Cadena SER] Arbeloa SHOCKED the group by not playing Ceballos against Benfica and they told Arbeloa about it. The press conference against Rayo was delayed due to DISAGREEMENTS with the coach. \"They live as if they were being coached by an interim manager\"",
        "content": "",
        "upvotes": 339,
        "comments": 106,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qvvtz5/cadena_ser_arbeloa_shocked_the_group_by_not/"
    },
    {
        "id": "1qw46b8",
        "author": "More-Judgment-9253",
        "title": "Thiago Pitarch vs Marseille (Man of the Match)",
        "content": "",
        "upvotes": 130,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6j6puwne7khg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qw46b8/thiago_pitarch_vs_marseille_man_of_the_match/"
    },
    {
        "id": "1qwcpv5",
        "author": "Upper_Coyote312",
        "title": "Board is  so clueless",
        "content": "Still can’t believe we spent all that money on Franco and did not bother getting a central midfielder after the season we had with ancelotti last season. Is like Perez does not even watch our games or understand anything. And now Franco is even struggling . Zubimendi was there for the taking but we let him leave arsenal and look how he is flourishing.",
        "upvotes": 26,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qwcpv5/board_is_so_clueless/"
    },
    {
        "id": "1qwa1gg",
        "author": "Short_Mousse_6812",
        "title": "What can we do with the CAM position?",
        "content": "I think it is obvious we have too many similar profiles, but this area is just overwhelmed. Bellingham, Brahim, Mastantuono, Guler and soon Nico Paz. We have too many players who thrive the best at that position. And the other problem is that they perform horribly if put at a different position. Bellingham hasn’t been the same since he was given defensive responsibility and was dropped deeper. Guler has amazing vision, but has little impact when playing deep in the midfield. Brahim and Mastantuono are bench players, but who are not quite good at wingers to constantly play there. Brahim will probably be sold and Mastantuono may get loaned out. And most importantly, Guler and Bellingham can’t work together which will definitely be hard to deal with.",
        "upvotes": 13,
        "comments": 31,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qwa1gg/what_can_we_do_with_the_cam_position/"
    },
    {
        "id": "1qvm92c",
        "author": "Agreeable-Stage-6896",
        "title": "How Simone Inzaghi would be an underrated alternative for Real Madrid",
        "content": "I think Simone Inzaghi should be a serious contender for a future Real Madrid manager, if Arbeloa leaves this summer. And if not then, further ahead in the future.\n\nUnlike Tuchel, Emery, and Klopp, who are the most common names circulating, his system does not revolve around a high press, which we realistically will never get with our current squad.\n\nInstead of high pressing, he focuses on defensive shape and structure, similar to how Ancelotti would ask our CB’s and Mendy to stay back while allowing our front three more freedom. His system is filled with quick vertical football and counters, which would suit our pace and speed offensively. Most Real Madrid fans probably thought of him as a manager while watching the Inter Milan vs Barcelona matchup in the Champions League. Last but not least, his system does not revolve around possession, which helps hide the fact that we clearly lack a tempo setter and have more of a physical than technical midfield.\n\nHe is extremely pragmatic in the way he sets his teams up and truly a big game manager. Having taken an aging Inter Milan side to two Champions League finals in four years, drawn against us with Al Hilal, and even beaten Manchester City with them. His personality is calm and collected and likely would not cause the same friction as managers like Conte or Tuchel.\n\nLooking at the managerial market for next summer, he is probably the top level coach least dependent on high pressing football and heavy possession, aside from Ancelotti after the Brazil job. For those reasons, I think these factors make him a realistic fit for Real Madrid.\n\nThoughts?\n\nEDIT:\n\nIt seems many people claim that he has underachieved in the league, and while I understand that argument, Serie A is far less predictable than La Liga. Even Carlo Ancelotti, who had an amazing European career with AC Milan, did not dominate Serie A in the same way.\n\nAs for comparisons with managers such as Tuchel and Klopp, the intention of this post was to highlight tactical compatibility with our current squad. I believe Inzaghi could start winning with only minor additions, whereas the others would likely require a full rebuild for heavy pressing system like gegenpressing. I personally cannot see Klopp returning to management anytime soon, and I do not believe Tuchel would be willing to work here given his previous tensions with mbappe at PSG and potentially with Bellingham in England (depending on how the World Cup goes and whether he starts regularly).",
        "upvotes": 177,
        "comments": 73,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qvm92c/how_simone_inzaghi_would_be_an_underrated/"
    },
    {
        "id": "1qvyk36",
        "author": "ultramarinum",
        "title": "My 9 years old is huge fan and we’re flying to watch league match with Elche",
        "content": "I hope this post fits the subreddit. My son is crazy about Real Madrid and I bought flight tickets from Prague for March, for the match against Elche, for our family 3. I had to choose this match because I learned that it’s difficult to find tickets to other matches. \n\nQuestion is; when will the tickets be open for sale? And which part of the stadium would you recommend?",
        "upvotes": 26,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qvyk36/my_9_years_old_is_huge_fan_and_were_flying_to/"
    },
    {
        "id": "1qvgqek",
        "author": "Serious-Letter7938",
        "title": "Real Madrid outfield players with the most recoveries in LaLiga this season [@statmuse]",
        "content": "",
        "upvotes": 300,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o09h0n2k5fhg1.png?auto=webp&amp;s=63ca2f6a07302736a29074e833d5fd1f873ce8d0"
        },
        "permalink": "/r/realmadrid/comments/1qvgqek/real_madrid_outfield_players_with_the_most/"
    },
    {
        "id": "1qw89py",
        "author": "Aesop_Rocky_",
        "title": "Real Madrid vs Real Sociedad 2.14",
        "content": "originally had tickets for this match on 2/15, looks like now it will take place on 2/14. \n\nI cant figure out what time the game will be played. I see conflicting information online, some sites say the game will be played at 3:oo PM and others say 9:00 PM.  Does anyone know when the actual match will be played? ",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qw89py/real_madrid_vs_real_sociedad_214/"
    },
    {
        "id": "1quxmik",
        "author": "ch1nkkyy",
        "title": "Tb to when everyone give the ucl a kiss but Modric and Kross tho 😂",
        "content": "",
        "upvotes": 1134,
        "comments": 40,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zdrvc3uaabhg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1quxmik/tb_to_when_everyone_give_the_ucl_a_kiss_but/"
    },
    {
        "id": "1quxa7t",
        "author": "Tempest696969",
        "title": "They say never fall in love with a loan player. What a blessing he was for us",
        "content": "",
        "upvotes": 1006,
        "comments": 87,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fsoy3s348bhg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1quxa7t/they_say_never_fall_in_love_with_a_loan_player/"
    },
    {
        "id": "1qur09s",
        "author": "More-Judgment-9253",
        "title": "This is a great video and it really shows that vini and mbappe absolutely cannot coexist here and one of them needs to go, and that's obviously vini.  (Made by Football TacticDive on youtube)",
        "content": "",
        "upvotes": 909,
        "comments": 278,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/smrao0v7y9hg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qur09s/this_is_a_great_video_and_it_really_shows_that/"
    },
    {
        "id": "1quq3wq",
        "author": "Extreme-Rhubarb3658",
        "title": "if anyone can touch these numbers, it's him",
        "content": "",
        "upvotes": 784,
        "comments": 124,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zblz5fvrr9hg1.png?auto=webp&amp;s=81f22d71e6a382f3e3b0851d09ce0c02b31e6fc2"
        },
        "permalink": "/r/realmadrid/comments/1quq3wq/if_anyone_can_touch_these_numbers_its_him/"
    },
    {
        "id": "1qvhidb",
        "author": "Foreign_Invite_4768",
        "title": "Your XI vs Valencia without Vini &amp; Jude",
        "content": "I’d consider a diamond setup focused on control rather than chaos. Tchouaméni and Camavinga as the pivot to protect transitions, Ceballos as the deep-lying playmaker to secure buildup.\n\nGuler at the tip, Gonzalo as striker, Mbappé attacking the left, Rodrgyo RW.\n\nCarreras at LB, Valverde at RB, Asencio in central defense.\n\nLess risk, more control and more like a team. How would you set up?",
        "upvotes": 22,
        "comments": 39,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qvhidb/your_xi_vs_valencia_without_vini_jude/"
    },
    {
        "id": "1qv77ja",
        "author": "nogokeo",
        "title": "Legit check pls Ronaldo 2002/03",
        "content": "",
        "upvotes": 91,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qv77ja/legit_check_pls_ronaldo_200203/"
    },
    {
        "id": "1quskne",
        "author": "Mysterious-Newt-1194",
        "title": "My top 3 favorite jerseys .",
        "content": "",
        "upvotes": 345,
        "comments": 110,
        "media": null,
        "permalink": "/r/realmadrid/comments/1quskne/my_top_3_favorite_jerseys/"
    },
    {
        "id": "1quwmkx",
        "author": "ContextDry9672",
        "title": "For all my hate-watchers, Albacete is going up against Barca today, believe.",
        "content": "",
        "upvotes": 130,
        "comments": 33,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1t028j4q3bhg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1quwmkx/for_all_my_hatewatchers_albacete_is_going_up/"
    }
]