[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 34,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kq4uj8",
        "author": "Relevant_Syllabub895",
        "title": "Netflix puts AI ads in paid tier",
        "content": "",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kq4uj8/netflix_puts_ai_ads_in_paid_tier/"
    },
    {
        "id": "1kpynjm",
        "author": "LMO2021",
        "title": "Wow, Forever was SO good …",
        "content": "AND … NO! I’m not crying 😂 stoked season 2 was renewed, let’s hope they don’t butcher it. Phenomenal performances by the cast! Wood Harris (Justin’s Dad) was a real scene stealer. I wasn’t going to, but I’m glad I gave it a chance. I recommend. ",
        "upvotes": 19,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1kpynjm/wow_forever_was_so_good/"
    },
    {
        "id": "1kq47p0",
        "author": "Equivalent_Phrase_25",
        "title": "Why do most anime’s fantasize high school",
        "content": "Have u noticed that like 95% of anime the MC character is either in high school or at-least the age of a high schooler. Like why is that. That apply’s to all of the sub genres in anime too. Like for a show like attack on titan it makes sense to make Eren a young character but I can’t even think of a show rn that has the MC as someone who’s 30 lol ",
        "upvotes": 4,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1kq47p0/why_do_most_animes_fantasize_high_school/"
    },
    {
        "id": "1kpgmhv",
        "author": "Equivalent_Phrase_25",
        "title": "New volume of love death + robots is trash",
        "content": "The first 3 volumes I really loved but the new one is just significantly worse, shorter episodes (per average to the other volumes) and only a couple of them in my opinion are good. Like (can’t stop, spider rose  , how zeke got religion). Idk maybe it seems to rushed because u can watch all of it in like a hour and I felt like the episodes in past volumes were better. Like the rat episode where he hires robots to hunt the rats. That episode was fire. ",
        "upvotes": 78,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1kpgmhv/new_volume_of_love_death_robots_is_trash/"
    },
    {
        "id": "1kpqbgq",
        "author": "kshkllaken420",
        "title": "So now even watching netflix on your phone isn’t allowed if you have multiple residents?",
        "content": "Is anyone else having troubles here? It was already a struggle when I could only watch netflix on tv at one place, but now I can’t even access my account from my phone because “it’s not apart of the household.” WTF. \n\nedit for context:\nI’m out of state for school, so “just logging back into the wifi” is not really an option. ",
        "upvotes": 16,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1kpqbgq/so_now_even_watching_netflix_on_your_phone_isnt/"
    },
    {
        "id": "1kpfcfe",
        "author": "19ghost89",
        "title": "What are the 10 most important Netflix original TV shows in the history of the platform?",
        "content": "I'm not talking about \"most watched.\" I can look that up easily enough, but it doesn't really answer the question. For example, Orange is the New Black is no longer in the Netflix top 10, but it would be hard to argue, in my opinion, that the show which basically launched Netflix originals and helped start the binging trend doesn't belong on such a list.\n\nI'm also not asking for your favorites, because that's very subjective and I could get hundreds of different answers.\n\nI want to know, if you had to make a \"history of Netflix\" and pick the 10 most important shows to highlight - the ones that were biggest and most impact full at the time of their release, with perhaps some extra points for staying relevant if you want - what would those shows be?",
        "upvotes": 74,
        "comments": 136,
        "media": null,
        "permalink": "/r/netflix/comments/1kpfcfe/what_are_the_10_most_important_netflix_original/"
    },
    {
        "id": "1kq6711",
        "author": "S4v1r1enCh0r4k",
        "title": "Here’s What’s Coming to Netflix in June 2025",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kq6711/heres_whats_coming_to_netflix_in_june_2025/"
    },
    {
        "id": "1kq5bdk",
        "author": "Grand-Quit3524",
        "title": "I can't find this show anywhere",
        "content": "I've been searching for a show I watched when I was younger probably around 2017-2019. The show was about this guy around (18-20 years old) who rode dirtbikes. He got some news and he went on a tour bus traveling the country with 2 other friends. \n\n\nThe part of one of the episodes I somewhat remember was in like a fun \"haunted\" dungeon type attraction and him and his friends were playing around and cussing alot. \n\nThat's all I remember of the show but I remember that I thought it was funny back then so I wanted to watch it again. But I can't find a name/anything close to it\n\nIt is NOT maveriX reddit please do your thing",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kq5bdk/i_cant_find_this_show_anywhere/"
    },
    {
        "id": "1kq4ugc",
        "author": "ThatOtherDiamond",
        "title": "Zombie Animated Toilet Humor Show!",
        "content": "Im looking for an older show that was out made in covid? (dk for sure) that was animated and an apocalypse show? It had toilet humor (lots) and I think most of the zombies were based on it, Any help would be SUPER appreciated!!!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kq4ugc/zombie_animated_toilet_humor_show/"
    },
    {
        "id": "1kprnld",
        "author": "peoplemagazine",
        "title": "Liam Payne to Still Appear on Singing Competition Series Building the Band After His Death, Confirms Netflix",
        "content": "",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kprnld/liam_payne_to_still_appear_on_singing_competition/"
    },
    {
        "id": "1kprr6z",
        "author": "Empty-Lobster4542",
        "title": "\"Device isn't part of household\" but I'm on the home network",
        "content": "I'm trying to watch Netflix on my phone, but it says that the device isn't part of the household! I get this error when I'm away from my parent's home for prolonged periods, but I'm on the home network right now and it's not working. I have double checked that the TV is on the same WiFi as my phone, I've logged both devices in and out, I've tried resetting the Roku and my phone, and it still just gives me the error. I know I can (and frequently do) get a temporary code for 14 days, but since I'm on the home network right now, I'd really rather just log in and have it approved for 30 days. ",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kprr6z/device_isnt_part_of_household_but_im_on_the_home/"
    },
    {
        "id": "1kq45mp",
        "author": "FabianGD",
        "title": "Not understanding Netflix system to avoid sharing",
        "content": "Hello everybody, I don't know why but when I'm trying to connect Netflix in my notebook I got the share message but I don't in my cellphone. I would like to have Netflix in my notebook instead of my phone, but I don't know how can I change the gadget. They are both in the same wi-fi when I do this but only one can connect. Can I change this? The home is my mother´s home that I visit regularly, but I can't understand why my phone can work in my own wi-fi and my notebook can't. Curiously I tried disconnecting my phone account totally and it worked one day but after that the message appeared again and the same \"solution\" didn't work anymore.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kq45mp/not_understanding_netflix_system_to_avoid_sharing/"
    },
    {
        "id": "1kq3rpr",
        "author": "bipolarpenny",
        "title": "Help y'all",
        "content": "Does Netflix notify you when someone on another device logs in again if they’ve already logged in before?\n(I input the wrong password twice btw does that notifies too?)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kq3rpr/help_yall/"
    },
    {
        "id": "1kq3g8j",
        "author": "pos_cant",
        "title": "Recently Watched list is just gone on my web browser?",
        "content": "Am I just not smart? I don't see it anywhere when I log in on Chrome. How is it possible that a streaming service won't show me my recently watched within 3 folds down? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kq3g8j/recently_watched_list_is_just_gone_on_my_web/"
    },
    {
        "id": "1kq0yw8",
        "author": "MrsChocolateDrop84",
        "title": "Forever- Mrs.Dawn Edwards( Justin’s mom)",
        "content": "So, I was looking up the cast and their bios.  Justin’s mom( Karen Pittman) is listed as 39.  I call the biggest of the biggest CAPS on planet earth.  Am I the only person questioning this? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kq0yw8/forever_mrsdawn_edwards_justins_mom/"
    },
    {
        "id": "1kou98z",
        "author": "itsLemurfan",
        "title": "A Deadly American Marriage",
        "content": "A Deadly American Marriage\n\nI don’t know if I’m missing something… but it seems like Molly and her dad are absolutely guilty ? The only basis of an argument her lawyer can make for the retrial is the fact that Jason had mentioned to a counselor that he was more angry, and the secret voice recordings. But I feel like 1) if someone who doesn’t even have guardianship of your own kids is actively trying to separate you from your kids, you’re going to be very stressed ? Also, the secret voice recordings don’t even show any abuse IMO ? They are arguing, and they both raise their voices, but Jason does NOT seem as aggressive as they are trying to paint him as. And the fact that they called it a threat that he was threatening Molly about taking the kids away… THEY ARNET EVEN HER KIDS ? Legally or biologically !! She never adopted them !! The other argument was regarding Jason’s first wife. But professionals from Ireland who worked with the autopsy said that it still was not strangulation that caused Mags death. It could’ve been a different medical condition that appeared to be an asthma attack at the time, but that does not warrant that Jason strangled her. Am I on the wrong side? Do people seriously think Mollys innocent ?",
        "upvotes": 632,
        "comments": 445,
        "media": null,
        "permalink": "/r/netflix/comments/1kou98z/a_deadly_american_marriage/"
    },
    {
        "id": "1kpz8bu",
        "author": "Beneficial-Exam-770",
        "title": "Where can I watch all the netflix interactives?",
        "content": "All the Netflix interactives were removed a few months ago but I know they can be archived by time stamps but the only ones I can find are the minecraft story mode netflix port",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kpz8bu/where_can_i_watch_all_the_netflix_interactives/"
    },
    {
        "id": "1kpp9hm",
        "author": "bestie_curiosa",
        "title": "Secrets We Keep",
        "content": "Wanted to share this fb post about the TV series.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kpp9hm/secrets_we_keep/"
    },
    {
        "id": "1kpwd8p",
        "author": "chopchop7",
        "title": "w/e I'm watching, netflix won't autoplay next episodes (error code NSES-UHX)",
        "content": "So just said on the title, I keep encountering **NSES-UHX** error code after the end of episode and the error triggered during autoplay counter for next episode.\n\nI did clear the cache, up-to-date chrome browser but it keeps happening. I mean I can easily reload the next episode by refreshing the browser- but it is still pain in the ass that if you have to do that all time.\n\nDoes anyone have an idea or fix regarding the issue :( ?\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kpwd8p/we_im_watching_netflix_wont_autoplay_next/"
    },
    {
        "id": "1kpubs8",
        "author": "9kLevix",
        "title": "Total Drama Seasons Available in Canada",
        "content": "I noticed that total drama on my tv only has season 1 at the moment, before it had all the seasons up to the ridonculous race. I searched it up online and everywhere says that Canada has all the seasons but I’m in Canada and I don’t? Is this how it is for everyone else in Canada or is my Netflix glitching?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kpubs8/total_drama_seasons_available_in_canada/"
    },
    {
        "id": "1kptpjl",
        "author": "Longjumping_Land_977",
        "title": "Crime scene photos from death of Jason Corbett resurface after A Deadly American Marriage",
        "content": "",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1kptpjl/crime_scene_photos_from_death_of_jason_corbett/"
    },
    {
        "id": "1kpfcs6",
        "author": "beautifulshilo",
        "title": "Netflix's A Deadly American Marriage: Jason Corbett &amp; Molly Martens",
        "content": "Bumped into the A Deadly American Marriage last night and was left intrigued. Especially because Molly and her dad are free. How??? ",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kpfcs6/netflixs_a_deadly_american_marriage_jason_corbett/"
    },
    {
        "id": "1koyb3w",
        "author": "kitabenita20",
        "title": "Liver king",
        "content": "Hey everyone, starting a new thread because the current one is under joe Rogan and that doesn’t make a lot of sense. For anyone who watched this doc and thought that something didn’t feel right about these kids and their situation-you’re not alone. Here’s what I saw-children who are in, essentially, an isolated cult where they have to think like their parents and abide by some insane rules or they’ll be rejected. They have to eat raw liver, raw testicles, raw innards, and apparently 15 raw eggs a day. Didn’t seem like there’s any additional food in the house or in their diet. Sleeping on wood slats, not allowed to wear proper clothing or shoes. When they were pretending to kill a cow (because it had already been shot) the men who weren’t part of the family and out there were in LAYERS-coats and warm clothing while the children were barefoot and in shorts and T shirts. The mom admitted that the son had a compound fracture in one of his legs that didn’t get medical attention for at least 24 hours because “pain won’t kill you”. She framed it\nLike he didn’t ask but that’s a lie. That child was either too afraid to ask for help or she told him “pain won’t kill you”. The whole thing smacks of child abuse-physical and psychological. Clearly CPS has already been involved because he brought it up but then lied and said they got there, saw the kids and said “what am I doing here? These kids are fine and left two minutes later”. That’s what a pathological liar would say-he’s making up stories. Kind of like the rest of his entire life-his wife might be even worse as an enabler and someone who supports the lies and admits that she’d never come clean on the lies. Those children seem extremely isolated and forced to live in this insane reality their mentally ill but extremely rich father is enforcing. I called CPS and filed a report. I\nEncourage anyone who shares these concerns to do the same. Yes, it’s wild to file a report based on a Netflix doc but it wouldn’t be the first time we’ve seen child abuse from content creators-far from it. These people think they’re gods and they’re sick. And ultimately the children suffer. Yes, I realize it also could be totally fake. But let CPS determine that. 1-800-252-5400 here’s their phone number, apparently his home address is 13876 longwood drive, Willis, Texas. This is public information already available online. \n",
        "upvotes": 59,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1koyb3w/liver_king/"
    },
    {
        "id": "1kpmcsr",
        "author": "SohamPlayz",
        "title": "How to watch series and movies in surround sound if you're on PC and your AVR or amplifier does not support Dolby Atmos",
        "content": "This is a solution to a problem I've had for ages and I just want to put it out here in case other people are also stuck on this problem.  \nMy AVR (Harman Kardon AVR 355) doesn't support Dolby Atmos for Home Theater. Netflix says for you to set the spatial sound effect to Dolby Atmos but when I do it, it refuses to play any sound, and even resets it's original configuration from 7.1 to 2.1.\n\n  \nHere's how I fixed it:\n\n1. Go to Windows Sound Settings and set the spatial audio to Dolby Atmos (make sure Netflix is not open during this) (It is completely normal if you don't hear anything from your speakers, we'll fix that later)\n2. Open Netflix. Netflix detects that the sound settings \"supports\" Dolby Atmos since the spatial audio is set to Dolby Atmos and makes all the 5.1 channel sounds available.\n3. Go to Windows Sound Settings, scroll down to \"More Sound Settings\" and press that. (This is from a Windows 11 perspective. On Windows 10, it is the same as going to the Sound setting in Control Panel)\n4. Right click your AVR or amplifier in the Playback tab and press \"Configure Speakers\". Set it back to your current speaker configuration (5.1 or 7.1 etc). Make sure to do this ***TWICE*** as Dolby Atmos disables at the first time, making the configuration back to 2.1.\n\nAfter that, you should be able to watch supported movies and series in 5.1 without needing Dolby Atmos!\n\nHope this helps someone!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kpmcsr/how_to_watch_series_and_movies_in_surround_sound/"
    },
    {
        "id": "1kp8kti",
        "author": "Lavep",
        "title": "Leaving soon titles",
        "content": "It absolutely boggles my mind that after so many years Netflix didn’t implement way for customers to easily search for titles that leave service soon. \nWhat’s the problem to add  option to search for all movies and tv shows that will leave service in next 30 days? Just add another tag. We can search for dramas, fantasy, sci-fi, wwe. Add another to the list ‘leaving soon’. As a matter of fact this tag is already there, we just cant search it\n\nI know there are many sites that publish this info but i don’t get it why i need to use 3rd party resource and then search each title one by one instead of seeing everything in one place and view it from the list directly\n\nAnybody else annoyed by this?",
        "upvotes": 11,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kp8kti/leaving_soon_titles/"
    },
    {
        "id": "1kpvy6y",
        "author": "National-Hurry-6254",
        "title": "I have still got this",
        "content": "https://preview.redd.it/24nvz8km6m1f1.png?width=94&amp;format=png&amp;auto=webp&amp;s=9aac59729210c0ba4e8fde7273b01e98112c8a69\n\nIt is old and I hope it never gets changed or I change since you cannot get this anymore, unless they bring back the animals section",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kpvy6y/i_have_still_got_this/"
    },
    {
        "id": "1kpvyu2",
        "author": "1VeryGenericUser",
        "title": "Is the leaked Ashley Madison data still out there?",
        "content": "I was just watching the Ashley Madison documentary and got curious what kind of data was leaked and what is still out there.\n\nBut when I googled for it, I only found one website and that doesn’t seem to be working. It was https://checkashleymadison.com and when I typed “Sam Rader” in the search bar (who is featured in the documentary for having his data leaked) it did not give any results. So I think the website might be fake?\n\nI found very little on the actual leaked data, so I’m a bit confused how the general public had access to it at the time.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kpvyu2/is_the_leaked_ashley_madison_data_still_out_there/"
    },
    {
        "id": "1kp00pj",
        "author": "Ola_maluhia",
        "title": "The Quilters",
        "content": "As a psychiatric nurse, I’ve worked in a few federal detention centers throughout my 17 year career. This was one of the most touching short films Ive ever watched. I highly recommend this 33 minute documentary on inmates who work in a max security prison and make quilts for foster kids. ",
        "upvotes": 31,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kp00pj/the_quilters/"
    },
    {
        "id": "1kputhl",
        "author": "Difficult-Owl943",
        "title": "Someone tried to cancel my account",
        "content": "I got an email from Netflix that said \"sorry to see you go! Your account will be deactivated per your request...\". I figured it was a phishing scam but when I logged into my account, it was true. \nI spoke to Netflix customer service who verified that someone spoke to them on the phone and requested my account be canceled. I asked how they verify the ID of the person requesting this and they said this person had my full credit card number. \nSo I had to cancel my credit card of course. But I'm wondering what the angle is here? Is it a way to verify if a stolen credit card number is active? \n",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kputhl/someone_tried_to_cancel_my_account/"
    },
    {
        "id": "1kpifx8",
        "author": "ForsakenVanilla123",
        "title": "Two Accounts in Two Different Countries",
        "content": "I'm thinking of buying the 2 household Netflix subscription in India, one for me and one for my sister who is abroad in Dubai. \n\nI wanted to know if this is possible or not? I've heard peolpe say that it no longer is. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kpifx8/two_accounts_in_two_different_countries/"
    }
]