[
    {
        "id": "1h57yn0",
        "author": "SanderSo47",
        "title": "November 29-December 1 Box Office Recap: 'Moana 2' debuts with a colossal $389 million worldwide, the biggest debut for an animated title. In the domestic market, 'Moana 2', 'Wicked' and 'Gladiator II' delivered the biggest Thanksgiving weekend in box office history.",
        "content": "No. | Movie | Studio | Domestic Opening | Week-to-Week Drop | Domestic Total | Worldwide Total | Budget |\n:--------:|----------|----------|:--------:|:--------:|:--------:|:--------:|:--------:\n1 | *Moana 2* | Disney | $139,787,385 | **NEW** | $225,441,826 | $389,241,826 | $150M\n2 | *Wicked* | Universal | $81,173,815 | **–28%** | $263,195,665 | $360,335,665 | $150M\n3 | *Gladiator II* | Paramount | $31,030,194 | **–44%** | $111,495,439 | $320,295,439 | $210M\n4 | *Red One* | Amazon MGM | $12,734,705 | **–4%** | $75,890,659 | $148,990,659 | $250M\n5 | *The Best Christmas Pageant Ever* | Lionsgate | $3,220,456 | **–6%** | $31,964,548 | $32,109,424 | $10M\n6 | *Bonhoeffer: Pastor. Spy. Assassin* | Angel Studios | $2,300,167 | **–54%** | $9,645,724 | $9,645,724 | N/A\n7 | *Venom: The Last Dance* | Sony | $2,222,577 | **–43%** | $137,885,451 | $468,185,451 | $120M\n8 | *Heretic* | A24 | $956,797 | **–57%** | $26,820,699 | $37,574,080 | $10M\n9 | *The Wild Robot* | Universal | $700,830 | **–67%** | $142,525,620 | $321,756,620 | $10M\n10 | *A Real Pain* | Searchlight | $655,910 | **–39%** | $6,112,534 | $7,083,173 | N/A\n\nTo say that it was a great Thanksgiving weekend would be selling it short.\n\n***Moana 2*** surpassed every expectation and delivered a record-breaking debut for the Thanksgiving weekend. And with the aid of ***Wicked*** and ***Gladiator II***, it was the busiest weekend of the year.\n\nThe Top 10 earned a combined $269.2 million this weekend ($412.8 million five-day). That's not just a colossal 210% up from last year, but it's also the biggest Thanksgiving weekend ever.\n\nDebuting on top, ***Moana 2*** earned a colossal $139.7 million in 4,200 theaters. Adding its numbers from Wednesday, the debut rises to $225.4 million in five days. It broke so many records, including the biggest debut for a Walt Disney Animation Studios film debut, as well as the highest Thanksgiving weekend. But most importantly; it beat ***The Super Mario Bros. Movie*** ($204.6 million) for the biggest Wednesday-to-Sunday debut. \n\nA fantastic debut all around, and it shouldn't be a surprise. If you've followed the Top 10 charts on streaming, you'll find that ***Moana*** has been one of the most streamed films in the past years. It was even reported that it was the most streamed film across all services last year. Needless to say, ***Moana*** became far more popular with years, and audiences hoped for a sequel to come.\n\nDisney, for some reason, was interested in doing it but only as a TV show for Disney+. In February 2024, it was revealed that the show was retooled into a film that would hit theaters this Thanksgiving. With an extensive marketing campaign, Disney successfully got people into giving this film a chance. \n\nAccording to Disney, 65% of the audience was female, and 60% was 18 and over. Critics were not enthused with the film, and it currently sits at 64% on RT. The audience was more forgiving, giving it an \"A–\" on CinemaScore, although that falls on the lower end of WDAS titles. There are no animated titles on its way until ***Dog Man*** in January, so it can leg out through the holidays. $500 million is pretty much guaranteed, and can go as high as $600 million if it can hold very well.\n\nAfter defying gravity on its opening weekend, ***Wicked*** continued flying high. It earned $81.1 million this weekend ($118.2 million five-day). That marks an insane 28% drop, which breaks the record set by ***Top Gun: Maverick*** (29%) as the smallest drop for a $100+ million opener. Of course, ***Maverick*** achieved that record on the weekend after Memorial Day, but it didn't face a $100+ million opener on its second weekend.\n\nThrough ten days, ***Wicked*** has earned a colossal $263.1 million domestically. It's already the highest grossing Broadway musical adaptation, passing ***Grease*** ($188 million). Of course, ***Grease*** is still ahead in terms of adjusted inflation ($770 million), but ***Wicked*** remains a colossal success. It should hit $400 million without any problem, and the holidays can help it get close to $500 million by the end of its run.\n\nParamount's ***Gladiator II*** added $31 million this weekend. That represents a 44% drop, which is fine, but not fantastic considering how well the other holdovers did. Through 10 days, Ridley Scott's sequel has earned $111.4 million, passing ***Robin Hood*** and ***Black Hawk Down*** to become Scott's 6th highest grossing film domestically. The film should finish with over $150 million domestically, quite down from the original's $187 million lifetime gross.\n\nAfter a steep second weekend drop, Amazon MGM's ***Red One*** eased a light 4%, adding $12.7 million this weekend. The film has earned $75.8 million so far, and depending on next week's drop, it could still hit $100 million. Although it's hard to call this a bonafide hit considering its colossal $250 million budget.\n\nLionsgate's ***The Best Christmas Pageant Ever*** was still on the Top 5, easing just 6% and adding $3.2 million. The film has earned $31.9 million domestically.\n\nIn sixth place, Angel Studios' ***Bonhoeffer: Pastor. Spy. Assassin*** fell 54% and added $2.3 million this weekend ($3.3 million five-day). That's a very weak drop, especially considering it had Thanksgiving. Through ten days, the film has amassed $9.6 million and will close with less than $15 million.\n\n***Venom: The Last Dance*** is still holding well, dipping 43% this weekend and adding $2.2 million. The film has amassed $137.8 million so far, which is still far behind the previous ***Venom*** films.\n\nA24's ***Heretic*** continues falling. This weekend, it fell 57% and added $956K this weekend. With $26.8 million in the bank, it's now gonna finish below $30 million.\n\nIn the face of ***Moana 2***, DreamWorks' ***The Wild Robot*** had its worst drop yet. It collapsed 67% this weekend, adding $700,000 to its run. The film has earned $142.5 million, and it's nearing the end of its run.\n\nRounding up the Top 10 was Searchlight's ***A Real Pain***, which recovered after its weak drop last weekend. The film dipped 39%, grossing $655,910 this weekend. The film has earned just $6.1 million, and barring some huge Oscar noms, it looks like it might miss $10 million.\n\nOutside the Top 10 was Focus Features' ***Conclave***, which dipped 46% and earned $616,955 this weekend. That takes its domestic total to $30.1 million domestically. A damn great run for an adult drama.\n\nNeon's ***Anora*** is winding down, and it's now playing in just 230 theaters. This weekend, it dipped 43% and added $385,292. Its domestic total stands at $12.7 million.\n\nA24 debuted Luca Guadagnino's ***Queer*** in 7 theaters, earning $188,808. That translates to a $26,973 per-theater average, which is quite middling (it barely cracks the top 20 highest PTA of the year). For comparison, it's barely above ***Bones and All*** ($24,201), and far below ***Suspiria*** ($92,019) and ***Call Me By Your Name*** ($103,233). The film will continue expanding through the holidays.\n\n#**OVERSEAS**\n\nThe records don't stop just in America for ***Moana 2***.\n\n***Moana 2*** debuted with a colossal $163 million overseas, which means it debuted with $389.2 million worldwide. That broke ***Mario***'s record ($377 million) for the biggest animated debut in history. The biggest markets were France ($18.8M), UK ($15.5M), Mexico ($11.1M), Germany ($10.5M), Italy ($9.3M), South Korea ($9.1M), Australia ($8.3M), Brazil ($7.5M), China ($6.5M) and Spain ($5.5M). An easy billion right here, ladies and gentlemen. \n\n***Wicked*** is a monster hit domestically, but that popularity hasn't fully connected with the rest of the world. This weekend, the film earned $29 million from the overseas markets, taking the worldwide total to $360.3 million. It's still killing it in the UK ($36M) and Australia ($12.9M), and it has performed well in South Korea ($8.5M), Mexico ($6.7M), and Philippines ($3.5M). The rest of the markets... not so much. While it still has some markets left, the film will be domestic-heavy. The film is cleary a hit, but it's crazy how the domestic market represents a huge 73% of its worldwide gross.\n\n***Gladiator II*** added $27.2 million this weekend, and its worldwide total is now $320.2 million. The best markets are the UK ($29.7M), France ($22.5M), Spain ($15M), Mexico ($12.9M) and Australia ($11.5M). The film should pass the original's $272 million foreign gross, but it's unlikely it can pass its worldwide gross ($460 million).\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Beetlejuice Beetlejuice* | Sep/6 | Warner Bros. | $111,003,345 | $294,100,435 | $450,053,961 | $100M\n*Saturday Night* | Sep/27 | Sony | $3,400,583 | $9,509,312 | $9,752,378 | $25M\n*Terrifier 3* | Oct/11 | Cineverse | $18,928,113 | $53,981,071 | $94,436,616 | $2M\n\n- 36 years in the making and it paid off, as ***Beetlejuice Beetlejuice*** closed with a fantastic $294 million domestically, finishing as Burton's second highest grossing film, just a little behind ***Alice in Wonderland*** ($334 million). Interestingly, that popularity wasn't as strong overseas, as the domestic market represented 65.3% of its worldwide gross. It's still a great $450 million worldwide, although ***Alice*** ($1 billion) and ***Charlie and the Chocolate Factory*** ($474 million) finished far higher. Despite a few duds here and there, Tim Burton is still as popular as he's ever been.\n\n- ***Saturday Night Live*** might be popular 50 years later, but that doesn't mean the audience is interested in a film depicting its first ever broadcast. That was the case for Jason Reitman's ***Saturday Night***, which closed with a very poor $9.5 million domestically. The film was positioned as an Oscars contender, but the film fizzled out by the time it hit wide release and faded quickly. Don't expect the rest of the world to save it, given that ***Saturday Night Live*** isn't as popular as the States. \n\n- Last month, we had two movies revolving around a clown as its protagonist. ***Joker: Folie à Deux*** became one of the worst received comic book films of all time, allowing Art the Clown to emerge as the winner of the month. And now, ***Terrifier 3*** has closed with a damn fantastic $94 million worldwide, making it the highest grossing unrated film ever. Shattered the ceilling of what a film like this could achieve, and elevating Art to one of the most iconic horror villains of modern times. Damien Leone has already confirmed a fourth film is coming up. Art in space when?\n\n#**THIS WEEKEND**\n\nThe post-Thanksgiving weekend is usually a dumping ground for studios. With the Christmas season kicking off, people are busy, which is why studios avoid releasing anything big. It's up to the small films to get a chance. This weekend, we have two newcomers and none of them stand a chance in dethroning ***Moana 2***. None will even touch $10 million this weekend.\n\nThe only one with a confirmed wide release is A24's ***Y2K***, which marks Kyle Mooney's debut as writer and director. The film stars Jaeden Martell, Julian Dennison, Rachel Zegler, Fred Durst, and Alicia Silverstone, and depicts an imaginative version of the Year 2000 problem, where a bug causes all technology to come to life and turn against humanity. The film has received mixed reviews (63% on RT), and horror comedies have not performed well as of late. We'll see how it does, but a debut under A24's ***Heretic*** ($10.8 million) seems pretty much imminent.\n\nThe other film, although in far less theaters, is Searchlight's ***Nightbitch***. A film that stars Amy Adams as a mother who transforms into a dog. Like, seriously. Y'all complain about lack of originality in Hollywood? Well, here's a very unique premise. Reviews are quite similar to ***Y2K***, and marketing has been very limited so far. This suggests it won't be a very wide release.\n\nAnd for those curious, Christopher Nolan's ***Interstellar*** is returning to theaters this Friday for a limited time on IMAX screens. You should hurry up, for screenings are quickly getting sold out.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice, where a slightly altered version of this write-up can be found.",
        "upvotes": 46,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1h57yn0/november_29december_1_box_office_recap_moana_2/"
    },
    {
        "id": "1h0uf7h",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Gladiator II / Wicked: Part I / Moana 2)",
        "content": "[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/?)\n\n[Wicked: Part I](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/?)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/?)",
        "upvotes": 88,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1h0uf7h/official_discussion_megathread_gladiator_ii/"
    },
    {
        "id": "1h5bixd",
        "author": "flowerhoney10",
        "title": "‘2000 Mules’ creator admits some of film’s claims are flawed",
        "content": "",
        "upvotes": 1901,
        "comments": 179,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SOVNgwWvG1bA4BgeUSQSDFR_HcxulhqmxvVPbRqQ1Q4.jpg?auto=webp&amp;s=bb96f86cf68887c407233210669fa412ac7aeabd"
        },
        "permalink": "/r/movies/comments/1h5bixd/2000_mules_creator_admits_some_of_films_claims/"
    },
    {
        "id": "1h4ziry",
        "author": "NonCorporealEntity",
        "title": "Modern tropes you're tired of",
        "content": "I can't think of any recent movie where the grade school child isn't written like an adult who is more mature, insightful, and capable than the actual adults. It's especially bad when there is a daughter/single dad dynamic. They always write the daughter like she is the only thing holding the dad together and is always much smarter and emotionally stable. They almost never write kids like an actual kid. \n\nWhat's your eye roll trope these days? ",
        "upvotes": 8618,
        "comments": 4784,
        "media": null,
        "permalink": "/r/movies/comments/1h4ziry/modern_tropes_youre_tired_of/"
    },
    {
        "id": "1h56dn8",
        "author": "MarvelsGrantMan136",
        "title": "Robert Eggers' 'Nosferatu' - Review Thread",
        "content": "'Nosferatu' - Review Thread\n\n* [Rotten Tomatoes](https://www.rottentomatoes.com/m/nosferatu_2024) \\- 96% (52 Reviews)\n* [Metacritic](https://www.metacritic.com/movie/nosferatu-2024/) \\- 83 (24 Reviews)\n\nReviews:\n\n[Variety](https://variety.com/2024/film/reviews/nosferatu-review-robert-eggers-lily-rose-depp-1236222769/):\n\n&gt;Visually striking as it is, with compositions that rival great Flemish paintings, the obsessive director’s somber retelling of F.W. Murnau’s expressionistic vampire movie is commendably faithful to the 1922 silent film and more accessible than “The Lighthouse” and “The Witch,” yet eerily drained of life.\n\n[Deadline](https://deadline.com/2024/12/nosferatu-review-robert-eggers-lily-rose-depp-nicholas-hoult-gothic-vampire-romance-1236191438/):\n\n&gt;Nosferatu may not click instantly, but, aside from the technical brilliance that superbly renders the late-19th century, there’s a baked-in longevity in its thinking that will surely keep people coming back.\n\n[Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/nosferatu-review-bill-skarsgard-lily-rose-depp-nicholas-hoult-robert-eggers-1236074321/) (100):\n\n&gt;Every age gets its definitive film of Stoker’s vampire legend. Eggers has given us a magnificent version for today with roots that stretch back a century.\n\n[Collider ](https://collider.com/nosferatu-2024-review/)(9/10):\n\n&gt;Nosferatu shows Robert Eggers at the height of his powers, building an atmosphere of choking menace anchored by magnificent turns from Lily-Rose Depp and Bill Skarsgard.\n\n[The Wrap](https://www.thewrap.com/nosferatu-review-robert-eggers-bill-skarsgard-dracula/):\n\n&gt;Robert Eggers may not have rewritten the book of “Nosferatu,” and much of the film plays more like an update than a wholly new take, but he does justice to this material. And he does more than justice to Orlock: Eggers and Skarsgård give him new (un)life, empowering him in ways that make all the rest of us feel powerless.\n\n[IndieWire](https://www.indiewire.com/criticism/movies/nosferatu-review-robert-eggers-lily-rose-depp-1235071494/) (A-):\n\n&gt;Eggers’ broadly suggestive script doesn’t put too fine a point on the specifics of Ellen’s repression, but Depp’s revelatory performance ensures that the rest of the movie doesn’t have to.\n\n[Empire](https://www.empireonline.com/movies/reviews/nosferatu-2024/) (4/5):\n\n&gt;Despite its familiar story beats, Eggers’ retelling suffocates like a coffin, right up to its chilling final shot. Lily-Rose Depp is full-bloodedly committed, and Bill Skarsgård’s fiend gorges with terrible fury.\n\n[Bloody-Disgusting](https://bloody-disgusting.com/reviews/3847134/nosferatu-review-robert-eggers-macabre-masterpiece/) (5/5):\n\n&gt;It’s operatic and dramatic, bold and revolting, with a powerful final shot for the ages. And Eggers’ *Nosferatu* happens to be set over Christmas. That all but ensures this macabre masterpiece is destined to become a new holiday horror classic.\n\n[Total Film](https://www.gamesradar.com/entertainment/horror-movies/nosferatu-review/) (4/5):\n\n&gt;Nosferatu delivers a relatively straight re-telling of this classic gothic tale. It looks and sounds stunning and is packed with vampiric horror. It doesn't push many boundaries but if you wanted the classic Dracula narrative feeling exactly like it’s directed by Robert Eggers, you're going to love it.\n\n[IGN](https://www.ign.com/articles/nosferatu-review?utm_source=threads,twitter) (9/10):\n\n&gt;Nosferatu is Robert Eggers' finest work, given how it both boldly stands on its own as a gothic vampire drama and astutely taps into the original texts — F.W. Murnau's silent classic and Bram Stoker's novel Dracula.\n\nThe Independent (100):\n\n&gt;Depp does magnificent work in embodying the sense of existing out of place, not only in the violent contortions and grimaces of supernatural possession, but in the way Ellen’s gaze seems to look out beyond her conversation partner and into some undefinable abyss.\n\nWritten and Directed by Robert Eggers:\n\n&gt;*Nosferatu* is a gothic tale of obsession between a haunted young woman and the terrifying vampire infatuated with her, causing untold horror in its wake.\n\nRelease Date: December 25\n\nCast:\n\n* Bill Skarsgård as Count Orlok\n* Nicholas Hoult as Thomas Hutter\n* Lily-Rose Depp as Ellen Hutter\n* Aaron Taylor-Johnson as Friedrich Harding\n* Emma Corrin as Anna Harding\n* Willem Dafoe as Prof. Albin Eberhart Von Franz\n* Ralph Ineson as Dr. Wilhelm Sievers\n* Simon McBurney as Herr Knock",
        "upvotes": 2282,
        "comments": 357,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8YRf9DL2t2vlPuXNMq8sNrlvKPVbqykBtxeOP4wJpaY.jpg?auto=webp&amp;s=49bcee9cdbf48491944d679a54058077ea2e8309"
        },
        "permalink": "/r/movies/comments/1h56dn8/robert_eggers_nosferatu_review_thread/"
    },
    {
        "id": "1h50bik",
        "author": "SemolinaPilchards",
        "title": "I've discovered Colin Farrell's birth-right",
        "content": "Colin Farrell has played the same character as Arnold Schwarzenegger (Quaid in Total Recall) \n\n\nBut these guys look nothing alike.\n\n\n\nColin Farrell has played the same character as Danny DeVito (The Penguin)\n\n\nThese guys look nothing alike.\n\n\nBut we all know Arnie and DeVito are Twins. So perhaps Colin Farrell is the missing triplet all along!",
        "upvotes": 2223,
        "comments": 80,
        "media": null,
        "permalink": "/r/movies/comments/1h50bik/ive_discovered_colin_farrells_birthright/"
    },
    {
        "id": "1h56i3v",
        "author": "BunyipPouch",
        "title": "First Poster for 'The Last Showgirl' - Starring Pamela Anderson, Jamie Lee Curtis, Dave Bautista, Kiernan Shipka, Jason Schwartzman &amp; Billie Lourd - Directed by Gia Coppola ('Palo Alto') - After a successful thirty-year run, a Vegas showgirl must plan her future after the show closes abruptly.",
        "content": "",
        "upvotes": 913,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ty0h7r4q7i4e1.jpeg?auto=webp&amp;s=8fc070d1b6f39a9b5e6ae3a5a5995c7c3d60fdae"
        },
        "permalink": "/r/movies/comments/1h56i3v/first_poster_for_the_last_showgirl_starring/"
    },
    {
        "id": "1h5aizw",
        "author": "ZiggyStardust996",
        "title": "Can Americans tell British/OZ/NZ actors doing American accents?",
        "content": "Hi everyone,\n\nQuestion to the Americans, can you tell non-Americans accents when they try to mask it?\n\nI'm not talking about the A-level actors like Christian Bale, Damian Lewis, Daniel Day-Lewis, Anthony Hopkins and Idris Elba.\n\nNor the ones with horrible accents like Michael Caine and Charlie Hunnam (no idea what accent he has, he's bad at every possible accent)\n\nBut other actors whom you've seen for the first time, someone like Stephen Graham or early Tom Hardy and Hemsworth brothers. Is the accent noticeable?\nWhich ones you didn't know about and which ones were obvious?\n\nI'm interested in your pov.",
        "upvotes": 519,
        "comments": 1033,
        "media": null,
        "permalink": "/r/movies/comments/1h5aizw/can_americans_tell_britishoznz_actors_doing/"
    },
    {
        "id": "1h57hov",
        "author": "DevilishTrenchCoat",
        "title": "Saving private ryan, 1998. How was the experience of watching It at the cinema when It came out? ",
        "content": "One of the best war movies I've seen and one of the most influential of the genre. Impressive even today. \n\nI was simply too young when It came out so I watched It years later after buying the DVD. It really made an impression on me, even on a shitty tv. I can only imagine how incredible must've been watching It and hearing It at the cinema.\n\nCheers!",
        "upvotes": 466,
        "comments": 788,
        "media": null,
        "permalink": "/r/movies/comments/1h57hov/saving_private_ryan_1998_how_was_the_experience/"
    },
    {
        "id": "1h52tli",
        "author": "Peter_Omun",
        "title": "The original April O'Neil, Judith Hoag, got top billing in the very successful \"Teenage Mutant Ninja Turtles\" (1990), and was a co-lead. Yet, unlike the Turtles, the leading lady didn't come back for the sequels. What happened?",
        "content": "I grew up watching \"Teenage Mutant Ninja Turtles\", it was among my favorite childhood films. It was entertaining, engrossing, funny, thrilling and even moving. \n\nAs engaging and charismatic as the Turtles were, April O'Neil, their human friend, wasn't sidelined as the \"token chick\". April had her own agency, she was smart and spunky and funny while never taking the spotlight away from the Turtles. She also had a romantic subplot with Casey Jones, played by Elias Koteas, and their scenes together sizzle with humorous chemistry. \n\nI liked Judith Hoag a lot, she'll always be April O'Neil. Unfortunately, Judith Hoag didn't return, she got recast with Paige Turco for the sequels and unlike Hoag, Turco was more supporting instead of a co-lead. Turco wasn't bad, she did the best with what she got, yet Hoag had a charm which was lacking in Turco's April. \n\nI've never found a proper reason of why Hoag didn't return. The most I got was Hoag quit because she disapproved of the \"violence\" in the film, which I don't get. It's a martial arts film about antromorphic Turtles, she wasn't given the script for \"Teletubbies\".",
        "upvotes": 563,
        "comments": 189,
        "media": null,
        "permalink": "/r/movies/comments/1h52tli/the_original_april_oneil_judith_hoag_got_top/"
    },
    {
        "id": "1h4lazw",
        "author": "Naweezy",
        "title": "Margot Robbie Reveals ‘Wolf of Wall Street’ Full-Frontal Nude Scene Was Her Idea",
        "content": "",
        "upvotes": 13064,
        "comments": 898,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/R2X-MiMBSvGQC6r8tC62MVuOeVR9V8NFRZBTF3yunqk.jpg?auto=webp&amp;s=7ab1c22b90e30d381764e29886feba90660ed71c"
        },
        "permalink": "/r/movies/comments/1h4lazw/margot_robbie_reveals_wolf_of_wall_street/"
    },
    {
        "id": "1h5bkb3",
        "author": "MarvelsGrantMan136",
        "title": "Doug Liman Confirms Tom Cruise’s Involvement With Supernatural Thriller ‘Deeper’",
        "content": "",
        "upvotes": 141,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/v3cuipTsQR6ETdi766ASwcTRdEhw8UhqKa9U-jlIcPg.jpg?auto=webp&amp;s=3c4009bbd8e571cf093e623ab224051714f3f779"
        },
        "permalink": "/r/movies/comments/1h5bkb3/doug_liman_confirms_tom_cruises_involvement_with/"
    },
    {
        "id": "1h5d41h",
        "author": "apple15332",
        "title": "They Live (1988) and it's concept ",
        "content": "It was in my watchlist for such a long time, finally decided to watch it and blew me away completely. John Carpenter is a visionary! Has anyone of you saw it in the theatres? Or were you there when it was released?\n\nHave you seen Men In Black or The Matrix or Fight Club? This movie felt like it had all of that! And maybe somewhat an inspiration for the movie I mentioned.\n\nThey Live dir. By *John Carpenter* is a story of a man, played by Roddy Piper who has come to City in search of a job, but is shocked when he sees the _*reality of this world*_. There are aliens living among us, and they are controlling everything.\n\nAdvertisements, News Channels, Politics, everything... everything is a LIE. They are controlling us with different mediums, changing our Subconscious mind and bending our reality, turning us into servants, into Livestock. \n\n_\"We are Sleeping, They are living.\"_\n\nIf you're someone who is into Illuminati, Secret Society, you'll love this film.\n\nThough some moments felt janky in acting, but that's because the lead is probably the first WWF Turned Actor. Also there is this lovely action scene which was EXHAUSTING (in a good way) because how real it felt.\n\nThis movie is more than relevant today ever before. Because we see so many influencers and internet personalities talking nonsense and even turning the real point.\n\nThe runtime is about 1hr 30mins, and even if you watch this type of films or not, you should watch it just for the concept.",
        "upvotes": 69,
        "comments": 31,
        "media": null,
        "permalink": "/r/movies/comments/1h5d41h/they_live_1988_and_its_concept/"
    },
    {
        "id": "1h5d6sd",
        "author": "BunyipPouch",
        "title": "Gotham Awards: 'A Different Man' Wins Best Picture, Colman Domingo &amp; Clarence Maclin Win Best Actor Prizes for 'Sing Sing', 'His Three Daughters' Wins Best Screenplay, RaMell Ross Wins Best Director for 'Nickel Boys', Vera Draw Wins Best Breakthrough Director for 'The People's Joker'",
        "content": "",
        "upvotes": 66,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YhjV5ddoCRkmRnoVGiMmNEexXv2YpSxO2n43uMTzJ_E.jpg?auto=webp&amp;s=def7b8f31db7b6fa1ca9ab1aa20502575541fd68"
        },
        "permalink": "/r/movies/comments/1h5d6sd/gotham_awards_a_different_man_wins_best_picture/"
    },
    {
        "id": "1h4xlq1",
        "author": "johntentaquake",
        "title": "Christmas Vacation is 35! Where’s the Tylenol?",
        "content": "",
        "upvotes": 495,
        "comments": 153,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0nbrQ0mmdRI8_75EGLp2lDg-z26zpBdBKJeWYFY58JI.jpg?auto=webp&amp;s=ed6c159875b99f89bad1a93dad79d2978589776c"
        },
        "permalink": "/r/movies/comments/1h4xlq1/christmas_vacation_is_35_wheres_the_tylenol/"
    },
    {
        "id": "1h5d1po",
        "author": "henrygatz",
        "title": "Scenes that need to be freeze-framed because blink and you missed it.",
        "content": "I don't mean movies that have freeze frames themselves, like Clark punching the air at the end of The Breakfast Club. More like you choosing to pause the movie at a particular scene because it's revealing in some way interesting or revelatory or funny. Basically scenes that contain details you may miss the first time viewing.\n\nFor example there is that famous head splitting scene from T2 that you need to freeze the frame to see. Guy's head splits before being shot at. [https://i.imgur.com/cWZlQCg.png](https://i.imgur.com/cWZlQCg.png)\n\nBut I prefer more focus on interesting details in scenes than \"mistakes.\"\n\nLike in Kubrick's Eyes Wide Shut, there are several scenes that need to be freezed, such as one involving Tom reading the paper. Sort of easter egg hunt thing.\n\nDo you have any you like to share?",
        "upvotes": 59,
        "comments": 109,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qYWCQezKWsZWgh5-l-SAUPYqwu1azwJB8jtQIXrgxx4.png?auto=webp&amp;s=4ac824c8b1c95a311239fff3ae83094e4eacb9c6"
        },
        "permalink": "/r/movies/comments/1h5d1po/scenes_that_need_to_be_freezeframed_because_blink/"
    },
    {
        "id": "1h5322l",
        "author": "MarvelsGrantMan136",
        "title": "Mike Flanagan's 'The Life of Chuck' Sets May 30, 2025 Release Date",
        "content": "",
        "upvotes": 211,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JBf62N6cibxvm9po5-7qciP7bqVgqhaCZReCklzWnKw.jpg?auto=webp&amp;s=dc18b2394356aa6b42415238505aa51073455118"
        },
        "permalink": "/r/movies/comments/1h5322l/mike_flanagans_the_life_of_chuck_sets_may_30_2025/"
    },
    {
        "id": "1h4z3fs",
        "author": "KillerCroc1234567",
        "title": "Legendary Conservationist Jane Goodall’s Life To Be Made Into A Movie; Appian Way Developing For Disney With ‘The Luminaries’ Scribe Eleanor Catton Penning The Screenplay",
        "content": "",
        "upvotes": 317,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kGjHvc2m0u-q64erlyu_R2fi-8MQLSMidyOhMpl6WCQ.jpg?auto=webp&amp;s=60fdd227fd63ac0566c884571f830d9134ba0d1f"
        },
        "permalink": "/r/movies/comments/1h4z3fs/legendary_conservationist_jane_goodalls_life_to/"
    },
    {
        "id": "1h4zhqt",
        "author": "HeightsGringo180",
        "title": "Heat (1995)….Most beautiful movie line I’ve heard ",
        "content": "In Heat… there’s 2 parts that stick out to me… many great scenes overall\n\nBut when Val Kilmer’s character tells DeNiro “for me the sun rises and sets with her” when talking about his wife and why he can’t leave her. Then at the end… they are both in a relationship where they fight a lot.. both have been unfaithful and she’s ready to turn him in. But when she sees his innocent genuine smile when he sees her, she can’t bring herself to go against him and realizes she still loves him despite all their issues and signals to him to run away. I loved that dynamic\n\nAlso the part where the Dennis Heybert’s character (the AllState commercial guy) is sitting with his gf and he feels like a failure. He tells her “why you rolling around with me for?” and starts crying. And she reassures him and tells him because she’s proud of him for trying. \n\n2 scenes/dynamics that are relatable and just hit deep. One is a relationship that has had many issues and in turmoil but deep down, the two still love eachother. The other is a man who feels like he can’t offer nothing and the woman is reassuring him that he is enough.",
        "upvotes": 239,
        "comments": 168,
        "media": null,
        "permalink": "/r/movies/comments/1h4zhqt/heat_1995most_beautiful_movie_line_ive_heard/"
    },
    {
        "id": "1h4xxa3",
        "author": "TravellingBeard",
        "title": "Who is your favorite movie villain where the actor was a delight and lovely human being in real life?",
        "content": "My gold standard is Louise Fletcher as Nurse Ratched (and for the trekkies here, as Kai Winn in Deep Space Nine... another \"God I hate that character\" role). \n\nIn real life, I heard nothing but praise about how kind and pleasant and unbothered she was before she sadly passed away.\n\nAnother candidate is Alan Rickman who is my favorite Christmas villain (Die Hard and Love Actually) who was loved by nearly everyone who knew him.\n",
        "upvotes": 286,
        "comments": 398,
        "media": null,
        "permalink": "/r/movies/comments/1h4xxa3/who_is_your_favorite_movie_villain_where_the/"
    },
    {
        "id": "1h4w7lg",
        "author": "Bennett1984",
        "title": "From Roger Moore With Love (2024) | Official Trailer",
        "content": "",
        "upvotes": 313,
        "comments": 112,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kgsOVSGBIGYagr9voByayxhwf_j7VI3AvaAJko9tWak.jpg?auto=webp&amp;s=930e9292e2ebd1299a8eb7f8b8281013dc93bdce"
        },
        "permalink": "/r/movies/comments/1h4w7lg/from_roger_moore_with_love_2024_official_trailer/"
    },
    {
        "id": "1h525fk",
        "author": "BunyipPouch",
        "title": "'Heavier Trip' - Official Trailer - Metal band Impaled Rektum breaks out of prison to perform at a major festival and save their guitarist's home, facing obstacles from police and a record exec.",
        "content": "",
        "upvotes": 97,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3HpnX-ZS4RYWoX_mmP8Poz1WDL3zrGyD0dAdXigtouE.jpg?auto=webp&amp;s=14899a833377fc3a8552b92792511a0943fd0deb"
        },
        "permalink": "/r/movies/comments/1h525fk/heavier_trip_official_trailer_metal_band_impaled/"
    },
    {
        "id": "1h4rynx",
        "author": "Peter_Omun",
        "title": "\"Pleasantville\" was unexpected. What started out as a seemingly conventional comedy became a social commentary about conventional vs modernism",
        "content": "Tobey Maguire's character yearning for the conventional world of the B&amp;W traditionl family values, he comes off as a Ben Shapiro-type without the bigotry, yet when he enters the world, he realizes his vision of the cookie cutter dimension isn't what he assumed to be. \n\nOddly enough, the bigger transformation happens with his vapid sister, played by Reese Witherspoon, who manages to have the biggest growth in the story as she realizes she has goals she wishes to accomplish and ends up embracing the B&amp;W universe she previously rejected. \n\nJoan Allen is fantastic, though. The scene of her character discovering what an orgasm is and how it ends up changing her skin color? Superb directing.",
        "upvotes": 431,
        "comments": 51,
        "media": null,
        "permalink": "/r/movies/comments/1h4rynx/pleasantville_was_unexpected_what_started_out_as/"
    },
    {
        "id": "1h5gwd2",
        "author": "neuro_space_explorer",
        "title": "It’s about time we talk about LA Story (1991) written and starring Steve Martin, is this his best comedy? ",
        "content": "I remember watching this with my parents when I was younger, prob around 95. I was born 88 so I didn’t have any ability to pick up any of the satire but I remember enjoying it.\n\nI have a bad habit of not rewatching movies I’ve seen since there’s so much out there, no matter how young I was when I first saw it, but my wife showed me a clip from the film off Instagram and we laughed and decided to give it a try and let me tell you it blew us away. We were crying laughing while totally engaged. \n\nIt’s a perfect LA satire and probably the only American Magical Realism film I’ve ever seen (I’m more familiar with the genre coming from Mexico).  Everything is pitch perfect. It’s a tight 91 minutes, edited beautifully, perfect writing from Steve Martin, directed as only I could imagine it and the casting is insane. Every side character and bit part is an amazing character actor from the 90s. \n\nAnd the leads are played beautifully by Richard Grant who I know from his performance in Withnail and I. Victoria tennent plays the love interest who is a beautiful actress who got stuck with bad roles most her career, but honestly Sarah Jessica Parker steals the show with her pre-emptive manic pixie dream girl. \n\nI think this is a movie that although critically acclaimed went over most peoples heads and was forgotten. But I sit here now thinking it’s just leapt to my favorite comedy of all time. It’s so sharp and witty and well executed and magical and of it’s time. I don’t think anyone can argue that Steve Martin is a comedic writing force and it shows in this movie. \n\nIf you haven’t seen it watch it as soon as you can, if you have what do you think about my analysis and how it’s held up and its legacy. I’d love to hear your thoughts. \n\nMy favorite joke so when Sarah Jessica Parker is trying to seduce Steve Martin and guides his hand down to cup her breast. He squeezes and makes a face and says “your breasts feel weird” and she says “oh, yeah, that’s cause they are real…”\n\nLa in a nutshell. That’s my Ted talk. ",
        "upvotes": 9,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1h5gwd2/its_about_time_we_talk_about_la_story_1991/"
    },
    {
        "id": "1h4licu",
        "author": "omgyoucunt",
        "title": "Nutcrackers (2024) starring Ben Stiller ruined my day",
        "content": "https://www.imdb.com/title/tt30144381/?ref_=ext_shr_lnk  \n  \nNutcrackers is, without a doubt, the worst movie I’ve seen in years. From the psychotic children to the dull, meandering plot, to the blandest cinematography, this film does nothing but waste your time. I already can’t stand David Gordon Green for what he did to the Halloween franchise, and now I can add this to the list of things he’s ruined.\n  \nIt’s rare for me to finish a movie and genuinely wish it didn’t exist. This is one of those times. The movie’s not entertaining, it’s not dramatic, it’s just pointless. I honestly can’t believe this thing was greenlit.  \n  \nBen Stiller returns to the screen after seven years… and this is what he came back to? Either he owed someone a huge favor or needed money because this is a complete disaster. I watched it with friends and at one point, I thought it’s probably almost over. There was still an hour left. I honestly thought I might scream. But we were too deep in at that point, so we kept watching. Spoiler: none of us enjoyed it.\n  \nThis movie feels like you’re stuck in a never-ending loop, with the same boring shots, the same settings, and the same tired characters repeating over and over again for 1 hour and 45 minutes. I’ve never regretted spending time on a movie more. I’m actually angry it exists.\n  \nDo yourself a favor and don’t waste your time. You’ll probably tap out after 45 minutes anyway, so save yourself the trouble. Avoid it at all costs. ",
        "upvotes": 1359,
        "comments": 345,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sJ1UnpLpAR8MFKGzxkE5kwD0NYawQ29IdfZBRVRTWFE.jpg?auto=webp&amp;s=94f52cd589c0006230771a0b945de552e60eb9c4"
        },
        "permalink": "/r/movies/comments/1h4licu/nutcrackers_2024_starring_ben_stiller_ruined_my/"
    },
    {
        "id": "1h4j4dk",
        "author": "MarvelsGrantMan136",
        "title": "Will Ferrell Reflects On ‘Elf’ Legacy",
        "content": "",
        "upvotes": 1935,
        "comments": 339,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Kse8Pp2VRBJdX-g_LvzGAsvEWxghGq3x8tLJB3PwjPI.jpg?auto=webp&amp;s=e53c741ea155dc6610c4c031c5ca08604c0f500c"
        },
        "permalink": "/r/movies/comments/1h4j4dk/will_ferrell_reflects_on_elf_legacy/"
    },
    {
        "id": "1h4zu1t",
        "author": "syemyu",
        "title": "The Terminator main theme goes HARD",
        "content": "That's it. That's all I wanted to say after I watched the movie yesterday. The main theme perfectly shows ~~Arnold Schwarzenegger~~ the Terminator as a relentless machine that, as Kyle Reese says, can’t be bargained with, reasoned with and doesn’t feel pity, remorse or fear. Are there any other main themes that go as hard as The Terminator one?\n\nBTW, the 4K remaster is really good!",
        "upvotes": 99,
        "comments": 76,
        "media": null,
        "permalink": "/r/movies/comments/1h4zu1t/the_terminator_main_theme_goes_hard/"
    },
    {
        "id": "1h592ca",
        "author": "Groundbreaking-Fig38",
        "title": "\"750\" in Heat (1995) (spoilers)",
        "content": "After the aborted theft of the metals place, the gang meets in a parking lot.  This is part of the conversation:\n\nMichael Cheritto: what the hell happens to Van Zant's seven fifty?\nNeil McCauley: With the heat we got now you want to play world war two in the streets with Van Zant?\nMichael Cheritto: No I want my seven fifty he gets a pass?\n\nThey stolen 1.6 million in bearer bonds, they are trying to get 60% for them which is $640k.  (Edit $960)\n\nWhere does \"750\" come from?  Any way I cut it,  I can't get the math to math.\n\nIs this just a simple goof?  Thanks!",
        "upvotes": 26,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1h592ca/750_in_heat_1995_spoilers/"
    },
    {
        "id": "1h5ieo7",
        "author": "Paxtnn",
        "title": "The Blair Witch Project - Extended Sight Cut (3hrs long cut with all newly released unseen &amp; deleted scenes)",
        "content": "",
        "upvotes": 5,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/to5f9-lmg-zB7mQLqFcLcarvHTYEBs4Sjn8N1rHTPrE.jpg?auto=webp&amp;s=11c80e4d616c47be3e05c85be59a088f038a8b0d"
        },
        "permalink": "/r/movies/comments/1h5ieo7/the_blair_witch_project_extended_sight_cut_3hrs/"
    },
    {
        "id": "1h4mh25",
        "author": "Phyliinx",
        "title": "In Bruges. Wow.",
        "content": "So I watched In Bruges and this is really a reddit movie, in a positive way, because it's one of these movies that you can find quoted around here, mainly in big threads, without loads of context, 'cause everyone and their mum but the reader knows where the damn quote originates from.\n\nThat being said: I absolutely loved it. It's a full circle feature film and made me realize how rare those are.\n\nWhy \"full circle\"? Because in my eyes, everything it does, it does right. \n\nThe setting itself is pretty rich, very interesting and fresh, not used many times before if I recall right.\n\nThe characters are, in my opinion, the closest someone has ever come to Quentin Tarantino.\n\nThe dialogue is vulgar and sometimes pretty deep at the same time. \n\nAnd all in all, the story, centering around three main characters in their small bubble, is a quick but sweet and simple but very interesting affair I loved seeing develop infront of me. There are not a lot of twists and turns, it does not need that, it just needs what it has to entertain all the way through.\n\nIt's darkly comedic and sometimes tragic and it manages both emotions with ease. \n\nAll in all: a fantastic piece of cinema and my personal introduction to the great mind of Martin McDonagh.",
        "upvotes": 738,
        "comments": 165,
        "media": null,
        "permalink": "/r/movies/comments/1h4mh25/in_bruges_wow/"
    },
    {
        "id": "1h51u9r",
        "author": "BunyipPouch",
        "title": "John Magaro ('Past Lives') Joins Josh O’Connor &amp; Alana Haim In Art-Heist Film ‘The Mastermind’ from Director Kelly Reichardt ('First Cow') - The new film centers on an audacious art heist amid the backdrop of the Vietnam War.",
        "content": "",
        "upvotes": 47,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WBVnnf9XPsSCnjL_QpzLgAw7kouMT1TX1DYVe_4J0PQ.jpg?auto=webp&amp;s=c6e2378fc45064de5109534b4abb7d4c3e5d59df"
        },
        "permalink": "/r/movies/comments/1h51u9r/john_magaro_past_lives_joins_josh_oconnor_alana/"
    },
    {
        "id": "1h548s4",
        "author": "King_of_Fife",
        "title": "Titanic Producer Rae Sanchini is coming out of retirement for Avatar 3",
        "content": "I haven't seen this mentioned anywhere but a dude on YouTube who covers Avatar interviewed the head of the lightstorm entertainment division and he confirmed that Rae is coming back to Produce (she's been out of the game for 20 years, her last being Solaris). Obviously with Jon Landau dying Cameron needed someone else to steer the ship. I'm shocked no trade has picked this up but I guess it's a niche youtuber who got the scoop.\n\nThe video by Avatar Guys is here: https://youtu.be/bM7r7HIAiLU\n\nconfirmed around the 5 minute mark.\n\nhttps://www.imdb.com/name/nm0761093/",
        "upvotes": 31,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VMj_rZZ109jGEOq4r8ZoHFRH7kDzXGvBFGtJrmek78I.jpg?auto=webp&amp;s=dc760b929d7e8396cfc595f4596bf6f7d98a96b0"
        },
        "permalink": "/r/movies/comments/1h548s4/titanic_producer_rae_sanchini_is_coming_out_of/"
    }
]