[
    {
        "id": "fq44oo",
        "author": "VoijaRisa",
        "title": "Read the rules sub before posting!",
        "content": "Hi all,\n\nFriendly mod warning here. In /r/Astronomy, somewhere around 70% of posts get removed. Yeah. That's a lot. All because people haven't bothered reading the rules or bothering to understand what words mean. So here, we're going to dive into them a bit further.\n\nThe most commonly violated rules are as follows:\n\n**Pictures**\n\nFirst off, all pictures must be original content. If you took the picture or did substantial processing of publicly available data, this counts. If not, it's going to be removed. Pretty self explanatory.\n\nSecond, pictures must be of an *exceptional* quality.\n\nI'm not going to discuss what criteria we look for in pictures as\n\n1. It's not a hard and fast list as the technology is rapidly changing\n2. Our standards aren't fixed and are based on what has been submitted recently (e.g, if we're getting a ton of moon pictures because it's a supermoon, the standards go up)\n3. Listing the criteria encourages people to try to game the system and be asshats about edge cases\n\nIn short this means the rules are inherently subjective. The mods get to decide. End of story. But even without going into detail, if your pictures have obvious flaws like poor focus, chromatic aberration, field rotation, low signal-to-noise ratio, etc... then they don't meet the requirements. Ever.\n\nWhile cell phones have been improving, just because your phone has an astrophotography mode and can make out some nebulosity doesn't make it good. Phones frequently have a \"halo\" effect near the center of the image that will immediately disqualify such images. Similarly, just because you took an ok picture with an absolute potato of a setup doesn't make it exceptional.\n\nWant to cry about how this means \"PiCtUrEs HaVe To Be NaSa QuAlItY\" (they don't) or how \"YoU hAvE tO HaVe ThOuSaNdS oF dOlLaRs Of EqUiPmEnT\" (you don't) or how \"YoU lEt ThAt OnE i ThInK IsN't As GoOd StAy Up\" (see above about how the expectations are fluid)?\n\nThen find somewhere else to post. And we'll help you out the door with an immediate and permanent ban.\n\nLastly, you need to have the acquisition/processing information in a top-level comment. Not a response when someone asked you. Not as a picture caption. Not in the title. Not linked to on your Instagram. In a top-level comment.\n\nWe won't take your post down if it's only been a minute. We generally give at least 15-20 minutes for you to make that comment. But if you start making other comments or posting elsewhere, then we'll take it you're not interested in following the rule and remove your post.\n\nIt should also be noted that we *do* allow astro-art in this sub. Obviously, it won't have acquisition information, but the content must still be original and mods get the final say on whether on the quality (although we're generally fairly generous on this).\n\n**Questions**\n\nThis rule basically means you need to do your own research before posting.\n\n* If we look at a post and immediately have to question whether or not you did a Google search, your post will get removed.\n* If your post is asking for generic or basic information, your post will get removed.\n   * Hint: There's an entire suggested reading list [already available here](https://www.reddit.com/r/askastronomy/comments/g0liwq/astronomycosmology_suggested_reading_list/).\n* If your post is using basic terms incorrectly because you haven't bothered to understand what the words you're using mean, your post will get removed.\n* If you're asking a question based on a basic misunderstanding of the science, your post will get removed.\n* If you're asking a complicated question with a specific answer but didn't give the necessary information to be able to answer the question because you haven't even figured out what the parameters necessary to approach the question are, your post will get removed.\n\nTo prevent your post from being removed, tell us *specifically* what you've tried. Just saying \"I GoOgLeD iT\" doesn't cut it.\n\nAs with the rules regarding pictures, the mods are the arbiters of how difficult questions are to answer. If you're not happy about that and want to complain that another question was allowed to stand, then we will invite you to post elsewhere with an immediate and permanent ban.\n\n**Object ID**\n\nWe'd estimate that only 1-2% of all posts asking for help identifying an object actually follow our rules. Resources are available in the rule relating to this. If you haven't consulted the flow-chart and used the resources in the stickied comment, your post is getting removed. Seriously. Use [Stellarium](https://stellarium.org/). It's free. It will very quickly tell you if that shiny thing is a planet which is probably the most common answer. The second most common answer is \"Starlink\". That's 95% of the ID posts right there that didn't need to be a post.\n\n**Pseudoscience**\n\nThe mod team of r/astronomy has two mods with degrees in the field. We're very familiar with what is and is not pseudoscience in the field. And we take a *hard* line against pseudoscience. Promoting it is an immediate ban.  Furthermore, we do not allow the entertaining of pseudoscience by trying to figure out how to \"debate\" it (even if you're trying to take the pro-science side). Trying to debate pseudoscience legitimizes it. As such, posts that entertain pseudoscience in any manner will be removed.\n\n**Outlandish Hypotheticals**\n\nThis is a subset of the rule regarding pseudoscience and doesn't come up all that often, but when it does, it usually takes the form of \"X does not work according to physics. How can I make it work?\" or \"If I ignore part of physics, how does physics work?\"\n\nSometimes the first part of this isn't explicitly stated or even understood (in which case, see our rule regarding poorly researched posts) by the poster, but such questions are inherently nonsensical and will be removed.\n\n**Bans**\n\nWe almost never ban anyone for a first offense unless your post history makes it clear you're a spammer, troll, crackpot, etc... Rather, mods have tools in which to apply removal reasons which will send a message to the user letting them know which rule was violated. Because these rules, and in turn the messages, can cover a range of issues, you may need to actually consider which part of the rule your post violated. The mods are not here to read to you.\n\nIf you don't, and continue breaking the rules, we'll often respond with a temporary ban.\n\nIn many cases, we're happy to remove bans if you message the mods politely acknowledging the violation. But that almost never happens. Which brings us to the last thing we want to discuss.\n\n**Behavior**\n\nWe've had a lot of people breaking rules and then getting rude when their posts are removed or they get bans (even temporary). That's a violation of our rules regarding behavior and is a quick way to get permabanned. To be clear: Breaking this rule *anywhere* on the sub will be a violation of the rules and dealt with accordingly, but breaking this rule when in full view of the mods by doing it in the mod-mail will 100% get you caught. So just don't do it.\n\nClaiming the mods are \"power tripping\" or other insults when *you* violated the rules isn't going to help your case. It will get your muted for the maximum duration allowable and reported to the Reddit admins.\n\nAnd no, your mis-interpretations of the rules, or saying it \"was generating discussion\" aren't going to help either.\n\n&amp;#x200B;\n\nWhile these are the most commonly violated rules, they are not the only rules. So make sure you read all of the rules.",
        "upvotes": 787,
        "comments": 0,
        "media": null,
        "permalink": "/r/Astronomy/comments/fq44oo/read_the_rules_sub_before_posting/"
    },
    {
        "id": "1gpq0lo",
        "author": "CICSTAR",
        "title": "M16 Rework from August",
        "content": "",
        "upvotes": 171,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/t98ebn7r8i0e1.jpeg?auto=webp&amp;s=10faae2d1e52f91bc2d688fd9d1ea5bfbae3f1bd"
        },
        "permalink": "/r/Astronomy/comments/1gpq0lo/m16_rework_from_august/"
    },
    {
        "id": "1gptm6r",
        "author": "Commercial_Radish757",
        "title": "James Webb X da Vinci",
        "content": "When I saw the Tarantula Nebula image from the Webb telescope it kind of reminded me of one of these dynamic da Vinci drawings, so I combined them. \nI really enjoy it as a wallpaper, thought others might as well :) (hope this is allowed copyright-wise? If not, please let me know)",
        "upvotes": 78,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kbg533gtyi0e1.png?auto=webp&amp;s=2ce7271d3c1b7b03827590bb009cfd04c01f829b"
        },
        "permalink": "/r/Astronomy/comments/1gptm6r/james_webb_x_da_vinci/"
    },
    {
        "id": "1gp6odz",
        "author": "adamkylejackson",
        "title": "Moon",
        "content": "Comparing cameras, this is the Nikon 7II version with Takahashi FSQ-85EDX and Televue Powermate 4x, perfect match for critical sampling and filling a full frame with the moon with what rendered a 60MP 6000x8000 pixel moon photo, 131 frames at ISO 400 1/40s aligned, stacked and processed in Photoshop, my other post is same night same setup with Panasonic G9II, Nikon is a resolution beast ",
        "upvotes": 905,
        "comments": 23,
        "media": null,
        "permalink": "/r/Astronomy/comments/1gp6odz/moon/"
    },
    {
        "id": "1gpc35f",
        "author": "AffectionateCod1995",
        "title": "IC434 ",
        "content": "",
        "upvotes": 270,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/s7ewwhhi9e0e1.jpeg?auto=webp&amp;s=8621e5c7c06eadc1bea309f32f4e35859cf832da"
        },
        "permalink": "/r/Astronomy/comments/1gpc35f/ic434/"
    },
    {
        "id": "1gpb9ev",
        "author": "BitterWin751",
        "title": "Waxing Gibbous Moon/Moon Map",
        "content": "",
        "upvotes": 178,
        "comments": 9,
        "media": null,
        "permalink": "/r/Astronomy/comments/1gpb9ev/waxing_gibbous_moonmoon_map/"
    },
    {
        "id": "1goyz9z",
        "author": "adamkylejackson",
        "title": "Moon",
        "content": "Shot with Panasonic G9II and Takahashi FSQ-85EDX on AM5 w/ASIAIR Mount, 400 images at ISO 100 1/60s aligned, stacked and processed in Photoshop ",
        "upvotes": 485,
        "comments": 10,
        "media": null,
        "permalink": "/r/Astronomy/comments/1goyz9z/moon/"
    },
    {
        "id": "1gpg1rg",
        "author": "VarthStarkus",
        "title": "Have any of you ever seen planet Mercury with a naked eye? ",
        "content": "If so, what did it look like and where did you see it and what time of the day was it?\n\nI've been determined to see as much if the planets as I can. I've seen Venus, Jupiter, Mars, and on Sunday I saw Saturn through a telescope at the Griffith Observatory here in LA. However I have yet to see Mercury. I tried to find it today at sunset using the Stellarium ap on my phone but I couldn't find Mercury.",
        "upvotes": 31,
        "comments": 33,
        "media": null,
        "permalink": "/r/Astronomy/comments/1gpg1rg/have_any_of_you_ever_seen_planet_mercury_with_a/"
    },
    {
        "id": "1gp1y25",
        "author": "Astro_mohd",
        "title": "Horsehead and Flame Nebulae ",
        "content": "",
        "upvotes": 263,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xvkacy5uyb0e1.jpeg?auto=webp&amp;s=38b60f4444f22eed5bda1fc0562b384cd917c582"
        },
        "permalink": "/r/Astronomy/comments/1gp1y25/horsehead_and_flame_nebulae/"
    },
    {
        "id": "1goz78d",
        "author": "rockylemon",
        "title": "“Shoot for the moon. Even if you miss focus you’ll probably nail focus amongst the stars”",
        "content": "",
        "upvotes": 329,
        "comments": 26,
        "media": null,
        "permalink": "/r/Astronomy/comments/1goz78d/shoot_for_the_moon_even_if_you_miss_focus_youll/"
    },
    {
        "id": "1gp2uyu",
        "author": "mustalainen",
        "title": "NGC2174 - Eye in the heavens (or monkey head nebula...)",
        "content": "",
        "upvotes": 159,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yq4zfn955c0e1.jpeg?auto=webp&amp;s=fed84c6d99e54abef4f28f671201df86f2427752"
        },
        "permalink": "/r/Astronomy/comments/1gp2uyu/ngc2174_eye_in_the_heavens_or_monkey_head_nebula/"
    },
    {
        "id": "1gplx9i",
        "author": "Bilacsh",
        "title": "New research challenges dark matter theory in galaxy formation",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/h9WhEX8mZqNObqsF_4SK8phdzU3Tf6_IoRkjyirb7To.jpg?auto=webp&amp;s=2304b778d532ad42666a86618b914b32ec3a8c0a"
        },
        "permalink": "/r/Astronomy/comments/1gplx9i/new_research_challenges_dark_matter_theory_in/"
    },
    {
        "id": "1gpu01r",
        "author": "Pale_Field4584",
        "title": "For stargazing in dark skies, is a waning crescent an impediment vs new moon?",
        "content": "I read somewhere that it doesn't matter because the waning crescent rises til 3am. Is this true? ",
        "upvotes": 2,
        "comments": 18,
        "media": null,
        "permalink": "/r/Astronomy/comments/1gpu01r/for_stargazing_in_dark_skies_is_a_waning_crescent/"
    },
    {
        "id": "1gooe3c",
        "author": "Dramatic_Expert_5092",
        "title": "M45 Pleiades",
        "content": "",
        "upvotes": 715,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hf5jc3w7r80e1.jpeg?auto=webp&amp;s=e2a1efb7b7b2f5dadd1020b2d6a9d42808302593"
        },
        "permalink": "/r/Astronomy/comments/1gooe3c/m45_pleiades/"
    },
    {
        "id": "1gp0xgh",
        "author": "Mysticalsss-yt",
        "title": "why are my pictures so red?",
        "content": "",
        "upvotes": 108,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8afgm60brb0e1.jpeg?auto=webp&amp;s=05e42aec05ba280e58d1d4279d019a9cc03a2481"
        },
        "permalink": "/r/Astronomy/comments/1gp0xgh/why_are_my_pictures_so_red/"
    },
    {
        "id": "1gp3gxy",
        "author": "majkij",
        "title": "Messier 8 (The Lagoon Nebula)",
        "content": "",
        "upvotes": 71,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5fg4ckkd9c0e1.jpeg?auto=webp&amp;s=cff83a05547a9307014e633d301e09fdb3fac4fa"
        },
        "permalink": "/r/Astronomy/comments/1gp3gxy/messier_8_the_lagoon_nebula/"
    },
    {
        "id": "1gpgj7l",
        "author": "Educational_Swim8665",
        "title": "New research prompts rethink on chances of life on Uranus moons",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jvOjZTY59_Rz_dlALBgX-HAsekQVdiblq2Hzptt1Vg4.jpg?auto=webp&amp;s=5796dd1878407a7665baf52a03229529fd7e29c5"
        },
        "permalink": "/r/Astronomy/comments/1gpgj7l/new_research_prompts_rethink_on_chances_of_life/"
    },
    {
        "id": "1gpgaxi",
        "author": "ProfessionalArm8256",
        "title": "Tidally locked stars? ",
        "content": "I know that planets &amp; their natural satellites can potentially be tidally locked with one another, but is it possible that two stars in a binary system be tidally locked with each other? \nJust a curiosity. ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/Astronomy/comments/1gpgaxi/tidally_locked_stars/"
    },
    {
        "id": "1gogwsp",
        "author": "MilOnTheMoon",
        "title": "Venus reflecting off the Pacific w/ Milky Way. Experimenting with phone in French Polynesia",
        "content": "",
        "upvotes": 733,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q7sjju2mg60e1.jpeg?auto=webp&amp;s=11b65a245c99bedd4d77b8ddfb733e894df60435"
        },
        "permalink": "/r/Astronomy/comments/1gogwsp/venus_reflecting_off_the_pacific_w_milky_way/"
    },
    {
        "id": "1go97xv",
        "author": "Please_makeit_stop",
        "title": "Can someone explain to me exactly what I’m looking at and why a black hole looks like this? Is a black hole a flat disc or a sphere like Earth?",
        "content": "",
        "upvotes": 1937,
        "comments": 324,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ns3ghe7rp40e1.jpeg?auto=webp&amp;s=9afd686964f6e4005c0789906154f84aebc18e90"
        },
        "permalink": "/r/Astronomy/comments/1go97xv/can_someone_explain_to_me_exactly_what_im_looking/"
    },
    {
        "id": "1gozvj2",
        "author": "Typical-Plantain256",
        "title": "Mining old data from NASA's Voyager 2 solves several Uranus mysteries",
        "content": "",
        "upvotes": 16,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dO425OAGbHqoS-MiOwD0PKTZQF2-OatNJoS-V6VSjEU.jpg?auto=webp&amp;s=8bbd57df5b223d29d7323e6a59cda176d1783216"
        },
        "permalink": "/r/Astronomy/comments/1gozvj2/mining_old_data_from_nasas_voyager_2_solves/"
    }
]