[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 27,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kjiek1",
        "author": "Opening_Income9862",
        "title": "A Deadly American Marriage",
        "content": "I was keeping an open mind as to the guilt of Molly and her father. Then, they described the recording devices she had set up. \n\nThe fact that the worst example of his 'abuse' that they shared from the recordings was that argument over the dinner sealed the deal for me. That OBVIOUSLY wasn't abuse and the fact they thought THAT was evidence of abuse is actually the strongest evidence that he WASN'T abusive. He sounded frustrated, and yes, he was kind of a jerk to his daughter, but abuse? Insane. A biological parent threatening to separate the kids from their stepparent in response to the stepparent threatening the same thing is a pretty natural response.\n\nMolly clearly has borderline personality disorder and both Molly and her Father are sick individuals, in my opinion. ",
        "upvotes": 363,
        "comments": 150,
        "media": null,
        "permalink": "/r/netflix/comments/1kjiek1/a_deadly_american_marriage/"
    },
    {
        "id": "1kj3bot",
        "author": "RoxieMatthews",
        "title": "Molly Martens is a psycho - A Deadly American Marriage",
        "content": "I’m in shock with this girl - she’s an absolute psycho. Like the audacity to be talking like she’s the victim!? Like we should feel bad for her?\n\nHer lies about giving birth to Sarah, and how obsessed she is talking about adopting them. She wanted those kids and Jason paid for it. \n\nAlso the RECORDING they tried to use as proof as abuse is insane. Yelling and fighting within families is normal and doesn’t = abuse. Absolutely pathetic excuse. \n\nHer and her disgusting father should still be in prison. I hope she has an awful life. Vile humans. ",
        "upvotes": 761,
        "comments": 413,
        "media": null,
        "permalink": "/r/netflix/comments/1kj3bot/molly_martens_is_a_psycho_a_deadly_american/"
    },
    {
        "id": "1kjveel",
        "author": "abhijeit",
        "title": "Problems and plot holes in 1899 (Netflix)",
        "content": "Just finished  1899 and loved the atmosphere, but the more I think about it, the more the plot holes and unresolved mysteries bother me. Here’s my breakdown of the biggest issues—let me know what I missed or if you have theories!\n\n# 1. The Simulation Twist Undermines Everything\n\nThe big reveal that it’s all a simulation (or layers of them) makes emotional moments feel weightless. If nothing’s \"real,\" why should we care about character deaths or trauma? Even worse, the rules of the simulation are never clear—why do the black crystals, memory bugs, or the Prometheus ship behave so inconsistently?\n\n# 2. Character Backstories Go Nowhere\n\n1899 set up really interesting character stories but then forgot about them. The French couple Clemence and Lucien had a troubled marriage with hints of cheating or maybe an abortion, but none of it went anywhere. The French lady who seemed to be forcing Ling Yi into prostitution just disappeared from the story. Ling Yi and her mom did something horrible - they killed another girl to steal her identity - but the show never explained why this mattered. They also hinted Ling Yi might be pregnant, then dropped it completely.\n\nThe little girl Ada died suddenly for no clear reason. Krester's story about his scar and being gay started strong but went nowhere. Why did so many people jump off the ship? Was the simulation breaking? Miguel, the stowaway, had strange visions and a connection to the boy Elliot, but we never learned his backstory. Angel and Ramiro's secret about Ramiro killing a priest to pretend to be him also didn't lead anywhere.\n\nIt's frustrating because all these stories felt important at first, but in the end, none of them really mattered or got explained. The show made us care about these characters, then left us hanging.\n\n# 3. The Pyramid, the Black Goo, and Elliot’s Role\n\n* The black pyramid/archive is treated as a big deal, but we never learn what it actually *does*.\n* The black substance spreads like a virus, but is it code? A metaphor? Who knows.\n* Elliot exists as a child in the simulation, but why? Is he a glitch, a memory, or a failsafe?\n\n# 4. The Ending Creates More Confusion\n\nMaura wakes up in 2099 on a spaceship, implying the 1899 simulation was just one layer. But:\n\n* Why is Ciaran suddenly in control?\n* Are the other passengers real people or AI?\n* If this is \"reality,\" how does it connect to the 1899 simulation?\n\n# 5. Cancellation Left Us Hanging\n\nNetflix axed the show after one season, so we’ll *never* get answers about Ciaran, the spaceship, or whether any of it mattered. The creators (*Dark* fans know this pain) love complex mysteries, but without payoff, it feels like wasted potential.\n\n# Was It All Just a Video Game?\n\nSome theories suggest  1899 is a psychological experiment or a *Matrix*\\-style VR game, but with no S2, we’re left guessing.\n\nWhat do you think—did the plotholes ruin it for you, or was the ride worth it?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kjveel/problems_and_plot_holes_in_1899_netflix/"
    },
    {
        "id": "1kjhgzz",
        "author": "InterestingCod3541",
        "title": "What to watch?",
        "content": "Can you give me suggestions on what to watch? Here are some series I have watched so you know my genre (it's mixed): The Good Place, Brooklyn Nine-Nine, Dead to Me, Lucifer, The Flash (season 6), Inventing Anna, The Queen's Gambit, Sherlock, The Office, Stranger Things, Wednesday, Money Heist, Lupin, The Lincoln Lawyer, Breaking Bad, Dead Boy Detectives, Young Sheldon, Good Witch, Altered Carbon, Unbreakable Kimmy Schmidt, Space Force, Russian Doll, Locke &amp; Key, Manifest, Chaos, Lost in Space.\n\nSo I like comedy, criminal, sci-fi...\nI gave you a lot, haha, but so you know what I have watched and what I like. Thank you!",
        "upvotes": 14,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1kjhgzz/what_to_watch/"
    },
    {
        "id": "1kjvqj3",
        "author": "Remarkable_Shake9364",
        "title": "Content not playing at 4k",
        "content": "So my monitor supports 1440p, I have a 4k UHD subscription. But every show and movie I click on it says HD, but there’s Spatial Audio. Why is there nothing available on 4k?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kjvqj3/content_not_playing_at_4k/"
    },
    {
        "id": "1kjvpq3",
        "author": "VipersInHerHair",
        "title": "Queen's Gambit Lovers Podcast!",
        "content": "we're a couple of INTJ females who love chess and the Queen's Gambit, i thought this was clearly relevant to this subreddit if anyone is interested in listening to a deep dive, episode by episode, on our **Beauty is Terror** Podcast. You can also find us on Youtube and Itunes.\n\n  \nCheers x",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kjvpq3/queens_gambit_lovers_podcast/"
    },
    {
        "id": "1kj6k79",
        "author": "Nastia_dream",
        "title": "Is Orange is the new Black worth watching all the way through ?",
        "content": "So i started watching this show recently for the first time, i’m only 3 episodes into it and i kind of like it. I think it’s definitely that kind of show to watch after a long day at work and unwind. But is it worth watching all 7 seasons? I heard the writing gets worse after first few seasons. ",
        "upvotes": 53,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1kj6k79/is_orange_is_the_new_black_worth_watching_all_the/"
    },
    {
        "id": "1kjtnek",
        "author": "LovingVancouver87",
        "title": "The Glory is a laugh riot towards the end",
        "content": "I was very intrigued by the Glory as it had such good reviews. I think it set up the suspense pretty well although I felt it was bloated in parts. However, towards the end, when shit is about to hit the fan, the acting of the bullies is just hilarious. They act so over the top with their reactions and the english dub adds to the hilarity. The main female bully is the standout as every time she came on screen with her snarky smile or overconfident attitude and just grotesque screams, I was laughing inside. All the other bullies also seemed like extreme caricatures lol. \n\nI have to give props to the bully characters to keep the show interesting. The female and male leads did great job of course but the commitment the bullies showed to their over the top characters was great.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kjtnek/the_glory_is_a_laugh_riot_towards_the_end/"
    },
    {
        "id": "1kjdhey",
        "author": "Molybecks",
        "title": "Phil Spector case would make for an amazing ‘Monster’ series/‘American Crime Story’",
        "content": "\n\nPhil Spector would make for an amazing ‘Monsters’ series\n\nIn 2003 music producer “accidentally” shot and instantly killed actress Lana Clarkson in his mansion, pretty much in the same spot he got married to his wife at the time (not Ronnie Spector, they were long divorced by this point) \n\nThe trial was bonkers and the whole thing is all types of creepy. ",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kjdhey/phil_spector_case_would_make_for_an_amazing/"
    },
    {
        "id": "1kjs9vt",
        "author": "BattleNo1217",
        "title": "Confusing plot in The Eternaut",
        "content": "There seems to be a very confusing plot element in the series. Juan and Tano go out to find Clara, but reach a wall of cars. Then they go to a church, which seems to be on the same side of the city as Tano's house. Then they bypass the wall of cars through a tunnel - and end up back at Tano's house! How is that possible? \n\nAnd then the people from the church set out for Campo de Mayo, but how could they do that if they are back at the \"wrong\" side of the city?\n\nIn the end, what was the goal of cutting through the wall of cars?\n\nAnother thing: the car Juan finds in the wall of cars seems to be on both sides of the wall.\n\nMaybe I got something wrong.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kjs9vt/confusing_plot_in_the_eternaut/"
    },
    {
        "id": "1kjgp6y",
        "author": "indiewire",
        "title": "The Best Movies New to Netflix in May 2025",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kjgp6y/the_best_movies_new_to_netflix_in_may_2025/"
    },
    {
        "id": "1kjifij",
        "author": "aniikenobi",
        "title": "recs for really good shows based on my likes?",
        "content": "Struggling to find something good! My favorite shows (not just on netflix, for a better idea of my faves) are The 100, The Good Place, Reign, Criminal Minds, The Haunting of Hill House, Bly Manor, The Last of Us, Obi-Wan Kenobi, &amp; You s1-3. I also liked the Kidfluencing doc, various true crime docs, Normal People, Cruel Summer, Supernatural, Bridgerton, etc. \n\nTIA!! ",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kjifij/recs_for_really_good_shows_based_on_my_likes/"
    },
    {
        "id": "1kjbv8x",
        "author": "Broad-Cranberry-9050",
        "title": "how to add extra member to household if I use T-mobile to pay the bill?",
        "content": "My brother and I are on the same T-Mobile account. Neither of us really use netflix but we have t-mobile pay the ad version. His kids love to watch it and sometimes my GF and I like to watch a few shows. Since netflix put the household restriction the last few months have been us basically switching the account household once every few weeks. At this point I decided to give in and pay the extra 10-18 dollars since I technically have gotten netflix for free the last few years. I saw I had to update to standard for an extra 11 dollars and then add a member for an extra 8 dollars or so. I dont mind. \n\nBut to my surprise Netflix doesnt allow extra member slots if you use a 3rd party to pay for part of the bill. Now im at a loss. I put back the ad version but now am at an empass. I dont want to pay netflix 30+ bucks a month just to have my brother and me have to use the account. \n\nIs there a way to somewhat share the account with my brother without this household BS?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kjbv8x/how_to_add_extra_member_to_household_if_i_use/"
    },
    {
        "id": "1kjkuwc",
        "author": "RefrigeratedLegumes",
        "title": "What Netflix documentary was Yasuke featured in?",
        "content": "I remember watching a Netflix documentary a few years ago that mentioned Yasuke during the Edo period. I thought it was Age of Samurai, but just rewatched it and he wasn't mentioned there. But I definitely remember seeing him somewhere, it could've been just one episode or one brief mention in some documentary. I even tried looking through my viewing history but nothing's really clicked, but I'm pretty sure it was some documentary on Netflix. Any suggestions?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kjkuwc/what_netflix_documentary_was_yasuke_featured_in/"
    },
    {
        "id": "1kjbedz",
        "author": "Star10001",
        "title": "How does the whole «different household» logic work?",
        "content": "I moved out of my parents house almost 10 months ago, but I’m still able to access Netflix through their subscription. I have a frame tv, so I can download the apps directly to the TV and I don’t have to stream from my phone, and after a week I wasn’t able to access it anymore because they registered that I wasn’t «home».\n\nBut the thing is I can still access it through my phone or laptop, so I can just stream it. Why is that different from the TV?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kjbedz/how_does_the_whole_different_household_logic_work/"
    },
    {
        "id": "1kif3wc",
        "author": "Zalensia",
        "title": "a deadly american marriage",
        "content": "I'm 43 minutes in and hooked but can not find conversations etc on it. \n\nSo thought i would make one asking for other people's opinions and points of views, as i know I'm already asking about billion questions, to the point I'll have to go to my computer and boot up to actually do the research myself. \n\nI'm very ill, with brain damage etc and that's really hardwork today, but I won't  manage on this latest fold phone as it's still just a useless phone 😅🙃 \n\nMy other phone that's partitioned etc is in the car and that's over at Inverness!",
        "upvotes": 490,
        "comments": 1355,
        "media": null,
        "permalink": "/r/netflix/comments/1kif3wc/a_deadly_american_marriage/"
    },
    {
        "id": "1kjno3y",
        "author": "tako1559",
        "title": "\"Your device isn’t part of the Netflix Household for this account\"",
        "content": "Is this a new thing? I literally was watching on netflix on my computer yesterday but this morning this showed up and I couldn't watch anything anymore. I noticed it says this on their website now but I don't know if it's a new thing or not. \n\nMy dad and sister back in the West Coast can use it, but I'm unable to. I've been living on the East Coast for the longest time and this is the first time this has showed up for me. \n\n",
        "upvotes": 0,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1kjno3y/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1kj031y",
        "author": "Lollelowksss",
        "title": "Good shows ?",
        "content": "Just finished ransom canyon &amp; virgin river I need something else to watch 😩 any suggestions? Doesn't have to be the same type of show just don't feel like searching Netflix for hours to find something good 😭",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kj031y/good_shows/"
    },
    {
        "id": "1kiv9mn",
        "author": "Fun_Cod2356",
        "title": "I just watched American vandal !!",
        "content": "I finished season 1 and started season 2 immediately but I'm so sad they skipped the 3d models this season ;( that's all I just wanted to complain lol and of course recommend the show if you haven't watched it already, I literally just found out about it and it has been around for many years!! I literally cried of laughter with season 1",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kiv9mn/i_just_watched_american_vandal/"
    },
    {
        "id": "1kiztmh",
        "author": "bluecoastblue",
        "title": "British Show About Girl Kidnapped at Sleepover?",
        "content": "This is driving me crazy. I am two episodes in on what I think is a British tv series about girl who goes to a sleepover and when the parents go to pick her up the house is empty and a cleaning woman tells the parents it's an empty vacation rental. I've tried searching several times and I can't find it and it's not in my \"continue watching\" Only one episode released every week. Anyone know what it is? ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kiztmh/british_show_about_girl_kidnapped_at_sleepover/"
    },
    {
        "id": "1kiaw7v",
        "author": "Efficient-Cup1752",
        "title": "Why is no one talking about The Residence? Such a good show wow",
        "content": "I mean it’s by ShondalandMedia so I’m not surprised it’s such a good show, but I’m surprised no one is talking about it! It’s like the TV Show version of playing the board game murder mystery. So entertaining to watch with your friends on a pizza night lol",
        "upvotes": 178,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1kiaw7v/why_is_no_one_talking_about_the_residence_such_a/"
    },
    {
        "id": "1kihnod",
        "author": "AdventurousCandle203",
        "title": "The Four Seasons Episode 7: um what the fuck?",
        "content": "I won’t post spoilers in my post but can’t guarantee there won’t be any in the comments.\n\nI can’t believe that happened! I was really loving this show and now I actually kind of hate it. I don’t really want to finish the last episode anymore. ",
        "upvotes": 36,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1kihnod/the_four_seasons_episode_7_um_what_the_fuck/"
    },
    {
        "id": "1kj49fs",
        "author": "Beneficial-Claim8373",
        "title": "The Residence - What was the purpose of the secret service crash?",
        "content": "The show placed a lot of attention on it in the first few episodes but then it was never addressed? Everything else seemed to either add up to the end except for this.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kj49fs/the_residence_what_was_the_purpose_of_the_secret/"
    },
    {
        "id": "1kiwaq1",
        "author": "stellacampus",
        "title": "The Last Night at Tremore Beach is pretty good",
        "content": "The Last Night at Tremore Beach is kind of a sleeper in that I can easily see folks blowing by it, but I actually thought it was pretty captivating if perhaps a little too drawn out.  I even had to watch it dubbed into English from Spanish because I am having some eye issues at the moment, and I thought the dub was much more natural than usual.  I;m sure there will be \"experts\" who decry plot holes and the like, but I thought it was overall put together very well as far as the mystery.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kiwaq1/the_last_night_at_tremore_beach_is_pretty_good/"
    },
    {
        "id": "1kiyfdb",
        "author": "Admirable_Iron8933",
        "title": "Nonnas- Wigs and Chemistry",
        "content": "It was promising. The cast. True, compelling story. \n\nBut I don’t know which was more like sandpaper to my heart- the lack of chemistry (between a great cast) or the tragic wigs. \n",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kiyfdb/nonnas_wigs_and_chemistry/"
    },
    {
        "id": "1kj5i37",
        "author": "Wrong_Garlic141",
        "title": "Why is my Netflix telling me to update Google Play Services when I can't and it won't let me login cuz it says Password incorrect despite it being correct",
        "content": "I have a Vivax TV and I didn't have any issue with Netflix till now, I have tried to replace the google play services with an APK i got online but it says App Not Installed everytime I try. Does anyone know how to fix this cuz I tried every youtube tutorial on the planet and it didn't fix it. My grandma who has a Fox TV started having the same issue as my TV. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1kj5i37/why_is_my_netflix_telling_me_to_update_google/"
    },
    {
        "id": "1kixmuw",
        "author": "SynthRogue",
        "title": "After literal years, I have just finally found the cause for why I was getting sub 720p on netflix, on pc. So here is the solution for those who are still frustrated and looking for a fix.",
        "content": "# Install the HEVC Video Extensions\n\nThat’s the last (and key) piece you're missing.\n\n1. Open the Microsoft Store\n2. Search for: **“HEVC Video Extensions”**\n3. Choose this one: **HEVC Video Extensions – $0.99 on Microsoft Store**\n4. Install it\n5. Restart your PC\n6. Try Netflix again in Edge or the Netflix app\n7. Press `Ctrl + Alt + Shift + D` while playing content and verify:\n   * Codec: `hevc`\n   * KeySystem: `HW_SECURE_DECODE`\n   * HDR support: `true`\n   * Bitrate: `16000+ kbps`\n   * Resolution: `3840x2160`Install the HEVC Video Extensions That’s the last (and key) piece you're missing.    Open the Microsoft Store       Search for: “HEVC Video Extensions”       Choose this one:  HEVC Video Extensions – $0.99 on Microsoft Store       Install it       Restart your PC       Try Netflix again in Edge or the Netflix app       Press Ctrl + Alt + Shift + D while playing content and verify:       Codec: hevc       KeySystem: HW\\_SECURE\\_DECODE       HDR support: true       Bitrate: 16000+ kbps       Resolution: 3840x2160\n\nthe **HEVC Video Extensions** from the Microsoft Store is:\n\n# A one-time purchase\n\n* You pay **$0.99 USD** once — **no subscription**, no renewal fees.\n\n# Tied to your Microsoft account\n\n* Once purchased, it’s permanently linked to your **Microsoft account**.\n* You can **install it on any other Windows 10/11 device** you sign in to with that account — no need to pay again.the HEVC Video Extensions from the Microsoft Store is: A one-time purchase    You pay $0.99 USD once — no subscription, no renewal fees.    Tied to your Microsoft account    Once purchased, it’s permanently linked to your Microsoft account.       You can install it on any other Windows 10/11 device you sign in to with that account — no need to pay again.\n\n  \nWhy You Need the HEVC Codec for HD/4K Netflix on PC\n\nNetflix uses different video codecs depending on the device, platform, and stream quality. The key reasons for needing HEVC are:\n\n 1. 4K (and sometimes even Full HD) Requires HEVC on PC\n\n HEVC (H.265) is a more efficient codec than AVC (H.264). It compresses video better while keeping quality high.\n\n Netflix streams 4K content (and often HDR) using HEVC, which requires:\n\n   HEVC decoding capability\n\n   Secure content protection (DRM like Widevine L1 in hardware)\n\n\n\nIf you don’t have the HEVC codec, Netflix falls back to AVC1, which maxes out at 480p or 720p, even with a 4K plan.\n\n 2. Windows 10/11 Doesn’t Include HEVC by Default\n\n Microsoft used to bundle the HEVC codec for free.\n\n But around 2017, they stopped because:\n\n   HEVC is not free to license. It has royalty fees tied to it (paid to patent holders).\n\n   To reduce Windows licensing costs, Microsoft made it an optional \\\\$0.99 addon in the Store.\n\nThis is why TVs, phones, game consoles still get HEVC support for free — the manufacturer licenses it for that device. But with PCs (especially custombuilt desktops), you’re responsible for getting the codec.\n\n 3. Why You Didn’t Notice Before\n\n If you only watched Netflix at 720p or lower before, AVC1 was enough.\n\n Or you might’ve been on a device that came with HEVC preinstalled (like a laptop from Dell, HP, etc.).\n\n Now that you're on the Premium plan, Netflix tries to stream 4K — but it can’t unless your PC supports HEVC with DRM.\n\nWhy Charge \\\\$0.99 at All?\n\nThe \\\\$0.99 price is basically a token fee to offset Microsoft’s licensing cost. The real reason you have to pay:\n\n Microsoft can't legally distribute HEVC for free on Windows unless it's covered by an OEM license (e.g. Dell paid for it for your laptop).\n\n You’re only charged once per Microsoft account, and the codec is yours forever.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kixmuw/after_literal_years_i_have_just_finally_found_the/"
    },
    {
        "id": "1kir0d6",
        "author": "trutrutrudadada",
        "title": "How does changing netflix plan work when its in the middle of a already paid sunscription?",
        "content": "If i change my plan on netflix will it change now or next month\nIf i change the plan from like basic HD to standard full HD will it switch instantly or next month? And if it does switch instantly do i pay like the price difference the two plans have? I really need to know.",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kir0d6/how_does_changing_netflix_plan_work_when_its_in/"
    },
    {
        "id": "1kir6qo",
        "author": "HehroMaraFara",
        "title": "Havoc (2025)",
        "content": "So, I love Tom Hardy. For the most part I will always support anything he’s in. Hes one of the most “normal guys” in the action world of Hollywood. Yes, all his American accents are circa 1945 Brooklyn, but whatcha gonna do. \n\nAll that being said I REALLY wanted to like Havoc. If you turn your brain COMPLETELY off, it’s kind of possible. \n\nIt’s the cabin scene though that they completely lost me. All three standing in the wide open while a dozen guys open up on them in full auto from about 100 feet away. Not only do they have time to duck inside and “cover” but nary a bullet hits a one of them. The walls are essentially cardboard and somehow they are not only not getting hit, but returning fire and getting kills instead themselves. Ludicrous doesn’t even begin to describe it. \n\nThis movie so desperately wanted to be an updated Max Payne kinda vibe, but instead it was more Uwe Boll Max Payne. Do better. ",
        "upvotes": 3,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1kir6qo/havoc_2025/"
    },
    {
        "id": "1kj7lsy",
        "author": "intelerks",
        "title": "Billie Piper says filming sex scene with animal noises in Netflix drama made her feel ‘wrong’",
        "content": "Billie Piper has opened up about a particularly uncomfortable moment from her time filming *Secret Diary of a Call Girl*, the ITV drama that stirred headlines when it first aired and is currently available to stream on Netflix until 29 May.\n\n",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1kj7lsy/billie_piper_says_filming_sex_scene_with_animal/"
    }
]