[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 9,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 340,
        "comments": 2189,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1n80kh8",
        "author": "thehealer2",
        "title": "Stand by Me (1986) is such an underrated gem.",
        "content": "This film is truly an underrated gem, beautifully capturing the raw essence of childhood friendships and the bittersweet journey into adulthood.\n\nFor a few hours, I felt like I was right there alongside Gordie, Chris, Teddy, and Vern, wandering through the woods, chasing whispers of a dead body, and facing their fears and dreams. The film’s strength lies in its authenticity; every laugh, heartbreak, and quiet moment feels genuine, drawing you into their world. It serves as a poignant reminder of how fleeting and impactful those youthful adventures can be.\n\nI really miss road movies like this, where a group of friends embarks on a journey to discover something meaningful.\n\nWhat did you think about this movie? I’d love to hear your thoughts and feelings after watching it!\n\nAlso, if you have any recommendations for similar movies, please share them below!",
        "upvotes": 85,
        "comments": 41,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qup1tmd8r2nf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1n80kh8/stand_by_me_1986_is_such_an_underrated_gem/"
    },
    {
        "id": "1n7ycvl",
        "author": "TeaRemote258",
        "title": "Wednesday S2 Underwhelming?",
        "content": "Just me? I know they had to change things around when they ditched that S1 actor but this season just felt like a jumble of storylines someone started slapping together. Only pieces here and there felt cohesive like someone thought about the plot in advance. And splitting the season up just didn’t help at all. I think Agnes was a good addition, though. ",
        "upvotes": 26,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1n7ycvl/wednesday_s2_underwhelming/"
    },
    {
        "id": "1n7mmgn",
        "author": "AccurateInflation167",
        "title": "KPop Demon Hunters dethrones Squid Game as Netflix’s most-watched title ever - KED Global",
        "content": "",
        "upvotes": 77,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1n7mmgn/kpop_demon_hunters_dethrones_squid_game_as/"
    },
    {
        "id": "1n7vybz",
        "author": "self-fix",
        "title": "Netflix urges Tencent to stop airing plagiarized 'Culinary Class Wars' in China",
        "content": "",
        "upvotes": 14,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n7vybz/netflix_urges_tencent_to_stop_airing_plagiarized/"
    },
    {
        "id": "1n7altt",
        "author": "Educational_Tea2511",
        "title": "WEDNESDAY on netflix",
        "content": "I just finished *Wednesday*, and man, I’m not getting why everyone’s obsessed! Jenna Ortega’s got that deadpan stare on lock, and the show’s got a cool spooky vibe, but the story? Total snooze-fest. It’s like someone threw every teen show into a blender with some fake cobwebs. You’ve got the usual “weird kid with a big destiny” deal, a boring love triangle, and a boarding school that’s basically Hogwarts’ less fun cousin. It’s trying to be peak Tim Burton, but it’s more like Tim Burton’s distant nephew who’s trying too hard. Some parts dragged worse than my Monday mornings, and half the characters are flatter than my phone battery at 1%. I’ve seen X users call it overhyped, whining about the same old plot. Anyone else think it’s a bit of a yawn? What didn’t vibe for you? ",
        "upvotes": 132,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1n7altt/wednesday_on_netflix/"
    },
    {
        "id": "1n71pyj",
        "author": "Similar_Diver9558",
        "title": "'Irrelevant meets intolerable': Meghan Markle’s Netflix show tanks - Season 2 misses Top 10 entirely",
        "content": "",
        "upvotes": 489,
        "comments": 155,
        "media": null,
        "permalink": "/r/netflix/comments/1n71pyj/irrelevant_meets_intolerable_meghan_markles/"
    },
    {
        "id": "1n82v3m",
        "author": "Maybeatordsimp",
        "title": "Help finding a show that used to be on Netflix?",
        "content": "Tbf idk if this even was on Netflix might’ve been something else. It was a kids cartoon that had birds on a plane doing rescues iirc. There was an ostrich I think and also a bat. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n82v3m/help_finding_a_show_that_used_to_be_on_netflix/"
    },
    {
        "id": "1n84fle",
        "author": "GolemancerVekk",
        "title": "Spam on Netflix email address",
        "content": "Today I've started receiving spam on an address that is unique and only used for the Netflix account. Anybody else notice anything funny? \n\nhaveibeenpwned says the address doesn't currently appear in any breach.\n\nStill, it's possible that there's either been a breach, or Netflix has shared emails with 3rd parties.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n84fle/spam_on_netflix_email_address/"
    },
    {
        "id": "1n84dsb",
        "author": "1amtheknight",
        "title": "Anyone else have their extra profiles deleted?",
        "content": "Opened the Netflix app on my TV today to find my extra profiles gone. Went through all the troubleshooting steps:\n-Restarted TV\n-Cleared the app data and logged back in\n-logged in on a different device saw the extra profiles disappear as it loaded.\n-Logged in on a browser saw there was an error against my account for my TV. The error said the TV app couldn't access the Internet and check my network. No error message for my phone app though. \n-Checked the TV apps internet connection using the in app test which passed and tested the TVs internet connection using a speed test app full speed. \n-Contacted Netflix help and all they did was copy paste the checks from the error which I'd already done. I was then told sorry there was nothing they could do.\n\nSo now I've had to create the profiles again and all the viewing history is gone.\n\nAnyone else successfully restored \"deleted\" profiles? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n84dsb/anyone_else_have_their_extra_profiles_deleted/"
    },
    {
        "id": "1n7sgo1",
        "author": "Kairiste",
        "title": "Can I get some Asian dramedy recommendations?",
        "content": "I got hooked on \"Bon Appetit, Your Majesty\" because I was in between cooking competition shows and think I just found my new guilty pleasure.  I wasnt expecting the humor, and the costumes/makeup are lovely.\n\nWould appreciate getting some other recommendations I could add to my watch list... I currently have Tale of the Nine Tailed, and Beyond The Bar saved.  I like fantasy/sci fi, probably wouldnt be intrigued with 100% drama, I really liked the comedic touches.  Thanks!",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1n7sgo1/can_i_get_some_asian_dramedy_recommendations/"
    },
    {
        "id": "1n82ngl",
        "author": "djkhan23",
        "title": "New Fire Stick update is terrible!",
        "content": "Ugly new layout.\n\nMuch harder to scroll. Makes shifting through everything a chore.\n\nI will have to consider using my tablet to initiate a watch and search for titles from now on. It's that bad! \n\nWho's to blame! Netflix or Amazon? Apologies to Netflix if so. \n\nAlso take back that apology until Manhunter Season 3 comes out.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n82ngl/new_fire_stick_update_is_terrible/"
    },
    {
        "id": "1n7tk99",
        "author": "Randomname194728",
        "title": "Why can’t I choose the “English (Original)” option that makes Netflix know you don’t have surround sound?",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/r8u5mx9441nf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1n7tk99/why_cant_i_choose_the_english_original_option/"
    },
    {
        "id": "1n7xsee",
        "author": "dailystar_news",
        "title": "Netflix's star Penn Badgley announces birth of twin boys with wife Domino Kirke",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n7xsee/netflixs_star_penn_badgley_announces_birth_of/"
    },
    {
        "id": "1n79cox",
        "author": "Routine-Ad-1546",
        "title": "Katrina: Come Hell and High Water documentary",
        "content": "I know the documentary is new but its #2 of Netflix top 10 and I feel like its not talked about enough. I remember when Hurricane Katrina hit, I was 7 living in Winter Park, Florida and what we went through wasn't nearly half as bad as NOLA. I've cried so much and i'm not even finished with the 2nd ep. This documentary is so extremely devastating, a bunch of piss poor excuses working as government servants. The only one with integrity and honor being General Honoré. Its always better to be safe then sorry, mandatory evacuation of ppl in below sea level neighborhoods should've been 1st and not even second guessed. The corrupt Major Nagin, awful Governor Blanco, incompetent FEMA Director Brown, horrendous President Bush just ugh I want to vomit and I wonder if how tragically they screwed this up lives in their heads to this day.... None of them cared about their constituents or residents in the region. My heart aches.",
        "upvotes": 46,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1n79cox/katrina_come_hell_and_high_water_documentary/"
    },
    {
        "id": "1n7th23",
        "author": "Educational_Tea2511",
        "title": "Just finished watching “MY OXFORD YEAR” And what the helly",
        "content": "Yo, just watched My Oxford Year on Netflix and, girl, I’m shook AF. Thought it’d be cute Oxford romance, but that ending? Heart smashed. Sofia n Corey were legit sparks, all poetry n pub vibes, then it got heavy. The dream trip montage? Smilin then cryin, and boom, Jamie’s gone, Anna’s solo on the beach. Total mess rn. Heard the book’s softer, might read it to feel better. Anna goin prof and doin the cake thing was cute, keeps Jamie’s vibe alive. You seen it? You cryin too or just me? Spill, what hit ya?",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n7th23/just_finished_watching_my_oxford_year_and_what/"
    },
    {
        "id": "1n7vvk8",
        "author": "Shot-Canary-5912",
        "title": "Wednesday season 2 finale",
        "content": "The finale of season 2 was something, well a few things: exciting, creepy, disastrous yet at the same time kind of expected. This season just didn’t have that “OMG” moment like season 1 did. Idk how to word it properly as I only finished it about an hour ago, but something was off. However, don’t take this review as someone who is against the season and didn’t like it. I was glued (unhealthily) to my screen the whole time. Cannot wait for the next season now either, the way they used the last few moments to set the groundings for season 3 already has me excited. PLEASE DON’T TURN EVIL ENID! Pls lmk what all u guys think!!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n7vvk8/wednesday_season_2_finale/"
    },
    {
        "id": "1n7zdcz",
        "author": "AwakeningWillow",
        "title": "I think the \"Mole\" is suspicious",
        "content": "I'm currently watching the Netflix shoe \"The Mole\".\nI am starting to believe there isn't actually a true \"Mole\".  \nWhen there are only a few players left, I think that's when the producers choose who the \"Mole\"  is. \nI also think the reason they decide to eliminate people is not based on their answers, but possibly off who is the least entertaining.\nAny thoughts??? \nI\n ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n7zdcz/i_think_the_mole_is_suspicious/"
    },
    {
        "id": "1n7hgcn",
        "author": "negborhodhypersexual",
        "title": "Cole’s character from My life with the Walter boys is badly written",
        "content": "I am sorry but I had to say it. I know he is supposed to be this bad boy heartthrob stereotype, but all the interactions he has with Jackie or parts that are supposed to further his storyline are shallow and badly delivered. I don’t know if it’s the writers, the actor or everything else, but I just can’t seem to connect with him. \n\nAlso, the actor’s bone structure doesn’t fit with the overall age casting. I know this show has a lot of complaints about the actors not suiting the ages they’re supposed to be, but at the same time he’s the one that sticks out the most for me, especially next to Danny who is supposed to be his twin.\n\nThe show seems like they’re trying to have Damon and Stefan the remake, but it’s not working because those two were ancient vampires. The dark and broody bit on a teenager without going deeper into his struggles or thought process is just cringe.",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1n7hgcn/coles_character_from_my_life_with_the_walter_boys/"
    },
    {
        "id": "1n7qvxc",
        "author": "TwistNo8702",
        "title": "Music Loud, Voices Soft",
        "content": "Is there any way to change settings on Prime so that the music/sound effects are not so damn loud?! If I turn the music/sound effects down, the voices are too soft and can't hear what anyone is saying. \n\nThis seems to be the case on most TVs. Mine is an old Hisense ledn32d50, that I Chromecast to, but it happens on smart TVs, too, and I've tried playing with the settings there, but nothing. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n7qvxc/music_loud_voices_soft/"
    },
    {
        "id": "1n71i3j",
        "author": "spider3407",
        "title": "Leanne",
        "content": "Has anyone else seen the show Leanne on Netflix? I'm watching it and it is so funny and clever. I'm surprised no one else has talked about it. It is so funny to see Kristen Johnson in a role where she drinks. I recently finished rewatching the show Moms. \nEdited for typos.",
        "upvotes": 83,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1n71i3j/leanne/"
    },
    {
        "id": "1n6ojq5",
        "author": "Longjumping_Land_977",
        "title": "Chris Watts claims he’s a ‘changed man’ and ‘forgiven by God’ in new letters to female pen pal",
        "content": "",
        "upvotes": 402,
        "comments": 220,
        "media": null,
        "permalink": "/r/netflix/comments/1n6ojq5/chris_watts_claims_hes_a_changed_man_and_forgiven/"
    },
    {
        "id": "1n7vfy8",
        "author": "Particular_Signal191",
        "title": "Why is my top 10 tv shows in uk not showing ridiculous service",
        "content": "Why is my top 10 tv shows in uk not showing ridiculous service is anyone else in he uk having this problem or isit just my account its only showing top 10 films but not shows? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n7vfy8/why_is_my_top_10_tv_shows_in_uk_not_showing/"
    },
    {
        "id": "1n7mw1s",
        "author": "JuTeena",
        "title": "WEDNESDAY S2,Francoise and Isaac (spoiler ahead for those who haven't watched part 2 yet!)",
        "content": "Was i the only one waiting for the 'We are lovers and Tyler is Isaac's maybe son' part in Wednesday part 2.\nLike nah, I dont know how other people's sibling love is like buutttt yeah something wasn't right about this one? Like that chemistry was wild wilddddd. \nOr am I reading too much into it lol.\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n7mw1s/wednesday_s2francoise_and_isaac_spoiler_ahead_for/"
    },
    {
        "id": "1n7jlmx",
        "author": "ANGELB4B1E",
        "title": "Netflix not available in my region?",
        "content": "Can someone help me understand why my TV all of a sudden says “Your ad-supported plan is not available in this region?” I live in the U.S. and have never traveled outside of the country and I was just watching netflix on my TV with no issues last night so literally what happened overnight?? The app works perfectly fine on my ipad and phone but shows that message whenever I try on my TV. I restarted it and everything and still nothing. Anyone know a solution?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n7jlmx/netflix_not_available_in_my_region/"
    },
    {
        "id": "1n731vx",
        "author": "Boho_baller",
        "title": "Dark. German with English subtitles OR English voiceover with subtitles",
        "content": "What did you find was the best way to watch the series Dark? I speak English. I always use subtitles regardless of the language, but how should this show be watched for best experience and understanding of context? ",
        "upvotes": 13,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1n731vx/dark_german_with_english_subtitles_or_english/"
    },
    {
        "id": "1n6nt7c",
        "author": "DetectiveHot2071",
        "title": "KJ Apa spills messy details about the Riverdale cast sleeping together while filming",
        "content": "i knew it was happening but i'm still kinda shocked he said it so blatantly in an interview hahaha fourteen year old me is freaking out",
        "upvotes": 81,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1n6nt7c/kj_apa_spills_messy_details_about_the_riverdale/"
    },
    {
        "id": "1n75g21",
        "author": "Lonely_Holiday9034",
        "title": "The Hunting Wives",
        "content": "Okay so when I originally saw this show I immediately assumed it was a reality tv show LOL and man was I happy to be wrong. Such a good storyline that genuinely kept me guessing. Some of the characters had more predictable storylines obv because of foreshadowing etc etc but there were a lot of things I anticipated that I was wrong about. Now I’m rewatching it with my husband and catching more details I missed the first time around. And season 2?!!! Can’t wait. My one *annoyance* is that Sophie is just stupid reckless by the end by I guess they have to keep the plot movin somehow 😂😂😂🤷‍♀️",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n75g21/the_hunting_wives/"
    },
    {
        "id": "1n7cf2b",
        "author": "3M4N59",
        "title": "“Zero Day” Proteus",
        "content": "If proteus was merely stress then how come the Mossad agent literally mentioned it on the phone with him? Aswell as coming up to rodger at the funeral asking if he was “hearing music” etc… if it was never rebooted then why did it even come up at all? This really bothered me and kind of ruined the show, I haven’t seen anyone else discussing this either.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n7cf2b/zero_day_proteus/"
    },
    {
        "id": "1n6r2gu",
        "author": "bigguys45s",
        "title": "Just curious, for fans of Netflix’s, “Trainwreck” series of documentaries, what topics would you like to see next/ discussed about?",
        "content": "Maybe like the rise and fall of certain companies/ corporations over the years/ or even the current Roblox game scandals/ downfall, lol. Or the rise and falls of certain social media personalities/ YouTubers as well.\n\nI honestly enjoy the, “Trainwreck” series quite a bit. Entertaining (if often shocking) documentaries with a bit of twisted/ dark humor thrown in there as well.",
        "upvotes": 42,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1n6r2gu/just_curious_for_fans_of_netflixs_trainwreck/"
    },
    {
        "id": "1n77u5t",
        "author": "oldsoulpapaya",
        "title": "My Life With the Walter Boys - season 2 issues. Jackie and Cole",
        "content": "I love My Life With the Walter Boys so much!! The whole cast seems so lovely and like a genuine family. But I have a few issues with season 2…\n\nFor me, the actress who plays Jackie can not act at all. Her character did not land. A lot of the scenes of hers felt stiff, flat, disengaged and unnatural. Take the final scene for example when the ambulance comes, her reaction just didn’t feel natural. It felt laboured and half hearted and I noticed it enough that it effected my overall feeling \n\nBy comparison the actor who plays Cole I thought was fantastic this season. I loved the delivery of that portrayal of the actor, really shined, especially this season. He did such a beautiful, seamless transition that  made him more likeable, vulnerable and understandable. It’s such a lovely light hearted family show that reflects the beauty and complexities of family subtly, and his character adds depth and rawness, which is really refreshing. He’s doing a great job\n\nThe love triangle though….is driving me crazyyyy. I honestly feel like it’s so obvious that Cole and Jackie are meant to be together. Their chemistry feels so natural, and they bring out the best in each other, it’s real relationship energy and intimacy where they feel like an in love couple with an unsaid understanding \n\nI really don’t enjoy Jackie and Alex as a couple. At all. It’s frustrating that season 2 ended on basically the same cliffhanger as season 1… but at least there’s clear growth with Cole this time around. His character feels more grounded and less arrogant, which I loved seeing\n\nI  want Jackie to finally settle down instead of bouncing between the brothers. Alex might be the “good boy” type, but it’s obvious Jackie’s heart is with Cole. That’s the relationship I want to see play out in season 3\n\nIt’s a great show and I adore the family essence of it but I have issue with season 2 not being much growth in the story and the actress who plays Jackie not being really present in her delivery. For me it was Cole’s character who really shined this season but I’m hoping everything steps up for everyone in season 3\n\nWhat does everyone else think?? ",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1n77u5t/my_life_with_the_walter_boys_season_2_issues/"
    }
]