[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oth71o",
        "author": "Candiez89",
        "title": "“Beef” on Netflix",
        "content": "Wow. Just wow. I’d never even heard of the tv series “Beef” on Netflix and randomly stumbled upon it when I was browsing Netflix last night looking for something to watch. I ended up binge watching the whole thing in one go, and I have to say it was hands down one of the best tv series I’ve watched in a very long time. It had me laughing, crying, and just feeling all the feels.\n\nSerious credit to the actors, producers, and screenwriters for real. A special shoutout to the actor Steven Yeun in particular, who played the main character, Danny 👏👏🙌... Amazing.\n",
        "upvotes": 519,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1oth71o/beef_on_netflix/"
    },
    {
        "id": "1otuwg4",
        "author": "JamieLTR",
        "title": "Documentary",
        "content": "Looking for a good documentary to watch! Just got done with unknown number the high school catfish. I’ve watched several other documentaries on Netflix (Murdaugh murders, Gabby’s petito, take care of maya, etc). Any recommendations?\n",
        "upvotes": 66,
        "comments": 148,
        "media": null,
        "permalink": "/r/netflix/comments/1otuwg4/documentary/"
    },
    {
        "id": "1otvvzj",
        "author": "57829",
        "title": "‘Wednesday’ Star Catherine Zeta-Jones Wants Danny DeVito to Play Cousin It: ‘He’s Gonna Kill Me for That’",
        "content": "",
        "upvotes": 45,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1otvvzj/wednesday_star_catherine_zetajones_wants_danny/"
    },
    {
        "id": "1otxqx3",
        "author": "[deleted]",
        "title": "What’s one song that became so iconic because of the movie it was used in, that you can’t hear it without instantly thinking of that film?",
        "content": "Love Me again by John Newman.\nThe song was used in the film \"Edge of Tomorrow\" and with its increased popularity found its way into the FIFA 15 game's soundtrack which boosted its success even more. However, those who've watched Edge Of Tomorrow, now can't remember the movie without remembering the song first!",
        "upvotes": 13,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1otxqx3/whats_one_song_that_became_so_iconic_because_of/"
    },
    {
        "id": "1otcxn2",
        "author": "FinalLightNL",
        "title": "Another price hike... Are you guys serious???",
        "content": "€20,99 for the new plan is ridiculous, how are you guys oblivious to why people are taking other roads to watch shows and movies?\n\nThat's it, i couldn't give less of a ...   i'm canceling my sub.",
        "upvotes": 85,
        "comments": 79,
        "media": null,
        "permalink": "/r/netflix/comments/1otcxn2/another_price_hike_are_you_guys_serious/"
    },
    {
        "id": "1ou13yo",
        "author": "bbsquirell",
        "title": "Finishing Nurse Jackie soon and I need a plan for what to watch when I finish it",
        "content": "Im very into the drug addict aspect of this show. I’d like to lean into that as I search for a new show. I also like the drama! I’m probably going to stay away from more medical shows because the whole time I’ll just be thinking “nurse Jackie is better” looking for suggestions for shows that are really good and dramatic but not soapy. Preferably with multiple seasons! I’m patiently waiting for stranger things season 5, but I’m going to finish this series before that is released. \n",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ou13yo/finishing_nurse_jackie_soon_and_i_need_a_plan_for/"
    },
    {
        "id": "1ot3vhz",
        "author": "[deleted]",
        "title": "What is that one movie which everyone loves unanimously but you hate it with all your heart?",
        "content": "For me it's Leon - The Professional.\nExcept the opening sequence and Gary Oldman's performance, nothing else felt quite compelling to me as most made it out to be. The pedophilic thread was the boiling point for me as I've never been this uncomfortable in even a disturbing movie, let alone a so-called \"action\" film. I'm familiar with the director's personal life as well as the extended cut and the disgust relating to it just goes on more by the day. Do let me know what is your opinion on this film as well as the films you hate which received critical acclaim.",
        "upvotes": 156,
        "comments": 747,
        "media": null,
        "permalink": "/r/netflix/comments/1ot3vhz/what_is_that_one_movie_which_everyone_loves/"
    },
    {
        "id": "1otckfi",
        "author": "Frosty_Ad_5096",
        "title": "What show or movie is this from?",
        "content": "",
        "upvotes": 26,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1otckfi/what_show_or_movie_is_this_from/"
    },
    {
        "id": "1ou1k1z",
        "author": "Shah2002",
        "title": "Cinematography of FRANKENSTEIN (2025)",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ou1k1z/cinematography_of_frankenstein_2025/"
    },
    {
        "id": "1ou0gvj",
        "author": "TheGavinator1",
        "title": "Frankenstein James Jean poster",
        "content": "does anyone have a spare poster from their screening? eBay has a lot of fakes posted, and I can't trust ones that seem legit because they'll have copy and pasted descriptions. will pay",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ou0gvj/frankenstein_james_jean_poster/"
    },
    {
        "id": "1otfjwb",
        "author": "Sufficient-Curve2951",
        "title": "Jacob Elordi's monster in Frankenstein",
        "content": "Is Guillermo del Toro’s Frankenstein the most humane depiction of the monster? This article makes some good points! Getting emotional over this movie was the last thing I expected but here we are! Monster's tale was beautifully adapted. What do you think?\n\n  \n[https://www.soapcentral.com/entertainment/how-guillermo-del-toro-s-frankenstein-reimagines-mary-shelley-s-monster-details-explored](https://www.soapcentral.com/entertainment/how-guillermo-del-toro-s-frankenstein-reimagines-mary-shelley-s-monster-details-explored)",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1otfjwb/jacob_elordis_monster_in_frankenstein/"
    },
    {
        "id": "1otytda",
        "author": "Far_Pen3186",
        "title": "What's a movie you always in real life reference, get reminded of, see parallels to, etc?",
        "content": "Movies that stay in your frame of references, etc.   What's a movie you always reference, get reminded of, see parallels to, etc?   Movies that you bring up in conversations, like \"this reminds me of movie XYZ\", etc",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1otytda/whats_a_movie_you_always_in_real_life_reference/"
    },
    {
        "id": "1otqbal",
        "author": "MasterSparrow",
        "title": "Man Vs Baby trailer",
        "content": "There's something weirdly AI generated about the baby. But good trailer overall.\n\nAnything with Mr Bean/Rowan Atkinson in it gets my watch and Man Vs Bee was amazing.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1otqbal/man_vs_baby_trailer/"
    },
    {
        "id": "1otjw9a",
        "author": "littleMissTired123",
        "title": "Just watched \"Behind Her Eyes\" need suggestions for similar stuff",
        "content": "Wow... what a show. I first saw a vid on tiktok and people were talking abt the plot twist and how crazy it was.  So, I watch it and the whole time im thinking \"oh I know what the twist will be\" but BOY WAS I WRONG.\n\nWhat did u think abt it? And do u guys have any similar shows with a crazy twist? I don't want a show that's 1+ seasons. Thanks ",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1otjw9a/just_watched_behind_her_eyes_need_suggestions_for/"
    },
    {
        "id": "1otnwiu",
        "author": "BespokeMe",
        "title": "Is there a way to tell if my extra member is actually using his account?",
        "content": "I added my brother as an extra member but I don't know if he has ever used his membership. He isn't replying to my texts (a bit of a hermit). Is there anyway for me to determine if he is making use of the membership? Thanks in advance to anyone that has an answer. The Netflix website is worthless.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1otnwiu/is_there_a_way_to_tell_if_my_extra_member_is/"
    },
    {
        "id": "1otw0s2",
        "author": "justbeingmebc2069",
        "title": "Wwe",
        "content": "Anyone else have an issue with watching WWE. Unless it is on my phone it is so grainy. We have watched different tv's and trust using a roku. We have the best wifi out there. And yet quite a bit it gets SO grainy. What are we doing wrong or as anyone else experienced this. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1otw0s2/wwe/"
    },
    {
        "id": "1otu6rl",
        "author": "greennurse0128",
        "title": "Help finding shows dubbed in english.",
        "content": "Deadwind.\n\nDeath Inc.\n\nTwo shows, I wish were dubbbed in english! A lot of the times I am doing something else and cant always stare at the screen.\n\n\nI watch a lot of the these these shows. The Killing, Pagan Peak, BorderTown, The Breakthrough (so good) etc. I search netflix for european drama shows, german shows, swedish shows.  And the results are lackluster. \n\n\nIs there a way to find these english dubbed shows?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1otu6rl/help_finding_shows_dubbed_in_english/"
    },
    {
        "id": "1oteq9z",
        "author": "Sufficient-Curve2951",
        "title": "Heweliusz",
        "content": "Just got to know the real story through this article! A great tragedy indeed but the Systematic failure and the cover-up are honestly a shame.\n\n[https://www.soapcentral.com/shows/heweliusz-the-tragic-real-life-ferry-disaster-inspired-netflix-s-latest-polish-historical-drama](https://www.soapcentral.com/shows/heweliusz-the-tragic-real-life-ferry-disaster-inspired-netflix-s-latest-polish-historical-drama)",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oteq9z/heweliusz/"
    },
    {
        "id": "1otgv3x",
        "author": "jaguaraugaj",
        "title": "Gunslingers - WTF",
        "content": "I love Westerns, but after Nicolas Cage spoke, I thought I was watching Idiocracy. So terrible, why has the quality of simple movie production become such a problem?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1otgv3x/gunslingers_wtf/"
    },
    {
        "id": "1osywvk",
        "author": "GeneralIronsides2",
        "title": "Finished Death by Lightning and....",
        "content": "It is so well put together, and I was blown away by the fact that a lot of what happened in the show was pretty faithful to what actually happened, Charles Guiteau did become apart of a free loving commune, and was a failure at everything he did in life. Garfield was a Civil War hero and a abolitionist, and he didn't initially want his parties nomination, and is considered one of the last 'log cabin' Presidents, because he like Lincoln was born in a log cabin. Guiteau had hidden the gun in his pocket and the police only found it after taking him to the police station, and the first metal detector was used on Garfield. Guiteau's brain was actually studied, and its thought that his actions may have been due to syphilis, though of course in the 1880s medical tests like that were very unreliable. And Chester Arthur passed a lot of Garfield's corruption reforms. The score was great, made by the same composer that did Game of Thrones and Iron Man. I also thought they nailed Michael Shannon's look, his beard looks very similar to Garfield's pictures. Betty Gilpin's performance was so convincing.",
        "upvotes": 40,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1osywvk/finished_death_by_lightning_and/"
    },
    {
        "id": "1otn4tj",
        "author": "Teknevra",
        "title": "Orpheus Sings to Hades | The Sandman | Netflix Philippines",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1otn4tj/orpheus_sings_to_hades_the_sandman_netflix/"
    },
    {
        "id": "1ot7z4m",
        "author": "purple_jelly30",
        "title": "Can someone suggest me shows similar to Derry girls ?",
        "content": "I really loved the show and also I enjoyed the accent so I’m looking for something as refreshing , funny and light as Derry girls. Please do recommend me some ! ",
        "upvotes": 9,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1ot7z4m/can_someone_suggest_me_shows_similar_to_derry/"
    },
    {
        "id": "1otoewc",
        "author": "thisisinsider",
        "title": "Netflix wants 50+ video podcasts ready for early next year as it looks to challenge YouTube",
        "content": "",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1otoewc/netflix_wants_50_video_podcasts_ready_for_early/"
    },
    {
        "id": "1othirf",
        "author": "Different_Paint7862",
        "title": "How to contact customer service?",
        "content": "A subscription charge was put onto my bank account for 13£ but I never signed up to make an account. I suspect someone is using my details, and I’m trying to contact netflix through their customer service but cannot find any information.\n\nIf anyone has their customer service information, I would really appreciate it. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1othirf/how_to_contact_customer_service/"
    },
    {
        "id": "1otgq6i",
        "author": "infectiousparticle",
        "title": "Priority Viewing 2024-2025?",
        "content": "I only let myself have one streaming subscription at a time, technically I should make myself finish Yellowjackets first but I just heard about the Perfect Neighbor movie, having had followed the case I went to impulse-subscribe to watch it, but I already know the real story, so for $18, what else is worth my time? I haven’t had Netflix in over a year so the only other thing that comes to mind is Squid Games S2.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1otgq6i/priority_viewing_20242025/"
    },
    {
        "id": "1otfr38",
        "author": "UpsetHealth5516",
        "title": "Do you wish to skip re-caps and intros when binge-watching on mobile with less sit-ups?",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1otfr38/do_you_wish_to_skip_recaps_and_intros_when/"
    },
    {
        "id": "1ot8s1o",
        "author": "redflost",
        "title": "Extra Member",
        "content": "Is it possible to take someones Extra Member account and add it to my Netflix account now we live together?\n\nBasically this person was an Extra Member on my account but now we live together I want to cancel the Extra Member and add them to my household without losing any profile data. Is this possible?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ot8s1o/extra_member/"
    },
    {
        "id": "1ot5b3c",
        "author": "AccurateWin9104",
        "title": "Suggestions please",
        "content": "Have watched Breaking bad, Haunting of hill house, Better call Saul, Osama bin laden documentary, Boston bombings, currently watching John Wayne Gacy tapes.\nAny suggestions for suspense, thriller series on Netflix?",
        "upvotes": 7,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ot5b3c/suggestions_please/"
    }
]