[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1r9rosv",
        "author": "ProfessionalIcy306",
        "title": "Qualche azione per aiutare il Comala?",
        "content": "Ormai lo saprete, il Comala chiude il perchè e il come ve lo lascio spiegare a chi ha creato questa realtà \nhttps://www.instagram.com/reel/DU886JCEg6C/?igsh=aDVsZ2sxeG03ZWto\n\nCosì come vi lascio qualche link utile per capire che tipo di associazione prenderà il suo posto.\n\nhttps://radioblackout.org/podcast/macerie-su-macerie-podcast-29-4-24-storia-e-storie-del-terzo-settore-il-caso-di-almaterra-ed-eufemia/\n\nhttps://torinocronaca.it/news/torino/533911/sfruttamento-nel-terzo-settore-prima-udienza-della-causa-contro-escape4change.html\n\nhttps://www.rainews.it/tgr/piemonte/video/2024/04/torino-lavoro-terzo-settore-assemblea-polo-900-f8763505-b3b8-469b-b20b-4b99e95f10d5.html\n\nVi lascio anche la mail del presidente dell'associazione per esprimere pacatamente i vostri dubbi e rispondere a eventuali vostre contestazioni pasquale.lanni@eufemia.eu. \n\nMa ora veniamo a noi. Che fare per aiutare il Comala? \nSono certo organizzeranno manifestazioni a suo favore, ma nel frattempo? Beh nel frattempo rompiamo loro i coglioni.\n\nA iniziare dalla circoscrizione 3 che è la responsabile del bando.\n\nhttps://decentramento.comune.torino.it/circoscrizione3/amministrazione/uffici/segreteria-presidenza\n\nChi può (soprattutto i residenti) chiami, prenda appuntamento, protesti. Chi non può mandi loro una mail per far sapere loro il nostro disappunto.\n\nMa non solo:\n\nPer contattare il Sindaco di Torino, Stefano Lo Russo, è possibile inviare una e-mail alle caselle istituzionali stefano.lorusso@comune.torino.it o sindaco.lorusso@comune.torino.it\n\nFatelo. Se siete elettori PD comunicategli la vostra intenzione di votare chiunque altro. Se non siete elettori PD... fatelo comunque.\n\nhttps://c.org/8WxZJjxTds c'è anche questa petizione su change\n\nSe avete altre idee o conoscete altre informazioni che possono essere utili aggiungetele e le integrerò nel post. Non lasciamo morire il Comala.\n\n",
        "upvotes": 63,
        "comments": 71,
        "media": null,
        "permalink": "/r/torino/comments/1r9rosv/qualche_azione_per_aiutare_il_comala/"
    },
    {
        "id": "1r9q1sp",
        "author": "Ko_tatsu",
        "title": "Situazione Comala: le parole del presidente Andrea Pino",
        "content": "Tutta l'amarezza e lo scoramento della situazione sono concentrati in questo video.\n\nÈ una vergogna ed è l'ennesimo insopportabile affronto di una città che tutto vuole essere tranne che a misura di giovane. \n\nIo credo che per chiunque sia di Torino questo modus operandi di gestire il potere da parte del PD non sia assolutamente nuovo. Tra poco inizierà lo scaricamento della patata bollente agonistico con il sindaco che dà la colpa alla circoscrizione che dà la colpa ai tecnici che al mercato mio padre comprò. \n\nÈ necessario che noi giovani e cittadini mettiamo alle strette la politica per quello che è successo. Ora aspetteremo il ricorso, ma una mobilitazione è d'obbligo. ",
        "upvotes": 46,
        "comments": 37,
        "media": null,
        "permalink": "/r/torino/comments/1r9q1sp/situazione_comala_le_parole_del_presidente_andrea/"
    },
    {
        "id": "1r9syx8",
        "author": "VecchioDiM3rd1955",
        "title": "Ciao Supermarket",
        "content": "Lo scorso weekend il Supermarket in via Madonna di Campagna ha chiuso.\n\nIo lo frequentavo ai tempi della lira ed era una discoteca carina, poi i giri sono cambiati. Mi son detto un giorno o l'altro di farci un giro. Poi ho letto che stava per chiudere e quindi sono andato.\n\nOra non so come fosse nelle altre serate, ma era pieno, c'era tanta gente, selezione musicale particolare. A vedere le ultime serate uno si domanda come mai abbian deciso di chiudere.\n\nMa poi una risposta me la son data. La zona e' periferica, se uno vuole andare li' con i mezzi pubblici o torna in taxi o fa chiusura e prende il primo 77 del mattino. Se uno va in macchina come ho fatto io al bar prende succhi e bicchieri d'acqua.\n\nL'altro problema che c'era e' mi sa la demografia. Per me va benissimo se sono tutti della GenX e qualche Xennial, ancor meglio dato che non c'erano truzzimaranzatamarri. Ma d'altra parte non c'erano i giovani, o comunque persone sotto i trenta. \n\nE questo mi fa supporre che poca gente alla fine andasse li`.\n\nso benissimo che alla fine sono anche io parte del problema, ma ormai sono vecchio, e B52 ed Angeli azzurri meglio lasciarli perdere, e se poi uno deve guidare alcool proprio nulla.\n\nPero' avessi saputo prima che in quel locale alla fine la situazione era carina magari ci sarei andato prima.",
        "upvotes": 17,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1r9syx8/ciao_supermarket/"
    },
    {
        "id": "1r9aknb",
        "author": "Frads01",
        "title": "alternative al comala?",
        "content": "è abbastanza scontato che con la nuova gestione diventerà una bella merda in pieno stile milanese.\n\ndetto questo, sapete se siano rimasti ancora degli spazi di incontro simili, dove si respiri un po' di naturalezza e si possa socializzare senza dover per forza fatturare con uno spritz in mano? oltre ai classici centri sociali \"a rischio\" tipo el paso o il gabrio, per citarne alcuni.\n\np.s. ovviamente tutta la mia solidarietà va agli ex-gestori e a chi ha collaborato con loro. se state leggendo, grazie per tutto ciò che avete fatto in questi anni. ❤️",
        "upvotes": 50,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1r9aknb/alternative_al_comala/"
    },
    {
        "id": "1r93amf",
        "author": "Gheebss",
        "title": "Il Comala chiude ma io no",
        "content": "Ragazzi non vi preoccupate, se mi cercate sarò a ubriacarmi come un matto davanti ai cancelli del comala ogni venerdì e sabato per il resto dei pochi giorni che mi rimangono su questa terra.\n\nProject C\n\n",
        "upvotes": 71,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/y7QYPM7TXxACcnsGWq_uGFl4-ZWpXFV8PX0BTcjX_mA.jpeg?auto=webp&amp;s=602f252f76845a6e0d695d45800d3c52707708d6"
        },
        "permalink": "/r/torino/comments/1r93amf/il_comala_chiude_ma_io_no/"
    },
    {
        "id": "1r9y02l",
        "author": "Infamous_Award7847",
        "title": "Cerco terreno agricolo",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r9y02l/cerco_terreno_agricolo/"
    },
    {
        "id": "1r8zya5",
        "author": "nickname1917",
        "title": "Dopo Sinner...il nulla",
        "content": "Sono passati due mesi dalla fine delle ATP e Piazza d'Armi è ancora in questo stato: una bella fetta di parco è inaccessibile e trascurata.\n\nDobbiamo aspettare il ritorno di Sinner per renderla ancora più inaccessibile ma bella agli occhi dei turisti?\n\nIo posso capire che ormai si viva per quelle due settimane ma non è corretto nei confronti dei torinesi che pagano le tasse e che non hanno ritorni diretti (e forse neppure indiretti) dalle ATP lasciare le aree verdi in quello stato.\n\nhttps://preview.redd.it/yu1g8q3ijgkg1.png?width=1440&amp;format=png&amp;auto=webp&amp;s=ef4569989908ec1b8d51a04533b1c5f977df8f24\n\nhttps://preview.redd.it/w6md8hhjjgkg1.png?width=1440&amp;format=png&amp;auto=webp&amp;s=a96bc89a98213f155f50a52ad2b38108625aa0d5",
        "upvotes": 36,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1r8zya5/dopo_sinneril_nulla/"
    },
    {
        "id": "1r8s3l0",
        "author": "lokumbu",
        "title": "Could someone help me in turino :(",
        "content": "Forgot my new airpods in the plane yesterday and they popped up in turino. Is there anyone who'd like to go on a mission for me? Or any other ideas?",
        "upvotes": 72,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wpdfvromdekg1.jpeg?auto=webp&amp;s=a58e86deac47a8e28454909ff0fea3f626c53790"
        },
        "permalink": "/r/torino/comments/1r8s3l0/could_someone_help_me_in_turino/"
    },
    {
        "id": "1r9a82n",
        "author": "Feeling-Conflict3214",
        "title": "Vivere in Via Borgo Dora, fattibile?",
        "content": "Mi chiedevo se per una ragazza sui 30 (quindi vita da lavoratrice) come possa essere vivere lì. Ho visto una casa e sono andata appositamente di sera (18.45/19).\n\nLa zona è proprio dove si trovano i locali e le bancarelle ed è molto carino quel tratto di strada, ho visto anche delle signore portare tranquillamente a spasso i cani, c’era ancora via vai, per il resto i locali e i negozi già chiusi\n\nMa considerando tutte le circostanze di vita quotidiana:\n\n\\- quando arriveranno le belle serate, sarebbe sicuro rientrare anche alle 22/23 da sola in sicurezza?\n\n\\- nelle commissioni quotidiane, spesa e giri vari, bisognerebbe davvero stare sempre allerta?\n\nNon avendo la patente e non uscendo più di un paio di volte a settimana, ho un budget mensile per il taxi, oppure ogni tanto mi riporta a casa un amico, in alternativa dovrei preoccuparmi?\n\nIl casinò è la movida non mi preoccupano, più che altro le tratte da e per casa.\n\nQualcuno ha avuto esperienza di inquilino in zona?\n\nAggiornamento: il problema è che per raggiungere via borgo Dora bisogna necessariamente passare per porta palazzo o corso Giulio Cesare, ci sono alternative?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1r9a82n/vivere_in_via_borgo_dora_fattibile/"
    },
    {
        "id": "1r8zxcj",
        "author": "Diecinavetta",
        "title": "Comala Torino: Pd querela Pino dopo il bando perso. Sinistra divisa su Askatasuna - La Stampa",
        "content": "Torino sta cambiando volto e sta cercando di diventare una piccola Milano, a pagare il prezzo sono i luoghi di aggregazione giovanile storici della città. Paradossalmente ci si aspetterebbe questi interventi da un amministratore di centrodestra e invece...",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1r8zxcj/comala_torino_pd_querela_pino_dopo_il_bando_perso/"
    },
    {
        "id": "1r9d8it",
        "author": "AfraidAd2805",
        "title": "Corsi serali artistici",
        "content": "buongiorno a tutti,\n\nsapete se ci sono corsi/attività o altri serali a Torino?\n\nSarei interessata in particolare a corsi di disegno o pittura, però anche semplici incontri andrebbero bene, è più per tornare a disegnare e intanto fare anche amicizia.\n\nHo 28 anni e sono da poco in città, ho pensato fosse un ottimo modo per integrarmi ma accetto consigli.\n\ngrazie a tutti",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1r9d8it/corsi_serali_artistici/"
    },
    {
        "id": "1r8ws8h",
        "author": "Electronic-Print-229",
        "title": "Consigli su come fare amicizia a Torino",
        "content": "Hellooo :) sono Ylenia, ho 27 anni e mi sono trasferita a Torino per lavoro circa 2 anni fa. Purtroppo non ho ancora avuto modo di conoscere nessuno oltre ai colleghi di lavoro...  Mi piacerebbe conoscere nuove persone e staccare dalla solita routine. Qualsiasi consiglio è ben accetto ☀️",
        "upvotes": 7,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1r8ws8h/consigli_su_come_fare_amicizia_a_torino/"
    },
    {
        "id": "1r94a2v",
        "author": "OppositeUsed5161",
        "title": "🛼Torino is a beautiful city! Here is me exploring the city away from the tourist stuff.",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/E4UlWoOQU9P4Gaf_FtJKpZxBoqHJjFYjZRA-BJSe96g.jpeg?auto=webp&amp;s=e5889ecdbda6d19a71a3b67fc3652a456804e241"
        },
        "permalink": "/r/torino/comments/1r94a2v/torino_is_a_beautiful_city_here_is_me_exploring/"
    },
    {
        "id": "1r97686",
        "author": "Repulsive-Tonight288",
        "title": "Telecamere o autovelox?",
        "content": "Su corso Moncalieri tra il ponte Isabella e il ponte Umberto I ci sono degli autovelox ma ormai spenti da anni (perché omologati percorsi a scorrimento veloce da 70kmh orari vedi corso regina e corso unità)\n\nUltimamente sono comparse nuove telecamere o aggeggi comunque sospetti sui vecchi autovelox non funzionanti e su un palo di nuova installazione (insieme con un nuovo cartello di avviso controllo velocità)\n\nQualcuno sa se sono autovelox o se sono solo telecamere per registrare il traffico?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1r97686/telecamere_o_autovelox/"
    },
    {
        "id": "1r962km",
        "author": "External-Start-6640",
        "title": "Convertire un negozio in casa: consigli?",
        "content": "Domanda un po' tecnica e un po' (molto) specifica ma ci provo: stavo vedendo online situazioni abitative a Torino e parlando con un mio amico esce fuori la possibilità di comprare un locale commerciale e riconvertirlo a scopo abitativo... mi chiedevo quanto fosse possibile come cosa! C'è qualcuno qui che ha info a riguardo/ha fatto questa bravata?\n\nAvrei anche trovato il locale da ristrutturare, ottima planimetria e nella zona che cerco... però prima di aprirmi un mutuo ecco voglio capire quanto sia fattibile come progetto\n\nPs considerate che non abito a Torino ma per fine anno mi ci trasferisco\n\nGrazie in anticipo!",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1r962km/convertire_un_negozio_in_casa_consigli/"
    },
    {
        "id": "1r94a43",
        "author": "TheMoistMaker69",
        "title": "Specialty Coffee in Torino",
        "content": "EDIT: Thanks everyone for the recommendations! We'll definitely make sure we hit Orso and Artifact!\n\nHi all, my wife and I are traveling around Italy and while we love Italian style espresso we find ourselves missing the specialty coffee that is common in places like London, Melbourne, etc. so we wanted some recommendations for places to try in Torino!\n\nMy Google Maps research has turned up places like Oishii Coffee, Costadoro Coffee Lab Diamond, Artifact, Pressato Coffee and Books, Dapper Coffee, and Santaromero. Are there any other spots worth checking out? Thanks!",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1r94a43/specialty_coffee_in_torino/"
    },
    {
        "id": "1r8srt1",
        "author": "NoraPinkUniverse",
        "title": "Altre zone di Torino città buone come Santa Rita e Cenisia? Lingotto e Mirafiori sono valide?",
        "content": "Buongiorno, i miei genitori prossimi alla pensione sui 60 stanno valutando di trasferirsi da Milano a Torino per via dei costi della vita troppo alti e per vivere in una città più raccolta (stanno considerando anche altri capoluoghi di provincia nel Nord-Ovest), e io mi accoderei a loro visto che al momento non ho più un lavoro qui e sono single, e e riprenderei gli studi per la laurea magistrale (ho già la triennale)\n\nQuindi stanno cercando un trilocale/quadrilocale con due camere da letto in una zona tranquilla ben collegata coi mezzi ma non troppo costosa.\n\nAl momento ci siamo segnati Santa Rita e Cenisia come zone ideali, ci sono altre zone di questo tipo a Torino città? Se si, quali? Lingotto e Mirafiori sono da scartare o sono tranquille? Io nel caso dovrei andare al campus di Lingue o di Relazioni internazionali di UniTo quindi un posto ben collegato coi mezzi anche se non centralissimo andrebbe bene.\n\n  \nVi ringrazio :)",
        "upvotes": 3,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1r8srt1/altre_zone_di_torino_città_buone_come_santa_rita/"
    },
    {
        "id": "1r8u522",
        "author": "CH_440",
        "title": "Cerco fotografo a Torino",
        "content": "Sto cercando un fotografo a Torino per alcune foto di una proposta di matrimonio. Qualcuno?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1r8u522/cerco_fotografo_a_torino/"
    },
    {
        "id": "1r7yj8o",
        "author": "SeverusSnark",
        "title": "Inglese per bambini a Torino. Come vi organizzate?",
        "content": "Ciao! Viviamo a Torino e sto cercando idee per aiutare mio figlio a mantenere l'inglese attivo. A scuola fanno poco e anche a casa non riusciamo a fare molto. Qualcuno ha trovato soluzioni, online o offline, che funzionano davvero per i bambini?",
        "upvotes": 65,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1r7yj8o/inglese_per_bambini_a_torino_come_vi_organizzate/"
    },
    {
        "id": "1r8b0un",
        "author": "Current_Emu4588",
        "title": "C'è qualcuno che ha voglia di fare amicizia?",
        "content": "Io sono M17 è cerco gente più o meno della mia età (vi prego se siete dei maniaci/disagiati non provateci neanche a scrivermi che vi blocco) ",
        "upvotes": 9,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g594y67gqakg1.jpeg?auto=webp&amp;s=118b5f270e5b7735c0f0b4ebbf4dbf97859d949d"
        },
        "permalink": "/r/torino/comments/1r8b0un/cè_qualcuno_che_ha_voglia_di_fare_amicizia/"
    },
    {
        "id": "1r8e9ot",
        "author": "nazarthinks",
        "title": "Have you been confused by this GTT terminal screen?",
        "content": "",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1r8e9ot/have_you_been_confused_by_this_gtt_terminal_screen/"
    },
    {
        "id": "1r84fbx",
        "author": "backdunflip",
        "title": "Ragazze qual è il vostro parrucchiere di fiducia?",
        "content": "Devo realizzare un taglio abbastanza semplice, ma non voglio uscirne traumatizzata come l'ultima volta, aiutatemii ",
        "upvotes": 8,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1r84fbx/ragazze_qual_è_il_vostro_parrucchiere_di_fiducia/"
    },
    {
        "id": "1r817jw",
        "author": "Key_Leg_6503",
        "title": "Solo io noto una differenza abissale nella qualità dei servizi tra Piemonte e le altre regioni del nord come Lombardia ed Emilia-Romagna?",
        "content": "",
        "upvotes": 11,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1r817jw/solo_io_noto_una_differenza_abissale_nella/"
    },
    {
        "id": "1r7ymbu",
        "author": "mattgwa",
        "title": "Weekly international meeting",
        "content": "Hello!\n\nIf you need to make new international friends in Torino and practice languages I organize an international meeting.\n\nIt is held every Tuesday at 8pm at Tipsy, piazza Vittorio Veneto 23B, Torino.\n\nThis project is 100% based on volunteering, 100% no-profit. I don't get any money out of it.\n\nIt's open to everybody, every age.\n\nIt's very useful for those who are new in town and for locals too to make new friends and connections and practice languages.\n\nHere is the link to our WhatsApp group: [https://chat.whatsapp.com/Glkd55ANFrXD468PVSih8q](https://chat.whatsapp.com/Glkd55ANFrXD468PVSih8q)\n\n... and here's the link to our page on Meetup: [https://www.meetup.com/torino-international](https://www.meetup.com/torino-international)\n\nWhat do you think about my project?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1r7ymbu/weekly_international_meeting/"
    },
    {
        "id": "1r7xjgt",
        "author": "LostInMyDreams_",
        "title": "Acquisto nuovo pc",
        "content": "Buongiorno,\nNell'immediato sarò costretto a comprare un nuovo pc. \nEviterei assemblati già pronti, quelli parcheggiati negli scaffali delle note catene di negozi di elettronica o venduti online.\nConoscete, mi potete consigliare negozi affidabili onesti, possibilmente in zona Santa Rita o nei paraggi, dove assemblano pc su misura a prezzi onesti??\nGrazie",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1r7xjgt/acquisto_nuovo_pc/"
    },
    {
        "id": "1r72gcg",
        "author": "Toughgirl-4253",
        "title": "Linea metro 2, voi che ne pensate? Siete fiduciosi per il 2032 o pensate che, di questo passo, faremo prima a inventare il teletrasporto?",
        "content": "Ma parliamone seriamente: abbiamo appena saputo che febbraio è il mese \"cruciale\" per i sondaggi e i nuovi micro-cantieri della **Metro 2** tra Scalo Vanchiglia e Regio Parco. Bene, direte voi. Finalmente si muove qualcosa! Peccato che poi leggi la data di fine lavori: **2032**. Sì, avete letto bene. Tra test, collaudi e pre-esercizio, se tutto va bene, vedremo un treno tra sei anni abbondanti.\n\n**Ma com’è possibile che nel 2026 ci si metta ancora così tanto a costruire una linea della metropolitana?** Capisco la complessità, capisco i sondaggi, ma qui stiamo parlando di tempi biblici. Ci ricordiamo tutti della Linea 1: quasi 15 anni per vederla completata. Sembra che a Torino il tempo si fermi quando si tratta di scavare sottoterra. Mentre nel resto del mondo le città si trasformano in pochi anni, noi ci prepariamo a un decennio di viabilità impazzita e transenne, con la speranza che i nostri nipoti possano prenderla per andare all'università.\n\n",
        "upvotes": 168,
        "comments": 89,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/epdu5b1371kg1.png?auto=webp&amp;s=8302cf181a7297d09c346b1abf29c9bda8047b1a"
        },
        "permalink": "/r/torino/comments/1r72gcg/linea_metro_2_voi_che_ne_pensate_siete_fiduciosi/"
    },
    {
        "id": "1r83lxc",
        "author": "FitWafer2763",
        "title": "Hotel in Torino",
        "content": "Hello \nI will stay one night in Torino due to a work trip. Which hotel would you recommend between these 2: Best Quality Hotel Gran Mogol or Hotel Roma e Rocca Cavour? Also, how can I spend best some hours in the afternoon in Torino? Grazie Mille! ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1r83lxc/hotel_in_torino/"
    },
    {
        "id": "1r82zsm",
        "author": "Famous-Print7360",
        "title": "Conosci un'estetista specializzata in elettrolisi a Torino?",
        "content": "Ciao a tutti,\nSono nuova a Torino e cerco un'estetista che faccia elettrolisi in città. Ho cercato su internet ma non ne ho trovata nessuna (ne ho trovata una, ma non la fa più).\nSarei grata se qualcuno avesse qualcuno da consigliarmi a Torino o nella zona di Torino.\nGrazie mille",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1r82zsm/conosci_unestetista_specializzata_in_elettrolisi/"
    }
]