[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1ojtfsd",
        "author": "Ok_Swordfish_5870",
        "title": "barbiere torino 10€",
        "content": "Ciao! Cerco un barbiere in centro che mi tagli i capelli per 10 o max 15€  \nAvete consigli?  \nGrazie!",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1ojtfsd/barbiere_torino_10/"
    },
    {
        "id": "1ojdxva",
        "author": "ElectricalVegetable6",
        "title": "Come bippare su SFM?",
        "content": "Ho fatto una tessera Bip Universitaria, che mi permette di usare i servizi urbani/suburbani e i treni nel comune di Torino. La mia domanda è: come si fa a bippare la carta nelle stazioni ferroviarie? Non trovo una macchina per bippare, a parte la macchina verde Tap&amp;Tap di Trenitalia.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ojdxva/come_bippare_su_sfm/"
    },
    {
        "id": "1ojkuxj",
        "author": "Icy_Sand_1453",
        "title": "Best food a Torino",
        "content": "What food should I not miss in Turin?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ojkuxj/best_food_a_torino/"
    },
    {
        "id": "1oj6ha0",
        "author": "Rascoyho",
        "title": "Soffiafoglie",
        "content": "\nScusate, ma anche a voi danno fastidio quei maledetti soffiafoglie a benzina che rompono i timpani e soprattutto i cog.. ni? \nIl comune non può bandirli a favore di quelli a batteria? ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1oj6ha0/soffiafoglie/"
    },
    {
        "id": "1ojj7o8",
        "author": "Haunting_Hat5975",
        "title": "partiboi69 in turin",
        "content": "Hey, is anybody going to partiboy69 on friday?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ojj7o8/partiboi69_in_turin/"
    },
    {
        "id": "1ojepzk",
        "author": "EstablishmentFit7936",
        "title": "Carte Pokémon Torino",
        "content": "Ciao a tutti!\nSono nuovo a Torino e sto cercando di completare il pokedex, sapete di qualche negozio o mercatino qui a Torino che vende carte singole ? Mi servono tutti i tipi di carte solo che non so dove trovarle",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ojepzk/carte_pokémon_torino/"
    },
    {
        "id": "1oj897t",
        "author": "reddithatsick",
        "title": "AAA cercasi squadra calcio a 7",
        "content": "Ciao Raga, io e un mio amico avremmo voluto fare tornei di calcio a 7 ( ma anche sporadiche partite ) ma mi sono reso conto che mi viene veramente difficile contattare squadre. Qualcuno di voi ha qualche dritta?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oj897t/aaa_cercasi_squadra_calcio_a_7/"
    },
    {
        "id": "1oj4lt6",
        "author": "Hot-Garage-4536",
        "title": "Scrittori a Torino e dintorni",
        "content": "Ciao a tutti! Starei scrivendo una storia per un fumetto, solo che scrivere non é una gran passione per me, quindi far uscire qualcosa di buono ci metto un po’. \nSe qualcuno avesse voglia di mettersi in gioco e aiutarmi a portare avanti sto progetto, vi sarei grata :)\n\nNon saprei neanche da dove partire per rendere più intrigante la mi proposta, quindi se avete delle domande fate pure :,)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oj4lt6/scrittori_a_torino_e_dintorni/"
    },
    {
        "id": "1oj297d",
        "author": "kvlt1",
        "title": "Place to sleep Friday 26",
        "content": "Ciao a tutti! Venerdì sera sono al C2C e dovevo dormire da amiche varie, che mi hanno però paccato...sto cercando qualcuno disposto a ospitarmi! se viene al C2C posso offrire birrette e varie in serata, altrimenti la mattina dopo una bella colazione! Grazie a tutti\n\nHi everybody! On Friday I'll be at C2C (Club2Club Festival) and I was supposed to crash at some friends' house, but they stood me up...I'm looking for somebody available to host me! if you're coming to C2C as well I can offer beer or whatever else, otherwise a good breakfast the morning after! thanks guys",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1oj297d/place_to_sleep_friday_26/"
    },
    {
        "id": "1oj09rz",
        "author": "Icy_Sand_1453",
        "title": "Arrivare a Torino",
        "content": "Arriverò a Malpensa il 26. Dal Terminal 2 ho visto autobus diretti con Flixbus e Flibco. Autoestradale non ha biglietti disponibili; non so se saranno in servizio durante le festività natalizie. Conoscete altre compagnie di autobus? Vale la pena acquistare il biglietto in anticipo o è meglio acquistarlo sul posto?",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1oj09rz/arrivare_a_torino/"
    },
    {
        "id": "1oi550s",
        "author": "Vittoriooh",
        "title": "Tram metro e SFM",
        "content": "",
        "upvotes": 101,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/252t7kmmrtxf1.jpeg?auto=webp&amp;s=9ca6f826ed92176e9b55e93e6df3375f3438e0a5"
        },
        "permalink": "/r/torino/comments/1oi550s/tram_metro_e_sfm/"
    },
    {
        "id": "1oigd6k",
        "author": "Tyvas",
        "title": "Dove comprare interruttori, encoder e potenziometri a Torino?",
        "content": "Ciao a tutti!\n\nSto costruendo un pannello per simulatore di volo fai da te (tipo quello che c'è in foto) e sto cercando un negozio che venda componenti elettronici come:\n\n* Interruttori a levetta\n* Encoder o selettori rotativi\n* Potenziometri \n* LED o materiali per retroilluminazione\n\nSo che potrei ordinare tutto online ma mi piacerebbe vedere i pezzi in persona, per assicurarmi della qualità. Avete qualche negozio da consigliare, possibilmente in zona Lingotto o facilmente raggiungibile in metro?\n\nSe qualcuno ha già realizzato controller simili e vuole condividere la sua esperienza sarei felice di saperne di più. Grazie in anticipo! ",
        "upvotes": 12,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k3stfz574wxf1.jpeg?auto=webp&amp;s=888ba9a4f52fd54e5f1211e66c114de8866957fc"
        },
        "permalink": "/r/torino/comments/1oigd6k/dove_comprare_interruttori_encoder_e/"
    },
    {
        "id": "1oio8ag",
        "author": "Zoremia",
        "title": "Cerco lucina del bracciale concerto Lady Gaga",
        "content": "Ciao! Sono stato al concerto di Lady Gaga a Milano, dove distribuivano questi bracciali con lucine. \nSto facendo alcuni esperimenti per attivarle dal computer, ma al momento ho solo uno di questi aggeggi. Se qualcuno ce li ha e se ne vuole sbarazzare, lo prendo volentieri!\n\nMi interessa solo la lucina, non il bracciale intero. Dovrebbe andar bene anche se è di altri concerti.\n\nGrazie :D",
        "upvotes": 5,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4hwepuianxxf1.png?auto=webp&amp;s=be1e4310e92f234668f4198b8dc84bcdb35a2b8d"
        },
        "permalink": "/r/torino/comments/1oio8ag/cerco_lucina_del_bracciale_concerto_lady_gaga/"
    },
    {
        "id": "1oicpqu",
        "author": "Hyzev_",
        "title": "AAA Cercasi compagni di studio",
        "content": "Ciao ragazzi, dato che ogni giorno leggo dei post generici per fare gruppo e conoscere gente nuova ci provo anche io ma in modo più specifico.\n\nSono un ragazzo di 28 anni che lavora da 5 e per questo ha messo in pausa la propria carriera universitaria. Vorrei ricominciare a studiare decentemente e con costanza quindi vorrei creare un gruppo di studio per aumentare un po' la motivazione. Attualmente sono iscritto al corso di laurea triennale in Informatica presso UNITO, essendo uno studente lavoratore ho degli orari un po' stravaganti ma magari qualcuno vuole unirsi a me anche solo una volta a settimana (non sto cercando gente iscritta esclusivamente ad informatica, qualsiasi corso di laurea va bene, anche magistrale). Fino ad ora ho sperimentato solo l'aula studio EDISU in San Salvario, per me va benissimo ma sono disponibile a valutarne altre. L'importante è che siano aperte fuori dall'orario d'ufficio, i miei orari sono:\n\nLunedi: -\nMartedi: 19:00/23:00\nMercoledi: -\nGiovedi: 19:00/23:00\nVenerdi: -\nSabato: 10:00/20:00 \nDomenica: 10:00/20:00\n\nVorrei creare un gruppetto (anche su wa/tg) per organizzarci, scrivetemi pure in dm (anche studenti stranieri ed erasmus sono ben accetti!)",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oicpqu/aaa_cercasi_compagni_di_studio/"
    },
    {
        "id": "1oige17",
        "author": "Lollodoro",
        "title": "Dove bere il bicerin?",
        "content": "Buona sera cari amici Torinesi,\nMi stavo chiedendo se ci sia un locale del centro in cui sia possibile trovare il bicerin la sera, dopo ora di cena.\n\nGentilmente.",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1oige17/dove_bere_il_bicerin/"
    },
    {
        "id": "1oi72m6",
        "author": "zacchinator",
        "title": "Vista di Crocetta e delle Colline del Po",
        "content": "La luce autunnale a Torino è incredibile. Adoro il contrasto tra le ville signorili e l'esplosione di verde, giallo e rosso degli alberi. Un angolo di pace, nonostante siamo in piena città. 🌿🏘️",
        "upvotes": 12,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z9q86u2uauxf1.png?auto=webp&amp;s=4aff5190522b4835836ccd2ad17b90627fbb84d4"
        },
        "permalink": "/r/torino/comments/1oi72m6/vista_di_crocetta_e_delle_colline_del_po/"
    },
    {
        "id": "1oibhvh",
        "author": "Glad-Lecture-1700",
        "title": "Piscine Torino centro",
        "content": "Consigli per piscine con possibilità di nuoto libero per adulti a Torino centro con prezzi decenti? \n\nHo trovato la piscina comunale Cecchi ma pare che sia aperta per il nuoto libero solo fino alle 15.30 e, lavorando, potrei andare solo dopo le 18. \n\nHo provato a chiamare la \"Omniafit\" che pare avere buone recensioni ma mi hanno chiesto di andare fin là solo per sapere il prezzo, cosa idiota che purtroppo fan tutte le palestre, magari se qualcuno ci va sa dirmi quanto costa senza dovermi fare 30 minuti di bus per conoscere un prezzo nel 2025...",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1oibhvh/piscine_torino_centro/"
    },
    {
        "id": "1oi4j1c",
        "author": "Sufficient-Visit-440",
        "title": "Corso Principe Oddone angolo Dora, com'è?",
        "content": "Ciao a tutti, non sono di Torino e volevo chiedervi che ne pensate della zona tra corso Principe Oddone e il fiume Dora. Avrei trovato lì una palestra che mi interessa, ma non so come sia la zona soprattutto la sera.   \nQualcuno conosce la zona?  \nCom'è a livello di sicurezza, specialmente la sera? ",
        "upvotes": 5,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w54i17a6ktxf1.png?auto=webp&amp;s=28496593c91e6fa96fc7133717dc24d8ee55b8e4"
        },
        "permalink": "/r/torino/comments/1oi4j1c/corso_principe_oddone_angolo_dora_comè/"
    },
    {
        "id": "1oieyqd",
        "author": "Icy_Sand_1453",
        "title": "Capodanno a Torino",
        "content": "Sarò a Torino a fine anno. Qualche festa in città, qualche spettacolo? ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1oieyqd/capodanno_a_torino/"
    },
    {
        "id": "1ohtiof",
        "author": "Bella_Goldhood",
        "title": "Nuove amicizie a Torino post relazione tossica",
        "content": "Buonasera a tutti, sono nuova su Reddit quindi spero di star postando nel posto giusto e nel modo giusto.\n\nHo letto una sfilza di post su “come fare amicizie a Torino” ma oltre a constatare che a Torino siamo in molti a vivere questo problema, non ho trovato una soluzione brillante e definitiva per il mio caso.\n\nVorrei spiegare da cosa nasce la mia difficoltà: ho 24 anni e sono uscita da poco da una relazione problematica che per diversi motivi mi ha completamente isolata dal mondo e impedito di costruirmi solide amicizie, per cui adesso mi ritrovo quasi sempre da sola e senza nulla da fare se non per qualche uscita saltuaria.\n\nAvendo concluso l’università, è anche venuto meno l’ambiente in cui più potevo cercare di stringere nuovi rapporti e ora che comincerò a lavorare sono limitata ai pochi colleghi non coetanei che avrò in ufficio.\n\nNon mi aspetto e non pretendo di trovare un gruppo di amici qui su Reddit ma sono alla ricerca di nuove persone da conoscere e nuovi interessi da coltivare, pertanto mi sembrava un buon punto di partenza chiedere a chi ha vissuto una situazione come la mia cosa ha fatto/come ne uscito e a chi ha tante passioni cosa fa nella vita nel tempo libero.\n\nMi rendo conto suoni banale ma per riprendersi da relazioni del genere bisogna completamente mettersi in discussione, e sicuramente farlo in compagnia alleggerisce il carico.\n\nQuesto è quanto, grazie a chiunque risponderà e buona serata a tutti.",
        "upvotes": 20,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1ohtiof/nuove_amicizie_a_torino_post_relazione_tossica/"
    },
    {
        "id": "1oi4y16",
        "author": "DarkDoomDimension",
        "title": "Prefettura di Torino Appointment",
        "content": "Hey everyone,  \nI’m new here in Italy and a foreigner trying to figure out how to book an appointment for **document legalization** at the **Prefettura di Torino**.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1oi4y16/prefettura_di_torino_appointment/"
    },
    {
        "id": "1oikr7c",
        "author": "festa-bianca-torino",
        "title": "Torino ciaoooo chi ha bomba🐸🐸io,,,,",
        "content": "@/smokqual ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oikr7c/torino_ciaoooo_chi_ha_bombaio/"
    },
    {
        "id": "1oi4isq",
        "author": "vasilnazarov",
        "title": "Parcheggi gratis zona San Salvario?",
        "content": "Studio fisica a UniTo (il dipartimento è accanto al Parco del Valentino), e volevo capire se mi conveniva andare col bus o con la macchina (siccome sto in un comune decentemente lontano).\n\nCi sono parcheggi gratis in questa zona? Va bene anche se è distante una mezz'oretta a piedi, basta che sia libero di mattina.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1oi4isq/parcheggi_gratis_zona_san_salvario/"
    },
    {
        "id": "1oi4dn2",
        "author": "AdThese6575",
        "title": "Collezionismo/Carte Torino",
        "content": "Ciao a tutti, quali sono secondo voi i migliori rivenditori Pokémon a Torino? Riuscireste a consigliarmi qualche negozio/edicola in città o poco fuori?\n\nGrazie in anticipo! ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1oi4dn2/collezionismocarte_torino/"
    },
    {
        "id": "1ohsbnx",
        "author": "guigbd",
        "title": "Nuove connessioni e good vibes",
        "content": "Ciao a tutti!  \nAbbiamo messo in piedi un gruppo a Torino per chi ha voglia di conoscere gente nuova, bere qualcosa in compagnia e passare serate diverse dal solito. La cosa bella? Dentro ci sono studenti (ma anche no!) da ogni parte del mondo e con hobby di ogni tipo — dal gamer all’appassionato di cucina, fino a chi ama il trekking o semplicemente chiacchierare davanti a una birra.\n\nOrganizziamo eventi dal vivo dove si gioca, si ride, si scoprono posti nuovi in città e, ogni tanto, ci scappa pure una gita fuoriporta per prenderci una pausa insieme.  \nNiente stress, niente formalità: solo voglia di stare in buona compagnia e allargare un po’ il giro di amicizie.\n\n[Uno dei nostri eventi al Valentino](https://reddit.com/link/1ohsbnx/video/e64l1kv5bqxf1/player)\n\nSe vi va di unirvi o anche solo curiosare, fatevi vivi nei commenti o in DM. Più siamo, più ci divertiamo.  \n",
        "upvotes": 4,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1ohsbnx/nuove_connessioni_e_good_vibes/"
    },
    {
        "id": "1oi1yv3",
        "author": "Necessary-Luca01",
        "title": "Nuove conoscenze a Torino",
        "content": "Sono un ragazzo di 24 anni  in cerca di nuove amicizie, persone con cui organizzare uscite",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oi1yv3/nuove_conoscenze_a_torino/"
    },
    {
        "id": "1oi1xk9",
        "author": "GoodHorse1926",
        "title": "Torino festa bianca",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oi1xk9/torino_festa_bianca/"
    },
    {
        "id": "1ohtmha",
        "author": "b1729",
        "title": "Hiking",
        "content": "Hi everyone! Which places near to Turin would you recommend for hiking? Thank you.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ohtmha/hiking/"
    }
]