[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 510,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1k71md4",
        "author": "nickbruckman",
        "title": "I’m Nicholas Bruckman — director of the new documentary on Netflix, MINTED: The Rise (and Fall?) of the NFT  — AMA on 4/28 @ 4pm ET!",
        "content": "What’s up r/netflix! I’m Nick, director of *MINTED*, now streaming on Netflix worldwide (well, North America, the UK, Australia/New Zealand, and Africa!)\n\nThe film is a front-row seat to the explosive rise of NFTs becoming a $40 billion digital gold rush, all the way through the market's dramatic crash. We spent years embedded in the digital art and crypto worlds, from NFT multimillionaires flipping JPEGs to the pioneering artists flipping the script on the traditional art market, plus the critics and journalists digging into the good, the bad, and bizarre of this new frontier.\n\nWhether you love or hate NFTs, I hope the film sparks some big questions about how art, tech, and finance are colliding. Beyond NFTs, it’s about pioneering artists trying to not just survive, but lead the way forward in how we use new technology as a society.\n\nWe premiered *Minted* at the Tribeca Film Festival, and its been a wild ride since. So whether you’re a collector, a skeptic, or just a fellow documentary nerd — AMA!\n\nproof: [https://www.instagram.com/p/DI12rZQz1BX](https://www.instagram.com/p/DI12rZQz1BX)\n\nnetflix: [https://www.netflix.com/title/81993558](https://www.netflix.com/title/81993558)",
        "upvotes": 14,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1k71md4/im_nicholas_bruckman_director_of_the_new/"
    },
    {
        "id": "1k8z00y",
        "author": "S4v1r1enCh0r4k",
        "title": "First Look at Liam Hemsworth as Geralt in The Witcher Season 5",
        "content": "",
        "upvotes": 30,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1k8z00y/first_look_at_liam_hemsworth_as_geralt_in_the/"
    },
    {
        "id": "1k8sdwu",
        "author": "BusinessBeetle",
        "title": "Havoc: Tom Hardy doesn't know how to act like a human being.",
        "content": "I'm a fan of Tom Hardy, but after watching Havoc, I'm not so sure anymore. \n\nGranted, this is off the heals of trying to watch Capone, which was a masterclasses in overacting. But going into Havoc, my expectations were reset, and I was ready to watch a mindless action movie. \n\nThe intro made me realize what I was in for: was I watching a movie or a video game intro? Everything looked fake, this is a movie that doesn't know how to act like a movie. And that's when Tom Hardy stepped in. An actor that isn't sure how a real human acts. \n\nYes, this movie is stylized and over the top. It's not trying to be realistic, but I think it's supposed to be a video game movie. From the hijacker's neon LED masks to the impossible camera action, this is a video game movie. \n\nBut at the heart is Hardy, whom I'd love to see him play an average Joe, who works as an electrician, but doesn't have a weird accent, a bizarre walk, or looks like he's acting. Because that's all I see now after Capone, Venom, and now Havoc: Tom Hardy is ACTING. But not like real human being. ",
        "upvotes": 75,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1k8sdwu/havoc_tom_hardy_doesnt_know_how_to_act_like_a/"
    },
    {
        "id": "1k94iij",
        "author": "Radiant-Agent-558",
        "title": "YOU S5",
        "content": "Kate should have died. She killed people and just gets to live happily ever after with HIS son (he’s a bad dad but still) Kate isn’t innocent and benefited from Joes kills. Henry could have been adopted by Megan. \n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k94iij/you_s5/"
    },
    {
        "id": "1k96v7l",
        "author": "TheMirrorUS",
        "title": "Netflix adding action thriller to rival Tom Hardy's Havoc",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k96v7l/netflix_adding_action_thriller_to_rival_tom/"
    },
    {
        "id": "1k932ih",
        "author": "damn_daim",
        "title": "Netflix app stuck at 540p",
        "content": "Hey everyone, I've been tryna watch Oppenheimer on Netflix windows app but it seems to have been stuck at 540p. I get full 1080p on other things ive watched (The Crown, House, se7en.....). I've tried it on browser aswell, it's also seem to be stuck at 540p. Double check any vpns, downloaded 1080p extensions but nothing seems to work. How do I fix this?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k932ih/netflix_app_stuck_at_540p/"
    },
    {
        "id": "1k95n0w",
        "author": "curiousnerd08",
        "title": "Comparing SDR, HDR10+, and Dolby Vision on Xiaomi Pad 6 – Why Are HDR Versions So Dim and Washed Out?",
        "content": "Hey everyone,\nI’ve been testing HDR content on my Xiaomi Pad 6, and I’ve noticed some interesting things while comparing SDR, HDR10+, and Dolby Vision. I wanted to share my experience and hear your thoughts on a few issues I’ve encountered. I’ve had similar experiences with HDR on my LG CX OLED as well, so I’m wondering if this is just how HDR is implemented or if it’s something else.\n\nSDR (Standard Dynamic Range):\nSDR has much better brightness compared to HDR10+ and Dolby Vision. It doesn’t look dim at all, and the brightness feels natural and sharp. The colors are balanced, and overall, it provides a more comfortable viewing experience compared to the HDR formats.\n\nHDR10+ and Dolby Vision:\nHDR10+ and Dolby Vision are supposed to enhance brightness, color, and contrast, but on the Xiaomi Pad 6, both of these look surprisingly dim, especially in comparison to SDR.\n\nDolby Vision in particular appears washed out, with colors lacking vibrancy and saturation. I was expecting much richer colors, but it seems flat and dull. Even HDR10+ feels less bright than I imagined.\n\nA Few Questions I Have:\nWhy are HDR10+ and Dolby Vision versions so dim? I thought HDR content was supposed to have better brightness and contrast.\n\nIs Dolby Vision really a useful feature to have? The feature is hyped up as this premium viewing experience, but when compared to SDR I don’t really see the benefit.\n\nStreaming Issues:\nAlso you can’t turn Dolby Vision or HDR10+ off if you don’t like it. This is pretty frustrating, as I’d prefer to stick with SDR in some cases, but the app forces HDR formats regardless of my preference.\n\nFinal Thoughts:\nHonestly, I’m struggling to comprehend why HDR has become so popular and why it’s valued so highly as a premium feature. If it’s supposed to make content brighter and more vibrant, why does it often seem like it’s more of a dim, washed-out experience?\n\n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k95n0w/comparing_sdr_hdr10_and_dolby_vision_on_xiaomi/"
    },
    {
        "id": "1k97fbx",
        "author": "Prestigious-Sail9406",
        "title": "The Diamond Heist",
        "content": "i dont know about yall, but watching the first 5mins, so many sounds effect and cant really clean to hear the character speaking, make me dont want to watch it",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k97fbx/the_diamond_heist/"
    },
    {
        "id": "1k8ydrb",
        "author": "Informal-Purpose5979",
        "title": "Race for the Crown",
        "content": "Heya!\n\nBinged the series last night and was pleasantly surprised with what I've watched. I am not into horse racing, and generally speaking, do not approve of gambling. That being said I approached the first episode with an open mindset and that if the first 10-20 minutes suck, then I'll just turn it off.\n\nIt started off a bit slow on the horses side and pretty fast on the glamour and glitz side, with lots of great personalities larger than life. The dapper jockey, the self-proclaimed race horse investor, the billionaire (there were a few actually) and a colorful and multi-national cast from the stables. Man, the show runners narrative building game was spot on! I felt like I was right there and then despite knowing nothing about horses, like I mentioned already.\n\nI don't want to spoil too much, so I'm gonna stop talking about what happened in the show, but will leave some notes to compare.\n\n- **Biggest surprise of the season**: Kenny McPeek. Whoa. What a man. What a rock. I did not expect to like him as much as I did by the end of the season. The way he was nonchalantly introduced and the part he played later was astonishing. Kudos to the show runners again.\n\n- **Biggest disappointment of the season**: Michael Iavarone and Frankie Dettori, not because they disappointed me, but because I was very disappointed along them as their endeavors didn't exactly go as planned. Michael grew on me, although the dude is all show.\n\n- **Katie Davis** was adorable. Watch her rip her heart out on camera. \n\n- **Umberto Rispoli** had the most normal/sane and lovely family and I just couldn't help but feel happy for them. It's nice to see someone doing it right in these *interesting* times.\n\n- **Michael Repole**... yeah.\n\n- **Dornoch's team** were so so great and genuine. Loved every single person in there, but especially Jayson Werth's crew (that's how I am referring to his family). I honestly didn't expect to see such a healthy and functional unit until I read that he and his wife go way back to highschool, which explains a lot.\n\nAs a conclusion, I think for me, this show is on par with Full Swing in terms of immersion into the sport, and Tiger King in terms of suspense (just don't look up the results for 2024) and character/narrative building. Really loved it and hoping to see season 2!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k8ydrb/race_for_the_crown/"
    },
    {
        "id": "1k95d03",
        "author": "VoteCompModee",
        "title": "\"There appears to be a problem with the payment method you are trying to use\" HELP",
        "content": "I've been trying to subscribe to Netflix for the past 2-3 days and it keeps saying \"There appears to be a problem with the payment method you are trying to use\"\n\nI created a new account and tried, still the same result. I changed cards and still the same 🙃 tf do I do",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k95d03/there_appears_to_be_a_problem_with_the_payment/"
    },
    {
        "id": "1k8e8dg",
        "author": "IrishStarUS",
        "title": "American Primeval fans must watch 'criminally underrated' Western series",
        "content": "",
        "upvotes": 54,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1k8e8dg/american_primeval_fans_must_watch_criminally/"
    },
    {
        "id": "1k8mcu6",
        "author": "spicynoodl_",
        "title": "Is there a way to remove the watch history of a single show on Netflix",
        "content": "I am rewatching The Crown, and I keep getting lost every time I watch an episode and then come back a few days later, because it skips ahead, so I can't remember where I was before. Is there a way I can \"wipe\" the history of a specific show so that Netflix doesn't remember that I've watched those episodes without wiping my entire account?",
        "upvotes": 19,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1k8mcu6/is_there_a_way_to_remove_the_watch_history_of_a/"
    },
    {
        "id": "1k8poyj",
        "author": "Adventurous_Pay7519",
        "title": "You (S5)",
        "content": "So like… Is anyone getting tired of the trope with Joe just seemingly having it good and then f***ing blowing it on some random chick? And I mean I get the internal dialogue explaining his behavior but Jesus Christ ",
        "upvotes": 9,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1k8poyj/you_s5/"
    },
    {
        "id": "1k90lj1",
        "author": "Fine-Delivery3518",
        "title": "How Do I Fix This",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/d13paohtqcxe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1k90lj1/how_do_i_fix_this/"
    },
    {
        "id": "1k88gvo",
        "author": "Sweaty-Toe-6211",
        "title": "Joe Keery Is ‘Okay’ If He’s Only Ever Known as Steve Harrington from Stranger Things",
        "content": "",
        "upvotes": 96,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1k88gvo/joe_keery_is_okay_if_hes_only_ever_known_as_steve/"
    },
    {
        "id": "1k8uqq6",
        "author": "Ancient-Damage9160",
        "title": "Any recommendation?",
        "content": "I'm looking for something that makes me think... I watched 13 Commandments, a Belgian police series and I liked it a lot, then Black Mirror, and on the other hand, on Apple TV I watched Severance and I thought it was incredible.\n\nI'm looking for something similar but on Netflix. It doesn't necessarily have to be science fiction but rather a movie that makes you think, or that is related to psychological themes and that is very good.\n\nAny recommendation? \n\nEdit I know dark is good. But some other options? ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k8uqq6/any_recommendation/"
    },
    {
        "id": "1k8kqrn",
        "author": "saleboulot",
        "title": "Suggestions of shows for someone who liked Million Dollar Secret",
        "content": "Give me suggestions of shows (On Netflix or other platforms) knowing that:\n\n* I enjoyed The Traitors, Million Dollar Secret, The Trust (concept but not necessarily the cast)\n* I don't like dating shows, insufferable casts, drama just for the sake of drama\n\nThank you!",
        "upvotes": 13,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1k8kqrn/suggestions_of_shows_for_someone_who_liked/"
    },
    {
        "id": "1k94wse",
        "author": "Plane-Cloud-5837",
        "title": "Very ironic that the guy who played Henderson in YOU has since been blacklisted from Hollywood",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k94wse/very_ironic_that_the_guy_who_played_henderson_in/"
    },
    {
        "id": "1k8xhas",
        "author": "Lexii2626",
        "title": "YOU - sequel?",
        "content": "Not fully completed YOU season 5 yet, got two episodes left. But just had a thought and was curious if anyone else would be even interested in it that liked the show. But having Netflix do another You 2.0? where it follows Joe's and love's son Henry and him kinda becoming the new Joe/love serial killer. Think it would be an awesome twist to it. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k8xhas/you_sequel/"
    },
    {
        "id": "1k9586s",
        "author": "kakimizu",
        "title": "Looking for someone want to join in solo netflix account",
        "content": "Naghahanap ako ng apat na tao na gusto makihati sa bayad sa netflix premium account. Bale ang mangyayare, tig 110 pesos tayo kada month for nerflix premium. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k9586s/looking_for_someone_want_to_join_in_solo_netflix/"
    },
    {
        "id": "1k8xwxs",
        "author": "Top-Dragonfruit-7735",
        "title": "What is the log in thing so horrible?",
        "content": "Every time I wanna log in a game or another device. It says my password is incorrect. But it is correcct. And even if I change it IT STILL SAYS INCORRECT",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k8xwxs/what_is_the_log_in_thing_so_horrible/"
    },
    {
        "id": "1k8q38m",
        "author": "m5les",
        "title": "If I were to stop netflix from sending me any notifications, would it still send an email if I changed the age restrictions on my profile?",
        "content": "If I disabled the setting that lets netflix send emails, would it still send a notification after changing the age restrictions on my profile? Furthermore, would it send a notification if I were to disable that setting.",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k8q38m/if_i_were_to_stop_netflix_from_sending_me_any/"
    },
    {
        "id": "1k8u52v",
        "author": "Mediahead13",
        "title": "Netflix no longer working on PC",
        "content": "So since the password crackdown, the only way I've been able to watch anything on Netflix in my home was through my laptop, since I have no intention of creating my own account.  But now it seems I'm no longer allowed to do that either. Is anyone else having this issue and is there a way around this or is this it for me?\n\n  \nAny help you can offer will be greatly appreciated",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k8u52v/netflix_no_longer_working_on_pc/"
    },
    {
        "id": "1k8d35o",
        "author": "feb19s",
        "title": "documentary reqs that arent true crime?",
        "content": "basically what the title says. it can be on anything. what is something you watched that greatly expanded your knowledge on that topic? i like learning about arts and history but also keen to look more into wildlife",
        "upvotes": 12,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1k8d35o/documentary_reqs_that_arent_true_crime/"
    },
    {
        "id": "1k8bfiv",
        "author": "Connect-Space1818",
        "title": "I need suggestions for new show to watch",
        "content": "Some I've watched previously :\n\nGossip Girl\nInsatiable \nNever Have I Ever\nThe Residence \nGood Girls\nSex Education \nHeartbreak High\nSquid Game\nWednesday \nHeartstopper ",
        "upvotes": 14,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1k8bfiv/i_need_suggestions_for_new_show_to_watch/"
    },
    {
        "id": "1k8sdof",
        "author": "LikeWowMan_Ca",
        "title": "Netflix lag loading",
        "content": "For the last month I have to restart anything I watch about 8 times before it’ll actually play. Everything just gets stuck at 0% and doesn’t load… and I mean EVERYTHING. Just in time for the rate hike too. Anyone else? This doesn’t happen with any other platform. I’m on a Firestick. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k8sdof/netflix_lag_loading/"
    },
    {
        "id": "1k8qtz4",
        "author": "ilmd",
        "title": "2 tv’s same house",
        "content": "If I’m watching a series in my living room then watch next episode the next night in my bedroom, why doesn’t the bedroom tv play the next episode. It goes to the episode I watched the night before in the living room. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1k8qtz4/2_tvs_same_house/"
    },
    {
        "id": "1k7yt4n",
        "author": "Upper-Transition4714",
        "title": "Does every new show/movie added to Netflix make it to the top 10?",
        "content": "My friends and I were wondering if every show/movie makes it to the top 10 Daily. We went through the most recent shows release and they all seemed to be in the top 10 at least for a day in some country. I understand the incentive for Netflix to do so but I was wondering if you have noticed any new show/movie that hasn’t. ",
        "upvotes": 68,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1k7yt4n/does_every_new_showmovie_added_to_netflix_make_it/"
    },
    {
        "id": "1k84yz5",
        "author": "curious7189",
        "title": "Million Dollar Secret - one of the best social deduction games",
        "content": "This is better than The Traitors IMO - one of the best social deduction games\n\nI loved that the millionaire had a secret agenda. The Traitors had the traitors do some missions but it was very rare. I wanted more of that and got it in Million Dollar Secret. \n\nI enjoyed the millionaire being rotated so often. It lets you see different strategies from different players.  \n\nThe winner played such a good game, and showed she was strategic in not voting Syd when she had immunity, playing the final round right etc. \n\nI would've been okay with Sam winning too. \n\nCorey...take a shot every time Corey guessed the millionaire incorrectly 😂 he was cool though. \n\nUltimately it was nice to see all of the contestants trying to play strategically. Some of the challenges could be improved (threading needle in the final episode?) but I can say the same for the Traitors. \n\nHoping there's a season 2! What are your thoughts? ",
        "upvotes": 12,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k84yz5/million_dollar_secret_one_of_the_best_social/"
    },
    {
        "id": "1k8ra1j",
        "author": "LenFraudless",
        "title": "Is Netflix scamming users that cancel their account?",
        "content": "I canceled my Netflix subscription back in February I got an email.. a month later it started charging me again.. I went back on canceled my account. I got a email confirming my cancellation on March 17th.  Yesterday I get an email thanking me for opening my account back up. I didn't open my account back up. Is this a common occurrence is this happening with everyone that cancels their subscription? ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1k8ra1j/is_netflix_scamming_users_that_cancel_their/"
    },
    {
        "id": "1k8mq5t",
        "author": "Sharp-Mine1136",
        "title": "2 accounts",
        "content": "Why would Netflix create 2 different accounts for me when I signed up the first time. I realized that I was being double charged when I recently cancelled my subscription but I was still seeing the charges on my statements. All this time I’ve been charged 2 times. Bruh \n\n\nSomeone else experience this issue ?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k8mq5t/2_accounts/"
    }
]