[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 697,
        "comments": 5169,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nxldkf",
        "author": "millzbill",
        "title": "Netflix loses $20 billion in value as stock drops in its worst week since April.",
        "content": "",
        "upvotes": 151,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1nxldkf/netflix_loses_20_billion_in_value_as_stock_drops/"
    },
    {
        "id": "1nxhwz4",
        "author": "Organic_Caramel_8354",
        "title": "Wayward SUCKS",
        "content": "0/10. Weird. Uncomfortable. Good acting but terribly unpredictable script. I am so disappointed. I wasted 8 hours of my life for this. Unless there is a follow up season, I don’t see any rectification for this. \n\n",
        "upvotes": 173,
        "comments": 130,
        "media": null,
        "permalink": "/r/netflix/comments/1nxhwz4/wayward_sucks/"
    },
    {
        "id": "1nxvtl8",
        "author": "peoplemagazine",
        "title": "Charlie Hunnam Says He Lost 30 Pounds to Transform Into Infamous Murderer Ed Gein for Netflix’s Monster — and Opens Up About How Else He Prepared for the Role",
        "content": "",
        "upvotes": 18,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1nxvtl8/charlie_hunnam_says_he_lost_30_pounds_to/"
    },
    {
        "id": "1nxeh8z",
        "author": "MelodicJello2099",
        "title": "Monster: Ed Gein is such a let down",
        "content": "Holy flip man this show blows. It’s wrenchingly slow paced, incredibly boring and all over the place. I don’t think I can make my way to another episode. I have no idea what the point in this is supposed to be but it’s horrid. Such a let down. ",
        "upvotes": 189,
        "comments": 336,
        "media": null,
        "permalink": "/r/netflix/comments/1nxeh8z/monster_ed_gein_is_such_a_let_down/"
    },
    {
        "id": "1nxjqgd",
        "author": "conzojay1",
        "title": "Ed gein story nonsense.",
        "content": "So he hits his brother over the head with a massive log (which didn’t actually happen in real life.) but somehow, the coroner misses the huge massive head wound the body would have and just blindly accepts asphyxiation as the cause of death without even checking the lungs either. Stupid logic, totally broke my immersion. ",
        "upvotes": 81,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1nxjqgd/ed_gein_story_nonsense/"
    },
    {
        "id": "1nxtr7k",
        "author": "mulgwang",
        "title": "am i the only one who really doesn't enjoy the last season of wednesday",
        "content": "i really couldn't get into the season at all, it was hard to concentrate on the plot and some characters that i actually liked started annoying the hell out of me. i watched only the first half of the season and am procrastinating starting the second half because i hated the first so much… 💀",
        "upvotes": 13,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1nxtr7k/am_i_the_only_one_who_really_doesnt_enjoy_the/"
    },
    {
        "id": "1nxqnuv",
        "author": "anon9876543210nymous",
        "title": "It's ridiculous we have to wait 2-3 years for the next season !",
        "content": "I was eager for Wednesday and strange things to return \n\nAlso squid game. Upload ...\n\nBut I read online platforms will only renew a show once it's streamed for a year and shows ratings *good enough to renew*  which means filming can't really begin until much later to allow a timely release \n\nNetflix, prime all of them are doing this.\n\nI feel like they are trying so hard to save money that customer satisfaction isn't even considered ",
        "upvotes": 10,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1nxqnuv/its_ridiculous_we_have_to_wait_23_years_for_the/"
    },
    {
        "id": "1nxcw4k",
        "author": "Big-Sprinkles7377",
        "title": "Charlie Hunnam as Ed Gein",
        "content": "I cannot get over how absolutely absurd his voice is in this show. I understand that he’s trying to replicate Gein’s voice to the best of his ability, but…did he really need to sound like THAT?? It was definitely a choice, that’s for sure. Lori Metcalf rules though. ",
        "upvotes": 101,
        "comments": 143,
        "media": null,
        "permalink": "/r/netflix/comments/1nxcw4k/charlie_hunnam_as_ed_gein/"
    },
    {
        "id": "1nxk9tf",
        "author": "ArtIsDead77_",
        "title": "Ed Gein:Mindhunter",
        "content": "Okay, can we talk about how Ryan Murphy blatantly copied David Fincher’s ‘Mindhunter’ in episode eight? It is a complete rip off! Lmfao. It doesn’t feel like they did anything different to the scenes to change them to fit the show, instead the Literally copied the scenes straight from mindhunter. \n\nSpeaking of, if Y’all want to watch a great show about serial killers check it out. 10/10. \n\nEd Gein 2/10 ",
        "upvotes": 9,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1nxk9tf/ed_geinmindhunter/"
    },
    {
        "id": "1nxbaer",
        "author": "SweetWitch180",
        "title": "I really like “The curious creations of Christine McConnell”, did anyone else?",
        "content": "I was so sad that this show didn’t get another season, and it ended on a sort of cliffhanger. I loved Rose and Rankles dynamic, and I loved the constant spooky vibe and tasty looking treats. And while Christine’s acting isn’t…great at times, I think her overall calm demeanor was a good contrast to the other characters wackiness. Anytime I bring it up my family thinks it’s dumb but I liked it a lot. ",
        "upvotes": 32,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nxbaer/i_really_like_the_curious_creations_of_christine/"
    },
    {
        "id": "1nxx769",
        "author": "schi__zoid",
        "title": "Monsters: Ed Gein - there's something off about the show",
        "content": "I don't know how to describe it. I'm halfway through, and it feels like there's an exaggeratedly slow pace, with too many details and distractions meant to... increase the disgust? IDK - as if the story itself isn't  enough.\n\nAnyone else felt this way?\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nxx769/monsters_ed_gein_theres_something_off_about_the/"
    },
    {
        "id": "1nx70an",
        "author": "Longjumping-Elk-7840",
        "title": "Anyone Watching Monster: Ed Gein Story ?",
        "content": "anyone watching it ? Last season was Okey-ish. But this time I'm quite excited to see Charlie human as Ed Gein. Anyone who watched/watching share your overall thoughts. ",
        "upvotes": 44,
        "comments": 123,
        "media": null,
        "permalink": "/r/netflix/comments/1nx70an/anyone_watching_monster_ed_gein_story/"
    },
    {
        "id": "1nxumfz",
        "author": "Different_Day7553",
        "title": "Monster: The Ed Gein Story",
        "content": "Okay first. Isn’t it funny how society is quick to blame the woman (mother) for why a man chooses to violate females (corpses). \n\nWhy was it again, another female whose influence was basically linked to this POS behaviour? (Adeline).\n\nThe last episode, I had to check 3 times to be sure it wasn’t finished and Netflix was automatically playing Mindhunter.\n\nWhy cant we all just accept that some men are so wildly fucked up, because they choose to be? \n\nWhy was Ed sexualised yet the Menendez brothers made to look daft? The two entail vastly different stories especially noting one is a monster and the boys were obviously victims. The writers ultimately wanted viewers to feel sorry for this guy.\n\nI must say the link to historical horror films being inspired by Ed was pretty good but otherwise, the show was shiiiiieeettttt.\n\nwtf is Ryan Murphy trying to have us believe because this story was so insanely incorrect to the point he can kiss my ass and I’m not watching anything from him again.\n\nCharlie Hunnam, peace out dude, ain’t anyone going to take you seriously after this performance. \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nxumfz/monster_the_ed_gein_story/"
    },
    {
        "id": "1nxn1lr",
        "author": "noneofuswantthis",
        "title": "This might be dumb",
        "content": "It might not be an option buttt .. I really hate when I back out of a show and don't touch my ps4 controller for a few minutes and it starts playing flashes of shows until I wiggle the remote or hit a button. I just am wondering if there's a way to turn those off so that it just sits on the screen I'm on until I'm ready to hit play again lmao ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nxn1lr/this_might_be_dumb/"
    },
    {
        "id": "1nxt3ux",
        "author": "Eezzy_",
        "title": "Not being able to sign in after cookies reset",
        "content": "Every time I do a cookies reset and try to sign in it doesn’t let me sign in and I have to do a new password all the time. Even after using the cookie option from Netflix itself, Netflix is the only website I have trouble with.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nxt3ux/not_being_able_to_sign_in_after_cookies_reset/"
    },
    {
        "id": "1nxrw2w",
        "author": "Leading-Hippo-3541",
        "title": "Great new series",
        "content": "The series House of Guinness was a nice surprise. i figured I would watch one episode, then decide. I ended up binging the whole show. I loved it! I do like period pieces, and this is a great series. Highly recommend",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nxrw2w/great_new_series/"
    },
    {
        "id": "1nxehgs",
        "author": "Confident-Text-3980",
        "title": "Who’s Adeline in Monster: Ed Gein Story",
        "content": "Now I know that being a serial killer show we are mostly anticipating that the characters in the show are written accurate as much as possible &amp; there’s not really any side line characters, but boy this season make sure to flesh out the Adaline character for which I don’t know the reason for. Through research I tried to figure out more about her role and the real life events of the story to which there wasn’t a clear cut answer. But anyways, I found her character not needed or necessary for the show. To be honest, I was anticipating that the twist would be she was just a hallucination the entire time but supposedly she’s not. Her character is repulsive and equally disturbing as Ed. Why are we getting a pointless arc of her going to New York to glaze a graphic comic book novelist? Are we supposed to feel bad for a person who set Ed up to defile the body of another side character? Throughout the episodes, I was trying to figure out the motivation of her character, and I was still left confused.\n",
        "upvotes": 7,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1nxehgs/whos_adeline_in_monster_ed_gein_story/"
    },
    {
        "id": "1nww0ln",
        "author": "pinkykimster",
        "title": "Is monsters, Ed Gein, really about Ed Gein?",
        "content": "So is monsters, Ed Gein, really about Ed Gein?\n\nOkay, so I'm only two episodes in, so I may have missed the mark. But two episodes in, monsters Ed Gein, is monsters Alfred Hitchcock, psycho, featuring Ed Gein. I get that the making of psycho would make for a very interesting story. I just didn't expect a series about Ed Gein, being about that. Or mostly that. When I watched monsters Jeffrey Dahmer, or the Menendez brothers. I didn't watch a series about a movie based on them. And some hard hitting issues involved with that. Again, would make an excellent series. Not the one I thought I was watching though. Is this a me thing?\nEdit\n\nI made it to episode 4. To all of you who hinted it was going to also be about the Texas chainsaw massacre, this and silence of the lambs, well done. But honestly ffs. If they didn't know enough of Ed Gein to make a series out of it, than don't. No need to make stuff up. Or connect him to movies. Or I half part get that part. But make that it's own series, movies inspired by Ed Gein. Usually monsters takes some creative licence. Here, they took all the licence. Most of this is made up. When it didn't have to be. What he did was plenty to base a series on. What they did was make up shit surrounding this case, give the lead an awful voice the real Ed didn't. And than show,  hey, remember this movie? Wasn't that guy weird. Oooh that and making the lead in the Hitchcock movie gay. And him going, ugh, gay, that is so shit. My life is so shit. *I heard the real actor went through conversion therapy* All of this I hated. Im not watching episode 5. To those who stuck with it, let me know if I got it wrong. Im just done. The acting is fine. It's not them. The series is just so all over the place bad",
        "upvotes": 77,
        "comments": 234,
        "media": null,
        "permalink": "/r/netflix/comments/1nww0ln/is_monsters_ed_gein_really_about_ed_gein/"
    },
    {
        "id": "1nxfcmh",
        "author": "No-Hedgehog1797",
        "title": "why the “creative” choice for ed gein?",
        "content": "ed gein along with other killers were something i did some deep dives on a few years ago during the pandemic. \ni remember that ed gein was isolated and probably wasn’t the best socially— but he wasn’t slow.. he scored a 99 on the iq test. \nso… why make him “slow”??? i dont know if i’m going to be able to get through this first episode tbh there’s a lot of stuff rubbing me the wrong way",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nxfcmh/why_the_creative_choice_for_ed_gein/"
    },
    {
        "id": "1nxqaq0",
        "author": "Hot-Equal9848",
        "title": "Series aren’t appearing",
        "content": "Could anyone tell me why are some series that I’ve already watched aren’t appearing? They all disappeared suddenly, and I want to know if there might be something to fix this. I’ve asked my friends about it, and yet they still have them. Is this a temporary or a permanent thing?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nxqaq0/series_arent_appearing/"
    },
    {
        "id": "1nx1llh",
        "author": "Sudden_Pop_2279",
        "title": "‘KPop Demon Hunters’ Breaks Another Netflix Record With 15 Straight Weeks on Top 10",
        "content": "",
        "upvotes": 31,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nx1llh/kpop_demon_hunters_breaks_another_netflix_record/"
    },
    {
        "id": "1nxsvte",
        "author": "xCreampye69x",
        "title": "Wait what? Monster: Ed Gein and Mindhunter are in the same universe?",
        "content": "I mean it makes sense given the subject matter. If all the Monster shows are in the same universe that means theyre now all canon to Mindhunter aswell.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nxsvte/wait_what_monster_ed_gein_and_mindhunter_are_in/"
    },
    {
        "id": "1nx7j2f",
        "author": "Perfect-Cause-6943",
        "title": "Fireworks fall from a display in China Looks like the first game from Alice in Borderland season 3",
        "content": "",
        "upvotes": 12,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1eu9ec49zxsf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nx7j2f/fireworks_fall_from_a_display_in_china_looks_like/"
    },
    {
        "id": "1nxocik",
        "author": "thanksidontwantit",
        "title": "Flickering on safari full screen",
        "content": "I’m not sure if I should post here or /macbook or /safari… but this flickering only happens if I’m watching Netflix on full screen mode on safari (not other browsers or websites e.g. YouTube) Have tried all possible methods googled but it didn’t work :(\n\nDoes this happen to anyone? And is there a successful fix? I used to watch Netflix on chrome &amp; Firefox but chrome drained too much battery and Firefox keeps giving me error code on Netflix recently. \n\nMuch appreciated for any help. \n\n",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ihxt2arf02tf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nxocik/flickering_on_safari_full_screen/"
    },
    {
        "id": "1nwfelp",
        "author": "InsaneCookies21",
        "title": "Just to put this in perspective. Breaking Bad had 62 episodes in 5 1/2 years.",
        "content": "While Stranger Things will have 20 FEWER episodes at 42 in 9 1/2 years... absolutely ridiculous. So in nearly double the time, Stranger Things produced two-thirds the amount of content.",
        "upvotes": 596,
        "comments": 157,
        "media": null,
        "permalink": "/r/netflix/comments/1nwfelp/just_to_put_this_in_perspective_breaking_bad_had/"
    },
    {
        "id": "1nxnddx",
        "author": "Crafty_Progress2291",
        "title": "Help me find a tv show I can’t remember the name of",
        "content": "Hi everyone, I asked basically every AI platform you can think of to find this tv show that I watched on Netflix a couple of years ago. I don’t remember much of it all I know is that in the first episode, the characters were in a forest competing in a race and only the best people were allowed to be in the competition (Mostly men). However, the main character was a girl and everyone was targeting her because they thought she would be an easy target. (Not the 100 tv show) I also remember near the end of the show, the main character was talking to a tree and the tree held memories and some kind of special power. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nxnddx/help_me_find_a_tv_show_i_cant_remember_the_name_of/"
    },
    {
        "id": "1nx4yfa",
        "author": "Curious_Natural_1111",
        "title": "Is Alex Dempsey supposed to be awkward in Wayward?",
        "content": "I haven't seen Mae Martin in anything else so I'm not sure if it's just awkward acting for the character is supposed to be this way. \n\nI watched it for toni Collette and she definitely didn't disappoint but nothing really stands out in the series. The start was really good but it fell flat for me somewhere after episode 5.",
        "upvotes": 10,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1nx4yfa/is_alex_dempsey_supposed_to_be_awkward_in_wayward/"
    },
    {
        "id": "1nxuo02",
        "author": "Then_School2163",
        "title": "Betty White??",
        "content": "Am I the only one thinking this actress looks like Betty White? The resemblance is uncanny. Then I wasn’t expecting to see this side of her, on top of that.. ",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/50aib092p3tf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nxuo02/betty_white/"
    }
]