[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 120,
        "comments": 374,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mte0jn",
        "author": "cute_pum",
        "title": "‘Winning Grammy will be a message to every Asian American girl who’s ever felt impostor syndrome,’ says ‘Golden’ songwriter Ejae",
        "content": "Review from a non-kpop fan:\n\nHeard about Kpop demon hunters from a friend. Neither of us watched it and we're not really into Kpop. But we're both from Toronto and thought it was cool the director was from there. I myself like art as well.\n\nAfter watching film, it was easy to follow, fun movie. Not heavy on plotline but animations, colours, music was pretty awesome.\n\nLooking into the history and BTS of the film was what really caught me (hence sharing article). So much respect for the teamwork, thought and intention.\n\nFelt like it's a milestone for many of us who didn't make it in something but the alternative path brought us towards something we'd never imagined. Overcoming our battles and demons and bringing in a new version of ourselves.\n\nSo glad for this film's success and everyone involved 💯🙏👏\n\nP.s. yes you should watch this masterpiece 👌",
        "upvotes": 35,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mte0jn/winning_grammy_will_be_a_message_to_every_asian/"
    },
    {
        "id": "1ms9tim",
        "author": "Upset-Flower-148",
        "title": "The stupid household thing should be illegal and it is infuriating",
        "content": "Netflix uses your wifi to know if you are home. What if I have a kid in college across the country? What if my parents want to use my account and live across town? \nWhy the heck should I not be able to share MY account which I PAID for with anyone I want?\nA limit on the number of accounts makes sense but who cares on the location!?\n\nIt’s an obvious money grab and they have literally said in the past “true love is sharing your Netflix password” \n\nTalk about a 180. \n\nIt is infuriating. \n\nThis is just one of the things I added to my consumer protection law draft I am sending to my congressman. \n\nThen they “let you” add a person like they are benevolent and we should be thankful to spent $8 EXTRA!? Maybe if it was $1 I would understand but the entire software industry is infuriating on how much of a cash grab it is. ",
        "upvotes": 1765,
        "comments": 293,
        "media": null,
        "permalink": "/r/netflix/comments/1ms9tim/the_stupid_household_thing_should_be_illegal_and/"
    },
    {
        "id": "1mtao2c",
        "author": "cubiclecx",
        "title": "Netflix crack down on account sharing",
        "content": "I’m so sick of corporations making the experience more annoying/difficult just so they can gouge money from people. \n\nI live with my mom and use her netflix, I pay for some services and she pays for some and we share at our house. I recently went on a little vacation for and tried using netflix on my phone but it was saying I wasn’t “part of the household account” the thing is I don’t have her email and can’t ask her to look and send me the code in the middle of the night for her. \n\nThat’s not even the most annoying part, I get home and again while she’s sleeping I want to watch netflix on my phone but I’m still “not part of the household account” even when I’m connected to the wifi and again i’m not gonna wake her up for this so now I can’t use netflix? \n\nI get it’s a small issue but cmon I used to use netflix at ease and now I’m constantly battling how many screens are watching when I try switching from the TV to my phone and not even having access because I left for two days… streaming services are getting out of hand and we’ve been thinking of cancelling since my sister who left for college across the state cant use netflix anymore without them asking for more money. god forbid poor people enjoy things. ",
        "upvotes": 6,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mtao2c/netflix_crack_down_on_account_sharing/"
    },
    {
        "id": "1mt97dc",
        "author": "mallardducky",
        "title": "Took a bad AppleTV app and made it worse…",
        "content": "How on earth could they have taken a bad app and made it this much worse?  Top menu (and no easy way to get to it instantly), tiles that change side, and previews that \\*still\\* freakin’ autoplay with no way to disable it.\n\nAdd in that it continues to show the same limited number of shows/movies in all the various categories, created new ‘categories’ that are just full of garbage, and have abandoned the built-in video player for their own code, and it’s clear that they view the AppleTV as a necessary evil.\n\nI won’t even get into their refusal to play well with the overall ecosystem (that one I could deal with, if the app itself was usable, but it’s not).",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mt97dc/took_a_bad_appletv_app_and_made_it_worse/"
    },
    {
        "id": "1msz9t7",
        "author": "huds0",
        "title": "Dept Q - Why was Merritt so dirty??",
        "content": "I enjoyed the show, despite all the plot holes and confusing timelines. But the one thing that drove me nuts is: \n\nWhy the heck was Merritt always filthy? They showed her showering multiple times, but her face always looked like she just finished a shift as a chimney sweep. \n\n🤷‍♀️",
        "upvotes": 21,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1msz9t7/dept_q_why_was_merritt_so_dirty/"
    },
    {
        "id": "1mt9ow2",
        "author": "Thetrucker5",
        "title": "Screen mirroring",
        "content": "Why would Netflix stop allowing screen mirroring, all I’m trying to do as a truck driver is mirror my phone to the tv in my truck so I can have a larger screen, I have unlimited data but not unlimited hot spot, are they trying to loose even more customers ",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1mt9ow2/screen_mirroring/"
    },
    {
        "id": "1mt7yzx",
        "author": "No_Sound674",
        "title": "Is BoJack’s “The View from Halfway Down” one of the best individual Netflix episodes of all time?",
        "content": "As it’s definitely up there as one of my favorite cartoon episodes with it being how truthful and realistic it is, but also having it be BoJack’s DYING dream, I want to argue that it’s one of the best individual Netflix episodes out of any series on the platform. ",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1mt7yzx/is_bojacks_the_view_from_halfway_down_one_of_the/"
    },
    {
        "id": "1mt2lh5",
        "author": "Dotsq",
        "title": "Dark comedy is lowkey therapy",
        "content": "People think dark comedy is just “edgy jokes,” but honestly it’s way more than that.\n\nNormal comedy = you laugh at something dumb.\nDark comedy = you laugh at something painful.\n\nThat’s the magic. The moment you can laugh at shame or taboo stuff, it doesn’t crush you the same way anymore.\n\nShows like BoJack Horseman, Big Mouth, After Life (Ricky Gervais), Sex Education, Dead to Me, or The End of the F*ing World — they don’t just make you laugh, they sneak in permission to breathe. Like, “hey, the world isn’t gonna end if this embarrassing thing exists.”\n\nAnd Netflix has nailed this: some of their best comedies are hilarious and heartbreaking at the same time, showing how humor can live right next to grief, awkwardness, or chaos.\n\nSo yeah, call it what you want, but for some of us, dark comedy is therapy in disguise.\n\n⸻\n\nTL;DR: Laughing at pain makes it lighter. Dark comedy = free antidepressants.",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mt2lh5/dark_comedy_is_lowkey_therapy/"
    },
    {
        "id": "1mt3dgo",
        "author": "neidbrbduror",
        "title": "Guys I need some recommendations",
        "content": "I need a series or a movie about war romance kr something like the man fights and the girl keeps worrying about him and crying and when she sees him she hugs him and shut and he rescues her you know what I mean give me hundreds of recommendations deadass give me hundreds ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mt3dgo/guys_i_need_some_recommendations/"
    },
    {
        "id": "1mt87nv",
        "author": "Few_Warning_4273",
        "title": "I really hate the you cant play the next episode! Is it just me?",
        "content": "One of my biggest pet peeve with Netflix is that you can't go to directly to the next episode when you pause a series. Its always bothered me that I can't choose to go directly to the next episode but now I'm watching Korean dramas, they always do spoilers of the next episode at the end and I don't really want to see that. I have to come off to then go to the next episode and it really winds me up. Sometimes you even have to go to more episodes which angers me off even more.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mt87nv/i_really_hate_the_you_cant_play_the_next_episode/"
    },
    {
        "id": "1mt7v8o",
        "author": "James_15625_",
        "title": "Tried Watching Saare Jahan Se Accha, ended up binging half a season of House MD",
        "content": "So I saw good reviews of this show even before it released. Thought it will have that thriller or whodonit energy and that I’ll enjoy Saare Jahan se accha. No spoilers but half into the 2nd episode I’m bored. \n\nHouse MD on the other hand - some interesting characters introduced every episode and houses resident doctors make up for the show. Not sure why Netflix is unable to make the good content again. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mt7v8o/tried_watching_saare_jahan_se_accha_ended_up/"
    },
    {
        "id": "1msc1rn",
        "author": "Low-Squirrel-4868",
        "title": "Just rewatched Catch me if you can and it got me thinking",
        "content": "I know the movie is set decades ago but watching someone pull off that level of identity theft with nothing but charm and some paperwork is wild. It made me wonder how much easier it would be today with everything being online.\n\nBack then you had to forge documents and physically be somewhere to make the scam work. Now with social media, data leaks and people oversharing, you could probably impersonate someone you have never met just by piecing together public information. Name, address, phone number, old photos, even their signature if they have posted it somewhere (I myself have never changed my phone number or email, I imagine I'm in every database online). The scary part is how official everything can look. A scammer could set up fake accounts, fake email domains, fake phone numbers, and most people would not even think twice if the message looked professional. If someone had enough of your personal data they could probably pass as you with your bank, insurance, or even your employer. That's why I'm using Cloaked just to stay safe because I'm spiraling into all of this modern day privacy stuff and it's scaryyy. \n\nI know there is places you can buy data but is there any software or method to help with this stuff? I'd like to know your opinions or advice.",
        "upvotes": 79,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1msc1rn/just_rewatched_catch_me_if_you_can_and_it_got_me/"
    },
    {
        "id": "1mt9lo1",
        "author": "AngryPig154",
        "title": "I need help finding this",
        "content": "Idk the name but I remember its part this dude he finds a ring in a house and whenever he puts it on a ghost girl appears and then they like fall in love or sum ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mt9lo1/i_need_help_finding_this/"
    },
    {
        "id": "1mt39mb",
        "author": "Direct_Solution_2590",
        "title": "Live-action reccomendations",
        "content": "Can anyone here recommend me a live action series or movie, where the fight scenes are as good as what's in Bleach: TYBW, Jujutsu Kaisen or Demon Slayer?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mt39mb/liveaction_reccomendations/"
    },
    {
        "id": "1mt68ge",
        "author": "KingNene3",
        "title": "Secret Millionaire (Traitors viewers opinion)",
        "content": "A couple of thoughts, likely shared many times before..\n\nMy wife and I have watched most series of The Traitors (from all over the world, UK/US/Canada/NZ/Aus) and it’s the one “mainstream” show we really enjoy. \n\nSo, let’s find other similar shows, that’s when we came across this one. \n\nPositives:\n\nPeter Serafinowicz\nEnd game tactics\n\nNegatives:\n\nEverything else!? 😂\n\nBut seriously:\n\nZERO jeopardy in the entire game until the end game. As in, it didn’t matter who was or wasn’t the millionaire throughout.\n\nZERO tactics required until the end game. Just a popularity vote in reality and clutching at straws. \n\nOverly sexualised, this is coming from a heterosexual male here too. It’s like the producers brainstormed what makes TV popular and they’d all been watching Love Island etc.. Absolutely no need for the abundance of bikini shots, the shots of girls running from behind in said bikinis or the choice of clothes for the “laser beam” task. I’m all for having attractive people on TV, nothing wrong with a bit of eye candy, but this seemed so forced and unnecessary?\n\nWhat would I change:\n\nSome form of jeopardy for getting / not getting a millionaire out. For instance, every time a millionaire is caught an extra £10 is added to the pot.\n\nOne more thing:\n\nDid they all (except the winner Cara) play it poorly? As in, as the rules stand and if you’re sure someone is a millionaire (as they often thought they were at certain points in the game). Would it not be in your advantage to team up with one other person and attempt to keep that “millionaire” in until the end?\n\nIn closing:\n\nIt all came down to a game of chance at the end anyway, kind of renders the rest of the show pointless. \n\nI think there is a format in here somewhere, they just need to refine it, a lot!\n\nOff to find something else to watch now 😅\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mt68ge/secret_millionaire_traitors_viewers_opinion/"
    },
    {
        "id": "1mscvge",
        "author": "___TylerDurden",
        "title": "Brothers Home: The Echoes of Survivors: Inside Korea's Tragedies",
        "content": "Who else has watched the two episodes of Brother’s Home on Netflix and is horrified? This series made me so angry and sad, especially knowing that the members of that family are able to live well today. Why are people capable to do such things?! I feel so bad for the victims.\n\nWhat’s your opinion on this?",
        "upvotes": 31,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1mscvge/brothers_home_the_echoes_of_survivors_inside/"
    },
    {
        "id": "1mrqbz2",
        "author": "Flowerofthesouth88",
        "title": "S Club 7 Netflix documentary in The Works",
        "content": "I know there was more of no hit wonder in The US with Never have a dream come true but in The UK and a few countries they had a few hits but The band isn’t make much money then people thought and once they broke up, They still have financial issues that one member, Jon Lee turned to drug abuse to cope and drug abuse that nearly killed him, And Paul Cattermole sadly died in 2023 of natural causes and was on benefits months prior and tried to sell his Brit Awards trophy just pay The bills, Jo O'Meara was a contestant on Celebrity Big Brother UK in 2007 where she was controversy of racism in The house that killed her career in The end and had suicidal thoughts because what went on as she even had death threats from The public, It’s would be interesting for Netflix Viewers to watch even there not into S Club 7 or never heard of them because with The darkness that The band went during and after S club 7 and that it’s shows how little they made within The success within how much fame and little money they made that The fans didn’t think and also how there mental health can take a toll. ",
        "upvotes": 505,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1mrqbz2/s_club_7_netflix_documentary_in_the_works/"
    },
    {
        "id": "1mt38zx",
        "author": "Clipseexo",
        "title": "Does basic Netflix lag horribly for anyone else?",
        "content": "I wonder if it’s an Apple thing where they’re purposefully lagging your device so you subscribe to a higher price point. No matter what time of day this is always occurring. I know it’s not my internet bc the internet is fine when doing research or playing a game. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mt38zx/does_basic_netflix_lag_horribly_for_anyone_else/"
    },
    {
        "id": "1mt51da",
        "author": "PlotHole2017",
        "title": "Something on Netflix keeps triggering my Malwarebytes",
        "content": "I'm guessing it's probably against Reddit rules to post a link to a possible trojan but it seems to be the Netflix assets? It kinda comes and goes. A minute ago it wouldn't load but I just tried it again and it's loading now. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mt51da/something_on_netflix_keeps_triggering_my/"
    },
    {
        "id": "1msiw9e",
        "author": "Intelligent-Bit4250",
        "title": "Hitler and the nazis evil on trial",
        "content": "Just arrived at the last episode. I think the show is okay, but just okay. As someone who knows relatively much about the history of the Second World War I expected, judging by the title, a more thorough history of the Nuremberg trial of which I know less. However, that’s not what I got at all. \n\nThe trial is treated more as a sideshow and the documentary watches more like a general history doc of the Second World War. A missed opportunity to do something unique in my opinion. I get that it is also meant for people who don’t know anything about the Second World War, but I think you can also just introduce the fact that the trial is about the horrors and crimes during that war and then go on with a documentary about how the trial took place. \n\nNow it’s just the worst of both worlds. It’s veeeery general on the war, it’s causes and the way it was lost itself, but then also it just touches briefly upon the different perpetrators. \nWouldn’t it have been far better to go by topic, eg people responsible for the camps, people in general administration, generals etc etc. Or just a couple of episodes where they talk about one person only, eg Speer, Göring or Hans Frank? \n\nTLDR: the documentary is not anything like the title would suggest and it feels more like a general history doc of WW2. Generic. ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1msiw9e/hitler_and_the_nazis_evil_on_trial/"
    },
    {
        "id": "1msjeo9",
        "author": "akagiaa",
        "title": "Lucifer",
        "content": "I m thinking of watching Lucifer, but is it worth watching? Don't spoil the show, tho. The Imdb rate is 8, but I heard it's kinda boring . In every episodes there is a new case, and at the end, with the help of lucifer, it gets solved that's it. Idk, tho. What do you guys have to say about it?",
        "upvotes": 5,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1msjeo9/lucifer/"
    },
    {
        "id": "1mt2nci",
        "author": "dwfieldjr",
        "title": "Is anyone else having trouble getting ahold of Netflix customer service?",
        "content": "There’s two banners that keep saying “we are experiencing higher than volumes try back later”. I canceled Netflix last April and they’ve been charging me the whole time. I did notice Netflix’s sneaky little button that says “confirm cancellation “.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mt2nci/is_anyone_else_having_trouble_getting_ahold_of/"
    },
    {
        "id": "1msvhzc",
        "author": "AlexisLexus3829",
        "title": "Gossip Girl s5",
        "content": "Hey, it's not much a question about the season rather than a technical issue, ig..., E17 \"the princess dowry\" can't be played for some reason..., when I searched about it it showed that it's episode 20.., so now I'm confused with the order and note that every episode after and before E17 can be played except it for some reason. Does anyone know what's up with that?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1msvhzc/gossip_girl_s5/"
    },
    {
        "id": "1msu4up",
        "author": "Deep_Block7712",
        "title": "What if  Rumi showed her patterns to huntrix",
        "content": "I was watching korean cómics video and i was wondering what if she dud show her powers and say my dad was a demonnbut im not one  i  just am wondering. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1msu4up/what_if_rumi_showed_her_patterns_to_huntrix/"
    },
    {
        "id": "1msomee",
        "author": "randymysteries",
        "title": "Add ratings and warnings to show descriptions",
        "content": "When you open a film on Netflix, it counts as a hit, or view. If you look at the rating at the start of the show and decide not to watch the video and close it before the opening credits finish running, you've still technically watched the movie: by opening the movie, you generated a view for the movie. This means that if you open a movie and realize it is something you would never watch, you still stated that you watched it by opening it. This information is probably used by Netflix to determine what to add to its catalog, and false data like yours can be used to justify posting more movies you don't want to watch. \n\nIf Netflix included ratings and warning in the descriptions of their shows, we could decide whether to watch a show based on this information without opening the video. If the rating and warning make us concerned and we decide not to watch the show, we won't generate false data by opening the video. This could reduce the amount of false data used in determining Netflix content. ",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1msomee/add_ratings_and_warnings_to_show_descriptions/"
    },
    {
        "id": "1msmug4",
        "author": "Commercial-Ad-674",
        "title": "Hunting Wives - lazy writing",
        "content": "I enjoyed the drama but ti was so hard to get past how easily this would've been solves if they FOLLOWED THE GUN at the other shooting. They would've immediately figured out Kyle sold it, and that he was Margo's sister. If they had just left out the other shooting but that they found the gun, that wouldve been way more realistic. But also, no forensics were done at all??",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1msmug4/hunting_wives_lazy_writing/"
    },
    {
        "id": "1mt58y5",
        "author": "Otherwise_Maybe3127",
        "title": "Nflix lost its value 🤕",
        "content": "Does anyone also find that netflix has never recovered from COVID, wasn't it much better in its pre COVID era? (Who was ceo then vs now?) It used to release so many cool stuff and have a super exciting comming soon 🔜. Now days its just doesn't give you a good value bang. The coming soon are just boring platform transfer ex: Demeter left prime to go on netflix lol and they dare brag new on netflix for old stuff like Oppenheimer from 2023 🚮. It seems like whom ever is head of netflix now should care a bit more about making a product that people love and worrie less about shrinkflationning the product into PNL improvement 🤸‍♂️🤸‍♂️🤸‍♂️",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mt58y5/nflix_lost_its_value/"
    },
    {
        "id": "1msrwxq",
        "author": "roydodger3",
        "title": "Update now on Apple TV",
        "content": "So I saw and experience the update menu on my ps5 and I say to myself I hope this update doesn’t come to the Apple TV. And you know what it happened, browsing the new menu was kinda annoying only seeing 4 movies in the category is something I can’t get used to it. Maybe someday Netflix will make an option to go back the old design.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1msrwxq/update_now_on_apple_tv/"
    },
    {
        "id": "1mseksi",
        "author": "Creative-Ad-1363",
        "title": "Quantum Leap",
        "content": "I love this series, it's so refreshing. I'm on season 1. It tells really important stories in the most wholesome way. Those of you looking for a family show, this fits the bill.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mseksi/quantum_leap/"
    },
    {
        "id": "1msgxg3",
        "author": "Southern-Brother5693",
        "title": "New Layout - Suddenly the rows are so boring",
        "content": "Something I noticed when using Netflix on my Sony Bravia TV. Previously, i used to get different rows of recommendations like \"Asia Movies, Get With Action, Documentaries\" but now for the past week I am only getting the same tired rows like \"Gems for you, Catch up with unwatched episodes.\"\n\nThis only happens on my TV. My Phone and PC still have the different variety of rows. Anyone here facing the same issue?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1msgxg3/new_layout_suddenly_the_rows_are_so_boring/"
    }
]