[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 13,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1md80h5",
        "author": "leyy_pink1997",
        "title": "Just finished The Fall of the House of Usher — WHY did no one warn me it was this good?! 😱🔥",
        "content": "I went in thinking it would be another slow gothic horror, but damn—Mike Flanagan really cooked with this one. The visuals, the pacing, the way each episode was named after a Poe story… genius.\n\nAnd can we talk about Carla Gugino? She was terrifying and mesmerizing all at once. I haven’t binged something this fast in a while.\n\nAnyone else get Haunting of Hill House vibes but darker and more vicious? Curious if I should go for Midnight Mass next.\n\nWould love to hear your Flanagan rankings or any hidden gems on Netflix that are equally mind-blowing.\n",
        "upvotes": 31,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1md80h5/just_finished_the_fall_of_the_house_of_usher_why/"
    },
    {
        "id": "1md2mol",
        "author": "Sweaty-Toe-6211",
        "title": "Adam Sandler’s ‘Happy Gilmore 2’ Debuts to 46.7 Million Views, Biggest Netflix U.S. Film Opening Ever",
        "content": "",
        "upvotes": 63,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1md2mol/adam_sandlers_happy_gilmore_2_debuts_to_467/"
    },
    {
        "id": "1md2rio",
        "author": "dailystar_news",
        "title": "Netflix have confirmed full cast for Pride and Prejudice TV series - what do you think?",
        "content": "",
        "upvotes": 52,
        "comments": 41,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dbcx9j3blzff1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1md2rio/netflix_have_confirmed_full_cast_for_pride_and/"
    },
    {
        "id": "1mcqsfu",
        "author": "GingerVix666",
        "title": "If there’s one show on Netflix you could recommend…",
        "content": "…to someone who just joined the platform, what would it be? And why? Please don’t say Riverdale 😂😭 I’m just rejoining after a bit and want to know what’s worth watching ",
        "upvotes": 108,
        "comments": 605,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqsfu/if_theres_one_show_on_netflix_you_could_recommend/"
    },
    {
        "id": "1mce7ep",
        "author": "Whobitmyname",
        "title": "‘Untamed’ Renewed for Season 2 at Netflix",
        "content": "",
        "upvotes": 475,
        "comments": 142,
        "media": null,
        "permalink": "/r/netflix/comments/1mce7ep/untamed_renewed_for_season_2_at_netflix/"
    },
    {
        "id": "1md0vy2",
        "author": "Hey-yo-iz-me",
        "title": "Squid game 3 - is it just me or do you also feel it is slow and boring?",
        "content": "It feels really slow paced. And story seems boring now. And the old aunty who killed her own son to save a stranger and her baby , my two brain cells cant comprehend that kind of kindness/empathy/stupidity. \n\nWhat are your views? ",
        "upvotes": 13,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1md0vy2/squid_game_3_is_it_just_me_or_do_you_also_feel_it/"
    },
    {
        "id": "1md5are",
        "author": "Maxgay4u",
        "title": "Saja boys (They were not human.)",
        "content": "Jinu is the only former human one out of them all. “Oh then what about the photos on the doctors wall?” That could literally be any other group in that universe, and they show us later in that doctor scene that he fakes his photos most of the time. (plus they look nothing like the saja boys if thats what they did look like bc they would look the same still, kinda like how jinu still has the same face and body as before and same hair!!) Abby, Romance, Mystery and Baby are all demons who Jinu turned into hot guys, they literally show us that. So idk whyyyy people are speculating that they are humans when they literally show them being turned into hot guys bc they were Ugly demons before. I just wanna say that bc i keep hearing ppl speculate they were human like no they show us they werent.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1md5are/saja_boys_they_were_not_human/"
    },
    {
        "id": "1mcxy7c",
        "author": "coolgamer8473",
        "title": "I need Netflix recommendations",
        "content": "I need Netflix recommendations I've seen squid game, Wednesday, stranger things, ECT I need new shows to watch so can y'all please give me some recommendations to watch",
        "upvotes": 9,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1mcxy7c/i_need_netflix_recommendations/"
    },
    {
        "id": "1md9nhk",
        "author": "Sudden_Pop_2279",
        "title": "'KPop Demon Hunters' becomes Netflix's most-watched original animated film",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1md9nhk/kpop_demon_hunters_becomes_netflixs_mostwatched/"
    },
    {
        "id": "1mcmqiv",
        "author": "kay-pii",
        "title": "Help. I need a show to binge or movie.",
        "content": "I can't find anything new to grasp my attention. I finished untamed in two days. Finished Brick. I've tried Dept Q but I just don't know wtf is going on and it seems so slow to get to the plot. I just rewatched Queens Gambit because I couldn't find anything else. I like thrillers, sci-fi. Seen ST. Not sure if I should start Mindhunters because of how heartbroken you guys are it was cancelled. Tried Dark but it's a bit confusing. Suggestions for shows or movies would be great. ",
        "upvotes": 25,
        "comments": 103,
        "media": null,
        "permalink": "/r/netflix/comments/1mcmqiv/help_i_need_a_show_to_binge_or_movie/"
    },
    {
        "id": "1md69v5",
        "author": "Glittering_Mind6771",
        "title": "Recommended me",
        "content": "I loved watching all four of seasons Stranger things and looking some more tv shows or movies having a similar type of plot or world. You can recommend me from Netflix or from any other too.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1md69v5/recommended_me/"
    },
    {
        "id": "1mclemt",
        "author": "ToonAdventure",
        "title": "‘Untamed’ Leads Netflix English TV List Again As ‘The Hunting Wives’ Puts Up Impressive Debut; ‘Happy Gilmore 2’ &amp; ‘KPop Demon Hunters’ Dominate Film",
        "content": "",
        "upvotes": 13,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mclemt/untamed_leads_netflix_english_tv_list_again_as/"
    },
    {
        "id": "1md20kv",
        "author": "filipduki1222",
        "title": "Narcos Cast vs Real Life People",
        "content": "Hope you like it,any support,advice or criticism in improving my channel is welcomed.\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1md20kv/narcos_cast_vs_real_life_people/"
    },
    {
        "id": "1md1jei",
        "author": "Moist_Pepper8124",
        "title": "A Netflix Nevermore Videogame Idea",
        "content": "Think about a game that's like Hogwarts Legacy but it takes place at Nevermore Academy in the Wednesday universe. You could pick the power, gender and appearance of your character where the things you could do would be decided by your power.\n\nYou could have friendships and romantic relationships, you could date the other students/outcasts at Nevermore according to your gender preference.\n\nYou would be assigned your dorm hall, dorm and roommate which would be part of the games story. Your roommate would be the same as the gender yours so if you picked to be a guy your roommate would be a guy and it would be the same if you picked to be a girl, your roommate would be a girl. Your roommate would always be the same in the story every time you play the story so they could actually be part of the story.\n\nThe story would make sense with what happens in the show and would contain things from the show like the Poe Cup and The Nightshades.\n\nThe game would contain side quests where some of them would correlate to the power you chose.\n\nAfter the story is done you could walk around the campus and still do classes like learning about carnivorous plants and fencing. There would be extracurricular activities like choir or archery. You could still talk to NPC's after the story is over and make relationships with them.\n\nThe game would have other locations outside Nevermore like Jericho, The Weathervane, Crackstones Crypt or even the Gates family mansion.\n\nAfter The Wednesday Series ends I think this game could work, the only problems would be the amount of powers in Wednesday, the useless powers in Wednesday, the useful ones that become useless after the story ends like the visions or if the game would be possible after the Wednesday Series ends because we don't even know what will happen in the show but yet again the game could take place before the show takes place.\n\nSo yeah that was my game idea if Netflix would make a Nevermore game, I wanna hear your thoughts on it so feel free to comment anything or ask anything.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1md1jei/a_netflix_nevermore_videogame_idea/"
    },
    {
        "id": "1md1env",
        "author": "Technical_Two_733",
        "title": "Lost Ending August 14?",
        "content": "So I've been watching the best show on the planet - Lost through Netflix, but lately I keep getting this popup at the beginning of an episode saying that I only have until August 14 to finish watching it. Does that mean it will only stop showing in my region or all together?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1md1env/lost_ending_august_14/"
    },
    {
        "id": "1md7m51",
        "author": "bkat004",
        "title": "Would you watch a Biopic of the founding of Netflix ?",
        "content": "It could come off as grossly narcissistic.  (Did you see that FIFA Biopic ? - Disgusting !)\n\nHowever, I find the founding of this network ridiculously interesting.  From the rejection of Blockbuster to the advent of DVDs to the failure of RedBox to the raid on Kim Dotcom's house to the creation of original content to the purchasing of many studio's libraries.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1md7m51/would_you_watch_a_biopic_of_the_founding_of/"
    },
    {
        "id": "1mczvc8",
        "author": "witcherdeadpool",
        "title": "Netflix Commercials (Lindsey Lohan)",
        "content": "Anyone else watching a show or movie and the commercials come on unexpectedly and without announcements, and you repeatedly do a double-take and wonder, “what, Lindsey Lohan?\"",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mczvc8/netflix_commercials_lindsey_lohan/"
    },
    {
        "id": "1mczrot",
        "author": "WallFlowers2",
        "title": "why after trying to redownload the app it said I have to get IOS17 ?",
        "content": "hi I never had any problems using netflix until today when I try to redownload the app on my Iphone 12. I didn't delete it before but it's like it needed a upgrade or something. I deleted it completely and when I tried downloading it again on app store it says : \"This application requires IOS 17.0 or later\". But Ive never had a problem before? I think the last time I watched netflix was like not even one month ago. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mczrot/why_after_trying_to_redownload_the_app_it_said_i/"
    },
    {
        "id": "1mc523p",
        "author": "Neat_Suit3684",
        "title": "Trainwreck Area 51",
        "content": "Im just finding this series and I gotta say rewatching the Area 51 madness is making me howl! 😂 like Im loving how crazy people got into this.\n\nIdk what the other trainwreck documentaries are but im hoping theyre as funny as this.\n\nI still can't believe a dude made this whole thing up outta boredom. Like that just blows my mind how crazy it got and he wasnt even trying to do anything serious 😂 ",
        "upvotes": 78,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1mc523p/trainwreck_area_51/"
    },
    {
        "id": "1md3m3b",
        "author": "Riverman0323",
        "title": "Is Monument Valley still on the App Store?",
        "content": "Is Monument Valley still on the App Store?\n\nIs Monument Valley still on the App Store?\n\nIs Monument Valley still on the App Store?\n\nIs Monument Valley still on the App Store?\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1md3m3b/is_monument_valley_still_on_the_app_store/"
    },
    {
        "id": "1mcxts8",
        "author": "Alarming_Art_4763",
        "title": "Recommendations please",
        "content": "Recently finished: The diplomat, Suits, The recruit, Night agent, Peaky blinders, Young sheldon and Succession. Any recomendations for a good series or movie to watch ?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mcxts8/recommendations_please/"
    },
    {
        "id": "1md2031",
        "author": "TacoClocker",
        "title": "New Netflix UI",
        "content": "Just wanted to come here and say that I am not a fan at all of the new Netflix UI. I loaded it up on my TV just now and the whole screen is plastered with just one show preview and the “home, shows, movies, my Netflix” at the top middle of the screen. \nThis makes it even harder to stop scrolling through titles and pause them by going to the sidebar and search menu by placing it above everything else.\nAlso, the category rows takes up like 85% of the screen so you don’t even know what’s coming next underneath what you’re already scrolling through. It used to fit 3 rows..",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1md2031/new_netflix_ui/"
    },
    {
        "id": "1mco5u7",
        "author": "Ok_Acanthocephala425",
        "title": "Happy Gilmore 2 Visual Question",
        "content": "Ok so in some of the scenes of the movie I noticed things disappearing from the picture. Like a ball would be rolling across the green, then for a few frames be invisible then in a few frames, reappear on the same trajectory. This happens multiple times and on other objects. So I guess my question is: is this a problem with my television, or is this something with the way the movie was produced? ",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mco5u7/happy_gilmore_2_visual_question/"
    },
    {
        "id": "1mbxvig",
        "author": "BeckettWilderness",
        "title": "Happy Gilmore 2 … rate it",
        "content": "I have seen so many great reviews for this movie and I know taste is completely subjective but I just didn’t like it - am I the only one? I am happy to see a lot of classic actors in this film though. \n\nPost Edit* After a little bit of reflection: I think it wasn’t horrible but the original is such a great classic - maybe subconsciously I had a very high expectation. ",
        "upvotes": 121,
        "comments": 381,
        "media": null,
        "permalink": "/r/netflix/comments/1mbxvig/happy_gilmore_2_rate_it/"
    },
    {
        "id": "1mctqrq",
        "author": "ArchAesthetics2046",
        "title": "Sanctuary is like an adult version of ippo",
        "content": "This show's full of heart, inspiration, and manliness. It's like the darker, adult version of hajime no ippo mixed with the yakuza game series. I'm not into sumo at all, but the writing of this show pulled me in. In desperate need for a second season. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mctqrq/sanctuary_is_like_an_adult_version_of_ippo/"
    },
    {
        "id": "1md3exr",
        "author": "Strict_Difficulty_90",
        "title": "Bad hair",
        "content": "Why do all the women in Netflix shows have bad hair? Like unevenly colored, poorly shaded etc.   they’re such beautiful women but my mind can’t stop focusing on colored hair with poor shading ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1md3exr/bad_hair/"
    },
    {
        "id": "1mcl8sn",
        "author": "Cherry_xvax21",
        "title": "Hitmakers",
        "content": "What y’all think about this show? On episode 3 and so far impressed with the singer and songwriters. I never realized how many talented people work behind the scenes especially on some of my favorite hit songs. I really respect the choice to stay out of the spotlight and let the music speak for itself and still make that money!  \n\nNot a fan of Jhart though. There’s a thin line between confident and cocky. He came in way too cocky claiming to be a “fashion icon”. Excuse me but most of us don’t even know who you are. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mcl8sn/hitmakers/"
    },
    {
        "id": "1mcblm2",
        "author": "ToonAdventure",
        "title": "Fixed | Official Trailer | Netflix",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mcblm2/fixed_official_trailer_netflix/"
    },
    {
        "id": "1mctnr7",
        "author": "jaimelee1235",
        "title": "Squidward Games",
        "content": "painted Squidward Tentacles into the Squid Games , using sized 2.88mm rhinestones. \n\ni combined two patterns that i found here: \n\nhttps://www.braceletbook.com/patterns/alpha/49900/\n\nhttps://www.braceletbook.com/patterns/alpha/105915/\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/iry2eng60xff1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mctnr7/squidward_games/"
    },
    {
        "id": "1mbi3pw",
        "author": "restrictednumber1996",
        "title": "I can’t lie anymore. The Hunting Wives is sleazy, twisty and a hell of a summer binge.",
        "content": "Look, it isn’t Emmy award winning TV. The acting only ranges slightly fair. The characters are terrible people. \n\nBut I’d be lying if I said I wasn’t sucked in from the very first episode. It’s got everything a good summer binge should have for me. Like a trashy beach read. A mystery, sex, lies, and twists. It’s a super fun romp. \n\nAlso: I see some comments stating that Brad and Jamie are underage, thus making some scenes uncomfortable. Idk about the book, but they are 18 years of age on the show. Still taboo because he is a student, but I did want to mention that. Malin did an interview on it recently. \n\nAll in all, if you want a quick and breezy watch with some bonkers moments, take a watch. ",
        "upvotes": 293,
        "comments": 197,
        "media": null,
        "permalink": "/r/netflix/comments/1mbi3pw/i_cant_lie_anymore_the_hunting_wives_is_sleazy/"
    }
]