[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 485,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hm18t3",
        "author": "AutoModerator",
        "title": "NFL Christmas Gameday Megathread",
        "content": "1:00pm ET - Kansas City Chiefs @ Pittsburg Steelers\n\n4:30pm ET - Baltimore Ravens @ Houston Texans",
        "upvotes": 35,
        "comments": 616,
        "media": null,
        "permalink": "/r/netflix/comments/1hm18t3/nfl_christmas_gameday_megathread/"
    },
    {
        "id": "1hn2ir0",
        "author": "alkosz",
        "title": "Squid Game Season 2 was actually good",
        "content": "i know a lot of people here hate the second season and admittedly sure its not as good as the first one, however its a pretty close tie. having our antagonist directly involved into the game a second time yet we now know the entire time who it is probably has to be the best writing switch in any series ive ever watched. it was very entertaining not knowing when he'll switch up back to his own side and felt oddly satisfying watching him do so at the end. granted there was barely any sad moments in the series like the first one had, not as memorable of characters but it still got the job done it set out to do. at the end of it all i still wanted to watch more and any series that makes me feel that way deserves a great score.\n\ni would rate the first season a definite 10/10\n\nthis new season is definitely a 8/10\n\ncould've done better, better pacing, better characters and more drama but definitely not bad at all.",
        "upvotes": 509,
        "comments": 453,
        "media": null,
        "permalink": "/r/netflix/comments/1hn2ir0/squid_game_season_2_was_actually_good/"
    },
    {
        "id": "1hnds35",
        "author": "StudioJamesCao",
        "title": "I animated Squid Game action figures in stop motion",
        "content": "",
        "upvotes": 20,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vx403pmrvd9e1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1hnds35/i_animated_squid_game_action_figures_in_stop/"
    },
    {
        "id": "1hn3b1j",
        "author": "Cheddar18",
        "title": "So La Palma absolutely sucked.. what other natural disaster movies or shows should I try next!? ",
        "content": "Talk about plot armor... damn what a disappointment of a show. \n\n\nBut now I'd love to watch any other natural disaster shows or movies- I've seen Greenland so many times but am not sure what else to watch that's actually good. I'd love any recommendations please!! \n\n\nEdit- thank you everyone for the recs, please keep them coming because I love this genre!! I started The Wave 🕺🏻",
        "upvotes": 75,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1hn3b1j/so_la_palma_absolutely_sucked_what_other_natural/"
    },
    {
        "id": "1hn4upw",
        "author": "Zeroyhme",
        "title": "Squid Game: Season 1 vs Season 2",
        "content": "",
        "upvotes": 40,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hn4upw/squid_game_season_1_vs_season_2/"
    },
    {
        "id": "1hnigwr",
        "author": "Chucky949208",
        "title": "Is anyone having problems with netflix?",
        "content": "So the last couple days think this started Christmas day, we have been having issues with netflix. I went to put on paw patrol for my toddler and his continue watching shows were not showing, when I searched paw patrol it came up add to wish list. Same is happening with other shows and not just on his profile but on my in laws profile and my profile and my husbands. We have checked all tvs and phones and same problem is happening. My mother in law wanted to watch a film the other day and it came up add to wish list. Has anyone else had this problem and if so how did you solve it? We have logged out, uninstall edited the app, restored phones and tvs and the problem is still occurring. Any help would be appreciated. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnigwr/is_anyone_having_problems_with_netflix/"
    },
    {
        "id": "1hnie9o",
        "author": "More-Ad7683",
        "title": "If I downloaded a film and it leaves Netflix today can i access it after it leaves?",
        "content": "If I download a film from Netflix and it’s set to leave the platform today, will I still be able to access it afterward? If so, for how long can I watch it?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnie9o/if_i_downloaded_a_film_and_it_leaves_netflix/"
    },
    {
        "id": "1hn9l0b",
        "author": "EvelynClede",
        "title": "Squid Game's Season 2 - A Comprehensive Overview",
        "content": "",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hn9l0b/squid_games_season_2_a_comprehensive_overview/"
    },
    {
        "id": "1hnhvwd",
        "author": "Jason1088S",
        "title": "App long starting/loading time ",
        "content": "Hi,\nI have an Apple TV and it is connected via Ethernet cable. My connection is Like 1000mbits. Im using a unifi-setup.\n\nNetflix is the only App which starts very slow. Every other App is starting normally. \n\nAfter I Open the App all I See is the red „N“ with the loading Circle underneath and then proceed to the accounts. Takes forever to load. \n\nCan someone help me out or knows a solution for this?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnhvwd/app_long_startingloading_time/"
    },
    {
        "id": "1hnh2v2",
        "author": "Frequent_Region_8447",
        "title": "Top 10 Horror movies on Netflix. Watch and support channel by subscribing if you like. ",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnh2v2/top_10_horror_movies_on_netflix_watch_and_support/"
    },
    {
        "id": "1hnfpq9",
        "author": "LatterPick7252",
        "title": "WWE RAW | LIVE on Netflix | Starting January 6",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnfpq9/wwe_raw_live_on_netflix_starting_january_6/"
    },
    {
        "id": "1hnajhg",
        "author": "mister_alma_raynard",
        "title": "problem with netflix on my browser",
        "content": "hi, so am using my netflix on browser and many movies dont appear that ive seen previosly. example i wanted to watch babylon. it aint there after i search. if i go to my mobile its there. i tired a different browser and same problem.\n\nsome more movies where is problem occurs are the other guys, gifted, the interview.........and so on\n\nive added these movies to my list before in the browser itself and one day many movies just dissapear. i tried searching them as well but they dont appear. any fix?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hnajhg/problem_with_netflix_on_my_browser/"
    },
    {
        "id": "1hmi2o0",
        "author": "Robemilak",
        "title": "Adam Sandler Shares the First Teaser for Netflix's Sequel ‘Happy Gilmore 2’",
        "content": "",
        "upvotes": 250,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1hmi2o0/adam_sandler_shares_the_first_teaser_for_netflixs/"
    },
    {
        "id": "1hmqmv2",
        "author": "DotOne4395",
        "title": "10 Highly Anticipated Netflix Movies Coming in 2025",
        "content": "* **Back in Action (January 17)**\n* **The Electric State (March 14)**\n* **Wake Up Dead Man: A Knives Out Mystery (2025)**\n* **The Old Guard 2 (2025)**\n* **Fear Street: Prom Queen (2025)**\n* **The Life List (2025)**\n* **Frankenstein (2025)**\n* **Happy Gilmore 2 (2025)**\n* **Havoc (2025)**\n* **Plankton: The Movie (2025)**\n\n[**View in Web**](https://www.cinemablind.com/highly-anticipated-netflix-movies-of-2025/) **|** [**Anticipated Netflix Shows**](https://www.cinemablind.com/highly-anticipated-netflix-shows-of-2025/)\n\n",
        "upvotes": 40,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hmqmv2/10_highly_anticipated_netflix_movies_coming_in/"
    },
    {
        "id": "1hnclhg",
        "author": "ConfessionSeeker",
        "title": "my netflix is broken",
        "content": "everytime i try opening netflix on my laptop, this appears, and netflix is completely unusable, but when I log into a different laptop (ex. my sister's) it works just fine and like I have no idea why LMAO\n\n[what pops up when i try to use netflix\\*](https://preview.redd.it/xdfw0g91id9e1.png?width=2766&amp;format=png&amp;auto=webp&amp;s=25cddba3aa6be61c61dce854c46f22b6ca276e5e)\n\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hnclhg/my_netflix_is_broken/"
    },
    {
        "id": "1hnbrzl",
        "author": "FitChemical5370",
        "title": "Similar movies/series to After?",
        "content": "So i love the american teen type of movies and series. I’m looking for similar things to all of the after movies, the kissing booth, anyone but you, sex ed, the end of the f world… and similar, thank you so so muchhh  yall ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hnbrzl/similar_moviesseries_to_after/"
    },
    {
        "id": "1hnavr2",
        "author": "Mtreece23",
        "title": "movies",
        "content": "i just watched carry on and kevin heart new movie lift and they were both good. i’ve been thinking about watching don’t move but what are some good movies on netflix? preferably action, mystery or time travel. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hnavr2/movies/"
    },
    {
        "id": "1hn1u6j",
        "author": "Chaosjoint",
        "title": "Carry-on: Did I miss something?",
        "content": "When Ethan face-off with the antagonist at the end of sorting, Ethan find a similar case when the villain demands him to give him the case. \n\nMy thought is that he swapped the case by putting the ribbon on that random case and leave his earpiece there for him to take.\n\nLater, when the antagonist board the plane to DC, it was by the time he settle down that he found the case is slightly bigger than his design and even already tagged for transport.\n\nThen it is not the real one right?\n\nThen why the hell is the chem weapon still in the case? \n\nI just can't wrap my head around it. Am I missing something here?",
        "upvotes": 7,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1hn1u6j/carryon_did_i_miss_something/"
    },
    {
        "id": "1hn9qwb",
        "author": "aditya_35",
        "title": "Subscription issue?",
        "content": "I have Netflix basic which renews every 27th of the month. I was watching multiple series like When the phone rings, Dan da dan, etc.\n\nToday when I logged through my pc and mobile, it showed they are not available in my region(India). \n\nWhen I logged through Jio STB (TV) it showed they are available? \n\nWhat is the issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hn9qwb/subscription_issue/"
    },
    {
        "id": "1hn86yy",
        "author": "YRNERICK",
        "title": "Hear me out. ",
        "content": "I don’t know if this the right sub for this but Just hear me rant for a bit. \n\nWhen did TV series adopt this new format of waiting 2-5 years for a new season just to release 10 episodes or less?? I get that they are about an hour long but still.. What’s the point of waiting so long for a tv show for only to have such little episodes? When did this become the new norm?? What’s the reasoning for such long period of wait time for 10 episodes max? Compared to TV shows from the early 2000s and 2010s where they would have 20-30 episodes per season. Is it budget reasons? Or is it just to create more hype for the tv show? I hate it. -_-\n\nOr is it just me that feels this way?\n\nExample, season 2 of squid games released today with only 7 episodes, I finished it already and now going to have to wait several years for season 3… besides the rant I think season 2 was great. ",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hn86yy/hear_me_out/"
    },
    {
        "id": "1hn6jwk",
        "author": "Mingming_143",
        "title": "Netflix games not letting me log in?",
        "content": "\nWhen I try to select a profile when logging in, it gives me an error and doesn’t let me play the game. I’ve had this problem with all other or Netflix’s games, and I cannot fix it. This happened with Monument Valley 3 and Storyteller, but I’m sure it does the same with other games. No matter what profile I select or how many times I restart my phone, it still won’t work. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hn6jwk/netflix_games_not_letting_me_log_in/"
    },
    {
        "id": "1hmv9u7",
        "author": "sillysaegers",
        "title": "Any good Netflix movies/shows with Dutch Dubs?",
        "content": "I’m Belgian and I live in America and I use Netflix as one does but almost every show or movie I enjoy doesn’t have a Dutch dub, anyone have any recommendations?",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmv9u7/any_good_netflix_moviesshows_with_dutch_dubs/"
    },
    {
        "id": "1hmxmnk",
        "author": "hamsamichhh",
        "title": "video game commercial?",
        "content": "hi friends, my dad saw an action video game commercial during the netflix christmas football game and can’t remember the name of it. wondering if anyone remembers the name of it ? ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hmxmnk/video_game_commercial/"
    },
    {
        "id": "1hmhk3t",
        "author": "Robemilak",
        "title": "Carry-On pulled nice numbers",
        "content": "‘CARRY-ON’ had 97M views in its first 10 days of streaming. The biggest Netflix film release this year. What did you think of it? I'd says it's a decent addition to Christmas movie list.",
        "upvotes": 54,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1hmhk3t/carryon_pulled_nice_numbers/"
    },
    {
        "id": "1hm64x4",
        "author": "AnonymousUser8476249",
        "title": "Netflix needs a “Live” button / option",
        "content": "There needs to be a way to jump to the live action when viewing a live event such as an NFL game.  \nApple TV latest version, latest os, etc. \nWhen you switch away from the game and then come back, Netflix holds your spot.  Which is great when watching regular shows and movies, but sucks when watching a live event.\n\nI understand that this may be baked into the core architecture of Netflix, but they need to at least add a button to jump to the live action.  Currently the only way to do this is to fast forward until you reach the live spot.  \n\nHopefully someone from Netflix sees this and makes it happen.",
        "upvotes": 249,
        "comments": 117,
        "media": null,
        "permalink": "/r/netflix/comments/1hm64x4/netflix_needs_a_live_button_option/"
    },
    {
        "id": "1hmcjls",
        "author": "ohhhKid",
        "title": "Korean zombie movies are top tier",
        "content": "New show called Happiness out on Netflix, korean based, zombie theme show. I love zombie movies, but “all of us are dead” “kingdom” and “happiness” are awesome choices! Really hope to see more Korean zombie movies/shows in the future",
        "upvotes": 86,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1hmcjls/korean_zombie_movies_are_top_tier/"
    },
    {
        "id": "1hnct3w",
        "author": "Jihyoqtt",
        "title": "Squid Game Season 2 ending sucked azz",
        "content": "What was their purpose for helping Gi-hun if they can't get the money? and if y'all say \"to finish the game\" they can finish the game by doing the riot, red/x team has the advantage bc most of them can fight and they have the numbers game.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hnct3w/squid_game_season_2_ending_sucked_azz/"
    },
    {
        "id": "1hmwvts",
        "author": "Euphoric-Editor-6986",
        "title": "Wrong password and wrong email adress",
        "content": "Hi! So I have a problem. I have a netflix account,and I added a wrong E-mail adresss to my account,and I forgot the password.I want to change my password and Netflix send a code to my phone number but I didn’t get it many times.I write to Netflix,I didn’t get answer and I told the netflix costumer service that \nif it’s necessary, I will write down them to my card number or my full name,or my phone number that is linked to the Netflix account that I can't log into.So I \nI can prove that the account is mine…\nPlease help me because the gmail address is wrong and I can't change it because I don't know the password, so it's taking money from my card unnecessarily….thanks!!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hmwvts/wrong_password_and_wrong_email_adress/"
    },
    {
        "id": "1hn5wuw",
        "author": "SF6-Manon",
        "title": "SPOILER: My thoughts on Squid Game Season 2",
        "content": "I'm not going to go super in-depth or make this spoiler-heavy but I thought I'd give my honest review on season 2 so... let's begin.\n\nFirst off, what would I rate this season? In comparison to the first season, I'm going to be generous and give it a 6/10. The pacing of the show felt slow at first. Starting off with scenes of Seong Gi-Hun then fast forwarding 2 years later. Pretty much emphasizing that Gi-Hun's on the hunt for the front man/the one in charge of the games to begin with. Puts up money and sends grunts to go on a wild goose chase to find the recruiter he came across in the subway back in season 1. After a long 2 years, they finally spot the recruiter then secretly follows him but things don't go as planned. Stuff happens, Gi-Hun then formulates a plan which failed and now we end up with end getting back into the game. Pretty much the \"I will find you, and I will kill you\" cliche except he doesn't plan on killing the head??... so... yeah. I'll leave it at that.\n\nNow that that's out of the way, let's fast forward. The failed plan that became an even bigger fail since there was a snake amongst him as he planned on going in and infiltrate the island with a group of people. This was realized during the first game that his backup no longer had a trace on him so his backup is... well... back on another goose chase. But instead of finding the recruiter, they're trying to find the island. And that's pretty much all we got out of them. Again, I'm not trying to spoil much.\n\nDuring the first game, Gi-Hun insists on helping everyone make it out in one piece. A lot more survived this time around compared to season one. Cool. After this, we now have a better look at the new players, a lot of which, are either just wimpy or plain annoying/obnoxious. Season 1 had its annoying characters too but they were done in a way where it felt just right and not over the top. A ton of \"high school bully\" type of characters. The new player(s) that were written well enough was the mom &amp; son duo. That's all I can say about the characters.\n\nNow, onto the primary reason people are watching season 2, the games. We're first introduced with red light green light since it's a staple of the show. The games that followed after that were different which was quite nice. But that's where it kind of stops being nice. The game now introduced a new thing where players could vote to either stay or leave after EACH game. If I'm going to be honest, I feel like this took away what made season 1 so good. The weight/burden of choice. In season one, players had only ONE opportunity to vote, it made scenarios a lot more impactful and gave the players an option of joining. With that, players bared the weight of \"the point of no return\". Once you were in, you're staying until the end. In this season, with players given the option to vote after every round, it eliminated that impact and made it more of a \"Don't join them, join me\" ordeal. Pair that with the high school bullying, you're left with kinda of an \"meh\" feeling. There isn't much fear since players can just stay for the money or they'll just pair with Gi-hun since he's played the game before. Follow the leader. \n\nOnce the games began, the pace suddenly sped up, leaving less room for you to have any sort of attachment to some characters. The games felt rushed/sped up making them not as fun and suspenseful to watch. With that, we're then back to scenes with Gi-Hun's muscle for hire are still looking for a way in and very little clue as to what's up with Triangle 11. The ending, being Gi-Hun's final plan which ALSO fails. Lots of gun fire, players are \"offed\", aaaaand we're left with a cliffhanger. \n\n  \nHonestly, I would have preferred they made an additional 2-3 episodes to flesh it out a bit more and conclude it all as a whole but nope... many questions a left unanswered and it seems we may have to wait for season 3. Wasn't a bad season, but it wasn't exactly great either. To those who are well-versed with celebrities in K-POP, you may enjoy it a bit more, maybe. Even then, it was okay. I'm not sure if I'll stick around for season 3 but yeah... what are your thoughts?",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1hn5wuw/spoiler_my_thoughts_on_squid_game_season_2/"
    },
    {
        "id": "1hn0zvg",
        "author": "CarlosGaarher",
        "title": "Have a share account without living in the same home, didn't have a problema already. I'm gonna have problems one day? ",
        "content": "Yes, my girl and two of his friends share an account. They lived in an apartment together, I lived in another apartment. I have the account on my TV for like 3 weeks. With the Netflix restrictions, some day I'm gonna have the warning that I not lived in the same place that the owner of the account? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hn0zvg/have_a_share_account_without_living_in_the_same/"
    },
    {
        "id": "1hn4jqn",
        "author": "Tedman6969",
        "title": "Carry-on Plot Hole?",
        "content": "In the movie it shows the tsa officer switch the gas bomb into another suitcase that had to be checked when Jason Bateman gets on the plane. The issue is did he put the smaller suitcase inside the larger suitcase or did he have time to move the bomb into the new suitcase?\n\nEither way there is an issue because the smaller suitcase wasn’t left at the baggage area but when they open the suitcase on the plane the bomb is only in one suitcase.\n\nNot sure if anyone has any clarity on this.\n\n",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hn4jqn/carryon_plot_hole/"
    }
]