[
    {
        "id": "1n8sw5t",
        "author": "mi-16evil",
        "title": "Official Discussion Megathread (The Conjuring: Last Rites, Hamilton) plus throwback discussions",
        "content": "**New In Theaters**:\n\n* [The Conjuring: Last Rites](https://www.reddit.com/r/movies/s/kqpgXYUJF3)\n* [Hamilton \\[2020\\] (Theatrical Release)](https://www.reddit.com/r/movies/comments/hkm7e5/official_discussion_hamilton_2020_spoilers/)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Highlander: Endgame](https://www.reddit.com/r/movies/s/McksjhzFbX)\n* [Whipped](https://www.reddit.com/r/movies/s/Shi0nfwGUC)\n\n**Still In Theaters**:\n\n* [The Toxic Avenger (2025)](https://old.reddit.com/r/movies/comments/1n2v42x/official_discussion_the_toxic_avenger_2025/?)\n* [Caught Stealing](https://old.reddit.com/r/movies/comments/1n2v46f/official_discussion_caught_stealing_spoilers/?)\n* [The Roses](https://old.reddit.com/r/movies/comments/1n2v49v/official_discussion_the_roses_spoilers/?)\n* [Nobody 2](https://old.reddit.com/r/movies/comments/1mqleeh/official_discussion_nobody_2_spoilers/?)\n* [Weapons](https://old.reddit.com/r/movies/comments/1mkiuk7/official_discussion_weapons_spoilers/?)\n* [Honey Don't!](https://www.reddit.com/r/movies/comments/1mwu2vw/official_discussion_honey_dont_spoilers/?)\n* [Primitive War](https://www.reddit.com/r/movies/comments/1mwu35t/official_discussion_primitive_war_spoilers/?)\n* [Ne Zha II](https://www.reddit.com/r/movies/comments/1j5dv7y/official_discussion_ne_zha_2_spoilers/)\n\n**New On Streaming:**\n\n\n* [Highest 2 Lowest](https://old.reddit.com/r/movies/comments/1n9h173/official_discussion_highest_2_lowest_spoilers/?)\n* [The Thursday Murder Club](https://old.reddit.com/r/movies/comments/1n5045m/official_discussion_the_thursday_murder_club/?)\n* [The Home](https://old.reddit.com/r/movies/comments/1n5046o/official_discussion_the_home_spoilers/?)\n* [Eenie Meanie](https://old.reddit.com/r/movies/comments/1n5043w/official_discussion_eenie_meanie_spoilers/?)\n* [Fixed](https://old.reddit.com/r/movies/comments/1ms61cu/official_discussion_fixed_spoilers/?)\n* [Night Always Comes](https://old.reddit.com/r/movies/comments/1ms61j7/official_discussion_night_always_comes_spoilers/?)\n* [War of the Worlds (2025)](https://old.reddit.com/r/movies/comments/1mek72y/official_discussion_war_of_the_worlds_spoilers/?)",
        "upvotes": 21,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1n8sw5t/official_discussion_megathread_the_conjuring_last/"
    },
    {
        "id": "1n6mf61",
        "author": "TheCutAMA",
        "title": "Hey reddit, I'm Sean Ellis, director of THE CUT starring Orlando Bloom (The Lord of the Rings franchise), Caitríona Balfe (Outlander) and John Turturro (Severance) in theaters 9/5. It premiered at TIFF 2024. You may know me from my previous films THE CURSED, CASHBACK, &amp; ANTHROPOID. Ask me anything!",
        "content": "Hey reddit, I'm Sean Ellis, director of THE CUT starring Orlando Bloom (The Lord of the Rings franchise), Caitríona Balfe (Outlander) and John Turturro (Severance) in theaters 9/5. You may know me from my previous films THE CURSED, CASHBACK, &amp; ANTHROPOID. Ask me anything!\n\nThe film had its World Premiere at the Toronto International Film Festival last year. Here to answer your questions.\n\nRepublic Pictures will release THE CUT In Select Theaters September 5th!\n\nCheck out the Trailer: [https://paramnt.us/TheCutTrailer](https://paramnt.us/TheCutTrailer)\n\nSYNOPSIS: After a career-ending defeat, a former champion trains for redemption – but as obsession takes hold and reality unravels, he may be spiraling into something far more terrifying.\n\nHere are all of my credits:\n\n[https://www.imdb.com/name/nm1193346/](https://www.imdb.com/name/nm1193346/)\n\nAsk me anything! I'll be back at 11:00 AM ET tomorrow (Wednesday 9/3) to answer your questions!",
        "upvotes": 51,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wdz0f96wqrmf1.jpeg?auto=webp&amp;s=d5685cf32f3353080b4a130229ceb6f076d98877"
        },
        "permalink": "/r/movies/comments/1n6mf61/hey_reddit_im_sean_ellis_director_of_the_cut/"
    },
    {
        "id": "1nbaoi2",
        "author": "MarvelsGrantMan136",
        "title": "‘Pee-wee As Himself’ Wins the 2025 Emmy for Outstanding Documentary",
        "content": "",
        "upvotes": 5553,
        "comments": 106,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MZ-p7zHF7dMJmV10o-d3vbC19CRrrISdIXKSmshlakw.jpeg?auto=webp&amp;s=a1ecaa5b4e9e9fbfbee083b66e0c8ad381d8f78d"
        },
        "permalink": "/r/movies/comments/1nbaoi2/peewee_as_himself_wins_the_2025_emmy_for/"
    },
    {
        "id": "1nb4zby",
        "author": "EuphoricButterflyy",
        "title": "Patrick Wilson surprises fans at a ‘The Conjuring: Last Rites’ showing in Atlanta.",
        "content": "",
        "upvotes": 2364,
        "comments": 111,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/mfebfci26tnf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1nb4zby/patrick_wilson_surprises_fans_at_a_the_conjuring/"
    },
    {
        "id": "1nawtuo",
        "author": "sicknessandpurgatory",
        "title": "What is the absolute dumbest premise that actually turned out to be a really good movie?",
        "content": "I was thinking The Purge, obvious answer, but looking for the most plot-hole ridden, juvenile concept that actually ended up a lot of fun despite it all. Mainly looking for 21st century films, not so much the video nasties and ridiculousness from the 60’s and 70’s. Because that would be too easy. Mainly mainstream stuff that people saw en masse. ",
        "upvotes": 4965,
        "comments": 3577,
        "media": null,
        "permalink": "/r/movies/comments/1nawtuo/what_is_the_absolute_dumbest_premise_that/"
    },
    {
        "id": "1nb6gaw",
        "author": "Zestyclose_General87",
        "title": "Name a romance or rom-com that everyone swooned over but you thought was a cautionary tale and devastating to watch.",
        "content": "\"One Day\" with Anne Hathaway, bestfriends from college who had a brief fling and met up once a year to catch up with each others lives. This movie should have been called \"One Day He'll Pick Me\" it was so uncomfortable to watch but I wanted to see if the FMC finally realized her worth and stopped pining for her best friend. Its only after so many years she appears to move on, he finally realizes his feelings and she drops everything to be with him, and it pretty much goes downhill from there.",
        "upvotes": 659,
        "comments": 365,
        "media": null,
        "permalink": "/r/movies/comments/1nb6gaw/name_a_romance_or_romcom_that_everyone_swooned/"
    },
    {
        "id": "1nb4kn4",
        "author": "Alternative-Cake-833",
        "title": "What's a movie that you anticipated quite heavily that turned out to be quite a disappointment?",
        "content": "For me, it was Star Wars: The Phantom Menace. I don't think that the movie is bad (it does has some cool scenes such as the Darth Maul fight scene) but I am saying this: we were all excited for the return of Star Wars after a 16 year hiatus, it was constantly hyped up, was the most anticipated movie of our lives and we were curious to know about the rise of Anakin Skywalker and how he became Darth Vader...\n\nInstead, we ended up getting Jar-Jar, a long podracing scene, CGI overload and corny dialogue that was written by a 7 year old. We waited 16 years for this film to come out and also, we get a sci-fi movie, disguised as a children's film for the first 2/3rds of the movie. It was a huge letdown at the time but despite this, I since have cooled down quite a bit on the prequels with the exception of Jar-Jar Binks as at least, it still has the Star Wars feel to it and a cool fight scene to Phantom Menace which is the Darth Maul fight scene with Obi-Wan and Qui-Gon.",
        "upvotes": 353,
        "comments": 1010,
        "media": null,
        "permalink": "/r/movies/comments/1nb4kn4/whats_a_movie_that_you_anticipated_quite_heavily/"
    },
    {
        "id": "1nb730h",
        "author": "M_Le_Petomane",
        "title": "Lake Placid (1999)",
        "content": "I LOVE this film.  Great script and dialogue by David E. Kelley.  Gleason and Platt are hilarious bouncing off each other and Bridget Fonda just doin' her cute 'Bridget Fonda' thang. Creature by *Stan Winston* and of course.....Betty White stealing scenes:\n\n[S*heriff Hank Keough*](https://www.imdb.com/name/nm0322407/?ref_=ttqu_qu)*: \"Ma'am, your husband Bernie, you didn't by any chance lead him to the lake blindfolded?\"*\n\n[*Mrs. Bickerman*](https://www.imdb.com/name/nm0924508/?ref_=ttqu_qu)*:  \"If I had a dick, this is where I'd tell you to suck it!\"*\n\nI don't know why it doesn't get more love to be honest - puts a smile on my face with every viewing.\n\nWhere does it go wrong that so many dislike it?",
        "upvotes": 238,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_UVF62BFJ8VYW0pzmPURW6cux8mAsGqLkFd7ktQUj6o.jpeg?auto=webp&amp;s=b5ba2bde13683c7196761ed42759d686a8d81483"
        },
        "permalink": "/r/movies/comments/1nb730h/lake_placid_1999/"
    },
    {
        "id": "1nbi6vw",
        "author": "yashg",
        "title": "Mission: Impossible - The Final Reckoning just unbelievably stupid plot holes",
        "content": "This is probably discussed already but as a programmer I have to get it out of my system. I watched Final Reckoning on a flight and here are the things I find absolutely unbelievable -\n\nWhy is the source code of The Entity on a hard drive on a submarine? Who deploys software with source code? Were there no other copies of the code with the programmers who developed it? No concept of a code repository?\n\nLet's put aside the fact that Luther developed a virus/malware for code he has not seen for a drive he has not seen and seems to use a non standard interface - how connecting the poison pill to the Podcova drive will control/kill the AI when the drive is not even connected to any network?\n\nWhy would any country connect their nuclear arsenal with public internet? This is a common trope of all AI as villain movies. AI taking control of nuclear weapons and launching them to destroy humanity.\n\nHow did the US government know it will take the Entity exactly 3 days for the Entity to gain access to every country's nuclear arsenal?\n\nWhy didn't any other country launch a preemptive nuclear strike on the command centers controlled by the Entity? Why wait till your command center also get hacked?\n\nIf you know your servers are going to be hacked, just unplug the router.\n\nGabriel seems to be all powerful and resourceful. He also seems to have easy access to nuclear weapons himself. He activates them not once but twice. In any other movie just stopping a guy like him from having access to even a single nuclear bomb would itself be a mission. And now he just shows up and activates a nuclear weapon like lighting a cigarette.\n\nWhy is Ethan Hunt the only man who can find the submarine and retrieve the hard drive? How difficult would it be to locate a sunken submarine from 2012 when everyone seems to know its coordinates can be found from a specific monitoring station. Why would the Russians wait for 13 years when they already have another key. \n\nThe action sequences are getting boring and repetitive. Just how many times have we seen Tom Cruise hanging onto planes and skyscrapers? The bike jump in Dead Reckoning was cool. The whole submarine and plane chase was simply exhausting.\n\nThey tried to make Neo out of Hunt. One who fights the machine/AI and saves humanity.",
        "upvotes": 38,
        "comments": 72,
        "media": null,
        "permalink": "/r/movies/comments/1nbi6vw/mission_impossible_the_final_reckoning_just/"
    },
    {
        "id": "1naxsqn",
        "author": "therekcap",
        "title": "I simply cannot remember this movie and it’s killing me.",
        "content": "Ok so I apologize as I am really struggling to remember specific details. But I know there is a successful woman who has become reclusive and is living at home. She might be an author or something like that. There is a younger woman (potentially a man) who is like a mentee who kinds of ends up being her caregiver. She wants to be more and successful but the older woman is sort of dragging her down mentally.\n\nI believe the younger person is engaged, and the older woman is against that I think. The older woman is married and the husband is not around often. A lot of the movie takes place in the house. There are books, I think it ends in a garden.\n\nThe older woman might have dementia or some kind of illness. She’s very snappy and manipulative.\n\nThe closest thing I’ve found is The Lesson but it’s not that.\n\nSlow burn drama. Not a ton happens. English language. Made in the last 10 years.\n\nScenes at dinner table, bathroom, bedroom, flowery garden.\n\nPlease help me.\n\nEDIT: THANK YOU REDDIT! You movie buffs did what AI couldn’t. It was Shirley. Thanks to Imjustabuttonpusher",
        "upvotes": 655,
        "comments": 108,
        "media": null,
        "permalink": "/r/movies/comments/1naxsqn/i_simply_cannot_remember_this_movie_and_its/"
    },
    {
        "id": "1nb1rl0",
        "author": "m_t_rv_s__n",
        "title": "Examples of films that don't become clear until the end?",
        "content": "I've become more interested recently in movies that only make sense in hindsight, i.e. the viewer watches, gets clues or hints along the way, might make an educated guess or two, but the film doesn't really come together until the end, when the movie reveals the rest and it all makes sense in retrospect. Bonus points if the conflict isn't immediately apparent either.\n\nAppreciate your recommendations\n\nEdit: Can't keep up with all the replies, so just wanted to give a general \"Thanks again\", look forward to watching a lot of these",
        "upvotes": 382,
        "comments": 576,
        "media": null,
        "permalink": "/r/movies/comments/1nb1rl0/examples_of_films_that_dont_become_clear_until/"
    },
    {
        "id": "1namdgn",
        "author": "ChiefLeef22",
        "title": "'Wake Up Dead Man: A Knives Out Mystery' - Review Thread",
        "content": "*World-renowned detective Benoit Blanc returns for his most dangerous case yet.*\n\nDirector: Rian Johnson\n\nCast: Daniel Craig, Cailee Spaeney, Jeremy Renner, Andrew Scott, Mila Kunis, Thomas Haden Church, Glenn Close, Josh Brolin, Kerry Washington, Josh O'Connor\n\n**Rotten Tomatoes:** [100%](https://www.rottentomatoes.com/m/wake_up_dead_man_a_knives_out_mystery)\n\n**Metacritic:** [85/100](https://www.metacritic.com/movie/wake-up-dead-man-a-knives-out-mystery/)\n\nSome Reviews:\n\n[Variety - Owen Glieberman](https://variety.com/2025/film/reviews/wake-up-dead-man-a-knives-out-mystery-review-daniel-craig-1236510178/)\n\n&gt;Wake Up Dead Man: A Knives Out Mystery is an enticingly clever and droll, nearly pitch-perfect piece of murder-mystery fun — a whodunit that lives up to the expectations set six years ago by “Knives Out,” which offered its own perfect revival of the Agatha Christie spirit, with a tasty frosting of meta cheekiness.\n\n[TheWrap - Chase Hutchinson](https://www.thewrap.com/wake-up-dead-man-review-rian-johnson-daniel-craig-knives-out-3/)\n\n&gt;Although “Wake Up Dead Man” is the “Knives Out” movie that’s most preoccupied with existential questions surrounding death, writer/director Rian Johnson’s third film in the series is also the one that’s most full of life.\n\n[DEADLINE - Damon Wise](https://deadline.com/2025/09/wake-up-dead-man-a-knives-out-mystery-review-rian-johnson-daniel-craig-1236510199/)\n\n&gt;After the bright, light, summery holiday special that was *Glass Onion*, the *Knives Out* franchise returns to its gothic roots with a wintry whodunit that, for some at least, might endure as the the best one yet. Where the first and second used the murder-mystery as a jumping-off point for some very funny contemporary satire, *Wake Up Dead Man* is much more introspective. In a funny way, it’s a little analogous to *Joker 2*, not because it unloads on its audience in the same acerbic way but because it poses similarly metaphysical questions about its own popularity. Why do people respond so eagerly to stories of murder and betrayal? To answer that, director [Rian Johnson](https://deadline.com/tag/rian-johnson/) goes back to the greatest story ever told, using a small religious community as the setting for the third instalment.\n\n[IndieWire - Kate Erbland](https://www.indiewire.com/criticism/movies/wake-up-dead-man-review-rian-johnson-third-knives-out-1235149631/) \\- 'B+'\n\n&gt;It works, and it’s no big mystery why — Johnson knows his form and format, and delivers on it, playing with tone and message but never losing sight of why these stories are so damn entertaining to watch and unravel.\n\n[Awards Radar - Joey Magidson](https://awardsradar.com/2025/09/07/tiff-review-wake-up-dead-man-a-knives-out-mystery-is-rian-johnsons-best-and-most-ambitious-installment-yet/) \\- 3.5 / 4\n\n&gt;Filmmaker Rian Johnson trusts the strength of his franchise to play around with format and theme. The gothic elements on display, as well as the religious aspect, may initially seem like a left turn, but it all ends up fitting like a glove. He knows the must haves for a *Knives Out* flick and absolutely delivers. A few big sequences here at TIFF received ovations once completed. You just can feel that you’re in the hands of a master storyteller, so you’ll follow him anywhere. Johnson knows that and 100% makes the most of it.\n\n[The Daily Beast - Nick Schager](https://www.thedailybeast.com/obsessed/wake-up-dead-man-knives-out-3-finds-god-and-is-so-good-because-of-it/)\n\n&gt;In terms of pure, heady kicks, it outpaces *Knives Out* but falls just short of *Glass Onion*. In the big picture, however, such distinctions are rather inconsequential; more important is that Johnson’s franchise remains a sly and sure-footed delight, as well as demonstrates, with its religiously minded latest, that it’s capable of coloring its Christie-esque mysteries in a variety of shades.",
        "upvotes": 3304,
        "comments": 440,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fIYpdc8nom8ZtELZywKtatTiDUv459rA98wOjyUOqJM.jpeg?auto=webp&amp;s=1b6126b416858cea28015e58202287deb62e8e00"
        },
        "permalink": "/r/movies/comments/1namdgn/wake_up_dead_man_a_knives_out_mystery_review/"
    },
    {
        "id": "1nbbs29",
        "author": "EuphoricButterflyy",
        "title": "‘Showdown in Little Tokyo’ (1991)- the scene where Dolph Lundgren and Brandon Lee get bombarded and captured by the enemy",
        "content": "",
        "upvotes": 84,
        "comments": 17,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/i2816i8uounf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1nbbs29/showdown_in_little_tokyo_1991_the_scene_where/"
    },
    {
        "id": "1nazqw1",
        "author": "darth_vader39",
        "title": "‘Toxic Avenger’ Writer/Director Macon Blair Hopes To Bring Back OG Characters &amp; Cast Melanie Lynskey As Villain In Potential Sequel",
        "content": "",
        "upvotes": 379,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9PV6y40-mIHzfhzF3sAZw6HXIjNgzDie0GDKdad46h0.jpeg?auto=webp&amp;s=11da18ede8d9040cc909eeecf9489bff2548fb13"
        },
        "permalink": "/r/movies/comments/1nazqw1/toxic_avenger_writerdirector_macon_blair_hopes_to/"
    },
    {
        "id": "1nbhfft",
        "author": "ChiefLeef22",
        "title": "'Rental Family' - Review Thread",
        "content": "*Struggling to find purpose, an American actor lands an unusual gig with a Japanese agency to play stand-in roles for strangers. As he immerses himself in his clients' worlds, he begins to form genuine bonds that blur the lines between performance and reality. Confronting the moral complexities of his work, he soon rediscovers purpose, belonging, and the quiet beauty of human connection.*\n\nDirector: Hikari\n\nCast: Brendan Fraser, Mari Yamamoto, Akira Emoto, Takehiro Hira\n\n**Rotten Tomatoes:** [100%](https://www.rottentomatoes.com/m/rental_family)\n\n**Metacritic:** [70/100](https://www.metacritic.com/movie/rental-family/)\n\nSome Reviews:\n\n[The Hollywood Reporter - Franck Scheck](https://www.hollywoodreporter.com/movies/movie-reviews/rental-family-review-brendan-fraser-hikari-1236362251/)\n\n&gt;Brendan Fraser's superbly nuanced and expressive performance proves key to the film’s power, and he’s well matched by excellent supporting players, including Mari Yamamoto as one of his role-playing co-workers, with whom he develops a strong friendship (and who thankfully doesn’t turn out to be a predictable love interest).\n\n[TheWrap - William Bibbiani](https://www.thewrap.com/rental-family-review-brendan-fraser/)\n\n&gt;“Rental Family” is, in turns, wholesome and vicious, funny and severe, contrived and elegant. It is after all a film about actors with oodles of range, undergoing the unique challenges of their craft, and these shifts serve the material well but they don’t always work wonders for the audience. It’s easy to struggle with how exactly we’re supposed to feel about all this.\n\n[IndieWire - David Ehrlich](https://www.indiewire.com/criticism/movies/rental-family-review-brendan-fraser-1235149619/) \\- 'B-'\n\n&gt;It’s impossible to watch Fraser’s turn without thinking about the various injuries he’s suffered over the span of his career (physical and otherwise), and that extra-textual layer of personal history goes a long way towards fleshing out the underwritten character he inhabits here. His see-through screen persona makes for a similar advantage, as it allows Phil’s services to perfectly split the difference between the realness of his connection and the artifice of his affect. His relationship with Mia feels real as can be and glaringly fake all at once, which is just as well in a gentle little movie that recognizes truth and performance as two sides of the same coin. \n\n",
        "upvotes": 21,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/K8bXJFCqrT77cO74bdjMsfUKDzJ8eknzJ5eLJuwTnrU.jpeg?auto=webp&amp;s=98c7240ca28998f3c86a1ac42efdd971b559847d"
        },
        "permalink": "/r/movies/comments/1nbhfft/rental_family_review_thread/"
    },
    {
        "id": "1nbbbwn",
        "author": "ImportantGuidance884",
        "title": "What is your favorite movie Robin Williams was cast in, and why?",
        "content": "Realized after watching “RV” with my kids last night that there are sooo many Robin Williams movies I haven’t seen! I’m on a mission to watch more movies starring him, but I’m not sure where to start. \n\nIf you could suggest just one Robin Williams movie, what would it be, and why? Open to all genres! ",
        "upvotes": 60,
        "comments": 289,
        "media": null,
        "permalink": "/r/movies/comments/1nbbbwn/what_is_your_favorite_movie_robin_williams_was/"
    },
    {
        "id": "1narizi",
        "author": "Big-Property7157",
        "title": "Top Secret! (1984) Trailer #1 | Movieclips Classic Trailers",
        "content": "",
        "upvotes": 707,
        "comments": 93,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kgDNNadCn_7ZGhlH8hg3vpeA4tJDTpUGLAovJ5dEc88.jpeg?auto=webp&amp;s=b35658472710e74c5c5ddb6eb3ef063cf529d9b8"
        },
        "permalink": "/r/movies/comments/1narizi/top_secret_1984_trailer_1_movieclips_classic/"
    },
    {
        "id": "1nb5362",
        "author": "MarvelsGrantMan136",
        "title": "New Poster Yorgos Lanthimos’ ‘Bugonia’ Starring Emma Stone &amp; Jesse Plemons - Two conspiracy-obsessed young men kidnap the high-powered CEO of a major company, convinced that she is an alien intent on destroying planet Earth.",
        "content": "",
        "upvotes": 88,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zgxf0jgu6tnf1.jpeg?auto=webp&amp;s=f35b6a74e3eb2a79388d7205f2d3b8518a684e15"
        },
        "permalink": "/r/movies/comments/1nb5362/new_poster_yorgos_lanthimos_bugonia_starring_emma/"
    },
    {
        "id": "1nb0u62",
        "author": "ItsMeItsKayItsKay",
        "title": "Actors you’re dying to see together in a movie",
        "content": "Which two actors would you love to see do a movie together (any genre) that have never paired up before?\n\nI recently listened to the Smartless episode with Steve Buscemi, and I can’t stop thinking about how I’d love to see a cop movie with him and Denzel. Could be drama or comedy — I’d watch either way!\n\nEDIT: I wish I could comment on everything, and if I don’t get to your comment, know I haven’t been disappointed by any response. Absolutely incredible pairing suggestions, friends!!",
        "upvotes": 124,
        "comments": 356,
        "media": null,
        "permalink": "/r/movies/comments/1nb0u62/actors_youre_dying_to_see_together_in_a_movie/"
    },
    {
        "id": "1nad0vh",
        "author": "kanethekiller90",
        "title": "One thing thats always irritated me about Interstellar",
        "content": "Cooper is desperate to get back to his children. He goes back and see’s Murph in the hospital etc. but theres no mention of his son. Presumably his son’s dead considering Murphs age and condition. But surely there could have been a small bit of dialogue about it. He was hell bent on getting back to them. I dunno, it’s like his son’s just completely forgotten about at the end…",
        "upvotes": 4366,
        "comments": 634,
        "media": null,
        "permalink": "/r/movies/comments/1nad0vh/one_thing_thats_always_irritated_me_about/"
    },
    {
        "id": "1nb68nb",
        "author": "ghostcaurd",
        "title": "Finished The act of killing. I’ve never seen a documentary that blew me out of the water that was. What are some other documentaries that are on the same level.",
        "content": "The only ones I’ve seen that come close are: winter on fire, blackfish, dear Zachary, postcards from a lynching and Icarus. I’m looking for documentaries that completely capture you and take you to a place you’ve never been/felt. Mind blowing stuff. Please list them and describe how it made you feel! ",
        "upvotes": 48,
        "comments": 57,
        "media": null,
        "permalink": "/r/movies/comments/1nb68nb/finished_the_act_of_killing_ive_never_seen_a/"
    },
    {
        "id": "1naw5kq",
        "author": "AlanisBeauty",
        "title": "What’s the movie you always rewatch out of nostalgia?",
        "content": "Sometimes it’s not about whether the movie is “objectively good,” it’s about how it makes us feel. I have a few films I rewatch because they remind me of a certain time in my life, even if they’re a bit dated now. Which movie do you keep rewatching purely for nostalgia?\nLet me know what is your greatest love (movie)",
        "upvotes": 155,
        "comments": 515,
        "media": null,
        "permalink": "/r/movies/comments/1naw5kq/whats_the_movie_you_always_rewatch_out_of/"
    },
    {
        "id": "1nb42vk",
        "author": "Double-Survey7382",
        "title": "Slap Shot",
        "content": "Is *Slap Shot* the best hockey movie ever? With Paul Newman leading the way, the wild Hanson Brothers, the rough old-school hockey feel, and jokes that still land today, what other hockey film really stacks up to its mix of laughs, fights, and pure chaos on and off the ice? I say nothing comes close. The Mighty Ducks was for kids, Mystery Alaska? Meh. Love to hear your opinions.",
        "upvotes": 59,
        "comments": 86,
        "media": null,
        "permalink": "/r/movies/comments/1nb42vk/slap_shot/"
    },
    {
        "id": "1nazmvf",
        "author": "Laurie_Barrynox",
        "title": "Luca Guadagnino's remake of \"Suspiria\" was so different from the original movie and it's a film hard to describe. Some parts work, some don't.",
        "content": "I love the supporting cast he got. So many Iconic European actresses: Tilda, Angela Winkler, Renee Soutjendiik, Sylvie Testud, Ingrid Caven, and then, there's the original leading lady, Jessica Harper. \n\nAs much flak as Dakota Johnson gets for her acting,I thought her performance as Susie was very good, even though they made some drastic changes with her character. Tilda is good as usual. I loved Mia Goth, her scenes are definitely the closest ones to Horror. Chloe Moretz has an unforgettable cameo. \n\nBut the movie doesn't seem to know what it wants to be. It's very uneven. The political commentary felt pointless. And Tilda's stunt casting as an elderly man was distracting and mostly boring. It was like the Dominic Guard scenes in Picnic at Hanging Rock, a irritating distraction.",
        "upvotes": 79,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1nazmvf/luca_guadagninos_remake_of_suspiria_was_so/"
    },
    {
        "id": "1nb85zj",
        "author": "EveryoneCallsMeYork",
        "title": "Hear me out. Wes Anderson's Sirens of Titan",
        "content": "All I could picture while reading this book last year was a Wes Anderson film. The way the characters are written, the descriptions of the scenes, the framing of the images in my mind as I ripped through the book. It was like I was viewing my own personal showing of his adaptation in my mind. I can't think of anyone better to land the visual style and the oddly comedic tones.",
        "upvotes": 23,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1nb85zj/hear_me_out_wes_andersons_sirens_of_titan/"
    },
    {
        "id": "1nahu2n",
        "author": "MarvelsGrantMan136",
        "title": "'Rebel Ridge' Wins the Emmy for Outstanding Television Movie",
        "content": "",
        "upvotes": 1014,
        "comments": 107,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3_92vJU4yAYk2NhgIVs1_o_m5AxQkGexRAX0CQmacj4.jpeg?auto=webp&amp;s=0a40b086cb84027a54aa340bdf7237f4f9d71502"
        },
        "permalink": "/r/movies/comments/1nahu2n/rebel_ridge_wins_the_emmy_for_outstanding/"
    },
    {
        "id": "1nbi7xc",
        "author": "jonbristow",
        "title": "The making of the dance scene in “Sinners” is so fascinating. One of the best scenes ever",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g8a3jimULL61iEmhgqVF5psSWUWPGEO-meFIj5e4ILg.jpeg?auto=webp&amp;s=6a39e044151821f9a7a2e0f7142ddfe71fd19e53"
        },
        "permalink": "/r/movies/comments/1nbi7xc/the_making_of_the_dance_scene_in_sinners_is_so/"
    },
    {
        "id": "1nbewkb",
        "author": "CherryTraditional229",
        "title": "Letterboxd vs. IMDb vs. (Another app) - What's one feature from each you'd combine into a super-app?",
        "content": "Every app has its strengths. IMDb's database is unmatched. Letterboxd's social feel and design are great. Trakt's API is powerful.\nIf you could take one core feature from each major movie tracking app and combine them into your perfect platform, what would you choose and why? What would be the ultimate combo?",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1nbewkb/letterboxd_vs_imdb_vs_another_app_whats_one/"
    },
    {
        "id": "1nbhh7d",
        "author": "457655676",
        "title": "Nic Pizzolatto’s Debut Film Centers on Second Chances",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kEBWuKOeSDoCso5VdIPO3T5UBwWbNdmU8krGjVw6YDQ.jpeg?auto=webp&amp;s=72639809dc70dbd69c17534772b065a984d76543"
        },
        "permalink": "/r/movies/comments/1nbhh7d/nic_pizzolattos_debut_film_centers_on_second/"
    },
    {
        "id": "1nb5pm5",
        "author": "thedudelebowsky1",
        "title": "Rewatched the Revenant last night, and I had some thoughts",
        "content": "I know that this appears to be a movie that people either love or hate, personally, I love the movie. I absolutely love the way that it's shot, a long with the score giving it a mythical or dreamlike feel at times. I was thinking recently about Tom Hardy and how his career trajectory has changed since the venom movies and I feel like he doesn't stand out as much as an actor anymore, and rewatching this movie reminded me just how great Tom Hardy can be. His role as Fitzgerald is genuinely his best in my opinion. The cinematography is stunning, the performances are bold, the violence feels real, and the desperation of Hugh Glass really is felt. Of course this movie won DiCaprio his Oscar and I feel that's well deserved despite some saying he tortured himself to get the Oscar. For the life of me I don't understand how so many people I know were underwhelmed with the movie upon its release. Have you revisited it recently? And if so, how have your thoughts on the film changed since release?",
        "upvotes": 21,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1nb5pm5/rewatched_the_revenant_last_night_and_i_had_some/"
    },
    {
        "id": "1nbh98d",
        "author": "g2daizzle",
        "title": "Movies That Completely Changed Your Perspective on Life?",
        "content": "I just watched \"Everything Everywhere All at Once\" and it genuinely shifted how I think about existence and relationships. Are there any films that fundamentally changed your worldview or made you reconsider major life decisions? Not just entertained you, but actually altered your perspective on something important?",
        "upvotes": 2,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1nbh98d/movies_that_completely_changed_your_perspective/"
    },
    {
        "id": "1nb1gc0",
        "author": "Mechagoji75",
        "title": "Who Discovered Roger Rabbit (Unproduced Prequel Script) (1998) by Sherri Stoner &amp; Deanna Oliver",
        "content": "([https://archive.org/details/who-discovered-roger-rabbit-script-1998](https://archive.org/details/who-discovered-roger-rabbit-script-1998))\n\n**Writers:** Sherri Stoner &amp; Deanna Oliver\n\n**Note:** This was a script that was commissioned by Michael Eisner - as it was developed around the late-90s, after the original prior Toon Platoon prequel script (by Nat Mauldin &amp; Tony Sheehan &amp; Jeff Stein) was cancelled - although it retained the element of Roger searching for his mother, but Stoner &amp; Oliver replaced the WWII subplot with Roger's inadvertent rise to stardom on Broadway and Hollywood. Disney was impressed and Alan Menken was hired to write five songs for the film and offered his services as executive producer. One of the songs, \"This Only Happens in the Movies\", was recorded in 2008 on the debut album of Broadway actress Kerry Butler. Eric Goldberg was set to be the new animation director, and began to redesign Roger's new character appearance. \n\nSteven Spielberg became busy establishing DreamWorks, while Frank Marshall and Kathleen Kennedy decided to remain as producers. Test footage for Who Discovered Roger Rabbit was shot sometime in 1998 at the Disney animation unit in Lake Buena Vista, Florida; the results were a mix of CGI, traditional animation, and live-action that did not please Disney. A second test had the toons completely converted to CGI, but this was dropped as the film's projected budget would escalate past $100 million. Eisner felt it was best to cancel the film.\n\n\\*Attached is Stoner &amp; Oliver's November 20, 1998/1st draft -- Enjoy!",
        "upvotes": 28,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2jEFvJsyojbS8PqI3bck9CgMRyBXI0UlRw2hgywNAFA.jpeg?auto=webp&amp;s=045b274b7738d23b7f58bf8f29e7a58eba31e52f"
        },
        "permalink": "/r/movies/comments/1nb1gc0/who_discovered_roger_rabbit_unproduced_prequel/"
    }
]