[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 506,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1k71md4",
        "author": "nickbruckman",
        "title": "I’m Nicholas Bruckman — director of the new documentary on Netflix, MINTED: The Rise (and Fall?) of the NFT  — AMA on 4/28 @ 4pm ET!",
        "content": "What’s up r/netflix! I’m Nick, director of *MINTED*, now streaming on Netflix worldwide (well, North America, the UK, Australia/New Zealand, and Africa!)\n\nThe film is a front-row seat to the explosive rise of NFTs becoming a $40 billion digital gold rush, all the way through the market's dramatic crash. We spent years embedded in the digital art and crypto worlds, from NFT multimillionaires flipping JPEGs to the pioneering artists flipping the script on the traditional art market, plus the critics and journalists digging into the good, the bad, and bizarre of this new frontier.\n\nWhether you love or hate NFTs, I hope the film sparks some big questions about how art, tech, and finance are colliding. Beyond NFTs, it’s about pioneering artists trying to not just survive, but lead the way forward in how we use new technology as a society.\n\nWe premiered *Minted* at the Tribeca Film Festival, and its been a wild ride since. So whether you’re a collector, a skeptic, or just a fellow documentary nerd — AMA!\n\nproof: [https://www.instagram.com/p/DI12rZQz1BX](https://www.instagram.com/p/DI12rZQz1BX)\n\nnetflix: [https://www.netflix.com/title/81993558](https://www.netflix.com/title/81993558)",
        "upvotes": 14,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1k71md4/im_nicholas_bruckman_director_of_the_new/"
    },
    {
        "id": "1kaw573",
        "author": "LushCharm91",
        "title": "'You' Season 5 Ratings: 10.1 Million Netflix Views in Four Days",
        "content": "",
        "upvotes": 55,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1kaw573/you_season_5_ratings_101_million_netflix_views_in/"
    },
    {
        "id": "1kay7ag",
        "author": "No_Fox_3788",
        "title": "May 2025 looks...like we've seen it already",
        "content": "Twilight? Airport '75? The Lego Movie?\n Why is Netflix seemingly committed to releasing every Wal-Mart DVD bin you've ever seen? There aren't even 1 or 2 bright spots. Original movies suck,their series sucks, live events get overblown,\nI've never really considered canceling my subscription because of the kids but gd do better",
        "upvotes": 19,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kay7ag/may_2025_lookslike_weve_seen_it_already/"
    },
    {
        "id": "1kb27lv",
        "author": "Visible_Economics_79",
        "title": "Havoc 😞",
        "content": "IMO, one of the all time worst movies ever made. I had such high hopes too. Tom Hardy, Timothy Olyphant, and Forest Whitaker; I thought there’s no way this isn’t a 10/10. More like -100/10. I like a good shoot’em up movie. I thought it would be on par with Extraction and Triple Frontier. Extreme disappointment. Has anyone else watched this movie and felt the same way? ",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kb27lv/havoc/"
    },
    {
        "id": "1kagcp4",
        "author": "ElectronicSpeed3785",
        "title": "Suggest me a movie on Netflix right now!!!!",
        "content": "Hi everyone! I'm in the mood to watch a really good psychological thriller with lots of suspense, mind games, and unexpected twists. Something that keeps you guessing until the very end and leaves you thinking afterward. Preferably available on Netflix. It could be intense, disturbing, emotional, or slow-burn — I'm open to anything as long as it messes with your mind and keeps the tension high. I'd love some recommendations from you all! Thanks in advance!",
        "upvotes": 78,
        "comments": 109,
        "media": null,
        "permalink": "/r/netflix/comments/1kagcp4/suggest_me_a_movie_on_netflix_right_now/"
    },
    {
        "id": "1kb42mc",
        "author": "Ecstatic-Cranberry90",
        "title": "The Brothers Sun",
        "content": "I just started watching The Brothers Sun and I like the mixture of action with comedy. It's keeping me interested. Also I feel sorry for Bruce. Dude keeps sacrificing for his family while he just wants to go to school and do improv comedy 😂",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kb42mc/the_brothers_sun/"
    },
    {
        "id": "1kau1tz",
        "author": "CocoaDementi",
        "title": "Chef's Table",
        "content": "Hi Everyone. \n\nI came here to say that I think Chef's Table (Original, Noodles, Pizza, BBQ, France and now Legends) is the ABSOLUTE GREATEST SHOW RUNNING when it comes to Chefs and Food. \n\nFrom The Director to the editing .. It is BRILLIANT. It is so intimate and you really get to spend 48 minutes just completely honed in on The Chef's back story. If you love Food Shows .. TRUST ME and give it a try. \n\nFor those of you who are familiar with Chef's Table .. What other Food shows do you love or recommend? ",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kau1tz/chefs_table/"
    },
    {
        "id": "1kb2287",
        "author": "_zyx_716",
        "title": "Household question",
        "content": "I live in two separate houses and until now there hasn't been any issues with the account but now I'm unable to use the account in one of them. I am the only user of the account just in two different locations. Is there anyway around this? Having to pay for two separate subscriptions just to be able to watch it at both houses seems excessive.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kb2287/household_question/"
    },
    {
        "id": "1kaigcq",
        "author": "j-pop97",
        "title": "Why does Netflix use filter on female actors' faces?",
        "content": "Watching the latest season of You (no spoilers thank you), and I'm noticing they use some kind of blurring filter on the female characters but not the male characters, at least not as much. Is this of the request from the actresses ,or is this purely editors/Netflix choice?",
        "upvotes": 34,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1kaigcq/why_does_netflix_use_filter_on_female_actors_faces/"
    },
    {
        "id": "1kb3qh4",
        "author": "dadpole42069",
        "title": "What show is this?",
        "content": "There was this show my wife and I watched about this lady that drove a yellow ford ranger and had a gay, nerdy BFF with a fiance that leaves him because he spends too much time with title character. Gay BFF guy gets a dog that runs away during a thunderstorm, main characters sister has a husband that cheats on her and she beats the other woman up in a motel room. This is all I remember 😔 ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kb3qh4/what_show_is_this/"
    },
    {
        "id": "1k9y0cj",
        "author": "theipaper",
        "title": "TV is better with subtitles - whether you need them or not",
        "content": "",
        "upvotes": 323,
        "comments": 120,
        "media": null,
        "permalink": "/r/netflix/comments/1k9y0cj/tv_is_better_with_subtitles_whether_you_need_them/"
    },
    {
        "id": "1kb0ss0",
        "author": "U196",
        "title": "Title Restrictions List Completely Vanished?",
        "content": "Now when I try to access it it gives me the option of password or code, before it was just password. Now when I get into the settings for it the titles I had previously selected are completely gone. The list is blank.\n\nCan anyone see their list of titles that were restricted? Or is it blank as well?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kb0ss0/title_restrictions_list_completely_vanished/"
    },
    {
        "id": "1kauzdt",
        "author": "OkBuilder9240",
        "title": "Why does Netflix only partially download episodes?",
        "content": "Netflix says that the episode is fully downloaded but midway through the episode it says that I have watched everything that’s downloaded and I need to connect to the internet to continue watching. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kauzdt/why_does_netflix_only_partially_download_episodes/"
    },
    {
        "id": "1kazmg1",
        "author": "KidCharlemagneII",
        "title": "Error message \"This device isn't part of your Netflix Household\" for no reason?",
        "content": "I've been at home all day. I'm on my usual Wi-Fi. I watched Netflix just fine this morning. Now I'm suddenly getting the message that \"This device isn't part of your Netflix Household\" even though no one in my family has used Netflix today or messed with any settings. It says online I have to set up my settings on the TV, but we don't use Netflix for TV. Anyone encountered this before?\n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kazmg1/error_message_this_device_isnt_part_of_your/"
    },
    {
        "id": "1kavz9q",
        "author": "Atlast_2091",
        "title": "Lost in Starlight | Official Teaser | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kavz9q/lost_in_starlight_official_teaser_netflix/"
    },
    {
        "id": "1kal5o5",
        "author": "Robinshadow91",
        "title": "I just watched manifest, and i'm blown away",
        "content": "This serie is probably the only series that made me watch with full dopamine the entire time.\n\nThe story was so good, and i wish they continued with it, but obviously nothing goes forever.\n\nBut it's all connected! :) ",
        "upvotes": 3,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1kal5o5/i_just_watched_manifest_and_im_blown_away/"
    },
    {
        "id": "1kasomy",
        "author": "NathLWX",
        "title": "Lost in Starlight (Netflix's first Korean original animated film) - Teaser Trailer",
        "content": "Netflix's first Korean original anime (aeni) film.\n\n[Description](https://media.netflix.com/en/only-on-netflix/81664623):  \nIn 2050 Seoul, astronaut Nan-young’s ultimate goal is to visit Mars. But she fails the final test to onboard the fourth Mars Expedition Project. The musician Jay buries his dreams in a vintage audio equipment shop.  \nThe two fall in love after a chance encounter. As they root for each other and dream of a new future. Nan-young is given another chance to fly to Mars, which is all she ever wanted…  \n**“Don’t forget. Out here in space, there’s someone who’s always rooting for you.”**\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kasomy/lost_in_starlight_netflixs_first_korean_original/"
    },
    {
        "id": "1kaaqhz",
        "author": "United_Credit_6264",
        "title": "You series/Bronte character question",
        "content": "Just to be clear, there will be spoilers if you have not watched season five episode seven and so on.\n\nAnd before I get to the spoilers, can I just ask has anyone been bored with this last season? Every other season I have stayed very interested but this time around I get easily distracted and want to stop watching. Am I the only one?\n\n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n💥 \n\nSPOILER ALERT\n‼️\n\nSo Brontë doesn’t know that Joe killed her friend Beck?!!!!!!? Like I’m so confused. How does she still not know it was him…….?",
        "upvotes": 18,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kaaqhz/you_seriesbronte_character_question/"
    },
    {
        "id": "1k9qon6",
        "author": "usmannaeem",
        "title": "There should be an option to completely remove a title that I am never going to watch.",
        "content": "There is only an option to hide a title but then, still Netflix will recommend titles similar to it as well. Would be nice if Netflix allowed me to completely remove a title that is never to be seen again and therefore the algorithm will never recommend something like it either.",
        "upvotes": 297,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1k9qon6/there_should_be_an_option_to_completely_remove_a/"
    },
    {
        "id": "1kaowve",
        "author": "BunyipPouch",
        "title": "Scott Mann, the director of 2022 survival-thriller FALL, which was a huge hit on Netflix and resulted in two announced sequels, is doing an AMA/Q&amp;A in /r/movies today for anyone interested. It's live now, with answers at 4 PM ET.",
        "content": "Scott Mann, the director of 2022 survival-thriller FALL, which was a huge hit on Netflix and resulted in two announced sequels, is doing an AMA/Q&amp;A in /r/movies today for anyone interested. It's live now, with answers at 4 PM ET.\n\nIt's live here now for anyone interested:\n\nhttps://www.reddit.com/r/movies/comments/1kanxim/hey_rmovies_im_scott_mann_director_writer_and/\n\nThey'll be back at 4 PM ET to answer questions. Any question/comment is much appreciated.\n\nVerification photo:\n\nhttps://i.imgur.com/qOJYP9k.png",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kaowve/scott_mann_the_director_of_2022_survivalthriller/"
    },
    {
        "id": "1kaywlc",
        "author": "Nates4Christ",
        "title": "File Complaint about PC Download",
        "content": "Has anyone here been filing a complaint that Netflix removed the ability to download movies and shows on the PC app? I filed a complaint and was hoping others have too. I doubt it does any good because the customer service and quality has gone so down hill, but it couldn't hurt. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kaywlc/file_complaint_about_pc_download/"
    },
    {
        "id": "1kb22np",
        "author": "ECO_FRIENDLY_BOT",
        "title": "Full Swing needs to be cancelled",
        "content": "As I'm a golf fan I decided to watch Full Swing  which I now regret as it's such a poor production and is just another disappointing Netflix original. The contributors are all crap and add absolutely nothing to the narrative especially Amanda Balionos and Dan Rappaport. The players know they're micd up so are very careful with what they say and the moments that are recorded look so staged and cringe. It also seems to be a platform for the Wags who no doubt want to promote their own brand and Netflix are happy to do so. Drive to Survive was a good addition but this is mostly garbage.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kb22np/full_swing_needs_to_be_cancelled/"
    },
    {
        "id": "1kahpw9",
        "author": "WildAutonomy",
        "title": "What It Was Like Dubbing Squid Game S2: Voice Actor's Perspective",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kahpw9/what_it_was_like_dubbing_squid_game_s2_voice/"
    },
    {
        "id": "1kagesq",
        "author": "Adventurous-Tea-9460",
        "title": "Will changing my billing country cause the sharing rule to kick in?",
        "content": "A few years ago, I moved back to the US. I was living in the UK and that's where I created my Netflix account. I never got around to change the country so I still get billed in pounds. I have premium and I currently pay £18.99. According to the Netflix website, I need to cancel my account, wait till the end of my billing period, then restart my account. A few years ago, Netflix introduced the extra members fee where anyone outside your household has to pay for Netflix or something along those lines. As far as I can tell, this never took affect for me. I have friends in other countries, who use my account with no issues. And I'm still able to use it when I travel and stuff. Maybe I don't understand how it's supposed to work but if I change my billing country, will it mess everything up for me? Will other people outside my household get kicked off my account? ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kagesq/will_changing_my_billing_country_cause_the/"
    },
    {
        "id": "1kapmjn",
        "author": "GalicDr",
        "title": "Glitching on PC",
        "content": "Having issues while watching on PC, gets way worse than example given in video. ",
        "upvotes": 0,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ls1pd3obdsxe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1kapmjn/glitching_on_pc/"
    },
    {
        "id": "1kamd34",
        "author": "HorseshoeOverlook2",
        "title": "you ahead to be using a proxy... On one profile only?",
        "content": "Over the weekend I was watching a series and as it rolled over from one episode to the next, Netflix stopped playing and provided an error message saying \"You appear to be using a proxy...\", you know the rest. \n\nIt's been that way ever since, on my profile only. My wife can watch whatever she wants with no error message but I can't watch a thing, on the same device. \n\nAny thoughts as to why this is happening on one profile and not another in the same account?\n\nAny idea how to fix it? (Not workaround or bypass but FIX)?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kamd34/you_ahead_to_be_using_a_proxy_on_one_profile_only/"
    },
    {
        "id": "1kaf83z",
        "author": "SelfAmbitious",
        "title": "CHOICES HAVE CONSEQUENCES TOO! Wwe Raw Review (29/4/25)",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kaf83z/choices_have_consequences_too_wwe_raw_review_29425/"
    },
    {
        "id": "1kaf36c",
        "author": "PrettyGirlChaz431",
        "title": "Black Mirror Season 7",
        "content": "So I found out about a week late that there was a new season of black mirror and I just finished the first episode recently and onto the 2nd one but how did everyone feel about this season without spoilers? I remember reading on Twitter that people weren't happy about season 6 except for maybe one or two episodes. ",
        "upvotes": 1,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1kaf36c/black_mirror_season_7/"
    },
    {
        "id": "1kai6i5",
        "author": "Jules1864",
        "title": "Account accessed in radom American cities??",
        "content": "This is the decond time I've had to change my password because I got three simultaneous emails from Netflix saying my account was accessed by a new device, each email with an  American location (one California and the other two Illinois).\n\nI know the location isn't always accurate, but I live in the UK, so there's no chance it was me or another member of my household. \n\nWhat's going on? Has this happened to anyone else? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kai6i5/account_accessed_in_radom_american_cities/"
    },
    {
        "id": "1kadwdf",
        "author": "DaddyyBlue",
        "title": "The Residence, E6 - who’s the young woman in the jungle?",
        "content": "I’m curious who the actress is because she looks familiar. In episode 6, The Third Man, she’s in the very first scene. Shes the one who comes to deliver the stuff to Cordelia in her birdwatching treehouse. I tried googling and I couldn’t find anything.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kadwdf/the_residence_e6_whos_the_young_woman_in_the/"
    },
    {
        "id": "1kadm92",
        "author": "Dragon-_-Lady",
        "title": "Help with Netflix Error 5.7.6",
        "content": "One night I can set my timer app to play a series to fall asleep to on Netflix and the next night it opens Netflix but no videos will play and I get this error. I've cleared the cache on my phone for Netflix, I've restarted my phone, and just now I un-installed Netflix and reinstalled it and still no videos will play. And yes, my phone has the latest update. I've done nothing different with my phone. Netflix plays fine on my TV. Any ideas or help would be most appreciated, thanks! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kadm92/help_with_netflix_error_576/"
    }
]