[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 45,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qgjhem",
        "author": "kmaysu",
        "title": "Netflix cancelling masterpieces on CLIFFHANGERS but renewing trash like Emily in Paris is criminal",
        "content": "Netflix really said:\n\n“Let’s cancel great shows AND leave fans emotionally traumatized.”\n\nThey cancel Mindhunter, The OA, Lockwood &amp; Co. — all with unfinished stories and brutal cliffhangers — but somehow Emily in Paris gets renewed every year like clockwork.\n\nSo you expect us to invest hours, get attached to characters, analyze plots, cry over scenes… just for Netflix to pull the plug mid-story?\n\nWho is approving this logic?\n\nIt’s not just about cancellation — it’s about disrespecting the audience. Ending shows without closure should honestly be illegal.\n\nNetflix’s algorithm clearly prefers shallow binge content that trends for 2 weeks over shows that actually build long-term fandoms.\n\nAt this point watching a new Netflix original feels like gambling.\n\nRant over. Still mad.",
        "upvotes": 2426,
        "comments": 533,
        "media": null,
        "permalink": "/r/netflix/comments/1qgjhem/netflix_cancelling_masterpieces_on_cliffhangers/"
    },
    {
        "id": "1qgmuur",
        "author": "SpecialistTour4232",
        "title": "Netflix new layout SUCKS",
        "content": "Bro why did they change the layout of Netflix to be so difficult to navigate?? It’s like Hulus horrendous layout. Literally the reason I preferred Netflix was the ease of use. ",
        "upvotes": 58,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1qgmuur/netflix_new_layout_sucks/"
    },
    {
        "id": "1qgj2w1",
        "author": "itzclicker",
        "title": "Netflix \"random\" button",
        "content": "Does anyone else wish that Netflix had a \"random\" button where when pressed it would put on a random film that you haven't watched before. I wish it did because it's alway's so hard to find new stuff to watch!",
        "upvotes": 63,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1qgj2w1/netflix_random_button/"
    },
    {
        "id": "1qfs60q",
        "author": "DemiFiendRSA",
        "title": "Matt Damon Says Netflix Wants Movies to Restate the ‘Plot Three or Four Times in the Dialogue’ Because Viewers are on ‘Their Phones While They’re Watching’",
        "content": "",
        "upvotes": 1387,
        "comments": 121,
        "media": null,
        "permalink": "/r/netflix/comments/1qfs60q/matt_damon_says_netflix_wants_movies_to_restate/"
    },
    {
        "id": "1qgq8jx",
        "author": "itsssstonyyy",
        "title": "His and hers",
        "content": "What’s a shit show, In the last episode how did Priya arrive the same time as Jack to take the shot killing lexy, literally makes zero sense when jack had left priya unconscious ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qgq8jx/his_and_hers/"
    },
    {
        "id": "1qggiio",
        "author": "RiskAndReason",
        "title": "What did you WATCH THIS WEEKEND?",
        "content": "What did you end up watching on Netflix this weekend?   \n  \nA new series, a comfort rewatch, or a random movie you finally gave a chance? Looking for ideas to add to my watchlist.",
        "upvotes": 8,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1qggiio/what_did_you_watch_this_weekend/"
    },
    {
        "id": "1qg5yyv",
        "author": "Miserable-Bother-572",
        "title": "Agatha Christie's Seven Dials",
        "content": "I am a big fan of Agatha Christie and her work. Books are great, and Poirot with David Suchet is one of my favourites. The newest adaptation, which aired on Netflix is a huge let down for me, and my greates impression is that they have really dumbed it down. what is you opinion? ",
        "upvotes": 28,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1qg5yyv/agatha_christies_seven_dials/"
    },
    {
        "id": "1qgiqnu",
        "author": "Tricky-Bat-2638",
        "title": "Any good true crime documentaries?",
        "content": "I’m looking for some good true crime documentaries that aren’t too long. Maybe where each episode is a different crime or only 2-3 episodes long. Anything too long I can lose interest in. \n\nThanks in advance 😊 ",
        "upvotes": 4,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qgiqnu/any_good_true_crime_documentaries/"
    },
    {
        "id": "1qgqw7o",
        "author": "Ariesthebigram",
        "title": "GLOW filmed 2 episodes before being shut down due to the COVID pandemic (and later cancelled). How likely will they get released (assuming little to no post-production work)?",
        "content": "A lot of people still want a GLOW series finale movie of some sort but I am definitely intrigued to see these two episodes that were already filmed and have never seen the light of day...yet, but there's hope, just maybe, they can finally be seen.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qgqw7o/glow_filmed_2_episodes_before_being_shut_down_due/"
    },
    {
        "id": "1qgbi6t",
        "author": "sagar-waykar-seo",
        "title": "What to watch next based on my choice?",
        "content": "I feel like, I am out of options. Please help.\n\nBelow are my top choices.\n\nSeries - Dark, Stranger Things, 1899, Ozark, American Gods, Legion, Black Mirror, Sense8, House Of Cards, Squid Games\n\nInside Mossad, The Girl from Oslo, The Spy, Captive, Caliphate, Return From ISIS\n\nDocumentary - The Social Dilemma, The Great Hack.\n\nGOT, Breaking Bad, Narcos - watched once, it is worth watching once onky for me, except few scenes.",
        "upvotes": 6,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1qgbi6t/what_to_watch_next_based_on_my_choice/"
    },
    {
        "id": "1qgkpb6",
        "author": "Kendikay1966",
        "title": "Kids movies",
        "content": "Flying frontier with 2 younger children (boys). Any good movie recommendations to download for them?  They like all kinds of genres.  Aged are 4 and 6. Thx!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qgkpb6/kids_movies/"
    },
    {
        "id": "1qgpwdx",
        "author": "KittyDomoNacionales",
        "title": "Amo (2018)",
        "content": "I’m rewatching an old show, Amo (2018). I forgot how weird and kinda disturbing it was that the director chose to include irl crime scenes in the intro. As in, you could see the blood and corpses for a few seconds and it’s real. I feel like shows like this, with absolutely realistic graphic violence and sex, should warrant more than a TV-MA rating. I checked the ratings guide and there’s actually a higher rating which is NC17. I’m just wondering how graphic something has to be before it gets bumped up to that.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qgpwdx/amo_2018/"
    },
    {
        "id": "1qgp6pf",
        "author": "Achenar459",
        "title": "Is there a built-in way to tell if all the episodes in a season are available to watch?",
        "content": "Is there any built‑in way on Netflix to see whether a season is fully available, or do I need to check somewhere else—like Google or IMDb—to know if more episodes are still pending?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qgp6pf/is_there_a_builtin_way_to_tell_if_all_the/"
    },
    {
        "id": "1qgmwbi",
        "author": "PracticalMagic3015",
        "title": "Love Through a Prism VA",
        "content": "am I the only one who felt that lead female VA was a massive miscast. Netflix has a huge budget so it’s a bit frustrating when it feels like they hire actors who can’t act. her dub was very robotic and felt like ai reading. I love kit and the professor and Catherine’s va’s but I found myself switching to sub just bc the of her",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qgmwbi/love_through_a_prism_va/"
    },
    {
        "id": "1qgmr4b",
        "author": "friki__fran",
        "title": "What's a series that got discontinued after 1 season that you haven't been able to get over?",
        "content": "Mine is **Giri/Haji** (2019), created by Joe Barton -- *\"Family duty sends a lawman to London to look for his mob-assassin brother as a yakuza war threatens to engulf Tokyo. Trust is even tougher to find.\"*\n\nI enjoyed the complexity of the story and the really great performances from the cast. Very subtle east-meets-west crime drama that had it's raw action moments and more somber moments, as well. Was actually really sad to see such a well-developed crime drama with a stoic lead get cut short.",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qgmr4b/whats_a_series_that_got_discontinued_after_1/"
    },
    {
        "id": "1qgmdxt",
        "author": "MoroccanChristmas",
        "title": "His and Hers - Hot Take (SPOILERS)",
        "content": "\\*SPOLER ALERT\\*\n\nAm I the only one that initially thought Jack might be the killer and he was trying to cover himself? Of course different guesses came along after watching the middle to end of the show, but towards the beginning, more and more hints made me think that Jack had a neurological disorder and was murdering people while he was unconscious.\n\nI thought that maybe he started slowly realizing that more and more evidence was pointing at him, which started Priya's suspicion about Jack (shoe size, swabbing his niece, having Rachel's phone and getting it unlocked, a flashback of Rachel bringing up his wife while in the truck which made him angry, and more), and he started panicking as he realized that he himself was doing all of this.\n\nPerhaps that could have been a pretty interesting plot that still had the same ending twist.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qgmdxt/his_and_hers_hot_take_spoilers/"
    },
    {
        "id": "1qgludu",
        "author": "Remarkable-Bus2362",
        "title": "Netflix preview club pin",
        "content": "So I’ve been a member for a few months, only had a three screenings so far. So those that are members, how does it work for your tv? So far, I’ve only been able to watch the shows on my phone. On the tv it asks for the pin, but no option to send for the pin. It will only do this on my iPhone app. The pin that is sent will only work on the phone, not the TV. Any ideas? I’m not the most technically minded, so am I doing something wrong? \n\nI’m not going to disclose what shows I’ve  previewed or anything as I don’t want to jeopardise my membership, so please don’t ask. Thanks. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qgludu/netflix_preview_club_pin/"
    },
    {
        "id": "1qglran",
        "author": "No_Layer4519",
        "title": "What are some historical shows to watch that have a gothic feel?",
        "content": "I love gothic movies such as nosferatu and frankenstein (surface level, I know.) And i just want to get some recommendations for shows in historical time periods 1700-1800's kind of era that might be scary. Not scary works well too, I will take anything.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qglran/what_are_some_historical_shows_to_watch_that_have/"
    },
    {
        "id": "1qgqzt3",
        "author": "Top-Three-USA",
        "title": "Matt Damon Reveals How Phone-Scrolling Viewers Are Quietly Reshaping Movies at Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qgqzt3/matt_damon_reveals_how_phonescrolling_viewers_are/"
    },
    {
        "id": "1qgksn5",
        "author": "volkivolki",
        "title": "Brigands: The Quest for Gold",
        "content": "There's a song in episode 3 of season 1 of this series, starting at 31.50 minutes. I couldn't find it on Shazam. Does anyone know who the artist is? Thanks.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qgksn5/brigands_the_quest_for_gold/"
    },
    {
        "id": "1qgkl10",
        "author": "shadowhawk720",
        "title": "Cannot get DV to work on my PC",
        "content": "I have been researching this a lot and I cannot for the life of me figure this out. I know DV works on my Apple TV for example but when I try to use something like Netflix on my edge browser from my LG C1, I cannot get DV to work. Netflix shows \"HDR\" as the tag for a show but not DV. I know the show supported DV so I am not sure why my PC cannot enable it. I see standard HDR. I have a 4k120hz cable, I have a 5080 graphics card and I have the LG c1 so I should have everything I need hardware wise. I picked up dolby access and that only shows the audio settings on there. I saw some videos showing people accessing the dolby vision settings there but it does not show up for me in my app. I installed the dolby vision extensions app from the MS store and that did not look like it did anything. Does anyone have any advice or know what is going on here? Any help or direction would be appreciated!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qgkl10/cannot_get_dv_to_work_on_my_pc/"
    },
    {
        "id": "1qf6w3z",
        "author": "Remarkable-Gate-9944",
        "title": "Santa Clarita Diet deserved better. WE deserve better.",
        "content": "I just found out from Reddit that Santa Clarita Diet ended.\n\nNot ‘ended years ago, we all processed it’ ended.\n\nEnded as in I was living my life under the delusion that Sheila Hammond was still somewhere out there, eating bad people and making suburban chaos look fun.\n\nNetflix said - zombies, but make it domestic.\n\nThen said - cool concept, great cast, cliffhanger? Yeah, no. Buhbye. Nailed the coffin shut.\n\nWhat makes it worse is that this show was early to a very specific vibe that’s everywhere now. Dark but cozy, absurd but oddly wholesome. Violent things happening while people argue about mundane nonsense. Basically existential dread with popcorn.\n\nShows like Ghosts are carrying that torch. Dead people. Ridiculous problems. Jokes that are dumb, sharp and self-aware at the same time. The kind of humor that doesn’t try too hard but still sneaks up and punches you in the face. Politely.\n\nI’m convinced this genre works because most of us are tired, mildly unhinged and coping through irony. We don’t want prestige misery. We want chaos that knows it’s chaos. We want death jokes that somehow feel comforting.\n\nAnyway, RIP Santa Clarita Diet. Gone too soon.\n\nTaken from us mid-bite.\n\nNetflix, I forgive a lot, but I will never forgive you for this one. If ever I get bitten, you know who I’m coming for",
        "upvotes": 960,
        "comments": 76,
        "media": null,
        "permalink": "/r/netflix/comments/1qf6w3z/santa_clarita_diet_deserved_better_we_deserve/"
    },
    {
        "id": "1qgii1m",
        "author": "DominickSantoro",
        "title": "Poor Image/Resolution using AppleTV box",
        "content": "I recently purchased a new TV,  doubled my internet speed and (for now) upgraded to the highest Netflix plan in hopes of having a better picture but I was wrong. Only Netflix has this issue where the image fluctuates from HD to a grainy picture. \n\nI believe the AppleTV has the best settings, I also made adjustments in the Netflix website for Profile/Picture and AppleTV is updated \n\nAnyone else experience this? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qgii1m/poor_imageresolution_using_appletv_box/"
    },
    {
        "id": "1qgmqee",
        "author": "arbunckle",
        "title": "How to download Netflix Shows on Windows 11 2026 Update",
        "content": "As of 2026 the old version of the Netflix app will no longer work and is not a viable workaround to get downloaded episodes on a Windows 11 Laptop.\n\nI have found a workaround and have tested it on multiple devices successfully.\n\nI can't find this info anywhere so I will add it here, please consider an upvote if this is helpful so that more people can find it.\n\n**Step 1: Download Bluestacks**\n\nThis is a media player which emulates a Android environment on your laptop, essentially allowing you to treat it like an android phone and thus enabling Netflix downloads. It is free and a relatively easy process.**(Unfortunately to keep it free, Bluestacks will show you a bunch of ads on the home screen and loading pages but they are pretty non invasive and you WON'T have any ads while playing the Netflix App)** Here is the link for a download:\n\n[https://www.bluestacks.com/download.html](https://www.bluestacks.com/download.html)\n\n**Step 2: Download Netlflix on Bluestacks**\n\nYou will need a Google account to do this as you are essentially downloading the app onto a different device via the Google Play Store.\n\n**Step 3: Run Netflix Via Bluestacks**\n\nSimply open Netflix on Bluestacks, login to Netflix, and download shows just like you would on the mobile app. You can the play those shows in full screen, offline, on you Windows 11 Laptop.\n\n**Step 4: Enjoy Your Show Offline**\n\nThat's it, leave a comment with any troubleshooting tips or issues you experience.\n\nDisclaimer: I am not sponsored by or represent Bluestacks in any way, I simply found this by doing research, please make sure you make your own informed decisions.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qgmqee/how_to_download_netflix_shows_on_windows_11_2026/"
    },
    {
        "id": "1qforjn",
        "author": "SecretaryPresent16",
        "title": "His and Hers - opinions and spoilers",
        "content": "Personally I thought this was a fun, quick watch. Was it realistic? No. Was it far-fetched? Absolutely. But I enjoyed it. Entertaining for sure and I appreciated the plot twist no matter how ridiculous it was \n\nBUT There were quite a few plot holes. I can let things go, but the one that really bothered me was WHY WOULD ANNA BE MARRIED TO THE BROTHER OF A GIRL WHO WATCHED AND LAUGHED WHILE SHE GOT RAPED??\n\nSure, Jack was flawed, but an overall good man who loved Anna and definitely went out of his way to protect her, but still, you’d think she’d stay far away from those girls and anyone related to them, let alone marry a sibling. Those girls were just plain evil. And they didn’t even have any remorse. Helen making a comment about her dead child? Zoe giving her the finger and telling her to stop holding a grudge??\n\nI wish there had been some backstory of how she and Jack got together. Anything that would explain how she could possibly be content with Zoe being his sister-in-law. I thought maybe she fell in love with Jack before she knew Zoe was his sister? Or maybe she started dating Jack so she could keep Zoe close and somehow get revenge … but then accidentally fell for him?? Idk. At least some kind of explanation. \n\nAnyway, that is all. ",
        "upvotes": 44,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1qforjn/his_and_hers_opinions_and_spoilers/"
    },
    {
        "id": "1qgd5m7",
        "author": "ShorTmOneyGAines21",
        "title": "House of dynamite triggered my anxiety 😥",
        "content": "Watching this movie, I went through aalll the emotions. And truthfully, that’s what a good movie should do. BUT the ending?!?!?! There was absolutely no solution!! \n\nWhere does that build up energy go?!?! I’m literally shaking in my blanket and it just stops!!??!! Nope, no movie is worth me going through all that. \n\nSO MANY unresolved storylines….ugh. I would rather not have watched it at all.. okay my rant is over 😂 ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qgd5m7/house_of_dynamite_triggered_my_anxiety/"
    },
    {
        "id": "1qfyefn",
        "author": "PhenomenalPhoenix",
        "title": "When I click on a show or a movie it automatically starts playing instead of going to the series info/episode list screen. Does anyone know if there’s a way to change that?",
        "content": "I can go the info screen without an episode starting on the app on my phone but when I’m watching on my tv there’s no way to just go straight to the info screen anymore. It just starts playing the show when I click on it and I have to wait for it to load so I can click on series info from there. I want to know if there’s a way to change that because sometimes I want to see more about a new show without it auto starting or if I exit the episode I’m watching without letting it get far enough through the credits, it’ll start that episode completely over instead of going to the next one. It’s just generally annoying and there doesn’t seem to be any app settings that I can find but I want to know if there’s a way to change it that I’m just missing.",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qfyefn/when_i_click_on_a_show_or_a_movie_it/"
    },
    {
        "id": "1qfv5it",
        "author": "got2bfaster",
        "title": "His &amp; Hers",
        "content": "I had mixed feelings about this show. Just binged watched it and I couldn’t believe those 3 girls would SING AND LAUGH happy birthday WHILE Anna was being SA’d. That was beyond sadistic. \n\nAs f’d up it was to kill them, they deserved everything. \n\nAnd Catherine Alexis (Lexy) was such a b when Anna said a couple times she didn’t know the other girls would bully her let alone the fact Anna STEPPED IN when those trifling men were going to SA HER. she also was a b to kill her sister and then tried to act like she was sad. \n\nThe grandma killing all the girls didn’t make sense logistically esp as she would’ve had footprints in the wood (they found footprints but didn’t see the other set?) and there should’ve been fingerprints SOMEWHERE  but I know they did that so the twist would be such. \n\nAlso, did she walk EVERYWHERE? how the hell she end up at the lake house? It doesn’t seem like that was a commuter friendly town as everyone else drove except her and her timing for being everywhere was impeccable. I knew she could’ve tossed her gown from the first killing but wouldn’t they had found that somewhere along the path to the forest. ",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qfv5it/his_hers/"
    }
]