[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1omc7i6",
        "author": "does_anyone_know_wtf",
        "title": "Netflix asking me if I’m still there- stop it",
        "content": "Sometimes I’ll turn on a show and literally like 20 minutes into it, It’ll ask if I’m still there. Yes, I’m still here and probably will be until I turn the tv off. Wtf is this about and why? Please just let me watch tv in peace without having to continuously tell them. It does not deter me in the SLIGHTEST. I just like background noise. But on a little bit of a creepier note, I’ve noticed just lately that it has popped up right when I walk away from the TV as if it’s watching my movements. Anyone else?",
        "upvotes": 282,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1omc7i6/netflix_asking_me_if_im_still_there_stop_it/"
    },
    {
        "id": "1omwbw9",
        "author": "Repulsive_Knee9258",
        "title": "Controversial but I don’t see the issue with Liam hemsworth as the Witcher",
        "content": "I’m just your average watcher, i don’t make reviews and I watch Netflix here and there in my spare time after work and then get on with my life. So  I just started season 4 of the Witcher and found out Henry Cavill left and Liam hemsworth is now the Witcher and so far so. I’m enjoying the show. Great suspense, great magic and action scenes. It’s decent, it keeps you entertained which is all I’m looking for. But the reviews? The craziest hate load I’ve seen in a while to a cast change. I honestly don’t get the hate, but yeah that’s all im g onna say.",
        "upvotes": 9,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1omwbw9/controversial_but_i_dont_see_the_issue_with_liam/"
    },
    {
        "id": "1omidrk",
        "author": "Miljkomax",
        "title": "Why is Netflix always so dark?",
        "content": "Noticed this earlier this year when I subscribed and watched the SciFi series Dark. Now I'm watching Black Rabbit during the day and all I can see is just fucking dust on my TV. This is literally unwatchable. \n\nThe brightness, contrast and everything else is at it's highest.\nIs there anything I can do to fix this?",
        "upvotes": 42,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1omidrk/why_is_netflix_always_so_dark/"
    },
    {
        "id": "1omywhy",
        "author": "Rannrann123",
        "title": "Looking for good episodic shows",
        "content": "Hey guys, I'm a busy college student who doesn't really have the time to keep up with shows that require you to remember what happened in previous episodes. What are some good episodic shows that I can just watch an episode or two of whenever I find myself with some spare time? Thanks :)",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1omywhy/looking_for_good_episodic_shows/"
    },
    {
        "id": "1omp30y",
        "author": "joe_dirty365",
        "title": "Ran here when I heard The Lady's Companion was cancelled.",
        "content": "This is just a PSA to watch it asap. It is so good I am flabbergasted that it got cancelled. Its hilarious, well written, campy, heartfelt and steamy. Was rooting for all the characters/love interests to work out ha. Sad to hear season 2 wasn't picked up. ",
        "upvotes": 10,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1omp30y/ran_here_when_i_heard_the_ladys_companion_was/"
    },
    {
        "id": "1omlm78",
        "author": "Lopsided_Doubt_3649",
        "title": "Witcher season 4",
        "content": "Well just finished Witcher season 4 and have nothing bad to say about characters. However storyline absolutely garbage did absolutely nothing in terms of any content, Netflix makes you wait years between seasons then gives you nothing for a story. What a absolute waste of time ",
        "upvotes": 14,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1omlm78/witcher_season_4/"
    },
    {
        "id": "1omygj1",
        "author": "vacantexpressions",
        "title": "Halo",
        "content": "I loved this series. The story, the characters, the ships, all of it. What does it take for Netflix to pick up production of a show? I'd really like to see more seasons of this. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1omygj1/halo/"
    },
    {
        "id": "1omn28t",
        "author": "techieyo",
        "title": "Netflix's 2026 anime lineup might be better than Crunchyroll's",
        "content": "Am I crazy or does anyone else see this? What's everyone most excited about?\"",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1omn28t/netflixs_2026_anime_lineup_might_be_better_than/"
    },
    {
        "id": "1ome68t",
        "author": "No-Jaguar-7492",
        "title": "I figured out has to get past the household rule on a tablet or phone without asking for a code!",
        "content": "Ok so basically if you enter the app in airplane mode or without WiFi and it takes you to your downloads. After your in that area just pick the home button in the left hand corner. From there you just turn your device’s WiFi back on and boom in three steps you got Netflix without having to bug your family for the entrance code every 5 minutes!\n\n\nDisclaimer: I did this on an IPad and my IPhone but I’m not sure it will work for all devices. I haven’t tried this method on a pc yet or by using just the plane website Netflix but I doubt it would work there. I also don’t know if it work on non-apple devices but it’s worth a shot. Hope someone found this helpful!\n",
        "upvotes": 17,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ome68t/i_figured_out_has_to_get_past_the_household_rule/"
    },
    {
        "id": "1omqvcj",
        "author": "Top-Three-USA",
        "title": "Rei Ami Says She’s “Waiting for the Call” from Netflix as ‘KPop Demon Hunters’ Becomes Record-Breaking Hit",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1omqvcj/rei_ami_says_shes_waiting_for_the_call_from/"
    },
    {
        "id": "1omif78",
        "author": "BeautifulReaction222",
        "title": "Mr. Robot Series",
        "content": "I’m JUST coming across this in November 2025! I know, I know,  I’m late but is anyone else watching currently? Or willing to rewatch with me? I have no one to talk to about this show and I’m only EPISODE 1 deep 😫",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1omif78/mr_robot_series/"
    },
    {
        "id": "1omyejl",
        "author": "xllaull2211",
        "title": "Watched “The life list”",
        "content": "I watched the life list recently, what does everyone think about it?\n\nMore importantly, has anyone been inspired to make their own life list as well? What have you included in it? \n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1omyejl/watched_the_life_list/"
    },
    {
        "id": "1omp1y8",
        "author": "Ok_Wedding_640",
        "title": "Something strange happens while I'm watching Star Trek",
        "content": "I'm watching Star Trek: The Next Generation. I'm watching it in Spanish for obvious reasons, then suddenly the audio randomly switches to English and then back to Spanish. Is this a dubbing error or is this how the original series is? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1omp1y8/something_strange_happens_while_im_watching_star/"
    },
    {
        "id": "1olrq6q",
        "author": "RealAccount2024",
        "title": "I don’t mind the ads on Netflix but…",
        "content": "why do they have to be so loud?\n\nLiterally the last ad break I had at least doubled the decibel level. \n\nI get they want you to pay attention to them but that’s some gorilla tactics. ",
        "upvotes": 84,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1olrq6q/i_dont_mind_the_ads_on_netflix_but/"
    },
    {
        "id": "1omikgu",
        "author": "Arch_ies",
        "title": "Netflix app on iPhone says I’m not connected to the internet, but everything else works fine",
        "content": "Hey, I’m having a weird issue with Netflix on my iPhone.\nWhen I open the app, it says I can’t connect to the internet — but I am connected. Other apps and browsers work perfectly fine on the same Wi-Fi.\n\nI already tried:\n\t•\trestarting my phone and the app\n\t•\treconnecting to Wi-Fi\n\t•\tlogging out and back in\n\nThere’s no error code, just a message saying it can’t connect.\nAny ideas what could cause this or how to fix it?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1omikgu/netflix_app_on_iphone_says_im_not_connected_to/"
    },
    {
        "id": "1omn186",
        "author": "GabrieleVassallo00",
        "title": "How can One Hundred Years of Solitude only have another 8 episodes season???",
        "content": "This question is for the ones who also read the book, so they already know the remainder of the story (but is spoiler-free).  \nSo, up until now the series was very accurate to the book I believe. Point is, the point it reached isn't even half the book's story, and everywhere I look it seems it was already decided that the whole story would be adapted in a total of 16 episodes. \n\nHow are they gonna keep up the narration rhythm, strength and accuracy that combined characterized the first season? \n\nI don't know, it seems to me there's too much material to cover yet without losing on at least one of these aspects!\n\nLet me know what you think, maybe I'm wrong",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1omn186/how_can_one_hundred_years_of_solitude_only_have/"
    },
    {
        "id": "1omh5vt",
        "author": "Specialist-Change-86",
        "title": "For the fans of medical dramas",
        "content": "[https://www.soapcentral.com/shows/breathless-season-2-cast-character-guide-who-plays-netflix-drama-s-latest-chapter](https://www.soapcentral.com/shows/breathless-season-2-cast-character-guide-who-plays-netflix-drama-s-latest-chapter)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1omh5vt/for_the_fans_of_medical_dramas/"
    },
    {
        "id": "1om55n2",
        "author": "pnyluv16",
        "title": "Ballad of a Small Player",
        "content": "I just wanted to say that I really enjoyed this movie. I’m not a very “artsy” or whatever person, but some of the visuals/shots were just so pretty. Colin Farrell was great, too ",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1om55n2/ballad_of_a_small_player/"
    },
    {
        "id": "1omfggf",
        "author": "Hairy-Mess-2764",
        "title": "Best series with a 90's vibe?",
        "content": "A serie like Monsters; The Menandez brothers or even Dahmer, or the Pepsi documentary but also Dexter: Original Sin has the 90's vibe what I really like. The fashion, the music, the brands, etc.\nWhat would be your recommendations for shows that have this?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1omfggf/best_series_with_a_90s_vibe/"
    },
    {
        "id": "1om8047",
        "author": "Delusional_Rose444",
        "title": "Im watching \"Bet\" on Netflix (spoilers)",
        "content": "Just started the latest episode of Bet on Netflix and I can’t shake this feeling — if Michael’s dad really killed Yumeko’s parents, I need her to get revenge. 😤 The tension and setup are unreal so far. Anyone else getting the same vibe or think there’s more to it?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1om8047/im_watching_bet_on_netflix_spoilers/"
    },
    {
        "id": "1omw7iu",
        "author": "Cutespatoot",
        "title": "Death Becomes Her reboot!",
        "content": "Cmon Netflix!  Someone do it!  Idk who I would cast.  I feel like in its day, the graphics were good but just imagine what they could do now?  Let’s have this discussion below….",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1omw7iu/death_becomes_her_reboot/"
    },
    {
        "id": "1olf332",
        "author": "whatchagonnadoelbert",
        "title": "Netflix \"leaking\" my wife's viewing behavior into my profile",
        "content": "My wife and I have our own separate profiles.  I am the account holder, FWIW.  My wife watches a LOT of K-dramas.  I watch no K-dramas.  I watch no Asian-based content.  A lot of the stuff my watches from her profile end up as suggestions and \"watch next\" on my profile, and this HEAVILY skews what Netflix thinks I'm interested in. \n\nHas anyone else experienced this and actually convinced someone at Netflix to do something about it?  The one agent I spoke to several months ago said, \"Oh, your wife must be watching K-dramas using your profile.\"  He refused to believe that there could be a problem with Netflix's system.  I've seen my wife use Netflix and she is always using her profile.",
        "upvotes": 285,
        "comments": 81,
        "media": null,
        "permalink": "/r/netflix/comments/1olf332/netflix_leaking_my_wifes_viewing_behavior_into_my/"
    },
    {
        "id": "1omd7n3",
        "author": "xKqda",
        "title": "Need help with 4k Viewing on Desktop",
        "content": "I have been at this for many many many hours. I can not for the life of me get Netflix to view in 4k HDR. I am using my brand new, got today, ROG SWIFT PG27UDM.  \nThis is what I've tried.  \nISO Re-Install of Windows 11  \nedge://flags to ensure the right DMR settings  \nUsing Edge and Netflix App.  \nDisabling my second monitor that's not 4k.  \nUsing display port 1.4 and HDMI 2.1  \nEnsuring Nvidia shows HDCP-capable status  \nDownloaded the 99c HEVC Codec (paywall codec lol)  \nCheck and made sure youtube was able to display 4k hdr on Edge, it was.  \nI contacted both windows support, which they tried to help. And netflix support, which did nothing but copy paste the FAQ then tell me i had a bad cable...  \nLooking for some help!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1omd7n3/need_help_with_4k_viewing_on_desktop/"
    },
    {
        "id": "1olx28j",
        "author": "Nervous-Cry1817",
        "title": "Help finding a good telenovela style show",
        "content": "Hey everyone!\n\nI’m trying to find a new show to binge and could use some recommendations.  \n\nI’m in my 20s and love series like Jane the Virgin (100/10), Modern Family (9/10), Friends, Desperate housewives (&amp; devious maids), and Pretty Little Liars (10/10), Riverdale (although I didn’t love it).\n\nBasically I like something fun, a bit dramatic, and character-driven ideally with friendship, romance, or mystery mixed in (bonus points if it’s slightly chaotic or has those telenovela-style twists). Really can’t find another good show ideally like Jane the Virgin.\n\nAny ideas for newer (2024/5) or underrated shows that fit that vibe?\n\nThanks in advance!",
        "upvotes": 13,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1olx28j/help_finding_a_good_telenovela_style_show/"
    },
    {
        "id": "1olr9yw",
        "author": "Ok_Process2503",
        "title": "Annoying Episode Releases",
        "content": "Anyone else frustrated with Netflix adding more and more slow release content? \n\nThey add the episodes slowly and only say the amount of episodes that are up already. For example, at first, Love in the Clouds said it only had 22 episodes, when really there are now 36 episodes. Further, the last episode is scheduled to come out today but it’s not out yet (it’s already about noon ET) and I’m not sure what time of day it will be out.\n\nIt feels like they are just messing with us now 😑",
        "upvotes": 18,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1olr9yw/annoying_episode_releases/"
    },
    {
        "id": "1oljr8m",
        "author": "Cxinthechatnow",
        "title": "After watching a House of Dynamite, I realized the guys carrying the nuclear football probably have one of the most boring jobs in the world",
        "content": "Think about it — you’re probably a high-ranking officer, one of the best of the best, trusted enough to literally follow the president everywhere with a bag that could end the world.\n\nAnd then… nothing ever happens.\n\nDay after day, year after year, you just carry this mysterious briefcase around, always on alert but never actually doing anything. You train for the most extreme scenario imaginable, but your actual job is to wait.\n\nIt’s like being on the world’s most stressful standby mode. You’re part of history, but your daily life is probably just… walking, standing, and waiting for something that hopefully never happens.\n\nKinda wild when you think about it.",
        "upvotes": 42,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1oljr8m/after_watching_a_house_of_dynamite_i_realized_the/"
    },
    {
        "id": "1om8uoy",
        "author": "DoughMyNuts",
        "title": "Doi Doi Doi",
        "content": "I'm at a loss. This is an official category? I'd attach a pic for proof, but it looks like this sub doesn't allow them anymore. How does a random meme describe an array of shows and movies spanning two decades? Like I can't imagine recommending a 2006 movie for its \"Hawk Tuah\" vibes.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1om8uoy/doi_doi_doi/"
    },
    {
        "id": "1om8qm4",
        "author": "oblc",
        "title": "Screen Keeps Flickering Netflix (Windows App) And Browser (Edge)",
        "content": "Been wanting to fix my shows from being blurry so I recently turned on HDR video streaming on my laptop to see if it fixes and it turned out to much better quality. But I realized my screen started to unusually flicker.\n\nI turned off graphics acceleration on edge and the flickering stopped on both but went back to it being blurry...\n\nIs there a way to keep the video quality high quality without any problems?  \n  \n**Note:** I'm using an Dell Inspiron 15 3520 laptop and have everything updated.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1om8qm4/screen_keeps_flickering_netflix_windows_app_and/"
    }
]