[
    {
        "id": "1ltq8c0",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 19,
        "comments": 3272,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ltq8c0/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1lvu0p4",
        "author": "scoreboard-app",
        "title": "Post Match Thread: Real Madrid vs PSG, CWC Semifinal ",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1lvu0p4)",
        "upvotes": 210,
        "comments": 1728,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lvu0p4/post_match_thread_real_madrid_vs_psg_cwc_semifinal/"
    },
    {
        "id": "1lwgh8u",
        "author": "OmarEhab10",
        "title": "Enrique knew Mbappe's problem. Now we have to players behaving this way, him and Vini. Xabi's most important mission is forcing these two to start putting the team first and start pressing like their lives depend on it. All dominant teams play that way now. The times for one man teams are over.",
        "content": "",
        "upvotes": 1095,
        "comments": 168,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o3s5bedtk2cf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lwgh8u/enrique_knew_mbappes_problem_now_we_have_to/"
    },
    {
        "id": "1lwj3pw",
        "author": "Radbevto",
        "title": "[Transfermarkt] Federico Valverde finishes the season with the most games and minutes in Europe, for club and country",
        "content": "",
        "upvotes": 702,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yh6cfvad33cf1.png?auto=webp&amp;s=1d7d25cd828ffdeab8f028cfb6b9386a98112e6a"
        },
        "permalink": "/r/realmadrid/comments/1lwj3pw/transfermarkt_federico_valverde_finishes_the/"
    },
    {
        "id": "1lwafb7",
        "author": "Real_Colinio",
        "title": "Vini horrible pass from a corner",
        "content": "",
        "upvotes": 2127,
        "comments": 283,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dws6opog91cf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lwafb7/vini_horrible_pass_from_a_corner/"
    },
    {
        "id": "1lwmna0",
        "author": "TimothyX7",
        "title": "🚨💣 EXCL: Álvaro Carreras to Real Madrid, here we go! Verbal agreement in place between Real and Benfica. Real negotiated to pay €50m in multiple installments instead of one-payment clause.",
        "content": "",
        "upvotes": 398,
        "comments": 84,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VCKqLtC5lZ1VRz0fBK1mYIfM3DM_kQPaONGEdLxM4EY.jpg?auto=webp&amp;s=d4cbec0beeed3b9f8480430bbb292f05d91eade5"
        },
        "permalink": "/r/realmadrid/comments/1lwmna0/excl_álvaro_carreras_to_real_madrid_here_we_go/"
    },
    {
        "id": "1lweckd",
        "author": "Lost_Amoeba_3897",
        "title": "Vini and Mbappe need to learn how to press from Dembele.",
        "content": "Look at how eagerly Dembélé and Doué are ready to press. Our forwards, on the other hand, look like they’re on vacation at the sidelines. The difference in mentality is stark. If Mbappé and Vini don’t want to press, then honestly, they should be dropped — it doesn’t matter if you score 45 goals, only to be a liability in defense.",
        "upvotes": 931,
        "comments": 84,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ml06cqhx52cf1.jpeg?auto=webp&amp;s=5f3d77e995253e33f07e1ce0c4c9efea1c384201"
        },
        "permalink": "/r/realmadrid/comments/1lweckd/vini_and_mbappe_need_to_learn_how_to_press_from/"
    },
    {
        "id": "1lwmb6o",
        "author": "tomaa25",
        "title": "Highlights from yesterday",
        "content": "",
        "upvotes": 340,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g3q1x2gup3cf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lwmb6o/highlights_from_yesterday/"
    },
    {
        "id": "1lwg1ld",
        "author": "AestheticEvan23",
        "title": "Oh brother peep this pressing",
        "content": "",
        "upvotes": 354,
        "comments": 87,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/eqr0d3zzh2cf1/DASH_270.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lwg1ld/oh_brother_peep_this_pressing/"
    },
    {
        "id": "1lwnznr",
        "author": "xggq",
        "title": "Modric and Alonso reaction to 3-0",
        "content": "",
        "upvotes": 126,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/k6y0tkuk04cf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lwnznr/modric_and_alonso_reaction_to_30/"
    },
    {
        "id": "1lwq5zs",
        "author": "DoriOli",
        "title": "How it used to go down back in the day 🤍",
        "content": "",
        "upvotes": 76,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/gk82udreh4cf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lwq5zs/how_it_used_to_go_down_back_in_the_day/"
    },
    {
        "id": "1lwe7kp",
        "author": "X_KAV007",
        "title": "7 years ago today...",
        "content": "On 10th July 2018, exactly 7 years ago, Real Madrid announced the shocking departure of Cristiano Ronaldo to Juventus for £99.2 million. It marked the end of an era—Ronaldo, the club’s all-time top scorer, had been the face of Los Blancos' golden age. His exit triggered a slow unraveling of that dominant era, as Madrid struggled to fill the void left by their talisman.\n\n",
        "upvotes": 272,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rlultgmx42cf1.jpeg?auto=webp&amp;s=07adaf9391d70425b192fcab5f762391f9cbd89e"
        },
        "permalink": "/r/realmadrid/comments/1lwe7kp/7_years_ago_today/"
    },
    {
        "id": "1lw8h11",
        "author": "FearlessWasFounded",
        "title": "7 years ago, an official statement that was buzzing around the world; \" Real Madrid CF communicates that, in response to the will and request expressed by the player Cristiano Ronaldo, it has agreed to transfer him to Juventus FC. \"",
        "content": "",
        "upvotes": 627,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9ijuk6ffo0cf1.png?auto=webp&amp;s=ac3476e4dbdc3fbcea45df848e1bd3997b201d2a"
        },
        "permalink": "/r/realmadrid/comments/1lw8h11/7_years_ago_an_official_statement_that_was/"
    },
    {
        "id": "1lwqz1r",
        "author": "tefftlon",
        "title": "Militao looked good!",
        "content": "Lost in the reactions of the loss, Militao looked good!\n\nIt has felt like people forgot he was a good defender before his injuries. \n\nIf Huijsen is CB1 and Rudiger and Militao are competing for CB2, then that's a good spot for us to be in.\n\nNow if another CB is added like rumores, CB can go from a weakness last season to a strength this one!",
        "upvotes": 45,
        "comments": 21,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lwqz1r/militao_looked_good/"
    },
    {
        "id": "1lwec7v",
        "author": "Saleh67",
        "title": "How does it feel right now",
        "content": "",
        "upvotes": 217,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3f037mpu52cf1.png?auto=webp&amp;s=e824f5517d59758177dc2e8f71e9af161e7b1a2a"
        },
        "permalink": "/r/realmadrid/comments/1lwec7v/how_does_it_feel_right_now/"
    },
    {
        "id": "1lwd5rk",
        "author": "Messmers",
        "title": "[ge.globo] Despite the lack of opportunities, Rodrygo currently prefers to stay. What is certain now is that any decision to open the door for a departure will not come from Rodrygo as he wants to compete for his place at least until the end of 2025.",
        "content": "",
        "upvotes": 215,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4UQYNesOGq1wbyhDDzb_oYwm_X39BnitDdTHCpI7DW0.jpeg?auto=webp&amp;s=7d7f5d050990850c4cc0294e3472147169ff0ca4"
        },
        "permalink": "/r/realmadrid/comments/1lwd5rk/geglobo_despite_the_lack_of_opportunities_rodrygo/"
    },
    {
        "id": "1lwpv6w",
        "author": "Emergency-Hornet-594",
        "title": "This one is really funny. Shoutout to Novaxfootball for the reel.",
        "content": "If real madrid had a groupchat. Endrick one is the funniest shit, and bellingo one is top tier. Also, fear well LUCAS and MODRIC. \n.\n.\n.\n.\n.\n.\n.\n.\n If real madrid had a groupchat. Endrick one is the funniest shit, and bellingo one is top tier. Also, fear well LUCAS and MODRIC. \n \nIf real madrid had a groupchat. Endrick one is the funniest shit, and bellingo one is top tier. Also, fear well LUCAS and MODRIC. ",
        "upvotes": 43,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/48s0l1mbf4cf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lwpv6w/this_one_is_really_funny_shoutout_to/"
    },
    {
        "id": "1lwjlm4",
        "author": "ace-s",
        "title": "I'd rather have us keep Rodrygo and sell Vini",
        "content": "I honestly think that Rodrygo fits Xabi's philosophy more than Vini. \n\n  \nWe have seen how much of a beast he is on LW. He is also a better passer than Vini, he is also a better presser than vini.\n\nIt's clear that Rodrygo has request to be considered as a LW for the next season and does not want to be played out of position, this is probably why we did not see Rodrygo get minutes in the CWC. \n\nLooking at how muhc Vini's form dipped this year, I don't think think he is even a top 3 winger in the world at the moment. I dont think he is even a top 3 winger in PSG.\n\n  \n",
        "upvotes": 79,
        "comments": 120,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lwjlm4/id_rather_have_us_keep_rodrygo_and_sell_vini/"
    },
    {
        "id": "1lwcwhp",
        "author": "Messmers",
        "title": "Most defensive pressures applied by Madrid players at CWC 2025",
        "content": "",
        "upvotes": 155,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/e59wqvi0v1cf1.jpeg?auto=webp&amp;s=dd6cac4af965cd151ab2bc784165dbba5c1ab45f"
        },
        "permalink": "/r/realmadrid/comments/1lwcwhp/most_defensive_pressures_applied_by_madrid/"
    },
    {
        "id": "1lvtrio",
        "author": "imperador_passado14",
        "title": "2012/2025 Goodbye Luka",
        "content": "Titles:\n    LaLiga - 4x (2016-17, 2019-20, 2021-22 and 2023-24)\n    Copa del Rey - 2x (2013-14 and 2022-23)\n    Spanish Super Cup - 5x (2012, 2017, 2020, 2022 and 2024)\n    Champions League - 6x (2013-14, 2015-16, 2016-17, 2017-18, 2021-22 and 2023-24)\n    UEFA Super Cup - 5x (2014, 2016, 2017, 2022 and 2024)\n    FIFA Intercontinental Cup - 6x (2014, 2016, 2017, 2018, 2022 and 2024)\n\n",
        "upvotes": 3078,
        "comments": 68,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lvtrio/20122025_goodbye_luka/"
    },
    {
        "id": "1lwer11",
        "author": "Different_Craft5237",
        "title": "Xabi's biggest challenge will be to bring back that DOG mentality we were so renowned for.",
        "content": "Tactically, I'm not worried one bit. Looking at PSG as an example, this is the same PSG which finished 15th, losing to Atletico, Bayern, Arsenal, drawing to fucking PSV. They were sitting below 24th spot a some point even. Fast forward to now, they are the best collective in the world, destroying teams left right and center. So, for us, it might take some time obviously, for Xabi to try things. Some might fail, we might even need a few more signings, but eventually, Xabi will have this team playing exactly the way he wants and it will be amazing. \n\nBut to me, his biggest challenge will be to bring us back to being the mentality monsters we were always praised for in the last 10 years or so. Last season up till now, this team seems absolutely lost the moment we concede 2 goals. Barcelona, Arsenal, PSG, etc, like clockwork. And it's not a Carlo thing, since the '22 was literally won on the backs of remontadas and '24 we were the most solid team in Europe with 2 losses all season. And it's not like we bought a fresh new team either, most of the guys who were there then, but n ow, they seem to almost click off the moment we go 2 goal down.\n\nThis is the thing Mourinho managed to instill in our squad from 2010 to 2013. That \"Never say die\" spirit. Which was then carried on by our core players, CR7, Benz, Modric, Kroos, Case, Carvajal. We might not win the game, but we'll make sure the team suffers and holds on for dear life until the final whistle. When a team took a 1-2 goal advantage, people would say they were lucky Madrid didn't comeback. Now, the moment we concede twice, might as well turn off the TV cause the rest of the game is gonna consist of us trying to survive not conceding more instead trying an actual comeback.\n\nI don't know how we went from mentality monsters for a decade straight, to wtv this garbage is right now in the span of a single year. We practically switched places with Barcelona at this point, cause the past season they managed to reverse god knows how many 2 goal deficits, including against us.\n\nWhat people called \"individual brilliance\" was actually not quite that. Just a collective understanding from a group of elite players telling each other \"WE'RE NOT LOSING TODAY, SO WE FIGHT TILL THE END, TOGETHER\". So yes, in my opinion, this will be the biggest challenge and probably the one which will determine if Xabi wins major trophies for us or not. Cause yes, there will be games where things go sideways. But what always made us special was the fact we ALWAYS reacted and put up one hell of a fight, till the final whistle. ",
        "upvotes": 97,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lwer11/xabis_biggest_challenge_will_be_to_bring_back/"
    },
    {
        "id": "1lw7k0b",
        "author": "Top-Pepper-3025",
        "title": "The Overreaction to PSG Loss Is Getting Out of Hand",
        "content": "People seriously need to calm down about this loss.\n\nYes, losing 4-0 to PSG hurts, but the overreactions are getting out of control. I’ve seen people say Mbappé is the worst signing we’ve made in the last years. Really? The same Mbappé who’s had a goal or assist in every final since he joined? The same player who was basically carrying us in every El Clásico? Without him, some of those games would’ve looked like 4-0 or 5-1 defeats. Even against City in the second leg, he was the only one who showed up and scored.\n\nAnd now people are turning on Arda Güler too, saying he can’t start against top teams. This guy started five games during the Club World Cup and looked sharp. In this PSG game, he was thrown into a midfield where he was completely isolated. Bellingham couldn’t do much either, and Valverde was played as a right-back. What exactly was Güler supposed to do?\n\nSame with Gonzalo García. He played against arguably the best team in the world right now, in a side that’s still finding itself. And people are already calling him not good enough? It’s been a handful of games.\n\nThen there’s Tchouaméni. Suddenly he “can’t perform against top teams”? That makes no sense. The real issue wasn’t the midfield or the attack — it was the defense. All four defenders had an off-day. Simple as that. We conceded goals through errors you’d expect from Sunday league players.\n\nXabi Alonso’s only been working with this squad for five games. Five. He was basically using last season’s team, without his new signings. What exactly are people expecting? Miracles?\n\nThis is the best PSG team ever. This club is in their prime. No one’s been able to touch them. And yet some fans are acting like this one result erases everything we’ve done and all the potential this team still has.",
        "upvotes": 279,
        "comments": 118,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lw7k0b/the_overreaction_to_psg_loss_is_getting_out_of/"
    },
    {
        "id": "1lwqwju",
        "author": "Max01170117",
        "title": "Endrick suffering another injury.",
        "content": "Endrick has suffered a relapse of the muscle injury he sustained in May and is expected to be sidelined for weeks.  \nTrent will undergo tests in Madrid to see the extent of the muscular problem he felt in his right leg.",
        "upvotes": 17,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6MP5NqhUMajz_8Cm95tdQdD1du8024d2GDY2mzJDpK0.jpeg?auto=webp&amp;s=382f625d0a4c1ca58e83cc9356367c39f93342b2"
        },
        "permalink": "/r/realmadrid/comments/1lwqwju/endrick_suffering_another_injury/"
    },
    {
        "id": "1lw7dua",
        "author": "Ready_Ad_1353",
        "title": "Luka Modrić to AC Milan, here we go confirmed! Exclusive story from June and deal now in place for Croatian midfielder. Modrić counter signed one year contract at AC Milan valid until June 2026, arriving after Club World Cup as planned. Deal confirmed.",
        "content": "",
        "upvotes": 235,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NW1X5UVkzss2g58gq3uT464jCghj4flyhXSdxZhR2JA.jpg?auto=webp&amp;s=97ce7619c2428fded14359f95f8d990e9cd31d6c"
        },
        "permalink": "/r/realmadrid/comments/1lw7dua/luka_modrić_to_ac_milan_here_we_go_confirmed/"
    },
    {
        "id": "1lvyejq",
        "author": "AdVaanced77",
        "title": "Asencio and Rüdiger mistakes",
        "content": "",
        "upvotes": 919,
        "comments": 221,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2txq9guhtxbf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lvyejq/asencio_and_rüdiger_mistakes/"
    },
    {
        "id": "1lw3fcr",
        "author": "Aggravating_Sport495",
        "title": "Why I think the 4-0 loss to PSG is a good thing (hear me out)",
        "content": "Yesterday’s 4-0 defeat to PSG was painful, no doubt. But honestly I think this loss might actually help us in the long run.\n\nThis game clearly exposed some of our weak spots  especially in defense and up front. I hope this pushes the club to fully utilize the transfer window. We need proper reinforcements not just backups, but solid starters.\n\nYes, we’ve got Vini and Mbappé, but let's be real: they’re not center-forwards. They thrive as wingers. Sure, Mbappé scored tons last season, but when did those goals come? Against who? When it mattered most  vs Liverpool,  Arsenal, and nowPSG  he went missing.\n\nDid you notice yesterday how PSG’s attackers pressed our keeper and center-backs constantly? Meanwhile, our front three were waiting for quick counters  but to counter, you need the ball first. PSG controlled possession and suffocated our build-up.\n\nThis isn’t about blaming individuals. The CB error? It happens. But the overall system looked off  (not xabi's fault) and that’s why I’m hoping the club realizes we need a true striker, more depth in defense, and maybe a few others with the hunger to fight in games like these.\n\nJust my take. I know some may disagree  and that’s totally fair. I just love this club and want us to improve from here.\n\nHala Madrid. 🤍",
        "upvotes": 361,
        "comments": 177,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lw3fcr/why_i_think_the_40_loss_to_psg_is_a_good_thing/"
    },
    {
        "id": "1lwh30d",
        "author": "More-Judgment-9253",
        "title": "Let's talk about something that I consider to be even worse than the lack of pressing: Not trying to win the ball after losing it",
        "content": "There's absolutely NO excuse for vini and mbappe to be losing the ball and then leaving the rest of the team to fend for themselves and just hope that they win it back and pass it to them for a counter attack. Mbappe is literally the FASTEST man on the pitch, if he was to track back and recover the ball after losing it, things would be perfect. This attitude from both of them is genuinely unbelievable to me, it literally makes no sense,they can't keep doing this. Also vini does actually defend sometimes but he's not consistent with it so I don't care anymore",
        "upvotes": 41,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lwh30d/lets_talk_about_something_that_i_consider_to_be/"
    },
    {
        "id": "1lvx4tv",
        "author": "Kick1O1",
        "title": "🤍 Lucas Vázquez leaves Real Madrid and he’s set for next move as free agent. Legend of the club.",
        "content": "",
        "upvotes": 742,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yCEskG7UcEqWa-kIzv7TXEpSsYwQ3WXxfZVsfac4SEY.jpg?auto=webp&amp;s=e707f03e5c907241b05bdfb76e40322d0c9ba9f3"
        },
        "permalink": "/r/realmadrid/comments/1lvx4tv/lucas_vázquez_leaves_real_madrid_and_hes_set_for/"
    },
    {
        "id": "1lwqw0q",
        "author": "Ok-Breakfast-1305",
        "title": "What's your signing for the club?",
        "content": "If you could pick any current player in the world, who would be your dream signing for the team? Personally, as a Swede, I would love to see Alexander Isak play for us. He has La Liga experience from his days at Real Sociedad, and he can play multiple roles in attack. Despite his height, he is very good on the ball, and his passing is highly underrated. It would be challenging to fit him into the current squad, but with potential future outgoings, who knows?",
        "upvotes": 8,
        "comments": 36,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lwqw0q/whats_your_signing_for_the_club/"
    },
    {
        "id": "1lwtkf1",
        "author": "Messmers",
        "title": "[The Athletic] Endrick has suffered a relapse of his hamstring injury and will be out for several more weeks.",
        "content": "",
        "upvotes": 6,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6MP5NqhUMajz_8Cm95tdQdD1du8024d2GDY2mzJDpK0.jpeg?auto=webp&amp;s=382f625d0a4c1ca58e83cc9356367c39f93342b2"
        },
        "permalink": "/r/realmadrid/comments/1lwtkf1/the_athletic_endrick_has_suffered_a_relapse_of/"
    },
    {
        "id": "1lwdqyy",
        "author": "Warandlife07",
        "title": "The reactions to the PSG game are hilarious, and vastly disappointing.",
        "content": "First, I am not happy about the result, but everyone needs to calm down. Pundits included. The fact that people are calling for everything to get thrown away is mind numbingly crazy. \n\nHere are the facts, PSG just came off a DOMINANT UCL run. RM implemented a new coach and System last month. Does RM have world class players yes, absolutely. Does RM need to do better? ABSOLUTELY!!! But idk can we see what the team looks like after 1 month? Can we see what they look like with players that actually play the position they are in? \n\nHere is what we know, Mbappe got his first start in the new system against the best team in the world. The young players (Garcia, Asensio, Arda) finally had growing pains against Prime competition and showed their age. Fede is a top 3 player itw as a CM, but maybe he shouldn’t be playing against the best front 3 as a RB. 2 mistakes in the first 7 minutes changed the game immensely. Also, RM was missing key players, but players that were coming off major injuries, showed their class.\n\nTranquilo, RM are coming, and anyone who doubts that needs to go watch baseball.",
        "upvotes": 39,
        "comments": 92,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lwdqyy/the_reactions_to_the_psg_game_are_hilarious_and/"
    },
    {
        "id": "1lwuptk",
        "author": "Messmers",
        "title": "Modric giving Arda his jersey and hugging each other goodbye",
        "content": "",
        "upvotes": 4,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6njamxtyi5cf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lwuptk/modric_giving_arda_his_jersey_and_hugging_each/"
    }
]