[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 43,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q8c7eq",
        "author": "GiveMeSomeSunshine3",
        "title": "‘Black Mirror’ Renewed For Season 8 At Netflix",
        "content": "",
        "upvotes": 81,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1q8c7eq/black_mirror_renewed_for_season_8_at_netflix/"
    },
    {
        "id": "1q7orjz",
        "author": "Similar_Diver9558",
        "title": "‘Stranger Things’ Fans Crashed Netflix Looking For An Alternate Finale—But It Doesn't Exist",
        "content": "",
        "upvotes": 1364,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1q7orjz/stranger_things_fans_crashed_netflix_looking_for/"
    },
    {
        "id": "1q89b3m",
        "author": "TheShyBuck",
        "title": "Are there more Korean shows on Netflix in the Middle East and North Africa than on Netflix in America or Europe? does Netflix in America have more Western shows?",
        "content": "I am from the Middle East\n\nWhen the president Yoon met the CEO of Netflix nearly 2 years ago, the Korean president called for increased investment in Korean shows (billions)\n\nand since that day nearly all that I see on Netflix are Korean shows added every week. I can't find enough American and European shows to watch on Netflix,\n\nUnfortunately most streaming services are not available in my country except for Amazon Prime and Netflix\n\nand no I never watched Korean shows on Netflix before so it is not the algorithms",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q89b3m/are_there_more_korean_shows_on_netflix_in_the/"
    },
    {
        "id": "1q832jb",
        "author": "Economy-Specialist38",
        "title": "Netflix co-CEO says he doesn’t read business books—at all. Instead, he reads one 1902 fiction about a ship and its reckless ‘hot dog’ captain over and over again",
        "content": "",
        "upvotes": 15,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q832jb/netflix_coceo_says_he_doesnt_read_business/"
    },
    {
        "id": "1q84on1",
        "author": "Wonderful_Nebula_802",
        "title": "Just finished watching Animal Kingdom.",
        "content": "What a brilliant series!!! \nI think I might watch it again! \nI loved Pope. Any one else have a favourite?  \nAny recommendations for a series that’s just as good?  \n",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1q84on1/just_finished_watching_animal_kingdom/"
    },
    {
        "id": "1q7vgvo",
        "author": "Gordonica",
        "title": "Harlan Coben? why not Janet Evanovich?",
        "content": "I see all the Harlan Coben stories made into Netflix series. I would like to see a series based on Janet Evanivich's novels about the female bondsman. One movie was made with the woman from greys anatomy and it was great. And only one VI Warshovski movie was ever made with Kathleen Turner (it was great). Anyone else?\n",
        "upvotes": 29,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1q7vgvo/harlan_coben_why_not_janet_evanovich/"
    },
    {
        "id": "1q7yxx1",
        "author": "stellacampus",
        "title": "The recent Stephen King series are worth watching.",
        "content": "Both 11-22-63 and Castle rock are worth a watch.  11-22-63 is very well made and a must for time travel fans. It's just a well told story. I also recommend the book for readers. Castle Rock is also a good watch.  I think the first season is more interesting and the second season is more entertaining - ultimately they come together as a full story. Both are executive produced by Stephen King and J.J. Abrams.",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1q7yxx1/the_recent_stephen_king_series_are_worth_watching/"
    },
    {
        "id": "1q7zlmt",
        "author": "LilNello1",
        "title": "His &amp; Hers",
        "content": "So just finished watching this new miniseries, and wow I must say had me on the edge of my seat.  So good and makes me want to read the book now too.  So without giving away too many spoilers for those who have seen it.  What is everyone’s else’s thoughts and on why you did or didn’t like it?",
        "upvotes": 10,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1q7zlmt/his_hers/"
    },
    {
        "id": "1q81whh",
        "author": "harpreetthind",
        "title": "Need recommendation for movies on Netflix",
        "content": "Just got done watching Stranger Things what else does everybody recommend watching? Want something similar to Stranger Things if possible thanks for the recommendations.",
        "upvotes": 7,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1q81whh/need_recommendation_for_movies_on_netflix/"
    },
    {
        "id": "1q8ckzd",
        "author": "Emergency_Air4575",
        "title": "Netflix gets one more month.",
        "content": "Netflix, you did it again. You pulled me into another show. RUN AWAY starts a bit slow, but the final three episodes are intense, especially the last one. Alright Netflix, you’ve earned one more month.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q8ckzd/netflix_gets_one_more_month/"
    },
    {
        "id": "1q7i0mn",
        "author": "intelerks",
        "title": "Netflix gives first look at 2026 releases, from ‘Enola Holmes 3’ to ‘Peaky Blinders’",
        "content": "",
        "upvotes": 59,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1q7i0mn/netflix_gives_first_look_at_2026_releases_from/"
    },
    {
        "id": "1q7ket8",
        "author": "EdnaJosie8924",
        "title": "Which series do you rewatch once a year?",
        "content": "I have a running list of series that I typically watch once a year.  I think it’s a comfort thing…Do you? And if so, which ones?\n\nMine are typically:\n\nThe Sopranos, Six Feet Under, House of Cards. Hacks, Dexter, Veronica Mars, Bates Motel, Ozark, Schitt’s Creek… ",
        "upvotes": 18,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1q7ket8/which_series_do_you_rewatch_once_a_year/"
    },
    {
        "id": "1q803dq",
        "author": "Working_Branch_751",
        "title": "People We Meet On Vacation",
        "content": "Is anyone excited for this movie? I just watched the trailer and it is so meh! The chemistry seems so off between the two leads. I've watched Tom Blyth in Billy the Kid and he is really good in that. I want to watch this one but also don't want to waste my time. Thoughts from anyone who watched it/will watch it? ",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1q803dq/people_we_meet_on_vacation/"
    },
    {
        "id": "1q7crlh",
        "author": "Lhakey",
        "title": "His&amp;Hers - My honest thoughts",
        "content": "I literally wrapped this show up 20 minutes ago and WOW. I have some strong emotions on this one.\n\nSide note: I am by no means a critic. I just wanted to share my thoughts in case you were on the edge.\n\nIt’s a stark contrast from your typical detective show, mixing in lust, hatred, romance, and love into a twisted story. It was refreshing! Throughout the show I drew sharp comparisons between titles like Gone Girl and The Girl on the Train, with a distinct splash of the traditional detective themed Hollywood blockbuster. However, even then it was entirely different. \n\nThere is definitely something to be said about the predictability throughout this show. With modern day crime films, I often feel I have a solid grasp of when or how an event is going to take place or come forth, but not with this. This was entirely fresh and entirely unpredictable. The director does a fantastic job of steering the viewers mind; Pushing us to a prejudice and bias that even the most experienced crime thriller fanatics try to avoid. I thoroughly enjoyed the plot and its many twists and turns.\n\nI say all this with some slight criticism. In order to accomplish such a rollercoaster of a plot line, I did feel there was a certain loss of realism. The general structure of the plot is gripping, but the actual substance of it can be slightly off putting. I felt as if some of the reasonings were a slight bit of a reach for my tastes, but could be well within the palettes of most viewers.\n\nFrom a cinematographic point of view, the show was well made. The scenery, the mood, and the pacing, was attractive to your typical crime thriller junkie. I have little to complain about aside from the pacing in the last episode. I felt as if there could have been a slight bit more to explore concerning the main protagonist and his trauma, but it was brushed off for the jaw dropping peak of the show (absolutely 100% unexpected). So yes, I will say the cinematography was well done. It’s no Lord of the Rings or Interstellar, but it has more than enough to make the viewing experience pleasurable. \n\nAlso, there were so many morals and lessons put into this story. Maybe it’s just me being impressionable, but I definitely felt there was some moving moments throughout. \n\nI strongly recommend this series and look forward to more similar work in the future. \n\n\n TLDR: Great series. It was a nail biter that had me constantly questioning my theories. There’s some minor misgivings but they are made up for by other plot twists and so on. 8.2/10. Strongly recommend!\n",
        "upvotes": 23,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1q7crlh/hishers_my_honest_thoughts/"
    },
    {
        "id": "1q7zd7k",
        "author": "xdylanx2424",
        "title": "Can’t watch 4k content with dual monitors (pc)",
        "content": "So I have the KTC-M27P6 4K Mini-LED + Dell 24” 1080p monitor and I bought the HVEC extension from Microsoft store thinking it would allow me to watch 4k content. I tried everything to get it to work only to find out it was because I had dual monitors. After unplugging my 1080p monitor i was finally able to watch 4k content. \n\nI tested this both on app and on edge and as long as I have both monitors plugged in I’m stuck at 1080p content is there a way to fix this? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q7zd7k/cant_watch_4k_content_with_dual_monitors_pc/"
    },
    {
        "id": "1q6m0fa",
        "author": "Stormin_333",
        "title": "Torture is the new gunfight in so many shows.",
        "content": "Why has torture become so prevalent in media in recent years?  It is constant.  Sometimes less graphic than other times, but every show eventually at least has somebody tied to a chair and punched over and over.  Some really lean in on it and get graphic.\n\nGross\n",
        "upvotes": 383,
        "comments": 154,
        "media": null,
        "permalink": "/r/netflix/comments/1q6m0fa/torture_is_the_new_gunfight_in_so_many_shows/"
    },
    {
        "id": "1q7ohso",
        "author": "Caityb13",
        "title": "Need Trashy Reality Competition Recs",
        "content": "Feel like we’ve watched everything on Netflix that falls under this category but truly these shows are our guilty pleasure. It feels like it takes forever to get new shows and we go months without content to watch. Any recommendations? Below are the ones we watched and liked. (We also like culinary competition shows like next gen chef) \n\n\\-Love Is Blind\n\n\\-Perfect Match\n\n\\-The Circle\n\n\\-Too Hot to Handle\n\n\\-The Trust\n\n\\-The Ultimatum\n\n\\-Temptation Island \n\n\\-Sneaky Links\n\n\\-Battle camp\n\n\\-The Mole",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1q7ohso/need_trashy_reality_competition_recs/"
    },
    {
        "id": "1q77ybn",
        "author": "Baapofmovies_123",
        "title": "Netflix’s His &amp; Hers Review (2026): This Limited Series Is A Glossy, Twisty Thriller Made for Binge-Watching(Rating: 3.5/5)",
        "content": "Each episode is very well balanced, as it ends with enough intrigue to pull viewers straight into the next, and every twist will engage the viewers. The production values are slick, and throughout the show the pacing is very consistent. ",
        "upvotes": 12,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1q77ybn/netflixs_his_hers_review_2026_this_limited_series/"
    },
    {
        "id": "1q7sq6i",
        "author": "Curious_Register_718",
        "title": "grey flashes",
        "content": "i get grey flashes whenever im watching a show on my iphone 15 (device may be relevant im not sure). they go completely grey but within a few seconds fade away. just a bit irritating. if anyone knows why id appreciate it!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q7sq6i/grey_flashes/"
    },
    {
        "id": "1q6pv44",
        "author": "Thissuxxors",
        "title": "The Gabby Petito case - I really need to stop watching these crime docs",
        "content": "They're just so ridiculously sad, I asked myself why do I watch them. I said I would not watch another one after that Netflix documentary about that pos who wanted to leave his wife for another woman and offed his kids. That one really haunted me.\n\nI didn't think this one would get to me as much as it did. What a beautiful soul Gabby was. I honestly have no idea what she saw in that ugly pos. And her think she thought she was lucky that he wanted her was ludicrous, he is the one that was lucky to have her. I don't understand how you can do that to someone who loved you that much even when you were being a piece of shit that you are and she still wanted to spend her life with him.\n\nSorry, I have to vent. This was such a difficult watch.",
        "upvotes": 161,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1q6pv44/the_gabby_petito_case_i_really_need_to_stop/"
    },
    {
        "id": "1q730co",
        "author": "Coach006",
        "title": "What the HELL did I just watch?!?!?!",
        "content": "'Becky' it drew me in with the trailer and the individuals playing the parts. Never heard anything about this movie, but DAMN!!!!!! I guess that I'd call it unexpected???",
        "upvotes": 26,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1q730co/what_the_hell_did_i_just_watch/"
    },
    {
        "id": "1q7krkg",
        "author": "splader",
        "title": "Unable to hold to speed up anymore? (Android)",
        "content": "Hey guys, just a really quick question as I'm not sure if this is a bug or an update or something.\n\nOne of my favorite things with the Netflix Android app is that if I hold down on the screen, the media plays at 1.5 speed. It's super useful for slow moments or when rewatching shows etc. \n\nBut since a few days ago, it's completely stopped working for me. I tried searching online but wasn't able to find it if this is my phone glitching out or if there was an update or something that removed it. I'm in a pixel 9, and I've done some basic troubleshooting already. \n\nAny help is appreciated, thanks!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q7krkg/unable_to_hold_to_speed_up_anymore_android/"
    },
    {
        "id": "1q7p87v",
        "author": "Crazy_Quantity8573",
        "title": "The Residence Chef",
        "content": "**The one thing that bothered me the entire series is why the hell did they have the female chef as a suspect and keep bringing her up?? She had like 0 motive, that was just her personality/stress getting to her, and it was clearly one moment of anger. It doesn't make sense. And the 'i'm going to kill you' dialogue repeating it over and over across the episodes was so annoying 😭.**",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q7p87v/the_residence_chef/"
    },
    {
        "id": "1q7o58g",
        "author": "StillCompetition2456",
        "title": "Question: Will Netflix keep releasing remastered One Piece episodes regularly (e.g., monthly)?",
        "content": "Hey everyone, I have a question about the One Piece anime on Netflix. I noticed that the HD remastered version started rolling out recently, and I’m trying to understand how the release schedule works.\n\nSo far Netflix has released:\n\n\t•\tNov 15: Episodes 1–16\n\n\t•\tDec 15: Episodes 17–31\n\n\t•\tJan 15: Episodes 32–61 (upcoming)\n\nMy question is: will Netflix keep releasing more episodes on a regular schedule (like every month)? Or will it slow down or even stop at some point? Is there any official info on how many episodes Netflix plans to release in total?\n\nI’m just starting One Piece for the first time — I watched the live‑action series last year and now I’m finally getting into the anime — so I’m curious how this release pattern works. I couldn’t find anything official about this anywhere.\n\nThanks in advance! ✌️",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q7o58g/question_will_netflix_keep_releasing_remastered/"
    },
    {
        "id": "1q7h6dm",
        "author": "Possible_Term_8426",
        "title": "Where can I see what people think about films on Netflix or other streaming platforms",
        "content": "Whenever I want to see what people think about a show or movie, I never know where to look. Are there any websites for this—Netflix or other streaming platforms—where I can read other people’s opinions? Ideally, with a comment section for each title.\n\nIf not, I’m thinking of making one myself. Would anyone actually use it?",
        "upvotes": 1,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1q7h6dm/where_can_i_see_what_people_think_about_films_on/"
    },
    {
        "id": "1q7w4xn",
        "author": "Adventurous_Floor403",
        "title": "Does anyone have a spare/extra ticket to the Frankenstein Exhibit in LA??",
        "content": "pls!!!!! i'm so so bummed there are no tickets left, i am so hyper fixated on this adaptation and would love to have an opportunity to see this exhibit if anyone has a spare ticket (or two, for my partner! but they understand how my autism yearns to go so hard that even one would do!) pls let me know!!! i will send you a pack of snacks i think the creature would like!!!  anything !!! tysm",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q7w4xn/does_anyone_have_a_spareextra_ticket_to_the/"
    },
    {
        "id": "1q7zlp9",
        "author": "Much-Potential1008",
        "title": "What is the point of making \"Saare Jahan Se Accha\" really?",
        "content": "All this lame effort to be like \"India is not making a bomb\" - what's the point really of this show? Given we all know India did make one. Is it India's just another effort to promote nationalistic, jingoism? To show that Pakistan will sell the atomic bomb and give it to terrorists. Like how stupid do you have to be to make losing points like \"sambhaal nahi payenge, secure nahi rakh payenge.\" Seriously, why is Indian media so obsessed with Pakistan?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q7zlp9/what_is_the_point_of_making_saare_jahan_se_accha/"
    },
    {
        "id": "1q7swpp",
        "author": "BoeWulf127",
        "title": "show cut out mid-episode and is now gone, did they happen to remove it?",
        "content": "I was watching star trek and like 15 minutes in it cut to the 'cannotnplay this title at this time' or whatever it is. it has now disappeared from my list and my continue watching, and when I search for it it doesn't come up.\n\ndoes this mean they happened to remove it right as I was watching it? I'm confused cuz usually it says in the blurb if something is leaving soon but I didnt have any such message, but everything else plays fine so idk what else it could be.\n\nsorry if this has been asked before, I couldn't find an FAQ anywhere or see it while quickly scrolling.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1q7swpp/show_cut_out_midepisode_and_is_now_gone_did_they/"
    }
]