[
    {
        "id": "1lzies3",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 23,
        "comments": 1059,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lzies3/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1lbetgi",
        "author": "RM_Official_Thread",
        "title": "r/RealMadrid Reddit CWC Fantasy League and Prediction Bracket Challenge",
        "content": "FIFA Official app has 2 games going on for the CWC and it would be fun if we use both to determinate if you guys know as much football as you pretend to when  you're all arguing tactics in the sub and claiming you know how to fix the team and that Carlo had none.\n\n\\# Join the Fantasy League for this subreddit here:\n\n[https://play.fifa.com/fantasy/join-league/BDHSOJPY](https://play.fifa.com/fantasy/join-league/BDHSOJPY)\n\n\\# Join the Prediction bracket for this subreddit here:\n\n[https://play.fifa.com/bracket-predictor/join-league/60B7D21B](https://play.fifa.com/bracket-predictor/join-league/60B7D21B)\n\npost your bracket or fantasy team here to get people going.\n\nWinner of each will get a custom flair set to whatever you want (as long as its reasonable)",
        "upvotes": 19,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L2IQgNCexcLebmnUV4r1PsoE08WHXZ9oOuLG1NvcOCg.png?auto=webp&amp;s=e5d92205c44c2e30bc741130b750be458855c060"
        },
        "permalink": "/r/realmadrid/comments/1lbetgi/rrealmadrid_reddit_cwc_fantasy_league_and/"
    },
    {
        "id": "1m0yr10",
        "author": "EffectiveTie3144",
        "title": "Happy birthday to Club Legend Gareth Frank Bale 🏴󠁧󠁢󠁷󠁬󠁳󠁿",
        "content": "",
        "upvotes": 932,
        "comments": 32,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m0yr10/happy_birthday_to_club_legend_gareth_frank_bale/"
    },
    {
        "id": "1m0s27c",
        "author": "FrrancondonaEra",
        "title": "This is how Al-Baciti fans waited for the Vallejo deal 😂",
        "content": "",
        "upvotes": 523,
        "comments": 47,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/aaa9kwdxf3df1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m0s27c/this_is_how_albaciti_fans_waited_for_the_vallejo/"
    },
    {
        "id": "1m0ezco",
        "author": "No-Independent2522",
        "title": "Carreras (18) with Perez",
        "content": "",
        "upvotes": 870,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3p3b2mn2u0df1.jpeg?auto=webp&amp;s=9b6b04cc7d8a36653aebd77c0c03d73d91f036a7"
        },
        "permalink": "/r/realmadrid/comments/1m0ezco/carreras_18_with_perez/"
    },
    {
        "id": "1m0qveq",
        "author": "Short_Mousse_6812",
        "title": "We can’t just mindlessly support Vini",
        "content": "   Vini was my favorite player for many seasons and I think he deserved the ballon dor. I feel bad for him because he had to go through racism, getting robbed off an award and now his form has dipped. Nonetheless, we can’t just mindlessly support him and act like nothing happens. We can’t just act like he didn’t play horribly this year. But most importantly we can’t ignore his attitude. I have no problem supporting a player during tough times. I would go far and more for Valverde. However, the problem with Vini is his behavior and ego. Vini is asking the club for more money and trying to shine over Mbappe. I think it is pretty evident by this time that Vini and Mbappe don’t work together. If a player wants to be over the club and act un accordingly they can leave no matter who they are. On the other hand Rodrygo may be a worse player than Vini but has always played out of position for the club and been humble. I believe that Vini needs to stop being defended as much as he is. Every true Real Madrid fan knows no one is above the club.",
        "upvotes": 173,
        "comments": 195,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m0qveq/we_cant_just_mindlessly_support_vini/"
    },
    {
        "id": "1m0d1pp",
        "author": "Mindless_Life_3585",
        "title": "Greatest UCL knockout run of all time?",
        "content": "",
        "upvotes": 984,
        "comments": 66,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/nibug75b90df1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m0d1pp/greatest_ucl_knockout_run_of_all_time/"
    },
    {
        "id": "1m0pkv7",
        "author": "TheFeatherDiaries",
        "title": "Arda Güler - OVERALL Club World Cup 2025",
        "content": "",
        "upvotes": 168,
        "comments": 40,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7faob632z2df1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m0pkv7/arda_güler_overall_club_world_cup_2025/"
    },
    {
        "id": "1m0eief",
        "author": "No-Independent2522",
        "title": "Mandatory Sanitas pic : Carreras 👍",
        "content": "",
        "upvotes": 565,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/e3s2uungp0df1.jpeg?auto=webp&amp;s=dc1faa0a9502828053c323f8bc3b98679c5af921"
        },
        "permalink": "/r/realmadrid/comments/1m0eief/mandatory_sanitas_pic_carreras/"
    },
    {
        "id": "1m062y7",
        "author": "menu07",
        "title": "It's strange to see the captain with another shirt",
        "content": "",
        "upvotes": 1694,
        "comments": 65,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0z4xp1vq8ycf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m062y7/its_strange_to_see_the_captain_with_another_shirt/"
    },
    {
        "id": "1m0f5qh",
        "author": "OmarEhab10",
        "title": "🚨🚨 Real Madrid are NOT working on signing a midfielder right now. ⚪️❌ Florentino Perez doen't want to OVERPAY for players that aren't worth it, La SER reports.",
        "content": "",
        "upvotes": 288,
        "comments": 207,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m0f5qh/real_madrid_are_not_working_on_signing_a/"
    },
    {
        "id": "1m0nz44",
        "author": "RealMood8898",
        "title": "We need stiller but not for the reasons you think",
        "content": "Personally I think our midifled is creative and are being held back by a lazy attack who refuses to make appropriate runs and confuse the defense. Take garcia for example always moving around getting into good positions that’s why he got so many goals. Compared to vini who runs to the wings and Mbappe who stands still instead on constantly making runs and moving around. Not to mention if Dean and Trent aren’t playing passing back to the defense is the same as giving the opposite team possession because they aren’t capable of being calm and passing that ball back. I think midifled creativity and control really isn’t the anywhere near as big of a problem as people think. I think it’s the people surrounding them that needed the most improvement. But we still need stiller not only are we losing Bellingham we lost modric , Kroos, and possibly ceballos so we need depth and even once Jude is back assuming we play 4 mids we will have only 1 CM option of the bench. What are your opinions ? I personally think defense should be our biggest priority ",
        "upvotes": 31,
        "comments": 56,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m0nz44/we_need_stiller_but_not_for_the_reasons_you_think/"
    },
    {
        "id": "1m03731",
        "author": "FrrancondonaEra",
        "title": "its Franco era at real madrid and im hyped for him to join us",
        "content": "",
        "upvotes": 625,
        "comments": 56,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/yxbepm6okxcf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m03731/its_franco_era_at_real_madrid_and_im_hyped_for/"
    },
    {
        "id": "1m0hfs4",
        "author": "Smoosa_Champagne",
        "title": "¡Hala Madrid, mis madridistas! 🤍",
        "content": "Just thinking back to that Champions League run in 2021/22 still gives me goosebumps. Honestly, sometimes I sit here and I *still* can't quite believe we pulled it off. Comeback after comeback... it felt like every single round was a movie script that no one would have dared to write because it seemed too unbelievable!\n\nFrom PSG to Chelsea, then that crazy City game, and finally lifting la Decimocuarta against Liverpool, each step felt like climbing a mountain. But our players... they left EVERYTHING on that pitch. They played with a spirit that was just unmatched.\n\nThere were moments where it felt like it was over, done. But this is Real Madrid, and somehow, some way, our boys found that extra gear, that bit of magic, to turn the impossible into reality. The Bernabéu was a cauldron, a true force of nature pushing the team forward.\n\nThat run wasn't just about winning; it was about the heart, the passion, the never-say-die attitude that defines our club. It’s a reminder of what’s possible when you wear that white shirt and fight until the very last second.\n\nEven now, years later, whenever I think about that incredible journey, it fills me with so much joy and a sense of limitless possibility for Real Madrid. What a team, what a spirit, what a run!",
        "upvotes": 44,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m0hfs4/hala_madrid_mis_madridistas/"
    },
    {
        "id": "1m0gert",
        "author": "Actual_Box7731",
        "title": "(Basket) Vasilije Micic could pick Real Madrid they offered him 8.4mil in 2 years, 4.2mil per year. Hes seriously considering it Eurohoops sources confirms it too.",
        "content": "",
        "upvotes": 30,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ISl1g9Biljvj-dqW0bJ2lW5k_UPGFOxN1kxrf4H4Y6A.jpeg?auto=webp&amp;s=24b3df38602d80d7e57a52dff36d144d85d20ea0"
        },
        "permalink": "/r/realmadrid/comments/1m0gert/basket_vasilije_micic_could_pick_real_madrid_they/"
    },
    {
        "id": "1lzzib8",
        "author": "herkalurk",
        "title": "Gonzalo Garcia in Club World Cup Team of the Tournament",
        "content": "",
        "upvotes": 407,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n29c77wyswcf1.jpeg?auto=webp&amp;s=2a04eb5789ba4361cfa9c17ecf07f394312ee8df"
        },
        "permalink": "/r/realmadrid/comments/1lzzib8/gonzalo_garcia_in_club_world_cup_team_of_the/"
    },
    {
        "id": "1lzwgtd",
        "author": "menu07",
        "title": "What do you think of the new signing?",
        "content": "",
        "upvotes": 467,
        "comments": 75,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fgdu4ay58wcf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lzwgtd/what_do_you_think_of_the_new_signing/"
    },
    {
        "id": "1lzspkj",
        "author": "antoniokr8s",
        "title": "[realmadrid.com] Comunicado Oficial: Álvaro Carreras",
        "content": "",
        "upvotes": 591,
        "comments": 58,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lzspkj/realmadridcom_comunicado_oficial_álvaro_carreras/"
    },
    {
        "id": "1lzxh0b",
        "author": "More-Judgment-9253",
        "title": "Carreras vs Atletico Madrid",
        "content": "",
        "upvotes": 203,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3soi9jmrewcf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lzxh0b/carreras_vs_atletico_madrid/"
    },
    {
        "id": "1lzyyeh",
        "author": "ace-s",
        "title": "Álvaro Carreras is a very unique player like Huijsen, he will be instrumental for many years.",
        "content": "Huijsen and Álvaro Carreras have both had a breakthrough season. Majority of football fans probably did not know how much talented these players are 2 years ago, they were able to show their worth this season. \n\nHuijsen is a master at carrying the ball, either with his pinpoint passes or with his feet. So is Carreras. \n\n[Among all fullbacks in his league](https://x.com/DataMB_/status/1943720247891997042), he has the most touches, most progressive actions, most passes completed, most forward passes completed, Most progressive passes completed, most accurate passes to final third...etc. Benfica literally played through him. \n\nI don't have this year's stats but last year he dwarfed everyone in his age bracket in [progressive actions](https://x.com/DataMB_/status/1840701634726216192) in the top 7 league. \n\nOn top of all of this, he has experience playing as a CB aswell, we could see him as an LCB in some games too. I can see him transition to a CB like Ramos too.\n\nWe should be very optimistic in regards to our backline, we have a master passer in trent on our RB, A master progressive player in Alvaro on the left and Dean in the middle.  ",
        "upvotes": 138,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1rzc7as0dFWoxvYJdiqAy8Vn4iewIsV6iquSiXv-VX4.jpg?auto=webp&amp;s=d20df2b86f1ec8705adc95f681780ac6f6aabfb9"
        },
        "permalink": "/r/realmadrid/comments/1lzyyeh/álvaro_carreras_is_a_very_unique_player_like/"
    },
    {
        "id": "1lzvc48",
        "author": "Sel2g5",
        "title": "Lessons from the PSG Chelsea final",
        "content": "99.9% of everyone had written Chelsea off in the final. But if anything has become clear, its that the modern game, for better or worse, requires pressing and physicallity. \n\nLook at what Chelsea did. They pressed from minute 1, the commentators were questioning if they'd run out of gas before 20 minutes and they kept on pressing. \n\nIt worked wonders. PSG, who is the best tiki taki team right now, couldnt even get a pass together. The CBs, MFs and fowards were immeadeatly stifled. They looked like PSG made Madrid look in the previous match.  It shut PSG down completely. They immediately started going to the long ball with no success.  \n\nAnd it paid off. They ran ruckus on the CB/wing backs, thanks also to Sanchez's superb passing and scored on quick turnovers in dangerous positions. They made PSG seem completely normal, average.\n\nWhile watching it, I said, thats completely the opposite of Mbappe and Vini, who barely press. The better or worse part is though, I dont like it. This isnt basketball, this is football. I miss real wings, real number 10s, beatiful dribbling and amazing passes, but alas 2025, and the press rules. If our forwards don't do it, this generation will be wasted.\n\nThis is not a drama post, or sell this player or that player. I've been watching madrid for 30 years. Its been success after success. But, the game has changed and this team has to change with it. \n\nMarca or As was quick to write a story about how Xabi will have complete authority to play or bench whomever. That's complete BS, and everyone knows it. \n\nLuis Enrique was right. (paraphrasing) \"Attacking, you're the best, but when you're not attackeing, you're the best defender in the world, thats what a leader does.\" If Xabi can't put them in line I sure hope Dani and Fede do. ",
        "upvotes": 206,
        "comments": 62,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lzvc48/lessons_from_the_psg_chelsea_final/"
    },
    {
        "id": "1lzsih6",
        "author": "No-Independent2522",
        "title": "[AC Milan] La Scala del Calcio has a new maestro",
        "content": "",
        "upvotes": 268,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/B5xUYk9Ir1uPiqAoPRobQbpZ05ix7eCrzAqkIyICgVw.png?auto=webp&amp;s=8878c6c8c5207c7ef29ab241b677c1062332c8e1"
        },
        "permalink": "/r/realmadrid/comments/1lzsih6/ac_milan_la_scala_del_calcio_has_a_new_maestro/"
    },
    {
        "id": "1m05hys",
        "author": "More-Judgment-9253",
        "title": "Since La Fabrica is probably the best academy in the world when it comes to producing fullbacks (Hakimi,Carvajal, Guiterrez) hopefully diego aguado and fortea really get some chances in the future.",
        "content": "Seeing as we have fran and carreras now tho I doubt aguado would get to play there much so he might have to play as a CB for a while and Fortea might get his chances after carvajal most likely retires next year. I know it's really wishful thinking but it would be really nice to them becoming first team players along with Joan Martinez",
        "upvotes": 51,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m05hys/since_la_fabrica_is_probably_the_best_academy_in/"
    },
    {
        "id": "1m068dq",
        "author": "HideoKojimaTheThird",
        "title": "Franco Mastantuono Spanish interview",
        "content": "",
        "upvotes": 44,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ubS9dtfF0yHMTvGNbfyXeZrxx7v4CN8H26-UENfAd8E.jpeg?auto=webp&amp;s=91079cb673de85d69a741ff1c6596158a1268cc5"
        },
        "permalink": "/r/realmadrid/comments/1m068dq/franco_mastantuono_spanish_interview/"
    },
    {
        "id": "1lzmvx8",
        "author": "JulioEC10",
        "title": "Newest addition to the collection 🔥",
        "content": "",
        "upvotes": 312,
        "comments": 23,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lzmvx8/newest_addition_to_the_collection/"
    },
    {
        "id": "1lzxnak",
        "author": "Leopardmaster",
        "title": "Rodrygo’s First Hat-Trick with Real Madrid",
        "content": "Man, Rodrygo’s first hat-trick for Real Madrid feels like it was just yesterday. First season at the club, and he absolutely lit up the Bernabéu with those three goals against Galatasaray in the Champions League. 6-0 win, pure magic. You could just see the talent and confidence oozing out of him - and the connection with the fans was instant.\n\nHard to believe we might be talking about him leaving now. He’s grown so much since that night. Still so much more to give. Really hope he stays. This club feels like his home.\n\nHala Madrid!",
        "upvotes": 62,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jxql9VzS7ZOChUm0rqNheSqWLQ986hBuZJhK_lPz4fA.jpeg?auto=webp&amp;s=69f12523bb28ffca51421f3189dcfc2305976c74"
        },
        "permalink": "/r/realmadrid/comments/1lzxnak/rodrygos_first_hattrick_with_real_madrid/"
    },
    {
        "id": "1lzwp0r",
        "author": "itsnotisaias",
        "title": "Real Madrid collection",
        "content": "",
        "upvotes": 67,
        "comments": 12,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lzwp0r/real_madrid_collection/"
    },
    {
        "id": "1lzjw1s",
        "author": "Material_Title_3337",
        "title": "Just got the 2017-2018 ronaldo jersey",
        "content": "",
        "upvotes": 232,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yetez4wvrtcf1.png?auto=webp&amp;s=34a703c5637d5e2a03b7a200e7f3f422ab5004dc"
        },
        "permalink": "/r/realmadrid/comments/1lzjw1s/just_got_the_20172018_ronaldo_jersey/"
    },
    {
        "id": "1lzgiwh",
        "author": "iamlazyambitious",
        "title": "Why is Alonso getting signings and Ancelotti didn’t?",
        "content": "Hey everyone,\nIt really feels like we’re finally building a complete squad: two quality players for almost every position, actual investment, and long-term planning.\n\nBut looking back… why didn’t Ancelotti get this?\n\nI have nothing but respect for Carlo because the man delivered everything. And back then, every headline was, “Real Madrid believe there are no players on the market with Real Madrid quality.”\nWe were told over and over that there was no value, that Madrid wouldn’t spend just to spend. Most of Carlo’s reinforcements were free signings or very opportunistic deals.\n\nBut now under Alonso, we’re actually spending. There’s serious investment and a plan to finally have depth in every line.\n\nSo what changed?\n\t•\tDid Ancelotti not push for signings?\n\t•\tWas Pérez saving funds for the stadium and Mbappé saga?\n\t•\tOr was Carlo just seen as a transitional figure, and this new “cycle” was always meant for the next manager?\n\nFeels a bit unfair in hindsight, considering what Ancelotti achieved with what he had. Curious to hear what you all think — is it timing, strategy, or just a change in mindset from the club?\n\nHala Madrid ⚪👑\n",
        "upvotes": 309,
        "comments": 100,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lzgiwh/why_is_alonso_getting_signings_and_ancelotti_didnt/"
    },
    {
        "id": "1lz4o6a",
        "author": "AestheticEvan23",
        "title": "Gonzalo Garcia win the CWC golden boot",
        "content": "",
        "upvotes": 2069,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/r45fn9fznpcf1.jpeg?auto=webp&amp;s=87751c401185456ca1dbc50e8663daf83e0c633b"
        },
        "permalink": "/r/realmadrid/comments/1lz4o6a/gonzalo_garcia_win_the_cwc_golden_boot/"
    },
    {
        "id": "1lzgahv",
        "author": "Lekanswanson",
        "title": "Half the supporters in this sub will be gone if madrid becomes a mid table team",
        "content": "As someone that has been supporting madrid for a long time, before the days of Ronaldo when Robinho, Drenthe, Diarra and them were in the team, and someone that has seen some truly awful madrid squads (not saying I know every single thing about madrid), one thing I always found funny is when my friends most who support teams based in England, call me a glory hunter when ironically enough I started supporting madrid during the worst periods.\n\nIts funny though because Raul was my idol even though stature wise I was closer to Drogba at 6,3 220+ pounds but I never played like that. The whole point of this is to say that from what I've seen in this sub with the way people overact to every defeat and turn on players when they are going through a rough patch, regardless of how high of an expectation we have as a club, it clearly shows that there are plenty in this sub that would literally stop supporting the club if we ever somehow become really shit.\n\nAnd as much we might not think its possible, truth is shit happens in football and times change and we could get a president after Perez that mismanages the club and then what. If half the sub loses their mind because we don't even win a preseason tournament after getting a new manager, new players and playing a new system and start losing their minds after 5 games, how will they ever handle coming 12th.",
        "upvotes": 307,
        "comments": 117,
        "media": null,
        "permalink": "/r/realmadrid/comments/1lzgahv/half_the_supporters_in_this_sub_will_be_gone_if/"
    },
    {
        "id": "1lz6o2h",
        "author": "iamhadi12",
        "title": "Enzo Maresca explaining how Carlo Ancelotti's advice helped him fix a big problem with this Chelsea squad",
        "content": "",
        "upvotes": 611,
        "comments": 52,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/v4apqbdm3qcf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1lz6o2h/enzo_maresca_explaining_how_carlo_ancelottis/"
    }
]