[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 15,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1rclvgc",
        "author": "mattgwa",
        "title": "Gruppo musei molto vivace a Torino",
        "content": "Ciao! Ho scoperto un gruppo che organizza visite ai musei. È totalmente gratuito e basato sul volontariato, si paga solo l'ingresso al museo nel caso non si avesse la Carta Musei. Ogni weekend organizzano una visita a un museo o una gita. Ho incontrato persone molto gentili e simpatiche. Siccome mi è piaciuto molto condivido il link per entrare: https://chat.whatsapp.com/JrqhgFdYRwuKpie59Hu1lW",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rclvgc/gruppo_musei_molto_vivace_a_torino/"
    },
    {
        "id": "1rcmf6a",
        "author": "Ok-Elevator-2778",
        "title": "Pool game/ billiards / snookers",
        "content": "I want to know where the Pool game is cheaper in Torino, with decent boards , since me and my friends are noobs, we are spending more time playing the game , we usually play 2 times a week and 3-4 hours each time, and we end up paying 40-50 euros each time in funmily. I don't know the hourly price now . but I would like to know any other cheaper alternatives .\n\nthank you in advance. probably I might miss some details here so please let me know",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rcmf6a/pool_game_billiards_snookers/"
    },
    {
        "id": "1rcfrkn",
        "author": "Scary_Method4595",
        "title": "Dnd online",
        "content": "Ciao sono una di tre giocatrici in un party (viviamo tutte intorno o a Torino), siamo tutte prime giocatrici e il nostro dm all'improvviso ci ha abbandonato ancora prima di poter giocare la prima sessione ufficiale, quindi stiamo cercando un DM che sia disponibile a giocare preferibilmente online. \nSe siete interessati scrivetemi pure.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rcfrkn/dnd_online/"
    },
    {
        "id": "1rbuoi5",
        "author": "Ko_tatsu",
        "title": "L'associazione Comala pubblica un video sulla cordata di SIT",
        "content": "Andrea Pino ha pubblicato un video sull'account Instagram dell'associazione Comala in cui mette in luce alcuni volti famigerati della cordata di associazioni che hanno vinto il bando per la gestione dell'ex caserma La Marmora.\n\nPer chi non è del terzo settore è uno sguardo (senza pretese di imparzialità) su alcune persone e realtà che lavorano nel settore. Credo che molti degli addetti non possano che avallare ciò che si è detto su Eufemia. ",
        "upvotes": 42,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1rbuoi5/lassociazione_comala_pubblica_un_video_sulla/"
    },
    {
        "id": "1rckl89",
        "author": "Purple_Life_7850",
        "title": "Cerco roba da fare a torino",
        "content": "ciao! sono un ragazzo di 17 anni di Novara, vado a Torino 1 volta ogni circa 2 mesi e solitamente passo il tempo con amiche, ma spesso non abbiamo tappe ben definite o cose specifiche da fare.\n\nSo che questo è l'ennesimo post di questo genere ma mi piacerebbe sapere posti carina dove poter andare.\n\nmi piace molto anche la roba underground, musica, videogiochi, fumetti, etc.\n\nma in generale tutto mi andrebbe bene pur di esser divertente e passare un buon attimo diverso dal solito in una città più grande.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1rckl89/cerco_roba_da_fare_a_torino/"
    },
    {
        "id": "1rch2ns",
        "author": "davidebellone",
        "title": "GitHub Copilot Dev Days | Torino, martedí 17 marzo",
        "content": "Ciao.\nVi segnalo un evento interessante per gli sviluppatori a Torino: un evento a tema GitHub Copilot organizzato dal gruppo Torino.NET.\n\nE' un workshop con attivitá interattive e molto pratiche.\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rch2ns/github_copilot_dev_days_torino_martedí_17_marzo/"
    },
    {
        "id": "1rcchju",
        "author": "Ql1ster",
        "title": "Cerco insegnante di pianoforte a Torino (che parli inglese)",
        "content": "Ciao a tutti!\n\nVivo a Torino e sto cercando un insegnante di pianoforte per lezioni in presenza. Ho iniziato a studiare da solo ma sento di aver bisogno di una guida, specialmente per correggere la tecnica.\n\nIl mio problema è che non parlo ancora bene l'italiano, quindi avrei bisogno di un insegnante che possa spiegare le lezioni in inglese.\n\nConoscete qualcuno o sapete consigliarmi una scuola di musica internazionale in città? Grazie mille in anticipo!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rcchju/cerco_insegnante_di_pianoforte_a_torino_che_parli/"
    },
    {
        "id": "1rbuen4",
        "author": "Sadebbasta",
        "title": "Gruppi con cui viaggiare",
        "content": "Allora, contesto: sono una ragazza di 30 anni, o meglio, sono una ragazza di 21 anni intrappolata nel corpo di una trentenne. Tutti i miei amici si stanno sposando e figliando con tutte le conseguenze che ne derivano: uscite a cena con neonati, difficoltà nell’organizzarsi per uscire, amici diventati super noiosi che hanno due argomenti in croce e basta, tentativi di organizzare cene a tema a casa in cui ognuno deve portare qualcosa mal riusciti per mancanza di creatività e di accollatività degli invitati. Io e il mio fidanzato amiamo viaggiare e ci manca da morire un gruppo con cui farlo perché i nostri amici o hanno sempre altri impegni oppure non hanno soldi. Come diavolo si fa a conoscere gente con cui fare amicizia e viaggiare in questa città?  Avevo un gruppo una volta che aveva le mie stesse vibes ma purtroppo erano amici del mio ex e ovviamente non li frequento più. ",
        "upvotes": 12,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1rbuen4/gruppi_con_cui_viaggiare/"
    },
    {
        "id": "1rc5a1y",
        "author": "Rebusudoku",
        "title": "Crocetta e San Salvario",
        "content": "Ciao a tutti, sono una ragazza di 24 anni e sola. È da pochissimo che sono qui a Torino. È stata una decisione molto improvvisata, temeraria, direi coraggiosa. Ho lasciato un lavoro sicuro, un buono stipendio (tutto questo nella mia città natale), perchè? Perchè ero stanca di vivere la mia solita routine. Dopo un percorso di studio all'università sospeso, varie crisi esistenziali per capire cosa farne della mia vita, ho preso la decisione di andare via e scegliere una città che mi permettesse di vivere in modo indipendente ma allo stesso tempo non troppo veloce come le solite città del nord. Una metropoli che ancora trattiene quel sapore di pace interiore che ti accoglie e non ti respinge, quel mistero intriso tra abitudini che ti fanno sentire incluso nei cambiamenti stessi del posto. Beh, ho pensato che questo posto potesse essere Torino. Già frequento Torino ormai da 3 anni, sono sempre salita a trovare la mia migliore amica qui e mi è sempre piaciuta, per questo, motivata da tutte queste paturnie, ho deciso di farmi coraggio e lasciare tutto per iniziare una nuova vita qui. Poichè purtroppo non sono riuscita a trovare casa in centro vicino la mia amica, sono però riuscita a trovarla tra crocetta e San salvario, praticamente sono a metà tra i due quartieri e non li conosco per niente, non li ho mai visitati e non so cosa posso vedere, scoprire, come vivermeli, quindi chiedo un aiuto a voi torinesi, magari ancora meglio chi è autoctono della zona, se doveste mostrare il meglio, il peggio, i posti per divertirsi, rilassarsi, per mangiare, per bere, i posti nascosti dei due vostri quartieri (Crocetta e San Salvario), quali sarebbero? Vi ringrazio tanto per l'aiuto, dato che non ho nessuno che può aiutarmi, dovrò vedersela da sola e quindi non aspetto altro che ricevere un po' di consigli, grazie a tutti per le eventuali risposte",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1rc5a1y/crocetta_e_san_salvario/"
    },
    {
        "id": "1rc0ay6",
        "author": "Parking-Job-3175",
        "title": "Ciao! Opinioni sul quartiere Lingotto? Sembra ottimo per la connettività ma vorrei pareri su sicurezza e servizi",
        "content": "É per consigliare il mio migliore amico che si trasferisce a Torino per lavoro e ha bisogno di accesso al treno ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1rc0ay6/ciao_opinioni_sul_quartiere_lingotto_sembra/"
    },
    {
        "id": "1rbtp0v",
        "author": "dkroods",
        "title": "Ciao Torino!",
        "content": "È disponibile da ora su Google Play la nuova versione **v1.5.5** di   \n**Bus Torino Take It Easy TO** 🚍  \n[https://play.google.com/store/apps/details?id=com.takeiteasy.torino.app&amp;hl=it](https://play.google.com/store/apps/details?id=com.takeiteasy.torino.app&amp;hl=it)\n\nIn questo aggiornamento:  \n• Correzione di numerosi bug  \n• Miglioramento della stabilità generale  \n• Riduzione significativa dei crash  \n• Ottimizzazioni interne per rendere l’app più fluida\n\nL’app è disponibile in più lingue ed è pensata per essere semplice, veloce e utile per chi usa ogni giorno i mezzi pubblici a Torino e dintorni.\n\nAll’interno dell’app potete anche consultare direttamente le **notizie ufficiali di GTT**, così restate sempre aggiornati su scioperi, modifiche di linea e comunicazioni importanti.\n\nSe la usate già, fatemi sapere cosa ne pensate   \nE se non l’avete ancora provata, vi aspetto!\n\nGrazie alla communityTorinese per il supporto !!!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nuaiiGFItbtxDSNzYhaG2Rssd5hcTlUDwPMth7Unb6A.png?auto=webp&amp;s=46528cedf69c398f3882c445f711b582d0d0bc88"
        },
        "permalink": "/r/torino/comments/1rbtp0v/ciao_torino/"
    },
    {
        "id": "1rbmq3z",
        "author": "Impossible_Ring691",
        "title": "Qualcuno è mai stato al PrimoGemito? Ci sono altri eventi simili qua in città?",
        "content": "Questo è un account temporaneo. Vorrei participare a questo party, son già stato ad eventi simili ma mai qua a Torino. Sto cercando qualcuno che mi descriva la sua esperienza, com'è stato in generale? Si può raggiungere con i mezzi? Ci sono state controversie? Grazie in anticipo.",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1rbmq3z/qualcuno_è_mai_stato_al_primogemito_ci_sono_altri/"
    },
    {
        "id": "1rbua5d",
        "author": "QuickPersonality9090",
        "title": "Portare CV in un supermercato?",
        "content": "Ciao, sono una studentessa e sto cercando un lavoro part-time. Per ragioni che non mi dilungherò a spiegare, credo che l'opzione migliore per me sarebbe un supermercato. Non riesco però a capire come fare, considerando che i CV online non vengono minimamente cagati, e non tutti i supermercati hanno uno \"sportello informativo\". Dovrei lasciarlo ai cassieri chiedendo loro di darlo ai responsabili? Avete consigli?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1rbua5d/portare_cv_in_un_supermercato/"
    },
    {
        "id": "1rbu9cg",
        "author": "Aromatic_Muffin_",
        "title": "Holiday questions",
        "content": "Ciao a tutti!\n\nIo e mia famiglia andiamo in vacanza a Torino (Ottobre)!\n\nDov'è il miglior ristorante per la bistecca e la pizza? Anche, cacio e pepe? Io so è Roman 😅😅 Ma mi piece!\n\nCom'è il tempo in Ottobre? \n\nParlano inglese?\n\nMi dispiace, mio italiano è così così!\n\n  \nGrazie!\n\n  \n\\----\n\nHey everyone!\n\nMy family and me are going to Torino in October!\n\nWhere (or what) is the best restaurant for steak and pizza? Also cacio e pepe if possible?! I know it is Roman 😅😅 But I like it! So I am hoping there maybe a Roman style restaurant there!\n\nWhat is the weather like in October? We are going late October and I am getting an average online but would like real experiences\n\nDo people speak English? I have allgeries and my Italian is not to great as I have noone to speak to, had a tutor which was great but ran out of things to practice..Ofcourse still trying to learn and not be so shy lol!\n\n  \nThankyou!\n\n\\--\n\n",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1rbu9cg/holiday_questions/"
    },
    {
        "id": "1rbhggy",
        "author": "_L_-",
        "title": "Gran Torino 4 maggio marcia?",
        "content": "Ciao, so che ogni anno si fa una marcia verso Superga in ricordo del Gran Torino. \n\nQuest'anno capita di lunedì, volevo capire se si fa comunque quel giorno o il weekend dopo (o quello prima in questo caso?) ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1rbhggy/gran_torino_4_maggio_marcia/"
    },
    {
        "id": "1rb1h29",
        "author": "Erleyx",
        "title": "Need a place to stay for one night (willing to pay)",
        "content": "Hey everyone,\n\nI’m in a tough situation right now and was unexpectedly kicked out by my parents today. I’m looking for a safe place to stay just for one night while I figure things out.\n\nI’m respectful, clean, and can pay for the stay. I don’t need much, just somewhere safe to sleep. If anyone is willing to help or can point me toward a safe option, I’d really appreciate it.\n\nPlease DM me if you can help. Thank you.",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1rb1h29/need_a_place_to_stay_for_one_night_willing_to_pay/"
    },
    {
        "id": "1rbgwyv",
        "author": "Hashischfarmer",
        "title": "Dove posso comprare piccole quantitá d'oro (1-2 g)",
        "content": "Come da titolo cerco un negozio fisico in cui recarmi e comprare 1-2 g di oro, grazie",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rbgwyv/dove_posso_comprare_piccole_quantitá_doro_12_g/"
    },
    {
        "id": "1rb3oyh",
        "author": "TostVolante",
        "title": "Locali per metal dal vivo",
        "content": "ciaoo! Sono nuovo a Torino e cercavo di capire se ci sono locali dove si esibiscono band metal (doom in particolare) anche poco conosciute, o posti che fanno musica dal vivo di ogni tipo e in passato hanno invitato band metal. \n\nAnche pagine che pubblicizzano eventi così su Torino sono apprezzate!",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1rb3oyh/locali_per_metal_dal_vivo/"
    },
    {
        "id": "1raq9l7",
        "author": "enoughtodo67",
        "title": "Trovare un gruppo di amici?",
        "content": "Ciao! \nMa è possibile trovare un gruppo di amici sulla ventina, in cui includere un ragazzo molto timido ma con tanta voglia di avere amicizie?☺️",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1raq9l7/trovare_un_gruppo_di_amici/"
    },
    {
        "id": "1rb2rxd",
        "author": "QualityLazy",
        "title": "Digital SAT for UniTO",
        "content": "Ciao. I am currently studying in University of Messina and planning on transferring to university of Turin by reapplying as a freshmen. Since that, I need to take the SAT exam, what I have been currently preparing for. I am very curious of the average SAT score of the 2025/26 year’s applicants. If any Unito Business and Management program student is reading this rn, please, tell me what was your score that got you in the university 🙏",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rb2rxd/digital_sat_for_unito/"
    },
    {
        "id": "1rb03a3",
        "author": "Fit-Chemist5054",
        "title": "val chisone e germanasca",
        "content": "Ciao Reddit,\n\nc'è qualcuno che abita o frequenta la val chisone\\\\germanasca?\n\nDa Pinerolo a Sestriere passando chiaramente anche per Prali.\n\nVolevo confrontarmi, io amo questa valle ma al contempo è difficile poterci vivere\\\\lavorare, non ci sono attrazioni per la vita quotidiana, attività da svolgere né aziende abbastanza strutturate da permettere sicurezza e continuità lavorativa.\n\nMi piacerebbe mi deste il vostro parere e sentire idee su cosa si potrebbe fare per cercare di avere una valle più viva e con un'economia che permette di poterci vivere senza fare 100km al giorno per scendere in città.\n\nAd esempio mi chiedo perché non nascano aziende manifatturiere, luoghi per fare sport, perché non venga riutilizzato il palazzo delle olimpiadi per creare attività, perché non ci siano maggiori luoghi di aggregazione o per fare sport.\n\nCome gestite l'assenza di queste strutture\n\nCome gestite il lavoro?\n\nQuali sono le cose che più mancano secondo voi?\n\nSe possibile non vorrei innescare polemiche, quanto più cercare di tirare fuori argomenti costruttivi.\n\nGrazie a chi avrà voglia di rispondere ed argomentare.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1rb03a3/val_chisone_e_germanasca/"
    },
    {
        "id": "1rapbid",
        "author": "EducationalTicket458",
        "title": "serate",
        "content": "Sono a Torino da circa 3 mesi per studio M22 e purtroppo non ho ancora avuto l'opportunità di fare serata con qualcuno che ne avesse genuinamente voglia, mi va bene un po' di tutto ma assolutamente no techno/elettonica. se vi va sentiamoci ",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1rapbid/serate/"
    },
    {
        "id": "1rayvto",
        "author": "Different_Yam8152",
        "title": "Offro Petsitting a Torino",
        "content": "Ciao! Volevo cercare un modo per offrire petsitting a cani e gatti, visto che al momento non posso avere animali. Vorrei curare animali a un prezzo irrisorio oppure se c'è qualche posto in cui fare volontariato. Conoscete qualche realtà/persona che cerca?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1rayvto/offro_petsitting_a_torino/"
    },
    {
        "id": "1rasxnm",
        "author": "Salty-Dragonfruit-",
        "title": "English speaking friend",
        "content": "Ciao tutti. I’ve been living in Turin for a short time, and I don’t know how to speak much Italian yet, but my English is good. I’m looking for an Italian friend who can speak English. We can do a language exchange together.",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1rasxnm/english_speaking_friend/"
    },
    {
        "id": "1raoa5b",
        "author": "Ms_Stregatta1890",
        "title": "Bilance pesapersone a Torino",
        "content": "Ciao, è una domanda un po' inusuale, spero che qualcuno sappia rispondermi.\n\nCerco un posto (farmacia, centro commerciale o altro) dove sia presente una bilancia pesapersone, di quelle che rilasciano lo scontrino con tutti i dati di peso, altezza ecc.\n\nSto seguendo un percorso di dimagrimento con una nutrizionista, ed ho notato che le bilance che ho  in casa riportano sempre un peso diverso da quello registrato, al massimo mezz'ora dopo, nello studio della nutrizionista. So che il peso varia anche di ora in ora, ma qui parliamo di chili di differenza, non grammi... So che basterebbe provare a ritirarle, ma sono del tipo elettronico che va ora e credo che sia proprio un loro difetto. Potrei comprarne un'altra, ma temo lo stesso problema.\n\nVivo a Torino nord, quindi sarebbe top se ce ne fossero da queste parti, ma posso recarmi ovunque in città, nel caso.\n\nGrazie mille!",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1raoa5b/bilance_pesapersone_a_torino/"
    },
    {
        "id": "1rav2r7",
        "author": "Sharews",
        "title": "Tatuatore consigli",
        "content": "Hello, mi sono trasferito da poco e cerco un buon tatuatore, vorrei fare qualcosa stile concept minimal ma ancora da progettare. Consigli? Possibilmente non uno con liste d’attesa infinite (anche se potrei valutarlo se è davvero bravo) dato che vorrei farlo nei prossimi mesi\n\nThanksss",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1rav2r7/tatuatore_consigli/"
    },
    {
        "id": "1rau3t1",
        "author": "GearBrilliant1924",
        "title": "Pane buono!",
        "content": "Ciao a tutti.\nMi consigliate un panificio, che secondo voi, vende del buon pane.\nRiferimento zona/e: Torino sud, ma anche  Comuni limitrofi tipo Nichelino/Beinasco.\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1rau3t1/pane_buono/"
    },
    {
        "id": "1rarfyr",
        "author": "Project-PhoenX",
        "title": "Sviluppatore mobile (iOS/Android)",
        "content": "Ciao!\n\nSto lavorando a un progetto \"early-stage\" in ambito mobilità urbana e vorrei costruire un MVP mobile. Voglio precisare che non voglio offrire attività \"a ticket\" ma l'intento, se l'MVP piace è di andare avanti in modo più strutturato. Cerco quindi qualcuno, nell'area torinese, che voglia crederci e che sia disposto a scommettere assieme a me per costruire qualcosa di interessante.\n\nSe interessati, contattatemi.  \nCiao",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1rarfyr/sviluppatore_mobile_iosandroid/"
    }
]