[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 46,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qqm8bc",
        "author": "MattTheKing23",
        "title": "Netflix Had a Plan If Alex Honnold Died During Live Skyscraper Climb",
        "content": "",
        "upvotes": 297,
        "comments": 82,
        "media": null,
        "permalink": "/r/netflix/comments/1qqm8bc/netflix_had_a_plan_if_alex_honnold_died_during/"
    },
    {
        "id": "1qqnyn5",
        "author": "Jumpy_Wing_7884",
        "title": "Anyone else feel sad when they outgrow a show? (me: Bridgerton)",
        "content": "I used to LOVE *Bridgerton*, but Season 4 just isn’t hitting for me anymore. Same thing happened with *You*. It’s not bad, I’m just… not as into it.\n\nKind of makes me sad because these used to be such comfort shows for me. 😅\n\nAnyone else go through this with shows they used to love?",
        "upvotes": 129,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1qqnyn5/anyone_else_feel_sad_when_they_outgrow_a_show_me/"
    },
    {
        "id": "1qqjrtn",
        "author": "Hefty_Shoe_7081",
        "title": "The Perfect Neighbor",
        "content": "I know this show has been talked about alot on this sub but I have some things I’d like to discussed that I don’t think have been discussed. \n1. Even if this lady was bothered by these kids (which believe me kids can be annoying especially in large groups) why did NO OTHER FAMILY had anything bad to say about these kids? These kids were playing, being kids, imagine what a miserable piece of garbage you have to be to be so bothered by children playing. \n2. Does anybody feel for her in the sense that mental health is something ignored in their country or was she just an awful person? (Was she schizophrenic, etc…) \n3. Why did it take somebody dying for something to happen? These cops had been here what, over 10 times? And nothing happened? \n",
        "upvotes": 64,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1qqjrtn/the_perfect_neighbor/"
    },
    {
        "id": "1qqoe1g",
        "author": "SugaryFlump",
        "title": "Sense8",
        "content": "Why was Sense8 never renewed for a third season? Just rewatched it all for a second time and I forgot just how brilliant it is! Wish they’d bring it back, I’d love to see them all these years later with a new storyline. ",
        "upvotes": 21,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1qqoe1g/sense8/"
    },
    {
        "id": "1qpx47n",
        "author": "Pawssabillitysawait",
        "title": "Anyone else like the show Derry Girls?",
        "content": "For some reason i never hear anyone ever talk about this show, it is hilarious and so well written (at least in my opinion) and i absolutely adore it. It’s a spectacular comedy show and am so bummed it’s only 3 seasons!",
        "upvotes": 409,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1qpx47n/anyone_else_like_the_show_derry_girls/"
    },
    {
        "id": "1qqhpx5",
        "author": "Extro-shy1401",
        "title": "Grace &amp; Frankie",
        "content": "This has become my comfort show, i don’t rewatch anything so I really take them seriously &amp; miss them seasons before the final one.\n\nWell, this show has actually portrayed the importance of having genuine friends around you, more than importance it is about how lucky it is to have a grace or a frankie in life.\n\nIt has really shown me that sometimes there’s nothing wrong with a person but just the company. Everyone have their flaws &amp; pros but friends are people who just don’t care about your pros and flaws but only about your happiness. \n\nI loved the show for its quirkiness, rawness of being a human, being old, depiction of love that is unconditional, personalities such as grace &amp; brianna, i personally relate with them.\n\nGood show! Watching it feels like I’m close to my family when I’m far away. ",
        "upvotes": 18,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qqhpx5/grace_frankie/"
    },
    {
        "id": "1qqqbmh",
        "author": "OrangeSpark16",
        "title": "Who is the most successful actor/actress to come from Netflix?",
        "content": "Reworded, who is the most successful actor/actress that got their break on Netflix? I saw a post about a new Noah Centineo movie and it got me thinking about this question. My first thought was Jacob Elordi coming from Kissing Booth. He's nominated for an Oscar this year, coincidentally because of his performance in a Netflix movie! I would also consider Millie Bobby Brown. While she's only been on Netflix shows/movies, it's undeniably given her a lot of fame. Do y'all agree/disagree?",
        "upvotes": 6,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qqqbmh/who_is_the_most_successful_actoractress_to_come/"
    },
    {
        "id": "1qqdp9v",
        "author": "fuckindisturbed",
        "title": "Hidden gems of Netflix",
        "content": "Netflix has a short film called if anything happens, I love you, and it completely made me cry like UGLY cry I was going to continued and watch all the empty rooms but I don’t think my heart can take all of this. There are a lot of good short films on Netflix even if you don’t want to you should watch a few they might change your outlook on life love and whatever else. Just give it a change and you’ll come out a better person. ",
        "upvotes": 18,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1qqdp9v/hidden_gems_of_netflix/"
    },
    {
        "id": "1qqpi51",
        "author": "Prestigious-Back-981",
        "title": "Netflix Will Stream ‘The Secret Agent’ in Brazil, Opens New São Paulo Headquarters",
        "content": "&gt;“The opening of our new São Paulo office is a natural next step in the journey our local team has built over the past 15 years alongside Brazil’s creative community,” said Netflix co-CEO Greg Peters, who flew in for the opening ceremony. “We support Brazilian films in multiple ways because we want to be the best partners and stay flexible so local producers can decide the best way to bring their projects to life,” he said. “That’s why we were so excited to partner with ‘The Secret Agent’s’ producers to help fund the film and pre-license it for Netflix in Brazil.\"\n\n&gt;“The Secret Agent” garnered four Academy Awards nominations, including Best Film, Best International Film, Best Actor (Wagner Moura) and Best Casting. Moura has already won the distinction of being the first Brazilian thesp to win a Best Actor Golden Globe.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qqpi51/netflix_will_stream_the_secret_agent_in_brazil/"
    },
    {
        "id": "1qq1sdj",
        "author": "messengers1",
        "title": "'Gundam' Live-Action Pic Starring Sydney Sweeney Lands At Netflix",
        "content": "After One Piece, another well known animation IP is coming up for live action and possible as franchise if it is a hit. However, Sweeney is not really in my casting list.",
        "upvotes": 54,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1qq1sdj/gundam_liveaction_pic_starring_sydney_sweeney/"
    },
    {
        "id": "1qp894z",
        "author": "Salty_Pangolin_6163",
        "title": "Netflix Faces Backlash After Famous Climber Discloses Low Pay For 500-Meter Skyscraper Climb",
        "content": "",
        "upvotes": 1895,
        "comments": 378,
        "media": null,
        "permalink": "/r/netflix/comments/1qp894z/netflix_faces_backlash_after_famous_climber/"
    },
    {
        "id": "1qqs0pq",
        "author": "PrizeStructure2467",
        "title": "[Edge] Building the ultimate \"Productive\" streaming setup for Netflix/Prime – Need stable extension recommendations",
        "content": "I use Microsoft Edge for streaming, and I want to build a complete power-user setup that covers every aspect of the player. I’m tired of installing random extensions that break the site or cause lag.\n\nI am looking for the best, most stable extensions for **Netflix and Amazon Prime** that handle the following needs without side effects:\n\n1. **Playback &amp; Speed:** Reliable speed controllers (like Global Speed) that work smoothly for speeding up slow content without distorting audio.\n2. **Automation:** Extensions that actually work to auto-skip intros, recaps, and Prime Video pre-roll ads so I don't have to touch the mouse.\n3. **Subtitle Power:** Tools for dual subtitles (for learning) or better subtitle customization (font/size/background) beyond the default settings.\n4. **Audio Enhancement:** Volume boosters or equalizers for movies with low dialogue volume.\n5. **Visual Tweaks:** Video filters (brightness/contrast/saturation) for dark scenes and Ultrawide monitor support (to remove black bars).\n6. **Quality Control:** forcing 1080p/4K bitrate without triggering DRM black screens.\n\nBasically, I want a \"Swiss Army Knife\" setup that makes streaming efficient and customizable.\n\nIf you have a specific list of extensions that play nice together on Edge, please share them!\n\nThanks.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qqs0pq/edge_building_the_ultimate_productive_streaming/"
    },
    {
        "id": "1qqrvg2",
        "author": "cadence_99",
        "title": "Warrior Nun",
        "content": "I just finished watching second season of Warrior Nun and realised that netflix cancelled s3. But why? I think the series is pretty good, not great but i enjoyed it while it lasted. I think they should continue it. \nJust feeling a bit disappointed. I was curious with what's going on with the Reya part tho.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qqrvg2/warrior_nun/"
    },
    {
        "id": "1qqpp3y",
        "author": "Critical-Willow-6270",
        "title": "New episodes of shows not appearing on continue watching queue",
        "content": "I have a question about something that's really annoying me about Netflix. It seems like every time one of my shows has a new season or episode, it dosen't show up on my continue watching list. Does this happen to anyone else and if it does, is it aggravating you?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qqpp3y/new_episodes_of_shows_not_appearing_on_continue/"
    },
    {
        "id": "1qqmxvp",
        "author": "mo_7anona",
        "title": "Bigger budget doesn’t mean better fantasy",
        "content": "&gt;\"The Letter for the King\" had a much smaller budget, but it felt more focused in its storytelling, character arcs, and overall direction. In comparison, The Last Knight of the Seven Kingdom clearly benefits from a huge production budget and looks \"impressive\", but for me it lacked the same narrative cohesion and emotional weight.  \n  \n**big budget ≠ quality**\n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qqmxvp/bigger_budget_doesnt_mean_better_fantasy/"
    },
    {
        "id": "1qpp1xi",
        "author": "AmIbi69",
        "title": "Go watch Future man",
        "content": "Great show. never hear anybody recommend it. The series follows an underachieving janitor who is called upon to save the world. It's fucking hilarious. ",
        "upvotes": 69,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1qpp1xi/go_watch_future_man/"
    },
    {
        "id": "1qqdujs",
        "author": "fuckindisturbed",
        "title": "Mantis Korean movie",
        "content": "I know some people don’t like watching Korean movies or shows but I promise this one and kill boksoon are a must watch. The English dubbed is not that bad for mantis, so if you don’t want to listen to it Korean you can still enjoy it in English. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qqdujs/mantis_korean_movie/"
    },
    {
        "id": "1qq36cj",
        "author": "PrizeStructure2467",
        "title": "Manhunt osama bin laden DOCUMENTARY is Awesome.",
        "content": "it is definitely worth watching, it contain 3 episode each approx 1 hour .The emotion and Real scene is awesome as hell . Netflix mentioned that some of scene according to research recreated,but all scene they showed during operation neptune is that staged or not I can't get . definitely deserve a watch ",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qq36cj/manhunt_osama_bin_laden_documentary_is_awesome/"
    },
    {
        "id": "1qq4slj",
        "author": "skibidi_i3",
        "title": "Bridgerton S4 or Cinderella?",
        "content": "Did they reallyyyyyy just copy the script of Cinderella?????  OHMYGOD what\nBridgerton Season 4 seems like a copy of Cinderella and like they didn’t even try to make some changes or what?! ",
        "upvotes": 6,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qq4slj/bridgerton_s4_or_cinderella/"
    },
    {
        "id": "1qqigjp",
        "author": "rackemronnie7",
        "title": "Any good romantic movies on netflix right now?",
        "content": "I’m in the mood for a good romantic movie, but I’m kind of out of the loop with what’s available lately. Does anyone have any recommendations for romantic movies on Netflix that are a must-watch? I’m into everything from classic love stories to newer releases. Would love to hear your favorites!",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qqigjp/any_good_romantic_movies_on_netflix_right_now/"
    },
    {
        "id": "1qqqwu6",
        "author": "902Gal",
        "title": "Slimy promotion of Spinning Out in 2026",
        "content": "Netflix is promoting Spinning Out on my home page and it makes me irrationally angry because I loved this show when it came out and was so sad when they didn’t renew it after the first season. To see them promote it again 6 years after its release just because ice skating is getting hyped up with the Olympics coming up again and they have another new ice skating show makes me crazy.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qqqwu6/slimy_promotion_of_spinning_out_in_2026/"
    },
    {
        "id": "1qq6v9n",
        "author": "TortorClassics",
        "title": "Season 4 Bridgerton",
        "content": "Watched the trailer, and I’m on season 4 episode 1 already. I find it a bit lackluster since its looking kind of a spinoff on Cinderella 🫠 but what do you think?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qq6v9n/season_4_bridgerton/"
    },
    {
        "id": "1qqfwg6",
        "author": "Little_Sain",
        "title": "Account issues",
        "content": "Hello yall, I wanted to cancel my subscription but figured out I'm not paying from any account and also seem to be subscribed trough Foxtel. I don't even know what Foxtel is but looking at the .au domain it's Australian. Anyone had this happen before? Netflix can't help me and sends me over to Foxtel...",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qqfwg6/account_issues/"
    },
    {
        "id": "1qq19l0",
        "author": "pjand08",
        "title": "Suggest me some good sitcoms which has seriousness at times like young sheldon",
        "content": "I’m looking for sitcom recommendations that balance humor with some real emotional depth — not just nonstop jokes, but actual character growth and meaningful relationships.\n\nSomething with a vibe similar to Young Sheldon would be perfect: light and funny on the surface, but with serious moments that hit unexpectedly hard. I really like shows where teen characters have strong bonds, especially brother–sister dynamics or a sweet, realistic teen love story that develops over time instead of feeling forced or overdramatic.\n\nSchool or family settings are a big plus. I want awkward phases, misunderstandings, growing pains, and those quiet scenes where characters actually talk about what they’re going through. Basically, comedy with a heart — where you laugh one minute and get emotionally attacked the next.It should be live action not animation.",
        "upvotes": 2,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qq19l0/suggest_me_some_good_sitcoms_which_has/"
    },
    {
        "id": "1qq6f6l",
        "author": "ChloroFluoroCarbonCC",
        "title": "Why they are not releasing Dragon ball z's 7th season?(Netflix India)",
        "content": "Every month, the new season is released on 15th but since the last season, which was in December, they didn't release the new season nor they gave update on anything. DBZ is nowhere else available in Japanese with Eng subs and now they are also not releasing. Do you guys have any update regarding this?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qq6f6l/why_they_are_not_releasing_dragon_ball_zs_7th/"
    },
    {
        "id": "1qpko3h",
        "author": "Ok_Future7107",
        "title": "finding her edge- my personal thoughts (its pretty bad but im just gonna admit it- it was a decent binge watch",
        "content": "okay so i fully agree with everyone, brayden and adriana have insane chemistry, they NEED to be endgame  \nbut im so perplexed by the persuasion parallel like i didn't even know that was part of the plot until her sister kept reading jane austen and i just searched up about the show to find out later. Truthfully, if they'd tried to do a modern adaptation of it then ending up with freddie should've felt right\n\nQuite frankly, they should've switched brayden and freddie, give brayden (as freddie's role) more screen time so it adds up to the persuasion plot. If they wanted this show to be a second chances trope it clearly backfired super hard  \nMoreover, i'm pretty sure by the public outrage s2 endgame is most likely going to be braydriana. Riley and Brayden will not work out and neither will freddie and adriana. I hope Adriana and Freddie get the closure they deserve tho\n\nI'm a huge fan of this whole figure skating romance trope. I really liked spinning out and i was super bummed when it was discontinued, i was hoping for this to be bettter\n\nPS- is there anyone who's a fan of adriana and freddie ??? bc as soon as i finished the show and opened insta- all i could see was just insane braydriana love, like yeah their chemistry was off the charts but i couldn't help but feel for the whole freddie and adriana trope too. The moments they had were more emotional and intimate otherwise. ",
        "upvotes": 13,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1qpko3h/finding_her_edge_my_personal_thoughts_its_pretty/"
    },
    {
        "id": "1qqmdfu",
        "author": "Xongxilly69",
        "title": "Alex Honnold climbing that skyscraper was actually not that risky",
        "content": "Maybe it’s because I watched the documentary, but I never once thought “omg he’s gonna fall” while watching that. He knows what he’s doing. Sure, it was nerve wracking, and it being live added an element of uncertainty. But he was never going to (and didn’t) fall. That building was not as tall as El Capitan and he practiced it many times, so the risk of him falling was actually quite low. I think the only reason people freaked out was because it was in an unnatural environment (a city and not out in nature). I’ve seen so many people online criticizing him, calling him inconsiderate at times because he has a wife and kids and people watching him. I don’t really get it.",
        "upvotes": 0,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1qqmdfu/alex_honnold_climbing_that_skyscraper_was/"
    },
    {
        "id": "1qpt7l7",
        "author": "Lonely-Flower-2308",
        "title": "The Residence unexplained detail.",
        "content": "So I know this show is nothing new but my wife and I just got done watching it. We really enjoyed the story and wished it was a real book series so they could continue the character. But one detail that was not explained to my recollection is \"Where did the blood in the Lincoln bedroom that Kylie Minogue found come from?\". Maybe I missed it but any answer would be appreciated. Thank you",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qpt7l7/the_residence_unexplained_detail/"
    }
]