[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 711,
        "comments": 5203,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1o0s46h",
        "author": "Substantial_Copy_576",
        "title": "Anyone else stopped new TV shows until it has finished?",
        "content": "It’s not just Netflix but every single streaming platform out there are taking 2-3 years per season.\n\nIt’s super annoying, by the time the new season arrives, I barely remember anything about the show and all hype is long gone.\n\nHonestly, I’m skipping a lot of shows until it’s pretty much confirmed for final season or nearing it.\n\nAnd I definitely skip Netflix’s 2 part releases until they are all out. E.g. Wednesday season 2\n\n",
        "upvotes": 110,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1o0s46h/anyone_else_stopped_new_tv_shows_until_it_has/"
    },
    {
        "id": "1o0zet1",
        "author": "Individual-Cut9977",
        "title": "Need new Netflix show recs that actually keep you hooked",
        "content": "I just finished my last series and now Im stuck scrolling for something good Everything either feels too slow or gets boring after a few episodes\n\nWhat are some shows on Netflix that pulled you in right away and actually stayed good till the end",
        "upvotes": 29,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1o0zet1/need_new_netflix_show_recs_that_actually_keep_you/"
    },
    {
        "id": "1o0kro4",
        "author": "croissantdeprived",
        "title": "Finally, Nurse Jackie is on Netflix!",
        "content": "7 seasons, 80 episodes of absolutely bingeable, brilliant tv.\n\nI've been waiting forever for this to stream on a service with no ads.\n\nIf you haven't seen it, you should. Witty dialog, complex storylines, well developed characters. Amazing acting, especially by Edie Falco and Merritt Wever. ",
        "upvotes": 118,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1o0kro4/finally_nurse_jackie_is_on_netflix/"
    },
    {
        "id": "1o0w83p",
        "author": "sbailey7643",
        "title": "I actually enjoyed the Ed Gein Story",
        "content": "I have seen a lot of negative back lash regarding the series, but I actually enjoyed this season. \nFrom researching a bunch of the case, I find a lot of accuracy, and less inaccuracies. \nWhat are your thoughts?",
        "upvotes": 25,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1o0w83p/i_actually_enjoyed_the_ed_gein_story/"
    },
    {
        "id": "1o14cqj",
        "author": "WinterMortician",
        "title": "My hubby pointed out this comparison of Charlie Hunnam’s Ed Gein— it’s surprisingly laughably accurate and now I can’t unsee it.",
        "content": "We loved the Dahmer limited series, so thought we would give this one a try. There was immediately something about it that left me unable to take it seriously; hubby pointed out this comparison last night and I will never unsee it, because it’s *absolutely 500% accurate.* Would love to hear your guys’ thoughts or if it’s worth going past the first episode 😂 \n\n____\n\nEdited to add that C.H. was lookin right tho, in terms of his build, so good for him!",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1o14cqj/my_hubby_pointed_out_this_comparison_of_charlie/"
    },
    {
        "id": "1o13lj2",
        "author": "BunnyBunny777",
        "title": "California bans loud commercials on Netflix (and others)",
        "content": "Newsom singed the bill effective 2026.  This should be a federal law.  Watching a show only to have a commercial suddenly start blaring 25 db louder is just menacing.  ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o13lj2/california_bans_loud_commercials_on_netflix_and/"
    },
    {
        "id": "1o118jb",
        "author": "No_Resolution315",
        "title": "\"Never Have I Ever\"- the only show where they show high school as it is?",
        "content": "As a fan of american teen dramas, i feel like \"Never have i ever\" is the only show where they show school like as it is. And where teenagers behave like teenagers not some 35 year olds with bunch of experience and shit. \n\nAlso, in this show, there are like class breaks, projects, extra credits and everything. And other shows be like girls trying hard to be the \"it\" girl. Cross-Sleeping with everyone in a particular gang. Drugs, bullying, and everything but actualy studying or schooling. \n\nOr does schools in america are actually like that? As an indian myself, \"Never have i ever\" was the only show that comes comparitively close to how we knew school as. ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o118jb/never_have_i_ever_the_only_show_where_they_show/"
    },
    {
        "id": "1o10vjr",
        "author": "NjXLoneWolf",
        "title": "The Ed Gein Story. Didn’t love it. Didn’t hate it.",
        "content": "I just finished the last episode, and I believe the show was intended to be more of a social commentary, almost borderline satire. I didn’t hate it but didn’t love it either. At first I was getting annoyed by the clear inaccuracies, or embellishments and what seemed like lazy writing. It feels more like the show was designed to critique modern fascination with blood lust, and the twisting of stories by the media, authors, writers, movies, etc. for entertainment. The girlfriend seemed more like a schizophrenic hallucination or possibly a symbol of a textbook female lover in a horror story. She didnt feel like a real character. Her dialogue was off, she was inconsistent, and unrealistic. I think that was the point. They didn’t want to spell the underlying message out for the viewers. \n\nNow with all that said, I wish they didn’t go about it this way. This show had real potential to be great. It was shot well, the music was good, good actors, interesting dialogue at times, the real story was crazy enough. But there were many scenes that were forced in there with no significance. Pulling you out of the story and into one of Ryan Murphy’s strange fantasies. Also the title is misleading, the title “The Ed Gein Story” gives the impression this is a somewhat accurate representation of the actual Ed Gein Story. It is far from that. While i finished the show, i lost interest halfway through episode 6. I honestly wouldn’t recommend it. Watch Mindhunter or American Primeval instead lol. \n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o10vjr/the_ed_gein_story_didnt_love_it_didnt_hate_it/"
    },
    {
        "id": "1o12gzd",
        "author": "Bright_Elk2942",
        "title": "Halo on Netflix",
        "content": "First, I’d like to say there have been far too many shows canceled—not because they were bad, but because they were either poorly marketed or not well produced. And trust me, I’ve watched plenty of discontinued shows in my life that deserved a second chance.\n\nWe often talk about books—some people read them, others don’t. But think about Game of Thrones and the impact it had once it became a TV series. Now, we’re seeing something similar with Halo.\n\nUnlike Game of Thrones, Halo began as a video game—one with a rich, well-written story, deep characters, and an expansive universe. It’s unfortunate that the show was discontinued, but with the right creative vision and marketing—especially now that it’s on Netflix—it has the potential to be reimagined into something incredible.\n\nSo, to get things moving toward a potential Season 3, the first two seasons need to attract strong viewership numbers. That’s the key factor studios will look at before making any decisions. Ultimately, it all comes down to marketing—not just the fact that it’s now on Netflix, but how it’s promoted and presented to draw in both longtime fans and new audiences.\n\nThe real test lies in how future seasons are produced and promoted. That’s what will either bring Halo back to life or cause it to fade away. The story itself is already solid; it all depends on how the storyteller chooses to tell it.\n\nHalo has one of the most cinematic and emotionally layered storylines in gaming—packed with lore, complex characters, and massive world-building potential. The original TV adaptation didn’t fail because of the source material; it struggled due to uneven pacing, inconsistent tone, and marketing that didn’t capture what made the games special.\n\nNow that it’s on Netflix, the opportunity is huge. Netflix knows how to build global hype and reach audiences at scale. If they focus on storytelling first—treat Halo with the same level of seriousness as Game of Thrones or The Last of Us—and back it with smart, emotional marketing, Halo could easily become a breakout hit.\n\nIn short:\nThe story’s there.\nThe fan base is there.\nThe potential is there.\nIt just needs the right storyteller and direction to bring it to life.\n\nThe humanity of the story is there. The Halo universe is massive enough to keep viewers fully immersed. The visuals already capture grounded realism. What’s needed now is a simplified plot, stronger character focus, and refined storytelling that stays true to the heart of the game’s lore.\n\nIf Netflix follows those steps—focusing on storytelling, authenticity, and emotional depth—Halo could genuinely become the next Game of Thrones for sci-fi fans.\n\n⸻\n\n🔍 Current Situation\n\t•\tHalo has completed two seasons.\n\t•\tThe series was canceled by Paramount+ in mid-2024.\n\t•\tNetflix has picked up Seasons 1 &amp; 2 for streaming, giving it a much wider audience.\n\t•\tThere’s renewed fan interest and a growing buzz now that it’s on Netflix.\n\t•\tHowever, there’s still no official confirmation that Season 3 will be greenlit.\n\n⸻\n\n⚙️ What Needs to Happen for Season 3 to Take Off\n\t1.\tData &amp; Viewership: Netflix will monitor performance metrics like viewership, watch time, and retention. Strong numbers will strengthen the case for renewal.\n\t2.\tRights &amp; Deals: Since the show originated from Paramount+, negotiations over rights, funding, and cast contracts would need to be resolved.\n\t3.\tBudget &amp; Cost Control: Sci-fi is expensive. Season 3 must balance spectacle with storytelling efficiency.\n\t4.\tCreative Direction: A unified vision is essential. Addressing past criticisms—like pacing and lore accuracy—will help regain fan trust.\n\t5.\tMarketing &amp; Messaging: A fresh campaign should highlight the emotional and epic scale of the story, while promising resolution to lingering threads like The Flood and Installation 04.\n\n⸻\n\n🧭 Story Directions for Season 3\n\nIf Season 3 moves forward, it should build on what’s been established while setting up the long-term arc of the Halo universe.\n\nMajor story threads to carry forward:\n\t•\tThe Flood has been introduced—this should become the central threat.\n\t•\tThe Halo ring (Installation 04) must now take center stage, with its mysteries and dangers explored.\n\t•\tThe moral and emotional journey of John-117 and his bond with Cortana should remain at the heart of the story.\n\t•\tGrowing tension within the UNSC and ONI, with political and ethical dilemmas that challenge every character.\n\t•\tThe Covenant’s internal conflicts, adding new layers of intrigue and perspective.\n\nWith the right production, storytelling focus, and creative leadership, Halo has the potential to span 8–10 successful seasons—a true sci-fi epic that could redefine video game adaptations for television.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o12gzd/halo_on_netflix/"
    },
    {
        "id": "1o0qibm",
        "author": "Sudden_Pop_2279",
        "title": "I think what makes Alice in Borderland one of my favorite shows is that it ACTUALLY has a justified reason for having such insane plot armor",
        "content": "Alice in Borderland has some... pretty crazy plot armor. ESPECIALLY in season 2 episode 7, where we had Heiya straight up take a full mag of a machine gun and survive HOURS later (while funnily enough, Ann \"died\" from two shots).\n\nNiragi was by far the craziest example. Dude got lit on fire, fell off the building into the pool, tackled into a burning building, was coughing up blood all of seaosn 2 and then took a shotgun blast, ALL of which he survived.\n\nWhat I love so much is that the show ACTUALLY has an explination for such insane plot armor; the will to live. The Borderland's are a test of how much each character wants to survive (the games). The stronger your will, the more likely you are to live. That's why someone like Heiya can take so much punishment, because she's made it clear she does NOT intend to die\n\nIt makes moments when you're on rewatch hit different, like when Usagi tells Arisu in episode 2 \"I know I'll do anything to stay alive\".",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o0qibm/i_think_what_makes_alice_in_borderland_one_of_my/"
    },
    {
        "id": "1o14c52",
        "author": "eclipse91017",
        "title": "Why don’t people like Monsters: The Ed Gein Story?",
        "content": "Besides the last episode, that was almosy complete fiction, I loved this series with its tragic childhood, obsessive Christian mother, gynephiliac themes, schizophrenia, and psychosis. Charlie Hunman played a extraordinary Ed Gein.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o14c52/why_dont_people_like_monsters_the_ed_gein_story/"
    },
    {
        "id": "1o142qx",
        "author": "TopTierProphet",
        "title": "I just watched the katseye show on netflix and here's my review of the girls who didn't make it to the final six.",
        "content": "First off, all of these girls are much more talented than 99% of people in the world. They are the most talented of the talented, and would completely blow average joe or sue out of the water in terms of musical ability. So when I am criticizing these girls, i'm criticizing them relative to other girls on the show.\n\n**Brooklyn:** Brooklyn always seemed out of place compared to the other girls. She was like a cross country runner in a room full of sprinters, she just seemed like she didn't belong. That doesn't mean she was untalented, it just meant that she didn't fit the overall vibe compared to other girls. I think that's a big reason why she was eliminated so early.\n\n**Iliya**: She was similar to Brooklyn in that she seemed like a cross country runner trying to be a sprinter, meaning she seemed out of place compared to the other girls. There's no doubt that Iliya is a talented singer, but she doesn't fit the k-pop vibe. I feel like she'd have been a more successful solo artist instead.\n\n**Emily:** Emily has a very distinctive look about her. Her face is distinctive looking but not in an unappealing sort of way. No doubt, she is a very talented dancer and was easily the best out of the entire group. I could see her becoming a very good backup dancer somewhere.\n\n**Karlee:** I think she was eliminated simply because she's a step or two lower compared to other girls. She didn't stand out as being attractive, didn't stand out as being a really good dancer, or stand out as being a really good singer. There were girls who were simply better looking and more talented compared to her across all aspects. Her chances of making the final squad were going to be low.\n\n**Lexi:** Lexi had such a cute and innocent looking face and demeanor about her. Her face is quite cute and neotenous and when combined with her soft spoken personality, this made her stand out in terms of charisma and star power. While not a top singer or top dancer, she was good enough to not look completely out of place. If she'd have never left, she probably would have made the team.\n\n**Hinari:** I didn't see anything wrong with Hinari but I think she was a little bit too young. If she'd have been a couple years older, she may have had a better chance of making it.\n\nThat's everyone who stood out to me.\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o142qx/i_just_watched_the_katseye_show_on_netflix_and/"
    },
    {
        "id": "1o0bnmo",
        "author": "ADMlN-",
        "title": "Ed Gein series felt insulting and narcissistic",
        "content": "From a purely horror, acting and even artistic standpoint, this was well done, but it was just wayyyy too try-hard. \n\nIt feels as if Ryan Murphy is insulting us as viewers. He thinks we are too dumb to understand what he's trying to deliver, so he repeats his messages in as many drawn out disturbing ways as possible.  \n\nAnyone else feel this way?  ",
        "upvotes": 32,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1o0bnmo/ed_gein_series_felt_insulting_and_narcissistic/"
    },
    {
        "id": "1o12se7",
        "author": "miyyukii",
        "title": "Any websites to recommend that allows me to watch love island au/usa/uk from season 1?",
        "content": "i’m from singapore and i really like this series but i’m only able to watch seasons 4 &amp; 5 from netflix :( i have been trying to find a website that works and has episodes from season 1 but can’t, please help! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o12se7/any_websites_to_recommend_that_allows_me_to_watch/"
    },
    {
        "id": "1o0e7iq",
        "author": "ElectroElk31",
        "title": "Catch Me If You Can, would a Frank Abagnale style con work today or would tech stop it?",
        "content": "Just finished rewatching Catch Me If You Can and I keep getting stuck on how much of Abagnale’s success relied on people trusting a confident story and paper records. He forges checks, pretends to be pilots and doctors, and basically wins on smooth talk, timing, and exploiting gaps in how institutions verified things back then. Looking at 2025, there are two clear directions. Modern banks, airlines, and employers have more automation, KYC checks, instant database lookups, and cross-referenced ID services that can flag fakes in seconds. A fake resume or a paper letter seems much harder to use to fool those systems. Digital trails and audit logs make it easier to trace and stop suspicious activity.\n\nBut there’s also a huge amount of real personal data out there from breaches and data brokers, and that can be stitched together to build very believable identities ( I myself try and remove and monitor these with privacy apps like Cloaked). Deepfakes and AI can clone voices or make convincing video snippets. Human trust is still a major vulnerability: social engineering works because people rush, want to help, or assume an authority figure is legitimate. A modern operator could combine old-school charm with new tech  build an online persona first, then use carefully timed phone or in-person moves to close the deal. Some targets would be harder today and others are still shockingly soft. Big finance, enterprise HR, and major airlines are much tighter. Small hospitals, local businesses, and customer-support teams at smaller services often rely on phone calls and quick checks, which feels like low-hanging fruit. Logistics and delivery systems can also be manipulated if you know the right touchpoints.\n\nMy mental image of a 2025 Abagnale is someone who layers things: scraped data to bootstrap a backstory, polished social media and LinkedIn history, AI-generated voice clips for cold calls, and then a confident in-person moment where people fill in the blanks. Or it could be less theatrical and more distributed: exploit gaps in onboarding flows, trick CS systems, and collect many small wins across dozens of targets instead of one big caper.  \nWould a charismatic impersonator still pull it off today, or has tech made that kind of con obsolete? If someone tried something like this now, where would you expect them to succeed first and where would modern verification stop them quickly? Any examples of modern scams that felt like a Catch Me If You Can remake but for the internet age?",
        "upvotes": 25,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1o0e7iq/catch_me_if_you_can_would_a_frank_abagnale_style/"
    },
    {
        "id": "1o129ky",
        "author": "writeitout_",
        "title": "One thing that I just DID NOT understand about the pool scene (Wayward full series spoiler incoming)",
        "content": "&gt;!How did Jess die by drowning in a freaking pool? Is it because she was drunk and fully clothed? is the show /really/ trying to make us believe that Leila killed her? Why not set it in a river or something more dangerous? She could have hit her head or something?!! I was watching the scene of her drowning and I could NOT get myself to believe it. Anyone else.!&lt;\n\n(I actually really liked the series as a whole) ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1o129ky/one_thing_that_i_just_did_not_understand_about/"
    },
    {
        "id": "1o1259n",
        "author": "ParagonConsequence",
        "title": "Black screen",
        "content": "I'm on an android phone, and no matter what I do, no video plays when I try to watch something. I have re-installed, cleared cashe, re-started phone, checked updates, checked android updates, everything the EXTREMELY limited trouble shooting tip tells me to do. \n\nSo I am here on Reddit, asking y'all. \n\nI can see everything in the app, can select shows, and navigate to individual episodes. All that works fine. When I hit play tho, I get audio, the play bar and interaction tools are visible and viable, but NO picture. This has persuaded for WEEKS. Please tell me something that I haven't tried. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o1259n/black_screen/"
    },
    {
        "id": "1o1100b",
        "author": "TheAlmighty3",
        "title": "Everything wrong with Alice in Borderland Season 3 and how to fix it",
        "content": "I just finished Alice in Borderland Season 3, and honestly, it’s bad. People are going to say we should just be happy it exists, but that’s not an excuse. The show had everything it needed to be great, yet it ended up being a mess.\n\nThe first issue is memory. Out of nowhere, people start remembering what happened in the Borderland. Season 2 made it clear that everyone forgot, but now some remember everything while others remember little pieces. It’s confusing and inconsistent.\n\nThen there’s the guy in the wheelchair. He adds nothing to the story. His only role is to steal Alice’s wife. How did he convince Usagi to go back to the Borderland? The show never explains. We’re told he promised she’d see her father again, but she already had that chance and didn’t see him. Why believe him this time? The scene where she “sees” her father was just a dream, not real. Usagi went from being strong and smart to acting without logic.\n\nAlice’s return makes no sense either. A citizen supposedly planned it all, but how does killing Alice’s pregnant wife make him want to stay? It’s ridiculous.\n\nThe new characters are useless. None of them have depth or backstory. The only one who seemed interesting, the yakuza, dies in a weak way, and we never learn his past. Meanwhile, Usagi keeps playing random games without any real reason or goal.\n\nThe pacing is terrible. There are too few episodes, so everything feels rushed. The final game is especially bad. The characters make dumb choices, and logic disappears. Alice literally saw a vision where the man in the wheelchair killed his wife, yet he still trusted him. The old characters show up for a few seconds, just for fan service, and then vanish again.\n\nTo fix it, the story should have started with the earthquake idea. That could have naturally brought Alice and the others back. They could even show the earthquake causing a massive tsunami that hits Los Angeles, setting up a new storyline.\n\nUsagi could have met her father in a game where he’s revealed to be one of the citizens. That would make sense and give her real emotional depth instead of turning her into a confused and irrational character.\n\nAnd most importantly, don’t rush it. Make two seasons instead of one. Give time for the story, the characters, and the emotions to grow. That’s how Alice in Borderland could have stayed great.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1100b/everything_wrong_with_alice_in_borderland_season/"
    },
    {
        "id": "1o0wc9g",
        "author": "Impressive_Dingo4333",
        "title": "Ad supported bug",
        "content": "Is it just me or does anyone that have ad supported plan sometimes run into unable to fast forward or rewind the show or movie your watching it happen a few times since I signed up my last question got auto modded and deleted ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o0wc9g/ad_supported_bug/"
    },
    {
        "id": "1o0sxjn",
        "author": "AggravatingTartlet",
        "title": "Loved Wayward and would love to see more like it!",
        "content": "I don't currently have a Netflix sub. I heard about Wayward and went to watch it with a friend at their house over three nights. Am glad I did as we both loved the show! \n\nThe  late 80s/early 90s setting feels so right for the show and what it's about (a school for wayward kids).\n\nYes it's light entertainment, and just so entertaining all the way through. So impressed that Mae Martin conceived the story, wrote it, produced it, directed it, was a co-show runner AND starred in Wayward. Incredible.\n\nI have rarely seen teenage girls depicted the coming-of-age way they are in Wayward. It's almost always boys who are given those kinds of roles, while the girls play the sensible roles and act as \"prizes\" for the boys once the boys either \"win\" or learn to tame themselves.\n\nAnd wonderful to have Mae playing the part of a trans man in a relationship with a woman, and it's just accepted without question in the show. I loved her in this. And then you have all the strong female roles in the show. Toni Collette is amazing (as always) as the one who runs the school.\n\n\n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o0sxjn/loved_wayward_and_would_love_to_see_more_like_it/"
    },
    {
        "id": "1o0ta20",
        "author": "miyyukii",
        "title": "Any similar shows to Alice In Borderland?",
        "content": "i absolutely love this series and would like to find similar netflix series to keep myself entertained! \n\nthe only closest series to this type of survival show i’ve finished watching is squid game &amp; the8 show",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o0ta20/any_similar_shows_to_alice_in_borderland/"
    },
    {
        "id": "1o0kjo5",
        "author": "StraightRaspberry952",
        "title": "any show thats wholesome or lighthearted plssss",
        "content": "idk what to watch anymore!!!!!!!\n\nmaybe theres something that got u hooked on the very first episode????\n\nkorean, american or japanese series long as theyre a good watch im down",
        "upvotes": 5,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1o0kjo5/any_show_thats_wholesome_or_lighthearted_plssss/"
    },
    {
        "id": "1o0r1lf",
        "author": "PieNo3510",
        "title": "I'm So Mad About Monsters: Ed Gein",
        "content": "I was skeptical after seeing the promotional photos and the fact that they seemed to depict Ed Gein in some sort of romantic scenario because I didn't ever remember that being part of the story, but man, was I way more disappointed than I had anticipated. Ryan Murphy has a tendency to bring a lot of camp to his work and jump the shark often, so in general I don't expect much from him. That being said, the Dahmer series was incredible. They told a 95% accurate story and it felt like they introduced creative liberties only when necessary (i.e. the glorious Niecy Nash) and they even found creative ways to show a different narrative, like the POV of Tony Hughes. I don't know why they didn't do that for the Ed Gein. I get that they wanted the audience to know how much of an impact his crimes had on the horror genre, but the whole thing was completely ham-fisted. Not to mention the mixture of fact (which allotted to about 5% of the show) and fiction adds confusion to what his influence actually was. Plus all of the jumping around was just confusing. My boyfriend doesn't even care about true crime and he hated it. \n\nI know some people liked it for the creative take on the story and that part of it reflected his mental state as he was doing these things, fine, but in my opinion it was TOO creative a take. The true story of Ed Gein is fascinating and horrifying enough without all of the liberties they took (damn you, Ian Brennan), and to me it was just a wasted opportunity to tell a good story. It definitely makes me hesitant to watch further Monsters.   \n  \nThat being said, Charlie did an amazing job. Yes, at times he sounded like the Abominable Snow-Rabbit from Looney Tunes, but overall he really stepped into the role. I just wish he had been able to showcase his talent with something more worthwhile. ",
        "upvotes": 2,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1o0r1lf/im_so_mad_about_monsters_ed_gein/"
    },
    {
        "id": "1o0zbsw",
        "author": "RemarkableLab433",
        "title": "Shows",
        "content": "I lost my grandpa in March so finding shoes to watch alone is hard\nI want a show only 1 u suggest that is like a thriller kinda I love twists and turns and edge of ur seat shows . I don’t want slow or anything kinda shows that you will get hooked quick and not wanna stop \n\nIf u can explain your choice please ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o0zbsw/shows/"
    },
    {
        "id": "1o0jz7b",
        "author": "Bone_Dirty",
        "title": "No Halloween section",
        "content": "Typically on Netflix during October there is a Netflix &amp; Chills category or they will boost horror films and have sub sections recommending different scary movies. I just scrolled down the entire Home Screen and not one single section had a horror movie category or even recommended a single scary movie, aside from the Ed Gein story. The last 3-4 movies I’ve watched have been horror films (I had to search the individual title to find them) so I don’t think it’s an algorithm thing. But idk. Has Netflix said they aren’t supporting the spooky season this year? Did I miss something and Halloween stuff is out? The new UI is a bit annoying for me to navigate so maybe I’m just old. Anyone else notice the lack of holiday spirit this year on Netflix?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o0jz7b/no_halloween_section/"
    },
    {
        "id": "1nzotzy",
        "author": "camwtss",
        "title": "does ANYONE like the ed gein series?",
        "content": "im bummed because i was really looking forward to watching this, but i have seen nothing but negative comments about it. did anyone enjoy it? or is it a waste of 8 hours.",
        "upvotes": 226,
        "comments": 550,
        "media": null,
        "permalink": "/r/netflix/comments/1nzotzy/does_anyone_like_the_ed_gein_series/"
    },
    {
        "id": "1nzv2dk",
        "author": "Adventurous_Ant5428",
        "title": "Why didn’t Alice in Borderland ever gain popularity like Squid Game?",
        "content": "Kind of similar premise involving survival games, so why didn’t Alice in Borderland seem to gain as much traction? It has a more complex storyline and the games are arguably more interesting. ",
        "upvotes": 80,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1nzv2dk/why_didnt_alice_in_borderland_ever_gain/"
    },
    {
        "id": "1o0o2q4",
        "author": "Jaisietoo",
        "title": "How do I watch the full credits?",
        "content": "I'm watching Stranger Things at the moment and it's really annoying when at the end of each episode the credits just cut off. There isn't any option to continue watching credits - clicking the window in the top corner will just restart the episode.\n\nDoes anyone know how to make it stop cutting the credits off on the TV?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o0o2q4/how_do_i_watch_the_full_credits/"
    }
]