[
    {
        "id": "1kcdwx5",
        "author": "VulcanizadoraAMA",
        "title": "Hi, r/movies. It's Joel Potrykus, writer/director/editor of VULCANIZADORA, and leading man Josh Burge. This is our fourth film together after APE, BUZZARD, and RELAXER. VULCANIZADORA is a bleak comedy-thriller about friends who embark on a disturbing mission in the woods. Ask us anything if you dare",
        "content": "What's up, cine-freaks. It's writer/director/editor/actor Joel Potrykus and leading man Josh Burge. We've been making movies together for a long time, starting with APE (2012), BUZZARD (2015), and RELAXER (2018). Our new film VULCANIZADORA opens in theaters today, May 2nd, starting at the IFC Center in NYC and expanding in the coming weeks. Find a screening near you at vulcanizadora.oscilloscope.net. \n\nCheck out the trailer here: [https://youtu.be/S80Jz\\_ob8-U?feature=shared](https://youtu.be/S80Jz_ob8-U?feature=shared)\n\nWe look forward to talking about movies and I guess literally anything else. Cheers. We'll be back tomorrow (Friday 5/2)( at 3:00 PM ET to answer your questions.\n\n",
        "upvotes": 35,
        "comments": 95,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/v1qp1vsfc7ye1.png?auto=webp&amp;s=bd93424a5fe8653d6ef8dda120d5375800a57254"
        },
        "permalink": "/r/movies/comments/1kcdwx5/hi_rmovies_its_joel_potrykus_writerdirectoreditor/"
    },
    {
        "id": "1kcpxna",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Thunderbolts* / The Surfer) Plus Throwback Discussions",
        "content": "# New Theatrical Releases\n\n[Thunderbolts*](https://old.reddit.com/r/movies/comments/1kcpug8/official_discussion_thunderbolts_spoilers/?)\n\n[The Surfer](https://old.reddit.com/r/movies/comments/1kcpuhw/official_discussion_the_surfer_spoilers/?)\n\n# 25th Anniversary Throwback Discussion Threads\n\n[The Flintstones in Viva Rock Vegas](https://old.reddit.com/r/movies/comments/1kcpumj/official_throwback_discussion_the_flintstones_in/?)\n\n[Frequency](https://old.reddit.com/r/movies/comments/1kcpunu/official_throwback_discussion_frequency_spoilers/?)\n\n[Where the Heart Is](https://old.reddit.com/r/movies/comments/1kcpupt/official_throwback_discussion_where_the_heart_is/?)\n\n\n\n\n# Still in Theaters\n\n[The Accountant 2](https://old.reddit.com/r/movies/comments/1k79o5r/official_discussion_the_accountant_2_spoilers/?)\n\n[The Legend of Ochi](https://old.reddit.com/r/movies/comments/1k79o78/official_discussion_the_legend_of_ochi_spoilers/?)\n\n[Until Dawn](https://old.reddit.com/r/movies/comments/1k79o90/official_discussion_until_dawn_spoilers/?)\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n[The Wedding Banquet](https://www.reddit.com/r/movies/comments/1k1tsqm/official_discussion_the_wedding_banquet_spoilers/?)\n\n[Warfare](https://www.reddit.com/r/movies/comments/1jwev1e/official_discussion_warfare_spoilers/)\n\n[The Amateur](https://www.reddit.com/r/movies/comments/1jwev63/official_discussion_the_amateur_spoilers/)\n\n[Drop](https://www.reddit.com/r/movies/comments/1jwevax/official_discussion_drop_spoilers/)\n\n[Freaky Tales](https://www.reddit.com/r/movies/comments/1jwevev/official_discussion_freaky_tales_spoilers/)\n\n[A Minecraft Movie](https://www.reddit.com/r/movies/comments/1jr0qff/official_discussion_a_minecraft_movie_spoilers/?)\n\n\n\n\n# On Streaming\n\n[Another Simple Favor](https://old.reddit.com/r/movies/comments/1kdg7p5/official_discussion_another_simple_favor_spoilers/?)\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)\n\n[G20](https://old.reddit.com/r/movies/comments/1k7zfzp/official_discussion_g20_spoilers/?)\n\n[2073](https://old.reddit.com/r/movies/comments/1k7zg0y/official_discussion_2073_spoilers/?)\n\n[Holland](https://old.reddit.com/r/movies/comments/1k7zg30/official_discussion_holland_spoilers/?)",
        "upvotes": 17,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1kcpxna/official_discussion_megathread_thunderbolts_the/"
    },
    {
        "id": "1kd4m4z",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Zoe Saldana's Neytiri in 'Avatar: Fire and Ash'",
        "content": "",
        "upvotes": 8611,
        "comments": 1149,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/r3rwsk846eye1.jpeg?auto=webp&amp;s=8b8956d3cb1ab3a4cdb45dfb58fe6ab18a98a8df"
        },
        "permalink": "/r/movies/comments/1kd4m4z/first_image_of_zoe_saldanas_neytiri_in_avatar/"
    },
    {
        "id": "1kddzas",
        "author": "BunyipPouch",
        "title": "Three years after cinematographer Halyna Hutchins was killed by a stray bullet on set, indie Western 'Rust' is being released in 115 theaters nationwide this weekend. Funds from the release will go to Hutchins’ family, mainly to her son.",
        "content": "",
        "upvotes": 1389,
        "comments": 175,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/iFGz9UvKGWU9D8ihCesSYorPFvJ9N6KRTPl8FK1M5FU.jpg?auto=webp&amp;s=f24a39d890c0df0bb448d64c0d74042a0ef6bed8"
        },
        "permalink": "/r/movies/comments/1kddzas/three_years_after_cinematographer_halyna_hutchins/"
    },
    {
        "id": "1kdfeoe",
        "author": "MarvelsGrantMan136",
        "title": "Rian Johnson Doesn’t Agree With Netflix CEO Over Movie Theater Model Being Outdated, Wants ‘Knives Out 3’ in as Many Theaters For as Long as Possible",
        "content": "",
        "upvotes": 1013,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xQP5np-ccFd3orSRF9yNkTBuJEb7SjBdImZhmSj4W2o.jpg?auto=webp&amp;s=3cf949b5c7fb9775c7f44c01fc85795764e8250f"
        },
        "permalink": "/r/movies/comments/1kdfeoe/rian_johnson_doesnt_agree_with_netflix_ceo_over/"
    },
    {
        "id": "1kd3nre",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Wes Anderson's 'The Phoenician Scheme'",
        "content": "",
        "upvotes": 2107,
        "comments": 107,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9sp7cb97zdye1.jpeg?auto=webp&amp;s=86eae7993487841685d5aa866d9405b9389e0e60"
        },
        "permalink": "/r/movies/comments/1kd3nre/new_poster_for_wes_andersons_the_phoenician_scheme/"
    },
    {
        "id": "1kd3da5",
        "author": "JonasKahnwald11",
        "title": "Official Poster for 'The Unholy Trinity' - Starring Pierce Brosnan and Samuel L. Jackson",
        "content": "",
        "upvotes": 1325,
        "comments": 191,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o36thw01xdye1.jpeg?auto=webp&amp;s=245cd122a91098eb1ec4df931947ce94d00c0dea"
        },
        "permalink": "/r/movies/comments/1kd3da5/official_poster_for_the_unholy_trinity_starring/"
    },
    {
        "id": "1kd6ef4",
        "author": "cmaia1503",
        "title": "Keanu Reeves, Sandra Bullock Reteam for Untitled Amazon MGM Romantic Thriller",
        "content": "",
        "upvotes": 669,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wbGUQUMWs8wgR5jv6ZZgZu6hfmNZF9JSDjZChhMhnys.jpg?auto=webp&amp;s=f159e46679255050aa523f7dd398fab57ff58817"
        },
        "permalink": "/r/movies/comments/1kd6ef4/keanu_reeves_sandra_bullock_reteam_for_untitled/"
    },
    {
        "id": "1kd42id",
        "author": "MarvelsGrantMan136",
        "title": "New Character Posters for 'The Fantastic Four: First Steps'",
        "content": "",
        "upvotes": 627,
        "comments": 110,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/txenz5l32eye1.jpeg?auto=webp&amp;s=8aca2c7b21c581075ee4ef1cbcdf0ad34541f8fc"
        },
        "permalink": "/r/movies/comments/1kd42id/new_character_posters_for_the_fantastic_four/"
    },
    {
        "id": "1kd6qo2",
        "author": "indiewire",
        "title": "‘Thunderbolts*’ and ‘Andor’ Redeem Struggling Franchises, While ‘Weapons’ Is the Year’s Best Trailer",
        "content": "",
        "upvotes": 339,
        "comments": 112,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4CnkaRrHQM7pKku-NHVzOHa2LqLuUzrTPKP6jrvPkt8.jpg?auto=webp&amp;s=b6e6175ea501d8149e2889dc09504bd2c94027ef"
        },
        "permalink": "/r/movies/comments/1kd6qo2/thunderbolts_and_andor_redeem_struggling/"
    },
    {
        "id": "1kcln9p",
        "author": "ContinuumGuy",
        "title": "Mississippi city where 'Sinners' is set has no movie theater, petitions for cast visit and public screening",
        "content": "",
        "upvotes": 8414,
        "comments": 192,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j66EWtopy-ntDUtWhbny_-8QfkKWPUITHeAeOGJzMTc.jpg?auto=webp&amp;s=9486e40f65bc5caf80bfba59b3ae931e27d4e0e9"
        },
        "permalink": "/r/movies/comments/1kcln9p/mississippi_city_where_sinners_is_set_has_no/"
    },
    {
        "id": "1kd60un",
        "author": "FilmWaffle-FilmForum",
        "title": "What “hated” movies do you love?",
        "content": "Battle: Los Angeles is the answer to this question for me. I genuinely think it’s a good alien invasion movie with great action. Yeah, it’s cliche but it’s definitely not as bad as people make it out to be in my opinion. \n\nWhat movie do you love despite being disliked by the majority of general movie goers? ",
        "upvotes": 228,
        "comments": 773,
        "media": null,
        "permalink": "/r/movies/comments/1kd60un/what_hated_movies_do_you_love/"
    },
    {
        "id": "1kd4z0j",
        "author": "mikedomert",
        "title": "How come there are almost no good dinosaur movies besides first Jurassic Parks and King Kong?",
        "content": "Given how popular and interesting topic dinosaurs are, it strikes me as odd that there are almost no movies about them. Everyone knows Jurassic Park movies, and Peter Jacksons King Kong is very good but it doesnt focus on dinosaurs.\n\nIs there some obvious movie I am missing, or do good dinosaur  movies just not exist?",
        "upvotes": 243,
        "comments": 524,
        "media": null,
        "permalink": "/r/movies/comments/1kd4z0j/how_come_there_are_almost_no_good_dinosaur_movies/"
    },
    {
        "id": "1kd6kzx",
        "author": "Gonstackk",
        "title": "Ruth Buzzi, comedy sketch player on groundbreaking series ‘Laugh-In,’ dies at 88",
        "content": "",
        "upvotes": 185,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nqcEHYSr2J34NJ5n_Rpbhuk7cvua8v2NjKgZCmQgY-8.jpg?auto=webp&amp;s=ffa77aeba19075bd03ee5d5f89b08fcfa58e8a55"
        },
        "permalink": "/r/movies/comments/1kd6kzx/ruth_buzzi_comedy_sketch_player_on_groundbreaking/"
    },
    {
        "id": "1kcyipj",
        "author": "herequeerandgreat",
        "title": "in honor of dogma's 25th anniversary, here are 25 fun facts about dogma",
        "content": "in the bar scene, jay can be seen nodding off in the background. this wasn't a gag. jason mewes was actually strung out on heroin during filming.\n\nprior to signing onto the movie, alan rickman only had two questions. would the angel wings be real and would his dialogue be filmed as written. kevin smith assured him that the wings would be real and the dialogue would be filmed as written. rickman enthusiastically signed on. \n\ngeorge carlin had recently lost his wife prior to filming and asked kevin smith if there was someway he could film his scenes with his wedding ring on because he didn't feel ready to take it off. smith noted how the normally very calm carlin was very nervous when asking. smith and carlin both decided that carlin would wear a band aid on the finger with the ring to hide it. however, this was actually unnecessary since cardinals are given special rings to wear. oh well. hindsight is 20 20.\n\nin a rare move for a kevin smith movie, the bulk of the movie was not shot in new jersey. rather, it was largely filmed in pittsburgh.\n\nalanis morissette was originally offered the role of bethany but she couldn't commit to it due to her world tour. by the time morissette was available, linda fiorentino had been cast in the role. smith gave her the role of god instead.\n\nkevin smith planned to make a sequel in the aftermath of 911 which would have focused on islam. the movie would have been about bethany's daughter who would have gone on an adventure to save humanity with the aid of jay and silent bob. smith eventually decided against it, deciding that the subject matter was too complicated for him to handle gracefully.\n\nrufus's line \"know him? that N word owe me 12 bucks\" was improvised by chris rock, one of only a few things that he ad libbed for the movie.\n\nan early draft of the script featured a scene where jay and silent bob sing.\n\nholly hunter was kevin smith's original choice for the role of god. this is why jay refers to god as \"the chick from the piano\" in the film. however, hunter was unavailable. emma thompson was also offered the role but she declined due to her pregnancy. \n\nbefore jason lee was cast as azarael, bill murray, adam sandler, and john travolta were considered. sandler was even offered the role but declined due to his commitment to big daddy. \n\nboth albert brooks and chevy chase were considered for the role of cardinal glick.\n\nthis movie was the first of 3 consecutive collaborations between kevin smith and george carlin. carlin was later cast in smith's films jay and silent bob strike back and jersey girl.\n\nwhen alanis morissette was unavailable to play bethany, janeane garofalo, joey lauran adams, and gillian anderson were also considered.  \n\nthe adulterer on the train is played by scott mozier, the film's co producer and a good friend of kevin smith.\n\nkevin smith approached robert rodriguez to direct the movie. rodriguez liked the script but felt that the film was super personal for smith and that he should be the one to direct it.\n\nin addition to being the most fantasy oriented of the view askewniverse movies, dogma also holds the distinction of being the only movie in the series where the protagonist is not a man.\n\nbefore howard shore was hired to compose the film's score, danny elfman was offered the chance but was unavailable. \n\nkevin smith actually wrote the movie before clerks was even a thought. however, upon listening to a radio interview with robert rodriguez about writing around your limitations, smith decided to put the project off and make clerks instead. he considered making dogma as his followup to clerks but decided that he needed more experience.\n\nthe mooby's playground was built specifically for the movie and was deliberately modelled like a meat grinder.\n\nkevin smith briefly toyed with making the end be god answering bethany's \"why are we here\" question with \"i've got just one word for you...plastics\" which would have resulted in everyone's heads blowing up.\n\nsamuel L jackson and will smith were both offered the role of rufus. \n\nin addition to writing, directing, and starring in the film, kevin smith also helped puppeteer the wings on the angels. \n\nif you look very carefully, you'll notice that all the angels are dressed the same way. the only difference is the colors of their outfits.\n\ngwyneth paltrow, a friend of ben affleck, actually visited the set of the airport scene. during the scene where ben and matt are sitting, paltrow was sitting just off camera. \n\ndespite the controversy surrounding it's release, dogma was lionsgate's highest grossing movie until the 2004 release of crash.",
        "upvotes": 523,
        "comments": 65,
        "media": null,
        "permalink": "/r/movies/comments/1kcyipj/in_honor_of_dogmas_25th_anniversary_here_are_25/"
    },
    {
        "id": "1kcqo26",
        "author": "essenceofnutmeg",
        "title": "I finally watched Schindler's List after putting it off for years... where does all the pain go?",
        "content": "I hope it's ok to post this here, I'm not trying to be inflammatory, as I don't really discuss the actual plot of the movie or the actors.\n\n I finally watched Schindler's List, and I just need to get this off my chest and have no one else to talk to about how I feel. \n\nI tend to stay away from movies that depict historical violence. I can sit through documentaries and educational content that contains NSFL footage and testimonies, I guess I can chalk it up to me just being sensitive and easily triggered.\n\nThe movie itself was an absolute masterpiece. That being said, I went through all three hours completely unphased. I didn't cry when I saw children being killed en mass. I didn't gasp when I saw the piles of dead bodies. At no point did I look away because the horror was too much to bear.\n\nI'm numb and desensitized. Not just because of what's happening in Gaza, The Congo, Sudan... but because I've seen how the current barbarity is a mere drop in the bucket compared to the collective atrocities we as a species inflicted on ourselves for centuries. Year after year; decade after decade; millennia after millennia. The weaponization of fear fuels hate and violence to serve the greed and desires of people with power over others. To me, it's everything everywhere all at once... if that makes any sense \n\nI will say that although I was unphased during the movie, I couldn't sleep a wink afterwards. My mind couldn't rest thinking of all the parallels between the holocaust, the history of indigenous people who were colonized or annihilated, state sanctioned violence against it's own citizens, and the reality of the daily unfathomable torment that people are experiencing today. \n\nI think part of what kept me up is the understanding that this unbridled horror is avoidable, but the people with the power to orchestrate these atrocities have decided it's in their best interest to have the masses believe there is/was no way to prevent the carnage.\n\nMy ultimate takeaway from the film is that:\n\n\"Those who can see beyond the shadows and lies of their culture will never be understood, let alone believed, by the masses.\"\n-Plato \n\nOne day, when the truth comes to light, everyone will be against (insert whatever mass-manufactured atrocity here). \n\nBy then, it will have been too late to save ourselves from the consequences of our collective inaction.\n\nI cannot begin to conceptualize the physical and psychological pain that the dead victims who lived through the previous and present tortuous times experienced, not even to speak of the survivors. Where does all of their pain go?",
        "upvotes": 1550,
        "comments": 499,
        "media": null,
        "permalink": "/r/movies/comments/1kcqo26/i_finally_watched_schindlers_list_after_putting/"
    },
    {
        "id": "1kdcw6x",
        "author": "bomberman12",
        "title": "Making Ben Affleck Talk About Every Film He's Ever Done | GQ",
        "content": "",
        "upvotes": 42,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FobyAWmIHgRj0EZIhuD94LDDaqvwmR0b9z0ZLqKHSxs.jpg?auto=webp&amp;s=6732591725c619db276bfa2269f8e155e1dc8f4b"
        },
        "permalink": "/r/movies/comments/1kdcw6x/making_ben_affleck_talk_about_every_film_hes_ever/"
    },
    {
        "id": "1kcpug8",
        "author": "LiteraryBoner",
        "title": "Official Discussion - Thunderbolts* [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/IPulGdRzLriY)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/IPulGdRzLriY)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ItnAgr4mX7QR) to see the rankings of 2025 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done \n\n\n---\n\n**Summary**  \n*Thunderbolts\\** is a Marvel Studios ensemble film following a team of reformed villains and morally gray operatives sent on covert government missions. As the group is tasked with a dangerous black-ops assignment, tensions rise among the unstable team members, revealing conflicting loyalties and buried traumas. The film serves as a continuation of storylines from *Black Widow*, *The Falcon and the Winter Soldier*, and *Ant-Man and the Wasp: Quantumania*, with a darker tone and grounded action set pieces.\n\n**Director**  \nJake Schreier\n\n**Writer**  \nEric Pearson\n\n**Cast**  \n- Florence Pugh as Yelena Belova  \n- Sebastian Stan as Bucky Barnes / Winter Soldier  \n- Wyatt Russell as John Walker / U.S. Agent  \n- David Harbour as Alexei Shostakov / Red Guardian  \n- Hannah John-Kamen as Ava Starr / Ghost  \n- Olga Kurylenko as Antonia Dreykov / Taskmaster  \n- Julia Louis-Dreyfus as Valentina Allegra de Fontaine  \n\n\n**Rotten Tomatoes**: [89%](https://www.rottentomatoes.com/m/thunderbolts)  \n**Metacritic**: [68](https://www.metacritic.com/movie/thunderbolts)\n\n**VOD**  \nTheaters\n\n**[Trailer](https://www.youtube.com/watch?v=thunderbolts)**\n\n---",
        "upvotes": 1263,
        "comments": 1754,
        "media": null,
        "permalink": "/r/movies/comments/1kcpug8/official_discussion_thunderbolts_spoilers/"
    },
    {
        "id": "1kdgibw",
        "author": "keepfighting90",
        "title": "Burning (2018) is a wonderful movie. A hypnotic, moody slow-burn that refuses to provide any easy answers",
        "content": "You know it's funny, as I was watching Burning, I kept thinking to myself that something about the story feels very familiar. It’s like I’ve seen elements from it in other places before. It’s only after I rolled credits and looked up some details on Wikipedia that it hit me – it’s based on a story by Haruki Murakami, and I had completely missed that detail in the opening credits.\n\nIt seems so obvious in retrospect because Burning contains pretty much all of Murakami’s classic tropes: a young, directionless man without much of a personality. A hot manic-pixie dream girl drawn to the protag for unknown reasons. A surreal, dreamlike atmosphere. A well. Shots of the protagonist running. And of course, a cat! \n\nJokes aside, Burning is a pretty terrific movie, but it’s also a pretty elusive one that isn’t really eager to provide any easy answers. I suspect that it’s probably going to leave a lot of people unsatisfied because of the way it plays coy with pretty much every aspect of its narrative but that’s what I loved about it. It leaves a lot open to interpretation and lets you draw your own conclusions.\n\nI’m not sure if mine are right or wrong, but I have a few thoughts. The concept of the \"Big Hunger\" seems to drive a lot of the narrative forward. All 3 of the characters found something within each other to fill that metaphorical gaping void. Haemi to have someone to trust and feel validated by. Jongsu to feel some kind of meaningful physical sensation to jolt him out of his life of drudgery. And Ben...I suppose he felt fulfillment by finding these lost and lonely girls and essentially using them as prizes to maintain the image of his cool, rich alpha male life? At least that's what I gathered from the trophies in his bathroom - he parades these beautiful women around until he gets bored and moves on to the next one.\n\nI'm still perplexed at Haemi's disappearance from the movie about 2/3 of the way through. I could be wrong, but I took it to mean that at that point, she had stopped mattering to both Jongsu and Ben. Ben was already moving on to the next girl after getting bored with Haemi, and Jongsu was more obsessed with Ben's lifestyle and personality than caring about Haemi as a person. There definitely seems to be some commentary about misogyny here as well. In addition to Ben's treatment of Haemi, Jongsu calling her a whore for dancing half-naked while high is pretty telling.\n\nAnd all the talk of burning and burning imagery - I took it as a symbol of rebirth and continuance. To move on from something, you have to burn it and destroy it. I'm not sure if Ben saying he burns greenhouses down every few months correlates with him finding a new \"trophy\" girl. And maybe Jongsu burned down Ben in his car to try and move on from his obsession of him.\n\nI'm sure you could spend a lot more time interpreting the movie but I'll leave that for the comments. Storytelling aside, it works really well as a pure vibe piece. It's so atmospheric and moody, and gets downright eerie and menacing at times. The cinematography is gorgeous as well with some unforgettable shots and sequences.\n\nThe performances are top notch as well. Steven Yeun is fantastic as Ben, and seeing him play this charismatic and sinister bad boy was a blast. The actors who play Jongsu and Haemi are damn good as well.\n\nI'm still thinking about the movie and it's really trying to say. Might need to watch it another time but would love to discuss it in the meantime.\n\n",
        "upvotes": 19,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1kdgibw/burning_2018_is_a_wonderful_movie_a_hypnotic/"
    },
    {
        "id": "1kdekha",
        "author": "Looniluz",
        "title": "What’s a movie you loved (or hated) but could never watch again?",
        "content": "Ive always wanted to watch Eternal Sunshine of the Spotless Mind (2004). Featuring Jim Carry and Kate Winslet, but haven't built up the courage to because I hear so many people mention how gut wrenching it is. So I was curious of course and wanted to ask reddit, what are some movies you'd never watch again because of this? ",
        "upvotes": 23,
        "comments": 82,
        "media": null,
        "permalink": "/r/movies/comments/1kdekha/whats_a_movie_you_loved_or_hated_but_could_never/"
    },
    {
        "id": "1kcyqe4",
        "author": "Odins-raven",
        "title": "What's your favourite comfort movie?",
        "content": "When you are feeling out of sorts or anxious, or sad. What's your go to movie?\nFor me it's has to be Disneys Sword in the Stone. It's comedic and feel good with an underdog, and has the best disney character in my opinion... Archimedes. But I want to know what else has vibes that relax and chill you out?",
        "upvotes": 176,
        "comments": 499,
        "media": null,
        "permalink": "/r/movies/comments/1kcyqe4/whats_your_favourite_comfort_movie/"
    },
    {
        "id": "1kct408",
        "author": "exophrine",
        "title": "Shudder Acquires GOOD BOY, A Haunted House Movie Told from Dog’s Perspective",
        "content": "",
        "upvotes": 556,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/okdmdOoqPdxg7IzZlXmWB4hVLwvU5BL0SZmU1N1Mymo.jpg?auto=webp&amp;s=3dfd61da771f95c7224e566aadabcd0f8247b4f2"
        },
        "permalink": "/r/movies/comments/1kct408/shudder_acquires_good_boy_a_haunted_house_movie/"
    },
    {
        "id": "1kd6er6",
        "author": "Sullhammer",
        "title": "What's the best sequel that never had to be made?",
        "content": "What's the best sequel to a movie you believe is the best sequel to the initial movie, but didn't have to be made because the story in the original movie was wrapped up? \n\nI was watching Gladiator 2 yesterday with some high hopes. Gladiator never called fie a sequel, the story was wrapped up. Yet they made it, and after, I wish it wasn't a sequel. It is OK for a standalone movie, but not worth continuing the already ended story line of Gladiator.\n\nWhat comes to my mind is Judgement Day. Terminator could have been a one and done and have been a fantastic movie. And the T2 brings it back and is an absolutely phenomenal movie.\n\nUpdate: Getting a lot of suggestions quickly. I should have thought more about this. Didn't even think of Aliens or Shrek 2!",
        "upvotes": 60,
        "comments": 178,
        "media": null,
        "permalink": "/r/movies/comments/1kd6er6/whats_the_best_sequel_that_never_had_to_be_made/"
    },
    {
        "id": "1kd3vow",
        "author": "gruesomesonofabitch",
        "title": "The Hunchback of Notre Dame (1996) is one of the most beautifully dark animated films and I adore it.",
        "content": "\"Who is the monster and who is the man?\" is a question posed at The Hunchback of Notre Dame's start and finish that perfectly encapsulates the story. A man (Judge Claude Frollo) chases down a young mother, kills her, prepares to drown her deformed baby (Quasimodo), is stopped from plunging the child into a watery grave and then saddled with caring for the infant. Instead of receiving affection, the child is manipulated into thinking they're a monster who will never be loved or accepted. On top of this, the man is actively pursuing an obsession to eradicate an entire ethnic group (Gypsies) while lusting after a woman (Esmeralda) who is one of those people.\n\n\n\nIf that in no way sounds like it could be an animated children's film, much less a Disney movie, that is where you are mistaken and this is precisely why The Hunchback of Notre Dame is the most beautifully grim and special piece of work that the studio has ever produced. The first six and a half minutes alone are one of the most emotionally arresting expository sequences thanks in large part to Alan Menken's incredible music. Menken delivers what is easily his strongest score and several stellar songs (The Belles of Notre Dame, Out There and Heaven's Light/Hellfire) paired with some of the most striking visuals in any animated film.\n\n\n\nIt's immediately after the opening sequence that we are introduced to the film's only true flaw... the gargoyles. Apparently, the directors (Gary Trousdale and Kirk Wise) forcibly inserted these painfully intrusive characters as an attempt at humor which instead tarnishes the dark tone of the film; the gargoyles are even given a horribly out of place and mediocre song (A Guy Like You). A far better means for delivering their brief heartfelt moments of wisdom to Quasimodo would have been through the Arch Deacon character introduced earlier in the film.\n\n\n\nAs a whole, I have a deep love for this film despite it being just shy of perfection.",
        "upvotes": 73,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1kd3vow/the_hunchback_of_notre_dame_1996_is_one_of_the/"
    },
    {
        "id": "1kdhhgf",
        "author": "submortimer",
        "title": "Ryan Coogler is a Genius",
        "content": "\n**Obligatory major spoilers for Sinners. Go see it.** \n\nOn second viewing the other night, I noticed something that I hadn't the first time in saw it, and it straight up blew my mind. \n\nThe film got to \"The Rocky Road to Dublin\", and just like the first time in was absolutely vibing, it's just so good. And like a lot of people I've seen online, I thought to myself again, \"yeah, if this is what Rennick was offering, he would probably get me. Let me in to the family brother!\"\n\nThen I thought about it and bit, and I realized why: I'm white, specifically German/Irish on my mother's side. Like yeah, it's a whole vibe and the dance is awesome and everything, but what he's presenting is my historical culture. I resonated with that and the vamps singing \"Go, Lassie, Go\" much more than I did with Preacher Boy and the Juke Joint specifically because *they aren't my people*, not in the context of the film.\n\nRyan Coogler had to know that a lot of his white audience was going to be of Irish descent, and that so many of us crave and cling on to our European ancestry because, let's be honest, \"white\" culture is largely awful, and the parts that aren't are stolen from someone else. We don't have songs and stories and traditions that go back hundreds of years unless we go down our European roots.\n\nSo when I see Rennick doing a jig and getting his little clan to dance and sing the absolute ass off of a banger of a pub tune, I'm like \"sign me the hell up, that's all I've ever wanted\". I have no songs to lose.\n\nBut it hits VERY differently for those in the community with those in the juke joint who absolutely do.\n\nI'm down to do a jig, when I should be horrified. \n\nCoogler is a master. ",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1kdhhgf/ryan_coogler_is_a_genius/"
    },
    {
        "id": "1kc7ihg",
        "author": "BunyipPouch",
        "title": "Deadline Announces 2024's Biggest Box Office Bombs: Joker 2 ($144M loss), Furiosa ($119M loss), Borderlands ($80M loss), Megalopolis ($76M loss), and Kraven the Hunter ($71M loss).",
        "content": "",
        "upvotes": 11405,
        "comments": 2353,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oo6jm3EvxqQMbO_4al2Paz-NRnSRU2bkEjALZSjBnso.jpg?auto=webp&amp;s=72836b537694c81d0e2f4f3af0ecbb48a035913c"
        },
        "permalink": "/r/movies/comments/1kc7ihg/deadline_announces_2024s_biggest_box_office_bombs/"
    },
    {
        "id": "1kczr85",
        "author": "SafeBodybuilder7191",
        "title": "Billy Magnussen, Ella Purnell and Ariana Greenblatt to Star in Teen Comedy ‘Hot Ted’ From ‘SNL’ Alum Hannah Levy, Protagonist Launching in Cannes (EXCLUSIVE)",
        "content": "",
        "upvotes": 110,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CfLbsulqlk2GKz-Fl_h05v5mOfV5d4k1665MqDufOlM.jpg?auto=webp&amp;s=dcb3f617388beaa0b3d8f24a520d71c7faa0c9ff"
        },
        "permalink": "/r/movies/comments/1kczr85/billy_magnussen_ella_purnell_and_ariana/"
    },
    {
        "id": "1kdckgg",
        "author": "garlicmanatee",
        "title": "Madeline is the absolute villain of “Death Becomes Her”",
        "content": "In the movie, Madeline and Helen are rivals to one another, portrayed as equally antagonistic. In the end, the both are punished for their vanity and forced to spend eternity with each other, but do so as friends. \n\nExcept Madeline was a psychopath. Helen didn’t drink the potion because of her own narcissism, Madeline repeatedly destroyed Helen’s life and left her with nothing. Helen wanted to be a writer. She felt compelled to make herself beautiful because it’s the only thing she could do make herself safe from Madeline. Madeline stole husband after husband, demolished Helen’s self worth and her love - because at one point Helen called her “trashy”? Madeline didn’t even like Ernest, her cheating on him was a huge plot point! \n\nBut they’re both framed as equally vain and narcissistic. At the end, they just decide to forget it all and be friends. \n\nI know that’s the point. I know not every bad character has to be “punished” by the narrative. \n\nBut did the ending piss anyone else off 😭 Man fuck Madeline!! Justice for Helen. ",
        "upvotes": 22,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1kdckgg/madeline_is_the_absolute_villain_of_death_becomes/"
    },
    {
        "id": "1kccih5",
        "author": "MarvelsGrantMan136",
        "title": "Ryan Coogler’s ‘Sinners’ Gets 70mm IMAX Re-Release on May 15",
        "content": "",
        "upvotes": 3987,
        "comments": 294,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HuxGbJQ-Gi2cVZcDF1-SrwsowwF9V5w6t93B4T6FuVg.jpg?auto=webp&amp;s=966f3f7ae851c285e9466e186db60937342c18fb"
        },
        "permalink": "/r/movies/comments/1kccih5/ryan_cooglers_sinners_gets_70mm_imax_rerelease_on/"
    },
    {
        "id": "1kcgoqv",
        "author": "indiewire",
        "title": "Norm Macdonald’s ‘Dirty Work’ Gets Even Dirtier Almost 30 Years After Its Release",
        "content": "",
        "upvotes": 2074,
        "comments": 234,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XgydGaFeZfYcHh2ke_ZtG3KCmblnro9AzHoBZyk-2ZY.jpg?auto=webp&amp;s=08cc481af4b37978785726c95300c3113ac10dcc"
        },
        "permalink": "/r/movies/comments/1kcgoqv/norm_macdonalds_dirty_work_gets_even_dirtier/"
    },
    {
        "id": "1kdg7p5",
        "author": "LiteraryBoner",
        "title": "Official Discussion - Another Simple Favor [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/FdrboZByXWE2)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/FdrboZByXWE2)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ItnAgr4mX7QR) to see the rankings of 2025 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done \n\n---\n\n**Summary**\nStephanie Smothers is a widow and mommy‑vlogger whose life is turned upside down when her glamorous best friend Emily mysteriously disappears. As Stephanie digs deeper she uncovers a web of secrets, lies, and betrayals that go far beyond her small town.\n\n**Director**\nPaul Feig\n\n**Writer**\nJessica Sharzer, based on the novel by Darcey Bell\n\n**Cast**\n\n* Anna Kendrick as Stephanie Smothers\n* Blake Lively as Emily Nelson\n* Henry Golding as Sean Townsend\n* Andrew Rannells as Dennis Nylon\n* Rupert Friend as Gabriel Sanford\n* Isabella Russo as Nicky Smothers\n\n**Rotten Tomatoes**\n[R67%](https://www.rottentomatoes.com/m/another_simple_favor)\n\n**Metacritic**\n[55](https://www.metacritic.com/movie/another-simple-favor)\n\n**VOD**\nAmazon Prime\n\n**Trailer**\n[Official Trailer on YouTube](https://www.youtube.com/watch?v=un6mlTXMdig)",
        "upvotes": 9,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1kdg7p5/official_discussion_another_simple_favor_spoilers/"
    },
    {
        "id": "1kd6f96",
        "author": "KillerCroc1234567",
        "title": "Will Poulter, Kit Connor &amp; Manu Ríos To Star In Medieval Zombie Horror ‘Rapture’ For Elevation, 2AM &amp; Brookstreet; HanWay Launching Sales For Cannes",
        "content": "",
        "upvotes": 29,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BmQ1f8-OKQmCE1os3C1G_5Sb5QrqCu09wKydCueytYM.jpg?auto=webp&amp;s=42d07e41bf4fe95f0b8b1d1747ba56bbcdf7242a"
        },
        "permalink": "/r/movies/comments/1kd6f96/will_poulter_kit_connor_manu_ríos_to_star_in/"
    }
]