[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 494,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i8muj5",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game Season 3 Is Coming ‘Sooner Than You Expect’ Director Says",
        "content": "",
        "upvotes": 535,
        "comments": 76,
        "media": null,
        "permalink": "/r/netflix/comments/1i8muj5/squid_game_season_3_is_coming_sooner_than_you/"
    },
    {
        "id": "1i8rjwk",
        "author": "Sweaty-Toe-6211",
        "title": "Netflix has reached an agreement and renewed the Breaking Bad series until April 18, 2027.",
        "content": "",
        "upvotes": 161,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1i8rjwk/netflix_has_reached_an_agreement_and_renewed_the/"
    },
    {
        "id": "1i8x25x",
        "author": "LauraEats",
        "title": "'Squid Game' Topped the 2024 Single-Week Charts with 4.9 Billion Minutes Watched",
        "content": "",
        "upvotes": 27,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i8x25x/squid_game_topped_the_2024_singleweek_charts_with/"
    },
    {
        "id": "1i8yus6",
        "author": "pinkeythehoboken22",
        "title": "New Subreddit Rule",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i8yus6/new_subreddit_rule/"
    },
    {
        "id": "1i8956q",
        "author": "OkImpression1223",
        "title": "Second Bling Empire cast member dies since Netflix cancellation",
        "content": "",
        "upvotes": 180,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1i8956q/second_bling_empire_cast_member_dies_since/"
    },
    {
        "id": "1i8xrbi",
        "author": "Herazim",
        "title": "Extra member help needed",
        "content": "I'm not sure what happened, I have a Netflix account with 3 profiles. One of them was made into an extra member a year ago for a SmartTV in another location.\n\nStarting 2 days ago the app keeps asking for a SMS verification, the profile isn't an extra member anymore and the slot is empty. How do I restore this and why did this happen ? I don't want to make an extra Netflix account, can't I use the other profile like I did for the past year ?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i8xrbi/extra_member_help_needed/"
    },
    {
        "id": "1i8hxyk",
        "author": "bell-fruit-205",
        "title": "Night Agent S2 - does anyone else find Rose to be extremely annoying?",
        "content": "I just started season 2 but she literally didn’t need to be involved in any of this but she felt like she had to find Peter which made her involved. \n\nBut then she’s worried about being in danger…when finding Peter in fact puts her in danger\n\nThen she’s hung up on the fact that Peter didn’t call for 10 months. Like girl take a clue! And also even if we wanted to call, you know he’s an agent it’s not like he’s really able to just call whenever and it be safe \n\nIdk she’s just so annoying\n\nThoughts?",
        "upvotes": 33,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1i8hxyk/night_agent_s2_does_anyone_else_find_rose_to_be/"
    },
    {
        "id": "1i7y9hk",
        "author": "Pogrebnik",
        "title": "'Stranger Things 5' Release Date Leaked By Examining Netflix’s Website Code",
        "content": "",
        "upvotes": 523,
        "comments": 96,
        "media": null,
        "permalink": "/r/netflix/comments/1i7y9hk/stranger_things_5_release_date_leaked_by/"
    },
    {
        "id": "1i8wxjf",
        "author": "mouthwashhh",
        "title": "Phone is “not part of household” when I’m in my house",
        "content": "we all know the household thing is bs but my phone is connected to my house WiFi and yet it is not considered part of the household and can’t be used for Netflix. My PC and TV can access it.\n\nhow can I fix this? is there any exploit/workaround for the household restriction?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i8wxjf/phone_is_not_part_of_household_when_im_in_my_house/"
    },
    {
        "id": "1i8whi0",
        "author": "Robemilak",
        "title": "Netflix Africa Reshuffle: Kaye-Ann Williams Replaces Tendeka Matatu",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i8whi0/netflix_africa_reshuffle_kayeann_williams/"
    },
    {
        "id": "1i8vvlz",
        "author": "SectionEarth",
        "title": "Documentary on New Yorker Magazine to Premiere on Netflix This Year",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i8vvlz/documentary_on_new_yorker_magazine_to_premiere_on/"
    },
    {
        "id": "1i8vsr1",
        "author": "ShiversAndCuddles",
        "title": "Netflix or Show?",
        "content": "TLDR: idk if Netflix is breaking or if show just has weird transitions theyre trying out this season\n\nI'm currently watching House MD on Netflix, and during transitional scenes, the very last fee seconds kind of pause and then speed up (kinda like the cinematics of how the running works in Twilight, slowish background, fast characters) and it's not like the kind of transition where that kind of cinematic is needed (I know nothing about film so I may be using the wrong verbiage here)\n\nTrying to Google but I just get stuff for Netflix video error (don't notice it with Youtube, hdmi seems fine) and for House but not weird / oddly placed transitionals like that\n\nIt's not every transition, most times just ending ones, screen doesn't go black like a scene transition, but more like, if they go to a seperate room, its sped up? Idk if any of this makes sense, thanks in advance to anyone who does know (or understands)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i8vsr1/netflix_or_show/"
    },
    {
        "id": "1i86816",
        "author": "Robemilak",
        "title": "Every Movie &amp; Series Coming to Netflix in February 2025",
        "content": "",
        "upvotes": 55,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1i86816/every_movie_series_coming_to_netflix_in_february/"
    },
    {
        "id": "1i84c7r",
        "author": "Tuktuktuk2020",
        "title": "American Primeval (trigger warning, spoilers)",
        "content": "I've never seen a better depiction of women in a historical series, or any other series at that. Women are allowed to be independent, opinionated, and vulnerable and feminine - fleshed out and whole people just as much as the male protagonists. \nFurthermore, as a s/a survivor, I was touched by the way it was handled in the series. Delicately, not exploitedly, and showing strength and resilience in the survivor, instead of the usual crumbling and broken victim. It felt authentic. It was treated with compassion and without shame. \nI do think I would have ended many things differently, it was depressing AF, but overall I liked the series. ",
        "upvotes": 64,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1i84c7r/american_primeval_trigger_warning_spoilers/"
    },
    {
        "id": "1i8fb0z",
        "author": "Strict_Emu5187",
        "title": "Resident alien",
        "content": "So I know I'm late to the party but this is the best thing I've ever seen. I'm usually a true crime horror kind of girl but I am literally LOLing throught this whole thing. I can't wait for season 3.",
        "upvotes": 12,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1i8fb0z/resident_alien/"
    },
    {
        "id": "1i8x97u",
        "author": "Unhappy_Passage5535",
        "title": "Forgot the name of a Baking Show!",
        "content": "Guys 😭 There was the baking show I watched a while back, but I can't remember the name at all. Here are a few details I remember:\n\nIt was definitely about sweet things only. The winner of the first season was the middle aged mum with a silver bob and glasses. She beat out this arrogant guy, so I was happy. In the final challenge, she made a mistake of putting red fingerprints on her white cake. And I think she won the first ever episode?\n\n🙏Your help is much appreciated, as well as any other similar recommendations",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i8x97u/forgot_the_name_of_a_baking_show/"
    },
    {
        "id": "1i8stmx",
        "author": "Def_Not_A_Terrorist_",
        "title": "App Not Working",
        "content": "Every time i open the app it automatically logs in into this account (not mine), I tried resetting from the app settings (i'm on ios), I also deleted then reinstalled the app but it's not working and this account keeps showing up.\nI tried customer support, but either the 2 people I talked to are bots or new and completely clueless, they kept asking me if i have an account and that I should just log in to it wich is clearly not possible.",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/gd4abs19axee1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1i8stmx/app_not_working/"
    },
    {
        "id": "1i8sbdt",
        "author": "vds99",
        "title": "Skip button",
        "content": "I hereby start a petition to request netflix to add a shortcut key on the keyboard to skip intro. \n\n-netflix_user\n\n-------------------------------------------\nLikewise we have for full screen - F, forward and backward. \nIt's so annoying to search for curson and bring it on the skip intro pop up to be able to skip. Our keyboard should be able to do that. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i8sbdt/skip_button/"
    },
    {
        "id": "1i801x6",
        "author": "NathLWX",
        "title": "These are the 8 biggest anime premieres on Netflix (+ Synopsis).",
        "content": "I believe these are the views for the first time they appear in the Netflix Top 10 site.\n\nI recommend giving them a try. I've watched most of them, except Baki Hanma, Dragon Ball Daima, Demon Slayer Season 4. All of them are available in English dub too.\n\n**Sakamoto Days** (Currently simulcasting/weekly release) - 8/10  \nComedy action anime about a hitman who left his job after falling in love at first sight with a convenience store lady. As a result, he left his job and became a father who helped people, prohibited from killing. He's now living his peaceful quiet life... or is he?  \nHe is also being hunted or searched by his former rivals and partners, so he has to stop his enemies without killing them.\n\n**DAN DA DAN** (there's an attempted rape at ep. 1 by the aliens, afterwards it's safe) - 8.5/10  \nHe was an alien fanboy, she was a ghost fangirl. They're in dispute over which one is real since they believe the other one doesn't exist, so the female MC (main character) decided to look for alien; male MC looked for ghost. Turns out both are real. Male MC lost his balls (literally) to Turbo Granny in a tunnel. Long story short they both gain supernatural powers, guess you can say they are a match.\n\n**Record of Ragnarok** - 7/10  \nAnimation needs improvements imho, but it's still enjoyable. The gods want to wipe out humanity due to their sins and selfishness, but one of the Valkyries (Brunhilde) said hold up, let them cook, and proposed an idea to make humans literally fight against the gods in an arena instead. If humans have more wins than gods, humankind will be spared. Some of the fights include Adam vs Zeus, Lü Bu vs Thor, Jack the Ripper vs Heracles, Raiden vs Shiva.\n\n**My Happy Marriage** - 7.5/10  \nThe female MC lives in an abusive household ever since her mother died and her father remarried an evil woman and her daughter. She got forced to be a servant/mais. Her father suddenly brought a news that she is to marry a guy from a noble and distinguished family. Her fiancee is known to be callous and dismissed all his previous fiancees. That's what she expected, but turns out he treated her nicely.\n\n**Ranma 1/2** (2024 remake) - 8/10  \nI'm sure you've heard of this slapstick romance comedy before; if not, it's about a dude (Ranma) who is a gender bender after falling into a hot lake in China; likewise his father who can turn into a Panda. Ranma got engaged with a tomboy girl by his father who is a friend to the fiancee's father.",
        "upvotes": 89,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1i801x6/these_are_the_8_biggest_anime_premieres_on/"
    },
    {
        "id": "1i8rij2",
        "author": "Roseaestheticz",
        "title": "My Spoiler free review for The Night Agent",
        "content": "Just finished watching S2 and damn it was fun. I didn't rewatch Season 1, but this one had me hooked from the first episode. I was on edge and invested in the characters.\n\nBut let's get real - Rose's character just didn't do it for me. I couldn't connect with her, and her storyline felt like a convenient plot device. On the other hand, Alice was a breath of fresh air. I loved her charm and personality, and I was gutted that we didn't get to see more of her. I think the screen time should have been the opposite. Alice in the lead and Rose on the side. Which makes more sense since Alice is an Agent where Rose is just a civilian \n\nCatherine, though personally I enjoyed her character. So classy and poised  There has to be someone who keeps Peter in check and I like Catherine for . And Noor? I liked her strength and perseverance. I loved how the show gave us these glimpses into the characters' pasts, making them feel so much more real and adding depth to the characters. I'm a big fan of characterization and they did it good .\n\nHere's the thing, though: I just don't buy Peter and Rose romance. They have no chemistry at all. I'm really looking forward to some other female lead. And Rose's character, in general, felt like an afterthought. It was like she was only there to advance the plot. So I don't get why people want to see more of her in s3 especially as a romantic interest.\n\nDespite that, I'm still booked with this show. The side characters were definately the show stopper",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i8rij2/my_spoiler_free_review_for_the_night_agent/"
    },
    {
        "id": "1i8qv8m",
        "author": "Ok-Frame-5421",
        "title": "Rose as a character in night agent is BEYOND insufferable",
        "content": "Does anyone else share this opinion? Sure she’s helpful at times but in general she’s causing more trouble than anything ESPECIALLY in ep 5-6. Rose wants everything to be perfect and ideal when it’s not realistic at all, for example she demands that the agent go and save noors family with little to no time to prepare not only endangering his life but noors family as well but then when it goes wrong she gets upset about it when it should’ve already been expected as a possibility, then she’s iffy about having to lie to get the pictures when she’s already been told that thousands of lives could be at risk but no she’s right it’s a hard choice wavering honesty over thousands of lives. She’s extremely entitled and full of herself. I think the actor did a great job it’s just the way the character was written. \n\nEdit: also biggest nitpick later on rose acts like she was dragged into all this and didn’t ask to be a “night agent” after having her tantrum when she quite literally inserted herself into every situation any way she could when everyone was hesitant on her doing so.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1i8qv8m/rose_as_a_character_in_night_agent_is_beyond/"
    },
    {
        "id": "1i8q78y",
        "author": "dyslexic2",
        "title": "My monitor shuts down as if you unplug the display port from the GPU whenever i browse netflix.",
        "content": "This issue has been annoying me for 3 days. whenever I browse netflix, my monitor shutsdown. I have no problem with gaming like god of war and warframe and other stuffs. I had to unplug my display port and plug it again to turn on the display again. What is going on? can you help me please?\n\nPS even replacing display port. doesnt work. I use the netflix app instead of MS edge. still same thing. there is something wrong with netflix.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i8q78y/my_monitor_shuts_down_as_if_you_unplug_the/"
    },
    {
        "id": "1i8tjk9",
        "author": "Alex_barbosu_ro",
        "title": "My profile icon and some shows are gone on mobile but on TV there's nothing wrong. How do I fix this?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i8tjk9/my_profile_icon_and_some_shows_are_gone_on_mobile/"
    },
    {
        "id": "1i7c7cu",
        "author": "TheExpressUS",
        "title": "Bling Empire New York star Lynn Ban dies aged 51 after brain surgery",
        "content": "",
        "upvotes": 884,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1i7c7cu/bling_empire_new_york_star_lynn_ban_dies_aged_51/"
    },
    {
        "id": "1i8lq9y",
        "author": "lenystar",
        "title": "NO 2FA YET?",
        "content": "my netflix changes to foreign languages ALL THE TIME even i dont know how do they log in  \nbut if there was 2fa i could just enjoy my netflix without having billions of random peoples accounts  \nis it that hard to add 2fa? google is about to leave 2fa behind with something safer while we cant just have 2fa to prevent stupid hackers into our accounts",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i8lq9y/no_2fa_yet/"
    },
    {
        "id": "1i8urh7",
        "author": "ellie_gina",
        "title": "Nicole Young claps back at claims she was 'cut' from Selling Sunset",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i8urh7/nicole_young_claps_back_at_claims_she_was_cut/"
    },
    {
        "id": "1i8snzk",
        "author": "No-Sundae5831",
        "title": "Netflix tricking people into signing up for an extra account",
        "content": "I haven’t seen people talk about this but recently Netflix kept popping up an unskippable pop up telling me to create an extra account for no extra cost. Silly me I signed up and turns out it’s been charging us! I cancelled the account after noticing this a few months later. Now I’ve cancelled it and it continues to push it onto me. The extra account didn’t even transfer my history or preferences. I’ve lost so much respect for them and it’s so upsetting that they’re resorting to dirty tricks like this to squeeze out more money from loyal customers. Whoever came up with this idea should be fired. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i8snzk/netflix_tricking_people_into_signing_up_for_an/"
    },
    {
        "id": "1i89m8e",
        "author": "Atlast_2091",
        "title": "Sweet Magnolias: Season 4 | Official Trailer | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i89m8e/sweet_magnolias_season_4_official_trailer_netflix/"
    },
    {
        "id": "1i8h88u",
        "author": "ILikeTheTinMan83",
        "title": "Netflix preview club question",
        "content": "I got sent an email today saying that the new Netflix preview club screening is available to watch in my feed and I can’t find it. I have watched several previews before so I’m not new to this. I am logged into my main profile. I even tried resetting the app and logging in and out and nothing. Anyone else having an issue with the newest screening and it not showing up in your feed? ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1i8h88u/netflix_preview_club_question/"
    },
    {
        "id": "1i7vaiu",
        "author": "okraisyummy",
        "title": "Two Must-Watch Documentaries on War, International Relations, and Terrorism",
        "content": "Just finished watching two Netflix docuseries: Turning Point: The Bomb and the Cold War and Turning Point: 9/11 and the War on Terror. Honestly, both were super interesting and packed with details about these major events in history.\n\nIf you’re into learning about big global moments or people like Oppenheimer, these are definitely worth a watch. They break down a lot of important stuff without feeling too overwhelming. Highly recommend if you’re into history or just want to understand these topics better!\n",
        "upvotes": 31,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i7vaiu/two_mustwatch_documentaries_on_war_international/"
    }
]