[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 20,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kh8qjg",
        "author": "mydearmelody7",
        "title": "I will never forgive you for this 💔",
        "content": "",
        "upvotes": 456,
        "comments": 151,
        "media": null,
        "permalink": "/r/netflix/comments/1kh8qjg/i_will_never_forgive_you_for_this/"
    },
    {
        "id": "1khh3bl",
        "author": "purplewizardshoes",
        "title": "I will also never forgive… or forget…",
        "content": "Capitalizing u/mydearmelpdy7 ‘s post… These are the cancellations that make me want to visit their headquarters and leave bags of flaming poo for all their executives… still mad. 💔",
        "upvotes": 27,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1khh3bl/i_will_also_never_forgive_or_forget/"
    },
    {
        "id": "1kh7lpg",
        "author": "plushchxrry",
        "title": "Show/movie recommendations not for the weak.",
        "content": "I want recommendations based on questioning reality, existence, unveiling dark deep secrets and something that gives me goosebumps. Gripping and chilling movie/series that just makes me sit dumbfounded haha. Any language-region based appreciated. \n\n",
        "upvotes": 24,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1kh7lpg/showmovie_recommendations_not_for_the_weak/"
    },
    {
        "id": "1khf7ej",
        "author": "MrMycrow",
        "title": "Sweet Bobby",
        "content": "I was watching it last night but fell asleep and it played out.\n\nFrom what I'm reading on here Bobby wasn't actually Bobby? Cousin is weird?\n\nWhat did Bobby and cousin do? Take pity on a poor soul and help me out here! I didn't like the format so am reluctant to put it on again",
        "upvotes": 7,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1khf7ej/sweet_bobby/"
    },
    {
        "id": "1kh77y6",
        "author": "gamersunite1991",
        "title": "Netflix will release Poop Cruise this summer",
        "content": "",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kh77y6/netflix_will_release_poop_cruise_this_summer/"
    },
    {
        "id": "1kgxmqb",
        "author": "Somethingman_121224",
        "title": "Netflix Will Update Its Layout And Interface Later This Month, Adding A Bonus For Gamers",
        "content": "",
        "upvotes": 43,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1kgxmqb/netflix_will_update_its_layout_and_interface/"
    },
    {
        "id": "1kh9olj",
        "author": "_macadocious",
        "title": "Still incredibly sad that they stopped filming Terrace House",
        "content": "I understand why they did, but I just loved how wholesome it was. It was almost like a Japanese version of The Real World. \n\nI watched “The Boyfriend” which gave similar vibes, but felt like they didn’t go as in-depth with the cast members.\n\nAny recommendations on similar shows to Terrace House? Are there other seasons that were not shown on Netflix?",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kh9olj/still_incredibly_sad_that_they_stopped_filming/"
    },
    {
        "id": "1khl6zd",
        "author": "2ndplaceBrennan",
        "title": "Heart Eyes is locked for ad-supported accounts",
        "content": "Why is that a thing? Everything I read said that it would be full release this morning at midnight PST. Why isn't this available? If this is where we are headed, I'm just gonna unsubscribe. They keep cancelling good shows, and what they pick up isn't worth the money.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1khl6zd/heart_eyes_is_locked_for_adsupported_accounts/"
    },
    {
        "id": "1khfnit",
        "author": "vanth55",
        "title": "Ads on the standard plan",
        "content": "I have the standard plan with no ads.  I’m traveling and staying with friends.  I signed in on the smart tv in their guest room and I’m getting ads.  Any idea why this would happen?\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1khfnit/ads_on_the_standard_plan/"
    },
    {
        "id": "1kh9gug",
        "author": "TheCrystal_01",
        "title": "Can you recommend some series to me?",
        "content": "I recently started using Netflix and I found old series that I watched years ago, that I watch episodes from time to time, but I would like to watch new series but many of the ones that I find the episodes last 1 hour and I don't know, I don't feel like watching such long episodes in case I don't like the series so as not to get bored or some days I don't have enough time to watch for so long.\n\nSo if it were possible, you could recommend series that last 20-25 minutes, maximum 30 minutes at most.  ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kh9gug/can_you_recommend_some_series_to_me/"
    },
    {
        "id": "1kgq8t7",
        "author": "LawInside0",
        "title": "what’s your favorite series on netflix?",
        "content": "what’s your favorite series on netflix if you had to chose? its hard to chose one but i think my all time favorite would be orange is the new black. i love it. what about you? what is your favorite?",
        "upvotes": 61,
        "comments": 213,
        "media": null,
        "permalink": "/r/netflix/comments/1kgq8t7/whats_your_favorite_series_on_netflix/"
    },
    {
        "id": "1kh9kl6",
        "author": "indiewire",
        "title": "Netflix Overhauls TV Homepage with AI Search and Short-Form Reels",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kh9kl6/netflix_overhauls_tv_homepage_with_ai_search_and/"
    },
    {
        "id": "1kgxfff",
        "author": "Internal-Bed-3150",
        "title": "The Four Seasons season 2 hopes pick up steam after latest Netflix ratings drop",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kgxfff/the_four_seasons_season_2_hopes_pick_up_steam/"
    },
    {
        "id": "1kgx2or",
        "author": "bytesized25",
        "title": "Show Recommendations!",
        "content": "Hi everyone! I am looking for new shows to watch! These are some of the shows I enjoyed on Netflix: Grey's Anatomy, The Resident, Insatiable, Younger, Working Moms, Orange is the New Black, Bridgerton, Never Have I Ever. There's tons more but thats just a short list! I would love something that has a few seasons but I'm open to limited series as well! ",
        "upvotes": 8,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1kgx2or/show_recommendations/"
    },
    {
        "id": "1kh4z94",
        "author": "Active_Taste9341",
        "title": "Looking for a Documentary",
        "content": "i watched a awesome crime documentary years ago. i thought the name was hope county but that's wrong obviously.\n\nit was about some hillbillies growing weed at first and many strange and horrible family stories around this place deep in the woods. like kids disappeared/got killed and stuff like this. \n\nit was very exciting and I'd like to watch it again. any ideas?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kh4z94/looking_for_a_documentary/"
    },
    {
        "id": "1kh91t9",
        "author": "david_monkman",
        "title": "The Four Seasons Beach Bar: Ep. 4",
        "content": "In episode 4, Beach Bar, about 15:50 minutes into the episode, a song is playing as they begin to dance at the beach party. What is the name of this song?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kh91t9/the_four_seasons_beach_bar_ep_4/"
    },
    {
        "id": "1kh7s72",
        "author": "KangarooSensitive539",
        "title": "Video not working on Roku TV",
        "content": "Ive been trying to watch arcane On my tv but no video will play, only audio and captions. Ive tried every solution that google has to offer and this is an issue with other apps on my TV too. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kh7s72/video_not_working_on_roku_tv/"
    },
    {
        "id": "1kgojl3",
        "author": "Kagamid",
        "title": "Cassandra is actually very sad on the second watch",
        "content": "Cassandra was an interesting story that I couldn't help but wonder what happened next. By the time we get to the end, we get that bitter sweet ending. But I was curious on what I missed on the first watch knowing what I know now. I found that the story is actually very sad when you watch it a second time. It lets you see everything from Cassandra's perspective. In the past, the last thing that happens is Cassandra watches her son die and shorts out. Her daughter then starves to death in the room and 50 years past. When she wakes up, she first assumes the boy is Peter. She is obviously very hopeful that her last memory was wrong. But then she notices that it's not Peter and a new family is in her house. What's the first thing she does? She goes to the master bedroom and enters the closet to check on her daughter. You can see when she enters the room and when the wife looks, you can see the closet door close with no one else around. Cassandra went into the secret room. Now at this time the rest of the house starts coming on with an expressionless Cassandra. I believe at this point, the robot is mourning her daughter and losing her mind. You next see Cassandra standing by the pool where I believe she's thinking about killing herself and wondering if she can just fall in and end it. But then she sees the mouse and that's when you know she's gone crazy. She talks to it and runs it over. When the family wakes up, she's not acting like herself anymore. She's pretending to be a house servant for them so she can take over the family and replace the ones she lost. The rest of the story plays out as normal, but now you know where her madness comes from.\n\nI'm glad I took the time to watch it all. It was very interesting.",
        "upvotes": 16,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kgojl3/cassandra_is_actually_very_sad_on_the_second_watch/"
    },
    {
        "id": "1khgjk5",
        "author": "Secret_Ad_1107",
        "title": "What we expected from Adolescence",
        "content": "Expectation(What we would've liked): A mystery, action-packed thriller about a 13 year old psycho incel murderer, who happens to be a computer genius hacker, going on a journey/crusade to try and spread his redpill beliefs as much as possible. He forms his own groups/orgs along the way and hacks every broadcasting news station/media, and becomes a formidable Andrew Tate-like figure. Then it becomes a huge police chase action thriller.\n\nReality(What we got): A boring snooze fest about a family household going through hardship dealing with the idea of their son being a murderer.\n\nI can't be the only one right? I just might be lol.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1khgjk5/what_we_expected_from_adolescence/"
    },
    {
        "id": "1kh3wza",
        "author": "Oblique4119375",
        "title": "Blood Of Zues [OC] Kore's Plot",
        "content": "Watched this episode and decided to make this",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6l1w6998eeze1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1kh3wza/blood_of_zues_oc_kores_plot/"
    },
    {
        "id": "1kh3p5o",
        "author": "SubjectGloomy4430",
        "title": "A Survey: Will John Mulaney fight three 14 year-old boys on Everybody's Live?",
        "content": "Trying to collect data on the fight to settle a friendly debate between my partner and I! Filling out this survey helps! I'll share the data in a week or so :)\n\n[https://forms.gle/9j3HxKTX1nc2Uqcx7](https://forms.gle/9j3HxKTX1nc2Uqcx7)",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kh3p5o/a_survey_will_john_mulaney_fight_three_14_yearold/"
    },
    {
        "id": "1kgxzrw",
        "author": "indiewire",
        "title": "The 25 Scariest Movies on Netflix: Pearl, Fear Street, Scream &amp; More",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kgxzrw/the_25_scariest_movies_on_netflix_pearl_fear/"
    },
    {
        "id": "1kheifw",
        "author": "dlyop11",
        "title": "NEW DESIGN SUCKS!!",
        "content": "Can we please stop trying to fix what isn't broken? What is up with tech companies making stuff worse? Do the \"engineers\" need to justify their paycheck? If so, FIRE THEM! \n\nfrom the clip i just saw, they are basically copying Amazon prime's design, WHICH IS THE WORST OF ALL THE STREAMERS!!!!! \n\nThis is a very bad idea, Netflix.  All you needed to do what stop the auto play so that one could read about the title.  Prime's UI is so annoying to navigate the way it expands the tile your on, make it harder to scroll and see what's available.  If Netflix does the same, this might be it for me.  Honestly i hope they lose a lot of customers of this. They have the best UI and are ruining it for...? ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kheifw/new_design_sucks/"
    },
    {
        "id": "1khawr7",
        "author": "Upstairs_Demand_6018",
        "title": "How Many Shows Does Netflix Add a Week?",
        "content": "I'm asking for your guesses as I'm sure it fluctuates and nobody knows for certain. And I'm talking all shows on Netflix (scripted and unscripted).\n\nHow many would you say are added each week on average? Just give an estimate. And yes, this is a dumb question that I'm sure not a lot of people think about lol.\n\nIs it worth the subscription? Thanks.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1khawr7/how_many_shows_does_netflix_add_a_week/"
    },
    {
        "id": "1kh7m17",
        "author": "Internal-Bed-3150",
        "title": "She's back! Emily in Paris season 5 filming announcement debuts Emily's bold new look",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kh7m17/shes_back_emily_in_paris_season_5_filming/"
    },
    {
        "id": "1kh55f4",
        "author": "chaigaii",
        "title": "YOU editing error S5E7?",
        "content": "im watching the last season of YOU and with 41:20 mins left on ep 7, a lowercase b randomly appears at the bottom while the lawyer spoke/the intro credits were rolling.. lmao did anyone notice this? i'd take a photo if i wasnt using the mobile app\n\n",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kh55f4/you_editing_error_s5e7/"
    },
    {
        "id": "1kfvs35",
        "author": "RGBLEDWill",
        "title": "Netflix allows children to upgrade plans.",
        "content": "Got home and saw an email from Netflix saying my account had been upgraded to the $25 4K plan. Seems one of my kids got a prompt and upgraded (from their child account). Netflix support was like, “yep, they can do that.” Wild",
        "upvotes": 552,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1kfvs35/netflix_allows_children_to_upgrade_plans/"
    },
    {
        "id": "1kgxjz6",
        "author": "jingle_dingle_berry",
        "title": "Netflix debuts its generative AI-powered search tool | TechCrunch",
        "content": "Will you use this AI tool from Netflix, to personalize your viewing experience, I've tried the Spotify AI to make playlist and the recommendations are hit or miss based on the prompt you put in. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kgxjz6/netflix_debuts_its_generative_aipowered_search/"
    },
    {
        "id": "1kgx4fd",
        "author": "drawnonglass",
        "title": "Weird bug on resuming short episodes",
        "content": "just more or less rage-quit netflix and I'm curious whether other people are seeing this bug too. If I watch an episode of something (Love / Death / Robots in this case) and then stop, when I go back to it later it will start playing the next one instead of resuming what I was watching. This happens even if I'm less than halfway through it. \n\nWorse, if I manually go back to the last one and try to play it, the app just quits completely and puts me back on the roku main screen. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kgx4fd/weird_bug_on_resuming_short_episodes/"
    },
    {
        "id": "1kgc6yt",
        "author": "anonRedd",
        "title": "Fear Street: Prom Queen - streaming May 23!",
        "content": "",
        "upvotes": 16,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc6yt/fear_street_prom_queen_streaming_may_23/"
    }
]