[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 31,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kldjbn",
        "author": "HERE-F0R-THE-TEA",
        "title": "The four seasons was okay??",
        "content": "I can definitely understand why a lot of people loved the show but it just didn’t fully do it for me.. yeah I was definitely laughing for many parts but my biggest issue was the pacing. Certain ends to episodes left me wanting to see how the chaos would play out but would just enter the next episode months into the future. \n\nI think the pacing wasn’t for me but entertaining cast. \n\nAnyone else ?!? ",
        "upvotes": 21,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1kldjbn/the_four_seasons_was_okay/"
    },
    {
        "id": "1kkxwi5",
        "author": "EthanWilliams_TG",
        "title": "Netflix's Hit Series 'Lupin' Is Coming Back for a Fourth Part",
        "content": "",
        "upvotes": 72,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kkxwi5/netflixs_hit_series_lupin_is_coming_back_for_a/"
    },
    {
        "id": "1kla8jz",
        "author": "Curious_Cranberry543",
        "title": "Relaxing lifestyle shows?",
        "content": "I really liked With Love, Meghan, because I thought it was relaxing. I know a lot of people are weirdly, passionately vitriolic towards it… but pls don’t comment any rants… I am just asking for a rec for another relaxing show that is lighthearted and calming after a stressful day. Feel free to share anything that you think is in that genre, but better. Thank u",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kla8jz/relaxing_lifestyle_shows/"
    },
    {
        "id": "1klf6xl",
        "author": "LoveOnPawzz",
        "title": "13 Reasons Why",
        "content": "I just finished reading the book and went on the the show.. I’m disappointed. One, why is there four seasons? Oh and spoilers if you haven’t read it. There should only be one season with episodes for each tape. Going through clays night. Not this having him go through by days, he did it in one night. Plus the facts in the tapes are wrong. Half the show is inaccurate and I was really expecting more… what are your opinions?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1klf6xl/13_reasons_why/"
    },
    {
        "id": "1kla37n",
        "author": "Chef__Goldblum",
        "title": "Million Dollar Secret",
        "content": "For the next season (if there is one) I’d love there to be an edit where we can play along. We don’t know who has it. We don’t see the confessionals of ‘I feel so guilty’ just a chance to be as shocked as the others when it is/isn’t who we all suspect! \n\nPlus not knowing the challenges would be so cool. \n\nWould be a hard edit, but I would watch twice. Once not knowing and once knowing with the commentary and agendas and things. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kla37n/million_dollar_secret/"
    },
    {
        "id": "1klbr6x",
        "author": "ToonAdventure",
        "title": "Cells At Work! | Official Trailer | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1klbr6x/cells_at_work_official_trailer_netflix/"
    },
    {
        "id": "1kkzaxk",
        "author": "indiewire",
        "title": "Madonna’s Life Story to Be Adapted Into Netflix Limited Series from Shawn Levy",
        "content": "",
        "upvotes": 15,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1kkzaxk/madonnas_life_story_to_be_adapted_into_netflix/"
    },
    {
        "id": "1kkj5a6",
        "author": "Upset-Look2811",
        "title": "Deadly American Marriage",
        "content": "The scene at 24:01 where Molly is filming the kids on the swing and asks Sarah how old she is and Sarah answers 2, then Molly says 2 and a half.  Then she pans pover to Jack and ask how old he is and he proudly  says 4 and a half , and she says,,,,, are you sure?  Are you sure ? because tyhose noises ahahah you make sound like a one and a half.. THAT IS EVERYTHING YOU NEED TO KNOW ABOUT HER.  DISGUSTING. MANIPULATIVE. ABUSIVE. NARCISSISTIC ",
        "upvotes": 171,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1kkj5a6/deadly_american_marriage/"
    },
    {
        "id": "1kl86wj",
        "author": "Itachi_uchiha_62",
        "title": "can't watch Raw live stream tonight, anyone else have this issue?",
        "content": "Hello, posting this on behalf of my dad as he is the one who watches Raw.\n\nfor some reason whenever he clicks on the raw watch live button the same error pops up saying \"this title is not available to watch instantly\" this only applies for raw and he can watch other movies just fine with no issues. If it's any help he is watching over the PS4 application\n\nSo is anyone else experiencing this issue?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kl86wj/cant_watch_raw_live_stream_tonight_anyone_else/"
    },
    {
        "id": "1klcthc",
        "author": "Adorable_Fail_7974",
        "title": "Screen flickering on full screen mode",
        "content": "Whenever I try to watch something on my laptop and press full screen, the screen flickers and moves up and down. This literally only happens when I use netflix. Does this happen to anyone else and is there any way to fix it?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1klcthc/screen_flickering_on_full_screen_mode/"
    },
    {
        "id": "1kl405z",
        "author": "JackStraw388",
        "title": "Do we know who the next installment of the “Monster:” series will be about?",
        "content": "We’ve had Dahmer and the Menendez brothers. If Netflix’s decides to make another one I’m hoping for one about either John Wayne Gacy or Ted Bundy. I’d love to hear your thoughts.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kl405z/do_we_know_who_the_next_installment_of_the/"
    },
    {
        "id": "1kk752l",
        "author": "Short-Complex4819",
        "title": "A Deadly American Marriage - Molly's Lies",
        "content": "Among her many INSANE lies was something that didn't sit well with me at all. Wondering if anyone else thought of this too.\n\nSo Molly lied to the maid of honor and said she had been friends with Mags, the wife who died of an asthma attack. Why didn't anyone say to the father when he gave those lies about Mag's father: Didn't your daughter claim to be friends with Mags? If she had been murdered by Jason, why didn't she know already to be afraid of him? Why did she marry someone who she thought had killed her friend?\n\nThere were SO many opportunities here to catch these people up in her lies and to send them to jail forever, and I am just beyond disgusted that there wasn't a bigger push to expose her for the BPD lying fraud she is, and HE is.",
        "upvotes": 353,
        "comments": 199,
        "media": null,
        "permalink": "/r/netflix/comments/1kk752l/a_deadly_american_marriage_mollys_lies/"
    },
    {
        "id": "1kkrdbj",
        "author": "Robin__Throwaway",
        "title": "I Just Finished Watching Forever Y'all",
        "content": "&gt;! I'm not crying. You're crying!😩!&lt;\n\n&gt;!What did you guys think? I thought the show was well done. The relationship between Justin and Keisha was very endearing and tender when they were getting along.!&lt;\n\n&gt;!I know it was a realistic ending but with a name like forever I guess I was hoping my fairy tale happy ever after. Yes I know it's still happy in a sense but a bit bitter sweet. Do you think there we be another season?!&lt;\n\nAlways nice to see Wood Harris (Justin's dad). Overall I thought the acting was quite good.\n\nThoughts\n\nCovering my bases by covering everything with the spoiler cover. Wasn't sure if this should be tagged discussion or new on Netflix",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kkrdbj/i_just_finished_watching_forever_yall/"
    },
    {
        "id": "1kksvyi",
        "author": "PoblacionArdiente",
        "title": "Culinary Class War the best",
        "content": "*Culinary Class Wars* is an electrifying competition where 80 underdog \"Black Spoon\" chefs take on 20 elite \"White Spoon\" masters in intense, taste-driven battles that redefine the culinary hierarchy.",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kksvyi/culinary_class_war_the_best/"
    },
    {
        "id": "1kk7yoq",
        "author": "S4v1r1enCh0r4k",
        "title": "David Fincher and Netflix Reportedly Clash Over Title of Squid Game American Spin-Off, Netflix wants to keep \"Squid Game\" in the title, Fincher doesn't",
        "content": "",
        "upvotes": 120,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1kk7yoq/david_fincher_and_netflix_reportedly_clash_over/"
    },
    {
        "id": "1kk53z5",
        "author": "cdigir13",
        "title": "A Deadly American Marriage: Molly’s Mom",
        "content": "I was basically convinced it was an actual murder when I heard Molly’s Mom was there the whole time. And that her story was, Molly’s Dad and Mom heard Molly scream and her dad grabbed a baseball bat and went to see what was going on and her mom rolled over and went back to sleep.  But what really convinced me was later it they said Mollys parents were aware of the “domestic abuse” and that her mom gave the children specific safe words and her phone number and had the children hide it because Mollys Mom believed he was that dangerous. There is NO WAY you would roll over and go back to sleep in that situation. She would have been awake and 911 called or ready to be called. ",
        "upvotes": 142,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1kk53z5/a_deadly_american_marriage_mollys_mom/"
    },
    {
        "id": "1kkvgf8",
        "author": "Ok_Cod_8664",
        "title": "Battle Camp - Thumbs Up and Thumbs Down Contestants",
        "content": "Just stated Battle Games…\n\nChase makes me want to turn it off! Can’t escape that dude and can’t stand him! Also, Irina UGH. She’s just…UGH. \n\nBut on the plus side, I love Georgia! Also Shubham. Nice to see them both again. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kkvgf8/battle_camp_thumbs_up_and_thumbs_down_contestants/"
    },
    {
        "id": "1klciel",
        "author": "ConsistentCareer483",
        "title": "Anyone heard of \"Artfact Note\"? Looks like a clever streaming access trick but feels too good to be true.",
        "content": "So, one random day I was scrolling through Facebook and saw a post in a Netflix-related group. The caption was “sharing is caring,” and it showed this app/interface called Artfact Note—basically disguised as an artifact-looking app, but once you enter a specific code, it unlocks access to a bunch of streaming platforms like Netflix, Disney+, HBO, etc.\n\nI got curious (of course) and tried it out. Been using it for a day and, honestly? It works. I can actually stream shows without the usual login/subscription steps. It really feels too good to be true.\n\nI dug around a bit—checked their privacy policy, user agreement, etc.—and nothing seems immediately sketchy. It explicitly states that it does not collect or store personal data.\n\nStill, I can’t help but feel like there’s a catch. Either it’s harvesting something quietly, or it’s going to stop working one day and leave everyone hanging. Anyone here tried it or have any idea what the risks might be?\n\nNot trying to promote it, just curious if anyone else has encountered this. Thoughts?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1klciel/anyone_heard_of_artfact_note_looks_like_a_clever/"
    },
    {
        "id": "1kkd0la",
        "author": "54321hope",
        "title": "Fuuuuuck. (Orgasm Inc) I need brain bleach.",
        "content": "I missed this in 2022 and decided to watch this today after seeing news about the federal trial, but knowing nothing else about it. \n\nIronically, I just really wanted some distraction from things I'm worrying about. Big mistake. Totally and profoundly SHOOK. Repulsed, nauseous, and I was weeping by the end for some of the victims who spoke up in one way or another. Nicole Daedone is an egomaniacal monster and I hope they throw the WHOLE book at her. Off in search of some comedic antidote....",
        "upvotes": 26,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1kkd0la/fuuuuuck_orgasm_inc_i_need_brain_bleach/"
    },
    {
        "id": "1kkp31c",
        "author": "Parking_Goal_8525",
        "title": "Bill cycle question",
        "content": "I started the $7.99 plan on May 1 and want to change to $17.99 plan. I noticed that the new plan will start now and I will pay $17.99 starting May 20. I wonder what is the gap here? And what’s my next payment? June 20?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kkp31c/bill_cycle_question/"
    },
    {
        "id": "1kkqj0t",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix’s ‘Forever’ Star Lovie Simone Wants Viewers To “Have Fun With Love, Even Though It Can Hurt You”",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kkqj0t/netflixs_forever_star_lovie_simone_wants_viewers/"
    },
    {
        "id": "1kk5oez",
        "author": "proofofclaim",
        "title": "Was Zero Day written by AI?",
        "content": "Would any anonymous Netflix employees care to divulge anything?\n\nThe plot was so disconnected, so many loose threads that went nowhere and intrigues that turned into dead ends. \n\nThe characters were flat and some of the dialogue was bizarre. Some conversations just came to weirdly abrupt ends or with people blurting out inappropriate tangents. \n\nThe scenes were all too short and chaotic, like those 10 second clips with no cohesion people generate in Runway and call a movie. \n\nAnd the black female president was too incompetent to lead so they had to call back the old white former president with Alzheimers?\n\nHow did they get flaming liberal actors like De Niro to star in a miniseries that is a conservative's wet dream? \n\nNothing about this show makes sense! I just have this strong feeling that this is an experiment in AI generated scripts.",
        "upvotes": 28,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1kk5oez/was_zero_day_written_by_ai/"
    },
    {
        "id": "1kko1d8",
        "author": "Independent_Win_710",
        "title": "Xo kitty",
        "content": "Is it just me or does anyone also think dae's singing skills are horrible?\n\nAnd why does kitty make everything about her every damn time ?! Like gurl get a life\n\nAlso why haven't seen none of these students actually study like they are doing everything but study 🙄",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kko1d8/xo_kitty/"
    },
    {
        "id": "1kjiek1",
        "author": "Opening_Income9862",
        "title": "A Deadly American Marriage",
        "content": "I was keeping an open mind as to the guilt of Molly and her father. Then, they described the recording devices she had set up. \n\nThe fact that the worst example of his 'abuse' that they shared from the recordings was that argument over the dinner sealed the deal for me. That OBVIOUSLY wasn't abuse and the fact they thought THAT was evidence of abuse is actually the strongest evidence that he WASN'T abusive. He sounded frustrated, and yes, he was kind of a jerk to his daughter, but abuse? Insane. A biological parent threatening to separate the kids from their stepparent in response to the stepparent threatening the same thing is a pretty natural response.\n\nMolly clearly has borderline personality disorder and both Molly and her Father are sick individuals, in my opinion. ",
        "upvotes": 852,
        "comments": 522,
        "media": null,
        "permalink": "/r/netflix/comments/1kjiek1/a_deadly_american_marriage/"
    },
    {
        "id": "1kkysce",
        "author": "Chicks_Hate_Me_Too",
        "title": "Not part of the Netflix Household.",
        "content": "I got the message \"Your house isn't part of the Netflix Household for this account\", so they stopped giving me access to the the account from MY house. I manage the finances for someone in the family and pay the bill, but I am not in that house. So, if I can't have access, I cancelled it. Way too many other options, and many for free.\n\nI bet others are going to get the same message and do the same thing, cancel. This might be why the stocks starting to tank.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kkysce/not_part_of_the_netflix_household/"
    },
    {
        "id": "1kk528v",
        "author": "GenTrapstar",
        "title": "Brooklyn Nine Nine",
        "content": "Just want to say I really like Captain Holt’s character. Watched the show when it first came out probably the first 3 seasons. Recently picked it back up and it’s still just as funny. Glad to kno there’s 8 seasons sad that it came to a finale😞\n\nP.S all the characters are great and have good personalities IMO. Like there’s not really a bad character on the show IMO. ",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kk528v/brooklyn_nine_nine/"
    },
    {
        "id": "1kkrcn4",
        "author": "sololegend89",
        "title": "Can you add your signature?",
        "content": "Save Bandersnatch and the platform it runs on! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kkrcn4/can_you_add_your_signature/"
    },
    {
        "id": "1kkfrvx",
        "author": "Tilley881",
        "title": "Space Force s3",
        "content": "With all the nonsense going on in our country lately, this is a prime time to give us a space force season 3. Season 2 was kinda meh....but this could be epic!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kkfrvx/space_force_s3/"
    },
    {
        "id": "1kkcclz",
        "author": "Zestyclose-Let7929",
        "title": "Netflix shuts off during a watch and after every episode.",
        "content": "I cancelled my Netflix because I was forced to upgrade to the $17.99 a month because my $7.99 plan with Ads shut off during shows. Turned off after every episode. The Ads freeze. Then shuts off. \n\nI paid the $17.99 a month for a while to be able to continue the shows. \n\nI figured let them figure out the problem. \nHere I am 6 months later and the same issues. \n\nActually it also kicks me out of Netflix and I have to start to reload again. Only to have it happen minutes later. \n\nThis is clearly intended to go to the $17.99 a month because I am not the only one experiencing. \n\nAnd I order thru Netflix directly. No third party, ",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1kkcclz/netflix_shuts_off_during_a_watch_and_after_every/"
    },
    {
        "id": "1kj3bot",
        "author": "RoxieMatthews",
        "title": "Molly Martens is a psycho - A Deadly American Marriage",
        "content": "I’m in shock with this girl - she’s an absolute psycho. Like the audacity to be talking like she’s the victim!? Like we should feel bad for her?\n\nHer lies about giving birth to Sarah, and how obsessed she is talking about adopting them. She wanted those kids and Jason paid for it. \n\nAlso the RECORDING they tried to use as proof as abuse is insane. Yelling and fighting within families is normal and doesn’t = abuse. Absolutely pathetic excuse. \n\nHer and her disgusting father should still be in prison. I hope she has an awful life. Vile humans. ",
        "upvotes": 1500,
        "comments": 865,
        "media": null,
        "permalink": "/r/netflix/comments/1kj3bot/molly_martens_is_a_psycho_a_deadly_american/"
    }
]