[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 482,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gsenwg",
        "author": "AutoModerator",
        "title": "JAKE PAUL v. MIKE TYSON Fight Megathread",
        "content": "&amp;#x200B;\n\nhttps://preview.redd.it/w8ywthvqp61e1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=95e740ea33c09fcd4e8c898ea8b46958cd88635d",
        "upvotes": 122,
        "comments": 5781,
        "media": null,
        "permalink": "/r/netflix/comments/1gsenwg/jake_paul_v_mike_tyson_fight_megathread/"
    },
    {
        "id": "1gzi47u",
        "author": "techfinpro",
        "title": "Ted Danson’s New Series ‘A Man On The Inside’ from ‘The Good Place’ Creator Michael Schur Debuts at Number 1 on Netflix",
        "content": "",
        "upvotes": 45,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1gzi47u/ted_dansons_new_series_a_man_on_the_inside_from/"
    },
    {
        "id": "1gzm3oh",
        "author": "IrishStarUS",
        "title": "JonBenét Ramsey's dad vows to hold on until killer caught - as police 'wait for him to die' amid new Netflix doc",
        "content": "",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gzm3oh/jonbenet_ramseys_dad_vows_to_hold_on_until_killer/"
    },
    {
        "id": "1gzju2e",
        "author": "anonymous231722",
        "title": "Must watch Netflix series!! ",
        "content": "I have watched : stranger Things, Money heist, GOT, Sex education, Wednesday. \nRecently I watched Alice in borderland and pretty much liked it. \nCan you all suggest some more good series to watch. \n",
        "upvotes": 6,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1gzju2e/must_watch_netflix_series/"
    },
    {
        "id": "1gzmuzr",
        "author": "WesHarrison",
        "title": "Harlan Coben’s New Netflix Series ‘Missing You’ Drops Trailer After Runaway Success Of ‘Fool Me Once’",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gzmuzr/harlan_cobens_new_netflix_series_missing_you/"
    },
    {
        "id": "1gzeqm3",
        "author": "aBlastFromTheArse",
        "title": "Pantheon",
        "content": "Any love for the show around here?\nI don't watch a lot of animated shows/anime but this show is absolutely blowing me away. \nThe information about season 2 seems very confusing. Looks like it was created but only released in certain parts of the world? \nCan anyone confirm if season 1 wraps everything up before I get to the end? ",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gzeqm3/pantheon/"
    },
    {
        "id": "1gznbhs",
        "author": "Senegal47",
        "title": "Need replacement show",
        "content": "I'm currently in the third and final season of The Lincoln Lawyer. I need something of that caliber to replace it when I'm done: no gory violence, explicit sex or excessive bad language. Something \"calm\" like The Lincoln Lawyer, preferably drama (no comedies or dramedies), but suspense wouldn't be bad. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gznbhs/need_replacement_show/"
    },
    {
        "id": "1gzmd7c",
        "author": "cylemmulo",
        "title": "Whenever an ad plays it wrecks the bitrate on android",
        "content": "I've got an android tablet, and sadly the stupid tmobile ad plan. It's not a huge deal normally, but when i'm streaming now, and an ad plays, it reduces the bitrate to a blurry mess, then when it goes back to the video it's stuck at that horrible blurry bitrate and never gets better until I force close the app and re-open it. Even it I exit the show and re-enter it the bitrate stands.\n\nIDK how they screw things up this bad with ads.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gzmd7c/whenever_an_ad_plays_it_wrecks_the_bitrate_on/"
    },
    {
        "id": "1gzld55",
        "author": "MovieGuyTravis",
        "title": "Official Trailer for Netflix’s The Six Triple Eight",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gzld55/official_trailer_for_netflixs_the_six_triple_eight/"
    },
    {
        "id": "1gzg0b2",
        "author": "Bapposaurus",
        "title": "Netflix problems",
        "content": "Netflix keeps causing my monitors to turn on and off repeatedly unless I go to another tab it happens because my graphics acceleration is turned on, but when I turn it off the resolution drops to 540p or 480p which is wild. I know it's not my internet because I have gigabit, and not my pc because it's relatively good, I just can't figure out what the problem is",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gzg0b2/netflix_problems/"
    },
    {
        "id": "1gyhqsm",
        "author": "waseijin",
        "title": "They killed a Goat in a japanese reality show",
        "content": "There is a reality show in Japan called \"Ai no Sato\".\nIn Season 2, they brought a miniature goat into an old, rotting house with no vet or specialist.\nAfter a month outside on a cold winter night, with little or no food, the miniature goat died.\nIt's unbelievable, absurd, and unrealistic.\nJapanese production company are terrible, but for Netflix to approve this and release the show is crazy.\nI contacted support and cancelled my subscription.\nI can't believe they would kill animals like this.\nI'm so angry rn...",
        "upvotes": 464,
        "comments": 141,
        "media": null,
        "permalink": "/r/netflix/comments/1gyhqsm/they_killed_a_goat_in_a_japanese_reality_show/"
    },
    {
        "id": "1gz46v1",
        "author": "Original2021",
        "title": "Kudos to the cast of The Piano Lesson",
        "content": "I wasn't familiar with the play but decided to watch the movie anyway. The cast was fantastic. The woman who plays Beatrice and the lead actor both deserve Oscar nods along with best cast ensemble.  Samuel Jackson is always reliable but the whole cast was really memorable. The plot was a little slow moving in the beginning but the cast really carried the film well. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gz46v1/kudos_to_the_cast_of_the_piano_lesson/"
    },
    {
        "id": "1gz2v9c",
        "author": "ScifiCanadian",
        "title": "RECCOMEND MOVIES OR TVSHOWS ",
        "content": "I'm on a desperate watch to find another film to binge. Can you guys help me recdomended some shows or movies to watch? I don't have a specific preference however I did like shows such as The Good Place, cobra kai, and remember me. Maybe that can u help u guys with suggestions ",
        "upvotes": 6,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1gz2v9c/reccomend_movies_or_tvshows/"
    },
    {
        "id": "1gyklsn",
        "author": "philomatic",
        "title": "A man on the inside",
        "content": "Show by Michael Schur starring Ted Danson\n\nJust finished it and it was great. I was expecting it to be 80% comedy, but I’d say it’s more 50% comedy and 50% feeling with a mystery built in. I’d say similar to the final couple seasons of The Good Place.\n\nI was not expecting to like it as much as I did. ",
        "upvotes": 70,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1gyklsn/a_man_on_the_inside/"
    },
    {
        "id": "1gzapm8",
        "author": "VegetableStart1781",
        "title": "English Subtitles",
        "content": "So i watched the first 10 episodes of The Story of Pearl Girl which is a c-drama and they all had english subtitles. But then starting from episode 11 there are no more english subtitles available and only have the chinese ones. is this a glitch or am i supposed to wait for the english ones to come out as the episodes are relatively new. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gzapm8/english_subtitles/"
    },
    {
        "id": "1gz5yuh",
        "author": "HipsLikeHunie",
        "title": "Error Code",
        "content": "I’m getting an error code every time I try to boot on my Vizio smart tv but I can’t find that error code anywhere even in the Netflix website. tvq-st-132 it’s working fine on multiple phones but the tv keeps giving this error code along with “Something went wrong. Please try again later”",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gz5yuh/error_code/"
    },
    {
        "id": "1gz5nep",
        "author": "cloudiestmind",
        "title": "Cannot Airplay Netflix and other streaming services",
        "content": "Hello! I just bought a projector that works with Airplay but when i try to stream from Netflix, Prime Video, Mubi and others it doesn’t work. Youtube and other random videos do. Is there any way to fix it? If not, can I still stream on it by connecting my laptop with an hdmi cable? Thanks for your answers ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gz5nep/cannot_airplay_netflix_and_other_streaming/"
    },
    {
        "id": "1gybd2g",
        "author": "ChirrBirry",
        "title": "Arcane is EXCEPTIONAL ",
        "content": "I don’t just want more seasons of Arcane…I *need* it. This show fills a content gap I didn’t know could be satisfied. \n\nNormally I hate character development and over the top attempts to connect the viewer with characters, but Arcane makes the endeavor a pleasure. The animation style fills me with joy, it’s like when the first season of Avatar: The Last Airbender came out and we all had our jaws drop to the floor.\n\nI’ve never played a single second of LoL but now I’m fully immersed in a world that I’m pissed might come to an end as I finish the last episode of season 2. More please.",
        "upvotes": 107,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1gybd2g/arcane_is_exceptional/"
    },
    {
        "id": "1gz4vpx",
        "author": "BigCheetah6345",
        "title": "Video doesn't run in hd ",
        "content": "So i just got netflix subscription and it doesn't run videos on 1080p even though my phone is capable of it it just runs on 480p it is very annoying does anyone have a solution.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gz4vpx/video_doesnt_run_in_hd/"
    },
    {
        "id": "1gyj58r",
        "author": "Proof_Cable_310",
        "title": "Any feel good stuff out there that's not Hallmark cheesy?",
        "content": "I feel enough toxicity, drama, and bad influence in the world as is. I'd like to escape that with some feel good tv. Ideally, no cake wars, nor anything \"off script\", nor reality. Any recommendations?",
        "upvotes": 28,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1gyj58r/any_feel_good_stuff_out_there_thats_not_hallmark/"
    },
    {
        "id": "1gyy47w",
        "author": "itisnottherealme",
        "title": "Decent parental controls",
        "content": "There is a lot of good content on Netflix, and a lot of trash - all of which has a maturity rating.\n\nSurely it is not beyond the wit of Netflix to give decent granular parental controls, where I can allow or block content by category (e.g. Teen high school drama, nature documentary, spooky etc ...) as well as age rating. This type of web filter has been around for 20 years, so why not Netflix. I don't want to manually type in 1,000 titles to remove them from my children's profile.\n\nA 12 is rated purely for sex, violence and nudity - but the topic is often not appropriate for a 12 year old to watch.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gyy47w/decent_parental_controls/"
    },
    {
        "id": "1gz0v0z",
        "author": "Icy-Cartographer3314",
        "title": "Can’t do anything during the end of the show",
        "content": "This is a weirdly specific thing, and I have no clue why it happens. I have Netflix downloaded on my Xbox, and after I finish an episode of a show/movie when it reaches the end credits I can’t do anything. This is purely a Netflix issue because on all of my other apps like Hulu this isn’t a problem, and I can still exit out of Netflix through my Xbox, but while in Netflix I can’t back out, fast forward, rewind. Before it reaches the credits I can do all of these things with no issues, but as soon as it starts playing the ending theme for a show I’m locked. This makes it hard to watch things with my gf, and is a general hassle to deal with. Has anyone else had this issue and if so do you know how to fix it? Thank you!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gz0v0z/cant_do_anything_during_the_end_of_the_show/"
    },
    {
        "id": "1gyfyis",
        "author": "Senturos",
        "title": "Arcane... A fucking masterpeace!",
        "content": "Man, what to write about this show. Because well, I love it. I mean I've never played or will ever play League of Legends. But the characters, the story, it was all fucking perfect. I'm a 30-year-old man, and this shit brought me to tears. Every emotion I was meant to feel, I did.  \nAs a man, I'm not meant to, you know, feel these feelings out there, but with shows like this, I can. I remember swallowing nothing when a character was betrayed. I felt that same anger in my pit.\n\n  \nI know deep down there is more to this, and I can't wait to see where the story goes from here and what characters come out from it. But to the writing team and all those that made this show, hold your head up high because you guys did a top fucking job! The animation, the characters, the story was fucking on point all the time. Can't wait to see more from this team.",
        "upvotes": 30,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gyfyis/arcane_a_fucking_masterpeace/"
    },
    {
        "id": "1gzayrb",
        "author": "Brightclaw431",
        "title": "why is the english dialogue in anime so hard to hear?",
        "content": "So I am trying to watch scissor seven in the english dub and I can't hear 90% of what they are saying as the dialogue is too damn low despite my sound bar being cranked up to near max.\n\n  \nI looked into the audio settings, but there is just one english option, not like you can switch it from english 5.1 to english original.\n\n  \nIs this just a \"me\" problem, an anime audio mixing problem or a Netflix problem as I have noticed the same thing with other anime in that that the english dub dialogue is way to quiet",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gzayrb/why_is_the_english_dialogue_in_anime_so_hard_to/"
    },
    {
        "id": "1gyrajp",
        "author": "whitehawk295",
        "title": "Arcane Season 2 Preview Spoiler",
        "content": "I'm not sure if anyone knows how to suggest things to Netflix but I couldn't believe how big of a spoiler they put for the season 2 preview when you hover over Arcane. It's with Jinx and Vi when they are in those tunnels, so disappointing.\n\nPlease do not watch this preview it has massive spoilers!!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gyrajp/arcane_season_2_preview_spoiler/"
    },
    {
        "id": "1gyvpa4",
        "author": "Offer_Euphoric",
        "title": "Hdr option not available ",
        "content": "My phone, an Oppo Reno 6 Pro, supports HDR, but the HDR option isn't available in my Netflix app, even though I'm subscribed to the highest plan. According to Netflix's website, phones like the Oppo Reno 5 do support HDR. Could this be a bug, or does anyone know any work around??",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gyvpa4/hdr_option_not_available/"
    },
    {
        "id": "1gyunrb",
        "author": "TheMonoMew",
        "title": "Smart downloads never update on iOS",
        "content": "Title mostly, I enabled it so that I’d always have something to watch. It worked the first time and downloaded and filled up the storage limit I set, but now I’ve watched all of that and it won’t delete or download anything else! I increased the storage limit to 3 GB and it’s not even using 2 GB. I searched around for a bit but I didn’t find anyone else who had this issue. Manual downloads work fine, and there is almost 100 GB left on my phone so that should be no issue. I know iOS is pretty aggressive with background apps so I have background app refresh enabled for it as well. I have another app with the feature and I don’t think that one is working either. Does anyone have any advice? Thanks!!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gyunrb/smart_downloads_never_update_on_ios/"
    },
    {
        "id": "1gz5qry",
        "author": "VINIJRFAN",
        "title": "Netflix keeps telling there are two many devices signed in ",
        "content": "Our house has the platinum subscription where they allow 4 devices to sign in, its used to be 4 devices until my mother signed in with her new ipad, now me and father keep going back and forth, since i would sign in with my device my father’s device would be signed out for some reason, and my father would sign in again with his device and my device will get signed out, i even entered one of the other devices signed into Netflix and clicked sign out and the problem would still occur, at this point there’s now way there is too many devices signed in but thats what Netflix tells me, unless I maybe didn’t do it right? please help y’all ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1gz5qry/netflix_keeps_telling_there_are_two_many_devices/"
    },
    {
        "id": "1gymnp9",
        "author": "Playosaurus",
        "title": "Anyone Else Experiencing \"We are experiencing technical difficulties\" logging in?",
        "content": "Ive been been having login issues for the past 3 days. Every time I try to login using password or sign in code I get various technical difficulty messages. I called Netflix twice and they said they were having issues with browser login and devs were already trying to fix it. They said the Netflix app from the MS store should work but that doesnt either. They insisted TV were not having any issues, so I logged out of both TVs and my iphone and now they cant login either. \n\nI find it difficult to believe Netflix would be having this kind of issue for this long as:\n\na) Netflix availability page says that all services are up.\n\nb) I cant find any threads about this currently. You would think if browser, iphone, and TV logins were failing this would be talked about after a full day.\n\nI have to wonder since Ziply did a major upgrade in my area 2-3 days ago and I received a new IP address (on a whole new class A), am I somehow there is a routing error or Im being geoblocked or something.\n\nEvery other streaming service works fine. Im not having any issues at all other than Netflix. Ive cleared cookies, cache and rebooted. \n\n",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gymnp9/anyone_else_experiencing_we_are_experiencing/"
    },
    {
        "id": "1gysix5",
        "author": "EiffelPower76",
        "title": "BSOD in Windows 11 with NetFlix on Google Chrome and nVIDIA GPU",
        "content": "Seems well known BSOD with Google Chrome and Netflix hasn't been solved, happened just last hour\n\nI know that disabling OpenGL hardware acceleration fixes the problem, but it is strange that this bug hasn't been fixed yet ?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gysix5/bsod_in_windows_11_with_netflix_on_google_chrome/"
    },
    {
        "id": "1gyif7v",
        "author": "Pincg",
        "title": "Weird static when people talk in Dexter?",
        "content": "I’ve been watching Dexter and whenever people are having a somewhat quiet conversation, there’s a weird almost windy/static noise during speech. I’m assuming it’s increased volume to make the voices louder, but it sounds like the microphones fuzziness was also made even louder than the voices. What’s going on?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gyif7v/weird_static_when_people_talk_in_dexter/"
    }
]