[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 35,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pyfw6q",
        "author": "WillyBeShreddin",
        "title": "What about Barb?",
        "content": "This has bothered me forever. Everyone seems to be taken for a purpose. The Demigorgons even dodge some characters. When someone dies, they are mourned for episodes or even seasons. Unless you are innocently sitting on a diving board, taken to the underground, and forgotten forever. Why did they do Barb so dirty? What about Barb?",
        "upvotes": 114,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1pyfw6q/what_about_barb/"
    },
    {
        "id": "1pyla96",
        "author": "Efficient_Ear_1851",
        "title": "Just finished Adolescence on Netflix... anyone else need therapy now?",
        "content": "This show hit harder than expected. 4 episodes, each one take, and I'm still processing. Stephen Graham and Owen Cooper are incredible, but wow – that ending.\nNo spoilers, but if you're a parent or remember being 13... brace yourself.\nWhat did everyone think? Worth the hype?",
        "upvotes": 24,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1pyla96/just_finished_adolescence_on_netflix_anyone_else/"
    },
    {
        "id": "1pynsbu",
        "author": "Sakura_Kagayaki",
        "title": "Single papa on Netflix is one of the best series &amp; must watch",
        "content": "Just finished Single papa on Netflix. Couldn’t finish in one go. Initially it took time to strike a chord but once started, u ought to finish it. It offers alternate display of masculinity which is pleasant to watch. Manny played by Daya was a pleasant surprise. ITV is filled with female centric cringe show. But Single papa takes unique stance about how divorced man-child develop parental instinct, apply for adoption. We get overall info about Indian adoption system. It’s a must watch show for all men &amp; women. ",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pynsbu/single_papa_on_netflix_is_one_of_the_best_series/"
    },
    {
        "id": "1pxmcdo",
        "author": "akssh_art",
        "title": "“Stranger Things is just supposed to be a fun sci-fi show” cannot be an excuse for Season 5’s mediocre writing",
        "content": "There’s a part of the fandom that’s using the argument that Stranger Things is just supposed to be a fun sci-fi, with fun cast and emotions, but this does not sit right with me at all. \n\nThe show not only has taken so long to finish, but has also been (I think?) Netflix’s biggest show till date, bringing in a new Sci-Fi IP which demands quality in its storytelling given its scale. Till Season 4, I thoroughly enjoyed the lore of the universe. I felt like the sci-fi elements were the priority (if there was any) and the “fun” stuff was sort of secondary. Season 5 feels like the writers turned into a bunch of teenagers and wrote up some BS to finish the plot.\n\nThe only thing I have liked is the Upside Down being a wormhole. Apart from that, from The Crawl to The Bridge, almost all elements of the lore have insane number of loopholes. Plus, the actors have such cringe dialogues. This wasn’t the show I fell in love with.\n\nSaying “this is just supposed to be a fun sci-fi” screams of calling a superhero movie “just a fun movie” or a shonen anime “just a shonen.”\n\nThe world you build has to make sense, the rules you establish have to matter, and the way you make these stories into a reality has to be upto the mark man. \n",
        "upvotes": 1235,
        "comments": 469,
        "media": null,
        "permalink": "/r/netflix/comments/1pxmcdo/stranger_things_is_just_supposed_to_be_a_fun/"
    },
    {
        "id": "1pykvny",
        "author": "Infinite-Albatross44",
        "title": "Stephen King’s 11.22.63 coming to Netflix on January 7",
        "content": "This used to be on Tubi and Hulu  (not anymore 😒), but Netflix finally picked it up only about ten years late. Fantastic series and a total hidden gem if you’re into period pieces and time travel shows.\n\nJames Franco freaking kills this and the historical production design is really amazing. ",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pykvny/stephen_kings_112263_coming_to_netflix_on_january/"
    },
    {
        "id": "1pxzsjl",
        "author": "Able_Milk521",
        "title": "Enjoying Stranger Things Season 5",
        "content": "Just countering all the hate online for the new season. It's a show. Not real life. \n\nBut like real life sometimes it's more about the journey than the destination. ",
        "upvotes": 135,
        "comments": 137,
        "media": null,
        "permalink": "/r/netflix/comments/1pxzsjl/enjoying_stranger_things_season_5/"
    },
    {
        "id": "1py8zyt",
        "author": "Mandingy",
        "title": "Recommendations Terrible",
        "content": "Why does Netflix recommend things I’ve already watched or rated? Especially things I just watched. They have a huge catalog but I feel like I only see so little for seeing the same things over and over.",
        "upvotes": 36,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1py8zyt/recommendations_terrible/"
    },
    {
        "id": "1pyq7jp",
        "author": "Selection-123",
        "title": "What happens to gift card balance",
        "content": "I subscribed to a $17 plan with a $25 gift card what will happen the second month.I subscribed to a $17 plan with a $25 gift card what will happen the second month.\n\n\n\nWill they keep my account open or steal the money and close it?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pyq7jp/what_happens_to_gift_card_balance/"
    },
    {
        "id": "1pyq12y",
        "author": "sharmarohan136",
        "title": "Series name?",
        "content": "I am trying to recognise the name of the Show from which this character is in . I probably have watched it in the past but don’t remember it. Do you which tv show is this?",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pyq12y/series_name/"
    },
    {
        "id": "1pynujd",
        "author": "NocerinoCarmine",
        "title": "Film simili a Shutter Island: cosa guardare se ami i thriller psicologici con colpo di scena",
        "content": "Se *Shutter Island* ti ha lasciato con quella sensazione scomoda — il dubbio costante su cosa sia reale e cosa no — allora sai già che non stavi guardando solo un thriller. Stavi entrando nella mente di un personaggio… e forse anche nella tua.  \nSe cerchi **film simili a Shutter Island**, preparati a storie fatte di memoria difettosa, identità frammentate e finali che ribaltano tutto quello che credevi di aver capito.\n\nQui trovi una selezione di pellicole **perfette per chi ama i thriller psicologici intensi**, ordinate per affinità tematica e livello di “inganno mentale”.\n\n# Perché questi film sono simili a Shutter Island\n\nI film simili a *Shutter Island* condividono alcuni elementi chiave:\n\n* **Protagonisti inaffidabili**\n* **Memoria alterata o negazione della realtà**\n* **Indagini che diventano viaggi interiori**\n* **Twist finali che cambiano il significato di tutto**\n\nNon sono semplici gialli: sono **thriller introspettivi**, dove la mente è il vero luogo del mistero.\n\n[https://www.cinefatti.it/film-simili-a-shutter-island-cosa-guardare-se-ami-i-thriller-psicologici-con-colpo-di-scena/](https://www.cinefatti.it/film-simili-a-shutter-island-cosa-guardare-se-ami-i-thriller-psicologici-con-colpo-di-scena/)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pynujd/film_simili_a_shutter_island_cosa_guardare_se_ami/"
    },
    {
        "id": "1pyaqrp",
        "author": "YesterdayHiccup",
        "title": "Pause screen block by ads.",
        "content": "Sometimes I pause to check the text and other small details in the scenes. It's really bother some that screen gets blocked by ad when I do this. I don't mind seeing ads every 20 to 30 minutes, but blocking pause screen is really annoying. I guess there are no chance that they will stop this?",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pyaqrp/pause_screen_block_by_ads/"
    },
    {
        "id": "1pym4gw",
        "author": "Aggressive-Ad-8298",
        "title": "The 8 Show",
        "content": "This show has, I must say, a very questionable writing. I just needed to say this in case anyone is wondering and honestly I wouldn't recommend it to others.\n\nEpisodes 1-4. It's good, I could see lots of references and demonstration of our capitalist society. It is also fun and good to see people collaborating because it is what people would naturally do in that situation.\n\nEpisode 5. Also a commentary on the exploitative nature of the system. But the violence is over-the-top and isn't what normal people would ever do. The most anyone would do is to threaten them to earn more points. Everything else was highly unnecessary. And I also don't think it's possible to keep going when you are getting hit like that everyday. \n\nThere is literally no way anyone would ever do what 4, 6, and 8 did. It would work only if they were freaking psychopaths chosen deliberately. That's the only logical answer to their actions.\n\nEpisode 6-8. If you really wanna watch this drama, I recommend you to stop on episode 6. The lower class people revolt and they get their peaceful ending there. Anything past that was unnecessary and outright DUMB. Highlight the word DUMB.\n\nThe psychological torture scenes were unnecessary and over the top cruel, too disturbing even. \n\nAfter episode 6, I just skipped through most parts because it became unbearable for a few reasons.\n\n1. The characters become stupid. \n\nCouldn't they just keep buying stuff until the time is over? Even if 1st floor is against it, they were more than willing to cover his cost so I see no point in them continuing the BS. \nAlso the \"no-violence we-cant-harm-them\" thing was just??? Personally, I would've at least scarred 8's face or something.\n\n2. Their motivations for doing things don't make sense anymore.\n\nWhy did 5th floor just go along with 8? She had multiple chances to stop her but she simply didn't and until 4 convinced her, she wasn't even thinking about saving the others??? They went on and on about how much they suffered and how deep their bond is and then suddenly 5 was helping 8?\n\nAlso, the fact that 8 has gotten away with everything she did was... just ugh. I also don't understand how anyone of them didn't think of killing her. It was obvious what she would do after she gets out into the world with that much of a money. She would definitely do unspeakable things and any sane person would want to prevent that from happening if they were in that situation.\n\nTo me, it all went downhill after 4th episode. And the last two episodes hit such a rock bottom that I'd never ever ever seen on any show. I didn't even  know it was possible to get that bad. Just absurd honestly. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pym4gw/the_8_show/"
    },
    {
        "id": "1px7c2n",
        "author": "Tricky-Bat-2638",
        "title": "Anyone else Disappointed with season 5 of stranger things?",
        "content": "Finding it a little disappointing considering how amazing the first 4 seasons were. \n\nDustin’s character is starting to really grate on me and will has spend most of seasons 1-5 sleeping. Joyce’s voice has just got more irritating as the seasons have gone on. \n\nAnd Millie Bobby brows face barely moves. I’m not judging her for having work done to her face but I do feel like there should be rules in long term series about having a large amount of plastic surgery. Her top lip is huge and barely moves and there’s  minimal expression on her face due to Botox. Some dramatic scenes are ruined from the lack of movement &amp; expression in her face.\n\nOverall I’m a little disappointed",
        "upvotes": 1644,
        "comments": 798,
        "media": null,
        "permalink": "/r/netflix/comments/1px7c2n/anyone_else_disappointed_with_season_5_of/"
    },
    {
        "id": "1pykovj",
        "author": "HelloW0rldBye",
        "title": "Watching Parish, seriously you won't put subtitles for foreign speech if I turn off subtitles?",
        "content": "I really hate this \"feature\" I don't want to watch all the English spoken words on the bottom of the screen distracting me from the show. But when I turn it off I do expect any foreign language to be written on the screen otherwise what I'm expected to learn every language on earth just to enjoy your shows? \n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pykovj/watching_parish_seriously_you_wont_put_subtitles/"
    },
    {
        "id": "1pyillt",
        "author": "strawberry_corpse",
        "title": "Lupita’s ending in “The Accident” doesn’t make sense",
        "content": "I finished the second season of “The Accident” just now and there is one thing I felt to not really be logical. So, everything was going ‘well’ up until Yola visits Lupita in jail and gives her poisoned candy. Alright that, even though, in my opinion, that is also not as logical (even though I get the reference to Moncho’s death and that it was supposed to be ironic) as Yola’s, even if lied, words that she would much rather Lupita rot in prison for all those years. Wouldn’t that give Yola more satisfaction rather than an easy way out for Lupita? It just genuinely didn’t make sense to me, even though I get what the show was trying to do, again, with the irony of Lupita ending up the same way as her victim but at the hands of the victim’s wife’s hands, I get it. But at the same time I don’t find it the logical outcome for the show. \n\nNext, and this is honestly my main point about this, why the hell would Lupita, who poisoned multiple people herself in such a way, eat this candy given to her by someone who has exceptional hatred against her no less? It leads me to believe that she knew the candy would be poisoned and just wanted to use it to commit suicide. I can not explain it in any other way. There is no way she ate that candy, really believing Yola’s words that the candy isn’t poisoned. If that IS what happened then that does not make any damn sense and is downright stupid. \n\nWhat did you guys think of this part? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pyillt/lupitas_ending_in_the_accident_doesnt_make_sense/"
    },
    {
        "id": "1pyid6r",
        "author": "StarchoHeaven",
        "title": "Just finished watching XO, Kitty. All I just want to say is, what the hell?",
        "content": "When I watched the first season, it was quite a nice binge worthy show and I didn't realize they released a new season until today (Yes, they released the second season last year but, I never really saw any hype for the show on the internet). I couldn't bring myself to watch it after the second episode. However, I had to endure the amount of cringe and revolting disgust I felt when watching the show just because I wanted to know who Stella Cho actually was. The whole season is just such a mess. The more I watched it, the more I hated Kitty. I feel like the writing and character development could have been done better. I feel like Kitty only reaches out to people whenever she faces a problem and, the fact she has FOUR people in love with her. Which is kind of insane, honestly. Honestly, out of all these characters, I only liked Stella but, they ruined her character at the end and what do you mean she forgave Min ho's dad after he just said, \"I am sorry for being cruel\", like, you just said a sentence, and she just accepted it!? When you consider Stella was bullied a lot online (She was a YOUNG KID back then. It must have hurt a lot), this kind of simple apology just wouldn't do...... I feel like Stella's goal was better than Kitty's at this point. They keep dragging out the \"I am searching for my mom and I am also gonna keep ending up at several love triangles or squares or even hexagons!\" plot too much. Min ho, Yuri, and maybe especially Kitty had really bad character development.... Why would Min ho even date a girl while he was still following around Kitty like a dog? Yuri is a cheater at this point. Cheating on her girlfriend with Kitty. I hope they make up for this mediocre writing at season 3.....",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pyid6r/just_finished_watching_xo_kitty_all_i_just_want/"
    },
    {
        "id": "1pyi9n6",
        "author": "YamEfficient8427",
        "title": "Why does the same Netflix show support downloads on some devices but not others?",
        "content": "I recently noticed that the same show on Netflix behaves differently depending on the device I'm using. On my phone, the download option is available, but on another device, the option doesn’t appear at all, even though I’m logged into the same account!\nWhy did this happen?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pyi9n6/why_does_the_same_netflix_show_support_downloads/"
    },
    {
        "id": "1pxibja",
        "author": "fluffnubs",
        "title": "The video quality on Netflix is total garbage, and has gotten progressively worse since 2020.",
        "content": "It’s almost unwatchable. We watched the latest Knives Out movie last night and it was like there was a static overlay. If you stared at any characters forehead for more that half a second you’d think it was almost \\*moving\\*. It’s terrible. We have the premium 4K package, a newer 4K TV with full HDR etc etc. Netflix has the highest subscription price of the major streaming services and the video quality - \\*even of their own in-house produced films/shows\\* - is a total, complete compressed mess. We watched Weapons on Crave immediately after and the quality was 1000% better. It was insane the difference. \n\nI remember during the Covid pandemic, they sent out a notice saying they were further compressing the streams to conserve bandwidth under high demand, but it’s never come back. \n\nI’ve been on the fence about even keeping my subscription, and I think this is the final straw. ",
        "upvotes": 120,
        "comments": 104,
        "media": null,
        "permalink": "/r/netflix/comments/1pxibja/the_video_quality_on_netflix_is_total_garbage_and/"
    },
    {
        "id": "1pyoln8",
        "author": "yourundy",
        "title": "What about kate ??",
        "content": "Just finished watching the final season of YOU and I find it unfair the JOE who killed at least 10 people in his life time got locked behind bars meanwhile KATE who killed hundreds of children 🤷🏾‍♂️ went on to live happily ever after. TF?!?!",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1pyoln8/what_about_kate/"
    },
    {
        "id": "1pyeqbw",
        "author": "Levarator_01",
        "title": "A weird issue(nw 3-6)with Netflix on Smart TV",
        "content": "Is it me or anyone facing problem to turn on Netflix while connecting tv to personal hotspot of iphone and showing the error nw 3-6. Tried everything but couldn't find any solution. But the same problem doesn't occur when connecting to android phone with the same carrier?\n\nAnyone has solution to this problem.😐 ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pyeqbw/a_weird_issuenw_36with_netflix_on_smart_tv/"
    },
    {
        "id": "1py7zpr",
        "author": "Level_Investigator_1",
        "title": "Moonhaven - would love to see it renewed on Netflix",
        "content": "Just watched the AMC show and have been pleasantly surprised with how unique it is even if there are some aspects that feel a bit campy. I thoroughly loved it and it would be amazing if they could continue the story given this is essentially a prologue.\n\nThe exploration of human somewhat plausible and non-cynical future human culture and.\n\nIt’s rare that a show explores these aspects of human nature and culture in a sci-fi setting and I loved it. Anyone else feel the same?",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1py7zpr/moonhaven_would_love_to_see_it_renewed_on_netflix/"
    },
    {
        "id": "1py7gbx",
        "author": "Watchhistory",
        "title": "Peaky Blinders - Season 6 (2022) - Rewatch",
        "content": "*Peaky Blinders* (2022) Season 6, supposedly final season. Film sequel, *The Immortal Man*,  coming in March 2026.\n\nGods, this is good - the fascist movement, Mosley, etc. in England, the connections with it, gangster and political in the US. \n\nRe-watching for the first time since it came out, season 6 of *Peaky Blinders* (2022). I'm being deeply impressed with it, I think, more so, than first time around. In other words, this series is aging very well, becoming every more relevant to our own time than even when it released initially. Which is both good, for viewing, and bad, for we *living* in this time.\n\nDiana Mitford is a prominent character due to her intimate relationship with Mosley, the proud Brit fascist/racist would-be prime minister, and her fan girl relationship with Hitler. Watching this in the same year UKTV-Britbox put out another period drama series on the Mitford sisters (*Outrageous,* adapted from a book by Mary Lovell), is disturbing in exactly the way the history of that bundle of sisters always is. How could a family produce both a fascist racist like Diana and a progressive like Jessica?\n\nI am guessing many of those who found season 6 an inferior season, \"not like what it used to be\", is because the season dramatized so specifically how capitalism, class, crime and politics are history's quartet, connected in time's womb. Along with Mosley, a Boston Irish crime boss, Jack Nelson, is Tommy Shelby's antagonist. Nelson is another fascist opportunist-sympathizer, playing both sides against his middle, wired into D.C. political hierarchy at the highest levels, including having easy access to the POTUS. He's a fictional Joe Kennedy.\n\nWhat I like best about this period drama, and so far, particularly, this season, is the range of strong female characters -- and there are many! Again, it seems many viewers couldn't move on without Polly. They loved her strong character -- it had been there from the beginning. These newer women having so much influence on the Shelby family's growth moving into WWII era, seemed not to be to the liking of many viewers either.\n\nIt's so interesting too, seeing other characters hewing in their individual cases back to their cultural roots in many ways, as the world they'd been navigating successfully as crime bosses is changing again, and they look in their own ways to survival and success in their future, particularly Tommy with his Romany imagination, and Alfie Solomons. Sure and they'd be in alliance now and again, both always forever outsiders to Britain's ruling class, no matter how useful, how necessary, they are to it..",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1py7gbx/peaky_blinders_season_6_2022_rewatch/"
    },
    {
        "id": "1pxv4u6",
        "author": "Yuck_Few",
        "title": "Black Rabbit",
        "content": "Since Reddit unfortunately doesn't let you edit a title when you make a typo, I just had to scrap the whole thing and start over... anyway \n\n\nI went into it already expecting it to be good just because it's Jason Bateman and I was not disappointed \n\nBasically first two episode set up the premise, this is the situation they're in and this is how screwed they are if they don't find a solution and then starting it episode 3, the writers do a really good job of snowballing and escalating the tension with each episode. \n\nIn my opinion, Bateman is underutilized as an antagonist character who doesn't think he's the villain.\nHe's really talented at that casual dry situational cruelty. \n\nthat's why he was good and carry on also\n",
        "upvotes": 9,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pxv4u6/black_rabbit/"
    },
    {
        "id": "1pxweik",
        "author": "itsBlissBunny",
        "title": "Spoiler Ad",
        "content": "Everyone’s talking about stranger things, so can we talk about that new spoiler ad?! When I saw the “spoiler ahead” line, I didn’t think they’d literally be spoiling the endings of all their most popular shows?!? Who would want this? You’ll either ruin the show for someone. Or fill people with a redundancy to watch it in the first place. In the end just to promote Stranger Things 5 and make you believe there’s a possibility one of them will die. \n\nI just need to know who the marketing genius was who went  “no trust me, people LOVE spoilers.” 😒",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pxweik/spoiler_ad/"
    },
    {
        "id": "1pyb1z5",
        "author": "Smooth_Increase6865",
        "title": "Language has changed and I can't change it back",
        "content": "I've been watching Lego Ninjago on my account and have just finished the first season. I went to the first episode of season 2 and had noticed it changed to Swedish. \n\nI tried going to the language setting on the episode and only had the option to use Swedish so I tried going to the language setting for my profile and it was already on English. \n\nThe preview is in English, info and menus and the entire first season was also English. Any ways to fix it? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pyb1z5/language_has_changed_and_i_cant_change_it_back/"
    },
    {
        "id": "1pyljpv",
        "author": "Healthy_Birthday_135",
        "title": "ST5 changes i would make in vol 1 and 2",
        "content": "\n⚠️ I’m no director, so I don’t know exactly how these changes would affect the whole story. But these are fixes I think would work without messing up the big plot.\n\n\n1. Holly &amp; Max Plot  \n\nIssue: This plot wasn’t super interesting. It took too much time that could have gone to the main group we’ve followed for 7 years. It also pulled us away from other characters.  \n\nChanges: Skip Holly’s full perspective and making her a main character. Instead, learn that Vecna takes 12 random kids through quick clips and stories that we see and that Max says to the group. Show short clips of all 12 kids, not a full Holly storyline.  \nFor Max: After she wakes from her coma (with a proper reunion), she tells it all. Use simple flashbacks: the portal to Hawkins opening, entering the cave, seeing the memory world for real.\n  \nWhy it works: Solves the boring Holly/Max story, gives main group more time for their plan (key in a finale), and we still get what’s happening with the 12 kids.\n\n\n2. Lumax Hospital Scene  \n\nIssue: This scene felt poorly done with obvious plot armor. Lucas kicking a Demodog at full speed without getting bitten or falling? Too unreal. We also need a death in Vol 2.  \nChanges: \n\nInstead of Lucas kicking the demo, Vickie or a random makes a loud distracting noise either by accident or purpose. Demodogs turn, attack, and kill her right before the elevator doors close. Lucas sees it and screams “NO!” in horror. Then the scene continues like in the show.  \n(We know Demodogs chase loud noises, like when Mrs. Wheeler turned on the washing machine.)  \n\nWhy it works: More realistic, less plot armor with a tiny change. Vol 2 needed a death, and Vickie fits—she’s not a main character and adds nothing big later in the story. \n\n\n3. Upside Down’s Look  \n\nIssue: Upside Down changed a lot from S4. It should feel scarier and more mysterious, like before. \nChanges: \n\nMore darkness, fog, and rotten vibes—like real Upside Down from past seasons. More monsters is optional (there’s an explanation why they’re gone), but the look should match S1-4. Characters should show more fear going in.  \n\nWhy it works: A consistent, creepy Upside Down with darkness, fog, and rot feels right. It keeps the scary nostalgia and makes more fans (including me) happy.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pyljpv/st5_changes_i_would_make_in_vol_1_and_2/"
    },
    {
        "id": "1py6z7e",
        "author": "Yendis4750",
        "title": "The Watcher in 2026?",
        "content": "Did season two get renewed? I haven't heard anything about it and can't find any details. Any word on a release date? \n\n(Repeating)\nDid season two get renewed? I haven't heard anything about it and can't find any details. Any word on a release date? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1py6z7e/the_watcher_in_2026/"
    },
    {
        "id": "1pxk2z3",
        "author": "Neverendingstory1-",
        "title": "What’s a show you’re still mad that it got canceled?",
        "content": "I’ll start Black AF I liked the show. I thought it was funny and I related to the show. I grew up black and from the same area. It was good to see a show I kind of related too. I thought it was way better than blackish and was sad it got cancelled after one season.",
        "upvotes": 27,
        "comments": 285,
        "media": null,
        "permalink": "/r/netflix/comments/1pxk2z3/whats_a_show_youre_still_mad_that_it_got_canceled/"
    }
]