[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 15,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1petx4m",
        "author": "TheMirrorUS",
        "title": "BREAKING: Netflix acquires Warner Bros in $83 billion deal after tense bidding war",
        "content": "",
        "upvotes": 362,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1petx4m/breaking_netflix_acquires_warner_bros_in_83/"
    },
    {
        "id": "1pel907",
        "author": "somacula",
        "title": "Netflix Wins the Warner Bros. Discovery Bidding War, Enters Exclusive Deal Talks - The streaming giant hit the magic $30-a-share target and has an exclusive window to negotiate a final deal.",
        "content": "That's a wrap.",
        "upvotes": 107,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1pel907/netflix_wins_the_warner_bros_discovery_bidding/"
    },
    {
        "id": "1pem9ht",
        "author": "Obvious_Shoe7302",
        "title": "Netflix Wins Bidding War For Warner Bros. Discovery, Starts Exclusive Deal Talks",
        "content": "",
        "upvotes": 48,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1pem9ht/netflix_wins_bidding_war_for_warner_bros/"
    },
    {
        "id": "1pemlo8",
        "author": "Easy_Pen5356",
        "title": "Thoughts on Unbreakable Kimmy Schmidt?",
        "content": "I’m new to Netflix. I’m looking for a good show to watch! I’m looking for something lighthearted to watch while I pack since I’m moving and got recommended this show by my sister, but I’ve heard mixed reviews while I’ve been briefly looking..\n\nSo just wanted some firsthand opinions without spoilers! I just tried to watch Schitt’s Creek and found it too slow even though I heard it gets better. I’m gonna come back to it.\n\n(I’ve liked shows like the office and superstore in the past I tend to watch more lighthearted, shows where you don’t have to follow the plot with every detail)",
        "upvotes": 32,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1pemlo8/thoughts_on_unbreakable_kimmy_schmidt/"
    },
    {
        "id": "1peruai",
        "author": "Purple_Pay_1274",
        "title": "Is anyone else watching  Victoria? I find one thing super distracting?",
        "content": "Generally enjoying the show Victoria, but there is one thing that takes me out of the show every time I notice it. The (gorgeous and talented) actress who plays the queen is wearing the most god awful blue contacts. Everytime she is in the light she literally looks like a twilight vampire with these huge cheap looking contacts sitting unnaturally over her eyes.\n\nOf course I understand that the real queen had large blue eyes, but I hate the way these contacts look and it’s all I can look at in any scene where she’s in the light. No one else on the show has such strange contacts in… \n\nIt honestly looks like she is wearing gag gift/Halloween costume contact lenses sometimes! Has anyone else noticed this? I am only on season one, so do they get better over time? Or is this something I should just do better ignoring? It seems strange to me that a show that went to such lengths to have amazing costumes, sets, and historical accuracy would allow such a wildly weird element and expect people not to notice. ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1peruai/is_anyone_else_watching_victoria_i_find_one_thing/"
    },
    {
        "id": "1pecmsn",
        "author": "LollipopChainsawZz",
        "title": "Netflix is leading bidder for Warner Bros. Discovery: Sources",
        "content": "",
        "upvotes": 53,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1pecmsn/netflix_is_leading_bidder_for_warner_bros/"
    },
    {
        "id": "1pexbm3",
        "author": "businessinsider",
        "title": "Netflix investors don't seem to like its blockbuster deal with Warner Bros. Discovery",
        "content": "",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pexbm3/netflix_investors_dont_seem_to_like_its/"
    },
    {
        "id": "1pezcne",
        "author": "EvyPooPoo",
        "title": "Be better.",
        "content": "Just opened up my son’s kids profile to watch a few episodes of one of his shows. There is no excuse to why Red Dead Redemption is on the front page of my 5 year olds kids page for suggested mobile games….Be better Netflix.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pezcne/be_better/"
    },
    {
        "id": "1pez0mg",
        "author": "wheel_smith",
        "title": "explain to me , in simple way",
        "content": "for regular users what is going to happen now when hbo is going to be under netflix? i hope they dont remove tv shows from platform or something like that (sopranos etc)  ..... i know they are going to raise prices but other than that i dont have a clue..... :)",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pez0mg/explain_to_me_in_simple_way/"
    },
    {
        "id": "1peyeqq",
        "author": "DeadlyKindHero",
        "title": "So the FRIENDS and other WB shows are leaving the platform? Is this a plan for acquiring WB?",
        "content": "Is this a long term plan of Netflix? I read that it will take 12-18 month to finalise the deal and all. Will I have to wait for this much time? Prime video does have it but it sucks",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1peyeqq/so_the_friends_and_other_wb_shows_are_leaving_the/"
    },
    {
        "id": "1pey3xg",
        "author": "hard2resist",
        "title": "Netflix to acquire Warner Bros. film studios, HBO, HBO Max in massive deal",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pey3xg/netflix_to_acquire_warner_bros_film_studios_hbo/"
    },
    {
        "id": "1pey3cz",
        "author": "Puzzled-Perception88",
        "title": "Netflix canada",
        "content": "Why does Netflix consistently remove movies &amp; shows, just to bring them back months or a year later?\n\nNetflix has a tendency to bring us a new show, &amp; remove it the same year.. but bring it back the next year. Why?\n\nExample: “Mad Men” was on back in 2019, they moved it a year or two later moving it to i believe crave. Back in 2024 they brought it back, just to remove it again in august. This is not the only example i could offer, &amp; its genuinely a bother, making me less interested in keeping netflix for their lack of consistency. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pey3cz/netflix_canada/"
    },
    {
        "id": "1pexzp1",
        "author": "DesperateAuthor3493",
        "title": "Netflix not loading on windows app and chrome",
        "content": "its in white screen and is stuck loading. Netlix doesnt work on chrome, edge and the software on PC. I have turned off every extension, neflix only works on firefox fine elsewhere its just a white screen and not loading   \nBtw i just got netflix like a few minutes ago even restarted my pc ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pexzp1/netflix_not_loading_on_windows_app_and_chrome/"
    },
    {
        "id": "1perykl",
        "author": "Zestyclose-Piece-662",
        "title": "Sudden quality drop on Netflix app while watching something - Fixed",
        "content": "I had this issue yesterday, so thought I would share what the fix is. \n\nWas watching a movie yesterday and suddenly the quality dropped, not terribly, but noticeably. I was on wifi with 300+mbps, so not a streaming issue. Had the same issue watching the same movie today. \n\nTurns out the app had for some reason downloaded the movie, whether it was a misclick or what, the app downloaded a poorer quality of the movie and was playing that for me. Just uninstalled the movie and the quality resumed. \n\nJust posting this for anyone who searches a similar problem in future. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1perykl/sudden_quality_drop_on_netflix_app_while_watching/"
    },
    {
        "id": "1pew673",
        "author": "Level-Arugula4",
        "title": "That’s all folks: the WB story",
        "content": "Perhaps the title of the next Netflix documentary will be “That’s all folks: the WB story” it’s pretty interesting how this all has gone down. I for one would love a behind the scenes look at what went on with these deals",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pew673/thats_all_folks_the_wb_story/"
    },
    {
        "id": "1pe6pfe",
        "author": "StunningComment6064",
        "title": "Which movie (on netflix) is the saddest one you ever watch?",
        "content": "Hey guys,\ncould you recommend a Netflix movie that made you cry? Or a movie that left you with strong (sad) emotions after watching it? I’m currently in the mood for something like that.\nThank you!\n",
        "upvotes": 43,
        "comments": 117,
        "media": null,
        "permalink": "/r/netflix/comments/1pe6pfe/which_movie_on_netflix_is_the_saddest_one_you/"
    },
    {
        "id": "1pel9li",
        "author": "harpreetthind",
        "title": "Movie recommendations on Netflix",
        "content": "Just got done watching midnight mass what else does everybody recommend looking for some great shows that that are in this category but open to all suggestions thanks guys",
        "upvotes": 4,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1pel9li/movie_recommendations_on_netflix/"
    },
    {
        "id": "1pdnga8",
        "author": "GuineaPKilledMe",
        "title": "Sean Combs: The Reckoning - The jurors that agreed to sit down for documentary are disgusting.",
        "content": "If every juror in Diddy's case truly felt the same way as those two they interviewed for the doc, no wonder Diddy only got away with 50 months.\n\nBoth of them seemed extremely biased. The male juror basically put all the blame on Cassie and showed absolutely no sympathy for her. He immediately gave me the creeps. Seems like he really didn't value women at all.\n\nThe woman was even worse. She couldn't even hide her delusional love for Diddy. You can tell she was jumping with joy every time how she explained how Diddy would make eye contact with the jurors. She's so delusional I wouldn't doubt if she thought he was making eye contact with only her.\n\nThose two were absolutely vile in their reasoning for only counting him with two charges.\n\nEdit: Sorry about the grammar error in the title. It was suppose to say \\*The documentary",
        "upvotes": 608,
        "comments": 175,
        "media": null,
        "permalink": "/r/netflix/comments/1pdnga8/sean_combs_the_reckoning_the_jurors_that_agreed/"
    },
    {
        "id": "1pe4fit",
        "author": "GEMHidden",
        "title": "Director recognition for Sean Combs: The Reckoning",
        "content": "Alexandria Stapleton use of arrest photos, live footage, and decades of escalating violence paints the picture of a monster built by silence and complicity. The reckoning isn’t just for Diddy but for everyone who enabled him! \n\nI’m sure 50 cent offered her a pretty penny for the series, as Diddy likely passed on it either because he believed he would receive a not guilty verdict or did not have the funds to pay for the footage. What do you all think? \n",
        "upvotes": 28,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pe4fit/director_recognition_for_sean_combs_the_reckoning/"
    },
    {
        "id": "1peqjsj",
        "author": "Subhash_Boi",
        "title": "So I was watching HDR and Dolby vision right with premium plan that includes it all ?",
        "content": "My phone poco x7 pro supports everything and even in playback certification it's showing the capabilities but I'm not noticing anything big , it's normal 1080p content. Am I Missing something?? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1peqjsj/so_i_was_watching_hdr_and_dolby_vision_right_with/"
    },
    {
        "id": "1pe7279",
        "author": "hevy_smoker",
        "title": "The UK top 10",
        "content": "Just looking at the top ten films in the UK and it seems no-one in the country has any desire to watch anything that isn't total and utter garbage. Same with the top ten series, utter utter garbage.",
        "upvotes": 12,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pe7279/the_uk_top_10/"
    },
    {
        "id": "1pdkhjy",
        "author": "Wayman52",
        "title": "Netflix is removing Lost, Supernatural and The 100 all in one month.",
        "content": "This is ridiculous, there's so much slop on this site now, maybe 1 in 10 shows (and that's being generous) is actually watchable, and they continually get rid of beloved movies and shows. They cancel good Netflix originals or just quietly never giving them a second season, why does anyone keep their subscription? ",
        "upvotes": 281,
        "comments": 175,
        "media": null,
        "permalink": "/r/netflix/comments/1pdkhjy/netflix_is_removing_lost_supernatural_and_the_100/"
    },
    {
        "id": "1petkv1",
        "author": "Jumpy-Classroom3655",
        "title": "Netflix’s Upcoming Bosch &amp; Reacher Replacement Beats Both Detective Shows In 1 Undeniable Way",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1petkv1/netflixs_upcoming_bosch_reacher_replacement_beats/"
    },
    {
        "id": "1penoe2",
        "author": "catsaway9",
        "title": "How can I download a movie in the windows app?",
        "content": "I download content on my phone all the time, but I can't figure out how to download on my laptop. \n\nI installed the app but there's no \"available for download\" section like there is on my phone app. \n\nWhat am I missing? \n\nI'm going to be without Internet tomorrow and I'd really like to have a movie or two available.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1penoe2/how_can_i_download_a_movie_in_the_windows_app/"
    },
    {
        "id": "1pel9tp",
        "author": "Fit-Object5402",
        "title": "Can’t think of show or movie name",
        "content": "Hi - I only can remember bits and pieces but it’s driving me nuts. It’s a student. I think at nyu and someone dies and he has to hide at his wealthy friends apartment and the friend pays for his flight to the funeral and then his friends come to support him at the funeral and he doesn’t show up and there’s like an explosion or shooting or a tornado during the funeral. And then after at the bar there’s a fight and he hooks up with his dead brothers ex gf from hs. And he blames himself for his brothers death. And then he stops hooking up w her and goes back to school to hang w his friends and live in the present. Does anyone know what I’m talking about? ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pel9tp/cant_think_of_show_or_movie_name/"
    },
    {
        "id": "1peuepr",
        "author": "owjim",
        "title": "[US] why is Wolf of Wall St. censored ?",
        "content": "Watching Wolf of Wall St. and everything below the waist is blurred out. Has this always been the case ?  \n\nIt’s not that I want to see nudity I just don’t like Netflix deciding what I am allowed to see. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1peuepr/us_why_is_wolf_of_wall_st_censored/"
    },
    {
        "id": "1pegj3k",
        "author": "TheStickySpot",
        "title": "I just got Netflix for my first time so I can watch Vol 2 of ST with everyone else are there any show or movie recommendations as I have technically already seen Vol 1 but I’m rewatching it.",
        "content": "The only other platforms I have had were I believe Paramount and HBO Max. I never really jumped on this platform as I thought that ai would only use it for one thing but today I decided to take a gamble on it and now I am a bit overwhelmed.",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1pegj3k/i_just_got_netflix_for_my_first_time_so_i_can/"
    },
    {
        "id": "1pedddo",
        "author": "ScorpioBear1996",
        "title": "Help",
        "content": "I need help guys. I can't log in on my computer without it saying 'technical difficulties' but I can log in on my phone website and app. I dunno what's going because it doesn't make sense. I even got downloaded the app on my laptop but it's still not working",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pedddo/help/"
    }
]