[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 44,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qf6w3z",
        "author": "Remarkable-Gate-9944",
        "title": "Santa Clarita Diet deserved better. WE deserve better.",
        "content": "I just found out from Reddit that Santa Clarita Diet ended.\n\nNot ‘ended years ago, we all processed it’ ended.\n\nEnded as in I was living my life under the delusion that Sheila Hammond was still somewhere out there, eating bad people and making suburban chaos look fun.\n\nNetflix said - zombies, but make it domestic.\n\nThen said - cool concept, great cast, cliffhanger? Yeah, no. Buhbye. Nailed the coffin shut.\n\nWhat makes it worse is that this show was early to a very specific vibe that’s everywhere now. Dark but cozy, absurd but oddly wholesome. Violent things happening while people argue about mundane nonsense. Basically existential dread with popcorn.\n\nShows like Ghosts are carrying that torch. Dead people. Ridiculous problems. Jokes that are dumb, sharp and self-aware at the same time. The kind of humor that doesn’t try too hard but still sneaks up and punches you in the face. Politely.\n\nI’m convinced this genre works because most of us are tired, mildly unhinged and coping through irony. We don’t want prestige misery. We want chaos that knows it’s chaos. We want death jokes that somehow feel comforting.\n\nAnyway, RIP Santa Clarita Diet. Gone too soon.\n\nTaken from us mid-bite.\n\nNetflix, I forgive a lot, but I will never forgive you for this one. If ever I get bitten, you know who I’m coming for",
        "upvotes": 410,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1qf6w3z/santa_clarita_diet_deserved_better_we_deserve/"
    },
    {
        "id": "1qf8xbk",
        "author": "BradyPhoenix",
        "title": "The Rip was a pleasant surprise",
        "content": "I’m not normally into heist/cop movies but I gave this one a shot due to the stacked cast. I had a lot of fun with it. \n\n🛑Plot Spoilers Ahead:🛑\n\nI assumed either Affleck or Damon was gonna be the mole and the drama of the film was gonna be them facing off and it seemed to be going that way, but I really liked that it ended with them teaming up and utilizing their bromance.\n\nI think all the other actors did a great job too!\n\n  \nMy only real complaint was they had these 3 interesting ladies and didn’t utilize them at all in the climax. It was like ”Alright you girls just sit here while we go have our Man Action Finale™️ now” lol\n\n  \nBut overall I really did like it! 👍",
        "upvotes": 25,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qf8xbk/the_rip_was_a_pleasant_surprise/"
    },
    {
        "id": "1qemamp",
        "author": "Reddit_Sucks_1401",
        "title": "The Live-Action Zelda Movie Is Coming To Netflix Following Its Theatrical And Home Entertainment Release Periods",
        "content": "",
        "upvotes": 278,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1qemamp/the_liveaction_zelda_movie_is_coming_to_netflix/"
    },
    {
        "id": "1qez4kr",
        "author": "Texanlivinglife",
        "title": "The Rip",
        "content": "Oh my goodness. Damon and Affleck have done it again. Best movie!!! I mean full on suspense throughout. I hope they continue making great movies. The ending though wow!!! ",
        "upvotes": 55,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1qez4kr/the_rip/"
    },
    {
        "id": "1qf2bj8",
        "author": "Creative-Pudding-392",
        "title": "His &amp; Hers is Amazing!",
        "content": "I read this one post on Reddit about how bad the show is and or how it's comical and doesn't compare to the book or some stuff like that. Anyway, the show is amazing. The ending is amazing. The twists are amazing. I am in complete shock by the ending so much so that I had to rewind it, just to watch it again. You had people talking about the actors and their acting as if the cast isn't filled with seasoned performers. Come on! Some people are complaining for no reason at all. We need more shows like this that has good unsuspecting twists. ",
        "upvotes": 24,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1qf2bj8/his_hers_is_amazing/"
    },
    {
        "id": "1qf4de7",
        "author": "JemJemIsHerName",
        "title": "The Rip (just about the dog)",
        "content": "No plot/story spoilers here! When I saw there was a dog in the movie I was worried about the dog’s outcome. I love how much the movie addresses this and tells us how ok the dog is and also how much other people in the movie care about how the dog is doing. Dog is ok! ",
        "upvotes": 15,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qf4de7/the_rip_just_about_the_dog/"
    },
    {
        "id": "1qf5bel",
        "author": "AccomplishedPut5175",
        "title": "The Rip",
        "content": "Just finished watching and… Ben is brilliant, Matt is always an A+, they never disappoint when it comes to acting, always A+. The film, is it good? Yes. Could it have been better in my opinion? Yes. Definitely my recommendation to watch, it will hold your attention, no doubt about that. Honestly, 8 out of 10. This is just my opinion, so… All the best☘️",
        "upvotes": 14,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qf5bel/the_rip/"
    },
    {
        "id": "1qf3ip6",
        "author": "Own-Resource4156",
        "title": "Movie about ex wife trying to warn new fiance",
        "content": "I was working, not paying much attention but a trailer popped up on netflix about an ex wife going to the new fiances home. She said she just needed 5 minutes of her time. The fiance put her hand on the doorframe, showing off her painted nails. The ex wife looked shocked and said \"he lets you paint your nails?\" And that stood out to me. I was on the phone with a client and several trailers past and now its not on mh account anymore. I tried google, chatgpt, phone-a-friend and im starting to feel crazy. In the trailer it was at night in what looked like a suburb. Both women had american accents, i believe the ex wife was brunette and the fiance was a redhead. Thanks in advance!",
        "upvotes": 9,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qf3ip6/movie_about_ex_wife_trying_to_warn_new_fiance/"
    },
    {
        "id": "1qer9e2",
        "author": "Icy-Calligrapher1188",
        "title": "His&amp;Hers... a few things made no sense. Anyone care to explain?",
        "content": "The series was okay. Enough for me to binge it in a day and keep wanting to play the next episode. But dialogue and acting was... meh. \n\nOk, things that didn't make sense and I'm unsure if it was just a weird way to think one way and throw us off track? If so... kind of sloppily done. \n\n1) the whole intro. Anna hurrying to clean up her apartment and her tooth being infected or whatever? \n\n2) what was Lexy and Richard's end game?? Why did they have all of that stuff at the lake house? \n\n3) So did Lexy become a news anchor just to get back at Anna or to do what? (See 2) \n\n4) I don't even understand the whole Clyde and Helen side quest. \n\n5) Why did Zoe say to Jack that Anna isn't who he thinks she is. Guessing to side-blame because shit was about to go down?? \n\nI'm sure there's others I am unsure about but that's in my brain rn. ",
        "upvotes": 25,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1qer9e2/hishers_a_few_things_made_no_sense_anyone_care_to/"
    },
    {
        "id": "1qfd8qh",
        "author": "andrestrujillopulido",
        "title": "El Tigre Blanco (2021)",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qfd8qh/el_tigre_blanco_2021/"
    },
    {
        "id": "1qf2brw",
        "author": "Naive-Hat-2403",
        "title": "Double feature of hilarity",
        "content": "Just watched Suitcase Killer and Amish Stud back to back.  So bad, they were hilarious.  Seemed like the same actors were in both.  Thanks to Netflix for making these available to us. ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qf2brw/double_feature_of_hilarity/"
    },
    {
        "id": "1qekauv",
        "author": "Thissuxxors",
        "title": "What a beautiful show MO is...",
        "content": "As a Palestinian, I was upset with Netflix that MO was only 2 seasons. It seems to obviously be rushed, so I don't think it was the original idea to only have it as 2 seasons. Clearly there were some ugly people that didn't want the show to continue and put pressure on Netflix.\n\nNow I could say that Netflix are cowards if that is indeed the case as I assume, however, I don't think that. If anything, Thank you Netflix for having the guts to allow this show to exist. To produce it and to put it on your platform. It truly is a hilarious, wonderful, heartfelt show that shows the struggles of Palestinians. I would say it is a love letter to Palestinians and our beautiful culture.\n\nThe actors were absolutely wonderful, and while some of it was just hard to watch, particularly MOs struggles. The show left me feeling good and hopeful.\n\nParticularly I loved the Thanksgiving get together at the farm. It was just beautiful to see all these people who are different come together because it felt they were all family.\n\nSorry if my post sounds corny, but I really did love this show so much.\n\nAnyway, for those who haven't seen it, I highly recommend it. It's a brilliant, clever and outrageously funny show.\n\nThank you Netflix.",
        "upvotes": 24,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qekauv/what_a_beautiful_show_mo_is/"
    },
    {
        "id": "1qf1v94",
        "author": "chuckythecrow",
        "title": "Unlocked: A Jail Experiment",
        "content": "I just finished watching Season 2 of Unlocked: A Jail Experiment on Netflix, and I found it genuinely fascinating, but also far more disturbing than I expected. Compared to Season 1, this season felt much darker, more intense, and emotionally charged. I’m curious how others on this sub experienced that shift.\n\nOne of the biggest things I noticed was how quickly things escalated in Season 2. The power dynamics seemed to form faster and more aggressively than in Season 1, where there was at least some attempt at cooperation early on. Do you think this was due to differences in the group of inmates, the environment, or the way the experiment was structured by the producers?\n\nAnother major difference for me was the overall tone. Season 1 felt more like a social experiment focused on rehabilitation and self-governance, while Season 2 often felt closer to a psychological pressure cooker. Some moments made me question the ethics of continuing the experiment under those conditions. Did anyone else feel that the line between observation and exploitation was crossed more often this season?\n\nI’m also wondering how much the presence of cameras influenced behavior in Season 2 compared to Season 1. It seemed like some participants were more aware of how they were being portrayed.\n\nFinally, do you think there should be a Season 3? If so, what would you want to see done differently, or has the experiment already shown everything it needed to prove?\n\nCurious to hear everyone’s thoughts",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qf1v94/unlocked_a_jail_experiment/"
    },
    {
        "id": "1qenxr1",
        "author": "Left_Actuary_7890",
        "title": "His &amp; Hers (Netflix/Book) – Genuine questions about character choices",
        "content": "Spoilers for His &amp; Hers (Netflix) and the novel\n\nFirst, I want to be very clear up front: this post is NOT victim-blaming, minimizing assault, or being insensitive. The show covers extremely heavy subject matter, and I’m asking these questions in good faith to better understand the characters, their psychology, and the story’s themes.\n\nI just finished His &amp; Hers on Netflix and was genuinely caught off guard by several of the later revelations. I’m still processing some of the character choices and was hoping people who’ve watched the show and/or read the book could help expand on them.\n\nMy main questions:\n\n1. Why did Anna get involved with Jack at all, knowing he was Zoe’s brother?\n\nAnna’s trauma stems from what happened when she was 16; when her friends Zoe, Rachel, and Helen orchestrated the assault, sold photos, and then watched, laughed, and mocked her while it happened.\n\nKnowing this, Anna choosing to be with Jack (Zoe’s brother) was odd?\n\nWas this relationship meant to show:\n\n\t•\ttrauma bonding or unresolved attachment?\n\n\t•\ta way of reclaiming control over her past?\n\n\t•\tself-punishment or denial?\n\n\t•\tor is there more internal context in the book that the show didn’t fully explore?\n\n2. Why is Lexy (Catherine) so fixated on Anna years later?\n\nCatherine/Lexy was also a victim, but she ran away and left Anna behind in the woods. Yet as adults, Lexy seems to direct an intense amount of blame, resentment, and obsession toward Anna.\n\nIs this survivor’s guilt turning into projection? Or does the novel give more insight into her mindset and how she rationalizes this?\n\n3. Did anyone else expect the reveal to be “less extreme” at first?\n\nBefore the woods scene, I honestly assumed the trauma might be centered on bullying or humiliation..not the calculated setup, photos, and assault itself. That escalation completely blindsided me.\n\n4. And bluntly… how are we meant to interpret Lexy getting her own sister killed? 💀\n\nI understand trauma can seriously distort judgment, but this was downright psychotic. Is Lexy meant to be seen as someone spiraling, or as a cautionary example of unresolved trauma turning destructive?\n\n5. For book readers: what did the show change or leave out?\n\nWere there:\n\n\t•\tinternal monologues or motivations cut from the adaptation?\n\n\t•\tchanges to character dynamics (especially Anna, Jack, Alice or Lexy)?\n\n\t•\tplotlines or reveals that were simplified or altered?\n\nI’d really appreciate if novel readers could expand on whether the book gives clearer psychological grounding for these choices, or if the ambiguity is intentional.\n\nThanks in advance.\n\nI’m genuinely interested in thoughtful discussion from both show-only viewers and readers.",
        "upvotes": 15,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qenxr1/his_hers_netflixbook_genuine_questions_about/"
    },
    {
        "id": "1qeyt0z",
        "author": "StriderDB",
        "title": "Tires Season 3?? Will this be happening?",
        "content": "I just binge watched the first two seasons. I can’t really find any info if season 3 is happening or even a ETA?\n\nIt remind me a lot of the office and I love this show. \n\nDoes anyone have any insight. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qeyt0z/tires_season_3_will_this_be_happening/"
    },
    {
        "id": "1qeset4",
        "author": "atomiccaffa",
        "title": "The psychology of \"Bundle\": Why Agatha Christie gave her smartest female lead such a silly nickname in Seven Dials",
        "content": "\"Bundle\" is not just 1920s slang given to Lady Eileen Brent for her chaotic character. Agatha Christie had a very specific psychological reason for giving her most competent women names like \"Bundle,\" \"Egg,\" or \"Bunch.\"\n\n  \nHere is an investigation about the \"Bright Young Things\" archetype, the historical context of the name, and why being called something \"infantile\" allowed these women to act as the perfect undercover investigators in a male-dominated aristocracy.",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qeset4/the_psychology_of_bundle_why_agatha_christie_gave/"
    },
    {
        "id": "1qemp7p",
        "author": "nikhiljr12",
        "title": "Watched the movie THE RIP",
        "content": "Only got to know about this movie 2 days ago and was waiting to watch it. Atmosphere was nice, beginning u doubt all of them and the way they clear the air about the bad guys was also great.\nThoroughly enjoyed watching Ben Affleck again!",
        "upvotes": 16,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1qemp7p/watched_the_movie_the_rip/"
    },
    {
        "id": "1qdvcd0",
        "author": "Mucek121",
        "title": "What's the Best Documentary You've Ever Seen? Need Recommendations!",
        "content": "Looking for must-watch documentary recommendations! Whether it's mind-blowing, inspiring, or eye-opening—drop your favorites!\n\n  \nThank you for answer",
        "upvotes": 630,
        "comments": 1372,
        "media": null,
        "permalink": "/r/netflix/comments/1qdvcd0/whats_the_best_documentary_youve_ever_seen_need/"
    },
    {
        "id": "1qfawgx",
        "author": "ForkWithSoup",
        "title": "Why are there Amazon logos on all of the show previews?",
        "content": "Didn’t notice this before- so maybe I’m late to the game? But I also can’t find anything as to why this is happening. When I hover over a show and preview, the amazing logo shows while playing the audio of the preview clip, no video. Anyone else seeing this? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qfawgx/why_are_there_amazon_logos_on_all_of_the_show/"
    },
    {
        "id": "1qf6hvn",
        "author": "Fluffy_Tie5709",
        "title": "A good girl's guide to murder ending",
        "content": "this series ending question\n\nI just finished watching this series. But after watching it, I didn't understand the ending.\n\n1. What does Jason have to do with this murder? Didn't Andy end up being killed by Elliot and her sister?\n\n\n2. Who killed Emma's puppy?\n\n\n3. Will S2 be the main storyline to reveal Max's sins?\n\nI'd appreciate it if you could answer😘🫡",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qf6hvn/a_good_girls_guide_to_murder_ending/"
    },
    {
        "id": "1qen51s",
        "author": "insaneruffles",
        "title": "Netflix Error tvq-st-144",
        "content": "Was watching Netflix when this error popped up, and I cant seem to fix it.\n\nIm on an LG C4.\n\nAll of my other apps and streaming services work.\n\nI restarted the TV.\n\nThe Netflix network check shows all connections as green.\n\nIve tried closing and reopening the app several times.\n\nanyone have any other solutions? thanks!\n\nEDIT: Everyone who is having this issue, uninstalling and re installing the app worked for me.",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qen51s/netflix_error_tvqst144/"
    },
    {
        "id": "1qf5r8g",
        "author": "ROGUE_butterfly2024",
        "title": "Bridgeton",
        "content": "Well I guess Ill rewatch lol. All these adds of past seasons. Simon and Daphne 🔥🔥 were my favorite. Think they had the most depth and passion. Anyone else? Fav season? Anyone read the books, are they better? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qf5r8g/bridgeton/"
    },
    {
        "id": "1qeiru5",
        "author": "Flapalms239",
        "title": "The Rip",
        "content": "I have the cheapest ad plan. I watched this movie this morning and had zero ads!  I’m not complaining but did anyone else notice this as well? \n\nAs for the film itself I enjoyed it for the most part. I don’t see myself watching it a second time though. ",
        "upvotes": 12,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qeiru5/the_rip/"
    },
    {
        "id": "1qf20js",
        "author": "haihukkuhaihai",
        "title": "Unpopular Opinion: The Rip is a bad movie",
        "content": "Premise and starcast looked awesome and the initial half an hour was interesting. But it got boring so fast and the eventual reveal didn't make up for it. Climax was so average too. The only good part was Ben Affleck. 4/10 . Glad if you loved it. I didn't. ",
        "upvotes": 0,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1qf20js/unpopular_opinion_the_rip_is_a_bad_movie/"
    },
    {
        "id": "1qeshfe",
        "author": "Nuo_Vibro",
        "title": "The Rip - Subtitles",
        "content": "All the subtitles are doubled, making some of them unreadable. \n\nBig movie of the weekend and they drop the ball like this. Shameful behaviour.\n\nOtherwise a solid wee thriller.",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qeshfe/the_rip_subtitles/"
    },
    {
        "id": "1qe3wpp",
        "author": "Dramatic_Stretch2760",
        "title": "People We Meet On Vacation",
        "content": "Let me preface this by saying: I love rom-coms. Like, I will defend the genre every time. That said… this movie was not it.\n\nI haven’t read the book, so don’t come for me- I’m judging purely on the film. From the very beginning, both main characters were insufferable. Poppy leaned too hard into the chaotic, ultra–Type B personality, while Alex was painfully rigid and Type A. We’re told they’re best friends, but the movie never convincingly shows why. I genuinely couldn’t see how they’d tolerate each other for more than 20 minutes, let alone build a long-term friendship.\n\nThe chemistry was nonexistent. On top of that, the emotional cheating while they were both in relationships was uncomfortable - are we just supposed to normalize that now?\n\nThe pacing was off, and the story tried to cram in every rom-com trope imaginable, which made everything feel rushed and forced instead of charming or organic. I kept waiting for it to click… and it never did.\n\nDisappointing, especially for a genre I usually adore.",
        "upvotes": 86,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1qe3wpp/people_we_meet_on_vacation/"
    },
    {
        "id": "1qf0i08",
        "author": "TheWickedCoffee2526",
        "title": "Can't login",
        "content": "When I try to login to Netflix I get an error message that says \"Something went wrong. Please try again in a few minutes.\" Does anyone else encounter this message?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qf0i08/cant_login/"
    },
    {
        "id": "1qeaoxr",
        "author": "RiseoftheBandit",
        "title": "His &amp; Hers",
        "content": "I couldn’t come to Reddit fast enough . I legit just binged this show on Netflix because of the actors . I first played it for background noise because I needed a new show. But let me tell you I was hooked . All the plot twist was crazy. I’m glad it was short and straight to the point. If you need a show while you are cleaning or playing a game this is it !  ",
        "upvotes": 25,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1qeaoxr/his_hers/"
    }
]