[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 33,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kpgmhv",
        "author": "Equivalent_Phrase_25",
        "title": "New volume of love death + robots is trash",
        "content": "The first 3 volumes I really loved but the new one is just significantly worse, shorter episodes (per average to the other volumes) and only a couple of them in my opinion are good. Like (can’t stop, spider rose  , how zeke got religion). Idk maybe it seems to rushed because u can watch all of it in like a hour and I felt like the episodes in past volumes were better. Like the rat episode where he hires robots to hunt the rats. That episode was fire. ",
        "upvotes": 45,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1kpgmhv/new_volume_of_love_death_robots_is_trash/"
    },
    {
        "id": "1kou98z",
        "author": "itsLemurfan",
        "title": "A Deadly American Marriage",
        "content": "A Deadly American Marriage\n\nI don’t know if I’m missing something… but it seems like Molly and her dad are absolutely guilty ? The only basis of an argument her lawyer can make for the retrial is the fact that Jason had mentioned to a counselor that he was more angry, and the secret voice recordings. But I feel like 1) if someone who doesn’t even have guardianship of your own kids is actively trying to separate you from your kids, you’re going to be very stressed ? Also, the secret voice recordings don’t even show any abuse IMO ? They are arguing, and they both raise their voices, but Jason does NOT seem as aggressive as they are trying to paint him as. And the fact that they called it a threat that he was threatening Molly about taking the kids away… THEY ARNET EVEN HER KIDS ? Legally or biologically !! She never adopted them !! The other argument was regarding Jason’s first wife. But professionals from Ireland who worked with the autopsy said that it still was not strangulation that caused Mags death. It could’ve been a different medical condition that appeared to be an asthma attack at the time, but that does not warrant that Jason strangled her. Am I on the wrong side? Do people seriously think Mollys innocent ?",
        "upvotes": 520,
        "comments": 340,
        "media": null,
        "permalink": "/r/netflix/comments/1kou98z/a_deadly_american_marriage/"
    },
    {
        "id": "1kpfcfe",
        "author": "19ghost89",
        "title": "What are the 10 most important Netflix original TV shows in the history of the platform?",
        "content": "I'm not talking about \"most watched.\" I can look that up easily enough, but it doesn't really answer the question. For example, Orange is the New Black is no longer in the Netflix top 10, but it would be hard to argue, in my opinion, that the show which basically launched Netflix originals and helped start the binging trend doesn't belong on such a list.\n\nI'm also not asking for your favorites, because that's very subjective and I could get hundreds of different answers.\n\nI want to know, if you had to make a \"history of Netflix\" and pick the 10 most important shows to highlight - the ones that were biggest and most impact full at the time of their release, with perhaps some extra points for staying relevant if you want - what would those shows be?",
        "upvotes": 12,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1kpfcfe/what_are_the_10_most_important_netflix_original/"
    },
    {
        "id": "1kpmcsr",
        "author": "SohamPlayz",
        "title": "How to watch series and movies in surround sound if you're on PC and your AVR or amplifier does not support Dolby Atmos",
        "content": "This is a solution to a problem I've had for ages and I just want to put it out here in case other people are also stuck on this problem.  \nMy AVR (Harman Kardon AVR 355) doesn't support Dolby Atmos for Home Theater. Netflix says for you to set the spatial sound effect to Dolby Atmos but when I do it, it refuses to play any sound, and even resets it's original configuration from 7.1 to 2.1.\n\n  \nHere's how I fixed it:\n\n1. Go to Windows Sound Settings and set the spatial audio to Dolby Atmos (make sure Netflix is not open during this) (It is completely normal if you don't hear anything from your speakers, we'll fix that later)\n2. Open Netflix. Netflix detects that the sound settings \"supports\" Dolby Atmos since the spatial audio is set to Dolby Atmos and makes all the 5.1 channel sounds available.\n3. Go to Windows Sound Settings, scroll down to \"More Sound Settings\" and press that. (This is from a Windows 11 perspective. On Windows 10, it is the same as going to the Sound setting in Control Panel)\n4. Right click your AVR or amplifier in the Playback tab and press \"Configure Speakers\". Set it back to your current speaker configuration (5.1 or 7.1 etc). Make sure to do this ***TWICE*** as Dolby Atmos disables at the first time, making the configuration back to 2.1.\n\nAfter that, you should be able to watch supported movies and series in 5.1 without needing Dolby Atmos!\n\nHope this helps someone!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kpmcsr/how_to_watch_series_and_movies_in_surround_sound/"
    },
    {
        "id": "1kpfcs6",
        "author": "beautifulshilo",
        "title": "Netflix's A Deadly American Marriage: Jason Corbett &amp; Molly Martens",
        "content": "Bumped into the A Deadly American Marriage last night and was left intrigued. Especially because Molly and her dad are free. How??? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kpfcs6/netflixs_a_deadly_american_marriage_jason_corbett/"
    },
    {
        "id": "1koyb3w",
        "author": "kitabenita20",
        "title": "Liver king",
        "content": "Hey everyone, starting a new thread because the current one is under joe Rogan and that doesn’t make a lot of sense. For anyone who watched this doc and thought that something didn’t feel right about these kids and their situation-you’re not alone. Here’s what I saw-children who are in, essentially, an isolated cult where they have to think like their parents and abide by some insane rules or they’ll be rejected. They have to eat raw liver, raw testicles, raw innards, and apparently 15 raw eggs a day. Didn’t seem like there’s any additional food in the house or in their diet. Sleeping on wood slats, not allowed to wear proper clothing or shoes. When they were pretending to kill a cow (because it had already been shot) the men who weren’t part of the family and out there were in LAYERS-coats and warm clothing while the children were barefoot and in shorts and T shirts. The mom admitted that the son had a compound fracture in one of his legs that didn’t get medical attention for at least 24 hours because “pain won’t kill you”. She framed it\nLike he didn’t ask but that’s a lie. That child was either too afraid to ask for help or she told him “pain won’t kill you”. The whole thing smacks of child abuse-physical and psychological. Clearly CPS has already been involved because he brought it up but then lied and said they got there, saw the kids and said “what am I doing here? These kids are fine and left two minutes later”. That’s what a pathological liar would say-he’s making up stories. Kind of like the rest of his entire life-his wife might be even worse as an enabler and someone who supports the lies and admits that she’d never come clean on the lies. Those children seem extremely isolated and forced to live in this insane reality their mentally ill but extremely rich father is enforcing. I called CPS and filed a report. I\nEncourage anyone who shares these concerns to do the same. Yes, it’s wild to file a report based on a Netflix doc but it wouldn’t be the first time we’ve seen child abuse from content creators-far from it. These people think they’re gods and they’re sick. And ultimately the children suffer. Yes, I realize it also could be totally fake. But let CPS determine that. 1-800-252-5400 here’s their phone number, apparently his home address is 13876 longwood drive, Willis, Texas. This is public information already available online. \n",
        "upvotes": 48,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1koyb3w/liver_king/"
    },
    {
        "id": "1kp8kti",
        "author": "Lavep",
        "title": "Leaving soon titles",
        "content": "It absolutely boggles my mind that after so many years Netflix didn’t implement way for customers to easily search for titles that leave service soon. \nWhat’s the problem to add  option to search for all movies and tv shows that will leave service in next 30 days? Just add another tag. We can search for dramas, fantasy, sci-fi, wwe. Add another to the list ‘leaving soon’. As a matter of fact this tag is already there, we just cant search it\n\nI know there are many sites that publish this info but i don’t get it why i need to use 3rd party resource and then search each title one by one instead of seeing everything in one place and view it from the list directly\n\nAnybody else annoyed by this?",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1kp8kti/leaving_soon_titles/"
    },
    {
        "id": "1kp00pj",
        "author": "Ola_maluhia",
        "title": "The Quilters",
        "content": "As a psychiatric nurse, I’ve worked in a few federal detention centers throughout my 17 year career. This was one of the most touching short films Ive ever watched. I highly recommend this 33 minute documentary on inmates who work in a max security prison and make quilts for foster kids. ",
        "upvotes": 28,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kp00pj/the_quilters/"
    },
    {
        "id": "1kpifx8",
        "author": "ForsakenVanilla123",
        "title": "Two Accounts in Two Different Countries",
        "content": "I'm thinking of buying the 2 household Netflix subscription in India, one for me and one for my sister who is abroad in Dubai. \n\nI wanted to know if this is possible or not? I've heard peolpe say that it no longer is. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kpifx8/two_accounts_in_two_different_countries/"
    },
    {
        "id": "1kpi8sb",
        "author": "22fbz",
        "title": "Watched episodes not marked",
        "content": "I have Netflix since 2018 but haven’t watched any show this year yet. I just logged in as I wanted to see how far I‘ve watched Black Mirror. And through this I‘ve found out that none of the shows I‘ve watched in the last 7 years is longer marked as watched.\n\nDoes anyone had this problem before and a solution how to fix it?\n\nI can see the shows I‘ve watched in the activity log. So the information is still there somewhere. And it does not happen in the profile my brother uses.\n\nI also logged out, deleted cache, tried another browser to force a re-sync, but did not help.\n\nSome advice would be appreciated, thank you 🙏🏼",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kpi8sb/watched_episodes_not_marked/"
    },
    {
        "id": "1kpi3md",
        "author": "New-Entrepreneur4132",
        "title": "Regional content",
        "content": "I traveled to Ireland and my Netflix account loaded completely different content and great shows that I started but never finished. Got back to the US and it’s back to US content. Is there a way to get access to shows from the Irish and UK region? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kpi3md/regional_content/"
    },
    {
        "id": "1kpclcb",
        "author": "Robemilak",
        "title": "‘Arcane: League of Legends’ Team Unpacks Epic Final Season and Teases More to Caitlyn and Vi’s Story",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kpclcb/arcane_league_of_legends_team_unpacks_epic_final/"
    },
    {
        "id": "1kpnlfv",
        "author": "Rain_Lemon",
        "title": "Season 7 of Young Sheldon hasn’t shown up on my Netflix? Any reasons why?",
        "content": "I’m in the UK and season 7 was supposed to have been added on April 15th. But, it just hasn’t appeared? Is it like this for any other UK users or are there any reasons why it isn’t showing up?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kpnlfv/season_7_of_young_sheldon_hasnt_shown_up_on_my/"
    },
    {
        "id": "1kpgi5i",
        "author": "Key-Occasion-629",
        "title": "Can't split screen",
        "content": "I can't split screen netflix, what i'm referring to is being able to put the show on half of my phone like you can with youtube, peacock, twitch etc. Both of my friends can do it but I can't (both also have iphones). i've tried having it playing while trying rather then paused and i don't have an update, im on apple iphone 14 plus if that means anything.\n\nany help is appreciated ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kpgi5i/cant_split_screen/"
    },
    {
        "id": "1kp5dc3",
        "author": "onionnette",
        "title": "Damsel ending is the GOT ending I wanted.",
        "content": "Not that anything before the ending of Damsel is in anyway relevant to this line of thinking. But yeah, my brain started switching MBB out for Dany, and by the time we got to the end, it was Dany &gt;! burning King's Landing to the ground and then sailing across the Narrow Sea to go \"Home.\" !&lt;",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1kp5dc3/damsel_ending_is_the_got_ending_i_wanted/"
    },
    {
        "id": "1kpmj96",
        "author": "adogg281",
        "title": "My thoughts on Live sports on Netflix",
        "content": "I'm having some concerns about Netflix showing live sports. I know that they have WWE Raw and NFL Christmas games. But what about bringing more live sports events like MMA or something? I can hardly imagine that they can show Golf and racing events. If they can show those, cable TV won't last as long as I expected.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kpmj96/my_thoughts_on_live_sports_on_netflix/"
    },
    {
        "id": "1kpnlik",
        "author": "Rain_Lemon",
        "title": "Season 7 of Young Sheldon hasn’t shown up on my Netflix? Any reasons why?",
        "content": "I’m in the UK and season 7 was supposed to have been added on April 15th. But, it just hasn’t appeared? Is it like this for any other UK users or are there any reasons why it isn’t showing up?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kpnlik/season_7_of_young_sheldon_hasnt_shown_up_on_my/"
    },
    {
        "id": "1kp4t1y",
        "author": "korstocks",
        "title": "Barron’s: Netflix Stock Gets a Price-Target Hike. Why It Still Has Upside After a Great Run.",
        "content": "“As of Thursday’s close, Netflix had a market capitalization of just over $500 billion.”\n\n“This week, Barron’s argued that Netflix stock remains a Buy despite its lofty valuation, with its margin likely to grow at a fast enough rate to maintain momentum.”\n\n$NFLX share price is almost near $1,200 a share. The company’s executives, per the Wall Street Journal, are aiming for the company to be worth $1 trillion. \n\n",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kp4t1y/barrons_netflix_stock_gets_a_pricetarget_hike_why/"
    },
    {
        "id": "1kphy1a",
        "author": "mushie-mushroom",
        "title": "how do i get certain profile pictures??",
        "content": "it’s super annoying how they only show certain shows on certain profiles for pfps ughh \n\nwhat if i want a picture from a show that my sister has on her pfp options but it doesn’t show on my account??\n\nand it doesn’t to my knowledge even tell you what shows could possibly have pfp options, like for example the new-ish tmnt show— does that have any pfp options?? i don’t know bc they don’t show up anywhere but nothing seems definitive…\n\nanyway it’s just annoying \n\ni looked online and it said to rate shows you might want as pfps highly, but i did that and nothing seems to change? do i have to wait? is there another way? does anything work??",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kphy1a/how_do_i_get_certain_profile_pictures/"
    },
    {
        "id": "1kphflm",
        "author": "jjgffc",
        "title": "Adventure time with Arabic Dub on Netflix?",
        "content": "Can I still watch Netflix's dub of adventure time in arabic? Or did they remove it? If so is it avialble everywhere or region locked? And if its region locked where can I find it? (What region)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kphflm/adventure_time_with_arabic_dub_on_netflix/"
    },
    {
        "id": "1kovsy8",
        "author": "Mysterious-Order-334",
        "title": "Secrets that we keep",
        "content": "Warning warning!! I watched the series last night. Binged it. I enjoyed it. How ever the ending had me stumped. Did they all know? Will there be another season? Confused on the ending. ",
        "upvotes": 9,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1kovsy8/secrets_that_we_keep/"
    },
    {
        "id": "1kp95y9",
        "author": "cheddrshreddr",
        "title": "Netflix requires wifi to access offline downloads?",
        "content": "I bought a subscription for a trip to Europe so that I could download videos offline to watch on the incredibly long flight. When we took off, I tried opening the app and it kept prompting me to sign in and wouldn’t let me access the videos until I did which is impossible without internet. This seems to defeat the purpose of downloading videos. Is this part of the new household verification process and if so does anyone know a way around this because I feel ripped off paying almost 30$ for a subscription I can’t use. ",
        "upvotes": 1,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kp95y9/netflix_requires_wifi_to_access_offline_downloads/"
    },
    {
        "id": "1kogqh1",
        "author": "pinkglue99",
        "title": "The Quilters",
        "content": "I don’t usually have time to pop in and pick a new show, but tonight I decided to go with something I don’t usually watch. This is a absolutely magical ",
        "upvotes": 94,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1kogqh1/the_quilters/"
    },
    {
        "id": "1kp7sb4",
        "author": "traker998",
        "title": "Multi Camera and Single in same movie or show?  Forgot name.",
        "content": "I saw something about a show that was like a sitcom when the main character was there then a single camera when he left to show both sides.  One joyful and one terrifying when he was gone. \n\nI think it was named the guys name or who the f is something. It’s eating me alive. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kp7sb4/multi_camera_and_single_in_same_movie_or_show/"
    },
    {
        "id": "1knwtjs",
        "author": "theipaper",
        "title": "TV show Adolescence sparks rise in hate on world's biggest incel site",
        "content": "",
        "upvotes": 1304,
        "comments": 471,
        "media": null,
        "permalink": "/r/netflix/comments/1knwtjs/tv_show_adolescence_sparks_rise_in_hate_on_worlds/"
    },
    {
        "id": "1koueqr",
        "author": "stellacampus",
        "title": "An interesting time travel series",
        "content": "The French series Vortex is a really interesting take on time travel, which I think will be enjoyed by anyone who is into that particular genre.  I should note that there is no dub, so if you don't speak French, or can't handle subtitles, skip it.",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1koueqr/an_interesting_time_travel_series/"
    },
    {
        "id": "1kou5qs",
        "author": "gorcbor19",
        "title": "Who's watching \"Weak Hero\" ?",
        "content": "Over the past few years, Netflix has been introducing a ton more foreign shows and films. Some are decent, some are terrible. I watched the preview for this one and thought I'd try watching an episode of it.  \n\nI was instantly hooked!  The show is so well done. It can be slow at times, but for some reason it really fascinates me. I blasted through season 1, and am a couple episodes into season 2.  \n\nWho else is really enjoying this show?  ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kou5qs/whos_watching_weak_hero/"
    },
    {
        "id": "1kph3ry",
        "author": "TheMirrorUS",
        "title": "Netflix fan says people need to see 5 'top movies' including 'best in years'",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kph3ry/netflix_fan_says_people_need_to_see_5_top_movies/"
    },
    {
        "id": "1kp1i2i",
        "author": "Natural-Ship-4854",
        "title": "Weird glitch i think?",
        "content": "Ok so I wanted to watch a specific episode of a series I clicked that episode but instead I went to the episode of a series I am currently watching and when I backed out of that I was in another I was watching. This happen to anyone else?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kp1i2i/weird_glitch_i_think/"
    },
    {
        "id": "1kp0dgu",
        "author": "Either-Concern4358",
        "title": "Netflix on browser loading infinitely",
        "content": "Hi, i've been using netflix on firefox for over a year now with no issues, but for some reason, starting from last week, i've been unable to load any shows or movies at all. It will just show a black screen with the loading circle rotating infinitely. \n\nDoes anyone know how to fix this issue?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kp0dgu/netflix_on_browser_loading_infinitely/"
    }
]