[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1omc7i6",
        "author": "does_anyone_know_wtf",
        "title": "Netflix asking me if I’m still there- stop it",
        "content": "Sometimes I’ll turn on a show and literally like 20 minutes into it, It’ll ask if I’m still there. Yes, I’m still here and probably will be until I turn the tv off. Wtf is this about and why? Please just let me watch tv in peace without having to continuously tell them. It does not deter me in the SLIGHTEST. I just like background noise. But on a little bit of a creepier note, I’ve noticed just lately that it has popped up right when I walk away from the TV as if it’s watching my movements. Anyone else?",
        "upvotes": 152,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1omc7i6/netflix_asking_me_if_im_still_there_stop_it/"
    },
    {
        "id": "1omidrk",
        "author": "Miljkomax",
        "title": "Why is Netflix always so dark?",
        "content": "Noticed this earlier this year when I subscribed and watched the SciFi series Dark. Now I'm watching Black Rabbit during the day and all I can see is just fucking dust on my TV. This is literally unwatchable. \n\nThe brightness, contrast and everything else is at it's highest.\nIs there anything I can do to fix this?",
        "upvotes": 10,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1omidrk/why_is_netflix_always_so_dark/"
    },
    {
        "id": "1ome68t",
        "author": "No-Jaguar-7492",
        "title": "I figured out has to get past the household rule on a tablet or phone without asking for a code!",
        "content": "Ok so basically if you enter the app in airplane mode or without WiFi and it takes you to your downloads. After your in that area just pick the home button in the left hand corner. From there you just turn your device’s WiFi back on and boom in three steps you got Netflix without having to bug your family for the entrance code every 5 minutes!\n\n\nDisclaimer: I did this on an IPad and my IPhone but I’m not sure it will work for all devices. I haven’t tried this method on a pc yet or by using just the plane website Netflix but I doubt it would work there. I also don’t know if it work on non-apple devices but it’s worth a shot. Hope someone found this helpful!\n",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ome68t/i_figured_out_has_to_get_past_the_household_rule/"
    },
    {
        "id": "1omif78",
        "author": "BeautifulReaction222",
        "title": "Mr. Robot Series",
        "content": "I’m JUST coming across this in November 2025! I know, I know,  I’m late but is anyone else watching currently? Or willing to rewatch with me? I have no one to talk to about this show and I’m only EPISODE 1 deep 😫",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1omif78/mr_robot_series/"
    },
    {
        "id": "1omlm78",
        "author": "Lopsided_Doubt_3649",
        "title": "Witcher season 4",
        "content": "Well just finished Witcher season 4 and have nothing bad to say about characters. However storyline absolutely garbage did absolutely nothing in terms of any content, Netflix makes you wait years between seasons then gives you nothing for a story. What a absolute waste of time ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1omlm78/witcher_season_4/"
    },
    {
        "id": "1olrq6q",
        "author": "RealAccount2024",
        "title": "I don’t mind the ads on Netflix but…",
        "content": "why do they have to be so loud?\n\nLiterally the last ad break I had at least doubled the decibel level. \n\nI get they want you to pay attention to them but that’s some gorilla tactics. ",
        "upvotes": 75,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1olrq6q/i_dont_mind_the_ads_on_netflix_but/"
    },
    {
        "id": "1omikgu",
        "author": "Arch_ies",
        "title": "Netflix app on iPhone says I’m not connected to the internet, but everything else works fine",
        "content": "Hey, I’m having a weird issue with Netflix on my iPhone.\nWhen I open the app, it says I can’t connect to the internet — but I am connected. Other apps and browsers work perfectly fine on the same Wi-Fi.\n\nI already tried:\n\t•\trestarting my phone and the app\n\t•\treconnecting to Wi-Fi\n\t•\tlogging out and back in\n\nThere’s no error code, just a message saying it can’t connect.\nAny ideas what could cause this or how to fix it?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1omikgu/netflix_app_on_iphone_says_im_not_connected_to/"
    },
    {
        "id": "1omh5vt",
        "author": "Specialist-Change-86",
        "title": "For the fans of medical dramas",
        "content": "[https://www.soapcentral.com/shows/breathless-season-2-cast-character-guide-who-plays-netflix-drama-s-latest-chapter](https://www.soapcentral.com/shows/breathless-season-2-cast-character-guide-who-plays-netflix-drama-s-latest-chapter)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1omh5vt/for_the_fans_of_medical_dramas/"
    },
    {
        "id": "1om55n2",
        "author": "pnyluv16",
        "title": "Ballad of a Small Player",
        "content": "I just wanted to say that I really enjoyed this movie. I’m not a very “artsy” or whatever person, but some of the visuals/shots were just so pretty. Colin Farrell was great, too ",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1om55n2/ballad_of_a_small_player/"
    },
    {
        "id": "1omfggf",
        "author": "Hairy-Mess-2764",
        "title": "Best series with a 90's vibe?",
        "content": "A serie like Monsters; The Menandez brothers or even Dahmer, or the Pepsi documentary but also Dexter: Original Sin has the 90's vibe what I really like. The fashion, the music, the brands, etc.\nWhat would be your recommendations for shows that have this?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1omfggf/best_series_with_a_90s_vibe/"
    },
    {
        "id": "1om8047",
        "author": "Delusional_Rose444",
        "title": "Im watching \"Bet\" on Netflix (spoilers)",
        "content": "Just started the latest episode of Bet on Netflix and I can’t shake this feeling — if Michael’s dad really killed Yumeko’s parents, I need her to get revenge. 😤 The tension and setup are unreal so far. Anyone else getting the same vibe or think there’s more to it?",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1om8047/im_watching_bet_on_netflix_spoilers/"
    },
    {
        "id": "1olf332",
        "author": "whatchagonnadoelbert",
        "title": "Netflix \"leaking\" my wife's viewing behavior into my profile",
        "content": "My wife and I have our own separate profiles.  I am the account holder, FWIW.  My wife watches a LOT of K-dramas.  I watch no K-dramas.  I watch no Asian-based content.  A lot of the stuff my watches from her profile end up as suggestions and \"watch next\" on my profile, and this HEAVILY skews what Netflix thinks I'm interested in. \n\nHas anyone else experienced this and actually convinced someone at Netflix to do something about it?  The one agent I spoke to several months ago said, \"Oh, your wife must be watching K-dramas using your profile.\"  He refused to believe that there could be a problem with Netflix's system.  I've seen my wife use Netflix and she is always using her profile.",
        "upvotes": 280,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1olf332/netflix_leaking_my_wifes_viewing_behavior_into_my/"
    },
    {
        "id": "1omd7n3",
        "author": "xKqda",
        "title": "Need help with 4k Viewing on Desktop",
        "content": "I have been at this for many many many hours. I can not for the life of me get Netflix to view in 4k HDR. I am using my brand new, got today, ROG SWIFT PG27UDM.  \nThis is what I've tried.  \nISO Re-Install of Windows 11  \nedge://flags to ensure the right DMR settings  \nUsing Edge and Netflix App.  \nDisabling my second monitor that's not 4k.  \nUsing display port 1.4 and HDMI 2.1  \nEnsuring Nvidia shows HDCP-capable status  \nDownloaded the 99c HEVC Codec (paywall codec lol)  \nCheck and made sure youtube was able to display 4k hdr on Edge, it was.  \nI contacted both windows support, which they tried to help. And netflix support, which did nothing but copy paste the FAQ then tell me i had a bad cable...  \nLooking for some help!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1omd7n3/need_help_with_4k_viewing_on_desktop/"
    },
    {
        "id": "1olx28j",
        "author": "Nervous-Cry1817",
        "title": "Help finding a good telenovela style show",
        "content": "Hey everyone!\n\nI’m trying to find a new show to binge and could use some recommendations.  \n\nI’m in my 20s and love series like Jane the Virgin (100/10), Modern Family (9/10), Friends, Desperate housewives (&amp; devious maids), and Pretty Little Liars (10/10), Riverdale (although I didn’t love it).\n\nBasically I like something fun, a bit dramatic, and character-driven ideally with friendship, romance, or mystery mixed in (bonus points if it’s slightly chaotic or has those telenovela-style twists). Really can’t find another good show ideally like Jane the Virgin.\n\nAny ideas for newer (2024/5) or underrated shows that fit that vibe?\n\nThanks in advance!",
        "upvotes": 13,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1olx28j/help_finding_a_good_telenovela_style_show/"
    },
    {
        "id": "1om8uoy",
        "author": "DoughMyNuts",
        "title": "Doi Doi Doi",
        "content": "I'm at a loss. This is an official category? I'd attach a pic for proof, but it looks like this sub doesn't allow them anymore. How does a random meme describe an array of shows and movies spanning two decades? Like I can't imagine recommending a 2006 movie for its \"Hawk Tuah\" vibes.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1om8uoy/doi_doi_doi/"
    },
    {
        "id": "1olr9yw",
        "author": "Ok_Process2503",
        "title": "Annoying Episode Releases",
        "content": "Anyone else frustrated with Netflix adding more and more slow release content? \n\nThey add the episodes slowly and only say the amount of episodes that are up already. For example, at first, Love in the Clouds said it only had 22 episodes, when really there are now 36 episodes. Further, the last episode is scheduled to come out today but it’s not out yet (it’s already about noon ET) and I’m not sure what time of day it will be out.\n\nIt feels like they are just messing with us now 😑",
        "upvotes": 14,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1olr9yw/annoying_episode_releases/"
    },
    {
        "id": "1oljr8m",
        "author": "Cxinthechatnow",
        "title": "After watching a House of Dynamite, I realized the guys carrying the nuclear football probably have one of the most boring jobs in the world",
        "content": "Think about it — you’re probably a high-ranking officer, one of the best of the best, trusted enough to literally follow the president everywhere with a bag that could end the world.\n\nAnd then… nothing ever happens.\n\nDay after day, year after year, you just carry this mysterious briefcase around, always on alert but never actually doing anything. You train for the most extreme scenario imaginable, but your actual job is to wait.\n\nIt’s like being on the world’s most stressful standby mode. You’re part of history, but your daily life is probably just… walking, standing, and waiting for something that hopefully never happens.\n\nKinda wild when you think about it.",
        "upvotes": 36,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1oljr8m/after_watching_a_house_of_dynamite_i_realized_the/"
    },
    {
        "id": "1om8qm4",
        "author": "oblc",
        "title": "Screen Keeps Flickering Netflix (Windows App) And Browser (Edge)",
        "content": "Been wanting to fix my shows from being blurry so I recently turned on HDR video streaming on my laptop to see if it fixes and it turned out to much better quality. But I realized my screen started to unusually flicker.\n\nI turned off graphics acceleration on edge and the flickering stopped on both but went back to it being blurry...\n\nIs there a way to keep the video quality high quality without any problems?  \n  \n**Note:** I'm using an Dell Inspiron 15 3520 laptop and have everything updated.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1om8qm4/screen_keeps_flickering_netflix_windows_app_and/"
    },
    {
        "id": "1om8dhh",
        "author": "Buyylah",
        "title": "Frankenstein Aspect Ratio for its Netflix Release, Standard AR or in IMAX AR?",
        "content": "Will it have an IMAX Aspect ratio when it releases on Netflix or just the standard AR? Couldn’t find any info regarding it. Asking as I could not find any info regarding this online and would prefer someone to assist. I can’t watch it in theatres too :(",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1om8dhh/frankenstein_aspect_ratio_for_its_netflix_release/"
    },
    {
        "id": "1om7xkc",
        "author": "Lumpy-Locksmith7001",
        "title": "I need help finding a slasher type show",
        "content": "I dont remember much about it but I watched it a few years ago it was I believe it was 3 seasons/ 3 different stories I remember one took place in a small town and the other happened in a cabin in the woods\n\nThe cabin in the woods one is the only one I remember the group goes on a trip and they start getting killed off and they try to figure out who is doing and at the end the twist is 2 of the people or might have been just one of the ladies was imagining a person and talking to them and some of the people end up escaping and the girl tracks them down to try to finish them off and I believe that was the end",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1om7xkc/i_need_help_finding_a_slasher_type_show/"
    },
    {
        "id": "1om77d3",
        "author": "mc4557anime",
        "title": "Neo yokio",
        "content": "Will we ever get another season of neo yokio?  Love the first season and the special, but would love another season.   What we got is better than most of what netflix puts out.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1om77d3/neo_yokio/"
    },
    {
        "id": "1omdwkm",
        "author": "Aethereal999",
        "title": "Netflix moves Henry Cavil's name to last on Witcher series cast.",
        "content": "How the mighty have fallen! Netflix has moved Henry Cavil's name to last on Witcher series cast. Witcher series gained traction due to the Witcher3 game and casting Henry Cavil as the main character. Now, how can they move Henry's name to the last? There are much positive ways to introduce a new cast for main character. Guess the disrespect is common in high grossing companies\n\n[Screenshot 2025 11 02 154523 — Postimages](https://postimg.cc/qzPmP0q5)\n\n\\#witcher #netflix #henrycavil",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1omdwkm/netflix_moves_henry_cavils_name_to_last_on/"
    },
    {
        "id": "1om3kxd",
        "author": "AccomplishedPut5175",
        "title": "Rulers of Fortune",
        "content": "I just watched it, and I can recommend it to anyone who loves this genre: action, betrayal, twists.\nIts good show in all,and general acting is good.\nFrom me 8/10.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1om3kxd/rulers_of_fortune/"
    },
    {
        "id": "1omcmjt",
        "author": "Mysterious_Form8966",
        "title": "2 Netflix slots available (4K plan) ₹180 per profile",
        "content": "I’ve been using my personal Netflix subscription for about 4 months now (4K Ultra HD plan). I currently have 2 extra profile slots available  offering each for ₹180/month.\n\n✅ It’s my personal account, so you won’t face any issues.\n✅ If there’s ever a logout or access issue, I’ll refund the amount accordingly.\n\nDM me if you’re interested or have any questions!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1omcmjt/2_netflix_slots_available_4k_plan_180_per_profile/"
    },
    {
        "id": "1om07vu",
        "author": "PokelingLoL",
        "title": "Error code tvq-pb-101 (5.2.5) — common fixes have not worked",
        "content": "Updated my Netflix to include HDR10+ and 5.1 surround sound recently and now shows start spewing the aforementioned error code when I try to watch them.\n\nI have tried everything I could find online: uninstall Netflix, reboot TV, clear cache, change audio settings, turn the audio of a show from 5.1 to original, automatic sound levels on and off, multichannel/bypass/stereo, all that jazz. I do NOT have any audio equipment plugged into my TV. I am using the TV's own speakers, no HDMI cable plugged.\n\nFor context, I own a Philips 55PUS8100 Google TV. I haven't found a setting to turn Dolby sound completely off TV-side. There's a setting for a Dolby notification but turning that on and off does nothing.\n\nEDIT: The issue seems to only persist in very specific parts of series and movies. Skipping over the parts where the error code appears lets video play without issue. This is the case for both 5.1 and normal sound.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1om07vu/error_code_tvqpb101_525_common_fixes_have_not/"
    },
    {
        "id": "1olxaiq",
        "author": "Grand-Inspector1914",
        "title": "Does anyone remember this movie's name?",
        "content": "Im looking for the name of a really bizarre movie i saw some years ago, i don't know if it's still in the catalogue but i recall it being a netflix original.\n\nSince i saw it a while ago i don't quite remember what's about, but it was something along the lines of a couple moving into a new home and weird things happening. LOTS of bugs and holes (or spirals maybe? but it's NOT uzumaki lol).\n",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1olxaiq/does_anyone_remember_this_movies_name/"
    },
    {
        "id": "1olworp",
        "author": "Significant_Ad_Why",
        "title": "Netflix acting funky",
        "content": "Does anyone elses Netflix get dim, like as if it is inactive on the device you're playing it on? Turned on 4 different shows/movies thinking it would be different but after a few minutes, whatever I am watching goes dim and I have to move my mouse on my laptop or the stick on my xbox controller to get the lighting back to normal. \n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1olworp/netflix_acting_funky/"
    },
    {
        "id": "1olms4w",
        "author": "Crow_Whisperer",
        "title": "Fun suggestions to change algorithm",
        "content": "Hi everyone! I have been really into crime and murder documentaries, as well as serious dramas, and now I can't find anything else to watch. I have tried looking up a few lighter shows or movies to watch but it hasn't really changed my selection. It's the same 20ish shows and movies and I'm so tired of it. What are fun, silly, and/or lighthearted titles I can flood my search bar with? Thank you in advance!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1olms4w/fun_suggestions_to_change_algorithm/"
    }
]