[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 512,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1k71md4",
        "author": "nickbruckman",
        "title": "I’m Nicholas Bruckman — director of the new documentary on Netflix, MINTED: The Rise (and Fall?) of the NFT  — AMA on 4/28 @ 4pm ET!",
        "content": "What’s up r/netflix! I’m Nick, director of *MINTED*, now streaming on Netflix worldwide (well, North America, the UK, Australia/New Zealand, and Africa!)\n\nThe film is a front-row seat to the explosive rise of NFTs becoming a $40 billion digital gold rush, all the way through the market's dramatic crash. We spent years embedded in the digital art and crypto worlds, from NFT multimillionaires flipping JPEGs to the pioneering artists flipping the script on the traditional art market, plus the critics and journalists digging into the good, the bad, and bizarre of this new frontier.\n\nWhether you love or hate NFTs, I hope the film sparks some big questions about how art, tech, and finance are colliding. Beyond NFTs, it’s about pioneering artists trying to not just survive, but lead the way forward in how we use new technology as a society.\n\nWe premiered *Minted* at the Tribeca Film Festival, and its been a wild ride since. So whether you’re a collector, a skeptic, or just a fellow documentary nerd — AMA!\n\nproof: [https://www.instagram.com/p/DI12rZQz1BX](https://www.instagram.com/p/DI12rZQz1BX)\n\nnetflix: [https://www.netflix.com/title/81993558](https://www.netflix.com/title/81993558)",
        "upvotes": 15,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1k71md4/im_nicholas_bruckman_director_of_the_new/"
    },
    {
        "id": "1k8sdwu",
        "author": "BusinessBeetle",
        "title": "Havoc: Tom Hardy doesn't know how to act like a human being.",
        "content": "I'm a fan of Tom Hardy, but after watching Havoc, I'm not so sure anymore. \n\nGranted, this is off the heals of trying to watch Capone, which was a masterclasses in overacting. But going into Havoc, my expectations were reset, and I was ready to watch a mindless action movie. \n\nThe intro made me realize what I was in for: was I watching a movie or a video game intro? Everything looked fake, this is a movie that doesn't know how to act like a movie. And that's when Tom Hardy stepped in. An actor that isn't sure how a real human acts. \n\nYes, this movie is stylized and over the top. It's not trying to be realistic, but I think it's supposed to be a video game movie. From the hijacker's neon LED masks to the impossible camera action, this is a video game movie. \n\nBut at the heart is Hardy, whom I'd love to see him play an average Joe, who works as an electrician, but doesn't have a weird accent, a bizarre walk, or looks like he's acting. Because that's all I see now after Capone, Venom, and now Havoc: Tom Hardy is ACTING. But not like real human being. ",
        "upvotes": 50,
        "comments": 82,
        "media": null,
        "permalink": "/r/netflix/comments/1k8sdwu/havoc_tom_hardy_doesnt_know_how_to_act_like_a/"
    },
    {
        "id": "1k8e8dg",
        "author": "IrishStarUS",
        "title": "American Primeval fans must watch 'criminally underrated' Western series",
        "content": "",
        "upvotes": 51,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1k8e8dg/american_primeval_fans_must_watch_criminally/"
    },
    {
        "id": "1k8mcu6",
        "author": "spicynoodl_",
        "title": "Is there a way to remove the watch history of a single show on Netflix",
        "content": "I am rewatching The Crown, and I keep getting lost every time I watch an episode and then come back a few days later, because it skips ahead, so I can't remember where I was before. Is there a way I can \"wipe\" the history of a specific show so that Netflix doesn't remember that I've watched those episodes without wiping my entire account?",
        "upvotes": 12,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1k8mcu6/is_there_a_way_to_remove_the_watch_history_of_a/"
    },
    {
        "id": "1k8poyj",
        "author": "Adventurous_Pay7519",
        "title": "You (S5)",
        "content": "So like… Is anyone getting tired of the trope with Joe just seemingly having it good and then f***ing blowing it on some random chick? And I mean I get the internal dialogue explaining his behavior but Jesus Christ ",
        "upvotes": 9,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1k8poyj/you_s5/"
    },
    {
        "id": "1k88gvo",
        "author": "Sweaty-Toe-6211",
        "title": "Joe Keery Is ‘Okay’ If He’s Only Ever Known as Steve Harrington from Stranger Things",
        "content": "",
        "upvotes": 95,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1k88gvo/joe_keery_is_okay_if_hes_only_ever_known_as_steve/"
    },
    {
        "id": "1k8z00y",
        "author": "S4v1r1enCh0r4k",
        "title": "First Look at Liam Hemsworth as Geralt in The Witcher Season 5",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k8z00y/first_look_at_liam_hemsworth_as_geralt_in_the/"
    },
    {
        "id": "1k8ydrb",
        "author": "Informal-Purpose5979",
        "title": "Race for the Crown",
        "content": "Heya!\n\nBinged the series last night and was pleasantly surprised with what I've watched. I am not into horse racing, and generally speaking, do not approve of gambling. That being said I approached the first episode with an open mindset and that if the first 10-20 minutes suck, then I'll just turn it off.\n\nIt started off a bit slow on the horses side and pretty fast on the glamour and glitz side, with lots of great personalities larger than life. The dapper jockey, the self-proclaimed race horse investor, the billionaire (there were a few actually) and a colorful and multi-national cast from the stables. Man, the show runners narrative building game was spot on! I felt like I was right there and then despite knowing nothing about horses, like I mentioned already.\n\nI don't want to spoil too much, so I'm gonna stop talking about what happened in the show, but will leave some notes to compare.\n\n- **Biggest surprise of the season**: Kenny McPeek. Whoa. What a man. What a rock. I did not expect to like him as much as I did by the end of the season. The way he was nonchalantly introduced and the part he played later was astonishing. Kudos to the show runners again.\n\n- **Biggest disappointment of the season**: Michael Iavarone and Frankie Dettori, not because they disappointed me, but because I was very disappointed along them as their endeavors didn't exactly go as planned. Michael grew on me, although the dude is all show.\n\n- **Katie Davis** was adorable. Watch her rip her heart out on camera. \n\n- **Umberto Rispoli** had the most normal/sane and lovely family and I just couldn't help but feel happy for them. It's nice to see someone doing it right in these *interesting* times.\n\n- **Michael Repole**... yeah.\n\n- **Dornoch's team** were so so great and genuine. Loved every single person in there, but especially Jayson Werth's crew (that's how I am referring to his family). I honestly didn't expect to see such a healthy and functional unit until I read that he and his wife go way back to highschool, which explains a lot.\n\nAs a conclusion, I think for me, this show is on par with Full Swing in terms of immersion into the sport, and Tiger King in terms of suspense (just don't look up the results for 2024) and character/narrative building. Really loved it and hoping to see season 2!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k8ydrb/race_for_the_crown/"
    },
    {
        "id": "1k8uqq6",
        "author": "Ancient-Damage9160",
        "title": "Any recommendation?",
        "content": "I'm looking for something that makes me think... I watched 13 Commandments, a Belgian police series and I liked it a lot, then Black Mirror, and on the other hand, on Apple TV I watched Severance and I thought it was incredible.\n\nI'm looking for something similar but on Netflix. It doesn't necessarily have to be science fiction but rather a movie that makes you think, or that is related to psychological themes and that is very good.\n\nAny recommendation? \n\nEdit I know dark is good. But some other options? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k8uqq6/any_recommendation/"
    },
    {
        "id": "1k8kqrn",
        "author": "saleboulot",
        "title": "Suggestions of shows for someone who liked Million Dollar Secret",
        "content": "Give me suggestions of shows (On Netflix or other platforms) knowing that:\n\n* I enjoyed The Traitors, Million Dollar Secret, The Trust (concept but not necessarily the cast)\n* I don't like dating shows, insufferable casts, drama just for the sake of drama\n\nThank you!",
        "upvotes": 8,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1k8kqrn/suggestions_of_shows_for_someone_who_liked/"
    },
    {
        "id": "1k8xwxs",
        "author": "Top-Dragonfruit-7735",
        "title": "What is the log in thing so horrible?",
        "content": "Every time I wanna log in a game or another device. It says my password is incorrect. But it is correcct. And even if I change it IT STILL SAYS INCORRECT",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k8xwxs/what_is_the_log_in_thing_so_horrible/"
    },
    {
        "id": "1k8xhas",
        "author": "Lexii2626",
        "title": "YOU - sequel?",
        "content": "Not fully completed YOU season 5 yet, got two episodes left. But just had a thought and was curious if anyone else would be even interested in it that liked the show. But having Netflix do another You 2.0? where it follows Joe's and love's son Henry and him kinda becoming the new Joe/love serial killer. Think it would be an awesome twist to it. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k8xhas/you_sequel/"
    },
    {
        "id": "1k8u52v",
        "author": "Mediahead13",
        "title": "Netflix no longer working on PC",
        "content": "So since the password crackdown, the only way I've been able to watch anything on Netflix in my home was through my laptop, since I have no intention of creating my own account.  But now it seems I'm no longer allowed to do that either. Is anyone else having this issue and is there a way around this or is this it for me?\n\n  \nAny help you can offer will be greatly appreciated",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k8u52v/netflix_no_longer_working_on_pc/"
    },
    {
        "id": "1k8d35o",
        "author": "feb19s",
        "title": "documentary reqs that arent true crime?",
        "content": "basically what the title says. it can be on anything. what is something you watched that greatly expanded your knowledge on that topic? i like learning about arts and history but also keen to look more into wildlife",
        "upvotes": 11,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1k8d35o/documentary_reqs_that_arent_true_crime/"
    },
    {
        "id": "1k8bfiv",
        "author": "Connect-Space1818",
        "title": "I need suggestions for new show to watch",
        "content": "Some I've watched previously :\n\nGossip Girl\nInsatiable \nNever Have I Ever\nThe Residence \nGood Girls\nSex Education \nHeartbreak High\nSquid Game\nWednesday \nHeartstopper ",
        "upvotes": 12,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1k8bfiv/i_need_suggestions_for_new_show_to_watch/"
    },
    {
        "id": "1k8sdof",
        "author": "LikeWowMan_Ca",
        "title": "Netflix lag loading",
        "content": "For the last month I have to restart anything I watch about 8 times before it’ll actually play. Everything just gets stuck at 0% and doesn’t load… and I mean EVERYTHING. Just in time for the rate hike too. Anyone else? This doesn’t happen with any other platform. I’m on a Firestick. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k8sdof/netflix_lag_loading/"
    },
    {
        "id": "1k8qtz4",
        "author": "ilmd",
        "title": "2 tv’s same house",
        "content": "If I’m watching a series in my living room then watch next episode the next night in my bedroom, why doesn’t the bedroom tv play the next episode. It goes to the episode I watched the night before in the living room. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k8qtz4/2_tvs_same_house/"
    },
    {
        "id": "1k8q38m",
        "author": "m5les",
        "title": "If I were to stop netflix from sending me any notifications, would it still send an email if I changed the age restrictions on my profile?",
        "content": "If I disabled the setting that lets netflix send emails, would it still send a notification after changing the age restrictions on my profile? Furthermore, would it send a notification if I were to disable that setting.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k8q38m/if_i_were_to_stop_netflix_from_sending_me_any/"
    },
    {
        "id": "1k7yt4n",
        "author": "Upper-Transition4714",
        "title": "Does every new show/movie added to Netflix make it to the top 10?",
        "content": "My friends and I were wondering if every show/movie makes it to the top 10 Daily. We went through the most recent shows release and they all seemed to be in the top 10 at least for a day in some country. I understand the incentive for Netflix to do so but I was wondering if you have noticed any new show/movie that hasn’t. ",
        "upvotes": 61,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1k7yt4n/does_every_new_showmovie_added_to_netflix_make_it/"
    },
    {
        "id": "1k8d4gf",
        "author": "Internal-Bed-3150",
        "title": "Emma Mackey is the White Witch in Netflix's Chronicles of Narnia movies",
        "content": "Perfect choice.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k8d4gf/emma_mackey_is_the_white_witch_in_netflixs/"
    },
    {
        "id": "1k84yz5",
        "author": "curious7189",
        "title": "Million Dollar Secret - one of the best social deduction games",
        "content": "This is better than The Traitors IMO - one of the best social deduction games\n\nI loved that the millionaire had a secret agenda. The Traitors had the traitors do some missions but it was very rare. I wanted more of that and got it in Million Dollar Secret. \n\nI enjoyed the millionaire being rotated so often. It lets you see different strategies from different players.  \n\nThe winner played such a good game, and showed she was strategic in not voting Syd when she had immunity, playing the final round right etc. \n\nI would've been okay with Sam winning too. \n\nCorey...take a shot every time Corey guessed the millionaire incorrectly 😂 he was cool though. \n\nUltimately it was nice to see all of the contestants trying to play strategically. Some of the challenges could be improved (threading needle in the final episode?) but I can say the same for the Traitors. \n\nHoping there's a season 2! What are your thoughts? ",
        "upvotes": 11,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k84yz5/million_dollar_secret_one_of_the_best_social/"
    },
    {
        "id": "1k8mq5t",
        "author": "Sharp-Mine1136",
        "title": "2 accounts",
        "content": "Why would Netflix create 2 different accounts for me when I signed up the first time. I realized that I was being double charged when I recently cancelled my subscription but I was still seeing the charges on my statements. All this time I’ve been charged 2 times. Bruh \n\n\nSomeone else experience this issue ?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k8mq5t/2_accounts/"
    },
    {
        "id": "1k8ra1j",
        "author": "LenFraudless",
        "title": "Is Netflix scamming users that cancel their account?",
        "content": "I canceled my Netflix subscription back in February I got an email.. a month later it started charging me again.. I went back on canceled my account. I got a email confirming my cancellation on March 17th.  Yesterday I get an email thanking me for opening my account back up. I didn't open my account back up. Is this a common occurrence is this happening with everyone that cancels their subscription? ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1k8ra1j/is_netflix_scamming_users_that_cancel_their/"
    },
    {
        "id": "1k81wx6",
        "author": "Marite64",
        "title": "Suggestions on good series.",
        "content": "I'm watching Desperate Housewives season 6 (no spoiler please). Is there something as good on Netflix? \n\nNo violence, no gore, no sci-fi, no medical drama. Thanks. ",
        "upvotes": 8,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1k81wx6/suggestions_on_good_series/"
    },
    {
        "id": "1k8pemm",
        "author": "That-Ad757",
        "title": "THE ARE MURDERS",
        "content": "Watching Swedish movie it's in English. Actors all have American accents Thought at first dubbed it's is so out of touch with reality of location and the voices almost sound horrible very generic and lot is unoriginal. How on earth are they pushed as so great guess its netflix not viewers",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1k8pemm/the_are_murders/"
    },
    {
        "id": "1k8pafz",
        "author": "Stumblebum24",
        "title": "Netflix has logged everyone out of my household account.",
        "content": "I share my Netflix account with my parents and a friend and we all got a message stating this: \n\n***Your device is not part of the Netflix Household for this account***\n\n***Not \\[email\\]? Create an account to enjoy your own Netflix today.***  \n**Did we get it wrong? Watch temporarily until you are back on your Netflix Household Wi-Fi or sign out.**\n\nbut that is the email that I was logged in from. moreover, I live in a different province now so I can't log back in to the same wifi if that is the issue this is alluding to. idk what to do or what the problem even is.",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1k8pafz/netflix_has_logged_everyone_out_of_my_household/"
    },
    {
        "id": "1k8a1m8",
        "author": "Excellent-Chair2796",
        "title": "Price Increases To Netflix",
        "content": "I'm new to this forum but am really disappointed the way I am (in UK) now paying £12.99 for a service monthly I used to pay £7.99 for.  That's nearly double.  I don't want wrestling !!! Does anyone know if Netflix are losing subscribers from this, and if their updated subscription statistics are available to view anywhere ? ",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1k8a1m8/price_increases_to_netflix/"
    },
    {
        "id": "1k7yrbs",
        "author": "HumdrumHoeDown",
        "title": "Recommendation: Warrior",
        "content": "I slept on this show since it became available. Watched a few minutes of it, didn’t bite. But i heard some hype and decided to give it a try just recently, and holy shit am I feeling rewarded for it. \n\nIt doesn’t even take long to get good, and rarely falters in any area. Writing, production, acting, casting, costumes, what have you: it’s all on point 90% of the time.\n\nIt’s a gangsters/families, cops and robbers martial arts drama, with the various gangs being fictional, but still feeling plausible in its’ historicity. I treat it as fiction, but made in imitation of real life, at least as far as the broad tensions and power dynamics of that place and time.\n\nThe writing is sharp, the characters are great portrayals of certain archetypes. The action is excellent and stylish. It’s quality top to bottom. And it’s a unique perspective.\n\nThe focus is the Chinese immigrant population of 19th century San Francisco, but also the Irish population and other ancillary forces such as nativist white supremacy, economics, existing political structures, culture barriers, space and resource limitations etc etc. \n\nIf you like historical fiction, martial arts, sopranos style gangster drama…this is for you. \n",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k7yrbs/recommendation_warrior/"
    },
    {
        "id": "1k7v333",
        "author": "KingFyx",
        "title": "Did Netflix just gave up promoting their once popular tv shows ?",
        "content": "This year, I got back into rewatching a few old shows from Netflix only to realise that there was a new season of Black Mirror. That's weird I thought to myself cause Netflix usually would promote their shows leading up to the release. \n\nAnd now with You season 5 being released, I realised that Netflix hasn't done any promos for their old shows for a while for the past 2 years ? It's only a week after the season hits or some random Tiktoks that i would find out a show is coming up. What happened ? \n\nEdit: I just went through their trailers and like, this entire year is loaded with their highest viewership shows ? How are they not making a big deal out of this year being the year of Netflix coming back with their cult classic shows ? We have Sandman, Love, Death and Robots, Wednesday, as well as Stranger Things (although I did saw Stranger Things being announced this year BUT not because of Netflix bombarding it in my face). ",
        "upvotes": 12,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1k7v333/did_netflix_just_gave_up_promoting_their_once/"
    },
    {
        "id": "1k8os2x",
        "author": "Humble_Classic_1676",
        "title": "Why can’t i use my netflix???!!",
        "content": "this is a small rant: i am part of a family netflix account that my parents pay for. i attend college a whole 30 minutes away from my house and have not been able to use my netflix for two years at this point because it keeps telling me that i’m not a part of my household. this is absolutely insane to me because the account is paid for and i’m NOT EVEN FAR AWAY FROM HOME. is there ANY way i can trouble shoot this without having to shell out for an entirely separate subscription, this is insane. ",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1k8os2x/why_cant_i_use_my_netflix/"
    },
    {
        "id": "1k7n76b",
        "author": "Internal-Bed-3150",
        "title": "Netflix is dropping 55 movies and series this week (April 26 - May 2, 2025)",
        "content": "",
        "upvotes": 27,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1k7n76b/netflix_is_dropping_55_movies_and_series_this/"
    }
]