[
    {
        "id": "1kwvyuw",
        "author": "SisterMidnightAMA",
        "title": "Hi r/movies! I’m Karan Kandhari, writer/director of the new black-comedy SISTER MIDNIGHT, in theaters now from Magnolia Pictures. Premiering at the Cannes Directors’ Fortnight in 2024, the film is my debut feature film and stars Radhika Apte. Ask me anything!",
        "content": "Hi [r/movies](https://www.reddit.com/r/movies/)! I’m Karan Kandhari, writer/director of the new black-comedy SISTER MIDNIGHT, in theaters now from Magnolia Pictures. Premiering at the Cannes Directors’ Fortnight in 2024, the film is my debut feature film, stars Radhika Apte, and features an original soundtrack from Interpol frontman Paul Banks. Ask Me Anything!\n\n**SISTER MIDNIGHT**\n\nNow in Theaters\n\nWritten and Directed by Karan Kandhari\n\nStarring Radhika Apte, Ashok Pathak, Chhaya Kadam, Smita Tambe\n\nComposer Paul Banks (Interpol)\n\nSynopsis:\n\nIn SISTER MIDNIGHT, the audacious debut feature from London based Indian artist and filmmaker Karan Kandhari, rebellious small-town misfit Uma (acclaimed Indian actress Radhika Apte) arrives in Mumbai to find herself totally unsuited to life as a housewife. At odds with her prying neighbors and under the constant oppressive noise and heat of the city, she decides to break free from the shackles of domesticity and follow her own path in this bold, unpredictable, and darkly funny debut. Featuring an eclectic soundtrack (Interpol frontman Paul Banks makes his debut as composer) and singular visual aesthetic, the film world-premiered in Cannes’ Directors Fortnight and won the award for Best Film in the Next Wave section at Fantastic Fest.\n\n110 Minutes\n\nOur TAXI DRIVER-Inspired Official Poster is painted by James Paterson, who also painted the key art for Edgar Wright’s LAST NIGHT IN SOHO and David Fincher’s THE KILLER.\n\nOfficial Trailer:\n\n[https://youtu.be/g2hiY3SNplw?si=Sxm6BAB0Es-qHVlA](https://youtu.be/g2hiY3SNplw?si=Sxm6BAB0Es-qHVlA)\n\nGet Tickets:\n\n[https://www.magnetreleasing.com/sistermidnight/screenings/](https://www.magnetreleasing.com/sistermidnight/screenings/)\n\nAsk me anything! Back at 5 PM ET tomorrow (Wednesday 5/28) to answer your questions",
        "upvotes": 43,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n9tkhc2zid3f1.png?auto=webp&amp;s=7ef8c1160af49dba77915f45733bdb638cd69627"
        },
        "permalink": "/r/movies/comments/1kwvyuw/hi_rmovies_im_karan_kandhari_writerdirector_of/"
    },
    {
        "id": "1kx4pt0",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Lindsey Bahr - Wednesday 5/28 at 1:00 PM ET - 10-Year Veteran Film Reporter &amp; Film Critic for the Associated Press",
        "content": "",
        "upvotes": 14,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/olw7dcvaef3f1.jpeg?auto=webp&amp;s=a5e66a6a3500c7e9cd30027e1b5c8e981da89b98"
        },
        "permalink": "/r/movies/comments/1kx4pt0/amaqa_announcement_lindsey_bahr_wednesday_528_at/"
    },
    {
        "id": "1kws6hs",
        "author": "dancingbanana123",
        "title": "What Oscar winner had the worst career afterwards?",
        "content": "Usually, winning an Oscar is seen as a huge boost for ones career and that actor/director/whatever tends to have an easier time finding good movies to work on. However, presumably if someone continues to have box office fail after box office fail afterwards, they would start to lose that success and slowly stop appearing in big movies. Who are some people like this? It doesn't have to be an actor or actress, it can be a writer, cinematographer, etc. I'm curious on what the outlier cases look like.",
        "upvotes": 3981,
        "comments": 2819,
        "media": null,
        "permalink": "/r/movies/comments/1kws6hs/what_oscar_winner_had_the_worst_career_afterwards/"
    },
    {
        "id": "1kwpjbp",
        "author": "MarvelsGrantMan136",
        "title": "New Character Posters for Wes Anderson's 'The Phoenician Scheme'",
        "content": "",
        "upvotes": 2751,
        "comments": 419,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/szuu56zbac3f1.jpeg?auto=webp&amp;s=059d2640e68452cc61f7129890c882930f155a1d"
        },
        "permalink": "/r/movies/comments/1kwpjbp/new_character_posters_for_wes_andersons_the/"
    },
    {
        "id": "1kwsvv5",
        "author": "MarvelsGrantMan136",
        "title": "‘Kung Fury’ Director David Sandberg Unveils New Movie ‘Dragonlord'",
        "content": "",
        "upvotes": 1343,
        "comments": 92,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FcdJL9lxm0f2neo0MH0b3MLNb4mMUT0B7UnsLONsXZg.jpg?auto=webp&amp;s=5541e0f2479e52e842baf1fea6123742b7a7e3b0"
        },
        "permalink": "/r/movies/comments/1kwsvv5/kung_fury_director_david_sandberg_unveils_new/"
    },
    {
        "id": "1kx3dov",
        "author": "Hey-Yah1",
        "title": "Guess the movie (or show) with one word",
        "content": "Let’s play a movie guessing game! Type a single word that hints at a movie or show. The word you pick CANNOT be any of the following \n\nIn the title\n\nA character’s name, \n\nMade-up word like: Jedi, Kryptonite, etc \n\nHere’s an easy example: CHOCOLATES\n\n\nNow it’s your turn! Drop your one-word clue and see who can guess it. Reply to others if you think you’ve cracked theirs. Keep it fun, clever, and challenging!",
        "upvotes": 340,
        "comments": 2690,
        "media": null,
        "permalink": "/r/movies/comments/1kx3dov/guess_the_movie_or_show_with_one_word/"
    },
    {
        "id": "1kx7fxj",
        "author": "Independent-Dust4641",
        "title": "What's a fun fact that many people may not know about a movie?",
        "content": "I'm reading through the trivia page for George of the Jungle (1997), and I found 3 things that kinda shocked me.\n\nFirst, Leslie Mann said in an interview in 2019, that while filming George of the Jungle, she developed a crush on and fell in love with Brendan Fraser.\n\nSecond, George of the Jungle is the movie that made Stephen Sommers consider Brendan Fraser for The Mummy (1999)\n\nAnd third, Brendan Fraser was considered for the lead role in Inspector Gadget but turned it down for George of the Jungle.\n\nAre there any fun facts that kinda blow your mind?",
        "upvotes": 173,
        "comments": 150,
        "media": null,
        "permalink": "/r/movies/comments/1kx7fxj/whats_a_fun_fact_that_many_people_may_not_know/"
    },
    {
        "id": "1kwfvq8",
        "author": "Fabulous_Bluebird931",
        "title": "Robin Williams' Popeye Was Filmed While the Set 'Snowed with Cocaine'",
        "content": "",
        "upvotes": 8750,
        "comments": 666,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x13Ggv0_QZC8I5LgJfcMchqki5FZ33N4neWgaDSqsQU.jpg?auto=webp&amp;s=4011768d553bf6aef22cb25b97af625ae56b5f38"
        },
        "permalink": "/r/movies/comments/1kwfvq8/robin_williams_popeye_was_filmed_while_the_set/"
    },
    {
        "id": "1kwih8m",
        "author": "PM_Peartree",
        "title": "Nepotism doesn't always work: Children of celebrated actors who tried to be film stars and FAILED",
        "content": "Rumer Willis - She did a few pictures throughout the 2000s, among those being Sorority Row and The House Bunny, yet the Alexa Joel Ray of acting failed to catch in and since became more of a bit player. \n\nSistine Stallone - The highlight of her acting career was getting eaten by a shark in 47 Meters Down: Uncaged. Her cousin, Vatican, didn't even try.",
        "upvotes": 4248,
        "comments": 1584,
        "media": null,
        "permalink": "/r/movies/comments/1kwih8m/nepotism_doesnt_always_work_children_of/"
    },
    {
        "id": "1kx7o9w",
        "author": "EThorns",
        "title": "Samurai Jack creator Genndy Tartakovsky had to fight for his R-rated version of Lady and the Tramp",
        "content": "",
        "upvotes": 111,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xVAPeU2x836e-nj2m-wBJNIQnIt9qIFYwKf4FqvYy_8.jpg?auto=webp&amp;s=705d2907eb46aa7ba26847c662cdc28815c7a88c"
        },
        "permalink": "/r/movies/comments/1kx7o9w/samurai_jack_creator_genndy_tartakovsky_had_to/"
    },
    {
        "id": "1kx94yw",
        "author": "magnetman47",
        "title": "What is the worst use of the one allocated F-Bomb for a PG-13 movie?",
        "content": "I've seen threads in the past asking for the best use of it, so I thought I'd go in the opposite direction here. Plus I don't think I've ever seen this asked before, so there's that. \n\nThe worst one that comes to mind for me is from Ride Along. It doesn't really add anything and they whisper it, pretty lame.\n\nHere's a link to the scene if you're curious: https://youtu.be/10aHzbMq4dU?t=60",
        "upvotes": 75,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CujzqGO2Jzcx6FJMOd5S2ojsvaucxMm3ruIwJSbqprA.jpg?auto=webp&amp;s=eb8fcf4802419831140c9533e57435c21ed0fab6"
        },
        "permalink": "/r/movies/comments/1kx94yw/what_is_the_worst_use_of_the_one_allocated_fbomb/"
    },
    {
        "id": "1kwo31n",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Aziz Ansari's ‘GOOD FORTUNE’ - Follows Keanu Reeves as an inept angel who meddles in the lives of a gig worker and a wealthy man.",
        "content": "",
        "upvotes": 1146,
        "comments": 119,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ikzs0datzb3f1.jpeg?auto=webp&amp;s=748f5357cdafa3abbca1416fd4870653289466db"
        },
        "permalink": "/r/movies/comments/1kwo31n/official_poster_for_aziz_ansaris_good_fortune/"
    },
    {
        "id": "1kwuz5v",
        "author": "BunyipPouch",
        "title": "New Poster for Dark-Comedy 'Sister Midnight' - In Mumbai, an arranged marriage spirals into darkness as the spineless husband watches his wife morph into a ruthless, feral force within their marital confines.",
        "content": "",
        "upvotes": 460,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wwjxba94cd3f1.jpeg?auto=webp&amp;s=87a31798073e066d67cf255292eaa9d9f29875be"
        },
        "permalink": "/r/movies/comments/1kwuz5v/new_poster_for_darkcomedy_sister_midnight_in/"
    },
    {
        "id": "1kwwgd9",
        "author": "indiewire",
        "title": "Jacob Elordi Teases Working on Ridley Scott's \"The Dog Stars,\" Saying That Scott's Energy Has Inspired Him to Keep Going for Another 400 Years",
        "content": "",
        "upvotes": 318,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-0UXyNTayESfvgf4Fej9a4IsZWeiP7rq1aWfOO_YElY.jpg?auto=webp&amp;s=e15d7493833a78f27178a403c679c105ef643613"
        },
        "permalink": "/r/movies/comments/1kwwgd9/jacob_elordi_teases_working_on_ridley_scotts_the/"
    },
    {
        "id": "1kwohsz",
        "author": "rejiro659630042025",
        "title": "I genuinely believe short IMAX release windows are a large contributor to cinema's decline",
        "content": "I almost missed out on Sinners in 70mm, so if this post comes off as a little petty, I admittedly am.\n\nI work in film myself, I love and live for the artform. Unfortunately, my unpredictable work schedule means I actually miss out on watching some good movies in theatres. My girlfriend and I have to coordinate our work schedules, and sometimes we're able to go on the third week. We both only got to see Sinners on the week of its return engagement in 70mm because IMAX agreed to it.\n\nLately, IMAX has been screening a lot of new releases for only a week or two, and rereleases for maybe 1-3 days. Michael B Jordan himself complained about the small 3 day window which he couldn't attend the screening of the 4K Princess Mononoke restoration. This is occuring quite often because IMAX has been adamant about signing contracts for as many films and experiences as possible. Sinners was not only kicked out of theatres to make way for Thunderbolts*, but also to make way for Fortnite Championship Series (which I can't understand how the audience would benefit from the extra pixels compared to a standard screen). Interstellar's infamously limited rerelease had advance tickets offered on eBay for hundreds.\n\nFurthermore, tickets are so hard to buy for the first week and sometimes even the second week. IMAX has unintentionally curated a toxic collecting culture around collecting different film strips every week (the artificial scarcity of those same strips selling for hundreds online). It has contributed to a toxic rewatch culture that takes away seats from potential first-time viewers. And IMAX only has so many screens available, which makes rewatch culture even more unfair when a second viewing could be on a standard screen instead.\n\nIMAX's greed is why a lot of cinemagoers who usually show up the second or third week have become jaded with movie theatres and just wait for the home release. Who can blame them when they're being marketed the best cinema experience only to be blocked out of attending because it's so hard to find good tickets for the entire IMAX run? IMAX has close to a monopoly on Premium Large Format where I live here in Canada (if they don't have one already). Again, I love cinema, but this is the reason I'm falling out of love with watching films in a theatre.\n\nWhat can IMAX do to fix this? Sign less contracts, IMAX should only screen 11 or 12 new releases each year, in 3-4 week runs. The extra weeks left over can be filled with rereleases that stay for 1-2 weeks. Make only one type of film strip  so that viewers aren't coming back to collect them all, and increase the supply so that everyone who wants to get one can get one.\n\nWhere will the other films go if they can't screen in IMAX? They can go to competing Premium Large Formats or standard screens (romcoms aren't made for IMAX, to be quite fair). There aren't enough IMAX screens to properly meet demand for the biggest films out there, so some films have to be pushed out to make way for longer engagements for other films.\n\nIf IMAX cannot change their ways and allow their screenings to stay an extra week or two so they can be more accessible, I think it's time to bet on another horse in the race. Maybe Dolby Cinema once they can open up enough screens worldwide. But preferably a format that can keep a film in theatres for roughly a month, as it used to be back in the old days. I'm speaking as someone who didn't have to worry about choosing between Spider-Man 2 or Shrek 2, because I could see them both in theatres on different days.",
        "upvotes": 785,
        "comments": 271,
        "media": null,
        "permalink": "/r/movies/comments/1kwohsz/i_genuinely_believe_short_imax_release_windows/"
    },
    {
        "id": "1kwzb55",
        "author": "BunyipPouch",
        "title": "South African Actor Presley Chweneyagae, who was the Lead Actor in the 2005 Oscar-Winning ‘Tsotsi’, (Best International Feature Film), Dies Aged 40",
        "content": "",
        "upvotes": 187,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4sj6nfyn9Zjs50DIc8PmXpVD-6OLojCeOshdQD7k_VM.jpg?auto=webp&amp;s=6d8b542f6bb86d431299e54ef421ca783a96b2fd"
        },
        "permalink": "/r/movies/comments/1kwzb55/south_african_actor_presley_chweneyagae_who_was/"
    },
    {
        "id": "1kx2kbe",
        "author": "Stackman878",
        "title": "Evan Almighty was the first move to go completely “Carbon Neutral”",
        "content": "I was listening to a podcast today about the movie Evan Almighty and how many things went wrong with the movie. One part that went right was that the movie was the first to be completely carbon neutral, which I thought was really cool. Here is how they did it.\n\n\t•\tCarbon footprint calculation: The production team first measured the estimated carbon emissions the film would generate (including transportation, energy use, construction, etc.).\n\tTree Planting Initiatives: Director Tom Shadyac required crew members to plant 2,050 trees at the Rappahannock River Valley National Wildlife Refuge in Virginia and the San Joaquin River National Wildlife Refuge in California.  ￼\n\t•\tRecycling and Sustainable Practices: The production emphasized recycling, provided bicycles for crew members to reduce vehicle use, and used double-sided scripts to minimize paper waste.  ￼\n\t•\tSet Material Donations: the ark in the movie was a real fully built ark! When production was over the are was deconstructed and materials from the ark set were donated to Habitat for Humanity instead of being discarded. \n\t•\tUse of hybrid vehicles: The production used hybrid cars for transportation during filming to reduce fuel consumption and emissions.\n\t•\tEco-friendly power: Efforts were made to reduce on-set energy use, including turning off equipment when not in use and optimizing energy efficiency.\n\t•\tRecycling and waste reduction: On set, recycling programs and waste reduction initiatives were implemented, including composting and limiting single-use plastics.\n\nAll in all, I feel like these practices could be adopted more often. Thought it was a really cool story and wanted to share!\n",
        "upvotes": 119,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1kx2kbe/evan_almighty_was_the_first_move_to_go_completely/"
    },
    {
        "id": "1kwhsu5",
        "author": "mrjohnnymac18",
        "title": "James Bond franchise owners request more time to defend control of 007 spy name",
        "content": "",
        "upvotes": 2112,
        "comments": 100,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_KifZuq4wrFppOqWeABnOmkgSv-iviGJg0AMRqZF454.jpg?auto=webp&amp;s=8d6e940420654218613444d72919e02cd4d4eb63"
        },
        "permalink": "/r/movies/comments/1kwhsu5/james_bond_franchise_owners_request_more_time_to/"
    },
    {
        "id": "1kx2p5z",
        "author": "Wonder-Lad-2Mad",
        "title": "Everbody knows Christopher Lloyd can play a mean villain, but holy shit he's terrifying as Kruge in Star Trek III: Search for Spock (1984), this movie rules",
        "content": "I'm still going through the Star Trek movies, now I've finished the third one. Everbody told me this one isn't that good, you guys lied. This one was good too. But honestly the highlight for me was Commander Kruge played by Christopher Lloyd. He's playing a crazy, bloodthirsty Klingon commander. And he's playing it so fucking large and terrifying that it makes me wonder how the Federation ends up having a treaty with Klingons in later Star Treks, cause these guys hate eachother.\n\n\nI think people know Lloyd can play a scary villain because of his Performance as Judge Doom in Roger Rabbit. But I felt way more evil radiating from Kruge as the megalomaniac commander.\n\n\nEnough gushing about Lloyd, I thought this movie was adorable. They really spend a long time &gt;!mourning the loss of Spock, the initial intro monoluge by Kirk about the Enterprise feeling like an empty home where the children have moved on was so sweet!&lt; I kinda love how the first 30 minutes are just spent adjusting to that grief.\n\n\n\nAnd the ending is also quite emotional. I wish I had a best friend like Spock. Fucking friendship goals.\n\n\nJust a side observation but Spock's dad, Sarek reminds me of a Minecraft villager for some reason.\n\n\n\nThe only downside to this movie would be sequences with David and Savvik on Genesis if I had to point out a flaw. It just didn't really feel that emotionally connected to the rest of the story. It just felt like they had to resolve the revelation from the prior movie that &gt;!Kirk had a secret son!&lt;.\n\n\nP.s.: I'm watching the Space Seed episode of the TOS since you guys recommended it so hard.",
        "upvotes": 92,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1kx2p5z/everbody_knows_christopher_lloyd_can_play_a_mean/"
    },
    {
        "id": "1kw8cdm",
        "author": "chrispdx",
        "title": "You often hear the phrase \"They Couldn't Make That Movie Today!\" about a movie that they could. What movies from the past could they LITERALLY not make today?",
        "content": "The one that pops to my mind is from 1984: \"Blame It On Rio\", where middle-aged Michael Caine has a sexual relationship with his co-worker's teenage daughter while on vacation in Brazil.\n\nIn fact, most of the late-70s to mid-80s teenage sex comedies couldn't be made today due to hightened sensibilities about exploitation.\n\nAny others?\n\nEDIT: Jesus F C this blew up\n\nEDIT 2: People, these have been covered to death:\n\nBlazing Saddles\n\nTropic Thunder\n\nRevenge Of The Nerds\n\nBirth Of A Nation\n\nSong Of The South\n\nAce Ventura",
        "upvotes": 11414,
        "comments": 5876,
        "media": null,
        "permalink": "/r/movies/comments/1kw8cdm/you_often_hear_the_phrase_they_couldnt_make_that/"
    },
    {
        "id": "1kx1j44",
        "author": "Deadstone16",
        "title": "What is your \"This movie kinda sucks, but I'll leave it on in the background because the action's great.\" ?",
        "content": "You know the type: Maybe it's a laundry movie, maybe it's a guilty pleasure. Something that you're really only in for for the visuals, but the story/writing leaves much to be desired.\n\nFor me, it's Transformers: Dark of the Moon. Can't stand to actually sit down and watch it, but my god if the VFX aren't absolutely breathtaking throughout.",
        "upvotes": 102,
        "comments": 223,
        "media": null,
        "permalink": "/r/movies/comments/1kx1j44/what_is_your_this_movie_kinda_sucks_but_ill_leave/"
    },
    {
        "id": "1kx5fsc",
        "author": "EntertainmentQuick47",
        "title": "Movies that started off as completely different projects",
        "content": "I was surprised to learn that The Truman Show has originally been conceived as a psychological thriller with Robin Williams and Dennis Hopper (who actually showed up to set and filmed a bit) before it became the movie we currently know.\n\nNow I must ask: what are some other movies that started off as completely different projects?\n\nA few more examples off the top of my head include:\n\n• Die Hard 3 being a movie called \"Simon Says\" and Die Hard 4 being a movie called \"WW3.com\" \n\n• The Cable Guy being a Buddy comedy with Chris Farley and David Spade\n\n• The Lawnmower Man being a Sci Fi script before being turned into a \"Stephen King\" adaptation that Stephen King himself disowned \n\n• Tales From The Darkside being Creepshow 3 before becoming a separate anthology horror movie.\n\n• Live action Scooby Doo originally being a PG-13 parody movie \n\n• The first Final Destination was meant to be an X-Files spin-off ",
        "upvotes": 47,
        "comments": 92,
        "media": null,
        "permalink": "/r/movies/comments/1kx5fsc/movies_that_started_off_as_completely_different/"
    },
    {
        "id": "1kwrd7x",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Colby Minifie - Wednesday 5/28 at 4:30 PM ET - Actress in 'The Boys', 'Gen V', 'I'm Thinking of Ending Things', 'Fear the Walking Dead', 'The Marvelous Mrs Maisel', and lots more.",
        "content": "",
        "upvotes": 259,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ilzzql5umc3f1.png?auto=webp&amp;s=aa5228fcc19f5540d3de257a62be0c23ee4c2746"
        },
        "permalink": "/r/movies/comments/1kwrd7x/amaqa_announcement_colby_minifie_wednesday_528_at/"
    },
    {
        "id": "1kwnbht",
        "author": "PM_Peartree",
        "title": "\"3 Ninjas: High Noon at Mega Mountain\" (1998): Hulk Hogan, Jim Varney and Loni Anderson in a movie so bad that it will make you want to run away but entertaining enough (for the wrong reasons) to keep you glued to the screen",
        "content": "",
        "upvotes": 416,
        "comments": 180,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vwZkI3uCn_Q8iOqNuxzODYzPxWy9fPvDRfJC_-oSB7g.jpg?auto=webp&amp;s=b427f0fbb54f36ed450ec622c9b3ed3729c7eb1d"
        },
        "permalink": "/r/movies/comments/1kwnbht/3_ninjas_high_noon_at_mega_mountain_1998_hulk/"
    },
    {
        "id": "1kx89ws",
        "author": "virtualpig",
        "title": "Gods of Egypt was a fun ass movie",
        "content": "I just saw this movie and I can't stop thinking about it. I think it's quickly becoming one of my favorite movies. \n\nYes it's the antithis to the \"serious\" movie but honestly that's what I was looking for. It played out like a live action video games and the whole thing  felt badass the whole time. It's one of those movies that make you love the artform and the possibilitities of it. \n\nI'm making this as sort of a PSA because the film got terrible reviews and is kind of an internet punching bag. And I mean, I guess it's not totally unwarented it's a Michael Bay esque , essentially scifi, movie about Egyptian gods shooting lasers at each other, so if you were expecting an at all nuanced examination of Egyptian mythology this ain't it folks, but what is here is so great and fun and the movie just looke beautiful. So yeau that's my review. \n\nAny other fans here?  ",
        "upvotes": 27,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1kx89ws/gods_of_egypt_was_a_fun_ass_movie/"
    },
    {
        "id": "1kwr54e",
        "author": "Comic_Book_Reader",
        "title": "Elio | Final Trailer | In Theaters June 20",
        "content": "",
        "upvotes": 200,
        "comments": 134,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FGtu1uAT3RVUBAFm3DKyBHELxUJCwq5DDpLukz7huXw.jpg?auto=webp&amp;s=034a4d7b83c715623c65f0962bf2f63a3345873f"
        },
        "permalink": "/r/movies/comments/1kwr54e/elio_final_trailer_in_theaters_june_20/"
    },
    {
        "id": "1kx5f82",
        "author": "Charrikayu",
        "title": "(RedLetterMedia) The A.I. Apocalypse - Beyond the Black Void",
        "content": "",
        "upvotes": 30,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/l6HcmiUWukON0EDPGxJNEMqVYAYfY3G-R__8N78pPEQ.jpg?auto=webp&amp;s=bc6b435167721f5e4481913f2a28f196e95afd1a"
        },
        "permalink": "/r/movies/comments/1kx5f82/redlettermedia_the_ai_apocalypse_beyond_the_black/"
    },
    {
        "id": "1kwpdjz",
        "author": "Draper_White_Soprano",
        "title": "What is the most ridiculous example of someone winning a fight who in reality is way too small/weak/old?",
        "content": "Given that most of Hollywood is under 5' 10\" It is always humorous to imagine 75 YO Robert Deniro beating up someone in the Irishmen.  5'8\" Vin Diesel going blow for blow with the Rock, or 120 pound Scarlett Johansson in the Black Widow kicking every dude's ass.\n\nThough I never watched a single episode, every time I would see a commercial for the TV version of The Equalizer with Queen Latifah (badly) throwing punches, it always cracked me up.",
        "upvotes": 194,
        "comments": 477,
        "media": null,
        "permalink": "/r/movies/comments/1kwpdjz/what_is_the_most_ridiculous_example_of_someone/"
    },
    {
        "id": "1kx5w8b",
        "author": "joesen_one",
        "title": "Bi Gan’s Cannes Winner ‘Resurrection’ Nabbed by Janus Films for North America",
        "content": "",
        "upvotes": 25,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mMFarCumuViu-ul9ofpxlUKETculfayqX78i33RyyAI.jpg?auto=webp&amp;s=cb39dc6bf9fa8c8e594ee2e6f75e39276ed28980"
        },
        "permalink": "/r/movies/comments/1kx5w8b/bi_gans_cannes_winner_resurrection_nabbed_by/"
    },
    {
        "id": "1kx0d9k",
        "author": "adamsandleryabish",
        "title": "It Came From Hollywood (1982) - A Documentary/Tribute to B Movies featuring Dan Aykroyd, John Candy, Gilda Radner, and Cheech and Chong that has been OOP since VHS",
        "content": "",
        "upvotes": 42,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VhAVfsZrJt-AWYQFW6ldrMPnj1Ai9uuJOL3e60kqEyk.jpg?auto=webp&amp;s=445a0e5ba6e53993cba59860d15a3384b00c6481"
        },
        "permalink": "/r/movies/comments/1kx0d9k/it_came_from_hollywood_1982_a_documentarytribute/"
    },
    {
        "id": "1kwrvlr",
        "author": "Affectionate-Age715",
        "title": "Just finished rewatching Lawrence of Arabia. Noticed something.",
        "content": "I have watched this movie at least 2 dozen times in full and countless times through rewatching my favorite clips. I can quote this movie in my sleep.\n\nOn this rewatch, I noticed something.\n\nWhenever he's in control, or in a dominant or comfortable position, or victory, he is framed in the left looking towards the right.\n\nWhenever he's in danger, or undertaking a difficult task, or generally uncomfortable, or defeat, he's framed in the right looking to the left.\n\nHe's positioned in the centre when he's in a state of ambivalence, being not quite sure where he'd be, what he'd do.\n\nBe it the beginning of the movie where he's reading his bike, or him leading into the desert, with his guide Tafas. Or him admonishing Sherif Ali for killing his guide, him reaching Faisal's camp, talking to the prince privately, formulating the attack on Aqaba, crossing the nefud desert, rescuing Gasim, attacking Aqaba, walking with Allenby after convincing him to take Jerusalem, bombing the Turkish railways, agreeing to take Damascus, riding with his men towards Damascus, sitting in the aftermath of a brutal battle with a turkish brigade. In all these situations, he's framed in the left looking rightwards.\n\nWhenever he's expressing displeasure or vulnerability, or conceding defeat, like being unhappy in the cartography room, being commanded to do something by his superiors, trying to convince Colonel Brighton and Prince Faisal to fight the right way, and later on trying to defend himself and convince Allenby to continue blowing up the Turkish strongholds, talking about how he was born out of wedlock riding into the anvil to save Gasim, later executing Gasim, leaving Aqaba to ride into Sinai, trying in vain to save Farraj from quicksand, trying to pass off as Arab when getting caught, suffering torture from the Turks, getting shot at by that turkish soldier. Him getting smacked by the british officer in the military hospital in Damascus and him finally leaving Arabia. In all those instances, he's framed in the right looking leftward.\n\nWhenever he's in center, like him deciding to put Daud out of his misery, him talking about how he enjoyed the execution, him weighing the options between a job back home or go back to the Arabs, him pausing  before joining in the slaughter of the Turkish brigade.\n\nI wonder if it's a cheeky in joke about Peter O'Toole being left handed.\n\nOr a psychological trick, being that the Earth spins from west to east, a direction we associate with left to right. Him going towards the left from the right is him essentially going against what is written according to him.\n\nOr a deeper commentary about how Lawrence is powerful when he embraces the contradictions of an Englishman going 'native', buying into his own hype, deciding for himself. He's weakened when he has to defend himself, his authority is questioned, he denies the contradiction and he starts to doubt himself.\n\n\n\nAll I know is, this film never ceases to amaze me\n\n",
        "upvotes": 122,
        "comments": 55,
        "media": null,
        "permalink": "/r/movies/comments/1kwrvlr/just_finished_rewatching_lawrence_of_arabia/"
    },
    {
        "id": "1kwdyva",
        "author": "diapersareforgods",
        "title": "\"What movie scene or trope do most people dismiss as unrealistic, but you know from personal experience is actually spot-on?\"",
        "content": "I’m curious — are there any moments in movies that people often call out as \"Hollywood exaggeration\" or \"totally unrealistic,\" but you've lived through something just like it?\n\n\n\nMaybe it's something as dramatic as surviving a freak accident, or as mundane as how a workplace operates. What’s a scene or trope that felt weirdly real to you because you've actually experienced it?\n\n\n\nBonus points if you can name the movie and the scene!",
        "upvotes": 1121,
        "comments": 1148,
        "media": null,
        "permalink": "/r/movies/comments/1kwdyva/what_movie_scene_or_trope_do_most_people_dismiss/"
    }
]