[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 49,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 18,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qpx47n",
        "author": "Pawssabillitysawait",
        "title": "Anyone else like the show Derry Girls?",
        "content": "For some reason i never hear anyone ever talk about this show, it is hilarious and so well written (at least in my opinion) and i absolutely adore it. It’s a spectacular comedy show and am so bummed it’s only 3 seasons!",
        "upvotes": 362,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1qpx47n/anyone_else_like_the_show_derry_girls/"
    },
    {
        "id": "1qqdp9v",
        "author": "fuckindisturbed",
        "title": "Hidden gems of Netflix",
        "content": "Netflix has a short film called if anything happens, I love you, and it completely made me cry like UGLY cry I was going to continued and watch all the empty rooms but I don’t think my heart can take all of this. There are a lot of good short films on Netflix even if you don’t want to you should watch a few they might change your outlook on life love and whatever else. Just give it a change and you’ll come out a better person. ",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qqdp9v/hidden_gems_of_netflix/"
    },
    {
        "id": "1qp894z",
        "author": "Salty_Pangolin_6163",
        "title": "Netflix Faces Backlash After Famous Climber Discloses Low Pay For 500-Meter Skyscraper Climb",
        "content": "",
        "upvotes": 1828,
        "comments": 375,
        "media": null,
        "permalink": "/r/netflix/comments/1qp894z/netflix_faces_backlash_after_famous_climber/"
    },
    {
        "id": "1qq1sdj",
        "author": "messengers1",
        "title": "'Gundam' Live-Action Pic Starring Sydney Sweeney Lands At Netflix",
        "content": "After One Piece, another well known animation IP is coming up for live action and possible as franchise if it is a hit. However, Sweeney is not really in my casting list.",
        "upvotes": 38,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1qq1sdj/gundam_liveaction_pic_starring_sydney_sweeney/"
    },
    {
        "id": "1qqdujs",
        "author": "fuckindisturbed",
        "title": "Mantis Korean movie",
        "content": "I know some people don’t like watching Korean movies or shows but I promise this one and kill boksoon are a must watch. The English dubbed is not that bad for mantis, so if you don’t want to listen to it Korean you can still enjoy it in English. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qqdujs/mantis_korean_movie/"
    },
    {
        "id": "1qpp1xi",
        "author": "AmIbi69",
        "title": "Go watch Future man",
        "content": "Great show. never hear anybody recommend it. The series follows an underachieving janitor who is called upon to save the world. It's fucking hilarious. ",
        "upvotes": 66,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1qpp1xi/go_watch_future_man/"
    },
    {
        "id": "1qq36cj",
        "author": "PrizeStructure2467",
        "title": "Manhunt osama bin laden DOCUMENTARY is Awesome.",
        "content": "it is definitely worth watching, it contain 3 episode each approx 1 hour .The emotion and Real scene is awesome as hell . Netflix mentioned that some of scene according to research recreated,but all scene they showed during operation neptune is that staged or not I can't get . definitely deserve a watch ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qq36cj/manhunt_osama_bin_laden_documentary_is_awesome/"
    },
    {
        "id": "1qq4slj",
        "author": "skibidi_i3",
        "title": "Bridgerton S4 or Cinderella?",
        "content": "Did they reallyyyyyy just copy the script of Cinderella?????  OHMYGOD what\nBridgerton Season 4 seems like a copy of Cinderella and like they didn’t even try to make some changes or what?! ",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1qq4slj/bridgerton_s4_or_cinderella/"
    },
    {
        "id": "1qq19l0",
        "author": "pjand08",
        "title": "Suggest me some good sitcoms which has seriousness at times like young sheldon",
        "content": "I’m looking for sitcom recommendations that balance humor with some real emotional depth — not just nonstop jokes, but actual character growth and meaningful relationships.\n\nSomething with a vibe similar to Young Sheldon would be perfect: light and funny on the surface, but with serious moments that hit unexpectedly hard. I really like shows where teen characters have strong bonds, especially brother–sister dynamics or a sweet, realistic teen love story that develops over time instead of feeling forced or overdramatic.\n\nSchool or family settings are a big plus. I want awkward phases, misunderstandings, growing pains, and those quiet scenes where characters actually talk about what they’re going through. Basically, comedy with a heart — where you laugh one minute and get emotionally attacked the next.It should be live action not animation.",
        "upvotes": 4,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1qq19l0/suggest_me_some_good_sitcoms_which_has/"
    },
    {
        "id": "1qq6v9n",
        "author": "TortorClassics",
        "title": "Season 4 Bridgerton",
        "content": "Watched the trailer, and I’m on season 4 episode 1 already. I find it a bit lackluster since its looking kind of a spinoff on Cinderella 🫠 but what do you think?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qq6v9n/season_4_bridgerton/"
    },
    {
        "id": "1qq6f6l",
        "author": "ChloroFluoroCarbonCC",
        "title": "Why they are not releasing Dragon ball z's 7th season?(Netflix India)",
        "content": "Every month, the new season is released on 15th but since the last season, which was in December, they didn't release the new season nor they gave update on anything. DBZ is nowhere else available in Japanese with Eng subs and now they are also not releasing. Do you guys have any update regarding this?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qq6f6l/why_they_are_not_releasing_dragon_ball_zs_7th/"
    },
    {
        "id": "1qpko3h",
        "author": "Ok_Future7107",
        "title": "finding her edge- my personal thoughts (its pretty bad but im just gonna admit it- it was a decent binge watch",
        "content": "okay so i fully agree with everyone, brayden and adriana have insane chemistry, they NEED to be endgame  \nbut im so perplexed by the persuasion parallel like i didn't even know that was part of the plot until her sister kept reading jane austen and i just searched up about the show to find out later. Truthfully, if they'd tried to do a modern adaptation of it then ending up with freddie should've felt right\n\nQuite frankly, they should've switched brayden and freddie, give brayden (as freddie's role) more screen time so it adds up to the persuasion plot. If they wanted this show to be a second chances trope it clearly backfired super hard  \nMoreover, i'm pretty sure by the public outrage s2 endgame is most likely going to be braydriana. Riley and Brayden will not work out and neither will freddie and adriana. I hope Adriana and Freddie get the closure they deserve tho\n\nI'm a huge fan of this whole figure skating romance trope. I really liked spinning out and i was super bummed when it was discontinued, i was hoping for this to be bettter\n\nPS- is there anyone who's a fan of adriana and freddie ??? bc as soon as i finished the show and opened insta- all i could see was just insane braydriana love, like yeah their chemistry was off the charts but i couldn't help but feel for the whole freddie and adriana trope too. The moments they had were more emotional and intimate otherwise. ",
        "upvotes": 6,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qpko3h/finding_her_edge_my_personal_thoughts_its_pretty/"
    },
    {
        "id": "1qpt7l7",
        "author": "Lonely-Flower-2308",
        "title": "The Residence unexplained detail.",
        "content": "So I know this show is nothing new but my wife and I just got done watching it. We really enjoyed the story and wished it was a real book series so they could continue the character. But one detail that was not explained to my recollection is \"Where did the blood in the Lincoln bedroom that Kylie Minogue found come from?\". Maybe I missed it but any answer would be appreciated. Thank you",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qpt7l7/the_residence_unexplained_detail/"
    },
    {
        "id": "1qpx2xh",
        "author": "MrGamingPerson",
        "title": "No Transfer option?",
        "content": "I just made my own Netflix account and am trying to transfer my profile from my mom's account to my new one but the \"Transfer a Profile\" option is not appearing in the settings on her account, but it is on mine. Does anyone know why that is?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qpx2xh/no_transfer_option/"
    },
    {
        "id": "1qohkbx",
        "author": "IncompleteBM",
        "title": "Which Netflix shows should’ve been cancelled earlier?",
        "content": "In contrast to the “which shows were killed too soon?” discussion.  \n\nI’ll say that:\n\n“You” - I thought it peaked at season 2. Season 3, ok fine. After that? Ridiculous. \n\n“Stranger things” - yeah, lots of hype. It’s been on way too long and is a shell of itself. \n\n“Emily in Paris” - “fun” escapist show for a couple seasons. Not sure what the point of it is now. \n\n“In the dark” - I know it wasn’t a Netflix produced show but it’s obviously had more viewership on there. It should’ve ended at season 3. \n",
        "upvotes": 434,
        "comments": 263,
        "media": null,
        "permalink": "/r/netflix/comments/1qohkbx/which_netflix_shows_shouldve_been_cancelled/"
    },
    {
        "id": "1qpcfrt",
        "author": "Different-Ice-8703",
        "title": "Is Frieren not available in English DUB/SUB on Netflix? Can anyone please comfirm?",
        "content": "It only gives two options for audio, my country's native language and Japanese and there is no option for SUB. I have never watched anime in my native language so it will take time to adjust... I really wanna watch it in Japanese with English SUB. My region is India btw so if anyone from India can check for me, I would be grateful. Also, the anime was released in 2023 so it feels weird that there is no SUB...",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qpcfrt/is_frieren_not_available_in_english_dubsub_on/"
    },
    {
        "id": "1qpmskr",
        "author": "Senior_Bison_4647",
        "title": "Question about His and Hers? [spoiler]",
        "content": "!Spoiler!\n\nI don’t understand why Catherine Kelly would be motivated to kill Anna if they were in the same position? Or even, if she intended to kill her? ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qpmskr/question_about_his_and_hers_spoiler/"
    },
    {
        "id": "1qq6dfj",
        "author": "FantasticAd9478",
        "title": "Netflix Faces Backlash After Famous Climber Discloses Low Pay For 500-Meter Skyscraper Climb",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qq6dfj/netflix_faces_backlash_after_famous_climber/"
    },
    {
        "id": "1qopzzl",
        "author": "No-Description-2138",
        "title": "‘Star Search’ Fails To Break Through For Netflix",
        "content": "",
        "upvotes": 140,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1qopzzl/star_search_fails_to_break_through_for_netflix/"
    },
    {
        "id": "1qpgprz",
        "author": "Aggressive_West6616",
        "title": "A question about 11.22.63 (SPOILER)",
        "content": "\\&gt;!When Al goes into the worm hole, stays for two years, then reappears with cancer, I understand how he has cancer since he (and he alone) has aged two years and got cancer, even though the rest of the world has only aged two minutes.  I get that.\n\nBut, when Jake goes into the worm hole the first time for just a couple of minutes (where he carves his initials into the tree), shouldn't that have reset the rest of the world, including Al aging two years (and getting cancer)?!&lt;",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qpgprz/a_question_about_112263_spoiler/"
    },
    {
        "id": "1qpncui",
        "author": "skelly_gurl12",
        "title": "This hansel and gretal story, they give “siblings or dating”",
        "content": "The show, “A tale of dark and grim” is a take on hansel and gretal fairytale. They have a very good sibling relationship but it’s a little weird… I mean one episode they fall asleep holding hands, i get it they have a good relationship but it’s something… those who have watched it, what’s your opinion on it? it is a kids show but it is a very interesting take on hansel and gretal and interesting to say the least",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qpncui/this_hansel_and_gretal_story_they_give_siblings/"
    },
    {
        "id": "1qolg2p",
        "author": "cheno103",
        "title": "Love on the Spectrum quietly renewed for 5th season as producers make 3 big changes to Netflix reality show",
        "content": "",
        "upvotes": 127,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qolg2p/love_on_the_spectrum_quietly_renewed_for_5th/"
    },
    {
        "id": "1qp09fk",
        "author": "MediocrePiece1267",
        "title": "Getting surgery next week and need a new series to binge.",
        "content": "What’s the last show you couldn’t stop watching? \n\nFor me, the two that come to mind are Breaking Bad and Better Call Saul. Ozark was great- just third tier compared to these two. \n\nWhat do you suggest?",
        "upvotes": 19,
        "comments": 92,
        "media": null,
        "permalink": "/r/netflix/comments/1qp09fk/getting_surgery_next_week_and_need_a_new_series/"
    },
    {
        "id": "1qoewi2",
        "author": "Deep20779",
        "title": "Which Netflix shows got cancelled way too early and were seriously underrated?",
        "content": "Netflix cancels a lot of stuff, but some shows really didn’t deserve it.\n\nFor me, it’s Locke &amp; Key — great concept, solid world-building, and it felt like it still had so much story left to tell.\n\nCurious what everyone else thinks — which cancelled Netflix show do you think was underrated and ended too soon?",
        "upvotes": 205,
        "comments": 786,
        "media": null,
        "permalink": "/r/netflix/comments/1qoewi2/which_netflix_shows_got_cancelled_way_too_early/"
    },
    {
        "id": "1qpi9ji",
        "author": "HecticJones",
        "title": "William Oldroyd's idea for (unlikely) His &amp; Hers s2",
        "content": "\"The question I have is, 'Where do you pick it up from?' \\[...\\] For me, It’s like, \\[...\\] 'Do you want to just start from a position which is further down the line and she’s sitting with it, and it’s still there, and she knows the truth, see how it plays out with her relationship with her mother after that?'\" - [full quote](https://www.thepopverse.com/tv-his-and-hers-season-2-william-oldroyd-jon-bernthal-tessa-thompson-alice-feeney)",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qpi9ji/william_oldroyds_idea_for_unlikely_his_hers_s2/"
    },
    {
        "id": "1qphdt3",
        "author": "happysquid14",
        "title": "What do you think of Seven Dials?",
        "content": "Personally, I enjoyed it up to its third episode, but I hated its ending. It felt like a lot of solid setup that was completely wrecked with a nonsensical, almost Marvel-esque moment at the end. Seeing good actors like Helena Bonham Carter deliver inane forced-emotional dialogue is just painful to watch. ",
        "upvotes": 0,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1qphdt3/what_do_you_think_of_seven_dials/"
    },
    {
        "id": "1qopf7k",
        "author": "No-Description-2138",
        "title": "Alex Honnold's Taipei 101 Climb Attracts 6.2M Views On Netflix",
        "content": "",
        "upvotes": 44,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1qopf7k/alex_honnolds_taipei_101_climb_attracts_62m_views/"
    },
    {
        "id": "1qol58c",
        "author": "Lucariusssss96",
        "title": "What do you think of The OA?",
        "content": "I’ve always wanted to watch this show but I know that it’s been discontinued. \n\nIs it still worth watching despite it being cancelled?\n\nHow did you feel after watching the show? Do you think it’s life changing?? ",
        "upvotes": 46,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1qol58c/what_do_you_think_of_the_oa/"
    }
]