[
    {
        "id": "1l352bo",
        "author": "IanAndRoss",
        "title": "Hi /r/movies! We're Ian Spendloff and Ross Wilkinson, the VFX team who brought Mr. Ring-A-Ding to life in Doctor Who Season 2: Lux. Other credits include Avengers: Infinity War, Ms. Marvel, The Marvels, Avatar: The Last Airbender, Black Mirror, and much more. Ask us anything!",
        "content": "Hey r/movies!\n\nWe're Ian Spendloff (Creative Director and Character Designer) and Ross Wilkinson (VFX Supervisor), the Framestore team who brought Mr. Ring-A-Ding to life in Doctor Who Season 2: Lux, from concept and design through to final pixel. Ian is an Emmy winner for his animated sequences on Ms. Marvel, and has also created standout work The Marvels, and the iconic Beats Pills campaign. Ross has worked on Avatar: The Last Airbender (S1) and Avengers: Infinity War. Ask us anything! \n\nWe’ll be back tomorrow (Wednesday 06/04) at 15:00 PM ET to answer your questions. Please feel free to ask away in the meantime.\n\nMore information:\n\nLed by Emmy-winning Creative Director Ian Spendloff and VFX Supervisor Ross Wilkinson, Framestore designed and animated Mr. Ring-A-Ding for Doctor Who Season 2: Lux, supported with visualisation by Framestore Preproduction Services (FPS).\n\nCrafted entirely in the UK, the team took the character from initial concept, design and previs, through to final pixel. Mr. Ring-A-Ding evolves over the episode, starting as a classic 1930s hand-drawn, frame-by-frame animation and transforming into a gruesome and realistic modern 3D character, seamlessly integrated into live-action footage.\n\nBehind-the-scenes \n\n[https://www.youtube.com/watch?v=5xuI5jP-xZQ](https://www.youtube.com/watch?v=5xuI5jP-xZQ)\n\nBios:\n\n**Ian** \\- Ian Spendloff is a highly experienced Director, Art Director and Designer, with a particular focus on character led projects. He has created concepts, narratives, characters &amp; creatures for a host of thrilling projects, spanning advertising, series and immersive entertainment.\n\nIan’s latest major project was a multi-million pound, fully CG theme park dark ride ‘Pearl Quest’, created for China’s Wanda Group. Framestore were lucky enough to be granted full directorial &amp; creative control of the project, which allowed  Ian’s talent in re-imagining a classic Chinese folklore to shine out over eleven large- scale installation screens. The project attracted a VES nomination for “Outstanding Visual Effects in a Special Venue Project”    \n\nIan was instrumental in the making of Tooned, an animated series crafted by Framestore in partnership with Formula 1 giant McLaren. Tooned was highly praised, winning the Gold Clio, Eurobest and Lovie Awards, with the special edition Tooned 50 landing Ian a place in the D&amp;AD book.\n\nIan also drove the iconic ‘Beats by Dre’ campaigns, providing the early concepts for the Pill characters right through to the animation. Ian has a  passion for capturing personality in his work, and a natural ability to add humour, emotion &amp; visual depth to any project, regardless of platform.\n\n**Ross** \\- Ross gained his first experience into visual effects during a modelling internship at Framestore in 2008. After a ten year stint at DNEG, he returned to Framestore in 2022 as a VFX Supervisor.\n\nRoss’s keen eye for detail has seen him work on a variety of projects spanning film, episodic and advertising. From Marvel Studios’ box-office smashing Avengers: Infinity War to season five of Black Mirror, as well as visits to the Wizarding World and The Hunger Games franchises. \n\nMore recently, Ross completed work on BBC documentary series Dinosaurs: The Final Day, with Sir David Attenborough. The documentary follows the final days of non-avian dinosaurs through the Cretaceous–Paleogene extinction event, and was a career highlight for Ross. \n\nAsk us anything! Back at 3 PM ET today to answer your questions.",
        "upvotes": 43,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/08a8t9mmsw4f1.jpeg?auto=webp&amp;s=583ce97a65cd1549ae11f9965aa830fec626217f"
        },
        "permalink": "/r/movies/comments/1l352bo/hi_rmovies_were_ian_spendloff_and_ross_wilkinson/"
    },
    {
        "id": "1l2wgrp",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Dan Trachtenberg - Thursday 6/5 at 11:45 AM ET - Director of 'Prey', '10 Cloverfield Lane' and the upcoming 'Predator: Killer of Killers' and 'Predator: Badlands' (starring Elle Fanning). He's also directed episodes of 'The Boys', 'Black Mirror', and 'Stranger Things'.",
        "content": "",
        "upvotes": 16,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uu2jh4677u4f1.png?auto=webp&amp;s=e9ee9b07a6dc00b32d921c57eb73e89aedcb3b61"
        },
        "permalink": "/r/movies/comments/1l2wgrp/amaqa_announcement_dan_trachtenberg_thursday_65/"
    },
    {
        "id": "1l35pkg",
        "author": "PM_Peartree",
        "title": "What ever happened to Liv Tyler? Her career seemed on a high after The Lord of the Rings and then, KAPUTT.",
        "content": "The only big thing she seemed to do in movies after the Tolkien trilogy was The Strangers which did well at the box-office but didn't appear to help Tyler's career out all that much. Jersey Girl flopped and The Incredible Hulk was the rare MCU under-performer. \n\nI remember Liv Tyler was like the next big thing: Armaggedon, Stealing Beauty, The Lord of the Rings, the Aerosmith music videos, she was everywhere. Just to give you an idea of how popular she was, her role as Arwen wasn't that big yet she always had her face in the movies' posters which shows how much of a star she was.",
        "upvotes": 1684,
        "comments": 665,
        "media": null,
        "permalink": "/r/movies/comments/1l35pkg/what_ever_happened_to_liv_tyler_her_career_seemed/"
    },
    {
        "id": "1l2qrut",
        "author": "StevenSanders90210",
        "title": "Warner Bros. Discovery Shareholders Vote Against CEO David Zaslav’s $52 Million Pay Package in a Symbolic Rebuke",
        "content": "",
        "upvotes": 25074,
        "comments": 591,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kYPVbW6t3_p5_6jXp0jNeAz-jU6IAcC3eMGrjENBOJY.jpg?auto=webp&amp;s=6ca8a5bd06ac43abcf15e80364113078b177ef4a"
        },
        "permalink": "/r/movies/comments/1l2qrut/warner_bros_discovery_shareholders_vote_against/"
    },
    {
        "id": "1l36lvt",
        "author": "jimmyhoffasbrother",
        "title": "AMC to show even more ads in its theaters before the actual movie",
        "content": "",
        "upvotes": 798,
        "comments": 326,
        "media": null,
        "permalink": "/r/movies/comments/1l36lvt/amc_to_show_even_more_ads_in_its_theaters_before/"
    },
    {
        "id": "1l37fpl",
        "author": "ChiefLeef22",
        "title": "Everyone In Hollywood Is Already Using AI (And Hiding It) | Lionsgate’s vice-chairman Michael Burns talks about how they’re considering using AI to change existing films into being more kid-friendly or animated",
        "content": "",
        "upvotes": 519,
        "comments": 247,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nS0mOMXy8Cka3UB_2zBwOYgEuLT02s56h9cYVsttyY8.jpg?auto=webp&amp;s=13597d65e17721356d05d6e885205ad18673fcf2"
        },
        "permalink": "/r/movies/comments/1l37fpl/everyone_in_hollywood_is_already_using_ai_and/"
    },
    {
        "id": "1l36ymg",
        "author": "akbanx",
        "title": "Hollywood Has Left LA",
        "content": "Worthwhile read for anyone working in the film industry or curious as to what has been going on with the lack of film production across the United States — and why so few movies and TV shows are able to film on location in Los Angeles. A lot of people are aware of this, but production across the US is at historically low levels, and this article addresses why this is happening. I’ll post a paywall free link in the comments! ",
        "upvotes": 543,
        "comments": 153,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mJ44CMGGbyPIcxn3Pi68aR9Qjv3jsLRfhxcKCzyueFw.jpg?auto=webp&amp;s=719ed469cebdb38a31ec67a6bee2ac50da0ffb4b"
        },
        "permalink": "/r/movies/comments/1l36ymg/hollywood_has_left_la/"
    },
    {
        "id": "1l37svw",
        "author": "Comic_Book_Reader",
        "title": "New poster for Wicked: For Good.",
        "content": "",
        "upvotes": 272,
        "comments": 132,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5pqi5rmhdx4f1.jpeg?auto=webp&amp;s=146b4a7a75b5c2b9935cb38fb5a28ef6f51f6cee"
        },
        "permalink": "/r/movies/comments/1l37svw/new_poster_for_wicked_for_good/"
    },
    {
        "id": "1l34zfe",
        "author": "MarvelsGrantMan136",
        "title": "New Character Posters for Danny Boyle's '28 Years Later'",
        "content": "",
        "upvotes": 312,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q4nl1rp5sw4f1.jpeg?auto=webp&amp;s=a8f80104d9848b2da8b85a90789ce92080667e7e"
        },
        "permalink": "/r/movies/comments/1l34zfe/new_character_posters_for_danny_boyles_28_years/"
    },
    {
        "id": "1l2bf2c",
        "author": "KevinSmithAMA",
        "title": "Hey reddit, I'm Kevin Smith. I got the rights back to Dogma and I'm putting it out in theaters for a limited time for its 25th Anniversary starting Thursday June 5th. Ask me anything!",
        "content": "Hey reddit, I'm Kevin Smith. I got the rights back to Dogma and I'm putting it out in theaters for a limited time for its 25th Anniversary starting Thursday June 5th. Ask me anything!\n\nGive me your questions!!!\n\nDogma 25th anniversary trailer:\n\n[https://www.youtube.com/watch?v=rwSRribTgdA&amp;ab\\_channel=KevinSmith](https://www.youtube.com/watch?v=rwSRribTgdA&amp;ab_channel=KevinSmith)\n\nSynopsis:\n\nTwo fallen angels who were ejected from paradise find themselves banned in Wisconsin. They are now headed for New Jersey where they find a loophole that can get them back into heaven. The only catch is that it will destroy humanity. A group bands together to stop them.\n\nCast:\n\n* Ben Affleck\n* Matt Damon\n* Linda Fiorentino\n* Salma Hayek\n* Jason Lee\n* Jason Mewes\n* Alan Rickman\n* Chris Rock\n* Kevin Smith\n* George Carlin\n* Bud Cort\n* Alanis Morissette\n* Janeane Garfolo\n\nBack out in theaters starting June 5th.\n\nAsk me anything reddit. Back at 5 PM ET to chat with you all.\n\nOther/Bio:\n\nKevin Smith has been saying silly cinematic shit since 1994’s Clerks. He almost dropped dead of a massive heart attack in 2018 but then lived to make more useless media that only he loves. He also convinced someone to marry him and make him a Dad. Catch Dogma in theaters (again) starting June 5th.\n\nKevin Smith has directed Clerks I, II, III, Mallrats, Chasing Amy, Jay and Silent Bob Strike Back, Jersey Girl, Zack and Miri Make a Porno, Cop Out, Red State, Tusk, Yoga Hosers, Jay and Silent Bob Reboot, The 4:30 Movie.  \n\n",
        "upvotes": 42655,
        "comments": 4085,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tnp4rodpnp4f1.png?auto=webp&amp;s=75af3e3dfecc7684022d98c22cdca16af4fdc94d"
        },
        "permalink": "/r/movies/comments/1l2bf2c/hey_reddit_im_kevin_smith_i_got_the_rights_back/"
    },
    {
        "id": "1l2mvff",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Fantastic Four: First Steps'",
        "content": "",
        "upvotes": 2732,
        "comments": 915,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wbn928kwxr4f1.jpeg?auto=webp&amp;s=c041c3be286c48f6b9e7986a7038b3830acd9dc3"
        },
        "permalink": "/r/movies/comments/1l2mvff/new_poster_for_the_fantastic_four_first_steps/"
    },
    {
        "id": "1l2k5gq",
        "author": "discofro6",
        "title": "Movies that have an actor's (on-screen) \"last words\"?",
        "content": "This was inspired by the late great Robin Williams. His final on-screen role before his passing was in Night at the Museum 3. His final line as Teddy Roosevelt also ended up being his final words as an actor on-screen: *\"Smile, my boy. It's sunrise.\"*\n\nThat made me wonder; what are some movies where an actor ended up delivering their last words in it? i.e. what was the very last movie they made before they passed or retired. And if any of their final words feel as poignant as Robin Williams's",
        "upvotes": 3175,
        "comments": 477,
        "media": null,
        "permalink": "/r/movies/comments/1l2k5gq/movies_that_have_an_actors_onscreen_last_words/"
    },
    {
        "id": "1l2y9dj",
        "author": "fir_trader",
        "title": "Inception, was it all a dream? Don't look at the top, look at the children",
        "content": "I was randomly thinking about Inception today and am 99% confident the entire movie is a dream. While different actors, the clothing worn by his children in both the flashback and the end of the movie are nearly identical in addition to their location in the backyard. The girl is wearing a pink dress in the flashback and subsequently is wearing a pink dress over a white t-shirt. Similarly the boy is wearing a plaid shirt with shorts in both scenes. After not seeing his kids for \\~2 years, the chance that his kids are wearing nearly the same outfit and are in the same location in the backyard is nearly impossible.\n\nWith most directors I think you can let this slide, but Chris Nolan is particular about every detail of his movies. This was an intentional choice that is unlikely to happen in reality.\n\nPs. I think the totem was always a red herring and constructed to give the dreamer the outcome they want.",
        "upvotes": 356,
        "comments": 238,
        "media": null,
        "permalink": "/r/movies/comments/1l2y9dj/inception_was_it_all_a_dream_dont_look_at_the_top/"
    },
    {
        "id": "1l39hca",
        "author": "throw0101a",
        "title": "John Candy Documentary 'I Like Me' to Open 2025 Toronto Film Festival",
        "content": "",
        "upvotes": 52,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Ko5W0AQTXQVoe9o_cnEr3JmYTO-49xVuYOw2mIm7fwE.jpg?auto=webp&amp;s=aefb7d0cf4462935c27ff453b143122a97a37d10"
        },
        "permalink": "/r/movies/comments/1l39hca/john_candy_documentary_i_like_me_to_open_2025/"
    },
    {
        "id": "1l2rssv",
        "author": "rasslingrob",
        "title": "Jim Carrey Effect",
        "content": "Everybody knows about Jim Carrey amassing three Number One films in the same year with **Ace Ventura: Pet Detective**, **The Mask**, and **Dumb and Dumber**. But has there been anyone else to achieve this feat since, or manage to top it with four or more? The thought just popped in my head while rewatching two of those three.",
        "upvotes": 718,
        "comments": 404,
        "media": null,
        "permalink": "/r/movies/comments/1l2rssv/jim_carrey_effect/"
    },
    {
        "id": "1l3890n",
        "author": "XumaOutIslander",
        "title": "Blade Runner – am I watching the same movie?",
        "content": "I rewatched Blade Runner recently, and I couldn’t get over the feeling that I was watching a very different film. It wasn’t that it was the latest in the umpteen cuts that have been released. And I hadn’t just forgotten the plot over the years. What got me for the first time was I wasn’t so sure Deckard was the good guy. Not even an antihero.\n\n&gt;!This growing unease really took root when Deckard kills Zhora. It brought to mind “Han Shot First”, but in this case there was no ambiguity. Deckard went to the nightclub with the intent of killing this woman and proceeded to do so by shooting her in the back as she tries to flee.!&lt;\n\n&gt;!I’m sitting upright and squinting at the screen trying to process this, when things go from bad to worse. In his apartment, Deckard is making unwanted advances as Rachel gets increasingly upset. She tries to leave, and he won’t let her, and then he proceeds to force himself on her. And I begin to feel insane. This is rape, but it never once occurred to me until that moment.!&lt;\n\n&gt;!The hits keep coming. When Pris is in her death throes it’s not just disturbing, it’s sad. All these replicants wanted was to live. They’re fighting to survive. And this culminates when Roy saves Deckard’s life when he had absolutely every reason to let him fall to his death. Was Roy the hero all along? Trying to save his friends and then proceeding to spare his nemesis’ life?!&lt;\n\nSo after I pull myself together, I do some digging. There are number of discussions out there on the very topic of Deckard’s character, including a piece by Eric Haywood, who had an extremely similar take. Has anyone else had this 180 experience? And if so, why? Is Blade Runner a litmus test for us and the world at large?\n\nI still believe it’s an amazing film. It’s aged certainly, but it has aged well. Matured into something that is still thought provoking and relevant. Just a bit more upsetting than I remembered.",
        "upvotes": 45,
        "comments": 146,
        "media": null,
        "permalink": "/r/movies/comments/1l3890n/blade_runner_am_i_watching_the_same_movie/"
    },
    {
        "id": "1l2fia4",
        "author": "MarvelsGrantMan136",
        "title": "New Character Posters for 'Superman'",
        "content": "",
        "upvotes": 2382,
        "comments": 582,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nqmzlsryhq4f1.jpeg?auto=webp&amp;s=a3451ed4fd39d8e7dd9ad56e78dfe11ac1236a4f"
        },
        "permalink": "/r/movies/comments/1l2fia4/new_character_posters_for_superman/"
    },
    {
        "id": "1l38jt9",
        "author": "NoCulture3505",
        "title": "Russell Crowe, Jacob Tremblay, Shailene Woodley &amp; Annabelle Wallis To Star In Ted Kaczynski Thriller ‘Unabom’; Janus Metz Directing For Netflix",
        "content": "",
        "upvotes": 29,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OQyuJNsLNc9eK6Uu3o5MtgSEmKrdGhHo_BdXRhHaMjY.jpg?auto=webp&amp;s=fdb476502616136219e76314b1211e7138360fce"
        },
        "permalink": "/r/movies/comments/1l38jt9/russell_crowe_jacob_tremblay_shailene_woodley/"
    },
    {
        "id": "1l292ud",
        "author": "TimbukNine",
        "title": "Which romance movies fail the “Devito test”?",
        "content": "I recently discovered the DeVito test where questionable romantic gestures by the lead are seen as favourable if played by a handsome lead but would be very dubious if done in real life. Apparently a good test is to replace the lead with Danny DeVito and if it’s still funny and charming then it’s not creepy.\n\nWhich romance movies would you say fail the DeVito test?\n\nEdit: to fix typos where I can.",
        "upvotes": 4222,
        "comments": 767,
        "media": null,
        "permalink": "/r/movies/comments/1l292ud/which_romance_movies_fail_the_devito_test/"
    },
    {
        "id": "1l3abba",
        "author": "BunyipPouch",
        "title": "First Image from Andy Serkis' George Orwell Adaptation 'Animal Farm' - Starring Seth Rogen, Steve Buscemi, Kieran Culkin, Woody Harrelson, Glenn Close, Andy Serkis, Gaten Matarazzo, Kathleen Turner, Laverne Cox, Jim Parsons, Iman Vellani.",
        "content": "",
        "upvotes": 18,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/neaqyoepux4f1.jpeg?auto=webp&amp;s=eb511b23a8c99ee0ff9871d8b83bd0345a50c53c"
        },
        "permalink": "/r/movies/comments/1l3abba/first_image_from_andy_serkis_george_orwell/"
    },
    {
        "id": "1l2n5pk",
        "author": "Cartmantor1",
        "title": "Is there a REMAKE of a movie you think is BETTER than the ORIGINAL?",
        "content": "I am one of those people who felt that the remakes of the Night of the Living Dead (1990) was better than the original in certain respects. \n\nI also think the remake of The Crazies was better than the original as well. Does anyone else have a remake they feel might have overall superior to the original? Writing? Acting? Directing?",
        "upvotes": 487,
        "comments": 1493,
        "media": null,
        "permalink": "/r/movies/comments/1l2n5pk/is_there_a_remake_of_a_movie_you_think_is_better/"
    },
    {
        "id": "1l32ztg",
        "author": "cxjoshuax21x",
        "title": "Amazon Prime does not have subtitles for some movies that are natively in English, but have dialogue in other languages. Wtf Amazon?",
        "content": "I am making my way through the Mission Impossible franchise for the first time and get to Mission Impossible 4. Early in the movie there are several short sequences of characters speaking Russian. There are no subtitles which I found odd, I dig through the settings, turn subtitles and captioning on, all with no success. All closed captioning offers me is \"characters speaking in Russian'. These were short little exchanges so I figured they just made the movie that way. Weird but whatever. About an hour later a full 5 minute conversation is happening in Russian and I realize no way they actually just made this without subtitles. I dig through the settings and options again with no success. I started doing some googling and found THIS IS A KNOWN ISSUE. Some titles don't have subtitles for other languages so you just are not allowed to understand the dialogue if you watch on Prime I guess? I switched to paramount plus, went to those sequences, and there were my missing subtitles. Didn't even have to go into the settings. Amazon, Bezos, seriously? Now I will only ever watch on Prime if it's my only option. Making it to where the viewer can not understand necessary dialogue is totally unacceptable.",
        "upvotes": 30,
        "comments": 40,
        "media": null,
        "permalink": "/r/movies/comments/1l32ztg/amazon_prime_does_not_have_subtitles_for_some/"
    },
    {
        "id": "1l35sha",
        "author": "LetMeExplainDis",
        "title": "What are some examples of villains being uncharacteristically nice or heroic?",
        "content": "My favorite moment is near the end of Harry Potter and the Deathly Hallows: Part 2 when Voldemort just lets Neville give his side a pep-talk, even after the kid publicly rebuffed him. Turns out the evil Dark Lord is surprisingly gracious in victory.\n\nWhat are some other ones you can think of? Bonus points if it has no actual effect on the plot. ",
        "upvotes": 20,
        "comments": 79,
        "media": null,
        "permalink": "/r/movies/comments/1l35sha/what_are_some_examples_of_villains_being/"
    },
    {
        "id": "1l21lsx",
        "author": "LushCharm91",
        "title": "Michael B. Jordan Did the Impossible. In an era of mounting crises, the Sinners star got people off their couches and into cinemas for an original film.",
        "content": "",
        "upvotes": 17798,
        "comments": 969,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wcXRJj7cIeRFbKMFyuylBUbCAol2ZyIW7RVkTBfRmC4.jpg?auto=webp&amp;s=e22bf27a77dbadd971bdf58fe8bbe584d0d5e092"
        },
        "permalink": "/r/movies/comments/1l21lsx/michael_b_jordan_did_the_impossible_in_an_era_of/"
    },
    {
        "id": "1l2gk26",
        "author": "indiewire",
        "title": "Scarlett Johansson Is Glad She Was a Fangirl in Front of Steven Spielberg: Says That She Might Not Have Been Cast in ‘Jurassic World: Rebirth’ Otherwise",
        "content": "",
        "upvotes": 846,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zzf-dqN90Kbi6SMajMjdo3ylyaIzr7slNDt8X9JuJso.jpg?auto=webp&amp;s=d6b3fac6b963136795d301129606f8eb0c801f0a"
        },
        "permalink": "/r/movies/comments/1l2gk26/scarlett_johansson_is_glad_she_was_a_fangirl_in/"
    },
    {
        "id": "1l2f2eh",
        "author": "lawrencedun2002",
        "title": "First Image of Miranda Cosgrove and Pierson Fodé in The Wrong Paris - The film follows a woman desperate to get to France talks herself into a reality dating show set in Paris. Only to discover the show is actually in Paris, Texas. Premiering September 12.",
        "content": "",
        "upvotes": 783,
        "comments": 120,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8hx5yoxueq4f1.jpeg?auto=webp&amp;s=c9e3f76ae6f0338e368a0aa98fc0ccb7c6d82aaf"
        },
        "permalink": "/r/movies/comments/1l2f2eh/first_image_of_miranda_cosgrove_and_pierson_fodé/"
    },
    {
        "id": "1l36n7a",
        "author": "AdConstant9383",
        "title": "I love when a movie completely catches you off guard in the best way",
        "content": "Had one of those nights where I wasn’t really in the mood to watch anything serious, so I just threw on The Invitation kind of randomly. Figured I’d half-watch it while scrolling  but nope, it completely pulled me in. Super tense and quietly creepy in the best way.\n\nSame thing happened with Coherence a while back. Low-budget, no big names, but I was glued to the screen. And The Vast of Night too such a slow, eerie build that totally worked.\n\nI kind of love when this happens. You don’t expect much, then suddenly you’re like “Why doesn’t everyone talk about this?” Curious if others have had this experience. What’s a movie that completely caught you off guard in a good way?",
        "upvotes": 14,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1l36n7a/i_love_when_a_movie_completely_catches_you_off/"
    },
    {
        "id": "1l2mkhj",
        "author": "PM_Peartree",
        "title": "Which movie stars have lied about their age?",
        "content": "After her death, it was revealed that Tanya Roberts had shaved like 6 or 7 years off her age.\n\nFor years, Katharine Hepburn claimed to be born in 1909. Turns out she was two years older than that. She was born in 1907. \n\nIt's also been long rumored that Donna Mills was born in 1938, not 1940.\n\nAnd remember when Jessica Chastain claimed to be born in 1981 but her former classmate, the deceased Mandisa, outed her as being 4 years older. She was born in 1977.",
        "upvotes": 259,
        "comments": 205,
        "media": null,
        "permalink": "/r/movies/comments/1l2mkhj/which_movie_stars_have_lied_about_their_age/"
    },
    {
        "id": "1l321oh",
        "author": "Special-Tiger2818",
        "title": "my old ass",
        "content": "i’m SOOO late to the party but i just watched this movie tonight. i had so many emotions throughout and i think this is one of the best movies ive ever watched honestly. being a 22 year old girl and never forgiving myself for my past, making so many mistakes and wishing i could take them back, living with so much regret and fear. this movie definitely gave me a lesson that everything you go through, everyone you meet, is your fate and it’s transforming you into who you are no matter how terrible it feels in the moment. UGH. so good!!! 😭\n\nALSO MY OLD ASS IS THE TITLE OF THE MOVIE!!!! IM NOT TALKING ABOUT MYSELF LMAO ",
        "upvotes": 18,
        "comments": 38,
        "media": null,
        "permalink": "/r/movies/comments/1l321oh/my_old_ass/"
    },
    {
        "id": "1l2tow5",
        "author": "tacoreddit",
        "title": "First Poster for Eminem documentary, Stans, coming to Paramount+ in Summer",
        "content": "",
        "upvotes": 72,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/710v316ugt4f1.jpeg?auto=webp&amp;s=6f534ab57c2773bc31addc4496426241ebab6b76"
        },
        "permalink": "/r/movies/comments/1l2tow5/first_poster_for_eminem_documentary_stans_coming/"
    },
    {
        "id": "1l37w2t",
        "author": "DemiFiendRSA",
        "title": "‘Monster High’ Live-Action Movie Taps ‘M3GAN’ Director Gerard Johnstone",
        "content": "",
        "upvotes": 5,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hdcQ7MP4sEr8Fng0KIn8DCVawafC9Zj0ATBeJtdTSsY.jpg?auto=webp&amp;s=651d765fb5487226579c5f62603928a172f3b890"
        },
        "permalink": "/r/movies/comments/1l37w2t/monster_high_liveaction_movie_taps_m3gan_director/"
    },
    {
        "id": "1l39amz",
        "author": "Comic_Book_Reader",
        "title": "THE LIFE OF CHUCK - Official Trailer #2 - In Select Theaters 6.6, Everywhere 6.13",
        "content": "&gt;From the hearts and minds of Stephen King and Mike Flanagan comes THE LIFE OF CHUCK, the extraordinary story of an ordinary man. This unforgettable, genre-bending tale celebrates the life of Charles 'Chuck' Krantz as he experiences the wonder of love, the heartbreak of loss, and the multitudes contained in all of us. ",
        "upvotes": 5,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tdOUE27MuJ-P9Qxicwc7PasQp9g0RfQJmvNrMYTLz8Y.jpg?auto=webp&amp;s=6ba2f7766b0a870d77b7e1d68fa5f16a54b11005"
        },
        "permalink": "/r/movies/comments/1l39amz/the_life_of_chuck_official_trailer_2_in_select/"
    }
]