[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1mafs6p",
        "author": "Independent_Dingo904",
        "title": "Acquisto alloggio a Torino",
        "content": "Buongiorno a tutti,\na breve le mie due figlie si trasferiranno a Torino per studio e anche io mi trovo allo prese con la ricerca di una sistemazione abitativa.\nAvendo altri due loro amici con la stessa necessità  stanno cercando una casa in affitto ma, viste le cifre richieste, stiamo valutando l'acquiato di un appartamento da destinare poi all'affitto, una volta che avranno ultimato gli studi\nche frequenteranno a  Palazzo Nuovo e al Campus Einaudi.In zona ho trovato davvero poco in vendita e a prezzi elevati Valuterei quindi, ebeo, di allontanarmi, rimanendo in zone ben collegate e, per quanto possibile, soprattutto vivibili in termini di sicurezza.Quali consigli potete darmi? Grazie in anticipo ",
        "upvotes": 3,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1mafs6p/acquisto_alloggio_a_torino/"
    },
    {
        "id": "1m9x1g0",
        "author": "spacecraft628",
        "title": "Arriva la più grande sala giochi anni ‘80 d’Italia!",
        "content": "https://preview.redd.it/1h0py452s8ff1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=f677be94d7de3200389eaee3a7cfbac90d877f61\n\nA settembre, a Grugliasco (TO), ci sarà la più grande sala giochi anni '80: grazie alla partnership con Arcade Story si troveranno un centinaio di cabinati originali, console vintage, flipper, air hockey, calciobalilla e per esagerare anche una mostra di giocattoli e Lego anni ’80.\n\nSi paga l'ingresso, ma il gioco è completamente libero. Domani finisce la promozione dei biglietti.\n\nNel parco fuori ci sarà anche un mercatino a tema anni ’80, con musica, cosplay, collezionisti e intrattenimento.\n\nSuper consigliato ad appassionati di retrogaming e anni '80 in generale!",
        "upvotes": 32,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1m9x1g0/arriva_la_più_grande_sala_giochi_anni_80_ditalia/"
    },
    {
        "id": "1m9t4nc",
        "author": "melkijades",
        "title": "Mi hanno derubato in palestra Orange/I was robbed in the Orange gym (Via Nizza)",
        "content": "Ciao! I’m a foreigner temporarily living and working in Torino since 2024. About 6 months ago, I joined the Orange Nizza gym. I’ve always used the same corner of the locker room, where I usually lock my stuff.\n\nLast night, around 22:45, I went to the gym for a short workout. When I returned to the lockers on the second floor, my bag was gone. I searched nearby and checked other lockers, but it was not there. The bag contained my clothes, house keys, and wallet. Inside the wallet were my ID, driver’s license, and credit cards. All gone. The keys of my house as well (tonight I slept in a hotel, and this was almost impossible to get without any documents on me).\n\nI immediately informed the young man at the reception, but he showed no concern. He told me, *“Come back tomorrow morning.... If it’s not there, then you call the police.”* He also said, *“Maybe someone kicked it by accident. Check around the gym. Wait for the cleaning lady in the morning to see if she finds it...”* He was clearly watching the clock, more focused on closing the gym than helping me.\n\nI asked about the security cameras (the gym has many inside and outside!) but he said he couldn’t check them without a police request and insisted I return the next day. I was speechless!\n\nAnd here is the 2nd part:\n\nI immediately blocked my credit cards and went to the nearest police  (Carabinieri office). When I arrived, the officer told me I’d have to wait 3–4 hours. Just then, I got a notification from my bank app that someone was trying to use my card at a specific store. I found the store on Google Maps and urgently showed it to the officer, saying, *“They’re trying to steal my money right now....can we please go there quickly?”*\n\nHe simply pointed to the waiting room and repeated: *“You’ll have to wait 3–4 hours.”*\n\nI was in disbelief. I had always thought that the Carabinieri were the “serious” police who deal with crime. LOL. But in this case, the officer showed no urgency or interest.\n\nAfter a few hours, I finally gave my statement and received a report in paper and that was it.\n\nNo follow-up. Nothing.\n\nI’ll replace my credit cards, and I don’t care about the clothes. But I’m deeply worried about my documents, some of them are really sensitive... for example my driver’s license, which was issued in the country where I previously studied. Replacing it would take me a lot of time and a lot of money, and I need to drive in the meantime!\n\nDoes anybody have advice on what to do in this situation?",
        "upvotes": 49,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1m9t4nc/mi_hanno_derubato_in_palestra_orangei_was_robbed/"
    },
    {
        "id": "1m9uhk9",
        "author": "Dqrank",
        "title": "Rave oggi? (26/07)| Rave today",
        "content": "\nQualche raccomandazioni?\n\nAny recommendations? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1m9uhk9/rave_oggi_2607_rave_today/"
    },
    {
        "id": "1m9rdn6",
        "author": "maronne93",
        "title": "Norbertus Kardinal",
        "content": "Qualcuno sa dove posso comprare la birra Norbertus Kardinal a Torino o dintorni?\n Ho già provato a vedere nei Mercató e Carrefour ma niente.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1m9rdn6/norbertus_kardinal/"
    },
    {
        "id": "1m9tsdn",
        "author": "m4db0b",
        "title": "Lamiera di metallo?",
        "content": "Da tempo mi frulla per la testa di piazzare in salotto una lastra di metallo abbastanza grande da usare come lavagna magnetica per i magneti raccolti nel corso dei miei viaggi, appendere foto e cose del genere. Ma non volendo applicare tasselli al muro, l'idea sarebbe di farla stare in piedi mettendola tra il muro ed il divano.\n\nStamane sono andato al Tecnomat di Orbassano ed ho trovato una lastra di ferro 2x1 metri, ma [spessa 0.6mm](https://www.tecnomat.it/it/lamiera-ferro-100x200cm-sp-0-6mm-10049891/): troppo sottile, flette e non sta dritta da sola. Leroy Merlin a catalogo ha [la stessa cosa](https://www.leroymerlin.it/prodotti/lamiera-in-ferro-liscio-opaco-200x100-cm-0-6-mm-argento-83972893.html), nulla di più spesso.\n\nVorrei provare a valutare qualcosa di più rigido ma non ho idea di dove andarlo e pescare, anche per farmi una idea del peso. Qualcuno ha un suggerimento?\n\nBen vengano anche eventuali altri suggerimenti sul tema \"superficie magnetica in salotto\", purché appunto non prevedano interventi invasivi di installazione e fissaggio.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1m9tsdn/lamiera_di_metallo/"
    },
    {
        "id": "1m9odqo",
        "author": "Other_Tangerine8489",
        "title": "Corsi di canto?",
        "content": "Ciao a tutti 😊 Mi sono trasferita da poco e sto cercando una scuola di musica oppure dei corsi specifici di canto. Sono una lavoratrice quindi ho tempo libero dalle 18 oppure il fine settimana.\nHo fatto ricerche e ho trovato qualche alternativa, ma non saprei quale scegliere e vorrei sapere se qualcuno di voi ha già avuto esperienze da condividere che possano aiutarmi a scegliere.\nPreferirei corsi individuali ma mi piacerebbe condividere questa passione anche con altre persone. Starei lontana da coach/ guru della voce (temo siano troppo cari)\nCantare sotto la doccia non mi basta piú 🥲 grazie a chiunque abbia suggerimenti!",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1m9odqo/corsi_di_canto/"
    },
    {
        "id": "1m9da95",
        "author": "robert030_",
        "title": "Alloggi per studenti a Torino entro due settimane",
        "content": "Ciao a tutti. Scusate in anticipo, questo messaggio è stato scritto con Google Translate perché purtroppo non parlo italiano.\n\nLa mia ragazza, che viene dal Brasile, sta facendo un anno di scambio con UniTo. A causa di circostanze sfortunate, ha ricevuto il via libera solo circa un mese fa e ora sta avendo molte difficoltà a trovare una casa dove stare per un anno, da agosto/settembre 2026 a giugno/luglio 2027. Ha anche bisogno di un posto dove stare prima di poter ottenere il visto. Qualcuno ha qualche consiglio su come affrontare la situazione? È realistico trovare un appartamento o una stanza in un dormitorio per studenti a Torino in questo momento o dovrebbe prendere in considerazione l'idea di vivere in una città/paese vicino? \n\nQualche consiglio è utile. Grazie mille per aver letto! :) 🙏",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1m9da95/alloggi_per_studenti_a_torino_entro_due_settimane/"
    },
    {
        "id": "1m9mrw4",
        "author": "Competitive_Pop_2345",
        "title": "Gruppi telegram/whatsapp per giochi da tavolo?",
        "content": "Buongiornoo, mi chiedevo essendo abbastanza patito se c’erano nel sub dei link di vari gruppi di giochi di tavolo organizzati nel Barbillar/Jolly Joker ecc… ho usato app come Tablo e simili, però mi chiedevo se c’erano proprio dei gruppi appositi ecco.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1m9mrw4/gruppi_telegramwhatsapp_per_giochi_da_tavolo/"
    },
    {
        "id": "1m93sia",
        "author": "LucaLuchino5",
        "title": "Guidare a torino",
        "content": "Libro teoria quiz patente... Dice che si può impegnare l incrocio con il verde... Però non é sempre vero... Manca un pezzo.. Ove non ci sono segnali che ti impedisa di svoltare.. (cartello blu con freccia obbligatoria)... Perché non hanno specificato? ",
        "upvotes": 11,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0hogj02ir1ff1.jpeg?auto=webp&amp;s=82bcc1eb6c0587818803b22c4c4b6603bc5d0854"
        },
        "permalink": "/r/torino/comments/1m93sia/guidare_a_torino/"
    },
    {
        "id": "1m973j6",
        "author": "No-Engineer-2001",
        "title": "Quali sono le zone migliori per vivere a Torino da fuorisede (Politecnico + vita universitaria)?",
        "content": "Quali zone consigliate a Torino per uno studente fuorisede del Politecnico? \n\nCerco un quartiere comodo per le lezioni ma anche con un po’ di vita universitaria la sera e ben collegato. \n\nOltre a valutare tutti i quartieri vicino al Politecnico (Crocetta, Cit, Cenisia, ecc…) mi chiedevo se avesse senso valutare quartieri diversi ma magari con una maggiore attività serale. \n\nA puro titolo esemplificativo: San Salvario (per il Valentino e la vita notturna) ma non so se sia la scelta giusta o se ci siano alternative migliori. Consigli o zone da evitare?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1m973j6/quali_sono_le_zone_migliori_per_vivere_a_torino/"
    },
    {
        "id": "1m9efrw",
        "author": "Fasy_360",
        "title": "Un nuovo sito di affitti per studenti universitari a Torino con video",
        "content": "Moltissime persone che conosco mi chiedono sempre informazioni per affitti a Torino. Un'amica fuori Torino che sta cercando casa, mi ha persino chiesto di visitare al posto suo. Inoltre i miei affittano anche case a studenti/lavoratori a Torino.\n\nHo idea di creare un sito molto semplice dove è possibile visionare video degli appartamenti oltre alle solite foto. \n\nLo scopo è quello di aiutare al meglio tutto gli studenti fuori sede e non per aiutarli a visionare l'interno della camera/appartamento con video presentazioni semplici e complete della casa (stile tour video). Oltre ai dettagli precisi su costi (utenze e altri dettagli). Anche inserire recensioni verificate (di altri studenti) credo possa aiutare molto. \n\nSe sei fuori sede o uno studente in cerca di un appartamento a Torino come reputi questa idea? \nVorrei leggere opinioni sensate (anche critiche ma costruttive). \nHo solo paura che sia già un mercato saturo, tra i gruppi su facebook, telegram e vari siti.\n\nA proposito quali siti reputi utili per trovare/cercare affitto a Torino?\n\nLa mia idea per me è fattibile perché ho le capacità per farlo: \n- so creare siti (in HTML e CCS)\n- video editor (come side job esito molti video per canali YT e agenzie di marketing e video shorts) quindi farlo per appartamenti a Torino sarebbe super Easy.\n\nUnica cosa non so se sia effettivamente utile. \n",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1m9efrw/un_nuovo_sito_di_affitti_per_studenti/"
    },
    {
        "id": "1m9bx1u",
        "author": "lexdoleur",
        "title": "About the Shipping Services in Turin",
        "content": "hi everyone! i'm planning to buy a bag from louis vuitton in turin, and i'm considering selecting the home delivery option on their website. is it secure? has anyone had any experience with it? i'm a bit concerned... could the bag get lost during delivery?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1m9bx1u/about_the_shipping_services_in_turin/"
    },
    {
        "id": "1m96waa",
        "author": "Serious-Hurry9127",
        "title": "Guidare torino incroci",
        "content": "Ma negli incroci senza controviali con semaforo, é sempre possibile la svolta? O il casino esiste solo quando ci sono viali e contro viali? ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1m96waa/guidare_torino_incroci/"
    },
    {
        "id": "1m8xz0f",
        "author": "AlessandroCadenelli",
        "title": "Notaio consigliato?",
        "content": "Buongiorno,\n\nqualcuno ha un notaio che lavora bene a prezzi ragionevoli? \n\nGrazie",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1m8xz0f/notaio_consigliato/"
    },
    {
        "id": "1m90mb0",
        "author": "MurkySignificance588",
        "title": "Looking for ppl to watch demon slayer",
        "content": "Hi guys Imma watch the upcoming demon slayer movie in August and was looking for ppl to watch together maybe even prepare to cosplay characters, feel free to hit up if interested!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1m90mb0/looking_for_ppl_to_watch_demon_slayer/"
    },
    {
        "id": "1m80uja",
        "author": "ProfessionalIcy306",
        "title": "Ma che problemi hanno i torinesi con le ciclabili?",
        "content": "Ogni giorno attraverso la città in bici per andare al lavoro.\n\nOgni giorno sulle ciclabili trovo mezzi parcheggiati, donne con passeggino, gente a spasso con il cane, vecchi di merda.\nMA LO VEDETE IL FOTTUTO DISEGNO DELLA BICICLETTA? VEDETE PER CASO UN CANE AL POSTO DI QUELLA BICICLETTA? VEDETE UN PASSEGGINO? PER DIO C'È IL MARCIAPIEDE A FIANCO.\n\nE questo oltretutto vale per le ciclabili rialzate, quelle disegnate a terra sono direttamente considerate linee bianche per il parcheggio.\n\nMa poi io voglio sapere quale sia la mente geniale che ha disegnato la ciclabile all'incrocio tra Rondò della Forca e Corso Regina.\nCHI DIAVOLO HA PENSATO CHE FARE UNA \"ROTONDA\" LI PER I CICLISTI POSSA ESSERE CONSIDERATA UNA PISTA SICURA? MA SIETE IMBECILLI? MA AVETE PRESENTE CHE LE MACCHINE SVOLTANO E NON TI VEDONO (complice il fatto che i torinesi guidano apparentemente senza tenere d'occhio gli specchietti, o anche solo a lato dell'auto guardando solo davanti a loro)!?\n MA ERA TANTO DIFFICILE FARE L'ATTRAVERSAMENTO UN METRO PIÙ IL LA DOVE ATTRAVERSANO I PEDONI? NO. ANZI LI METTIAMO BARRIERE ARCHITETTONICHE PER I CICLISTI. CHE USINO LA ROTONDA E SI FACCIANO AMMAZZARE, STI STRONZI\n\n",
        "upvotes": 86,
        "comments": 79,
        "media": null,
        "permalink": "/r/torino/comments/1m80uja/ma_che_problemi_hanno_i_torinesi_con_le_ciclabili/"
    },
    {
        "id": "1m8ewn7",
        "author": "ldexp",
        "title": "Hello, I am going to visit your beautiful city at the beginning of August. Is it good idea to park my car at P4 parking near Juve stadium and take public transport? I would like to avoid going to the city center by car that's why I'm looking for P+R.",
        "content": "",
        "upvotes": 6,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1m8ewn7/hello_i_am_going_to_visit_your_beautiful_city_at/"
    },
    {
        "id": "1m855nk",
        "author": "Frosty_Laugh1090",
        "title": "Starting an English-friendly cleaning service in Torino - does this sound useful?",
        "content": "Ciao a tutti! 👋\n\nI’ve been thinking about starting a small cleaning service business in Torino. I know there are already quite a few services out there, but I’m wondering if there’s space to niche down, specifically for people who feel more comfortable communicating in English, from booking to explaining what they need.\n\nIt feels like this might be a gap I could help fill, especially for international students, expats, or anyone still getting confident with Italian.\n\nWould you (or someone you know) use a service like this?\n\nAlso curious:\nWhat kind of cleaning do you usually need (basic home, deep clean, move-out, shared flat)\nDo you prefer paying hourly or by fixed packages? And how much?\n\nJust feeling things out at this stage. Any thoughts, feedback, or suggestions would be really appreciated. Thanks!\n",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1m855nk/starting_an_englishfriendly_cleaning_service_in/"
    },
    {
        "id": "1m7z5g6",
        "author": "ZookeepergameNo5935",
        "title": "Amicizie?",
        "content": "Ciao sono una ragazza di 22 anni, mi piacerebbe fare amicizia con altre ragazze della mia età a Torino e su bumble bff non sto avendo molta fortuna (la gente risponde in maniera secca e noiosa e solo dopo 7 ore).\nEssendo abbastanza introversa non mi va di fare amicizia out in the wild a qualche evento, quindi ho pensato di chiedere anche qui &lt;3\nScrivetemi pure se vi va!\n",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1m7z5g6/amicizie/"
    },
    {
        "id": "1m8375t",
        "author": "Adept_Implement_2521",
        "title": "Fare benzina",
        "content": "Ma ai distributori di benzina, quelli che sono aperti con personale all interno, si paga a loro o si usa sempre e solo la macchinetta fuori digitando pompa e inserendo il danaro? Poi a volte vicino alle pompe ci sono pulsanti con nuemri 5 20 50...cliccando quelli scegliamo l importo e in quel caso si passa  dalla cassa dai dipendenti? ",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1m8375t/fare_benzina/"
    },
    {
        "id": "1m79jzv",
        "author": "SignatureLast3380",
        "title": "\"Degrado\" in Barriera di Milano",
        "content": "Mahalo,\n\nsono un ragazzo di Palermo e recentemente sono salito in trasferta a Torino a trovare un amico fuorisede che abita in Barriera di Milano, in via Cherubini. Premetto che, prima di partire, il mio amico mi aveva terrorizzato psicologicamente sulla pericolosità di questo quartiere al punto che mi stavo quasi per equipaggiare di fucile da cecchino Remington e un paio di bombe a mano come se stessi andando sul fronte a Gaza. Non fidandomi della singola esperienza di una sola persona, ho provato a informarmi un po' di più su questa zona e ho avuto i sudori freddi leggendo le descrizioni che i torinesi ne offrivano. Beh volete sapere una cosa? Appena ci ho messo piede la prima esclamazione che mi è venuta in mente è stata \"MA VERAMENTE FATE?\". Da come ne parlavano sembrava dovessi trovarmi in uno dei barrios più pericolosi di Caracas, dove per un sì e per un no avrei potuto dire addio giugulare. Invece mi è sembrato un normalissimo quartiere di periferia, specialmente nelle vie adiacenti al condominio del mio amico, sì mi è capitato di adocchiare qualche brutto ceffo e qualche palazzo più fatiscente nella zona di Corso Vercelli, ma semplicemente avevo capito che non mi trovavo nella zona più ricca della città, certo non è bellissimo, non è Beverly Hills e non c'è molto da vedere o visitare (anche se ho visto che c'è un bel museo di arte contemporanea), ma non mi è sembrato nulla di così scandaloso e per nulla corrispondente a ciò che ho letto in giro. Da palermitano vi posso assicurare che Barriera di Milano figurerebbe come uno dei migliori quartieri della mia città (e lo dico a malincuore, con profondo rammarico). Forse non ho \"visitato\" le zone giuste? Forse non sono uscito abbastanza tardi? Forse il mio amico ha subito il lavaggio del cervello da parte di media e torinesi?\n\nCredo che ad alcuni servirebbe uscire per vedere e rendersi conto di quali siano i quartieri veramente pericolosi e malfamati in Italia.\n\n  \nPS unica cosa: le tende verdi sul retro delle case quelle si potreste toglierle che effettivamente sono un po' bruttine\n\nFatemi sapere",
        "upvotes": 69,
        "comments": 68,
        "media": null,
        "permalink": "/r/torino/comments/1m79jzv/degrado_in_barriera_di_milano/"
    },
    {
        "id": "1m81bx0",
        "author": "papafrancesca",
        "title": "Costo medio personal trainer",
        "content": "Ciao! Come da titolo. Indicativamente per quello che sapete etc. non pretendo un'analisi scientifica del mercato, mi serve giusto per farmi un'idea! Grazie in anticipo ",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1m81bx0/costo_medio_personal_trainer/"
    },
    {
        "id": "1m7xp0i",
        "author": "panzerPandaBoom",
        "title": "Specialistica medicina torino",
        "content": "Ciao a tutti,\nMia sorella sarebbe interessata a frequentare la specialistica di endocrinologia a Torino.\n\nCome è l'ambiente della specialistica di medicina a Torino, se possibile di quel reparto nello specifico?\n\nGrazie",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1m7xp0i/specialistica_medicina_torino/"
    },
    {
        "id": "1m7rz3j",
        "author": "EduardisEduard",
        "title": "Musicisti, vi invoco!",
        "content": "Ciao a tutti, ultimamente mi passa sempre per la testa imparare a suonare un istrumento musicale. \nHo visto varie scelte, dal semplice ukulele, alla chitarra,  al violino e al sassofono. \nDiciamo che, quello che mi ispira di piu e l'ultimo,  perche più semplice da padroneggiare. Ma anche il violino mi incanta per la sua eleganza.\nVoi cosa ne pensate? \nCome avete cominciato?\nCome suonate a casa?\nCi sono posti a Torino dove socializzare con altri musicisti?\nVorrei sentire le vostre esperienze, e perché no, anche consigli. :')\n",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1m7rz3j/musicisti_vi_invoco/"
    },
    {
        "id": "1m7i9k3",
        "author": "[deleted]",
        "title": "Guidare a torino",
        "content": "Ma guidare a torino é complicato con sti viali e controviali, segnali che non si vedono ecc.. ",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1m7i9k3/guidare_a_torino/"
    },
    {
        "id": "1m6j0sp",
        "author": "Murky_Giraffe8700",
        "title": "Ma cosa sta succedendo in zona Barriera?",
        "content": "Negli ultimi giorni passo spesso in zona Barriera, in macchina, in bici o a piedi… e ogni volta sembra peggiorare.\n\nGente che dorme ovunque per strada, parchi giochi pieni di persone che bevono e fumano tutto il giorno, gruppi che stazionano agli angoli delle vie come se fossero delle gang, e almeno un angolo che è chiaramente una piazza di spaccio a cielo aperto (sulla farmacia vicino l'angolo con Corso Regina)\n\nL’altro giorno ero in macchina e improvvisamente, a pochi metri, due tizi hanno iniziato a urlare e a picchiarsi. Si sono tirati sassi e bastoni in mezzo alla strada, come se fosse una scena da paese del terzo mondo. Nessuno ha detto o fatto nulla. Tutto normale. Come se fosse routine.\n\nLa cosa assurda è che tutto questo avviene **con una normalità sconcertante**. Nessuno interviene. Mi sto perdendo qualcosa?",
        "upvotes": 70,
        "comments": 48,
        "media": null,
        "permalink": "/r/torino/comments/1m6j0sp/ma_cosa_sta_succedendo_in_zona_barriera/"
    },
    {
        "id": "1m75e2e",
        "author": "nonsensehero",
        "title": "Parcheggio zona Mauriziano",
        "content": "Ciao! Venerdì dovrò accompagnare un parente a una visita per le 8:30., E' tanto che non passo in zona: com'è il parcheggio? Parkito è full 😞 e non vedo parcheggio su strada 😐",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1m75e2e/parcheggio_zona_mauriziano/"
    },
    {
        "id": "1m6xv81",
        "author": "Repulsive-Yak-126",
        "title": "Leaving italy",
        "content": "Leaving italy\n\nHello everyone, I'm an exchange student with a expired visa 17 July), working ricevutta and I'm leaving italy on a plane from MCP today, I wanted to know if there would be any problems on passport control and if I will be able to leave the country, thank you in advance!",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1m6xv81/leaving_italy/"
    },
    {
        "id": "1m6pnxg",
        "author": "melethbser",
        "title": "[OC] Piazza Castello (Novembre 2019)",
        "content": "",
        "upvotes": 19,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/v76vanwpmhef1.jpeg?auto=webp&amp;s=4a435262a9060841550cb744cbb5e98602ebafae"
        },
        "permalink": "/r/torino/comments/1m6pnxg/oc_piazza_castello_novembre_2019/"
    }
]