[
    {
        "id": "1mny4vi",
        "author": "RM_Official_Thread",
        "title": "La Liga Fantasy League 2025-26 for r/RealMadrid - on SofaScore",
        "content": "Sofa finally open their fantasy leagues and they follow the same UEFA and EPL fantasy format (Unlike that nasty Marca laliga fantasy from a few years ago)\n\n#La Liga Fantasy 2025-26\n\nJoin here: [https://www.sofascore.com/fantasy/competition/121#tab:fantasy\\_leagues,joinCode:BN8C2](https://www.sofascore.com/fantasy/competition/121#tab:fantasy_leagues,joinCode:BN8C2)\n\nOr use Code: BN8C2 in the Sofascore app\n\nThis info will be included in the Open Thread.\n\nEnd of Season prize for the top 3 will be a custom flair and 1 million dollars\\*\n\n^(\\*1 million dollars depends if uncle Flo authorize the transfer.)",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mny4vi/la_liga_fantasy_league_202526_for_rrealmadrid_on/"
    },
    {
        "id": "1mn8vcf",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 27,
        "comments": 1887,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mn8vcf/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1mrpr9k",
        "author": "EquivalentAbalone456",
        "title": "On this day 9 years ago, Real Madrid presented Marco Asensio.",
        "content": "",
        "upvotes": 423,
        "comments": 23,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mrpr9k/on_this_day_9_years_ago_real_madrid_presented/"
    },
    {
        "id": "1mrntix",
        "author": "Disastrous-Duty-8152",
        "title": "In which season u think modric proved that he is indeed One of the best midfielders, for me...",
        "content": "It would be 2017/18 season when we were on top with our team, modric consistent amazing performances in all matches pulling the strings alongside with casemiro and kroos providing for the attack and working hard both offensively and defensively. He was one of my most fav player on that season\n\nAlso in the worldcup 2018 he performed really well and Led his team to worldcup final as a captain plus he won the ballondor later after the worldcup\n\nSo for me I would say the 2017/18 season luka showed the whole world that he is one of the best midfielders❤️\n",
        "upvotes": 214,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7j01iif40cjf1.jpeg?auto=webp&amp;s=b5c2b4d6412ebb7da4abe10587f05897dcc3cc65"
        },
        "permalink": "/r/realmadrid/comments/1mrntix/in_which_season_u_think_modric_proved_that_he_is/"
    },
    {
        "id": "1mrrbgk",
        "author": "Ghost-Ripper",
        "title": "Our boys are focussed and training enough before we go all in. What are our chances this time?🔛",
        "content": "",
        "upvotes": 115,
        "comments": 33,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mrrbgk/our_boys_are_focussed_and_training_enough_before/"
    },
    {
        "id": "1mrf8yv",
        "author": "Specialist_Meat_4889",
        "title": "fun fact:for the last 3 world cups weve been the holder of the ucl during the tournament",
        "content": "",
        "upvotes": 321,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mrf8yv/fun_factfor_the_last_3_world_cups_weve_been_the/"
    },
    {
        "id": "1mrdl2x",
        "author": "urs_romeo007",
        "title": "Which black jersey kit is this ? Looks damn🔥👀 where can I buy this?",
        "content": "",
        "upvotes": 130,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i9vqolx9m9jf1.jpeg?auto=webp&amp;s=dbea18ff28f80cae3b4fdc0ac84cdefb506d63ad"
        },
        "permalink": "/r/realmadrid/comments/1mrdl2x/which_black_jersey_kit_is_this_looks_damn_where/"
    },
    {
        "id": "1mrmca8",
        "author": "khalidvawda",
        "title": "Made a bunch of wallpapers based on the new Kits. Available for 1920 x 1080, 2560 x 1440 &amp; 3840 x 2160 resolutions.",
        "content": "I made some more wallpapers for this season. I have had some requests to do updated versions of the ones I posted last year.\n\nUpdate the trophies and made them to match this season's kit colors.\n\n1920 x 1080, 2560 x 1440 &amp; 3840 x 2160 resolutions available to download via OneDrive links below:\n\n[Home Wallpapers](https://1drv.ms/u/c/9ff94517492d2098/EfzqclqNGOdFgJMMso7GZBIB8an66gROQ96O1AmOjVMUsQ)\n\n[Away Wallpapers](https://1drv.ms/u/c/9ff94517492d2098/ETEL5mnqJkxJgfqBCuER5yoBnL92u2h3w2dSzsefUyOeMQ)\n\n[Third Wallpapers](https://1drv.ms/u/c/9ff94517492d2098/EWYXYmc0I1FMsSWnrSSb4jcBgbF_v8FoJra0PEJuE6zwWQ)",
        "upvotes": 37,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mrmca8/made_a_bunch_of_wallpapers_based_on_the_new_kits/"
    },
    {
        "id": "1mr142s",
        "author": "strangerdagger",
        "title": "COMUNICADO OFICIAL: Perez is taking El Confidencial to court",
        "content": "The Supreme Court has upheld the ruling handed down by Madrid’s Court of First Instance No. 42 on October 6, 2022, which convicted the El Confidencial newspaper and its editor, Ignacio Cardero, for unlawfully intruding upon the honour of Real Madrid president Florentino Pérez.                                   \n\n\nOver a period of several days during July 2021, El Confidencial published a series of audio recordings from a private conversation involving the Real Madrid president, recorded without his consent. In his ruling, the judge stated that “the form and content of the broadcasts show that the intent was always to undermine Mr. Florentino Pérez Rodríguez's public image. As such, this constitutes an unlawful intrusion upon his right to honour.”",
        "upvotes": 242,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TFcxTGJ-4nfEVc2nRbk9ES9WefEG2eE0pCcAz588Nao.png?auto=webp&amp;s=72a90616cda61c2524537adf0501d21be4b98aff"
        },
        "permalink": "/r/realmadrid/comments/1mr142s/comunicado_oficial_perez_is_taking_el/"
    },
    {
        "id": "1mqth2h",
        "author": "Brave-Lion6449",
        "title": "I was at the Bernabéu for Real Madrid vs Juventus in 2018 – what a night!",
        "content": "",
        "upvotes": 466,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uay3c3mbq5jf1.jpeg?auto=webp&amp;s=eae485f8072229639592b5d99b3e509bfd34e66b"
        },
        "permalink": "/r/realmadrid/comments/1mqth2h/i_was_at_the_bernabéu_for_real_madrid_vs_juventus/"
    },
    {
        "id": "1mqpul4",
        "author": "Disastrous-Duty-8152",
        "title": "What were Ur first expectations when we signed bale from spurs",
        "content": "I was excited to see him playing cause I have watched him play for Tottenham and he was amazing there. He was fast, he was a good dribbler and his free kicks were top class plus he was the most expensive player at that time when we signed him\n\nSo I had lots of high expectations from him which, ofc bale proved me right, he settled well in real Madrid and linked up really well with Karim and Cristiano. \n\nI love his technical skills and dribbling and his amazing finesse goals and he was also a major part of our team for many years especially when we did 3 UCLs in a row \n\nSo overall my expectations were high and he did delivered and became important part of the squad",
        "upvotes": 443,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a30br9vmp4jf1.jpeg?auto=webp&amp;s=9ee94bf41b531cb697de9ba20745a1527ee10890"
        },
        "permalink": "/r/realmadrid/comments/1mqpul4/what_were_ur_first_expectations_when_we_signed/"
    },
    {
        "id": "1mqg5fc",
        "author": "brainybrit",
        "title": "I would not be okay with loosing a big game player like Rodrygo",
        "content": "Real Madrid can’t let Rodrygo go. The guy lives for big moments — Champions League nights, El Clásico, you name it. He’s got that clutch factor you just can’t replace. Players like him win you trophies when it really matters. Hshshehshshshshshehhehehehehehehehehehhehehehehehehehehehehehehhehe heheheheheheheheheheh heheheh",
        "upvotes": 1511,
        "comments": 98,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7aaa4fa1f2jf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mqg5fc/i_would_not_be_okay_with_loosing_a_big_game/"
    },
    {
        "id": "1mrb6pd",
        "author": "kasam-se",
        "title": "Intense session in preparation for LaLiga opener! | Real Madrid",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wcVIhIQoaKDH0Ez20jt4DCBovQvbDFtcCzq0HrG2N4w.jpeg?auto=webp&amp;s=bbf8cfff61f67c50841e3a205e0669936e37d584"
        },
        "permalink": "/r/realmadrid/comments/1mrb6pd/intense_session_in_preparation_for_laliga_opener/"
    },
    {
        "id": "1mr4rz0",
        "author": "zblbolapills",
        "title": "LaLiga 2025/26 has officially kicked off!",
        "content": "It has been a long wait so what are your overall expectations for this season? Not only for Real Madrid but for all LaLiga teams in general, opinion on this summer's transfer window for Spanish teams, top goalscorer and assister at the end of the season, any potential black sheep like 2023/24's Girona, etc. Share your thoughts!",
        "upvotes": 39,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mr4rz0/laliga_202526_has_officially_kicked_off/"
    },
    {
        "id": "1mqtnq1",
        "author": "123kallem",
        "title": "Analysis of Rodrygo's inconsistency / Rodrygo Rant (LONG POST)",
        "content": "The reason im making this post is because i dont think i've ever seen so many fans defend such an incredibly inconsistent player in all my years of being a Madridista, it's very strange to me.\n\nI think at some point we need to be honest about Rodrygos inconsistency as a player. The ''hes playing out of position on the right wing'' excuse has been around for years, but the reality is hes been at Madrid for five seasons now and has played the majority of his games on that side. If he hasnt adapted by now, i dont know what to tell you. Also, he has the exact same inconsistency problem when he plays on the left, so why are we attributing this to something about what side of the pitch he plays on? \n\nRodrygo has a clear history of disappearing for long stretches. [There are periods where he will go 15 games without a goal](https://i.gyazo.com/4dd70ccb5107d64c10a50975f900abbf.png), which is not acceptable for a starting attacker at Real Madrid, the thing i linked above was from the insane 23/24 season, and [heres something from 22/23](https://i.gyazo.com/890c4767c80f2722fa1b1e9a9f1ae924.png) and [heres something from last season](https://i.gyazo.com/1f882bd04a677989aa19bfb486cf7336.png). I could also show the 21/22 season where he didn't score his first league goal until April, but i dont think Rodrygo was a real starter up until right at the end of that season.\n\nAnd its not just when hes on the right wing in some of those games, he's been played on the left and still failed to deliver. Right now, like i showed you, he hasnt scored a league goal since January. Before that, yes, he had his usual hot streak where he scored and assisted in a few games in a row and showed us how fucking amazing Rodrygo can be. But if you go back before that run, he didnt score between September and December. Its a pattern we've seen season after season short periods of great form, followed by long droughts of not really doing much at all. People want to say he's out of position, sure, but why is it that in the 22/23 season, when Benz was injured a lot, we put Rodrygo in the middle, and his usual hotstreak in ~December-January happened, why did that happen while [he was playing through the middle](https://i.gyazo.com/83df0eb5a5723ae1c682eed202a1a2ef.png)? Wouldn't he be out of position there too? How come he randomly performed, is it because he's inherently an inconsistent player, where his position doesn't really matter too much?\n\nAnd theres this narrative that he works harder defensively than players like Vini or Mbappé, which i just dont think is true at all and it unironically triggers the fuck out of me because its an easy excuse people can use that people wont really be able to accurately check if its correct or not, if that makes sense.\n\n [The data](https://i.gyazo.com/8254d0cb337c78242ef22323025ca94d.png) from last season, and from [our most recent CL season](https://gyazo.com/f69cc34cea537f17dbcc4c8ee8745b79), shows that, yes, he might do a bit more than them, but it's by a very small margin. Its not like he's putting a crazy amount of work more every match and exhausting himself, the difference isnt enough to say thats why he's underperforming. That excuse just doesnt hold up, same with the pressing/running thing, [nothing shows that he's some insane presser](https://i.gyazo.com/dfb70fc0cc9ae7c3429a45470283ee48.png), most things are [gonna show that he does run more](https://pbs.twimg.com/media/GoUxq_EWQAAZQ9_.jpg:large) but not really [by much at all](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSyO1A5dnMKzSY6JT8iSccyu1tqi9rjLWVGrQ&amp;s), but i guess all the Rodrygo stans are just gonna say that im watching football through stats or whatever else, i dont really know what else to cite when im making a post like this.\n\nIm not saying Rodrygo is a bad player or that i hate him, i think literally every Madrid fan loves the fuck out of him. He's obviously very talented and can be decisive when he's in form. But at some point, you cant keep giving a forward at Real Madrid a free pass for being invisible for months at a time, i dont think i've ever seen another Madrid player get such a free pass like him, i think a ton of this subreddit are too young to know or are just more recent fans, but a player like Benzema got fucking grilled like crazy in both the 16/17 season and the 17/18 season for being inconsistent, literally on of our most upvoted posts during those years was [''1 upvote = 1 apology to Benzema''](https://www.reddit.com/r/realmadrid/comments/6afgnd/1_upvote1_apology_to_benzema) because people were endlessly shitting on him, myself included in 2018. It feels like a lot of people are just so in love with Rodrygo because of stuff like the Chelsea and City goals, plus the CDR final goals, i will forever love Rodrygo for those too, but im not gonna be blinded by my love for him.\n\nSo when people say stuff about how Rodrygo should start on the left over Vini..... Why exactly? I dont know in what situation you'd ever take a gamble on Rodrygo somehow becoming a consistent player when he gets to play on the left, and also matching/being better than Vini, who for 4 seasons straight has put up 40+g/a, even in his last season, which was a bad one, and i think has broken the record for most G/A in the CL knockout stages, showing that he's a big game player. Like in what world do you ever say ''Hey Vini, i know you were consistently the best LW in the world for 4 years straight, but since you didn't perform well in the last half of the season, we're gonna bench you for the guy who guy who hasn't performed consistently in either of the 3 attacking positions, because apparently he runs more than you, sorry king''. Like you guys are either blinded by your love for Rodrygo, which i am guilty of too in the past, or you're just delusional. This guy is not good enough of a player to force us into  4-3-3, our best formation, as we saw in our most recent double and in a lot of the games last season when Carlo finally benched Rodrygo, is a 4-3-1-2, with Vini and Kylian up top with Jude/Arda behind them, i dont see what Rodrygo does that warrants us changing our entire formation just to fit him in.",
        "upvotes": 76,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/X5wzauL3pG3rHtU1CuYJK7oB046l6K96fkMqfeDx5jU.png?auto=webp&amp;s=715ee0f037ae8c63dcca5f024d1f702351ee646b"
        },
        "permalink": "/r/realmadrid/comments/1mqtnq1/analysis_of_rodrygos_inconsistency_rodrygo_rant/"
    },
    {
        "id": "1mq56h8",
        "author": "The_Flash_20",
        "title": "Crazy 6 minutes of madness between Real Madrid and Man City in 2022 - from Mendy's goal line clearance to Rodrygo's double",
        "content": "",
        "upvotes": 1964,
        "comments": 125,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/nkjn52klf0jf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mq56h8/crazy_6_minutes_of_madness_between_real_madrid/"
    },
    {
        "id": "1mquctf",
        "author": "SakhtNahiYeLaunda",
        "title": "[Brand Directory] Real ranked 1st in the annual report on the most valuable football club brands",
        "content": "",
        "upvotes": 45,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mquctf/brand_directory_real_ranked_1st_in_the_annual/"
    },
    {
        "id": "1mpxnf7",
        "author": "ManuMora98",
        "title": "Mastantuono will wear n°30, leaving a spot in the first team for a posible last minute signing",
        "content": "",
        "upvotes": 1137,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ls03bt2jxyif1.jpeg?auto=webp&amp;s=e2171ee838e96f52a21ce69dfa0e6e0d5290e845"
        },
        "permalink": "/r/realmadrid/comments/1mpxnf7/mastantuono_will_wear_n30_leaving_a_spot_in_the/"
    },
    {
        "id": "1mq2o4q",
        "author": "No-Independent2522",
        "title": "Mastantuono has a message for you, Madridistas!",
        "content": "",
        "upvotes": 496,
        "comments": 42,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/cctq9dw7zzif1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mq2o4q/mastantuono_has_a_message_for_you_madridistas/"
    },
    {
        "id": "1mpwtc7",
        "author": "ScleaverZer0ne",
        "title": "The Left-back who started La Décima final",
        "content": "They wrote this heading on Fábio Coentrão's player page on the official site, calling Coentrão just “the left back who started La Décima final” is wild. Man was a clutch in big games, bled for the badge. Way more than one match! Give him a headline that shows the fight, passion, and respect he earned, not this lukewarm “he played that one game” energy. Put some respect on his name.",
        "upvotes": 669,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9rxs2dygpyif1.png?auto=webp&amp;s=82826e37634fc06f76b241e4eb9bcbe3788e1a0d"
        },
        "permalink": "/r/realmadrid/comments/1mpwtc7/the_leftback_who_started_la_décima_final/"
    },
    {
        "id": "1mpsbgd",
        "author": "Novel_Exchange_356",
        "title": "Unforgettable hat-trick. Man showed City their place.",
        "content": "",
        "upvotes": 876,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a3azkh2wdxif1.jpeg?auto=webp&amp;s=7d9e1af24a05d68e4267520f3ac469eb89d11721"
        },
        "permalink": "/r/realmadrid/comments/1mpsbgd/unforgettable_hattrick_man_showed_city_their_place/"
    },
    {
        "id": "1mpwt1s",
        "author": "Affssshaaan77",
        "title": "Latest update on the stadium",
        "content": "they’re experimenting with stunning lighting under the new panels, creating a spectacular glow across the exterior. The effect is giving off strong Allianz Arena vibes to me but with a sleeker, more modern twist. What do you all think of this look?  \n\nThe project’s been dragging on forever no idea when it’ll finally be done but really hoping they pull off what we saw in the renders! ",
        "upvotes": 369,
        "comments": 29,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2rogr5igpyif1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mpwt1s/latest_update_on_the_stadium/"
    },
    {
        "id": "1mpu9ev",
        "author": "FlyingWaterMen",
        "title": "[AS] Ibrahima Konate has agreed to join Real Madrid, whether this summer or next. Madrid want Konaté, and at zero cost, next summer. However, the possibility of a last-minute move in this market of an offer — never exceeding €20-25 million is gaining momentum at the club.",
        "content": "",
        "upvotes": 563,
        "comments": 110,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Lb-OwMVjfT_dpUdInsgr3vVnTvC0FIAUVUbteKCDiYs.jpeg?auto=webp&amp;s=ce92f673892c9eaa70dd73a0ef0bef84bd9b24d5"
        },
        "permalink": "/r/realmadrid/comments/1mpu9ev/as_ibrahima_konate_has_agreed_to_join_real_madrid/"
    },
    {
        "id": "1mqlgtu",
        "author": "Im_A_OF_Soldier",
        "title": "Planned my travel at the worst time",
        "content": "Unfortunately made my travel plans to madrid before the season was announced. I'll be there Aug 31 thru Sep 7 and of course theres no games but anything else I should do in the city other than a tour of the bernabeu? Any suggestions are much appreciated even if its not real madrid related ex Cafe restaurante etc",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mqlgtu/planned_my_travel_at_the_worst_time/"
    },
    {
        "id": "1mpypht",
        "author": "No-Independent2522",
        "title": "Real Madrid is for the second consecutive year the most valuable football brand in the world and for the fourth year the strongest brand, according to Brand Finance",
        "content": "&gt; The 'Football 50-2025' report establishes for our club a brand value of 1,921 million euros and a strength score of 94.9 out of 100.\n\n\n&gt; Real Madrid is for the second consecutive year the most valuable football brand in the world and for the fourth year the strongest brand, according to Brand Finance\n\n&gt; Real Madrid is, for the second consecutive year, the most valuable football brand in the world and for the fourth year in a row the strongest brand, according to the Football 50-2025 report, published by the brand finance consultancy. The brand value of our club has grown by 14% and sets a new record of 1,921 million euros.\n\n&gt; In its report, Brand Finance highlights that \"the record revenues obtained during two consecutive seasons and the continuous increase in the value of the brand highlight the strength of the Real Madrid brand, and demonstrate the fundamental role played by a solid and valuable brand in sustaining long-term growth. Real Madrid leads the international markets as the favorite team among fans around the world.\"\n\n&gt; The strongest football brand\n&gt; Brand Finance also determines the strength of brands through metrics that evaluate marketing investment, stakeholder brand assets and business performance. In this section, Real Madrid maintains its leadership for the fourth consecutive year by obtaining a score of 94.9 out of 100 and the maximum AAA+ rating.",
        "upvotes": 250,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TFcxTGJ-4nfEVc2nRbk9ES9WefEG2eE0pCcAz588Nao.png?auto=webp&amp;s=72a90616cda61c2524537adf0501d21be4b98aff"
        },
        "permalink": "/r/realmadrid/comments/1mpypht/real_madrid_is_for_the_second_consecutive_year/"
    },
    {
        "id": "1mprohx",
        "author": "Puzzleheaded-Delay60",
        "title": "Good Link up play and team work",
        "content": "I really like this sequence of play, quick one twos, hold up play and overlapping runs. No pass was wasted, i hope to see more of this in the coming season.",
        "upvotes": 604,
        "comments": 31,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fynb90sm6xif1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mprohx/good_link_up_play_and_team_work/"
    },
    {
        "id": "1mq98a8",
        "author": "Sysyphus8",
        "title": "What was your biggest gripe with the 2024-25 season ?",
        "content": "0. Lack of Transfer urgency by the Board ; No commitment to replace injured players.\n\n1. Lucas Vázquez at RB ; No chance given for academy full-backs/defenders.\n\n2. Rigid Starting XI  ; Stubborn Lack of rotation despite visible shortcomings.\n\n3. Injury Crisis ; Incompetent medical staff and outdated training/fitness methods.\n\n4. Bellingham’s Shoulder Surgery ; Avoiding surgery worsened long-term performance/morale.\n\n5. Mbappé’s First-Half Form ; Negative impact and complete lack of poise.\n\n6. Zero Chemistry in Attack ; No sync between front three.\n\n7. Midfield–Attack Disconnect ; Too dull with the ball, too slow without it.\n\n8. Ballon d'Or Drama ; Disrupted focus mid-season.\n\n9. Tactics ; No plan B, no pressing patterns.\n\n10. No Substitutions — Waiting 85/88 minutes for the first substitution.\n\n11. Arda &amp; Endrick Banished/Complete Outcast ; Dozen games without a single minute.\n\n12. Vini’s Mentality Shift ; Less hunger, more frustration.\n\n13. Rodrygo's Late-Season Drama/ Form ; Timing couldn't have been worse. \n\n14. Fede Valverde and Bellingham with too much overload/ covering for forwards.\n\n15. Awful attacking display by fullbacks.\n\n16. Too much blame on Ancelotti/ easy scapegoating.\n\n14. Too much tactical freedom.\n\n15. Out of control arrogance/ anger  visible in players at times.",
        "upvotes": 51,
        "comments": 35,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mq98a8/what_was_your_biggest_gripe_with_the_202425_season/"
    },
    {
        "id": "1mq2jtx",
        "author": "ace-s",
        "title": "Don't be surprised if Mastantuano ends up being a starter before the end of the season or have a major role on the get go.",
        "content": "MOST important point before saying anything, he was close to signing with PSG and Xabi calling him and telling him about his role in the team gave him the confidence to sign. I know we are his dream club but PSG wanted him badly. So Xabi, rates him very highly.\n\nI've been looking at alot of his videos and saw some of the replays of the games where he performed well. Out of all the players we got from SA in the recent years, he is clearly the most ready to get minutes. The other's were not ready and simply prospects but this guy just needs to adapt to the team and league.\n\nSimilar to Yamal. Franco is an agile dribbler who doesnt reply on his physicality like Vini to dribble past people. He also is amazing at link ups and through balls. I noticed alot of times his playmaking was too good for River plate players, where he would do an amazing pass but his teamamtes would not be able to predict the pass and go into space.\n\nWith players like Mbappe, Vini...etc. he wont have this problem.\n\nOut of Arda and Franco. I can see one of them become a CM. Or even both. They are just too good to not play together",
        "upvotes": 108,
        "comments": 63,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mq2jtx/dont_be_surprised_if_mastantuano_ends_up_being_a/"
    },
    {
        "id": "1mpt1fn",
        "author": "EffectiveTie3144",
        "title": "Happy birthday to Francisco José García Torres 🇪🇦",
        "content": "",
        "upvotes": 438,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mpt1fn/happy_birthday_to_francisco_josé_garcía_torres/"
    },
    {
        "id": "1mr77ni",
        "author": "ZealousidealPie6377",
        "title": "In defense of Rodrygo / Vini at RW can unlock our offense",
        "content": "Our record over the last 2 seasons where vini doesn't play and Rodrygo does is 17-2-2 . Over those games, Rodrygo recorded 12 goals and 5 assists at LW . If you ask me, that's not bad . It's so easy for people to hate on Rodrygo for playing out of position and putting up bad numbers, but  if the roles were reverse and Rodrygo was in Vini's shoes , we would be having the same conversation about Vini . Vini's never had to play out of position or compromise as much as Rodrygo has since Carlo joined and that led to him developing bad habits. \n\nThis isn't a post of me trying to hate Vini. Both players have very different qualities in terms of play style but are equally effective on the LW . This is a team sport. This sub should be thinking who would be the better RW and I think that would be Vini . Rodrygo's link-up play (IMO)  is better than Vini's , he has great chemistry with the fullbacks and utilizes overlaps better and his chemistry with Mbappé is better. However, vini is more relentless, explosive and more willing to take players on and can beat the opponent to the byline to create better chances. He also likes to trivela a lot . All of those qualities make him to be a much better RW than Rodrygo l. If vini puts up better stats than Rodrygo does (which I believe he would), then that's a  positive and improves the team . Even if Xabi doesn't want to play Rodrygo , Mbappé would also love that LW spot and play Garcia  at striker . I hope Xabi tries this early in the season because I think this will unlock our offense, but at the end of the day, I trust Xabi's judgment and won't be too overcritical .",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/realmadrid/comments/1mr77ni/in_defense_of_rodrygo_vini_at_rw_can_unlock_our/"
    },
    {
        "id": "1mpdq4l",
        "author": "No-Independent2522",
        "title": "OTD in 2017 - Ronaldo's brilliant goal vs Barcelona in 2nd leg of Spanish Super Cup 2017/18.",
        "content": "",
        "upvotes": 1241,
        "comments": 39,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ljrlb7nn6uif1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1mpdq4l/otd_in_2017_ronaldos_brilliant_goal_vs_barcelona/"
    },
    {
        "id": "1mp9z2z",
        "author": "cyrusmancub",
        "title": "Real Madrid could register Franco Mastantuono with Castilla, in order to leave a free spot in the main squad in case a signing becomes available",
        "content": "",
        "upvotes": 281,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/olr4DIHQsfbwECWiks-41lwic9FtZQ5jT1mPOdY7FlE.jpeg?auto=webp&amp;s=3c6ae0eff97c12eae720d09dc1e2781f98d5fa9b"
        },
        "permalink": "/r/realmadrid/comments/1mp9z2z/real_madrid_could_register_franco_mastantuono/"
    }
]