[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 499,
        "comments": 272,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 16,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jeot1i",
        "author": "flannel_flower",
        "title": "Why are so many missing the point of Adolescence?",
        "content": "There’s a lot of articles on Facebook about the new series Adolescence and the vast majority of people seem to have completely missed the point of the series and the message it’s trying to convey?                                                                   You have people asking whether Jamie really killed Katie, saying that it was left on a cliff hanger and there will be a series 2, that it was about bullying or knife crime. The series is clearly about toxic masculinity and how young boys are being brain washed by Andrew Tate and the likes. Jamie couldn’t handle being rejected by a “flat-chested” girl who was weak and vulnerable after her topless photos were circulated. He thought he was entitled to her, that he deserved her. She did ridicule him online with her comments on his Instagram which was a contributing factor but it really did come down to Jamie thinking he was entitled to Katie.",
        "upvotes": 366,
        "comments": 170,
        "media": null,
        "permalink": "/r/netflix/comments/1jeot1i/why_are_so_many_missing_the_point_of_adolescence/"
    },
    {
        "id": "1jewkoh",
        "author": "gnshgtr",
        "title": "Netflix Director Arrested for $11 Million Fraud, Spent $2.4 million on five Rolls-Royces and one Ferrari",
        "content": "",
        "upvotes": 32,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jewkoh/netflix_director_arrested_for_11_million_fraud/"
    },
    {
        "id": "1jedgsd",
        "author": "S4v1r1enCh0r4k",
        "title": "‘Adolescence’ Becomes Netflix’s Most-Watched Show of the Week",
        "content": "",
        "upvotes": 415,
        "comments": 132,
        "media": null,
        "permalink": "/r/netflix/comments/1jedgsd/adolescence_becomes_netflixs_mostwatched_show_of/"
    },
    {
        "id": "1jezg16",
        "author": "Grogman2024",
        "title": "Jamie’s crime in Adolescence",
        "content": "How is there so many people asking whether or not Jamie did it when he was very clearly caught on camera stabbing Katie. I’ve even seen a lot of people saying in the video you only see Jamie pushing her when you very clearly see more than that? Just very confused overall haha",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jezg16/jamies_crime_in_adolescence/"
    },
    {
        "id": "1jezy7g",
        "author": "ggroover97",
        "title": "Netflix’s Ted Sarandos Isn’t Done Disrupting Hollywood: On Winning the Streaming Wars, a Marvel ‘Fistfight’ and Defending Meghan Markle",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jezy7g/netflixs_ted_sarandos_isnt_done_disrupting/"
    },
    {
        "id": "1jebdhw",
        "author": "Greedy_Safety_4674",
        "title": "WATCH Adolescence!",
        "content": "Just finished Adolescence and wow. I’m not going to get into a long psychological analysis here. But, uh…let’s just say, I’m deeply disturbed by this show. I never thought I’d find a 13 year old scary. \n\nAfter ep. 3: hide your kids, hide your husband, and hide your wives (mm, the husbands may be safe though given his pathology).",
        "upvotes": 116,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1jebdhw/watch_adolescence/"
    },
    {
        "id": "1jey95y",
        "author": "MysteriousDelay6266",
        "title": "The Diamond Heist | Official Trailer | Netflix | April 16",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jey95y/the_diamond_heist_official_trailer_netflix_april/"
    },
    {
        "id": "1jekvw2",
        "author": "udar55",
        "title": "Feds Indict Director Who Allegedly Scammed Netflix Out Of Millions",
        "content": "",
        "upvotes": 23,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jekvw2/feds_indict_director_who_allegedly_scammed/"
    },
    {
        "id": "1jf0zf8",
        "author": "kyrgyzmcatboy",
        "title": "The Twister: Caught in the Storm. A movie that shows just how absolutely stupid most people are.",
        "content": "The worst offense in my book was Mac and Eric being completely oblivious, while Kaylee is practically screaming at them to run. They just keep standing there like morons, completely disregarding Kaylee yelling to run. On top of that, they make a stop a bit further on just to watch, while Kaylee is understandably scared, stays in the car.\n\nThen the people in the diner, and the mom, disregarding the son, who is a weather expert, that the tornado is about to kill everyone in sight.\n\nJust a really frustrating movie to watch because of the stupidity. I used to think movies made people intentionally stupid, but no, people are fucking stupid.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jf0zf8/the_twister_caught_in_the_storm_a_movie_that/"
    },
    {
        "id": "1jf07ta",
        "author": "Somethingman_121224",
        "title": "Austrian Hit Crime Thriller 'Woman of the Dead' Is Back on Netflix with Season 2, Trailer Available",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jf07ta/austrian_hit_crime_thriller_woman_of_the_dead_is/"
    },
    {
        "id": "1jen5px",
        "author": "Playful_Shake3651",
        "title": "Adolescence - Jamie Discussion",
        "content": "I just finished the show and loved it, especially the acting. There's alot I can and want to say about the show but to streamline this Jamie discussion I'll leave it at I loved the show and acting.\n\nAfter finishing I started scrolling through r/Netflix and the amount of threads and comments about how Jamie is a monster, he was a psychopath, etc... was shocking to me. \n\nYes what he did was horrible and the way he did it was clearly very brutal, but like wasn't the entire point of them constantly mentioning incels supposed to be a clear indication that Jamie was not actually a \"bad\" kid, but just a victim of this Andrew Tate anti-women movement? I thought it was so incredibly in your face the entire show that it would be impossible for anyone to not realize what the message of the show was, but like I said I found an astounding number of threads and comments completely ignoring that Jamie was molded into a monster, not born one.\n\nThe 4th episode is just the parents grieving about what they may have done wrong and they even literally talk about how they thought he was safe at home on his computer, how more obvious can the writers / directors make it? Yet somehow people came to the conclusion he was just born a psychopath and all he needed was a trigger?!?!?\n\nTLDR: This show is about how the incel / anti-women movement impacts our young men correct? Not about the next John Wayne Gacey getting caught early before he could do more harm? Its shocking how many people completely missed the purpose of the show and somehow came to the conclusion that Jamie was just a natural born psycho and nothing more.",
        "upvotes": 11,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1jen5px/adolescence_jamie_discussion/"
    },
    {
        "id": "1jexgr0",
        "author": "indiewire",
        "title": "The 26 Scariest Movies on Netflix: Pearl, Fear Street, Scream &amp; More",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jexgr0/the_26_scariest_movies_on_netflix_pearl_fear/"
    },
    {
        "id": "1jew913",
        "author": "rainj97",
        "title": "Expert explains clever reason why psychologist insists on bringing Jamie a hot chocolate during gripping Adolescence episode",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jew913/expert_explains_clever_reason_why_psychologist/"
    },
    {
        "id": "1jel31z",
        "author": "Deanno0",
        "title": "best series you’ve ever seen on Netflix . Go!",
        "content": "Post the best series you’ve ever seen ! So many options and shows aren’t what they used to be. Trying to find something worth binging. Post here or send me a private message of a list of them . Thanks!",
        "upvotes": 9,
        "comments": 193,
        "media": null,
        "permalink": "/r/netflix/comments/1jel31z/best_series_youve_ever_seen_on_netflix_go/"
    },
    {
        "id": "1jem7kh",
        "author": "Grouchy-Ad-1863",
        "title": "Adolescence - What's Your View?",
        "content": "Your View on Adolescence\n\nAs parents, teens, or kids, how do you view the message of Adolescence? I'd like to get different perspective on how different age groups grasp its message. \n\nI started overthinking about my child's future and how I am doing as a parent after seeing it. :( \n",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jem7kh/adolescence_whats_your_view/"
    },
    {
        "id": "1jeul6g",
        "author": "finnthegreatest",
        "title": "Boy Swallows Universe Ending",
        "content": "Can anyone comment on what happened to tytus broz at the end? Why did he pick up the scalpel? Nothing happened after that…\n\nAlso keen to just chat abt the show too ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jeul6g/boy_swallows_universe_ending/"
    },
    {
        "id": "1jeoa1u",
        "author": "Steerpike58",
        "title": "Adolescence - Episode 3, rehearsals and acting question",
        "content": "I just finished Adolescence on Netflix and was pretty blown away by the acting, especially since they shot each episode in one continuous take.  Specifically, in Episode 3, there's a 45+ minute scene in which the young boy (Jamie) is in conversation with the clinical psychiatrist Briony.  \n\nMy question is, how did that young actor (Owen Cooper) pull it off? Did they do a ton of rehearsals? Did he ad-lib any of it?  Did they have his lines posted up on big boards that they hand-held for his use, which they somehow managed to keep out of sight of the (constantly moving) camera?  How many full takes did they do before they determined that they had what they needed? \n\nApparently he's an unknown actor and this was his first role. Even if he's older than 13 in real life, he's pretty darned young to be able to pull off such a performance. \n\nUPDATE - found this article - [Owen Cooper in Adolescence: is this the best child acting debut since Jodie Foster? | The Standard](https://www.standard.co.uk/culture/tvfilm/boy-adolescence-owen-cooper-b1217411.html)  \\- he was 14 at the time, and the 50+ minute episode took 3 weeks to film; 1 week of rehearsals, 1 week of 'tech' rehearsals, 1 week of final filming with 2 takes a day, roughly.  So maybe they did up to 10 takes and picked the best one? \n\nPretty amazing. ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jeoa1u/adolescence_episode_3_rehearsals_and_acting/"
    },
    {
        "id": "1jevvvb",
        "author": "nico3727",
        "title": "What are some of your favorite disclaimers?",
        "content": "These can be pre-show disclaimer scenes like that of 13 Reasons Why, or Painkiller.\n\nI don't know why, but I just really find disclaimers fascinating and interesting to watch. I wonder if there's a comprehensive list of all disclaimers that have been added to Netflix shows.\n\nI find that a really good disclaimer almost sort of immerses you deeper into the show and the ambience.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jevvvb/what_are_some_of_your_favorite_disclaimers/"
    },
    {
        "id": "1jescpd",
        "author": "Yogi8156",
        "title": "Unable to watch New movies",
        "content": "Can someone explain the Sony Netflix deal to me? Venom 3 came out, but I can't watch it on their plan with ads. I mean, would they make more money on the ad plan than with no ads? Will I ever be able to watch, or do I just have to upgrade my plan? I don't make that much money, so that's why I got the lowest plan, but this seems unfair.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jescpd/unable_to_watch_new_movies/"
    },
    {
        "id": "1jernos",
        "author": "ThunderChild247",
        "title": "Netflix on Apple TV won’t play WWE content without re-installing app",
        "content": "Is anyone else having this issue?\n\nThis has been happening since WWE came to Netflix. Any time I try to watch Raw, Smackdown or NXT (replay or live), I have to uninstall and re-install the Netflix app. \n\nThe content shows in the menu, I have the “Play with adverts” button, but when I press it, nothing happens. \n\nThe app and the Apple TV is fully up to date. I can play the content on my account on my phone, iPad and TV, but not on the Apple TV. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jernos/netflix_on_apple_tv_wont_play_wwe_content_without/"
    },
    {
        "id": "1jeu35x",
        "author": "gorcbor19",
        "title": "Thoughts on \"Trap\" with Josh Hartnett?",
        "content": "Did you watch the movie? What did you think? \n\n&gt;***Trap*** is a 2024 American [psychological thriller](https://en.wikipedia.org/wiki/Psychological_thriller) film written, produced, and directed by [M. Night Shyamalan](https://en.wikipedia.org/wiki/M._Night_Shyamalan). Starring [Josh Hartnett](https://en.wikipedia.org/wiki/Josh_Hartnett), [Ariel Donoghue](https://en.wikipedia.org/wiki/Ariel_Donoghue), [Saleka Night Shyamalan](https://en.wikipedia.org/wiki/Saleka_Night_Shyamalan), [Hayley Mills](https://en.wikipedia.org/wiki/Hayley_Mills), and [Alison Pill](https://en.wikipedia.org/wiki/Alison_Pill), it follows a serial killer evading a police blockade while attending a concert with his daughter.\n\n&gt;The film was shot in Toronto and Hamilton, Ontario, Canada, in late 2023. It premiered in New York City on July 24, 2024, and was theatrically released in the United States by [Warner Bros. Pictures](https://en.wikipedia.org/wiki/Warner_Bros._Pictures) on August 2, 2024. It received mixed reviews from critics and grossed $82.7 million on a $30 million budget.\n\nI was surprised to see the movie grossed $82.7 million. It was probably the worst movie I've watched in a really long time. The storyline, the acting, the filming, it was all so bad.  ",
        "upvotes": 0,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1jeu35x/thoughts_on_trap_with_josh_hartnett/"
    },
    {
        "id": "1je98fh",
        "author": "Big-Acanthisitta8797",
        "title": "The Recruit",
        "content": "Who else is feeling bummed that there won’t be a Season 3? It’s disappointing when a great show ends too soon, leaving us wanting the next part of the story and characters!",
        "upvotes": 10,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1je98fh/the_recruit/"
    },
    {
        "id": "1jem9o7",
        "author": "x-kraken",
        "title": "How can i get Subtitles downloaded with episodes im downloading?",
        "content": "Hi, When i watch a show or a movie online it have every languages for subtitle and Dub but when i download it i get only two languages, at least i want it to download german with it how can i do that? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jem9o7/how_can_i_get_subtitles_downloaded_with_episodes/"
    },
    {
        "id": "1jem9c4",
        "author": "MysteriousDelay6266",
        "title": "Karma | Official Trailer | Netflix | April 4",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jem9c4/karma_official_trailer_netflix_april_4/"
    },
    {
        "id": "1jehljl",
        "author": "Ordinary_survival",
        "title": "Apple cider vinegar tv series",
        "content": "I watch a  lot of tv shows, but this one got me. I can not even imagine to con people that doesn’t have money, let alone people has any kind of illness. I feel we need an awakement to these kind of profiting! ,and unite against to  these people who think they can profit from sick people.\n\nIf you think it is ok to overlook, think twice. It might be your favourite neighbor, or a very nice neighbor you haven’t met yet. God forbid someone from tour family. So watch it, don’t fool for these “new” treatments. And hope you heal faster than you imagine 🙏🏻",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jehljl/apple_cider_vinegar_tv_series/"
    },
    {
        "id": "1jdh87u",
        "author": "yahooentertainment",
        "title": "The Terrifying Truth Behind Netflix’s ‘Adolescence’",
        "content": "**From The Wrap:**\n\nThe four-part Netflix series [“Adolescence”](https://thewrap.com/tag/adolescence/) is already making waves after its debut on Friday, with many wondering if the tale of a teen who has been accused of killing a female classmate is based on a true story.\n\nThe young boy, played by Owen Cooper, is quickly revealed to be guilty of the crime in the first episode, and the series begins a larger, steeper dive into incel culture and gender violence that has been promoted by influencers such as Andrew and Tristan Tate.\n\n“In the U.K., there’s a real problem with knife crime, certainly in the younger generation. There have been a series of of young boys who were killing young girls with knives, and it was really upsetting,” director Philip Barantini [told TheWrap](https://www.thewrap.com/adolescence-netflix-cast-creators-behind-the-scenes/) this month. “That was the seed that we wanted to explore, and send a bit of a message and maybe spark a bit of a conversation.”",
        "upvotes": 659,
        "comments": 174,
        "media": null,
        "permalink": "/r/netflix/comments/1jdh87u/the_terrifying_truth_behind_netflixs_adolescence/"
    },
    {
        "id": "1je3tto",
        "author": "Robemilak",
        "title": "Happy Gilmore 2 | Official Teaser Trailer | Netflix",
        "content": "",
        "upvotes": 14,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1je3tto/happy_gilmore_2_official_teaser_trailer_netflix/"
    },
    {
        "id": "1jeup3h",
        "author": "railroadintersection",
        "title": "Are 3 Body Problem Aliens stupid?",
        "content": "I'm sorry but how's the concept of lying foreign to a species that can pretty much understand everything we are trying to do scientifically, knows how to read between the lines( realising saul is a threat after vera's mother told him something ). Yet are incapable to understand metaphors and stories? ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jeup3h/are_3_body_problem_aliens_stupid/"
    },
    {
        "id": "1jemafs",
        "author": "StarPrincess101",
        "title": "Recommendations about movies/series that are horror, terror or mystery",
        "content": "Please, recommend movies or series about the following genres:\n\nHorror\nTerror\nMystery\nScifi\n\nI prefer more recommendations about movies. The newer the rec, the better.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jemafs/recommendations_about_moviesseries_that_are/"
    },
    {
        "id": "1jdv0b6",
        "author": "gobsmacked247",
        "title": "I am only 20 minutes into Adolescence, episode one, and I already can’t breathe!!!!",
        "content": "This series is already breaking all the rules.  The acting and camera work is insane.  The story is making me want to scream.  I’m on the edge of my seat and I don’t even know why!!!",
        "upvotes": 58,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1jdv0b6/i_am_only_20_minutes_into_adolescence_episode_one/"
    }
]