[
    {
        "id": "1qh18g5",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 7,
        "comments": 594,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qh18g5/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1qhpxlp",
        "author": "scoreboard-app",
        "title": "Pre Match Thread: UCL Match 7, Real Madrid vs As monaco",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1qhpxlp)",
        "upvotes": 67,
        "comments": 85,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qhpxlp/pre_match_thread_ucl_match_7_real_madrid_vs_as/"
    },
    {
        "id": "1qi4qie",
        "author": "Zee27butt",
        "title": "When is this cringe gonna stop",
        "content": "",
        "upvotes": 227,
        "comments": 86,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w8yjhlm80jeg1.jpeg?auto=webp&amp;s=9cfc979b4552108204e55cba350516f180ba4124"
        },
        "permalink": "/r/realmadrid/comments/1qi4qie/when_is_this_cringe_gonna_stop/"
    },
    {
        "id": "1qi1qe4",
        "author": "Practical-Dentist546",
        "title": "Breakdown of the Vini saga - for those refusing to understand",
        "content": "Vini is underperforming, yes. But it's not the main reason the fans are turning on him. Some people don't want to understand that, and play the \"loyalty\" song and dance as if he's just underperforming a bit. And even if they do understand, they point fingers at other players and do the \"what about\" song and dance.\n\nLast year Vini's behavior got so bad that it directly resulted in our defences being caught out and being scored on... Losing the ball constantly due to egotistic 1v3 attempts, falling on his ass and complaining/gesticulating instead of trying to run back and helping his teammates defend a counter that HE caused.\n\nHow many times did we see an overlapping run from our LB, Vini waiting for the LB to run past him, deciding not to pass to the LB and instead running into three defenders to play the \"hero\" and prove to everyone he deserved the ballon d'Or? He of course always proceeded to lose the ball, and then our opponents had all that free space on their right wing to run into. I've seen this movie more times than I care for.\n\nHow many times have we seen him take a shot when a much better passing option was available? How many times we've seen him get into dick measuring contests with the opposing players and fans, showing \"2 CL titles\" to them etc instead of focusing on his football. More times then I care for.\n\nAfter the ballon d'or snub, he said he'll try 10x harder. He definitely tried 10x harder to make it about himself.\n\nHis presence on the pitch was obviously influenced by his need to prove that he's the guy - instead of focusing on the team's needs. Vulnerable ego, responding to all taunts and any percieved attacks. We were all forgiving for a while because he's a club legend. But after a few months of that, and no end in sight, people started looking to Carlo to perhaps bench his star or tell him to get his act together. Carlo did no such thing. Vini was untouchable.\n\nOnce Xabi came in we saw a more team oriented Vini for a while. Less rolling around on the floor, less mouthing off, higher work rate and helping out in defence. Maybe Vini didn't score a lot of goals, but we were winning as a team.\n\nThen the Classico happened and the dam had broken. Vini could no longer hold it in. He was not the star anymore and he couldn't bear the embarrassment of being taken off. Everything that happened since has been a cascade of that moment. Results started suffering at that point, Vini's attitude started stinking often etc.\n\nLoking back, seeing how there seems to be a cult built around Vini in our club, can you really blame Xabi for trying to \"stay alive\" and play it nice? Not that it helped him ultimately. \n\nThe club seems to be talking about Vini as if there's something they know that we don't. They seem to completely ignore the fact fans have a problem with a selfish attitude that hurts the team, and instead focus on \"his ability\" and coddling him to greatness again. This is extremely concerning given his contract negotiation situation, and the fact he's asking for an astronomical salary.\n\nFans were booing Vini and Florentino, and making their voices heard because of that. Fans that mostly happen to be the owners of this institution, mind you.\n\nSo when someone simplifies this whole saga to a single factor of Vini just being slightly out of form, they are being disingenuous. They support the individual over the needs of the squad. Nobody else would get such special treatment, and that's a fact.\n\nThe fact the rest of the footballing world can clearly see where the issue at Real Madrid is, while our board is doubling down is even more frustrating.\n\nThe issue is not an underperforming player. It's a self centered individual, who the club seems keen on indulging and coddling, while a massive contract extension in the works could prove to be a massive mistake from a sporting and financial standpoint.",
        "upvotes": 154,
        "comments": 51,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qi1qe4/breakdown_of_the_vini_saga_for_those_refusing_to/"
    },
    {
        "id": "1qhr9v3",
        "author": "Ready_Ad_1353",
        "title": "Luis Enrique on the Brahim Diaz Panenka: We talked about it on the bus today. I remember Zidane a football God, who did that during a World Cup”. When it works everyone applauds; when you miss, there’s a lot of criticism.” I know Brahim, he is a magnificent player.”",
        "content": "",
        "upvotes": 571,
        "comments": 41,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ec32aqicmfeg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qhr9v3/luis_enrique_on_the_brahim_diaz_panenka_we_talked/"
    },
    {
        "id": "1qhkqht",
        "author": "dark4403",
        "title": "This video is unbeatable, I'll never forget that night.",
        "content": "",
        "upvotes": 874,
        "comments": 35,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/txwyhmxm6eeg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qhkqht/this_video_is_unbeatable_ill_never_forget_that/"
    },
    {
        "id": "1qhx9qp",
        "author": "tavorasc",
        "title": "Immaculate press conference from Kylian Mbappe today",
        "content": "Just watched Kylian respond with leadership, character, charisma and reflection to heavy questions during a heavy time, he clearly is very mature and focused on the team and club. \n\nSome people are keen into trying to blame him and push him out, clearly those people are as Arbeloa says people with agendas probably not real Madridistas. Kylian behaves in the best standard and I am proud to have him with us.",
        "upvotes": 104,
        "comments": 79,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qhx9qp/immaculate_press_conference_from_kylian_mbappe/"
    },
    {
        "id": "1qhd5t9",
        "author": "Ready_Ad_1353",
        "title": "Brahim Diaz on Instagram:",
        "content": "“My soul hurts. I dreamed of this title because of all the love you guys have given me, every message, every show of support that made me feel like I wasn't alone. I fought with everything I had, with my heart above all.\n\nYesterday I failed and I take all responsibility and apologize from all my heart.\n\nIt will be hard for me to recover, because this wound does not heal easily, but I will try. Not because of me, but for all who believed in me and for all who suffered with me.\n\nI will keep going until one day I can return all this love and be the pride for my Moroccan people.”",
        "upvotes": 848,
        "comments": 116,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5b9f2epgsceg1.jpeg?auto=webp&amp;s=098dbc342c616eba85a19a591f7b22a18cfcce57"
        },
        "permalink": "/r/realmadrid/comments/1qhd5t9/brahim_diaz_on_instagram/"
    },
    {
        "id": "1qhmwri",
        "author": "hueymayne",
        "title": "Handmade Real Madrid rug [OC]",
        "content": "",
        "upvotes": 257,
        "comments": 26,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qhmwri/handmade_real_madrid_rug_oc/"
    },
    {
        "id": "1qhevca",
        "author": "ch1nkkyy",
        "title": "Can't wait for TAA to be back",
        "content": "",
        "upvotes": 579,
        "comments": 66,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/do33ct573deg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qhevca/cant_wait_for_taa_to_be_back/"
    },
    {
        "id": "1qhlmqm",
        "author": "cyrusmancub",
        "title": "Ramos message of support to Brahim: “Only those with the personality to take them miss.”",
        "content": "",
        "upvotes": 255,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qhlmqm/ramos_message_of_support_to_brahim_only_those/"
    },
    {
        "id": "1qhzfi1",
        "author": "OneConsideration1819",
        "title": "Who will be our GK after Courtois?",
        "content": "what the title says, he is getting 34 in may and his contract expires june 2027, even if he renews for another year he will most surely leave the club in june 2028 as he will be 36 by then… also, should he be renewing? (not questioning his abilities)\n\ndo we make lunin our first choice goalkeeper or sign someone else? I personally think lunin has shown that he belongs here and is amazing if not world class himself, the 23/24 ucl campaign was a proof of it, and tbh there will not be any big names on the market anytime soon. lunin’s contract with madrid is until 2030 so im hoping he is here to stay, and start.",
        "upvotes": 23,
        "comments": 72,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qhzfi1/who_will_be_our_gk_after_courtois/"
    },
    {
        "id": "1qhb6c1",
        "author": "AccomplishedWatch834",
        "title": "Excluding CR7,Puskas,Stefano and Raul who is the greatest player of the club?",
        "content": "",
        "upvotes": 584,
        "comments": 332,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mnji8v45gceg1.jpeg?auto=webp&amp;s=ef2427f0dc7268fdc0aff041bdcaacaf9d2ea90e"
        },
        "permalink": "/r/realmadrid/comments/1qhb6c1/excluding_cr7puskasstefano_and_raul_who_is_the/"
    },
    {
        "id": "1qhwbcq",
        "author": "cyrusmancub",
        "title": "Arsenal are monitoring Victor Valdepeñas",
        "content": "He’s one of the names on the Gunners’ shortlist as potential investment for next months, but his future remains in Real Madrid hands.",
        "upvotes": 31,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qhwbcq/arsenal_are_monitoring_victor_valdepeñas/"
    },
    {
        "id": "1qh4856",
        "author": "RMfan987",
        "title": "[Marcos De la Rocha] During Real Madrid training today , Vinicius Jr and Arbeloa seemed to be talking about lateness of some players to the training: Vinicius Jr : “For me, a fine is better.” Arbeloa: “You are the captain.You have to fine people.”",
        "content": "",
        "upvotes": 944,
        "comments": 202,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/e6epi8mc6beg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qh4856/marcos_de_la_rocha_during_real_madrid_training/"
    },
    {
        "id": "1qh3ljf",
        "author": "No-Independent2522",
        "title": "Mbappe: “it’s not Vini’s fault. It’s the fault of the entire squad. That’s all I have to say to the fans. Let them boo the whole team. We have to accept it, it’s our job. We know that. But we can’t single out a few and say it’s their fault. It’s everyone’s fault.”",
        "content": "",
        "upvotes": 899,
        "comments": 186,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BfzmTugOF4C4Kes6OLKUYCGblHuuIxvbpiWgTIVxOMc.jpeg?auto=webp&amp;s=f5455055e88a8667e8ffde01bef7e3466151acf5"
        },
        "permalink": "/r/realmadrid/comments/1qh3ljf/mbappe_its_not_vinis_fault_its_the_fault_of_the/"
    },
    {
        "id": "1qh5lo8",
        "author": "Dangerous_Tip_4985",
        "title": "Some of Cristiano Ronaldo’s insane goals for Real Madrid",
        "content": "",
        "upvotes": 570,
        "comments": 44,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3d9h23tegbeg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qh5lo8/some_of_cristiano_ronaldos_insane_goals_for_real/"
    },
    {
        "id": "1qh31d8",
        "author": "MoreanSwordsman",
        "title": "Carlo Ancelotti watched the game against Levante UD at the Bernabeu",
        "content": "I can’t help but wonder what his thoughts were when he heard the whistles, when he witnessed our team’s inability to perform in the first half, and when he saw that the very boy he had benched almost the entire time had a significant impact on our victory and was named the MVP, after he entered the game in the second half.\n\nSource: Carlo's Instagram. ",
        "upvotes": 664,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4a5l1grcwaeg1.png?auto=webp&amp;s=2b03ad48d5f705ebad282941020cbb3da73bafed"
        },
        "permalink": "/r/realmadrid/comments/1qh31d8/carlo_ancelotti_watched_the_game_against_levante/"
    },
    {
        "id": "1qh5bk3",
        "author": "TheFeatherDiaries",
        "title": "Alvaro Arbeloa on substituting Vinicius Jr during the match or benching him based on his poor run of form : “Take him off? I don’t know if that’s clear enough (to you). He’ll be on the pitch as long as he’s available and performing as he is now. He’s a fantastic, exceptional player.''",
        "content": "",
        "upvotes": 385,
        "comments": 190,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ixdj2uxAKbP22mGMu-Wwc1czkN9VsujUzXAHq1ZRxDs.jpeg?auto=webp&amp;s=1b2a9e098e589a016cdf1aa44d27192d01bce7a5"
        },
        "permalink": "/r/realmadrid/comments/1qh5bk3/alvaro_arbeloa_on_substituting_vinicius_jr_during/"
    },
    {
        "id": "1qgvi3j",
        "author": "Charybd1ss",
        "title": "many Madrid fans were telling me Endrick couldn't play as a right winger?",
        "content": "",
        "upvotes": 1626,
        "comments": 210,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1kfv7lamr8eg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qgvi3j/many_madrid_fans_were_telling_me_endrick_couldnt/"
    },
    {
        "id": "1qi5qwc",
        "author": "Bijay12356",
        "title": "Discussion About Trent",
        "content": "Trent is a very good player but i think Liverpool overused him. He may have surpassed his prime, and he is not that physically fit like he used to be. When he began adapting to his teammates and forming strong connections, his injury came, and Carvajal is most probably going to leave this season. So what do you all think? Should we look for an RB next season, or should we trust him and the Fede duo 🤔 for another season?",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qi5qwc/discussion_about_trent/"
    },
    {
        "id": "1qh8f0o",
        "author": "Tagoony",
        "title": "I get it: Arbeloa’s obsession with Vini is a bit weird but..",
        "content": "I understand why some people think Arbeloa’s constant praise of Vini is a bit weird or over the top. But honestly, I think it’s very intentional and very pragmatic.\n\nVini’s confidence is clearly at a low point right now, and like it or not, this team still needs him firing if we want to win anything meaningful this season. Everything is still wide open, especially with Barca dropping points. The margins at Real Madrid are always thin, and when Vini is hesitant or mentally checked out, our attack looks predictable and toothless.\n\nYes, the criticism he’s getting is fair. His decision-making hasn’t been great, his body language hasn’t helped, and he hasn’t always responded well to pressure. But singling him out endlessly doesn’t help the team. At this stage of the season, it’s not about who was right or wrong, it’s about putting players in the best position to perform.\n\nI genuinely think Arbeloa is trying to protect and empower Vini, not because he’s blind to his flaws, but because he understands how crucial Vini is when he’s confident and decisive. Whether you’re a Vini defender or a critic, the reality is the same: if he plays well, Madrid’s chances improve dramatically.\n\nYou don’t have to like him. You don’t have to excuse everything he does. But right now, backing him is simply the most pragmatic move for the team’s success, and that’s probably all Arbeloa is doing.",
        "upvotes": 157,
        "comments": 58,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qh8f0o/i_get_it_arbeloas_obsession_with_vini_is_a_bit/"
    },
    {
        "id": "1qi423a",
        "author": "No_Page5201",
        "title": "What’s your best eleven",
        "content": "Assuming you had everyone available, what do you think is the best setup for the team? I would say 4-3-3, or some variety of 442. 3-5-2 could be nice but we don’t have enough reliable center backs to be playing 3 of them at a time frankly. \n\nMbappe - Gonzalo - Rodrygo\n\nJude- Arda \n\nTchouameni\n\nCarreras- (Militao) / Dean - Asencio - (Trent) / Fede\n\nThibaut\n\nCaveat being that against high press/higher quality attacking teams you start Camavinga over Güler. \n\nI’d say the biggest question mark is that third center mid spot, Arda seems best to have in there against a low block as he helps with unlocking it and creating chances. Camavinga performances have ranged from very good to terrible, and Fede has largely been average at best when played in the midfield this season. Ceballos occasionally looks like he could help as a Deep-lying playmaker and other times looks out of his depth. \n\nAlternatively you play Mbappe and Gonzalo up top, and a diamond midfield with Jude, Arda, Tchou, and Rodrygo",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qi423a/whats_your_best_eleven/"
    },
    {
        "id": "1qgkkdk",
        "author": "dark4403",
        "title": "BRAHIM DIAZ HAS MISSED THE PENALTY!",
        "content": "",
        "upvotes": 3724,
        "comments": 371,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/cq5aea7ic6eg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qgkkdk/brahim_diaz_has_missed_the_penalty/"
    },
    {
        "id": "1qh83ds",
        "author": "ace-s",
        "title": "Wouldn't the blatant favouritism towards Vini alienate the rest of the players?",
        "content": "The coach and the boards are constantly saying that no matter what Vini will be a starter even if he plays badly.\n\nDon't they realize that this will negatively affect the rest of the players? Why would a player get complete immunity while the rest of the players will have to fight for their spot?\n\nIt is a crazy situation we live in, even players like Bale did not have this immunity.",
        "upvotes": 103,
        "comments": 94,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qh83ds/wouldnt_the_blatant_favouritism_towards_vini/"
    },
    {
        "id": "1qgmc69",
        "author": "Messmers",
        "title": "Endrick vs Brest - Man Of The Match",
        "content": "",
        "upvotes": 2501,
        "comments": 251,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ducnn1x6p6eg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qgmc69/endrick_vs_brest_man_of_the_match/"
    },
    {
        "id": "1qh8oy3",
        "author": "BagOwn7148",
        "title": "Revisionism on Endrick",
        "content": "\"2025: Why wouldn't we buy Estevao instead of this overhyped benchwarmer Endrick.\n\n2026: Why would we sell Endrick the talent to play this useless and inconsistent Mastantuono.\"\n\nF\\*ck this fanbase and its revisionism habit seriously. Feeling happy for Endrick is fine, but we must understand that he is still a very raw and needs a refreshment for his career, not sitting on the bench for the turtle and Gonzalo (who has scored 5 goals since new year, pretty impressive for an academy prospect).\n\nAnd imagine if Mastantuono being loaned out and cooked like Endrick or Paz, this fanbase will cry like a baby and spam endless \"If\" questions.",
        "upvotes": 51,
        "comments": 41,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qh8oy3/revisionism_on_endrick/"
    },
    {
        "id": "1qgpma5",
        "author": "soldier101br",
        "title": "Endrick debut on ligue 1: 1 Assist,1 Man of the Match",
        "content": "",
        "upvotes": 784,
        "comments": 42,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qgpma5/endrick_debut_on_ligue_1_1_assist1_man_of_the/"
    },
    {
        "id": "1qgmb4i",
        "author": "No-Independent2522",
        "title": "Brahim Diaz in tears while getting his golden boot award",
        "content": "",
        "upvotes": 1160,
        "comments": 95,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ayftckj1p6eg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qgmb4i/brahim_diaz_in_tears_while_getting_his_golden/"
    },
    {
        "id": "1qhgh6n",
        "author": "Short_Mousse_6812",
        "title": "The best possible front three",
        "content": "First, we all know our Right Wing is weak. We have mastantuono who is still lacking a lot. We also have Brahim, who is good, but is incredibly inconsistent. So, our main problem is the right flank. We could easily fix this, but for some reason we don’t. First, Mbappe can play on the Right Wing. He has played there more than he has on the left. He played throughout his early PSG career, up to 2019 in the right flank. Many claim he can’t, but he very much can. But, let’s say Mbappe wants to stay as a ST. Then we would have to bring Endrick back, and play him as a RW. Who also played a lot as a RW before coming to Madrid. You just need to watch him play to know his quality and how capable he is of playing Right Wing. Our Front Three could easily be Vini, Mbappe, Endrick. We could rotate them with Rodrygo, Gonzalo and Brahim. We would have good competition, and we would be utilizing Endrick who is a great talent.\n\nEdit: I prefer Rodrygo way more, but the board won’t bench Vini.",
        "upvotes": 13,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qhgh6n/the_best_possible_front_three/"
    }
]