[
    {
        "id": "1lo6q3j",
        "author": "TheTwinAMA",
        "title": "Hi r/movies! We're JC Doler (co-writer/director) and Logan Donovan (lead actor, producer), of the new film \"The Twin\", an Irish folk-horror film about being haunted by yourself. Releasing July 1 on digital and VOD. Want to know how we made $500k look like a lot more? Ask us anything!",
        "content": "We’re the filmmakers behind The Twin, a new folklore-inspired horror film that won the Audience Award for Best Horror Feature at the Austin Film Festival. I’m J.C. Doler, the co-writer and Director, joined by producer and lead actor Logan Donovan. The Twin is about a man struggling with the death of his son when he begins seeing a terrifying figure that looks exactly like himself. It blends psychological horror with Irish folklore. \n\nHere's our trailer:\n\n[https://www.youtube.com/watch?v=eKXNmE5JGBo](https://www.youtube.com/watch?v=eKXNmE5JGBo)\n\nThe film releases on July 1st, distributed by Vertical, and will be available in select theaters and on VOD in North America, and will be available on Shudder later this year. This is our first AMA, and we’re excited to answer anything about indie filmmaking, the horror genre, Irish folklore, festival distribution, or whatever else you’re curious about. Whether it’s the creative process, behind-the-scenes stories, or the challenges of getting an indie horror film out into the world, ask us anything!\n\nBack at 4 PM ET today to answer your questions.\n\n",
        "upvotes": 21,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j22l1ok4y1af1.png?auto=webp&amp;s=36f9e4e6d64172593ab9d8ce11725426fc509471"
        },
        "permalink": "/r/movies/comments/1lo6q3j/hi_rmovies_were_jc_doler_cowriterdirector_and/"
    },
    {
        "id": "1llihwl",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (F1: The Movie / M3GAN 2.0) plus throwback discussions!",
        "content": "**New In Theaters**:\n[F1: The Movie](https://old.reddit.com/r/movies/comments/1lli8lz/official_discussion_f1_the_movie_spoilers/?)\n\n[M3GAN 2.0](https://old.reddit.com/r/movies/comments/1lli8nm/official_discussion_m3gan_20_spoilers/?)\n\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Me, Myself, and Irene](https://old.reddit.com/r/movies/comments/1lli8ox/official_throwback_discussion_me_myself_and_irene/?)\n\n* [Chicken Run](https://old.reddit.com/r/movies/comments/1lli8q9/official_throwback_discussion_chicken_run_spoilers/?)\n\n**Still In Theaters**:\n\n* [28 Years Later](https://www.reddit.com/r/movies/comments/1lfsc91/official_discussion_28_years_later_spoilers/)\n* [Elio](https://www.reddit.com/r/movies/comments/1lfscb2/official_discussion_elio_spoilers/)\n* [The Life of Chuck](https://www.reddit.com/r/movies/comments/1la4c8g/official_discussion_the_life_of_chuck/)\n* [Materialists](https://www.reddit.com/r/movies/comments/1la4c8n/official_discussion_materialists/)\n* [How to Train Your Dragon](https://www.reddit.com/r/movies/comments/1la4c8v/official_discussion_how_to_train_your_dragon/)\n* [From the World of John Wick: Ballerina](https://old.reddit.com/r/movies/comments/1l4gwpn/official_discussion_from_the_world_of_john_wick/?)\n* [The Phoenecian Scheme](https://old.reddit.com/r/movies/comments/1l4gwrc/official_discussion_the_phoenecian_scheme_spoilers/?)\n\n\n**New On Streaming:**\n\n* [KPop Demon Hunters](https://www.reddit.com/r/movies/comments/1lghony/official_discussion_kpop_demon_hunters_spoilers/)\n* [Echo Valley](https://www.reddit.com/r/movies/comments/1lar0eb/official_discussion_echo_valley/) \n* [Deep Cover](https://www.reddit.com/r/movies/comments/1lar0ej/official_discussion_deep_cover/) \n* [Straw](https://www.reddit.com/r/movies/comments/1lar0h7/official_discussion_straw/)\n* [Predator: Killer of Killers](https://old.reddit.com/r/movies/comments/1l5aczx/official_discussion_predator_killer_of_killers/?)\n* [Mountainhead](https://old.reddit.com/r/movies/comments/1l0u3hy/official_discussion_mountainhead_spoilers/?)\n* [Lost in Starlight](https://old.reddit.com/r/movies/comments/1l0u3kg/official_discussion_lost_in_starlight_spoilers/?)",
        "upvotes": 43,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1llihwl/official_discussion_megathread_f1_the_movie_m3gan/"
    },
    {
        "id": "1lo5w4k",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Project Hail Mary'",
        "content": "",
        "upvotes": 3477,
        "comments": 518,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a6spfz2u22af1.jpeg?auto=webp&amp;s=1a9b30b80de57fa2a56b852b3b4e47b0c2cda5b8"
        },
        "permalink": "/r/movies/comments/1lo5w4k/new_poster_for_project_hail_mary/"
    },
    {
        "id": "1lo2i14",
        "author": "PyroxCrymson",
        "title": "AMC Theaters Now Warns Moviegoers About Lengthy Previews Before Films Start",
        "content": "",
        "upvotes": 4206,
        "comments": 819,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Iy6ZO_n6_gn008gOu0l_BgRvDVnoEAs9jEpPUUli6es.jpeg?auto=webp&amp;s=83d2664e5c58babcb3aff19afc1ff7c29ddde0ed"
        },
        "permalink": "/r/movies/comments/1lo2i14/amc_theaters_now_warns_moviegoers_about_lengthy/"
    },
    {
        "id": "1loaxem",
        "author": "MoviesMod",
        "title": "Project Hail Mary - Official Trailer (fair warning, it reveals way too much according to a lot of users)",
        "content": "",
        "upvotes": 943,
        "comments": 277,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4DNij_KXMqEq44ilvf3N8C0zHxUzmORjt98hrEkIM6g.jpeg?auto=webp&amp;s=4662b771d0351cdc0e96e724924456ae417459fa"
        },
        "permalink": "/r/movies/comments/1loaxem/project_hail_mary_official_trailer_fair_warning/"
    },
    {
        "id": "1lo9v7t",
        "author": "MarvelsGrantMan136",
        "title": "New Image from Dan Trachtenberg's 'Predator: Badlands'",
        "content": "",
        "upvotes": 577,
        "comments": 124,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bmt9x1ilx2af1.jpeg?auto=webp&amp;s=aa6c289df8c400721eb9ce9ff6f5b3d7936e15b7"
        },
        "permalink": "/r/movies/comments/1lo9v7t/new_image_from_dan_trachtenbergs_predator_badlands/"
    },
    {
        "id": "1lo8ehb",
        "author": "NoCulture3505",
        "title": "Teenage Mutant Ninja Turtles 35th Anniversary Re-Release Official Trailer",
        "content": "",
        "upvotes": 339,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mSsfiQehATrYBUxjQqMVewFwSHhTlXi7aAUNOu1qReY.jpeg?auto=webp&amp;s=a7737e187e7af5ca60e08962b5f1945cd0fefd03"
        },
        "permalink": "/r/movies/comments/1lo8ehb/teenage_mutant_ninja_turtles_35th_anniversary/"
    },
    {
        "id": "1lo9xf4",
        "author": "JannTosh70",
        "title": "'Apollo 13' at 30: the space movie where scientists have the right stuff too",
        "content": "",
        "upvotes": 260,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3fRSFHYZVYBgKABUUncvPXfLZ18K2bPvtFKSNaAnWnQ.jpeg?auto=webp&amp;s=243334e68f9c799b5fe32678082469f0ac40941b"
        },
        "permalink": "/r/movies/comments/1lo9xf4/apollo_13_at_30_the_space_movie_where_scientists/"
    },
    {
        "id": "1lnzzsr",
        "author": "steviewemyss",
        "title": "Where does Brad Pitt rank among the true acting greats?",
        "content": "Having just come out of seeing Brad Pitt in F1 and really enjoying it, I realised that I’ve seen far more Brad Pitt movies than any other actor or actress. It makes me feel like he’s my favourite actor just by volume of his movies I’ve seen and thought he was great in, however for some reason it feels like a cheesy pick to say he’s my favourite actor compared to the other greats. Do you think he deserves to be considered in that upper echelon of legendary actors, or is he just a Hollywood name? \n\nEdit: I agree with what a lot of the comments are saying that he is a great actor, but bigger movie star. And that despite having gotten his Oscar, he still lacks his magnum opus. ",
        "upvotes": 789,
        "comments": 827,
        "media": null,
        "permalink": "/r/movies/comments/1lnzzsr/where_does_brad_pitt_rank_among_the_true_acting/"
    },
    {
        "id": "1lobb20",
        "author": "SanderSo47",
        "title": "'Jurassic World Rebirth' Review Thread",
        "content": "[Rotten Tomatoes](https://www.rottentomatoes.com/m/jurassic_world_rebirth): 57% (67 reviews) with 5.90 in average rating\n\n[Metacritic](https://www.metacritic.com/movie/jurassic-world-rebirth/): 55/100 (29 critics)\n\nAs with other movies, the scores are set to change as time passes. Meanwhile, I'll post some short reviews on the movie. It's structured like this: **quote first, source second.** Beware, some contain spoilers.\n\n&gt; The blend of physical locations with sets and digital imagery is seamless and the CG work on the creatures is first-rate, notably so in the scary climactic stretch when the lumbering D. Rex joins the fray. Edwards clearly is a devoted Spielberg fan, embedding subtle homages throughout, notably in the open water sequences that recall Jaws. Jurassic World Rebirth is unlikely to top anyone’s ranked franchise list. But longtime fans (count me among them) should have a blast.\n\n-[David Rooney, The Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/jurassic-world-rebirth-review-scarlett-johansson-1236302373/)\n\n&gt; Scenes between Ella and her potentially ill-advised pet, along with tender moments involving several other species, introduce a surprising counter-argument to the earlier “Jurassic” movies: namely, that they have a right to exist. But entertaining as it can be at times, stripped of the silliness that tainted the second trilogy, “Rebirth” doesn’t necessarily make the same case for itself. The movie offers an updated version of the same basic ride Spielberg offered 32 years earlier, and yet, it hardly feels essential to the series’ overall mythology, nor does it signal where the franchise could be headed.\n\n-[Peter Debruge, Variety](https://variety.com/2025/film/reviews/jurassic-world-rebirth-review-1236443872/)\n\n&gt; Needless to say, “Rebirth” doesn’t do itself any favors by so frequently harkening back to the original. Bad as some of the previous sequels have been, none of them have been so eager to measure themselves against Spielberg’s masterpiece. Nothing in this movie is quite as maddening as the second trilogy’s attempt to make audiences invest in a specific Velociraptor (though Edwards half-heartedly tries to sweeten us on an adorable baby Aquilops named Dolores), but the extent to which this franchise is just fending off its own extinction has never been more obvious than it is in during the “Rebirth” sequence that pays homage to the kitchen encounter from the first movie. The “Jurassic” sequels were bad enough when they made an effort to evolve — they’re even less worth seeing now that they already come pre-fossilized.\n\n-[David Ehrlich, IndieWire](https://www.indiewire.com/criticism/movies/jurassic-world-rebirth-review-1235135932/): C–\n\n&gt; There’s a disappointing amount of “same old thing” to Jurassic World Rebirth. Scarlett Johansson, Mahershala Ali, and the rest of the cast are intriguing and sympathetic throughout, but Gareth Edwards doesn’t quite recapture his signature flair for grand-scale visuals nor does David Koepp find the magic of his original Jurassic Park screenplay, opting to follow that movie’s structure as more of a remix than a rebirth.\n\n-[Clint Gage, IGN](https://www.ign.com/articles/jurassic-world-rebirth-review-scarlett-johansson-mahershala-ali): 5.0 out of 10 \"mediocre\"\n\n&gt; So why the hell does this feel so generic, so by-the-numbers, so instantly forgettable? The whole thing resembles the blockbuster version of a readymade, assembled from various, recognizable spare parts and elevated only by virtue of its name. Fans and completists may still get giddy over a ScarJo vs. Dinos showdown, and you should never underestimate the power of giant, toothy jaws chomping down on poor, hapless humans. But long before the big showstopping climax, you’ll start to understand why the movie’s jaded public became bored by what once seemed thrilling and unique. Subtitling this Rebirth seems to have been an act of extreme optimism.\n\n-[David Fear, Rolling Stone](https://www.rollingstone.com/tv-movies/tv-movie-reviews/jurassic-world-rebirth-review-scarlett-johansson-1235372435/)\n\n&gt; This new Jurassic adventure isn’t doing anything so very different from the earlier successful models, perhaps, and I could have done without its outrageous brand synergy product placement for certain brands of chocolate bar. But it feels relaxed and sure-footed in its Spielberg pastiche, its big dino-jeopardy moments and its deployment of thrills and laughs. Maybe the series can’t and shouldn’t go on for ever: we need new and original ideas. This one would be great to go out on.\n\n-[Peter Bradshaw, The Guardian](https://www.theguardian.com/film/2025/jun/30/jurassic-world-rebirth-review-scarlett-johansson-runs-show-as-near-extinct-franchise-roars-back-to-life): 4/5\n\n&gt; “Jurassic” has to live with setting a high bar, of course — the original film revolutionized the industry, a status that “Rebirth” is all too aware of, as seen in its meta theme of dinosaurs becoming old news to a jaded populace. Yet just because cheeseburgers are now available anywhere doesn’t mean that they can’t be damn tasty. “Jurassic Park Rebirth” is just a well made cheeseburger, and whether that’s filling and interesting enough is up to your own appetite. \n\n-[Bill Bria, The Wrap](https://www.thewrap.com/jurassic-world-rebirth-review/)\n\n&gt; “Science is for all of us, not just for some of us,” Dr. Loomis tells Zora, advocating for their work to have a more noble purpose than lining their pockets. That aspirational notion has always sat at the heart of the Jurassic Park films. Jurassic Park Rebirth is one of the more successful and satisfying entries in the franchise precisely because it, uh, finds a way to keep Loomis’ mantra close, foregrounding the film’s sense of wonder above a mere blatant cash grab.\n\n-[Maureen Lee Lenker, Entertainment Weekly](https://ew.com/jurassic-park-rebirth-review-scarlett-johansson-jonathan-bailey-help-franchise-roar-back-11763036): B+\n\n&gt; It might sound like a challenge to believe these humans would sign up to visit a forbidden jungle for guaranteed encounters with truly frightening and gigantic creatures out of another time in order to essentially get blood samples, but if you are game to go with that premise a good time will be had for all. If there is to be an eighth installment, count me in.\n\n-[Pete Hammond, Deadline](https://deadline.com/2025/06/jurassic-world-rebirth-review-scarlett-johansson-spielberg-1236445462/)\n\n&gt; This is a monster-adventure movie, with passages that recall Jaws and King Kong; maybe not the most original influences, but certainly not shabby ones. In its fusion of Edwards’ craft with characters who aren’t thunderously stupid or unlikable, this is the best Jurassic movie in ages – in part because it works so comfortably as an ooh/ahh/run/scream monster movie.\n\n-[Paste](https://www.pastemagazine.com/movies/gareth-edwards/jurassic-world-rebirth-scarlett-johansson-mahershala-ali-gareth-edwards-dinosaurs): 7.0\n\n&gt; “Jurassic World: Rebirth” is a very imperfect film. On one hand, it seems to be recycling every successful character trope and set piece from the franchise, which may be considered lazy and uninspiring, but it is still captivating. Even in its faults, the objective of a “Jurassic Park” film is to scare, thrill, and amaze its audience, and this film does that in its set pieces.\n\n-[Lauren LaMagna, Next Best Picture](https://nextbestpicture.com/jurassic-world-rebirth/)\n\n&gt; There are worse exercises in IP-extension out there in the marketplace. But it is hard to imagine what possible basis there could be for an eighth Jurassic film. We’ve overused the extra-island trope; we’ve done dinos invading the mainland a couple times now. We’ve seen enough long necks poking up from the grass. We’ve seen too many T-rexes thundering after their prey. Now even the oceans have been exhausted. I suppose they could send some dinosaurs to space next time, where no one can hear them roar. But that wouldn’t really make much of a difference: the sound barely registers anymore.\n\n-[Richard Lawson, Vanity Fair](https://www.vanityfair.com/hollywood/story/jurassic-world-rebirth-review)\n\n&gt; To his credit, Edwards immediately injects \"Rebirth\" with a sense of stakes and tension that the entirety of the previous trilogy struggled to depict. But every time the plot kicks in again and writer David Koepp's script goes through the motions of a standard \"Jurassic\" movie, those dizzying peaks soon begin to flatten out into overgrown valleys. For those simply hoping for a watchable movie on the heels of the disastrous \"Dominion,\" your wish has been granted with a safe rehash punctuated by a handful of genuine thrills. For everyone else curious about whether this was the ticket to teaching old dinos new tricks? The inherent limits of the \"Jurassic\" IP are as glaring as ever.\n\n-[Jeremy Mathai, /FILM](https://www.slashfilm.com/1899528/jurassic-world-rebirth-movie-review/): 5.5/10\n\n&gt; And there are some sporadic joys here in the clever sight gags, the sleight of hand, the bait and switch. These moments remind us of the mindless summertime excitement the “Jurassic” movies have long provided, albeit with diminishing returns. But that giant footprint just isn’t as imposing as it used to be. \n\n-[Christy Lemire, RogerEbert.com](https://www.rogerebert.com/reviews/jurassic-world-rebirth-scarlett-johannsson-movie-review-2025): 2/4\n\n&gt; Worst of all, this hoary adventure story is rendered soulless by the blatant product placement: Henry crunching on Altoids, Reuben scolding Xavier for eating too many of their bags of Doritos, and Isabella feeding Twizzlers to her little dino friend. After a while, you may wonder if the entire film was subsidized by the snack food industry. Rebirth even goes so far as setting its final action scene in a long-abandoned but still fully stocked convenience store. How meta: a franchise trying to distract us from how past its sell-by date it is with expired potato chips.\n\n-[Derek Smith, Slant Magazine](https://www.slantmagazine.com/film/jurassic-world-rebirth-review-scarlett-johansson-jonathan-bailey-gareth-edwards/): 1.5/4\n\n&gt; Audiences may not have run out of enthusiasm for what the Jurassic Worlds are selling, or at least they haven’t yet, but the people tasked with making them sure are out of ideas.\n\n-[Alison Willmore, Vulture](https://www.vulture.com/article/review-jurassic-world-rebirth-makes-dinosaur-carnage-dull.html) \n\n____________________________________________________________________________________________\n\n**PLOT**\n\nFive years after the events of *Jurassic World Dominion*, the planet's ecology has proven largely inhospitable to dinosaurs. Those remaining exist in isolated equatorial environments with climates resembling the one in which they once thrived. The three most colossal creatures within that tropical biosphere hold the key to a drug that will bring miraculous life-saving benefits to humankind.\n\n**DIRECTOR** \n\nGareth Edwards\n\n**WRITER**\n\nDavid Koepp\n\n**MUSIC**\n\nAlexandre Desplat\n\n**CINEMATOGRAPHY**\n\nJohn Mathieson\n\n**EDITOR**\n\nJabez Olssen\n\n**RELEASE DATE** \n\nJuly 2, 2025\n\n**RUNTIME**\n\n133 minutes\n\n**BUDGET**\n\n$180 million\n\n**STARRING**\n\n- Scarlett Johansson as Zora Bennett\n\n- Mahershala Ali as Duncan Kincaid\n\n- Jonathan Bailey as Dr. Henry Loomis\n\n- Rupert Friend as Martin Krebs\n\n- Manuel Garcia-Rulfo as Reuben Delgado\n\n- Luna Blaise as Teresa Delgado\n\n- David Iacono as Xavier Dobbs\n\n- Audrina Miranda as Isabella Delgado\n\n- Ed Skrein as Bobby Atwater",
        "upvotes": 121,
        "comments": 167,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gJ1x-u_SQ__tWNxJIYzoqiuQA51YyYQ6LLJYtAiGlu0.jpeg?auto=webp&amp;s=7b78496758cbb3f559b03c04a7e149def1b95024"
        },
        "permalink": "/r/movies/comments/1lobb20/jurassic_world_rebirth_review_thread/"
    },
    {
        "id": "1lo8dfl",
        "author": "DemiFiendRSA",
        "title": "Teenage Mutant Ninja Turtles: The Original Movie to Get 35th Anniversary Theatrical Re-Release on August 17 and 20",
        "content": "",
        "upvotes": 157,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lRUZLZtibw110g2WLoZvVaUy71RkHGjc3M2MOdL2yYw.jpeg?auto=webp&amp;s=7652d8a6a81ae0f7c0bc15e505ec4340534f8f16"
        },
        "permalink": "/r/movies/comments/1lo8dfl/teenage_mutant_ninja_turtles_the_original_movie/"
    },
    {
        "id": "1lnifp6",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Uma Thurman in ‘The Old Guard 2’",
        "content": "",
        "upvotes": 9254,
        "comments": 1020,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/apuneu8n4w9f1.jpeg?auto=webp&amp;s=2b1cbb8346e8453b9f8298d5e7edd04e1450d794"
        },
        "permalink": "/r/movies/comments/1lnifp6/new_poster_for_uma_thurman_in_the_old_guard_2/"
    },
    {
        "id": "1lo4uuq",
        "author": "readonlycomment",
        "title": "Was Donkey Love a legitimate real documentary screened at festivals or is it a hoax?",
        "content": "This \"documentary\" came up in conversation today and we were unable to determine if it was real or just a \"trailer\".  Can anyone shed any light on this? ",
        "upvotes": 175,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rIfR723J6C1RkgUs0cQZGAEUYKqViGUXs8882p0YQrE.jpeg?auto=webp&amp;s=548ab9e3accd6f182dd627430e045ae82334e46b"
        },
        "permalink": "/r/movies/comments/1lo4uuq/was_donkey_love_a_legitimate_real_documentary/"
    },
    {
        "id": "1lnu6w8",
        "author": "Beezneez86",
        "title": "What movie has the best 'character accidentally takes drugs' scene?",
        "content": "I recently rewatched 'Starsky and Hutch' and enjoyed the scene where Ben Stiller's character takes a heap of cocaine accidentally, but I also thought it was a bit silly as they showed him hallucinating and then later on he passes out/falls asleep like he's drunk. Neither of which are effects of cocaine (or so I've heard...)",
        "upvotes": 1231,
        "comments": 1005,
        "media": null,
        "permalink": "/r/movies/comments/1lnu6w8/what_movie_has_the_best_character_accidentally/"
    },
    {
        "id": "1lnwt9t",
        "author": "Entronico",
        "title": "What Actors Were Actual Badasses and Played Badasses?",
        "content": "I'm nominating Robert Mitchum. \n\nRan away from home first at 11.\n\nRan away at 14 and hopped freight cars cross-country. \n\nExpelled from school for mischief and fistfights. \n\nArrested for vagrancy and served on an ACTUAL chain gang. \n\nThen escaped from the chain gang and nearly lost his leg in the process.\n\nIf not his older sister Julie Mitchum he probably would have gone nowhere fast. He moved in with her and accompanied her to her local theater group; where he caught the acting bug. ",
        "upvotes": 578,
        "comments": 510,
        "media": null,
        "permalink": "/r/movies/comments/1lnwt9t/what_actors_were_actual_badasses_and_played/"
    },
    {
        "id": "1lo30k7",
        "author": "Comic_Book_Reader",
        "title": "Troll 2 | Official Teaser | Netflix",
        "content": "",
        "upvotes": 145,
        "comments": 85,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yg6HADQcvY-BgvxJnjLer-MoJ4cWG0zVhIda3oGVsSc.jpeg?auto=webp&amp;s=db9320be45956e878e4e4661d049080e678083eb"
        },
        "permalink": "/r/movies/comments/1lo30k7/troll_2_official_teaser_netflix/"
    },
    {
        "id": "1lo6fj0",
        "author": "NoCulture3505",
        "title": "New Poster for \"Downton Abbey: The Grand Finale\"",
        "content": "",
        "upvotes": 79,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9teodt2j72af1.jpeg?auto=webp&amp;s=9fd4e502ce8f6fdc4cb9221bf788fb8329f69bc5"
        },
        "permalink": "/r/movies/comments/1lo6fj0/new_poster_for_downton_abbey_the_grand_finale/"
    },
    {
        "id": "1lnwcj4",
        "author": "GreenForceTv47",
        "title": "WTH did I watch as a kid?",
        "content": "Hi everyone,\n\n\n\nI’m trying to identify a Yugoslav (or possibly early post-Yugoslav) film I saw as a kid, probably on TV sometime in the late ’90s or early 2000s. The movie itself felt older—likely filmed in the late 1980s or early 1990s, based on the grainy visuals and production quality. It was in color, definitely not black and white.\n\n\n\nHere’s what I remember, as accurately as possible:\n\n\n\n* A man and a woman (she was blonde, maybe in her 30s) are driving at night in a **red car** (possibly a VW Golf, but I’m not certain).\n* They are stopped at a **border checkpoint or police stop** and the man is **beaten** by the officers.\n* Later in the film, **several men invade a house** where the same woman and another woman are staying. There’s a brief conversation, then a **sexual assault occurs**—graphic and with nudity.\n* After the attackers leave, a **young boy comes to the house**, opens the door, and sees the two women **lying unconscious and naked** on the floor.\n\n\n\n\n\nThis scene stuck with me because it aired on TV right after a block of children’s cartoons. As a kid, it completely blindsided me. Now I’m just trying to identify the film for peace of mind, to make sense of what I saw. I talked to my mom about how I was raised by my aunts as a kid when we visited our family home over the summer and I mentioned this stuff. My mom does not believe me. She also told me to prove it by telling her the name of the movie. At first I am like \"The fuck? What kind of logic is that? If I know the name of the movie, my claims are true but if not then I am lying?\" TL;DR This is *not* for any sensational reason—just closure and proving my mom that some of my aunt's on my dad's side are a bit messed up\n\n\n\nIf anyone recognizes this or has any idea what film this might be, I’d be grateful.  \n\n\nThanks in advance.\n\nEDIT: Solved. The movie is vukovar jedna prica",
        "upvotes": 414,
        "comments": 74,
        "media": null,
        "permalink": "/r/movies/comments/1lnwcj4/wth_did_i_watch_as_a_kid/"
    },
    {
        "id": "1lobero",
        "author": "SanderSo47",
        "title": "‘The Devil Wears Prada 2’: Kenneth Branagh Joins With Meryl Streep, Anne Hathaway, Emily Blunt &amp; Stanley Tucci Officially Back",
        "content": "",
        "upvotes": 31,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nHFZJ3Qz7_gpyBbAYZ3RkByhnyGKLvhW1jDEB_BAEU4.jpeg?auto=webp&amp;s=adc693cf574181c911b36c06180658cc7e9b7140"
        },
        "permalink": "/r/movies/comments/1lobero/the_devil_wears_prada_2_kenneth_branagh_joins/"
    },
    {
        "id": "1lo48z4",
        "author": "Express_Classic_1569",
        "title": "The First Movie Ever Made - Workers Leaving the Lumière Factory (1895) By the Lumière brothers",
        "content": "It shows workers leaving a factory. Though simple, it was the first movie shown to a paying audience, marking the beginning of cinema.",
        "upvotes": 81,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZSTBfLSjaiyvlN9AZlXCTXNr8wR_82BkiVqG5TyzWSQ.jpeg?auto=webp&amp;s=4f5d397d70a52496173843ae04ec700ed78dc6b1"
        },
        "permalink": "/r/movies/comments/1lo48z4/the_first_movie_ever_made_workers_leaving_the/"
    },
    {
        "id": "1lo9ueg",
        "author": "darth_vader39",
        "title": "‘Sinners’ and ‘The Studio’ Among Nominations for  Location Managers Guild International Awards",
        "content": "",
        "upvotes": 31,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_RLSYHZHoRUGlFMOQYTgQDXg6sHnVIjLC4dqNjFfaWc.jpeg?auto=webp&amp;s=abd98551f37ac43d9d58d247162d46dd08a9eb5c"
        },
        "permalink": "/r/movies/comments/1lo9ueg/sinners_and_the_studio_among_nominations_for/"
    },
    {
        "id": "1lobcc7",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Roofman' - True story of Jeffrey Manchester (Channing Tatum), a charming armed robber who makes an elaborate escape from prison and takes refuge in a Toys \"R\" Us",
        "content": "",
        "upvotes": 35,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ykuzbhjr73af1.jpeg?auto=webp&amp;s=6e24106a77598724a30cf9d514ba02939ecc7478"
        },
        "permalink": "/r/movies/comments/1lobcc7/official_poster_for_roofman_true_story_of_jeffrey/"
    },
    {
        "id": "1lnj2lh",
        "author": "DemiFiendRSA",
        "title": "‘Fast &amp; Furious 11’ Racing to April 2027 Release",
        "content": "",
        "upvotes": 1572,
        "comments": 466,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DI5yRlMGm93RMxyq2IKwRiSD5v_Kj3F5nsecIAKWv-M.jpeg?auto=webp&amp;s=6390546af3e7f3178bcaa0704987a5ffab03b7c2"
        },
        "permalink": "/r/movies/comments/1lnj2lh/fast_furious_11_racing_to_april_2027_release/"
    },
    {
        "id": "1lo60ew",
        "author": "Kiss_It_Goodbyeee",
        "title": "What song instantly reminds you of a film and then the urge to watch it again?",
        "content": "I was at a restaurant earlier and Dusty Springfield's \"Son of a Preacherman\" came on in the background music and now I want to watch Pulp Fiction. It's not that long ago that I watched it again.\n\nWithout looking it up I couldn't remember the scene it was from, but it is such a distinct song from the film for me.\n\nWhat's your recent experience? New or old.",
        "upvotes": 40,
        "comments": 122,
        "media": null,
        "permalink": "/r/movies/comments/1lo60ew/what_song_instantly_reminds_you_of_a_film_and/"
    },
    {
        "id": "1lobb7a",
        "author": "ProfessionalLevel908",
        "title": "\"elephant 2003\" has the saddest death in a film ive ever seen.",
        "content": "(heavy spoilers) elephant 2003 is a thriller drama that centers around the 1999 columbine shooting. the film follows the victims and perpetrators lives the day before and during the day of the shooting. i dont know why but a character that really stuck with me was michelle. shes shy and barely talks to anyone during the whole movie, shes a good normal person like every other victim in the film. shes the first one to get shot when alex and eric storm the bulding with guns. she hears a shotgun being loaded behind her she turns around and says: \"Hey you gu-\" and gets cut off by a rifle blast and her death is the only reason why people even know she ever existed as she was a person in real life aswell. the film horrifyingly shows how anyones life can be cutoff in a snap of fingers for no reason at all. the second i saw them eric and alex enter the library my stomach dropped becouse i realized every character expect john is gonna die, including her. its fucking depressing.",
        "upvotes": 18,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1lobb7a/elephant_2003_has_the_saddest_death_in_a_film_ive/"
    },
    {
        "id": "1lnvc84",
        "author": "BunyipPouch",
        "title": "'The Twin' - Official Trailer - Irish Folk-Horror - Following the death of his only son, a grieving father is haunted by a terrifying demon known in Irish folklore as the Fetch.",
        "content": "",
        "upvotes": 213,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lev32qoX3OfpY6C8gab2wIIp6K_xUXogx2bdvQ8vK7I.jpeg?auto=webp&amp;s=4bb94572ef59ef8c3dd87ab6ecfc983706fddcd4"
        },
        "permalink": "/r/movies/comments/1lnvc84/the_twin_official_trailer_irish_folkhorror/"
    },
    {
        "id": "1lnulmw",
        "author": "evmasterflash",
        "title": "What is your favorite small role or quick appearance by an actor or actress before they became famous?",
        "content": "For example, one of my favorite instances is Miles Teller’s appearance in Project X as the popular baseball jock who attended the party. I think it’s a fun, small role to look back on that makes me say “woah I didn’t know Miles Teller was in Project X!” I’m sure there are plenty of others that are like that. What comes to mind for you? ",
        "upvotes": 222,
        "comments": 531,
        "media": null,
        "permalink": "/r/movies/comments/1lnulmw/what_is_your_favorite_small_role_or_quick/"
    },
    {
        "id": "1lo7x1s",
        "author": "darth_vader39",
        "title": "Richard Linklater on Overcoming Language Barrier to Direct ‘Nouvelle Vague’: ‘The Sound of Cinema to Me Is French Language With English Subtitles’",
        "content": "",
        "upvotes": 18,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j6HLvlx9In6eRGSUeWhfKfXwnQZ7ymSHb_8BWF0JSvs.png?auto=webp&amp;s=7c26fbab0a947bce94b766bcd62841722175f50a"
        },
        "permalink": "/r/movies/comments/1lo7x1s/richard_linklater_on_overcoming_language_barrier/"
    },
    {
        "id": "1lo96tz",
        "author": "RoutinePlane5354",
        "title": "What’s one movie that you think everyone should watch?",
        "content": "Choose one movie that you think almost everyone would like, learn from, should watch. \nCould be any genre, story-focused/cinematic masterpiece, emotional/thought provoking. Literally anything.\n\nI’ll start:\n\nShawshank Redemption\n\n- incredible cinematography \n- thought provoking story/relatable characters\n- engaging storyline \n- amazing actors\n",
        "upvotes": 13,
        "comments": 73,
        "media": null,
        "permalink": "/r/movies/comments/1lo96tz/whats_one_movie_that_you_think_everyone_should/"
    },
    {
        "id": "1ln7ioq",
        "author": "Gato1980",
        "title": "'It has the appeal of an actual horror': How 'Return to Oz' became one of the darkest children's films ever made",
        "content": "",
        "upvotes": 4144,
        "comments": 241,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2Dce3Awk5chaEDhbzsh7dJSFAapRG-QsHVsjv2QlylM.jpeg?auto=webp&amp;s=5ccdad7dab12e6a96e8234e87afe52c2f346476a"
        },
        "permalink": "/r/movies/comments/1ln7ioq/it_has_the_appeal_of_an_actual_horror_how_return/"
    },
    {
        "id": "1lnfvt3",
        "author": "darth_vader39",
        "title": "Sam Rockwell Was Almost ‘Gonna Be a Star’ in ‘Lean on Me,’ but Was Cut (and Still Gets Residuals)",
        "content": "",
        "upvotes": 758,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/M2ojzFf561U_Re8SovqenFaS5zxgyihv5d3Zl2fmU2s.jpeg?auto=webp&amp;s=a002fe84cd144be26dd4780751732bd1521891e6"
        },
        "permalink": "/r/movies/comments/1lnfvt3/sam_rockwell_was_almost_gonna_be_a_star_in_lean/"
    },
    {
        "id": "1lo9t6g",
        "author": "herequeerandgreat",
        "title": "for a character who only appears in the first shrek movie, lord farquaad has a very big impact on the shrek franchise as a whole.",
        "content": "lord farquaad, the villain of the first shrek movie, is never seen or even mentioned again in the mainline shrek film franchise after the first movie. however, he had a very big and lasting impact on the franchise.\n\nfor starters, him sending shrek on the quest to rescue fiona is what leads to the two of them falling in love and getting married, which naturally leads to everything else. however, if lord farquaad hadn't sent shrek to rescue fiona, prince charming would have rescued fiona and married her, thus the plots of shreks 2 and 3 wouldn't have happened. also, before fiona was rescued, the king and queen were going to make a deal with Rumpelstiltskin to overturn the curse in return for giving him control of far far away. thus it kicks off the plot of shrek forever after.\n\nfor a character who only appears in the first movie and is never seen or mentioned again, lord farquaad sure had a big impact on the series. ",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1lo9t6g/for_a_character_who_only_appears_in_the_first/"
    }
]