[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 11,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1plnb36",
        "author": "MeowLesty1",
        "title": "Qualcuno va al Xmas comics domani?",
        "content": "Hai, primo post che faccio su Reddit. Sarei dovuto andare al Xmas Comics con duei miei amici, ma mi hanno dato buca di brutto per tutti e due i giorni.\n\nQualcuno che ha già i biglietti ha bisogno di un +1 per la giornata? (Sono addirittura in Cosplay, wow!), non ho sbatti di andarci da solo per due giorni di fila :(",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1plnb36/qualcuno_va_al_xmas_comics_domani/"
    },
    {
        "id": "1pldu75",
        "author": "Amazing_Constant_405",
        "title": "ma è possibile che ci siano fuochi d’artificio alle 3 del mattino?",
        "content": "questa cosa è inaccettabile. zona porta susa, sono io che me lo sono sognato o l’ha sentito qualcuno?",
        "upvotes": 15,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1pldu75/ma_è_possibile_che_ci_siano_fuochi_dartificio/"
    },
    {
        "id": "1pljiqc",
        "author": "Extension_Eye_2635",
        "title": "Com'è questa zona in Barriera?",
        "content": "Ciao a tutti, sto considerando di cambiare casa, ho visto qualcosina da queste parti, com'è la zona a livello di sicurezza, servizi, efficienza dei mezzi e rumore notturno? So che di per sé il quartiere non gode di una bellissima reputazione, ma immagino che evitando alcuni punti (che sto cercando di individuare) non sia poi così male. Ora sono in zona san paolo, tra piazza Sabotino e il mercato di corso Racconigi e non mi sono mai trovata male, ho vissuto per anni in zona San Salvario, vicino via Belfiore e a parte un paio di strane apparizioni mi sono sempre trovata bene anche lì\n\nhttps://preview.redd.it/naw77odlly6g1.png?width=1334&amp;format=png&amp;auto=webp&amp;s=baa0e56d7f705541252ba07c9c35c9bdd6e91e25\n\n",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pljiqc/comè_questa_zona_in_barriera/"
    },
    {
        "id": "1pljncj",
        "author": "ProposalPlayful837",
        "title": "Some questions about the city",
        "content": "Hello,\n\nI am interested in learning more about Torino. These are my questions:\n\nHow architecturally beautiful do you think the city is? Do you find it on par with other more famous cities architecture wise?\n\nAbout how many paintings are on view at any given time in Galleria Sabucha?\n\nIs Valentino Park a really beautiful park or is it more average? What about Parco della Pellerina?\n\nAbout how long is needed if you take it slowly in Royal Palace of Turin (excluding Galleria Sabucha), Galleria Sabucha by itself, Egyptian Museum, La Venaria Reale, Palazzina di Caccia di Stupinigi.\n\nAny other museums/palaces that I should know off and how long is needed in each? I like old art and palaces.\n\nThank you in advance!\n\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pljncj/some_questions_about_the_city/"
    },
    {
        "id": "1pljmfd",
        "author": "fsuran",
        "title": "Negozi per regali originali a Torino",
        "content": "Ciao a tutti, oggi mi rechero in centro alla ricerca di regali da fare per natale. Tutti i regali più banali e scontato li ho già comprati, mi mancano un paio di chicche per le persone più care. Sono uno studente e sono a Torino da un paio di mesi, quindi potrei prendere anche qualcosa di tipico.\n\nOltre a questo accetto anche consigli per locali/cose da vedere in centro nel pomeriggio.\n\nGrazie a tutti!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1pljmfd/negozi_per_regali_originali_a_torino/"
    },
    {
        "id": "1pll5ic",
        "author": "Ok_Conflict6394",
        "title": "Ristorante per laurea",
        "content": "Salve, a dicembre mi laureo e vorrei qualche consiglio su dei buoni ristoranti per pranzare una cosa molto intima giusto 4 persone, possibilmente vicino a corso unione sovietica ma va bene dovunque. Grazie in anticipo a chiunque risponda!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pll5ic/ristorante_per_laurea/"
    },
    {
        "id": "1plgtln",
        "author": "fantecto",
        "title": "Pasticceria natalizia",
        "content": "Ciao a tutti, conoscete qualche pasticceria in città che faccia pasticceria natalizia come mostaccioli, paste di mandorla e simili?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1plgtln/pasticceria_natalizia/"
    },
    {
        "id": "1pkndph",
        "author": "Top-Analysis-887",
        "title": "Credete che lo sciopero generale, pur creando disagi (trasporti, servizi), sia ancora oggi uno strumento efficace e necessario per ottenere cambiamenti, oppure credete che il danno superi il beneficio?",
        "content": "",
        "upvotes": 55,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/24glqniunq6g1.png?auto=webp&amp;s=a02325607149a2ee1e062671969b6628c9dbe448"
        },
        "permalink": "/r/torino/comments/1pkndph/credete_che_lo_sciopero_generale_pur_creando/"
    },
    {
        "id": "1pkukks",
        "author": "bookbookitaita5",
        "title": "Ci sono un sacco di cose carine da fare questo weekend a Torino, voi che fate??",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HF4NvlNfWrDXqYOx53YMUOqeR49_rx2MQeI_d-KMNxY.jpeg?auto=webp&amp;s=35b5379f0971880580588a50806415dd4e592843"
        },
        "permalink": "/r/torino/comments/1pkukks/ci_sono_un_sacco_di_cose_carine_da_fare_questo/"
    },
    {
        "id": "1pkln4y",
        "author": "Garaad252",
        "title": "Travel advice: Easiest way from Milan Malpensa to Turin?",
        "content": "Hi guys👋\n\nI’m landing in Milano Malpensa Airport (MXP) – Terminal 1 on 29 December, and I plan to go straight to Turin after I land. I have two pieces of luggage, so I’m looking for the easiest and most comfortable way to get there.\n\nQuestions:\n\n\t1.\tWhat is the easiest option with luggage (bus vs train)?\n\n\t2.\tIs there a direct bus from outside Terminal 1 to Turin (and where does it stop in Turin)?\n\n\t3.\tApproximate prices for bus or train one-way?\n\n\t4.\tShould I book tickets in advance or is it usually okay to buy once I land?",
        "upvotes": 7,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1pkln4y/travel_advice_easiest_way_from_milan_malpensa_to/"
    },
    {
        "id": "1pkwjxr",
        "author": "sturmfrey",
        "title": "anyone going to kybba?",
        "content": "Ciao! \n\nGot my tickets for the night of kybba in torino. Anyone going? Want to get some friends and have fun!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pkwjxr/anyone_going_to_kybba/"
    },
    {
        "id": "1pknzww",
        "author": "Independent_Chip_697",
        "title": "Parchetto di Calisthenics vicino a Vanchiglia?",
        "content": "Ciao gente! Mi sono appena trasferito in zona Vanchiglia, sapete dove posso trovare una zona calisthenics all’aperto ben fornita per fare un po’ di tutto? (Trazioni, dips, addominali)\nSono stato al giardino ginzburg ma non c’è molto lì, giusto la barra per fare trazioni.\nGrazie!!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pknzww/parchetto_di_calisthenics_vicino_a_vanchiglia/"
    },
    {
        "id": "1pklhkb",
        "author": "Similar_Profit_7298",
        "title": "Torino-Borgaro con la AM",
        "content": "Salve ragazzi, vi scrivo perché stavo valutando l'acquisto di una Citroen ami e il percorso giornaliero che farei di più è praticamente quello che fa il Sadem che collega Borgaro all'aeroporto, anche se per raggiungere Torino credo ci siano altre strade percorribili(nel caso consigliatemele), vi scrivo per sapere se \"la strada aeroporto\"(quella che passa per la zona \"industriale\" di Borgaro e che poi passa sopra il campo Rom, finendo davanti all'istituto Grassi e in zona Via Lanzo) sia una strada percorribile con quel mezzo, com'è classificata? Ringrazio già per le risposte.",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1pklhkb/torinoborgaro_con_la_am/"
    },
    {
        "id": "1pkqqrf",
        "author": "fedebusiness",
        "title": "Chi vuole migliorarsi e crescere insieme?",
        "content": "**Ciao a tutti!**  \nIn questo periodo sento il desiderio di conoscere persone nuove, con cui creare rapporti positivi e circondarmi di un ambiente sano.\n\nMi piacerebbe entrare in contatto con chi ha voglia di crescere, confrontarsi e magari aprirsi a nuove esperienze, nuove prospettive o semplicemente trovare un “piano B” per avvicinarsi ai propri obiettivi.\n\nSe anche tu sei in una fase in cui vuoi cambiare qualcosa, migliorarti o ampliare le tue conoscenze… scrivimi pure.  \nMi farebbe piacere conoscere persone sulla stessa lunghezza d’onda.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1pkqqrf/chi_vuole_migliorarsi_e_crescere_insieme/"
    },
    {
        "id": "1pk690h",
        "author": "cinnamon_troll77",
        "title": "Torino ha bisogno di rilanciare l'economia. Qual è, secondo te, il settore (oltre all'auto) su cui la città dovrebbe puntare di più nei prossimi 5 anni?",
        "content": "Synergie cerca 400 operai per la 500 ibrida a Mirafiori. Secondo te, le nuove generazioni a Torino vedono ancora un futuro nell'industria automobilistica o puntano su altri settori (come l'aerospazio, menzionato nell'articolo)?",
        "upvotes": 14,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pjrSvE3mT7Af0umCP1LXGOjdmcCPNH5xRxtrjV9A_nc.jpeg?auto=webp&amp;s=08e52918614cdd3a6ac42a30f32645f3c7c172d6"
        },
        "permalink": "/r/torino/comments/1pk690h/torino_ha_bisogno_di_rilanciare_leconomia_qual_è/"
    },
    {
        "id": "1pk5a8c",
        "author": "Top-Analysis-887",
        "title": "C'è qualcuno che ha già provato un laboratorio o una scuola di ceramica in città e la raccomanda vivamente?",
        "content": "Dove si trova? Quanto dura il corso (un workshop singolo o un ciclo di lezioni)? È stata una bella esperienza? (E cosa siete riusciti a creare?)",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pk5a8c/cè_qualcuno_che_ha_già_provato_un_laboratorio_o/"
    },
    {
        "id": "1pks83x",
        "author": "Aromatic-Gift4353",
        "title": "Migliori sigarette slim?",
        "content": "Come da titolo",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1pks83x/migliori_sigarette_slim/"
    },
    {
        "id": "1pk5o8i",
        "author": "Quentin_T84",
        "title": "Corso di mandarino a Torino",
        "content": "Scuole di lingue che facciano corsi serali di cinese mandarino a Torino?\nXiexie!\n",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pk5o8i/corso_di_mandarino_a_torino/"
    },
    {
        "id": "1pjzgqy",
        "author": "Aviatore_",
        "title": "Piola non turistica in centro",
        "content": "Ciao! Venerdì sera arriverò a Torino con degli amici e volevamo provare la cucina tipica. Mi consigliereste un posto con una buona qualità sui 25/30 euro a persona? Grazie!",
        "upvotes": 5,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1pjzgqy/piola_non_turistica_in_centro/"
    },
    {
        "id": "1pkb8uq",
        "author": "Witty_Raisin9289",
        "title": "Inquiry about the gpa requirements in politecnico di torino",
        "content": "Greetings everyone, i just wanna inquire if the politecnico di torino uni have some gpa requirements to apply in master cs program. \nAnd thanks in advance. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pkb8uq/inquiry_about_the_gpa_requirements_in_politecnico/"
    },
    {
        "id": "1pjvooh",
        "author": "Much-Calendar-7675",
        "title": "Succede qualcosa in piazza a capodanno?",
        "content": "Ciao ragazzi, \n\nDal 31 al 2 vengo a torino con la mia ragazza. Ho studiato a Torino, ma manco da sei anni. \n\nNon amiamo discoteche e ' troppo casino al chiuso ', quindi la nostra idea sarebbe quella di andare a cena magari da Eataly, cosi' non rischiamo inculate varie dai cenoni, e poi un semplice giro da Porta Nuova a Piazza Vittorio. \n\nChe ne dite? Ci sara' qualcosa nelle maggiori piazze o sara' tutto vuoto?",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1pjvooh/succede_qualcosa_in_piazza_a_capodanno/"
    },
    {
        "id": "1pjyiaa",
        "author": "sunurban_trn",
        "title": "Barbieri bravi per cura barba a Torino centro o nord",
        "content": "Ciao a tutti, avete consigli su barbieri bravi con i barboni? Per favore non Torino sud\n\nGrazie!",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1pjyiaa/barbieri_bravi_per_cura_barba_a_torino_centro_o/"
    },
    {
        "id": "1pjejk3",
        "author": "zerozerosettete11",
        "title": "Com'è Torino per i mercatini di Natale?",
        "content": "Una ragazza che sto frequentando tiene molto al Natale e cavolate simili, io per niente. Vorrei accontentarla portandola ad un mercatino di Natale senza però allontanarmi troppo da casa. E magari a Torino avrei pure l'occasione di andarmi a vedere una partita. Che dite, si presta?",
        "upvotes": 61,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n39ctx2kyf6g1.jpeg?auto=webp&amp;s=077ea3a514ed96981ed76151172503a0f9216192"
        },
        "permalink": "/r/torino/comments/1pjejk3/comè_torino_per_i_mercatini_di_natale/"
    },
    {
        "id": "1pjrsdx",
        "author": "nickname1917",
        "title": "Voi da chi preferite essere colonizzati?",
        "content": "Indiani, francesi, milanesi... c'è l'imbarazzo della scelta\n\nhttps://preview.redd.it/xwue22fr3j6g1.png?width=879&amp;format=png&amp;auto=webp&amp;s=639c848a1ee9c3637815493c20ea14d0628e7e3b\n\nhttps://preview.redd.it/yq7t8yer3j6g1.png?width=871&amp;format=png&amp;auto=webp&amp;s=7c13c36217201fe3aeed58a70515bb7da70b886e\n\nNotare che il fatto che l'India si sta comprando Torino ed il Piemonte è riportato come \"Piemonte e India mai così vicini\"  \n",
        "upvotes": 8,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1pjrsdx/voi_da_chi_preferite_essere_colonizzati/"
    },
    {
        "id": "1pjxfbh",
        "author": "Glass_Court7148",
        "title": "Tatuaggi e piercing Walk-In",
        "content": "Ciao! Io e gli altri membri del Tiga siamo felici di annunciarvi che ci troverete Domenica 21 Dicembre per tatuaggi e piercing senza appuntamento!\n\nTroverete tantissimi flash a prezzo scontato o fisso\n\nNon mancate!\n\nVia Gaetano Donizetti, 3 (vicino metro Nizza)",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g4pbjopctk6g1.jpeg?auto=webp&amp;s=b3bb5534f6c6d5801f221a3d7cb7488c4b4b195a"
        },
        "permalink": "/r/torino/comments/1pjxfbh/tatuaggi_e_piercing_walkin/"
    },
    {
        "id": "1pjppb1",
        "author": "mattgwa",
        "title": "International meeting Torino",
        "content": "If you need to make new international friends in Torino and practice languages I organize an international meeting\n\nIt is held every Tuesday at 8pm at Tipsy, piazza Vittorio Veneto 23B, Torino.\n\nThis project is 100% based on volunteering, 100% no-profit and open to everybody.\n\nIt's very useful to connect internationals living or travelling in town and locals, make new friends and practice languages.\n\nHere is the link to our WhatsApp group: [https://chat.whatsapp.com/Glkd55ANFrXD468PVSih8q](https://chat.whatsapp.com/Glkd55ANFrXD468PVSih8q)\n\n... and here's the link to our page on Meetup: [https://www.meetup.com/torino-international](https://www.meetup.com/torino-international)\n\nWhat do you think about my project?",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pjppb1/international_meeting_torino/"
    },
    {
        "id": "1pja3rj",
        "author": "FrancoSerra1712",
        "title": "Torino sta diventando Milano",
        "content": "Ma è possibile che trovare anche solo una stanza per studenti stia diventando proibitivo? \n\nQuando mi sono trasferito 2 anni , ho scelto Torino proprio perche più economica, ma adesso trovare una stanza sui 350/375 max sembra impossibile.\n",
        "upvotes": 33,
        "comments": 42,
        "media": null,
        "permalink": "/r/torino/comments/1pja3rj/torino_sta_diventando_milano/"
    },
    {
        "id": "1pjughl",
        "author": "Future_Doughnut5981",
        "title": "Consigli palestre zona San Paolo",
        "content": "Ciao a tutti! \n\nAbito in zona San Paolo e da gennaio vorrei tornare in palestra. \n\nSia per prezzo che per vicinanza a casa avevo puntato la Orange Rosselli. Qualcuno che ci va sa dirmi com’è? È tanto affollata dalle 17/18 in poi? Ci si riesce ad allenare in 1h30/2h? \n\nSi accettano consigli anche su altre palestre in zona, budget 50€ max al mese. \n\nGrazie mille a chi risponderà ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pjughl/consigli_palestre_zona_san_paolo/"
    }
]