[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1op5qxs",
        "author": "EchoNarwhal812",
        "title": "Which actor completely carried a Netflix show",
        "content": "For me it has to be Rami Malek in Mr. Robot. Even though it originally aired elsewhere, watching it on Netflix now just hits different. The way he plays Elliot awkward, brilliant, paranoid, and somehow still relatable makes the whole show work. Without him, it wouldn’t be half as powerful.",
        "upvotes": 180,
        "comments": 99,
        "media": null,
        "permalink": "/r/netflix/comments/1op5qxs/which_actor_completely_carried_a_netflix_show/"
    },
    {
        "id": "1ope43t",
        "author": "BrideofBazza",
        "title": "Cancel for elderly parents",
        "content": "My parents have moved into assisted living and are no longer using their Netflix account.  Their tv is gone so do t have access. I have no idea what email/phone they used to set it up. \nThey are being charged $24.99/month and I have no idea how to stop it. Any suggestions? \n\n",
        "upvotes": 53,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1ope43t/cancel_for_elderly_parents/"
    },
    {
        "id": "1opcoii",
        "author": "LandscapeNarrow5352",
        "title": "'KPop Demon Hunters 2' Aims for 2029 Release",
        "content": "",
        "upvotes": 33,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1opcoii/kpop_demon_hunters_2_aims_for_2029_release/"
    },
    {
        "id": "1oowdtv",
        "author": "chashows",
        "title": "'Nobody Wants This' Renewed for Season 3 at Netflix",
        "content": "",
        "upvotes": 177,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1oowdtv/nobody_wants_this_renewed_for_season_3_at_netflix/"
    },
    {
        "id": "1opsanm",
        "author": "Specialist-Change-86",
        "title": "I have a theory regarding one of Ginny &amp; Georgia Season 4 cast additions",
        "content": "Sunny Mabrey is playing Daisy, but we don't have a character description for her. Considering Daisy is also Georgia's mother's name, are we getting Ginny's maternal grandmother? What is your theory? Source link:\n\n[https://www.soapcentral.com/shows/ginny-georgia-season-4-added-three-new-members-cast-find](https://www.soapcentral.com/shows/ginny-georgia-season-4-added-three-new-members-cast-find)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1opsanm/i_have_a_theory_regarding_one_of_ginny_georgia/"
    },
    {
        "id": "1opclr7",
        "author": "the_trend_memo",
        "title": "Netflix Reveals Massive Scale of Ad Business: 190 Million Monthly Active Viewers",
        "content": "",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1opclr7/netflix_reveals_massive_scale_of_ad_business_190/"
    },
    {
        "id": "1opjhly",
        "author": "Upstairs-Film-3400",
        "title": "How to stop automatic trailers after show but keep previews on main menu?",
        "content": "Is it possible? I tried un checking the box that says to automatically play previews but it also affects the automatic previews while you're browsing the maine menu. I WANT to see a little preview of each show to give me an idea of it. I do NOT want Netflix to play five billion trailers in a row after my movie is over and I'm either digesting what I just saw or falling asleep or whatever lol. \n\nPlease, is there a way to just change one of these things? Why in the world can't they be separate things in settings? They're definitely two very different things?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1opjhly/how_to_stop_automatic_trailers_after_show_but/"
    },
    {
        "id": "1opjby5",
        "author": "Pretty-Bit-9997",
        "title": "Four Seasons-Nick",
        "content": "I was in disbelief that Nick died until the following episode lol. Life is fast and that was definitely a reality check. That funeral was terrible 😂. Also, how couldn't they afford a nicer funeral and actual burial? \n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1opjby5/four_seasonsnick/"
    },
    {
        "id": "1opn6jx",
        "author": "baguetteworld",
        "title": "Why does Uncle Joe keep speaking English in Rabo de Peixe (Turn of the tide)?",
        "content": "Not sure what the best sub is for posting this question, but Rabo de Peixe is a show about an Azores island in the Atlantic but uses all Portuguese mainland actors. However one of the characters, Uncle Joe, is also the narrator and his character spent a bit of time in the US but now lives back in the same island he was born in. However in the show he keeps speaking English to all the Portuguese characters (I mean he’s also Portuguese himself), and they respond in PT and everyone just chugs along. It just strikes me as very weird when both the actor and the character are supposed to be Portuguese first and foremost. Any idea why?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1opn6jx/why_does_uncle_joe_keep_speaking_english_in_rabo/"
    },
    {
        "id": "1opmkvl",
        "author": "Unlucky-Carpenter9",
        "title": "Boot Camp, Brothers in Arms &amp; a Secret Self—Why Boots is a Must-Watch",
        "content": "Hey all! Just finished watching *Boots* on Netflix and had to jump into r/netflix to share—and I highly recommend it if you haven’t seen it yet.\n\nFirst off: the brotherhood. The camaraderie between recruits under pressure, the friction, the breakdowns, the reunions—every bit of it felt *real*. You’ll find yourself rooting for them when they clash, and cheering when they pull together.\n\nNext: the character work is super nuanced. None of the characters are just “soldiers in training”—each has layers, vulnerabilities, secrets. That makes them all worth your time.\n\nAnd yes—it *does* explore hidden identities. Sgt. Sullivan (played by Max Parker) is this tough-as-nails, by-the-book drill instructor, but beneath the bark there’s a closeted truth, a personal weight. Parker nails it. \n\nWhile the first season sets things up brilliantly, there are still threads left open—so yes, I’m all in for Season 2!!!\n\nIf you’re into shows that blend **military grit + growth + brotherhood + queer undercurrent**, this is your kind of watch.\n\nSo… who else has seen it? Which character struck you the most? And what do you hope to see in Season 2?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1opmkvl/boot_camp_brothers_in_arms_a_secret_selfwhy_boots/"
    },
    {
        "id": "1op3ez5",
        "author": "misterpopculture",
        "title": "Xolo Maridueña Joins Season 3 of Netflix’s One Piece",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1op3ez5/xolo_maridueña_joins_season_3_of_netflixs_one/"
    },
    {
        "id": "1opdtxj",
        "author": "IYAMCANADIAN",
        "title": "Netflix App Won't Launch?",
        "content": "Anyone else had difficulty getting the Netflix App to launch on their new Windows 11 computer?\nAfter days of troubleshooting, and watching endless YouTube videos I discovered the fix.\n\nBecause I despise Microsoft Edge, I had disabled it.  Microsoft Edge is a necessary component to launch the Netflix App.  \n\nHopefully this post will save at least one other person some time and frustration.\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1opdtxj/netflix_app_wont_launch/"
    },
    {
        "id": "1opdpa2",
        "author": "LandscapeNarrow5352",
        "title": "'Overcooked' Reality Competition Series Based On Game Set At Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1opdpa2/overcooked_reality_competition_series_based_on/"
    },
    {
        "id": "1opidk3",
        "author": "Big-University-7198",
        "title": "Show or film recs?",
        "content": "Hi guys, recently got a Netflix account and I’m not sure what the watch! Here are some of my favourite watches for context: \n\nnon- english: \n- evening drink style\n- solitary gourmet \n- dr. romantic \n- panchayat \n\nenglish: \n- gilmore girls \n- gossip girl\n- the 100 \n- superstore\n- b99\n- house\n\n(all are very very basic i know) \nmany thanks, this is just a background of all my favourite tv shows! i mainly like either slice of lifes that are semi boring and peaceful or really really dramatic pieces. no in between. and please No friends, no big bang theory, i tried and hated both! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1opidk3/show_or_film_recs/"
    },
    {
        "id": "1oph1tg",
        "author": "EdmontonBest",
        "title": "Not enough historical/ docudrama content. Why?",
        "content": "Even though they aren’t perfect, Netflix’s docudramas like Roman Empire, The Romanovs, Age of Samurai, Rise of Empire Ottomans inspire me to learn more about history. I like them. But Netflix doesn’t really release them often, despite them being much more cheaper to produce than some of their blockbuster films and shows. I’m happy to see the new drama about President Garfield being released tomorrow, I simply wish they created more historical content regularly in the first place to cater to those who enjoy non-fiction (there’s dozens of us). ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oph1tg/not_enough_historical_docudrama_content_why/"
    },
    {
        "id": "1oomxpo",
        "author": "graemeisverytired",
        "title": "Daniel Craig reads each new Knives Out script like his character - and doesn’t want to have the mystery spoiled for him in advance",
        "content": "“I read them, I suppose, like Benoit... I’m trying to sort of get in Benoit’s head. I don’t read it wanting to know who the murderer is; I want to know what the whole is,\" Craig began. He also added that he told writer-director Rian Johnson, \"I don't want to know!\" when asked by him if he wanted to know who the killer was beforehand. ",
        "upvotes": 63,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oomxpo/daniel_craig_reads_each_new_knives_out_script/"
    },
    {
        "id": "1op557c",
        "author": "scooterdoo123",
        "title": "Netflix account creation/ recovery nightmare",
        "content": "I’ve had an existing Netflix account in 2023, I stopped paying and now I am trying to make another account. I tried hitting forgot password and then I get an error saying I don’t have an account. When I try to sign up I get an error stating that I do already have an account. I contacted support and they basically said they don’t have a solution since my email shows that I never had any existing accounts and when they sent me a sign up link I also get the error that there is an existing account under that email. Has anyone dealt with this before? Image links are below of the error codes during sign up and login. Thank you for any information/help\n\nhttps://imgur.com/gallery/netflix-sign-up-loop-EMRrnTD",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1op557c/netflix_account_creation_recovery_nightmare/"
    },
    {
        "id": "1op9t9y",
        "author": "Havince01",
        "title": "House of dynamite secretary of defence",
        "content": "See lots of posts on the film but literally none in regards the secretary of defence \n\nConsidering was such a sad shocking moment \n\nHe literally couldn't live knowing his daughter was going to be killed in the explosion",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1op9t9y/house_of_dynamite_secretary_of_defence/"
    },
    {
        "id": "1op9kuv",
        "author": "Fraankyy1998",
        "title": "Why won't Netflix play Dr. House on my iPhone?!",
        "content": "All other movies and series play without any problems—except for Dr. House. Every time, the error message BR:10068 appears. \n\nI've already tried restarting both Netflix and my iPhone, but it doesn't help. The problem occurs every time.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1op9kuv/why_wont_netflix_play_dr_house_on_my_iphone/"
    },
    {
        "id": "1oow687",
        "author": "dicklaurent97",
        "title": "Love vs. Nobody Wants This",
        "content": "Does anyone else here remember the show Love from about 10 years ago? It had Britta from Community and a lot of other people who weren't famous at all. The show was about an unlikely romance and wasn't even the first attempt at \"new modern\" romantic comedy in the vein of Annie Hall and When Harry Met Sally; You're The Worst was an earlier attempt at it.\n\n  \nI finished Nobody Wants This and it really reminded me of Love. Anyone else feel this way?",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oow687/love_vs_nobody_wants_this/"
    },
    {
        "id": "1oorxul",
        "author": "Visible_Star_7783",
        "title": "Squid game The challenge S2 enjoying it way more than S1",
        "content": "The characters this time round are way more interesting my favourite player is actually one of the most hated #98 but I enjoy his heart on sleeve personality and the Boston accent hope he wins. The ones I really don’t like is the twins and the dad and daughter they have double the chance to win I don’t think they should allow relatives to play it’s not fair on the single competitors. How you all liking it so far and who would you like to see win?",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1oorxul/squid_game_the_challenge_s2_enjoying_it_way_more/"
    },
    {
        "id": "1op51rb",
        "author": "Historical-Egg-9194",
        "title": "Why is man vs baby trailer not out yet.",
        "content": "The first episode is supposed to come out on December the 11th but I am not seeing any trailer for it does anyone know if the show is still happening and when will the trailer be released \n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1op51rb/why_is_man_vs_baby_trailer_not_out_yet/"
    },
    {
        "id": "1opfhl5",
        "author": "LeakyGaming",
        "title": "13 reasons why spoiler as a new watcher. Thanks Netflix!",
        "content": "I’m almost done with the 1st season of 13 reasons why, I knew literally nothing and haven’t read the books, started 3 days ago. The bigass netflix trailer, “Bryce Walker is dead.” Why have major spoilers like that out in the open?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1opfhl5/13_reasons_why_spoiler_as_a_new_watcher_thanks/"
    },
    {
        "id": "1op13mb",
        "author": "fioredellapassione",
        "title": "Grand Army season 2 / movie",
        "content": "I loved this show and I was hoping that even if it got cancelled will get another season to follow up the events of the first season to shows us the future for the main characters.\nDo you guys believe is there still hope for another season or a movie? I doubt that the characters will still be in high school considering it's been 5 years but at least they can show us a time skip to their college/ work lives + their relationships \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1op13mb/grand_army_season_2_movie/"
    },
    {
        "id": "1oos0hu",
        "author": "LKS983",
        "title": "Farha",
        "content": "I watched this movie for the first time (as it appeared on the 'Leaving Soon' line on Netflix) and recommend it to anyone (like me) **who hadn't really thought** about how this 'war' started.....\n\nThis movie is leaving on the 30th November (where I live) - and is definitely worth a watch.\n\n\n\n",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oos0hu/farha/"
    },
    {
        "id": "1oobnhv",
        "author": "Crowned_Toaster",
        "title": "Recommend your best dystopian movies.",
        "content": "I would like movies like Never Let Me Go, Paradise, or In Time. Any movie is generally fine as long as it's non-horror and no dogs die in said movies (we recently lost our dog).",
        "upvotes": 31,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1oobnhv/recommend_your_best_dystopian_movies/"
    },
    {
        "id": "1oobl1n",
        "author": "Hackedbytotalripoff",
        "title": "Got hooked to the show \"Sinner\"",
        "content": "I have started watching the first season of Sinner. Oh boy,  I got hooked right away.   I was so intrigued by the storyline, the slow pace that provided background for each of the characters, and the acting.   It is a fantastic show, and it is going to keep me busy. Binge-watching it for a while.",
        "upvotes": 23,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1oobl1n/got_hooked_to_the_show_sinner/"
    },
    {
        "id": "1oodnq9",
        "author": "graemeisverytired",
        "title": "Netflix has found its Bon Clay for One Piece and are once again having us hope for more seasons beyond season 3",
        "content": "\"Fans of One Piece will be familiar with Bon Clay as a member of Baroque Works, the infamous criminal organization that plays a key role in [the Alabasta Arc](https://www.thepopverse.com/one-piece-arcs-ranked-best-worst-luffy-wano-country-enies-lobby-water-7-crunchyroll-marineford). Although originally male in the manga and anime, [initial reports around](https://deadline.com/2025/11/one-piece-cole-escola-bon-clay-1236604228/) Cole Escola’s casting of Bon Clay indicate that the character has been reimagined as non-binary to match the actor. A master of disguise with the ability to change their face into anyone with the touch of their hand, Bon Clay is a formidable opponent who eventually becomes a stalwart ally of Luffy and the Straw Hats in later arcs.\"",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oodnq9/netflix_has_found_its_bon_clay_for_one_piece_and/"
    }
]