[
    {
        "id": "1p5g70i",
        "author": "TinselTownAMA",
        "title": "Hi reddit. I'm Chris Foggin, director of the upcoming christmas-comedy TINSEL TOWN. It stars Kiefer Sutherland, Rebel Wilson, and Alice Eve. It's out on December 5th. Ask me anything!",
        "content": "Hi reddit. I'm Chris Foggin, director of the upcoming christmas-comedy TINSEL TOWN. It stars Kiefer Sutherland, Rebel Wilson, and Alice Eve. It's out on December 5th. Ask me anything!\n\nIt stars Kiefer Sutherland, Rebel Wilson, Alice Eve, Derek Jacobi, Katherine Ryan, and Lucien Laviscount.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=ObrcqCxZlPg](https://www.youtube.com/watch?v=ObrcqCxZlPg)\n\n**Synopsis:**\n\nA washed-up Hollywood action star takes a role in a small English village's Christmas pageant. With help from the straight-talking choreographer and quirky cast, he embraces the holiday spirit and reconnects with his estranged daughter.\n\n**Release Date:**\n\n* November 28th (US)\n* December 5th (UK)\n\nAsk me anything! I'll be answering questions at 1 PM ET today, Monday 11/23.",
        "upvotes": 3,
        "comments": 88,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w7e0bz8jb73g1.png?auto=webp&amp;s=e911eff9038517b194fc5d4e4f23832265641de2"
        },
        "permalink": "/r/movies/comments/1p5g70i/hi_reddit_im_chris_foggin_director_of_the/"
    },
    {
        "id": "1p5woeu",
        "author": "SanderSo47",
        "title": "November 21-23 Box Office Recap – 'Wicked: For Good' opens with a fantastic $147M domestically and $223.1M worldwide, the biggest ever debut for a Broadway musical. 'Rental Family' opens with an okay $3.3M, while 'Sisu: Road to Revenge' underwhelms with $2.4M.",
        "content": "https://preview.redd.it/tqle9ifhga3g1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=fd7d9f5ab63a8d215d9d95f969961d633f421465\n\nIt's been some rough months, but there's finally a megablockbuster in theaters.\n\nUnsurprisingly, ***Wicked: For Good*** destroyed a lot of box office records this weekend, including the biggest Broadway adaptation debut. The arrival of such a blockbuster meant everything else was reduced to atoms; nearly all the holdovers in the Top 10 dropped less than 50% this weekend. There was also the arrival of two smaller films, ***Rental Family*** and ***Sisu: Road to Revenge***, none of which posted anything impressive.\n\nThe Top 10 earned a combined $181.5 million this weekend. That's down 9.1% from last year, when ***Wicked*** topped the box office. Even though ***For Good*** opened higher, the weekend lacked a strong second place like ***Gladiator II*** ($55 million) to make up the difference.\n\nDebuting at #1, ***Wicked: For Good*** opened with a fantastic $147 million in 4,115 theaters. Not only higher than ***Wicked*** ($112 million), but it broke so many records. That includes the biggest debut for a Broadway adaptation, the third biggest debut in November (behind ***The Hunger Games: Catching Fire*** with $158 million and ***Black Panther: Wakanda Forever*** with $182 million) and the second biggest debut of the year (behind ***A Minecraft Movie*** with $162 million).\n\nIt doesn't take a genius to see how it opened this high. Last year's ***Wicked*** had an incredible run, closing with $474 million domestically and $758 million worldwide, on top of scoring some big awards. Universal mounted an extensive marketing campaign, which included early access screenings in the days prior to its debut. Not to mention the amount of press junkets and interviews that have been going viral over the past weeks.\n\nWhile there was the belief that splitting the musical into two films was a risky choice, it definitely paid off. There were concerns that ***For Good*** could have some challenges, specifically the idea that the second half of the musical is weaker than the first. But Universal knew how to sell the film, specially highlighting how it would connect with ***The Wizard of Oz***. Even if reviews weren't as favorable as last year (a 70% on RT and 58 on Metacritc).\n\nAccording to Universal, 70% of the audience was female, and 61% was in the 18-34 demographic. Despite the PG rating, only 34% was 25 and under, so clearly it didn't really attract families. Even with the reviews, audiences gave ***For Good*** a great \"A\" on CinemaScore, same grade as its predecessor. ***Wicked*** had great legs, achieving a 4.22x multiplier. Given its high debut, it's unreasonable to expect ***For Good*** to replicate those legs. But at the very least, it should absolutely cross $500 million domestically. Easily Universal's highest grossing film of the year.\n\nIn second place, ***Now You See Me: Now You Don't*** added $8.9 million. That's a rough 57% drop, only slightly ahead of the second film's 58% drop. While it slightly over-performed projections last week, seems like the fans rushed out, and there wasn't much interest from general audiences. Through 10 days, the film has made $36.6 million, and it's now guaranteed to miss $60 million domestically.\n\nAfter its brutal drop last week, ***Predator: Badlands*** had the distinction of being the holdover in the Top 10 with the best drop. It dropped 49%, which translated to a $6.5 million weekend. The film has earned $76.5 million, and it will finish with around $90 million domestically.\n\n***The Running Man*** isn't really running as much as it's collapsing. The film dropped a brutal 65% on its second weekend, earning only $5.7 million. That's Edgar Wright's worst second weekend drop, steeper than ***Last Night in Soho***'s 56.9% drop, and the worst drop in the Top 10. Through 10 days, the film has earned a poor $26.9 million. With more competition on its way, the film is now destined to finish with less than the unadjusted domestic total of the 1987 film ($37 million).\n\nIn fifth place, Searchlight's ***Rental Family*** debuted with $3.3 million in 1,925 theaters. This debut is higher than the wide debut of Brendan Fraser's latest lead role, ***The Whale*** ($1 million), although that was playing in 603 theaters.\n\nThis is an okay, albeit unremarkable debut. Even though he won an Oscar for ***The Whale***, the film didn't make a lot of money domestically, tapping out at $17 million. And ***Rental Family*** didn't have much of a hook; an actor working for a rental family agency isn't exactly an attracting concept for moviegoers. And even with positive reviews (87% on RT), it seems Searchlight changed its plans to position it as its Oscar buzz title after it failed to score anything in TIFF.\n\nAccording to Searchlight, 53% of the audience was female, and 34% was 45 and over. In some great news, they gave it a pretty great \"A\" on CinemaScore, indicating strong word of mouth. It should hold well over the Thanksgiving weekend, but it seems like the film might tap out at $15 million domestically, especially if there's no Oscar buzz to boost it. Regardless, it's not all doom and gloom; ***The Whale*** made 68% of its money outside America, so perhaps ***Rental Family*** could perform better overseas.\n\nIn sixth place, ***Sisu: Road to Revenge*** earned a lukewarm $2.4 million in 2,222 theaters. That's less than the first ***Sisu*** ($3.3 million), and that film was playing in just 1,006 theaters.\n\nGiven its $12 million budget, this is an underwhelming debut. Even though the trailers offered pretty much the same things people loved about the original (brutal WWII action), it seems like audiences were fine with checking it just once. At the end of the day, it's a niche property.\n\nAccording to Sony, a gigantic 81% of the audience was male, and 42% was 45 and over. They gave it a middling \"B\" on CinemaScore, which doesn't indicate good word of mouth. With heavy competition, the film will probably follow the original's short legs. Right now, it'd be a surprise if it made it past $6 million.\n\n***Regretting You*** dropped 57%, adding $1.5 million. The film has earned $47.3 million, and should cross $50 million soon.\n\n***Nuremberg*** dropped 51%, earning $1.2 million this weekend. That takes its domestic total to $10.9 million.\n\n***Black Phone 2*** added $1 million, a rough 60% drop. It has amassed $76.4 million to date.\n\nRounding out the Top 10 was ***Sarah's Oil***, which collapsed 64% for just $801,269. The film's domestic total stands at $10.3 million.\n\nWith horrible word of mouth, Neon's ***Keeper*** vanished from the Top 10. It collapsed a brutal 75%, earning just $628,801. The film has made a very weak $3.9 million, and will officially close with less than $5 million domestically. Basically just half of what ***Longlegs*** did on its first day.\n\nNeon's ***Sentimental Value*** was expanded to 151 theaters, managing to score $616,782. The film has amassed $1.4 million, and it will continue expanding.\n\n#**OVERSEAS**\n\n***Wicked: For Good*** debuted with a pretty great $76.1 million overseas, for a dazzling $223.1 million worldwide debut. The biggest ever debut for a Broadway adaptation. The biggest debuts were in the UK ($24.4M), Australia ($8.6M), Germany ($4.1M), South Korea ($3.8M) and Mexico ($3.7M). The debut was higher than the original ***Wicked***, although this one opened in far more markets. Judging from its performance, it should crack $800 million, but $1 billion doesn't seem likely unless it massively over-performs in Japan, its final market.\n\n***Now You See Me: Now You Don't*** added $32.6 million overseas, taking its worldwide total to $146 million.\n\n***Predator: Badlands*** added $7.2 million overseas, for a $160.2 million worldwide total. It's just a few dollars away froom becoming the highest grossing mainline ***Predator*** film, passing ***The Predator*** ($160.5 million). The best markets are China ($14.5M), the UK ($6.6M), Mexico ($5.2M), France ($4.4M) and Japan ($4M).\n\n***The Running Man*** added $7.1 million overseas, for a weak $48.2 million worldwide total. While it still has major markets like China, South Korea and Japan left, it'll be nowhere close to breaking even.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Gabby's Dollhouse: The Movie* | Sep/26 | Universal | $13,697,595 | $32,011,820 | $79,341,103 | $32M\n*Roofman* | Oct/10 | Paramount | $8,108,861 | $22,739,882 | $32,628,143 | $18M\n*Good Fortune* | Oct/17 | Lionsgate | $6,163,433 | $16,585,758 | $25,618,837 | $30M\n*Shelby Oaks* | Oct/24 | Neon | $2,346,918 | $4,500,052 | $5,683,151 | $1.4M\n\n- DreamWorks' ***Gabby's Dollhouse: The Movie*** has closed with $32 million domestically and $79 million worldwide. Not really a hit, but not a failure. After all, the film is more like advertising for the toys, where the real money is. DreamWorks and Universal are now going to try it again with ***Cocomelon*** in 2027. God save us all.\n\n- Paramount's ***Roofman*** has closed with just $22 million domestically and $32 million worldwide. Even with a name like Channing Tatum attached and a crazy real life story, audiences didn't get much of an excuse to watch this. It's not even director Derek Cianfrance's highest grossing film; it finished below ***The Place Beyond the Pines*** ($47 million).\n\n- Comedies are back? Yeah, doesn't seem like it. Lionsgate's ***Good Fortune*** has closed with an underwhelming $16 million domestically and $25 million worldwide, failing to recoup its $30 million investment. Even with some names like Keanu Reeves, Seth Rogen and Aziz Ansari attached, the audience wasn't particularly hyped for this.\n\n- The audience wasn't ready to get Stuckmannized in theaters. Neon's ***Shelby Oaks*** has closed with $4.5 million domestically and $5.6 million worldwide. Given its low budget, it's certainly profitable, despite its terrible legs. Sold pretty much entirely as Chris Stuckmann's directorial debut, the film had many positive screenings in festivals, but reception dwindled as it got closer to release. He finally got his wish in making a film, but it's now up to him if he really wants to continue. And if he wants to continue, he'll have to re-think on what works and what doesn't.\n\n#**THIS WEEKEND**\n\nIt's Thanksgiving, and it will be a very lucrative weekend.\n\nThe biggest film is obviously ***Zootopia 2***, the sequel to the 2016 film. The cast is back, and it revolves around Judy Hopps and Nick Wilde, who go undercover to pursue Zootopia's new and mysterious reptilian resident Gary De'Snake. ***Moana 2*** opened last year and crossed the $1 billion milestone despite mediocre reception. It's not unreasonable to expect this film to outgross this. Where did this confidence come from? The fact that it's heading for a colossal $200+ million debut in China. It's heading on to become the biggest Hollywood title in the market since the pandemic started. The question isn't if it will cross $1 billion, but how high it can go.\n\nA24 is releasing ***Eternity***, starring Miles Teller, Elizabeth Olsen, and Callum Turner, which follows a woman who must choose between two men with whom to spend eternity in the afterlife. The film has already premiered and has earned some great reviews so far (84% on RT), and the lack of romantic options could help it. A potential sleeper hit?\n\nFocus Features is also releasing Chloé Zhao's ***Hamnet***, starring Jessie Buckley and Paul Mescal, in limited release, ahead of a wide expansion on December 12. The film has earned incredible reviews since its festival debut, winning the People's Choice Award at TIFF, a big precursor for Oscars. Look for this to get one of the year's biggest per-theater averages.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 10,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/luSZ0f6O-ypxOLcFTslcouQioqjNfUqCo75NIOLBr9M.png?auto=webp&amp;s=0711c8475160f73c1b4f92721fdad21242d8c206"
        },
        "permalink": "/r/movies/comments/1p5woeu/november_2123_box_office_recap_wicked_for_good/"
    },
    {
        "id": "1p5uss2",
        "author": "Raj_Valiant3011",
        "title": "Lupita Nyong’o Says Oscar Win for ’12 Years a Slave’ Led to Acting Offers to Play More Slaves; One Offer Included the Pitch: ‘This Time You’re on a Slave Ship!’",
        "content": "",
        "upvotes": 6368,
        "comments": 531,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JuCYbClDCMz9c39ZoRpDGwhRduisQF1qrweU_jse-lA.jpeg?auto=webp&amp;s=d292047bb81100aa8b294342964f9aaa696352a6"
        },
        "permalink": "/r/movies/comments/1p5uss2/lupita_nyongo_says_oscar_win_for_12_years_a_slave/"
    },
    {
        "id": "1p5i4hb",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Glen Powell in 'How to Make a Killing' - Disowned at birth by his obscenely wealthy family, blue-collar Becket Redfellow will stop at nothing to reclaim his inheritance, no matter how many relatives stand in his way.",
        "content": "",
        "upvotes": 3690,
        "comments": 858,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0clot6bkp73g1.jpeg?auto=webp&amp;s=7b764c1801cfea65b4df4524d133d2a45dd37246"
        },
        "permalink": "/r/movies/comments/1p5i4hb/first_image_of_glen_powell_in_how_to_make_a/"
    },
    {
        "id": "1p5w74b",
        "author": "EuphoricButterflyy",
        "title": "Boyz n the Hood (1991)- “It’s Called Gentrification” speech. Directed by John Singleton",
        "content": "",
        "upvotes": 423,
        "comments": 69,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vger75gbda3g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1p5w74b/boyz_n_the_hood_1991_its_called_gentrification/"
    },
    {
        "id": "1p5u5gr",
        "author": "cmaia1503",
        "title": "Scarlett Johansson To Star In New ‘Exorcist’ Movie From Blumhouse-Atomic Monster, Morgan Creek And Universal",
        "content": "",
        "upvotes": 440,
        "comments": 141,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FRoRLcCvIrCjbSOcXUlEi-KCy2BRdxijvuDNnsCvIws.jpeg?auto=webp&amp;s=411e67fad556b1f165f9803ba0c3de28c1729f54"
        },
        "permalink": "/r/movies/comments/1p5u5gr/scarlett_johansson_to_star_in_new_exorcist_movie/"
    },
    {
        "id": "1p5njbd",
        "author": "ChiefLeef22",
        "title": "Brady Corbet says his next movie is an X-Rated epic spanning the 19th century to present day. It will be shot entirely on 70mm",
        "content": "",
        "upvotes": 907,
        "comments": 191,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sBcDly4nN-GxKlap6y1z70LK6Xk0-sHxwdXUfqttAcI.jpeg?auto=webp&amp;s=01b640b7b09f2d7adc0e9d5c2cb88377230255cd"
        },
        "permalink": "/r/movies/comments/1p5njbd/brady_corbet_says_his_next_movie_is_an_xrated/"
    },
    {
        "id": "1p5hxtj",
        "author": "MarvelsGrantMan136",
        "title": "Official Teaser Poster for 'How to Make a Killing' Starring Glen Powell - Disowned at birth by his obscenely wealthy family, blue-collar Becket Redfellow will stop at nothing to reclaim his inheritance, no matter how many relatives stand in his way.",
        "content": "",
        "upvotes": 1215,
        "comments": 194,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mksutb8fp73g1.jpeg?auto=webp&amp;s=9d1b39268bad326945ca7a2af4f1dfae95b3a467"
        },
        "permalink": "/r/movies/comments/1p5hxtj/official_teaser_poster_for_how_to_make_a_killing/"
    },
    {
        "id": "1p5e4vj",
        "author": "Chopper-42",
        "title": "Werner Herzog shares some Fitzcarraldo trivia",
        "content": "",
        "upvotes": 1487,
        "comments": 126,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/etakg589s63g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1p5e4vj/werner_herzog_shares_some_fitzcarraldo_trivia/"
    },
    {
        "id": "1p51luk",
        "author": "MarvelsGrantMan136",
        "title": "Andy Weir says spoiling ‘Project Hail Mary's big surprise in trailers was highly debated and was a marketing decision by Amazon",
        "content": "",
        "upvotes": 15946,
        "comments": 1503,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8JxoL_AX4sdrypYTHKJglXNtDSpExV2qrePqs9OJgMA.jpeg?auto=webp&amp;s=55718096f2b4cafb6ff118ad508dd9a62501c1d4"
        },
        "permalink": "/r/movies/comments/1p51luk/andy_weir_says_spoiling_project_hail_marys_big/"
    },
    {
        "id": "1p5mz9m",
        "author": "imalumberjackok",
        "title": "What is a detail in a movie that you're embarrassed to admit you didn't notice sooner?",
        "content": "I was watching L.A. confidential yesterday. Love the movie. Probably seen it a dozen times. There's a scene towards the beginning where James Cromwell asks Guy Pierce if he would ever plant evidence, beat a confession out of someone or shoot a suspect in the back to see justice done. Pierce answers no. At the end of the movie, he shoots someone in the back so he doesn't get away with it. For some reason I never put those two moments together until yesterday.\n\nAnyone have a similar story?",
        "upvotes": 379,
        "comments": 635,
        "media": null,
        "permalink": "/r/movies/comments/1p5mz9m/what_is_a_detail_in_a_movie_that_youre/"
    },
    {
        "id": "1p5y2tk",
        "author": "ubcstaffer123",
        "title": "‘Hermann Göring loved his kids. That’s what’s terrifying’: James Vanderbilt, Rami Malek and Michael Shannon on Nuremberg",
        "content": "",
        "upvotes": 82,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PeOmRRhClohl955PLsZJ8wMYW8cjcMKPvXqe3GhujpY.jpeg?auto=webp&amp;s=21bf63cc874361f53908cc3cb3e20504cfe430bb"
        },
        "permalink": "/r/movies/comments/1p5y2tk/hermann_göring_loved_his_kids_thats_whats/"
    },
    {
        "id": "1p5oj35",
        "author": "mattbozle",
        "title": "Dead Man's Wire - Official Trailer",
        "content": "",
        "upvotes": 243,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ew_jdAWxd75CfXuWYqDG-mIHDjABSL4vykW2WgMR0s8.jpeg?auto=webp&amp;s=cbc4d67e41813f0818a7a18fdede664bd72930fa"
        },
        "permalink": "/r/movies/comments/1p5oj35/dead_mans_wire_official_trailer/"
    },
    {
        "id": "1p5oqro",
        "author": "Turbulent_Theory6532",
        "title": "What \"America\" Movies Weren't filmed in America",
        "content": "I'm talking about movies made by American film companies that take place in America (or unambiguous setting, or fantasy/Sci-Fi setting) that were not filmed there. My roommate keeps talking about how movies filmed in America about America for Americans are just better than anywhere else in the world. I just want examples of those types of movies that just weren't filmed here.\n\n  \nEdit: Thanks, I knew that most films were filmed else where I just wanted specifics, so I didn't sound as dumb when I made my case.",
        "upvotes": 226,
        "comments": 639,
        "media": null,
        "permalink": "/r/movies/comments/1p5oqro/what_america_movies_werent_filmed_in_america/"
    },
    {
        "id": "1p5m5q7",
        "author": "Ill-Albatross4896",
        "title": "Children of Men (2006) has the best long takes in modern cinema and they’re not just technical flex - they serve the story perfectly",
        "content": "everyone talks about the car ambush scene and the battle of bexhill but those long takes arent just showing off\nthe unbroken shots put you IN the chaos with the characters. you cant look away. you cant catch your breath\nmost action movies cut every 2 seconds to hide bad choreography. children of men forces you to experience everything in real time\nthe scene where theo is walking through the building and the fighting stops when they see the baby gets me every time. that moment only works because of the continuous shot\nalfonso cuaron understood that sometimes the best way to show the stakes is to never cut away\nalso clive owen is criminally underrated in this. his performance is so subtle and exhausted\nthe movie came out in 2006 and still looks better than most action movies today\nif you havent seen it in a while its worth a rewatch just for the cinematography alone",
        "upvotes": 301,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1p5m5q7/children_of_men_2006_has_the_best_long_takes_in/"
    },
    {
        "id": "1p5nmob",
        "author": "Task_Force-191",
        "title": "Ethan Hawke to Receive Career Achievement Award at Palm Springs International Film Festival",
        "content": "",
        "upvotes": 252,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bZs_clZgxLOAWc6rrZPPWFmQ7ucmpBE9qhWoajrvC2I.jpeg?auto=webp&amp;s=bf1747f63978d60f216c5b512df2d74c4782795a"
        },
        "permalink": "/r/movies/comments/1p5nmob/ethan_hawke_to_receive_career_achievement_award/"
    },
    {
        "id": "1p5q1wf",
        "author": "BunyipPouch",
        "title": "Alexandra Shipp To Star In Psychological-Horror 'The Autopsy Of Albert Kemper' - She will play a morgue assistant who faces a terrifying night at work when the body of a notorious serial killer begins to show signs of something beyond death.",
        "content": "",
        "upvotes": 188,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4zBAHlaz3iER3_AFc4d7K86tG0zkeERYfg_A-2qjDcM.jpeg?auto=webp&amp;s=6af61cfa6b16d06cbfc7ea1c0575b88be8591f4a"
        },
        "permalink": "/r/movies/comments/1p5q1wf/alexandra_shipp_to_star_in_psychologicalhorror/"
    },
    {
        "id": "1p5du05",
        "author": "MarvelsGrantMan136",
        "title": "‘Scary Movie 6’ Wraps Filming",
        "content": "",
        "upvotes": 815,
        "comments": 115,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NdsUlmYJQ80Gbf5ILSp1iCujKcn90f1OWiDSfGCvmoA.jpeg?auto=webp&amp;s=5628506072d92a2263aaa91dc187d823c704c62b"
        },
        "permalink": "/r/movies/comments/1p5du05/scary_movie_6_wraps_filming/"
    },
    {
        "id": "1p51r4c",
        "author": "Top_Report_4895",
        "title": "Unbreakable still doesn't get the credit it deserves as one of the great superhero movies",
        "content": "",
        "upvotes": 6920,
        "comments": 417,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aNPVhqG8rtGTlZ7CtUENmWnYQYPDlftzAgGrhcO132s.jpeg?auto=webp&amp;s=159b281d78459f33b8d5285a6bcc2e74bd7048bd"
        },
        "permalink": "/r/movies/comments/1p51r4c/unbreakable_still_doesnt_get_the_credit_it/"
    },
    {
        "id": "1p5kg7m",
        "author": "tcguy71",
        "title": "Variety - The 100 Best Comedy Movies of All Time",
        "content": "",
        "upvotes": 259,
        "comments": 528,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/P4kkv4ImTyo9-cEINuavZUxDqpjP4vcgNWpv5MPayn4.jpeg?auto=webp&amp;s=897d51e14c127f4cf59e75b619c15cfb7e1790ed"
        },
        "permalink": "/r/movies/comments/1p5kg7m/variety_the_100_best_comedy_movies_of_all_time/"
    },
    {
        "id": "1p55uoz",
        "author": "pardis",
        "title": "Three actors screen tested for Avatar. Fox wanted Channing Tatum to star, but James Cameron preferred Sam Worthington.",
        "content": "This is the 40:46 mark of his video interview with Vanity Fair:\nhttps://youtu.be/1Vjd6NmA9Hs?si=n9x9qzr_bfXEBQ2t&amp;t=2446\n\n&gt; And there were three young actors that were really nowhere, kind of in their career at the time. All three of them went on to be movie stars. I had to choose between them, and I did a series of screen tests. First, it was sort of a straight audition. Then I set up real screen tests in sets. Like there was a lab set, and there was a jungle set. And Zoe came in and read with everybody or tested with everybody 'cause she was now our baseline.\n&gt; \n&gt; And Sam was the one I kept going back to. And the studio disagreed. The Fox guys liked the other guys better. You know, I'll say one of 'em was Channing Tatum. So it's like, \"Okay, Channing did, well.\" You know, we're all good with Channing Tatum, right? You know, it could have been Channing Tatum.\n",
        "upvotes": 2326,
        "comments": 280,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nMeZuUK4EvmZvtfjSK1FkYjK2zQTv01Q5Tw34wvL7FI.jpeg?auto=webp&amp;s=53e0302c691b6e5e8b6fbf7f973e065c42a9a5ba"
        },
        "permalink": "/r/movies/comments/1p55uoz/three_actors_screen_tested_for_avatar_fox_wanted/"
    },
    {
        "id": "1p5yrc6",
        "author": "August_West_1990",
        "title": "What Was the First Movie Scene to Truly Disturb You?",
        "content": "For me it was the opening scene of The Untouchables. It may seem time now, but I was about nine when I watched it and it was the first time I ever saw a child die onscreen. I just always thought up until then that they just didn’t show that in movies. How naive I was.\n\nRunner-up would be the melting Nazis in Raiders of the Lost Ark.",
        "upvotes": 35,
        "comments": 166,
        "media": null,
        "permalink": "/r/movies/comments/1p5yrc6/what_was_the_first_movie_scene_to_truly_disturb/"
    },
    {
        "id": "1p5ofyk",
        "author": "LaserDiscCurious",
        "title": "The wife (Bridget Fonda) in Sam Raimi's \"A Simple Plan\" (1998): Evil has never been played more subtly than in this",
        "content": "Bridget Fonda's performance in A Simple Plan is one of my favorite performances in 90s film because she doesn't play her character, Sarah Mitchell, like an over the top baddie. If anything, you assume she's going to be the voice of reason, the one who puts sense to her husband and tries to do the right thing. \n\nInstead, she becomes a Lady MacBeth type of character, increasingly manipulating her husband into trying to keep the money by emotionally blackmailing him. Every time Paxton's Hank realizes it's gone too far, she brings up the struggles they go through, even using her child to dissuade Hank, and then having him turn against his friends because she's so desperate to keep the money bag. \n\nBridget Fonda never got the same critical acclaim as the other Fondas but here, she knocks it out of the park and without being showy or chewing the scenery or screaming. Everything she does is under the guise of calmness and I was impressed by that choice.",
        "upvotes": 87,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1p5ofyk/the_wife_bridget_fonda_in_sam_raimis_a_simple/"
    },
    {
        "id": "1p5gzab",
        "author": "Chief_Cthulhu",
        "title": "Kamen Rider transformation from Shin Kamen Rider: Prologue (1992)",
        "content": "",
        "upvotes": 168,
        "comments": 43,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/sebxio2sh73g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1p5gzab/kamen_rider_transformation_from_shin_kamen_rider/"
    },
    {
        "id": "1p5ts1t",
        "author": "Skin_Ankle684",
        "title": "Bacurau (2020) : I was not ready for how batshit insane this movie was.",
        "content": "Spoilers ahead, obviously.\n\nAfter the success of a couple of new movies in BR national cinema (I'm still here, Secret Agent), i decided to watch bacural. It was awesome, and i think the period it came out didn't allow it to be as popular as it should.\n\nI don't think the comments about the movie being this big political analogy really understand the movie. Most people shown in the movie are cartoonish and simplistic. The movie itself plays with a racist stereotype of northeastern ancertral banditry culture.\n\nThere are a few clues showing that the world of bacural is some hyper-violent dystopia like \"the purge\". So even if the cartoonish characters show real-life racist views, i don't think that's the movie's point.\n\nBacurau is simply making fun of the contrasts between Hollywood movies and Brazillian national movies. It gets some baddies from \"rich people do a human safari\" movies and puts them in a \"northeast is pure suffering\" movie setting with tarantino levels of violence.\n\nI think the element that shows this contrast the most is how nudity is depicted in the movie. The bacuralian nudity is casual, they get naked simply because it's hot outside, while the baddies' sex scene is nearly completely hidden by lighting and clothes. They even verbally comment how weird that is.\n\nThats not a culture thing, surely people in florida walk naked(or in underwear) in their homes when it's hot outside. Its a critique on US cinema, where it's normal to see someone's head get blown up but nudity is this sacred boundary few people cross.\n\nNow, there's a catch. Seeing US foreigners being the baddies and being blown appart in your country *IS* super cathartic. Mostly because 95% of action movies and games out there are about the exact opposite. So lots of audiences out there won't get the same feeling, which is a shame.",
        "upvotes": 37,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1p5ts1t/bacurau_2020_i_was_not_ready_for_how_batshit/"
    },
    {
        "id": "1p5ribp",
        "author": "PinkCadillacs",
        "title": "Wagner Moura’s Closet Picks",
        "content": "",
        "upvotes": 47,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vMGzZ_81ACk4LSOb3REFuzqA6rufUrLo6guxQYPDW7w.jpeg?auto=webp&amp;s=566fbd179594df8ee308348c252ec5646e4b9ddd"
        },
        "permalink": "/r/movies/comments/1p5ribp/wagner_mouras_closet_picks/"
    },
    {
        "id": "1p52ao8",
        "author": "BunyipPouch",
        "title": "Udo Kier, Star of Andy Warhol's 'Frankenstein' &amp; Cult Horror Icon, Dead at 81",
        "content": "",
        "upvotes": 1686,
        "comments": 129,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CiblxOT13zv2iT-WexSJW0EoEGFd2P-Gme69KGG4fJk.jpeg?auto=webp&amp;s=6e59e26f6534755e81b413d6e005c217163e5ef5"
        },
        "permalink": "/r/movies/comments/1p52ao8/udo_kier_star_of_andy_warhols_frankenstein_cult/"
    },
    {
        "id": "1p5nijx",
        "author": "TheBiasedSportsLover",
        "title": "Official Poster for Park Chan-wook's ‘No Other Choice’. Coming to theatres for one night only on December 8",
        "content": "",
        "upvotes": 53,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fo8hdwqzq83g1.jpeg?auto=webp&amp;s=887a9c400f22f0b4292d5a9882c91d3f0451238c"
        },
        "permalink": "/r/movies/comments/1p5nijx/official_poster_for_park_chanwooks_no_other/"
    },
    {
        "id": "1p5wnct",
        "author": "CT-6605",
        "title": "What’s the coolest easter egg you noticed yourself?",
        "content": "I’m talking about easter eggs you noticed yourself while watching a movie, not that you learned about by reading about it. I’ll go first (it’s a long one):\n\nI watched Kanał (1957) today and noticed something incredible. Keep in mind that it was made at a time when Poland was Communist and under a Stalinist government, so censorship was very strong. Anyway, the movie is about the Warsaw Rising, which failed because the Russians intentionally let it fail to weaken resistance for their own occupation of Poland. Obviously, Wajda (the director) could not portray this in the film because of censorship, so he hid a genius easter egg instead. In one scene where a pianist who fights with the rebels finds a piano, he is asked to play it. He begins playing Chopin’s Revolutionary Etude before being quickly told to play something else. This piece was written by Chopin in the 19th century, just after Poland had risen up against Russian occupation and been crushed. The inclusion of this piece in the film was absolutely a direct parallel to this rising caused to fail by the Russians.\n\nThis was an incredible easter egg to notice by myself. What are your similar stories?",
        "upvotes": 18,
        "comments": 30,
        "media": null,
        "permalink": "/r/movies/comments/1p5wnct/whats_the_coolest_easter_egg_you_noticed_yourself/"
    },
    {
        "id": "1p53ija",
        "author": "Dagdegan2000",
        "title": "What’s a movie where the villain is much cooler than the hero?",
        "content": "A lot of movies have a soft or weird or pathetic villain, and a sunglass wearing, one liner slinging hero.\n\nBut what’s a movie where the villain is much cooler than the hero?\n\nI would submit two: Demolition Man, where Stallone’s character is cool yeah but Wesley Snipes is so much cooler.\n\nAlso Face/Off, where, the Castor Troy is a lot cooler than Sean Archer.",
        "upvotes": 1120,
        "comments": 1352,
        "media": null,
        "permalink": "/r/movies/comments/1p53ija/whats_a_movie_where_the_villain_is_much_cooler/"
    }
]