[
    {
        "id": "1ib5zp0",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 34,
        "comments": 2939,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ib5zp0/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1ifhmji",
        "author": "scoreboard-app",
        "title": "[Post Match Thread] Espanyol - Real Madrid",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1ifhmji)",
        "upvotes": 40,
        "comments": 742,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ifhmji/post_match_thread_espanyol_real_madrid/"
    },
    {
        "id": "1ifrgqw",
        "author": "SubjectTumbleweed216",
        "title": "Courtois waiting for Rudiger to finish praying 🤍",
        "content": "",
        "upvotes": 152,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7h418a3baoge1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ifrgqw/courtois_waiting_for_rudiger_to_finish_praying/"
    },
    {
        "id": "1ifib5g",
        "author": "BdBoss_777",
        "title": "Yes we should have played better but when the Negreira league is against you for 90 minutes you can’t really do much. Wtf  is the point of VAR honestly, what happened today is honestly unbelievable.",
        "content": "",
        "upvotes": 633,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i5l3kfcztlge1.jpeg?auto=webp&amp;s=c8e6fb6aa64ba34a0cd5014256536983dbbc086f"
        },
        "permalink": "/r/realmadrid/comments/1ifib5g/yes_we_should_have_played_better_but_when_the/"
    },
    {
        "id": "1ifh0v3",
        "author": "supplementarytables",
        "title": "61' Carlos Romero foul on Kylian Mbappé",
        "content": "",
        "upvotes": 739,
        "comments": 96,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/b23q94lkjlge1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ifh0v3/61_carlos_romero_foul_on_kylian_mbappé/"
    },
    {
        "id": "1ifrms8",
        "author": "Shan107",
        "title": "You guys ready for this legendary defence against City and Atleti??",
        "content": "Alvindi the best attacking LB in modern football \nSalaba the best young ball playing CB in the world \nTchouldini the epitome of positional awareness \nLucafu the most complete RB football has ever seen",
        "upvotes": 120,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vg2fp0ufcoge1.jpeg?auto=webp&amp;s=84fb353eb4357234ca1bcca45d815d742117e6f3"
        },
        "permalink": "/r/realmadrid/comments/1ifrms8/you_guys_ready_for_this_legendary_defence_against/"
    },
    {
        "id": "1iffoem",
        "author": "Finian_mbappe",
        "title": "Espanyol's player was holding Mbappe by his neck to stop him from making a run before Mbappe pushed him away, but the VAR only reviewed the push not the choke hold.",
        "content": "",
        "upvotes": 698,
        "comments": 50,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3w0dr61t8lge1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1iffoem/espanyols_player_was_holding_mbappe_by_his_neck/"
    },
    {
        "id": "1ifpjbx",
        "author": "dark4403",
        "title": "Mbappé's reaction when he was asked about the brutal tackle he received.",
        "content": "",
        "upvotes": 137,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7bnm355uonge1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ifpjbx/mbappés_reaction_when_he_was_asked_about_the/"
    },
    {
        "id": "1ifggj6",
        "author": "DonManjo",
        "title": "Not even a freekick for this challenge",
        "content": "",
        "upvotes": 408,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pcmh0a52flge1.jpeg?auto=webp&amp;s=8acb7f061f652bd9f51c0696e28c50f84de16e8a"
        },
        "permalink": "/r/realmadrid/comments/1ifggj6/not_even_a_freekick_for_this_challenge/"
    },
    {
        "id": "1ifsgf3",
        "author": "VelvtThunder",
        "title": "It's time to run it.",
        "content": "Shit we can have Toni Kroos as our coach too",
        "upvotes": 41,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/eapadn3ymoge1.jpeg?auto=webp&amp;s=6f313de4119533d7e0fb8b5afde95f6659bb3e7a"
        },
        "permalink": "/r/realmadrid/comments/1ifsgf3/its_time_to_run_it/"
    },
    {
        "id": "1ificz8",
        "author": "loadedhunter3003",
        "title": "How are you hating Vini for one not even that bad game where he was trying to make something when no one else was?",
        "content": "This is the most entitled fanbase I've seen cuz jesus christ, the number of games Vini has delivered and bailed us out there is no way people are asking to sell him to Saudi rn just cuz Rodrygo and Mbappe have suddenly found their form for the last few games. Same with Ancelotti out takes, I'm sorry but we have still won 2 ucls in 3 years under him, suffice to say I wanna give him another year and if he doesn't win both this year and next year then cool maybe it is time to let go. Plus Vini wasn't even bad today, he had some good dribbles and chances today, just couldn't get the finishing right. Whenever someone has successful dribbles such as Rodrygo today and Vini against Bayern last year, the fans praise them and say they are keeping true football alive when it is dying and yet as soon as they have one half bad game where they lose the ball a few times, the entire fanbase is ready to ship them off to another country. I can't.",
        "upvotes": 173,
        "comments": 94,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ificz8/how_are_you_hating_vini_for_one_not_even_that_bad/"
    },
    {
        "id": "1ifpuwl",
        "author": "kaizar_Soze",
        "title": "The Board and Not Carlo Ancelotti Is Responsible For The Struggles And The Current Mess",
        "content": "\n\n\n\n\n\nI’m with Carlo on this. In just three years, he’s won two Champions League titles and a La Liga title, yet the club continues to treat him with a lack of respect. Last summer, he  asked for a replacement for Kroos, this is why we were linked to kimmich but the board rejected his request. Now, he’s once again pushing for reinforcements in midfield and at right-back this window, only to be turned down again. It’s unfortunate a manager  who has delivered so much success for this club is being undermined at every turn.\n\nTo make matters worse, every time the team loses a match, there’s immediate speculation in the media—often fueled by sources close to the board—about his job security. This kind of instability is unacceptable, especially when you compare it to how other top clubs operate. Take Guardiola, for example. When Manchester City lost five games in a row, there was never any  discussion about his future. Instead, the club backed him in the January transfer window, spending €200 million to strengthen the squad, and they’re now on the verge of signing another midfielder for €60 million.\n\nThis lack of respect for managers who has won a lot for the club is exactly why Zidane left. The board seems to take success for granted, failing to recognize that maintaining dominance requires consistent investment and trust in the manager’s vision. While players like Vazquez and Ceballos are valuable squad members, they’re not at the same level as Carvajal or Kroos. Expecting the team to perform at the highest level without addressing these gaps is unrealistic and unfair to both the manager and the players.\n\n",
        "upvotes": 54,
        "comments": 52,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ifpuwl/the_board_and_not_carlo_ancelotti_is_responsible/"
    },
    {
        "id": "1ifhyv5",
        "author": "SubjectTumbleweed216",
        "title": "Espanyol winning goal",
        "content": "",
        "upvotes": 147,
        "comments": 95,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5gtoj1l3rlge1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ifhyv5/espanyol_winning_goal/"
    },
    {
        "id": "1ifif8r",
        "author": "Inevitable_Sky398",
        "title": "Serious question: Why does Tchouameni keeps starting",
        "content": "Nothing sarcastic please. I want a genuine explanation.\n\nIf this was Militao, I would understand ! Militao can make brain farts and dangerous mistakes, but he is very good ! Not as reliable as Rudiger, but he has so much heart on the field, he is good in aerial duals, he is fast...\n\nI'm not saying that this game was entirely on Tchouameni.. whole team played horrible minus a couple of ones... but I really don't understand this obsession of starting him. The Bernabeu have had enough and sent a message to both him AND Ancelotti by whistling them in the Celta Vigo game.\n\nBernabeu is not reactionary, but very demanding, they even whistled CR7... they are still supportive though. It clearly looks like they know Tchouameni this season has been ASS.. he plays one good game every 5 games and he gets to start, either as DM or as CB.. and he has been ASS in BOTH... and yet.. he keeps starting.\n\nI understand that our bench is not exactly stacked in defense, but come on, we have all seen how capable Asencio is... today.. both him and Fran had to deal with a long ball and an Espanyol player pressing, Fran cleared it without overthinking and Asencio elegantly returned safely to Courtois... Tchouameni tried to kong fu kick it and almost resulted in a dangerous chance..\n\nWhat does Ancelotti see in this player ? He has been good last season, I remember he was even better than Nacho as CB in the FIRST HALF of the season, when Nacho kept making mistakes and sent off.. is he trying to give him confidence, kinda like what he did last season with Nacho ? I genuinely want to understand.. or are those Perez orders, because he is a 100k euros player ?\n\nPS : So apparently he is a Xabi Alonso or Busquets in CDM position as many here are pointing that he is good in that position, then I'm watching the wrong games... I believe you should go and watch the Barça game, Milan game, Lille game, Bilbao game... and tell me what the fuck you saw there from CDM Tchouameni. It's like the same lazy excuse of Mbappé not playing in his natural position on the left when he was doing bad in the first start of the season",
        "upvotes": 133,
        "comments": 72,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ifif8r/serious_question_why_does_tchouameni_keeps/"
    },
    {
        "id": "1ifr7fg",
        "author": "LosBlancosSR4",
        "title": "Former Real Madrid Basketball Star (and Madridista) Traded to the Lakers in Blockbuster Trade",
        "content": "",
        "upvotes": 28,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/avf0NrbD6O2HHPGwYoLwMUYAkhXMoNBjUfAcpiDtLeU.jpg?auto=webp&amp;s=d3e10f321818b801eedce2cbc730c839a99356f5"
        },
        "permalink": "/r/realmadrid/comments/1ifr7fg/former_real_madrid_basketball_star_and_madridista/"
    },
    {
        "id": "1if8t38",
        "author": "SubjectTumbleweed216",
        "title": "[relevo] 🚨 Madrid works to renew Vinicius Jr beyond 2027, with salary improvement",
        "content": "",
        "upvotes": 348,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SVo4EAucRqBps7bxxEW-4ux83h3aLJPeHHa7fQkLAxs.jpg?auto=webp&amp;s=73365a222f782c8b0a083e3ab1584a0332786bc1"
        },
        "permalink": "/r/realmadrid/comments/1if8t38/relevo_madrid_works_to_renew_vinicius_jr_beyond/"
    },
    {
        "id": "1ifgkxh",
        "author": "TheGhost5322",
        "title": "Imagine if this was a goal!",
        "content": "",
        "upvotes": 98,
        "comments": 7,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/c2nm1s31glge1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ifgkxh/imagine_if_this_was_a_goal/"
    },
    {
        "id": "1iff1dq",
        "author": "scoreboard-app",
        "title": "Match Thread: Espanyol Barcelona vs Real Madrid Live Score | La Liga (Spain) | Feb 1, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1iff1dq)",
        "upvotes": 81,
        "comments": 3661,
        "media": null,
        "permalink": "/r/realmadrid/comments/1iff1dq/match_thread_espanyol_barcelona_vs_real_madrid/"
    },
    {
        "id": "1ifnrtn",
        "author": "Total_Escape_9778",
        "title": "Why does Mbappe become so shy while playing with Vini?",
        "content": "Like with rodrygo, mbappe had a perfect chemistry and we created a lot of chances. With vini tho, mbappe becomes a bit reserved and tries not to interrupt him by shifting towards the right wing... I mean that's quite unlike the mbappe I thought when I heard the news about him at PSG. I wuld say that mbappe is like suprisingly not selfish enough. Is it because of his low-confidence due to poor form few months ago?? Cz vini and mbappe really need to sort our their chemistry for us to win the games\n\nAlso, apart from vazquez and tchouameni not being natural defenders, I feel vini and bellingham have been a bit selfish in past few games. I mean no hate to them, they were the main players last season when we won so many trophies but both of 'em kinda got like a main character syndrome. Vini always wants to dribble even when there are better options (plus ceballos literally didn't even pass vini today for some reason) and bellingham camps lots of times inside the box as a striker when he should be the one making passes. He even plays further than mbappe a lot of times due to which valverde and ceballos are left alone. He also takes a lot of bullshit shots, I mean I get it he in hungry for a goal but he needs to think about the team first\n\nMoreoever, I dunno wut the hell is our tactic apart from playing passes and hoping for a miracle play. We have the best players in the world, our manager needs to do much better than this. We literally had 5 shots on target before their goals... after 85 minutes!\n\nFinally, we risk a lot of injuries and suspensions at this point like bellingham, rudiger and valverde just because ancelotti isn't rotating the squad.",
        "upvotes": 17,
        "comments": 40,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ifnrtn/why_does_mbappe_become_so_shy_while_playing_with/"
    },
    {
        "id": "1ifmsq4",
        "author": "PeggingPotatoe",
        "title": "My takeaways from this season so far...",
        "content": "1. Ancelotti's time at Madrid is done.  Is unable to adapt and his favoritism is playing against us. I'll be grateful for all he has done for us, from 2013 up till now, but the club and team come first.\n\n2. Madrid's recruitment strategy needs to change. I understand wanting to sign young players and getting others for free, however, but not having an RB and refusing to buy a CB for added depth are mistakes that have let down the team, and fans. Believing that \"we are Madrid, so anyone will come for us\" is not good enough. We missed Yoro because we didn't want to go for a higher fee when we needed depth. And waiting for Trent till summer just for him to come free could be interpreted as giving up this season (though, thankfully, I don't believe that to be the case.\n\n3. Madrid needs to use Castilla more. We can't depend on signing players every single time, especially on seasons where the Perez doesn't want to sign anyone just so he can get his new toy come summer.\n\n4. Either Perez controls his ego or the debacle of this season will repeat itself in the future. The influence he has on the starting XI is unquestionable, and not respecting the opinion of your manager on whom to sign is questionable at best.\n\n5. Either move Tchoumani to DM or sell him. I believe there's still a good player in there, but either move him up to DM so we can find that out, or sell him. I do believe he still is useful as a CB, just not against strong opposition.\n\n6. Vasquez ain't good enough.\n\n7. Vini needs to work on his communication on the pitch with Fran. Refuses to pass to him at all, which is frustrating as he is losing a lot of balls this season due to thinking he has to get the tam put of trouble by himself.\n\n8. Mbappe and Rodrygo work together, but only when they're ST and LW respectively. This also helps Bellingham and the attack feel more organised withoucu excessive overloads.\n\n9. Ceballos Is good against weak teams, don't see him as a solution in midfield against stronger teams.\n\n10. We desperately need for Camavinga to step up his game. I love him, and I believe he has the hunger and talent to become our best player. Injuries and a bad run of form have played against him.\n\nTo end, despite my criticism, I believe that the team will push through. Doubt we will win UCL, but do have a strong chance to win La Liga. Despite not being a good team this season, great players have helped with giving us a fighting chance.\n\nHala Madrid ",
        "upvotes": 18,
        "comments": 19,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ifmsq4/my_takeaways_from_this_season_so_far/"
    },
    {
        "id": "1ifcfcp",
        "author": "R0otDroid",
        "title": "Starting 11 against Espanyol.",
        "content": "Fran and ceballos start.",
        "upvotes": 81,
        "comments": 127,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bxa1IDLjiudK7k22gEbWJgyfjM6iyuNHjJItckegKlg.jpg?auto=webp&amp;s=7d9e02d6f5bf9ea9012ebe75caf7756a85603b8b"
        },
        "permalink": "/r/realmadrid/comments/1ifcfcp/starting_11_against_espanyol/"
    },
    {
        "id": "1ieynex",
        "author": "Charybd1ss",
        "title": "Cristiano Ronaldo - 2016/17 UCL Campaign",
        "content": "",
        "upvotes": 589,
        "comments": 55,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8kkk8ngeigge1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ieynex/cristiano_ronaldo_201617_ucl_campaign/"
    },
    {
        "id": "1if7l4w",
        "author": "BIPBAP88",
        "title": "Would facing Man city just 3 days after facing Atletico cause us problems?",
        "content": "I would like the players to rest so they can be in great form facing man city away, but at the same time l wouldn't want the team to drop points against Atletico since they are right behind us in La Liga.\n(Madrid vs Atletico 8/2/2025)=&gt;(Man city vs Madrid\n11/2/2025)\nWe can’t afford a loss to Atletico since they will be behind us by a single point and Barcelona behind us by 4. ",
        "upvotes": 69,
        "comments": 44,
        "media": null,
        "permalink": "/r/realmadrid/comments/1if7l4w/would_facing_man_city_just_3_days_after_facing/"
    },
    {
        "id": "1ifb3ju",
        "author": "lordprettyflacko10",
        "title": "How to fix patch on Jersey",
        "content": "Hey guys, I didn’t know the proper way to wash jerseys and I messed up the UCL patch and fifa patch on the 2023 jersey where we won the UCL. Do you guys have like a hack or know a site where they can repair it? I’ll attach a photo for reference ",
        "upvotes": 36,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ifb3ju/how_to_fix_patch_on_jersey/"
    },
    {
        "id": "1iera3o",
        "author": "dark4403",
        "title": "🗣️ Vinícius Jr: \"Florentino has always trusted me when I was a child and nobody knew me, I have a great affection for him because he has always said Vini is going to play in Madrid forever, it is an honour for me.\"",
        "content": "",
        "upvotes": 914,
        "comments": 25,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7a7xgsqdoege1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1iera3o/vinícius_jr_florentino_has_always_trusted_me_when/"
    },
    {
        "id": "1iep8j4",
        "author": "Inomora",
        "title": "How this draw had me feeling",
        "content": "",
        "upvotes": 730,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vch6raoo8ege1.png?auto=webp&amp;s=43909d5542a93e85bdf0ce828afd2d9acfc829b1"
        },
        "permalink": "/r/realmadrid/comments/1iep8j4/how_this_draw_had_me_feeling/"
    },
    {
        "id": "1ifhmll",
        "author": "soccer-stats",
        "title": "Post Match Stats: Espanyol vs Real Madrid",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1ifhmll)",
        "upvotes": 6,
        "comments": 26,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ifhmll/post_match_stats_espanyol_vs_real_madrid/"
    },
    {
        "id": "1ieejkz",
        "author": "Ranvir24",
        "title": "Every Madrid fan after we drew with city",
        "content": "",
        "upvotes": 2985,
        "comments": 116,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jfomtj4txbge1.jpeg?auto=webp&amp;s=5afd0eb11397e6c3b857f4f8461ae3eb7a6ec45b"
        },
        "permalink": "/r/realmadrid/comments/1ieejkz/every_madrid_fan_after_we_drew_with_city/"
    },
    {
        "id": "1ifidpc",
        "author": "chui77",
        "title": "[Post Match Survey] Real Madrid 0-1 Espanyol",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ce_WtwWk9LyEGycYQpALNBMwcuszud1J2rvK8Gk-PgY.jpg?auto=webp&amp;s=b78231e306862c85e6ead2f0c0ea7afeeb0ead95"
        },
        "permalink": "/r/realmadrid/comments/1ifidpc/post_match_survey_real_madrid_01_espanyol/"
    },
    {
        "id": "1ieyu0z",
        "author": "chui77",
        "title": "[Post Match Survey Results] Real Madrid 3-0 Brest",
        "content": "",
        "upvotes": 97,
        "comments": 30,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ieyu0z/post_match_survey_results_real_madrid_30_brest/"
    },
    {
        "id": "1iecn6x",
        "author": "Finian_mbappe",
        "title": "REAL MADRID VS MANCHESTER CITY IN UCL PLAYOFFS. SECOND LEG AT THE BERNABÉU.",
        "content": "",
        "upvotes": 1903,
        "comments": 312,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/d8vpv10vdbge1.jpeg?auto=webp&amp;s=fcfa364367b66548bbead1d302a843149bfa77d2"
        },
        "permalink": "/r/realmadrid/comments/1iecn6x/real_madrid_vs_manchester_city_in_ucl_playoffs/"
    },
    {
        "id": "1iedjbm",
        "author": "dark4403",
        "title": "Let's go for another MAGICAL NIGHT at the Santiago Bernabéu 🤍",
        "content": "",
        "upvotes": 1335,
        "comments": 63,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/gpee7yrsnbge1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1iedjbm/lets_go_for_another_magical_night_at_the_santiago/"
    }
]