[
    {
        "id": "1mz351d",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Fred Hechinger - Wednesday 8/27 at 3:10 PM ET - Actor in 'Gladiator 2', 'Thelma', 'The White Lotus', 'Nickel Boys', 'Preparation for the Next Life', 'Kraven the Hunter', 'Hell of a Summer', and lots more.",
        "content": "",
        "upvotes": 11,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nwg41g4ke0lf1.png?auto=webp&amp;s=8ac17cc7e0565f006eb23a010243c3f8f44d587a"
        },
        "permalink": "/r/movies/comments/1mz351d/amaqa_announcement_fred_hechinger_wednesday_827/"
    },
    {
        "id": "1ml31yh",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Stephen King - Wednesday 8/27 at 3:00 PM ET - Author of The Shining, IT, The Shawshank Redemption, The Long Walk, The Stand, The Green Mile, Stand By Me, The Mist, Pet Sematary, Misery, Cujo, Salem's Lot, and lots more.",
        "content": "",
        "upvotes": 892,
        "comments": 161,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tfo1ago99uhf1.png?auto=webp&amp;s=f0e529a8d5678222589bc3f4c5dc236194100495"
        },
        "permalink": "/r/movies/comments/1ml31yh/amaqa_announcement_stephen_king_wednesday_827_at/"
    },
    {
        "id": "1myuw3q",
        "author": "lionsgate",
        "title": "Hey /r/movies, I’m Stephen King! Ask me anything about The Long Walk book or movie.",
        "content": "Hey r/movies, I’m Stephen King. You might know me from Stand By Me, It, or Shawshank Redemption, but my latest project is actually the first book I ever wrote. The Long Walk hits theaters on September 12. Ask me anything about the book or movie. \n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=vAtUHeMQ1F8](https://www.youtube.com/watch?v=vAtUHeMQ1F8)\n\n&gt;In a dystopian United States ruled by a totalitarian regime, a group of young men enter an annual walking contest in which they must maintain a speed of at least three miles per hour or risk execution. The contest ends when only one walker remains alive.\n\nIt stars Cooper Hoffman, David Jonsson, Ben Wang, Charlie Plummer, Roman Griffin Davis, Garrett Wareing, Joshua Odjick, Tut Nyuot, Mark Hamill, Judy Greer, and Josh Hamilton. \n\nI'll be back on Wednesday 8/27 at 12:00 PM ET to answer your questions.\n\n",
        "upvotes": 35823,
        "comments": 6210,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/f0jbdlbzsvkf1.jpeg?auto=webp&amp;s=994a7d31fceff32a2f3fdb62f59b362dca6da8a7"
        },
        "permalink": "/r/movies/comments/1myuw3q/hey_rmovies_im_stephen_king_ask_me_anything_about/"
    },
    {
        "id": "1mz3kxn",
        "author": "MarvelsGrantMan136",
        "title": "First Image from ‘The Dink’ - Jake Johnson stars as a washed-up tennis pro who, desperate to save a struggling club and earn his father’s respect, is compelled to break a sacred vow and do the unthinkable: play pickleball",
        "content": "",
        "upvotes": 2216,
        "comments": 196,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gl9oja9lh0lf1.jpeg?auto=webp&amp;s=6c8c6ceb699cd8a108c954982a4f5b507f820a3d"
        },
        "permalink": "/r/movies/comments/1mz3kxn/first_image_from_the_dink_jake_johnson_stars_as_a/"
    },
    {
        "id": "1mz14py",
        "author": "paxinfernum",
        "title": "For 25 Years, No One Has Dared Do Serial Killer Movies Like The Cell",
        "content": "",
        "upvotes": 1908,
        "comments": 306,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pa15QW_a55KqM5TD04dCQfJcgLMcaGRwM08kkFAxY0U.jpeg?auto=webp&amp;s=83cf371915a70d998695e65879b70cc17c447b4f"
        },
        "permalink": "/r/movies/comments/1mz14py/for_25_years_no_one_has_dared_do_serial_killer/"
    },
    {
        "id": "1mz3qz2",
        "author": "systemstheorist",
        "title": "Tommy (1975) - Champagne - scene starring Ann-Margret who was nominated for the Academy Award for Best Actress for her performance",
        "content": "",
        "upvotes": 454,
        "comments": 109,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lwdqg1ali0lf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1mz3qz2/tommy_1975_champagne_scene_starring_annmargret/"
    },
    {
        "id": "1myzdf6",
        "author": "Amaruq93",
        "title": "Before \"Spider-Man\", Sam Raimi refined his formula with 1990's \"Darkman\"",
        "content": "",
        "upvotes": 662,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bHPVPwh1IlckWAX9JNGrlFSaQvJoqO9A6YhkwUyurHI.jpeg?auto=webp&amp;s=4905d6af25ee061ed74303c24d8592100eb33a16"
        },
        "permalink": "/r/movies/comments/1myzdf6/before_spiderman_sam_raimi_refined_his_formula/"
    },
    {
        "id": "1myu7tv",
        "author": "MarvelsGrantMan136",
        "title": "‘The Toxic Avenger’ Star Elijah Wood on Cult Remakes and Why He Loves Weird Movies",
        "content": "",
        "upvotes": 1100,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/etemHcRvWh0w-IQu3frYvNTPLWzBcwKOgcRwo7BH72s.jpeg?auto=webp&amp;s=c4825192be3cd90520eb2a7a1620b287675a586f"
        },
        "permalink": "/r/movies/comments/1myu7tv/the_toxic_avenger_star_elijah_wood_on_cult/"
    },
    {
        "id": "1myn63y",
        "author": "BunyipPouch",
        "title": "Jerry Adler, Actor on ‘The Sopranos', A Most Violent Year’, 'Synecdoche, New York', 'Driveways', Dies at 96",
        "content": "",
        "upvotes": 2528,
        "comments": 162,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/F2xMxmPNZZYYAAflO7l_Uz_LycSm1Lx3vFrUNLlRVAc.jpeg?auto=webp&amp;s=adefe6280b3066bc76d4464b0779766ac08e784f"
        },
        "permalink": "/r/movies/comments/1myn63y/jerry_adler_actor_on_the_sopranos_a_most_violent/"
    },
    {
        "id": "1mz7edd",
        "author": "indiewire",
        "title": "Quentin Tarantino’s New Podcast Interview Reveals What Happened with ‘The Movie Critic,’ and More About His Next Moves",
        "content": "",
        "upvotes": 131,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/16a0J9BRKj0UAud6UlY1QvzScel89odWQnYFQKesY3Y.jpeg?auto=webp&amp;s=c3ee4e47f9fc27457c547f32f0f0f96571b2e30f"
        },
        "permalink": "/r/movies/comments/1mz7edd/quentin_tarantinos_new_podcast_interview_reveals/"
    },
    {
        "id": "1myuskh",
        "author": "bestest_at_grammar",
        "title": "What’s the most convincing emotional pain you’ve seen acted?",
        "content": "I recently watched Three Billboards Outside Ebbing, Missouri for like the fifth time and I never can get over Frances McDormands performance. It’s spectacular and it never fails to make me emotional.\n\nOne line in particular always sticks out for me.\nIn a scene her and her son Robbie find the Billboards on fire. She goes to extinguish them but almost in a pissed off game on way. As Robbie tries to stop her mother she screams his name and the quick emotion always gives me that ache in my throat.\n\nLink below it’s near the end of the clip.\n\nhttps://youtu.be/m9mVSET01g0?si=0b-cMuWUKjRirq2D \n\nHonorable mentions are\n\nThat’s my boy from Harry Potter. If you know you know, I fear rewatching this once I have kids will make this very hard to watch\n\nhttps://youtu.be/FjoemE6QvxU?si=UUyjDSwjct7Gz31e\n\nAnd of course the GOAT of it all hereditary\n\nhttps://youtu.be/M2101AvCGd8?si=Bg9wW_2OzMbA2HWu\n\nHow she found a way to channel that feeling I’ll never know.\n\nAnyways would love to hear some of your answers, and watch after I’m done cleaning. \n\nHave a good Sunday.",
        "upvotes": 569,
        "comments": 706,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Cou1zvUfVQ9kjqVn2hRAYZy_-TTmmT_tGT50xTAXjg0.jpeg?auto=webp&amp;s=c86910aefa3e561886fa546eda676f64b00e55c3"
        },
        "permalink": "/r/movies/comments/1myuskh/whats_the_most_convincing_emotional_pain_youve/"
    },
    {
        "id": "1myv7i8",
        "author": "Apartment-Drummer",
        "title": "Movies you dislike or refuse to watch for a petty reason.",
        "content": "For me it’s Amélie (2001) - I haven’t seen it and I’m sure it’s a good movie based on its ratings alone but I refuse to watch it simply because of that face she’s making on the poster. \n\nI know it’s petty and I hope someday I’ll convince myself to watch and understand its true meaning but there’s just something about that face I just can’t get over. ",
        "upvotes": 339,
        "comments": 692,
        "media": null,
        "permalink": "/r/movies/comments/1myv7i8/movies_you_dislike_or_refuse_to_watch_for_a_petty/"
    },
    {
        "id": "1mz397g",
        "author": "SanderSo47",
        "title": "Ben-Hur (1959): The Chariot Race. The scene used over 70 horses and thousands of extras. It took 5 weeks to film at a cost of $1 million and required more than 200 miles of racing to complete.",
        "content": "",
        "upvotes": 119,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pCfZWg0I-f34D047AYjcz-lcyHAYeMs9o40OWctaB48.jpeg?auto=webp&amp;s=bca2cf4903b63202a6b3d2d4eef5dd40b6021905"
        },
        "permalink": "/r/movies/comments/1mz397g/benhur_1959_the_chariot_race_the_scene_used_over/"
    },
    {
        "id": "1mz4dhs",
        "author": "SerDire",
        "title": "Is there an actor that peaked at the right time but never really blew up and now they’re forever linked to the history of movies?",
        "content": "A recent example is Sam Worthington and the Avatar movies. Just seems weird that he is forever linked with the highest grossing movies of all time when he really has done anything else. \n\nAnother one is Noomi Rapace and her link to the Alien movie franchise. She blew up with the original The Girl with the Dragon Tattoo movies and then starred in Prometheus which was the first true alien prequel and now anytime a new alien movie or show (Alien Earth) premieres, every recap starts at the beginning and her character, Elizabeth Shaw, will forever be brought up. Alien was one of the best sci fi horror movies of all time with probably THE BEST creature design of all time and Aliens was one of the best action movies of all time and now Rapace is forever tied to this franchise. \n\nThe franchise is experiencing a bit of a revival with Alien: Romulus last year and the Alien: Earth tv show so her character feels even more relevant than ever ",
        "upvotes": 95,
        "comments": 186,
        "media": null,
        "permalink": "/r/movies/comments/1mz4dhs/is_there_an_actor_that_peaked_at_the_right_time/"
    },
    {
        "id": "1mz2wty",
        "author": "Urbanpsyche",
        "title": "Aliens",
        "content": "I just caught Aliens, I’ve watched this film 20 times but I was still on the edge of my seat- the medical room scene, the movement detection scene where the warning pulse keeps getting quicker, the air shaft scene with Gorman and Vasquez taking one for the team so they can escape, which transitions beautifully into the Queen’s lair scene. We’re all going to come through this conversation with the same old it’s the best sequel ever but I think it’s a standout and standalone story. \n",
        "upvotes": 89,
        "comments": 54,
        "media": null,
        "permalink": "/r/movies/comments/1mz2wty/aliens/"
    },
    {
        "id": "1mz9rwg",
        "author": "joeljand",
        "title": "Sad movies that are kid friendly",
        "content": "This is kind of a weird question but when my kid is having a sad day, or in moments when something makes him really sad he often asks for a \"sad movie\". This is a normal way to process emotions, most adults do this but the problem is he is only 4. Most of the sad movies out there are not appropriate for kids and most kids movies aren't really sad, or at least sad for kids. The opening scene in 'UP' breaks my heart every time but it doesn't really register for a kid. \n\nWe often use 'Song of the Sea'. It's great animated movie but we need something new. Does anyone have any suggestions for kids friendly movies that have a meloncholic theme that don't have a lot of violence, scary scenes or mature content. ",
        "upvotes": 37,
        "comments": 198,
        "media": null,
        "permalink": "/r/movies/comments/1mz9rwg/sad_movies_that_are_kid_friendly/"
    },
    {
        "id": "1myo14u",
        "author": "darth_vader39",
        "title": "Netflix Broke Its Rules to Share ‘KPop Demon Hunters’ on the Big Screen … But Don’t Expect the Streamer to Make a Habit of It",
        "content": "",
        "upvotes": 573,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KKBb_pchk089bp3Hxz0l6b5RJiWri6p90RJIc_TzgUc.jpeg?auto=webp&amp;s=68d8a1a2844cba5c599775111361b4c422514160"
        },
        "permalink": "/r/movies/comments/1myo14u/netflix_broke_its_rules_to_share_kpop_demon/"
    },
    {
        "id": "1myvzan",
        "author": "leyy_pink1997",
        "title": "Which movie twist completely blew your mind the first time? (Spoilers allowed)",
        "content": "For me, it has to be The Sixth Sense. I remember watching it for the first time not knowing anything about the plot, and when the twist finally hit—that Bruce Willis’ character was dead the whole time—it honestly flipped my brain. I sat in silence for a good five minutes just replaying the whole movie in my head. Suddenly, all those little details made sense, and I realized how carefully the film was crafted to hide the truth in plain sight.\n\nWhat I really appreciate is how the twist doesn’t feel cheap. Some movies throw in a random reveal at the end just for shock value, but The Sixth Sense actually becomes a richer film after you know the ending. Rewatching it feels like a completely different experience, almost like you’re seeing it from another perspective.\n\nAnother one that stuck with me was Fight Club. I didn’t see it coming at all that Tyler Durden and the narrator were the same person. It completely reframed not just the character interactions, but also the movie’s commentary on consumerism and identity. Again, it’s the type of twist that rewards rewatching—you pick up on so many subtle clues that you just miss the first time around.\n\nSo my question is: what’s that one movie twist that left you stunned the first time you saw it? And more importantly, did the twist make the movie better for you, or did it feel like a gimmick?",
        "upvotes": 116,
        "comments": 342,
        "media": null,
        "permalink": "/r/movies/comments/1myvzan/which_movie_twist_completely_blew_your_mind_the/"
    },
    {
        "id": "1mz9r7t",
        "author": "ArchDucky",
        "title": "Mustafa Won’t Die -- Austin Powers",
        "content": "",
        "upvotes": 20,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0PgtZEhtEDvLgBGEeFr7mx8ipMqjlRAwPVkksw_VB2I.jpeg?auto=webp&amp;s=ae19a41a3cc0cf1ee12428c27841644433a82f22"
        },
        "permalink": "/r/movies/comments/1mz9r7t/mustafa_wont_die_austin_powers/"
    },
    {
        "id": "1mz8qmi",
        "author": "Educational_Metal_47",
        "title": "Was there really a fear in the movie theater business in the 80s that VHS/VCR would kill the theater business?",
        "content": "Was there genuine fear in the movie theater business that VHS/VCRs would kill the movie theater or moviegoing business? In the 1980s the technology — which allowed users to watch prerecorded videocassettes or make home recordings of TV broadcasts — was being adopted by an estimated 1 million households per month in North America. That’s per month that’s a lot. Also similarly people in the 50s that the medium of TVs would kill theaters. I’m genuinely asking this question because with today with streaming a lot of people think or seem to believe movie theaters are dead or dying or are gonna go extinct due to streaming what do you think?",
        "upvotes": 20,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1mz8qmi/was_there_really_a_fear_in_the_movie_theater/"
    },
    {
        "id": "1mz5fqq",
        "author": "CapableLanguage5480",
        "title": "Earliest example of the “THE END?” trope in film?",
        "content": "I’ve been digging into the origin of the old movie gag where the closing title card says **“THE END”** … but then adds a **“?”** (as in *The Blob* (1958), which ends with “The End” which then morphs into a questions mark to suggest the monster might return).\n\nThe earliest *explicit* one I’ve found so far is actually German: 1930's *Westfront 1918* concludes with **“ENDE?!”** being displayed in rough handwritten letters, a properly haunting final frame in the context of the anti-war message. Nearly 100 years later It's essentially a cliche, a form of unresolved storytelling/sequel bait that reeks of cheesiness.\n\nDoes anyone know of any **earlier examples** — especially silent-era films — that play with the final “THE END” card in this way? Either literally with punctuation, or in some similar wink at the audience? Bonus points if the title card literally shows \"THE END\" before a question marks is cheekily appended.\n\nThanks in advance — I’d love to trace how far back this schlocky trope goes",
        "upvotes": 29,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1mz5fqq/earliest_example_of_the_the_end_trope_in_film/"
    },
    {
        "id": "1my8w6v",
        "author": "JulianParge",
        "title": "3,400 movies later... here are my top WTFs...",
        "content": "Hi Reddit! I've been lurking here for a long time and I rarely post but I reached a milestone recently and thought it might be nice to celebrate with you by jumping on.\n\nI have been keeping a list of movies that I've watched for nearly 25 years (since I was \\~13). It started in a notebook and eventually I moved the list to a spreadsheet. I log the name of the movie, the name of the director(s), the year it was released, my own rating (out of 5), whether or not I own a physical copy, and what my thoughts were after watching it. Today that list is over 3,400 entries strong!\n\nIn honour of the last WTF movie I watched, I wanted to share a list of my most recent and memorable WTFs that I've either seen more than once or would watch again, for anyone else who likes this as a \"genre\". If you enjoyed at least one movie from this list, then I'm fairly confident you'll also enjoy any of the others which you haven't seen yet.\n\nIf you have any other WTF movies you would recommend in return, I am very grateful for your suggestions.\n\n**My top 10 WTFs**\n\nIn no particular order and released within the last 20 years:\n\n* [The Substance (2024)](https://www.imdb.com/title/tt17526714/) \\- I finally got around to seeing this today, and I haven't said WTF this much in a very long time. I thought it was utterly brilliant.\n* [Hereditary (2018)](https://www.imdb.com/title/tt7784604/) \\- one of the only true \"horror\" movies on this list. Difficult to unsee. Genuinely scary.\n* [Kill List (2011)](https://www.imdb.com/title/tt1788391/) \\- very original, completely unexpected. I watched it a second time with audio commentary from the cast which I thought was really interesting.\n* [Eden Lake (2008)](https://www.imdb.com/title/tt1020530/) \\- not the ending I was hoping for, but a total bucket of WTFs from start to finish.\n* [I Saw the Devil (2010)](https://www.imdb.com/title/tt1588170/) \\- one of two Korean entries on this list. Really brilliantly done. Just when you think it can't be more WTF, it gets more WTF...\n* [Parasite (2019)](https://www.imdb.com/title/tt6751668/) \\- the second of the two Korean movies, with completely unexpected scenes out of the blue that had me saying WTF for a very long time.\n* [The Menu (2022)](https://www.imdb.com/title/tt9764362/) \\- another insane rollercoaster of WTF that just keeps building.\n* [Midsommar (2019)](https://www.imdb.com/title/tt8772262/) \\- this movie had Wicker Man vibes but I was really much more freaked out watching this. There is at least one total WTF scene that you will definitely say WTF to... and then it almost immediately hits you again.\n* [The House That Jack Built (2018)](https://www.imdb.com/title/tt4003440/) \\- this is kind of a modern take on Dante's Divine Comedy, it's quite... \"poetic\"... and as far as serial killer movies go, this is really out there as one of the most WTF ever. Great soundtrack too.\n* [Der Goldene Handschuh (2019)](https://www.imdb.com/de/title/tt7670212/) \\- the only time I've ever paused a movie to take a photo and send a WhatsApp to the friend that recommended it... total WTF from start to finish, bordering on over the top, but I'd probably watch it again so I'll mention it. It's also \"based on a true story\"... which makes it even more WTF.\n\n**Honorable Mentions:**\n\n* [The Platform (2019) ](https://www.imdb.com/title/tt8228288/)\\- I thought this was very original, and it had quite a lot of WTF moments. Not sure it needed a sequel though?\n* [We Need to Talk About Kevin (2011)](https://www.imdb.com/title/tt1242460/) \\- so many WTF moments...\n* [Tusk (2014)](https://www.imdb.com/title/tt3099498/) \\- I've never really seen anything else quite like this. I remember sitting through the credits and the only recurring thought was... \"WTFAF was that?!\". I haven't seen it a second time but I would definitely watch it again.\n* [Three… Extremes (2004)](https://www.imdb.com/title/tt0420251/) \\- this was really on the verge of being too much and it's technically three short films blended into a feature, it's also the oldest on this entire list, but I've watched it more than once and it is uniquely WTF. You probably won't want to eat anything before, during, or after seeing this movie.\n* [Uncut Gems (2019)](https://www.imdb.com/title/tt5727208/) \\- whilst not entirely WTF the whole way through, that ending came out of nowhere and it hit me hard.... I watched it twice. Brilliant.\n* [The Perfect Host (2010)](https://www.imdb.com/title/tt1334553/) \\- can't believe I forgot about this. I couldn't remember the name.\n\nI wanted to add that I've deliberately avoided the more \"extreme\" WTFs. There are several that I've seen that were so excessive, WTF doesn't quite cut it. If you want to see the most messed up shock cinema, there are several entries that come up quite frequently in other WTF threads which I've seen over the years of lurking here. For what it's worth, I think when a movie reaches the point of sacrificing any sincerity or logic in its story in favour of shock value, it's lost its entertainment value completely for me, hence the aversion to mentioning those titles here.\n\n**Edits:**\n\n24.08 - I swapped *The Menu* with *Uncut Gems* because I totally agree with some of the comments. Uncut Gems wasn't overly WTF, whereas The Menu really was WTF the whole way through. I also wanted to say a **huge thanks** for the support and comments, I never expected this to take off and the many suggestions you have given me will keep me busy for weeks!",
        "upvotes": 2602,
        "comments": 580,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/H_it7D3BXUBzSO4wcFnJBKUitJwLuhawdJDiiPs4IIQ.jpeg?auto=webp&amp;s=aee56f46fef7a06ce17cde1db2df132ceafc12f6"
        },
        "permalink": "/r/movies/comments/1my8w6v/3400_movies_later_here_are_my_top_wtfs/"
    },
    {
        "id": "1myxl0t",
        "author": "Low_Insurance_1603",
        "title": "Watched ‘Alpha Dog’ (2006) several years ago freaked me out so much I’ve never been able to nor had any desire to watch again!",
        "content": "Younger Bro thought it would be a trip  to check out Justin Timberlake in AD. I  nonchalantly said I’d pass and wanted to see something more current. TBH I did not have the cojones to admit that this movie freaked me the f**k out when I first watched it-this was after released to video! If I recall it’s “loosely” based on a true story?  I lived in LA during this time and “knew of” the “character types” to a distant extent. I don’t want to give too much away but I do remember the naïveté of the kid brother I think it was  and the shocking outcome. This movie completely shook me to my core! To this day I remember being sooo distraught and disturbed I cannot bring myself to watch again almost 20 years later. I’m in my feelings composing this post. Did this movie affect anyone else this way? Is there another movie that affected you in this manner?",
        "upvotes": 58,
        "comments": 53,
        "media": null,
        "permalink": "/r/movies/comments/1myxl0t/watched_alpha_dog_2006_several_years_ago_freaked/"
    },
    {
        "id": "1mz9imn",
        "author": "Mediocre-Property-48",
        "title": "How was the film “RELAY” not promoted enough? What a crime, because it’s a great film with the great Riz Ahmed, kept me guessing the whole way.",
        "content": "How was the film “RELAY” not promoted enough? What a crime, because it’s a great film with the great Riz Ahmed (from the “Night of…”) kept me guessing the whole way. Terrific cast filled with familiar faces. Check out this video from this search, trailer for relay https://share.google/jj4E2HsEM9B4h2PeH",
        "upvotes": 11,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qiHK56vs-BdxJOEM65YzJSYcAvTtBMd1BOi4Z3ZL1MI.jpeg?auto=webp&amp;s=dbb6fbca4b154d0a4d2e69e66fbb1b9e06301607"
        },
        "permalink": "/r/movies/comments/1mz9imn/how_was_the_film_relay_not_promoted_enough_what_a/"
    },
    {
        "id": "1myeaag",
        "author": "Shoddy-Campaign-7684",
        "title": "Is there a scene from a non serious movie that has profoundly changed your view on some aspect of life?",
        "content": "For me, it was The Heat with Melissa McCarthy and Sandra Bullock.\n\nEarly on in the movie, Melissa's character is arresting a John for trying to pick up a hooker.  He attempts to justify it by stating his wife just gave birth and you can't imagine what's going on down there. \n\nMelissa's character responds something along the lines of he's got a lot of nerve to dry that to the mother of his children, he's blessed, her body goes through so much and so on.\n\nI think about this every time I'm upset with my wife, how I'm lucky to have her, and it doesn't matter what she looks like all the time after giving multiple births.  Or when I'm looking at other husbands doing similar things to their wives.  There are others, but this scene holds a special place in my head. ",
        "upvotes": 888,
        "comments": 470,
        "media": null,
        "permalink": "/r/movies/comments/1myeaag/is_there_a_scene_from_a_non_serious_movie_that/"
    },
    {
        "id": "1my3yuy",
        "author": "MarvelsGrantMan136",
        "title": "After 1 Million Trailer Views in 4 Days, IFC Announces ‘Good Boy’ Expanding to Wide Release on October 3",
        "content": "",
        "upvotes": 2499,
        "comments": 137,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HDIel-xZCybTi7c1Rthx6ST89cG8iITT77UNGakgmN8.jpeg?auto=webp&amp;s=df0e99481a46b9d95e02e9d29757b663d3cd1d50"
        },
        "permalink": "/r/movies/comments/1my3yuy/after_1_million_trailer_views_in_4_days_ifc/"
    },
    {
        "id": "1mzca3k",
        "author": "insulin4all",
        "title": "Armageddon",
        "content": "Which oil driller, who became an astronaut in one week in the movie Armageddon, was the one who tested positive for ketamine before heading to the asteroid? \n\n\n\n\nI am thinking it was Steve Buscemi as \"RockHound.\" There is a scene before he ascends to space to defeat the asteroid, where he goes with some of the other one-week astonauts to the strip club and spende $100k that RockHound took out from a loan shark at a 50% interst rate (I believe). Seems like he gets down. If it isn't him then it's got to be Owen Wilson. ",
        "upvotes": 6,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1mzca3k/armageddon/"
    },
    {
        "id": "1mz615i",
        "author": "Lokitusaborg",
        "title": "The Invisibles (2024) absolutely wrecked me.",
        "content": "If anyone has ever struggled with loss, depression, anxiety this movie hits so close to home. I went through a divorce a few years back and both prior to that and following I felt like I was slowly fading away. I told my therapist this, that I just felt invisible. This movie, while slow, really does a good job of showing what that feels like. At first it is comforting to forget your trauma and just walk through life as an observer. You find others like that and have these co-dependent relationships that feel good initially…but it all is just a cycle. It also demonstrates how incredibly hard it is to work through it and past that grief. It is such a thoughtful and moving movie; it’s not flashy or entertaining in the classical sense; but it is quite beautiful and honest.",
        "upvotes": 11,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1mz615i/the_invisibles_2024_absolutely_wrecked_me/"
    },
    {
        "id": "1my38rt",
        "author": "MarvelsGrantMan136",
        "title": "Edward Berger Says He’s Dropped Out Of Directing ‘Ocean’s 14’",
        "content": "",
        "upvotes": 2487,
        "comments": 338,
        "media": null,
        "permalink": "/r/movies/comments/1my38rt/edward_berger_says_hes_dropped_out_of_directing/"
    },
    {
        "id": "1mygwk8",
        "author": "Bennett1984",
        "title": "Beast of War - Official Trailer",
        "content": "",
        "upvotes": 456,
        "comments": 101,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GDfmcQD-PyOJO8AIwphO5cMOjRJjF-idYWCI2ymtbYs.jpeg?auto=webp&amp;s=70d2f999c3173aa7df3c9848356ca21d8759f4ea"
        },
        "permalink": "/r/movies/comments/1mygwk8/beast_of_war_official_trailer/"
    },
    {
        "id": "1my9gx8",
        "author": "BunyipPouch",
        "title": "All 7 ‘Nightmare on Elm Street’ 4K Restorations to Debut at Alamo Drafthouse Cinemas Starting August 29th",
        "content": "",
        "upvotes": 859,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GAfwN2qm9DjjrUfvLxijxXyq0b7x2bkxNc-lnRyfgtA.jpeg?auto=webp&amp;s=c103390a6d60aaaa1fde58155f5c2c1ad021fae3"
        },
        "permalink": "/r/movies/comments/1my9gx8/all_7_nightmare_on_elm_street_4k_restorations_to/"
    },
    {
        "id": "1my9lcw",
        "author": "Immediate-River-874",
        "title": "Brian Blessed in 'Henry V' (1989) - Monologue Scene",
        "content": "",
        "upvotes": 788,
        "comments": 120,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ofo2k32jetkf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1my9lcw/brian_blessed_in_henry_v_1989_monologue_scene/"
    }
]