[
    {
        "id": "1ggzmq2",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1ggzmq2/la_piola_friends_meetup/"
    },
    {
        "id": "1ggzmpq",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1ggzmpq/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1h1abox",
        "author": "Skylinegt-r34",
        "title": "sono un ragazzo di Torino che vive a settimo di 37 anni è mi sento molto solo, qualcuno che è disposto a fare conoscenza? preferirei ragazze perchè ho sempre fatto fdatica a relazionarmi con l'altro sesso, ma vanno benissimo anche ragazzi, purchè possa fare amicizia",
        "content": "Ciao a tutti, sto passando un periodaccio... mi sento tanto solo, ed ho bisogno di avere qualche amico/a accanto, qualcuno è disposto a perdere un pò di tempo con me... so di essere uno un pò \"difficile\" come gusti, ma ho anche un cuore grande e mi piacerebbe trovare qualcuno con cui passare le serate ed i week end a giocare, chiaccherare, vedere un film o bere una birra...spero qualcuno possa rispondere... grazie",
        "upvotes": 18,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1h1abox/sono_un_ragazzo_di_torino_che_vive_a_settimo_di/"
    },
    {
        "id": "1h1760d",
        "author": "sbrodolino_21",
        "title": "Multa GTT",
        "content": "Oggi sono stato multato da GTT perché sono salito su un tram, avendo acquistato il biglietto sull'app ToMove per android, ma senza validarlo. Il problema è che questo tram era talmente pieno che non era possibile raggiungere i validatori. Ci ho provato ma non è stato possibile e non volevo dare il mio cellulare a qualcuno per convalidare.\nNon era neanche possibile fare l'autoconvalida in quanto android.\n\nPosso fare qualcosa? Devo veramente essere multato io per le loro inefficienze?",
        "upvotes": 9,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1h1760d/multa_gtt/"
    },
    {
        "id": "1h1g63f",
        "author": "mo_one",
        "title": "Amicizie queer a torino?",
        "content": "Ehilà, sono un ragazzo bisessuale, Bulgaro, e mi chiedevo se c'è gente queer a torino che vuole fare amicizia? Ho abbastanza amici etero, e vorrei fare qualche amico nella comunità\n\nStudio informatica alla unito, e mi piacciono I giochi da tavolo/ruolo, scrivere ogni tanto, imparare lingue lingue, programmare (duh), e gli anime (anche se non li guardo da un po). (So che non è molto descrittivo, ma potete sempre guardare il mio profilo per vedere che genere di persona sono)",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1h1g63f/amicizie_queer_a_torino/"
    },
    {
        "id": "1h0yqe7",
        "author": "MicheleCaracas",
        "title": "Nuovi orari metro per Dicembre e Gennaio (non abituatevi troppo bene)",
        "content": "Dal sito GTT:\n\nLa metropolitana dal 2 dicembre offre un servizio prolungato per rispondere alle esigenze di cittadini e visitatori. La rimodulazione dell’orario tiene conto dell’aumento di mobilità tipico del periodo e la possibilità di integrare l’estensione oraria fino a tutto gennaio grazie all’avanzamento delle attività di aggiornamento tecnologico in corso.\n\nPrime partenze dai capolinea di Fermi e Bengasi sono confermate alle 5.30 tutti i giorni tranne la domenica con partenza ore 7.00. Le ultime partenze dai capolinea di Fermi e Bengasi saranno alle 21.30 il lunedì, alle 24.00 dal martedì al giovedì e alla domenica. Venerdì e sabato ultime partenze alle 1.00.\n\nLa rimodulazione degli orari è il risultato di una stretta collaborazione con la Città e si integra con il progresso dei lavori di migrazione degli impianti di terra del sistema di segnalamento CBTC. I lavori in questa fase non interferiscono sul servizio ed è quindi stato tecnicamente possibile estendere gli orari. Le attività di migrazione del sistema riprenderanno nel mese di febbraio 2025. ",
        "upvotes": 30,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1h0yqe7/nuovi_orari_metro_per_dicembre_e_gennaio_non/"
    },
    {
        "id": "1h1b65s",
        "author": "Global-Ad-31",
        "title": "Ciao a tutti! Ci provo😅 Sapreste dirmi se zona Torino nord c'è qualke gruppo ke organizza tornei di calcetto femminile amatoriali? Oppure ragazze ke semplicemente giocano a calcetto e  organizzano partitelle? Grazie a ki risponderà",
        "content": "",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1h1b65s/ciao_a_tutti_ci_provo_sapreste_dirmi_se_zona/"
    },
    {
        "id": "1h15wsr",
        "author": "Erleyx",
        "title": "Calisthenics park",
        "content": "Hey, does anyone know any calisthenics park near Nichelino or Moncaliere where people train and stuff, i would be really grateful if anyone knew",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1h15wsr/calisthenics_park/"
    },
    {
        "id": "1h0vllw",
        "author": "Agreeable-Bag1048",
        "title": "Futur festival 2025 ",
        "content": "Does anybody know when the day passes of the festival will be out? \n\nCurrently we’re forced to buy all 3 days pass. Will the release the day passes later? \n\nPlease help me out here! ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h0vllw/futur_festival_2025/"
    },
    {
        "id": "1h0jegq",
        "author": "Flat_Reserve8599",
        "title": "Giocatori/fan di beyblade a Torino",
        "content": "Buon pomeriggio, da poco ho trovato, con mia grande sorpresa, la nuova serie di beyblade nei negozi,  tuttavia , nonostante ne fossi un grande appassionato da piccolo con i primi, pensavo non sarebbero mai ritornati di moda.\n\nE questo porta alla mia domanda, c'è qualcuno che conosce un posto( negozi, fumetterie, etc) a torino, o dintorni dove qualcuno gioca con i beyblade? se si, quali sono, ho cercato online ma non ho trovato nulla.\n\ngrazie mille per le rispose, in caso, se anche voi giocate, potremmo comunque trovarci per qualche sfida, ho preso la scatola iniziale.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1h0jegq/giocatorifan_di_beyblade_a_torino/"
    },
    {
        "id": "1h08r58",
        "author": "Tony_06_",
        "title": "Perché è così difficile trovare lavoro?",
        "content": "Ciao, sono arrivato qui da poco e sto impazzendo nella ricerca di un lavoro e di una casa. \nPerché è tutto così confusionario qui? \nTra agenzie che promettono case in poco tempo e poi spariscono o affitti alle stelle, non trovo neanche un lavoro.\nHo provato in diversi rami, compreso il mio della ristorazione (che può risultare il più stupido da trovare per il gran numero di locali), ma non ho praticamente ricavato nulla. \nQuindi chiedo a voi che avete più esperienza, come posso fare a trovare un lavoro?\n\n",
        "upvotes": 9,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1h08r58/perché_è_così_difficile_trovare_lavoro/"
    },
    {
        "id": "1h0ckph",
        "author": "H4ttori_H4nzo",
        "title": "Miglior parrucchiere per uomo ",
        "content": "Via con le danze",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1h0ckph/miglior_parrucchiere_per_uomo/"
    },
    {
        "id": "1h0decd",
        "author": "ismisecraic",
        "title": "Visiting for Marathon - Some Questions",
        "content": "Buona giornata!\n\nI am visiting Turin from Ireland this weekend for the marathon.   \nStaying in and around **Porta Palazzo.** \n\nCan anyone advise if i get a taxi from the airport, roughly how much it will cost to get to my accommodation?  \n  \nWhat is the city like to walk around that neighbourhood security wise, is it safe? \n\nCan anyone recommend me any things to do on the Sunday night or monday afternoon before flying home? \n\nThanks in advance     \n",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1h0decd/visiting_for_marathon_some_questions/"
    },
    {
        "id": "1h0b6ve",
        "author": "rlagoa",
        "title": "New Year Eve Party / Capodanno ",
        "content": "Me and my wife are going to torino in the end of the year untill 5 of January , but we have some doubts in where to have the new year eve party … Can someone give us some tips ?\n\nWe would like to go some cool bar with some rock music and a small party or something like that … how is the party in the city ? Some cool hotel party ? \n\nAlso… any recommendation for cool spots ( bars, restaurantes , etc ) to visit ?\n\nThanks ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1h0b6ve/new_year_eve_party_capodanno/"
    },
    {
        "id": "1gzmerx",
        "author": "fenderfable",
        "title": "Ma perchè è così difficile trovare un appartamento a 500 euro?",
        "content": "Cioè è davvero troppo bassa questa cifra per un bilocale? Se sì, cosa differenzia Torino da Milano a questo punto?\n\nIo cerco da tre mesi, o la gente mi sfancula (sono un dipendente indeterminato con ccnl banche e assicurazioni) dicendomi che o l'hanno già affittata o sono in trattativa, altri non rispondono, altri 500 euro e 300 euro di spese condominiali, altri sono bellissimi appartamenti a barriera, e altri annunci sono di AP Madama o AffittoPrivato che sono quei fuffa truffa che ti chiedono 250 euro per mandarti dai proprietari e poi scompaiono rubandoti i soldi.\n\n  \nNon lo so, sono disperato, ho scritto in gruppi facebook anche per una stanza, niente.\n\nNon trovo niente.",
        "upvotes": 36,
        "comments": 62,
        "media": null,
        "permalink": "/r/torino/comments/1gzmerx/ma_perchè_è_così_difficile_trovare_un/"
    },
    {
        "id": "1h09k0f",
        "author": "redproteico",
        "title": "Aiuto barbiere S.Paolo-Cenisia",
        "content": "Ciao a tutti amici di Torino 🎈\nConoscete un barbiere o parrucchiere bravo e che non costi un rene in zona san paolo/cenisia? Ho provato latinos barber vicino al pick up, bravo per carità, ma troppo caotici e raffazzonati per miei gusti 🤣\nVorrei un qualcosa di più tranquillo, senza reggaeton a tutto volume e un minimo di servizio, anche su prenotazione \nGrazie a chiunque voglia aiutare un povero capellone disperato 🙏🤞🤞",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1h09k0f/aiuto_barbiere_spaolocenisia/"
    },
    {
        "id": "1gzqfe7",
        "author": "lore_mila_",
        "title": "Qualcuno ha partecipato a questo evento o simili? Consigliate?",
        "content": "",
        "upvotes": 9,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dwiyn59of33e1.jpeg?auto=webp&amp;s=c6954639504b9b1a728bcbaf3ef560f02db93023"
        },
        "permalink": "/r/torino/comments/1gzqfe7/qualcuno_ha_partecipato_a_questo_evento_o_simili/"
    },
    {
        "id": "1gzuicv",
        "author": "slight_choice_",
        "title": "Chi si ricorda la canzone \"Torino tropicale\" (~2019)??",
        "content": "Genere elettronica tipo house (mi sembra), l'avevo sentita all'ultima street parade di carnevale al valentino prima del covid (febbraio 2020). Era stata anche pubblicata online da qualcun* perché l'avevo riascoltata qualche volta, ma poi è completamente sparita da internet e ora è introvabile.\nMe la sono ricordata da poco ed era fighissima, che fine ha fatto?\nNon ricordo di chi fosse ma il testo era: \"Torino tropicale, chiudo gli occhi e vedo il mare\" &lt;3",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1gzuicv/chi_si_ricorda_la_canzone_torino_tropicale_2019/"
    },
    {
        "id": "1gzwq4q",
        "author": "Odd-Refrigerator-755",
        "title": "Dentista convenzionato",
        "content": "Ciao! Sono nuovo a Torino. \nI denti del giudizio mi stanno spuntando e il dentista dell'ASL mi ha suggerito, prima di procedere con l'estrazione, di fare una panoramica dei denti in un centro convenzionato (all'ASL mi ha esplicitamente detto che ci avrei messo una vita). Stupidamente, non ho chiesto quali fossero. Ne conoscete qualcuno? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gzwq4q/dentista_convenzionato/"
    },
    {
        "id": "1gzcpiz",
        "author": "itslilou",
        "title": "Dove posso avere una vista sulle Alpi senza un'auto?",
        "content": "Ciao! Le Alpi sono belle e innevate e vorrei trovare un posto con i mezzi pubblici accessibili per sedermi e guardarle. Hai qualche consiglio, forse alcuni parchi o aree casuali che hanno una vista aperta su di loro? Oltre alla Mole e al Parco Europa. Grazie!",
        "upvotes": 14,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1gzcpiz/dove_posso_avere_una_vista_sulle_alpi_senza_unauto/"
    },
    {
        "id": "1gzkekd",
        "author": "BlueLights420",
        "title": "Serate il giovedì sera",
        "content": "Ciao a tutt* 🫶🏻 come da titolo vorrei chiedere se esiste qualche serata carina a Torino dove andare a ballare il giovedì sera (se techno ancora meglio). Grazie ❤️ ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gzkekd/serate_il_giovedì_sera/"
    },
    {
        "id": "1gzew4y",
        "author": "papafrancesco3611",
        "title": "Lavanderia cenisia",
        "content": "Ciao a tutti, qualcuno ha avuto qualche esperienza con qualche buona lavanderia per giubbotti (in piume)? Sono stato l’anno scorso in una a via Monginevro ma mi hanno restituito il cappotto in condizioni abbastanza pessime. Diciamo come zona in un raggio di un km dalla mcfit di corso Ferrucci (anche poco in più se ne vale la pena)",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gzew4y/lavanderia_cenisia/"
    },
    {
        "id": "1gz99c8",
        "author": "Over-Line-1269",
        "title": "Kappa Futur 2025",
        "content": "Looking for people to connect with that are going! I’m coming from Australia on my own and would love to link up with people! \nFemale, 35 years old 💃 ",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1gz99c8/kappa_futur_2025/"
    },
    {
        "id": "1gzg1gz",
        "author": "MaRwan_2079",
        "title": "Accommodation cost in torino",
        "content": "I want to go study in torino(as international student) \nSo Iam wondering what is the accommodation cost for student\n(Private room or shared room) in apartment in (city center or in the other areas)\n",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1gzg1gz/accommodation_cost_in_torino/"
    },
    {
        "id": "1gzhhul",
        "author": "Sorry_Carrot7537",
        "title": "cerco gente con cui uscire ",
        "content": "innanzitutto buongiorno o buonasera, sono un ragazzo di 19 anni, sono siciliano e mi sono trasferito a Torino da poco, o comunque per il momento sono qui. Cercavo qualcuno con cui uscire, uomo o domna che sia non mi importa, l'importante è che sia una persona simpatica, ho diversi hobby uno dei tanti è lo sport, pratico calisthenics. ci sarebbero molte altre cose da sapere ma inutile che sprechi il mio tempo qui con migliaia di gente che leggerà il post e probabilmente non lo considererà neanche, quindi boh, se a qualcuno per caso andrebbe di conoscere nuova gente io sono più che disponibile. (avevo già fatto un post simile qualche giorno fa ma non è andato a buon fine, quindi ripropongo sperando vivamente di trovare qualcuno)",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1gzhhul/cerco_gente_con_cui_uscire/"
    },
    {
        "id": "1gzdig6",
        "author": "_L_-",
        "title": "Cercasi fotografo non professionista ",
        "content": "Cerco fotografo non professionista per dei ritratti in qualche zona bella di Torino. Banalmente vorrei foto per Instagram, LinkedIn, Tinder etc\n\nLasciate il vostro Instagram magari :) \n",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1gzdig6/cercasi_fotografo_non_professionista/"
    },
    {
        "id": "1gzg7zm",
        "author": "Herofrancy",
        "title": "Torino Xmas comics",
        "content": "Da quello che so, esiste un'area 18+ al Torino comics. Per accedervi serve la carta d'identità?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1gzg7zm/torino_xmas_comics/"
    },
    {
        "id": "1gz5k70",
        "author": "Agreeable-Program-68",
        "title": "Looking for a Badminton Partner!",
        "content": "\n\nHi everyone, I am an international student of Polito . I’m looking for a badminton partner to play with regularly. \nHere are some details:\n\n\t•\tLocation: Corso Re Umberto, 133\n\t•\tAvailability: weekends\n\t•\tEquipment: I have my own racket and shuttlecocks, but feel free to bring yours too!\n\nIf you’re interested in joining for some games, feel free to message me! \n\nLooking forward to hearing from you!",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1gz5k70/looking_for_a_badminton_partner/"
    },
    {
        "id": "1gyxl6m",
        "author": "OwnUse9143",
        "title": "University of Turin",
        "content": "Hi What should we consider when applying to the University of Turin for a Bachelor's in Business and management? (Non-eu)\nAre they looking for something in particular?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1gyxl6m/university_of_turin/"
    },
    {
        "id": "1gyo10j",
        "author": "Royal_Lime6493",
        "title": "Nuove Conoscenze",
        "content": "Ciao, M27 (ma me ne danno sempre 15) in zona Pozzo Strada. Cerco coetanei con interessi simili ai miei, ho proprio bisogno di una nuova comitiva. Non bevo ma un giro al bar non è fuori discussione. Nella vita faccio l'Illustratore Freelance e il traduttore di inglese. Da buon nerd mi interesso di film e videogiochi.\n\n",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1gyo10j/nuove_conoscenze/"
    },
    {
        "id": "1gy3jzd",
        "author": "SteamPaz",
        "title": "Venere su Via Roma",
        "content": "",
        "upvotes": 135,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ausi38miho2e1.jpeg?auto=webp&amp;s=d0cea1c108d1df5d6bd33f298fa535ebe4f4cef1"
        },
        "permalink": "/r/torino/comments/1gy3jzd/venere_su_via_roma/"
    },
    {
        "id": "1gyt34s",
        "author": "opaco_",
        "title": "Dove comprare Tartufo Nero a Torino?",
        "content": "Conoscete qualche negozio che propone tartufo nero a buon prezzo pur essendo dentro Torino?\nGrazie",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1gyt34s/dove_comprare_tartufo_nero_a_torino/"
    }
]