[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 491,
        "comments": 271,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j87k40",
        "author": "Internal-Bed-3150",
        "title": "Greta Gerwig wants Charli XCX in her Narnia movies",
        "content": "",
        "upvotes": 150,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1j87k40/greta_gerwig_wants_charli_xcx_in_her_narnia_movies/"
    },
    {
        "id": "1j85l1m",
        "author": "Last_Weird0717",
        "title": "American Manhunt Osama bin Laden: Not coming up on my Netflix??",
        "content": "I'm in the US and had this on my list to watch for today. Now it's suddenly not showing up at all. Anyone else having this issue? I know the release date was today, March 10th. \n\n",
        "upvotes": 85,
        "comments": 183,
        "media": null,
        "permalink": "/r/netflix/comments/1j85l1m/american_manhunt_osama_bin_laden_not_coming_up_on/"
    },
    {
        "id": "1j89yi7",
        "author": "Josh1923",
        "title": "American Manhunt: Osama bin Laden",
        "content": "Just spoke with support and they’re saying there’s no official release date. This is annoying ",
        "upvotes": 27,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1j89yi7/american_manhunt_osama_bin_laden/"
    },
    {
        "id": "1j7yf42",
        "author": "EthanWilliams_TG",
        "title": "New trailer for the final season of ‘YOUʼ has been released",
        "content": "",
        "upvotes": 42,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1j7yf42/new_trailer_for_the_final_season_of_youʼ_has_been/"
    },
    {
        "id": "1j8f38h",
        "author": "Bitter-Assistant070",
        "title": "Netflix Household Mess with 94 y/o Mother",
        "content": "I have been paying for a separate Netflix account for my mother for a couple of years. She was in the hospital and is now in rehab. She's doing well and will be moving into Assisted Living shortly. She started getting the Netflix Household message when trying to watch Netflix on her iPad. I chatted with support and they sent me the instructions that need to be handled from her Roku at home. The problem is none of my siblings are in the same state at the moment. The support rep said that this is the only way to handle this issue. Period. I find it hard to believe they can't override it. Is there really no other way to resolve this? I see that I can add her on my account now, but that would involve her jumping through hoops on her iPad. She's never been very tech savvy so I don't want to ask her to log out and log into my account.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j8f38h/netflix_household_mess_with_94_yo_mother/"
    },
    {
        "id": "1j8ebhl",
        "author": "cuzforwhy",
        "title": "Recommend Netflix shows or movies for a dental office",
        "content": "I work in a dentist office and I like to keep the tv in my operatory on, most of my patients are older folks and I need some Netflix shows or movies to play throughout the day that are appropriate and don’t have any awkward sex scenes or something, thank you.😂",
        "upvotes": 4,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ebhl/recommend_netflix_shows_or_movies_for_a_dental/"
    },
    {
        "id": "1j80met",
        "author": "strawberrycheescak",
        "title": "Netflix only has the same crime shows/movies but with the plot worded differently",
        "content": "I was looking for a thriller yesterday and all I  could find that I didn’t watch were those crime movies where someone goes missing and their family member has to find them or save them. Every 5th movie I pressed on was like that and it was the same plot but worded differently. I feel like it happens also with tv shows like why do they keep on doing that? Can’t they release shows/movies with a different plot? Maybe it depends on the countrys content but its all I ever see on netflix when looking for shows/movies or thrillers. ",
        "upvotes": 14,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1j80met/netflix_only_has_the_same_crime_showsmovies_but/"
    },
    {
        "id": "1j8ewwo",
        "author": "redsoxfan1845245",
        "title": "Netflix keeps asking to update household",
        "content": "My mother and I share a plan. She’s the main acct holder in another state. I also use the acct and we only have 2 devices on it. Her TV and my TV. It’s also the plan without commercials so we should get 1 out of household device right?\n\nAny idea what is going on? I keep having to ‘update household’ and send her a text to let me log in. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ewwo/netflix_keeps_asking_to_update_household/"
    },
    {
        "id": "1j7ji2j",
        "author": "WhileZestyclose2413",
        "title": "Any feel good happy shows to watch on Netflix?",
        "content": "I struggle with depression and anxiety and I was looking for a happy and feel good show to watch to help me wind down and relax. Nothing too old please. ",
        "upvotes": 205,
        "comments": 332,
        "media": null,
        "permalink": "/r/netflix/comments/1j7ji2j/any_feel_good_happy_shows_to_watch_on_netflix/"
    },
    {
        "id": "1j86py5",
        "author": "Affectionate_Mess488",
        "title": "What have we missed?",
        "content": "My husband and I had a baby a year and a half ago so we haven’t had any time for TV. We’re finally getting some quiet time at night so would love a new show to watch. What are some good shows we missed over the last year or two that are worth catching up on? We love $ or crime documentaries (I.e Tinder Swindler, Wild Wild Country) and drama shows (Peaky Blinders, Lincoln Lawyer, Ozark, Crown).",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1j86py5/what_have_we_missed/"
    },
    {
        "id": "1j810o1",
        "author": "Crazy_Ad_1545",
        "title": "Running Point - Jackie and the Cheerleaders",
        "content": "Is anyone else curious why all the cheerleaders want to sleep with Jackie? They were pissed at him at first for cutting them in lieu of Red Panda. No shade to the actor, but he's not particularly good looking or alluring. Is it just because they realized he's a Gordon?",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j810o1/running_point_jackie_and_the_cheerleaders/"
    },
    {
        "id": "1j8d6w7",
        "author": "Flyfishskier",
        "title": "Any way to bypass household restrictions on macbook browser?",
        "content": "title basically says it all. I know of the airplane mode for mobile apps and it works but since I mainly watch on my MacBook I cannot figure a bypass out. VPNs have never worked for me. Pretty crazy how long I had my browser working compared to my app, but now its gone unfortunately. Anybody have any solutions?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j8d6w7/any_way_to_bypass_household_restrictions_on/"
    },
    {
        "id": "1j8biaa",
        "author": "mikestergame01",
        "title": "Force highest quality for whatever I'm watching on netflix?",
        "content": "Is there a way to force 4k or whatever the highest quality of the video you're watching on youtube?  On windows 11 what's the best way to watch netflix in a browser or using the app?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j8biaa/force_highest_quality_for_whatever_im_watching_on/"
    },
    {
        "id": "1j82128",
        "author": "ArmChairDetective84",
        "title": "Different series with the same name",
        "content": "So I started to watch La Reina del Sur a few days ago and it started with her being captured then later on in the episode the prison break BUT now , the first episode is completely different …instead of showing her being arrested and Landero coming to visit her at a Colorado Federal Prison - it’s all about her life before she was arrested. \n\nI wanted to re watch the prison scenes because the way she broke out was badass but it seems to have disappeared ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j82128/different_series_with_the_same_name/"
    },
    {
        "id": "1j7okbt",
        "author": "Odd-Network-3005",
        "title": "Tell me 8 shows that you liked too much",
        "content": "From netflix\n\n🙂 mines in no specific order:\n\n1)a series of unfortunate events\n2)the oa\n3)arcane\n4)The order\n5)archive 81\n6)dark\n7)death love robots season 3\n8)my name (korean)\n\n",
        "upvotes": 26,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1j7okbt/tell_me_8_shows_that_you_liked_too_much/"
    },
    {
        "id": "1j86xf9",
        "author": "More-Quantity-6117",
        "title": "Unique problem with my account",
        "content": "I don't really know how to solve this issue\n\nI've created a Netflix account in the past year. Haven't used it in a while so I wanna cancel the account but when I try to log in it says there's no account for that mail address. They keep charging me though. How can this be solved, is there any real customer service? I'm not in the US\n\nThanks",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j86xf9/unique_problem_with_my_account/"
    },
    {
        "id": "1j7mxfx",
        "author": "questionsfordays22",
        "title": "HELP ME FIND NAME OF THIS SHOW",
        "content": "A man was framed for stealing documents or evidence, when he went to jail he tried figuring out what happened. He then connected with someone that was able to fake his death. He then pretended to be the nephew of a mob boss and killed everyone that was involved in framing him. \n\nHis wife was trying to figure out who wanted to frame her husband (she thinks he’s really dead). \n\nThe husbands best friend tries making a move on the wife and she turns him down and says she still in love and not over her husband…\n\nIt was a foreign Netflix limited series ",
        "upvotes": 25,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1j7mxfx/help_me_find_name_of_this_show/"
    },
    {
        "id": "1j84vwi",
        "author": "Fast-Discussion6538",
        "title": "Netflix Recommending My Watch History to Other Profiles?",
        "content": "Hi!♥\n\n I recently added two more Netflix profiles to my account for my parents. While explaining to them how to use the app, I noticed that Netflix is recommending movies and series that I have watched or am currently watching.\n\nI still don’t really want them seeing my watch history in their recommendations. \n\nI thought profiles were supposed to be separate, so I have no idea why this is happening.\n\nIs there a way to turn this off? Or is this just how Netflix works? Any advice would be appreciated!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j84vwi/netflix_recommending_my_watch_history_to_other/"
    },
    {
        "id": "1j89tqf",
        "author": "ellissabain",
        "title": "One of Running Point’s main filming locations is over 5,000 miles from LA where it’s set",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j89tqf/one_of_running_points_main_filming_locations_is/"
    },
    {
        "id": "1j7uo3r",
        "author": "Robemilak",
        "title": "Alan Ritchson Hypes That His Next Film Will Be \"The Biggest Movie Netflix Has Ever Had\"",
        "content": "",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j7uo3r/alan_ritchson_hypes_that_his_next_film_will_be/"
    },
    {
        "id": "1j8dh6o",
        "author": "Jazzydiva615",
        "title": "With Love, Meghan",
        "content": "Let's Discuss With Love Meghan, new on netflix\n\nPersonally thought too much talking to the director and in that game night episode, he had to eat his sandwich on camera! Come on! That's too much!\n\nFor someone that grew up eating TV Dinners, I can appreciate the growth and evolution!! \n\nEpisode one that guy cutting himself was hilarious! Somehow I suspect he didn't know his invite involved so much work! 😆\n\nMindy definitely didn't know she was going to be working so hard! All that make up and those thick lashes. She probably expected to be massaged all day and lounging\n\nNever seen an edible flower before this series, and I'm in my 50s\n\nOverall Enjoyable",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1j8dh6o/with_love_meghan/"
    },
    {
        "id": "1j84e2l",
        "author": "chrisarrant",
        "title": "Anora's studio Neon says A24 isn't their biggest competitor, it's Netflix. Here are the 6 movies they competed for",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j84e2l/anoras_studio_neon_says_a24_isnt_their_biggest/"
    },
    {
        "id": "1j7xoy2",
        "author": "kubawww1",
        "title": "Netflix Spams Notifications",
        "content": "Hello! Since yesterday the Netflix app on my Android (15, OPPO) phone started acting weird, whenever it sends a notification and I close it, it reappears almost instantly and it seems to do it for a while and then it stops.\n\nIt does that with the \"recommended for you\" thing and the \"upcoming title\". I don't want to disable them since they are useful sometimes.\n\nDoes anyone have this bug also?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j7xoy2/netflix_spams_notifications/"
    },
    {
        "id": "1j7x59x",
        "author": "Loner_Indian",
        "title": "What are some of the series or movies to be avoided ?",
        "content": "I mean bad is something where ending was subpar that it rendered entire previous viewing meaningless.\n\nFor example to me, and again \"Personally\", \"Lost\" was a disaster it kept on building up and building up but ending was ridiculous and  wasted my time.\n\nOn other hand Dexter (The early one not recent) also had horrible ending but it's subplot and thriller in (s1-s5) were so good that it was memorable and I still remember the scenes while for \"Lost\" I hardly recall anything. Both I watched 13 years ago.\n\nAnd coming to comedies I don't like comedies like \"Friends\", \"Seinfeld\", \"HIMYM\", \"BBT\", etc..though I like characters like Joey, Kramer, Howard but it becomes a slog waiting for them. \n\nI liked \"Office(US)\", \"Louie\", \"Two and a half men\", \"People just do nothing\", \"Silicon Valley\".\n\nEdit : Also any show you left midway because you became \"bored/tiresome\" or it lost the edge\n\nAgain this is all personal , please don't write things like \"you are too stupid\".\n\nThanks",
        "upvotes": 1,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1j7x59x/what_are_some_of_the_series_or_movies_to_be/"
    },
    {
        "id": "1j77itb",
        "author": "Janawham_Blamiston",
        "title": "Is there any way to have Netflix not infect every profile with the actions of another?",
        "content": "My wife and I decided to check out that show Too Hot To Handle on Netflix, just for shits and giggles, we had made a new profile just for that. Well, our 12 year old went to use Netflix on her own profile, and the recommendations are all filled with different regional versions of the show, and shows that are similar.\n\nShe obviously didn't watch, and it's not like she's a little child who can't see an image of a woman in a bikini. But the point is, we were on our own profile, so why is Netflix recommending it on other profiles as well? What's the point of having separate profiles if they're going to leak into other ones?",
        "upvotes": 62,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1j77itb/is_there_any_way_to_have_netflix_not_infect_every/"
    },
    {
        "id": "1j7vywq",
        "author": "galaxyFighter0",
        "title": "Netflix’s $18 Billion Bet: How the Streaming Giant Plans to Conquer 2025",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j7vywq/netflixs_18_billion_bet_how_the_streaming_giant/"
    },
    {
        "id": "1j7hsyx",
        "author": "Leading-Bug-Bite",
        "title": "Delicious (Movie)",
        "content": "The movie redefined the concept of \"eat the rich\" and brought it to this age.\n\nThe movie slowly showed the pressing dangers to the wealthy, when the many \"peasants\" realize there's just a few of the rich which they can literally eat. The wealthy are treated as beasts for slaughter. A plague that must be dealt with.\n\nIt was a brilliant movie with mild foreshadowing. \n\nUltimately, it was a gentle nudge to the common folk to remember that the many will always outnumber the few. The many are everywhere and the few are helplessly stuck. ",
        "upvotes": 10,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1j7hsyx/delicious_movie/"
    },
    {
        "id": "1j7okkc",
        "author": "characterarcforth",
        "title": "Ad supported plan",
        "content": "Does anyone have the ad supported plan and if so, is it much different from the Ad free plan? Kinda want to save money and switch but the aspect of having some shows locked behind a paywall doesn’t sound good. ",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j7okkc/ad_supported_plan/"
    },
    {
        "id": "1j7n4kj",
        "author": "Alan_Stamm",
        "title": "'Asura:' A Series About Nothing, This Time From Japan",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j7n4kj/asura_a_series_about_nothing_this_time_from_japan/"
    },
    {
        "id": "1j7tyvg",
        "author": "Robemilak",
        "title": "'You' Superfan Cardi B Teases the Trailer for the Series's Fifth and Final Season",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j7tyvg/you_superfan_cardi_b_teases_the_trailer_for_the/"
    }
]