[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 36,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q0gmea",
        "author": "DetectiveHot2071",
        "title": "The Evil Influencer completely leaves out Jodi and Ruby’s secret ‘intimate relationship’",
        "content": "",
        "upvotes": 19,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1q0gmea/the_evil_influencer_completely_leaves_out_jodi/"
    },
    {
        "id": "1pzz9da",
        "author": "UnsleekGeek",
        "title": "I have watched the entire run of Ozark twice now and now I'm certain it's my all-time favorite show.",
        "content": "Prior to Ozark, Breaking Bad was my all-time favorite show (yeah there are definite thematic similarities). The suspense, pacing, and stylistic elements of this show were amazing, perhaps only outdone by the production and the acting.  I've never watched an entire run of any show until Ozark (for context I did wait a couple of years before I watched it again).  Seriously, watch this show.  It's a gem.  ",
        "upvotes": 171,
        "comments": 138,
        "media": null,
        "permalink": "/r/netflix/comments/1pzz9da/i_have_watched_the_entire_run_of_ozark_twice_now/"
    },
    {
        "id": "1q0akb6",
        "author": "the1neisme",
        "title": "Why can't Emily just stay single for a second?",
        "content": "The plot of the show is her love life so that's probably why she never stays single but that just goes to show unrealistic the show is. She keeps jumping from guy to guy without ever processing or healing anything. How problematic is that, she never gets over Gabriel but keeps dating other guys? Toxicity 101",
        "upvotes": 24,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1q0akb6/why_cant_emily_just_stay_single_for_a_second/"
    },
    {
        "id": "1q0eqho",
        "author": "tomaz1989",
        "title": "What are the best shows to binge and finish?",
        "content": "I’ve noticed I would start on a show, stop, &amp; start on another one. I need a show that i won’t get bored of &amp; can watch it until it’s finished\n\nCAN BE NETFLIX OR NONE NETFLIX SHOW\n\nthanks",
        "upvotes": 11,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1q0eqho/what_are_the_best_shows_to_binge_and_finish/"
    },
    {
        "id": "1q0hhi8",
        "author": "CrimsonSigh",
        "title": "What’s one Netflix show you wish you could watch again for the first time?",
        "content": "Looking for recs and curious what really stuck with people.\n\nWhat’s that one show that ruined other shows for you because it was that good?\n\nFeels like I spend more time choosing than actually watching.\n\nWhat are you currently watching that’s actually worth starting?",
        "upvotes": 5,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1q0hhi8/whats_one_netflix_show_you_wish_you_could_watch/"
    },
    {
        "id": "1q00sx0",
        "author": "Time-Philosophy0323",
        "title": "I can’t believe it - I actually won on Best Guess Live!",
        "content": "Won $666 on Best Guess Live tonight, with the guess of “Sandcastle” after clue 3, and claimed the prize shortly after. \n\nStill stunned I won out of 80,000 people! \n\nFor those wondering, I claimed the prize by linking my PayPal account and within 5 minutes the funds were added to my account. Cool to receive a payment from Netflix, Inc.",
        "upvotes": 43,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1q00sx0/i_cant_believe_it_i_actually_won_on_best_guess/"
    },
    {
        "id": "1q09932",
        "author": "Bulky-Farmer-201",
        "title": "best movies to watch this 2025 to really feel the new years eve if currently depressed",
        "content": "Currently depressed and I want to feel happy again. what movies do you recommend for new years eve to be happy again because my year is so wack and bad and depressing ",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1q09932/best_movies_to_watch_this_2025_to_really_feel_the/"
    },
    {
        "id": "1q07bpp",
        "author": "hammonit",
        "title": "Wake up dead man: does Jud remind anyone else of Linguini from Ratatouille?",
        "content": "I mean, the resemblance is uncanny. The mannerisms spot on. And I crush on him just the same. All in all, great movie. Now just yapping to reach my character minimum. ",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q07bpp/wake_up_dead_man_does_jud_remind_anyone_else_of/"
    },
    {
        "id": "1q0aeem",
        "author": "VividShift7011",
        "title": "Boggle on Netflix",
        "content": "Has anyone gotten the Mira avatar? I've been playing for like 3 days straight but habe yet to get it. How did you finally get it? I have Rumi and Zoey.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q0aeem/boggle_on_netflix/"
    },
    {
        "id": "1pzvsds",
        "author": "RiskAndReason",
        "title": "On the last day of the year… what was the BEST SHOW or MOVIE Netflix released?",
        "content": "With the year coming to an end, I’m curious what everyone thinks Netflix absolutely nailed this year.\n\nWhat was the best series, movie, or overall production Netflix released, in your opinion?",
        "upvotes": 30,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1pzvsds/on_the_last_day_of_the_year_what_was_the_best/"
    },
    {
        "id": "1q0eua8",
        "author": "Automatic-Mix-3816",
        "title": "Not able to open Netflix on Chrome",
        "content": "I just got a subscription to Netflix again after a 2 month break and I am not able to open Netflix in Chrome. The only was it works is if I open Netflix in incognito mode. What do I do ? Has anyone else experienced this before ?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q0eua8/not_able_to_open_netflix_on_chrome/"
    },
    {
        "id": "1pzvnb1",
        "author": "thepurplethorn",
        "title": "Anybody see Evil Influencer yet?",
        "content": "Oh Gosh , I am not okay. This show had me shaking I was so upset!\n\nThese two sick women ….., I swear there is so much weird and evil going on in these religious communities which suppose to be the opposite of evil. All this nonsense being poured in their heads ..  some of the commentary was spot on",
        "upvotes": 16,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1pzvnb1/anybody_see_evil_influencer_yet/"
    },
    {
        "id": "1q0crjo",
        "author": "Limp-Inflation-7881",
        "title": "No Thumbnails when using my laptop",
        "content": "Whenever I open Netflix on my laptop there are no thumbnails? Just the category title and what looks like a bunch of underscores. It does not matter if I access via a browser or install the app. I have an Asus Duo Zenbook, running Windows 11. there is no connection issue (100Mbps line and works fine on TV and Mobile). Any one else had this problem and figured out how to fix it?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q0crjo/no_thumbnails_when_using_my_laptop/"
    },
    {
        "id": "1q019ip",
        "author": "wildwoman_smartmouth",
        "title": "Goodnite comfort shows",
        "content": "SUPERNATURAL and LOST are both leaving.  Im new to this sub, but was surprised how briefly LOST was run.  Either ready to cancel or start something new? Im open to suggestions bc there isnt much else I use it for. ",
        "upvotes": 8,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1q019ip/goodnite_comfort_shows/"
    },
    {
        "id": "1pz3051",
        "author": "McNasty420",
        "title": "\"Emily In Paris\" goes beyond hate watching.  This show is  offensive and lazy",
        "content": "Is this what passes as a show now?  This is bad, like \"Sex and the city 2\" bad. The acting.  Jfc.  I've never felt bad for actors before.  What is the point of this?  To anger people? So basically, people just hate watch this show?  How exactly do the pitch meetings go?  \"Let's disgust people!\"",
        "upvotes": 698,
        "comments": 215,
        "media": null,
        "permalink": "/r/netflix/comments/1pz3051/emily_in_paris_goes_beyond_hate_watching_this/"
    },
    {
        "id": "1q09sws",
        "author": "tssessy",
        "title": "Continue watching problems..",
        "content": "Does anyone understand how continue watching works on Netflix. Noticed today on my pc on netflix i only have 2 shows on the list. On the tv netflix i have 15 . On the phone app i have 13. \n\nAnyway.. over time shows disappear or reappear on the list , sometimes i have to manually search for shows i know were on the list and did not finished... Like wtf ... Who programs this apps ?? (Not to mention the new app interface witch is a disaster)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q09sws/continue_watching_problems/"
    },
    {
        "id": "1pzhqeq",
        "author": "Initial_Ebb_9742",
        "title": "The Witcher, season 4–incredibly bad",
        "content": "I’m nearly done with season four and I’m floored at how bad it is. The setups, the dialogue, the acting. I could stop but I’ve gotten this far so I’ll see it through. Maybe I’ve forgotten how bad the other seasons were or maybe they weren’t quite as bad. It’s one of those shows that I really want to like. But it’s embarrassingly awful. The whole Rats storyline is annoying and boring and all the characters dull as rocks with not a good actor in the bunch. I hope the last two episodes at least have a decent payoff. Hemsworth is doing an ok job as Geralt but I def prefer Cavill. I’m not even up to speed on the future of the series but if a season five is planned I may have to nope out at this point. I can see why Cavill wanted out.",
        "upvotes": 36,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1pzhqeq/the_witcher_season_4incredibly_bad/"
    },
    {
        "id": "1pzjogf",
        "author": "damn_it_beavis",
        "title": "Murder in Monaco AI",
        "content": "I like documentaries and it sounded interesting. It took me a few minutes, but I realized that much — if not most, if not all — of the purported voiceovers are AI. You know the drill: To provide exposition or background, documentaries show news footage and you hear a newscaster’s voice. In this show, the “newscasters” are AI. Once I heard it happening, I couldn’t unhear it and turned it off after 20 mins. Bummer and a waste of time.\n\nEdit: Downvote to your little hearts’ content. AI fucking sucks, and you won’t change my mind.",
        "upvotes": 28,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pzjogf/murder_in_monaco_ai/"
    },
    {
        "id": "1q04pgl",
        "author": "Fit_Significance_846",
        "title": "Android + Netflix FHD 4K",
        "content": "Hi all, I just realized Netflix app on iPhone and Android max support FHD. Anyone found out a way to unlock 4k streaming? I would use my great dpi screen on my honor magic v3. Thank u ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q04pgl/android_netflix_fhd_4k/"
    },
    {
        "id": "1q04l4q",
        "author": "monyetguru",
        "title": "Black Rabbit was not bad but not great either.",
        "content": "\"shit show\" the show is my description of this series. and not in a derogatory way, its just everything that could go wrong, did go wrong plot wise.\n\nboth vince and jake have got to be one of the unluckiest characters in all fiction, literally nothing they did ever gone the way they wanted.\n\nim not familiar with the behind the scene but i felt like the show was some kind of an answer from Netflix to The Bear with all the similarities. but with that all the show was somehow enjoyable and made me intrigued each episodes. would probably give it 7/10, not that recommended if im being honest.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q04l4q/black_rabbit_was_not_bad_but_not_great_either/"
    },
    {
        "id": "1pzcxbx",
        "author": "Kurtz62",
        "title": "Adolescence",
        "content": "I got bored tonight so I decided to watch *Adolescence* and I can see why it swept the Emmy’s. \n\nThe fact this show was genuinely good while it was all done in one-shot is very, very impressive. \n\nIt was the third European crime thriller that caught my attention from the beginning to end. \n\nDoes Europe know how to do it better than the U.S.? \n\nWhy do their crime thrillers seem 100x better than ours?",
        "upvotes": 34,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pzcxbx/adolescence/"
    },
    {
        "id": "1pzx2pg",
        "author": "Heapsees",
        "title": "Tea with Judi Dench",
        "content": "Having seen an excerpt from Tea With Judi Dench and having found that it’s carried by Sky Arts and having read somewhere that it’s available on Netflix I’m just gonna cast out a ring buoy for flotation here.\nOr HEY Y’all!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pzx2pg/tea_with_judi_dench/"
    },
    {
        "id": "1pzw1m8",
        "author": "roydogaroo",
        "title": "I was watching episode 1 of The Gentlemen Netflix TV show yesterday, and today the whole series is just gone! (Australia)",
        "content": "Can anybody else in Aus find the Netflix created show The Gentlemen? its not in Continue Watching or searchable for me? Seems really weird. Please help!",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pzw1m8/i_was_watching_episode_1_of_the_gentlemen_netflix/"
    },
    {
        "id": "1pznawe",
        "author": "Important-Story3858",
        "title": "Netflix Double Charge",
        "content": "Hi everyone ! Is this common knowledge or am I missing something? \n\nI joined netflix this month, and was charged the basic package (19$) for the month of December (7th). \n\nI then added on the additional member, and was charged (27$) again on the 30th. \n\nIs it expected to be charged 46$ in a month’s span for signing up plus adding a member? ",
        "upvotes": 6,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pznawe/netflix_double_charge/"
    },
    {
        "id": "1pzc4cz",
        "author": "Previous-District309",
        "title": "Watching The Diplomat S3 feels like reading tomorrow's headlines",
        "content": "The geopolitics are scarily realistic, the betrayals hit hard, and every conversation feels like it could start WW3.\n\n  \nYet I'm glued to the screen yelling \"just tell him the truth Kate!\"\n\n  \nBest political thriller since West Wing?\n\n  \nFavorite \"oh shit\" moment this season? (No spoilers!)",
        "upvotes": 20,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pzc4cz/watching_the_diplomat_s3_feels_like_reading/"
    },
    {
        "id": "1q0cb23",
        "author": "No_Title_5126",
        "title": "Bye bye BigBang and StarTrek. Bye bye Netflix? Not sure theres much point in me keeping my subscription now. 😔",
        "content": "We pretty much watch StarTrek and BigBang on loop, devastating for us to lose both.\n\nWith shows getting fractured between an increasing number of streaming outlets. is it time to go back to boxsets?",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1q0cb23/bye_bye_bigbang_and_startrek_bye_bye_netflix_not/"
    },
    {
        "id": "1pzxl3t",
        "author": "wBrite",
        "title": "Red Road",
        "content": "I thought it said 2025 and now I'm disappointed it only has two seasons. Suggest something similar, or maybe funny. Otherwise I'm rewatching something.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pzxl3t/red_road/"
    },
    {
        "id": "1pz4ppk",
        "author": "Greenfrog2023",
        "title": "Members Only: Palm Beach",
        "content": "What on earth..... Has anyone watched this yet? I will reserve judgement until the end (if I make it through) but first episode has me thinking these women are diabolical and gross. \n\nUPDATE: Since posting this I found a thread in the BravoHouseiwves Sub and the comments perfectly describe this show... \n\nI just watched the one episode in the end. I have a very low standard but even Members Only: Palm Beach was not for me...  ",
        "upvotes": 54,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1pz4ppk/members_only_palm_beach/"
    }
]