[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 36,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pv1y5j",
        "author": "DiesIrae7",
        "title": "Anyone else open Netflix and immediately feel… stuck?",
        "content": "This happens to me more than I’d like to admit. I’ll open Netflix with time to watch something, scroll around for a bit, and then nothing really feels right. \n\nEven when Netflix is recommending stuff that seems like it should be up my alley, I still sometimes end up scrolling and not feeling great about any choice. \n\nI’m sure I’m not alone in this and depending on my mood at the time, end up feeling frustrated, overwhelmed, or even at times indifferent. Curious to know what usually goes through your head in that moment?",
        "upvotes": 48,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1pv1y5j/anyone_else_open_netflix_and_immediately_feel/"
    },
    {
        "id": "1puvzld",
        "author": "Li3Ch33s3cak3",
        "title": "Best netflix shows to binge right now",
        "content": "I’m looking for some new shows to binge-watch on Netflix. I feel like I’ve seen most of the popular ones, but I’m still missing a few gems. What are some underrated shows that you think more people should check out? Or if there’s something new you’ve been watching that’s really hooked you, let me know!",
        "upvotes": 75,
        "comments": 169,
        "media": null,
        "permalink": "/r/netflix/comments/1puvzld/best_netflix_shows_to_binge_right_now/"
    },
    {
        "id": "1pud2t0",
        "author": "Wonderful_Highway629",
        "title": "People with money can afford no ads so they are marketing products to people with no money",
        "content": "The pay more for no ads model makes no sense.  People without money buy the ad version of the streaming service while people with money do not.  Advertisers end up marketing their products to poor people who cannot afford their products anyway while people with more disposable income see no ads.  It’s a really dumb setup.",
        "upvotes": 406,
        "comments": 108,
        "media": null,
        "permalink": "/r/netflix/comments/1pud2t0/people_with_money_can_afford_no_ads_so_they_are/"
    },
    {
        "id": "1pv23b5",
        "author": "BGenie_",
        "title": "Cut/altered scenes",
        "content": "im watching Holidate and this is the third show/movie where I was like.. \"that's different \" they cut a scene with Ryan Gosling and a few other scenes seem altered.. been watching this movie every year for 3 years now, im not crazy, its different. I am finally paying for Netflix myself and I have ads.. is that the reason? \n\nhas anyone else noticed differences in shows they've watched in the past?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pv23b5/cutaltered_scenes/"
    },
    {
        "id": "1pudpow",
        "author": "the_Snowmannn",
        "title": "A Man on the Inside",
        "content": "Seriously underrated show.  Ted Danson is awesome.  A couple Easter egg call outs in late season two, to another show he was in a few years ago (actor cameos/footage).\n\nFunny and emotional and pretty friggin great.",
        "upvotes": 131,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1pudpow/a_man_on_the_inside/"
    },
    {
        "id": "1puqopt",
        "author": "Maleficent-Term-126",
        "title": "Deleted Scenes For Guillermo del Toro's 'Frankenstein' Will Be Included in the Physical Release",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1puqopt/deleted_scenes_for_guillermo_del_toros/"
    },
    {
        "id": "1pv2o1q",
        "author": "madelinebuns30",
        "title": "Happy Merry Whatever",
        "content": "I love Happy Merry Whatever and wish there were more Christmas “shows”, there I said it. I love my Christmas movies don’t get me wrong but this format of a limited series around Christmas is gold and I have no idea why it’s more a more popular model. Ive done some light googling and haven’t come up with anything with similar vibes, can anyone make any recommendations?! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pv2o1q/happy_merry_whatever/"
    },
    {
        "id": "1pun6tf",
        "author": "Available-Towel-8222",
        "title": "[US] Anyone else find the relationship dynamic on The Next Act uncomfortable to watch?",
        "content": "First of all, I will say the show is overall great. These young talents are adorable and I think something special will come from this journey they are on but what in the heck am I watching when it comes to Simon’s relationship with his wife?!\n\nThe way Simon Cowell’s relationship is showcased felt awkward, immature, and at times honestly uncomfortable to watch. There were moments where the dynamic came off as childish yet oddly overbearing, like a push-and-pull that never quite lands as playful or loving. Instead of feeling warm or endearing, it often felt tense and unsettling.\n\nWhat made it more jarring was the contrast, this is someone known for control, precision, and authority, yet the relationship on screen felt emotionally clumsy and strangely unbalanced. It didn’t read as healthy banter or confident love, but more like two people stuck in a loop of immaturity masked as affection.\n\nOf course, editing plays a role, and we never see the full picture. But what was shown felt surprisingly raw in a way that raised eyebrows, not because it was honest, but because it seemed normalized despite how uncomfortable it came across.\n\nCurious if anyone else felt the same watching it.",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pun6tf/us_anyone_else_find_the_relationship_dynamic_on/"
    },
    {
        "id": "1puf6cx",
        "author": "Secretly_Wealthy90",
        "title": "I highly recommend the Movie \"Relay\" on Netflix US",
        "content": "the movie \"Relay\" just dropped on Netflix in the U.S. it was in theaters this past August. fresh plot that many of you will enjoy. good plot twist in the end :)",
        "upvotes": 21,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1puf6cx/i_highly_recommend_the_movie_relay_on_netflix_us/"
    },
    {
        "id": "1puygi1",
        "author": "WorkerEfficient5622",
        "title": "Stranger things season 1",
        "content": "In stranger things 1 How does hopper finding out will’s body being found by state troopers as well as his autopsy being done by state, lead him to become suspicious they’re working for the lab and that the body was fake ?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1puygi1/stranger_things_season_1/"
    },
    {
        "id": "1puwt0x",
        "author": "Legal-Boysenberry-38",
        "title": "Best Documentary/Short Movie?",
        "content": "I need a documentary or short movie to watch with family. Can be rated R if needed, in fact that may be betted. \n\nCan be on Amazon Video, or Netflix.\n\nWhats a must watch currently or what is underrated?",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1puwt0x/best_documentaryshort_movie/"
    },
    {
        "id": "1puwh9h",
        "author": "Commercial-Ad-5723",
        "title": "Ripple",
        "content": "I watched episode one. Unsure if I want to proceed. Has anyone watched this series? If so, does it get any better? It seems a bit contrived in the attempt to intersect these people’s lives. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1puwh9h/ripple/"
    },
    {
        "id": "1puwfz4",
        "author": "Calm_Highlight_9320",
        "title": "Tom Segura - Audio Sync Issues",
        "content": "Anyone seeing chronic lip sync issues with Tom Segura's new special?\n\nConfirmed on multiple devices - so not hardware related.\n\nHow is it possible these days to mess up something so basicl",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1puwfz4/tom_segura_audio_sync_issues/"
    },
    {
        "id": "1pttlqg",
        "author": "intelerks",
        "title": "'Stranger Things' sets up a marathon finish as final runtimes are confirmed",
        "content": "",
        "upvotes": 212,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1pttlqg/stranger_things_sets_up_a_marathon_finish_as/"
    },
    {
        "id": "1pum0ws",
        "author": "EverTheWeirdo",
        "title": "31 Christmas Movies to Stream All Through the Holidays",
        "content": "I’m trying to sort out my Christmas viewing but i feel like there are fewer decent options this year. I was hoping to add A Boy Called Christmas, which I’ve seen before on Netflix and is on their recent recommends list, but I can’t find it on the catalogue. When did it get removed or where did it go? \n\nI’m looking for films that are less Hallmark-ish. I can only stomach so much of the fluffy, cutesy low budget Christmas films so like to mix in drama, tearjerkers, horror, etc but Netflix isn’t delivering much so I will likely be doing some hopping around platforms…\n\nAny recommendations?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pum0ws/31_christmas_movies_to_stream_all_through_the/"
    },
    {
        "id": "1pupofr",
        "author": "HoldMyD20",
        "title": "Extra members and profiles",
        "content": "Hey so I just got my sister and brother added to my netflix account as extra members, and my sister wants her daughter to have her own profile. Is there a way to have 2 profiles added to the extra member account? Cause I'm kinda lost",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pupofr/extra_members_and_profiles/"
    },
    {
        "id": "1ptuqyd",
        "author": "AssociateLittle1487",
        "title": "Worst/ disappointing Netflix shows of 2025? (Rate out of 10)",
        "content": "While there are some good TV shows on Netflix this year, there are also a lot of very bad TV shows that people have been outraged at for Netflix milking them or creating so badly.\n\nFor example, I think that Squid Game 3 is the worst/ most disappointing  Netflix show of 2025, and would rate it a 3-4/10 because of how pointless everything was. (And not in a way which is supposed to be the message of the show- just lame and cringey writing).\n\nHow about you? Please upvote and share this.",
        "upvotes": 79,
        "comments": 184,
        "media": null,
        "permalink": "/r/netflix/comments/1ptuqyd/worst_disappointing_netflix_shows_of_2025_rate/"
    },
    {
        "id": "1puruuc",
        "author": "usenpen",
        "title": "Views about Peaky Blinders: The Immortal Man",
        "content": "What are your views on the new Peaky Blinders movie? Did you like the teaser or do you believe they are just juicing every money from the series until it's unwatchable?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1puruuc/views_about_peaky_blinders_the_immortal_man/"
    },
    {
        "id": "1puxbet",
        "author": "Semiazas_TV",
        "title": "Man vs Woman",
        "content": "I've just watched the highly entertaining Rowan Atkison beïng bossed around by incompetent woman, thank you.\nTo be fair, I'm halfway down a bottle od scotch an d had no where else to utter my annoyance. To keep a long story short, this movie doesnt  portrait woman in a positive light. Wouldn't you agree?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1puxbet/man_vs_woman/"
    },
    {
        "id": "1ptvocv",
        "author": "AssociateLittle1487",
        "title": "What are the best Netflix shows of 2025?",
        "content": "Since I’m doing a post on the worst Netflix shows of 2025, I’ve also decided to make people more optimistic about shows in Netflix by asking this question- what are the best Netflix shows of 2025? There are definitely some iconic shows that have come out of this year. ",
        "upvotes": 43,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1ptvocv/what_are_the_best_netflix_shows_of_2025/"
    },
    {
        "id": "1puufu3",
        "author": "AssociateLittle1487",
        "title": "So Stranger Things 5 comes out in 2 days! Who's excited?",
        "content": "After one month of patience, it's finally here! I hope it becomes the next most watched show on Netflix ever, by producing a plot so memorable everyone will love it!",
        "upvotes": 0,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1puufu3/so_stranger_things_5_comes_out_in_2_days_whos/"
    },
    {
        "id": "1pubkp7",
        "author": "paulnptld",
        "title": "Train Dreams and Commercials",
        "content": "Hi everyone. We switched to the ad-supported version of Netflix a few months ago. I downloaded Train Dreams and watched it on a tablet. No commercials. But now I want to watch it at home on our big screen with my wife.\n\nIt's the kind of film that commercials midway through would just ruin. Can anyone tell me if the commercials are only at the start of the film? Thanks!\n\n",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pubkp7/train_dreams_and_commercials/"
    },
    {
        "id": "1ptkxbr",
        "author": "Notoriously_So",
        "title": "‘Stranger Things’ Shatters Nielsen Record It Already Held As Season 5 Premiere Ushers In Highest Weekly Viewing Total Ever For A Streaming Title",
        "content": "",
        "upvotes": 198,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1ptkxbr/stranger_things_shatters_nielsen_record_it/"
    },
    {
        "id": "1pu76sq",
        "author": "Justalittle_batty",
        "title": "Four seasons (spoiler)",
        "content": "My husband and I just finished watching season one and decided to start it over. The first episode when nick and Anne scare the group in the car one of them yells “one of you is going to die”. Is this foreshadowing? Just a funny line? Intentional? I was shook! ",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pu76sq/four_seasons_spoiler/"
    },
    {
        "id": "1pu9cq7",
        "author": "Ok_Hippo6727",
        "title": "Ad version only good for TV",
        "content": "Recently switched to the ad version to save money. They had a deal going at the time. One thing I've noticed is the number of ads on movies are excessive.\n\nI was going to watch The Martian and paused to see there was going to be 11 Ads!  Ok maybe there's a movie with less, nope. On average there's 9+ ads per movie. Basically one every 12 to 14 minutes giver or take. I just can't find that enjoyable if I'm trying to sit down and watch a movie. For TV sure, but breaking the flow of a film bugs me. \n\nI decided to skip Netflix and go to another streaming service that had less ads or none for a film. When it comes to movie I think I'll be skipping netflix. I still enjoy the shows and the ads are less excessive, but I'm done with movies on Netflix. \n\nCurious if anyone else feels this way. ",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pu9cq7/ad_version_only_good_for_tv/"
    },
    {
        "id": "1pu6zof",
        "author": "Alive-Recording-3400",
        "title": "Christmas movies?",
        "content": "I’ve been using Netflix since a DVD came in the mail. This is the first year I’ve ever not been able to find a Christmas staple movie on the platform. I know this is petty, but I’m genuinely considering canceling my subscription over this. The last few years, you could at LEAST do an add on to watch specific movies, and I feel like this year is all C list movies with horrible plots, and as im angry and writing this, whatever bull I put on in the background literally just said “whatever mister weenie” and then it went to a dramatic scene??? \n\nI would’ve loved that if it wasn’t the ONLY CHRISTMAS MOVIE AVAILABLE. FFS ",
        "upvotes": 5,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1pu6zof/christmas_movies/"
    },
    {
        "id": "1puz28r",
        "author": "Purple-Wait1276",
        "title": "This isn’t queerbaiting — but it feels uncomfortably close",
        "content": "I don’t think Netflix is intentionally queerbaiting.  \nBut there’s a recurring pattern that ends up causing the same emotional damage.\n\nShows like Warrior Nun, Teenage Bounty Hunters, First Kill, and The Bastard Son &amp; The Devil Himself all followed a similar trajectory:\n\nThey introduce compelling characters.  \nThey build relationships slowly and intentionally.  \nThey let the story breathe.  \nAnd then — right when the emotional and narrative stakes finally lock in — they get cancelled.\n\nIn *Warrior Nun*, Avatrice finally becomes canon. Cancelled.  \nIn *Teenage Bounty Hunters*, we end on a major reveal and a painful breakup. Cancelled.  \nIn *First Kill*, the central conflict between families and identities is just beginning. Cancelled.  \nIn *The Bastard Son &amp; The Devil Himself*, the story was clearly structured for long-term development — morally complex, queer-inclusive, and unfinished. Cancelled.\n\nThis isn’t about “my favorite show didn’t get renewed.”  \nIt’s about stories being left structurally incomplete.\n\nNetflix often defends these decisions with algorithmic performance metrics, but that ignores a key issue:  \nmany of these shows are designed to grow, not explode instantly.\n\nQueer narratives, especially, tend to be:\n\n* slower burns\n* character-driven\n* reliant on emotional payoff over time\n\nWhen those stories are cut off right after the point of emotional commitment, the effect on the audience is indistinguishable from queerbaiting — even if the intent was different.\n\nRepresentation technically happens.  \nBut resolution never does.\n\nI’m not asking for infinite renewals.  \nI’m asking for:\n\n* full seasons\n* intentional endings\n* or at least the chance to complete the narrative arc that was clearly being set up\n\nBecause right now, it feels like viewers are being asked to emotionally invest in stories that platforms themselves aren’t willing to finish.\n\nHas anyone else noticed this pattern?  \nOr felt burned by these cancellations in the same way?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1puz28r/this_isnt_queerbaiting_but_it_feels_uncomfortably/"
    },
    {
        "id": "1ptmrbr",
        "author": "dk_x",
        "title": "Netflix’s The One Piece Anime Once Again a No-Show Nearly 3 Years After Announcement",
        "content": "",
        "upvotes": 94,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ptmrbr/netflixs_the_one_piece_anime_once_again_a_noshow/"
    }
]