[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 14,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 63,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lfqj1f",
        "author": "Proof-Pollution454",
        "title": "I just finished watching Trainwreck : Astroworld Tragedy. I am beyond digsuted",
        "content": "I just finished watching this documentary and I beyond disgusted how to this day no one was held accountable , let alone Travis Scott being serious of the aftermath, the company not holding their responsbility of planning this even right. to then see footage of scott telling fans to engage in dangerous behavior is just awful. Like where is the common sense ? Where is the importance of safet when anything could go wrong . To then want fans to go crazy is wrong",
        "upvotes": 220,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1lfqj1f/i_just_finished_watching_trainwreck_astroworld/"
    },
    {
        "id": "1lfimke",
        "author": "sassyblondechik",
        "title": "Just finished Animal Kingdom - I can’t believe I slept on this masterpiece",
        "content": "I honestly can’t believe it took me this long to experience Animal Kingdom. Maybe the title threw me off—I always assumed it was some kind of nature documentary or something completely different. But wow… what a ride.\n\nI just finished binging the entire series on Netflix, and I’m genuinely having withdrawals. The storytelling, the intensity, the family dynamics—everything just pulls you in deeper and deeper. It was addictive from the first episode to the last.\n\nLet’s talk about Smurf. Hands down, she has to be one of the WORST mothers in TV history—manipulative, calculating, and chillingly cold. And then there’s Pope… what a complex, tragic character. I don’t think I’ve ever had such a mix of empathy and unease toward someone onscreen.\n\nI’ll definitely be watching it again, no question. Massive thanks to Netflix for having this gem available.\n\nIf anyone has recommendations for similar shows—crime, dysfunctional families, intense drama—please drop them below! I’m officially on the hunt.",
        "upvotes": 202,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1lfimke/just_finished_animal_kingdom_i_cant_believe_i/"
    },
    {
        "id": "1lfb5mu",
        "author": "intelerks",
        "title": "Millie Bobby Brown’s Netflix film hit by food poisoning outbreak during overseas filming",
        "content": "",
        "upvotes": 222,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1lfb5mu/millie_bobby_browns_netflix_film_hit_by_food/"
    },
    {
        "id": "1lfpaf4",
        "author": "Sudden_Pop_2279",
        "title": "Squid game season 3 new poster",
        "content": "",
        "upvotes": 18,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lfpaf4/squid_game_season_3_new_poster/"
    },
    {
        "id": "1lfs0z2",
        "author": "HehroMaraFara",
        "title": "Americas Sweethearts S2",
        "content": "\nThat team LOSES 100k in their luxury box seat cushions, which would represent the women being able to pay all their utilities for the year alone.\n\nShame on the Cowboys, shame on those in charge of the Cowboys Cheerleaders and they need to do better for those women who put in JUST as much work if not more, actually doing the physical work as well as all the prep and not just sitting in some cushy offices whining about being busy.\n\nIt was super gross watching the leadership blatantly getting retribution on one of the core 6 asking for the better pay. If that’s not opened them up for a lawsuit I don’t know what would. \n\n",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lfs0z2/americas_sweethearts_s2/"
    },
    {
        "id": "1lfk7ds",
        "author": "mushybananabruh",
        "title": "Help me get into a TV series!",
        "content": "Hi everyone! I can finally afford Netflix again and I’m so excited! I’m looking to get into a new Netflix series. I really like psychological thrillers and mysteries. So far, I have finished Money Heist, How to Get Away with Murder, and You. I loved these all. This is my type of genre. Do you have any recommendations of what I should start next based on my interests? Thanks!",
        "upvotes": 7,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1lfk7ds/help_me_get_into_a_tv_series/"
    },
    {
        "id": "1lfiop0",
        "author": "MamaMia1325",
        "title": "The Waterfront...",
        "content": "I love the actors in it. I think it just came out yesterday and it has gotten great reviews-being compared to a mash up of Ozark and Dawson's Creek. \n\nWho has watched it? What are your opinions? I'm starting it tonight.",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lfiop0/the_waterfront/"
    },
    {
        "id": "1lfvtqb",
        "author": "sugarfuldrink",
        "title": "Any latest working dual subtitles out there?",
        "content": "I've searched for viable options but they are not really working, what other options do I have? I'm planning to watch together with my foreigner friends and it would be nice to be able to do dual subtitles.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lfvtqb/any_latest_working_dual_subtitles_out_there/"
    },
    {
        "id": "1lfrftj",
        "author": "VesnaKostic",
        "title": "I need series about the GODS, especially the GREEK GODS, the most similar possible TV show Kaos, Blood of Zeus",
        "content": "\n\nPlease write me recommendations about series where the plot is based on GREEK MYTHOLOGY and GODS. To be similar to Blood of Zeus, Kaos. It can also be similar to American Gods and The Sandman, but the first two take priority. Thank you very much\n\n\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lfrftj/i_need_series_about_the_gods_especially_the_greek/"
    },
    {
        "id": "1leu633",
        "author": "NoSweat_PrinceAndrew",
        "title": "Is there a way to remove the 'Add account' on the Netflix home screen? Our 8 year old has worked out he can just create a new account with adult content",
        "content": "Seems like a bit of a design flaw on Netflix part. Our 8 year old has worked out that if he loads Netflix on the TV when it gets to the screen to select a profile he can just create a new profile and just leave the children content box unlocked, enabling all the adult content to him\n\nI've looked everywhere on the app to see if the 'add profile' option can be removed but haven't been able to work it out\n\nAny suggestions??",
        "upvotes": 107,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1leu633/is_there_a_way_to_remove_the_add_account_on_the/"
    },
    {
        "id": "1lfj2b5",
        "author": "Miserable_Ad1914",
        "title": "Thoughts on Bet",
        "content": "Just finished watching Bet. Lowkey, it was so freaking good. While its more its own thing and doesnt follow the Kakegurui plot, I cant wait for more. But I also want that damn background ost bruh 😭. What are your thoughts if you weren't seeing it as a Kakegurui emake?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lfj2b5/thoughts_on_bet/"
    },
    {
        "id": "1lfo7yv",
        "author": "THC-Destroyer",
        "title": "Looking for an older show",
        "content": "Im looking for an older nature documentary series that used to be on netflix. Iirc it covered very dangerous species, and there was an episode about the black mamba. Im pretty sure it was made by a major network like nat-geo or Animal Planet. I remeber it had rlly cool graphics(for the time) showing how the venom interacted with nerve cells and such. Thats about all i can remeber though lol",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lfo7yv/looking_for_an_older_show/"
    },
    {
        "id": "1lf057q",
        "author": "Conscious_Tonight_85",
        "title": "Looking for a new series",
        "content": "Looking for a series to watch, i feel like ive seen everything on netflix and prime that is good, but am trying to find more hidden gems\nSomething that has the vibe of any of these\nBreaking bad\nMayor of Kingstown\nBetter Call Saul\nOzark\nAnimal Kingdom\nSirens\nDead to Me\nYou\nsuccession\nSneaky Pete\nLandman\nMobland\n… Anything that would compare to those,\nThanks!\n(I have crave, apple tv, prime, paramount and netflix)",
        "upvotes": 34,
        "comments": 82,
        "media": null,
        "permalink": "/r/netflix/comments/1lf057q/looking_for_a_new_series/"
    },
    {
        "id": "1lfmd2e",
        "author": "omes000",
        "title": "Netflix stuck on Widevine L3 and E100 errors on Pixel 9 Pro — support refuses to help",
        "content": "My Pixel 9 Pro shows Widevine L1 in DRM Info, passes SafetyNet and Play Integrity, and is Play Store certified. Still, Netflix is stuck on L3 with error code 500.-1029 in the app, and I get E100 errors in the browser.\n\nI’ve factory reset, reinstalled the app, tested multiple accounts, confirmed L1 support, and even reached Netflix support — they said there’s “nothing they can do,” despite this being a backend DRM provisioning issue.\n\nOther streaming apps like Amazon Prime/Max show HD and confirm L1 works. This is clearly a Netflix-side problem. Has anyone gotten Netflix to reset their DRM provisioning, or is there a workaround?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lfmd2e/netflix_stuck_on_widevine_l3_and_e100_errors_on/"
    },
    {
        "id": "1lfrbeq",
        "author": "LocksmithMinimum8217",
        "title": "Looking for a good show",
        "content": "I really like to watch TV while I play Xbox, but I can't find any good shows i'm looking for a show that I don't have to pay a whole lot of attention too. I don't really care what genre as long as it's not romance or anything do you guys have any recommendations ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lfrbeq/looking_for_a_good_show/"
    },
    {
        "id": "1lete3i",
        "author": "ThrowALifeline89",
        "title": "How is anyone supposed to hear all the dialogue that's being said with the audio being the way it is?",
        "content": "Hey everyone! Audio in movies not being great is at this point a well documented thing I believe. Yet it almost seems to be getting worse. I just watched *Extraction* on Netflix because someone recommended it to me. I mostly enjoyed the movie but the audio was so bad. Like there was an emotional scene between two characters but I couldn't understand a single word that one of them was saying. But then the explosions and gun shots are way louder. Sure, to a degree this can be used as a stylistic choice to make the violence more intimdating and such. However it can not be in the interest of the filmmakers that I, as a viewer, end up moving the volume up and down constantly depending if there are people talking or if there is fighting going on. Constantly.\n\nWhen are TV &amp; movie producers going to adress this problem? People have made videos about this on YouTube for years yet nothing is being done about it; what's up with that?",
        "upvotes": 19,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1lete3i/how_is_anyone_supposed_to_hear_all_the_dialogue/"
    },
    {
        "id": "1lf0znm",
        "author": "satsrikom",
        "title": "Suit Vs Lincoln lawyer",
        "content": "I like both the series. Though few elements matches, but Harvey specter and Mickey heller have their own swag. Mickey’s Lincoln is so dashing and his screen presence also very good.\nHarvey having Mike (inside court)and Mickey having Cisco(outside court). \n\nEagerly waiting for the next season! ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lf0znm/suit_vs_lincoln_lawyer/"
    },
    {
        "id": "1leylve",
        "author": "ninarinaa",
        "title": "i need show recs like now pleaseeee",
        "content": "watching shows is literally the best part of my day but i haven’t been able to find a good one in ages. \n\ni’ve enjoyed shows like game of thrones, desperate housewives, shameless, greys, money heist, derry girls, friends, breaking bad, gossip girl, the originals, the walking dead, dead to me, oitnb.\n\ni did NOT enjoy the last kingdom, lost, superstore, supernatural and succession. just found them boring. \n\ni thought i was into 2000s shows but i found the OC, gilmore girls and one tree hill extremely boring. i need shows that have loads of seasons and episodes. please im literally soooooo bored. ",
        "upvotes": 5,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1leylve/i_need_show_recs_like_now_pleaseeee/"
    },
    {
        "id": "1lezeg1",
        "author": "Zaorth",
        "title": "Fubar(S2) is so bad",
        "content": "I really enjoyed the first Season and had the same expectations for the 2nd Season.\n\nBut after watching the first episode on season 2. It’s just heartbreaking for me to continue. \n\n- Terrible acting from the entire cast\n- Felt more like they had memorised the scripts instead of actually having a conversational flow\n- All the scenes were pretty much predictable\n\nThis is a series I would only continue if there was nothing left on the internet for me to consume.\n",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lezeg1/fubars2_is_so_bad/"
    },
    {
        "id": "1lf51m3",
        "author": "Indoril-Nerevar337",
        "title": "Netflix Challenges Theme Parks with New Immersive Experience Centers in Philadelphia, Dallas, and Vegas",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lf51m3/netflix_challenges_theme_parks_with_new_immersive/"
    },
    {
        "id": "1lfjoq4",
        "author": "Stehno",
        "title": "Netflix starts charging on their own??",
        "content": "I haven’t had the time to contact support but I’m curious if you had similar issues. I cancelled my subscription a while back because this bloody service won’t allow me to watch my payed service at my parents home in a different town acting like a cable. Asking if I changed household. So I can’t watch while traveling. \n\nWell suddenly I get e-mail (welcome back kind of thing) that my subscription is renewed which I didn’t do. In the past this had to be done via phone app. So I’m checking devices activity and see last activity from my tv the day it started charging and remember I accidentally clicked on the app and closed it. \n\nIs it possible these scammers are now trying to scam people into subscription purely based on opening an app? Is there any way to recover the money? I don’t want to subscribe. Do I need to uninstall the app just to be safe? Thanks. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lfjoq4/netflix_starts_charging_on_their_own/"
    },
    {
        "id": "1lfovaf",
        "author": "SnooTomatoes7723",
        "title": "Shows that should have ended earlier",
        "content": "",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lfovaf/shows_that_should_have_ended_earlier/"
    },
    {
        "id": "1leofd9",
        "author": "berrey7",
        "title": "Trainwreck: I have been looking forward to each Tuesday release.",
        "content": "I actually really like it, and I think they have done a really good job with it.  \n\nIt's been awhile since My wife and I have had something to look forward to each week as a series.",
        "upvotes": 13,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1leofd9/trainwreck_i_have_been_looking_forward_to_each/"
    },
    {
        "id": "1lfa6wn",
        "author": "falorraine",
        "title": "Language Filter",
        "content": "Why don’t they have one?  So irritating when I decide on some and it’s not in a language that I understand. Unless, I’ve completely missed how to filter my results.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lfa6wn/language_filter/"
    },
    {
        "id": "1lep5xz",
        "author": "Cartman",
        "title": "Netflix House to open in Philadelphia in late 2025",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lep5xz/netflix_house_to_open_in_philadelphia_in_late_2025/"
    },
    {
        "id": "1lf6loe",
        "author": "yeetmysock69",
        "title": "Netflix Account gone?",
        "content": "Hello,\nI tried logging into my Netflix account just now and I was logged out from every device.\nWhen I try to log back in, it tells me that there is no account with this email.\n\nIt acts as if my account has never existed, even though I've been subscribed for years.\n\nI can't find anything about this online and I don't want to chat with the AI Netflix support.\n\nCould anyone help me with this issue?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lf6loe/netflix_account_gone/"
    },
    {
        "id": "1lf354z",
        "author": "ferdia6",
        "title": "Constant freezing after adverts",
        "content": "Right I know this has been posted before but the posts are all old and I'm doing one last attempt to fix this before cancelling. \nOn my Panasonic TV netflix freezes after an advert. Every single time. You need to back out and restart. \nMy TV doesn't allow me to uninstall and reinstall the app, literally every other streaming app on there works without fail. \n\nIs there any point in me even attempting to fix this, I know this post is a fairly desperate one but here I am. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lf354z/constant_freezing_after_adverts/"
    },
    {
        "id": "1lf2a01",
        "author": "AnnArchist",
        "title": "When I select English subtitles it shows Russian(I think) subtitles",
        "content": "If I select English CC it won't play English. Some shows have English CC and English and one will work. It's really annoying when I'm trying to read and keep the volume low.\n\nAnyone ran into this? US location \n\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lf2a01/when_i_select_english_subtitles_it_shows_russiani/"
    },
    {
        "id": "1lfffy7",
        "author": "PieDifferent1180",
        "title": "Is Netflix making all shows with gay characters 18+",
        "content": "For some time I've been wondering how some shows like Voltron, She-ra, Steven Universe and The Dragon Prince all of whitch were rated 7+ in the past have been booted up to 18+ in recent years despite having much in common with shows like Hilda and ATLA, no sex or nudity, no swearing and no gratuitous violence. I realized like 5 minutes ago that the thing separating the higher rated shows was their inclusion of LGBT characters. Ive noticed this with shows like NHIE or Arcane, both of witch were rated lower (14+ and 16+ respectively), are now 18+ and they also include LGBT characters. Idk i think netflix is doing kids a disservice by not letting the m watch these completely appropriate shows for  no substantial reason especially given that they had appropriate ratings before.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lfffy7/is_netflix_making_all_shows_with_gay_characters_18/"
    },
    {
        "id": "1lew6ya",
        "author": "LoonyToony1",
        "title": "Any ideas for mobile and pc tools to add subtitles to a show or a movie that don't have the language you know?",
        "content": "I am trying to watch one piece and solo leveling but they don't have subtitles and it's really annoying and I am trying to learn Japanese when watching but they only got Japanese sub any ideas?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lew6ya/any_ideas_for_mobile_and_pc_tools_to_add/"
    }
]