[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 48,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1r2tosl",
        "author": "Fun_Molasses5215",
        "title": "Love Is Blind cast member had to be hospitalised after she poured nail glue directly into her eye during the show",
        "content": "",
        "upvotes": 568,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1r2tosl/love_is_blind_cast_member_had_to_be_hospitalised/"
    },
    {
        "id": "1r3gml2",
        "author": "DJ-Praxis",
        "title": "Twilight of the Gods was AWESOME",
        "content": "But it was INCREDIBLY NSFW. I don't mind that personally at all- that's how the myths go. But I definitely do understand why it got canceled. It dives straight into some of the most uncomfortable themes that the Myths were originally all about. Not to say there is one true interpretation of the individual Gods, but the Thor we get in TotG is written waaaaay more like the Thor of old, a far cry from the Marvel Thor the majority of modern consumers are more used to.  \nThat's just one example. The Myths are filled to the brim with murder, torture, damnation, war, death just to name a few of the more... comfortable examples.   \nI hope it gets picked back up. I want to see the next chapter of the story. And I absolutely believe it stands well on it's own as a fantastic take on the stories. ",
        "upvotes": 16,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r3gml2/twilight_of_the_gods_was_awesome/"
    },
    {
        "id": "1r3j63x",
        "author": "messengers1",
        "title": "'The Empress' Makers Set Historical Epic 'Witches' at Netflix",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r3j63x/the_empress_makers_set_historical_epic_witches_at/"
    },
    {
        "id": "1r3hdng",
        "author": "Opening_Apple4121",
        "title": "I watched the series of unfortunates events, I love it!",
        "content": "I watched the show and I absolutely adored it! I watch til S1 EP 5 for a school project, but left it, so when I picked it up again this year I started being invested in it so much! \n\nThe problematic average adults not believing the kids can be so true at times, especially the loneliness the kids feel about someone not believing them at all. Then those same adults being ignorant of how they treated them (cough cough Poe cough). \n\nI loved how each information was revealed, the pacing was satisfying, and I loved how the Baudelaire kids got the ending they want in the end even if for them it was unsatisfying, they got the ending they created. \n\nNow question: Anything the show did different from the book other than the ending? (I read that it was unsatisfying for most) ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r3hdng/i_watched_the_series_of_unfortunates_events_i/"
    },
    {
        "id": "1r32psp",
        "author": "RiskAndReason",
        "title": "What did you WATCH LAST on Netflix?",
        "content": "I’m in that phase where I can’t decide what to start next. Looking for either something new that surprised you or an all-time classic that still holds up.\n\n\n\nWhat’s the last thing you watched that made you think, “yeah, that was worth it”?",
        "upvotes": 23,
        "comments": 122,
        "media": null,
        "permalink": "/r/netflix/comments/1r32psp/what_did_you_watch_last_on_netflix/"
    },
    {
        "id": "1r3corq",
        "author": "YoyoCando",
        "title": "Recommend something",
        "content": "Iam high as f recommend me something funny and light  to watch \n\nMore characters so i can post \n\nMore characters so i can post\n\nMore characters so i can post \n\nMore characters so i can post",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1r3corq/recommend_something/"
    },
    {
        "id": "1r3iyfo",
        "author": "nairgoks",
        "title": "The Big Show Show should return!!",
        "content": "I happened to watch The Big Show Show and ended up finishing it in one sitting. Such a positive, fun, feel good series.\n\nI was gutted to know that this got cancelled - the combination of reasons being low ratings and difficulty to shoot during lockdown. \n\nAny way the people who loved this show can bring this back. Netflix is filled with crime documentaries, Korean romantic shows and what not but family/kid shows like these bring back genuine smiles and laughs.\n\nThe Big Show was good, rather surprised me. The main cast was brilliant. Not a minute of lag. Just fun and as it ends (well ended back in 2020 and I’m ranting about this in 2026), I’m genuinely gutted.\n\nBring it back!!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r3iyfo/the_big_show_show_should_return/"
    },
    {
        "id": "1r2skm6",
        "author": "Deepakddxboi",
        "title": "Starting Dark show",
        "content": "So I started this show yesterday, finished 1st episode and i think I can watch this show. Heard that this show is \"Masterpiece\". What should I keep in mind before watching the whole series? The 1st episode reminds me a lot of stranger things like small town, children out of their house at night, stranger Mysterious building and more. My question was is this show really worth watching or its  just hype? ",
        "upvotes": 15,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1r2skm6/starting_dark_show/"
    },
    {
        "id": "1r31vw6",
        "author": "Zealousideal-Net6142",
        "title": "Dark",
        "content": "Can anyone please suggest a show that is similar to dark \n\nI watched dark a while a ago and was absolutely obsessed \n\nI wanted to watch 1899 but since it only has 1 season so idk if i should    \n\nPls tell me something that is mysterios and dark like chernobyl kinda idk wat im saying",
        "upvotes": 2,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1r31vw6/dark/"
    },
    {
        "id": "1r3aejk",
        "author": "persainjapan",
        "title": "Netflix not showing me all titles",
        "content": "I saw on letterboxd that a movie that i wanted to see (Y tu mama tambien) was available on netflix italy.\n\nI went on my profile to watch it but couldn't find it, at first i thought that they probably removed it recently, but then i googled the movie and it said (again) that i could stream it on netflix italy.\n\nBy clicking the page on google, i was able to watch the movie, not dubbed and only with very few subtitles (usually netflix has many languages to choose from for subtitles).\n\nNow, I'm able to watch the movie, but it still wont show up on any of my profiles and it also doesn't have the little + button to add it to your list.\n\nWhy does this happen? it would bother me  a bit if there were movies that i could potentially watch with my subscription but can't because they don't show up on my profile...",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1r3aejk/netflix_not_showing_me_all_titles/"
    },
    {
        "id": "1r2bmih",
        "author": "Common_Floor_7195",
        "title": "Netflix still does not send 4K content to mobile devices in 2026...?",
        "content": "For $25.00 a month, the fact that you can't stream 4K movies and shows on your iPad Pro in 2026 is just insane and honestly feels like a scam for the premium price(yes I am fully aware you can stream 4K via your TV, set top box, PC or Mac on the web, etc.). Almost every other top service have supported streaming 4K on mobile for YEARS now, besides Netflix. How does a company worth $350 billion in February 2026 STILL get away with this?\n\nNETFLIX JOIN THE REST OF THE WORLD AND SUPPORT\n\n4K STREAMING ON MOBILE ALREADY.",
        "upvotes": 90,
        "comments": 156,
        "media": null,
        "permalink": "/r/netflix/comments/1r2bmih/netflix_still_does_not_send_4k_content_to_mobile/"
    },
    {
        "id": "1r36a60",
        "author": "JJW4143",
        "title": "Netflix party's on xbox",
        "content": "Could we bring back the Netflix parties that used to be on xbox 360? Watch movies with friends in another states or country's was so fun. Is there anyway that they can bring this back?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r36a60/netflix_partys_on_xbox/"
    },
    {
        "id": "1r35sab",
        "author": "Ceceboy",
        "title": "4K content just not working on PC and it's driving my crazy",
        "content": "Getting 4K content to display is always a toss of a coin on my computer and I don't know what's going on. Once I start a series or a movie, I have to be very lucky that it starts in 4K but once I fast forward it just stops responding. After a while of re-opening apps the content locks itself to 1080p and I'm royally fucked from 4K content.\n\nEven when flicking off and on hardware acceleration it just doesn't turn into 4K.\n\nSometimes I switch to Firefox because my Nvidia GPU can upscale 1080p content. Some movies and series actually work with this and it creates a nice and sharp but \"fake\" 4K image but some content drops to 540p! There is no consistency. What the hell is going on? I'm completely lost and I don't know what's happening. \n\nMy browsers and graphics driver are completely up-to-date.\n\nSometimes when skipping forward I get the error code d7353-5101 but it has gotten me nowhere so far.  \n  \nPC specs:  \n\\- CPU: Ryzen 7 9800X3  \n\\- GPU: RTX 5080  \n\\- Display resolution: 3840 x 2160 @ 144 Hz  \n\\- Monitor: LG UltraGear 32GR93U-B - 4K IPS Gaming Monitor - 144hz - HDMI 2.1  \n",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r35sab/4k_content_just_not_working_on_pc_and_its_driving/"
    },
    {
        "id": "1r32wgb",
        "author": "BN_Coldesky",
        "title": "Does Netflix cost more across same household devices?",
        "content": "I have Netflix on 2 TVs in my house already, but I wanna download it on my phone too. Does it cost more if I want to get it on my phone as well? I am from the UK by the way, if that helps.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r32wgb/does_netflix_cost_more_across_same_household/"
    },
    {
        "id": "1r31jst",
        "author": "1and7aint8but17",
        "title": "Unfamiliar - question, SPOILERS for E1!",
        "content": "ok, i want to love this, e1 started tight\n\nthen,... they have full control of the environment, but they allow the agent guy to not only contact his employers, but pass a fucking fingerprint, totally blowing them. \n\nand THEN, when she drugs him, he gets out, ofcourse. \n\ncan expect this level of stupidity through out the series? i stopped after he got out, i just couldn't. id mede damn fucking sure he wouldn't be able to get out, i'd wait for the husband, whatever. \n\nreally want to love his, loving the vibe. but stupid plots just turn me off\n\nthanks",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r31jst/unfamiliar_question_spoilers_for_e1/"
    },
    {
        "id": "1r37zue",
        "author": "cheetocat2021",
        "title": "Are they really phasing out account sharing tomorrow? (Not in household)",
        "content": "A friend linked me to this and it was meant to take place on valentines' day.  But I can't find alternate sources.  I got my own disney plus, but netflix isn't really worth it for me. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1r37zue/are_they_really_phasing_out_account_sharing/"
    },
    {
        "id": "1r24oyw",
        "author": "South-Base3985",
        "title": "Why isn’t there a skip outro button?",
        "content": "When i’m watching an anime or anything similar with a blooper after the outro i normally have to manually skip the outro but it would be so much better if there was a skip outro button. ",
        "upvotes": 37,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1r24oyw/why_isnt_there_a_skip_outro_button/"
    },
    {
        "id": "1r2zapk",
        "author": "June2803",
        "title": "Is There Anything Left That’s Actually Great?",
        "content": "Suggest some truly great series similar to Stranger Things, Dark, From, The Haunting of Hill House, and The Haunting of Bly Manor. I feel like I’ve already watched almost everything in this genre, so I’m wondering if I might have missed something really good. I didn’t mention every show I’ve seen, of course. And maybe you could also recommend a genuinely beautiful, well made series like The Summer I Turned Pretty but only if it’s actually excellent.",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1r2zapk/is_there_anything_left_thats_actually_great/"
    },
    {
        "id": "1r2fvcc",
        "author": "southsideserpent18",
        "title": "Why is music and background audio sound so low but voice is normal?",
        "content": "I watch Netflix almost every night but the last couple of days the sound has been messed up. I can hear the voices talk normal but music is so low and barely can hear it. Is there a fix to this?",
        "upvotes": 9,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1r2fvcc/why_is_music_and_background_audio_sound_so_low/"
    },
    {
        "id": "1r2917l",
        "author": "Bacon_king1202",
        "title": "I’m loving blacklist",
        "content": "Blacklist is amazing I’ve been enjoying it sooo much if you enjoy crime thrillers I’d really suggest this one I hear it starts to decline after season 5 from what I hear but I mean long shows always have a decline eventually ",
        "upvotes": 16,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1r2917l/im_loving_blacklist/"
    },
    {
        "id": "1r35t94",
        "author": "HerbertClapton",
        "title": "Unpopular Opinion: With shows like Dark, people tend to mistake complexity for quality.",
        "content": "Don’t get me wrong, Dark is a good show, but sometimes we judge a show's brilliance by how many family trees and timeline diagrams we have to google to keep up. When a plot is as convoluted as Dark, you spend so much energy on mental gymnastics that you somewhat lose the critical perspective on the actual storytelling.\n\nThen you kind of mistake that personal feeling of achievement for the show’s artistic quality.\n\nYou say “it was awesome”, but you are actually saying: “I am smart I understood it. You did not like it? Well, you did not get it!”\n\nWhat do you think? Did you actually love the story, or did you just love the feeling of finally figuring it out?",
        "upvotes": 0,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1r35t94/unpopular_opinion_with_shows_like_dark_people/"
    },
    {
        "id": "1r33on1",
        "author": "cheno103",
        "title": "SPOILER WARNING! Love Is Blind spoiler revealed as fan-favorite couple is officially MARRIED despite up-and-down romance journey",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r33on1/spoiler_warning_love_is_blind_spoiler_revealed_as/"
    },
    {
        "id": "1r2pgge",
        "author": "floofywall",
        "title": "What was the feature of Netflix that is now discontinued that allowed Netflix to help you choose a movie or show to watch. It was like a gameshow.",
        "content": "I remember having this option on Netflix where it would start up a cheesy interactive game show that helped you pick something to watch. I think it would ask you what mood you were in and started giving suggestions that changed based on your feedback. I remember using Netflix on my PS3 so this would have been a number of years ago.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1r2pgge/what_was_the_feature_of_netflix_that_is_now/"
    },
    {
        "id": "1r27oj1",
        "author": "Right_Wall_1920",
        "title": "Feel good movies with stunning visuals",
        "content": "At my lowest today for some reason. Please suggest some feel good movies (absolutely no violence, nudity, hospitals). Crave to watch something with beautiful visuals. ",
        "upvotes": 13,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1r27oj1/feel_good_movies_with_stunning_visuals/"
    },
    {
        "id": "1r2zlin",
        "author": "The8BillionthNobody",
        "title": "Netflix has removed things from my watchlist without warning.-",
        "content": "So, this morning, I signed into Netflix and I was gonna watch Puss in boots: The Last Wish like any self respecting person would but I couldn't find it, not on my list nor the search feature. Same goes for Across The Spiderverse, Princess Mononoke which I watched yesterday so I know it was there, Can't find Spirted Away either so I think it's safe to assume not a lot of Studio Ghibli is here, How to Train Your Dragon: The Hidden World isn't here nor Despicable Me 4 but I dont care for that one. \n\nAnyway, what's going on? Did my computer accidently change regions and me updating and shutting it down last night instead of using sleep mode changed it back to the US? Is this not a region thing and Netflix is messing up? Any answers would be appreciated. ",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1r2zlin/netflix_has_removed_things_from_my_watchlist/"
    },
    {
        "id": "1r2j6p2",
        "author": "Remarkable_Web4595",
        "title": "FINALLY! 'What I Like About You (2002)' is on streaming again!",
        "content": "I've been waiting since 2021 for this show to come back to streaming. I love Amanda Bynes, so I almost bought the DVDs. But now I don't have to. Thank you, Netflix!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r2j6p2/finally_what_i_like_about_you_2002_is_on/"
    },
    {
        "id": "1r2hdyu",
        "author": "Significant_Ad3441",
        "title": "Star Search Live Voting not Available",
        "content": "Is anyone else not getting the Live voting prompt tonight? I’m so sad, I haven’t been able to vote. It’s not working on my Apple TV nor on my Netflix mobile app",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r2hdyu/star_search_live_voting_not_available/"
    },
    {
        "id": "1r1kboi",
        "author": "laureidi",
        "title": "Star Search giving space for being super preachy gives me the ick",
        "content": "So I am a little late to it, but just now watched the first two episodes of Star Search. I’m not very invested in contemporary music so I didn’t know who Jelly Roll was. I thought he was charming through watching this, noticed a moment when he was talking about the Christian god in the first episode but it was brief so I ignored it. Now at the end of the second episode, I’m realizing I’ll be removing this show from my list. Suddenly the whole thing became a televangelist prime time, which, when we’ve literally mentioned several times already that this show is live for the whole world to see, to me became very tone deaf. I don’t care what kind of religion you practice, as long as you don’t shove it in my face and especially if you’re gonna try to convert me I’m hella out. I just came here to watch some sparkly talent entertainment compete with each other I didn’t ask for missionaries wtf ",
        "upvotes": 111,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1r1kboi/star_search_giving_space_for_being_super_preachy/"
    }
]