[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 97,
        "comments": 285,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mjzix1",
        "author": "LeonNeuton",
        "title": "\"The Internet tantrums have begun.\" -Thanks to Netflix's New split release model.",
        "content": "\nOne common point of contention among both critics and viewers of the new season of Wednesday is Netflix's decision to split the release into two parts. As the first four episodes set up a satisfying new mystery, many feel the mid-season cutoff is abrupt and disrupts the show's momentum, leaving viewers with an \"unsatisfying appetizer\" rather than a complete meal. \n\n\"Fans will have to wait until Wednesday, Sept. 3, for Wednesday Season 2, Part 2 – which will conclude with episodes four through eight.\"\n\nWith so many taking it to the Internet streets; Is the uproar warranted? Or are we just spoiled brats moonlighting as binge divas?",
        "upvotes": 62,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1mjzix1/the_internet_tantrums_have_begun_thanks_to/"
    },
    {
        "id": "1mjrwod",
        "author": "vladtud",
        "title": "Netflix beauty filter",
        "content": "I really dislike how most Netflix shows have a beauty filter on their female characters. It’s very obvious and distracting while watching. Not that it makes it ok for older characters but what wrinkles does Jenna Ortega even have to hide. Ridiculous! ",
        "upvotes": 44,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1mjrwod/netflix_beauty_filter/"
    },
    {
        "id": "1mjenv3",
        "author": "Far_Print5884",
        "title": "Netflix is boring",
        "content": "Is it just me, or does Netflix have a talent for making even good stories boring? I’ve noticed this pattern for a while now, and I’m genuinely curious if others feel the same way. Netflix has some great concepts and plots—things that should, on paper, make for compelling shows or movies. But somehow, they often manage to stretch the story so much that it becomes boring, even frustrating to watch.Netflix shows are so slow paced.",
        "upvotes": 221,
        "comments": 158,
        "media": null,
        "permalink": "/r/netflix/comments/1mjenv3/netflix_is_boring/"
    },
    {
        "id": "1mjn139",
        "author": "pvpixelarts",
        "title": "Untamed is just so so",
        "content": "Just my personal opinion on Untamed series. \n\nIt was so much hyped up IMO. No depth in the story line and I could not keep myself engaged in the series at all. What you all think? ",
        "upvotes": 43,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1mjn139/untamed_is_just_so_so/"
    },
    {
        "id": "1mk4rmd",
        "author": "EnvironmentalOne8630",
        "title": "Looking for tv series recommendations",
        "content": "I tend to like more realistic shows but an open to all genres for the most part just no anime or cheesy cliche written stories. My favorites include\n\nLost\nThe leftovers\nThe stand\nMr robot\nAmerican primeval \nThe man in the high castle\nMindhunter\nOzark\nBloodline\nThe crowded room (very insane)\nMobland \nThe last of us (season one only)\nWalking dead\n\nThat’s all I can come up with at the top of my head and I do like most of Tyler Sheridan shows except for lioness and landman was “ok” would have been better without the obnoxious ex wife and daughter. The ones listed above are generally the shows I tend to enjoy. \n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mk4rmd/looking_for_tv_series_recommendations/"
    },
    {
        "id": "1mk3ufm",
        "author": "ToonAdventure",
        "title": "The World of Dr.Seuss | Official Announcement | Netflix Jr",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mk3ufm/the_world_of_drseuss_official_announcement/"
    },
    {
        "id": "1mk3rmw",
        "author": "grindingcoffeebean",
        "title": "TV Show: You (Potential Spoiler)",
        "content": "You can go ahead and spoil it for me (please!). \n\nMy partner started watching this tv show and I grab bits and pieces of the show but it’s freaky as hell. Every time I see the screen, there’s a new person in the glass cell. \n\nCan someone dumb it down for me and tell me what the show is about, I get trauma from watching bits and pieces of this show. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mk3rmw/tv_show_you_potential_spoiler/"
    },
    {
        "id": "1mja9b7",
        "author": "ComfortableWage",
        "title": "Anyone else getting tired of good series getting cancelled to the point you're just reading books more instead?",
        "content": "To be honest, that's where I'm at. And this doesn't just apply to Netflix, but Amazon and other streaming services as well. I'm tired of them pumping out series like candy, some of which in my opinion are really good, only for them to eventually get cancelled often times after just one or two seasons.\n\nIt's annoying. It's a disservice to subscribers. And frankly, I've been reading books of any series I find online now instead anyways because I've been so conditioned to just assume anything I like will eventually get cancelled anyways. \n\nAnd honestly? The books have been offering me a much better experience overall. I feel better, even if I spend all day reading a book or two, than I would've had I spent it binging a show. I also have the added confidence knowing that I'll be able to finish the series without getting pissed off after wasting so much time watching it only to find out it's cancelled later.\n\nSo yeah... books for the win! Depending on how into books I go I may honestly just get rid of my Netflix subscription altogether.",
        "upvotes": 67,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1mja9b7/anyone_else_getting_tired_of_good_series_getting/"
    },
    {
        "id": "1mj4s0m",
        "author": "BadShi-6",
        "title": "What’s with every new series being split in to 2 parts?",
        "content": "I’ve just sat down to watch the new season of Wednesday — I’ve noticed yet again Netflix has split the season into part 1 and part 2. Why do they keep doing this?  It’s actually super annoying to me, long gone are the days you can just sit and binge a new series on your day off. \n\nDo you guys prefer them split into 2 parts? I lose interest waiting for the second part of anything.. is there specific reasons for this like stretching out views etc? I don’t think it builds suspense like Netflix thinks, it’s actually just annoying 😂 ",
        "upvotes": 112,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1mj4s0m/whats_with_every_new_series_being_split_in_to_2/"
    },
    {
        "id": "1mjt3yx",
        "author": "BitResident",
        "title": "Show idea",
        "content": "Just had a cool idea with a friend of mine.\n\nImagine a medical drama, but set in a fantasy world like JK Rowling's Wizarding World or similar  \nwith a main character like this:\n\n[\\\\\"Accio Vicodin...\\\\\"](https://preview.redd.it/e8r54yurojhf1.png?width=638&amp;format=png&amp;auto=webp&amp;s=fa46d9ff9ee71564bed65854b4afb4339faf2d14)\n\nCan range from muggles accidentally unearthing cursed items.. to young witches/wizards making a badly brewed love potion with unexpected side effects... possibilities are endless.  \nHow about lingering side-effects on the brain from being charmed too many times??\n\nAll the while the main character is suffering from some kind of curse him/herself and tries to piece together the mystery of its origin...",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mjt3yx/show_idea/"
    },
    {
        "id": "1mjza1u",
        "author": "Nice_Pen_8054",
        "title": "Top action K-Drama series on Netflix?",
        "content": "Good afternoon,\n\nI am looking for K-Drama series.\n\nWhich are your top action K-Drama series on Netflix?\n\nI prefer action, adventure or horror.\n\nThank you.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mjza1u/top_action_kdrama_series_on_netflix/"
    },
    {
        "id": "1mjmhcj",
        "author": "Mountain-Bid4317",
        "title": "Netflix series 60+ minutes in length per episode.",
        "content": "Are most Netflix shows like this? I noticed Wednesday's current season so far every episode is exactly 60 minutes (plus or minus one minute). But is this the thing for Netflix series now. Stranger Things has movie length episodes now.",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mjmhcj/netflix_series_60_minutes_in_length_per_episode/"
    },
    {
        "id": "1mk3l8u",
        "author": "UnderstandingFew2905",
        "title": "Are we finally done watching shows just for famous faces?",
        "content": "Used to only click on shows if I knew the actor. Didn’t matter if the plot sucked at least I’d seen them somewhere.\n\nBut lately, not just with me, but my family too is hooked to these short micro-dramas on Bullet, Vertical TV, Flick Reels, even netflix, no celeb faces, tiny budgets, but addictive AF stories and acting.\n\nEnded up DMing the founder of Vertical TV on LinkedIn (turns out he’s from my college). Next thing i know, we’re on a call. He said most of their paying audience is from tier 2 cities Patna, Dehradun, Indore and those cities actually outperform metros in engagement.\n\nIf you are also into this, drop your fav shows…",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mk3l8u/are_we_finally_done_watching_shows_just_for/"
    },
    {
        "id": "1mjr83y",
        "author": "jaydey-waydey",
        "title": "how can i see how many times ive watched a show?",
        "content": "Me and my family always watch cobra kai most nights together, and it would be interesting to see just how many times we have watched it, how can I see that?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mjr83y/how_can_i_see_how_many_times_ive_watched_a_show/"
    },
    {
        "id": "1mjerre",
        "author": "randomboreduserrr",
        "title": "Wednesday season 2 is out, anyone watching?",
        "content": "I watched the first episode and it was okayish only, i am invested tho cuz i can't leave such a short series mid way (its only 4 eps till now). What do you like and dont like about it soo far??",
        "upvotes": 10,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1mjerre/wednesday_season_2_is_out_anyone_watching/"
    },
    {
        "id": "1mjkrm0",
        "author": "Emmazingx",
        "title": "How to secure my account against hackers?",
        "content": "Hi, first time poster here. I don't know if this is the right sub but I need help.\n\nI have a shared account with my mom and siblings, and I think it has been hacked. The language was changed to German today which is what alerted me, but it has probably been going on for a while because I saw that someone has accessed the account from Germany, Greece and Ghana, in the past days/weeks (I normally don't pay attention to these notification emails because it's usually just my siblings).\n\nI used my Netflix profile to watch a show this morning and everything seemed normal, but since then, the profile names have all been changed and the language and suggestions are completely different. This confuses me: how can the algorithm have changed completely in just half a day?\n\nAnyways, I logged into the account, changed the password, logged off from all devices. I enabled PIN verification for all profiles and verified email and phone number. What more can I do to ensure that these people can no longer access our account? Or should we delete the account altogether for safety and create another one with a different email adress?\n\n  \nThank you for your help! Any advice is appreciated.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mjkrm0/how_to_secure_my_account_against_hackers/"
    },
    {
        "id": "1mj2tuw",
        "author": "intelerks",
        "title": "‘The Walking Dead’ Actress Kelley Mack Dies at 33",
        "content": "",
        "upvotes": 27,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mj2tuw/the_walking_dead_actress_kelley_mack_dies_at_33/"
    },
    {
        "id": "1mizgyd",
        "author": "Sweaty-Toe-6211",
        "title": "‘KPop Demon Hunters’ Becomes Netflix’s No. 4 Most Popular English-Language Movie Ever",
        "content": "",
        "upvotes": 43,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mizgyd/kpop_demon_hunters_becomes_netflixs_no_4_most/"
    },
    {
        "id": "1mjmjpv",
        "author": "Green-Direction-5458",
        "title": "Foreign documentaries",
        "content": "Anyone else tired of all of the foreign true crime docs and shows? The English dubbing is awful, most of the time the film quality is awful, grainy looking. Something looks interesting, I'll put it in without realizing, then I hear that's its dubbed, and I just cant continue watching. The voice actors are terrible, sound is bad. I have to assume Netflix gets these shows really cheap. Like cheap filler. There are so many now I feel like canceling ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mjmjpv/foreign_documentaries/"
    },
    {
        "id": "1mju1cv",
        "author": "Dangerous-Forever119",
        "title": "when was netflix peak/fall off in your guys opinion?",
        "content": "for me definitely was i’d say 2015 to 2020 it was consistent original series consistent rewatch able movies from past times, i’d even say 2021 is included.\n\nthat was the golden age to me personally maybe because there wasn’t as many streaming platforms?\n\nnow it’s like the 2-3 shows you expect &amp; a bunch of nothing with a handful of movies…\n\nalso i’m not really a watch subtitles or laggy dub kind of guy another gripe is they only give the good adult animation shows 1 season\n\nlast thing anything good you can’t even binge watch cuz they split it in half like wtf!?",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1mju1cv/when_was_netflix_peakfall_off_in_your_guys_opinion/"
    },
    {
        "id": "1mja0pi",
        "author": "False_Candle1666",
        "title": "Back to school",
        "content": "I feel like every year, all I have to watch when fall comes around is reruns of *Veronica Mars* and *Gilmore Girls*. Are there any other shows that give off the same vibe and are just as good?  \nI've already seen *Pretty Little Liars* and *Gossip Girl* — they’re okay, but I don’t love them as much.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mja0pi/back_to_school/"
    },
    {
        "id": "1mj9oap",
        "author": "Legitimate_Dream9721",
        "title": "Can’t find show name - may be spoilers",
        "content": "I’m watching Surviving Summer again on Netflix (absolutely the show). However, my head is mixing it up with another show that I believe was also Netflix. Can anyone remember what this show was, I have added some facts I recall below - beware some may be spoilers but I can’t remember all details:\n\nDaughter/model sent to live with aunt in Australia after ruining a designers outfit.\n\nThere’s a girl called Coco and I think the uncle had recently died? Aunt and uncle were a surfing family - he had a shed to make surf boards in.\n\nI think there was a character Tom?\n\nDaughter makes friends, offends friends, then makes a fashion show of swim suits through the decades for an annual celebration on the beach.\n\n",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mj9oap/cant_find_show_name_may_be_spoilers/"
    },
    {
        "id": "1mjb5u6",
        "author": "chessieba",
        "title": "I can't really figure out how to word this question to search the answer...",
        "content": "I'm trying to figure out how to prevent Netflix from advertising shows after the season of the show we are watching is over. For example, we just watched the last Puffin Rock and it starts playing a preview from Paw Patrol immediately. I'm not interested in my daughter getting involved with Paw Patrol, so I would like it to just not exist in my house for now. We have the ad free subscription and whenever I try to search a way to turn this off it keeps recommending that we get the subscription we already have. \nThanks for any help!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mjb5u6/i_cant_really_figure_out_how_to_word_this/"
    },
    {
        "id": "1mii95w",
        "author": "MoneyLibrarian9032",
        "title": "‘KPop Demon Hunters’ Becomes Netflix’s No. 4 Most Popular English-Language Movie Ever",
        "content": "",
        "upvotes": 179,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1mii95w/kpop_demon_hunters_becomes_netflixs_no_4_most/"
    },
    {
        "id": "1mjy0u8",
        "author": "ElleimagineAI",
        "title": "What if Famous Artists Watched Netflix? Wednesday Addams Reimagined in Classic Art",
        "content": "**Update:** For anyone wondering, these were made with the [Sinaï Studio](https://sinai.studio/) mobile app.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mjy0u8/what_if_famous_artists_watched_netflix_wednesday/"
    },
    {
        "id": "1mjpq8o",
        "author": "guywho_try-tobe-nice",
        "title": "Weekly watchers lose Wensday is eight out of ten!",
        "content": "I am sure you have all noticed by now but Wednesday is only at eight out of ten. I think this is great as despite the fact it was released today it is at the bottom of the rankings. Truthfully I see this a great blow to Netflix's seeming acceptance to split the releases of big shows like Wednesday and the weekly model in general, I personally prefer binge, I hope most of you guys do to. Anyway I do realize this is the middle of the week and people may not have had time to watch it yet cause it is not the weekend but I see this as promising.\n\nPs I am not a hater of Wensday, I like the show, I am just resisting the two part release streaming model in favor of the binge one. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mjpq8o/weekly_watchers_lose_wensday_is_eight_out_of_ten/"
    },
    {
        "id": "1mjcler",
        "author": "Yali81",
        "title": "Netflix Preview Club-Focus Group",
        "content": "Hi guys!\n\nThis weekend I’m going to see my third preview and I just had a quick question. Do you guys think seeing the show/movie and completing the survey on the first day makes you more likely to get invited to the focus group? Also what is the email that it usually comes from (so I can look out for it)? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mjcler/netflix_preview_clubfocus_group/"
    },
    {
        "id": "1mjg5c6",
        "author": "intothevoidofsadness",
        "title": "Mo Amer Reminds Me Of",
        "content": "I just finished watching Mo on Netflix. I had never seen this show before or heard of him.\n\nHe reminds me of several other comedians/actors/characters. At least his character on the show does.\n\nParticularly his comedic timing, phrasing and the way he talks/sound of his voice. But also the qualities of his character on the show.\n\nSort of a blend of: Seth Rogan; Brett Gelman; Robb Wells; Jeff Garlin; Mike Mitchell\n\nand a tiny bit of Larry David. I think because of the repeated horrible situations he gets himself into.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mjg5c6/mo_amer_reminds_me_of/"
    },
    {
        "id": "1mj8vtt",
        "author": "indiewire",
        "title": "Hunter Doohan on 'Wednesday' Season 2 and His 'Even More Deranged Arc'",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mj8vtt/hunter_doohan_on_wednesday_season_2_and_his_even/"
    },
    {
        "id": "1mj8vqs",
        "author": "scottishdrunkard",
        "title": "Netflix won’t play the credits…",
        "content": "So, I’m watching Netflix and on every show, it will not play the credits. And I’m one of the few people who likes credits, they have nice music. You know that tiny screen it turns into when the credits play and asks if you wanna skip to the next episode? Doesn’t play the credits. Highlighting that window just plays the episode over.\n\nThe Netflix is hooked up to the Sky Box, and the Sky Box has two other slave boxes connected to it. When you play Netflix on those TVs, the credits play. It’s just the main box that doesn’t play them. I was at one point told to turn the Sky Box off and on again to reset it, I even did a hard reset where I cut the power, and rebooted it, but nothing. No change. \n\nCan you help me fix it? Wednesday just started, and I like clicking my fingers at the end…",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1mj8vqs/netflix_wont_play_the_credits/"
    }
]