[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1mvfllr",
        "author": "deucalion1994",
        "title": "Flibco vs Arriva from Turin to Malpensa Airport?",
        "content": "Hey everyone,\n\nI'm looking for a bus from Turin to Malpensa Airport, and based on my flight departure, the most convenient ones would be either Flibco or Arriva because Flixbus doesn't have buses between 6-11am.\n\n  \nI've always used Flixbus and never had any issues, but I've read a lot of negative reviews from both Flibco and Arriva.\n\nI would like to know if anyone has used these companies to travel to Malpensa Airport and how reliable they are. I've read a lot of reviews where the buses never show up, which would be terrible because I'd lose my flight, so I'm trying to avoid that.\n\nThanks.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mvfllr/flibco_vs_arriva_from_turin_to_malpensa_airport/"
    },
    {
        "id": "1mv9pf3",
        "author": "Live-Drag635",
        "title": "Proteine e creatina a buon prezzo",
        "content": "Ciao raga,\nSono nuovo in questo mondo e sto cercando proteine e creatina senza spendere troppo. Avete qualche consiglio su dove comprarle?\nGrazie mille in anticipo!!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mv9pf3/proteine_e_creatina_a_buon_prezzo/"
    },
    {
        "id": "1mupqy5",
        "author": "DirectInteraction825",
        "title": "Piste di atletica",
        "content": "Ciao a tutti, \n\nSono nuovo a Torino, e sto cercando una pista di atletica dove poter correre la sera dopo il lavoro. \n\nNota 1: Non cerco squadre o allenatori, solo una pista dove poter correre da solo (eventualmente con altra gente che come me si allena in contemporanea sulla pista). \n\nNota 2: quando mi alleno random vado al Valentino, ma per provare qualche lungo mi piacerebbe avere una pista. \n\nNota 3: meno costa meglio è. \n\n",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mupqy5/piste_di_atletica/"
    },
    {
        "id": "1muophm",
        "author": "BeginningRace8883",
        "title": "Ci sono tifosi del Toro qui? Domanda sulle trasferte",
        "content": "Ciao a tutti,  \nsono al mio secondo anno da abbonato in Curva Maratona. Non sono italiano, ma mi sono trasferito a Torino e mi sono subito legato al Toro, alla sua storia e al suo spirito (anche perché mi ricorda molto la squadra che tifavo a casa mia).\n\nVolevo chiedere: qualcuno sa se per le trasferte – tipo quella contro l’Inter settimana prossima e in generale per le partite fuori casa – vengono organizzati pullman o viaggi di gruppo dai gruppi di tifosi (UG, TH, CAST ecc.)?\n\nMi piacerebbe unirmi, conoscere gente e vivere la scena al massimo, andando a più trasferte possibile quest’anno \n\nGrazie in anticipo!",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1muophm/ci_sono_tifosi_del_toro_qui_domanda_sulle/"
    },
    {
        "id": "1mucxi0",
        "author": "pisia",
        "title": "Chiese più belle di Torino?",
        "content": "Ieri passeggiando sono entrata nella Chiesa dei Santi Angeli Custodi e sono rimasta ammaliata dalla sua bellezza, con le decorazioni neogotiche piene di angeli ovunque, e ho pensato che a Torino c'è della bellissima arte sacra che non è molto valorizzata. Quali sono le vostre chiese preferite a Torino? Anche la Gran Madre la trovo stupenda e molto particolare, a metà tra un tempio pagano e una chiesa, e la cappella di Lourdes in Santa Giulia è una piccola perla. Menzione disonorevole alla Chiesa del Santo Volto di quel minchione di Mario Botta che se la gioca come chiesa più brutta d'Italia.",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1mucxi0/chiese_più_belle_di_torino/"
    },
    {
        "id": "1mulzdy",
        "author": "KaleidoscopeKey6439",
        "title": "Errore ore iscrizione MBA università Torino",
        "content": "Ciao ragazzi,\n\nsto cercando di iscrivermi all'MBA offerto dalla Saa School of Management (Università di Torino) ma, quando seleziono il corso di mio interesse, non mi fa procedere in quanto mi appare il seguente messaggio:\n\n\"Funzione non accessibile. L'utente non ha i permessi di accesso a questa funzione.\"\n\nQualcuno ha avuto lo stesso problema, oppure sa come risolvere?\n\nHo contattato l'università, mi hanno detto che mi avrebbero fatto sapere ma ancora nulla.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mulzdy/errore_ore_iscrizione_mba_università_torino/"
    },
    {
        "id": "1mudhv2",
        "author": "SwrileyJones",
        "title": "Hiking without a car - Seeking advice",
        "content": "Hello everyone! I am planning to go to Torino for the first time in september/October and am really want to do some hiking. I am having a hard time finding good routes that are available by public transport that does not take several hours to the start, and am wondering if you know about any that I might be missing. \nI am open to sharing a car or with someone if they wish to or contribution with gas money and snacks. Or just joining a guided mountain tour would also be nice. Every advice is highly appreciated!\n\nLove from Sweden",
        "upvotes": 7,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1mudhv2/hiking_without_a_car_seeking_advice/"
    },
    {
        "id": "1mupxfu",
        "author": "Abbronzatissimo",
        "title": "Dove mangiare per il compleanno",
        "content": "Ciao a tutti, M29, sto cercando un ristorante dove mangiare cena con la mia compagna, F28, questo sabato per il suo compleanno.\nCi va bene anche un ristorante pettinato, però abbiamo alcune condizioni: lei non mangia carne e in particolare maiale/salumi, la mangia non di maiale solo se fatta bene, io sono celiaco.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mupxfu/dove_mangiare_per_il_compleanno/"
    },
    {
        "id": "1mupw9h",
        "author": "gloopie21",
        "title": "dove posso trovare i gashapon a torino?",
        "content": "titolo",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mupw9h/dove_posso_trovare_i_gashapon_a_torino/"
    },
    {
        "id": "1mupeen",
        "author": "_pigreco_",
        "title": "ciclo meccanico aperto",
        "content": "ciao, mi si è allentata la cassetta posteriore della mia MTB. dato il mio di fiducia sta chiuso ne avete uno aperto da consigliarmi. a torino città ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mupeen/ciclo_meccanico_aperto/"
    },
    {
        "id": "1munx3h",
        "author": "AdMundane2565",
        "title": "Come arrivare all’aeroporto da Barriera di Milano coi mezzi pubblici?",
        "content": "Per giovedì mattina. Immagino ci vorrà un po’ di tempo in più, ma che mezzi dovrei prendere?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1munx3h/come_arrivare_allaeroporto_da_barriera_di_milano/"
    },
    {
        "id": "1muhdc5",
        "author": "Gexea",
        "title": "Rivenditori Pokemon",
        "content": "Sto cercando negozi che vendano bustine e box Pokémon a prezzi non maggiorati. Ho fatto un giro alle Gru e in alcune edicole di Santa Rita ma per il momento, chi più chi meno, hanno gonfiato un po’ i prezzi. Visto che aprendo Maps escono una miriade di risultati speravo che qualcuno potesse aiutarmi a fare un po’ di scrematura. Grazie in anticipo 🫶🏼",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1muhdc5/rivenditori_pokemon/"
    },
    {
        "id": "1mug7mq",
        "author": "sarahhhh05",
        "title": "conoscete monopolio immobiliare?",
        "content": "sto cercando casa a torino, e tra i vari annunci continuo a trovarne alcuni di un’agenzia immobiliare chiamata “monopolio immobiliare”. negli annunci mettono sono la planimetria e le foto degli esterni. non so se fidarmi, dato che so dell’esistenza di agenzie che chiedono soldi per accedere a database di appartamenti. qualcuno di voi ha già avuto esperienze con loro? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mug7mq/conoscete_monopolio_immobiliare/"
    },
    {
        "id": "1mumin1",
        "author": "jouteix9093",
        "title": "Visited torino today.....",
        "content": "Me and my parents came from Grenoble (France) to Turin this morning.\n\nTo our surprise, everybodys closed and we can't get transport tickets '-'.\n\nThis is the first time we come across a city where you cant buy tickets from a bus stop or tram stop (we tried 6 stops, they're all with little to no information about where to even get tickets)\nAnd train stations, I found one GTT agency inside them (took an e scooter at some point), there was 30 people queue, and when I asked the lady, she advised me to not wzit here and go outside look for tobacco shop :|.\n\nSpent 3 hours walking going over 10 tobacco shops to find them all closed, so we are stuck in the hotel near the Flixbus station, and everything worth visiting is 40 mins walk away.\n\nDownloaded the official tickets app, it requests fiscal number, Im a young student with no fiscal number and my parents arent EU citizens.\n\nWe asked some locals as to why is everyone closed, we're visiting. They said that the whole city basically shuts down for a while after the 15th of august.\n\nWe've visited many countries late august over the past few years, and this is the first time we stumble upon such thing.\n\n300 euros gone to waste .... :/",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1mumin1/visited_torino_today/"
    },
    {
        "id": "1mtx7yh",
        "author": "sezam97",
        "title": "Is Porto Palazzo a safe area to stay",
        "content": "Ciao everybody, I’m sorry for writing in English but I don’t know Italian at all. \n\nMe and my friends are planning to visit your beautiful city in late September for 5 days and we found a place to stay that is near Porta Palazzo. I just wanted to know if the area is safe as some people in the reviews are calling it sketchy, but maybe they are just overreacting. We are 4 men, so we should be fine but we would still like to avoid any confrontation especially at night.\n\nIf you don’t recommend it, then what are some better areas to stay in?\n\nThanks in advance",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1mtx7yh/is_porto_palazzo_a_safe_area_to_stay/"
    },
    {
        "id": "1mtvfa5",
        "author": "gloopie21",
        "title": "giornata a tema arabo a torino?",
        "content": "la mia ragazza è un amante della cultura araba e vorrei portarla per il suo compleanno in giro per torino tra i posti più belli culturalmente arabi, avete qualche idea?",
        "upvotes": 3,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1mtvfa5/giornata_a_tema_arabo_a_torino/"
    },
    {
        "id": "1mtmsht",
        "author": "Powerful-Branch-6956",
        "title": "Cerco un’amica per condividere la passione per la montagna ⛷️🏂",
        "content": "Ciao! 🌸 Sono una ragazza di 34 anni di Torino e sto cercando **un’amica** con cui condividere la passione per la montagna ed iscriversi assieme a uno sci club.  \nSto seguendo un corso di snowboard (sono principiante :)), ma va benissimo anche se fai sci: l’importante è avere una compagna con cui andare in montagna, divertirsi e crescere insieme nello sport.\n\nSo che è ancora presto per pensare alla prossima stagione, ma mi piacerebbe già cominciare a conoscere qualcuna con cui organizzarsi. ❄️",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mtmsht/cerco_unamica_per_condividere_la_passione_per_la/"
    },
    {
        "id": "1mtw6hq",
        "author": "Miserable_Pop_3115",
        "title": "parrucchiere donna colore",
        "content": "ciao, mi serve una correzione colore, li vorrei sul ramato, che non mi spenni, diciamo che sono disposta a pagare max 120 comprensivo di frangia/piega/colore, grazie!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mtw6hq/parrucchiere_donna_colore/"
    },
    {
        "id": "1mtyjnj",
        "author": "Sensitive_Cellist493",
        "title": "Nuovi amici👍",
        "content": "Cerchiamo qualcuno con cui far amicizia e fare magari qualche uscita di sera tra amici, cerchiamo gente tranquilla, min. 15 anni max 18, zona Madonna di campagna 😁🤐😁👍😁👍👍👍👉🏻👈🏻🎀",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mtyjnj/nuovi_amici/"
    },
    {
        "id": "1msw94o",
        "author": "Throwaway_Mess97",
        "title": "Ma è normale non capire nulla quando si guida a Torino?",
        "content": "Mi sono trasferita 5 mesi fa, abito in provincia, ma ultimamente per un motivo o per un altro mi ritrovo a guidare sempre più spesso a Torino. Venendo da Napoli ed avendo guidato a Roma ed anche Milano, oltre che all'estero, pensavo che Torino fosse una passeggiata.   \nPer Dio.   \n38328 semafori, 292390 rotonde, strade senza un senso dove non si capisce se ci sia divieto o precedenza, stop a caso, gente che guida senza un senso, io che sarò entrata in almeno 3 strade dove probabilmente non sarei dovuta passare perché non si capisce un cavolo per come sono messe (se ci sono) le segnaletiche.   \nSono io o è normale avere questa percezione? Seguo maps e comunque sbaglio 300238 volte strada, sto impazzendo ",
        "upvotes": 77,
        "comments": 92,
        "media": null,
        "permalink": "/r/torino/comments/1msw94o/ma_è_normale_non_capire_nulla_quando_si_guida_a/"
    },
    {
        "id": "1mtp06y",
        "author": "AdMundane2565",
        "title": "Clima piovoso",
        "content": "Io dovrei arrivare domani a Torino e dovrei andarmene giovedì, ho letto previsioni meteo abbastanza piovose: di solito in questo periodo dell’anno come sono le piogge lì? Durature o qualche breve temporale isolato? Piove tutto il giorno?",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1mtp06y/clima_piovoso/"
    },
    {
        "id": "1mtjg84",
        "author": "Gulbelesma",
        "title": "TORINO X MODENA - Dove parcheggiare gratuitamente l’auto vicino allo stadio?",
        "content": "Dove parcheggiare l’auto vicino allo stadio?\n\nSarà la mia prima volta a una partita allo stadio e vorrei sapere se ci sono posti e dove di solito la gente parcheggia gratuitamente vicino allo stadio.\n\nGrazie.",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1mtjg84/torino_x_modena_dove_parcheggiare_gratuitamente/"
    },
    {
        "id": "1mtopdl",
        "author": "CDive20",
        "title": "Agenzie legit o scam ?",
        "content": "Ciao a tutti, sapete darmi qualche informazione in più sulle “agenzie” DolceCasa e PiemonteCasa. Stavo cercando nelle zone di piazza Bernini e le loro inserzioni sembravano molto vantaggiose. Posso fidarmi ?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1mtopdl/agenzie_legit_o_scam/"
    },
    {
        "id": "1msry2w",
        "author": "Itchy_Lock9406",
        "title": "\"PIEMONTE CASA\"= TRUFFA\"",
        "content": "Ritengo sia doveroso mettervi in guarda dalla pseudo agenzia immobiliare \"Piemonte casa\", locata in via San Secondo 74 a Torino.  \nDopo la richiesta di 260 euro promettono di aiutarti nella ricerca di una casa nel delirante mercato immobiliare della città. Versata la somma si sono del tutto volatilizzati non rispondendo più al telefono. Sporadicamente ti girano contatti di proprietari che, una volta interpellati, si sono rivelati del tutto inconcludenti. Riassumendo il loro servizio consiste nel aver accesso ad una sorta di lista di immobili (inesistente), che il più delle volte si è dimostrata distante dalla mie richieste.  \nDetto ciò se volete farvi fregare questo è il post giusto.  \n",
        "upvotes": 80,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1msry2w/piemonte_casa_truffa/"
    },
    {
        "id": "1mtl0dd",
        "author": "giggi1276",
        "title": "Torino in un giorno per lavoro",
        "content": "Ciao, devo venire a Torino da Roma per un paio d'ore un pomeriggio di settembre. Sono impegnato per lavoro, non vado per visitare la città. Devo essere alle 14.30 a Torino e finirò per le 19. Suggerimenti su come regolarsi? Pare che alle 19 partano gli ultimi freccia poi più niente, vi risulta? Grazie mille per ogni suggerimento ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mtl0dd/torino_in_un_giorno_per_lavoro/"
    },
    {
        "id": "1mswytl",
        "author": "Ancient_Tourist_4268",
        "title": "Odio i torinesi al semaforo",
        "content": "A Torino e prima cintura vige questa malsana regola che se non parti dove 0,1 secondi appena diventa verde sarai sicuramente vittima di clacson potentissimi.\n\nMa per chi viene da altre province di Italia, anche da voi a così? \n\nPoi mi lamento quando mi capita, ma sono il primo a suonare ahahah. \n\nSono parte del problema. ",
        "upvotes": 20,
        "comments": 75,
        "media": null,
        "permalink": "/r/torino/comments/1mswytl/odio_i_torinesi_al_semaforo/"
    },
    {
        "id": "1mthqui",
        "author": "Floofs-In-Space",
        "title": "Favorite yoga studio? Classes in English?",
        "content": "Hi, I just moved to Turin. I have two questions about yoga here.\n\n1. Are there any studios that offer classes in English?\n\n2. What are your favorite studios? Even if classes are in Italian. I typically practice vinyasa. I like to mix it up with some other types of yoga and pilates, too, so I like studios that offer a few different styles. I did some research online and Pure Love has great reviews. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mthqui/favorite_yoga_studio_classes_in_english/"
    },
    {
        "id": "1mtgega",
        "author": "Pablitos1989",
        "title": "Agosto a torino",
        "content": "Anche ad agosto, a Torino, ci sono tante occasioni per incontrare nuove persone dal vivo! 🎉\n\nUnisciti ai nostri tornei e divertiti giocando:\nMercoledì 20 Agosto – Ping Pong 🏓\nGiovedì 21 Agosto – Calciobalilla ⚽\n\nNon perdere l’occasione di conoscere persone nuove e divertirti!\n\nhttps://whatsapp.com/channel/0029VbAvzsQA89MZy7jPDT3I",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mtgega/agosto_a_torino/"
    },
    {
        "id": "1msx9ur",
        "author": "HelloMotoIt",
        "title": "Maps e affini",
        "content": "....ma perché secondo voi Google Maps non ha ancora capito come sono fatte le strade a Torino ? 🙂‍↔️Allora c'è una corsia centrale e due controviali per senso di marcia ora, com'è possibile che quando devo girare a destra per esempio non mi dice di mettermi nel controviale destro? Io non vado spesso a Torino ma ogni volta ci casco....👹Vedo che devo girare a destra e lui puntualmente mi dice di stare nella strada centrale, idem quando devo girare a sinistra...in alcuni incroci anzi, direi molti , non è possibile dalla strada centrale, dovrei mettermi nella controviale destro per poter girare a sinistra e niente smadonnamenti continui...😰",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1msx9ur/maps_e_affini/"
    },
    {
        "id": "1mt4vf3",
        "author": "goblinlancieredipane",
        "title": "Chi vuole fare un'uscita per una birretta tra amici?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mt4vf3/chi_vuole_fare_unuscita_per_una_birretta_tra_amici/"
    }
]