[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oi9lg0",
        "author": "Task_Force-191",
        "title": "‘One Piece’ Season 2 Sets March Release Date, Drops First Look at Luffy on Drum Island",
        "content": "",
        "upvotes": 15,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oi9lg0/one_piece_season_2_sets_march_release_date_drops/"
    },
    {
        "id": "1ohezqh",
        "author": "Virtual_Ad3412",
        "title": "A “House Of Dynamite “ has to be the worst produced film ever",
        "content": "If there is ever to be an award for worst film ever , look no further . Would never imagine such being released as a ‘film’ . There is no story , just anticipation from different points of view and movie accomplishes nothing, tells story of nothing , exposes nothing, results in nothing , accomplishes nothing . \n\nThe whole movie is literally is like 15mins of a war room on repeat for couple of hours . ",
        "upvotes": 364,
        "comments": 716,
        "media": null,
        "permalink": "/r/netflix/comments/1ohezqh/a_house_of_dynamite_has_to_be_the_worst_produced/"
    },
    {
        "id": "1oie444",
        "author": "Comfortable-Fan-607",
        "title": "Got a Netflix subscription, can’t change email",
        "content": "Basically I just got a subscription and I used the wrong email while making it. I want to change it but when I go to the account page to change it it keeps telling me “looks like something went wrong”. Idk what’s wrong with it. Pls help.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oie444/got_a_netflix_subscription_cant_change_email/"
    },
    {
        "id": "1oidtd0",
        "author": "Do_You_Pineapple_Bro",
        "title": "Unable to watch HoD",
        "content": "Is there something wrong with the system? I try to watch House of Dynamite, but it plays for like 5 seconds before saying \"Sorry, this title isn't available to be played immediately\", but everything else works perfectly fine.\n\nIt's not a parental lock or anything, it just doesn't want me to watch it...despite it being available",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oidtd0/unable_to_watch_hod/"
    },
    {
        "id": "1oi5546",
        "author": "wonhoppa",
        "title": "Physical: Asia - Discussion",
        "content": "\n\nAmong the competitors are world-renowned icons:\n\n* **Korea:** UFC trailblazer Dong-hyun “Stun Gun” Kim leads a powerhouse squad featuring Olympic gold medalist Yun Sung-bin, famed ssireum champion Kim Min-jae, Amotti (Physical: 100 Season 2 winner), Jang Eun-sil, and Choi Seung-yeon. \n* **Japan:** Yushin Okami, one of Asia’s most decorated MMA fighters.\n* **Australia:** Former UFC Middleweight Champion Robert “The Reaper” Whittaker.\n* **Philippines**: Boxing icon Manny Pacquiao, the only eight-division world champion in history.\n* **Thailand:** Muay Thai world champion Superbon.\n* **Mongolia:** Traditional wrestling star Orkhonbayar Bayarsaikhan.\n* **Türkiye:** Four-time oil wrestling champion Recep Kara.\n* **Indonesia:** Physique powerhouse I Igedz “Executioner”.",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1oi5546/physical_asia_discussion/"
    },
    {
        "id": "1ohz669",
        "author": "Historical-Phrase106",
        "title": "Mob War has sent me on a deep dive…",
        "content": "I recently watched Mob War: Philadelphia, which lead me to Fear City… which lead me to Get Gotti and the Irishman… \nI just started The Sopranos:  two and a half decades after its debut… I’m way behind but I’m so glad to find captivating entertainment… ",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ohz669/mob_war_has_sent_me_on_a_deep_dive/"
    },
    {
        "id": "1ohufij",
        "author": "Puzzleheaded-Web9066",
        "title": "Needing a new show!",
        "content": "I love finding a good series and then just going into essentially a portal 🔭. I cannot for the life of me find a new show to start and I’ve been trying for days. \n\nShows I love:\n\nCalifornication,\nGrey’s Anatomy,\nThe Wire,\n24,\nThe Morning Show, \nBetter Things,\nSchitt’s Creek,\nShameless, \nGIRLS (HBO),\nRunning Point,\nNobody Wants This,\nMistresses,\nRevenge,\nIndustry,\nAbbot Elementary,\nSuits,\nBig Sky,\nLincoln Lawyer \n\n\nI am not into sci-fi, horror or thrillers! HELPPP! Thank you! ",
        "upvotes": 13,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1ohufij/needing_a_new_show/"
    },
    {
        "id": "1ohhtte",
        "author": "ArtIsDead77_",
        "title": "House of Dynamite",
        "content": "I know there are handful of people on this sub who did not enjoy this film. \n\nI, however very much liked it. I loved the score, I loved the tension, and I loved the acting. \n\nI loved that the film was told through different characters point of view… It definitely was not a chronological narrative so to say which is fine because it’s a different style of story telling… (Babel). \n\nI know some people didn’t enjoy the ending (cliffhanger) but it’s up for interpretation. I think the Bomb went off and I think the audience not been informed of who launched the bomb also worked quite nicely. \n\nI think it’s okay if you don’t like it, and it’s okay if you do like it. So let’s stop shitting on other people’s opinions and quit trying to change their mind(s). \n\nI think the way how we watch media has changed. The rise of technology and acquiring information so quickly, has sort of shifted how we view movies. We want conclusions, we want information, we want the plot to be easy to follow, we want to know what exactly what happens. So it makes sense If there are a lot of people who are not really a fan of cliffhangers, which is OK. It’s just a different way of absorbing media.\n\n",
        "upvotes": 50,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1ohhtte/house_of_dynamite/"
    },
    {
        "id": "1oi17ze",
        "author": "Prize-Track1335",
        "title": "I just watched Lost in Starlight",
        "content": "It's so beautiful, the animation, the futuristic style, the story... Could you recommend any hidden gems? Korean if possible. It's a 10/10 for me. I've seen most of Makoto Shinkai's work, but I suspect there are just as good directors that I might not know.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oi17ze/i_just_watched_lost_in_starlight/"
    },
    {
        "id": "1oh4o8i",
        "author": "mother_earth_13",
        "title": "Susan in “The Perfect Neighbor” premeditated the shooting, not Just a “fed-Up” old lady.",
        "content": "This started as a reply to a comment, but after seeing so many threads blaming the “permissive” parents or portraying Susan as a harassed senior defending her turf, I had to make it a post. The doc shows Susan’s actions were calculated, not reactive self-defense. \n\nI get the parental angle, I’d be extra vigilant too and would keep my kids away from someone like Susan with her cursing, petty aggressions and escalating beef. You never know what people are capable of so you should trust your instincts, but blaming the parents overlooks Susan’s premeditation.\n\nSusan told AJ’s kid to fetch his mom (knowing it’d bring AJ over), called 911 then shot AJ unarmed in under two minutes. Florida’s Stand Your Ground might cover perceived threats on your property, but why not wait for cops? Lock the door? Retreat inside? Aim non-lethally? The body cams, timelines and forensics scream intent, not fear.\n\nShe escalated from verbal abuse to physical by throwing skates and swinging umbrellas at AJ’s kid to provoke AJ. That’s baiting, not being “fed up.” Any parent would confront that. The trespassing and door-banging excuses ignore how Susan orchestrated it betting on the law to shield her.\n\nParents could’ve chosen differently in hindsight, but Susan had clear alternatives to killing. Someone that determined would’ve found a way regardless. \n\nAccountability’s on her.",
        "upvotes": 336,
        "comments": 96,
        "media": null,
        "permalink": "/r/netflix/comments/1oh4o8i/susan_in_the_perfect_neighbor_premeditated_the/"
    },
    {
        "id": "1ohwjdx",
        "author": "geemav",
        "title": "The problem with Animal Kingdom...",
        "content": "The acting is just so apparent! I'm trying not to be an overly harsh critic, I really do want to enjoy it, but just every moment from every character I'm reminded that they are *acting*. It feels like they are pretending... and in order for me to fall into a story I don't want to feel that way, I want to forget that I'm watching acting. You get what I mean? Does anyone else relate?",
        "upvotes": 3,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ohwjdx/the_problem_with_animal_kingdom/"
    },
    {
        "id": "1ohyxs1",
        "author": "dicedtomatoes55",
        "title": "'A House Of Dynamite' Would Have Worked Better As A Short Film. Hear Me Out.",
        "content": "",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ohyxs1/a_house_of_dynamite_would_have_worked_better_as_a/"
    },
    {
        "id": "1ohrx7h",
        "author": "Other_Vegetable7640",
        "title": "‘Crash Bandicoot’ Animated Series in the Works at Netflix",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ohrx7h/crash_bandicoot_animated_series_in_the_works_at/"
    },
    {
        "id": "1oi6trg",
        "author": "Notspcommonsense",
        "title": "How to find a bing buddy?",
        "content": "I simply cannot be watching supernatural alone. I need someone to hold me to it. How to find a show buddy? I know there’s people out there. Many shows I have a hard time watching because I get disinterested between plot points but if I’m watching with someone it feels tolerable. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1oi6trg/how_to_find_a_bing_buddy/"
    },
    {
        "id": "1ogz75a",
        "author": "Boring_Sand_206",
        "title": "Hidden gems please",
        "content": "I have been unemployed since forever (not for lack of trying!) so I have watched A LOT of Netflix. I think I've watched pretty much everything worth watching on there. Anyone have some hidden gem recommendations for me??",
        "upvotes": 213,
        "comments": 534,
        "media": null,
        "permalink": "/r/netflix/comments/1ogz75a/hidden_gems_please/"
    },
    {
        "id": "1oi7dni",
        "author": "jerkoff1610",
        "title": "House of Dynamite",
        "content": "Just finished House of Dynamite last night and I have to say, the ending really did not satisfy me at all. I understand that the director wanted the ending that way because she thinks it is better to have us think of what might happen instead of just showing us. I think the end could have been more impactful by SHOWING the impact of the bomb or whatever the threat was instead of us showing us a bunch of people freak out. Now I get that was the reason she didn’t show the aftermath, but still it would have been so much more shocking than ending on a cliffhanger.",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1oi7dni/house_of_dynamite/"
    },
    {
        "id": "1ohhaze",
        "author": "peoplemagazine",
        "title": "Joe Keery Officiates Friends' Wedding Dressed as His Stranger Things Character Steve Harrington",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ohhaze/joe_keery_officiates_friends_wedding_dressed_as/"
    },
    {
        "id": "1ogo0q8",
        "author": "Newfie3",
        "title": "House of Dynamite - wholly unsatisfying (spoiler)",
        "content": "I should have known by the horrible deliberate camera-shaking that the movie was going to suck. There is no good reason for deliberate camera-shaking. Then the plot repeated itself from three or four perspectives. Then the movie just ended with zero resolution whatsoever. Sorry Netflix, this movie was a bomb, but not in a good way.",
        "upvotes": 369,
        "comments": 400,
        "media": null,
        "permalink": "/r/netflix/comments/1ogo0q8/house_of_dynamite_wholly_unsatisfying_spoiler/"
    },
    {
        "id": "1ohi2ul",
        "author": "alyxarthurs",
        "title": "Psychological thriller/ghostly horror SHOWS!",
        "content": "My favorite shows on Netflix: \n-Dirty John (season 1)\n-The haunting of Hill House\n-The Watcher\n-The Stranger\n-The fall of the house of Usher\n-You\n-Behind her eyes\n\nI feel like I’m missing something but whatever, you get the vibe. \nI need another show, or shows, that kinda fit with these.  \nAdd on: I despise shows that follow high school schoolers as the main characters. Just not my thing.",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ohi2ul/psychological_thrillerghostly_horror_shows/"
    },
    {
        "id": "1ohqu29",
        "author": "eppicnebula587",
        "title": "Guy Pearce, Teresa Palmer &amp; Ann Dowd Starring In 'Poor Boy'",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ohqu29/guy_pearce_teresa_palmer_ann_dowd_starring_in/"
    },
    {
        "id": "1ohkt4v",
        "author": "SchemeSpecific4573",
        "title": "subtitles out of sync after ad commercial plays",
        "content": "your obnoxious ads ruin the subtitle sync with the audio on whatever show I'm watching. not only are the ads intrusive and irrelevant, but they completely ruin the viewing experience, and I have to refresh the browser every time to get it in sync.  I am canceling my \"paid with ads\" subscription. pathetic. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ohkt4v/subtitles_out_of_sync_after_ad_commercial_plays/"
    },
    {
        "id": "1ohg8ll",
        "author": "namelessfdr",
        "title": "Just upgraded to an LG OLED - best movies and shows to watch in 4K?",
        "content": "Saw \"House of Dynamite\" last night and am looking forward to \"Frankenstein\". Will probably rewatch Fincher's movies. Any other good choices for movies and shows to watch in 4k?",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ohg8ll/just_upgraded_to_an_lg_oled_best_movies_and_shows/"
    },
    {
        "id": "1ohfj09",
        "author": "dea80",
        "title": "Blind Spot",
        "content": "Thoughts from anyone else who watched this? \n\nI’m not sure what hell I just sat through, but a combination of the script, acting, plot, and effects, I’m in shock that this ever got made! ",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ohfj09/blind_spot/"
    },
    {
        "id": "1ohj2ul",
        "author": "Minute-Car8845",
        "title": "How exactly do subscriptions and different accounts work?",
        "content": "Sorry if this comes off as technologically incompetent, but for quite a while my household have been account sharing with my aunt who has her own and offered to pay for 3 others for the rest of the family. We occasionally have trouble accessing Netflix with a message along the lines of 'we have updated the terms and services and you must sign in again', but just now as we caved and payed for our own subscription, we logged back into the account which we thought was blocked and now works. Did we waste our money? Why does Netflix occasionally allow the account and then blocks it? Hope we aren't doing anything wrong and thanks for any information.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ohj2ul/how_exactly_do_subscriptions_and_different/"
    },
    {
        "id": "1ogee04",
        "author": "Western_Quit_4966",
        "title": "Netflix doesn’t care about good writing anymore",
        "content": "The platform is full of shows with huge production value but terrible scripts. It’s all visuals and marketing, zero substance. People only praise it because it’s on Netflix. Who’s tired of this?",
        "upvotes": 378,
        "comments": 221,
        "media": null,
        "permalink": "/r/netflix/comments/1ogee04/netflix_doesnt_care_about_good_writing_anymore/"
    },
    {
        "id": "1ohxext",
        "author": "Own-Tie-640",
        "title": "House of Dynamite - Incredibly unrealistic",
        "content": "You’re telling me the entirety of the USA is safe guarded by a coin toss defense missile launch and there aren’t backup’s in place? Thats what really turned me off to the movie. I get trying to build suspense, but come on now, we have missile defense systems all over the country and it would be near impossible to land a missile on US soil.\n\nAlso, if the suspected missile is nuclear, we’d send a lot more at it than 2. I hope they don’t even bother making a part 2.",
        "upvotes": 0,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1ohxext/house_of_dynamite_incredibly_unrealistic/"
    },
    {
        "id": "1ohw7eq",
        "author": "Apochuman",
        "title": "The Perfect Neighbour - Susan’s Mental Health?",
        "content": "After watching the perfect neighbour I am inclined to ask for opinions on Susan’s mental health condition. \n\nClearly the woman is unwell mentally - her behaviour is erratic and extremely challenging. Her decision making is poor. Her lying is concerning and her ability to exhibit aggressive and confrontational behaviour towards her neighbours but to downplay it and act like a sweet, traumatised poor old lady to the police has my head in a spin. \n\nSadly, she reminds me of a more severe version of somebody that I know and I wonder if there is more to her behaviour than just being a sad lonely old lady. \n\nShe was obviously very anxious and paranoid, the behaviour of the children almost seemed like it became an obsession to her. \n\nCan we divulge on what we think is the psychological reason behind her behaviour and lack of accountability, empathy and compassion for her actions? \n\nIs it schizophrenia, autism, PTSD, a personality disorder - such as narcissism or bipolar? What makes someone act like this?",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ohw7eq/the_perfect_neighbour_susans_mental_health/"
    },
    {
        "id": "1ogep7t",
        "author": "YeetMyM3at",
        "title": "Anyone else spend more time scrolling than actually watching?",
        "content": "I open Netflix planning to watch something, then end up scrolling for 30 minutes trying to pick a show.  \nBy the time I finally choose, I’m not even in the mood anymore.\n\nDoes anyone else do this, or is it just me?",
        "upvotes": 157,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1ogep7t/anyone_else_spend_more_time_scrolling_than/"
    }
]