[
    {
        "id": "1pmfask",
        "author": "TestamentOfAnnLeeAMA",
        "title": "Hi r/movies, I'm Tim Blake Nelson. Ask me anything!",
        "content": "Hi r/movies, I'm Tim Blake Nelson, here to answer your questions.\n\nYou might know me from movies/series like **O Brother, Where Art Thou?**, **Old Henry**, **The Ballad of Buster Scruggs**, **The Lowdown**, **Watchmen**, **Lincoln**, **Holes**, **Captain America: Brave New World,** **Syriana**, **Guillermo del Toro's Pinocchio**, **Nightmare Alley**, **The Incredible Hulk**. Full list of credits [here](https://www.imdb.com/name/nm0625789/).\n\n  \nMy new movie, **The Testament of Ann Lee**, is out in theaters nationwide starting December 25 via Searchlight Pictures. It's directed and co-written by Mona Fastvold. Score by Daniel Blumberg.\n\nIt also stars Amanda Seyfried, Lewis Pullman, Thomasin McKenzie, Christopher Abbott, Stacy Martin, Matthew Beard, Scott Handy, Viola Prettejohn, Jamie Bogyo, and David Cale.\n\n*Synopsis:*\n\n&gt;Ann Lee, the founding leader of the Shaker Movement, proclaimed as the female Christ by her followers. Depicts her establishment of a utopian society and the Shakers' worship through song and dance, based on real events.\n\n*Trailer:*\n\n[https://www.youtube.com/watch?v=-zK\\_nzG36mk](https://www.youtube.com/watch?v=-zK_nzG36mk)\n\nAsk me anything! I'll be back tomorrow (Monday 12/15) at around 2 PM ET to answer questions.\n\n",
        "upvotes": 4927,
        "comments": 867,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0fyu4gwuz37g1.jpeg?auto=webp&amp;s=04f79496a1992b546624fb9ab5497a0eedc885fb"
        },
        "permalink": "/r/movies/comments/1pmfask/hi_rmovies_im_tim_blake_nelson_ask_me_anything/"
    },
    {
        "id": "1pvuj2g",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Marty Supreme / Anaconda (2025) / Song Sung Blue) plus Christmas release throwback discussions!",
        "content": "**New In Theaters**:\n\n* [Marty Supreme](https://old.reddit.com/r/movies/comments/1pvu1u8/official_discussion_marty_supreme_spoilers/?sort=top)\n* [Anaconda (2025)](https://old.reddit.com/r/movies/comments/1pvu1vs/official_discussion_anaconda_2025_spoilers/?)\n* [Song Sung Blue](https://old.reddit.com/r/movies/comments/1pvu1wk/official_discussion_song_sung_blue_spoilers/?)\n\n**Awards Run Catch-Up**\n\n* [Sentimental Value](https://www.reddit.com/r/movies/comments/1pkhnsl/official_discussion_sentimental_value_spoilers/)\n* [It Was Just an Accident](https://www.reddit.com/r/movies/comments/1pkhnwc/official_discussion_it_was_just_an_accident/)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Cast Away](https://old.reddit.com/r/movies/comments/1pvu1y2/official_throwback_discussion_cast_away_spoilers/?)\n* [Miss Congeniality](https://old.reddit.com/r/movies/comments/1pvu1zg/official_throwback_discussion_miss_congeniality/?)\n* [The Family Man](https://old.reddit.com/r/movies/comments/1pvu21f/official_throwback_discussion_the_family_man/?)\n* [Dracula 2000](https://old.reddit.com/r/movies/comments/1pvu22n/official_throwback_discussion_dracula_2000/?)\n* [O Brother, Where Art Thou?](https://old.reddit.com/r/movies/comments/1pvu24c/official_throwback_discussion_o_brother_where_art/?)\n* [Finding Forrester](https://old.reddit.com/r/movies/comments/1pvu25p/official_throwback_discussion_finding_forrester/?)\n\n**Still In Theaters**:\n\n* [Avatar: Fire and Ash](https://old.reddit.com/r/movies/comments/1pqbh9u/official_discussion_avatar_fire_and_ash_spoilers/?)\n* [The Housemaid](https://old.reddit.com/r/movies/comments/1pqbhad/official_discussion_the_housemaid_spoilers/?)\n* [The SpongeBob Movie: Search for Squarepants](https://old.reddit.com/r/movies/comments/1pqbhbe/official_discussion_the_spongebob_movie_search/?)\n* [Ella McCay](https://www.reddit.com/r/movies/comments/1pkhnoq/official_discussion_ella_mccay_spoilers/)\n* [Five Nights at Freddy's 2](https://old.reddit.com/r/movies/comments/1pekchd/official_discussion_five_nights_at_freddys_2/?)\n* [Hamnet](https://old.reddit.com/r/movies/comments/1pekcj2/official_discussion_hamnet_spoilers/)\n* [Zootopia 2](https://www.reddit.com/r/movies/comments/1p7rbyf/official_discussion_zootopia_2_spoilers/?)\n* [Eternity](https://www.reddit.com/r/movies/comments/1p7rc0x/official_discussion_eternity_spoilers/?)\n* [Wicked: For Good](https://old.reddit.com/r/movies/comments/1p2njr5/official_discussion_wicked_for_good_spoilers/?)\n\n**New On Streaming:**\n\n* [Wake Up, Dead Man](https://old.reddit.com/r/movies/comments/1plb82b/official_discussion_wake_up_dead_man_a_knives_out/?)\n* [Jay Kelly](https://old.reddit.com/r/movies/comments/1pg2zf7/official_discussion_jay_kelly_spoilers/?)\n* [Train Dreams](https://www.reddit.com/r/movies/comments/1p4qwxk/official_discussion_train_dreams/)\n* [PBS's The American Revolution](https://www.reddit.com/r/movies/comments/1p4qsya/official_discussion_pbs_the_american_revolution/)\n* [Nouvelle Vague](https://old.reddit.com/r/movies/comments/1oyaqq6/official_discussion_nouvelle_vague_spoilers/?)\n* [Playdate](https://old.reddit.com/r/movies/comments/1oyaqsm/official_discussion_playdate_spoilers/?)\n* [Frankenstein (2025)](https://old.reddit.com/r/movies/comments/1orfrtf/official_discussion_frankenstein_2025_spoilers/)\n* [Hedda](https://old.reddit.com/r/movies/comments/1orfruj/official_discussion_hedda_spoilers/?)\n* [Ballad of a Small Player](https://www.reddit.com/r/movies/comments/1okihwe/official_discussion_ballad_of_a_small_player/?)\n* [A House of Dynamite](https://old.reddit.com/r/movies/comments/1ofgyx9/official_discussion_a_house_of_dynamite_spoilers/?)\n* [The Hand that Rocks the Cradle (2025)](https://old.reddit.com/r/movies/comments/1ofgz2p/official_discussion_the_hand_that_rocks_the/?)",
        "upvotes": 22,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1pvuj2g/official_discussion_megathread_marty_supreme/"
    },
    {
        "id": "1pxnnoq",
        "author": "JeanMorel",
        "title": "RIP Brigitte Bardot (1934-2025)",
        "content": "The Brigitte Bardot Foundation announced on Sunday the death of the icon of 1950s femininity, film actress, singer, muse and inspiration to great artists, but also an animal rights advocate.\n\nShe was undoubtedly one of the greatest French and global stars, an icon of a generation, a symbol in her own way of the emancipation of women and sexual freedom: Brigitte Bardot passed away on Sunday, December 28, 2025, at the age of 91, her Foundation announced to AFP.\n\nBrigitte Bardot was [hospitalized in Toulon in November](https://www.franceinfo.fr/culture/cinema/brigitte-bardot/brigitte-bardot-rassure-sur-son-etat-de-sante-et-se-declare-en-convalescence_7649732.html) and underwent surgery. She was also hospitalized in January 2023 due to respiratory failure. An actress and singer known by her initials, \"BB\" was part of France's cultural heritage, but she also dedicated a large part of her life to animal rights.\n\nFrom the moment she appeared on the film scene, she revolutionized attitudes. Curves to die for, a sensual yet innocent way of moving… She would be the most beautiful woman in the world. Brigitte Bardot, the young woman from a privileged background in Paris, dreamed, like many little girls, of a career as a dancer. Very quickly, she became a model and landed her first role in \\* *Le Trou normand\\** alongside Bourvil.\n\nFrom then on, she was a force to be reckoned with, and much to her parents' dismay, Roger Vadim, then a young film assistant, became her mentor. A year later, at the Cannes Film Festival, the young actress caused a sensation on the Croisette, driving the photographers wild.\n\nBardot was already on par with the stars of the time. Kirk Douglas, captivated, tried to lure her to the United States. Behind the scenes, Vadim continued to mold her and finally obtained the right to marry her in 1952. She had just turned 18.\n\n*And God Created Woman* , the first film directed by her husband. She was 22 years old, and it was primarily in the United States that the film caused a scandal. \"And God created Bardot,\" the Americans say. France then embraced the myth of the young Frenchwoman. A global star was born.\n\nIt's 1958, and Bardot, now BB, is the embodiment of the free woman. A fashion phenomenon. An entire generation dresses, does their makeup, and styles their hair like her. Everything she touches turns to gold. And it's opposite Jean Gabin in the film \" *En cas de malheur\" (In Case of Emergency* ) that she will reveal her acting talents.\n\nIn 1960, she starred in her favorite film, *La Vérité* , directed by Henri-Georges Clouzot, a story of a crime of passion. It was then her foray into the New  Wave, with Jean-Luc Godard and Michel Piccoli, that would leave a lasting impression on film buffs. This was the legendary *Contempt* at the Villa Malaparte in Capri, and her famous line: *\"Can you see my backside in the mirror? -Yes. -Do you think my buttocks are pretty? -Yes... very.\"*\n\nMen came and went in Bardot's life  : Vadim, Trintignant, Charrier. Her second marriage to the latter ( [who died in September  2025](https://www.franceinfo.fr/culture/cinema/le-comedien-jacques-charrier-deuxieme-mari-de-brigitte-bardot-et-pere-de-son-fils-est-mort-a-l-age-de-88-ans_7474855.html) ) was short-lived, but she had a son with him, Nicolas, who was raised by his father. Bardot became the symbol of all French people as Marianne, before finding herself, towards the end of the 1960s, a new Pygmalion in Serge Gainsbourg.\n\n# The hysterical crowd at the 1967 Cannes Film Festival\n\nOn the occasion of the release of Louis Malle's *Viva Maria* , starring Jeanne Moreau, she said of her: *\"Watching her walk is like listening to great music.\"* A second marriage followed, this time to Gunter Sachs. The couple faced the hysterical crowds at the 1967 Cannes Film Festival. Brigitte Bardot could no longer bear the public life.  \n  \nA few unlikely films followed: *Les Novices* with Annie Girardot, *Les Pétroleuses* with Claudia Cardinale, *and Shalaco* with Sean Connery. From this period emerged only one charming comedy by Michel Deville, *L'Ours et la Poupée (The Bear and the Doll)* , where she finally played a tender character opposite Jean-Pierre Cassel. She finally worked under the direction of Nina Campanez and deflowered Francis Huster's character. When the film was released in 1973, no one yet knew it would be her last. She was 39 years old and wanted a change of pace.\n\nThe myth of the most beautiful woman in the world will continue to resonate in the annals of cinema. But it is elsewhere that she will play the role closest to her heart. It is now at La Madrague, in Saint-Tropez, surrounded by her dogs, that Brigitte Bardot is launching her new crusades for animal rights.\n\nIn 1977, she denounced the slaughter of baby seals. For the public, a new Bardot had just been born. A five-day trek across the Canadian polar ice caps led to a ban on the seal fur trade. But the media pressure was too intense, and BB was not yet taken seriously.\n\n# From the free woman to the conservative woman\n\nNine years later, she was selling personal belongings, jewelry, and memorabilia from her former profession. Three million francs were raised to fund her foundation and allow her to dedicate herself more fully to the protection of all oppressed animals. She also bequeathed her property to the foundation. From the abandonment of pets to animal experimentation, and even the hunting of turtledoves, she was involved in every fight. But, little by little, the free-spirited young woman of the 1950s gave way to an increasingly conservative, even reactionary, woman.\n\nBy marrying Bernard d'Ormale, an industrialist with ties to the National Front, she demonstrated her affinity for Jean-Marie Le Pen's ideas. The publication of her memoirs was surprising due to her aggressive, even racist, positions. This is also why she was convicted in 2003, following her statements about the slaughter of sheep during the Muslim festival of Eid al-Adha.\n\n*“Freedom is being yourself, even when it’s unsettling,”* proclaims Brigitte Bardot in the epigraph to her book, \\* *Mon BBcédaire\\* (Fayard Publishers)* , released on  October 1, 2025, in which she shares her views on the world. From the letter A for abandonment to the letter Z for zoo, Bardot writes a few lines on chosen words and the names of places or people she has known. In eroticism, the actress sees *“games of love where everything is permitted with imagination, unsettling perversity, and amorous mischief.”* The animal rights activist believes that France has *“become dull, sad, submissive, sick, damaged, ravaged, ordinary, vulgar…”* The right wing is the “ *only urgent remedy for France’s agony,”* adds the woman who has openly acknowledged her affinity with Marine Le  Pen  (National Rally).\n\nAs an actress, animal rights activist, and citizen, Bardot always spoke with the same freedom, even at the risk of causing a scandal. That's what we'll remember about her life.",
        "upvotes": 4276,
        "comments": 494,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TTAuuplnPGYq8XghDa4jlOcme0UvzI_veKh2wWWEKHc.jpeg?auto=webp&amp;s=dec55033a8c31a0539adade121871789551a26c9"
        },
        "permalink": "/r/movies/comments/1pxnnoq/rip_brigitte_bardot_19342025/"
    },
    {
        "id": "1pxlpmq",
        "author": "WerewolfCurious1412",
        "title": "Why did all the Judd Apatow style films burn out so fast?",
        "content": "Knocked Up, 40 Year Old Virgin and one of my faves This is 40 burned bright, but for a very short amount of time. \n\nI’ve always enjoyed the raunchy comedy that was still filled with a lot of heart and characters you can relate to.\n\nJudd Apatow was the king, now you never hear his name spoken. \n\nAny theories as to why that might be? ",
        "upvotes": 2947,
        "comments": 1031,
        "media": null,
        "permalink": "/r/movies/comments/1pxlpmq/why_did_all_the_judd_apatow_style_films_burn_out/"
    },
    {
        "id": "1pxeh0k",
        "author": "7216345",
        "title": "What’s the worst performance by an actor who’s usually very good?",
        "content": "There are a lot of bad movies where the actors themselves weren't to blame. For example, I think many marvel movies are quite formulaic, but the actors in them still did a great job (such as RDJ and Chris Evans). \n\nBut it must be the case that even good actors sometimes underperform. What are some movies where a usually good actor did a bad job acting?",
        "upvotes": 2182,
        "comments": 2499,
        "media": null,
        "permalink": "/r/movies/comments/1pxeh0k/whats_the_worst_performance_by_an_actor_whos/"
    },
    {
        "id": "1px5x59",
        "author": "NeonMeateOctifish",
        "title": "The Wedding Singer (1998) \"Somebody Kill Me\" - Adam Sandler, Drew Barrymore, Jon Lovitz",
        "content": "",
        "upvotes": 2315,
        "comments": 187,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/khnds3hops9g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1px5x59/the_wedding_singer_1998_somebody_kill_me_adam/"
    },
    {
        "id": "1pwx3x6",
        "author": "BunyipPouch",
        "title": "I saw 290 movies in theaters in 2025. Here is my full ranking.",
        "content": "Every year, I go to the movie theater as much as possible. It's my favorite place in the world. I first started keeping track/scores/reviews/ticket stubs in 2015. Since then, I've seen 1,827 different movies in theaters: 5 in 2015, 9 in 2016, 146 in 2017, 162 in 2018, 192 in 2019, 44 in 2020, 86 in 2021, 270 in 2022, 325 in 2023, 298 in 2024, and 290 this year.\n\nFor this ranking, I'm only counting movies I saw in theaters, nothing that I watched at home. I'm not counting re-watches. I don't have a specific scoring system, it's just a rating I give to the movie right after watching.  I've included a few re-releases, short films, and TV series, as long as they were seen in a theater (and for the first time). This is all just for fun and not meant to be taken super seriously, I'm not a professional movie critic. I just like going to the movies.\n\nI attended 9 film festivals in 2025 for a total of 124 movies. 97 movies had cast and/or crew in attendance for Q&amp;As. There were 26 World Premieres, 11 North American Premieres, 11 Canadian Premieres, 11 East Coast Premieres, 17 Southeast Premieres, 20 Florida/Georgia/Orlando/US/Tampa/South Florida/International Premieres:\n\n* Toronto International Film Festival - 29 Movies in 7 Days\n* SCAD Savannah Film Festival - 29 Movies in 8 Days\n* Fantasia Film Festival - 18 Movies in 6 Days\n* Florida Film Festival - 13 Movies in 5 Days\n* Miami Film Festival - 11 Movies in 5 Days\n* Popcorn Frights Film Festival - 11 Movies in 8 Days\n* Gasparilla International Film Festival - 6 Movies in 3 Days\n* Miami Jewish Film Festival - 5 Movies in 3 Days\n* Rendez-Vous Cinema Quebec - 2 Movies in 2 Days\n\nThere were 11 movies that I re-watched in theaters:\n\n* **One Battle After Another** - x7\n* **Hamnet** - x3\n* **Nouvelle Vague** - x2\n* **Sinners** - x2\n* **If I Had Legs I'd Kick You** - x2\n* **The Testament of Ann Lee** - x2\n* **Highest 2 Lowest** - x2\n* **The Life of Chuck** - x2\n* **Him** - x2\n* **Twinless** - x2\n* **Sentimental Value** - x2\n\nI have AMC's A-List, Regal's Unlimited, Cinemark's MovieClub, as well as memberships to the Fort Lauderdale, Miami, and Toronto film societies.\n\nI saw 290 movies in theaters in 2025. Here is my full ranking:\n\n----------------------------------------\n\n* **The Testament of Ann Lee** - 10/10 - It's a sprawling, intoxicating, and beautiful historical-epic with some of the best dance-sequence choreography I've ever seen on film. All of the performances are perfect, the songs/prayers are all memorable, the narration grabs you from the first second and never lets go, and it's got the most confident directing of the year. I wanted 5 more hours of Mother Ann's story. In a fair world, Amanda Seyfried is the runaway Best Actress Oscar winner. This'll go down as one of the best period-dramas of the 21st century. There's one or two masterpieces per year, *Ann Lee* a no-doubter for one of those spots.\n* **One Battle After Another**\t- 10/10 - Green Acres, Beverly Hillbillies, and Hooterville Junction.\t\n* **Marty Supreme** - 10/10 \t\t\n* **The Perfect Neighbor** - 9/10 - I've not cried in a movie theater this much since *Moonlight*. It's the kind of movie that will make your blood boil and will make you melt to your seat by the end. The bodycam footage where the dad has to tell his two sons that their mother isn't coming home is something that will leave a scar on your heart forever. It's also very impressive on a technical level, the best documentary editing since *Apollo 11* in 2019. I can't imagine all of the work that went into piecing this thing together. \n* **Sinners** - 9/10\t\t\n* **Brokeback Mountain** (Re-Release) - 9/10 - I'm a bit late to the party here, this 20th anniversary theatrical-release was the first time I've seen this movie, and goddamn was it worth the wait. One of the most powerful love stories ever shot. It's the ultimate \"what could've been\" love story. Heath's performance is generational. I'm now a card-carrying member of the *Brokeback Mountain* Was Robbed for Best Picture by *Crash* Society™. \t\n* **Warfare** - 9/10 - You can't talk about *Warfare* without first shouting out the insanely-great sound design. You could watch this movie with your eyes closed and still be impressed. An impossibly-tense war movie that makes 95 minutes feel like 10 minutes. It's really this generation's *Black Hawk Down* (huge compliment). It's a lot more grounded and believable though, with an outstanding ensemble cast. I love that nobody is a supersoldier in this, just guys in a bad spot in a bad point in time. It doesn't glorify but it also doesn't minimize. This movie will stand the test of time as one of the best war films of the decade. This thing was custom-built in a movie-lab just for me.\n* **Sorry, Baby** - 9/10 - Eva Victor is 2025's major revelation. This movie is heartbreaking, hilarious, bittersweet, and soul-warming. It's probably the best Original Screenplay of the year too. This made me realize how much I really missed Lucas Hedges. So cool to see him pop up again. \n* **Bugonia** - 9/10 - Yorgos doesn't miss.\t\t\n* **Hamnet**- 9/10 - An all-time child-actor performance from Jacobi Jupe. This movie is equally soul-crushing and hopeful. Jessie Buckley's close-up when Hamnet &gt;!dies!&lt; is pound-for-pound the best single scene of the year.\t\n* **F1** - 9/10 - As far as fun-summer-blockbuster movies go, *F1* is as good as it gets. It's this year's *Top Gun: Maverick*. Was it cliche? Yes. Was it predictable? Yes. Did I have a fucking blast for 2 hours? Also, yes.\tKeep pumping these out, Apple.\n* **The Phoenician Scheme** - 9/10 - *Asteroid City* &amp; *The French Dispatch* were slight missteps, but Wes Anderson is officially back. This movie overflows with heart &amp; laughs. (with 10/10 production/set design as usual)\t\n* **Sacrifice** - 9/10 - Anya Taylor-Joy was born to play an Icelandic eco-terrorist and Chris Evans was born to play the narcissitic, A-List actor in a rut suddenty thrust back into the limelight. Gorgeously shot, laugh-a-minute first act. I had a really great time with this one, it reminded me a lot of *Don't Look Up*.\tVery surprised everyone hates it.\n* **The Smashing Machine** - 9/10\t\t\n* **Magazine Dreams** - 8/10 - Jonathan Majors comes in with maybe one of the most physically-demanding performances of all time. Without the real-life drama, this might've been an Oscar-winning role for him. Great movie. \t\n* **Highest 2 Lowest** - 8/10 - If it wasn't for an extremely uneven first act and some classic weird Spike quirks in there, like insane transitions and some \"how do you do, fellow kids?\" moments , this would be one of the best movies of the year. It's still really really great, and the insane score kind of grows on you as it goes. Denzel is at the top of his game. My favorite Original Song of the year at the end. \t\n* **Train Dreams** - 8/10 - It takes a while to grow on you. It might take an hour, it might take 5 days, but it'll eventually hit you like a....train (sorry). It's a beautiful slow burn about appreciating life's fleeting and rare moments of joy. The world keeps going on without you, and that's okay. It's extremely reflective and existential. Beautiful stuff. It did what *A Ghost Story* did for me a few years ago. \t\n* **Presence**\t- 8/10 - Lucy Liu. No notes.\t\n* **It Was Just An Accident** - 8/10 - A lot more humor than I expected. The most impressive longshot of the year with that interrogation scene near the end. Mariam Afshari deserves more attention. And holy fuck does that pin-drop ending hit. There's a few ways you can interpret the ending too which is really cool.\t\n* **The Threesome** - 8/10 \n* **Nirvanna the Band the Show the Movie** - 8/10 - If you like satirical comedies (like *Borat*), just do yourself a favor and check it out. You’ll laugh more in the first 30 minutes than in any movie of the past 5 years.\t\n* **I'm Still Here** - 8/10\t\t\n* **Black Bag** - 8/10\t\n* **Nouvelle Vague** - 8/10 - A fun, sweet, breezy, delicate ode to the French New Wave. A movie for movie nerds. Zoey Deutch is a delight and Guillaume Marbeck is one of the year's breakout actors.\t\n* **Left-Handed Girl** - 8/10 - A beautiful slice-of-life family drama that’s right up my alley. Wonderful performances from the 2 young leads (their first major roles) and possibly the catchiest theme track of the year. All fans of Sean Baker should check this one out. Nina Ye killed it at the Q&amp;A. \t\n* **Splitsville** - 8/10 - Hilarious, sharp, sexy. One of the better recent romantic-comedies (big emphasis on comedy). I laughed more during the first fight sequence than probably any other single scene this year. Advice for any shlubby screenwriters out there: co-writing a sharp, funny screenplay where your romantic interestes are 10/10s like Dakota and Adria is a good move.\t\n* **It Ends** - 8/10 - Sometimes you're lucky enough to catch a great movie from a first-time director and you know they'll blow up soon. This is that movie for 2025. \t\t\n* **The Count of Monte Cristo** - 8/10 - You don't get these types of epics much anymore. Really well made and crafted. It's the best Monte Cristo has ever looked on screen.\t\n* **Oh, Hi!** - 8/10 \t\t\n* **Sacramento** - 8/10 - Michael Cera, how I've missed you.\t\t\n* **Mission: Impossible – The Final Reckoning** - 8/10\t\t\n* **Is This Thing On?** - 8/10 - Career-best stuff from Will Arnett. If only Laura Dern's character wasn't so poorly-written and shitty. Great, improv-like scenes in the comedy club.\n* **Wake Up Dead Man: A Knives Out Mystery**\t8/10 - Doesn't quite reach the peak of the first one, but it's a step up from the 2nd. It's a lot more personal and dark than the other 2, which I really liked, and it keeps the (sometimes-outdated) humor.\n* **Fucktoys** - 8/10 - It's *Anora* on mushrooms. It's weird, it's gross, it's got a ton of sex and some violence. It's kind of a modern nasty fairy tale. It's everything you want. Would recommend. Annapurna Sriram is a major talent to watch out for.\t\n* **Urchin** - 8/10 - Part Safdie, part Glazer, part Leigh. A really confident and impressive debut film from Harris Dickinson. Harry Dillane is magnetic.\t\n* **Eternity** - 8/10\n* **Predator: Badlands** - 8/10\t\n* **A Quiet Place** w/ Live Commentary (Re-Release) - 8/10 - This was the first \"live commentary\" screening I've ever attended. It was with co-writers Scott Beck &amp; Bryan Woods (who also co-directed *Heretic*), moderated by Josh Malerman (who wrote *Bird Box*). A very fun screening, very insightful and amusing. Think Mystery Science Theater 3000, but for an actually-good movie.\t\n* **Final Destination: Bloodlines** - 8/10 \t\n* **Companion** - 8/10\t\n* **No Other Land** - 8/10 - Incredible achievement in documentary filmmaking. almost unfurls like a narrative drama. The only documentary other than *20 Days In Mariupol* that's made me want to look away. It's really impressive how angry it makes you but also weaves in beautiful little funny moments of humanity that bring you back down to earth. You would think that \"pouring cement down village water wells\" was a cartoonish movie-villain move that would never actually happen in real life, but nope, it happens.\t\n* **The Girl with the Needle** - 8/10 - Sometimes you just need a Cristian Mungiu-like hit of depression. This filled that hole.\n* **28 Years Later**\t- 8/10 \n* **The Long Walk** - 8/10 - Not shying away from the brutality/violence is this movie's biggest strength. David Jonsson and Cooper Hoffman are perfect together. It's a very unique post-apocalyptic film, a different feel from the usual YA slop. Mark Hamill is very goofy and bad though. Rough casting there.\t\n* **Sentimental Value** - 8/10 - This was a lot better on 2nd watch. In her limited screentime, Inga Ibsdotter Lilleaas puts in the best supporting performance of the year. She is the heart &amp; soul of this movie. Truly heartbreaking stuff when Renate reads her the monologue at the table.\n* **The History of Sound** - 8/10 - Shoutout to this movie for introducing me to Silver Dagger, probably the greatest folk song ever. I've had different covers of it playing on repeat since the minute I left the theater. Paul Mescal was amazing in his rendition. Beautiful, *Brokeback Mountain*-like love story about what could've been and regrets.\t\n* **A House of Dynamite** - 8/10 -  It's only fair to score this by act: First Act: 10/10 - Movie-of-the-year potential. Thrilling and engaging. I wanted to cry everytime Rebecca Ferguson was on screen. Second Act: 8/10: The greatest TV pilot episode you've ever seen. Greta Lee keeps getting done dirty though. Third Act: 3/10 - What a fumble nooooooooo Kathryn noooooooo.\t\n* **My Mom Jayne** - 8/10\t\t\n* **Sirat** - 8/10 - Sound design that will have your clothes shaking during the rave sequences and have you jump during the (extremely) unexpected death scene(s). A great (but extremely bleak) odyssey through the desert set against the backdrop of the world falling apart. Good shit.\t\n* **She Dances** - 8/10 - Whenever Steve and Audrey Zahn are on-screen together, the scenes burst with authenticity and genuineness. The script is sweet, funny when it needs to be, and sometimes brings out a few tears. Really great little family-drama. \t\n* **Hamilton** - 8/10 \t\n* **Bring Her Back** - 8/10 - Danny and Michael Philippou should be thrown in fucking jail for that scene of the kid chewing on the knife. \n* **Sovereign** - 8/10\t\n* **Weapons** - 8/10\t\n* **Kill Bill: The Whole Bloody Affair** - 8/10 - Confession: I had only seen bits and pieces of both *Kill Bill* movies prior to this. I had an abolute blast. The 2nd half doesn't quite live up to the first though. \t\n* **Avatar: Fire and Ash** - 8/10 - Oona Chaplin awoke something in me. i'm now a Varangsexual.\t\t\n* **Mile End Kicks**\t- 8/10 - Chandler Levack is Canada’s brightest up and coming filmmaker since Xavier Dolan. Pls keep her on your radar. Now she needs to make a movie without an annoyingly-unlikeable lead.\t\n* **Nuremberg** - 8/10 - Your dad's pick for Best Picture. I had really low expectations, a 2.5-hour WW2 courtroom drama sounds like Oscar-bait 20 years too late, but a really tight script and perfect pacing kept me thoroughly engaged. It's also the best Russell Crowe performance since...*Gladiator*? Good stuff. I'm back on the WW2 movie train. Leo Woodall knocks it out of the pack with his monologue too. Out of nowhere.\n* **The Naked Gun** - 8/10\t\t\n* **Twinless** - 8/10\t\t\n* **Rebuilding** - 8/10 - Lowkey family-drama set in the aftermath of a fire that destroys a man's family ranch. Josh O'Connor is outstanding as usual.\t\n* **Eric LaRue** - 8/10\t\t\n* **The Life of Chuck** - 8/10\t\t\n* **Frankenstein** - 8/10 - It's undoubtedly technically impressive, probably deserves Oscar nominations in most tech categories. The cast and crew is stacked, and it's solid, but there's a major thing keeping it from being truly great/top 25 of the year: an interesting story. It's really good but classic GDT style-over-substance like *Crimson Peak*.\t\n* **Megadoc** - 8/10 - Almost makes up for the actual movie. Almost. The Francis/Shia and Aubrey/Dustin dynamics were really fascinating to watch. Really great doc about the chaos of filmmaking. It's a shame Adam Driver and Nathalie Emmanuel didn't want to be filmed for it, but I can't say I blame them.\t\n* **Jay Kelly**\t- 8/10\n* **Springsteen: Deliver Me From Nowhere** - 8/10 - Everyone else is wrong, this thing was good. Atlantic City forever.\n* **Rosemary's Baby** (Re-Release) - 8/10\n* **Hurry Up Tomorrow**- 8/10 - Maybe throw me in jail for this but I thought this thing rocked?  Part *Vox Lux*, part *Misery*, part *Good Time*. Jenna Ortega absolutely smashes it (wish the whole movie was from her POV tbh) and Keoghan/Abel are pretty solid as well. If you can look over the self indulgence (which is kinda the point) and a bad 5-minute sequence near the end, this is a banger. The score and camework alone make it watchable. Trey Edward Shults fan until the day I die.\t\n* **Together** - 8/10\t\t\n* **Americana** - 8/10 - It does jump the shark a bit near the end when like 45 people die and it becomes a bit unbelievable, but it's a fun Tarantino-like crime story and Sidney Sweeney/Paul Walter Hauser are great together.\t\n* **It's Never Over, Jeff Buckley** - 8/10\t\t\n* **The Fantastic Four: First Steps** - 7/10\t\t\n* **The Damned** - 7/10 - Claustrophobic period-pieces are my shit. An overlooked January-dump movie that deserves more praise.\t\n* **The Ballad of Wallis Island** - 7/10\t\n* **She Rides Shotgun** - 7/10\n* **Christy** - 7/10 \n* **Roofman** 7/10 - A perfectly-solid action-crime-comedy with a stellar Channing Tatum and Kirsten Dunst. This would've made $200M domestic 20 years ago. It doesn't have the usual emotional devastation that you'd expect from a Derek Cianfrance film, but that's fine. \t\n* **Thunderbolts** - 7/10 - Like most people, I'm kinda \"over\" the Marvel formula, and in general this was a bit more of the same, but Pugh and Harbour commit really hard and keep it very engaging and just-different-enough. It's one of the better recent MCU efforts. I liked Julia Louis-Dreyfus in a Veep-adjacent role.\t\n* **Materialists** - 7/10\t\t\n* **Dead Man's Wire** - 7/10\t\t\n* **Rental Family** - 7/10\t\n* **Sisu: Road to Revenge** - 7/10 - A nice improvement over the first one, rare for a sequel. Some really impressive kills.\n* **Mickey 17** - 7/10\n* **Shin Godzilla** (Re-Release) - 7/10\t\t\n* **The School Duel** - 7/10\n* **Eephus** - 7/10 - A local beer league baseball team plays their final game at the local park. Makes you feel nice and fuzzy and warm. \t\n* **Dangerous Animals** - 7/10 - Some actors are born for a certain role. Jai Courtney is that actor in this movie.\t\t\n* **Ballerina** - 7/10\t\n* **Vermiglio** - 7/10\t\t\n* **Violent Ends** - 7/10\t\t\n* **Good Fortune** - 7/10 - There are some glaring flaws (like Aziz's acting &amp; delivery), but it does a lot of things very well and has a sweet enough ending to keep this pretty good. Keanu's character is a highlight and has a ton of great lines (\"I used to be a celestial being and now I'm a chainsmoker\", etc)\t\n* **Secret Mall Apartment** - 7/10\t\t\n* **Blue Moon** - 7/10 - Ethan Hawke is outstanding and basically shows off and runs circles around everybody for 100 minutes, but chamber pieces just aren’t reaching “great” level for me recently.\t\n* **Wicked: For Good** - 7/10\t\t\n* **The Surfer** - 7/10\t\n* **Eleanor the Great** - 7/10 - Pure boomer catnip. Your grandma's favorite movie of 2025. June Squibb is a national treasure. Protect her at all costs.\t\n* **Blue Heron** - 7/10 - \n* **An Officer and a Spy** - 7/10 - Polanski still has a bit of juice. Nobody is doing courtroom-dramas like the French recently.\t\n* **California Schemin'** - 7/10 - It gets a bit repetitive but it's a solid directorial debut effort from James McAvoy.\t\n* **A Big Bold Beautiful Journey** - 7/10 \n* **Villes Jacques-Carton** - 7/10 - Quebec represent. (weak year for Quebec cinema I'll admit)\t\n* **Normal** - 7/10 - If you like John Wick and John Wick-like clone films, you’ll like this. Lots of fun kills. Lots of blood. Good popcorn flick. Not breaking any new ground though.\t\n* **The Ballad of a Small Player** - 7/10 - Macau is a sick setting for a film, and I really dug the first hour, a degenerate gambler just digging his own grave, and the score from Volker Bertelmann is a standout of the year, but it loses its way a bit when he &gt;!dies!&lt; (or maybe he doesn't? who knows). Also, more Fala Chen please.\t\n* **Jurassic World: Rebirth** - 7/10 \t\n* **Superman** - 7/10 - There's some funny lines, solid needledrops, and Rachel Brosnahan is great as usual, but it's not enough to make it really pop. Solid movie, another decent entry in the comic book movie category, but it doesn't reinvigorate my enthusiasm for the genre as a whole like I'd hoped it would.\t\n* **Tatami** - 7/10 \t\n* **One of Them Days** - 7/10 - Katt Williams being the highlight of a movie in the year of our lord 2025 was not on my bingo card. We need more crowd-pleasing comedies like this in theaters.\t\n* **The Seed of the Sacred Fig** - 7/10\t\n* **Fackham Hall** - 7/10\t- The *Trainspotting* poster bit was so good. Non-stop bits and easter eggs, a fun time. \n* **The Wizard of the Kremlin** - 7/10 \n* **Caught Stealing** - 7/10 - Zoë Kravitz is gone far too soon.\n* **I Love LA** (TV Series) - 7/10\t\t\n* **Fight or Flight** - 7/10 - It sequel-baits a bit too hard and the tech-villains are way too cartoony, but some solid kills, great lines/editing, and Josh Hartnett fully committing to the alcoholic, down-on-his-luck assassin bit really keeps it entertaining enough.\t\n* **Jane Austen Wrecked My Life** - 7/10\t\t\n* **Sisters** - 7/10\n* **Parthenope** - 7/10 - It's a gorgeous-looking movie, I could stare at Celeste Dalla Porta for 10 more hours, and I'm a big Paolo Sorrentino fan but this feels a bit more style-over-substance than his usual output.\n* **The Monkey** - 7/10\n* **The Luckiest Man in America** - 7/10 - When an indie budget is stretched to the limit and puts out a good movie.\t\t\n* **Terrestrial** - 7/10\t\t\n* **Two Women** - 7/10\t\n* **Sharp Corner** - 7/10 - I watched this dubbed in French so the performances definitely took a hit, but it was a pretty biting look at the pressures of the workplace and family leading to a man's downward spiral. Ben Foster is always solid (even when he's dubbed in French-Canadian).\t\n* **Sweetness** - 7/10\t\t\n* **Spinal Tap 2: The End Continues** - 7/10 - I have still not seen the original, but this was good enough as a standalone. The final performance scene leaves a bit to be desired, but there's enough humorous dialogue to keep it chugging along (\"in the daytime, ghosts are just rumors\" is my personal favorite\".\t\n* **Almost Popular** - 7/10\t\n* **My Dead Friend Zoe**\t - 7/10\t\t\n* **I Am Frankelda** - 7/10\t\t\n* **The Amateur** - 7/10 - It's basically Bourne-lite, but they don't make these globe-trotting spy movies enough anymore. I enjoyed it. Torture-by-pollen was a wild move though.\t\n* **On Swift Horses** - 7/10 \n* **Merrily We Roll Along** - 7/10 - As far as theatrical pro-shots go, it's below *Waitress* &amp; *Hamilton*. At first the constant cuts are a bit annoying/nauseating, but it works itself out. Radcliffe has one really amazing/impressive song number (during the TV interview), Groff is outstanding throughout. Was not a fan of Lindsay Mendez at all. I wanted a bit more emotionally from the whole thing. The theme song is amazing.\t\n* **Heart Eyes** - 7/10 \t\t\n* **No Other Choice** - 7/10 - good but kinda very long, innit?\n* **Freaky Tales** - 7/10 \n* **The Wedding Banquet** - 7/10 - Fun little rom-com brought down a bit by rough acting and awkward line/joke delivery from Bowen Yang and the Korean guy. Lily and Kelly carried them big time. Loved the “we have to de-gay the house!!!” bit. Great ending too. (never saw the original)\t\n* **Freakier Friday**\t - 7/10\t\t\n* **Rust** - 7/10 \n* **The Ugly Stepsister** - 7/10\t\t\n* **Come Closer** - 7/10\t\t\n* **La Grazia**\t7/10 - Location scouts for Sorrentino movies need special recognition.\t\n* **The Accountant 2** - 7/10 - The story is a bit overcooked (the X-Men-like school for autistic super-hackers is a crazy turn for this movie to take) and it gets a bit too *Sound of Freedom*-y, but the Affleck/Bernthal scenes together keep it from falling apart completely.\t\n* **Rise** (Short Film) - 7/10\t\n* **Tornado** - 6/10\t\t\n* **Inheritance** - 6/10\t\t\n* **The Housemaid** - 6/10\t\t\n* **Anemone** -  6/10 - [Sean Bean stares in amazement at DDL's performance] x10. There's a few good lines (\"god doesn't need undies, cause he's not full of shit like you are\", \"the explosion was so loud you couldn't hear it\"), two amazing DDL monologues, and it looks amazing, but feels kind of empty as a whole. Definitely something missing. \t\n* **Spider &amp; Jessie** - 6/10\t\t\n* **Orwell: 2+2=5**  - 6/10 - Some sequences are truly must-see pieces of documentary filmmaking (like the grilling of the ghoulish tech billionaire fucks and the January 6th bits) but then others are so truly scattered and shoehorned that it disconnects you from the message of the movie. 9/10 potential here if it could get out of its own way.\t\n* **Don't Let's Go to The Dogs Tonight** - 6/10\t\t\n* **Charlie Harper**\t- 6/10 - A cute story about a highschool sweetheart couple (an aspiring chef and an underachieving alcoholic, classic) that’s shot really great and acted well (othet than the non-existent drunk acting from a supposed alcoholic) but ultimately burdened by a mountain of cliches. \t\n* **Song Sung Blue** - 6/10\t\t\n* **The Toxic Avenger** 6/10 - A Troma film should have more nudity. Let's bring nudity back. Put me down for more nudity.\n* **Tron: Ares** - 6/10\t\n* **If I Had Legs I'd Kick You** - 6/10\n* **Anaconda** - 6/10 - One day soon I'll be tired and over and the ironic, meta, big-studio-movie, but today is not one of those days. I had a decent time with this. A *The Legend of Bagger Vance* reference in 2025 deserves some respect.\n* **Death Does Not Exist** - 6/10\t\n* **40 Acres**\t- 6/10\n* **Locked** - 6/10\t\t\n* **Paddington in Peru** - 6/10\n* **Clown In A Cornfield**\t - 6/10\t\n* **Captain America: Brave New World** - 6/10 - Adding this to the never-ending list of good-but-forgettable comic book movies. The genre is stale as hell.\n* **Wolf Man** - 6/10 - Really liked the POV switches, sound design, and creature design, but the rest is by-the-numbers horror flick.\t\n* **Drop** - 6/10\t\t\n* **Blood for Dracula** (Re-Release) - 6/10\n* **Taylor Swift - The Official Release Party of a Showgirl** - 6/10 - The lyric video stuff was whatever/boring/filler but I really liked the behind-the-scenes look at the making of the Ophelia music video. I could’ve watched an entire doc of Taylor directing that video. Great song too. And the closing song rocked too.\t\n* **Fanny** - 6/10\n* **Find Your Friends** - 6/10 \t\n* **All Her Fault** (TV Series) - 6/10\t\t\n* **Fairyland** - 6/10 \t\t\n* **A Nice Indian Boy** - 6/10\t\n* **Eddington** - 6/10 - There's some interesting stuff in here, but overall kind of a mess. That's been Ari Aster's vibe recently.\n* **A Minecraft Movie** - 6/10\t\t\n* **To Kill A Wolf**\t- 6/10\t\t\n* **Keeper** - 6/10\t\t\n* **Waltzing with Brando** - 6/10 - Billy Zane is super convincing as Marlon Brando. The rest is forgettable.\t\n* **Re-Animator** (Re-Release)\t- 6/10\t\n* **Opus** - 6/10 - John Malkovich could not have been more horribly miscast.  There's a good cult movie hidden in here somewhere, but Ayo by herself couldn't bring it out. Needed some more passes at rewrites.\t\n* **Grand Theft Hamlet** - 6/10\t\t\n* **Den of Thieves 2: Pantera** - 6/10\t\t\n* **Novocaine** - 6/10\n* **Barcelona** (Re-Release) - 6/10\t\n* **The Roses** - 6/10 - This was a Dollar Tree *Marriage Story*. Very tonally-uneven. Kate McKinnon is distractingly-bad. Cumberbatch and Colman work well enough together to keep it watchable but it's kinda messy.\t\n* **IT: Welcome to Derry** (TV Series) - 6/10 \n* **Modern Whore**\t- 6/10\t\n* **100 Nights of Hero** - 6/10\t\t\n* **Ick** - 6/10\t\t\n* **Algiers** - 6/10\t\n* **Everything's Going to Be Great** - 6/10 - I really wish Bryan Cranston didn't &gt;!die!&lt; early on in the movie. His character and charisma really kept this afloat at first. It mostly fall flats after he's gone, except a few sweet moments. Weirdly over-religious vibes to the movie. Angel Studios was probably close to landing this one.\t\n* **Abraham's Boys** - 6/10\n* **I Know What You Did Last Summer** - 6/10 - Worth seeing for the Nicole Kidman AMC intro reference alone. \t\n* **Death of a Unicorn** - 6/10\n* **Clorofilla** - 6/10\t\t\n* **I Don't Understand You** - 6/10\t\n* **On Becoming A Guinea Fowl** - 6/10 - It's hard to think of a more recent ending that's so unsatisfying. It's good until that. Fuck those last 5 minutes.\t\n* **Allen Sunshine**\t- 6/10\t\t\n* **Night of the Demons** (Re-Release) - 6/10\t\n* **La Gloria**\t- 6/10\n* **The Legend of Ochi**\t- 6/10 - It's a gorgeous movie and very Wes Anderson-coded, but too childish to make a real impact. If I'm honest, Helena Zengel should've just spoken German (with subtitles) instead of intelligible English.\t\n* **Cleaner** - 6/10\t\t\n* **Bonjour, Tristesse** - Lily McInerny is outstanding, one of my picks for \"breakout\" performances of the year, and I'm a sucker for a sun-drenched Mediterranean setting, but Chloë Sevigny is just so bad and sinks the rest of the performances. \t\n* **Love Machine** (Short Film) - 6/10\t\n* **The Shrouds** - 6/10\t\t\n* **Mermaid** - 6/10 - With 20-25 minutes shaved off, this could've been great. It captures some of the gross underbelly of Florida that not a lot of movies can (*The Florida Project* being the best example), but it's dragged down by bad performances and a plot that's too dragged out. I wanted it to end at least 5 times.\t\n* **Dog of God** - 6/10\t\t\n* **Trust** - 6/10\t\t\n* **Downton Abbey: The Grand Finale** - 5/10 - It loses a lot of the charm of the first 2 films.\t\n* **Dead of Winter** - 5/10\t\t\n* **The Friend** - 5/10\t\t\n* **Him** - 5/10\t\n* **Somnium** - 5/10\t\t\n* **Hard Truths** - 5/10 \t\n* **Borderline** - 5.7 - Full disclosure: I saw this in a theater but left about halfway because I saw a big ass rat crawling through the aisle (2nd time I've ever seen one in a theater. Other time was in 2019 for *The Best of Enemies*). That's gonna be a no from me, dawg. Finished the rest at home. All that being said, Samara Weaving is good but she can only do so much to carry a weak story.\t\n* **Hunting Daze** - 5/10\t\n* **The Chronology of Water**- 5/10 - A completely incomprehensible first-45-minutes (by design I guess?), but Imogen poots puts in one of the most daring &amp; brave performances in a while. A huge huge swing by Kristen Stewart for a directorial debut. Sometimes it hits, sometimes it misses hard.\t\n* **www.rachelormont.com** - 5/10 - This movie is fucking disgusting. I'm pretty sure real-life misdemeanors/felonies were actually committed during the filming (seriously). But it's just weird and funny enough (especially during the meta, audience-speaking portion) to keep you locked in. A wild ride that I wouldn't take again but that I'm happy to have taken off of the bucket list.\t\n* **Honey, Don't!**\t- 5/10 - \"My left or your left?\", \"We're facing the same way\" is one of the year's best exchanges, and there's a few of those gems, but ultimately this is one of the most disjointed movies involving A-list talent I've ever seen (looking at you, *Amsterdam*). Too much going on, some really awful performances (Charlie Day, Aubrey Plaza, Chris Evans). Only Margaret Qualley showed up. She rocks.\t\n* **Swiped** - 5/10 - We have *The Social Network* at home.\t\n* **Bone Lake** - 5/10\t\n* **Black Phone 2**\t- 5/10 - There should be a law capping Blumhouse horrors at 95 minutes. Big drop-off from the first one. Madelaine McGraw was fantastic though.\t\n* **The Woman in the Yard** - 5/10\t\t\n* **Seven Veils** - 5/10 \n* **M3gan 2.0** - 5/10 - I've gotta admit that there's a lot of really solid &amp; memorable one-liners in here, but this movie really needed an R-rating and 25 minutes less of runtime.\t\n* **Fuze** - 5/10 \t\n* **Now You See Me Now You Don't** - 5/10\t\n* **The Running Man** - 5/10 - Edgar no :(\t\t\n* **Ella McCay** - 5/10 - There's some truly baffling stuff going on in this movie (30-year old Ema MacKey unconvincingly playing a 15-year old for a part of the movie being one of them), but I love James L. Brooks too much to give it a lower score.\t#EllaMcCayChallenge\n* **Sketch** - 5/10\t\t\n* **The Well**\t- 5/10\n* **Queens of the Dead**\t- 5/10\t\t\n* **Unmoored** - 5/10\t\t\n* **Last Breath** - 5/10\t\t\n* **Mr. Blake at Your Service!**\t- 5/10\t\t\n* **Hedda** - 5/10 - Aside from the solid costume and set design (and a few moments when I was reminded of Babylon), this was a pretty nothing-movie with a confusing plot and extremely unlikeable characters.\t\n* **The Virgin of Quarry Lake**\t- 5/10\t- Visually striking but much too slow.\t\n* **Mr. Melvin** - 5/10\n* **Armand** - 5/10\t\t\n* **The Bearded Girl** - 5//10\t\n* **Karate Kid: Legends**\t- 5/10\t\t\n* **Test Screening**\t- 5/10\n* **Sounds of Glass** (Short Film) - 5/10\t\t\n* **Invention** - 5/10\t\t\n* **The Penguin Lessons** - 5/10\t\n* **Another Simple Favor** - 4/10 - This might be the most overcooked script of the year. There's just so much going on, you can't keep track of any character motivations, and it just throws in twists for the sake of twists. The original was fine, this was not good.\t\n* **Good Boy** - 4/10\t\t\n* **Hacked: A Double Entendre of Rage Fueled Karma** - 4/10\t\n* **Hot Milk** - 4/10 - There's something good hidden in here, but it's irritating as hell.\t\n* **The Room Next Door** - 4/10 - All of the bad of Almadovar (clunky dialogue, overly-melodramatic, etc), with none of the good. Boring as well\t\n* **Sister Midnight** - 4/10\t\t\n* **The Devil’s Bride**  - 4/10\t\t\n* **After the Hunt**- 4/10 - ???????????????\t\n* **Snow White** - 4/10 - I think Rachel Zegler is great. Whenever she wasn't on screen, I didn't care. Disney live-action remakes have to start caring a lot more about what they're putting out there. The returns are diminishing big time.\t\n* **Of Dogs and Men** - 4/10\t\t\n* **Shelby Oaks** - 4/10\t\t\n* **Nobody 2** - 4/10 - I never want to see Sharon Stone in anything ever again. Take the Oscar nomination away. \t\n* **Wish You Were Here** - 4//10\t\t\n* **The Baltimorons** - 4/10\t\t\n* **Die My Love** - 4/10\t- Shoutout to John Prine.\t\n* **The Carpenter's Son** - 4/10\t\n* **Dust Bunny** - 4/10\t\t\n* **The Rule of Jenny Penn** - 4/10 - Painfully repetitive. Enough lens-flare-induced-blindness to probably qualify for a class action lawsuit. \t\n* **Flight Risk** - 4/10\t\t\n* **Anniversary** - 4/10 - About as subtle as brick to the temple. Jesus christ.\t\n* **Ash** - 4/10\t\t\n* **Reflection in a Dead Diamond** - 4/10 - Zzz...\t\t\n* **Apostasy Blues** - 4/10\t\n* **The Christophers** - 4/10 - A very rare Soderbergh L. Such a bore. Did not help that I couldn't understand a single word Ian McKellen was saying and that Michaela Coel was horribly miscast.\t\n* **The G** - 4/10\n* **Rosemead** - 4/10 \t\n* **Teacher's Pet** - 4/10\t- Coming to a Tubi near you soon.\n* **Ex-Husbands** - 4/10\t\t\n* **The Unholy Trinity** - 4/10 - Bland RedBox (RIP) fodder. Samuel L. Jackson surprisingly cares so that kept it from a rock-bottom score.\t\n* **Away with the Fairies** (Short Film) - 4/10\t\t\n* **Atom &amp; Void** (Short Film)\t- 4/10\t\t\n* **Eastern Western** - 3/10 \n* **Cujo** (Re-Release) - 3/10 - Had not seen it before, and I can still tell you it hasn't aged well. Awful.\t\n* **High Rollers** - 3/10 \t\n* **Auction** - 3/10 - There aren't many things in life more pretentious than art-related French films.\t\n* **The Thing With Feathers** - 3/10 - Man this was a rough watch.\t\n* **The Home** - 3/10\n* **Thank You, Places!** - 3/10 - A valiant effort by a local theater group to shoot &amp; produce a movie during the height of COVID but I could've seen anything else and been more entertained. \t\n* **One Big Happy Family** - 3/10\t\t\n* **Homebound** - 3/10\t\t\n* **Good American Family** (TV Series) - 3/10\n* **The Story of Three Sisters** (Short Film) - 3/10\t\t\n* **First Rites** (Short Film) - 3/10\n* **Love Hurts** - 2/10 - If I had a gun with two bullets and I was in a room with Hitler, Bin Laden, and *Love Hurts*, I would shoot *Love Hurts* twice.\t\n* **Kiss of the Spider Woman** - 2/10 - I really enjoyed the 12-minute sequence of Diego Luna graphically and aggressively shitting himself (3 feet away from a toilet for some reason by the way?) while the lead character wipes it all up, that was super cool and cinematic and necessary. This movie was hot ass, in more ways than one. Extremely overhyped out of Sundance, there's one every year. Deserved flop. One of the few times a year I walk out of a movie theater angry.\n* **Nobody Wants to Shoot a Woman** - 2/10 - Amateur hour. The worst *Goodfellas* rip-off you've ever seen. If you told me this was originally a Youtube short from 2008, I would believe you.\t\n* **The Verdict** - 1/10 - The filmmakers should honestly be ashamed for submitting and screening this unfinished soap-opera-masquerading-as-a-film. The festival progammers should be ashamed for programming it and charging people for it. I should be ashamed for staying the entire 100 minutes. Shame all around, really. Nobody wins here. It’s like if a group of blind preschoolers decided to remake *Anatomy of a Fall*.\t\n* **Five Nights at Freddy's 2** - 0/10 - I thought Netflix’s truly-apocalyptical purchase of Warner Bros was the worst thing to happen to theatrical moviegoing in a hundred years, but then I saw *Five Nights at Freddy’s 2*. \t\t\n\n----------------------------------------\n\n**Theater Distribution by Venue/Chain:**\n\n* AMC - 103\n* Regal - 58 \n* Cinemark - 7 \n* Cineplex - 3 \n* VIP - 3\n* Landmark - 2 \n* Silverspot - 2\n* Independent/Festival/Other - 112 (Bill Cosford Cinema, Cinema Centre-Ville, Cinema du Musee, Cinema Paradiso, Classic Gateway, Coral Gables Art Cinema, Enzian Theater, Hall Theater, IFC Center, Lightbox Theater, Lucas Theater, Miami Theater Center, Movies of Delray, Olympia Theater, Princess of Wales, Roy Thomson Hall, Royal Alexandra, Salle J.A. DeSeve, Savor Cinema, SCAD Museum of Art, Scotiabank Theater, Tampa Theater, Trustees Theater)\n\n\n**Theater Visits by Month:**\n\nhttps://i.imgur.com/JxMd5Qt.jpeg\n\n* January: 19\n* February: 11\n* March: 27 + 1 Re-Release (**Barcelona**)\n* April: 37 + 1 TV Series (**Good American Family**) + 1 Re-Release (**Rosemary's Baby**)\n* May: 17\n* June: 15 + 1 Re-Release (**Brokeback Mountain**)\n* July: 24 + 6 Short Films (**Atom &amp; Void**, **Sounds of Glass**, **First Rites**, **The Story of Three Sisters**, **Love Machine**, **Away with the Fairies**)\n* August: 23 + 5 Re-Releases (**Re-Animator**, **A Quiet Place**, **Cujo**, **Night of the Demons**, **Shin Godzilla**) \n* September: 43 + 2 Rewatches (**One Battle After Another** x2)\n* October:  24 + 2 TV Series (**IT: Welcome to Derry, I Love LA**) + 1 Short (**Rise**) + 1 Release (**Blood for Dracula**) + 12 Re-Watches (**One Battle After Another** x3, **Nouvelle Vague**, **Sinners**, **If I Had Legs I'd Kick You**, **The Testament of Ann Lee**, **Highest 2 Lowest**, **Hamnet**, **The Life of Chuck**, **Him**, **Twinless**)\n* November: 16 + 1 TV Series (**All Her Fault**) + 1 Re-Watch (**Sentimental Value**)\n* December: 15 + 2 Re-Watches (**Hamnet**, **One Battle After Another**)\n\n**Theater Visits by Day of the Week:**\n\nhttps://i.imgur.com/wD0Tsx6.jpeg\n\n* Monday - 16\n* Tuesday - 28\n* Wednesday - 32\n* Thursday - 53\n* Friday - 57\n* Saturday - 65\n* Sunday - 39 \n\n**Notable Missed Movies:**\n\nhttps://i.imgur.com/42reKIv.jpeg\n\n**Cast/Crew/Filmmaker Q&amp;As/Appearances:**\n\nhttps://i.imgur.com/5kl6qWn.jpeg\n\n**Favorite Performances:** \n\nhttps://i.imgur.com/mf6Bren.jpeg\n\n----------------------------------------\n\n**Past Rankings:**\n \n* [2018 \\(162 Movies\\)](https://www.reddit.com/r/movies/comments/aavyrr/i_saw_162_movies_in_theaters_in_2018_here_is_my/)\n* [2019 \\(192 Movies\\)](https://www.reddit.com/r/movies/comments/eh71gy/i_saw_192_movies_in_theaters_in_2019_here_is_my/)\n* [2020 \\(44 Movies\\)](https://www.reddit.com/r/movies/comments/kp39ku/i_saw_44_movies_in_theaters_in_2020_here_is_my/)\n* [2021 \\(86 Movies\\)](https://www.reddit.com/r/movies/comments/ruaxif/i_saw_86_movies_in_theaters_in_2021_here_is_my/)\n* [2022 \\(270 Movies\\)](https://www.reddit.com/r/movies/comments/zzvg5y/i_saw_270_movies_in_theaters_in_2022_here_is_my/)\n* [2023 \\(325 Movies\\)](https://www.reddit.com/r/movies/comments/18v7k6g/i_saw_325_movies_in_theaters_in_2023_here_is_my/)\n* [2024 \\(298 movies\\)](https://www.reddit.com/r/movies/comments/1ho6mzf/i_saw_298_movies_in_theaters_in_2024_here_is_my/)\n\n----------------------------------------\n\nPlease support your local movie theater. Go alone. Go with others. Buy popcorn. Sneak in snacks. Go on a Discount Tuesday. Disconnect for 2 hours and watch a movie on the biggest screen possible. Don't let corporate greed and stockholder profits destroy a hundred years of laughs, tears, and communal joy. See you at the movies in 2026 :)",
        "upvotes": 8750,
        "comments": 1308,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PuMD246_ay-LwgJFNyShElsJT0_R0FKL6n0G6M-hU8s.jpeg?auto=webp&amp;s=f51f264720c4e27f34e948e6298256eadef1fd4f"
        },
        "permalink": "/r/movies/comments/1pwx3x6/i_saw_290_movies_in_theaters_in_2025_here_is_my/"
    },
    {
        "id": "1px9gw7",
        "author": "Playful-Statement-34",
        "title": "This is the real training behind Collateral. Tom Cruise trained extensively with tactical firearms instructors and thats exactly why, when you watch him on screen it feels real, not performed but earned through preparation",
        "content": "",
        "upvotes": 1352,
        "comments": 174,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/gjc8a8l0ht9g1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1px9gw7/this_is_the_real_training_behind_collateral_tom/"
    },
    {
        "id": "1pxuzaj",
        "author": "MarvelsGrantMan136",
        "title": "Simu Liu’s ‘Sleeping Dogs’ Movie Lands Director Timo Tjahjanto (‘The Night Comes for Us’, ‘Nobody 2’)",
        "content": "",
        "upvotes": 51,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1pxuzaj/simu_lius_sleeping_dogs_movie_lands_director_timo/"
    },
    {
        "id": "1px8myt",
        "author": "browniebiscuitchildr",
        "title": "What’s one of the best f bomb drops you heard delivered in a film?",
        "content": "We all know the classics. The infamous “I have *had it* with these motherfucking snakes on this motherfucking plane!”\n\nBut if I’m going by what’s most recent?\n\nFor me, that’s gotta be the Major’s “Who’s ready to fucking win?!” in The Long Walk just before he pulled the trigger to start the madness. \n\nThat shit had *me* amp and I know damn well I would be the first to get my ticket 😂.\n\nMark Hamil ate with that one.",
        "upvotes": 1146,
        "comments": 2000,
        "media": null,
        "permalink": "/r/movies/comments/1px8myt/whats_one_of_the_best_f_bomb_drops_you_heard/"
    },
    {
        "id": "1pxbbbx",
        "author": "MarvelsGrantMan136",
        "title": "‘The Long Walk’ to Stream Exclusively on Starz (January 10)",
        "content": "",
        "upvotes": 778,
        "comments": 145,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Bn6EJhh6JBUOPGD67qzkmKltgVeAnRSIM6Fi0JQue2E.jpeg?auto=webp&amp;s=511c444a754fbf1d3537f124daad301940ab4a34"
        },
        "permalink": "/r/movies/comments/1pxbbbx/the_long_walk_to_stream_exclusively_on_starz/"
    },
    {
        "id": "1pxm2g7",
        "author": "davideownzall",
        "title": "Eighties Film WarGames (1983) Still Matters and Its Message Is Louder Than Ever",
        "content": "",
        "upvotes": 144,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Bk3nrw7hoOGOaEsedNzs2P3uMRFqwv8Lju4FfNdhf3w.png?auto=webp&amp;s=a61e222d76628d6994ac758059e5be5b0146f3ed"
        },
        "permalink": "/r/movies/comments/1pxm2g7/eighties_film_wargames_1983_still_matters_and_its/"
    },
    {
        "id": "1pxss6c",
        "author": "akshatjiwansharma",
        "title": "Did you like Birdman (2014)?",
        "content": "Its a star studded film and each artist gave an incredible performance. Even minor characters like that of Amy Ryan (I loved her in the wire!) are so well done. \n\nSo what did you think about the movie? Did you find it funny at times? \n\n  \nOne question I have though is it in anyway related to Harvey Birdman,The superhero character? ",
        "upvotes": 36,
        "comments": 85,
        "media": null,
        "permalink": "/r/movies/comments/1pxss6c/did_you_like_birdman_2014/"
    },
    {
        "id": "1pxdzc5",
        "author": "hersugarplumfairy",
        "title": "When Harry Met Sally",
        "content": "Alamo had a showing across the street this morning and because this classic film has so much recent buzz due to the untimely passing of Rob Reiners work, and the fact that it’s one of my partners favorite movies, I figured the big screen would be the perfect place to watch it for the first time. \n\nOMG, how have I never seen this gem? I mean, not that I just watch movies all the time, but this was such a good movie. No fluff, no cgi, just a really good movie, with great performances, great storyline and direction. \n\nAnd the whole time I could have sworn I was watching Alicia Silverstone - I never realized her and Meg Ryan looked so much alike. \n\nAnd Billy Crystals jogging outfit was everything, lol.  Anywho, if you haven’t seen it, I would recommend that you do. \n\nSigned, \nBetter Late Than Never",
        "upvotes": 410,
        "comments": 149,
        "media": null,
        "permalink": "/r/movies/comments/1pxdzc5/when_harry_met_sally/"
    },
    {
        "id": "1px2wg9",
        "author": "BunyipPouch",
        "title": "Mary Steenburgen ('Stepbrothers') and Ted Danson ('Cheers') Visit the Criterion Closet",
        "content": "",
        "upvotes": 1233,
        "comments": 175,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qlB23dzoW7ixc1OxPN_9lVgGxHvOG6kEyACk2DDQIV4.jpeg?auto=webp&amp;s=2b3c6399e8afce7c35af8a523c6fc46765e7447d"
        },
        "permalink": "/r/movies/comments/1px2wg9/mary_steenburgen_stepbrothers_and_ted_danson/"
    },
    {
        "id": "1pxqg3y",
        "author": "carlskennedy1998",
        "title": "Hard Eight (1996) Starring Philip Baker Hall, John C. Reilly, Samuel L. Jackson and Gwyneth Paltrow",
        "content": "",
        "upvotes": 29,
        "comments": 9,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0979idwzwx9g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1pxqg3y/hard_eight_1996_starring_philip_baker_hall_john_c/"
    },
    {
        "id": "1pxj92i",
        "author": "BitEnvironmental283",
        "title": "Hercule Poirot movies",
        "content": "Just got to watch murder on the orient express, death on the Nile, and curse in Venice back to back….and broooooo. They were so good! I loved the colors, the scenes, the writing. It all just had me locked in. It’s been so long since I had a movie keep me interested.\n\nThere were also like settings or idk how you call it but like characters would be talking and the camera would adjust and you would see the whole Sven and background and it’s like it caused the scene to mean something else. For example on the Nile movie, Hercule and Bouc were talking in some wicker chairs. The camera lowered and it was like they were in cages or a confessional. \n\nOverall highly recommend. Only downside was Gal Gadot in the Nile one. Her scenes just kinda fell short for me. Other than that, you should definitely watch them!",
        "upvotes": 79,
        "comments": 54,
        "media": null,
        "permalink": "/r/movies/comments/1pxj92i/hercule_poirot_movies/"
    },
    {
        "id": "1pxivki",
        "author": "Catsocks33",
        "title": "I've just rewatched Zodiac (2007), why does Graysmith not suspect Vaughn?",
        "content": "The first time I watched Zodiac I was confused as to why the Bob Vaughn thing (basement scene) existed in the first place. It seemed like an unnecessary red herring that led to nowhere. Upon rewatching, I thought it was actually pretty cool, because it shows how Allen wasn't the definite killer, just the primary suspect. Also shows that Graysmith was going fucking crazy.\n\nBut what still confuses me is the scene right afterwards when Graysmith tries to steer Linda to tell him that the killer was Rick Marshall. She tells him it was \"someone with a common, shortened nickname\" and he keeps insisting it was Rick Marshall. This was right after (scene-wise) he'd run out of Vaughn's house. Vaughn, who'd just made himself a very possible suspect through handwriting. Vaughn, who had a creepy weird basement in his house, who (presumably) had ties to the killer, who had the door locked when Robert was trying to leave, and who just so happened to go by Bob. If Bob isn't the most common shortened nickname in America then I don't know what is.\n\nMy question is, why did Graysmith not at all suspect that it was Bob? I initially thought that maybe he'd just been obsessing on the idea that it was Rick Marshall, so much so that he'd just overlooked the incriminating evidence against Vaughn, but that doesn't line up with the fact that he was obviously terrified when he ran out of Bob's house. He clearly thought Bob might kill him at that moment, so why does he just completely forget about that when talking to Linda?\n\nI know this doesn't really matter since it wasn't Vaughn after all, but I do want to know if there's something I'm not seeing.",
        "upvotes": 66,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1pxivki/ive_just_rewatched_zodiac_2007_why_does_graysmith/"
    },
    {
        "id": "1pxib4o",
        "author": "akasauva",
        "title": "Am I crazy to think the Bourne series end in The Ultimatum or is this commonly what every one else thinks?",
        "content": "Just rewatched all three and they’re so good. Liked The Ultimatum even more than I remember. Feels like a good conclusion to the series and is arguably the best of all 3? Some prefere Identity but it’s a good debate.\n\nImo, Identity is awesome because it introduces you to that whole world (like many other firsts in trilogies do) and it felt so good watching this guy do what he does. And the romance with Marie was cool too. Started crazy chaotic and they ended up chilling and really understanding of each other.\n\nThen Ultimatum ties a few loose ends like Pam Landy and Nicky Parson, Noah Vohen and the doctor that coordinated the whole thing. Bourne makes another black ops asset question himself and maybe that guy questions the next and so on and so forth.\n\n",
        "upvotes": 70,
        "comments": 65,
        "media": null,
        "permalink": "/r/movies/comments/1pxib4o/am_i_crazy_to_think_the_bourne_series_end_in_the/"
    },
    {
        "id": "1pxfuk2",
        "author": "Fresh_Mobile",
        "title": "Before Sunset (2004) Appreciation",
        "content": "It‘s been a LONG TIME since I’ve seen the Before trilogy and, damn, Before Sunset did a number on my heart and soul tonight. I remember seeing this right around when it came out and thinking it was good…but my teenage self couldn’t relate. But today I started sobbing during the car scene when they talked about how loving others since Before Sunrise has never quite touched that ache. Sigh.\n\nJust wanted to make an appreciation post for this movie (and trilogy) and to connect to other fans! 🫶🏽",
        "upvotes": 96,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1pxfuk2/before_sunset_2004_appreciation/"
    },
    {
        "id": "1pxgy64",
        "author": "LilNello1",
        "title": "The Life of Chuck",
        "content": "So I just finished watching, The Life of Chuck and really enjoyed it a lot.  Just moved into my top 3 movies of the year and I thought Tom Hiddleston, Chiwetel Ejofor, Jacob Tremblay, Mark Hamill and Karen Gillian, as well as Trinity Bliss were pretty brilliant in it.  Some exceptional work by Nick Offerman as the narrator and was quite perfect for that role.  I was surprised at how the story broke down in the beginning that made it somewhat confusing, but after watching it all the way through.  I thought it was actually quite brilliant and somewhat cool how everything was broken down how it was.  So without giving too many spoilers away for those who did watch it already.  What are your thoughts and did you like or not like it?",
        "upvotes": 82,
        "comments": 32,
        "media": null,
        "permalink": "/r/movies/comments/1pxgy64/the_life_of_chuck/"
    },
    {
        "id": "1pxpcll",
        "author": "Loud-Inevitable-6536",
        "title": "I feel sad and unmotivated can someone recommend me a good movie ?",
        "content": "I am not a movie guy but I want something that make me happy or motivated \nI would like to watch any movie classic or new or what ever even and also if there are some best documentaries if someone know so I can watch and make my mind busy and enjoy it happy xmas happy xmas happy xmas happy xmas happy xmas ",
        "upvotes": 13,
        "comments": 102,
        "media": null,
        "permalink": "/r/movies/comments/1pxpcll/i_feel_sad_and_unmotivated_can_someone_recommend/"
    },
    {
        "id": "1px694c",
        "author": "Top_Report_4895",
        "title": "How do you think an hypothetical Austin Powers 4 could satirize the Daniel Craig Bond era?",
        "content": "As well as The Bourne Franchise, the Cruise Mission: Impossible film series, the Fast and furious movies. Given they are parodying the 60's Bond movies and Flint spy series. How would they parody the recent crop of spy movies, with their darker, grittier and realistic tone.\n\nThis is just a though exercise.",
        "upvotes": 241,
        "comments": 157,
        "media": null,
        "permalink": "/r/movies/comments/1px694c/how_do_you_think_an_hypothetical_austin_powers_4/"
    },
    {
        "id": "1pxufwg",
        "author": "portezbie",
        "title": "The Sure Thing - Question about a line",
        "content": "So we've been watching all of Rob Reiner's movies, and we just watched The Sure Thing. \n\nDuring a party scene, Cusack's best friend Lance says, \"have you ever made it with an avocado? PARTAYYTY!\" \n\nWTF? Does this mean something? Or is it just funny for being random? \n\nGreat movie, incidentally. Almost like a rough draft of when Harry Met Sally, in a good way.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1pxufwg/the_sure_thing_question_about_a_line/"
    },
    {
        "id": "1pwkleu",
        "author": "gamersecret2",
        "title": "What is something older movies cared about that feels mostly lost now?",
        "content": "Lately I have been rewatching older movies and realizing how much they cared about things that feel rare now. Not just story, but patience, atmosphere, and effort in the small details. Real locations. Practical sets. Letting scenes breathe. Silence that actually means something.\n\nFor me, a perfect example is Alien. \n\nThe movie takes its time. The ship feels real and lived in. The darkness hides things instead of showing everything. The tension comes from waiting, not from constant noise or fast cuts. It feels like the filmmakers trusted the audience to be uncomfortable and pay attention.\n\nI am not saying modern movies are bad, but it feels like something shifted. Faster pacing, cleaner visuals, and less willingness to sit in a moment. \n\nWhat is something older movies did really well that you feel is mostly lost now?",
        "upvotes": 5029,
        "comments": 1713,
        "media": null,
        "permalink": "/r/movies/comments/1pwkleu/what_is_something_older_movies_cared_about_that/"
    },
    {
        "id": "1px87xy",
        "author": "sonic13066",
        "title": "Arrow Video deserves a ton of praise for their commitment to physical media of movies.",
        "content": "I recently got into buying physical media again after my friend gave me a 4K blu-Ray player and noticed that a lot of great classics are coming out through Arrow Video and wow, they do an amazing job on these titles. Their commitment to including both theatrical copies of the movies but also including unrated/directors cut versions of the same movie both converted to 4K UHD. \n\nThese days in the streaming world or on iTunes/Prime where you “buy” the movie, they tend to only release the theatrical version of the movie in 4K/Atmos and the other cuts as regular HD. But Arrow Video goes out to make sure every cut of a movie is included in their sets of the movies. For example: Robin Hood Prince of Thieves had both cuts in 4K whereas iTunes only has the theatrical cut in 4K. \n\nThey also include amazing special features that are brand new for these older movies. The audio options of movies are amazing as well. \n\nNote: I’m not paid by Arrow for this, just wanted to share my thoughts of their releases, the work they’ve done and hope to buy move from them in the future  ",
        "upvotes": 117,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1px87xy/arrow_video_deserves_a_ton_of_praise_for_their/"
    },
    {
        "id": "1pxo6l5",
        "author": "ExplorationGeo",
        "title": "NOT ONLY FRED DAGG | Official Trailer | The life of satirist John Clarke, as told by his daughter Lorin Clarke. You know him from \"the front fell off\".",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6-BS8B8syG_BzVjSazcLhdcDm6rCYHgUv7JZ7W3Ew6Y.jpeg?auto=webp&amp;s=b746f15b8eb4b26ddfa9ae4700c21d3cd3fce344"
        },
        "permalink": "/r/movies/comments/1pxo6l5/not_only_fred_dagg_official_trailer_the_life_of/"
    },
    {
        "id": "1pxs34t",
        "author": "Apprehensive-Fun7474",
        "title": "Can anyone identify the art piece on the boat in the new anaconda movie?",
        "content": "Hello Reddit movie friends, \n\nSaw the movie last and wanted to find the art piece shown on the boat. The was a very cute river boat and nicely designed. \n\nThe art piece was mounted on the wall off the interior of the boat and looked kind of like a Kandinsky. Would love if anyone was able to identify it. \n\nTIA",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1pxs34t/can_anyone_identify_the_art_piece_on_the_boat_in/"
    },
    {
        "id": "1pxv2f6",
        "author": "Gamerguy230",
        "title": "Film Cells",
        "content": "Was gifted some film cells. I am trying to display them and I need help with lighting source. Seen some posts use different types of lighting, but comments always differ on types of lights to use without damaging the cells. What type of lighting (most likely using a strip or small single light source) would work best to illuminate the cells to see the pictures on them?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1pxv2f6/film_cells/"
    },
    {
        "id": "1pwx6i1",
        "author": "meltymcface",
        "title": "Noticed something fun in The World’s End (2013) [maybe spoilers?]",
        "content": "It’s something I’d clocked before but had forgotten about until I watched it again the other day. \n\nOnce Simon Pegg &amp; co reach their old hometown of Newton Haven, all the cars there are the same make and model - Vauxhall Ampera (Opel Ampera for the rest of the world). The car parks and streets, everywhere, dozens of these electric cars. \n\nAt first I thought it really random they chose this one particular(edit: and very rare) EV to populate the town with, but when you consider the main antagonists of the story have improved technology and just made everything “better”, it’s pretty funny that they’ve homogenised even the cars. It can’t have been a small effort to do something that not many people would notice. \nNothing revolutionary, just a fun detail I thought you’d all appreciate.",
        "upvotes": 298,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1pwx6i1/noticed_something_fun_in_the_worlds_end_2013/"
    }
]