[
    {
        "id": "1jfncab",
        "author": "OdessaAMA",
        "title": "Hi /r/movies, I am Geremy Jasper, the Director &amp; Writer of Searchlight Pictures' O'DESSA (starring Sadie Sink, Kelvin Harrison Jr, and Regina Hall) which just premiered at SXSW this year and is out on Hulu today. You may know me from my previous film PATTI CAKE$. Here to answer your questions. AMA!",
        "content": "",
        "upvotes": 6,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1texitsv4upe1.png?auto=webp&amp;s=6f87a5cb8e2b69216287953bd2af3574b53e0a8b"
        },
        "permalink": "/r/movies/comments/1jfncab/hi_rmovies_i_am_geremy_jasper_the_director_writer/"
    },
    {
        "id": "1jfr418",
        "author": "Rats-AMA",
        "title": "Hi reddit! We are Maxwell Nalevansky and Carl Fry, co-writers/co-directors of the independent stoner comedy RATS!. It's out now. Ask us anything!",
        "content": "",
        "upvotes": 6,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wf14wbxv0vpe1.png?auto=webp&amp;s=7c546b239ff2fefca0601d4d91deed79f78e6e28"
        },
        "permalink": "/r/movies/comments/1jfr418/hi_reddit_we_are_maxwell_nalevansky_and_carl_fry/"
    },
    {
        "id": "1jfr7ib",
        "author": "MarvelsGrantMan136",
        "title": "Apple Losing Over $1 Billion a Year on Streaming Service",
        "content": "",
        "upvotes": 1135,
        "comments": 350,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3vpuEAwytVn36HByAFeg6UnXp7RDVLeLTxu2UU7ROrU.jpg?auto=webp&amp;s=cca2316827519d6852131dd04b6792f7fe3af580"
        },
        "permalink": "/r/movies/comments/1jfr7ib/apple_losing_over_1_billion_a_year_on_streaming/"
    },
    {
        "id": "1jfokgp",
        "author": "MarvelsGrantMan136",
        "title": "First Teaser for Paul Thomas Anderson's 'One Battle After Another' Starring Leonardo DiCaprio",
        "content": "",
        "upvotes": 1623,
        "comments": 462,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tL4aC5uog_bGXeDMaip4xGwOC9EvyCC-4g2vxlHskqI.jpg?auto=webp&amp;s=b96df624da57487fa56f9ad826adbd3edf478d1a"
        },
        "permalink": "/r/movies/comments/1jfokgp/first_teaser_for_paul_thomas_andersons_one_battle/"
    },
    {
        "id": "1jfplj2",
        "author": "ChiefLeef22",
        "title": "Tom Cruise set to receive the British Film Institute‘s highest honor, the BFI Fellowship.",
        "content": "",
        "upvotes": 342,
        "comments": 103,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fN2Kn-s5ASMh8dfc5S2Nn8iSSPCfjPIc2CgeoSTIMfI.jpg?auto=webp&amp;s=89d47e6c1a50d4cdb28ba7ba5b4944cb3cc28d0b"
        },
        "permalink": "/r/movies/comments/1jfplj2/tom_cruise_set_to_receive_the_british_film/"
    },
    {
        "id": "1jfnlok",
        "author": "ladycourt_knee",
        "title": "What movie hit differently when you re-watched it as an adult?",
        "content": "As a kid, \"Big\" (starred by Tom Hanks) was just a fun fantasy about getting to be an adult overnight. But rewatching it now, it’s a bittersweet story about lost childhood, the pressures of adulthood, and how we often take youth for granted. It’s charming but also kind of heartbreaking when you realize how much Josh had to give up.",
        "upvotes": 382,
        "comments": 533,
        "media": null,
        "permalink": "/r/movies/comments/1jfnlok/what_movie_hit_differently_when_you_rewatched_it/"
    },
    {
        "id": "1jflqku",
        "author": "Superb_Boss289",
        "title": "Original body model of ET expected to fetch up to $1m at Sotheby’s",
        "content": "",
        "upvotes": 289,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/46wEQY8mQCnlGY0SlUnFHfsvBuJ7CmkF6BuyiSh5B2U.jpg?auto=webp&amp;s=69638d3c34a9692f7f243683d5d37703e7ec9759"
        },
        "permalink": "/r/movies/comments/1jflqku/original_body_model_of_et_expected_to_fetch_up_to/"
    },
    {
        "id": "1jf1k45",
        "author": "MarvelsGrantMan136",
        "title": "Warner Bros Negotiating Big Sale Of Shelved ‘Coyote vs. Acme’ Movie",
        "content": "",
        "upvotes": 7162,
        "comments": 454,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WV4uPyflTu5hceaiBkfJd0YfhWoFIMQNO4zhEiUQNWc.jpg?auto=webp&amp;s=900da3ca2cb74d262075bf8f7f00004b13eeb870"
        },
        "permalink": "/r/movies/comments/1jf1k45/warner_bros_negotiating_big_sale_of_shelved/"
    },
    {
        "id": "1jfbswu",
        "author": "Pooseygeuse",
        "title": "Johnny Dangerously (1984) - Forgotten parody of gangster movies",
        "content": "",
        "upvotes": 1013,
        "comments": 198,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mcQory5raNbUekbS8E1vHoPaE-e79JXFT0mdSDmTIoQ.jpg?auto=webp&amp;s=94bead1f28f144337ae0ebb97af9d8d15b1e50e7"
        },
        "permalink": "/r/movies/comments/1jfbswu/johnny_dangerously_1984_forgotten_parody_of/"
    },
    {
        "id": "1jfr2pm",
        "author": "RShneider",
        "title": "Movies with a lot of propaganda?",
        "content": "For me it’s American Sniper because it portrays a war criminal as a hero. It leaves out Chris Kyle sucker-punching Jesse Ventura and him writing in his book that he shot at Hurricane Katrina victims from on top of the Superdome. The story about hunting an Iraqi sniper has also been proven false. In the end, it feels like just another war movie meant to make Americans feel better about what their soldiers are actually doing overseas.\n\nWhat are yours?",
        "upvotes": 54,
        "comments": 139,
        "media": null,
        "permalink": "/r/movies/comments/1jfr2pm/movies_with_a_lot_of_propaganda/"
    },
    {
        "id": "1jf2iuq",
        "author": "OKMagHag",
        "title": "BREAKING: 'West Side Story' Actress Carole D’Andrea dead at 87 — As Star's Daughters Cry They Were 'By Her Side As She Passed' in Heartbreaking Statement",
        "content": "",
        "upvotes": 2884,
        "comments": 137,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x4LmfZzz7E8ruqMlTlClpm2a3ZJyJndPARaO3qP6dl8.jpg?auto=webp&amp;s=2d95be6cd61d0aae98bc4ee84374fcdbdf31fe36"
        },
        "permalink": "/r/movies/comments/1jf2iuq/breaking_west_side_story_actress_carole_dandrea/"
    },
    {
        "id": "1jfc0w6",
        "author": "Physical_Soil746",
        "title": "The last two Jurassic World movies feel so outlandish and strayed from the original source material that it doesn't even feel like a Jurassic Park movie.",
        "content": "Jurassic World at least tried to recapture the spirit of the first movie. Although it wasn't as good it did fall back on the same message of commercialism ruining the natural order of things.\n\nFallen Kingdom's plot is so baffling. The dinosaurs went from being completely terrifying killing machines to now just cartoon characters like when Blue winks at the audience and pretends to be dead. Also Hammond's former business partner uses the exact same DNA cloning techniques that were used on the dinosaurs to clone his deceased daughter into another person who becomes a main character. \n\nDominion goes even further to the point where the dinosaurs are just a background noise for the movie. The plot centers around some billionaire who wants to engineer a bunch of locusts to destroy the world's crop supplies so people will buy his food instead, oh and there's some scenes with dinosaurs here and there. Also the original cast came back to remind you you're watching a Jurassic Park sequel.\n\nAt this point JP3 seems like the last faithful sequel which is not really a good thing",
        "upvotes": 737,
        "comments": 176,
        "media": null,
        "permalink": "/r/movies/comments/1jfc0w6/the_last_two_jurassic_world_movies_feel_so/"
    },
    {
        "id": "1jfaloi",
        "author": "Lucky_Chaarmss",
        "title": "Toxic Avenger | Official Teaser #1 | Miss Meat",
        "content": "",
        "upvotes": 658,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lNl0VKaYoihZE1_v55wMcsAWvLPrn-wuArUzUOQJLzM.jpg?auto=webp&amp;s=0fbe3d50a4385d8cbd34fd3d0c70f320b2e623f1"
        },
        "permalink": "/r/movies/comments/1jfaloi/toxic_avenger_official_teaser_1_miss_meat/"
    },
    {
        "id": "1jfffou",
        "author": "once_upon_a_bear",
        "title": "Paddington 2 had me sobbing",
        "content": "It's such a beautiful and sweet movie. It's just so innocent. Literally I cried at the first scene where aunt Lucy and uncle Pastuzo decided to give up visiting London so they could raise the cub. Another tearjerker is at the end when Mary was trying to break Paddington out of the train underwater, and Paddington gave up and gave the smallest head shake. Not to sound ridiculous but I have a dog that looks very much like a small bear, and I think I'm projecting hard onto my precious baby pup lol\n\nThe movie even gave Buchanan a cute ending, where we see that what he really wanted was to perform again and be appreciated. So sweet. \n\nI can't believe I only heard about how good this movie is recently and decided to watch it. It is now a favorite movie of mine!",
        "upvotes": 282,
        "comments": 71,
        "media": null,
        "permalink": "/r/movies/comments/1jfffou/paddington_2_had_me_sobbing/"
    },
    {
        "id": "1jfbtxr",
        "author": "Canadian-Man-infj",
        "title": "It's Bruce Willis' 70th birthday today; in celebration, what are your favourite Bruce Willis roles or movies?",
        "content": "As the title says. I just discovered that Bruce Willis turns 70 today and thought I'd ask the r/movies community what everyone's favourite roles or movies are... I get the impression that I know what a lot of people will choose, but he has 147 acting credits (as per IMDB). \n\nAs an aside or addition to the question, what are his most underrated roles or movies? ",
        "upvotes": 492,
        "comments": 567,
        "media": null,
        "permalink": "/r/movies/comments/1jfbtxr/its_bruce_willis_70th_birthday_today_in/"
    },
    {
        "id": "1jfn6st",
        "author": "SardinesForHire",
        "title": "The Cell (2000)",
        "content": "This movie traumatized me as a kid. I think everyone has *that* movie. The one that changed their brain chemistry. Well this was mine. \n\n\nOddly enough, whenever the topic of scary movies comes up in a group conversation, no one has ever heard of it. I’ve rewatched it now as an adult showing people this crazy fever dream from my childhood and honestly this is a solid movie. The art direction and design is pretty spectacular. Despite a tight plot and novel imagery it kind of got panned and I’m not entirely sure why. \n\nIf this posts only achieves one thing in getting even one person to watch this movie. I will be satisfied ",
        "upvotes": 58,
        "comments": 52,
        "media": null,
        "permalink": "/r/movies/comments/1jfn6st/the_cell_2000/"
    },
    {
        "id": "1jf5gxs",
        "author": "TheDawiWhisperer",
        "title": "Is it weird that I'm considering going back to Blu-Rays and DVDs over streaming?",
        "content": "Anyone else feel the same?\n\nI _really_ feel like watching Battlestar Galactica for some reason and it's not available anywhere to stream....I'm getting really fed up of the cycle of things appearing and disappearing and hunting around streaming services for things.\n\nI've never been a fan of the seven seas and the cost per episode to buy it on a streaming service is just ludicrous....whereas I can the full series from a local shop for about £10.\n\nModern streaming services are a fucking mess. When  _everything_ was on Netflix it was fine but I'm not sighing up to Studiocanal+ for a month to watch The Host. I'm just not.",
        "upvotes": 908,
        "comments": 626,
        "media": null,
        "permalink": "/r/movies/comments/1jf5gxs/is_it_weird_that_im_considering_going_back_to/"
    },
    {
        "id": "1jewgp7",
        "author": "MarvelsGrantMan136",
        "title": "New IMAX Poster for 'Warfare'",
        "content": "",
        "upvotes": 2873,
        "comments": 722,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sjgl8wcw9npe1.jpeg?auto=webp&amp;s=e613f0a54c64ee18b9d2e9fe8452f020a61cab27"
        },
        "permalink": "/r/movies/comments/1jewgp7/new_imax_poster_for_warfare/"
    },
    {
        "id": "1jf10yx",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for ‘Lilo &amp; Stitch’",
        "content": "",
        "upvotes": 1230,
        "comments": 169,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7nh85r0jaope1.jpeg?auto=webp&amp;s=b3dfb768b81d8d8b456f63eaddcea558f188f572"
        },
        "permalink": "/r/movies/comments/1jf10yx/new_poster_for_lilo_stitch/"
    },
    {
        "id": "1jfpswy",
        "author": "NoCulture3505",
        "title": "Dangerous Animals: Official Teaser | Jai Courtney | HD | IFC Films",
        "content": "",
        "upvotes": 22,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Z0Dd8DlCkYr4nkmSUrE9h7iFr09rXD_XJcEMnMsAtOQ.jpg?auto=webp&amp;s=8caf27870f326285ca730a70235647764c23edb3"
        },
        "permalink": "/r/movies/comments/1jfpswy/dangerous_animals_official_teaser_jai_courtney_hd/"
    },
    {
        "id": "1jf4q2q",
        "author": "ChiefLeef22",
        "title": "'Disney's Snow White' - Review Thread",
        "content": "Director - Marc Webb  \nStarring - Rachel Zegler, Gal Gadot, Andrew Burnapp, Martin Klebba, Ansu Kabia\n\n*A beautiful girl, Snow White, takes refuge in the forest in the house of seven dwarfs to hide from her stepmother, the wicked Queen. The Queen is jealous because she wants to be known as \"the fairest in the land,\" and Snow White's beauty surpasses her own.*\n\n**Rotten Tomatoes:** [47%](https://www.rottentomatoes.com/m/disneys_snow_white) (Rotten)\n\n**Metacritic:** [47/100](https://www.metacritic.com/movie/snow-white/) (Mixed or Average)\n\nSome Reviews:\n\n[The Hollywood Reporter - David Rooney](https://www.hollywoodreporter.com/movies/movie-reviews/snow-white-review-rachel-zegler-gal-gadot-disney-1236167607/)\n\n&gt;Webb proves equally adept at romantic interludes, attack scenes and production numbers, notably the joyous finale, “Good Things Grow,” with the entire cast outfitted by Powell in resplendent white. Sure, those poorly integrated CG little people take some getting used to, but this is the type of wholesome and uplifting family entertainment that comes directly from old-school Disney DNA.\n\n[Awards Watch - Erik Anderson \\[C+\\]](https://awardswatch.com/snow-white-review-rachel-zegler-is-the-fairest-of-them-all-in-marc-webbs-fairytale-remake-c/)\n\n&gt;*Snow White* is more clearly made for children than most of the other Disney live-action remakes, and its focus on being a fairytale helps with that goal. This is a simple story that anyone can understand and enjoy, with a cheer-worthy lead and some catchy, if unmemorable, new songs. The film threads the needle about as well as it possibly could, which is impressive even if it doesn’t mean the film is actually great. You may not be whistling on your way out of the theater, but at least watching *Snow White* doesn’t feel like work.\n\n[Variety - Owen Glieberman](https://variety.com/2025/film/reviews/snow-white-review-rachel-zegler-gal-gadot-1236340753/)\n\n&gt;You could say that we’ve seen other fairy-tale rulers a lot like this one. Yet movies connect in mysterious ways. Who would have thought that a Disney live-action remake could seem this pointedly political? In the end, the most resonant romantic feeling “Snow White” leaves you with may be: Someday my chintz authoritarian will come tumbling down.\n\n[FandomWire - Manuel](https://fandomwire.com/snow-white-review)\n\n&gt;Rachel Zegler is the heart and soul of this film. Not only does she deliver an impressive vocal performance, but she also radiates charisma and emotion in every scene. Her Snow White is fearless, fair, brave, and true like she should be, elevating the character to a new level of sophistication. It’s disappointing to see how many people will leave outside influences to shape their perception of her work because this is, without a doubt, one of the most memorable performances of the year from one of the most talented actresses of her generation.\n\n[Independent (UK)](https://www.rottentomatoes.com/critics/source/691) \\- [Clarisse Loughrey \\[1/5\\]](https://www.rottentomatoes.com/critics/clarisse-loughrey)\n\n&gt;With Snow White, they’ve finessed their formula -- do the bare minimum to make a film, then simply slap a bunch of cutesy CGI animals all over it and hope no one notices. The film’s prince, played by Andrew Burnap and, for some reason, called Jonathan, is essentially Disney cannibalising itself, as he has the same thief backstory and curtain bangs as *Tangled*’s Flynn Rider. There’s self-cannibalisation at work, too, in Sandy Powell’s costumes, which are dour replicas of their animated counterparts. At times, Zegler’s bob leans dangerously close to “little Dutch boy”. What’s most disheartening about it all is how predictable Disney’s choices have become.\n\n[The Daily Beast - Nick Schager](https://www.thedailybeast.com/obsessed/snow-white-review-disneys-worst-live-action-catastrophe-yet/)\n\n&gt;From a strictly political standpoint, it provides a more enlightened portrait of female independence. Such a nominal improvement, however, proves inherently incompatible with its source material, and the resultant awkwardness defines this misfire, whose every duplication is underwhelming, and whose every alteration is less a move in the right direction than a step on a face-smacking rake. No Magic Mirror is needed to identify it as the lamest Mouse House re-do of them all.\n\n[Guardian - Peter Bradshaw \\[1/4\\]](https://www.theguardian.com/film/2025/mar/19/snow-white-review-live-action-musical-rachel-zegler-gal-gadot)\n\n&gt;Those otherwise estimable performers Rachel Zegler and Gal Gadot are now forced to go through the motions, and they give the dullest performances of their lives. Here is a pointless new live-action musical version of the Snow White myth, a kind of un-Wicked approach to the story and a merch-enabling money machine. Where other movies are playfully reimagining the backstories of famous villains, this one plays it straight, but with carefully curated revisionist tweaks.\n\n[RogerEbert.com](https://www.metacritic.com/publication/rogerebertcom/) \\- [Nell Minow](https://www.metacritic.com/critic/nell-minow/)\n\n&gt;Some parts of the film work better than others, but none of it has the sweetness and imagination of the animated feature. This “Snow White” is not the fairest of them all. It’s just, well, fair. The other core elements of any version of this story are all present here, with varying degrees of success. Near the top is replicating Disney’s version of the iconic magic mirror that answers the question about fairness (the mirror for “Sydney White’s” nemesis is the online campus popularity poll). This one is close to the 1937 film’s design, familiar to Disney fans through many appearances in various productions, from the “Wonderful World of Disney” series of the 1950s, when it was voiced by Hans Conried, through the popular “Descendents: Wicked World” series of 2015-17.\n\n[The Film Verdict](https://www.rottentomatoes.com/critics/source/4059) \\- [Alonso Duralde](https://www.rottentomatoes.com/critics/alonso-duralde)\n\n&gt;Like so much of contemporary fantasy cinema, Snow White exists in a weirdly artificial netherworld, and not just where the seven dudes are concerned.\n\n[AV Club](https://www.rottentomatoes.com/critics/source/833) \\- [Jacob Oller](https://www.rottentomatoes.com/critics/jacob-oller)\n\n&gt;For every attempt to replicate majestic shots from the original or to give them a bit of technological oomph (perhaps most effective as sunlight breaks through Snow White’s fearful first trip through the forest), there is a spurt of modern quippiness that pulls the audience in the other direction. It’s a disorienting take on a film whose success relied as much on its elegance as its beauty, and yet, thanks to sunny songstress Rachel Zegler, there is a talented throughline still obvious amidst the mess.\n\n[New York Magazine/Vulture](https://www.rottentomatoes.com/critics/source/334) \\- [Alison Willmore](https://www.rottentomatoes.com/critics/alison-willmore)\n\n&gt;*Snow White* is, for better and (mostly) worse, a product of a corporation that has for years been lumbering after its idea of the zeitgeist with all the agility of an aging colossus. That, in chasing something vaguely progressive and YA-inspired with *Snow White*, Disney has turned out a film with some hilariously timely choices is a great joke, though I wouldn’t call it an intentional one. The most pragmatic aspect of Snow White is that with its plasticky set design and gift shop tacky costuming, it already looks like it takes place in a theme park — no adaptations necessary.\n\n[Consequence](https://www.rottentomatoes.com/critics/source/2610) \\- [Liz Shannon Miller \\[C+\\]](https://www.rottentomatoes.com/critics/liz-shannon-miller)\n\n&gt;At the end of the day, the best parts of Snow White are the parts that feel genuinely real and authentic. If only there were more of those, and less screen time spent dancing in the realm of mind-breaking absurdity.\n\n[The Playlist](https://www.rottentomatoes.com/critics/source/2100) \\- [Rodrigo Perez](https://www.rottentomatoes.com/critics/rodrigo-perez) [\\[C-\\]](https://theplaylist.net/snow-white-review-oppressed-princess-reclaims-kingdom-from-occupying-tyrannical-queen-in-otherwise-boring-loud-spectacle-20250319/)\n\n&gt;Films are supposed to be passion projects, even the biggest and kitschiest, but one wonders what in this material compelled Marc Webb to dedicate two years of his life to this hollow and soulless project seemingly meant to move merchandise other than hopefully what was a very handsome paycheck. White interjecting its social commentary, “Snow White” otherwise tackles much of the same ideas, but it’s all put together in a very familiar and garish package. The fairest in the land? Far from it.",
        "upvotes": 762,
        "comments": 958,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/30LNbP38mO5pmtZ_gw1IxnmF3upGtHFy6u0bMZwHExU.jpg?auto=webp&amp;s=e6e3c115271e4c48bac731e4b8bc829d6835e124"
        },
        "permalink": "/r/movies/comments/1jf4q2q/disneys_snow_white_review_thread/"
    },
    {
        "id": "1jfoolm",
        "author": "Bigboss7823",
        "title": "One of my fav movies is \"Frequency\" with D. Quaid if you like some mystery, science, emotional trauma from loss, and yearning for I wish this was possible.",
        "content": "Being from NY and huge MLB fan, lost my Dad at a young age. Also love science and it's nostalgic to check out time periods when I grew up. Gen X has a very unique perspective like no others because we've seen pre-internet, start of it, and our current technology. It's truly amazing and so interesting but it would be even more amazing if stuff like (in this movie) really happened. I cry like crazy at the end...like I just close my eyes and picture that reunion with my own father. Anyways, I'd like to hear about anyone else's reviews on the movie. Thanks!",
        "upvotes": 25,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1jfoolm/one_of_my_fav_movies_is_frequency_with_d_quaid_if/"
    },
    {
        "id": "1jfra1e",
        "author": "TheDezKillah",
        "title": "Possession - re:View (RedLetterMedia)",
        "content": "",
        "upvotes": 16,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UrrlGmyvj8UG4aQtOecZZHal2OOudLcoZtHPvOtfGyc.jpg?auto=webp&amp;s=e782f6876306fc8230be829891c81527f817606d"
        },
        "permalink": "/r/movies/comments/1jfra1e/possession_review_redlettermedia/"
    },
    {
        "id": "1jf3jql",
        "author": "ChiefLeef22",
        "title": "Moviegoers Want More Comedies, Thrillers and Action Titles in Theaters, Global Cinema Study With Over 68,000 Respondents in 15 Markets Finds | Audiences over 45 were the most dissatisfied with the number of compelling films in theaters, despite having the time and desire to attend.",
        "content": "",
        "upvotes": 767,
        "comments": 266,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ohxpOb5cUUwfDPIg_dkcIYpi2MyIrciFIqZsrIO1qHI.jpg?auto=webp&amp;s=ab42a230a7608b181190c84d11931e988a1c5901"
        },
        "permalink": "/r/movies/comments/1jf3jql/moviegoers_want_more_comedies_thrillers_and/"
    },
    {
        "id": "1jeypyj",
        "author": "MarvelsGrantMan136",
        "title": "From the World of John Wick: Ballerina - New Trailer",
        "content": "",
        "upvotes": 1123,
        "comments": 436,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LRa1LkIzTqnIlHyg6R2tMVD_-ir3ey5cghHFvhCY1yc.jpg?auto=webp&amp;s=29e3e93d73ec21630520646cd33288867761fe35"
        },
        "permalink": "/r/movies/comments/1jeypyj/from_the_world_of_john_wick_ballerina_new_trailer/"
    },
    {
        "id": "1jez07f",
        "author": "NoCulture3505",
        "title": "Untitled Daniels Film, ‘Community’ Movie, ‘Cut Off’ Secure California Production Tax Credits",
        "content": "",
        "upvotes": 884,
        "comments": 109,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/n3i0eXtIJRtuB-5E-aTvbPM-mWb5JuKIVkgi28aGNRY.jpg?auto=webp&amp;s=3845b0410a165948dd609a0c39841203d17967a1"
        },
        "permalink": "/r/movies/comments/1jez07f/untitled_daniels_film_community_movie_cut_off/"
    },
    {
        "id": "1jfd3gx",
        "author": "MarvelsGrantMan136",
        "title": "Zach Cregger’s 'Weapons' Moves Up Release Date to August 8; Leonardo DiCaprio, Paul Thomas Anderson’s 'One Battle After Another' Moves to September 26; Maggie Gyllenhaal’s ‘The Bride’ Delayed Until March 2026",
        "content": "",
        "upvotes": 118,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PobZLak87J-ezMEfPyVYgYc9b8i7Gq2iTJToU2LwW7I.jpg?auto=webp&amp;s=6d79a8faf87108f6d0a608488660a394ca9e9a24"
        },
        "permalink": "/r/movies/comments/1jfd3gx/zach_creggers_weapons_moves_up_release_date_to/"
    },
    {
        "id": "1jf0cmi",
        "author": "MarvelsGrantMan136",
        "title": "TOGETHER - Official Teaser Trailer - In Theaters August 1",
        "content": "",
        "upvotes": 615,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/262juXnhj2Y8kHTTUDADvA4qNckJo8bQQT8G2eYlg0I.jpg?auto=webp&amp;s=36254af6cb495ddf69b15a0a036f7a990e6946a9"
        },
        "permalink": "/r/movies/comments/1jf0cmi/together_official_teaser_trailer_in_theaters/"
    },
    {
        "id": "1jfc61a",
        "author": "shrek_deus",
        "title": "name a movie you gradually dislike more on every rewatch",
        "content": "my pick: Interstellar\n\nnot a bad movie by any means, it is incredibly well shot, directed and has brilliant cgi, but at each time i rewatch it, i start to get more bothered with the plot, and the dialogue is also pretty expository.\nall of this got worse after i watched Contact (1997), a film that also features Matthew MacCoughney, but it has a much more interisting take in physics and human relations.",
        "upvotes": 120,
        "comments": 520,
        "media": null,
        "permalink": "/r/movies/comments/1jfc61a/name_a_movie_you_gradually_dislike_more_on_every/"
    },
    {
        "id": "1jf0hby",
        "author": "LinkSwitch23",
        "title": "New Poster for Pixar’s ‘Elio’",
        "content": "",
        "upvotes": 446,
        "comments": 313,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o2so4dye6ope1.jpeg?auto=webp&amp;s=97b1480992fda5ec06e7976eb87459aa0abacb8b"
        },
        "permalink": "/r/movies/comments/1jf0hby/new_poster_for_pixars_elio/"
    },
    {
        "id": "1jft1w5",
        "author": "Desperate_Cicada_203",
        "title": "What was the name of that lifetime movie?",
        "content": "I remember seeing a movie on Lifetime where in one scene the mom tells her son to do his homework because that is his job as a kid right now. Then I remember in another scene the parents are rushing with joy finding their eldest daughter and it turns in slow motion into emotional shock and sadness as they find her dead body in the grass. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1jft1w5/what_was_the_name_of_that_lifetime_movie/"
    },
    {
        "id": "1jf1qpe",
        "author": "MarvelsGrantMan136",
        "title": "Miami Beach Mayor Drops Plan to Evict O Cinema After ‘No Other Land’ Controversy",
        "content": "",
        "upvotes": 302,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PNj_Mus6R3XbuKCTSKAYCCyFrhE0KONmQm42Bi4Tpho.jpg?auto=webp&amp;s=3a7e12701ef6c8c9f97d801fa8669f901bdc91e5"
        },
        "permalink": "/r/movies/comments/1jf1qpe/miami_beach_mayor_drops_plan_to_evict_o_cinema/"
    }
]