[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 13,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 48,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l0buum",
        "author": "MovieFan0512",
        "title": "The 2025 'Tudum' Event is Horrifically Bad",
        "content": "I tuned in to watch the event and it looks like the teen choice awards but for Netflix. It would have been better and more to the point by just releasing trailers and previews of upcoming shows on social media and YouTube. Not a teenybopper concert and nonsense.",
        "upvotes": 151,
        "comments": 94,
        "media": null,
        "permalink": "/r/netflix/comments/1l0buum/the_2025_tudum_event_is_horrifically_bad/"
    },
    {
        "id": "1l0czo5",
        "author": "CosmosisJones42",
        "title": "TUDUM is the cringiest thing I have ever seen.",
        "content": "I decided to check it out to see some cool trailers. I've been watching for 10 minutes, and I am cringing at everything. The host, the writing, I get that award show jokes are usually lame, but my god, I am literally shocked about how bad this is. Who approved this?",
        "upvotes": 86,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1l0czo5/tudum_is_the_cringiest_thing_i_have_ever_seen/"
    },
    {
        "id": "1l0bma9",
        "author": "Lucky_Chaarmss",
        "title": "I've never seen Tudum before...",
        "content": "This is one of the dumbest things I've ever watched. They really need this to show some trailers? Just release the trailers and go about your day. Seems like a huge waste of money to me. ",
        "upvotes": 67,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1l0bma9/ive_never_seen_tudum_before/"
    },
    {
        "id": "1l0i61j",
        "author": "killwish_",
        "title": "Glitch: A Hidden Gem Worth Watching on Netflix?",
        "content": "\nHey r/Netflix,\nI just stumbled upon \"Glitch\" on Netflix and it looks pretty intriguing! It's a series about a police officer and a doctor who face an emotionally charged mystery when seven local residents inexplicably return from the dead in peak physical form.\nBefore I dive in, I wanted to get the community's thoughts. Has anyone watched this show? If so, what did you think? Is it worth the watch? No spoilers please!\nLooking forward to hearing your recommendations!\n\n–u/killwish_\n",
        "upvotes": 15,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1l0i61j/glitch_a_hidden_gem_worth_watching_on_netflix/"
    },
    {
        "id": "1l0catv",
        "author": "Significant-Chart661",
        "title": "ONE PIECE: Season 2 | Chopper First Look | Netflix",
        "content": "",
        "upvotes": 34,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l0catv/one_piece_season_2_chopper_first_look_netflix/"
    },
    {
        "id": "1l0cvvu",
        "author": "LushCorp",
        "title": "Joined the Reddit just to ask",
        "content": "Is it TOODOOM or TUHDUM I was assuming i assuming it was Tuhdum like the noise Netflix makes when you open the app but me and my friend itch in our seats every time someone says “toodoom” anyway this isn’t a serious post just wondering if anyone else felt the same",
        "upvotes": 16,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1l0cvvu/joined_the_reddit_just_to_ask/"
    },
    {
        "id": "1kzxgcy",
        "author": "Worth-Stop3752",
        "title": "my netflix has the literal worst interface I have ever seen on my TV",
        "content": "I am one of the unlucky saps who got stuck with the new interface, I opened it said what the fuck, scrolled and immediately decided I am NOT using my netflix because wdym I have FOUR slots to look at??? it’s 100% an AI algorithm too.. which just makes it worse because I haven’t ever watched anything remotely to what’s being reccomended, why is the SETTINGS gone? who thought this shit was a good idea??? I used to be able to see like 30 things on my screen because they were smaller, but I can’t even see the next row… this is literally THE WORST interface i’ve seen on a streaming service and Km very tempted to just cancel 🙃",
        "upvotes": 124,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1kzxgcy/my_netflix_has_the_literal_worst_interface_i_have/"
    },
    {
        "id": "1l0bsi6",
        "author": "iPhone13pm",
        "title": "Squid Game Season 3 Trailer",
        "content": "",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l0bsi6/squid_game_season_3_trailer/"
    },
    {
        "id": "1l097pf",
        "author": "norman3355",
        "title": "The Secrets we keep (2024)",
        "content": "Danish social/crime drama over 6 episodes. Fabulous direction and photography and solid cast. Avoids cliches for the most part and is refreshing to see. \n\nJust thought I’d share. ",
        "upvotes": 18,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l097pf/the_secrets_we_keep_2024/"
    },
    {
        "id": "1l0dtys",
        "author": "MysticCrest1830",
        "title": "Netflix Confirms 'Wake Up Dead Man: A Knives Out Mystery' December Premiere, Reveals Detailed Cast Information in New Teaser",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l0dtys/netflix_confirms_wake_up_dead_man_a_knives_out/"
    },
    {
        "id": "1l0hdwo",
        "author": "crustychad",
        "title": "Shouldn't it be tuh-duhm not tuh-doom?",
        "content": "I had been saying it tuh-duhm for a few weeks now. Seems like it would fit closer to the sound effect that way.\n\nOverall excited for one piece and a few of the other shows. Lady Gaga's backup dancers were really outstanding and the highlight of her performance.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l0hdwo/shouldnt_it_be_tuhduhm_not_tuhdoom/"
    },
    {
        "id": "1l0iex4",
        "author": "Kellsbells976",
        "title": "Netflix was wrong for what they did to Squid Game",
        "content": "That's how you treat one of your most streamed shows? By giving them the cringiest and shortest segment at Tudum? All that hype about Choi Seunghyun being there and then the man said like two lines? You flew them from Korea just for that? A damn shame. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l0iex4/netflix_was_wrong_for_what_they_did_to_squid_game/"
    },
    {
        "id": "1l0apdw",
        "author": "crosstheroom",
        "title": "that Chris Watt movie was so hard to watch American Murder\" The Family Next Door",
        "content": "I'm numb, how could he do that to his babies.\n\njust leave, it's better to be seen as an ahole who abandoned your family than to do what he did.   Doesn't matter what people think, better to be hated than to hear \"daddy no\" in your head for the rest of your life,\n\nand he even took them in the truck with Shannan dead knowing he was going to kill them when he got there.\n\nand it's so sad because it seemed he was a good guy and even with the way he treated the girls.\n\nWhen they said his parents didn't go to his wedding I knew something was wrong with his side of the family.\n\nI even felt bad for the poor little dog left behind.",
        "upvotes": 12,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1l0apdw/that_chris_watt_movie_was_so_hard_to_watch/"
    },
    {
        "id": "1l04ouq",
        "author": "gorram1mhumped",
        "title": "Adolescence vs Dept Q. Actors living in the moment vs actors acting, a short rant.",
        "content": "Many of us love a good procedural. Adolescence was unique in many ways. The single shot experience is amazing. But contrasted with Dept Q, it really showcases a slowed down, normal way of talking that is rare in tv. I'm very much into the story of Dept Q, but far too often the characters are slinging witticisms, even normal ideas, back and forth clearly faster than normal cognition allows. Nothing too wrong with it, its exciting and fun. In early Guy Ritchie movies its amazing. When Jeremey Brett does it as Sherlock Holmes you believe it. But in this show, for me at least, it kinda breaks the spell. Adolescence told a great story in four episodes, and every character was understandably too busy digesting the situation and processing their emotions to be pumping us with dialogue - that is great tv! Fast pace high level dialogue is a choice, a gamble, and ultimately a hard sell, especially for a 'procedural.' ",
        "upvotes": 19,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1l04ouq/adolescence_vs_dept_q_actors_living_in_the_moment/"
    },
    {
        "id": "1l0id1z",
        "author": "Much-Age6527",
        "title": "any recs?",
        "content": "any recs for series similar to Wednesday. I watched Wednesday back when it was released and rewatched it recently. I really wanna watch something that is similar to that genre and that vibe? any recs?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l0id1z/any_recs/"
    },
    {
        "id": "1l01km5",
        "author": "haplo76",
        "title": "Why are we paying more for the new horrible interface?",
        "content": "It’s so hard to search. They are trying to follow Disney+  ? Makes it so much harder to look for new shows. Every show gets enlarged.   You really don’t feel like searching after awhile. Anyway to get back the old interface? ",
        "upvotes": 25,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1l01km5/why_are_we_paying_more_for_the_new_horrible/"
    },
    {
        "id": "1kzfh7m",
        "author": "WhatevUsayStnCldStvA",
        "title": "Deadly American Marriage. Molly shouldn’t even be in this",
        "content": "I cannot believe how angry this documentary is making me. She comes off as a manipulative psycho. It seems clear she came into his life to steal these kids and he was catching onto it. Those recordings just proved that. She was purposely going against what he asked and wanted constantly. He called her out. And she played dumb and innocent. He even said in the recording that she was trying to separate him from his kids. He was 💯 percent correct on this. \n\nI can't believe the two of them were even in this documentary. Unless every person who watches it gets that same disgusting reaction to her that I do, then maybe this helps more in the court of public opinion.\n\nI still have 26 min left. I just can't believe they won an appeal. ",
        "upvotes": 407,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1kzfh7m/deadly_american_marriage_molly_shouldnt_even_be/"
    },
    {
        "id": "1l0ghg2",
        "author": "jaded_11",
        "title": "Random Restart??",
        "content": "Did anyone else's Netflix just randomly restart without their initiating it?\n\nWe never told anyone our email and I can't imagine they'd be able to guess the password since I don't even remember it. \n\nNetflix guidance is just too cancel and change your password but they don't offer a refund. Could they have restarted it and are pretending it's a child who guessed our details?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l0ghg2/random_restart/"
    },
    {
        "id": "1l0ggw0",
        "author": "Shi_draws",
        "title": "Bet: is the live action adaptation of Kakeguri worth checking out?",
        "content": "If I ignore the origonal anime's existence is Bet enjoyable? My parents quite enjoyed Alice in Borderland so i'm on the search for other live action adaptations of manga to watch with them as its nice to share my intrests with them and sadly my mum hates anime so they have to be live action. I LOVE kakeguri and I have a feeling based on the trailer of Bet that if I go into it wanting an even slightly faithful adaptation of Kakegurui i'll hate it, but if I go in ignoreing the anime is it a good show on its own?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l0ggw0/bet_is_the_live_action_adaptation_of_kakeguri/"
    },
    {
        "id": "1l0gd21",
        "author": "MysteriousMortgage4",
        "title": "Sirens Theory",
        "content": "I just finished and I actually really liked the show. My theory is all along we think Michaela is like a siren. She drew in Peter, Simone, and even Devon at some point. They even add in the hawk coming back for her. However by the end we realize the actual siren is Simone. \nMy theory is Simone has some personality type disorder from PTSD of her childhood. If you notice Raymond said that she slept with her college professor and ended his career. I also think a highschool boyfriend too. I think her meds keep her functioning normally, but as she got off them her “siren” ways came out. I think her dad saying it would just be them and touching her was a trigger and going to take Michaela’s role as Mrs. Kell was her response. A trauma response for survival. So interesting! Anyone agree/disagree? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l0gd21/sirens_theory/"
    },
    {
        "id": "1l0b8x4",
        "author": "Hungry_Detective4182",
        "title": "Netflix downloads",
        "content": "I got Netflix standard with ads(im in Australia) and even though it says on the website that you have up to 15 downloads. I cant find a download button anywhere. Did they change their policy without changing the website or something?",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1l0b8x4/netflix_downloads/"
    },
    {
        "id": "1l01mui",
        "author": "zdenstrn",
        "title": "Netflix on LG TV - new layout missing some sections",
        "content": "Hello, contrary to popular opinion, I am not that much disappointed by new layout. The large tiles are fine by me. \n\nHOWEVER, there are two important things missing from the interface, and that is \"New and popular\", which was far most used section by me. And it is NOT even hidden in the home section. This, and the \"coming this week\", \"coming next week\", \"worth the wait\" were great functionalities. \n\nanother missing section is games, but dont care about it. was crap anyway, most of the games.\n\nSo I wanted to ask, if something is wrong with my TV (its about 5 years old), or if its a feature and not a bug, or if they plan to update the app. \n\nObviously, theres a workaround, i can still see \"new and popular\" in PC or mobile app, pin it to \"my shows\" and then follow on TV, but it feels cheap and uncomfortable. \n\nany info would be greatly appreciated.",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1l01mui/netflix_on_lg_tv_new_layout_missing_some_sections/"
    },
    {
        "id": "1l0dn2v",
        "author": "Wiggle789",
        "title": "Can't even watch \"Tudum\"",
        "content": "Every time I press play, this \"Exit Livestream\" bar pops up automatically and kicks me after like ten seconds. I just want to see Lady Gaga. Help.\n\nhttps://preview.redd.it/6n76lz1u384f1.png?width=259&amp;format=png&amp;auto=webp&amp;s=129da40af0daedb8e4152b0a2fa4785a18a74c7c\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l0dn2v/cant_even_watch_tudum/"
    },
    {
        "id": "1l0d0n7",
        "author": "JoeSnaffles",
        "title": "Wake Up Dead Man Release Date",
        "content": "I don’t know if it’s because the Glass Onion trailer came out so closely to the release of that movie (and the fact that it came out in theaters almost a month before Netflix), or if it’s because of the three year long wait, but December is so goddamn far away 😭 I can still appreciate it for the fact that they might still be finishing up the movie in post-production, or the fact that all of the Knives Out movies have released around Thanksgiving or Christmas time. Sure, it fits with the other installments to keep a consistent release schedule. But man, we waited so long for a release date alone, just to learn it’s almost at the very end of the year.\n\nMaybe I’ll be less bummed out if they announce it’s getting a theatrical release akin to Glass Onion. Which, I’m slightly surprised they haven’t announced, because if they properly release this (and do it a month or two before the Netflix release), it could make WAY more money than Glass Onion did and absolutely turn a profit for the company. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l0d0n7/wake_up_dead_man_release_date/"
    },
    {
        "id": "1kzqtvz",
        "author": "Robemilak",
        "title": "Elizabeth Debicki has officially joined the cast of David Fincher’s ‘ONCE UPON A TIME IN HOLLYWOOD’ follow-up at Netflix.",
        "content": "",
        "upvotes": 31,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kzqtvz/elizabeth_debicki_has_officially_joined_the_cast/"
    },
    {
        "id": "1l06w1r",
        "author": "Extension_Sun_7487",
        "title": "Problème audio Love Death + Robots S4 : Can't Stop\"",
        "content": "Bonjour,\n\nMembre depuis janvier 2022, j'ai signalé plusieurs dysfonctionnements aussi bien audio que sous-titres.\n\nCependant, à chaque fois qu'un signalement est envoyé, j'ai l'impression que Netflix ne réagit pas.\n\nLà , il s'agit de la saison 4 de la série LD+R où tous les épisodes sont proposés dans plusieurs langues sans ou avec audiodescription, sauf l'épisode Can't Stop où l'audiodescription est imposée.\n\nJ'ai envoyé un signalement écrit, il y a quelques jours. Ne voyant pas le problème corrigé, j'ai appelé Netflix.\n\nJe suis tombé sur un employé de chez Netflix qui m'a dit que c'est lié aux licences qu'ils possèdent, aux droits d'auteurs et à l'entreprise d'édition au lieu de dire que c'est un oubli ou une erreur technique (Mais bien sûr... !!! Et c'est la marmotte qui met le chocolat dans le papier alu).\n\nComme je l'ai indiqué sur la 1ère ligne, j'ai émis plusieurs signalements comme par exemple un épisode de \"Classic\" Ben 10, où il y a une distorsion tout le long d'un épisode sur l'ensemble des 3 saisons.\n\nNetflix m'avait sorti le même baratin pour ce problème-là.\n\nJe ne serai pas étonné que certains passent par d'autres méthodes, plus ou moins illégales, pour un service médiocre et abusif.\n\nLa seule chose (positive) : c'est que je ne suis pas le seul à l'avoir signalé, d'après cet employé.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l06w1r/problème_audio_love_death_robots_s4_cant_stop/"
    },
    {
        "id": "1l06hga",
        "author": "goma_zr",
        "title": "tour de france unchained",
        "content": "I was wondering if anyone knows when the new season of tour de france unchained is coming out. the first two seasons were released in june so i assumed this one would as well but there arent any announcements... also id expect it to come out before the tour starts so why is no onetalking about it and does anyone know anything?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l06hga/tour_de_france_unchained/"
    },
    {
        "id": "1l0601v",
        "author": "Organic-Hovercraft-5",
        "title": "Netflix really wants a resub",
        "content": "I canceled my Netflix account about two months ago because we don’t really use it much anymore. The problem I have is every time we turn on our Samsung TV it’s asking for us to resub. I even deleted the Netflix app… getting quite annoying and honestly this shouldn’t be happening. \n\nDoes this happen to anyone else? ",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1l0601v/netflix_really_wants_a_resub/"
    },
    {
        "id": "1kzfb3h",
        "author": "Semtex7",
        "title": "If Netflix rolled the new layout for you - report it, don’t just take that crap",
        "content": "If you are one of the unlucky bastards they are beta testing the new layout for the TV app you already understand the title. Don’t just struggle with it, it is pointless. It is not usable. You see more titles on your phone than a freaking 84in TV. It makes NO SENSE. You have to scroll till your life is half over to go through a decent amount of titles. No upcoming titles anymore.\n\n\nReport it so it never stays. They are looking for feedback ",
        "upvotes": 140,
        "comments": 104,
        "media": null,
        "permalink": "/r/netflix/comments/1kzfb3h/if_netflix_rolled_the_new_layout_for_you_report/"
    },
    {
        "id": "1l080jr",
        "author": "Ames_2405",
        "title": "Netflix down",
        "content": "My Netflix logged us out and every time we try and sign in it come up with ‘error’, we’ve tried the website too and it doesn’t send us a reset email when we ask for one, any ideas??",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l080jr/netflix_down/"
    }
]