[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 29,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1ph1mqu",
        "author": "Other-Squirrel-8705",
        "title": "Diddy is done.",
        "content": "Sean Combs:The reckoning.  What shocked you the most? Collecting bodily fluids to drink later 😱. Also when he shook hands with his fans/people in Harlem….and talked about needing a shower after. That man is layers of evil. ",
        "upvotes": 738,
        "comments": 234,
        "media": null,
        "permalink": "/r/netflix/comments/1ph1mqu/diddy_is_done/"
    },
    {
        "id": "1ph42sv",
        "author": "HehroMaraFara",
        "title": "Sean Combs: The Reckoning",
        "content": "Obviously he’s generally a scumbag and that’s been well established. What struck me the most is almost any time he speaks at length, it is pure gibberish. \n\nThis mofo cannot put together a coherent thought. How he operated in any kind of a professional sense is unbelievable. It is pretty ridiculous that he was not exposed earlier. \n\nFuck Diddy. ",
        "upvotes": 308,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1ph42sv/sean_combs_the_reckoning/"
    },
    {
        "id": "1pgdmxt",
        "author": "Swamp_Hawk420",
        "title": "Canceling my subscription, this is too ridiculous",
        "content": "I’m traveling right now about a thousand miles from home. It’s late, I can’t sleep, tried to throw on a movie, and got notified that Netflix has decided that I’m trying to commit fraud by watching tv outside of my house. The account is linked to my wife’s email so I can’t get the temporary password. The fact that they treat us like we’re trying to steal from them after paying so much is just a bridge too far. ",
        "upvotes": 5407,
        "comments": 348,
        "media": null,
        "permalink": "/r/netflix/comments/1pgdmxt/canceling_my_subscription_this_is_too_ridiculous/"
    },
    {
        "id": "1phedey",
        "author": "DetectiveHot2071",
        "title": "50 Cent claims Diddy sent him ‘creepy’ gift from prison after explosive Netflix doc",
        "content": "",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1phedey/50_cent_claims_diddy_sent_him_creepy_gift_from/"
    },
    {
        "id": "1ph74e3",
        "author": "RedditBurner_5225",
        "title": "Sean combs the reckoning",
        "content": "Who did Diddy and his son Justin shoot in the bathroom? Who is G? Did anyone figure that out?\n\nAlso, why was he having freakoffs with his son Justin?! That is beyond insane.\n",
        "upvotes": 15,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ph74e3/sean_combs_the_reckoning/"
    },
    {
        "id": "1phdg8q",
        "author": "-sprout",
        "title": "Netflix account “doesn’t exist” customer service won’t help",
        "content": "My mum had a Netflix account that when I moved out she transferred to me through change of email. She still makes payments and I was able to log in with no problem on my smart TV and iPad. \n\nAfter a while (maybe after updates to the app) I was logged out of the account on my iPad and no longer able to log back in. This is something I just ignored for a long time as I was still able to watch on my TV. \n\nI am about to travel and would like to be able to watch Netflix away from home so, again,  tried logging in on my iPad. I’m told neither me or my mums email address are linked to an account, I’ve tried with both of our phone numbers and we get the same response “no account linked to these numbers”. We have also tried the option of using her debit card where payments are still taken monthly as it’s the “can’t remember email or phone number”last resort option, same response. \n\nWe called Netflix customer service today and she just ran us through the exact same process. She was quite adamant that no account exists and that we must be reading number wrong as there is no way that they couldn’t locate the account with her debit card account number. We’ve been through this process multiple times and the lady ended up telling us that there’s nothing she can do for us. \n\nI don’t really know where to go from here as the account definitely exists, I can still watch Netflix on my TV and a monthly payment is still being taken. Is there any way we can get money back, someone higher up than the call centre to email? Or do we just have to suck it up, close the account and create a new one? \n\nWe are in England for context and I’m not angry at the customer service lady, I know they’re trained to read off scripts and can only do what they can do. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1phdg8q/netflix_account_doesnt_exist_customer_service/"
    },
    {
        "id": "1phdglu",
        "author": "solid-sosa",
        "title": "Email showing up on tv that isnt mine?",
        "content": "I went to set up netflix on my tv, it says choose an account to sign in, one is a old gmail i havent used in a minute and isnt my netflix accounts email im not sure why it popped up, and the other is another gmail that isnt even mine it seems to be a womans as its a girly name? How is this possible, does it have something to do with being on wifi? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1phdglu/email_showing_up_on_tv_that_isnt_mine/"
    },
    {
        "id": "1pgtyt5",
        "author": "Chickenjane788",
        "title": "Check out Ripple - new on Netflix!",
        "content": "I enjoy a variety of stuff - dark and gritty to light and clever.\n\nCame across this new little 8 episode show on Netflix (Ripple) and it was actually pretty good! Yes, it was originally made for Hallmark and you can tell a bit, but a couple episodes in it finds a more natural groove and by the end I was invested in the characters and where it could go next. So fingers-crossed that netflix could keep going with it if enough people watch it. kinda the vibe of This is Us, virgin river etc.\n\nfirst episode is a little cheesy, but stick with it… it has potential!",
        "upvotes": 22,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pgtyt5/check_out_ripple_new_on_netflix/"
    },
    {
        "id": "1ph2zoi",
        "author": "Complex_Day6489",
        "title": "Help needed",
        "content": "**So when I go to watch Netflix (I watch Netflix on an Android phone) for some reason the screen always goes blank. I can still hear sound but the screen always turns black, I have reset my phone, delete and reinstall the app, and a few other things but I can't seem to get it to work. So if anyone knows how to fix this problem that would be amazing.**",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ph2zoi/help_needed/"
    },
    {
        "id": "1pgtj9a",
        "author": "JonCaroll21",
        "title": "Bad UI",
        "content": "I haven’t used Netflix on my TV in like a year or so but I downloaded it on my Roku again the UI is just humongous. Does anyone else have an issue with this or is it just me?\n\nI liked the old UI where I could catch a glimpse of a movie I may be interested in, in another row.",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pgtj9a/bad_ui/"
    },
    {
        "id": "1phcm75",
        "author": "N3DSdude",
        "title": "With the WB buyout and Ad tiers, watch out for Ultrasonic Tracking (uXDT)",
        "content": "As streaming libraries merge and ad-tiers become the norm, data tracking is ramping up. One specific method often flies under the radar: Ultrasonic Cross-Device Tracking.\n\nThe Gist: Advertisers hide high-frequency sounds in TV content that human ears can't hear. But your phone's microphone can. If a random app on your phone (like a free game or utility) has background mic access, it hears that signal and instantly links your TV viewing habits to your mobile profile.\n\nWhy it matters now: With the WB/Netflix changes, linking your TV to your Personal Device is the holy grail for their ad inventory.\n\nThe Fix: Audit your phone's Microphone Permissions. If an app doesn't need to listen to function (like a flashlight or puzzle game), revoke access. That is usually how the bridge is built.\n\nFor those wondering no, a VPN will not stop this. Since the tracking happens physically (sound waves hitting your microphone), no amount of encryption can block it.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1phcm75/with_the_wb_buyout_and_ad_tiers_watch_out_for/"
    },
    {
        "id": "1ph3ann",
        "author": "Dennis551103",
        "title": "Just finished SWAT. Does anyone have any good show recommendations?",
        "content": "I like anything car, police/fire, and history. If anyone knows anything good, that would be nice. I am currently watching the Sean “Diddy” Combs documentary and it is pretty good. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ph3ann/just_finished_swat_does_anyone_have_any_good_show/"
    },
    {
        "id": "1pgxuo4",
        "author": "Illustrious_Monk1523",
        "title": "Which episode of black mirror do you feel like represents best what is happening?",
        "content": "As one of the best and most popular shows on Netflix, I feel like Black mirror was spot on with predicting the future. Which episode do you feel like best represents what is happening right now in ou world ? ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pgxuo4/which_episode_of_black_mirror_do_you_feel_like/"
    },
    {
        "id": "1pgdpxe",
        "author": "Supermacropenis",
        "title": "The beast in me",
        "content": "Would it be wrong to suggest that the majority of the main events in this series were set in motion due to the fact that Nile Jarvis wanted a jogging path?",
        "upvotes": 32,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pgdpxe/the_beast_in_me/"
    },
    {
        "id": "1ph3tm0",
        "author": "elemenopes",
        "title": "Whaat should Netflix make a documentary on next?",
        "content": "With documentaries being so popular, what should Netflix make a documentary on next? \n\nI would love to see one about Sylvia Brown - the psychic on Montel Williams. \n",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1ph3tm0/whaat_should_netflix_make_a_documentary_on_next/"
    },
    {
        "id": "1pgsnpf",
        "author": "PatrikSelin",
        "title": "Netflix Playback Freezing in Safari on iPad (iPadOS 26.2)",
        "content": "Is anyone else experiencing issues with Netflix when using the Safari browser on an iPad Pro 11\" M5 (current: iPadOS 26.2)?\n\nI prefer using Safari over the native Netflix app because the picture quality is noticeably better. For about a month now, if I start playing a video, pause it, leave the app, and then return a little while later, the video freezes, but the audio continues without any problems.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pgsnpf/netflix_playback_freezing_in_safari_on_ipad/"
    },
    {
        "id": "1pgwrfp",
        "author": "twinflxwer",
        "title": "Bizarre deep voice glitch?",
        "content": "So I put on the Sabrina Carpenter Christmas special, and the audio was WAY off. It sounded like it went through a voice changer to make it super deep and echo-y. At first I thought it was part of a bit, then it continued after the first song so I paused it for a second to think about what was going on, resumed it, and the audio went back to normal\n\nThat was just…weird. Has anybody else ever seen this?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pgwrfp/bizarre_deep_voice_glitch/"
    },
    {
        "id": "1pgz44z",
        "author": "Funny_Koala_6088",
        "title": "Share Your Feedback on Netflix User Experience",
        "content": "I’ve read several posts that include complaints regarding recent user experience changes on Netflix. Some of the most annoying changes include loss of “remove from continue watching” and access to the details screen without starting a program or movie. I took the time to do a live chat with Netflix customer service. I asked them to pass my feedback along to their user experience design team. Here’s how you do this: \n\n1. Go to the official Netflix Help Center website.\n2. Scroll down to the bottom of the page.\n3. Look for the section that says \"Contact Us\" or \"Need more help?\"\n4. You should see an option to \"Start Live Chat.\" Click on this link.\n5. The website will guide you through a few quick steps (like signing in if you haven't already and selecting your issue) before connecting you to an agent in a pop-up window.\nThe chat option is generally available 24 hours a day, 7 days a week.\n\nIf enough ppl share feedback, they may be compelled to bring these features back. It’s worth a try!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pgz44z/share_your_feedback_on_netflix_user_experience/"
    },
    {
        "id": "1pgtla4",
        "author": "Available_Boat_99",
        "title": "One piece",
        "content": "So when I open one piece and start an episode it says last day to watch dec. 31st. Are they taking one piece off of Netflix Canada? I'm really confused because they just added a new season. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pgtla4/one_piece/"
    },
    {
        "id": "1pfrgbk",
        "author": "Large-Weight6213",
        "title": "Most pointless update ever: casting",
        "content": "Netflix has removed the ability to cast from our devices to our TV. I'm actually raging and wondering if this is just a trial, because even if this was a cash grab it does not even make sense.\n\nCasting is the only way I can watch shows with my partner. What is the point of even having a subscription in this case?",
        "upvotes": 236,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1pfrgbk/most_pointless_update_ever_casting/"
    },
    {
        "id": "1pfzosx",
        "author": "Odd_Campaign_2031",
        "title": "Diddy documentary- US jury system?",
        "content": "I’m watching the last episode of the Diddy doc and as someone not from the US, I’m quite confused by the whole jury thing.\n\nMy countrys legal system does not have juries, so to me it seems weird that 12 random people decided on Diddys fate and this case. Is there not a judge present or a team of judges that gets to decide the final verdict?\n\nI find the two jurors in the episode don’t seem that smart and like they could easily be coerced/ that their subjective values played a huge role in their decision. I always thought that the foundation of a solid legal system is that we have highly intelligent professionals who have been trained and educated for years, who chose to dedicate their lives to upholding the law, and have gone through a rigorous process to become a judge, making important decisions over people’s lives. So I’m quite shocked by the idea of just choosing random people from the general population, to make decisions like this..\n\nBut maybe someone can explain more about the legal side of how the jury system works and why it is in place in the US.",
        "upvotes": 74,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1pfzosx/diddy_documentary_us_jury_system/"
    },
    {
        "id": "1pfphza",
        "author": "perpetualsadnes1",
        "title": "Sean Combs: The Reckoning Documentary",
        "content": "What was your take on the documentary?\n\nWas anyone else absolutely livid at the jurors for what they were saying? I dont think justice was served at all.",
        "upvotes": 274,
        "comments": 274,
        "media": null,
        "permalink": "/r/netflix/comments/1pfphza/sean_combs_the_reckoning_documentary/"
    },
    {
        "id": "1pgwr84",
        "author": "ccmpiper",
        "title": "Where does Profile go on a Canceled “extra member”",
        "content": "Wondering where the canceled extra member profile goes. Is there a way to get it back into the original main users profile? Was was originally apart of the main account. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pgwr84/where_does_profile_go_on_a_canceled_extra_member/"
    },
    {
        "id": "1pghji1",
        "author": "AggravatingShow2028",
        "title": "What are your favorite Christmas RomComs at the moment?",
        "content": "I love this time of year Because all the sappy romcoms are on. I’m off today so I’m going to stay in my pajamas and watch movies and picture myself having a meet cute this holiday…I need inspiration! Best Christmas/holiday romcom?",
        "upvotes": 2,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1pghji1/what_are_your_favorite_christmas_romcoms_at_the/"
    },
    {
        "id": "1pggxjv",
        "author": "Bippy73",
        "title": "Jay Kelly (Spoilers)",
        "content": "This was easily one of my favorite movies this year.  Surprised at how much I enjoyed it. The acting was top-notch across the board, Clooney was brilliant, only I found Dern's constant complaining tiresome.  The sub plot between her and Sandler was unexpected, but definitely helped to really hammer home the theme of the movie.\n\nIn scrolling through some comments, I was wondering if we had watched the same movie. I think for some, if it is not an action-packed thriller, or maybe if you're younger, they can't stick with it. Curious to see if others see what I saw-  to me, this was a universal theme of looking back on life and assessing profound regret of choices made or the hand you are dealt.\n\nI think it was even more.  I took it that it is just fundamentally the human condition to not be happy.  Crudup, who is excellent, is the opposite side of the same coin as Clooney.  He has everything Clooney does not, yet Crudup is obviously filled with anger and regret.  Sandler &amp; Dern clearly regret their choices, despite saying otherwise.\n\nSaw some reviews talking about how this was too inside baseball of the movie industry.  To me, it's a universal theme that is so often the case in many people's lives. Anyone who travels for work, or is always at their home, but is absent either by constantly being at the office, whether mentally or physically.  Not showing up for family or friends in the sense of being truly present. You don't have to be a movie star millionaire to see money does not solve everything.  In fact, this movie proves it is just the opposite. You can have what everyone presumes is having won the lottery, but be profoundly lonely.\n\nIt is, at the end of the day, a sad movie.  Life is a game of choices, and it seems that everyone in this movie regrets theirs. So many people cannot reverse course.\n\nI said it's the movie version of the song Cat's in the Cradle.  I do think, though, it asks the question, if you did change course in life, would you really be happy?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pggxjv/jay_kelly_spoilers/"
    },
    {
        "id": "1pgnx3s",
        "author": "kanonkugle2111",
        "title": "Law and order special victims unit",
        "content": "Anyone here that knows why I seson 8 of special victims unit isnt on Netflix?  (I live in Denmark)\n\nI can only se seson 1-7 and then it skips seson 8 and goes Straight to 9\n",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pgnx3s/law_and_order_special_victims_unit/"
    },
    {
        "id": "1pgieng",
        "author": "Mucek121",
        "title": "Is The Crown and House of Cards  good shows ?",
        "content": "I need something to watch i think about  The Crown or House of Cards are   good shows ? anyone can give me mini review about this shows\n\n  \nThank you for answer",
        "upvotes": 2,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1pgieng/is_the_crown_and_house_of_cards_good_shows/"
    },
    {
        "id": "1pglt7z",
        "author": "sneakyslitherysnack",
        "title": "Blink Twice reference in Sean Combs The Reckoning",
        "content": "58 minutes into episode 4 “Blink again” Kirk Burrowes comments on how Diddy has shown violent behaviour since the 1992.\n\nHe goes on to say “it seems to be all of a sudden with Sean, and it isn’t. Some of it happened before our eyes. We blinked twice, and then we blinked again and were like “okay, I guess this is cool now.”\n\nIt struck me while watching it and reminded me of the movie Blink Twice, and how when it first came out there were conspiracies about it being loosely based around Diddy and/or Epstein.\n\nAfter seeing the series, and hearing ‘blink twice’ in an episode called blink again, I can’t help but think it was intentional to call attention to it and inadvertently confirm the conspiracy.\n\nDid anyone else pick up on this? I know I could be reading into it too much but 50 cent is his biggest hater and it wouldn’t suprise me if he would take the opportunity to throw shade wherever he can.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pglt7z/blink_twice_reference_in_sean_combs_the_reckoning/"
    }
]