[
    {
        "id": "1otauls",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 11,
        "comments": 1984,
        "media": null,
        "permalink": "/r/realmadrid/comments/1otauls/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1ox3ow4",
        "author": "WhiteWolf_08",
        "title": "Xabi Alonso after Mbappe's Injury:",
        "content": "",
        "upvotes": 889,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sw0um056i91g1.jpeg?auto=webp&amp;s=d6bcaa26fb5e814c381e84e23404a29524226092"
        },
        "permalink": "/r/realmadrid/comments/1ox3ow4/xabi_alonso_after_mbappes_injury/"
    },
    {
        "id": "1oxn0zp",
        "author": "Nalayakgadha",
        "title": "The most laughable Post of all time... Still haven't romoved it",
        "content": "",
        "upvotes": 30,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/imf3l3gnyd1g1.jpeg?auto=webp&amp;s=8a7b0af1a74187d2cf23542b77d4acab5094c2b4"
        },
        "permalink": "/r/realmadrid/comments/1oxn0zp/the_most_laughable_post_of_all_time_still_havent/"
    },
    {
        "id": "1ox0tjs",
        "author": "No-Independent2522",
        "title": "Thought r/realmadrid had wild takes… then I saw England fans.",
        "content": "",
        "upvotes": 330,
        "comments": 139,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7dufyfjez81g1.jpeg?auto=webp&amp;s=1473bcb0664048924d281449ad85fa6560ca2dbd"
        },
        "permalink": "/r/realmadrid/comments/1ox0tjs/thought_rrealmadrid_had_wild_takes_then_i_saw/"
    },
    {
        "id": "1oxehq5",
        "author": "Outrageous-Brain-395",
        "title": "Has Florentino Pérez surpassed Santiago Bernabeú's legacy at Real Madrid?",
        "content": "Do you think Florentino Pérez has surpassed Santiago Bernabeú as the most important president in the history of this institution? If you include everything, not just men's football, but like the basketball team and the creation of a women's team, I think he has done a lot for the club. The Bernabeú has been upgraded under his tenure, he's brought in Galácticos and won a lot of UCL trophies, in both his 1st and 2nd stint. Fans would always say, you can't replace Cristiano, or Kroos, or Modric, or Ramos, or Zidane, etc. but I think Pérez is probably going to be the one person we'll miss the most. We literally had to wait decades to go from Bernabeú to Pérez, I wonder how long until the next great Real Madrid president shows up.",
        "upvotes": 32,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oxehq5/has_florentino_pérez_surpassed_santiago_bernabeús/"
    },
    {
        "id": "1oxn9v2",
        "author": "dropmatlenayar",
        "title": "champions league nights aren't same without him",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mt7fe30c1e1g1.png?auto=webp&amp;s=fc3f5dd0de1213e65c3f68ea1d25fd018870429e"
        },
        "permalink": "/r/realmadrid/comments/1oxn9v2/champions_league_nights_arent_same_without_him/"
    },
    {
        "id": "1ox4aa2",
        "author": "Small-Ideal-5839",
        "title": "I rewatched Liverpool vs Real Madrid and I think we overreacted a bit 😬",
        "content": "\nAfter rewatching the match, a few things stood out:\n\n1. It wasn’t as bad as it first seemed.\nThe first half showed promising rotations and chance creation, but the final pass and finishing were missing. The players are still adapting to a system that requires composure on the ball, something easier to execute in La Liga than against high-intensity teams like Liverpool. We did manage to bypass their midfield often, but the end product wasn’t there.\n\n\n2. Old habits are hard to break.\nThis team is used to transition football, so shifting to a possession-oriented style will take time. Vini, for example, still looks to attack immediately rather than recycle play when needed. We need more patience instead of forcing every forward move into a chance.\n\n\n3. Arda Güler needs experience.\nHe had a decent first half despite small mistakes, but looked lost when shifted left after the break. I’d chalk that up to inexperience rather than pressure. While many fans see him as a No. 10, I still believe he’s better suited to developing into a deep-lying playmaker.\n\n\n4. Xabi experimented heavily in the second half.\nThe tactical tweaks didn’t come off because the players didn’t seem fully prepared for them. Güler looked uncertain, Rodrygo didn’t seem to know his role, and the defensive rotations (Fede dropping in, later Tchouameni) caused confusion rather than control. Xabi’s adjustments tried to solve one issue but created another, something normal early in a new coach’s cycle. The team simply needs more time to absorb his ideas.\n\n\n\nOverall:\nThe loss to Liverpool is just a small setback in a long-term project. What matters most is that Xabi keeps the dressing room. Despite negative leaks, I believe, he can still succeed. If he does, Real could dominate for another decade.\n\nHala Madrid.\n\n(Will add more thoughts after watching the Rayo Vallecano match.)",
        "upvotes": 73,
        "comments": 49,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ox4aa2/i_rewatched_liverpool_vs_real_madrid_and_i_think/"
    },
    {
        "id": "1owzo6p",
        "author": "Early_Ad_5386",
        "title": "Rated 10 league games of Ronaldo 11/12 so far.",
        "content": "Ratings: based on all actions\n\n  \nReal Madrid vs Real Zaragoza (A)—9.44/10\n\nReal Madrid vs. Getafe (H)—8.72/10\n\nReal Madrid vs Levante (A)—6.11/10\n\nReal Madrid vs Racing Santander (A)—6.58/10\n\nReal Madrid vs Rayo Vallecano (H)—9.66/10\n\nReal Madrid vs Espanyol (A)—8.59/10\n\nReal Madrid vs Real Betis (H)—8.03/10 \n\nReal Madrid vs Malaga (A)—10.32/10 (some 10-rated matches can go beyond 10 since no 10-rated matches are equal to each other)\n\nReal Madrid vs Villarreal (H)—7.44/10\n\n  \nStats:\n\nGoals: 10\n\nNPGs: 7\n\nBCC/QCC: 6\n\nKey passes with other good chance: 11\n\n\n\nWill do more ratings later.  :)",
        "upvotes": 115,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zchxe3aqr81g1.jpeg?auto=webp&amp;s=743d37c4d0cd4b4979567404c28d03f08484b7c5"
        },
        "permalink": "/r/realmadrid/comments/1owzo6p/rated_10_league_games_of_ronaldo_1112_so_far/"
    },
    {
        "id": "1oweur2",
        "author": "Jungkooks_bunny_ears",
        "title": "Kylian Mbappé reaches 400 career goals at 26 years old. He becomes the YOUNGEST player in the 21st century to reach 400 career goals.",
        "content": "",
        "upvotes": 2006,
        "comments": 145,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wwt4jm77n31g1.jpeg?auto=webp&amp;s=07167f2239aa0e24cba3132036e3f07cd40aef1f"
        },
        "permalink": "/r/realmadrid/comments/1oweur2/kylian_mbappé_reaches_400_career_goals_at_26/"
    },
    {
        "id": "1owv1k9",
        "author": "RM-PostMatchSurveys",
        "title": "[Post-Match Survey Results] Real Madrid 0-0 Rayo Vallecano",
        "content": "",
        "upvotes": 143,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2ygjs5qlt71g1.png?auto=webp&amp;s=7f1f523a867af9e54e7a8bfce8399abbcc1a13ba"
        },
        "permalink": "/r/realmadrid/comments/1owv1k9/postmatch_survey_results_real_madrid_00_rayo/"
    },
    {
        "id": "1owijuq",
        "author": "EndouShuuya",
        "title": "TODAY TRAINING INTENSITY! VAMOOOOOOOOSSSS!",
        "content": "",
        "upvotes": 145,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vrh7x7icf41g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1owijuq/today_training_intensity_vamoooooooossss/"
    },
    {
        "id": "1ow7jid",
        "author": "Gaengsa",
        "title": "Nico Paz vs Arda Guler 2025/26",
        "content": "",
        "upvotes": 447,
        "comments": 129,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0zfrfwon921g1.jpeg?auto=webp&amp;s=a22cc35d6e1459899b0f400216d15d6bb3c1b2c9"
        },
        "permalink": "/r/realmadrid/comments/1ow7jid/nico_paz_vs_arda_guler_202526/"
    },
    {
        "id": "1ow2biw",
        "author": "No-Independent2522",
        "title": "Bernabeu is set to host the first NFL game in Spain this Sunday",
        "content": "",
        "upvotes": 549,
        "comments": 79,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ow2biw/bernabeu_is_set_to_host_the_first_nfl_game_in/"
    },
    {
        "id": "1ownlhy",
        "author": "Blue_WaffIe",
        "title": "Valverde - Trent RW/RB",
        "content": "Both of these fine gentlemen can play on either position. People—myself included—have been complaining about the quality of our right flank. Trent deserves a chance in the team now. I would like to see us try a RW/RB overlap/interchange between Trent and Valverde. It would draw so much attention/confusion for the opposite defence trying to mark that.\n\nWholesome replies only pls xxx my uncle’s neighbour’s dog is critically ill, we’re all going through it rn. ",
        "upvotes": 32,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ownlhy/valverde_trent_rwrb/"
    },
    {
        "id": "1ows5ha",
        "author": "liarmkn",
        "title": "Real Madrid pre-match fan meet-ups UCL",
        "content": "Hello, after many years RM is coming to play in my country and since I'm probably never finding tickets for the match, does anyone know where they announce about these meet and greets (for pictures and autographs) like they do before matches? I want to know place and time or about where they're staying to even see them from far and I don't know where to go to find out. I have some information from some other madrid fan friends I have because they seem more involved, but they seem to know nothing about this. Also, about the tickets, do you know RM itself sells away tickets for ucl nights? Maybe if I can't find home tickets I can find away ones!? thhanks\n",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ows5ha/real_madrid_prematch_fan_meetups_ucl/"
    },
    {
        "id": "1ow0nss",
        "author": "TheFeatherDiaries",
        "title": "[Fabrizio Romano on X] : Vini Jr on Carlo Ancelotti : ''He is passing confidence, making everyone feel comfortable, taking advantage of each player’s best characteristics in their positions. He gives us peace of mind, making the work easier and everyone enjoys it.''",
        "content": "",
        "upvotes": 257,
        "comments": 79,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ow0nss/fabrizio_romano_on_x_vini_jr_on_carlo_ancelotti/"
    },
    {
        "id": "1ovs7s9",
        "author": "No-Independent2522",
        "title": "While every post here is about our great decline, enjoy a meme",
        "content": "",
        "upvotes": 750,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tfzom6pggy0g1.jpeg?auto=webp&amp;s=1a0b388abcf0dbae837d279f51cdfe468f274acc"
        },
        "permalink": "/r/realmadrid/comments/1ovs7s9/while_every_post_here_is_about_our_great_decline/"
    },
    {
        "id": "1ow1q85",
        "author": "cyrusmancub",
        "title": "Camavinga is out with injury for France’s match against Ukraine and is doubtful against Azerbaijan. It will be decided after tonight’s match whether he returns to Madrid.",
        "content": "",
        "upvotes": 90,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ow1q85/camavinga_is_out_with_injury_for_frances_match/"
    },
    {
        "id": "1ow0q9j",
        "author": "Lekanswanson",
        "title": "I think the board needs more criticism than they are getting",
        "content": "This post will probably be deleted but the truth is I think the board is much more to blame for the shit show than any individual player is and this isn't even me saying this because we lost one or two matches. People going crazy over one or two losses are overreacting but its a valid criticism to say that the way we lost certain matches have been very embarrassing as a supporter of the club. \n\nWhen we won the champions league and league last I don't even think we had the best players individually in the world compared to some other teams but we had a balance like no other. Vini and Rodrygo offered something different to Bellingham and Joselu. Kroos, Valverde and Tchouameni complemented each other and then you could rotate them with Camavinga and modric as needed. We had the ever reliable and professional Nacho and the beast Rudiger in the back Lunin was a positive surprise.\n\nBut the recruitment since that season has been poor and even though I criticized Ancelotti for what I perceived to be a lack of tactics i also realized just how difficult a job he had but still his inability to properly rotate and make early subs probably caused some of our injury issues. \n\nFor example, it took Kroos years of playing the same position to master it, he didn't become the Kroos we know overnight but for some reason we expect Bellingham who has shown he has a knack for getting goals and being a good poacher to suddenly become Kroos.\n\nWhen France won the world cup, there's a reason Giroud was a keypart, he offered a different dimension to the Mbappes and the griezmans but yet we signed Mbappe as a F1 car and expect him to play like a monster truck instead of maybe just signing the monster truck we needed.\n\nWe are asking Tchouameni to play like Kroos when that was never his game, that's like asking Casemiro to turn into modric, they are simply not that type of players but they allow those type of players to flourish.\n\nRamos was also prone to mistakes and stupid red cards early in his career but we expect Dean to become the Ramos we all remember when he was in his prime.\n\n\nBut in saying all this we are still top of the league even with all the flaws in the team and considering we have a manager thats still getting to know the team. Stop blaming individual players and instead blame the board for not properly rebuilding the team with the right players because expecting players to suddenly change their attributes to be a different player is not going to work. Mbappe will never be that type of striker, Valverde or. Bellingham will never be a dictator, Vini will never stop dribbling, Camavinga will never be a winger and Curtois will never be a ball playing keeper. Alonso has to find a way to get the best out of what he has and I trust he will and if we win even the league this year I'll be satisfied with that.",
        "upvotes": 74,
        "comments": 52,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ow0q9j/i_think_the_board_needs_more_criticism_than_they/"
    },
    {
        "id": "1owi4tt",
        "author": "bluefoxlive",
        "title": "Understanding Fede Valverde’s mindset - ‘What It Means to Play for Uruguay’",
        "content": "Original content. A short 3.5-minute documentary that helps explain something Madrid fans often mention about Fede Valverde: his mentality. A lot of pundits ask how he plays with such intensity every match, and understanding La Celeste’s culture gives some context to why he’s wired the way he is as a leader.   \n  \nHere’s the video if you’re interested on basically why Valverde plays the way he does. ",
        "upvotes": 8,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NXRxoQFdJ77X0hOKCZlkYzAijeXMZGKhR8zL1FbPl_E.jpeg?auto=webp&amp;s=114ee8484b291764731b6bed2903a03f3b1fdecd"
        },
        "permalink": "/r/realmadrid/comments/1owi4tt/understanding_fede_valverdes_mindset_what_it/"
    },
    {
        "id": "1ox4b0s",
        "author": "Fun-Beat-6332",
        "title": "Dominik Szoboszli Transfer Rumors",
        "content": "Quick question Madridistas, would yall take Dominik Szoboszli at our Club? Hearing that we are interested in yet another Liverpool player and this one comes as a surprise as I feel like he is a player that is fully committed to Liverpool but aye after all we are Real Madrid and we will continue to remain an attractive Club/ Destination as the years go by. Plus I think we can do something here by adding depth to our Midfield come next Summer 👀.",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ox4b0s/dominik_szoboszli_transfer_rumors/"
    },
    {
        "id": "1ovb6lf",
        "author": "soldier101br",
        "title": "Arsenal U16 players had the chance to meet the Madrid stars Vini Jr. and Rodrygo after the seleção training session",
        "content": "",
        "upvotes": 376,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ovb6lf/arsenal_u16_players_had_the_chance_to_meet_the/"
    },
    {
        "id": "1ov766u",
        "author": "ItsKBS",
        "title": "Toni Kroos on Arda Guler being his successor: \"I think he’s definitely a player you can build on for the future. But I don’t really like to make comparisons – Arda is a different type of player than I am. His best position is clearly more attacking, so it’s not really about being a successor.\"",
        "content": "",
        "upvotes": 460,
        "comments": 62,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1xd1x32w9u0g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ov766u/toni_kroos_on_arda_guler_being_his_successor_i/"
    },
    {
        "id": "1ov7lhb",
        "author": "TheFeatherDiaries",
        "title": "Beautiful Camera angle of Arda's last minute run vs Rayo Vallecano",
        "content": "",
        "upvotes": 378,
        "comments": 53,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jbp168w1du0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ov7lhb/beautiful_camera_angle_of_ardas_last_minute_run/"
    },
    {
        "id": "1ovf04e",
        "author": "PlantComprehensive77",
        "title": "It's honestly scary how predictable our attack is.",
        "content": "Just watched a La Liga video on all the goals we've scored so far in the 25/26 season, and I'm shitting my pants at how predictable our attack is. \n\n95% of the goals we've scored so far are either penalties or counter-attacks, with an occasional longshot. \n\n\\- We don't score from set pieces\n\n\\- We don't score headers\n\n\\- We barely score from crosses (low or high)\n\n\\- We don't score tap-ins\n\n\\- We don't score from possession play \n\nOur attack is so incredibly one-dimensional. We made a Liverpool defense that  got fucked in the ass by Haaland and Doku look like prime Milan. Anyone who thinks this type of attacking play is sustainable is mentally ill. ",
        "upvotes": 163,
        "comments": 107,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ovf04e/its_honestly_scary_how_predictable_our_attack_is/"
    },
    {
        "id": "1ovhki6",
        "author": "soldier101br",
        "title": "Vini Jr. And Carlo Ancelotti talking during the open training session of the Seleção",
        "content": "According to the Tati Mantovani,TNT Brasil repórter that covers Madrid in general and thats currently Covering the seleção during this National Duty,today was dedicated to more orientations Since the whole group got reunited now with the Arrival From PH,Fabrício Bruno and Vitor Roque,wich came late due to brasileirão Matches. In special, Ancelotti had 2 moments of direct orientation to Vini on this open training session. Still about the training session,The Team was divided in 3 groups to play the standard dummy circle,before moving to a more reserved Pitch on Arsenal Training ground. ",
        "upvotes": 123,
        "comments": 29,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/cwvb58ov5w0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ovhki6/vini_jr_and_carlo_ancelotti_talking_during_the/"
    },
    {
        "id": "1ov21vb",
        "author": "Violet_Kitty_room319",
        "title": "Carlo Ancelotti on Jude Bellingham's attitude",
        "content": "Lots of people have said this about Bellingham. The full interview was posted today on [The rest is football](https://www.youtube.com/watch?v=HbEhbOtwsvY), he also talks about player egos, the Brazil team, evolving his management style &amp; a bit about Xabi Alonso.",
        "upvotes": 734,
        "comments": 77,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/24vfcn1d2t0g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ov21vb/carlo_ancelotti_on_jude_bellinghams_attitude/"
    },
    {
        "id": "1ovd314",
        "author": "No-Independent2522",
        "title": "The club has unveiled a new corporate image for the Santiago Bernabéu stadium, featuring a logo that highlights the profile of the stadium’s futuristic exterior and shortens its name from Santiago Bernabéu to simply Bernabéu",
        "content": "",
        "upvotes": 96,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q0UeTD6ls1_zXTEdDW6y_dERjoKZmjf_YNfE7rCRHS0.jpeg?auto=webp&amp;s=cb673df8e17da75a419e1fbbdf515ad655cb8586"
        },
        "permalink": "/r/realmadrid/comments/1ovd314/the_club_has_unveiled_a_new_corporate_image_for/"
    },
    {
        "id": "1ouxr2z",
        "author": "More-Judgment-9253",
        "title": "Endrick Passing/ Central Play",
        "content": "Since they don't have any good attackers at Lyon endrick's definitely gonna be a starter, and he's most likely gonna be scoring a lot imo. I still don't think he can be a ST here for now though, he's gonna have to play on the RW.  \nCredit: Douba on twitter",
        "upvotes": 319,
        "comments": 67,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/p70yvg65qr0g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ouxr2z/endrick_passing_central_play/"
    },
    {
        "id": "1ov3615",
        "author": "Puzzleheaded-Delay60",
        "title": "This fanbase has become our own worst enemy and it needs to stop, we are all on the same team.",
        "content": "This club has arguably the worst fanbase when it comes to supporting our own players and backing the manager. Just look at other teams that are having a worst season than us, Liverpool literally won the league last season and now they have lost 6 games in a row and are out of the title race and yet I don't hear any slot out, sell this player and sell that player nonsense. \n\nWe only lost two games and drawn one so far this season but the way this fanbase is acting you would think we are in relegation. Everything seems blown out way of proportion and all its doing is feeding into the tabloids/medias hands to create a narrative about how the locker room is in disarray and all those clips in the Rayo game is just proving my point. Just wait until after the international break when we start to win games again how all these \"issues\" just vanish and all the xabi out and player fc hating fans go quiet, it happened after we lost to Atletico Madrid and we bounced back just fine. \n\nlosing to Liverpool in the champions league is not the end of the world as we are still in the top 8, all we need to do is learn from our mistakes and move on. We are so much better than last season, and yet still finding our new identity, its not perfect but we are heading in the right direction.",
        "upvotes": 93,
        "comments": 68,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ov3615/this_fanbase_has_become_our_own_worst_enemy_and/"
    }
]