[
    {
        "id": "1gpln2o",
        "author": "M4ds_hdg",
        "title": "What do you love about Casa?",
        "content": "https://",
        "upvotes": 87,
        "comments": 100,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pvb3hoe3bh0e1.jpeg?auto=webp&amp;s=5dcb84986ce615ff7ecfefd830c9c4d9504ca68c"
        },
        "permalink": "/r/Morocco/comments/1gpln2o/what_do_you_love_about_casa/"
    },
    {
        "id": "1gpxbca",
        "author": "thriwawayvyt",
        "title": "Im a native, born and raised Moroccan yet my arab is mediocre ",
        "content": "Title says it all, despite me being born snd raised here for my entire life, my arabic is extremely mediocre and bad, and it is a real pain in the ass for me, just wanted to see what yall think and if anyone relates 🥲\n\nEdit: i want to clarify i mean MSA, as in like ARABIC arabic, not darija",
        "upvotes": 15,
        "comments": 35,
        "media": null,
        "permalink": "/r/Morocco/comments/1gpxbca/im_a_native_born_and_raised_moroccan_yet_my_arab/"
    },
    {
        "id": "1gpuprx",
        "author": "y0ss3f_lach1r1",
        "title": "Cornflakes with Moroccan Tea ? ",
        "content": "Have you ever try cornflakes with tea instead of milk ? ",
        "upvotes": 19,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/odmzzfqy6j0e1.jpeg?auto=webp&amp;s=806e46b88dac5b4b8dbbab3f432eefdc87778971"
        },
        "permalink": "/r/Morocco/comments/1gpuprx/cornflakes_with_moroccan_tea/"
    },
    {
        "id": "1gpvcl5",
        "author": "Signal_Check5234",
        "title": "English studies ",
        "content": "Shno n9drr ndir b ijaza f English studies mn ghir t3lim",
        "upvotes": 15,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5rt0dcukbj0e1.jpeg?auto=webp&amp;s=e9d0bf11b650ef036d692624f783df2dc9c39cf7"
        },
        "permalink": "/r/Morocco/comments/1gpvcl5/english_studies/"
    },
    {
        "id": "1gpwfkn",
        "author": "RJIX69",
        "title": "A must visit place in Morocco. Guess the location?",
        "content": "",
        "upvotes": 11,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/31izrce8jj0e1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/Morocco/comments/1gpwfkn/a_must_visit_place_in_morocco_guess_the_location/"
    },
    {
        "id": "1gpqth0",
        "author": "Acceptable_Joke_4711",
        "title": "Any fragrances enthusiasts in here?",
        "content": "Rise up!",
        "upvotes": 22,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/s9ozkugnei0e1.jpeg?auto=webp&amp;s=bebffdb40043a7f4cdf2e7983a370d54060fcdc6"
        },
        "permalink": "/r/Morocco/comments/1gpqth0/any_fragrances_enthusiasts_in_here/"
    },
    {
        "id": "1gpha50",
        "author": "Vorghul",
        "title": "Morocco to License Starlink in 2025, Bringing High-Speed Internet to Remote Areas Ahead of the 2030 World Cup",
        "content": "",
        "upvotes": 96,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w7mbwpgk0g0e1.png?auto=webp&amp;s=f72b83f3544b4d6f64bc4074fe72f0ca1b58e70e"
        },
        "permalink": "/r/Morocco/comments/1gpha50/morocco_to_license_starlink_in_2025_bringing/"
    },
    {
        "id": "1gpp64m",
        "author": "kurayami7",
        "title": "Dark-skinned moroccans how's your average experience in our society? ",
        "content": "I'm coming from a very mix family in every term. We got white people married to darkskinned people and I never thought that colors was a thing in our society nowadays. Whoever the more I engage in our society the more I just discover the opposite and I'm like what?? 😂\n\n I had people in meetings, in hanging outs, or in groups where they literally found nothing better to discuss than my color?\n\nToday me and few people mentioned how vitamin D is necessary for women and that we must be exposed to sun from time to time, i got a comment from a guy telling me u're already dark what are u going for. \nWhen I was attending uni I got even hated because of my skin color, I just brushed it off at that time thinking it's funny or just a joke. \n A family related to me told me recently that he was praying Jamaah and he was the imam, someone passed by and literally was mocking  telling others why they approved of a black person to be their imam in salah and everyone there laughed. \n\nFellow dark skinned people how do u guys react? I just laugh it off mainly cz i'm used to lot of comments about other stuff so everything is been normalized for me, but thinking about other people being in my situation! i'm really afraid they would be hurt deeply, people honestly should watch out for their manners. ",
        "upvotes": 24,
        "comments": 47,
        "media": null,
        "permalink": "/r/Morocco/comments/1gpp64m/darkskinned_moroccans_hows_your_average/"
    },
    {
        "id": "1gpxfgx",
        "author": "Moroccanarab",
        "title": "What is this and is it even true??? ",
        "content": "Genuinely interested in this because it's the only Almohad map that is this big",
        "upvotes": 9,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lry4kw98rj0e1.jpeg?auto=webp&amp;s=9e5cfd04a5fd208bbb4dd63be925329c77658159"
        },
        "permalink": "/r/Morocco/comments/1gpxfgx/what_is_this_and_is_it_even_true/"
    },
    {
        "id": "1gplaoi",
        "author": "illnesz",
        "title": "New official Morocco home and away kits for AFCON 2025",
        "content": "",
        "upvotes": 41,
        "comments": 22,
        "media": null,
        "permalink": "/r/Morocco/comments/1gplaoi/new_official_morocco_home_and_away_kits_for_afcon/"
    },
    {
        "id": "1gpeclq",
        "author": "bootyslayer69xo",
        "title": "I took this pic a few years back I think you guys would love it ",
        "content": "",
        "upvotes": 143,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/r6orgbtexe0e1.jpeg?auto=webp&amp;s=93f18003b18a84200d2305acb50514928d20ffa4"
        },
        "permalink": "/r/Morocco/comments/1gpeclq/i_took_this_pic_a_few_years_back_i_think_you_guys/"
    },
    {
        "id": "1gpidze",
        "author": "Dream_2828",
        "title": "Is it just me or are middle aged/Elderly women just MEAN? ",
        "content": "Let me start off by saying I know it’s not everyone but haven’t you guys noticed that there is this category of middle age / senior women that are just so rude , mean, bitter and resentful? \n\nI’ve had so many instances where they were completely rude to me and they think that it’s okay because they’re old and should be respected. \n\nFor instances: \n- I used to go and feed the pigeons at this park, I used to do this a lot, never had a problem. Sometimes people enjoy it so much that they ask me to give them or their kids food to give to the pigeons themselves. But then there was this one lady (40-50s) that would just nag me down under the excuse that the pigeons moved the dust in the ground and it affected her. This was only her and also if it was that bad she could’ve easily changed her bench there was plenty of room. Couple weeks later my mom saw her nagging at some poor kid trying to play with his bicycle. \n\n- Another incident at the gym, this was just yesterday, I came early and decided that I was going to stand in the front row during my class. This old lady started interrogating me ( do you study or work , where do you work , what is your job, is it your first time cause I never saw you before ) then she proceeded to say you know we’re a group of ladies that always take the front rows it’s just that most of us are not hear today… WTH? So ? Was she offended that I stood near her in the front row?\n\n- there was another incident where it turned out much worst . Some lady tried to stop me from using the pool cause I didn’t have a hair cap. Hear me out I know I messed up but 1. My hair cap broke minutes before my class and 2. She herself was not respecting the rule , she didn’t have her goggles on which is also a rule and 3. I came to notice that they were swimming next to a DEAD COCKROACH and I didn’t hear one complaint about that? Which says to me that they don’t care about the hygiene they just care about ruining someone’s day. \nthere are so many other instances, There was one girl at the gym (it’s an all womens gym so we wear what we want ) and they literally started bullying her just because she looked good and in an even worst scenario there was a girl at my gym where 2 old women bullied the hell out of her bc she accidentally took a picture of herself and they were in the frame. She deleted it but they wouldn’t stop. The girl was a 16 year old with apparently some heart disease so she ended up fainting. Her mom and some guy from her family came screaming at the end the police had to get involved cause it got so bad! \n\nMy mom told me that the reason for this resentful and bitter behavior could be cause they feel like they waisted their entire youth and when they see someone that still has time and is enjoying their life they like to suck that out of them. Tbh , I’m starting to believe that to. I even overheard a conversation between them at the gym showers. I kid you not , they were literally talking about how they wasted their life always sacrificing too much for their kids until “nsaw 7althom “and now the kids are gone living their lives while their sick and old , unlike “lbnat dial had generation li mazal chadin f rasshom. “\n",
        "upvotes": 34,
        "comments": 77,
        "media": null,
        "permalink": "/r/Morocco/comments/1gpidze/is_it_just_me_or_are_middle_agedelderly_women/"
    },
    {
        "id": "1gpw9pq",
        "author": "RJIX69",
        "title": "The Moroccan Kaftan",
        "content": "",
        "upvotes": 5,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/i0xb5bc1ij0e1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/Morocco/comments/1gpw9pq/the_moroccan_kaftan/"
    },
    {
        "id": "1gptb6t",
        "author": "monster_cardilak",
        "title": "\"E-commerce pyramid scheme\" ",
        "content": "I was invited by a friend to go to so called free formation in e-commerce, their bureau looked legit with all those shiny quotes and stuff, but as he started giving the speech, he started talking briefly about how hard to get money but its easier using Ai in commercing, selling products, the first lesson is free but after that you gotta pay 1000dh just to show you \"the tricks\" of how to make ads on Facebook, but the catch is you have to buy the pack of cosmetic products from them and resell, it costs 6000dh and you have to hring 3 more. By now me and you know how it goes, i left there after a long debate with him in front of all those greedy brainless there. \n\nI was just wondering if there is any way i can shut them down? Does police take this matters seriously? ",
        "upvotes": 6,
        "comments": 23,
        "media": null,
        "permalink": "/r/Morocco/comments/1gptb6t/ecommerce_pyramid_scheme/"
    },
    {
        "id": "1gpzp37",
        "author": "ElBadir",
        "title": "Freedom of speech",
        "content": "What y’all think of freedom of speech in morocco , like the ilyass el maliki case , do you consider it as a violation of his freedom of speech and he was a victim of a poor legal system, or do you consider it hate speech ( totally legal in countries like usa) knowing that he didn’t incite into violence . Personally i think it’s a violation of freedom of speech , he should be cancelled not jailed . ",
        "upvotes": 3,
        "comments": 20,
        "media": null,
        "permalink": "/r/Morocco/comments/1gpzp37/freedom_of_speech/"
    },
    {
        "id": "1gpjfb5",
        "author": "Adventurous-Basket35",
        "title": "GTA V facture 🧾 ",
        "content": "2013 🥹",
        "upvotes": 25,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/43gorw7aqg0e1.jpeg?auto=webp&amp;s=772ff1b32672f06c86cc17044bebf177ac50fd8d"
        },
        "permalink": "/r/Morocco/comments/1gpjfb5/gta_v_facture/"
    },
    {
        "id": "1gpnrv6",
        "author": "[deleted]",
        "title": "The home renovation culture in Morocco ",
        "content": "We're about to do some renovations in our home, and while I was looking for inspiration models, I noticed that in Europe or US, many people prefer to do renovations/home makeovers themselves, that includes painting, wallpaper, fixing door frames, new floors... While in Morocco we have the habit of calling the \"experts\" for the smallest task. \n\nI think DIY gives a nice feeling of accomplishment, and being proud of the work you've done, but unfortunately we don't have this culture.\n\nNB : I'm including here plumbing or electrical task that must be done by a specific technician, even though they can be done if you have the necessary knowledge &amp; tools.\n",
        "upvotes": 13,
        "comments": 19,
        "media": null,
        "permalink": "/r/Morocco/comments/1gpnrv6/the_home_renovation_culture_in_morocco/"
    },
    {
        "id": "1gpskk1",
        "author": "Busy_Tax_6487",
        "title": "Why doesn't Morocco not have a metro?",
        "content": "Wouldn't it be smart to have one especially with such big events coming up?",
        "upvotes": 6,
        "comments": 46,
        "media": null,
        "permalink": "/r/Morocco/comments/1gpskk1/why_doesnt_morocco_not_have_a_metro/"
    },
    {
        "id": "1gpyrwf",
        "author": "renotsthgindim",
        "title": "Hey, my friends and I are coming to Morocco and our host requested us to send him pictures of the passports to prepare a contract that will help us to pass the gates at the airport. Is this normal procedure?",
        "content": "",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/Morocco/comments/1gpyrwf/hey_my_friends_and_i_are_coming_to_morocco_and/"
    },
    {
        "id": "1gpoilp",
        "author": "Ambitious-Lion1412",
        "title": "What are your best places to catch sunsets in Rabat? ",
        "content": "",
        "upvotes": 9,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9gd7dkzqxh0e1.jpeg?auto=webp&amp;s=410eac9ec11169a98530758385cf4e6915b2f1f6"
        },
        "permalink": "/r/Morocco/comments/1gpoilp/what_are_your_best_places_to_catch_sunsets_in/"
    }
]