[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 12,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 46,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1kyrn8k",
        "author": "gracieb_1",
        "title": "streaming not working?",
        "content": "can’t watch netflix on any devices (tv, ipad, phone, computer, etc). it’s not our account or our wifi. is anyone else having this issue? we’ve troubleshot multiple times and contacted support, but they say that it’s not showing any issues.",
        "upvotes": 1307,
        "comments": 1049,
        "media": null,
        "permalink": "/r/netflix/comments/1kyrn8k/streaming_not_working/"
    },
    {
        "id": "1kyri1s",
        "author": "Alextheseal_42",
        "title": "Can’t watch anymore episodes of Dept Q??",
        "content": "So I started watching Dept Q today (in the US) where all episodes are supposed to be available as of today. Get to the end of episode two and it won’t continue, saying I cannot watch it anymore. When I go to look up the series all that’s there is the trailer. What????\n\nEdit: glad to know I’m not alone but still sucks. I can watch other stuff on Netflix but seems like many others can’t. Ahhh technology. 🤦🏻‍♀️ ",
        "upvotes": 456,
        "comments": 820,
        "media": null,
        "permalink": "/r/netflix/comments/1kyri1s/cant_watch_anymore_episodes_of_dept_q/"
    },
    {
        "id": "1kyevkp",
        "author": "jerkoff1610",
        "title": "Anyone else tired of the four-year-long wait between seasons of Stranger Things, where kids don't look like kids anymore?",
        "content": "They all look so different now! Weren't they supposed to be 16-17 in season 5??\n\nAlso, correct me if I'm wrong, but isn't Erica, who btw just graduated high school and is an adult now, supposed to be THIRTEEN in season 5????\n\nApparently, they have pushed the release date for season 5 to 2026. This is just crazyyy!!!  \n",
        "upvotes": 931,
        "comments": 213,
        "media": null,
        "permalink": "/r/netflix/comments/1kyevkp/anyone_else_tired_of_the_fouryearlong_wait/"
    },
    {
        "id": "1kz2kjz",
        "author": "GoatRawFirePeak",
        "title": "Lost in Starlight",
        "content": "Came out today! This is the first korean animated film i’ve seen - looked like a shinkai film.\n\nBit of a slice of life feel, but romance and scifi heads will love this. Music was amazing. ",
        "upvotes": 13,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kz2kjz/lost_in_starlight/"
    },
    {
        "id": "1kyrvmj",
        "author": "ZirfyGaming2727",
        "title": "Error Code 2-0, \"This title is not available to watch instantly. Please try another title.\"",
        "content": "It's on an Apple TV. I've already restarted Netflix, restarted the TV, and all that hullabaloo. It still gives me the same answer. Somebody please help me, I just wanna watch Vinland Saga. \n\nWhy does technology hate me so\n\nEdit: They fixed it",
        "upvotes": 83,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1kyrvmj/error_code_20_this_title_is_not_available_to/"
    },
    {
        "id": "1kynijb",
        "author": "ComradeRedsky",
        "title": "Ozark years later.",
        "content": "Way behind the times here I've just started Ozark, meant to start it during lockdown however watched breaking bad and narcos Mexico instead, some people put me off Ozark however I'm loving the characters and the slow build up of the story. Anyone  watched it, any views,,, don't tell me the ending of course..",
        "upvotes": 61,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1kynijb/ozark_years_later/"
    },
    {
        "id": "1kyowd1",
        "author": "jerkoff1610",
        "title": "How Netflix got James Lewis to finally speak about the Tylenol murders in new doc",
        "content": "Netflix released a new doc called Cold Case: The Tylenol Murders. It's about the 1982 case where seven people died after taking cyanide-laced Tylenol in the Chicago area. It's still unsolved, but the wild part is they got James Lewis, the only official suspect for decades, to finally talk on camera before he died. He was never charged for the murders, but did serve time for sending a ransom letter. He had refused every major interview, but he agreed to do this one. They gave him the space to talk about his side of the story.\n\nIt is sooo strange how no one thought about approaching him like this before. And if they did, why didn't he talk? It's so bizzare. ",
        "upvotes": 33,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1kyowd1/how_netflix_got_james_lewis_to_finally_speak/"
    },
    {
        "id": "1kyrq24",
        "author": "BizzyM",
        "title": "Everybody's Live with John Mulaney has gone missing.",
        "content": "I couldn't watch it live last night, so I'm trying to watch it tonight and the whole series is gone.  It's missing from my Continue Watching.  it's missing from My List.  And I can't find it in search.",
        "upvotes": 21,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1kyrq24/everybodys_live_with_john_mulaney_has_gone_missing/"
    },
    {
        "id": "1kz4jzz",
        "author": "Spare_Blacksmith_816",
        "title": "Theater movies streamed on Netflix vs other services",
        "content": "Is there any analysis on which streaming service shows the most theater released movies?  Seems like Netflix is more and more about their own productions and we see fewer and fewer streams of Theater movies.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kz4jzz/theater_movies_streamed_on_netflix_vs_other/"
    },
    {
        "id": "1kz96yd",
        "author": "Realistic_Library309",
        "title": "Watched true beauty again after 3 years",
        "content": "Not a k drama fan but I really love that one drama which is true beauty . I watched it again after 3 years. It felt like I am watching it for the first time. Missing previous 2 days when I was just lost in that drama. Everything is feeling empty after finishing it .\n Can someone suggest more dramas like true beauty. It can be korean or anything.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kz96yd/watched_true_beauty_again_after_3_years/"
    },
    {
        "id": "1kyr6et",
        "author": "VixenSunburst",
        "title": "Netflix TV UI has changed - anyone else??",
        "content": "I personally hate it, things are too big and rounded now for no reason. Makes things much harder to look at, actually.\n\nMy phone's Netflix hasn't changed. If there is a way to revert it on TV, it'd be great to know. In the meantime I suppose I'll check to turn off auto-update on my phone. ",
        "upvotes": 14,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1kyr6et/netflix_tv_ui_has_changed_anyone_else/"
    },
    {
        "id": "1ky84ax",
        "author": "theipaper",
        "title": "Dept Q is the best police procedural Netflix has ever made",
        "content": "",
        "upvotes": 159,
        "comments": 240,
        "media": null,
        "permalink": "/r/netflix/comments/1ky84ax/dept_q_is_the_best_police_procedural_netflix_has/"
    },
    {
        "id": "1kyuleb",
        "author": "Tudorrosewiththorns",
        "title": "What show had an awesome first season then went off the rails?",
        "content": "I love The Chilling adventures of Sabrinas first season. It was god tier vibes and I loved it but everything after that was cringe AF. \n\nNo I haven't watched Riverdale and didn't know anything about it. It clearly wasn't my cup of tea. ",
        "upvotes": 7,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kyuleb/what_show_had_an_awesome_first_season_then_went/"
    },
    {
        "id": "1kys6y4",
        "author": "Previous-Rip-7104",
        "title": "NETFLIX IS BACK UP",
        "content": "WERE FREE! Netflix is back up and running they didn’t waste no time fixing whatever the problem is I hope we all go back to enjoying our shows! We made it yall LMAO😂😂😂",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kys6y4/netflix_is_back_up/"
    },
    {
        "id": "1kyyayr",
        "author": "Robemilak",
        "title": "Netflix Teases Major 'One Piece' Reveal at Tudum Event",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kyyayr/netflix_teases_major_one_piece_reveal_at_tudum/"
    },
    {
        "id": "1kytw3g",
        "author": "Sudden_Pop_2279",
        "title": "ALL OF US ARE DEAD Season 2 Reportedly Begins Filming This Summer",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kytw3g/all_of_us_are_dead_season_2_reportedly_begins/"
    },
    {
        "id": "1kz79bz",
        "author": "Milk_Man9696",
        "title": "What to watch",
        "content": "Hey everyone! I'm trying to decide what to watch next and would love some input. These are the shows I’m considering:\n\n* Black Sails\n* Rectify\n* Arcane\n* The Last Kingdom\n* Blue Eye Samurai\n\nIf you’ve seen any of these, which one would you recommend I start with—and why? I’m into strong storytelling, great characters, and engaging plots. Thanks in advance!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kz79bz/what_to_watch/"
    },
    {
        "id": "1kyvse4",
        "author": "sadjn",
        "title": "Android TV new layout/ UI",
        "content": "the new layout on netflix android tv app is a very bad, anybody knows work around for this? the old layout was good, why did they change something that's not broken?",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1kyvse4/android_tv_new_layout_ui/"
    },
    {
        "id": "1kyzr2n",
        "author": "Fit_Connection_3267",
        "title": "Recommendations for an Empowering watch",
        "content": "Hi Netflix buddies! I’m currently facing a decision fatigue on what to watch on Netflix because of the wide varieties of shows and movies available. I have decided to give myself an hour of time to watch something nice daily so I’m looking for some recommendations that are empowering and also make you smarter/wiser while doing so. Have you watched something that made you sense a shift of energy within yourself? Made you a better person or even just motivated you in whatever aspect to do better? Please recommend me one title to watch and how it made a difference in your life. Thank you ❤️",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kyzr2n/recommendations_for_an_empowering_watch/"
    },
    {
        "id": "1kyruz7",
        "author": "I_am_a_fishyy",
        "title": "Did Wednesday disappear for anyone else?",
        "content": "I was trying to watch Wednesday with my family, but it was gone. But we were watching the day before, and it wasn't gone. I searched it in the Roku search tab, and it went to Netflix, then it just said something like. \"This title isn't available to watch insanely try again later\" please help.      ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1kyruz7/did_wednesday_disappear_for_anyone_else/"
    },
    {
        "id": "1kyrp94",
        "author": "Heavy_Mental76",
        "title": "Squid Game removed?",
        "content": "I was watching Squid Game last night and tonight (on S1E8, was going to start E9) but when I clicked to go to the next episode, Netflix instead started playing the first episode of The Rookie.  I tried refreshing, but Squid Game is gone from the Continue Watching section.  Seriously?",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1kyrp94/squid_game_removed/"
    },
    {
        "id": "1kyr477",
        "author": "Existing_Wrangler_69",
        "title": "Sirens Finale",
        "content": "Question about the finale: SPOILERS AHEAD.\n\nThe last time we see of Simone and Peter on the beach is Simone saying \"I don't even want to work here anymore. I have to tell you something.\" Then later, when Simone is telling Devon what happened between her and Peter, she says that Peter said, \"I have to tell you something, I think I'm in love with you.\" This makes me believe it was really her that said this to Peter. She knew there was no chance of reconciliation with Kiki and she wanted to remain at the house using whatever means necessary. (She's young and attractive and Peter is over his wife and probably high so he goes along with it.) Simone looks like the victim, but she's really the one in control. Thoughts??",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kyr477/sirens_finale/"
    },
    {
        "id": "1kyxemy",
        "author": "Deep_Fly_4773",
        "title": "The Residence: Detective Cupp and Mr. Park duo",
        "content": "Is it just me or I want them to have more deeper relationship together haha the bond!!! I cannot their too funny, but at some point I want to ship them 😭🔪 I even wrote a scene of them haha which is unlikely 😂\n\nEdwin suddenly stepped out from the car and immediately went around it and opened the door for Ms. Cupp while she was putting his mackerel gift for her flight. She leaned on it as he opened it, and she gave him that decent look, like how he looks at her when he always interrupted her interviews. However, it was a bit more with higher eyebrows and felt like there's a question in her eyes, \"what's this supposed to be about?\" She utter in her mind. \n\nThey were at the airport, and Mr. Park asked her, \"Don't you have a suitcase?\" \"What am I, on vacation?\" She replied. \"Right, okay. Bye... have a good flight? Good... morning? See you, bye, bye now, for now.\" \n\nShe gave him that look and turned around and walked away. After three steps, she went to him and smiled while her hands were in her pockets. \"That's a bit off. Why is she smiling?\" He thought.\n\n \"I had a really great time solving this case,\" she said and added, \"Not with you, by the way.\" He smiled. After that, she slowly came closer to him, not being sure how she would do it, but she gave him a peck on his cheek and said, \"Goodbye.\" For her, it was just a kiss of gratitude, saying that she really had a great time with him, not all the time, perhaps. \n\nBut for him, it was a bit off, and felt like she's not herself. \"That's a bit off, why is she smiling?\"",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kyxemy/the_residence_detective_cupp_and_mr_park_duo/"
    },
    {
        "id": "1kytpe4",
        "author": "EffectiveHat2724",
        "title": "Lifetime accounts.",
        "content": "Anyone still has any of these accounts? I have two accounts for over 10+ yrs .. never any issues. All of sudden.. one account signs me out and I need to login and add a payment method. Is that account SOL? My other account is still going on with no issues. Both were started at the same time. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kytpe4/lifetime_accounts/"
    },
    {
        "id": "1kxwgqn",
        "author": "EmptyPocketsXotics",
        "title": "A Deadly American Marriage",
        "content": "I'm finishing up watching this documentary and came across an interesting tidbit. At 1:06:00, Molly is talking about having voice activated recording devices in different parts of the house, including one behind the headboard in the bedroom. How is it this was conveniently not brought up during any part of the trial? Does anyone have any info on this?",
        "upvotes": 95,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1kxwgqn/a_deadly_american_marriage/"
    },
    {
        "id": "1kyid1u",
        "author": "emslo",
        "title": "Survival of the Thickest: The dress.",
        "content": "You know the dress I'm referring to! There's a two-episode arc built around this dress. The set up is that it will be earth-shatteringly original, flattering and gorg. And it is *deeply meh.* Looks like anything you'd pull off the rack at a discount dress shop. \n\nMichelle Buteau, who did you so wrong?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kyid1u/survival_of_the_thickest_the_dress/"
    },
    {
        "id": "1kyiz9n",
        "author": "running_supbiotch",
        "title": "Ginny &amp; Georgia",
        "content": "Are there any shows like Ginny and Georgia, Dead to Me, Breaking Bad (Couldn't get into better call Saul for some reason, like El Camino), In the Dark, Alone (reality) I'm a reality junkie 100%, and any documentaries worth watching.\nThanks for any and all input :)",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1kyiz9n/ginny_georgia/"
    },
    {
        "id": "1kxx2qz",
        "author": "stellacampus",
        "title": "Yes I know \"Pig\" sounds insane, but if you haven't seen it you really should.",
        "content": "Yes, Nic is way over the top, but it somehow works here - I think this has to be considered one of his best performances.  The story line does not sound like something anyone would be interested in, and yet it ends up being fairly compelling.  It's a really good, odd little movie that you might like if you give it a chance.",
        "upvotes": 48,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1kxx2qz/yes_i_know_pig_sounds_insane_but_if_you_havent/"
    },
    {
        "id": "1kylx1p",
        "author": "zdenstrn",
        "title": "\"Remind me\" on TV",
        "content": "Ok so I just got the new layout. What I am really missing is \"Coming next week\", \"Coming in 2 weeks\" etc. I was surprised that in \"My Netflix\", theres even the section \"Reminders you have set\". But I dont know where to find upcoming shows to set the reminders. Am I just plain dumb or what?\n\nUsing LG TV, by the way.",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1kylx1p/remind_me_on_tv/"
    },
    {
        "id": "1kyq5uk",
        "author": "Cautious-Diamond-334",
        "title": "Adolescence Season 2",
        "content": "I got attached to this universe, I really wanted there to be a sequel. I found the series very short. There were many things that could be explored further (Like Katie's family's point of view, for example).",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kyq5uk/adolescence_season_2/"
    }
]