[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 9,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 58,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lb51pl",
        "author": "clevertulips",
        "title": "Why is Cobra Kai series considered good… universally bad acting, gratuitous nonsensical fight scenes every 5 seconds… ?!",
        "content": "Genuinely, I’m amazed that people rave about this series.  The cringe factor is off the charts,  most of the time, and the despair to be anything like Karate Kid is truly laughable considering just how bad the writing is. What the heck??",
        "upvotes": 101,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1lb51pl/why_is_cobra_kai_series_considered_good/"
    },
    {
        "id": "1lb2dwe",
        "author": "Sufficient-Paint-534",
        "title": "PLEASE GIVE ME SEASON 2 OF DEPT Q !",
        "content": "Okay what an amazing amazing show. Loved it. Last episode did feel a little rushed inspite of how dragged out the earlier episodes were ? Like there was so much happening. Few things I need to clarify though-\n\n1) Why did Rose say William saw Lyle on the ferry and got scared ? She meant William saw the man with the cap and not that he identified Lyle considering both lingaard siblings couldn't have remembered how Lyle Jennings looked like now\n2) Lyle acts extremely stupid when he's with his mom. Is this something to do with being abused? Because it is a little difficult to believe he pulled off all those crimes\n3) they never show the motive behind why Lyle targeted Sam. Was that because he ran in similar circles with Merritt or he just wanted to get back at Sam for punching him. Also, did Lyle pretend to be Sam H to know Merritts whereabouts or was he eventually going to know because he was stalking her.",
        "upvotes": 59,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1lb2dwe/please_give_me_season_2_of_dept_q/"
    },
    {
        "id": "1lb9lnq",
        "author": "Noggiesformynoggin",
        "title": "Please recommend me a mystery movie/series which has elements of comedy",
        "content": "I love murder mysteries which have a touch of comedy! Though I feel I’ve watched them all? The series I’ve watched are-\n\nMurder Mystery (1&amp;2)\nOnly murder in the building (just as an example Ik it’s not on Netflix lol)\n7 women in a murder\n\nThank you!!",
        "upvotes": 4,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1lb9lnq/please_recommend_me_a_mystery_movieseries_which/"
    },
    {
        "id": "1lbbaiv",
        "author": "Wyldstallyn80",
        "title": "Fubar",
        "content": "Just watched series 2 of Fubar and this might not be a popular opinion but Guy Burnet could be a dark horse for the next James Bond, good looking, right age range and he managed to give his character a certain suaveness. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lbbaiv/fubar/"
    },
    {
        "id": "1lb4q4k",
        "author": "Stunning_Magician495",
        "title": "Sirens - what was the point of the 3 ladies (Astrid, Chloe and whoever)",
        "content": "I binged the season, I’m still left with questions but the one that still irks me was, what was the point of these 3 ladies? Was it to show that they are just tick bored woman like 3 blind mice? The scene where they are shopping with Devon also made no sense? They talk about their willpower to project and get whatever they want, did Michaela find these ladies and get them these rich husbands? Was it voodoo? \n",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lb4q4k/sirens_what_was_the_point_of_the_3_ladies_astrid/"
    },
    {
        "id": "1latq5n",
        "author": "Worldly-Abrocoma2999",
        "title": "Fine I'll say it! FUBAR needs more love",
        "content": "https://preview.redd.it/lvt5xa5qyr6f1.jpg?width=1569&amp;format=pjpg&amp;auto=webp&amp;s=a9ee7e69cfb3e256134d64da44faaaca7936e5aa\n\nI don't understand why everybody is hating on FUBAR. It's the definition of a light summer watch. I personally love all of the punny jokes and references to arnold's past movies as well as the father daughter dynamic. Some people are acting like the shows goal was to be the next mission impossible or something like that. It's clearly not. Plus, I absolutely love the trope of \"will they? won't they?\" between Emma and Aldon. ",
        "upvotes": 29,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1latq5n/fine_ill_say_it_fubar_needs_more_love/"
    },
    {
        "id": "1lb7up5",
        "author": "JuryRevolutionary624",
        "title": "Will there be a season 3 of fubar",
        "content": "I really loved the two season of fubar and leaving the end with a cliffhanger and season 2 definitely exceeded my expectations and it was so good that I am rewatching from the first season again \nWould definitely love an another season tho",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lb7up5/will_there_be_a_season_3_of_fubar/"
    },
    {
        "id": "1lb0q81",
        "author": "The_crazy_bird_lady",
        "title": "Where is the coming soon section?",
        "content": "Trying to find the coming soon section on this new update on my tv.  I can't find it anywhere.  Did they remove it?\n\nSo far not loving the update.  Now it's like all the other streaming services that I dislike.  I find it way more frustrating to find something to watch.",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lb0q81/where_is_the_coming_soon_section/"
    },
    {
        "id": "1lbcihf",
        "author": "simdog6294",
        "title": "Dept Q ferry link took too long",
        "content": "I liked the series Dept Q except for one glaring problem. It seemed obvious much earlier than the final episode that Harry Jennings death was linked to Merritt's disappearance yet it took the team a long  time to finalize this conclusion. I found it hard to suspend disbelief that two people from the same small town Mhor both disappearing off a ferry would not be a huge story where news people would not be poking around and interviewing Ailsa right after the kidnapping. Then for Morck and company not to press harder when first trying to talk to Ailsa I find it hard to believe they would just leave Mhor without talking to her first. Just seemed like they should have figured this out way earlier. \n\nSecondly the police chief of Mhor disappears and no one goes looking for him? I know small town but pretty sure when investigating crimes you radio in where you are going and even then him going missing would have triggered an immediate response which would have included pinging his cell phone. Not really believable it would take more than a few hours. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lbcihf/dept_q_ferry_link_took_too_long/"
    },
    {
        "id": "1lbb31i",
        "author": "AnimatorNo8686",
        "title": "Netflix is broken on PC",
        "content": "I have two PC's, a better and an older one. On the better the quality is normal, but it keeps jumping back a few seconds (2-3 seconds) while I'm not even touching anything. On the older one the quality is unwatchable most of the time, even with a 30 MB/s network, and the same jumping back problem is happening here too. Why is it so broken why can't I just watch my movie?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lbb31i/netflix_is_broken_on_pc/"
    },
    {
        "id": "1lb9hcv",
        "author": "Glittering_South3125",
        "title": "How to remove gta banner from home screen",
        "content": "https://preview.redd.it/y7st9z6dgw6f1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=c9644dc0761b61023da7667106970fc05ccf16fc\n\nhow the hell can i remove this from my main screen, i never played game from netflix never clicked on any game why is this showing up on my screen how can i remove it",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lb9hcv/how_to_remove_gta_banner_from_home_screen/"
    },
    {
        "id": "1laor8b",
        "author": "KatieCat435",
        "title": "Does anyone have the ad-supported plan? Is it actually \"less than you might think?\"",
        "content": "There are a few shows and movies I wanted to watch on Netflix, so I was thinking of renewing my subscription. I am actually not new to Netflix- I am a long time user (I got the DVDs in the mail in 2009), so needless to say the price change is CRAZY compared to 10+ years ago. The flair was necessary to ask the question. Anyway, I ditched the subscription last year because I just wasn't using it, but after a nice break I wanted to come back. The price difference between ads and no ads is large enough that I am considering getting the basic ad-supported version, but I wanted to know how bad the ads are. Is it tolerable? How often and how long are they? ",
        "upvotes": 27,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1laor8b/does_anyone_have_the_adsupported_plan_is_it/"
    },
    {
        "id": "1lb69oa",
        "author": "RoundCalligrapher147",
        "title": "Ginny and Georgia season 3",
        "content": "Why was this season so delayed? It took quite a while for it to actually come out. Austin looks so old when ginny looks the same. They just never actually gave a full reason as to why it was actually delayed.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lb69oa/ginny_and_georgia_season_3/"
    },
    {
        "id": "1lb5wpk",
        "author": "Many-Refuse-6060",
        "title": "Picture in picture not working on standard plan, how do I fix this?",
        "content": "I have a standard Netflix plan without ads, and PiP was working on my old phone, and still works on my parents phone and ipad. \n\nMy phone seems to be the problem, but my PiP works on every other streaming app. I've already downloaded the Netflix app multiple times and nothing's changed, so idk what to do.\n\nAny advice on how to fix this?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lb5wpk/picture_in_picture_not_working_on_standard_plan/"
    },
    {
        "id": "1lb5th1",
        "author": "Solid_Cause1130",
        "title": "I dont receive one time pass code",
        "content": "Why can’t I receieve one time passcode? Forgot my pass but cant reset it since i dont receive one time passcode for a day now.\n\nAll of the account connected to my netflix, got logged out.\n\nHelp meee pls.\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lb5th1/i_dont_receive_one_time_pass_code/"
    },
    {
        "id": "1lauf4j",
        "author": "thisforealtho",
        "title": "TheResidence: WHY DIDNT LILY JUST MOVE THE CLOCK",
        "content": "In what universe is sneakily boarding up a door that is obviously week known and widely used a better idea than moving the damn clock or better yet, cleaning it and putting it back its original spot?? The final showdown happens Months after the actual crime, and she’s obviously heavily redecorating the White House in the meantime… there would’ve been easy / ample opportunity to move it - or at the very least, to go in there and clean the blood and fingerprints off the weapon. Felt way too easy and honestly out of character for a smart character like her to do that…  \nIn general, otherwise I liked the show, even it felt a bit slow and repetitive I parts… could’ve been a a 4 part series imho. This thing with the clock really bothered me in the end ! ",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lauf4j/theresidence_why_didnt_lily_just_move_the_clock/"
    },
    {
        "id": "1lb300o",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix’s New 'Ghostbusters' Animated Series Revealed at Annecy with Ben Hibon as Showrunner",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lb300o/netflixs_new_ghostbusters_animated_series/"
    },
    {
        "id": "1lawtw3",
        "author": "akagiaa",
        "title": "Anne with an E",
        "content": "Guys can't there be any petition or anyth be done to bring back Anne with an E ? Like I miss that show so much and so many questioons are left unanswered. We can't be left cliff hanger. That show was too good. It's still on my favourite show list. Especially Ka'kwet! I feel so bad for her. That storyline of her was something very emotional😭😭",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lawtw3/anne_with_an_e/"
    },
    {
        "id": "1lau75d",
        "author": "Atlast_2091",
        "title": "Squid Game: Season 3 | Final Games Trailer | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lau75d/squid_game_season_3_final_games_trailer_netflix/"
    },
    {
        "id": "1layc4m",
        "author": "kaylazomg",
        "title": "I didn’t think I’d find myself here… I miss the cast on Millionaire Secret.",
        "content": "I started watching out of amusement, but quickly knew this was going to be good entertainment. \nA week after finishing the series and I find myself missing the cast and their unique characters and their interactions and bonds with everyone. It felt like a very special group of people coming together! ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1layc4m/i_didnt_think_id_find_myself_here_i_miss_the_cast/"
    },
    {
        "id": "1lapnp6",
        "author": "CommercialWest5",
        "title": "Straw",
        "content": "At the beginning of the movie, Janiyah was dropping off her daughter at school, she waved at the teacher and the teacher looked at her like she was crazy. Did anyone else pick up on this? At that moment, did you know something was up?",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lapnp6/straw/"
    },
    {
        "id": "1l9wag6",
        "author": "ggroover97",
        "title": "Netflix Users Say They Dislike New Layout; Research Says Otherwise",
        "content": "",
        "upvotes": 455,
        "comments": 169,
        "media": null,
        "permalink": "/r/netflix/comments/1l9wag6/netflix_users_say_they_dislike_new_layout/"
    },
    {
        "id": "1lacr5p",
        "author": "Sweaty-Toe-6211",
        "title": "Ted Danson Reveals Wife Mary Steenburgen Is Playing His Love Interest in Man on the Inside Season 2: ‘We’re Nauseatingly in Love’",
        "content": "",
        "upvotes": 29,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lacr5p/ted_danson_reveals_wife_mary_steenburgen_is/"
    },
    {
        "id": "1lazzwl",
        "author": "tnakd",
        "title": "Account Email Keeps Getting Changed",
        "content": "It's like every month my Netflix account email address keeps getting changed. I've changed email accounts, used random arse passwords, and contacted support. Last support chat, last month, they just opened up a new account. This month, no one logged in on any of my devices so it's not malware/compromised network on my end. So WTH?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lazzwl/account_email_keeps_getting_changed/"
    },
    {
        "id": "1lav828",
        "author": "messengers1",
        "title": "AMA with the Composer, Carlos Rafael Rivera from Dept Q",
        "content": "AMA will take place at 3PM PST/11PM UTC on June 21 at r/deptq",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lav828/ama_with_the_composer_carlos_rafael_rivera_from/"
    },
    {
        "id": "1lac44y",
        "author": "Atlast_2091",
        "title": "The Diplomat: Season 3 | Official Teaser | Netflix",
        "content": "",
        "upvotes": 25,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lac44y/the_diplomat_season_3_official_teaser_netflix/"
    },
    {
        "id": "1lb6koz",
        "author": "TheMirrorUS",
        "title": "I'm a TV critic and I recommend these 3 chilling Netflix documentaries to everyone",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lb6koz/im_a_tv_critic_and_i_recommend_these_3_chilling/"
    },
    {
        "id": "1laxfzk",
        "author": "Marionberry-Current",
        "title": "Families Like Ours",
        "content": "Please someone tell me it gets better. I was down with the plot until episode four/five and now I actually can't stand how much I hate one of the main characters. I don't want spoilers, but if it's just gonna be insufferable decisions the rest of the series I'd rather exit now.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1laxfzk/families_like_ours/"
    },
    {
        "id": "1lb4yqw",
        "author": "garampani03",
        "title": "Removal of device without acknowledgement",
        "content": "So my friend has been using my netflix for pretty long time, about an year or so. Due to some reasons I don't want her to use it anymore. I asked her subtly to stop using my account but she didn't stop and is still using it. I don't have the guts to outright say this to her. Is there a way i can remove her device without her knowing?? (Idk if the user is informed when their device is removed or not, so if that can be done, pls let me know)\nIf not, give me some good excuse. I was thinking of telling her \"I'm terminating my account for now 'cause I've to focus on my studies and stuff and alongside I'll also save some money\" type shit and remove her. Will this work. If no please give me a way, i need to stop this bs",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lb4yqw/removal_of_device_without_acknowledgement/"
    },
    {
        "id": "1lavpdc",
        "author": "DonkGoblin",
        "title": "Need Help Finding a Lost Show!",
        "content": "I remember watching a show on Netflix a while back. I believe it was an animated anthology (not Love Death &amp; Robots).\n\nThere was an episode with a medieval army marching towards a farmhouse where a farmer stood with a pitchfork. There is a thunderous rumbling and a giant stomps towards him, picks him up and crushes him in his hand while his wife and baby are hiding in the house. \n\nI cannot find the show or episode for the life of me. Does this ring a bell to anyone? Did I just imagine this? Fever dream perhaps? Let me know if you know which show im talking about! ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lavpdc/need_help_finding_a_lost_show/"
    }
]