[
    {
        "id": "1imqu4z",
        "author": "BunyipPouch",
        "title": "Join us tomorrow (Tuesday 2/11) at 3 PM ET for a live AMA/Q&amp;A with Gints Zilbalodis, director/animator/writer of the Oscar-nominated film 'Flow'.",
        "content": "",
        "upvotes": 54,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vuz6m8z3yfie1.jpeg?auto=webp&amp;s=82b37ffa03223ed6dea5187a762b8bf7dfc255d5"
        },
        "permalink": "/r/movies/comments/1imqu4z/join_us_tomorrow_tuesday_211_at_3_pm_et_for_a/"
    },
    {
        "id": "1imixm4",
        "author": "SanderSo47",
        "title": "February 7-9 Box Office Recap: 'Dog Man' was still #1, but collapsed 62%, one of the steepest drops for an animated film. 'Heart Eyes' had a fine start with $8.3M, while 'Love Hurts' flopped with just $5.8M. In China, 'Ne Zha 2' becomes the first ever film to make $1 billion in one country.",
        "content": "https://preview.redd.it/7mjckxzmzdie1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=018f6af12666b3411065658a7cfdf54c2cfcb950\n\nUnsurprisingly it was a quiet weekend due to the Super Bowl.\n\nWhile this is hailed as one of the best Super Bowl weekends post-COVID, it gets less great when you read between the lines and see how most of these films floundered. ***Dog Man*** easily held the top spot, but it's looking clear that the film is proving to be front-loaded. Two newcomers dared to open on the weekend and it was a mixed bag; ***Heart Eyes*** had a fine start, while ***Love Hurts*** flopped.\n\nBut the real story was in China, where ***Ne Zha 2*** broke the $1 billion barrier in the country alone. A feat never accomplished before.\n\nThe Top 10 earned a combined $46.4 million this weekend. That's up a massive 59% from last year, when ***Argylle*** topped a slow weekend while ***Lisa Frankenstein*** flopped.\n\nDreamWorks' ***Dog Man*** stayed on top on its second weekend, adding $13.8 million this weekend. That represents an awful 62% drop from last weekend, which is one of the steepest for an animated film. That's almost on par with *Lightyear* (64.1%) and only a bit better than *The Simpsons Movie* (66.1%).\n\nWhile the Super Bowl often causes films to have larger-than-usual drops, ***Dog Man*** was already looking iffy before the weekend started. The film had a colossal 91.3% drop on Monday (animated films usually drop 70%, with 80% or higher in extremely rare scenarios), a feat not seen before on a major animated film. The Friday-to-Friday drop was horrible (70%), and Saturday's was also bad (52%). Basically, if ***Dog Man***'s Sunday had a similar drop to last week, its second weekend drop would still be $15.41 million, which would mark a 58% drop. Even with the Super Bowl, the film should have dropped 50% at worst.\n\nThrough 10 days, the film has earned $54.2 million domestically. We predicted a $150 million domestic run, but that's just not feasible now. Depending on how it holds next week against ***Paddington in Peru***, there's a strong chance that ***Dog Man*** could finish with less than $100 million domestically, making it one of the most front-loaded animated films ever.\n\nSony's ***Heart Eyes*** debuted with $8.3 million in 3,102 theaters. That's much better than last year's ***Lisa Frankenstein*** ($3.8 million), another rom-com horror. It's not that far off from last month's ***Wolf Man*** ($10.8 million) either.\n\nThat's a solid start, especially considering the rom-com and horror combo does not have the bext track record at the box office (***Warm Bodies*** is a rare exception to the rule). In an attempt to boost the box office, Sony lifted the review embargo a week earlier and it paid off; it's currently at a pretty good 80% on RT. A sign that couples could show up.\n\nAccording to Sony, it was equally split between men and women, and 63% was 25 and over. 40% of the audience were couples. They gave it a middling \"B–\" on CinemaScore, which isn't that bad for a horror title. It should hold well next week thanks to Valentine's Day, and it could finish with around $25 million domestically.\n\nIn third place, Universal's ***Love Hurts*** flopped with just $5.8 million in 3,055 theaters. That's a very poor start, managing to debut even below ***Nobody*** ($6.8 million), which was released in very bad conditions. \n\nThe film was sold basically as a perfect antidote to the typical rom-com; how about adding action to the mix? While intriguing, the trailers offered solely action scenes without any interesting story in sight. The audience watches movies like this for the action scenes, but they still need an interesting story to come along. Ke Huy Quan made a comeback with ***Everything Everywhere All At Once***, but it's clear his name cannot open a movie. And neither can his co-star Ariana DeBose, who is coming off a huge string of critical and commercial duds. The reviews (18% on RT) were the final nail in the coffin.\n\nAccording to Universal, 54% of the audience was male, and 50% was in the 18-34 demographic. The only thing that hurts more than those reviews is the audience's reviews: they gave it a poor \"C+\" on CinemaScore, which is a dead sentence for an action movie. With poor reception and competition on the way, the film is set to finish with less than $15 million domestically.\n\n***Mufasa*** was barely affected by the Super Bowl. It eased just 36%, grossing $4 million this weekend. That takes its domestic total to $235.2 million.\n\n***Companion*** fell all the way to fifth place, adding $3 million this weekend. That's a horrible 68% drop; even for Super Bowl weekends, that drop is larger-than-usual. Through 10 days, the film has earned $15.4 million, and it won't make it much further than $20 million domestically.\n\nIn sixth place, Sony's ***One of Them Days*** dropped 52%, earning $2.8 million. The film's domestic total stands at $39.2 million, and it should close with around $45 million domestically.\n\nThe documentary ***Becoming Led Zeppelin*** had an impressive debut, despite just playing in 369 theaters. It hit the seventh spot, earning $2.5 million this weekend. This made it the biggest IMAX debut for a concert film.\n\n***Flight Risk*** dipped 53%, adding $2.5 million this weekend. The film has amassed $25.1 million and should finish with around $30 million domestically.\n\nParamount's ***Sonic the Hedgehog 3*** dropped 45%, for a $1.7 million weekend. The film has earned $233.1 million domestically.\n\n***Moana 2*** rounded up the Top 10 with a 44% drop, adding $1.6 million. With this, the film has amassed $456.1 million.\n\nSearchlight's ***A Complete Unknown*** is slowing down, after dropping 47% and adding $1.2 million this weekend. The film has earned $68 million so far.\n\nSony expanded Best Picture nominee ***I'm Still Here*** into 704 theaters, but the film made barely $1 million this weekend. The film has made $2.2 million so far.\n\nNeon re-released Bong Joon-ho's ***Parasite*** in 193 screens. The film made $356,727, taking its lifetime total to $53.7 million domestically.\n\n#**OVERSEAS**\n\nAlright, the real deal is here. ***Ne Zha 2*** has crossed $1 billion in China alone. Not content with breaking so many opening weekend records, the film is now the highest grossing film in any country. And it's just getting started; it's projected to hit at least $1.5 billion, and could get close to $2 billion in China alone. Absolutely bonkers. Makes you wonder what \"impossible\" record can be broken next.\n\n***Mufasa*** added $8.5 million this weekend, taking its worldwide total to $671 million. The best markets are France ($40.5M), the UK ($37.7M), Germany ($30.5M), Mexico ($30M) and Italy ($23.5M). \n\n***Paddington in Peru*** added $7.5 million this weekend, crossing $100 million overseas. It's hitting North America this weekend.\n\n***Dog Man*** is failling to attract interest in the rest of the world. The film earned $6.6 million this weekend from 41 markets, taking its worldwide total to $66.2 million. Sounds good, except it isn't. $4 million of that money came from the UK, which means it flopped in pretty much every other market. It's clear this is gonna massively skew domestically.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Gladiator II* | Nov/22 | Paramount | $55,034,715 | $172,438,016 | $461,598,753 | $250M\n\n- 24 years in the making, ***Gladiator II*** has closed with $461.5 million worldwide. The fact that it's slightly above the original ***Gladiator*** is impressive. Less impressive is that its budget was $250 million, putting the break-even point far higher. Despite middling audience response, the film still held well enough, finishing with a 3.13x multiplier. Definitely a flop, but you can't say it didn't go out without a fight.\n\n#**THIS WEEKEND**\n\nMarvel is back in theaters.\n\nThe film is ***Captain America: Brave New World***, the 35th film in the MCU, and the first with Anthony Mackie as Captain America. To boost the film, Marvel got Harrison Ford attached as Thaddeus Ross, who transforms into Red Hulk. Despite some bad press over the past years, the film has launched a successful marketing campaign and pre-sales are looking good as of now. The only question left is if the film will deliver quality.\n\nIt's Valentine's Day weekend, and there's a British icon returning to the big screens. That's ***Bridget Jones: Mad About the Boy***, the fourth installment. This franchise has been the most profitable rom-com ever, with all films accumulating to $756 million worldwide. It's gonna make a killing in theaters... except in North America. As the franchise has lost power in the country (the third film made just 11.4% of its money in North America), Universal has decided to send the film to Peacock instead. But this is a very powerful franchise that it can survive this.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 45,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p7hZl6OKNLPGMiq4kVQEGltUJhBhL_ks1T0nTAoFklU.png?auto=webp&amp;s=64ee0c37896c1307844d053dc05b6cb66e1ebe08"
        },
        "permalink": "/r/movies/comments/1imixm4/february_79_box_office_recap_dog_man_was_still_1/"
    },
    {
        "id": "1imh555",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for A24’s ‘Friendship’ Starring Tim Robinson &amp; Paul Rudd",
        "content": "",
        "upvotes": 22270,
        "comments": 913,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ifk944o1ndie1.jpeg?auto=webp&amp;s=b9c63c43c8ba34df6a729b5c649039c54f9ff7ed"
        },
        "permalink": "/r/movies/comments/1imh555/official_poster_for_a24s_friendship_starring_tim/"
    },
    {
        "id": "1im775y",
        "author": "Amaruq93",
        "title": "\"Tom and Jerry\" at 85: The duo's first of many hits in 1940 and how their theatrical shorts have withstood the test of time",
        "content": "",
        "upvotes": 5989,
        "comments": 229,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yFf2_9tH7D6KKIbQlpqil8YLMIxOS5D7J8sEdbSWVJ8.jpg?auto=webp&amp;s=b2e767fc790f20f39716895e41c606a4510c6dd0"
        },
        "permalink": "/r/movies/comments/1im775y/tom_and_jerry_at_85_the_duos_first_of_many_hits/"
    },
    {
        "id": "1imlcvm",
        "author": "MarvelsGrantMan136",
        "title": "Peter Navy Tuiasosopo Dies: Honda in ‘Street Fighter' &amp; ‘Necessary Roughness' Actor Was 61",
        "content": "",
        "upvotes": 619,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cqVohzpwfgf7FxvrfverViRgtiIcvwjL_oT5DkbImvM.jpg?auto=webp&amp;s=99ae1dc4c34e6b6ef96870a5500d1cf88b070429"
        },
        "permalink": "/r/movies/comments/1imlcvm/peter_navy_tuiasosopo_dies_honda_in_street/"
    },
    {
        "id": "1imifh6",
        "author": "ezikial2517",
        "title": "The Other Guys end credits go hard in today's economic climate",
        "content": "I rewatched The Other Guys for the first time since it came out, and I liked it way better than the first time I saw it. In 2010 I was kind of Will Ferrell'd out after being a big fan in the Anchorman era. \"Aim for the bushes\" is an all-timer, Michael Keaton kills it, and I had a blast whenever Ray Stevenson was on screen (RIP). However, the biggest impact for me was the end credits. \n\nSince the main plot point revolves around financial fraud, the credits are a series of infographics displaying the basics about Ponzi schemes, government bailouts, and CEO compensation contrasted to worker salaries. These numbers have only ballooned further in the last decade and a half, as have the societal frustrations. It was a really clear and effective way to get a message about class inequality across at the end of a great action comedy.\n\nFor anyone who hasn't seen it or doesn't remember much about it, it's definitely a solid watch, and it's under 2 hours, which is always appreciated.",
        "upvotes": 582,
        "comments": 75,
        "media": null,
        "permalink": "/r/movies/comments/1imifh6/the_other_guys_end_credits_go_hard_in_todays/"
    },
    {
        "id": "1imdyhi",
        "author": "NoCulture3505",
        "title": "'Masters Of The Universe' Adds Morena Baccarin as Sorceress, Jóhannes Haukur Jóhannesson as Fisto",
        "content": "",
        "upvotes": 844,
        "comments": 164,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/shI-600FkjLwLlQ7vRkqYD7UdqAEMbsq5eFpqviCjUY.jpg?auto=webp&amp;s=444293a6cc0fa6c31367ba7fe3add0a3f59a2326"
        },
        "permalink": "/r/movies/comments/1imdyhi/masters_of_the_universe_adds_morena_baccarin_as/"
    },
    {
        "id": "1imik4o",
        "author": "Wonder-Lad-2Mad",
        "title": "The Northman (2022) is everything I could have asked for in a viking epic + incredibly gorgeous to look at.",
        "content": "I just finished seeing this movie, I remember when it came out two years ago, but for some reason I didn't pay it much heed. I wish I went back to undo it. Oh this movie is incredible. As the title says, I was extremely satisfied with what I got. Culture, magic, myth, violance.\n\n\nAnd it has that usual Robert Eggers weirdness and silliness that everyone loves.\n\n\n\nWhat can I say about the story? A well played out revenge epic. I love how creepy the whole thing feels. Idk why but I felt like things kinda started getting wobbly near the third act. It wasn't bad enough to damper my enjoyment.\n\n\nI love the atmosphere of this movie, really creepy and pagan feeling. I love how the supernatural element is consistant through the movie but really lowkey and eerie. Always just crouched in the background.\n\n\nThe acting was great, the music was great, the cinematography was artistic af. I loved the shooting location, the long shot scenes are so good.\n\n\nThis was totally Shakespearean right? I realized the guy is called Hamlet and he meets three witches that tell him his fate.\n\n\nThe moment that cemented my opinion and the climax of the movie for me was definitely the &gt;!Valkyrie escape dream!&lt;. What an incredible visual.\n\n\n\nAlso, a lot of things in this story reminded me of Berserk. The whole revenge plot, the savegry, the creepy magic, the protagonists journey etc.",
        "upvotes": 395,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1imik4o/the_northman_2022_is_everything_i_could_have/"
    },
    {
        "id": "1imbpv8",
        "author": "MarvelsGrantMan136",
        "title": "Christopher Nolan’s ‘The Odyssey’ Casts Jesse Garcia &amp; Will Yun Lee",
        "content": "",
        "upvotes": 733,
        "comments": 165,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CjapNJEyNBKHJprOGwmpudQYndV4fUWBSOl8H3FhOX0.jpg?auto=webp&amp;s=fab8d1e462d1c3edb4b08a9d42468c6d56995a7e"
        },
        "permalink": "/r/movies/comments/1imbpv8/christopher_nolans_the_odyssey_casts_jesse_garcia/"
    },
    {
        "id": "1imciur",
        "author": "NoCulture3505",
        "title": "New Concept Art for 'Avatar: Ash And Fire' Revealed",
        "content": "",
        "upvotes": 641,
        "comments": 216,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1pvwiKJhiySPnphu3_-FqzDPHPB5PMkyAQe6X0L12IY.jpg?auto=webp&amp;s=0e26629ded7943bdd78371333cea7fe76874db3c"
        },
        "permalink": "/r/movies/comments/1imciur/new_concept_art_for_avatar_ash_and_fire_revealed/"
    },
    {
        "id": "1imkgvn",
        "author": "Odd_Advance_6438",
        "title": "Real Steel (2011) fucking rocks",
        "content": "The more I think about it, the more I enjoy this movie. It’s a little cheesy, but it’s such a fun film. Love Hugh Jackman in everything, but all the other actors are pretty good too.\n\nTakes a fun premise of robot boxing and actually makes movie. Usually something like this would just be really dumb, but it appeals to the ape part of my brain that just wants to see cool robots hit each other.\n\nAlso surprisingly sincere. I point to this movie whenever people claim Shawn Levy hasn’t made anything good",
        "upvotes": 175,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1imkgvn/real_steel_2011_fucking_rocks/"
    },
    {
        "id": "1imns84",
        "author": "Prof_Tickles",
        "title": "Texas Chainsaw Massacre (1974) is an apocalyptic film just as much as it is horror.",
        "content": "Texas Chainsaw Massacre is, aside from the obvious slasher/exploitation flick, a film about the decay of society and the breakdown of systems.\n\nListen to the radio news broadcasts: Grave-robbing, murder, cholera epidemic, city wide fires, suicide, building collapses, oil reserves burning, and heat waves with no end in sight.\n\nNotice how *nothing* goes right or according to plan.\n\nSally wants to check on a relatives grave, only to be led off by a stranger. Franklin cannot take a piss without getting hurt. They pick up a hitchhiker, he’s bad news. They want to go see the old family house, it’s condemned. They want to go swimming, the swim hole dried up. They want gas, there isn’t any. Franklin and Sally want to drive away, the keys are gone because Jerry took them. The Sawyers need food, it’s scarce so they resort to cannibalism. The Sawyers dinner doesn’t go over well, etc.\n\nSystems are breaking down. \n\nThe authorities are incompetent, linking the grave robbing to an organized crime ring on the west coast - according to the radio broadcasts.\n\nBut perhaps the biggest most important system which is shown breaking down, the family unit.\n\nThe Hardesty’s are a dysfunctional family. Sally is annoyed with and burdened by her invalid brother. \n\nMirroring that dysfunction is the Sawyer family. Composed of three brothers and a centarian grandfather. Wrought with abuse, mental illness, and poverty.\n\nNo semblance of a nuclear family. \n\nYou see, art is, always has been, and always will be reflective of the times it was produced in. TCM was created at the height of Vietnam, the first energy crisis, Watergate recently happened so distrust in authority was at an all time high, and the youth of the 60’s witnessed their decade end with the Manson Murders. Which terrified a nation and arguably robbed a generation of its innocence way too early.\n\nThe fears of a terrified nation, the sense of doom and hopelessness, bleeds through this film.\n\nIt’s arguably the quintessential apocalyptic film.",
        "upvotes": 99,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1imns84/texas_chainsaw_massacre_1974_is_an_apocalyptic/"
    },
    {
        "id": "1ilxhg1",
        "author": "MWH1980",
        "title": "Really disliked how Kingsman blew its setup in the sequel. They “Men In Blacked” it in the worst way.",
        "content": "Both Kingsman and MIB’s first film brings in new blood, and we have a seasoned veteran getting out of the way so the newer generation can take the next steps forward.\n\n…and then in the sequel, they decide to sideline the new guy, and bring back the old one as the lead, let alone just disassemble so much of what was set up already.\n\nI feel there are other films that pull this in their sequels. Can anyone name any others?",
        "upvotes": 5643,
        "comments": 749,
        "media": null,
        "permalink": "/r/movies/comments/1ilxhg1/really_disliked_how_kingsman_blew_its_setup_in/"
    },
    {
        "id": "1im147p",
        "author": "exophrine",
        "title": "Poster for Marvel's THUNDERBOLTS*",
        "content": "",
        "upvotes": 2345,
        "comments": 566,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lhoctwkhq9ie1.jpeg?auto=webp&amp;s=f2a57c4d908964808d74a9ddbed80bd8abb36a17"
        },
        "permalink": "/r/movies/comments/1im147p/poster_for_marvels_thunderbolts/"
    },
    {
        "id": "1imn5do",
        "author": "CosmosisJones42",
        "title": "What’s the Most Unforgettable Experience You’ve Ever Had at the Movies?",
        "content": "I think the cinema is sacred. Some of my best memories have been based around a theatre. I used to work at a theatre in High School and it was some of the best times of my life. There were so many good times back then, which lead me to thinking: What’s the most unforgettable experience you’ve ever had at the movies?\n\nFor me, it was the opening night of The Avengers with my closest friends. The theater was completely packed, and the energy in the room was unreal. People were cheering, clapping, and reacting to every big moment like we were at a live event. It wasn’t just about watching a movie, it was about sharing an experience with an entire crowd of people who were just as hyped as we were to see the culmination of the first phase of the MCU.\n\nThat’s what I love about the theater experience. There’s something special about seeing a movie with a group of strangers who are all there for the same reason. Midnight premieres, surprise audience reactions, that moment when you realize you’re watching something truly great, those are the memories that stick with you.\n\nI’ve heard stories from people who were there for The Empire Strikes Back in 1980 and were able to experience the biggest twist in Cinema History firsthand. I've heard others talk about theaters full of people running out of the theater for The Exorcist. Some of my best experiences have been at the cinema, First dates, nights with the homies, and catching a movie on a hot day to cool off. For me, I live for the summer movie season where there's a new blockbuster every week. I love being hyped up for a film and then being able to see it with a packed audience.\n\nSo, what’s yours? What movie experience will you never forget?\n\nEDIT: Grammar",
        "upvotes": 74,
        "comments": 354,
        "media": null,
        "permalink": "/r/movies/comments/1imn5do/whats_the_most_unforgettable_experience_youve/"
    },
    {
        "id": "1immhbp",
        "author": "WaterMargin108",
        "title": "Ke Huy Quan breaks down his 7 favorite action scenes, from 'Indiana Jones' to 'X-Men'",
        "content": "",
        "upvotes": 78,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Z9fGupRnW35xIl_6Xq_HPjEbstKLlIj5CYVzufg50k8.jpg?auto=webp&amp;s=c60ee38b33bfd2f257d2690a26ee6737b04788fa"
        },
        "permalink": "/r/movies/comments/1immhbp/ke_huy_quan_breaks_down_his_7_favorite_action/"
    },
    {
        "id": "1impq6a",
        "author": "FuuuuckOffff",
        "title": "Talking about \"Movies that never happened\". Bright was such wasted potential.",
        "content": "A movie, or movie franchise, about a modern day world involving class definitions with mythological creatures sounds amazing.\n\nIn an LA rife with interspecies tensions, a human cop and his orc partner stumble on a powerful object and become embroiled in a prophesied turf war.\n\nToo bad Bright storyline sucked. I would have loved to see a word like that built up in depth.",
        "upvotes": 47,
        "comments": 27,
        "media": null,
        "permalink": "/r/movies/comments/1impq6a/talking_about_movies_that_never_happened_bright/"
    },
    {
        "id": "1ima8nk",
        "author": "Upper_Conversation_9",
        "title": "Barry Keoghan, Riley Keough Star in Kantemir Balagov's 'Butterfly Jam'",
        "content": "",
        "upvotes": 318,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PCyQQ7U1QCeFfRaK4RcivjvW2jLb6RpO1ShAwgMWMYc.jpg?auto=webp&amp;s=2de66f58ec748e22788ab5b53de0b3db7d52dd36"
        },
        "permalink": "/r/movies/comments/1ima8nk/barry_keoghan_riley_keough_star_in_kantemir/"
    },
    {
        "id": "1im79sb",
        "author": "Crazy_Historian_5731",
        "title": "The evolution of Laura Dern (Turns 58 Today!)",
        "content": "",
        "upvotes": 435,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8T9qf5LanaYEUZ_5K--J-EkHN8RYcTXJkgDISvNKxtQ.jpg?auto=webp&amp;s=8173e7fa3f1951e0213b3d2963fa402c5687d4be"
        },
        "permalink": "/r/movies/comments/1im79sb/the_evolution_of_laura_dern_turns_58_today/"
    },
    {
        "id": "1imq87n",
        "author": "in2xs",
        "title": "Ken Burns…criterion",
        "content": "I love how he quickly gets giddy like a kid when talking about some of his favs.",
        "upvotes": 32,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MEsTeBkuaDIjExqUXiw5j062At-nP4jTzuBdumGNeY4.jpg?auto=webp&amp;s=1e9f803ff2a942ee70963cd2ed6c5e01c5a61a09"
        },
        "permalink": "/r/movies/comments/1imq87n/ken_burnscriterion/"
    },
    {
        "id": "1ilszdw",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Thunderbolts*",
        "content": "",
        "upvotes": 6451,
        "comments": 1135,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5vh9gbhbc7ie1.jpeg?auto=webp&amp;s=e57b276c421b8b5efe80d8b1b272eea772f37224"
        },
        "permalink": "/r/movies/comments/1ilszdw/new_poster_for_thunderbolts/"
    },
    {
        "id": "1imfqmf",
        "author": "Flatoutspun",
        "title": "Movies That Disappointedly Don't Have A Sequel",
        "content": "The A-Team. Is my example. I love it. Maybe it's a product of my time and it hit me right at a point in my life. I think it's well cast. Well directed. I thought it had great potential for a franchise. I'm not sure of any details that may have derailed any sequels. It may be too late for a sequel at this point. It's a good movie to put on if the kids are around or to just watch for myself. I grew up with the TV show, but too young to remember much. I think this was part of the slew of movies from TV shows, but it stuck out. Did I mention the cast? They just had great chemistry. One of my favorite movies overall. ",
        "upvotes": 120,
        "comments": 413,
        "media": null,
        "permalink": "/r/movies/comments/1imfqmf/movies_that_disappointedly_dont_have_a_sequel/"
    },
    {
        "id": "1imt1mk",
        "author": "Oreoghostboy",
        "title": "Terminator 1 is what I've been looking for for a long time.",
        "content": "I know I'm a little bit late, but I just saw Terminator 1 yesterday, and it was amazing! I liked it so much, I just purchased it for my DVD/Blu-Ray collection. I'm glad I decided to give it a try. As someone who liked but could never bring myself to buy a single Star Wars DVD, a Blade-Runner DVD, or a Back To The Future DVD, this movie felt like everything I was looking for in those films. The only movie I can think of that I own close to it is the first Matrix movie, and Terminator 2 which I could barely even bring myself to buy as well. I was surprised to have liked it more than Terminator 2, given all the praise that one gets, and I expected it to be similar to Terminator 2, which prevented me from wanting to watch it, but it turns out it being not too similar to Terminator 2 is what made me like it so much.",
        "upvotes": 15,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1imt1mk/terminator_1_is_what_ive_been_looking_for_for_a/"
    },
    {
        "id": "1im6tey",
        "author": "NoCulture3505",
        "title": "Denzel Washington on Reuniting with Spike Lee for ‘Highest 2 Lowest’",
        "content": "",
        "upvotes": 333,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KjIVkpQBYMTcRdYYCRhZRDvxZOSDthWWEAOa1AF3urk.jpg?auto=webp&amp;s=56730dc0767d6fe56028b552dc8cb4923960bbe1"
        },
        "permalink": "/r/movies/comments/1im6tey/denzel_washington_on_reuniting_with_spike_lee_for/"
    },
    {
        "id": "1imgkam",
        "author": "KillerCroc1234567",
        "title": "Kerry Washington, Steven Yeun Join Ben Affleck’s Kidnapping Thriller ‘Animals’",
        "content": "",
        "upvotes": 96,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dtdSnZeh1y7gWdwFNUZ4yYPmxemRNwKWyLYz7OZ8Luw.jpg?auto=webp&amp;s=dcb92e0ad256ae51be36511d9a90c1a88edbbdc3"
        },
        "permalink": "/r/movies/comments/1imgkam/kerry_washington_steven_yeun_join_ben_afflecks/"
    },
    {
        "id": "1im3pjs",
        "author": "DarkXezz",
        "title": "Great scene from Zulu (1964) - \"Because We're Here, Lad. Nobody else\".",
        "content": "",
        "upvotes": 550,
        "comments": 192,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cqhzxYIKsIUSfGD98CnXKppNFK3vGkFEm_woVKt2Ap0.jpg?auto=webp&amp;s=60da513c884547dfe3ce1be9d321510bbfeccb7e"
        },
        "permalink": "/r/movies/comments/1im3pjs/great_scene_from_zulu_1964_because_were_here_lad/"
    },
    {
        "id": "1immlpf",
        "author": "Great-Program5656",
        "title": "Watching the Princess Diaries as an adult",
        "content": "I see this movie gets reviewed once a year or so in year so let me do the honors this time around. I'm watching for the first time in a really long time and it's breaking my heart! This 15 year old was used and abused by everybody around her.\n\nMom and Dad: Keep her father's identity from her and not even share custody, just abandon the kid.\n\nQueen: Not having any relationship with the girl until you want her to...RUN A COUNTRY? Then scold her for acting like a 15 year old under pressure.\n\nLily: With friends like this who needs an enemy? Jealous, judgmental, and just mean! \n\nMichael: Only wanted to hang out after she got her makeover then acted upset when he saw her out with another guy like she owed him her allegiance. He didn't even want to call their hangout a date.\n\nJosh: How do they learn to be THAT awful that young? That kiss?!? Disgusting.\n\nLana and posse: Yuck. I can't stand mean girls. When they pulled the tent up so the paps could catch her naked? \n\nThroughout the movie she apologizes to almost everyone for something she had no control over. I still feel fond of this movie but mostly for nostalgic purposes now.",
        "upvotes": 33,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1immlpf/watching_the_princess_diaries_as_an_adult/"
    },
    {
        "id": "1imla52",
        "author": "SanderSo47",
        "title": "Radio Silence ('Ready or Not', 'Scream VI', 'Abigail') &amp; Paul Giamatti Teaming Up for Biopic About Paranormal DJ, Art Bell",
        "content": "",
        "upvotes": 32,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bXAMDghneBU00b3rcG1b4DCJFbndvLBjegSw0QxR-G0.jpg?auto=webp&amp;s=8c350b336c0b299120ac7720edad8f2bc88f847b"
        },
        "permalink": "/r/movies/comments/1imla52/radio_silence_ready_or_not_scream_vi_abigail_paul/"
    },
    {
        "id": "1ilkipt",
        "author": "ArnoLamme",
        "title": "Don't look up: a satire so well done it made me lose faith in humanity",
        "content": "I recently watched the movie 'don't look up', a funny satire movie, it seemed at first glance.\n\nI was not prepared on how well this movie would portray the situation and consequences of its premise would play out. I am fully convinced that the events in this movie, even though it is a satire, would 100% play out the same way in real life, to a point that it converted me to being a misanthrope.\n\nDid others enjoy this movie as well? Did you enjoy the movie or didn't think much of it?",
        "upvotes": 9913,
        "comments": 1232,
        "media": null,
        "permalink": "/r/movies/comments/1ilkipt/dont_look_up_a_satire_so_well_done_it_made_me/"
    },
    {
        "id": "1im8rbo",
        "author": "theodo",
        "title": "Miles Teller &amp; Casey Affleck To Star In Manhunt Thriller ‘Wild Game’ For Range &amp; Endurance Media; Capstone Launching For EFM",
        "content": "",
        "upvotes": 107,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Qdq1BEvFDoTy8sfAKjeOB1nyPapynZA6ZvP9MyIhww4.jpg?auto=webp&amp;s=177b3ba3237badf61de4a86541fb4a4157c40227"
        },
        "permalink": "/r/movies/comments/1im8rbo/miles_teller_casey_affleck_to_star_in_manhunt/"
    },
    {
        "id": "1ilsnwo",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Lilo &amp; Stitch'",
        "content": "",
        "upvotes": 1857,
        "comments": 284,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/70gb33ya97ie1.jpeg?auto=webp&amp;s=834bababd8c16d8a4a3c05d228ac5e0695331782"
        },
        "permalink": "/r/movies/comments/1ilsnwo/new_poster_for_lilo_stitch/"
    },
    {
        "id": "1ilsx8l",
        "author": "MarvelsGrantMan136",
        "title": "Thunderbolts* | New Trailer",
        "content": "",
        "upvotes": 1639,
        "comments": 610,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zZYeNVI1mKHU3g0MY48RpkGXIhgtiEjcHDot_UfLTfM.jpg?auto=webp&amp;s=fd595eff365cdb4a190093ace017b9e5ad3bde2d"
        },
        "permalink": "/r/movies/comments/1ilsx8l/thunderbolts_new_trailer/"
    }
]