[
    {
        "id": "1hxsy90",
        "author": "BunyipPouch",
        "title": "Announcement: This week's AMAs/Q&amp;As with Robbie Williams for 'Better Man' &amp; the team of 'Extreme Unique Dynamic' have been cancelled/postponed due to the ongoing LA fires. We will announce new dates if/when they are confirmed.",
        "content": "",
        "upvotes": 38,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c6173soxj2ce1.png?auto=webp&amp;s=8890beac501e01a75272ddb5edc73c2a74fde3b2"
        },
        "permalink": "/r/movies/comments/1hxsy90/announcement_this_weeks_amasqas_with_robbie/"
    },
    {
        "id": "1hxuycv",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Den of Thieves 2: Pantera / Better Man)",
        "content": "# New Theatrical Releases\n\n[Den of Thieves 2: Pantera](https://old.reddit.com/r/movies/comments/1hxuwnk/official_discussion_den_of_thieves_2_pantera/?)\n\n[Better Man](https://old.reddit.com/r/movies/comments/1hxuwpf/official_discussion_better_man_spoilers/?)\n\n# Streaming Releases\n\n[Wallace &amp; Gromit: Vengeance Most Fowl](https://old.reddit.com/r/movies/comments/1hsvowt/official_discussion_wallace_gromit_vengeance_most/?)\n\n# Still in Theaters\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n[Nosferatu](https://old.reddit.com/r/movies/comments/1hmffh4/official_discussion_nosferatu_2024_spoilers/?)\n\n[Babygirl](https://old.reddit.com/r/movies/comments/1hmffj8/official_discussion_babygirl_spoilers/?)",
        "upvotes": 35,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hxuycv/official_discussion_megathread_den_of_thieves_2/"
    },
    {
        "id": "1hz9835",
        "author": "Sit_thursday",
        "title": "Forgetting Sarah Marshall is genuinely funny ",
        "content": "I stumbled across this on TV, havnt seen it in years. Jason Segel plays the part of sad funny guy excellently, Mila Kunis does Mila Kunis things and is immensely likable, and Russel Brand is pre-lunatic and scarce enough seen to be enjoyable. All in all it's a fantastic comedy which made me laugh out loud several times (although I am several drinks in) \n\nE: spelling ",
        "upvotes": 11262,
        "comments": 1380,
        "media": null,
        "permalink": "/r/movies/comments/1hz9835/forgetting_sarah_marshall_is_genuinely_funny/"
    },
    {
        "id": "1hzhasr",
        "author": "JonasKahnwald11",
        "title": "Disney Renaissance Animator Mike Toth Has Died (Hercules, Mulan, Tarzan and Atlantis: The Lost Empire)",
        "content": "",
        "upvotes": 1980,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qPEI8FxdisRo-eVY5uRTrhDqnRs6zxiw2uUkcY8oBh8.jpg?auto=webp&amp;s=2e96e5e8e0836ef0db9280b8971fd972472e9635"
        },
        "permalink": "/r/movies/comments/1hzhasr/disney_renaissance_animator_mike_toth_has_died/"
    },
    {
        "id": "1hzkk5j",
        "author": "Mandelmus100",
        "title": "Cillian Murphy's character in \"Small Things Like These\" is the most powerful depiction of \"virtuous masculinity\" I've seen",
        "content": "**DISCLAIMER: I highly recommend watching the film before reading this thread and commenting on it.**\n\nI'm in awe of Murphy's character in **[Small Things Like These](https://www.youtube.com/watch?v=Nqwn5Y_Y4xs)**. He\n\n- works hard\n- is generous with his friends and colleagues\n- has pain in his heart from childhood trauma but rather than feel sorry for himself, he tries to pay forward any kindness he has received\n- protects and provides for his loved ones\n- has compassion with those less fortunate than him\n- does the morally right thing despite overwhelming cost and risk to himself\n\nIt's a quiet but intensely profound film and it has deeply impressed and inspired me.",
        "upvotes": 798,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/P84Ykeot_9pPv44rNR5NseQhPN0aZH4NyZwnVaM2cRw.jpg?auto=webp&amp;s=a35725b4c3511bed33267153543c1fad90c28cb0"
        },
        "permalink": "/r/movies/comments/1hzkk5j/cillian_murphys_character_in_small_things_like/"
    },
    {
        "id": "1hzm4ko",
        "author": "leatherfacey",
        "title": "Movies you thought you would enjoy but couldn’t even finish?",
        "content": "I recently went to see Gladiator 2, fully expecting to just enjoy it. Sure it might not be my favourite movie of the year, but to my sincere surprise I was just so *bored* during it, that I did something which I have rarely ever done in my entire life and I just got up and left. Not out of anger or any kind of extreme emotion, but I was just so uninterested and underwhelmed that without even thinking I just found myself causally get up and leave to go do something else.\n\nAnyone else have any movies they interested in, or even hyped to see, only to find them surprisingly disappointing or underwhelming? ",
        "upvotes": 240,
        "comments": 991,
        "media": null,
        "permalink": "/r/movies/comments/1hzm4ko/movies_you_thought_you_would_enjoy_but_couldnt/"
    },
    {
        "id": "1hzpdpz",
        "author": "Puzzled-Tap8042",
        "title": "A24 Horror Movie ‘Opus’ Stars John Malkovich as a Popstar Cult Leader",
        "content": "",
        "upvotes": 114,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/V1KW-ThcI0p-gL1X_QyTGtBjzteEVgb_Elbci5LwSow.jpg?auto=webp&amp;s=9d85f8f32054f118b9625f91397ae063c3afda50"
        },
        "permalink": "/r/movies/comments/1hzpdpz/a24_horror_movie_opus_stars_john_malkovich_as_a/"
    },
    {
        "id": "1hz7mz8",
        "author": "OkStop1168",
        "title": "I want some bizarre movie recommendations 😂🙏",
        "content": "Something where the setting is the otherworldly, the characters are crazy, the plot is absurd and takes twist and turns, or all of the above.\n\nPlanning on watching a movie tonight and wanted some recommendations for fun movies like this. They can also be thrilling and suspenseful! I don’t care if they are well-known or not, any recs would be appreciated.\n\nThanks everyone!!!",
        "upvotes": 1099,
        "comments": 3885,
        "media": null,
        "permalink": "/r/movies/comments/1hz7mz8/i_want_some_bizarre_movie_recommendations/"
    },
    {
        "id": "1hzfwnm",
        "author": "GimmeDatAsSicily",
        "title": "How refreshing it is to go in to films completely blind; never seeing a trailer or reading about the film itself. This way, even bad films don't tend to disappoint.",
        "content": "I have been getting through a few films that came out in the past couple of years, knowing absolutely nothing about them (except for, say, the genre of film) and ultimately being thrilled with what I just watched. \n\n&amp;nbsp;\n\nIt wont work for everyone but I personally enjoy sitting to watch a film with zero expectations or notions of what it will be about, that way the whole screening usually ends up being a positive affair. Yesterday I watched The Menu for the first time and the only assumption I had of it was that it was maybe about food. Totally blown away by how good it was and ultimately what it was about. Such a great mix of black comedy with weird tense moments. If I had read a brief synopsis or watched the trailer, the unexpectedness of what takes place would have been ruined.\n\n&amp;nbsp;\n\nIt doesn't always work out where I can avoid things like this; I saw the trailer for Companion and then read a comment about Jack Quaid begging people not to watch it, and I totally get that. Because any element of surprise for the film is ruined now. It happened last year with Longlegs too. Saw the trailer. Read the hype. Went to the cinema so excited to see it. Couldn't believe how terrible the second half was.\n\n&amp;nbsp;\n\nDoes anyone else purposefully try to set out and watch films this way; blind as a bat. And you only watch it because you hear the name bandied about so much?",
        "upvotes": 138,
        "comments": 69,
        "media": null,
        "permalink": "/r/movies/comments/1hzfwnm/how_refreshing_it_is_to_go_in_to_films_completely/"
    },
    {
        "id": "1hzc4c5",
        "author": "RokuAang625",
        "title": "Does anyone still rent movies from the library? ",
        "content": "I’ve been watching a bunch of movies from the library mainly because they’re not on any streaming service and I really wanted to see them. Some examples include A Soldier’s Story, Gummo, Imagine Me &amp; You, The Quiet American and more. I’m curious does anyone else do this or is everyone mainly reliant on streaming, personal DVD/Blu-ray collections, piracy, etc?\n\n*meant to say borrow not rent ",
        "upvotes": 259,
        "comments": 193,
        "media": null,
        "permalink": "/r/movies/comments/1hzc4c5/does_anyone_still_rent_movies_from_the_library/"
    },
    {
        "id": "1hzg9u6",
        "author": "rpgisdum",
        "title": "How has time or culture-shifts changed your view of older movies/characters as you see them again?",
        "content": "I’ve noticed I’m fallen back to genuinely rooting for good guys over ‘cool anti-heroes’ from the 90’s I used to pull for.\n\nI noticed first when I was watching Point Break, one of my favorite action-flicks from back in the day. In the 90’s I thought Bodi was such a bad ass dude-against-the-system spiritualist rebel. Now I watch it and think he’s a self-serving prick that got a lot of people killed, and set in motion a situation where he could have gotten an ex-girlfriend tortured to death.\n\nToday when I watch it I wonder WTF Utah is doing just letting Bodi go surfing after he caused the deaths of undercover officers, his crew, and legit got Utah’s partner shotgun blasted in the back. “And you’re just gonna’ let him go surfing, bro?”\n\nKind of amazing what I was cool with as a 90’s teenager. Then Bodi seemed to have some sort of noble cause and I forgave him for a helluva lot of bad. Now I’m like “Yooooo that dude belongs in a cage, man.”\n\nThe same with the movie Heat, which was a favorite of mine in the 90’s. As a teenager, I thought Deniro’s character was awesome and rooted for him completely in the end to blow away struggling family-man Pacino, simply because he was cool and so Rock &amp; Roll on his heists. I watched it for the first time in forever recently and for the first time ever found myself rooting for Pacino at the end, which is a complete turn around from how I used to view this movie.\n\nIt’s wild how you watch these movies tons of times in a different era of society and your own life and always experienced the movies one way, then you watch them again now and experience them a completely different way and wonder how you didn’t always see it the same way despite numerous, numerous viewings.",
        "upvotes": 73,
        "comments": 145,
        "media": null,
        "permalink": "/r/movies/comments/1hzg9u6/how_has_time_or_cultureshifts_changed_your_view/"
    },
    {
        "id": "1hywkaj",
        "author": "yomjoseki",
        "title": "Looking for examples of a very specific subgenre of farce where the story starts with something seemingly small/inconsequential then basically Rube Goldberg machines into world-changing chaos",
        "content": "Even more specifically, the actions and choices made by the characters directly impact the next event and make the situation worse or bigger somehow.\n\nThe best example I can think of is [this clip from Malcolm in the Middle](https://www.youtube.com/watch?v=AbSehcT19u0). If you can't watch it, Hal has to fix a light bulb, so he grabs a light bulb, but notices a problem with the shelf. In doing so, he realizes the shelf is unstable, so he grabs a screwdriver from a drawer. The drawer, is squeaky, so naturally he looks for WD40 to correct that, but it's out. So he hops in his car to get some more WD40, and wouldn't you know it, his car won't start. Lois comes home and sees the light is out. She goes to the garage to tell Hal to change the light, and he yells back, exasperated, \"What does it look like I'm doing?!\"\n\nAnyway, what movies you can think of which more or less follow this kind of pattern with cascading chaotic sequences? What's the most entertaining example you can think of?",
        "upvotes": 1305,
        "comments": 749,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0JiSqovy8T2sk7cR7nGhUTo27L-grmvh3mY32IvfZS8.jpg?auto=webp&amp;s=78a010de957f67f2791077f9a063132fdd75ac64"
        },
        "permalink": "/r/movies/comments/1hywkaj/looking_for_examples_of_a_very_specific_subgenre/"
    },
    {
        "id": "1hzfwte",
        "author": "Public-Concert-1179",
        "title": "What is everyone’s thoughts of Lawrence Of Arabia? ",
        "content": "I just finished Lawrence Of Arabia I personally loved it It took my dad and me a few nights to finish watching this film. At first, he didn’t see what all the hype was about, joking, “This is a masterpiece? It’s just people walking around in the desert me and your mom used to do this all the time what is the difference between a white men does it and us Arabs .” But by the time we finished, we couldn’t stop talking about it about T. E. Lawrence as a person, the complexity of his choices, and the layers of morality and politics that shape the story. It’s a film that lingers in your mind, sparking conversation long after it’s over.\n\nThe movie, based on the life of T. E. Lawrence, follows his efforts to unite Arabian tribes and lead them in a military campaign against the Ottoman Empire during World War I. As an Arab that has bedu ancestry it is amazing how this film played out.",
        "upvotes": 68,
        "comments": 119,
        "media": null,
        "permalink": "/r/movies/comments/1hzfwte/what_is_everyones_thoughts_of_lawrence_of_arabia/"
    },
    {
        "id": "1hyybtm",
        "author": "theatlantic",
        "title": "“The Brutalist” review, by David Sims ",
        "content": "",
        "upvotes": 797,
        "comments": 86,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uY84M5xJhCrpelKD3m5bEVbAki-oZJgebfFYQQeGo3Y.jpg?auto=webp&amp;s=2c0a3e6068c14210a1270d292a71599b1de11e79"
        },
        "permalink": "/r/movies/comments/1hyybtm/the_brutalist_review_by_david_sims/"
    },
    {
        "id": "1hz6xz4",
        "author": "StrangeDays929",
        "title": "Robot Jox",
        "content": "I used to see this preview before every movie, as a kid",
        "upvotes": 239,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/i-XvBJCbYE8DlwsTCji-1FWB9dMWYLduDpVTcvlDIo0.jpg?auto=webp&amp;s=a6597c69ee274793e6f49fa45d9c2e501ead7fd3"
        },
        "permalink": "/r/movies/comments/1hz6xz4/robot_jox/"
    },
    {
        "id": "1hzhcvo",
        "author": "blueoceans2000",
        "title": "Andrew Is The Best Character In The Breakfast Club",
        "content": "In the recent years when I've rewatched The Breakfast Club, I've noticed that Andrew (played by Emilio Estevez) is actually the best character in the movie in my opinion. Bender was my favorite after watching the movie for the first few times, but I think Andy is the best character because of how he is the only one in the film to defend almost everyone at some point in the movie. He defends Claire from Bender, Brian from Bender, and Allison from Claire. He liked Allison for who she was before the makeover scene and was the only one who actually checked in on her. He also did the worst thing out of the group to earn him detention, yet was the most remorseful about what he did. Andy was a well balanced character in the movie, being somewhat of a coward by ironically trying to put on a tough guy act for his father and friends for their approval. He also liked to think that he would be the one brave enough to be cool with the others when they went back to school on Monday. Andy is a flawed dude who still sinks under peer pressure, but has a good heart deep down and has the potential to still stand up for what he thinks is right. He's not the best just cause he's the jock/popular guy, but because he probably had the best heart out of everyone else in the group.\n",
        "upvotes": 43,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1hzhcvo/andrew_is_the_best_character_in_the_breakfast_club/"
    },
    {
        "id": "1hyyd8s",
        "author": "snoke123",
        "title": "If Jurassic Park used site B to breed the dinosaurs...",
        "content": "and only moved them to the park once they were a few months/years old, what was the purpose of the laboratory Wu was working in and having the embryo samples Nedry steals, on Isla Nublar?\n\nShouldn't Wu as the chief genetic engineer be working where the dinosaurs are being mass produced? And if the dinosaurs were created in site B, what's the deal with the velociraptor that hatches when Grant and co. go into the lab?",
        "upvotes": 471,
        "comments": 187,
        "media": null,
        "permalink": "/r/movies/comments/1hyyd8s/if_jurassic_park_used_site_b_to_breed_the/"
    },
    {
        "id": "1hz0ilo",
        "author": "girafa",
        "title": "1985 - Runaway Train - Two criminals escape a maximum security prison in Alaska only to end up on a train without a conductor. In this scene, notorious career criminal Jon Voight explains what life is actually like for recidivists",
        "content": "",
        "upvotes": 346,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/26aLHimHsPPWdJ15Bmg0krmFtT_9m50isID-o2BUFuw.jpg?auto=webp&amp;s=c46f302de268b9ea890258fd2e362c354b3c51e4"
        },
        "permalink": "/r/movies/comments/1hz0ilo/1985_runaway_train_two_criminals_escape_a_maximum/"
    },
    {
        "id": "1hz77vs",
        "author": "BunyipPouch",
        "title": "This weekend, there are 2 movies releasing with the same exact title ('The Damned'), runtime (1h29), time period (mid 1800s), release date (January 10th), distribution (theaters), general theme (isolation), and almost matching critical reviews on Metacritc (63/64).",
        "content": "I present to you the ultimate double-feature: \n\n[The Damned²](https://i.imgur.com/v2chtjm.jpeg) \n\nI just thought this was interesting. Doesn't happen very often (or ever probably?). They both have the same exact title, runtime, release date, time period, theatrical release, and general themes/ideas. As a bonus, one has a 63 on Metacritic, the other a 64. Almost identical in every way. Both also premiered at a film festival in 2024 around the same time (one at Cannes in May and the other a few weeks later at Tribeca June). Both are internationally co-produced films and include Belgium and the US as production partners.\n\nOne is about an isolated fishing village in the artic, and the other is about an isolated Civil War company on the American frontier. Both really solid films as well. Both are slow burns and pretty philosophical. I preferred the artic one by a wide margin but both have strengths.\n\nTrailer for **The Damned**, Civil War film: https://www.youtube.com/watch?v=GjL0sNvX_VM\n\nTrailer for **The Damned**, artic horror film: https://www.youtube.com/watch?v=1itnHQHgxUI",
        "upvotes": 128,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FOxnaH4_22r6Una3P6VAyuNDA9Mrht5ACcjFGUh6_VU.jpg?auto=webp&amp;s=c03c15ef0825149e128b025758f9238f90386951"
        },
        "permalink": "/r/movies/comments/1hz77vs/this_weekend_there_are_2_movies_releasing_with/"
    },
    {
        "id": "1hzdrjv",
        "author": "ssdissaor",
        "title": "Heavier Trip (2024)",
        "content": "",
        "upvotes": 46,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VuzzGVv-29eCFf4VoQ6idfzpXK7Z6Ad7tT7-3-bZsKM.jpg?auto=webp&amp;s=5f26cda75fdea825656c45c0688b52b65e15a331"
        },
        "permalink": "/r/movies/comments/1hzdrjv/heavier_trip_2024/"
    },
    {
        "id": "1hz41xa",
        "author": "crumble-bee",
        "title": "The Edge (1997) is great! ",
        "content": "Came up on a podcast, thought I'd check it out - great! Amazing bear V man sequences, decent performances - Baldwin is great Hopkins as well. I really liked it! Decent people behind the camera too, a really solid movie. \n\nI don't have anymore to say, but the mods say I need to say more so I'm just going to paste in my thoughts again 🤷‍♂️\n\nCame up on a podcast, thought I'd check it out - great! Amazing bear V man sequences, decent performances - Baldwin is great Hopkins as well. I really liked it! Decent people behind the camera too, a really solid movie. \n",
        "upvotes": 182,
        "comments": 77,
        "media": null,
        "permalink": "/r/movies/comments/1hz41xa/the_edge_1997_is_great/"
    },
    {
        "id": "1hyq5sw",
        "author": "Emergency-Mammoth-88",
        "title": "‘Masters of the Universe’ Live-Action Movie Starring Nicholas Galitzine Begins Filming in London",
        "content": "",
        "upvotes": 1278,
        "comments": 372,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/n7-3FFre9VjMKdiCO5yOw8t3_rp6M_dUBxsW-0N3hho.jpg?auto=webp&amp;s=9f23af1afa9886045fc4730539d21e14fcf5a893"
        },
        "permalink": "/r/movies/comments/1hyq5sw/masters_of_the_universe_liveaction_movie_starring/"
    },
    {
        "id": "1hyuzbm",
        "author": "theipaper",
        "title": "The WW2 bomber pilot on a mission to save James Bond's Little Nellie",
        "content": "",
        "upvotes": 295,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fK8HCY7hEtKQk5xR4412cDh9KQdGLrcGB3rs945zC5w.jpg?auto=webp&amp;s=ba829e0938f9e4d1923c2895b7da0a3efe4868f1"
        },
        "permalink": "/r/movies/comments/1hyuzbm/the_ww2_bomber_pilot_on_a_mission_to_save_james/"
    },
    {
        "id": "1hz9p72",
        "author": "ben_watson_jr",
        "title": "Chinatown! 1974",
        "content": "The ‘best’ movie ever!! ",
        "upvotes": 34,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Pc7t44FL0fN9oRRe-xv4vTUHhJGevSKC_13Ovy-DFiE.jpg?auto=webp&amp;s=b881deeda32a644addf57502eae20123d0abac6d"
        },
        "permalink": "/r/movies/comments/1hz9p72/chinatown_1974/"
    },
    {
        "id": "1hz6pmw",
        "author": "feedthebear",
        "title": "Atonement (2007) - There was none",
        "content": "Just finished watching Atonement (2007) and thought it was excellent. The ending is bitter and frustrating so a great film overall with a wonderful cast who all went on to do well. \n\nBut my lord how loathsome is Briony Tallis. \n\nCan we all agree that there was no atonement in this film. Zero. Briony was arrogant and self-serving to the bitter end.\n\nShe ruins Robbie's (James McAvoy's) life with her lie resulting in his imprisonment and later death. And ruins his sister's (Keira Knightley's) life in turn who was waiting for him to return from war. \n\nShe then goes on to live a full and successful life as an author with this being her 21st novel and she has the audacity, arrogance and smugness to mislead further about how in the end she gave them their happy ending because they didn't get one in life as though this was a merciful act.\n\nThis just rings hollow as she has continued to fabricate her lies and mistruths condescendingly even in old age. There was no atonement or anything close. \n\nAt every opportunity she fails in correcting her lie other than this fanciful version of events she conjures up as to way to forgive herself. The final scene with her, as joyless as ever, caps it all off.\n\nEven in death she harvested their story for personal gain and acclaim only subverting what happened further.\n\nTLDR: Briony Tallis easily walks on to the shitlist for women in literature. \n\n ",
        "upvotes": 39,
        "comments": 32,
        "media": null,
        "permalink": "/r/movies/comments/1hz6pmw/atonement_2007_there_was_none/"
    },
    {
        "id": "1hyhm4w",
        "author": "MarvelsGrantMan136",
        "title": "Universal Delays ‘Shrek 5’ to December 2026, Moves Up ‘Minions 3’ to July 2026\n",
        "content": "",
        "upvotes": 2466,
        "comments": 296,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Y4W2l_1dcur-8D6seUx2U-KzapU-8a3mRqeX1dhMsIU.jpg?auto=webp&amp;s=72acf1af927701614667339c00a4856a89f92309"
        },
        "permalink": "/r/movies/comments/1hyhm4w/universal_delays_shrek_5_to_december_2026_moves/"
    },
    {
        "id": "1hyc9ba",
        "author": "MarvelsGrantMan136",
        "title": "Jude Law to Play Vladimir Putin in Olivier Assayas' New Movie 'The Wizard of the Kremlin'",
        "content": "",
        "upvotes": 4764,
        "comments": 367,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZqzaknzGjNDMc4EpRgVQepQmubWNhZSpVhTHSdGF24Q.jpg?auto=webp&amp;s=cc2f68fcf9f44885d8407e95236d9623029b1f00"
        },
        "permalink": "/r/movies/comments/1hyc9ba/jude_law_to_play_vladimir_putin_in_olivier/"
    },
    {
        "id": "1hzqwb5",
        "author": "Spirited-Purple707",
        "title": "Trying to identify a documentary about rapper that goes on a crime spree",
        "content": "So my parents rented this movie at blockbuster some time around 1999 give or take a few years. It was about a Mexican rapper that went on a crime spree. It's either real footage that they made into a doc or it's made to look real. It was convincing enough that my parents turned it off after this scene where there's a guy coming to an SUV to buy drugs. When he sits down a guy from behind him wraps some rope or wire around his neck and suffocates him. Like I said it's either real or made to look real by using regular video cameras and all that. And if it's fake these men are some of the best actors ever. The only other part I remember was some cctv footage of the rapper stabbing a guy with a screwdriver in a parking garage or something like that.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hzqwb5/trying_to_identify_a_documentary_about_rapper/"
    },
    {
        "id": "1hzqp0a",
        "author": "mmiller1026",
        "title": "Breaking into Beautiful",
        "content": "There’s a new documentary called Breaking into Beautiful that just came out about this girl named Kim White, I used to follow her on social media. She passed from cancer, and now her story is being told in documentary form. It’s only being advertised on the platform Angel. I really do not want to sign up for another freaking subscription service. Does anyone know where I could watch this outside of that site? TIA! ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hzqp0a/breaking_into_beautiful/"
    },
    {
        "id": "1hzq0tk",
        "author": "Eikthyrnir13",
        "title": "What directors would you recognize if you saw them on the street? ",
        "content": "Obviously, people would recognize tons of actors if they saw them in real life. But what about directors? Which directors do you think you would recognize if you saw them in the wild? For me, Quentin Tarantino, Spielberg, Ron Howard, Jon Favreau, Kevin Smith, and Jordan Peele. Probably Spike Lee. Maybe a few others. ",
        "upvotes": 0,
        "comments": 31,
        "media": null,
        "permalink": "/r/movies/comments/1hzq0tk/what_directors_would_you_recognize_if_you_saw/"
    },
    {
        "id": "1hy9891",
        "author": "TheMirrorUS",
        "title": "Ernest actor Bill Byrge dies at the age of 92",
        "content": "",
        "upvotes": 6183,
        "comments": 286,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kBLW3g_ETvf0sD5WcOg1ig9JUup_dpRVp40yk-Yhw6A.jpg?auto=webp&amp;s=6311c88479fc219e098b37aaac0edf39468611f8"
        },
        "permalink": "/r/movies/comments/1hy9891/ernest_actor_bill_byrge_dies_at_the_age_of_92/"
    },
    {
        "id": "1hyvkm2",
        "author": "adosculation",
        "title": "Most realistic addiction movies you've seen? ",
        "content": "There are lots of good addiction movies but I'm not sure how many are very realistic. Like take the case of Requiem for a Dream. It's a terrifying movie and a unique experience of horror but not so much a realistic drug movie. It's more like what if everything goes wrong times 100.\n\nSpecifically, it's sort  of a horror movie that uses drugs as its language, than a movie about what a life of addiction looks like. It gets some details wrong too, like in reality heroin makes you chill not all excited and energized. But no denying the movie works great as anti-drug advertising. Show that to some young person to scare them straight.\n\nLeaving Las Vegas, in contrast, is a lot more \"realistic,\" or accurate in terms of what it's like for someone to abuse alcohol and become addicted. I find it to be one of Cage's best films. If you think Cage sucks as an actor, just watch this movie. Or if you think drinking is fun, just watch this movie to see how drinking can easily become a tool of self-destruction.\n\nThe movie is in some ways boring and depressing, nothing like your typical movies about people drinking and partying, but that's what alcoholism is. It's when you take refuge in drink, when you become its slave, when you drink because you have to and not because you want to. It's a slow suicide.\n\nSo my question is which addiction movies you find realistic, especially if you or someone you know has done drugs or alcohol.",
        "upvotes": 135,
        "comments": 427,
        "media": null,
        "permalink": "/r/movies/comments/1hyvkm2/most_realistic_addiction_movies_youve_seen/"
    }
]