[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 46,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qn1uh2",
        "author": "WolfinBoy",
        "title": "Train Dreams was buried?",
        "content": "This movie just got nominated for Best Picture and yet I signed into my Netflix account thinking it would be right there blown up right there next to Frankenstein…but it wasn’t. In fact, I had to search for it. Multiple rows of other categories…I started to even doubt it was on the platform. \n\nWhat is Netflix even doing. They have two **beautiful** films that deserve more eyes and they are not prioritized at all. Instead I get The Circle and whatever other drivel is on there. \n\nMaybe my algorithm (from a sparsely used account) caused it to be buried. Is this the case for anyone else?",
        "upvotes": 81,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1qn1uh2/train_dreams_was_buried/"
    },
    {
        "id": "1qn3nd9",
        "author": "DemiFiendRSA",
        "title": "Alex Honnold Says Netflix Paid “Embarrassingly Small Amount” For Taipei 101 Climb: “I Would Do It For $0”",
        "content": "",
        "upvotes": 29,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1qn3nd9/alex_honnold_says_netflix_paid_embarrassingly/"
    },
    {
        "id": "1qm64ef",
        "author": "steal_your_thread",
        "title": "Skyscraper Live is all wrong",
        "content": "Netflix have gotten this wildly wrong, they don't seem to remotely understand what we wanted from this. I straight up couldnt care less about this random commentator having a crack at a part of the climb, or a prerecorded clip of Alex talking about not wanting to die. \n\nWE WANT TO WATCH THE CLIMB.\n\nShut up, keep the climb on the large screen and put all your stupid nonsense filler in that mini screen, if on at all, and STOP TALKING OVER ALEX. They are adding absolutely nothing to this, no commentary at all would be significantly better than these terrible commentators saying how 'scary and dangerous' for the 100th time.",
        "upvotes": 2825,
        "comments": 517,
        "media": null,
        "permalink": "/r/netflix/comments/1qm64ef/skyscraper_live_is_all_wrong/"
    },
    {
        "id": "1qmwpcq",
        "author": "Longjumping_Land_977",
        "title": "Why Elizabeth Smart’s mother Lois wasn’t in the Netflix documentary, and where she is now",
        "content": "",
        "upvotes": 55,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qmwpcq/why_elizabeth_smarts_mother_lois_wasnt_in_the/"
    },
    {
        "id": "1qmvzkb",
        "author": "RiskAndReason",
        "title": "What’s at the top of your Netflix watchlist right now?",
        "content": "Just curious 👀\n\nBecause I’m stuck scrolling again 😅 What’s the one show or movie at the top of your Netflix list that you actually plan to watch next?\n\n\n\nLooking for ideas on what to start next.",
        "upvotes": 61,
        "comments": 132,
        "media": null,
        "permalink": "/r/netflix/comments/1qmvzkb/whats_at_the_top_of_your_netflix_watchlist_right/"
    },
    {
        "id": "1qm5w0n",
        "author": "bh4v1_",
        "title": "Netflix, you should have done better on skyscraper live",
        "content": "People inside the buildings coming up and waving, the constant commentary over Alex speaking, the unnecessary conversations with him while he’s over a building and getting the crowd to shout at him whilst he’s up there. Having his wife appear from inside - it’s like they’re doing everything they can to throw him off his game. This is incredibly anxiety inducing as it is, and it’s like the production team have instructed certain behaviours to make it borderline unbearable. It just feels so performative which is not what his climbs are usually about. \n\nI get it’s fun for the show, and looks cool, but the guy is climbing a skyscraper ffs. \nHe’s doing enough to get you your views, please just let us watch him climb and PLEASE LET US HEAR HIM. I’m so sick of the constant yapping from the panellists; it’s like they’ve been told not to come up for air. Stop doing weird commentary and playing these videos when he’s talking, we want to hear his thoughts, his process, his funny quips. \n\nFeels really irresponsible of Netflix to allow this tbh; like the marvellousness of a free solo climb is just being made a mockery of tbh and this is a real person up there. A huge disservice to climbing, and to Alex. Props to him for absolutely giving the crowd what they’re after though. Couldn’t be me! \n",
        "upvotes": 572,
        "comments": 112,
        "media": null,
        "permalink": "/r/netflix/comments/1qm5w0n/netflix_you_should_have_done_better_on_skyscraper/"
    },
    {
        "id": "1qm5a5m",
        "author": "LosJones",
        "title": "The commentary on this live stream is annoying",
        "content": "Can they shut up for twenty seconds? He's talking and they're just speaking right over him. It makes it almost unbearable to watch. \n\nI hope they learn from this if they ever do anything like this again",
        "upvotes": 453,
        "comments": 172,
        "media": null,
        "permalink": "/r/netflix/comments/1qm5a5m/the_commentary_on_this_live_stream_is_annoying/"
    },
    {
        "id": "1qmoicz",
        "author": "Jay20173804",
        "title": "Netflix over commercialized Tapei 101, they will ruin all sports they host",
        "content": "What is the point of these Nature and Nature-esque Adventure Docs? For the viewer to be immersed, explore, and understand without overexplained talking points. Free Solo was an extension of that. When you are high up, you are looking for peace and to leave the heck of it all below you. What we got yesterday was the antithesis of peace. Elle Duncan, Mark Rober, etc., were named, but they were not needed; they don't understand the point of being Free. Sure, you hire these people, but nobody wants them. There is a reason Elle Duncan never worked out on ESPN. If Netflix wanted more respect, they could have gotten Will Smith, Jimmy Chin, Zac Efron, etc. to host. People who actually understand what Alex is doing, people who want to live in the moment and not make it this is my 9/11. This was unacceptable and a masterclass of complete disaster.\n\nObviously, a lot of first-timers in the comments are getting upset, but for somebody who has been watching Alex for a while, it's quite upsetting.",
        "upvotes": 23,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1qmoicz/netflix_over_commercialized_tapei_101_they_will/"
    },
    {
        "id": "1qnajb9",
        "author": "ZealousidealArm160",
        "title": "On a scale of 0-10, how much did Stevie Nicks’ solo music being in The Crown which was famous on every continent boost Stevie Nicks’ solo career’s fame outside North America, Australia and Oceania?",
        "content": "Cuz I hear people say all the time her solo career’s only big in North America, Australia, and Oceania (I mean her solo career did do good in South Africa, not sure about the rest of Africa, and had some fame in Japan, not sure about the rest of Asia) and I believe her solo career had a ton of fans in South America and Europe, but the Crown is big on every continent and it had her solo music In it, did it boost her solo career’s fame in Europe Asia Africa and South America? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qnajb9/on_a_scale_of_010_how_much_did_stevie_nicks_solo/"
    },
    {
        "id": "1qm7cvv",
        "author": "SavedMist36005",
        "title": "Commentary during the climb genuinely upset me",
        "content": "I know a lot of us are annoyed about the commentary but did anyone else get super irritated when Alex tried to lock back in and keep climbing and the commentator literally stopped him, and asked if he could hear the crowd?\n\nI thought that was so rude and unprofessional, he’s literally trying to focus and you’re interrupting ",
        "upvotes": 193,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1qm7cvv/commentary_during_the_climb_genuinely_upset_me/"
    },
    {
        "id": "1qms12w",
        "author": "zippy_wow",
        "title": "'Mask Girl' praise, Netflix's limited series (2023)",
        "content": "This is the only series that has made me cry, laugh, scream, and keep me on the edge of my seat.\n\nMask girl is for those who might feel insecure about themselves, whether it's body issues or facial features, or just enjoy great k-dramas and drama-thrillers!\n\nMINOR SPOILER AHEAD!\n\nI know it was released about 2 years ago now... but this show truly has made k-dramas a thing for me again. The actresses in this limited series was amazing! The plot twists and production was so well done. \n\nI was so sad during many scenes (don't worry its not known as a sad show) but others I was smiling, for example when Mo-Mi had found her twin (later on mirrored in her daughter), similar experiences, being treated horrible your whole life because of appearance, and also having plastic surgery and living a life to pursue dreams of being a star, to feel accepted. \n\nALSO CAN WE TALK ABOUT THE GRANDMA ON GRANDMA BATTLE?!?!?!\n\nI have never been more invested in what happened next... I stayed up till 6AM finishing off the ending.\n\nEven though I may not relate as much to her situation, I have my own insecurities about my image, and that had made me so happy seeing a show diving into those themes while making it so comedic at the same time. \n\nI had found this series by a random TikTok with those AI voices narrating clips of episode 6, I couldn't help but think \"What a bad b\\*\\*\\*\\*\". \n\nIf you had a glance or two at the show, CLICK THAT BUTTON and watch it... It's so good IMO!!!!",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qms12w/mask_girl_praise_netflixs_limited_series_2023/"
    },
    {
        "id": "1qn6o4u",
        "author": "Additional_Lie6724",
        "title": "Really sad about the final season of Queer Eye",
        "content": "Just finished the last season and I'm honestly bummer. I always binge it in one sitting., and every episode somehow makes me want to be a better human. It's one of those rare shows that actually change how you see people and life.\n\nReally hoping this isn't the true end, because the world still needs shows like this.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qn6o4u/really_sad_about_the_final_season_of_queer_eye/"
    },
    {
        "id": "1qn4i5y",
        "author": "randomkid89",
        "title": "Hey can yall suggest me something?",
        "content": "I just need a new show or movie to watch. I like stranger things and bridgerton a lot, so based off that can yall give me something interesting to watch? Thanks in advance.",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qn4i5y/hey_can_yall_suggest_me_something/"
    },
    {
        "id": "1qn30vh",
        "author": "DCman2",
        "title": "One month sign up / when does it end?",
        "content": "I’m cheap (haha) and trying to squeeze 2 wrestling events (1/31 &amp; 2/28) into a 1 month subscription.   \nSo if I signed up at noon 1/31/2026, when exactly would my 1 month subscription end? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qn30vh/one_month_sign_up_when_does_it_end/"
    },
    {
        "id": "1qn73h5",
        "author": "Christizzzle",
        "title": "Is there a way I can submit an idea for a documentary?",
        "content": "I’m a big documentary fan and enjoy a lot of what Netflix has put out. I’m also a grad student doing research and can’t help but think the subject I’m working on would make a decent one. Is there a way to submit an idea to Netflix or other similar platforms? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qn73h5/is_there_a_way_i_can_submit_an_idea_for_a/"
    },
    {
        "id": "1qm38tl",
        "author": "Explosive_Doggo",
        "title": "Is \"skyscraper live\" really a live?",
        "content": "just sounds like a horrible idea to do a super life threatening challenge on live, and would be a giant detriment to Netflix's reputation if some accident happened, it just makes sense that they would record it before going \"live\" to make sure there's no complications ",
        "upvotes": 104,
        "comments": 152,
        "media": null,
        "permalink": "/r/netflix/comments/1qm38tl/is_skyscraper_live_really_a_live/"
    },
    {
        "id": "1qn8afu",
        "author": "Own-Bunch-3836",
        "title": "thought on HIS&amp;HERS??",
        "content": "Netflix's HIS&amp;HERS and CLICKBAIT taught me one thing-  \nnever to trust old people🙏🏻  \nhow did you feel about both of the  shows if you watched them??\n\nalso, why the hell did richard have all that tools and stuff ready in lexy's beach house? they where gon kill anna right? or where they just some kink props? :)",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qn8afu/thought_on_hishers/"
    },
    {
        "id": "1qmqtp6",
        "author": "Terrible_Finding_487",
        "title": "There's something wrong in the aspect ratio of BODIES 2023",
        "content": "I just finished binge watching BODIES 2023 on netflix and I noticed obviously on the aspect ratio in the final episode. All of the episodes are shot in 2:39:1 aspect ratio. I know that the intro (opening credits) is in 16:9 aspect ratio which is occupying all the space, full screen. However, this one particular shot in the final epsiode at the timestamp of 9:14, the aspect ratio became 16:9.\n\nThe black bars on top and below are gone, it's like it went to imax but only full screen 16:9 ratio. Then at the timestamp of 9:19, the top black bar came back but the black bar below didn't until it reached at the timestamp of 9:22 where it all went back to 2:39:1 aspect ratio.\n\nIt's weird that this particular scene was missed in the editing post production or maybe there's a glitch or error that they forgot to fixed. I know some series were shot in different aspect and change it to make it feel like it does.\n\nI felt relieved when I saw that scene in a full screen mode since I'm expecting it to be full screen just like the opening credits, but yeah it was a fun observation.\n\nWhat do you guys think? Did you also experience this on your part?\n\n\n\nHere's the link on my other post. Since I can't upload with pictures in this discussion. \n\n[https://www.reddit.com/r/Netflixwatch/comments/1qmqjpe/theres\\_something\\_wrong\\_in\\_the\\_aspect\\_ratio\\_of/?utm\\_source=share&amp;utm\\_medium=web3x&amp;utm\\_name=web3xcss&amp;utm\\_term=1&amp;utm\\_content=share\\_button](https://www.reddit.com/r/Netflixwatch/comments/1qmqjpe/theres_something_wrong_in_the_aspect_ratio_of/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qmqtp6/theres_something_wrong_in_the_aspect_ratio_of/"
    },
    {
        "id": "1qmyx97",
        "author": "No-Station-8089",
        "title": "Monster the Ed Gein story",
        "content": "Im on the final episode of Monster The Ed Gein Story and WOW did netflix miss a huge opportunity. Imagine if they had brought in the Mindhunters cast.\n\nInstead im struggling not to turn off the last episode 5 minutes in. \n\nWhat a waste. ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qmyx97/monster_the_ed_gein_story/"
    },
    {
        "id": "1qmdty6",
        "author": "Crafterandchef1993",
        "title": "A Ballad of Songbirds and Snakes is really good",
        "content": "I'm going to try and keep this spoiler free. I actually never read the book, but now it's being added to my reading list. The first third of the movie hits like an action romance, the second sort of goes from that, slowly morphing into its final form, when it's a psychological thriller. The soundtrack and camerawork do a great job making the ending absolutely terrifying and anxiety inducing. Definitely give it a watch if you like the Hunger Games series.",
        "upvotes": 13,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qmdty6/a_ballad_of_songbirds_and_snakes_is_really_good/"
    },
    {
        "id": "1qmh9h1",
        "author": "TeamHoppingKanga",
        "title": "The Crown but for the Roman Empire",
        "content": "I have no clue how to get this idea out there but Netflix CEO’s or creative directors if you’re reading, this concept is yours for the taking, free of charge from me. \n\nThe Crown but for the Roman Empire. Historically accurate, dramatic recreation from the conception of the Roman Empire to its eventual downfall. \n\nThis is a cash cow, sure thing money maker! \n\nThank me later, no check needed. You’re welcome!",
        "upvotes": 9,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1qmh9h1/the_crown_but_for_the_roman_empire/"
    },
    {
        "id": "1qmxkrj",
        "author": "TheMirrorUS",
        "title": "Kidnapped: Elizabeth Smart has landed on Netflix.",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qmxkrj/kidnapped_elizabeth_smart_has_landed_on_netflix/"
    },
    {
        "id": "1qmq604",
        "author": "karmprcz",
        "title": "Fade Transition",
        "content": "So recently as I was watching Netflix (specifically Yellowjackets), I noticed the show had an odd amount of black fades in between scenes. Sometimes it would show up sometimes it wouldn’t. THEN I had skipped backwards to rewatch a scene and it faded again. It seems like at any abrupt cut, netflix fills it in with a black fade 😭 I just wanted to post about it because no matter where i search i can’t find anything about this. Is this a glitch? Or a new update?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qmq604/fade_transition/"
    },
    {
        "id": "1qmnnpx",
        "author": "odienz",
        "title": "Awful Video Quality, How to Check Real Time Stream Info (Android)?",
        "content": "I have Premium plan (4K+HDR) and enough internet speed. My device playback specs are L1, Full HD, etc, and setting on High for download and cell data usage. \n\nOn my TV I can stream 4K no problem, on my PC I can get decent quality too. Yet, when I'm watching on my phone it's awful.\n\nAny way I can check the real-time stream info on Android Netflix app? I don't think it's streaming full HD. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qmnnpx/awful_video_quality_how_to_check_real_time_stream/"
    },
    {
        "id": "1ql4deb",
        "author": "Large-Cardiologist54",
        "title": "Does anyone else spend more time choosing than actually watching?",
        "content": "I don’t know how many times I open up Netflix, sit down with snacks ready… and some how 20 minutes later I am still scrolling lol.. \n\nI mean it’s not that there’s “nothing” to watch. It’s that everything feeling like a commitment nowadays…\n\nIt’s either too long, too heavy, or not the right mood. \n\nHalf the time I just give up and rewatch something I’ve already seen. \n\nIs this just me, or does choosing feel harder than watching 😩?\n\nWhat do you usually end up doing when this happens? ",
        "upvotes": 1158,
        "comments": 196,
        "media": null,
        "permalink": "/r/netflix/comments/1ql4deb/does_anyone_else_spend_more_time_choosing_than/"
    },
    {
        "id": "1qm9bng",
        "author": "Thejoe923",
        "title": "Looking for new comedy suggestions, Am I missing any must-watch comedies out there?",
        "content": "Here are comedies I’ve watched and how much I liked them (rough ratings):\n\n• The Office (US &amp; UK) — 10/10\n• BoJack Horseman — 9/10\n• Family Guy — 9/10\n• Derry Girls — 8.7/10\n• Parks &amp; Rec — 8.5/10\n• I Think You Should Leave — 8.5/10\n• Big Mouth — 8/10\n• Tires — 8/10\n• Derek — 8/10\n• Brooklyn Nine-Nine — 7.5/10\n• Arrested Development — 7.5/10\n• Man on the Inside (season 1) — 7.5/10\n• Superstore — 7/10\n• Schitt’s Creek — 6.5/10\n\nAm I missing any must-watch comedies out there? \nOpen to anything with smart humor, absurd comedy or dark ",
        "upvotes": 4,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1qm9bng/looking_for_new_comedy_suggestions_am_i_missing/"
    },
    {
        "id": "1qlg076",
        "author": "ashbat1994",
        "title": "Why can't I watch end credits on TV anymore?",
        "content": "I like to sit with the end credits for a while to absorb and contemplate what I've experienced. I've disabled autoplay but after finishing any movie or show I get a giant ad on what to watch next with the end credits being in a tiny box. \n\nEarlier I could go and choose to watch credits but now any any navigation remote button I press just completely stops it. It's been happening since the past week or so, completely frustrating and dampens the experience.",
        "upvotes": 198,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1qlg076/why_cant_i_watch_end_credits_on_tv_anymore/"
    },
    {
        "id": "1qmkz97",
        "author": "Zarguthian",
        "title": "Any way to watch Netflix on unsupported bowsers?",
        "content": "I really like watching Netflix but much prefer Maxthon as my web browser. The app is actually just a Microsoft Edge add-on. Whenever I try to watch on Maxthon I get:\n\n&gt;Sorry, we're having trouble with your request.  \nError Code UI3012",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qmkz97/any_way_to_watch_netflix_on_unsupported_bowsers/"
    }
]