[
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 75,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lsbeqy",
        "author": "WinAdmirable5400",
        "title": "Have the small pictures been removed when rewinding?",
        "content": "When I try to rewind or fast forward there used to be an image of each 5-10 second increment on the bottom. Now there’s only a blank grey square. Is this a new thing? It feels like it’s intentional and not a bug. I don’t like it.",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lsbeqy/have_the_small_pictures_been_removed_when/"
    },
    {
        "id": "1ls96gx",
        "author": "nee_m_d",
        "title": "Any way of NOT getting suggested movies/series in foreign language",
        "content": "Hi, I'm relatively new to Netflix. I've set English as my preferred language in my profile, but I keep getting suggestions for movies that aren't in English. It's frustrating, especially since the language or country of origin often isn't shown until you actually start watching. I mostly want to watch US or UK-made movies. Is there a way to set my preferences so that only those kinds of movies are suggested?",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ls96gx/any_way_of_not_getting_suggested_moviesseries_in/"
    },
    {
        "id": "1lrzxxf",
        "author": "Blitzo-with-silent-O",
        "title": "Netflix better be making the third The Old Guard movie.",
        "content": "I will be so upset if they do not make another one.  Especially after the ending of the second movie left us hanging like that. They better be giving us a third one or I will quit Netflix for good.",
        "upvotes": 26,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1lrzxxf/netflix_better_be_making_the_third_the_old_guard/"
    },
    {
        "id": "1ls40hy",
        "author": "BUckENbooz91",
        "title": "Is Kingdom worth the investment to watch?",
        "content": "I've always loved zombie films. There's a lot of Korean films I've enjoyed, as well as series like Squid Game, All of Us Are Dead, Train to Busan, Sweet Home and much more. I won't lie when I tried to watch the first episode I was dosing off to sleep almost. It was pretty late, but I remember it feeling like it was just dragging on. I started the second episode and about half way got distracted. I'm considering starting over again as I'm looking for something to watch. Please let me know what you guys thought of Kingdom, and no spoilers for me, please! ",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ls40hy/is_kingdom_worth_the_investment_to_watch/"
    },
    {
        "id": "1lrwuqw",
        "author": "StarMasterAdmiral",
        "title": "Just got the new interface and it's horrible!",
        "content": "Like many others, we just got the new interface. One of the worst I've used. I have no clue how Netflix can say that this was preferred by users. I'm considering cancelling. Worst of all, why don't any of the major streaming providers just give users their choice? ",
        "upvotes": 42,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1lrwuqw/just_got_the_new_interface_and_its_horrible/"
    },
    {
        "id": "1ls47fp",
        "author": "Z0CH0R",
        "title": "Dept Q - Were Carl being followed during his investigation ?",
        "content": "Hi guys,\n\nWhen I first watched the show, upon episode 6, when Carl and Akram go into questioning Fergus about the investigation, he was beaten by some guy.\n\nWhen Carl returns to the precinct, he pulls over and the camera then stays for a full frame on this dark red Mercedes slowing down and then stopping after his Ford.\nFor me this was not some useless detail because it seemed the camera followed this car on purpose, also it caught my eye because it was the same color as Carl's car. \n\nI found it quite bizarre and decided to remember this bit if it comes back later.\nFor me, this car seemed to have followed Carl. Especially after Fergus told them that he was beaten by someone who they suspect is hurting him for cooperating with the investigation.\nThis seemed very odd.\n\nThen episode 9, revelation : we see Ailsa, Lyle's mother, trying to run away on the ferry with the same burgundy red Mercedes. The license plate matches the one following Carl in ep 6. So it was the same Mercedes who stopped behind Carl. It's not possible to see exactly who the driver is... \n\nSo I'm just wondering :\n* Do you think Lyle and his mother were following Carl and Akram during their investigation?\n* Were they the one hurting Fergus to silence him?\n* What this not extremely stupid since \"Sam\" was supposed to be dead? Being caught still alive is risky? \n\nMy take is that it must have been Lyle following Carl but it throws everything upside down knowing that Lyle was following the investigation... \nLyle has the capabilities to spy and stalk since he did that to Merritt. (like the scene where he is behind the window watching from outside before William, Merritt's brother sees him and  screams, to later recognize him on the boat).\nHe was also not always guarding Merritt and not always on the island, her mother did most of the job of keeping her enclosed.\nSo maybe, he was spending his time following Carl?\nBut for what? Taking this chance of being discovered is for me really risky, what is the point? \nAlso, if you're a cop, normally you can spot someone tailing you. \n\nDid you also catch this detail or is this new to you ?\n\nLet me know, I'd love to hear your theories! :) ",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ls47fp/dept_q_were_carl_being_followed_during_his/"
    },
    {
        "id": "1lrhmhg",
        "author": "Maison-Ikkoku",
        "title": "The horrific new Netflix user interface … venting",
        "content": "I am just venting here out of frustration with the not so new anymore Netflix user interface. Many of you probably like it or have adjusted to it, as Netflix’s own research would suggest, but I could not. I tried, I really tried. \n\nA discussion on the drawbacks of the interface has been exhausted so I will not get into it. What I would add is that I noticed that I have been recently spending more time on Apple TV and HuLu. Not out of stubbornness or revenge, but it came organically. The interface of all three platforms is now very similar with the Netflix one being mid pack. I can no longer tell the difference so I would watch whatever is good. I think the new Netflix interface is an opportunity for other streaming platforms to catch up with Netflix and get new subscribers. It might also be the beginning of Netflix’s decline or at best plateau.",
        "upvotes": 270,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1lrhmhg/the_horrific_new_netflix_user_interface_venting/"
    },
    {
        "id": "1ls4ru5",
        "author": "Lunally",
        "title": "Help me understand this scam",
        "content": "So my partner just noticed that there was a subscription charge from netflix coming out of his personal bank account, when our netflix account has been linked to our joint bank card for a while now (but used to be coming out of his personal card). I searched on our account and there were no trace of this in our payment history.\n\nI called Netflix and within minutes they found the scam and said this will be blocked and we won't have any more issues.\n\nWe also got an email from Netflix addressed to someone else saying the subscription had been cancelled, and to contact them if we didn't request this change.\n\nWhat exactly happened here? Did someone create a different account with my partner's email and bank card? I don't understand how they could get both his card details and his email address, and how could Netflix see that it was a scam so quickly without asking us any security questions or anything else? Thanks!",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ls4ru5/help_me_understand_this_scam/"
    },
    {
        "id": "1lsabak",
        "author": "ArcticSnow85",
        "title": "Detective Conan!",
        "content": "I’m so excited they picked up one of my favorite anime! It’s been years since the last English dub, and now tubi and Netflix are dropping new episodes (New to English dubbed)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lsabak/detective_conan/"
    },
    {
        "id": "1lse8yy",
        "author": "grindingcoffeebean",
        "title": "Poop Cruise (Spoiler)",
        "content": "I just finished watching this documentary and I’m absolutely furious for no reason about the compensation that the passengers faced! Would you have accepted it? I hope the staff got a massive bonus too !",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lse8yy/poop_cruise_spoiler/"
    },
    {
        "id": "1lse2ng",
        "author": "East_Veterinarian_51",
        "title": "Survey on Netflix’s recommendation system",
        "content": "Hi all, I’m writing a dissertation about the netflix recommendation system and how it affects viewership. Please could you fill out this surgery, it takes literally 2 mins\n\nThank you!!!!!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lse2ng/survey_on_netflixs_recommendation_system/"
    },
    {
        "id": "1ls94b7",
        "author": "Elegant_Tower7813",
        "title": "How to disable games from Netflix when viewing in browser",
        "content": "Hello, I use Netflix exclusively on my PC through a web browser, never through my phone or an app. How do I turn off the game advertisements/recommendations? I have never clicked on a game or expressed interest in them, so I am not sure why they started appearing. ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ls94b7/how_to_disable_games_from_netflix_when_viewing_in/"
    },
    {
        "id": "1ls8z5i",
        "author": "VesnaKostic",
        "title": "Recommendation for a TV show where a person imagines a relationship with someone \nand has its own reality that has no relation to the real world",
        "content": "\n\nRecommendation for a TV show where a person imagines a relationship with someone. As if they are in a serious relationship, but they are not. But not Baby Reindeer, that's what I watched, and I would like something darker and more twisted. It doesn't even have to be a relationship, but a series where a person has his OWN REALITY that has nothing to do with real life.\n\n\n\nSPOILERS!!! \n\nLike Emma Beesly in Clicbait",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ls8z5i/recommendation_for_a_tv_show_where_a_person/"
    },
    {
        "id": "1ls7s4y",
        "author": "Friedspam808",
        "title": "Sequel for Kpop Demon Hunters???",
        "content": "Personally I loved it!!!!! Tbh my boss even recommended this to me even though she only exclusively watch murder-mistery/thriller shows. \n\nI love their friendship, it feels silly and genuine, like my own in real life.\n\nI loved Jinu too, I hope he can come back for the sequel (somehow) an I kind of home they add a little romance too.\n\nI also hope they don't rush the makings of a sequel and botch it though. That's the last thing I want.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ls7s4y/sequel_for_kpop_demon_hunters/"
    },
    {
        "id": "1ls4c7g",
        "author": "Beginning-Visit523",
        "title": "Hating half shows and movies",
        "content": "The old guard 2, squid game being split between seasons, sandman season 2... What's up with contents being released unfinished recently ??\n\nI want a movie to have a beginning, a middle part, and an end. Same with seasons. Each season has a point, hate it when it's cut in half just for farming releases ",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ls4c7g/hating_half_shows_and_movies/"
    },
    {
        "id": "1lsawq0",
        "author": "Averyhandsonuncle",
        "title": "Continue watching plays a show i watched days ago!",
        "content": "I was watching supernatural few days ago and i saw old guard 2 is out and when I clicked watch now, it went to a random supernatural episode! I've noticed this is happening a lot. I clicked sienfeld and it went to a movie i watched last month on a random scene! Sometimes when I play a supernatural episde it'll toss me like 2 episodes to a while season back. Please help this is beginning to frustrate my why pay for borderline torture netflix ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lsawq0/continue_watching_plays_a_show_i_watched_days_ago/"
    },
    {
        "id": "1ls6uyk",
        "author": "Top-Three-USA",
        "title": "Squid Game creator Hwang Dong-hyuk says Season 3’s ending cameo isn’t linked to the U.S. spin-off and confirms no official talks with Netflix yet",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ls6uyk/squid_game_creator_hwang_donghyuk_says_season_3s/"
    },
    {
        "id": "1ls6dlo",
        "author": "ZaRyU_AoI",
        "title": "Series/Movies similar to Arcane and Cyberpunk:Edgerunners",
        "content": "Hi, I'm looking for series/movies similar to Arcane and Cyberpunk Edgerunners, in terms of plot, music, and theme.\n\nAny recommendations?\n\nAlso, got recommended KDH recently.. is it similar?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ls6dlo/seriesmovies_similar_to_arcane_and/"
    },
    {
        "id": "1ls9kep",
        "author": "dimsy_dum",
        "title": "is there any tips on how to recover my account?it was stolen fee weeks ago",
        "content": "i try to call the displayed number but didnt work,and the customer service also sucks. i contact like 10 times and theyre answer always the same. due to bla bla bla. they dont even ask me any question ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ls9kep/is_there_any_tips_on_how_to_recover_my_accountit/"
    },
    {
        "id": "1ls5mcg",
        "author": "10happinessesinasock",
        "title": "Orchestral/instrumental ost for kpop demon hunters",
        "content": "Where\nPlease\nI need the part where &gt;!rumi gets exposed to zoe and mira!&lt; and also the part where she is running after the first golden performance\n\nI love the kpop songs to bits but where is the ost ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ls5mcg/orchestralinstrumental_ost_for_kpop_demon_hunters/"
    },
    {
        "id": "1ls0xq4",
        "author": "Laymanluminary",
        "title": "[SPOILERS - DARK] Science is the reality.",
        "content": "\n\nJust now completed DARK. Idk whether someone got this thought, but I felt like saying this- \" Science doesn't need the story of Adam and Eve. They are just glitch in the matrix. All in reality only science prevails.\"\n\n A subtle but amazing metaphor!\n\n(Just my pov, no offense to any religious person)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ls0xq4/spoilers_dark_science_is_the_reality/"
    },
    {
        "id": "1lro42d",
        "author": "obeseelise",
        "title": "Bad Influence: Kidfluencer Documentary",
        "content": "Holy crap. I can’t believe this isn’t being talked about more. I have a few questions because I’m noticing there’s a surprisingly low amount of online discussion or attention brought to this. \n\nFirst, why is there no Wikipedia or other discussion for information related to Tiffany Smith and the lawsuit brought against her?\n\nSecond, how is Piper’s content today even legal? I’m so disgusted just searching her name looking for a discussion on this and seeing soft core porn of a 17 year old. It breaks my heart for her. \n\nThird, how is Tiffany not in jail? Why does it seem that we are saying this behavior and online kiddy porn is ok? \n\nI’m just shocked and feel like there neeeds to be more attention and discussion on this. ",
        "upvotes": 13,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lro42d/bad_influence_kidfluencer_documentary/"
    },
    {
        "id": "1lrvegw",
        "author": "ListeningPlease",
        "title": "What happened ed to categories? I hate this new layout.",
        "content": "I already hated the last layout. It made it difficult to find anything. Now we have this horrible layout. It's basically what Disney, Hulu, and Amazon have. I literally stayed on Netflix because it was easier to find things. Now we have this horrible layout with even less filters. Give me filters. Let me find what I'm looking for. These layouts are literally making me not want to use the apps. ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lrvegw/what_happened_ed_to_categories_i_hate_this_new/"
    },
    {
        "id": "1lrxld4",
        "author": "GrudginglyHufflepuff",
        "title": "I’m looking for a show about True Mexican Ghost Stories that used to be on Netflix (maybe 8 years ago?)",
        "content": "My husband says he remembers he watched true ghost stories about Mexico on Netflix about 8 or so years ago. He remembers one of the stories was about a recent widow who moved into a large, cheaply priced home with her children and a newborn. She soon found out it was haunted by a witch-like woman. I can’t seem to find it or what it is called. Does anyone remember the name of this docuseries? And where I can watch it?  \n\n\nEdit: My husband says it’s not Haunted: Latin America ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lrxld4/im_looking_for_a_show_about_true_mexican_ghost/"
    },
    {
        "id": "1lrugs6",
        "author": "DiamondDependent7641",
        "title": "Ragnarok",
        "content": "I just finished watching Rangarok on Netflix finally, and I realized that the ending just showed that all of the things about God's and Giants was all in Magne's head, I think that the ending wasn't that great. I mean it's good that they got a happy ending, but I feel like the show should've showed more than a happy ending, I understand that the struggle was internal but I just feel like it could've been better, it could've been so much better. But other than that I loved the show it was a good show, it was a really good modern telling of Ragnarok and I loved it.",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lrugs6/ragnarok/"
    },
    {
        "id": "1ls0vq6",
        "author": "manse10000",
        "title": "Fanfic sequel ideas to K-Pop Demon Hunters.",
        "content": "If Netflix is to craft a captivating Kpop: Demon Hunters sequel or trilogy, each installment should deepen our connection with Zoey and Mira, allowing for rich character development and a broader exploration of the band's journey. With the first film centering on Rumi, I have exciting fan fic ideas for the sequels that will elevate the story and keep viewers hooked. \n\nIntroducing the second installment of the gripping trilogy—a riveting story centered on Zoey, an Asian American singer of Huntr/x navigating the treacherous entertainment world. When Huntr/x arrives in Burbank, California to perform, the film exposes the industry's dark secrets across America, revealing how record labels and entertainment giants exploit artists for profit. Behind the dazzling facade, issues like institutional racism and cultural exploitation threaten artists like Zoey, who confront these challenges fueled by past betrayals and a thirst for justice. Teaming up with a former Korean-Vietnamese American actor and singer— a who was an old friend of Zoey—the team embarks on a mission to dismantle the corrupt power structures. Together, they uncover a conspiracy rooted in hypocrisy, theft, and manipulation, aiming to expose those who exploit artists and dismantle broken bands. Little do they know, this former stat has other plans for the group. This movie delves into themes of resilience, identity, and redemption within an industry rife with deception—an unmissable story of courage and truth.\n\nIn the thrilling final chapter of the trilogy, follow Mira—a descendant of Korean warriors and the estranged daughter of wealthy weapons manufacturers—as she seeks refuge in music to escape her violent legacy. Joining the acclaimed group Huntr/x, their rise sparks fierce international rivalry among South Korea, China, and Japan, who send their pop groups into intense competition. But as tensions escalated, ancient demon armies led by vengeful spirit kings threatened to destabilize the world, feeding on conflicts between the three nations to dominate their countries and expand their empires. Amidst the chaos, Mira uncovers a profound truth: music’s power to transcend borders, heal wounds, free spirits, and unify people. This epic tale celebrates courage, culture, and hope, showcasing how harmony can triumph over chaos in a fractured world.\n\nThese are my fan fic pitches. What are your fan fic ideas for Netflix's beloved movie sequels?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ls0vq6/fanfic_sequel_ideas_to_kpop_demon_hunters/"
    },
    {
        "id": "1ls077x",
        "author": "ThrowAwayAAHHAAAAAA",
        "title": "Is there a limit to how many times you can update Netflix household?",
        "content": "A while back heard there was a 4 times a year limit (to updating households) but I can't find any source for this. Is this true? Or is there actually no limit? Is it okay if I update my household every few months? ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ls077x/is_there_a_limit_to_how_many_times_you_can_update/"
    },
    {
        "id": "1lqtwej",
        "author": "murderedbyaname",
        "title": "The Residence cancelled after one season",
        "content": "",
        "upvotes": 525,
        "comments": 214,
        "media": null,
        "permalink": "/r/netflix/comments/1lqtwej/the_residence_cancelled_after_one_season/"
    },
    {
        "id": "1lqpcog",
        "author": "TudorNut",
        "title": "Netflix show you started with zero expectations but ended up loving?",
        "content": "When I clicked *The Queen’s Gambit*  out of curiosity&lt; didn't intent to watch to the end since I am not into chess. But I ended up completely hooked by the story, the acting, and how intense they made a quiet game feel. Totally surprised me!",
        "upvotes": 795,
        "comments": 652,
        "media": null,
        "permalink": "/r/netflix/comments/1lqpcog/netflix_show_you_started_with_zero_expectations/"
    },
    {
        "id": "1lrvywc",
        "author": "talveznana",
        "title": "Carol and the end of the world - personal opinion",
        "content": "**Sorry for my bad english and word repetition. English is not my native language :)**  \n  \nThe last epsiode shows a agent trying to understand the Carol's influence in office, in relation to the emotional epiphany in the Distraction. The final is discovered that the reason for epiphany is the own agent- in short.  \nThe influence of Carol is that she could bring a emotional conection, a individualization but in the same time a community that one cares about the other. The serie focus on the Carol's search for meaning and conection in the midst (I don't know if the translation is right) of a apocalipse. Carol looking for a value.  \nThe employees try don't lose the sanity with the permanence of the cycle, with the repetition from something that they had already done. They try justify their own existence in office, try distract themselves of the apocalipse. So Carol finds the value on monotomy, a satisfaction. She accepted her situation (the apocalipse) and her state (the work). There is a acceptation to death and routine, and with it, there is also a value.   \nThe insatisfaction about the death can be a insatisfaction about the life. Part of the despair of die is because the person didn't satisfied itself, because someone who stayed good don't care about the death, because this one has been already satisfied, has already with the life \"done\" with the things that the life gave.  \nThe people there stayed in comfort, and try to distract to don't thinking about the discomfort from death. Carol shows a balance between being satisfied with the atual situation but don't get attach, don't being dependent with the life.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lrvywc/carol_and_the_end_of_the_world_personal_opinion/"
    }
]