[
    {
        "id": "1m5mz0x",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Ari Aster - Tuesday 7/22 at 8:00 PM ET - Director of 'Midsommar', 'Hereditary', 'Beau Is Afraid', and 'Eddington'",
        "content": "",
        "upvotes": 28,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/72x90p1t39ef1.png?auto=webp&amp;s=8c888d22734879ddd10b555282ed3da68da67b78"
        },
        "permalink": "/r/movies/comments/1m5mz0x/amaqa_announcement_ari_aster_tuesday_722_at_800/"
    },
    {
        "id": "1m5vn9o",
        "author": "SanderSo47",
        "title": "July 18-20 Box Office Recap – 'Superman' stays #1 on its second weekend, and crosses $400M worldwide. 'I Know What You Did Last Summer' opens with just $12.7M, below the first two films. 'Smurfs' and 'Eddington' flop with $11M and $4.2M, respectively.",
        "content": "https://preview.redd.it/lh89pmj5paef1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=c864d1cb488d08750cb8bdd885c4286a2bbe2524\n\nWith three newcomers failing to make a good impression, ***Superman*** easily kept the top spot for a second weekend with a very solid second weekend drop. ***I Know What You Did Last Summer*** was the top newcomer, but it still wound up below expectations. ***Smurfs*** and ***Eddington*** also flopped, although that's hardly a surprise.\n\nThe Top 10 earned a combined $128.7 million this weekend. That's down 11.5% from last year, when ***Twisters*** led with a pretty great $80 million.\n\n***Superman*** was still #1 with $58.4 million this weekend. That represents a 53% drop, which is solid for a comic book film. It's a bit steeper than ***The Batman*** (50.4%), but better than this year's ***Thunderbolts*** (56.4%). And much better than ***Man of Steel*** (64.6%).\n\nThrough 10 days, the film has earned $236.2 million. Its opening weekend was $3 million behind ***Man of Steel***, but it's now $26 million ahead of it. It's set to finish with over $350 million domestically, although it will still depend on how much it drops when ***The Fantastic Four: First Steps*** debuts next week.\n\n***Jurassic World Rebirth*** dropped 41%, adding $23 million this weekend. The film has amassed $276.4 million, and it's now $27 million behind ***Dominion*** through the same point. And it's gonna get larger now with ***The Fantastic Four*** opening.\n\nDebuting in third place, Sony's ***I Know What You Did Last Summer*** earned a disappointing $12.7 million in 3,206 theaters. That's below the original film ($15.8 million) and the sequel ($16.5 million), and that's despite 27 years of inflation on its side.\n\nSony kept the budget low at $18 million, so it's not really a flop. But it's still a very disappointing debut: Sony resurrected this franchise after 27 years just to have a lower debut than the 90s films? That's gotta sting, at least. After all, ***Scream*** has had a successful relaunch this decade after impressing back in the 90s. How could the same not happen for ***I Know What You Did Last Summer***?\n\nA lot of people are aware of the title, it's very iconic. But knowing something and being interested in it are two different things. Unlike ***Scream***, ***Last Summer*** was never a critical darling, as both films have negative reviews. Sure, it helped launch the careers of many actors, including Jennifer Love Hewitt and Freddie Prinze Jr., which is why they were brought back here. But the 2025 version just didn't really offer anything new or interesting for old fans, and young audiences probably don't care for this franchise even with the young cast attached. The bad reviews (38% on RT) further confirmed that this film was not gonna win over any new fans.\n\nAccording to Sony, the film was 50/50 between men and women. As mentioned, the film didn't really connect with young audiences, which is a big demo for horror: only 34% was 25 and under. They gave it a poor \"C+\" on CinemaScore, which is the worst in the franchise. Given some controversial decisions in the film, it's very likely the film will fall off quickly. The only advantage is that there's no horror competition till ***Weapons*** on August 8. But despite that, ***Last Summer*** won't earn much higher than $30 million domestically, pretty much guaranteed to be the lowest grossing in the franchise.\n\nIn fourth place, Paramount's ***Smurfs*** debuted with a poor $11 million in 3,504 theaters. That's far below any of the ***Smurfs*** films, including ***The Lost Village*** ($13.2 million).\n\nThis is a failure that will surprise absolutely no one. While ***The Smurfs*** was one of the biggest hits in 2011, the popularity quickly dwindled. The sequel opened with just $17 million and capped out at $71 million, while ***The Lost Village*** continued the decline with a $45 million domestic total. The ***Smurfs*** franchise is simply something that just lost whatever popularity it had left.\n\nThe marketing was everywhere, but it just wasn't good in the slightest. The plot is pretty much the same from any of the prior films, failing to overcome the \"been there, done that\" feeling. And yes, every single piece of marketing highlighted the whole \"Rihanna is Smurfette\" tagline, which quickly became tiring and uninteresting. The only advantage it had was that ***Elio*** was already winding down after its poor box office numbers, but the real nail in the coffin for ***Smurfs*** was the reviews: an absolutely dismal 21% on RT. Some animated films are critic-proof, but ***Smurfs*** is not one of those.\n\nAccording to Paramount, 61% of the audience was female, and 59% were parents with a child. They gave it a very lukewarm \"B+\" on CinemaScore, which is poor for an animated film. With ***The Bad Guys 2*** coming up in 2 weeks, ***Smurfs*** is destined to fall off. Right now, it should finish with just $30 million domestically. Is this gonna be the final theatrical release for these little blue demons? \n\n***F1*** rounded up the Top 5 with $9.8 million, which was a light 24% off from last week. The film has earned $153.9 million, and its way to $180 million depends on how much it can hold against ***Fantastic Four***.\n\nUniversal/DreamWorks' ***How to Train Your Dragon*** dipped 32%, earning $5.4 million this weekend. The film has crossed $250 million domestically, and it should finish with around $270 million.\n\nOpening in seventh place, A24 and Ari Aster's ***Eddington*** flopped with just $4.2 million in 2,111 theaters. That's above ***Beau Is Afraid***'s wide debut ($2.6 million), but that's not really saying much, especially because that film was playing in 965 theaters. This debut is also below Aster's ***Hereditary*** ($13.5 million) and ***Midsommar*** ($6.5 million, but it actually debuted on Wednesday).\n\nThe debut is particularly disappointing given that it has the most big names attached to an Aster film (Joaquin Phoenix, Pedro Pascal, Austin Butler and Emma Stone). But the biggest setback was always gonna be its premise: a dark comedy set during the COVID-19 pandemic. It's been 5 years since this happened and audiences are still not looking to revive that period, at least not now.\n\nBut if this and ***Beau*** proved something, is that Aster has still remained a niche director. A24 lost around $35 million on ***Beau*** and they still gave him $25 million to make ***Eddington***, which also flopped. ***Hereditary*** and ***Midsommar*** were successful, but Aster went very experimental and ambitious on ***Beau*** and ***Eddington***. That's bold, but can also alienate audiences and at the end of the day, he's a polarizing filmmaker. The Cannes reviews pretty much confirmed it; it's sitting at a 67% on RT, with reviews divided over \"loving it\" or \"hating it\". The audience just didn't care to find out.\n\nAccording to A24, 61% of the audience was male and 73% was 25 and over. They gave it a weak \"C+\" on CinemaScore, the same grade as ***Midsommar***. With more competition on its way, it's very likely the film will miss $10 million domestically. ***Hereditary*** and ***Midsommar*** were successful, but between this and ***Beau*** flopping, how many blank checks does Aster have left?\n\n***Elio*** dropped 47%, adding $2.1 million. The film has earned a meager $69 million so far.\n\n***Lilo &amp; Stitch*** dropped 41%, for a $1.5 million weekend. The film's domestic total stands at $418.2 million for now.\n\nRounding out the Top 10 is ***28 Years Later***, which dropped 52% and added $1.3 million this weekend. The film has earned $69 million, and it's set to close with around $73 million domestically.\n\n#**OVERSEAS**\n\nThe big story is ***Lilo &amp; Stitch***, which became the first Hollywood title of the year to hit the $1 billion milestone. Earning $4.7 million overseas, the film has made $1.008 billion so far, making it the second biggest film of the year behind ***Ne Zha 2***. The best markets are Mexico ($67M), UK ($48.9M), France ($42.4M), Brazil ($37.4M), Germany ($32.4M), Spain ($27.4M), China ($25.2M), Italy ($25.1M), Australia ($21.1M) and Argentina ($20.1M).\n\n***Superman*** added $45.2 million this weekend, taking its worldwide total to $408 million. It had pretty good holds across the board, which is very encouraging after its disappointing start last week. The one place where it fell the most was China, where it collapsed by an insane 94% to just $410K this weekend.\n\nThe best markets for the film are the UK ($22.2M), Mexico ($16.6M), Brazil ($11.2M), Australia ($11M) and China ($8.5M). Should definitely hit $550 million, but the path to $600 million depends on how much it can hold against ***Fantastic Four*** this weekend.\n\n***Jurassic World Rebirth*** added $40.3 million overseas, for a $649 million worldwide total. Its best markets are China ($71.8M), the UK ($33.7M), Mexico ($28.7M), Germany ($20.3M) and France ($17.4M). Should hit $700 million by next week.\n\nIn Japan, history was made. ***Demon Slayer: Kimetsu No Yaiba Infinity Castle*** debuted with a colossal 5.9 billion yen, which is around $36.5 million (some estimates have it at $39.7 million). This is the biggest debut in the country's history, and Hollywood chose to avoid releasing anything in close proximity. This is set for one of the best runs in the history of the country.\n\n***F1*** continues impressing despite the heavy competition. It added $29.5 million, allowing it to cross $300 million overseas, for a $461 million worldwide run. The film is enjoying fantastic holds in markets like China (–37%) and South Korea (+28%). Its best markets are China ($45.5M), the UK ($24.6M), France ($20.8M), Mexico ($17.4M) and Australia ($15.2M). Even with ***Fantastic Four*** coming up, it should definitely cross the $500 million milestone next week, which means it officially recoups its $200 million production investment.\n\n***Smurfs*** saved some face overseas, but its $25 million overseas debut got to a very weak $36 million worldwide debut. France was its best market with $3.7 million, followed by a solid $1.7 million in the UK. The rest was not as great: Brazil at $1.6M, Mexico with $1.5M and Germany at $1.5M. It's clearly a film that will skew heavily overseas, but it's still unlikely it will avoid the flop status.\n\n***I Know What You Did Last Summer*** debuted with $11.6 million overseas, for a $24.3 million worldwide debut. Almost on par with the domestic market, but it's clear the nostalgia wasn't very strong outside America either. Should definitely recoup its $18 million budget, but just like the domestic market, it will be the lowest grossing in the franchise worldwide.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Sinners* | Apr/18 | Warner Bros. | $48,007,468 | $278,578,513 | $365,878,513 | $90M\n\n- Once in a while, in a sea of IPs dominating the film market, there's an original film that manages to break out. And this year, that was ***Sinners***, which closed with a fantastic $278 million domestically and $365 million worldwide. Sold entirely on the names of Ryan Coogler and Michael B. Jordan, the film had one of the greatest runs of the decade: opened with $48 million and then dropped just 4.8% on its second weekend. Aided with an \"A\" on CinemaScore (a feat no horror film achieved since 1982), the film had insane legs, closing with an incredible 5.80x multiplier domestically. Obviously, the domestic market represented 76.1% of its worldwide gross, but that's not really surprising. This film pretty much cements Coogler as a filmmaker whose name is the selling point for audiences and can guarantee success, which is extremely rare to happen. Whatever he does next, the world is ready.\n\n#**THIS WEEKEND**\n\nAnd so another MCU film has arrived. And it's Marvel's First Family.\n\nAfter years of teasing, ***The Fantastic Four: First Steps*** is finally here, the long-awaited arrival of these characters in the MCU. Starring Pedro Pascal, Vanessa Kirby, Ebon Moss-Bachrach, and Joseph Quinn as the titular team, alongside Julia Garner, Natasha Lyonne, Paul Walter Hauser, and Ralph Ineson, it follows the Fantastic Four as they must protect their 1960s-inspired retro-futuristic world from the planet-devouring cosmic being Galactus. The film has achieved high level of interest, as fans are anticipating what the characters will finally get to do in the grand scheme of the MCU. These characters are already confirmed for the next ***Avengers*** films, which helped raise awareness even further. Now is the big question: will the MCU finally deliver the first good ***Fantastic Four*** film?\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 184,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MOTLUSMP5CczPqOfKaXSxxtFRF2AmINbIK07jl4RCMY.png?auto=webp&amp;s=fd74f4d79483f4a666dca1005777c3fb7d3e4b0b"
        },
        "permalink": "/r/movies/comments/1m5vn9o/july_1820_box_office_recap_superman_stays_1_on/"
    },
    {
        "id": "1m5v438",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Avatar: Fire and Ash'",
        "content": "",
        "upvotes": 5972,
        "comments": 898,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mh6p8uizlaef1.jpeg?auto=webp&amp;s=40ed5b3d184efe38400613341979a62bd7d5a44c"
        },
        "permalink": "/r/movies/comments/1m5v438/official_poster_for_avatar_fire_and_ash/"
    },
    {
        "id": "1m5mt8n",
        "author": "MarvelsGrantMan136",
        "title": "Predator: Badlands | Official Trailer",
        "content": "",
        "upvotes": 7399,
        "comments": 1368,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Z-NOuu6_UITXqfhEJMyDJBQXL3OHkHHvqPNeg3o5kus.jpeg?auto=webp&amp;s=a4d1206ac5662c038cca6f18f00f61235cec5dc6"
        },
        "permalink": "/r/movies/comments/1m5mt8n/predator_badlands_official_trailer/"
    },
    {
        "id": "1m5k1ad",
        "author": "ungaayya",
        "title": "First image of Anna Hathaway as Andy Sachs in 'The Devil Wears Prada 2'",
        "content": "",
        "upvotes": 6514,
        "comments": 473,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xoh2bpgyj8ef1.jpeg?auto=webp&amp;s=8b4fdb35fe581c4272ed09b26e2784cb09c5f1f8"
        },
        "permalink": "/r/movies/comments/1m5k1ad/first_image_of_anna_hathaway_as_andy_sachs_in_the/"
    },
    {
        "id": "1m5pe1h",
        "author": "MarvelsGrantMan136",
        "title": "Malcolm-Jamal Warner, ‘Cosby Show’ Star, Dies at 54",
        "content": "",
        "upvotes": 2437,
        "comments": 160,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kirFy4D0L1q3WVPg6-U3q-gznz_KfQK-Ts2UtIx1qrI.png?auto=webp&amp;s=037e40c462d75ea94d9a558e25947f2fd4c6c5b7"
        },
        "permalink": "/r/movies/comments/1m5pe1h/malcolmjamal_warner_cosby_show_star_dies_at_54/"
    },
    {
        "id": "1m5js8o",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Sydney Sweeney as Christy Martin in 'Christy'",
        "content": "",
        "upvotes": 3861,
        "comments": 566,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1vyr8ka5i8ef1.jpeg?auto=webp&amp;s=7c3256ba9d9905c6ab0677d62cd9863a26f5f12b"
        },
        "permalink": "/r/movies/comments/1m5js8o/first_image_of_sydney_sweeney_as_christy_martin/"
    },
    {
        "id": "1m5l74e",
        "author": "ChiefLeef22",
        "title": "Guillermo Del Toro's 'Frankenstein' has a runtime of 2 hours and 29 minutes.",
        "content": "",
        "upvotes": 2556,
        "comments": 156,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Lgk1AE15QljUelhhrWwkRgWe7jUwbAD_YvB6U7C6254.jpeg?auto=webp&amp;s=0c5ebe1122defe6e54f94eb2a02ec29dd83e6983"
        },
        "permalink": "/r/movies/comments/1m5l74e/guillermo_del_toros_frankenstein_has_a_runtime_of/"
    },
    {
        "id": "1m5x5mu",
        "author": "AngryGardenGnomes",
        "title": "Friendship is simply Tim Robinson being dropped into a tense A24 family drama movie and reacting to it",
        "content": "It was dark and impactful, while remaining ridiculously funny throughout. Tim Robinson's casting was inspired. \n\nIt was not the type of movie I was expecting, to say the least. So surreal and unpredictable. A really cool modern fresh tone, as well. It didn't feel like some Apatow rip off, for example. I mean, I was expecting it to be flipping weird, because it's Robinson, but boy did he still surprise me. \n\nAndrew DeYoung, genius! A writer director we should all be keeping an eye on. I'm thinking the next James Gunn. I'm unfamiliar with his prior work - but this looks like his first high profile feature, at least. I see he worked on Lil Dicky TV show Dave - which was also dope.\n\nThis movie Friendship was so freakin good and felt so much like a feature length sketch in I Think You Should Leave, I was under the impression the whole time that it was written by Robinson. There were frequent moments that felt like a series of mini sketches interlaced into the plot, like the part with the toad and the subway. Just genius.\n\nIt was all so wildly unpredictable, at any given moment. Like when Robinson's character Craig is getting berated by some random stranger who then goes on some mad Afghanistan rant, absolutely loved it. DeYoung, if you ever read this, you are a legend. Hats off too, ya! Keep'em coming. \n\nAnd what a performance! Good grief, it was like the ultimate Tim Robinson role. I honestly hope we see more movies where he's just playing this weird angry version of himself, that we all know and love from his show, sort of like what Chaplin did with the Tramp.\n\nThere were quite a few moments that felt Chaplin-esqe. Especially the moment where he &gt;!flopped through the glass door!&lt;. That was so perfectly executed, sort of like a Checkhov's gun pay off moment. As soon as he enters the room, that &gt;!sliding glass door is in the back of your mind!&lt;. Plus, it's so perfectly set up right at the beginning of the movie.\n\nThen, there were the final close up shots that kind of reminded of the ending of Chaplin's City Lights (1931). Where Craig and Austin (Rudd) &gt;!are just staring at each other. Austin gives him a wink and the mad Craig gleefully leers back at him from the back of the police car. He's in pure bliss. The friendship in some weird form is intact again. Craig got what he wanted.!&lt; Credits roll. Glorious.\n\nAnd the soundtrack, I have to mentiom the soundtrack before even the cast. Wow. Such amazing music and really enhanced the mood. It was such a bizarre psychedelic experience, and dark, just so dark to see this relatable dude completely unravel and become more and more insane as the movie progressed to that explosive conclusion. \n\nThe cinematography was great too. It didn't 'look like a comedy' movie, it seemed like it was almost shot like a thriller. It looked fantastic. Dark and bleak, sort of like a British movie. Reminded me of Black Bag (2025), same sort of colour palette and cold desensitised corporate look in places. \n\nKate Mara put in a wonderful subtle performance as the wife. You could see the exact moment she realised she was done with this guy, before she slips away from him in the sewer. \n\nPaul Rudd was just marvellous, like Robinson, perfectly cast. It was cool to see he was one of the producers. (Hah, love this detail I just saw on Wiki: 'Rudd's character was originally named Brian in the script. When Rudd was cast, he requested that this be changed to avoid confusion with his Anchorman character and personally suggested the name Austin.'\n\n(I wish they had stuck with the Anchorman name. I think would have added to the surrealism.)\n\nAnother great cast member was the young Billy Bryk as' T-Dog'. I can see him going places.",
        "upvotes": 618,
        "comments": 120,
        "media": null,
        "permalink": "/r/movies/comments/1m5x5mu/friendship_is_simply_tim_robinson_being_dropped/"
    },
    {
        "id": "1m5oz8y",
        "author": "MarvelsGrantMan136",
        "title": "'Wonder Woman' Taps 'Supergirl' Writer Ana Nogueira for DC Studios Film",
        "content": "",
        "upvotes": 1155,
        "comments": 267,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DCyP2ih-gcv3N1exolxIZz7cbIL4XrDBEJGlEsGttfU.jpeg?auto=webp&amp;s=7ccb714a00a2b33d8e18c19ffbed77ecd934bf09"
        },
        "permalink": "/r/movies/comments/1m5oz8y/wonder_woman_taps_supergirl_writer_ana_nogueira/"
    },
    {
        "id": "1m5x72o",
        "author": "KillerCroc1234567",
        "title": "'Avatar: Fire and Ash' Trailer to Play in Theaters Before 'The Fantastic Four: First Steps'",
        "content": "",
        "upvotes": 382,
        "comments": 109,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FlmOjqrmMSpB0NTnYnI2bfpTT4N2v-M040U6oAEpuMk.jpeg?auto=webp&amp;s=7f17e973894a559fd1fe7f7b43af19c2c6a804da"
        },
        "permalink": "/r/movies/comments/1m5x72o/avatar_fire_and_ash_trailer_to_play_in_theaters/"
    },
    {
        "id": "1m5lzkb",
        "author": "Task_Force-191",
        "title": "First Image of Alan Cumming and Brian Cox in 'Glenrothan' - After 35 years apart, Donal returns from Chicago to help his estranged brother Sandy save their crumbling Highland whisky distillery as old wounds resurface and they confront the past and each other in a story of regret and reconciliation",
        "content": "",
        "upvotes": 1376,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ckx26ybdx8ef1.jpeg?auto=webp&amp;s=49d79687465f4122ead5b914b6c1167f6b32b992"
        },
        "permalink": "/r/movies/comments/1m5lzkb/first_image_of_alan_cumming_and_brian_cox_in/"
    },
    {
        "id": "1m5ucui",
        "author": "DemiFiendRSA",
        "title": "Matthew Broderick’s Closet Picks",
        "content": "",
        "upvotes": 428,
        "comments": 361,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-Evrtfb_kcoes4a9MNlc9pZxX6z4--2eWEV2wbuKLys.jpeg?auto=webp&amp;s=7817a51d6f0e6be7e6a72390abe1382962f91555"
        },
        "permalink": "/r/movies/comments/1m5ucui/matthew_brodericks_closet_picks/"
    },
    {
        "id": "1m5mumf",
        "author": "LunchyPete",
        "title": "Adria Arjona Joins Michael B. Jordan's 'The Thomas Crown Affair'",
        "content": "",
        "upvotes": 730,
        "comments": 102,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wyyDyQEl5wlNYOFUhSVLJDnB0Fr5R2Q73sKk39MjfGw.jpeg?auto=webp&amp;s=f582e2f83b824d80c1ed79ddac1d0da466c27499"
        },
        "permalink": "/r/movies/comments/1m5mumf/adria_arjona_joins_michael_b_jordans_the_thomas/"
    },
    {
        "id": "1m5mvin",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Predator: Badlands'",
        "content": "",
        "upvotes": 710,
        "comments": 97,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/agmllx3939ef1.jpeg?auto=webp&amp;s=868244b8c5e4a156c49d8001fbcc4c1afddca7b9"
        },
        "permalink": "/r/movies/comments/1m5mvin/new_poster_for_predator_badlands/"
    },
    {
        "id": "1m5y6gx",
        "author": "Task_Force-191",
        "title": "Official Poster for 'No Other Choice' - Directed by Park Chan-wook ('Oldboy', 'The Handmaiden', 'Decision to Leave') starring Lee Byung-Hun, Son Ye-jin - After being unemployed for several years, a man devises a unique plan to secure a new job: eliminate his competition.",
        "content": "",
        "upvotes": 145,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dngey9z88bef1.jpeg?auto=webp&amp;s=6a695a20bf2941b63d374ee4926510ff4e16133b"
        },
        "permalink": "/r/movies/comments/1m5y6gx/official_poster_for_no_other_choice_directed_by/"
    },
    {
        "id": "1m5fjw5",
        "author": "LordKevnar",
        "title": "Which disaster movie had the best depiction of societal collapse?",
        "content": "Every disaster movie I've ever seen had all the dramatic destruction scenes, explosions, buildings collapsing, tsunamis hitting. But few of them show society actually breaking down, the panic, the looting, the chaos. That's where the real terror comes in for me. That turns it from Hollywood spectacle, to real life apocalypse.\n\nSo far, the movie that's come the closest was Greenland. World War Z was also pretty good. Zombies aren't real, but if they were, that's how it would go down. I haven't seen The Day After Tomorrow in about 40 years, but I seem to remember they did a pretty good job with society breaking down, too.\n\nWhat are your picks?\n\nEdit: I forgot about Don't Look Up. That movie was amazing.",
        "upvotes": 1295,
        "comments": 987,
        "media": null,
        "permalink": "/r/movies/comments/1m5fjw5/which_disaster_movie_had_the_best_depiction_of/"
    },
    {
        "id": "1m5jzme",
        "author": "ungaayya",
        "title": "First Image of Chris Evans in 'Sacrifice'",
        "content": "",
        "upvotes": 664,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gc3kgyumj8ef1.jpeg?auto=webp&amp;s=ce21722b39c12c001902e342655d4604690dd3bd"
        },
        "permalink": "/r/movies/comments/1m5jzme/first_image_of_chris_evans_in_sacrifice/"
    },
    {
        "id": "1m585th",
        "author": "zip9990",
        "title": "Have you ever paid to see a movie twice in a theater?",
        "content": "Someone recently told they have seen movies they liked so much that they have returned to the theater to watch it again before it was released on DVD or streaming. Just curious if anyone else has done this and what movie or movies they have felt compelled to see twice before they were available for viewing elsewhere.",
        "upvotes": 4666,
        "comments": 6956,
        "media": null,
        "permalink": "/r/movies/comments/1m585th/have_you_ever_paid_to_see_a_movie_twice_in_a/"
    },
    {
        "id": "1m5xy6h",
        "author": "Task_Force-191",
        "title": "NO OTHER CHOICE - Official Teaser Trailer - Coming Soon",
        "content": "",
        "upvotes": 98,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p1qRjA8XhBklI_yvvDPlmS4mlJj-W57u1k6h21xqYJ4.jpeg?auto=webp&amp;s=14825d90d335c6d1eeef2d654fdf22a657ffd168"
        },
        "permalink": "/r/movies/comments/1m5xy6h/no_other_choice_official_teaser_trailer_coming/"
    },
    {
        "id": "1m5k98y",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Josh Gad &amp; Kaya Scodelario in Alex Winter's 'Adulthood' - When siblings uncover a long-buried corpse in their parents’ basement, they stumble into a wildly escalating spiral.",
        "content": "",
        "upvotes": 443,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zgk8tsmhl8ef1.jpeg?auto=webp&amp;s=b1d4fa4139071a324f03f9228fda2c5b5c3ba20e"
        },
        "permalink": "/r/movies/comments/1m5k98y/first_image_of_josh_gad_kaya_scodelario_in_alex/"
    },
    {
        "id": "1m5msin",
        "author": "MarvelsGrantMan136",
        "title": "KEEPER - Teaser Trailer - In Theaters November (Directed by Osgood Perkins)",
        "content": "",
        "upvotes": 301,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/t1Mklub045RvByh1WeLFASLyEKMsNeBtcNU_1chnJy4.jpeg?auto=webp&amp;s=471f3d789f8591317a54db9c90bc54f1a8f40b23"
        },
        "permalink": "/r/movies/comments/1m5msin/keeper_teaser_trailer_in_theaters_november/"
    },
    {
        "id": "1m5l41f",
        "author": "MoneyLibrarian9032",
        "title": "First image of Gus Van Sant’s ‘DEAD MAN’S WIRE’, starring Bill Skarsgård, Colman Domingo and Dacre Montgomery. The hostage thriller follows a man who takes a mortgage banker who did him wrong hostage, demanding $5 million and a personal apology.",
        "content": "",
        "upvotes": 252,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/86q3hjcgr8ef1.jpeg?auto=webp&amp;s=6383f733139a2a91c219a2528e0c621017e749ae"
        },
        "permalink": "/r/movies/comments/1m5l41f/first_image_of_gus_van_sants_dead_mans_wire/"
    },
    {
        "id": "1m5kxxt",
        "author": "Task_Force-191",
        "title": "First Image of Nic Pizzolatto 'Easy's Waltz' starring Al Pacino, Kate Mara, Vince Vaughn, Shane Gillis, Cobie Smulders – A fading Vegas crooner gets a shot at redemption from an old-school showbiz legend, but his brother’s betrayal and his own self-destructive habits threaten to derail his comeback",
        "content": "",
        "upvotes": 242,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9gtgjipaq8ef1.jpeg?auto=webp&amp;s=1e0c71a7a8230b257fc391029a1388a39df6e0ac"
        },
        "permalink": "/r/movies/comments/1m5kxxt/first_image_of_nic_pizzolatto_easys_waltz/"
    },
    {
        "id": "1m5xf54",
        "author": "Flibs-",
        "title": "Ink (2009) is one of the coolest low budget movies ever made IMO.",
        "content": "",
        "upvotes": 44,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TK09aUtrlLkExhvadp_GkKkh2WJyT_nW8ZqcMuBRB5s.jpeg?auto=webp&amp;s=a1ce73a6c2ff97e9f2516c6af152c7cce179f34d"
        },
        "permalink": "/r/movies/comments/1m5xf54/ink_2009_is_one_of_the_coolest_low_budget_movies/"
    },
    {
        "id": "1m5kxnb",
        "author": "animeking1074",
        "title": "FIRST OFFICAL IMAGE of Amanda Seyfried in Mona Fastvold’s ‘THE TESTAMENT OF ANN LEE’ Premiering at TIFF50 - An epic fable about religious leader Ann Lee (Amanda Seyfried), who was proclaimed by her followers as the female Christ and went on to build one of the largest utopian societies.",
        "content": "",
        "upvotes": 182,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8o47a73wp8ef1.jpeg?auto=webp&amp;s=4864b41127803f49e343beeca91be080c850e051"
        },
        "permalink": "/r/movies/comments/1m5kxnb/first_offical_image_of_amanda_seyfried_in_mona/"
    },
    {
        "id": "1m5ttxk",
        "author": "NoCulture3505",
        "title": "Katie Holmes To Write, Direct &amp; Lead ‘Happy Hours’ Film Trilogy; Joshua Jackson Co-Stars",
        "content": "",
        "upvotes": 62,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OWzdm0KVGh0pviVad1Yz_oIK_6gmktKnYfcEb0IoG_c.jpeg?auto=webp&amp;s=a9ec5d9a26b0a5b7679c054a980c598253eb9d9f"
        },
        "permalink": "/r/movies/comments/1m5ttxk/katie_holmes_to_write_direct_lead_happy_hours/"
    },
    {
        "id": "1m5k54p",
        "author": "KillerCroc1234567",
        "title": "First Image from Steven Soderbergh's 'The Christophers'",
        "content": "",
        "upvotes": 166,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sz27kyuok8ef1.jpeg?auto=webp&amp;s=9d75ec3a99607e5bde302012d0211cd78be2975d"
        },
        "permalink": "/r/movies/comments/1m5k54p/first_image_from_steven_soderberghs_the/"
    },
    {
        "id": "1m5v2yw",
        "author": "ubcstaffer123",
        "title": "'Jaws' will soon be re-released in theaters in IMAX and 3D. Here's when",
        "content": "",
        "upvotes": 49,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aTS8k1vbxCVYmdEgKrCz_njFACYtcexNhXJFaVQOVIo.jpeg?auto=webp&amp;s=e6ce9dd8fa4a2f328a19877cb8df6c3bbf1e29d6"
        },
        "permalink": "/r/movies/comments/1m5v2yw/jaws_will_soon_be_rereleased_in_theaters_in_imax/"
    },
    {
        "id": "1m60uvj",
        "author": "c1121123211234321",
        "title": "Folks who would generally consider yourself to have \"good taste\" in movies, what's a bad movie that you secretly love?",
        "content": "Not bad in the sense of \"campy/low budget/over the top but has a cult following.\" A truly bad movie that just hits right but you could never defend. I'll go first: Catwoman (2004.) \n\nTo hit the character minimum: I also love Latter Days (2003,) a gay movie from the era where there were occasionally movies made FOR gay men, but few thoughtful films ABOUT queer people. The budget is low, the script is cringe, the acting is... there. One scene borders on softcore. But I have loved it since I was a teen and it's still a comfort watch.",
        "upvotes": 15,
        "comments": 78,
        "media": null,
        "permalink": "/r/movies/comments/1m60uvj/folks_who_would_generally_consider_yourself_to/"
    },
    {
        "id": "1m5l88n",
        "author": "NoCulture3505",
        "title": "‘In a Violent Nature 2’ Starts Production in September in Canada",
        "content": "",
        "upvotes": 81,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CIR2e-5g4ndXrWQuLZVhSAD3-hruZBKX_H9XZkgtpCc.jpeg?auto=webp&amp;s=afc83ec62633d323c8970b190c961f0a86164988"
        },
        "permalink": "/r/movies/comments/1m5l88n/in_a_violent_nature_2_starts_production_in/"
    },
    {
        "id": "1m4r9t3",
        "author": "bluenowait",
        "title": "‘Pee-wee’s Big Adventure’ Original Red Bike Acquired by the Alamo",
        "content": "",
        "upvotes": 5740,
        "comments": 259,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CxoSr0H-xNJU4lr5MFZrAP10xFlEXQdK1H-RedyOIdY.jpeg?auto=webp&amp;s=002cbce532100c0a8026eb4d45a002bebfbd5371"
        },
        "permalink": "/r/movies/comments/1m4r9t3/peewees_big_adventure_original_red_bike_acquired/"
    }
]