[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 495,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1im280c",
        "author": "Sweaty-Toe-6211",
        "title": "Duffer Brothers Confirm No Spin-Offs: Stranger Things Characters Won’t Return After Season 5!",
        "content": "",
        "upvotes": 113,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1im280c/duffer_brothers_confirm_no_spinoffs_stranger/"
    },
    {
        "id": "1ilv83j",
        "author": "VerdeAzul74",
        "title": "Best Netflix documentaries that I may have missed?",
        "content": "I’ve seen quite a few documentaries on Netflix and am looking for something recommended. What do you recommend based on what I’ve seen? Favorites are marked with a *\n\nAmerican Murder\n\nAmerican Nightmare*\n\nThe Deepest Breath*\n\nFyre\n\nGirl in the Picture\n\nInto the Deep*\n\nInto the Fire*\n\nThe Staircase\n\nSweet Bobby\n\nThe Tinder Swindler\n\n\nI’ve seen more but I’m drawing a black rn. Also tried Wild, Wild Country but the scenes of nudity were too much. Likewise, tried Don’t F with Cats and I can’t stand watching animals being harmed and the same would go for Blackfish.",
        "upvotes": 61,
        "comments": 128,
        "media": null,
        "permalink": "/r/netflix/comments/1ilv83j/best_netflix_documentaries_that_i_may_have_missed/"
    },
    {
        "id": "1im9xzu",
        "author": "Atlast_2091",
        "title": "Cobra Kai: Season 6 Part 3 Sneak Peek | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1im9xzu/cobra_kai_season_6_part_3_sneak_peek_netflix/"
    },
    {
        "id": "1im7ssh",
        "author": "meepmeepbinch",
        "title": "Why did Anna Delvey go to jail, but not Belle Gibson?",
        "content": "After watching these two Netflix shows, I wonder why didn't Belle Gibson get sent to jail, I feel like what she did in comparison to what Anna Delvey did was WAYYYY worse. What do you think? \n\nEdit for typo. ",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1im7ssh/why_did_anna_delvey_go_to_jail_but_not_belle/"
    },
    {
        "id": "1im2yxv",
        "author": "S4v1r1enCh0r4k",
        "title": "Five Fast and Furious movies are leaving Netflix on February 12th, some of them will be available on Peacock",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1im2yxv/five_fast_and_furious_movies_are_leaving_netflix/"
    },
    {
        "id": "1imapxt",
        "author": "Scout1228",
        "title": "Anyone else hate this?",
        "content": "I am seriously getting traumatized by the booming noise that assaults me even when I click for more info on a movie. Why is this necessary? Anyone else hate this on Netflix?\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1imapxt/anyone_else_hate_this/"
    },
    {
        "id": "1il84am",
        "author": "Dreambeamed",
        "title": "Kinda pregnant - only about 15 minutes into the movie and already a little grossed out?",
        "content": "Anyone else think Amy Schumer saying sexually explicit dialogue to minors in high school in the classroom scene pretty wrong....? I'm only about 15 minutes in and had to post on Reddit about it find someone who felt the same. Am I crazy 😭\n\nJust seems a little inappropriate and a desperate attempt to be funny....\n\nAnd I just now saw a scene where she criticizes another character for being a teacher and being inappropriate 🤷‍♀️\n",
        "upvotes": 542,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/1il84am/kinda_pregnant_only_about_15_minutes_into_the/"
    },
    {
        "id": "1im4nlb",
        "author": "forlornforbit",
        "title": "Enjoying the zaniness of Celebrity Bear Hunt but the game logic makes no sense!",
        "content": "Celebrity Bear Hunt is a fun show, undoubtedly. But every episode I watch leaves me a little but perplexed / annoyed by the lack of logic in the rules of the competition and how Bear approaches it.\n\nFirstly, the way people get selected for the Bear Pit. On some episodes this makes sense but on others it doesn't. On the episode where they cross the rope bridge, Bear or the producers decided that Shirley wouldn't face the Bear Pit even though she was directly responsible for her team's loss.\n\nOnce in the Bear Pit, the rules about who gets caught and who gets eliminated seem completely arbitrary.\n\nIt's very obvious Bear isn't putting much effort into hunting contestants. He often sees a contestant in close proximity, and decides not to chase after them, even though he could easily catch them.\n\nThen the decision about who gets eliminated is for some reason divorced from the actual outcome of the Bear Pit. Surely, if 4 people are in the pit, trying not to get caught, and 1 of them is going to be eliminated... then the first person caught should be eliminated. Or the last one to escape. That would be an objective way to decide.\n\nBut no, the decision is made separately by Bear (or producers) - he's using evidence from their performance in the Bear Pit, but making a subjective judgement about who deserves to go. We have seen players get caught in traps really early through stupid decisions, and then be allowed to stay because Bear preferred to eliminate someone else - even though that person evaded capture much longer.\n\nOne final point - what is the point of Holly Willoughby being employed as a presenter on this show? She has such a minimal role. She isn't involved at all in the Bear Pit and isn't even present when Bear decides who is going to be eliminated. \n\n",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1im4nlb/enjoying_the_zaniness_of_celebrity_bear_hunt_but/"
    },
    {
        "id": "1ilqi9a",
        "author": "Responsible-Spot9317",
        "title": "Who here likes ZeroCalCare, Masameer and Bad Exorcist",
        "content": "Has anyone seen these shows",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ilqi9a/who_here_likes_zerocalcare_masameer_and_bad/"
    },
    {
        "id": "1ilzj21",
        "author": "enkicreator",
        "title": "Shoes not working when on WiFi",
        "content": "Hi all! Anyone else experiencing issues in watching shows when connected to the WiFi? Almost everything I want to watch doesn’t appear on the search and when I scroll to find it it’s either greyed out or it says “remind me”. When I use data everything is available again. First time this happened. Anyone else?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ilzj21/shoes_not_working_when_on_wifi/"
    },
    {
        "id": "1ilp72h",
        "author": "90PoundsOfFury",
        "title": "Received new Netflix account emails, but I never signed up. Contacted Netflix to cancel the account and they said I had to contact Verizon (partner) to cancel it. I don’t have an account with Verizon, and Verizon said there’s nothing they can do.  How do I ensure this account is cancelled?",
        "content": "When I spoke with Netflix, they said only Verizon can cancel the partner account.  Verizon says they can’t do anything because there is no phone account and can’t search by email address at all.  ",
        "upvotes": 11,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ilp72h/received_new_netflix_account_emails_but_i_never/"
    },
    {
        "id": "1ilwqpc",
        "author": "AlternativeCoyote413",
        "title": "Are The Diplomat &amp; The Night Agent of the same universe?",
        "content": "The ending credits are almost identical and both have themes around crimes within the government. It could be different timelines now and soon we’ll see the same Presidents in the others plot? Thoughts?",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ilwqpc/are_the_diplomat_the_night_agent_of_the_same/"
    },
    {
        "id": "1iljq2i",
        "author": "KitchenBeneficial302",
        "title": "4 Films from Netflix Animation in 2025",
        "content": "# Four Films from Netflix Animation\n* In Your Dreams - February 28, 2025 (limited), March 7, 2025 (Netflix)\n* The Twits - June 13, 2025\n* Untitled Charlie Bean, Paul Briggs and John Ripa film - July 25, 2025\n* Untitled Don Bluth, Gary Goldman and Dexter Fletcher film - November 21, 2025",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iljq2i/4_films_from_netflix_animation_in_2025/"
    },
    {
        "id": "1im0cri",
        "author": "ChiliPeppa_Squirrel",
        "title": "Night Agent Season 2 Question (Spoilers)",
        "content": "I just finished watching Night Age Season 2, and I’m not happy with it. I thought Season 1 was excellent, but this season felt all over the place.\n\nFirst off, Rose was incredibly annoying. She couldn’t decide if she wanted to stay or go back to California; she flip-flopped like four times in a single episode!\n\nThen there’s the whole Iranian involvement… which left me completely confused. What exactly was their role in all of this? It felt like they were introduced, but their purpose wasn’t clearly explained.\n\nAnother thing that bothered me: they never mentioned the name of the mysterious country the Bala family is from. Why keep that a secret?\n\nAnd speaking of the Bala family; why would Vickor Bala use the chemical KX on his own people? That made no sense to me. Now he suddenly wants revenge on the U.S.? For what exactly? His motivations just felt weak.\n\nOverall, the season didn’t make much sense to me. But back to my main question: What was the Iranians’ involvement? It really confused me, and I’d love to hear what others think.\n",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1im0cri/night_agent_season_2_question_spoilers/"
    },
    {
        "id": "1iljxmn",
        "author": "Atlast_2091",
        "title": "Is Friendly Rivalry (2025) kdrama series coming to netflix?",
        "content": "My subscriptions currently on-hold for valentines. So, I can't remember if I mark (notify) this show before pausing monthly plan. If you need info about the show [Trailer](https://youtu.be/_keUPuita5Q?si=oDgv8WqVTpmEGFFK) \\- [MyDramaList](https://mydramalist.com/764499-friendly-competition) ",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iljxmn/is_friendly_rivalry_2025_kdrama_series_coming_to/"
    },
    {
        "id": "1im1lwq",
        "author": "ametist0",
        "title": "Brightness Changes From Subtitles M1 iPad Pro",
        "content": "Whenever I turn the subtitles on, the bright parts of the screen become darker when they appear. Also, the black bars on the screen turn much brighter. This issue does not exist when I turn off the subtitles. I found a lot of complaints about this, but the only fix I could find is to stop using subtitles altogether.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1im1lwq/brightness_changes_from_subtitles_m1_ipad_pro/"
    },
    {
        "id": "1im4832",
        "author": "Neat_Stick_5902",
        "title": "Some netflix shows are not available",
        "content": "So apparently even if you pay for a netflix membership some of the shows or movies now are not available unless you upgrade to the ad free version. Pretty sure we are just canceling it at this point",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1im4832/some_netflix_shows_are_not_available/"
    },
    {
        "id": "1ilmsy9",
        "author": "cardsrealm",
        "title": "Apple Cider Vinegar (Series): True Story, Synopsis, Trailers and Cast!",
        "content": "",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ilmsy9/apple_cider_vinegar_series_true_story_synopsis/"
    },
    {
        "id": "1ilaxzi",
        "author": "Robemilak",
        "title": "Ben Affleck to Replace Matt Damon in Netflix Thriller 'Animals'",
        "content": "",
        "upvotes": 20,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ilaxzi/ben_affleck_to_replace_matt_damon_in_netflix/"
    },
    {
        "id": "1im0i88",
        "author": "okaybhaii",
        "title": "Ladies and Gentlemen! Swades💗✨",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t1k7d40ei9ie1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1im0i88/ladies_and_gentlemen_swades/"
    },
    {
        "id": "1im1pfs",
        "author": "ForeverOrdinary3361",
        "title": "Your device isn’t part of the Netflix Household for this account",
        "content": "For context, my dad pays for the account, my family is in Oman and for the past two years, I am in India due to college. However I had no issues watching Netflix, where I even watched a movie on Netflix just last week on my laptop. These past two years in India, I have actively used Netflix on my laptop.\n\nSince yesterday, I am facing this issue, which honestly sucks because I frequent use Netflix. What can I do?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1im1pfs/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1ilp3ok",
        "author": "photon1701d",
        "title": "Ad Tier",
        "content": "I have not had Netflix for a few years.  I signed up only for royal rumble last week and bought the ad tier.  There are a few things I want to see.  The ad's only come up once or twice a movie, 15 seconds, so it's tolerable.  Is that normal or after a month, you get more ad's.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ilp3ok/ad_tier/"
    },
    {
        "id": "1ikq32a",
        "author": "peoplemagazine",
        "title": "Prince Documentary Featuring Abuse Claim by Ex Killed by Netflix as Estate Plans New Film",
        "content": "",
        "upvotes": 200,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ikq32a/prince_documentary_featuring_abuse_claim_by_ex/"
    },
    {
        "id": "1ilryha",
        "author": "Sigfried_D",
        "title": "My Netflix profile disappeared, Help?",
        "content": "I have a rather terrifying suspicion of what may have caused this to happen:  \nI had a PfP from The Dark Crystal and when I went to restore it I noticed those were all gone.\n\nI swear if Netflix deleted my entire profile with all my watching history and MY LIST just bc that PfP was removed from the system I am cancelling my subscription.\n\nThis could be the last drop.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ilryha/my_netflix_profile_disappeared_help/"
    },
    {
        "id": "1ikrhzw",
        "author": "I_ReadThe_Comments",
        "title": "I’m obsessed with the show “MO.”",
        "content": "It’s informative, funny, heartwarming, heartbreaking. It touches ALL aspects of life in the U.S. as a Muslim, Jew, Hispanic, a man on the spectrum. And it all focuses around a family of refugees from war torn Palestine.\n\nDon’t do what I did and sleep on this show.",
        "upvotes": 122,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1ikrhzw/im_obsessed_with_the_show_mo/"
    },
    {
        "id": "1ilk8ji",
        "author": "KitchenBeneficial302",
        "title": "Netflix Animation New Shows, New Special and New Short Series",
        "content": "# Netflix Animation Shows\n* Long Short Story (The Tornante Company/ShadowMachine) \n* Wolf King (Jellyfish Pictures/Lime Pictures)\n* DJ Lance and the Upbeat Retreat! animated revival (Happy Nest/WildBrain/Gigglebug Entertainment)\n* Super Itzy (9 Story Media Group/Brown Bag Films/Atomic Cartoons)\n* Bia and the Beats (Birdo)\n* Let's Go, Red Velvet! (9 Story Media Group/Brown Bag Films/SM Entertainment/Titmouse, Inc.)\n* Stranger Things: Visions (Upside Down Pictures/21 Laps Entertainment/Monkey Massacre)\n* Squid Game Presents: Diabolical (Siren Pictures Inc.)\n* Zhongguo Yidai: Generation China (Pearl Studio)\n* Ranza (Snowflake Films NYC/Imagine Kids+Family/Alcon Television Group)\n* Agent Kyary Pamyu Pamyu (Cusack Creatures/Hermit House/Paper Kite Productions/Justin Roiland's Solo Vanity Card Productions/Harmonius Claptrap/Princess Pictures/Bento Box Entertainment)\n\n# New Special\n* Beyond the Yellow Brick Road (Laughing Wild/Rocket Entertainment/Higher Ground/Edelgang Worldwide/Mikros Animation/Cinesite)\n\n# Short Series\n* Past, Present &amp; Future (Marza Animation Planet)\n* Press Start, Level One (Proximity Media/DNEG Animation)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ilk8ji/netflix_animation_new_shows_new_special_and_new/"
    },
    {
        "id": "1ilma2k",
        "author": "16177880",
        "title": "Whenever I want to watch a show on Netflix that has a sequel currently in theaters, it suddenly becomes unavailable.",
        "content": "I am in Germany currently and the shows I have watched before suddenly disappears and i have to rent it from YouTube to watch it. \n\nIt happened countless times, it is so frustrating. I watched Bear paddington more than a year ago and now it is missing since paddington 2 is in theaters. Such bull... Why do I even pay sh.t. for subscription.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ilma2k/whenever_i_want_to_watch_a_show_on_netflix_that/"
    },
    {
        "id": "1ilsz8y",
        "author": "ThrowRA-fattcake",
        "title": "Why does my netflix say i watched episodes when i didnt?",
        "content": "Hey there! Idrk how else to say this, but ill watch a series, for example breaking bad, s1 ep 1, then ill turn it off, and when come back next day netflix says \"Start season 1 Episode 4.\" Im pretty sure it isnt hackers because it only happens on shows IM watching. Any clue as to what it is? im using netflix on apple TV if this helps",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ilsz8y/why_does_my_netflix_say_i_watched_episodes_when_i/"
    },
    {
        "id": "1ilrmn1",
        "author": "222befree",
        "title": "The Night Agent S2 👎🏽",
        "content": "season 1 was so good so naturally i had high expectations for season 2, but i had to force myself to get through it. It was so much going on that it was dofficult to keep up with the connections of the plot or have real interest in them. Peter carried the show but Rose seemed unnecessary and in the way this season. I strongly disliked the fact that Peter told her he couldnt keep her safe but she ended up staying anyway 😑 looking forward to season 3 but hoping it'll be paced. Everything about season 2 seemed to be rushed and forced  ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ilrmn1/the_night_agent_s2/"
    },
    {
        "id": "1iklucu",
        "author": "Alone-Application454",
        "title": "Night agent season 2 is horrible",
        "content": "24 js my favorite show of all time so as a 24 fan i adored season 1 of the night agent. But season 2 is just strange. Firstly the episodes are just straight up boring. No fights are high adrenaline scenes. Just conversations that feel meaningless to the plot. Rose is actually unbearable with her storyline of constantly changing her mind about staying or leaving was so frustrating to watch and it just feels ljke theyre forcing her into the show. Big boss lady is awful and horribly acted. Peter feels like a shell of himself in this season and half the episodes is just his relationship with rose. Its all awful. The final problem with this season is the muslim people always speaking that language. I dont have any problem with muslims or their language but o hate that half the episode isnt captioned and half of it is and when it is the conversations still feel pointless. Who else agrees?",
        "upvotes": 87,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1iklucu/night_agent_season_2_is_horrible/"
    }
]