[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 14,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1pypmn5",
        "author": "Medium_Woodpecker887",
        "title": "Ma solo io ne ho le p... Piene dei cosiddetti Maranza??",
        "content": "Non mi interessa se sono pericolosi o no,sono comunque  disadattate per la maggior parte,,non voglio avere nulla a che fare,fanno venire la depressione,abbasso i Maranza,hanno rovinato i Torino.Datemi pure della persona che fa pregiudizi ma sembranot utti uguali,col loro ciuffo da bambino,la tuta tech o quella cavolata, TikTok,fisico da scaricatore di porto,zero personalità,arabi,le ragazze tutte da loro vanno almeno quelle adolescenti.Ben vengano i movimenti anti maranza.",
        "upvotes": 8,
        "comments": 28,
        "media": null,
        "permalink": "/r/torino/comments/1pypmn5/ma_solo_io_ne_ho_le_p_piene_dei_cosiddetti_maranza/"
    },
    {
        "id": "1pykez2",
        "author": "Long-Cat1830",
        "title": "Amicizie millenial, metal, dark humor, montagna e dintorni",
        "content": "Ciao a tutti, so che ci sono già molti post cerca amicizie ma sentivo il bisogno di inserire qualche specifica in più. \nHo 31 anni, donna, molto introversa ma ammetto che vorrei qualche conoscenza in più anche banalmente per scriversi e a volte vedersi. Interessi che mi piacerebbe condividere: artigianato, montagna, campeggio, musical alternativa, estetica gothic, argomenti scientifici, psicologici, linguistici, antropologici, DnD, dark humor, hobby silenziosi, natura, minimalismo, ambientalismo.\nLavoro come sarta ma ho studiato linguistica e mi interesso di pensiero scientifico. Autistica (ma non troppo XD) e misofonica, quindi a parte qualche birra (rigorosamente da Skjuma) o museo devo escludere posti affollato, cibi croccanti, incontri con più di 3/4 persone... Mi piacerebbe incontrare gente per visitare mostre, fare escursioni in montagna, giochi da tavolo/tè/puzzle in casa ecc. Una frequenza gestibile per me è una volta al mese più o meno, per il resto mi piacerebbe avere amici con cui scriversi.\nNo drammi, no gossip, no falsità o gesti di convenienza. Mi piacciono le persone curiose e riflessive, mi piace imparare da chi ne sa di più.\nSono a Torino nord.\nSaluti :)",
        "upvotes": 15,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1pykez2/amicizie_millenial_metal_dark_humor_montagna_e/"
    },
    {
        "id": "1pyqijk",
        "author": "Competitive_Pool7136",
        "title": "🥍 Vuoi provare uno sport nuovo a Torino? Giochi (o hai giocato) a lacrosse? Sei in Erasmus?",
        "content": "Ciao! Siamo la **sezione Lacrosse del CUS Torino** e stiamo **reclutando nuovi giocatori e giocatrici** per le nostre squadre!  \n👉 **Nessuna esperienza richiesta**: ti insegniamo tutto noi.\n\n💥 **Cerchiamo**:\n\n* Ragazzi e ragazze **in Erasmus a Torino** che vogliono continuare a fare sport\n* Studenti/lavoratori torinesi che vogliono **provare uno sport di squadra diverso dal solito**\n* Ex giocatori o semplici curiosi (sì, anche se non hai mai visto una partita!)\n\n📍 Allenamenti a Torino (Corso Enrico Tazzoli, 78 - 10137 Torino)  \n🤝 Ambiente super internazionale e inclusivo  \n🔥 Sport veloce, fisico e divertente\n\n📲 Scrivici in DM su Instagram @**torinolacrosse**  \n📧 Oppure via mail: [**lacrosse@custorino.it**]()\n\nSe hai domande, **commenta pure sotto** o contattaci direttamente.  \n**Ti aspettiamo in campo!** 🥍💪\n\nhttps://preview.redd.it/okufzm8656ag1.png?width=1620&amp;format=png&amp;auto=webp&amp;s=dd8daa490d4e9fcabd36a1e2a5b2bc51c8e5ab86\n\nhttps://preview.redd.it/fwmsfruq46ag1.png?width=1460&amp;format=png&amp;auto=webp&amp;s=6cd32249dc6f566f3f720fe19c59957552864dfd\n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pyqijk/vuoi_provare_uno_sport_nuovo_a_torino_giochi_o/"
    },
    {
        "id": "1pyl398",
        "author": "SkyOk1181",
        "title": "Aiuto: esperto per rimozione muffa",
        "content": "Ciao a tutti!  Qualcuno conosce un bravo specialista per rimuovere la muffa, possibilmente con prezzi onesti? Sto cercando qualcuno affidabile nella mia zona e ogni consiglio è ben accetto. Grazie mille in anticipo!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pyl398/aiuto_esperto_per_rimozione_muffa/"
    },
    {
        "id": "1pyrs4q",
        "author": "rightedo",
        "title": "Questo capodanno mi tocca passarlo a Torino, ma ho una soluzione per fine gennaio",
        "content": "Se stai leggendo significa che 1) anche tu a capodanno non hai programmato niente e/o 2) magari sei curioso di cosa si potrebbe fare per recuperare la tristezza accumulata.\n\nPropongo un idea per una breve fuga al caldo in questi freddi giorni invernali. Si tratta di 9 giorni (8 notti) a Fuerteventura, con partenza/ritorno da/al’aeroporto di Bergamo (dunque ben collegati da Torino).\n\nIn passato ho vissuto diversi mesi alle Canarie, senza però avere l’opportunità di visitare Fuerteventura. Mi sento comunque di consigliare un programma di viaggio incentrato sull’esplorazione dell’isola e un po’ di surf.\n\nDurante la vacanza, suggerisco di gravitare intorno alla città di Corralejo, questo per due motivi: disponibilità di servizi (supermercati o locali per la sera) e vicinanza agli spot di surf. Se accetti il “rischio” di non avere tutte le notti coperte già all’arrivo, io prenoterei solo 4 notti a Corralejo così da farsi un idea una volta arrivati. Potrete poi decidere se eventualmente spostarvi o prolungare.\n\nAltro importante suggerimento è quello di dedicare del budget per l’affitto di un auto. In generale le Canarie offrono ottimi servizi bus sulle isole principali, ma alcuni luoghi magici valgono la pena di essere visitati all’alba o al tramonto. Per i più poverelli come me, se alloggiate in ostello non siate timidi a proporre (o accettare) una gita affittando un auto in giornata da CICAR (una compagnia locale molto consigliata).\n\nSto pensando di aprire un canale social che offra idee di viaggi comodi da Torino. Pensate possa essere una buona idea?",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/52k36oosd6ag1.jpeg?auto=webp&amp;s=4d544f1f20824d06fb20a08bfda8d1d2efb7f2b9"
        },
        "permalink": "/r/torino/comments/1pyrs4q/questo_capodanno_mi_tocca_passarlo_a_torino_ma_ho/"
    },
    {
        "id": "1pyrr1r",
        "author": "ConstructionAny6977",
        "title": "Posto al barbillar",
        "content": "Ciao ragazzi, stasera io e 3/4 amici vorremmo andare al Barbillar e nessuno di noi c’è mai stato, ho provato a chiamare ma non risponde nessuno. Che voi sappiate si può/deve prenotare?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pyrr1r/posto_al_barbillar/"
    },
    {
        "id": "1py4ooo",
        "author": "AlternativeTea2226",
        "title": "Accompagnatrici A Torino Per Donne .",
        "content": "Ciao, spero di non essere fraintesa, sono una ragazza di 24 anni lesbica, dopo una lunga serie di inculate e tragedie nelle relazioni e dopo aver trovato tanta gente di merda ho preso una pausa dalla vita sentimentale e ho deciso di concentrarmi su me stessa e sul guarire anche da tutto questo . Peró, avvolte sento il bisogno di una presenza femminile, e mi sento sola, mi piacerebbe passare delle serate o delle occasioni o giornate con qualcuna (non sto cercando rapporti sessuali di nessun tipo, solo compagnia, massimo massimo coccole), possibilmente non eccessivamente piú grande di me, ma sui siti di incontri la situazione rischia di farsi seria, e io non voglio ritrovarmi coinvolta sentimentalmente ne coinvolgere qualcuno che magari si fa delle speranze, dopo tanti mesi di ricerche mi sono un po arresa e vorrei optare per un'accompagnatrice, ma non voglio una escort, voglio qualcuno che faccia l'accompagnatrice solo ed esclusivamente per donne, e che magari sia lei stessa lesbica, vorrei che la cosa fosse piacevole per entrambe e non una costrizione per l'altra persona, o sarei io la prima a sentirmi a disagio e a rifiutare . Sarebbe bello magari trovare qualcuno che cera la mia stessa cosa e lo farebbe gratis . Aiuti ? Di accompagnatrici per uomini c'è ne sono tante, neanche mezza per donne peró . Sto cercando su Torino massimo massimo Piemonte . Potete aiutare una povera lesbica col cuoricino spezzato che vuole compagnia ? Grazie in anticipo 😂 .",
        "upvotes": 20,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1py4ooo/accompagnatrici_a_torino_per_donne/"
    },
    {
        "id": "1pyjijy",
        "author": "culturejunkiee",
        "title": "NYE in Torino",
        "content": "Hey everyone! \n\nI’m spending New Year's Eve in Torino and I'm looking for some party recommendations. I’m mainly into House, Disco and Electro.\n\nI’ve seen the event at Audiodrome, but since it's a bit far from the center, I’m worried about the commute back and forth at night. Does anyone know of any clubs or events closer to the city center (Quadrilatero, San Salvario, or Vanchiglia) that play these genres?\n\nAny tips on local venues or specific NYE parties would be much appreciated! Grazie!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1pyjijy/nye_in_torino/"
    },
    {
        "id": "1pyjvf7",
        "author": "ccrriissttian",
        "title": "localini soft",
        "content": "buondì a tutti, sono un terrone trasferito a Torino per lavorare da poco più di un mese.\nQuando non lavoro esco con un collega con l’identica situazione, ma dopo un po’ subentra la noia essendo sempre solo noi, volevo farmi consigliare qualche locale di “movida” (o semplicemente gente che beve due birre o qualche calice di vino) dove ci siano persone predisposte nel conoscere nuova gente. Nella mia città son pieno di amici ed uscivo tutti i giorni, forse è per questo che casa lavoro mi stia pesando. Ringrazio in anticipo, accetto ogni consiglio 🙏🏻",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pyjvf7/localini_soft/"
    },
    {
        "id": "1py0rp2",
        "author": "Conan5678",
        "title": "A Torino da qualche anno, cerco nuove amicizie tranquille 🌿",
        "content": "Ciao!\nVivo a Torino da circa tre anni e mi piacerebbe conoscere nuove persone con cui far nascere un’amicizia genuina senza pretese.\n\nMi piacciono le cose semplici e rilassate: passeggiate, aperitivi, chiacchiere senza stress, musei, curiosare per la città e lasciarsi ispirare dal mondo intorno.\nHo anche un forte interesse per la natura, il folclore e l’esoterismo.\n\nPer me è fondamentale un clima aperto, rispettoso e sereno: cerco persone LGBT-friendly, tranquille e lontane da atteggiamenti omofobi o giudicanti.\n\nSe ti va di fare due passi, bere qualcosa o semplicemente scambiare due parole e vedere se nasce una bella amicizia, scrivimi pure 🌙",
        "upvotes": 17,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1py0rp2/a_torino_da_qualche_anno_cerco_nuove_amicizie/"
    },
    {
        "id": "1pyiy3b",
        "author": "republicflags",
        "title": "Prova Orange Palestre",
        "content": "Qualcuno ha un codice invito per la prova gratuita di una settimana delle palestre Orange ? Grazie",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pyiy3b/prova_orange_palestre/"
    },
    {
        "id": "1pyh3ym",
        "author": "Foreign_Network1009",
        "title": "Traveling from Spain to Turin next february and looking to buy tickets for the family to see Juventus Lazio",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pyh3ym/traveling_from_spain_to_turin_next_february_and/"
    },
    {
        "id": "1px78st",
        "author": "OnuzzoT",
        "title": "Oggi in visita, dalla Basilica di Superga!",
        "content": "",
        "upvotes": 504,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2k8fhn3wzs9g1.jpeg?auto=webp&amp;s=145c82f1614110aaf3eba8c4e79b140330a09f33"
        },
        "permalink": "/r/torino/comments/1px78st/oggi_in_visita_dalla_basilica_di_superga/"
    },
    {
        "id": "1pxnzdw",
        "author": "nickname1917",
        "title": "L'aria di Torino non si vede...",
        "content": "Questo tappetino è stato un mese su un un balcone...mi chiedo i nostri polmoni nel frattempo...\n\nhttps://preview.redd.it/18f5v97i6x9g1.png?width=1440&amp;format=png&amp;auto=webp&amp;s=3cb9f45936738cab98ed5b199d3f37d054bc1b29\n\n",
        "upvotes": 24,
        "comments": 40,
        "media": null,
        "permalink": "/r/torino/comments/1pxnzdw/laria_di_torino_non_si_vede/"
    },
    {
        "id": "1py855z",
        "author": "giakka1071",
        "title": "Borsa di studio postepay",
        "content": "Vorrei chiedere a chi lo sa dove si può usare. Io sto provando dappertutto e non funziona, c'è scritto che si dovrebbe poter utilizzare per acquisti online e non a patto che rispettino le categorie sulle quali puoi sfruttare questa borsa di studio. \nPer dire c'è anche intrattenimento: ho provato a comprare online un biglietto del cinema e non funziona.\n\nLo chiedo qui perché da quel che ho capito la fa il comune, credo e quindi magari qualcuno di Torino sa usarla. Mi scuso per questa domanda che mi sembra stupida ma davvero non so più come usarla e non vorrei sprecarla🙏",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1py855z/borsa_di_studio_postepay/"
    },
    {
        "id": "1pwu9ej",
        "author": "raramoss",
        "title": "Incidente san salvario.",
        "content": "Buongiorno a tutti. \nSabato scorso, 20/12 alle 4 del mattino è successo un incidente in via saluzzo, n. 97 con la mia macchina e più tre che erano parcheggiate, sappiamo che il conducente era un’auto bianca con il tetto rosso, questa persona ha chiamato un carro atrezzi e è scapata, quindi non ha lasciato nessuno numero di telefono oppure targa. Qualcuno di voi ha visto qualcosa che possa aiutare?",
        "upvotes": 49,
        "comments": 28,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kev1aexazp9g1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/torino/comments/1pwu9ej/incidente_san_salvario/"
    },
    {
        "id": "1pwyi35",
        "author": "Competitive-Sky712",
        "title": "Biglietto GTT. Come scopro se è usato o meno?",
        "content": "Ho trovato un biglietto nel portafoglio e non ricordo se lo ho già usato o meno. Qual è il modo più furbo per controllare se è ancora utilizzabile ovviamente senza salire su di un mezzo?",
        "upvotes": 20,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/54y550yi6r9g1.jpeg?auto=webp&amp;s=8fb6216de169a8d51aa780294b12b147c78d3752"
        },
        "permalink": "/r/torino/comments/1pwyi35/biglietto_gtt_come_scopro_se_è_usato_o_meno/"
    },
    {
        "id": "1px7r9t",
        "author": "Glauco1",
        "title": "locali tranquilli aperti di notte",
        "content": "Salve a tutti! Ogni weekend il locale sotto casa mette la musica ad alto volume, disturbandomi. Volevo quindi sapere se esistessero bar o locali tranquilli in cui è possibile stare al chiuso (possibilmente anche fino all'una di notte) a leggere/studiare nei giorni di venerdì e sabato. Vanno bene anche posti tipo aule studio o biblioteche. Grazie mille a tutti!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1px7r9t/locali_tranquilli_aperti_di_notte/"
    },
    {
        "id": "1pwzbqh",
        "author": "Beneficial_Koala_882",
        "title": "Waiting at Porta Nouva....",
        "content": "Hello guys , I hope everyone is having good vacations , I wanted to ask something , I have a flight from Turin airport on the morning of 9th January and I am currently in Savona, I have to look for suitable ways to come to airport, however I found a flixbus that takes me from genoa principe to turin porta nouva , having a 1:30 minutes stay at the porta nouva bus stand , I was wondering considering the weather conditions and safety purposes is it fine to book that bus or should i consider coming to Turin a night before , staying there at someone's place. Or are there any other options to commute before 8 in the morning from Savona or Genoa. \n\nLooking for answers , Thank you ",
        "upvotes": 3,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1pwzbqh/waiting_at_porta_nouva/"
    },
    {
        "id": "1pwp7eg",
        "author": "Kernel_907",
        "title": "Dove trovare una bicicletta?",
        "content": "Ciao ragazzi, non conosco bene la città, mi servirebbe una bicicletta perchè mi trasferisco a breve a Santa Rita e potrebbe rivelarsi fondamentale! \nQualcuno sa dirmi dove posso trovarne di usate a veramente bassissimo prezzo? Davvero a me basta che pedali 😅\nGrazie (e buon fine feste a tutti)",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1pwp7eg/dove_trovare_una_bicicletta/"
    },
    {
        "id": "1pwjnu6",
        "author": "NoResponsibility151",
        "title": "Appena trasferiti a Torino: Musei Card e visita al Museo del Cinema",
        "content": "Ciao a tutti!\n\nSiamo argentini e ci siamo trasferiti da poco a Torino, quindi stiamo iniziando a conoscere la città   \nHo appena comprato la Musei Card e questa domenica pensavo di andare al Museo Nazionale del Cinema.  Se qualcuno ha voglia di unirsi, è il benvenuto!  \nAccetto volentieri consigli su altri musei, ad esempio il Museo Egizio o il Museo Lavazza.\n\nMi fa molto piacere per praticare l’italiano, e se volete praticare lo spagnolo, volentieri 😄",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1pwjnu6/appena_trasferiti_a_torino_musei_card_e_visita_al/"
    },
    {
        "id": "1pw7ryu",
        "author": "LuxJupiterian",
        "title": "Suggerimenti per nuova camminata montana",
        "content": "Buonasera ragazzi. Sono qui per chiedervi altri suggerimenti per percorsi raggiungibili da Torino (tipo un'ora di macchina o poco più).\nSono già stato nei seguenti luoghi, per farvi un'idea, e vorrei andare in sentieri della medesima difficoltà/bellezza/altitudine, più o meno:\n- Val Chisone, Parco Naturale Orsiera Rocciavrè: 2000 m (rifugio Selleries);\n- Valle Pellice: 1700 m (provincia Villanova d'asti, rifugio Jervis);\n- Nevache: rifugio i Re Magi;\n- Ceresole Reale.\n\nL'importante è che non siano camminate da Pro. \n\nPS. Abbiamo i ramponcini e scarpe adatte, quello sì.\n\nGrazie!\n\n\n",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1pw7ryu/suggerimenti_per_nuova_camminata_montana/"
    },
    {
        "id": "1pwgli4",
        "author": "Cool-Impression6669",
        "title": "Anyone interested in learning Touch Designer?",
        "content": "I have given up on that software more than I can remember it. I always run into some issues with this software and it infuriates me. I am usually good in learning software and good in blender as well, but I just need a study buddy who is not not willing to give up learning this.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pwgli4/anyone_interested_in_learning_touch_designer/"
    },
    {
        "id": "1pw0boc",
        "author": "questionsoftheworld",
        "title": "Cancelling pre-enrollment application after admission to Politecnico Torino",
        "content": "Hello,\n\nI applied to Politecnico di Milano for a master's in Architecture, but the results will come out at the end of May.\n\nIn the meantime, I am also applying for Politecnico di Torino in the 1st call for master's in Architecture. However, if I get in, then I only have until the 30th of April to complete the pre-enrolment deadline for the Study Visa.\n\nNow, if I get admitted to Politecnico Torino and complete the pre-enrollment application for it, and then get into Politecnico Milano, can I then cancel the pre-enrollment for Torino and do another application for Politecnico Milano?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1pw0boc/cancelling_preenrollment_application_after/"
    },
    {
        "id": "1pv9nmy",
        "author": "Spiritual_Cake_9127",
        "title": "Auguri a tutti, tranne a questo idiota tamarro che nonostante la pioggia battente ha ritenuto opportuno applicare dei fuochi d'artificio enormi nel divisorio in mezzo alla strada prima di ripartire a gran velocità",
        "content": "",
        "upvotes": 81,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1u7l21g2jb9g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/torino/comments/1pv9nmy/auguri_a_tutti_tranne_a_questo_idiota_tamarro_che/"
    },
    {
        "id": "1pvng9o",
        "author": "Spirited_Currency_30",
        "title": "Superga",
        "content": "Ciao a tutti. Triplo ringraziamento di: \nCioccolata calda\nPanettone \nCuffie\n\nAdesso essendo una persona che non sa guidare una machina e che patisce il freddo tantissimo... So che si può arrivare con i mezzi a Superga ma la mia paura è se ci sarà la neve.\nQualcuna sa se c'è ne neve in Superga ",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1pvng9o/superga/"
    },
    {
        "id": "1pv5c5t",
        "author": "Terrible_Wrap1928",
        "title": "Il deficente che ci sta terrorizzando a San Salvario con i fuochi d'artificio può smetterla per favore?",
        "content": "grazie ",
        "upvotes": 50,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1pv5c5t/il_deficente_che_ci_sta_terrorizzando_a_san/"
    },
    {
        "id": "1pv4iqm",
        "author": "CieloeMare",
        "title": "TARI Registration Form (Without SPID)",
        "content": "Is there a guide to fill out the Tari Registration Form? I couldnt find any. \nAre there things to be careful about?\nIs there a way to get free assistance?\nThanks in advance.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1pv4iqm/tari_registration_form_without_spid/"
    }
]