[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1n5hs8a",
        "author": "drgigabit",
        "title": "Why's there so much dog 💩?",
        "content": "Just the title. Don't want to be rude (there's thousands of things I love about this city), but it seems like I have to keep my head down when I walk anywhere to not step in poop. Is there no law banning not cleaning up after your pet?\n\nIt seems like everywhere except some parts of central. I've seen this many dogs in other cities but not as much poop. Actually, most of them even look like humans.",
        "upvotes": 45,
        "comments": 33,
        "media": null,
        "permalink": "/r/torino/comments/1n5hs8a/whys_there_so_much_dog/"
    },
    {
        "id": "1n5n3sv",
        "author": "Substantial_Gap_6051",
        "title": "Toyota yaris, molti furti?",
        "content": "Devo contemporaneamente trasferirmi a torino a breve sia cambiare auto, sto contrattando per una yaris di 4 anni fa. Molto comoda ma ho ansia perché è come nuova da fuori, somo auto che aprono e che rubano spesso? (Considerando che la parcheggerei in strada)\n(Nom so ancora in quale zona di torino andrei a vivere ma sicuramente eviterò barriera di milano e zone simili perché non voglio maranza tra le palle che li butto sotto)",
        "upvotes": 6,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1n5n3sv/toyota_yaris_molti_furti/"
    },
    {
        "id": "1n5p4r4",
        "author": "Tom_Kazinsky",
        "title": "Baseball/softball amatoriale",
        "content": "Tempo fa esisteva la Turin Softball League, una lega amatoriale di softball aperta a tutti che includeva 6/7 squadre, da quello che sono riuscito a capire\n\nPerò questa lega sembra sparita nel nulla\n\nC’è qualcuno di voi che pratica/conosce realtà del genere? Insomma un modo per praticare a livello amatoriale baseball o softball a Torino?\n\nOvviamente parlo per adulti",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n5p4r4/baseballsoftball_amatoriale/"
    },
    {
        "id": "1n5t314",
        "author": "mainapizza",
        "title": "Hiking a Noasca e Ca bianca con Wemeet",
        "content": "Ciao, spero sia permesso ma,\n\nSto organizzando un'attività con wemeet, l'idea è di andare a Noasca dietro la cascata e poi da Ceresole alla Ca Bianca, sono un paio di escursioni facili facili e l'occasione per incontrare un po' di persone, tutte nella stessa giornata (sabato 13 settembre) con ritrovo alle 9 e 30 a Noasca, pranzo al sacco da mangiare su alla Ca Bianca. \n\nAvrò una bella sony con me quindi se volete qualche nuova foto profilo approfittate 😁\n\nL'evento si chiama \"Hiking alla cascata di Noasca e Ca Bianca\", limitato a 10 persone! Per iscriversi serve scaricare l'app, è tutto completamente gratuito",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n5t314/hiking_a_noasca_e_ca_bianca_con_wemeet/"
    },
    {
        "id": "1n5eblj",
        "author": "MurkySignificance588",
        "title": "Anime fans in Torino: Demon Slayer movie &amp; cosplay?",
        "content": "Hey! I’m 20M and planning to watch the upcoming Demon Slayer movie in September here in Torino. Looking for people to join, and maybe even cosplay some characters together. If you’re interested, feel free to DM me!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n5eblj/anime_fans_in_torino_demon_slayer_movie_cosplay/"
    },
    {
        "id": "1n51azh",
        "author": "pistacchiocornetto",
        "title": "Job Market Question - Foreigner",
        "content": "I am an American living in Turin with my dear Italian wife. I have a residence permit which I acquired at the start of this year. Finding a job was expectedly hell especially considering a lack of prior Italian-work experience and a not-great level of Italian. \n\nRecently was very fortunate to be hired through my wife’s referral to the restaurant franchise she works for with a tirocinio contract. My Italian is conversational now and continues to improve, but I can’t help but wonder if I can actually expect to get a better job than this? I simply never wanted to work in the food business again after leaving the states and I have experience in security and warehouses. Am I going to struggle to jump jobs and find something better even as I gained this Italian work experience and fluency? If I study for a career in any field or perhaps something related to economics can I hope to find it here in this city? What is your experience?\n\nI ask only because I hear nothing but endless nihilism from literal Italians who have every advantage over me in this regard and it makes me wonder what I am doing here. Is there any hope for me? Thanks in advance, sorry if I seem arrogant I am only stressed. ",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1n51azh/job_market_question_foreigner/"
    },
    {
        "id": "1n4y55m",
        "author": "Nervous_Ad_4895",
        "title": "Trattoria/piola",
        "content": "Ciao, 🙂sapreste consigliare qualche ottima trattoria o piola in cui mangiare tipico?\nGrazie a tutti!",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1n4y55m/trattoriapiola/"
    },
    {
        "id": "1n54zjo",
        "author": "fluoressential",
        "title": "Attività sociali",
        "content": "Ciao, mi sono trasferito da poco a Torino e vorrei provare a conoscere un po' di persone e associazioni della zona con cui iniziare attività sociali (doposcuola, corsi di matematica/fisica/informatica, mense popolari, altro non specificato ma che possa essere utile). Sono in zona San Salvario, ma posso spostarmi. Avete consigli/conoscete associazioni in cerca di volontari? Graziee",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n54zjo/attività_sociali/"
    },
    {
        "id": "1n4rp4b",
        "author": "IcyLetterhead6750",
        "title": "Trasferito a Torino da poco, a qualcuno va di fare amicizia?",
        "content": "Ciao a tutti!\nM26, proveniente da un piccolo paesino che si è ritrovato in questa enorme città per questioni lavorative, devo ancora abituarmi\nHo molti interessi tra cui l’informatica, l’arte, il cinema, la lettura e gli sport da combattimento che pratico da tempo, quindi penso di poter trovare spesso argomenti in comune con le persone\nA qualcuno andrebbe di fare amicizia e magari mostrarmi un po’ la città?\nÈ un nuovo inizio e mi piacerebbe avere a che fare con nuove persone con cui condividerlo",
        "upvotes": 10,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1n4rp4b/trasferito_a_torino_da_poco_a_qualcuno_va_di_fare/"
    },
    {
        "id": "1n4qi97",
        "author": "DaveBoya94",
        "title": "Gruppi di pesca (lago/fiume)",
        "content": "Ciao a tutti!\nVorrei riavvicinarmi alla pesca di lago e/o fiume che praticavo quando ero piccolo con mio papà, però non so bene da dove iniziare e soprattutto con chi!\n\nPer caso qualcuno conosce dei gruppi di persone a Torino e provincia appassionate che vanno in giro a pescare? Ovviamente senza troppe pretese essendo praticamente alle prime armi!!",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n4qi97/gruppi_di_pesca_lagofiume/"
    },
    {
        "id": "1n4qghc",
        "author": "BearGrillz99",
        "title": "Pane napoletano a Torino ?",
        "content": "Ciao, conoscete un panificio che fa pane napoletano a Torino?  \nPurtroppo anche controllando nei mercati di zona non riesco a trovare nulla. Grazie a chi saprà aiutarmi",
        "upvotes": 3,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1n4qghc/pane_napoletano_a_torino/"
    },
    {
        "id": "1n4tywl",
        "author": "CrowNo7009",
        "title": "Juve - Inter turist 1 day",
        "content": "Ciao, verrò a Torino per vedere Juve-Inter il 13 settembre e ripartirò il 14 settembre. È consentito entrare allo stadio con uno zaino? O con un marsupio/portafoglio, visto che porterò con me cellulare e passaporto?\n\n\n\nGrazie.\n\n\n\n=============\n\n\n\nHello I will come to Turin to watch Juve-Inter on September 13th and I will leave on September 14th. Is it allowed to enter the stadium with a backpack? Or with a fanny bag / belt wallet since I will have my mobile phone and passport there\n\n\n\nthank you",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1n4tywl/juve_inter_turist_1_day/"
    },
    {
        "id": "1n4ihri",
        "author": "Flimsy-Face-8585",
        "title": "I need your experience/opinion",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n4ihri/i_need_your_experienceopinion/"
    },
    {
        "id": "1n48wju",
        "author": "SpartacusOnWheels",
        "title": "Riparazione telaio in carbonio bici da corsa",
        "content": "Buonasera, nuovo di Reddit e in città. Ci sono laboratori in cui effettuano riparazioni su telai in carbonio di bici da corsa? Avete ciclofficine da consigliarmi sulla base di vostre esperienze? Grazie per l'aiuto! ",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1n48wju/riparazione_telaio_in_carbonio_bici_da_corsa/"
    },
    {
        "id": "1n47mwp",
        "author": "friendly_neighbour42",
        "title": "Opinioni Madonna di Campagna - Borgo Vittoria",
        "content": "Ciao!\nDopo tanti anni in affitto a Torino, per il prossimo anno sto valutando di acquistare casa.\nStavo vedendo un po' di annunci per la zona di Madonna di Campagna/Borgo Vittoria.\nHo sempre vissuto nel quartiere di San Donato, nelle vicinanze di Parco Dora, e obbiettivamente non mi son mai trovato male.\nMa invece da quelle parti che si dice? Avete pareri/opinioni in termini di sicurezza/trasporti/servizi e tranquillità della zona?\n\nGrazie mille per qualsiasi opinione vi vada di darmi 🍻\n\nP.S. Aggiungo che sono un ragazzo di 30 anni, magari può essere in qualche modo utile 🤙",
        "upvotes": 3,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1n47mwp/opinioni_madonna_di_campagna_borgo_vittoria/"
    },
    {
        "id": "1n44yoi",
        "author": "EndIessCity",
        "title": "Compagnia per il TO Play",
        "content": "Andrò al TO Play, per il momento sono solo io (M29), se qualcuno vuole unirsi e fare compagnia è ben accetto 😁\nCi sono sia per il 13 che per il 14 settembre \n",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1n44yoi/compagnia_per_il_to_play/"
    },
    {
        "id": "1n443i3",
        "author": "Ok-Environment6602",
        "title": "🏠 Trasferimento verso prima cintura Torino ovest",
        "content": "Ciao a tutti!\n\nSo che magari è l'ennesimo post che leggete riguardo al vivere e trasferirsi da Torino a fuori, ma vorrei condividere la mia situazione e leggere i vostri consigli su ciò che vorremmo fare io e la mia compagna nei prossimi anni.\n\n**Situazione attuale**: io, la mia compagna e due pappagalli calopsite abitiamo in zona Santa Rita / Mirafiori Nord a Torino, in un appartamento di 90m².\n\nLa zona è incredibilmente servita e molto comoda per il tragitto casa-lavoro. Io lavoro vicino al PoliTo e vado in ufficio 1-2 volte a settimana; la mia compagna lavora vicino a piazza Massaua e va in ufficio 4 giorni a settimana (ha solo 1 giorno di smart working). Entrambi siamo automuniti.\n\nPurtroppo, forse un po' per il caos e la natura altamente residenziale della zona, ci sentiamo un po' \"oppressi\" dal traffico e dallo stress cittadino. Vorremmo anche più spazio abitativo per la nostra futura famiglia.\n\n**Il nostro obiettivo**: stiamo considerando di trasferirci fuori Torino (pensavamo alla prima cintura, ma mi piacerebbe sentire anche le vostre opinioni) per migliorare il nostro stile di vita, avere più relax dopo il lavoro e la possibilità di fare una passeggiata in serenità quando si vuole.\n\nNon vorrei che la mia compagna dovesse \"tirare giù il calendario\" per gli spostamenti e che ci metta troppo tempo per andare a lavoro (max 30 minuti solo andata, direi). Io, essendo più flessibile, posso accettare tragitti più lunghi.\n\nInoltre, ho vissuto i miei primi 25 anni a Nichelino, e mi manca un po' la tranquillità della provincia.\n\nVorrei sentire le vostre esperienze su com'è vivere nella zona ovest di Torino, come vi trovate con servizi, politica, infrastrutture e soprattutto com'è crescere una famiglia lì (per chi ha esperienza).\n\nStavamo valutando Grugliasco, Collegno, Rivoli, Alpignano, Pianezza e Venaria, ma se avete altre esperienze o suggerimenti, fatemi sapere.\n\n**Nota**: per ora non vorrei parlare di prezzi immobiliari, ci penserò quando cercherò casa anche in base ai vostri suggerimenti.\"",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1n443i3/trasferimento_verso_prima_cintura_torino_ovest/"
    },
    {
        "id": "1n4carj",
        "author": "asilorepublic95",
        "title": "Allenamento con scale",
        "content": "Delle scalinate a Torino per allenarsi e fare le ripetute? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n4carj/allenamento_con_scale/"
    },
    {
        "id": "1n41vgf",
        "author": "Nopesas",
        "title": "Studio giapponese",
        "content": "Ciao, sono un ragazzo di 20 anni, ho iniziato da poco a studiare Giapponese e volevo trovare qualcuno con cui studiare assieme NON online. Se siete interessati non esitate a scrivermi anche in privato.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n41vgf/studio_giapponese/"
    },
    {
        "id": "1n3uh8u",
        "author": "Banzay_87",
        "title": "On January 6, 1898, the first official friendly football match was held in Italy, in which the football section of the Genoa Athletic and Cricket Club (now Genoa) and FC Torinese (now Torino) took part; the match ended with a score of 0:1 in favor of the latter.",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ejxy37v0o3mf1.jpeg?auto=webp&amp;s=00969454c70218f7f240b38e1385d5f26d9b6d69"
        },
        "permalink": "/r/torino/comments/1n3uh8u/on_january_6_1898_the_first_official_friendly/"
    },
    {
        "id": "1n3xnd4",
        "author": "ExcitementVirtual562",
        "title": "Parrucchieri",
        "content": "Piccolo sfogo: chiamo 7/8 parrucchieri, chiedo servizio di balayage se lo fanno e prezzo. Di questi circa 4 mi dicono di recarmi in salone per “preventivo”, altri mi propongono cifre come 200/300 euro per questo servizio.\nMi chiedo, sono figata io o davvero questi sono i prezzi/ trattamenti da parte di questi -professionisti-? \n\nQualcuno conosce un posto che non costi un occhio della testa e che effettui il servizio ? \n",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1n3xnd4/parrucchieri/"
    },
    {
        "id": "1n3wdy1",
        "author": "Weird-Dragonfly-1938",
        "title": "Ciao a tutti! Dove posso trovare filo per amigurumi/uncinetto ad un buon prezzo? E quale marca italiana è buona? Grazie mille",
        "content": "",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n3wdy1/ciao_a_tutti_dove_posso_trovare_filo_per/"
    },
    {
        "id": "1n3wdwj",
        "author": "Ok-Stable1562",
        "title": "Liceo linguistico",
        "content": "Yo Ciao tutti, qualcuno sa se ci sono a torino dei licei linguistici serale? Voglio fare meno di 5 anni , a massimo 3 anni. Se avete qualche info sarei felice",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n3wdwj/liceo_linguistico/"
    },
    {
        "id": "1n3zs4h",
        "author": "Plenty-Mousse-5757",
        "title": "Is the area around museo impossibile safe?",
        "content": "I am looking for accomodation.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n3zs4h/is_the_area_around_museo_impossibile_safe/"
    },
    {
        "id": "1n3yz3b",
        "author": "mat_iia",
        "title": "studio",
        "content": "ce un posto tranquillo per studiare che non sia casa propria in sta città? oltre hai 2 soliti si intende. se qualcuno fosse anche interessato a studiare in gruppo. (cercasi alcolizzati e/o fattoni)",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1n3yz3b/studio/"
    },
    {
        "id": "1n3bi2p",
        "author": "lospavaldo",
        "title": "cerco un amic*",
        "content": "siamo 3 ragazzi che ci piace trekking in montagna ,fare cicloturismo ,fare arrampicata attivate sportive e riusciamo a trovare tempo anche nella parte nerd esempio guardare film e giocare a giochi da tavoli",
        "upvotes": 7,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1n3bi2p/cerco_un_amic/"
    },
    {
        "id": "1n342w4",
        "author": "Character-Dance7919",
        "title": "Libri su Torino sulfurea",
        "content": "Ciao, sto approfondendo il tema di Torino come città sulfurea, diabolica e metafisica. \n\nTra i titoli emersi, ***Minuetto all’inferno*** di Elémire Zolla, ***L'ultima notte*** di Furio Jesi, ***La coda della cometa*** di Italo Cremona, ***La notte dell'arciduca*** di Oddone Camerana,  ***Domingo il favoloso*** di Giovanni Arpino e infine ***Le venti giornate di Torino*** di Giorgio De Maria.\n\nA qualcuno sovvengono altro titoli? Grazie.",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1n342w4/libri_su_torino_sulfurea/"
    },
    {
        "id": "1n3faat",
        "author": "barelyheard",
        "title": "Permesso di soggiorno delay",
        "content": "hey guys, anyone waiting for their student permesso for more than 3 months? ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1n3faat/permesso_di_soggiorno_delay/"
    },
    {
        "id": "1n3d3mm",
        "author": "MonPorridge",
        "title": "manicure/pedicure uomo Torino?",
        "content": "Come da titolo, c'è qualcuno che va a farsi piedi/mani dall'estetista? Consigliate dei centri in particolare?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n3d3mm/manicurepedicure_uomo_torino/"
    },
    {
        "id": "1n3aslj",
        "author": "Academic-Method-4676",
        "title": "Tempo di elezioni",
        "content": "Abito a Torino da 3 anni e in questo periodo ho visto chiudere due parchi con la promessa di una futura manutenzione (mai avvenuta), buche per strada rattoppate alla bell'e meglio dopo mesi, strade chiuse e il leggendario sottopasso del lingotto. Oggi, magicamente, hanno iniziato a fare dei lavori stradali sotto casa e in giro vedo cantieri e lavori in corso a perdita d'occhio. Il sindaco è in carica dal 2021, quindi ci sta farsi belli per l'anno prossimo\n\nP.s. dai, che con un po' di fortuna riescono a finire pure la metro 1, la 2 serve cristo in terra purtroppo \n\nCiao ",
        "upvotes": 1,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1n3aslj/tempo_di_elezioni/"
    }
]