[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 35,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1poy8to",
        "author": "NovarisLight",
        "title": "Why can't I say \"not interested \" in these stupid fights advertised on autopsy on the top of Netflix?",
        "content": "As titled. I want to see or hear about these idiot fights on Netflix. There is no option to opt out. Why not? I am starting to dislike this service more and more.\n\nEdit: Title autocorrected... *on top of. Not autopsy...",
        "upvotes": 183,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1poy8to/why_cant_i_say_not_interested_in_these_stupid/"
    },
    {
        "id": "1pp9b3j",
        "author": "qqrz",
        "title": "Blue eye samurai",
        "content": "Who else has been waiting for this to come back since 2024? Best quality show to come out of  netflix in recent years. As someone who was never into animated shows before,  this blew me away with the quality of the writing and animation, and I have been waiting for the second season patiently....",
        "upvotes": 30,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pp9b3j/blue_eye_samurai/"
    },
    {
        "id": "1posalo",
        "author": "Thin_Dig_8140",
        "title": "Kudos to netflix for adding a feature that automatically turns on the subtitles when you turn the volume all the way down.",
        "content": "Title says it all honestly i think its absolutely awesome. Im not sure if its a new feature or not but im posting this because I feel like its not known about maybe im just late literally just found out.",
        "upvotes": 235,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1posalo/kudos_to_netflix_for_adding_a_feature_that/"
    },
    {
        "id": "1pp30tc",
        "author": "DefCatMusic",
        "title": "Is Netflix 4k worth it?",
        "content": "Wife and I just spent ​our christmas bonus and gift ​budget on a new oled 4k tv and sound system. Netflix then prompted us that we should upgrade to the 4k plan. For us + her little sister as an added member that is 33.98$. we do watch a lot of Netflix but I'm worried I could just be purchasing bluerays of what I want to watch at this point.\n\n  \nAnyway was to pay this yearly in a bundle instead? I doubt any services have a bundle that include the 4K plan.",
        "upvotes": 17,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1pp30tc/is_netflix_4k_worth_it/"
    },
    {
        "id": "1poqwe5",
        "author": "kdrama_fan_921",
        "title": "Too many dating shows... but very very few gamey competitive shows",
        "content": "Netflix has an ocean of dating reality shows and it's truly getting tiring.. bcoz there's no other variety available.... Battle camp was such a nice change... It was fun.... Different groups, winning challenges based on luck, strength &amp; logic.... ,with periodic eliminations... but they cancel that too....?? We need more shows like battle camp please...",
        "upvotes": 23,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1poqwe5/too_many_dating_shows_but_very_very_few_gamey/"
    },
    {
        "id": "1ppalo2",
        "author": "choochooreddi",
        "title": "Does anyone know at what time 10DANCE releases?",
        "content": "It's supposed to release today on the 18th, but I was wondering if anyone knows when that could be. I don't have Netflix and I've heard conflicting opinions about the exact time(s) shows or movies become available to watch. Would appreciate any help!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ppalo2/does_anyone_know_at_what_time_10dance_releases/"
    },
    {
        "id": "1po75ot",
        "author": "businessinsider",
        "title": "Netflix has done its second big podcast deal as it prepares to launch a slate of shows in early 2026",
        "content": "",
        "upvotes": 145,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1po75ot/netflix_has_done_its_second_big_podcast_deal_as/"
    },
    {
        "id": "1pottwf",
        "author": "Tasty-Account2220",
        "title": "Netflix: Pluto",
        "content": "I’ve just finished Pluto after stumbling upon it by chance on Netflix. I was actually just looking for something to have playing in the background, without the intention of actively watching it. Ever since Vinland Saga and AoT, I had pretty much given up on finding something genuinely good in that space — especially on Netflix.\n\nFirst of all: did anyone else notice how many hints and references there were to Monster?\n\n1. Tenma being a scientist/doctor.\n2. And what I found even crazier: they basically adapted Julius Reichwein 100% as Ban-Kouchou. He looks exactly like Julius Reichwein. Like, 1:1. \n\nI also really loved the many Evangelion references (e.g. “pierced Braun 1589 → Adam pierced by the Lance”). Those are just the ones I personally noticed.\n\nThat said, I’m left with a few questions:\n\n1. How was Braun 1589 able to kill a human? And how was Gesicht able to kill a human as well, when they technically shouldn’t be capable of that? As far as I understand, only Pluto — and Abdulla — should have been able to do so, since they were equipped with unpleasant emotions. Braun and Gesicht were created as “normal” AIs.\n2. Why was Atom able to lie to Helena at the end?\n3. Who is the teddy bear, and why did Braun decide to kill him?\n\nI get that, especially in sci-fi, you can’t avoid a few plot holes — but there were quite a few things that ultimately made me settle on an 8.5/10.\n\nThe lack of fight scenes didn’t bother me at all — quite the opposite. There were so many incredibly beautiful and symbolic images: Pluto crying together with Atom, Epsilon slowly shattering to light etc. It all felt almost like a dream. I think it was a very smart decision by the creators to prioritize these atmospheric visuals over action scenes.\n\nI might have liked to see at least one female member among the seven robots, though.\n\nLastly, I really wonder why this anime is so relatively unknown. And: do you have any other anime recommendations? I had basically given up on the whole medium, but Pluto has given me hope that there’s still something truly great out there.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pottwf/netflix_pluto/"
    },
    {
        "id": "1poyahj",
        "author": "Ok_Jeweler_6710",
        "title": "Detective and crime solving",
        "content": "Can you suggest some series or movies with detective themes and crime solving plots?Not too dark and gory, but interesting. I've watched enola holmes movies and I really hope they come up with a shelock holmes series.",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1poyahj/detective_and_crime_solving/"
    },
    {
        "id": "1pp18id",
        "author": "Obvious-Cucumber1086",
        "title": "I need something to watch - recommendations plz",
        "content": "I don’t like the shows everyone else likes. I like shows like good girls, p valley, animal kingdom. Things of those sorts. Not gossip girl &amp; stuff. I have nothing to watch currently &amp; looking for recs! \n\nMoney laundering \n\nRobbing\n\nCrimes\n\nAlcohol/drugs\n\nShows or movies like these plz!",
        "upvotes": 0,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pp18id/i_need_something_to_watch_recommendations_plz/"
    },
    {
        "id": "1pns4fh",
        "author": "Expensive-Elk-9406",
        "title": "'Boots' Canceled By Netflix After One Season",
        "content": "",
        "upvotes": 614,
        "comments": 191,
        "media": null,
        "permalink": "/r/netflix/comments/1pns4fh/boots_canceled_by_netflix_after_one_season/"
    },
    {
        "id": "1podoaz",
        "author": "CockroachLatte",
        "title": "Netflix shows are too dark",
        "content": "Netflix shows are too dark on my Samsung q65 OLED. the dark appears excessively dark ruining the experience. How do I solve this ? what’s the point of paying for premium formats? \n\nhttps://imgur.com/a/8J8qKH4",
        "upvotes": 25,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1podoaz/netflix_shows_are_too_dark/"
    },
    {
        "id": "1pnzz9b",
        "author": "raya2810",
        "title": "the creepiest thing happened with my netflix",
        "content": "I watched a movie (wake up dead man) at my friend's house, she has a separate account obviously \n\nthen today I opened netflix in my house with my tv, and there's a list of recs that says (because you watched wake up dead man) \n\nhow tf do they know that I watched it???\nI checked my history and I didn't watch it on this account! \n\nit's creepy af is there an explanation for this? ",
        "upvotes": 121,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1pnzz9b/the_creepiest_thing_happened_with_my_netflix/"
    },
    {
        "id": "1pp9nyq",
        "author": "Extension-Wait1528",
        "title": "Max and Hollys fate Stranger things",
        "content": "Hear me out.. I think Max and Holly will successfully escape \"Camazotz\" via Holly creating a dimension door into the Wheelers house where both escape. I then think that Max and Holly's old bodies such as Max in the hospital and Holly in the mysterious teeth cave place will just be useless bodies and the ones we saw in \"Camazotz\" will be their new bodies almost like a rebirth. I think this will be the moment where Henry notices that Holly is no longer under his control. I think this is when he will visit her in the wheeler house by going into her mind similar to how he did when he was \"Mr Whatsit\". Its maybe a bit out of the blue and not possible at all but its just a fun theory lmk what you think or want to add on!!!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pp9nyq/max_and_hollys_fate_stranger_things/"
    },
    {
        "id": "1ppb67e",
        "author": "sugarpoppins",
        "title": "HEAR ME OUT- KNIVES OUT WUDM IS JUST AN INVERTED MIDNIGHT MASS",
        "content": "OKAAAY! This is gonna blow all your minds. As Benoit Blanc would say \"Here's my checkmate show\".I just finished watching Knives out-WUDM, and I thoroughly enjoyed it. But as in any whodunnit we as viewers play the role of detectives itself, as if the mystery is ours to unfold.HAHAHAHA.... Call it coincidence but the last show I watched was \"Midnight mass\", also a brilliant mindfuck horror with heavy religious commentory.While I was watching it, I cannot unsee that both of these stories share very similar plots, characters, mythology and overall setting. Now when I am writing this post, I can conclude KNIVES OYT WUDM is just whoddunit version of Midnight Mass. Let me show you what I am talking out-\n\n1)Both the stories have the basic theme of faith, christanity and power of religion. The central plot in both of theme is of reserruction, literally and metaphorically. There are actual angel statues hanging from walls in WUDM for gods sake.\n\n2)Both of the stories are set in a Christian conservative american small town and main plot revolved around regulars at the church.\n\n3) There is a Monsignor in both of the stories. He dies in both of them and is reserrected (literally in MM and fakely in WUDM). A more suprising bit is the vessel of death- which is POISONED COMMUNION WINE in comon in both of them.I swear if Josh Brolin would have actually reserrected from the tomb, it would actually turn into a horror story.\n\n4) Both the monsignors have fathered an illegetimate child, which is the driving force behind their evil plans.\n\n5) The events of death and reserruction occur within the same week in both the stories-EASTER WEEK.\n\n6) The protagonist in Midnight mass (Rylie) is a guilt driven murderer who has lost his faith in christ. The protagonist in WUDM(Jud) is also a murderer who has accepted faith due to his guilt.\n\n6) Apart from Riley and Jud, other characters also share a lot of similar traits. Like a disabled girl in a wheelchair visiting church daily in hope of a miracle. I laughed out so hard in WUDM when she stands up and Martha (caretaker) proclaims it as miracle. Exactly similar outcome in MM when Leeza walks out of wheelchair and whole town takes it as a miracle.\n\n7) The main culprit in both the shows turns out is not Monsignor but the church caretakar lady (Bev in MM and Martha in WUDM) who would go any lenghts to protect the church and maintain its beliefs among the townkeepers.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ppb67e/hear_me_out_knives_out_wudm_is_just_an_inverted/"
    },
    {
        "id": "1pokjp6",
        "author": "CollectionNo8047",
        "title": "Anyone getting targeted Netflix ads?",
        "content": "I understand sometimes ads can be targeted, but I have multiple sclerosis and I’m getting MS medicine ads with every single commercial. It’s upsetting. Is anyone else experiencing a similar situation?  Repeated medication ads?",
        "upvotes": 4,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1pokjp6/anyone_getting_targeted_netflix_ads/"
    },
    {
        "id": "1pozfkw",
        "author": "-AI3x",
        "title": "Ive got a Question",
        "content": "So I’ve got a question for ya’ll. \n\nI’ve gotten to the part where i don’t know what to watch at all on Netflix. Do ya’ll have any recommendations for me? \n\nI like Action movie/s, Comedies with like Kevin hart, Jim Carrey, Dwayne Johnson etc\n, A bit of like criminal/police stuff too. \n\nIt could be outside of Netflix too but mostly on Netflix 🙏🏼\n\nAny recommendations for me? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pozfkw/ive_got_a_question/"
    },
    {
        "id": "1pp9abt",
        "author": "PhryYay",
        "title": "Another reminder to not shop with Netflix",
        "content": "Ordered a personalized Stranger Things coffee mug for a relative. The mug was wrapped in one thin layer of cellophane and thrown in the box with a Fragile label. No other wrapping. Not padding. Too big of a box. I could hear the shattered pieces clinking around in the box when I picked it up off my porch. Thanks for wasting my money, Netflix. \n\n  \n[https://imgur.com/a/GT6g5Lr](https://imgur.com/a/GT6g5Lr)  \n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pp9abt/another_reminder_to_not_shop_with_netflix/"
    },
    {
        "id": "1pos2rt",
        "author": "Jroll76",
        "title": "Watch party",
        "content": "Anyone keen to make a watch party sometime, can make a group or something. pretty sure there’s an extension to do so??\n\nOpen to watch anything taking recommendations too thanks!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pos2rt/watch_party/"
    },
    {
        "id": "1poob8i",
        "author": "timelordhonour",
        "title": "Holly Hobbie",
        "content": "I've been watching Holly Hobbie, but I see that Netflix only has up to season 3. Do you know if Netflix will get season 4 and 5? Or does anyone know where I can watch the rest in New Zealand?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1poob8i/holly_hobbie/"
    },
    {
        "id": "1pogg2l",
        "author": "Mysterious-Ranger757",
        "title": "Do movies/shows leave on the date said or is that the last day you can watch it?",
        "content": "Me and someone else are watching a show. We are close to finishing a season of the show so we need to know if we need to watch two or four episodes tonight.",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pogg2l/do_moviesshows_leave_on_the_date_said_or_is_that/"
    },
    {
        "id": "1pnzyqu",
        "author": "forevony_0904",
        "title": "Tv show~Behind her eyes",
        "content": "omfggggg. the massive plot twist at the end. Adam knew what was up. omgggg. the whole story. u didnt know who was bad,who was wrong. a real psychological thriller. omgggg I recommend to yall. dont wanna say too much to spoil it but go watch noww",
        "upvotes": 31,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1pnzyqu/tv_showbehind_her_eyes/"
    },
    {
        "id": "1pok7yo",
        "author": "MichaelPesci",
        "title": "Film or horror series",
        "content": "Can anyone recommend a good horror movie or TV series to watch, based on the title? I'm currently watching a TV series that will end soon, so I'll be left wondering what to watch next.",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pok7yo/film_or_horror_series/"
    },
    {
        "id": "1pp46hx",
        "author": "W0gg0",
        "title": "Does Netflix have ads like Amazon?",
        "content": "There’s a lot of grief about ads being shown on Amazon prime video even after paying $2.99 for the “ad free” service. Before I subscribe to Netflix, do they have ads yet? I heard that they were planning on it and don’t want to subscribe if they’ve already begun.",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1pp46hx/does_netflix_have_ads_like_amazon/"
    },
    {
        "id": "1po967a",
        "author": "the_trend_memo",
        "title": "Netflix &amp; iHeartMedia Ink Exclusive Video Podcast Deal",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1po967a/netflix_iheartmedia_ink_exclusive_video_podcast/"
    },
    {
        "id": "1pon33x",
        "author": "spaideishere",
        "title": "I want Netflix to renew shows that were removed or cancelled",
        "content": "I heard Shera (a Netflix original) was being removed in February because it's license expired and it's my FAVORITE show to watch on Netflix. I heard Inside Job was canceled for no reason. And I remember watching Voltron when it was still on Netflix back in the day. Also I found out Glitter Force was removed and there's NOWHERE to watch it. I just wanna know if there is any hope that Netflix will EVER uncancel shows or get the license to renew it on their streaming service. I hate it when a show I like dissappears from a streaming service and I wish things would stay the same.",
        "upvotes": 0,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pon33x/i_want_netflix_to_renew_shows_that_were_removed/"
    },
    {
        "id": "1pp167b",
        "author": "Aggravating_Ad6732",
        "title": "I can't deal with Netflix anymore",
        "content": "It's official, they cancelled Boots after 1 season. They keep doing this with shows, pushing them out just to cancel them after 1 season. They keep doing this over and over, and the shows tend to be LGBT shows or shows about minority groups.I really enjoyed Boots and even had a watching group from work. They don't look at viewership because when they did release data to Nelson about viewership, we saw that even high viewership of one-season shows was getting cancelled.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pp167b/i_cant_deal_with_netflix_anymore/"
    },
    {
        "id": "1po3ooq",
        "author": "buttatoad",
        "title": "Looking for \"Mom-Approved\" meaningful, dramas?",
        "content": "So recently, I watched the Flanagan series with my mom. She loved every one, though at times, Fall of The House of Usher was a bit much with the gore and sex. Her absolute favorite was Bly Manor. We also watched Wednesday, she loves this show. In the end, she also liked Beef, but thought it was a bit too crass at times.\n\nNot Netflix but she also liked 9 Perfect Strangers on Hulu.\n\nBasically I'm looking for quirky shows that are sort of sentimental and ultimately wholesome, maybe bittersweet dramas with real meaning to them, but aren't too sexual, violent, or vulgar? and very much character-focused.\n\nShe doesn't mind anything related to relationships or kissing or LGBT content or anything like that, romance is fine, just when anything sexually explicit is shown on a regular basis.",
        "upvotes": 9,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1po3ooq/looking_for_momapproved_meaningful_dramas/"
    }
]