[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 196,
        "comments": 720,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1o4zlew",
        "author": "DefiantRanger9",
        "title": "Does anyone else find Mikey Day annoying from “Is It Cake”?",
        "content": "His mannerisms and basically anything else irk me. Also he keeps tilting the knife each time it IS cake which is a dead giveaway. Would love to see someone else host this show. Any suggestions? \n\nCan someone please get this back to the producers. The show has potential. Poor Mikey does not. LOL",
        "upvotes": 17,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1o4zlew/does_anyone_else_find_mikey_day_annoying_from_is/"
    },
    {
        "id": "1o53cc4",
        "author": "Altruistic-Dot-5380",
        "title": "Bring back Daybreak!",
        "content": "I just recently watched Daybreak and didn't know it existed. It was not advertised enough. It's a great show and I'm so disappointed it wasn't given proper promotion. \n\nWe need season 2! ",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o53cc4/bring_back_daybreak/"
    },
    {
        "id": "1o52bs3",
        "author": "LegitimateHumor8212",
        "title": "Just watched tires and now i dont like anything else on Netflix",
        "content": "Please suggest me something good like tires, i really love how all the OG comics made that show.\nI have watched Brooklyn 99, breaking bad and superstore already.",
        "upvotes": 5,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1o52bs3/just_watched_tires_and_now_i_dont_like_anything/"
    },
    {
        "id": "1o554y6",
        "author": "Bluesalvia",
        "title": "The most boring show ever",
        "content": "Trying to find a limited series that was on Netflix maybe 8-9 years ago. There was a woman lead who produced and starred in the show. Maybe a comedian?  She said her goal was to create the most boring show ever.  She worked in an office with cubicles and in one episode went on a very awkward date. The entire show was awkward but weirdly compelling. There were pencils and old school tech. Not sure where it was filmed but it reminded me of Monterey or N CA. I have tried to find it again many many times but can’t find it. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o554y6/the_most_boring_show_ever/"
    },
    {
        "id": "1o4ffyl",
        "author": "YnotThrowAway7",
        "title": "I wish this many people had discovered Animal Kingdom years ago. I think it could have been up there with some of the biggest shows.",
        "content": "I know this show apparently did well on cable but I had genuinely never heard of it until this year. Although season 1 was good I feel once it really hits its stride it is right up there in my top 10 shows easily. It also had one of the best characters on TV period in Pope and I didn’t expect to be emotional by the end but damn I was more emotional than the final season of Breaking Bad. I’m so glad it’s getting a resurgence of viewers since coming to Netflix, but I can’t help but wish it had been the type of phenomenon everyone was talking about while it was airing.",
        "upvotes": 57,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1o4ffyl/i_wish_this_many_people_had_discovered_animal/"
    },
    {
        "id": "1o49rdr",
        "author": "SerialSeriesQueen",
        "title": "Does Ryan Murphy hate women?",
        "content": "I finished Ed Gein the other day and the longer I sit on it, the more I realize just how much I hated it. Charlie Hunnam and Laurie Metcalf's performances were great but what really grinds my gears are the portrayals of the actual known murder victims. I get writers take artistic liberties for entertainment but what they came up with was just so perverse. Mary Hogan was a former madam in Chicago? Bernice was a desperate old kinky cougar looking for a sugar baby? Was this to make us feel less sorry for them? Like maybe they deserved it bc they weren't \"virtuous\"? There's very little background online about either of the victims, at least nothing I could find, so I cant understand why they made these choices for these women? The only thing I could come up with was Ryan Murphy really doesn't like women.",
        "upvotes": 138,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1o49rdr/does_ryan_murphy_hate_women/"
    },
    {
        "id": "1o4ihji",
        "author": "LatteMermaid",
        "title": "Red flags or underrated masterpiece?",
        "content": "",
        "upvotes": 23,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1o4ihji/red_flags_or_underrated_masterpiece/"
    },
    {
        "id": "1o52bw3",
        "author": "OwOwOwoooo",
        "title": "household no longer aknowledged (changed provider, i guess) but no smart tv to setup one?",
        "content": "Basically what the title said. Tried to connect via webside after i change internet provider few days ago, netflix tells me its not my household so i got a temporary allowance...\n\nThen i v looked up about it, seems i gotta use a smart tv to set up a new household? I dont have a smart tv.. i use chrome on pc, my android phone and chromecast for my tv. How am i supposed to use netflix on pc w/o using temporary code?\n\nPlz netflix stop beeing annoying QQ\n\n  \nEdit pc is on ethernet",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o52bw3/household_no_longer_aknowledged_changed_provider/"
    },
    {
        "id": "1o3ra72",
        "author": "GlitteringAd6571",
        "title": "Victoria Beckham victimization",
        "content": "This girl grew up in a wealthy family and went to school in a Rolls Royce. Even if she wasn't such a great singer and dancer, she became part of the most successful girl bands in the 90s (i don't recall her singing very much in that band anyway).\nIn her 20s she met one of the most talented and considered sexy football player in the world. She married him, she has 4 beautiful children and she maintained her silhouette (I know her eating problems, but she's lucky to have a good health and not being affected by a hormonal problem, as many women are going through). She has the life and the opportunities that 99% of the planet couldn't even dream of. She is still very rich and she can pursue her passion, the fashion-she is very talented in this to be fair.\n\nI watched the documentary. It looks like she is not aware of none of these things. ",
        "upvotes": 602,
        "comments": 191,
        "media": null,
        "permalink": "/r/netflix/comments/1o3ra72/victoria_beckham_victimization/"
    },
    {
        "id": "1o4y65k",
        "author": "pippawhiskers",
        "title": "Ed Gein - Monster",
        "content": "Ryan Murphy’s jab at Mindhunter in Ed Geins monster is sending me into a spiral. The least he could do is fund mindhunters revamp at this point… not try to re create it 😭😭😵‍💫😵‍💫 \n\nI just needed somewhere to share this where others may have the same opinion. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o4y65k/ed_gein_monster/"
    },
    {
        "id": "1o4xthy",
        "author": "Sara_b211",
        "title": "Wayward Discussion- Laura and her Parents",
        "content": "So I just finished the series and well…\n\nspoilers ahead\n\nI just really want to know what you guys think. Did laura actually kill her parents? We saw a glimpse when she killed that frog, but that could be since the frogs bring her trauma? \n\nBut then again I really did feel like she killer her parents.. she did not give me good vibes. and alex just ignoring that when he knew? im so confused ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o4xthy/wayward_discussion_laura_and_her_parents/"
    },
    {
        "id": "1o55g2w",
        "author": "julieesq43215",
        "title": "Perhaps a new take on Ed Gein series?",
        "content": "Apologies if this is a repetitive idea — we are watching the Monster series and it’s been very confusing (not to mention disturbing). We are constantly asking each other, Is this real or someone’s fantasy?\n\nAfter the fourth episode with the clip about Texas chainsaw massacre, it occurred to me, maybe this whole series isn’t intended to be based in reality, but instead based on the MYTH of Ed Gein. \n\nAll of the movies that took such creative license, maybe this is supposed to be the story of who Ed Gein’s reputation evolved into? ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1o55g2w/perhaps_a_new_take_on_ed_gein_series/"
    },
    {
        "id": "1o4lvj5",
        "author": "purplefennec",
        "title": "Looking for a song playing in the final episode of the Ed Gein series. Can anyone help?",
        "content": "It was the scene with &gt;!his mother on the stairs where she says she’s proud of him and then the montage.!&lt; \n\nI can’t find it in the list of original soundtrack songs and it doesn’t seem to be an existing song. I really liked it (actually sounded weirdly familiar). Does anyone have any ideas? \n\nEdit: solved! It’s from the Truman Show. Thank you! ",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1o4lvj5/looking_for_a_song_playing_in_the_final_episode/"
    },
    {
        "id": "1o4knyw",
        "author": "Southern-Brother5693",
        "title": "Kurukshetra - Anyone watching this?",
        "content": "The animation is pretty basic, but for people who love Gods mythology shows, this is a blast.\n\nThis is an adaptation of an Indian epic. 18 characters. Each getting a spotlight in 18 episodes (Netflix is releasing this series in batches of 9 episodes). Many of the warriors here are demigods and have been granted mystical weapons and powers. Pretty awesome.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o4knyw/kurukshetra_anyone_watching_this/"
    },
    {
        "id": "1o4r7sc",
        "author": "therealbrandonhall",
        "title": "The Ed Gein Story - What really happened",
        "content": "In this video, we discuss the fact over fiction in the Netflix short series “Monster - The Ed Gein Story”\n\nProve It follows a group of amateur investigators on the hunt for evidence to prove the existence of otherworldly phenomena. Coming fall 2026.\n\nThis YouTube series will consist of paranormal investigations, UFO observations and the hunt for other mythical legends.\n\nMore information about Prove It will be revealed soon. Stay tuned!\n\nIn the meantime, if you have encountered anything out of this world, please let us know in the comment section. We are only central Florida based right now, and may be able to feature your story in a future episode.\n\nHistory:\n\nEdward Theodore Gein (August 27, 1906 – July 26, 1984), also known as the Butcher of Plainfield and the Plainfield Ghoul, was an American murderer, possible serial killer, and body snatcher. His crimes, committed around his hometown of Plainfield, Wisconsin, gathered widespread notoriety in 1957 after authorities discovered that he had exhumed corpses from local graveyards and fashioned keepsakes from their bones and skin. He also confessed to killing two women: tavern owner Mary Hogan in 1954 and hardware store owner Bernice Worden in 1957. It is believed Gein's actions were caused by severe psychosis.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o4r7sc/the_ed_gein_story_what_really_happened/"
    },
    {
        "id": "1o4pkkw",
        "author": "WestOk9144",
        "title": "[spoiler alert] on the ending of Monster Ed Gein series",
        "content": "At the cemetery where the rowdy teenagers are plucking his tombstone, right after, one kid starts seeing the characters of the show but it seems only him can see them. Did this spark his schizophrenia, like it did for Ed? It was like a way of saying, this is a timeless condition, it doesn't have to do with Ed not having seen morbid pictures in his lifetime, it can happen to anyone? kind of like a spooky ending?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o4pkkw/spoiler_alert_on_the_ending_of_monster_ed_gein/"
    },
    {
        "id": "1o4x7gr",
        "author": "AskAdministrative412",
        "title": "Monster S1 Jeff Dunmer was the best",
        "content": "With Ryan Murphy you don’t know what you’re gonna get but I don’t think he did Ed justice. \n\nIt was all over the place with the mainstream tv that followed.\n\nI felt like if it was a random show made up serial killer- it would have been good. It was too dramatized, too artistic, and honestly boring most time. \n\nIt wasn’t cool to insinuate he did things that he hasn’t - no real evidence he klled his bro, no f ded bodies, no cannibalism..Ryan relax. \n\nAt the end he did horrible things and he was very sick.",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1o4x7gr/monster_s1_jeff_dunmer_was_the_best/"
    },
    {
        "id": "1o46rpi",
        "author": "Present-Treacle2755",
        "title": "Boots (Netflix) – Thoughts on LGBT representation and overall tone [No Spoilers]",
        "content": "Hey everyone, I just finished watching Boots on Netflix and wanted to share some thoughts.\n\nWhat really stood out to me was how the show treats LGBT characters in a natural, realistic way. Unlike series like Heartstopper, it’s not overly sweet or romanticized  it has humor and light moments, but it doesn’t sugarcoat everything. The LGBT aspect feels like one part of the characters’ lives rather than the sole focus, and, at least from my perspective, it avoids stereotypes.\n\nI’m curious to hear what others think about this approach. Did you notice how the show handles LGBT representation without making it the only focus? Did this affect how you connected to the characters and the story? Personally, I found this more realistic style refreshing compared to more “feel-good” shows, and I’d love to know if others felt the same. Were there particular moments that felt especially natural or well-balanced to you?\n\nLooking forward to reading your thoughts and hearing how others experienced the series!\n",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o46rpi/boots_netflix_thoughts_on_lgbt_representation_and/"
    },
    {
        "id": "1o4x1hd",
        "author": "Original2021",
        "title": "The Victoria Beckham Documentary was really well done",
        "content": "I just finished watching the Victoria Beckham documentary and I really enjoyed it. I came to like the Beckham’s after watching the first documentary that featured David and the whole time I was thinking when are they gonna do a series about Victoria? I really like their love story and hope that Netflix does more on them in the future especially now that David owns his own soccer team.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o4x1hd/the_victoria_beckham_documentary_was_really_well/"
    },
    {
        "id": "1o4k0a7",
        "author": "Active_Rutabaga_4089",
        "title": "Inspired into action by TV show or film?",
        "content": "I’m a journalist with Vox media and I’m currently looking for stories of people inspired into action by a TV show or Film. Did you change job, move house, take up a new hobby or rediscover something after watching something on screen? I’d love to hear about it. Thanks so much ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o4k0a7/inspired_into_action_by_tv_show_or_film/"
    },
    {
        "id": "1o4j3rx",
        "author": "sammisshhh",
        "title": "Just discovered my dream roles - and I want to build something that gets Netflix’s attention!",
        "content": "Hey everyone!  \nI’ll be graduating with my **BBA in 2026**, and over the past couple of years, I’ve done several internships in **marketing, research, and HR**. Through all that, I recently discovered what I *truly love* \\- the idea of becoming a **Creative Director**, **Brand Strategist**, or **Innovation Consultant** someday.\n\nNetflix has such fascinating positions in **Content Creation and Acquisition**, and I even read their article on work culture (beautifully written, by the way!). It made me realize - *this is where I want to be.*\n\nNow, I want to create something unique to catch their team’s attention - maybe a **portfolio or concept project** that reflects Netflix’s creative energy. I’m also planning to **cold email** them, but before that, I’d love some advice:\n\n* What should I include in my portfolio to stand out for creative/branding roles?\n* Any tips on how to write a great cold email that actually gets noticed?\n\nWould really appreciate your insights or experiences!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o4j3rx/just_discovered_my_dream_roles_and_i_want_to/"
    },
    {
        "id": "1o3kxpv",
        "author": "nerfherder1620",
        "title": "Ed Gein Story is heinous",
        "content": "Is it no longer considered bad taste to make shows about murderers that almost exploits the suffering of others through glamorization? It is one of the most tasteless and disgusting shows I've ever seen. There are better ways to make an impact without having to watch 10 scenes of a dead bodies getting f***** and 600 people getting grotesquely murdered with every brutalized second on display.\n\nEdit: I have no problem with violence or gore in film, TV, video games etc. However, if im gonna have to watch some guy fuck a dead body for the love of the game every 10 seconds, the plot better be good and add something interesting to the conversation. If not, im not interested in some murder porn fantasy that isnt made in good faith to the people who actually suffered that freak. But, I shouldn't expect anything more from the company that also released catering to pedos.",
        "upvotes": 190,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1o3kxpv/ed_gein_story_is_heinous/"
    },
    {
        "id": "1o4ifoo",
        "author": "Hot-Manufacturer7619",
        "title": "If its not available why recommend it?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o4ifoo/if_its_not_available_why_recommend_it/"
    },
    {
        "id": "1o43z19",
        "author": "LadyCauliflower",
        "title": "A Rollercoaster of Emotions with Monster: Ed Gein (I actually liked it — and here’s why)",
        "content": "After the second episode, I started to doubt how accurate the show would really be (I hadn’t read any spoilers, but I knew a lot about the real case). At first, I was honestly annoyed by the whole Adelaine storyline —his supposed girlfriend and accomplice— and the murders of victims that were never actually proven to be his. Even the depiction of the *real* victims wasn’t that precise (Bernice’s death scene was… embarrassing, omg).\n\nBut around episode six or seven, I started to *get it*. It finally clicked that everything we’d seen before was meant to show what it’s like to be **inside Ed Gein’s head**: confusing, hyper-sexualized, disturbing, and suffocating. What’s real? What’s a lie?\n\nThe scenes that directly referenced horror films —like the chainsaw one and the babysitter Evelyn (clearly nodding to *The Texas Chainsaw Massacre*)— added a clever extra layer. They reminded us that we’re not only trapped in Ed’s confusion, but also in **Hollywood’s own distortion** of reality through the “creativity” of its horror movies inspired by killers like him.\n\nFor me, the turning point —and the reason I ended up really appreciating the show— was the final stretch. It hits you with a cold dose of reality, showing the heartbreaking truth about mental illness and how it gets minimized and worsened in a violent, repressive family or social environment.\n\nPsychiatric disorders are not only hard for others to understand —they’re also hard for the person living with them. And the way the show portrayed his schizophrenia diagnosis (wow) felt incredibly authentic. The imaginary communication with Ilse and Christine Jorgensen —with them saying things that were actually coming from his doctor and his own mind— was such a genuine representation of a brain desperately looking for answers but simply not working right. It truly felt like a drowning man reaching for anything to hold on to.\n\nMaybe we all expected it to follow the same style as *Dahmer*, but the fact that this one actually makes you **think** (and even research what was real and what wasn’t, instead of just buying whatever a show tells you) really impressed me. I’d even say it’s more suited for *true crime* and horror fans —the kind of viewers who can catch those deeper layers more easily.",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o43z19/a_rollercoaster_of_emotions_with_monster_ed_gein/"
    },
    {
        "id": "1o3tfcx",
        "author": "photoshop_2023",
        "title": "The Diplomat: Season 3",
        "content": "Is anyone else looking forward to The Diplomat: Season 3? The ending from season 2 was a real surprise and i wasn't expecting it. What do you think will happen this season?",
        "upvotes": 30,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1o3tfcx/the_diplomat_season_3/"
    },
    {
        "id": "1o4h4jr",
        "author": "[deleted]",
        "title": "Where did all the anime go",
        "content": "I checked my Netflix (UK) and I swear there was way more anime on here and now it's all just gone. Like all the ones I was interested in and wishlisted aren't there anymore. Demon Slayer, Hajime no Ippo, I think Jujustu Kaisen was on there, pretty sure Frieren was on there but I already watched that on Netflix I'm so sure. Where'd it go???? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o4h4jr/where_did_all_the_anime_go/"
    },
    {
        "id": "1o3iw2x",
        "author": "[deleted]",
        "title": "Disappointed in Netflix",
        "content": "Firstly, I’ve been a customer since the beginning and I have tremendous brand loyalty to Netflix, which will be a topic here.\n\nFor the last two-three years everyone I open the Netflix app on my TV all i feel is disappointment. I can never seem to find anything I want to watch or am interested in. Idk when it started but there was a time when basically every Netflix original I don’t dare to watch because I already know it’s going to let me down (except the Monster series like it ok.)\n\nI got a pretzel in my head due to simultaneously knowing that i should cancel and that i do have an attachment to the brand. Getting all the newest movies in the mail for me and the gang to watch was epic and being able to stream on my Xbox was epic in its own right. Does anybody feel similar?\n\nEdit: there has been some straight fire that I loved like All Quiet on the Western Front, Stranger Things, Haunting of Hill House/Bly Manor and others. It’s not all bad and i’m for sure not shitting on netflix",
        "upvotes": 186,
        "comments": 150,
        "media": null,
        "permalink": "/r/netflix/comments/1o3iw2x/disappointed_in_netflix/"
    },
    {
        "id": "1o4gbe9",
        "author": "Connect_Serve2248",
        "title": "The Longest Yard Audio Issue",
        "content": "Popped on Adam Sandler's \"The Longest Yard\" on my PC and noticed the dialouge only comes through the right headphone. At first I thought it was my computer or my headphones, but after checking other movies on Netflix I found that the problem was only for The Longest Yard. Music and ambience plays thru the left headphone mainly with some bleed thru on the right headphone but the right headphone is only dialouge. Is this how the movie's audio actually plays? Anyone got a DVD or blu-ray copy to cross reference and could someone with headphones confirm that I'm not crazy in hearing this🤣\n\nFirst time I've ran into something like this with a movie...",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o4gbe9/the_longest_yard_audio_issue/"
    }
]