[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 703,
        "comments": 5161,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nwfelp",
        "author": "InsaneCookies21",
        "title": "Just to put this in perspective. Breaking Bad had 62 episodes in 5 1/2 years.",
        "content": "While Stranger Things will have 20 FEWER episodes at 42 in 9 1/2 years... absolutely ridiculous. So in nearly double the time, Stranger Things produced two-thirds the amount of content.",
        "upvotes": 431,
        "comments": 130,
        "media": null,
        "permalink": "/r/netflix/comments/1nwfelp/just_to_put_this_in_perspective_breaking_bad_had/"
    },
    {
        "id": "1nx1llh",
        "author": "Sudden_Pop_2279",
        "title": "‘KPop Demon Hunters’ Breaks Another Netflix Record With 15 Straight Weeks on Top 10",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nx1llh/kpop_demon_hunters_breaks_another_netflix_record/"
    },
    {
        "id": "1nwxgwk",
        "author": "Charming_Amount5068",
        "title": "Binging tech/hacker movies lately, love Mr.Robot even more",
        "content": "I started rewatching Mr. Robot on Netflix and it hits so differently now compared to when it first came out. The way the show builds Elliot’s world is wild, the loneliness, the paranoia, but also the almost surgical precision he has when it comes to tech. What blows me away is how grounded the hacking feels. It’s not just flashy movie effects, it’s real exploits, social engineering, digging through code, finding weak spots, and using them in ways that could actually happen. Even the little things, like using encrypted communication and throwaway identities, make it clear the writers wanted it to feel authentic. (saw some interviews on youtube about that aswell)  \n  \nThe whole vibe of the show also makes you think about bigger questions like surveillance, data collection, and how much of ourselves we’ve basically handed over without even realizing it. Watching Elliot manipulate those cracks in the system really drives home how vulnerable our digital lives can be. All of this has me seriously curious. How does someone actually reach that level of skill in real life, it really is crazy. Either way 10/10 show, especially the ones like the PDF file one (idk if it gets censored if I post the word). I'm actually considering making into a career.  \n",
        "upvotes": 16,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nwxgwk/binging_techhacker_movies_lately_love_mrrobot/"
    },
    {
        "id": "1nww0ln",
        "author": "pinkykimster",
        "title": "Is monsters, Ed Gein, really about Ed Gein?",
        "content": "So is monsters, Ed Gein, really about Ed Gein?\n\nOkay, so I'm only two episodes in, so I may have missed the mark. But two episodes in, monsters Ed Gein, is monsters Alfred Hitchcock, psycho, featuring Ed Gein. I get that the making of psycho would make for a very interesting story. I just didn't expect a series about Ed Gein, being about that. Or mostly that. When I watched monsters Jeffrey Dahmer, or the Menendez brothers. I didn't watch a series about a movie based on them. And some hard hitting issues involved with that. Again, would make an excellent series. Not the one I thought I was watching though. Is this a me thing?\nEdit\n\nI made it to episode 4. To all of you who hinted it was going to also be about the Texas chainsaw massacre, this and silence of the lambs, well done. But honestly ffs. If they didn't know enough of Ed Gein to make a series out of it, than don't. No need to make stuff up. Or connect him to movies. Or I half part get that part. But make that it's own series, movies inspired by Ed Gein. Usually monsters takes some creative licence. Here, they took all the licence. Most of this is made up. When it didn't have to be. What he did was plenty to base a series on. What they did was make up shit surrounding this case, give the lead an awful voice the real Ed didn't. And than show,  hey, remember this movie? Wasn't that guy weird. Oooh that and making the lead in the Hitchcock movie gay. And him going, ugh, gay, that is so shit. My life is so shit. *I heard the real actor went through conversion therapy* All of this I hated. Im not watching episode 5. To those who stuck with it, let me know if I got it wrong. Im just done. The acting is fine. It's not them. The series is just so all over the place bad",
        "upvotes": 13,
        "comments": 103,
        "media": null,
        "permalink": "/r/netflix/comments/1nww0ln/is_monsters_ed_gein_really_about_ed_gein/"
    },
    {
        "id": "1nwcu16",
        "author": "SmartStar65",
        "title": "Elon Musk Doubles Down On Netflix-Bashing Over Trans Cartoon Character Park'",
        "content": "",
        "upvotes": 164,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1nwcu16/elon_musk_doubles_down_on_netflixbashing_over/"
    },
    {
        "id": "1nwwio9",
        "author": "priMa_Customs",
        "title": "What do you think?",
        "content": "I’ve just started episode 3, and wow… I thought the Dahmer series was disturbing (and very well done), but this one feels even worse in terms of how unsettling it is. I can’t quite put my finger on why, but I’m sitting here just completely disturbed.\n\nDoes anyone else feel the same? I honestly can’t believe what I’m watching…",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nwwio9/what_do_you_think/"
    },
    {
        "id": "1nwk2h5",
        "author": "Ember_Grove20",
        "title": "What’s the first show or movie you ever watched on Netflix?",
        "content": "I was just thinking about how long I’ve been using Netflix and realized I honestly can’t remember what the very first thing I watched was. Now I’m curious if anyone here actually remembers theirs. What was your very first Netflix watch, and do you still think about it?",
        "upvotes": 24,
        "comments": 153,
        "media": null,
        "permalink": "/r/netflix/comments/1nwk2h5/whats_the_first_show_or_movie_you_ever_watched_on/"
    },
    {
        "id": "1nwyemg",
        "author": "Atlast_2091",
        "title": "Steve | Official Trailer #2 | Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nwyemg/steve_official_trailer_2_netflix/"
    },
    {
        "id": "1nx1qyq",
        "author": "FarOutMagazine",
        "title": "David Squires' comic on the sticky story of a drinks dynasty",
        "content": "Ask any dynasty and they will happily tell you that the hardest part is finding a successor.\n\nThat’s the same for any business, be it legacy media a la Logan Roy and his band of bratty nepo babies in [*Succession*](https://faroutmagazine.co.uk/the-one-take-scenes-that-made-the-final-season-of-succession-a-masterpiece/) or those in the murky world of alcohol.\n\nAs *House of Guinness* takes hold of Netflix and becomes perhaps the most interesting story about the booze-du-jour ever committed to the screen (some feat!), our cartoonist, David Squires, looks at the trials and tribulations of a different family.\n\nThis one isn’t as rich, nor as velvety, but it certain packed a punch, and usually a few kicks too, as it trickled down every high street in Britain.\n\nWelcome to the brightly blue world of the WKD family.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nx1qyq/david_squires_comic_on_the_sticky_story_of_a/"
    },
    {
        "id": "1nx1i15",
        "author": "HeavyVanilla2083",
        "title": "Streaming rights shuffle: Movie disappears mid-watch on Netflix, pops up next day as ‘newly added’ on Hotstar 😂",
        "content": "On October 1st, I was watching The Great Wall movie on Netflix. It was available only for that day as the last limited show. But just when the movie had a few seconds left, the screen automatically went black and an error popped up saying “This title is not available.”\n\nBut today when I opened my Jio Hotstar, the same movie showed up there with a “newly added” status. 😂😂",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nx1i15/streaming_rights_shuffle_movie_disappears/"
    },
    {
        "id": "1nwp130",
        "author": "Catevagreen",
        "title": "Another Wayward Post. I liked it.",
        "content": "It was really nice to see the kids come from Toronto. I’m Canadian and I could understand these teenagers. We don’t really have reform schools here. I think they were banned. We made conversion therapy illegal a few years ago. So sending young girls to America is plausible.  \n\nI completely remember having a sketchy friend for a ride. He had a car like that. The whole scene where ditches Lelie is on point. Sketchy guys were never far behind. But she does make it across the border. That’s some guts without back up. \n\nI kept watching because that griped me. I was a fucked up Canadian teenager. I’d be terrified in the states. You don’t have the same laws and I would feel much more in danger. This to me more of harrowing tale just from that perspective.  \n\nIf you don’t like Mae Martin I find that disheartening. They he/she wrote an award winning show called ‘Feel Good’ for Netflix a few years back. It’s all about how hard it is be different and hurting inside. I think it was very good and taught me a lot about Trans people. I was glad to see Netflix give them another show. \n\n\n\n",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nwp130/another_wayward_post_i_liked_it/"
    },
    {
        "id": "1nwvaza",
        "author": "Spongybobchum",
        "title": "I think the trailer for Sesame Street release# October 13",
        "content": "Usually, we get the trailers 4 weeks before the title itself is added to Netflix.\n\nAnd we know Sesame Street will be on Netflix on November 10, meaning the trailer date is most likely October 13.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nwvaza/i_think_the_trailer_for_sesame_street_release/"
    },
    {
        "id": "1nwbl5v",
        "author": "pogonotomy_lover",
        "title": "I liked Wayward and I don't understand the criticism",
        "content": "The series premiered exactly a week ago, I watched it, and I enjoyed it. I didn't once think the actors were bad, a criticism I've seen a couple of times in reddit discussions. I was also very surprised by how they managed to make the dialogue between Leila and Abbie sound realistic and natural compared to how they've made teenagers speak in other Netflix shows, and I appreciated that.\n\nI definitely have no experience in entertainment criticism or analysis; the only way I judge whether the acting was good or bad is how much I believe the actors, and therefore how much I can focus on the plot. This is, of course, very subjective, but the only time I felt a little disconnected from the plot was with Abbie's father. I didn't fully believe his character's outburst or his overall persona, but I don't think he had more than 15 minutes of screen time, and I don't consider it \"bad\" acting—just less compelling. I truly don’t think this show had \"bad actors\". \n\nI think most of the criticism I’ve read comes from people that aren’t the show's target audience, which, from my perspective, seems to stem from their personal biases against queer people or from not connecting with or relating to the show's theme, which is intergenerational trauma and how it can cause children, teens, and eventually adults to feel the weight of their parents' unresolved grief or trauma, resulting in deep guilt and a sense of being \"bad kids\", even before they’ve developed a moral compass or an integral sense of self. \n\nAs for the protagonist, I can’t thank Mae Martin enough for the representation they gave the trans community in this series. I’ll save that aspect of this review for another subreddit though, as I have read very ignorant and rude comments regarding Mae Martin’s character, Alex, and I hope to minimize that aspect of the discussion in this post. \n\nI think the show does an incredible job of showing that there are no \"bad kids,\" but rather they are a direct result of their environment and the extremes parents or families go to in order to \"cope\" with their children, rather than working on themselves or simply trying to connect with them from a place of love, understanding, and empathy. I think all parents should go to therapy at least a few times, which I recognize is a statement that stems from and leads to something much deeper from a historical, sociopolitical, and evolutionary perspective. But, I think many parents should have gone to therapy before having children, and the series does a great job of taking that feeling and amplifying it to a psychological thriller level, while also depicting the dangers of retreats, programs, and poorly researched and unethical therapeutic methods for minors.\n\nOne of Sydney Topliffe's (Abbie) lines from Episode 1, \"When you had kids, what the f\\*\\*\\* did you imagine it would be like?\" that she says to her dad in an outburst, really struck me. I think it captures the incomprehension and frustration that so many children and teenagers feel: \"Why did my parents even have kids?\" Meaning, \"Why did this person or these people bring me into the world only to make me feel every day that they wish they hadn't?\" or “Did they create an idea or expectation of children and family, if any, in their heads that I'm not living up to, or do they simply not like me as a person?” Even though it could never be the kid’s fault truly, they are made to feel as though it is. Another line that captures this sentiment is Toni Collete's (Evelyn) line in Episode 7: \"Birth is... nonconsensual.\" \n\nI've also seen criticism that there are plot holes. I finished the series today, and I can't say with complete certainty that I found any plot holes per se, but I did feel that some things were left “up in the air”. For example, I think some character's subplots felt a bit rushed; it would have been interesting to know more about many of them (e.g., Riley and Maurice), but I also understand that it's a miniseries and covers topics that could give much more screen time in order for them to thrive.\n\nAs for the toads (I think cane toads), I do think they're simply symbolic. They're an invasive species that has taken over the town, and in one way or another, they're everywhere, just like Evelyn. Depending on the culture, they also represent different things, such as fertility and abundance, transformation and rebirth, healing and purification, among others (Logan, 2024). All of the articles I found about toad and frog symbolism can be closely associated with the series, including those that presented a negative and evil interpretation of frogs and toads, as most of the characters have different or opposite perspectives of Evelyn, many having both throughout the series and their character's development. Also, I'm sure the show implies that the toads have a role in the making of the drug used on the graduates, which isn't so far fetched in a science-y fiction way as there are psychedelic amphybians. The fact that the phase is called \"The Leap\", is probably also a play on the fact that frogs jump or \"leap\" from one place to another. I also think it could symbolize the term \"leapfrog\", which according to Cambridge Dictionary, can also be used as a verb to describe: \"to improve your position by going past other people quickly or by missing out some stages\". Maybe this could be interpreted as wanting to heal and become your new self with Evelyn's drug quickly, without going through a much longer process of healing and learning to live with your trauma, by facing your past, yourself and others, but that could just be a personal interpretation.\n\nI also read some reviews that said the series dragged on too long, something I personally disagree with. I think almost every aspect of the series contributed to the plot and deserves analysis from an entertainment perspective, but also from a psychological one. If anything, I sometimes felt it was fast paced and I hope they decide to renew for a second season.\n\nIn the future, I would love to rewatch this series with even more attention to detail, as I thoroughly enjoyed it and believe it has incredible potential, I hope Mae Martin takes up more production and acting roles as well.",
        "upvotes": 37,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1nwbl5v/i_liked_wayward_and_i_dont_understand_the/"
    },
    {
        "id": "1nwwqet",
        "author": "Oddmouse1234",
        "title": "Netflix on PC",
        "content": "Whenever I try to watch Netflix on my PC setup that uses dual 4K monitors, one of the screens will randomly go black for a second, and at times the entire system even freezes—what could be causing this issue?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nwwqet/netflix_on_pc/"
    },
    {
        "id": "1nwr8ig",
        "author": "charlotte_marvel",
        "title": "A Netflix original series that I saw on my account without using VPNS is now no longer showing up",
        "content": "I can't find the summer hikaru died and the fragrant flower blooms with dignity despite the fact they have been accessible in my country up untill this point \n\nHelp me I'm confused ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nwr8ig/a_netflix_original_series_that_i_saw_on_my/"
    },
    {
        "id": "1nwu5fr",
        "author": "alwaysaloneinmyroom",
        "title": "My netflix showing the same trailer for 3 or 4 different movies",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nwu5fr/my_netflix_showing_the_same_trailer_for_3_or_4/"
    },
    {
        "id": "1nw0no9",
        "author": "asdfghanjkl",
        "title": "thoughts on Wayward",
        "content": "here's mine: it could've been a 2-hour movie.\n\nloose ends, plot holes, has so much potential but the plot is struggling and scrambling. I thought the acting was great (especially Toni's and all the Tall Pines Academy kid(?) actors), however the flow was a bit too draggy. I sat through the whole thing and binged without any skips, but I wished I did, or at least watched it in a faster speed. I saw a lot of people having so many questions after watching, and I get it. I feel the same way too, and how I truly wish it could've been a movie instead. not the best series, but it's dragging me to watch it enough even though with a very loose thread. interesting concept though!",
        "upvotes": 55,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1nw0no9/thoughts_on_wayward/"
    },
    {
        "id": "1nwsnc6",
        "author": "Ok-Assist5226",
        "title": "Does Netflix purposely download their originals/exclusive content when you turn on Downloads for You?",
        "content": "Each time I turn on Downloads for you on Netflix, I say about 90%(thats being generous it could be more) of the content that gets downloaded is their Netflix originals/exclusive content. And the to be honest I wouldn’t mind if they at least they download the content they curated to my ratings and content I have watched. 100% of the time they release an Netflix original it’s gets downloaded so that’s why I think they are purposely doing it but I just want to see if any other people feel the same ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nwsnc6/does_netflix_purposely_download_their/"
    },
    {
        "id": "1nwsk3w",
        "author": "zoeiszesty",
        "title": "Why is this show taking up my comedy search?",
        "content": "https://preview.redd.it/4gf5l86jmusf1.png?width=1847&amp;format=png&amp;auto=webp&amp;s=c97f26522e4818cd2a39e7a7bada3eb5436b3f22\n\nI'm beyond confused? It's an Indian comedy show, but they're showing it as 2 minute clips and its all i'm seeing when i look up comedy, just beyond confused about this, I don't even speak any Indian languages.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nwsk3w/why_is_this_show_taking_up_my_comedy_search/"
    },
    {
        "id": "1nweex3",
        "author": "National-Poet-9165",
        "title": "Dark hits completely different on the second watch.",
        "content": "https://preview.redd.it/2j34fra29rsf1.png?width=480&amp;format=png&amp;auto=webp&amp;s=74fa63368f29e7da0c24f7f37531da3ae8544d18\n\nThe first time through, my brain was just in survival mode trying to keep up with who’s who. On my rewatch, it feels like a completely new show, I catch so many subtle details and emotional setups that flew over my head before.",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nweex3/dark_hits_completely_different_on_the_second_watch/"
    },
    {
        "id": "1nwjxvp",
        "author": "laurlu",
        "title": "Netflix on Roku TV",
        "content": "Is anyone else’s Netflix App on their Roku TV absolutely horrible? I don’t know if it’s my tv getting old or what, but the Netflix app is god awful. It’s extremely quiet compared to the rest of my streaming services, it glitches out if I try to pause/fast forward/rewind, it will literally make my tv crash back to the main menu. And if it makes my TV freeze, it takes like 10 minutes for the app to close out and take me back to my home screen. None of the other streaming apps do this on my Roku tv so that’s why I’m thinking it’s a Netflix-only issue. I’m so annoyed!!!",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nwjxvp/netflix_on_roku_tv/"
    },
    {
        "id": "1nwp2ta",
        "author": "Joylar7",
        "title": "Alice movie spoilers",
        "content": "Spoiler: how is Alice’s husband alive at the end. Wasn’t he shot dead after running away? \n\nI was so confused or did I get it wrong. He has a crutch and was standing on one leg ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nwp2ta/alice_movie_spoilers/"
    },
    {
        "id": "1nwes3c",
        "author": "Turbulent_Pipe_2391",
        "title": "need recommendations for dual subtitles and larger font",
        "content": "hi, total newbie to netflix. literally installed it to learn another language by watching movies. do you have any good recommendations to display subtitles in two different languages? what about showing the subtitles in a larger font (I know that netflix allows to change font, but the largest is still not enough because I'm sitting far from the screen and the screen is not big)\n\nwould be great if the recommended browser extensions were free",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nwes3c/need_recommendations_for_dual_subtitles_and/"
    },
    {
        "id": "1nw215d",
        "author": "Significant-Fun-4235",
        "title": "Please dont make this a trend for all non-US shows!!!",
        "content": "*Processing img 71tjd244wosf1...*\n\nI swear I was already pissed when Squid Game America was announced, but to even see someone is actually thinking about an Alice in Borderland spinoff is baffling! If this happens, maybe the future will show us Stranger Things China, Wednesday Korea, or Bridgerton South Africa. ",
        "upvotes": 12,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1nw215d/please_dont_make_this_a_trend_for_all_nonus_shows/"
    },
    {
        "id": "1nwkwvk",
        "author": "pocketrob",
        "title": "Billionaire's Bunker Inconsistency",
        "content": "When Asia is playing her sister's phone videos, and they show a shot of her and Max... Does anyone else get the urge to shout at the screen: Who's filming them?! 😂",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nwkwvk/billionaires_bunker_inconsistency/"
    },
    {
        "id": "1nwr4mg",
        "author": "relicmaker",
        "title": "Monsters Ed Gein",
        "content": "Monsters Ed Gein. What happened? It’s been showing as Coming Soon but now it’s gone? I’ve been looking forward to watching this show! Does anyone know what’s happened?",
        "upvotes": 0,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1nwr4mg/monsters_ed_gein/"
    },
    {
        "id": "1nvncdg",
        "author": "lil_sass-a-frass",
        "title": "Wayward was addictive. Kept me hooked throughout.",
        "content": "Admit I thought it was gonna be boring during the first episode but really had me guessing and almost watched the whole series in one sitting just to see what was next. Sometimes Netflix hits good with with a show like that. Was a bit disappointed that the ending did not turn out how I expected! Definitely made it even more thought provoking though.. ",
        "upvotes": 98,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1nvncdg/wayward_was_addictive_kept_me_hooked_throughout/"
    },
    {
        "id": "1nvumgb",
        "author": "daniellim1121",
        "title": "Alice in Borderland Season 3 Summary in 3 Photod",
        "content": "",
        "upvotes": 28,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1nvumgb/alice_in_borderland_season_3_summary_in_3_photod/"
    }
]