[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 488,
        "comments": 261,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1isewv3",
        "author": "MassiveDexterFanGirl",
        "title": "The Laundrie Family are THE worst!",
        "content": "The way they just batted off the police and gave no cooperation at all, nothing to ease the minds of the Petito Family, it's disgusting! \nThey should be charged with perverting the course of justice! ",
        "upvotes": 189,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1isewv3/the_laundrie_family_are_the_worst/"
    },
    {
        "id": "1isha22",
        "author": "tekavi23",
        "title": "Just Finished : Gabby Petito and I have so many questions",
        "content": "\n- POS killed her &amp; then stole her money to drive home\n\nLegally speaking : \n\n- when she went missing &amp; Brian had her van in Florida, couldn’t cops pressure him to answer questions since he had a van he didn’t own ?! \n\n- after the body was found &amp; there was a FBI wanted for Brian, couldn’t by law the parents be forced to speak ?\n- after Brian went “misssing” &amp; FBI searched the entire area …. The parents went and “found him” within the hour.\n- couldn’t the parents be criminally charged for aiding a murder?!\n ",
        "upvotes": 98,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1isha22/just_finished_gabby_petito_and_i_have_so_many/"
    },
    {
        "id": "1iso5az",
        "author": "Apprehensive_Sign_93",
        "title": "Is one piece USA leaving?",
        "content": "I just noticed that one piece in the earlier seasons is leaving Netflix. I have acreenshots, they are in dutch but you should be able to understand them. It says final day is february 19th, Ig I can't complete the series now.",
        "upvotes": 13,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iso5az/is_one_piece_usa_leaving/"
    },
    {
        "id": "1is0q3j",
        "author": "bluntprincess99",
        "title": "TW (Spoilers) How angry are you after seeing the American Murder: Gabby Petito ?",
        "content": "True crime documentaries usually anger us, but this angered me like no other. \n\nSpoilers\n\n\n\n\n\n\nThe man lied in his suicide letter. \nThe parents helped him cover up a murder. \n\nI mean how can people be this cruel and sociopathic. ",
        "upvotes": 351,
        "comments": 185,
        "media": null,
        "permalink": "/r/netflix/comments/1is0q3j/tw_spoilers_how_angry_are_you_after_seeing_the/"
    },
    {
        "id": "1is9ql4",
        "author": "doofuzzle",
        "title": "Which Netflix animated series is surprisingly good?",
        "content": "For me, BoJack Horseman is the standout. I started watching it because I thought it would just be a silly animated show, but it turned out to be deep, emotional, and incredibly well-written, tackling tough topics like depression, addiction, and self-worth with humor and heart.",
        "upvotes": 23,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1is9ql4/which_netflix_animated_series_is_surprisingly_good/"
    },
    {
        "id": "1isnqc8",
        "author": "Week-Stock",
        "title": "American Primeval: What is the name of poem recited by Devin?",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1isnqc8/american_primeval_what_is_the_name_of_poem/"
    },
    {
        "id": "1isndd1",
        "author": "indiewire",
        "title": "The 25 Best Rom-Coms on Netflix: ‘Notting Hill,’ ‘No Hard Feelings,’ and More",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1isndd1/the_25_best_romcoms_on_netflix_notting_hill_no/"
    },
    {
        "id": "1isbbfo",
        "author": "Josomie",
        "title": "Animated Squid Game Gi-hun in stop motion",
        "content": "",
        "upvotes": 14,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jlc94w513wje1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1isbbfo/animated_squid_game_gihun_in_stop_motion/"
    },
    {
        "id": "1iryv1b",
        "author": "Turtleballoon123",
        "title": "Started Baby Reindeer. It's brtutal and depressing yet compelling.",
        "content": "I don't know what to make of the show. It's brilliant, yet also brutal and depressing. Episode 4 is heart-wrenching. I've seen discussions from survivors who say the show can be triggering or who had to switch it off. I really feel for the series creator who based this off a story. It's so fucked up.",
        "upvotes": 123,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1iryv1b/started_baby_reindeer_its_brtutal_and_depressing/"
    },
    {
        "id": "1istar0",
        "author": "Zestyclose-Spare3446",
        "title": "American Murder: Gabby Petito",
        "content": "Was I the only one that heard the dispatcher almost laugh while the call was reported? After they asked for the vehicle description, the dispatcher said “a white *laugh* van?” Maybe it was just me… I think the officers may have written this off as “young crazy love” or maybe Gabby being written off as a typical “woman.” It just all seems so sick and I’m so sad for her. She deserved so much more… ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1istar0/american_murder_gabby_petito/"
    },
    {
        "id": "1ismw1g",
        "author": "DUCKlloovvaa1497",
        "title": "Good apocalypse movie",
        "content": "I like movies about a group of people trying to survive the apocalypse especially if it’s zombies, I just finished watching day break and that was great. If anybody knows and good apacolypse tv-series’s or shows similar to daybreak please leave it in the reply’s.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ismw1g/good_apocalypse_movie/"
    },
    {
        "id": "1irzxha",
        "author": "yercoolmarple",
        "title": "The character Rose in The Night Agent is insufferable at this point.",
        "content": "I just have to get this off my chest, even at the risk of getting massively downvoted, this character is so poorly written. She changes her mind ten times in a single episode and is excessively annoying. The story itself is dull and weak overall with no character developments, but I could live with that if it weren’t for ***this*** one character being forcefully inserted into every situation. It made sense in Season 1 since the story revolved around her, but in Season 2? Even FBI agents are unaware of Night Action, yet somehow, this civilian is deeply involved in everything??seriously? If the writers were so intent on keeping her relevant, why not just hire her as a tech? Instead, they throw a civilian into the field like it’s nothing. To top it all off, the actor really cannot act. It was really difficult to finish season 2. I am not even getting to the other issues like poor writting, countlessly irritating character arcs.. S1 was not the greatest but it felt like this had some promise going forward and boy, oh boy, was I wrong.",
        "upvotes": 75,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1irzxha/the_character_rose_in_the_night_agent_is/"
    },
    {
        "id": "1isr4vt",
        "author": "lindafromevildead",
        "title": "Yellowstone Season 5",
        "content": "\n\nDoes anyone know when season 5 will be out? I know the first 4 seasons came out January 30th-I was really excited to see it on Netflix because I don’t have Paramount but I see there is no season 5 🥲\nI’ve already watched seasons 1-4 when the show was on Amazon Prime and really don’t want to pay for another streaming service to finish the show if it’s going to be out soon.\nI’m in Canada- I did post this in the Netflix Canada sub but it’s not very active.\nThank you ! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1isr4vt/yellowstone_season_5/"
    },
    {
        "id": "1iscj20",
        "author": "dailystar_news",
        "title": "Netflix details how Gabby Petito trip of lifetime turned into double death hell",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iscj20/netflix_details_how_gabby_petito_trip_of_lifetime/"
    },
    {
        "id": "1isc2ag",
        "author": "Moonlightbeaming",
        "title": "American Murder: Gabby Petito + The Family Next Door",
        "content": "After watching both of these documentaries it's so eerieing the similarities of these two cases.\n\nTo start off: Both Gabby and Shannan had the same similarities of posting the \"happy life\" to social media. \n\nThe families are also similar as well.\nWith Chris Watts his family was the same narcissistic way as their son. Especially the mother. Blaming Shannan for everything. With Gabby, Brian’s mom is also narcissistic. In the same aspect as Brian. Both sons were narcissistic same as their mothers. \n\nThe body cams/story. In both body cams both Brian and Chris have that same smiley expression. They also both blamed the other party on wrong doing. Brian convinced the cops that Gabby was also being the aggressor. With Chris during the start he blamed Shannan stating they were fighting and she could of left with the kids. Also made the story convincing by her \"leaving the ring behind.\" During the interrogation Chris also claimed Shannan was choking one of the daughters and that's what \"made him\" kill Shannan.\n\nI just wanted to state this information because I started noticing the similarities when I saw the Brian body cam happened on August 12 2021. Chris murdered his family August 13 2018. \n\nIf there is anything else that is worth sharing please comment below! I'm sure there is a lot more similarities than my findings! ",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1isc2ag/american_murder_gabby_petito_the_family_next_door/"
    },
    {
        "id": "1is9dyf",
        "author": "Sweaty-Toe-6211",
        "title": "“All the Manga People Will Know”: ‘One Piece’ Star Katey Sagal Teases Crocodile’s Role for Season 2 and 3",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is9dyf/all_the_manga_people_will_know_one_piece_star/"
    },
    {
        "id": "1iruqoh",
        "author": "BlissfulEmilia",
        "title": "What's your all-time favorite Netflix original series?",
        "content": "I’ve been on the hunt for new Netflix originals to binge, and I wanted to know: what’s your all-time favorite Netflix original series? Whether it’s a drama, comedy, or documentary, I’m looking for recommendations that are must-watches. Bonus points if it’s something that really flew under the radar but ended up being amazing.",
        "upvotes": 99,
        "comments": 436,
        "media": null,
        "permalink": "/r/netflix/comments/1iruqoh/whats_your_alltime_favorite_netflix_original/"
    },
    {
        "id": "1isoc5r",
        "author": "Leather-Account8560",
        "title": "Please help me find this animated sci-fi show",
        "content": "I can’t remember the name and it might not even be a Netflix show but a ship crashes on a foreign planet and the crew gets separated and try to get back to the main crashed ship. Almost everyone dies and I remember a character having a robot that got destroyed by a telepathic alien that had absorbed some of the crew members. And another group of survivors encountered a tree that replaces your heart and puppets you around to make more heart trees. Please help me ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1isoc5r/please_help_me_find_this_animated_scifi_show/"
    },
    {
        "id": "1ishqap",
        "author": "Epigato",
        "title": "Hello r/netflix Im in a bit of a pickle",
        "content": "So my mom bought the subscription for the first time in her life, and Im trying to log in on my pc.\n\nThe subscription is like 10 dollars or smth, and for some reason when I log in it asks me to pay as well, whats happening?",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ishqap/hello_rnetflix_im_in_a_bit_of_a_pickle/"
    },
    {
        "id": "1is72r0",
        "author": "techfinpro",
        "title": "‘Stranger Things’ Jamie Campbell Bower Talked To Therapist About Not Wanting To Play Villains For A While: ‘F—s Me Up’",
        "content": "",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is72r0/stranger_things_jamie_campbell_bower_talked_to/"
    },
    {
        "id": "1irgsx6",
        "author": "Worldpeacee007",
        "title": "Official Discussion - American Murder: Gabby Petito",
        "content": "Crazy to think we are now in the era of tik Tok murder docs. Seeing victims document much of their lives in 4k adds a whole other heartbreaking element to these kinds of series and stories. I am only one episode in, but I thought this would be an interesting place to discuss the series.\n\nEdit: I have finished the series and I can say I went through pretty much every emotion while watching this-mostly anger and sadness. Gabby was such a beautiful soul. Feels like we all know someone like her.\n\n It's truly a shame so many people find themselves stuck in relationships with manipulative abusers. It was like Gabby couldn't wrap her mind around leaving him. Even in her final text message, she tells her mom that they aren't breaking up. It's almost like some people feel like if they break up with their partner, they consider *themselves* a failure. Just a really sad and devastating story. Watching the vlog outtakes of them made me so uncomfortable. It makes you think about how the internet is truly a facade.",
        "upvotes": 306,
        "comments": 1047,
        "media": null,
        "permalink": "/r/netflix/comments/1irgsx6/official_discussion_american_murder_gabby_petito/"
    },
    {
        "id": "1irh528",
        "author": "mmprobablymakingitup",
        "title": "What’s a show you randomly started watching on Netflix and ended up loving?",
        "content": "I started Blacklist on a whim, not expecting much, but it completely pulled me in. Whether it was the story, characters, or just the overall vibe, I ended up binge-watching the whole thing.\n\n",
        "upvotes": 282,
        "comments": 790,
        "media": null,
        "permalink": "/r/netflix/comments/1irh528/whats_a_show_you_randomly_started_watching_on/"
    },
    {
        "id": "1isgav3",
        "author": "dont_frek_out",
        "title": "Downside to cancelling and restarting",
        "content": "I have a standard ad-free plan which I've had for a very long time. Due to less interesting content and price increases I want to cancel my account and restart it within 10 months to save money (but preserve watch history . I spoke to a friend and he said my plan has additional benefits grandfathered (old rules are extended) in and to not cancel. From what I can tell nothing is grandfathered  for standard plans and my friend is wrong.\n\nCan someone confirm?\n\nAlso do memberships still immediately restart if one logins it? Or do you need to explicitly enable restarting? It could be useful to check watching history, etc. during the cancelled time.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1isgav3/downside_to_cancelling_and_restarting/"
    },
    {
        "id": "1isg50e",
        "author": "sidderr",
        "title": "Netflix randomly starts a Chinese show",
        "content": "Yesterday I’ve booted up the Netflix app on my TV and it completely skipped the profile selection part and instantly played a Chinese show without any subtitles.. When I went back I only saw a black screen, I had to force restart the app to make it work. I live in The Netherlands FYI. \n\nThis is the second time this happened, can anybody tell me what’s going on? 🙃",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1isg50e/netflix_randomly_starts_a_chinese_show/"
    },
    {
        "id": "1is2fik",
        "author": "ThinkBlink3",
        "title": "Cassandra: so much potential, so little substance",
        "content": "Well obviously spoilers ahead so read at your own risk.\n\nCassandra as a show promises so much with its premise. The movie and TV space has produced some excellent work with the whole \"AI gone rogue\" as a topic (read: Ex Machina) but Cassandra is one of those that doesn't live up to the hype it creates and can definitely be skipped.\n\nFirst of all, it features some of the dumbest side characters (Samira's family) who genuinely made my blood boil as I was watching this. I get that you need to push the story ahead but definitely not at the cost of making your characters 50 IQ. Juno doesn't tell anyone Cassandra told her where the gun is despite it almost getting her expelled. Fynn doesn't mention what his boyfriend said to him about Cassandra till it's too late and David is honestly so unlikeable and dumb, that already makes this a difficult watch.\n\nThe story starts okay, peaks around episode 4 and doesn't make any coherent sense from that point. The plot twist is not only there for the sake of it but is somehow still extremely predictable. The ending far too rushed, even for a 6 episode series. The whole plot with Samira's sister feels so badly forced in, that I had to skip past most of it in the later episodes to get to the end.\n\nSpent my weekend watching this and retrospectively I could have spent it staring at a painting and come out more content.\n\n1.5/5\n",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1is2fik/cassandra_so_much_potential_so_little_substance/"
    },
    {
        "id": "1isfi0v",
        "author": "MicroglialAndTheGut",
        "title": "iPhone 11 download quality suddenly poor",
        "content": "I recently noticed my downloads for everything on my iPhone 11 is low quality and looking at the size of the files it is very small (before it use to be around 600MB+ for an hour-ish long episode). My settings seem to be correct as well and downloads were completely fine before. When I stream episodes the quality seems much better and likely HD. Does anyone else have this issue now? Are there any solutions?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1isfi0v/iphone_11_download_quality_suddenly_poor/"
    },
    {
        "id": "1is3pde",
        "author": "Jazzlike_Custard_242",
        "title": "Mo season 2 autism representation",
        "content": "I have no words.\n\nIt’s been a very long time since I watched a show and been this emotional.\n\nI have a cousin with autism and this show just represents it so good. I was brought to tears by Sameer’s first therapy session in the new season of Mo. The actors the script everything was done amazingly. Hearing Sameer’s dialogue was truly touching.\n\nSeason 2 is so much better done than first season, as it explores the other characters more rather than focusing in on Mo alone. Really good job to everyone involved in it, I would totally recommend other people to watch it.",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is3pde/mo_season_2_autism_representation/"
    },
    {
        "id": "1irmoed",
        "author": "quietdepths",
        "title": "American Murder : Gabby Petito Netflix",
        "content": "I just finished watching the Netflix series about this and omg how sad and shocking. These documentaries really put me off relationships these days and make me so skeptical about how people truly are and just what we see online. \n\nIt’s very true that sometimes the people that seem the happiest online are often the saddest sometimes and with the most skeletons. I personally know many couples who would constantly post how in love they are and suddenly the very next day decide to divorce. And others who never post about one another but live a very happy and quiet life.\n\nAnyway this whole case was so sad and she seemed like such a bright and bubbly girl. One thing though, I need the caveat before I say it is that I’m not blaming her parents but just I know if it were me in that situation and I had said those things to my parents about him they absolutely would expect me to come back to them and would not be happy about me continuing. I know everyone has different parenting styles but me coming from an Asian family - they wouldn’t be ok with some of the things the parents already knew.\n\nThat guy seemed really creepy but it’s the kind of creepy that isn’t obvious which makes it more scary and I do wonder just how involved their parents were. None of this matters anymore I guess, sadly she’s dead and I just hope everyone (men and women) are all careful of the kind of people they get involved with. It’s a scary world out there and relationships don’t seem to be what they were. Not saying everyone is a killer, just that…. I think it’s really hard these days ",
        "upvotes": 69,
        "comments": 289,
        "media": null,
        "permalink": "/r/netflix/comments/1irmoed/american_murder_gabby_petito_netflix/"
    },
    {
        "id": "1is8qxa",
        "author": "S4v1r1enCh0r4k",
        "title": "K-Drama 'Boyfriend on Demand' Moves to Netflix, Starring BLACKPINK’s Jisoo &amp; Seo In Guk, releasing in 2026",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is8qxa/kdrama_boyfriend_on_demand_moves_to_netflix/"
    },
    {
        "id": "1irnhth",
        "author": "TheTabOfficial",
        "title": "What's a Netflix show that you're glad you stuck with?",
        "content": "Sometimes you've really got to trust the process to understand why everyone is raving about a show, because the first episode or two might not hook you straight away. Which show or shows surprised you?",
        "upvotes": 35,
        "comments": 94,
        "media": null,
        "permalink": "/r/netflix/comments/1irnhth/whats_a_netflix_show_that_youre_glad_you_stuck/"
    }
]