[
    {
        "id": "1jrtvzp",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Alex Garland - Tuesday 4/8 at 4:00 PM ET - Director of 'Civil War', 'Ex Machina', 'Warfare', 'Annihilation', 'Men' - Writer of '28 Days Later', '28 Weeks Later', 'Dredd', 'Sunshine', 'Never Let Me Go', and '28 Years Later'",
        "content": "",
        "upvotes": 98,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wp4nvak8mxse1.png?auto=webp&amp;s=3f09391890bc27eba3a1446a5533f4a4c347859d"
        },
        "permalink": "/r/movies/comments/1jrtvzp/amaqa_announcement_alex_garland_tuesday_48_at_400/"
    },
    {
        "id": "1jr0sp7",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (A Minecraft Movie / Hell of a Summer) Plus Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[A Minecraft Movie](https://www.reddit.com/r/movies/comments/1jr0qff/official_discussion_a_minecraft_movie_spoilers/?)\n\n[Hell of a Summer](https://www.reddit.com/r/movies/comments/1jr0qki/official_discussion_hell_of_a_summer_spoilers/?)\n\n# 25th Anniversary Throwback Discussion Threads\n\n[The Road to El Dorado](https://www.reddit.com/r/movies/comments/1jr0qog/official_throwback_discussion_the_road_to_el/?)\n\n[High Fidelity](https://www.reddit.com/r/movies/comments/1jr0qs7/official_throwback_discussion_high_fidelity/?)\n\n[The Skulls](https://www.reddit.com/r/movies/comments/1jr0qw5/official_throwback_discussion_the_skulls_spoilers/?)\n\n**Next week's throwback discussions will be Rules of Engagement, Return to Me, and Ready to Rumble!**\n\n# Still in Theaters\n\n[Death of a Unicorn](https://www.reddit.com/r/movies/comments/1jlkd7q/official_discussion_death_of_a_unicorn_spoilers/?)\n\n[The Working Man](https://www.reddit.com/r/movies/comments/1jlkdcp/official_discussion_the_working_man_spoilers/?)\n\n[The Woman in the Yard](https://www.reddit.com/r/movies/comments/1jlkdi0/official_discussion_the_woman_in_the_yard_spoilers/?)\n\n[Magazine Dreams](https://www.reddit.com/r/movies/comments/1jlkdma/official_discussion_magazine_dreams_spoilers/?)\n\n[Ash](https://www.reddit.com/r/movies/comments/1jlkdp3/official_discussion_ash_spoilers/?)\n\n[Snow White (2025)](https://www.reddit.com/r/movies/s/zHwZaVwVDH)\n\n[Black Bag](https://old.reddit.com/r/movies/comments/1jat4fj/official_discussion_black_bag_spoilers/?)\n\n[Mickey 17](https://www.reddit.com/r/movies/comments/1j5dv2d/official_discussion_mickey_17_spoilers/?)\n\n\n# On Streaming\n\n[O'Dessa](https://www.reddit.com/r/movies/comments/1jlkdu3/official_discussion_odessa_spoilers/?)\n\n[The Electric State](https://old.reddit.com/r/movies/comments/1jbkncc/official_discussion_the_electric_state_spoilers/?)\n\n[The Gorge](https://old.reddit.com/r/movies/comments/1iuhec9/official_discussion_the_gorge_spoilers/?)",
        "upvotes": 24,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1jr0sp7/official_discussion_megathread_a_minecraft_movie/"
    },
    {
        "id": "1js6pgv",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Tron: Ares'",
        "content": "",
        "upvotes": 12089,
        "comments": 1016,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/h2opp3lhh1te1.jpeg?auto=webp&amp;s=a43f5e55e20546857a34ef478a62bc1226f67ca6"
        },
        "permalink": "/r/movies/comments/1js6pgv/official_poster_for_tron_ares/"
    },
    {
        "id": "1js6pjz",
        "author": "DemiFiendRSA",
        "title": "Tron: Ares | Official Teaser Trailer",
        "content": "",
        "upvotes": 8969,
        "comments": 1391,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aFmKDSvx8vD9DsWLJ6FrVOxFPYCkDyaUW5EpPY-BqbM.jpg?auto=webp&amp;s=beeea542088b8e922d73c4baa498f7ff5716975c"
        },
        "permalink": "/r/movies/comments/1js6pjz/tron_ares_official_teaser_trailer/"
    },
    {
        "id": "1jsbmst",
        "author": "MarvelsGrantMan136",
        "title": "Eric André Says Jesse Eisenberg Offered Him Kieran Culkin's Role in 'A Real Pain' But Turned It Down",
        "content": "",
        "upvotes": 2330,
        "comments": 147,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OFMnz_1d6k86PIDfhY7ZX21YENzLOTp3YyNGH_9LjUo.jpg?auto=webp&amp;s=56d96b60488bd61921b1eb28df5513fda30054e9"
        },
        "permalink": "/r/movies/comments/1jsbmst/eric_andré_says_jesse_eisenberg_offered_him/"
    },
    {
        "id": "1jsbwjp",
        "author": "Bolinas99",
        "title": "The Most Interesting Roommate in the World: Will Forte Remembers ‘MacGruber’ Co-star Val Kilmer",
        "content": "",
        "upvotes": 2042,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/A2l2mI3gnFi_LmRCBaTDWXQV6UbsLzpvH12Pv7DOxn8.jpg?auto=webp&amp;s=dcbf89f9fe67ce7452e7e5e450d1e7c78ad912e1"
        },
        "permalink": "/r/movies/comments/1jsbwjp/the_most_interesting_roommate_in_the_world_will/"
    },
    {
        "id": "1jsj69w",
        "author": "Luce55",
        "title": "I’ve watched The Fifth Element and the Lord of the Rings trilogy countless times; I know each like the back of my hand, and yet today while watching The Fifth Element, I realized that Bilbo is ALSO Father Cornelius!! WHAT!!!",
        "content": "Perhaps this post is a testament to my mental slowness (which I won’t argue) but that aside, it is a testament to the excellence of each movie’s cast, costuming/makeup, crew and direction that create two completely different movies - worlds, really - such that the same actor in one movie is completely “unrecognizable” in another. There are so many amazing actors who disappear in roles, thanks to not only their own talent, but also the number of people behind them who assist with various aspects necessary to create the character…it’s one of my favorite things about movies - how many people come together to create art that is totally unique even when the “materials used” to create it are the same. \n\nWhat other movie combos should I watch that will break my brain that the same actor plays a role in each? (Excluding Gary Oldman, Walton Goggins, Brad Douriff, and the like, because they’ve already ‘fooled’ me 🤣)\n\nPS I don’t care about spoilers, at all.",
        "upvotes": 375,
        "comments": 296,
        "media": null,
        "permalink": "/r/movies/comments/1jsj69w/ive_watched_the_fifth_element_and_the_lord_of_the/"
    },
    {
        "id": "1jslm8a",
        "author": "LuckyLadybug20",
        "title": "My dad is dying and I need movie suggestions to take my mind off it tonight",
        "content": "Basically, as the title says! I'm having a night where I feel very sad and have done a lot of crying about my dad. I am ready to change it up a bit, but am having a bit of choice paralysis. I am looking for something either super scary, very suspenseful, or so heartwarming I'll be crying tears of joy instead. Something that is incredibly engaging and will rope me in. Preferably, stay away from heart wrenchingly sad movies (although those do have a place in my grieving process, not tonight :)).\n\nThanks in advance!\n\nEdit: So many people with amazing suggestions! I’ve saved this post so I can come back and refer to it many times. I will slowly work my way through this list, thank you so much you kind souls!",
        "upvotes": 98,
        "comments": 80,
        "media": null,
        "permalink": "/r/movies/comments/1jslm8a/my_dad_is_dying_and_i_need_movie_suggestions_to/"
    },
    {
        "id": "1jsl254",
        "author": "ja6j2",
        "title": "Was 'A Serbian Film' really a critique of the post-war society in Serbia, or just a disgusting shock piece?",
        "content": "I've seen interviews with the director Srdjan Spasojević who defends himself by saying the entire movie was a commentary on the effects of the Yugoslav wars. I don't buy it, I think he makes a mockery of it to be honest, and I think he went out of his way to just create one of the most disgusting horrible films that has ever been made.\n\nThere's no deeper theme to the movie, he literally just conjured up in his sick little mind whatever the most fucked up thing he could think of.\n\nHowever i'm open to people disagreeing, I know it has love in the disturbing movies community, although even there i've seen hatred for it.",
        "upvotes": 101,
        "comments": 66,
        "media": null,
        "permalink": "/r/movies/comments/1jsl254/was_a_serbian_film_really_a_critique_of_the/"
    },
    {
        "id": "1jsgj6c",
        "author": "UH60Mgamecock",
        "title": "What are your essential film noir films?",
        "content": "I’m looking to dive into the seedy underbelly played by Hollywood. I’m taking a break from horror right now and switching gears. I’m a pretty strong Sci-Fi fan, but I know very little about the essential viewing in Film Noir. \n\nSo what do you recommend?  Not required to be solely English. I’ll take subtitled movies as well. ",
        "upvotes": 193,
        "comments": 331,
        "media": null,
        "permalink": "/r/movies/comments/1jsgj6c/what_are_your_essential_film_noir_films/"
    },
    {
        "id": "1js2mnh",
        "author": "Acceptable_Book_8789",
        "title": "What non-horror movie did you find most disturbing?",
        "content": "I saw the Ballad of Buster Scruggs weeks ago and still can't get it out of my head. It was marketed as a comedy, so I wasn't prepared for how sad and serious some of the stories would be. I had an uneasy, anxious feeling while watching, uncomfortable with the un romanticized nature of the stories. The gold prospector story was nice but still disturbing to see calloused competition and cruelty.\n\nI watch horror movies and usually don't feel disturbed so it's been puzzling trying to pin down why Buster Scruggs got to me.\n\nYou just know that things like that did happen during those times and while they happen today too, what disturbs me is that back then it was much more common and normal for tragedies to occur, and there was much less opportunity for accountability and awareness of the true events.\n\nIt disturbs me to think that people in the film had a limited ethical and moral compass not because they were evil outliers but simply because they were limited by the era and conditions they were born into. I don't like thinking of this powerlessness.\n\nWhile watching I felt like I was grieving for my ancestors for what their \"normal\" was, how harsh those times were, and frankly amazed my ancestors survived things like that. It made me feel grateful to be living in modern times, especially with technology. \n\nWhat's a non horror movie that you found perhaps unexpectedly disturbing?",
        "upvotes": 879,
        "comments": 1444,
        "media": null,
        "permalink": "/r/movies/comments/1js2mnh/what_nonhorror_movie_did_you_find_most_disturbing/"
    },
    {
        "id": "1js8djl",
        "author": "throwaway424241",
        "title": "The Departed 👌",
        "content": "I just watched the departed for the first time last night and holy moly. I can’t believe I waited this long to see it. One of the best movies I’ve ever seen period. I won’t spoil anything of course but… what a ride man. All of the performances were absolutely excellent too. I highly highly recommend seeing it if you haven’t already. Who’s with me?",
        "upvotes": 282,
        "comments": 154,
        "media": null,
        "permalink": "/r/movies/comments/1js8djl/the_departed/"
    },
    {
        "id": "1js4mx6",
        "author": "OreoSpeedwaggon",
        "title": "What are the best or most iconic title drops in movies?",
        "content": "Or maybe just some that you consider to be your favorite? Is it notorious and awkwardly delivered like Will Smith's line, \"So that's it, huh? Were some type of Suicide Squad?\" or was it woven into the dialogue in a more memorable way like when Christopher Lloyd as Doc Brown said, \"We're sending you back to the future!\", or was it just a throwaway line and something completely unexpected when it was uttered? \n\nWhat was it that made you sit up and point at the screen like Leonardo DiCaprio in \"Once Upon a Time... In Hollywood\" and announce \"HE SAID THE THING\"? \n\nEDIT: Just to clarify for the purposes of this question, a title drop is when any character in the movie speaks the literal title of it verbatim for the first (and likely only) time in the film. Thanks for the ones you've shared so far that actually fit that description. ",
        "upvotes": 411,
        "comments": 470,
        "media": null,
        "permalink": "/r/movies/comments/1js4mx6/what_are_the_best_or_most_iconic_title_drops_in/"
    },
    {
        "id": "1jsguuj",
        "author": "midastheartist",
        "title": "Hans Landa is based on the child catcher from chitty chitty bang bang",
        "content": "Here me out. I've watched inglorious basterds over 50 times and I happened to catch a clip of the child catcher from chitty chitty bang bang recently and the way he is introduced and talks about smelling out his victims is extremely similar to Hans'introduction...the children in CCBB are hidden away in a cellar by a kind person willing to risk his life for them if they are found and the children catcher or Landa proclaim that they can sniff them out / think like their targets to find them. They are both the leading detectives and used by the higher powers to find their victims and both terrifying. If you have time to watch a clip of them one after another I'm sure you will see it.",
        "upvotes": 71,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1jsguuj/hans_landa_is_based_on_the_child_catcher_from/"
    },
    {
        "id": "1js03lf",
        "author": "Flubadubadubadub",
        "title": "What was the best 'NY City' movie ever made?  For clarity, I mean gives you more of the genuine 'feel' of NY City.",
        "content": "For me it's The Paper.  With a truly stellar cast, great story (if compressed into just 24 hours), nicely interwoven storylines, funny, empathic and just captures so many of the facets that make NY a pretty unique city.  \n\nI saw it in NY, on my own as it was during the day when everyone else was working, when it first came out.  I knew naff all about it before going in and came out loving it.",
        "upvotes": 798,
        "comments": 442,
        "media": null,
        "permalink": "/r/movies/comments/1js03lf/what_was_the_best_ny_city_movie_ever_made_for/"
    },
    {
        "id": "1jsbmgp",
        "author": "Mikecirca81",
        "title": "The Mothman prophecies does something pretty much unheard of in films, having   unknown entities    where's there's no way to make sense of what they are or how to explain them",
        "content": "The, whatever they are in the film that is behind all of the impossible events, the film never explains any of it,  no theories, no ideas, the film just tells us they exist and we can never understand  them.  The most the film does is speculate on there intentions , that's as far as the film goes. I know Roger Ebert was upset at the film  film for not giving  us anything  anything, no answers at all on what these things are, most films give  a crum of info but not here and I love that. we only learn they can do things that defy logic and even their intentions are ultimately   left  unexplained. It's ballsy for a film to do this to this extent and I wish more films would go this far. \n",
        "upvotes": 128,
        "comments": 124,
        "media": null,
        "permalink": "/r/movies/comments/1jsbmgp/the_mothman_prophecies_does_something_pretty_much/"
    },
    {
        "id": "1jsoovw",
        "author": "1whoisconcerned",
        "title": "My movie rewatch: The Prestige",
        "content": "I love this movie. It’s perfect storytelling with so much rewatch value. It’s also a magic trick like the subject matter. It does raise some questions though:\n\nBorden knows how traumatic his career is to his partners as evidenced by his wife’s suicide. Why then does he embark on another relationship? He must know a similar fate must occur due to the nature of his trick. Why go through all the stress of having to defend himself from accusations of infidelity? ",
        "upvotes": 13,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1jsoovw/my_movie_rewatch_the_prestige/"
    },
    {
        "id": "1jse0uz",
        "author": "gearwest11",
        "title": "Man I miss New Line Cinema when it was its own separate studio.",
        "content": "Back in the 90’s to mid 2000’s  they were one of the most balliest studios in Hollywood that took chances on quirkier movies like Austin Powers, The Mask, or Elf that even back then the other majors would’ve never done. And give up and coming directors like David Fincher and Paul Thomas Anderson their breakouts. Heck they manage to greenlight all three Lord of the Rings in one go. \n\nThey were like the equivalent to a punk rebel teenager  doing movies their way \n\nUnfortunately that’s what killed the studio after Return of the King putting whatever out there and most of them were box office failures or absolutely terrible like Son of the Mask or Hoot and  then spending $180 million on The Golden Compass which bombed so hard that Time Warner decided to it was enough  to absorb it into Warner Bros. \n\nAnd now it’s just a small label under WB  that makes some horror movies and 2 or 3  movies in other genres  that’s kind of forgotten about within a couple of months. \n\nBut at least WB still keeps that legacy going but I do have the feeling in 5 years they'll eventually retire the name.\n\nI feel like New Line's spiritual successor is Lionsgate where they still make smaller budgeted quirkier movies that other studios wouldn't dare to do. ",
        "upvotes": 88,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1jse0uz/man_i_miss_new_line_cinema_when_it_was_its_own/"
    },
    {
        "id": "1js975w",
        "author": "msfoote",
        "title": "What are your favorite cameos in a movie, especially ones that seem entirely incongruous.",
        "content": "I was watching one of my favorite guilty pleasure movies, Rat Race. Regardless of what you may feel about the movie, you have to admit that seeing Academy Award winner, Kathy Bates, playing a crazy squirrel lady who sends Whoopi Goldberg’s character and daughter careening off a cliff is a hilarious and completely unexpected cameo and a serious pull for the production.\n\nWhat are your favorite surprising cameos in that same vein?",
        "upvotes": 149,
        "comments": 317,
        "media": null,
        "permalink": "/r/movies/comments/1js975w/what_are_your_favorite_cameos_in_a_movie/"
    },
    {
        "id": "1jsg5xg",
        "author": "TeaParty24",
        "title": "VERY SPECIFIC baby cooing sound",
        "content": "Has anyone else noticed that most if not all scenes in tv shows and movies that feature a baby have a distinct, identical baby coo sound that is overlaid on the video? It is a specific “owa ooowa” sound that almost sounds robotic compared to whatever actual crying/babbling the baby is doing and this has been going in (from what I noticed) since the early 2000s in tv shows and movies, animated or live action. What gives!!!! What is the reason?? Is there some clause or universal rule that this sound has to be used in fictional portrayals of babies?? I will try to find the sound and link it but I just heard it on a recent episode of criminal minds and it caught my ear and bothered me at the same time. It sounds sooo doll-like and it’s so very obvious so I was wondering if anyone else has noticed this over the years??  \n\nThe sound in question: \nhttps://voca.ro/16I8Ikhpm5Om",
        "upvotes": 57,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1jsg5xg/very_specific_baby_cooing_sound/"
    },
    {
        "id": "1jrta4d",
        "author": "DemiFiendRSA",
        "title": "Robert McGinnis, Creator of Iconic James Bond Posters, Dies at 99",
        "content": "",
        "upvotes": 1640,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5i5qUhJhqMaLMnvIWcAZ7GFcJugPwM9CCt3_vthpv4E.jpg?auto=webp&amp;s=3fbdedafacacfc9f00e3c08992aa384c6f196b9e"
        },
        "permalink": "/r/movies/comments/1jrta4d/robert_mcginnis_creator_of_iconic_james_bond/"
    },
    {
        "id": "1js29w1",
        "author": "Striking_Border6905",
        "title": "Tom Cruise presents Christopher McQuarrie with #CinemaCon’s Director of the Year award",
        "content": "",
        "upvotes": 252,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/29PRV3tG_9ecx-gR3VOPhc7QPREt3Sy1jdy6e5odfTw.jpg?auto=webp&amp;s=b96fb788378944c5a53c4f665b00bcbada7bf7f4"
        },
        "permalink": "/r/movies/comments/1js29w1/tom_cruise_presents_christopher_mcquarrie_with/"
    },
    {
        "id": "1jsfrde",
        "author": "Fan387",
        "title": "Tamil-Malayalam film and television actor Ravikumar Menon dies in Chennai at 71",
        "content": "",
        "upvotes": 30,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3h5rjHa-Mf7f86SdQel2Gc3kZSyniuX_iGP3Otc931E.jpg?auto=webp&amp;s=c7c469793d7121c67c258b4ffa047e3bcd65835f"
        },
        "permalink": "/r/movies/comments/1jsfrde/tamilmalayalam_film_and_television_actor/"
    },
    {
        "id": "1jrbk0b",
        "author": "Moonskaraos",
        "title": "Comedian Russell Brand charged with rape",
        "content": "",
        "upvotes": 60474,
        "comments": 4990,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e8CruVqads_UU4QhLf8XGcFgtjO7fxYuan9W35PxETg.jpg?auto=webp&amp;s=c89f12d6440ecb044acdec9c5679b7f5da070633"
        },
        "permalink": "/r/movies/comments/1jrbk0b/comedian_russell_brand_charged_with_rape/"
    },
    {
        "id": "1jryhce",
        "author": "That_Suspect8866",
        "title": "I finally watched The Truman Show",
        "content": "This movie came out a while ago and it kept popping up in my feed because I listen to mitski and one of her song is greatly used in many edits of the movie. I was interested as soon as I saw that short video and after watching the film, I am in awe. This is what I would consider an\n\nhttps://preview.redd.it/1std0i2o2zse1.png?width=255&amp;format=png&amp;auto=webp&amp;s=7b83e623e594da6585be94ace271a917eca22e1f\n\nI honestly cried and I wish to forget it so I could watch it all over again. A true masterpiece. It will my favorite movie for a while.  So, I felt better after watching it.\n\nand in case I don't see ya Good afternoon Good Evening and Good Night.",
        "upvotes": 418,
        "comments": 128,
        "media": null,
        "permalink": "/r/movies/comments/1jryhce/i_finally_watched_the_truman_show/"
    },
    {
        "id": "1jrhyjb",
        "author": "whomp1970",
        "title": "No, really. You don't have to know a single thing about Dungeons and Dragons to thoroughly enjoy \"Dungeons and Dragons: Honor Among Thieves\" (2023)",
        "content": "I never gave this movie any of my attention for two solid years.  I don't know a druid from a bard, I have no idea what charisma points are, and I wouldn't know the word \"Demogorgon\" if it wasn't for Stranger Things.\n\nSo naturally I thought there's no way I could follow along in \"Honor Among Thieves\" because I know diddly squat about the franchise.  \n\nBut you guys ... you wouldn't let it be.  So many posts, so many comments, saying how wonderful this movie was.  I gave in and watched it last night.\n\nIt's really good.  Yes, just like you have all been screaming at me.  Good action, good comedy, good SFX, all around a great movie.\n\nI really loved Hugh Grant's performance.  He pulls off smarmy and slimy quite well. \n\nAnd I was leaping out of my seat when I saw [live-action versions](https://platform.polygon.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/24550574/80_Kids_Arena.png) of [these guys](https://reactormag.com/wp-content/uploads/2022/01/Dungeons-Dragons-cartoon.jpg).  Yay fanservice!\n\nI know I was a dummy.  Forgive me.",
        "upvotes": 5204,
        "comments": 470,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NuBOP7nA4drpfPBJwHqqgFLVJ74-yHThE5Gwg4-gXVo.png?auto=webp&amp;s=528bb5a177f31c9a08d793f0f067d0f564b5611e"
        },
        "permalink": "/r/movies/comments/1jrhyjb/no_really_you_dont_have_to_know_a_single_thing/"
    },
    {
        "id": "1js2jry",
        "author": "STLHOU95",
        "title": "The Wild Robot",
        "content": "My fiancé (who is a teacher) threw this on because she is reading it to her 2nd grade students. Thought I was getting into a silly movie about a robot lost in the forest…\n\nEnded up getting an epic movie about friends / family / circle of life with an incredible Rocky-style training montage, that slowly turned into a dystopian, post-apocalyptic sci-fi movie??? All while making me tear up every 30 minutes lol.\n\nWhat a great flick. One of the better new movies I’ve seen in a while. Definitely recommend with or without children. ",
        "upvotes": 138,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1js2jry/the_wild_robot/"
    },
    {
        "id": "1jsiepz",
        "author": "UteForLife",
        "title": "Other movies like Night of the Museum and National Treasure?",
        "content": "I am on a kick of watching some older movies with my kids and they have been loving Night at the Museum and National Treasure. Looking for recommendations of similar type movies. Age range from 9-14, so nothing mature or anything like that. I think they love the light heartedness that these movies bring compared to movies today.",
        "upvotes": 15,
        "comments": 51,
        "media": null,
        "permalink": "/r/movies/comments/1jsiepz/other_movies_like_night_of_the_museum_and/"
    },
    {
        "id": "1jrohvk",
        "author": "Civil_Noise_1234",
        "title": "I was NOT prepared for Grave of Fireflies",
        "content": "Last night I was cozy in my bed looking for a cute movie to watch. I haven’t seen many studio gibli movies but the ones I’ve seen I absolutely adored. I see Grave of Fireflies on Netflix with 2 cute little kids on the cover and I’m so ready for a My Neighbor Totoro-type movie. I was SO wrong. From the beginning I could tell how it was going to end but MY GOD. Ruined my night. And my day. And possibly my week. Will I recover? Who knows. Cute cozy fun movie suggestions will be appreciated. ",
        "upvotes": 1348,
        "comments": 314,
        "media": null,
        "permalink": "/r/movies/comments/1jrohvk/i_was_not_prepared_for_grave_of_fireflies/"
    },
    {
        "id": "1js49mk",
        "author": "nextgentactics",
        "title": "How I wrote Constantine - screenwriter Frank Cappello tells the fascinating story of writing the cult classic and being hijacked by Hollywood politics.",
        "content": "",
        "upvotes": 58,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ew97Gf2qVzcQcGV2HgDKAopoTFq9wX06tI4jGWtdplQ.jpg?auto=webp&amp;s=e3fc763c2fecc43a0b8e952bd5d7d04cf43d2f6a"
        },
        "permalink": "/r/movies/comments/1js49mk/how_i_wrote_constantine_screenwriter_frank/"
    },
    {
        "id": "1jspnuy",
        "author": "Ki9o_OP",
        "title": "ASIAN HORROR FILMS AT IT'S FINEST",
        "content": "I heard the name of this movie from reddit. I was searching for some really good asian horrors which would truly terrify me as I was tired of the same stereotypical hollywood horror with stupid jumpscares and gore even though the Wrong Turn series is one of my favourites lol. if someone asked me how I got into films without any hesitation i' would say it's because of horror films the rush of adrenaline I felt with masterclass works like Toby Hooper's Poltergeist David cronenberg's the fly or John Carpenter's 1982 classic the thing was more than enough to pull me into the world of cinematic horror and I watched hundreds if not thousands of horror films over the years of course the more you watch the less you get affected by the repetitive formula horror films tend to have. Fear is a feeling that stays on for a quite some time maybe 1 hour maybe 2 hours but it is not a spike which just comes for a second and goes away. Here what I mean to say is that hollywood horror films mostly hold jumpscares to be their prime subject for horror films while asian horror films tends to create an atmosphere so very terrifying which keeping the viewer's heart to be pumping hard for the whole time. I am a hardcore fan of horror films from my childhood but didn't get to know what true horror is until a few days back when I got recommendation from a friend of mine to watch some Asian horror films. I watched my very first Asian movie called \"Roh\" which is a malaysian film in malay language ( ofc I watched it with subtitles ) and it was terrifying. The atmosphere, the environment, the shots, the cinematography, everything was so much different than that of hollywood and I absolutely loved it and then I watched Ringu (1999) and it totally creeped me out. I couldn't sleep thinking about what if my T.V randomly starts to play the tape and what if I get a call from the very beautiful Miss Sadako. Well jokes aside, the day before yesterday I watched a film called Gonjiam: Haunted Asylum which is a south korean film of 2018. Can't sleep and the movie is 24/7 on my mind. This movie is what totally creeped me out. Can't write more as I have to go and complete my chores. Please suggest me some more Asian Horror films. Peace :3",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1jspnuy/asian_horror_films_at_its_finest/"
    },
    {
        "id": "1jsktdb",
        "author": "Sufficient-Pie129",
        "title": "Thriller recommendations that are not too dark or mind-f?cky?",
        "content": "I’ve been watching every thriller I can find from the 1980s onwards, particularly political, legal, and spy ones. I want to make sure I haven’t missed any gems. I just can’t handle movies that end in a really dark way or where, say, the serial killer is exceptionally twisted. Looking less for Oscar winners and more for ‘date night’ movies. ",
        "upvotes": 3,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1jsktdb/thriller_recommendations_that_are_not_too_dark_or/"
    }
]