[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 14,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 50,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l306ge",
        "author": "Sweaty-Toe-6211",
        "title": "‘Adolescence’ Beats ‘Stranger Things 4’ to Become Netflix’s No. 2 Most-Watched English-Language Series Ever",
        "content": "",
        "upvotes": 62,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1l306ge/adolescence_beats_stranger_things_4_to_become/"
    },
    {
        "id": "1l35moc",
        "author": "RIP_Golden_Boy",
        "title": "New interface introduced on Roku yesterday - hands down the WORST of all other streaming services I have",
        "content": "As described in the title, I opened Netflix on Roku yesterday to an announcement of the new UI and how wonderful it would be, etc., etc.\n\nDamn, is it ever bad. Of course, the \"worst\" label is 100% subjective and just one person's opinion. But, for me, it is objectively less usable than before. Its cramped design actually gives me a slight sense of clostrophobia to the point where I actively dislike being in the app. I find it very unwelcoming. \n\nWhen I open Netflix, most of the time I'm not going to in to watch anything in particular. I like browsing and hunting for something that, based on the title and/or image, I think might interest me. I've heard a lot of people complain about the quality on Netflix but there are still quite a few gems that I would often stumble on. The Residence and The Gentlemen are perfect examples of this - shows that I liked that I came across while scrolling through the app and hadn't previously heard of. \n\nThe new interface makes this process much more difficult. It's much easier to visually scan a screen with a lot of items and scroll when necessary. When you see something you might like you can choose to explore further and then look at the details.   \n\nNow, you are hit in the face with details of a single show taking up a large part of the screen that, odds are, you don't care anything about with a handful of other shows around the edges. \n\nGiven my typical use of Netflix, it will now take me much longer to find something than it did before. And given how being in the app makes me feel like I'm in a box, I can see my usage dropping significantly. Cancelation is likely right around the corner. \n\nFirst world problem, I know, but I only have so much money to go around. It doesn't make sense to spend it on something that will likely now sit idle most of the time. \n\nOk, rant over. On with my day. \n\nEDIT: I really am curious to hear from people who do like the new UI and what specifically they find better about it. While it's always fun to vent, I would like to hear others' perspectives just in case I'm missing something. ",
        "upvotes": 15,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l35moc/new_interface_introduced_on_roku_yesterday_hands/"
    },
    {
        "id": "1l2wrrb",
        "author": "thescatteroflight",
        "title": "Netflix search now useless",
        "content": "Sure, the first few results were accurate, but why in the hell is it showing me a Richard Pryor movie and 50 First Dates for Adam Driver, and Hoarders and The Breakfast Club for Pedro Pascal?! If you only have three or four movies with these actors, then show me that.",
        "upvotes": 62,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1l2wrrb/netflix_search_now_useless/"
    },
    {
        "id": "1l2tlqw",
        "author": "Northeast4life",
        "title": "Animal Kingdom.. how is this the first time I’m seeing or hearing about this show.",
        "content": "Maybe it’s the lack of decent shows on Netflix recently but after 4 episodes I’m hooked. And how is this the first time I’ve heard of this show. It’s amazing!",
        "upvotes": 45,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1l2tlqw/animal_kingdom_how_is_this_the_first_time_im/"
    },
    {
        "id": "1l38eg0",
        "author": "Educational_Still_51",
        "title": "Covid-19 show cancelations",
        "content": "Shows like “The Society”, “I Am Not Okay With This” , “GLOW” and more were cancelled a while (years) back due to the COVID pandemic and have yet to be renewed.  I feel like Netflix should consider renewing these shows again as they were originally renewed but the decision was reverted due to the pandemic.  Would love to know the community’s thoughts about this and if Netflix should revive these shows that were originally renewed for at least 1 more season.  One major flaw about this i can think of is casting back the same casts for these shows because they might have projects currently so filming would be difficult to plan and also different looking casts (with them looking older than what their characters are suppose to be, though Stranger Things managed to make that work).  ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l38eg0/covid19_show_cancelations/"
    },
    {
        "id": "1l2pwts",
        "author": "paharibilli",
        "title": "Four seasons",
        "content": "ok so i started watching this out of boredom and but im so pleasantly surprised. 19F here and im pretty sure im not exactly the targeted audience but i feel like if i had to compare it with white lotus (dont come at me for this u cant deny the parallels) this ones better? also the point where i really started liking the show was nicks daughter lilas play. Netflix really needs to up its game waise most of the shows dont hit the same anymore \n",
        "upvotes": 42,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1l2pwts/four_seasons/"
    },
    {
        "id": "1l340xw",
        "author": "Aromatic_Location",
        "title": "New UI",
        "content": "Is the New and Upcoming category still in the new UI somewhere? Every week I go through what will be released in the next week, and add it to my list if it's interesting. But I couldn't find it last night when I tried using the new UI for the first time. Their recommendations and categories that they show are broken. For example they really want me to watch Korean dramas. I've never shown any interest in any foreign language show, so I don't know why it would be a suggested category. That's why I just use my watchlist. But I can't find anything with the new UI. I need the new and upcoming so I can bookmark shows I want to see.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l340xw/new_ui/"
    },
    {
        "id": "1l36nuk",
        "author": "theipaper",
        "title": "Ginny and Georgia season 3 release date, cast and episode guide",
        "content": "",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l36nuk/ginny_and_georgia_season_3_release_date_cast_and/"
    },
    {
        "id": "1l3b0ir",
        "author": "ApplicationNo2375",
        "title": "My 3-year netflix billing glitch-Unpaid subscription-Am i alone?",
        "content": "I experienced a bizarre billing error with Netflix between 2019 and 2021. For 3 years, despite my payment details being active in the app, Netflix never charged me a single rupee, allowing me to stream on both my laptop and phone without interruption. I can only assume it was a persistent glitch, as I never paid for the service during that entire period. It wasn't until my phone crashed and I got a new device that I started paying for Netflix. Interestingly, I was never retroactively billed for those 3 'free' years. Has anyone else encountered such a significant service glitch?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l3b0ir/my_3year_netflix_billing_glitchunpaid/"
    },
    {
        "id": "1l3au2w",
        "author": "jgroove_LA",
        "title": "Director Hwang Teases a \"half happy, half sad\" ending for Squid Game",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l3au2w/director_hwang_teases_a_half_happy_half_sad/"
    },
    {
        "id": "1l3asxo",
        "author": "shitshow2235",
        "title": "is it possible to change thumbnails for netflix films and shows?",
        "content": "There are lots of movies on netflix that I like. However, the thumbnails sometimes change to something boring that I don't like. As in, just a character's face. Lots of times, the films thumbnail won't have much to look at other than a random persons face which sucks out any incentive to watch it. Is there a way to turn this off?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l3asxo/is_it_possible_to_change_thumbnails_for_netflix/"
    },
    {
        "id": "1l26ugd",
        "author": "iLikeDinosaursRoar",
        "title": "Dept Q",
        "content": "Going to need everyone reading this to please watch this show ASAP. Even if you don't like it, just let it run so Netflix thinks it was watched! Really be a shame not to get a 2nd season. \n\nJust need a few dozen million...thanks.\n\nNot to mention it was a fun crime drama with some enjoyable characters, it's Sherlock Holmes vs House. \"But they are the same!\" Yes yes, but imagine the detective an enjoyable grouch like House but it has all the detective and crime qualities of Sherlock. \n\nGive it a watch or the very least let it run in the background! ",
        "upvotes": 338,
        "comments": 124,
        "media": null,
        "permalink": "/r/netflix/comments/1l26ugd/dept_q/"
    },
    {
        "id": "1l39n2x",
        "author": "HehroMaraFara",
        "title": "Power Moves with Shaquille O’Neal",
        "content": "A mile wide and centimeter deep. \n\nDon’t watch it, I’ll summarize it:\n\nOne big commercial for a busted shoe brand with less than 1% market share in the ONLY market they are in. \n\nWatch it if you want to hear about the up and coming lifetime G Leaguers, or at best 5 years on the bench guys. If I were SGA, I’d sue them for pretending they even had a chance at signing him. \n\nIf you subtract the bad rap tracks, useless placating of Shaqs ego and nobody’s bragging in themselves. It’s 15 minute episodes. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l39n2x/power_moves_with_shaquille_oneal/"
    },
    {
        "id": "1l39jhg",
        "author": "Equivalent_Phrase_25",
        "title": "My opinion on Blue box",
        "content": "Dude taiki is so stupid, generally why won’t he pick hina. This is like the classic saying of you only appreciate something when you don’t have it anymore. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l39jhg/my_opinion_on_blue_box/"
    },
    {
        "id": "1l36rj4",
        "author": "Adityabutterchicken",
        "title": "Looking for a meaningful, touching movie or series.",
        "content": "A series or show where someone reminiscents about past life or visits past town etc, or about self discovery or finding happiness after struggle. \nNeed not be romantic. Any language welcomed. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l36rj4/looking_for_a_meaningful_touching_movie_or_series/"
    },
    {
        "id": "1l2gb8o",
        "author": "chrisarrant",
        "title": "Queen's Gambit creator mixes Scandi Noir with UK crime shows like Prime Suspect for Netflix's Dept. Q (with a side of Matthew Goode)",
        "content": "",
        "upvotes": 56,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l2gb8o/queens_gambit_creator_mixes_scandi_noir_with_uk/"
    },
    {
        "id": "1l2hdqx",
        "author": "ProbablyHere4Help",
        "title": "Netflix’s interface is AWFUL and permanent. Best part: you can’t leave feedback anywhere!",
        "content": "I could be wrong but wouldn't less title visibility induce quicker scroll fatigue? I have no desire to hunt for new titles and the once PERFECT interface now resembles all the others. Might as well spread my time and money elsewhere now that there's no difference in how annoyed I get navigating these streaming apps. \n\nYeah, most people are naturally resistant to change but this is probably their worst decision yet. I've been actively trying to avoid this ugly layout by keeping my testing feature off but I guess it's here to stay.\n\nI hope Netflix considers revising toward something that feels more like Netflix but my expectations are in Hell.",
        "upvotes": 44,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1l2hdqx/netflixs_interface_is_awful_and_permanent_best/"
    },
    {
        "id": "1l2z9p3",
        "author": "ThrowALifeline89",
        "title": "For anyone looking to fill the gap that the cancellation of 'Heartstopper' left: check out 'Smiley*",
        "content": "A lot of people loved *'Heartstopper'* and are understandably broken up about the show not getting renewed. **But** there is one shimmer of hope: *'Smiley'* is a netflix show from a few years ago that did not make a big splash **(sadly**) that has a lot of the same appeal however. If there is one thing that people liked to criticise about *'Heartstopper'* it is that it's a bit \"too clean and whimsical\" (not my opinion just something that I saw online a few times). Now *'Smiley'* is definetely more raunchy and adult oriented.\n\n  \n\\[Yes, I know there is movie supposedly coming out next year to wrap up things with Charlie &amp; Nick - but that is likely more than a full year away\\]. Anyhoo, I hope this post can get people to give *'Smiley'* a well deserved watch and bring some happiness to the world. Bye!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l2z9p3/for_anyone_looking_to_fill_the_gap_that_the/"
    },
    {
        "id": "1l34clo",
        "author": "suc08",
        "title": "Howl's moving castle",
        "content": "Unpopular opinion:  I genuinely couldn’t understand why so many people love Howl’s Moving Castle. Personally, I found the plot quite confusing and disjointed. There seemed to be no proper explanation, no clear backstory, and events kept unfolding without much context or coherence. It felt like things were just happening randomly, without offering the viewer a logical thread to follow. Maybe this film appeals more to those who prefer to experience a story emotionally or visually, rather than trying to analyze and make sense of every plot point. As someone who likes to understand the \"why\" behind characters and events, I struggled to connect with it. While I do appreciate the stunning animation and the magical world Hayao Miyazaki created, the storytelling left me feeling lost and unsatisfied.\n",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l34clo/howls_moving_castle/"
    },
    {
        "id": "1l36twm",
        "author": "CaracusUK",
        "title": "Netflix taking us for a ride 🤔",
        "content": "I have no issue paying for a subscription service after all how else can content be made but in my latest coming soon on Netflix is:\n\nHarlots - ITV\nMadam Blanc Mystery- Channel 5\nMurder on the internet - Channel 5\nNorth Shore - ITV\nGuide to murder - BBC\nThe year of the rabbit - Channel 4\n\nThese are just some of the already available free to air broadcasts shown in the UK!\n\nI bit annoying 🤨\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l36twm/netflix_taking_us_for_a_ride/"
    },
    {
        "id": "1l2uy1r",
        "author": "Southern-Brother5693",
        "title": "The \"Coming This Week\", \"Wait For It\" Features are missing",
        "content": "Just received the new Netflix UI design today on my Sony Bravia TV.\n\nI liked it as a whole. The layout looks more fluid and more streamlined. The suggestions feel more on point as well. I wish there were a way to immediately scroll up to the top of the page, though using the back button.\n\nMy biggest issue is that the \"Coming This Week\", \"Coming Next Week\" and \"Wait For It\" bars are all gone now. There is no longer any easy way to keep track of what is coming in the future and set reminders.\n\nI hope Netflix rectifies this in the future. But on a positive note, let me say again I like the new UI design.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l2uy1r/the_coming_this_week_wait_for_it_features_are/"
    },
    {
        "id": "1l31wtg",
        "author": "MaraxtheMeeper",
        "title": "Lore accurate Tomodachi Collection",
        "content": "I tested the compatibility tester on Houyi and Chang'e yeilkdymkdydykgkddgjsgnjsgjgdjgdsjdsjdtjdrrtsjterfttytreeteerrjddddddystkjthsjrssjrsrjsrhwrhyjsrhdaadhhdasdharharhshryjsrjsrjsr ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l31wtg/lore_accurate_tomodachi_collection/"
    },
    {
        "id": "1l20y5d",
        "author": "Aggressive_Data_6291",
        "title": "A Show That’s Going To Have Me Gagged and Shocked",
        "content": "I need to feel something. I wanna watch something that’s going to have me floored multiple times throughout watching. I’m talking jaw dropping , unexpected and applause worthy. I’m not really into documentaries. ",
        "upvotes": 152,
        "comments": 300,
        "media": null,
        "permalink": "/r/netflix/comments/1l20y5d/a_show_thats_going_to_have_me_gagged_and_shocked/"
    },
    {
        "id": "1l2x5g0",
        "author": "ItsTheSweeetOne",
        "title": "Shiny Flakes: the Teenage Drug Lord song question",
        "content": "Anybody know the song that starts playing at 36:30? It’s driving me nuts, not in the credits and Shazam didn’t pick it up. Help\n\nSide note, pretty good documentary. Don’t recommend watching it with the English dub though",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l2x5g0/shiny_flakes_the_teenage_drug_lord_song_question/"
    },
    {
        "id": "1l37025",
        "author": "indiewire",
        "title": "Netflix: The 55 Best LGBTQ Movies and TV Shows Streaming",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l37025/netflix_the_55_best_lgbtq_movies_and_tv_shows/"
    },
    {
        "id": "1l2kmav",
        "author": "Reasonable_Copy_8070",
        "title": "A Widow’s Game",
        "content": "I just finished watching this movie today and it also says it’s based on true events so I read what happened after. this is good!! especially the video at the end. to anyone who already watched it, what are your thoughts? ",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1l2kmav/a_widows_game/"
    },
    {
        "id": "1l22i52",
        "author": "portezbie",
        "title": "Why does Netflix change the UI constantly but almost never add actual new features?!",
        "content": "So the goddamn Netflix app on my TV is different again, apparently it was really important to make the cover images huge and make the buttons rounder. \n\nAnd yet for some reason all these super basic things still don't exist, like asking if you want to remove something from My List when you finish it, or easier access to subtitle options. \n\nOr heaven forbid having more than one list, like I dunno a \"watched favorites\" list and a \"want to watch\" list? It's so friggin basic! \n\nSorry, just really needed to vent. Rant over.",
        "upvotes": 53,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1l22i52/why_does_netflix_change_the_ui_constantly_but/"
    },
    {
        "id": "1l2h0ub",
        "author": "Street-Opening-5166",
        "title": "Series Recommendations",
        "content": "Hey everyone!\nI’ve barely watched any series in the past because work kept me super busy. But now that I finally have some free time, I want to dive in! 😄\n\nI’m looking for Netflix recommendations—I enjoy courtroom dramas, thrillers, mysteries, fiction, and even light-hearted comedies like Friends or The Big Bang Theory.\n\nWould love your suggestions—drop your favorites below! 🍿✨",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1l2h0ub/series_recommendations/"
    },
    {
        "id": "1l2srdb",
        "author": "OneBadDog",
        "title": "Sword Master",
        "content": "Just finished it. Started it last night and stayed up longer than I should have, but it's hard to stay so pretty when you don't get any sleep, so had to finish it today.\n\nIt is unfortunately a subtitled movie, unless you speak Mandarin, but an excellent movie nonetheless. I don't think it detracted from the movie at all, maybe even made it a tad better.\n\nIt is set in feudal China, where fights were solved with swords and the gap between upper and lower class was substantial. Tons of action, tough guys, some blood, some love interest stuff, even some interesting period stuff that might possibly be made up. \n\nI guess you'd have to like these types of movies to begin with, but I suspect even MrsBadDog would be down if I were to watch it in front of her. \n\ntldr: great movie, will watch a few times. Is in Mandarin- not a deterrent ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l2srdb/sword_master/"
    },
    {
        "id": "1l2bej5",
        "author": "Internal-Bed-3150",
        "title": "Led Zeppelin’s story like you’ve never seen it, is coming to Netflix soon",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l2bej5/led_zeppelins_story_like_youve_never_seen_it_is/"
    }
]