[
    {
        "id": "1mhctu2",
        "author": "JimmyAndStiggsAMA",
        "title": "Hi r/movies! I’m Joe Begos! Filmmaker behind VFW, Bliss, &amp; Christmas Bloody Christmas. My new movie Jimmy and Stiggs is a blood-drenched, alien-infested, DIY sci-fi horror shot over 4 years in my apartment with a crew of maniacs &amp; hand-built effects. Coming to theaters on August 15. Ask Me Anything!",
        "content": "Hi r/movies! I’m Joe Begos! Filmmaker behind VFW, Bliss, &amp; Christmas Bloody Christmas. My new movie Jimmy and Stiggs is a blood-drenched, alien-infested, DIY sci-fi horror shot over 4 years in my apartment with a crew of maniacs &amp; hand-built effects. Coming to theaters on August 15. Ask Me Anything!\n\nAbout Jimmy and Stiggs: A shitstorm of bad news sends out of work filmmaker Jimmy Lang (Joe Begos) spiraling into an out of control bender, during which he claims to have been abducted by aliens. Fearing they’ll come back, he contacts his old friend Stiggs (Matt Mercer) to help him gear up for war. When the sun sets, the duo are thrown into a hallucinatory explosion of aliens, drugs, booze, and all out carnage. Joe Begos is back! And this time, he’s brought his A-game with a drug-fueled, wall-to-wall frenzy that pulls no punches from the moment it begins. Channeling the hectic, chaotic brilliance of Jackson, Raimi, and other masters, Begos infuses his own unique tone and craftsmanship into JIMMY AND STIGGS. This film also showcases Begos’s acting chops, delivering a physical performance that’s part Keaton and a whole lot of Campbell. A wild and wonderful ride that truly deserves to be seen in the cinema with like-minded lunatics.\n\nWebsite: [https://jimmyandstiggs.com/](https://jimmyandstiggs.com/)\n\nTrailer:\n\n[https://www.youtube.com/watch?v=Ne3aSWSyAm8](https://www.youtube.com/watch?v=Ne3aSWSyAm8)\n\nOut in theaters August 15th,.\n\nAsk me anything! Back at 3 PM ET today to answer questions.",
        "upvotes": 31,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/r55o59nhwzgf1.png?auto=webp&amp;s=c806018ecd8d00726b00143a4a0790f96bee8aab"
        },
        "permalink": "/r/movies/comments/1mhctu2/hi_rmovies_im_joe_begos_filmmaker_behind_vfw/"
    },
    {
        "id": "1mhqmqa",
        "author": "SanderSo47",
        "title": "August 1-3 Box Office Recap – Despite staying at #1, 'The Fantastic Four: First Steps' collapses 67.2% domestically, the 7th worst drop in the MCU. It also collapses 60% overseas, earning $367M worldwide. 'The Bad Guys 2' and 'The Naked Gun' open solidly with $21.9M and $16.8M, respectively.",
        "content": "https://preview.redd.it/airvbn7ln2hf1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=a24f9ac3715eef6e282f1882ec272f5c6de39bfb\n\nWell, that wasn't really fantastic.\n\n***The Fantastic Four: First Steps*** easily topped the box office on its second weekend, but in the process, it posted one of the steepest second weekend drops in the whole MCU. Three newcomers arrived at the scene, but it was a mixed bag; ***The Bad Guys*** wasn't that far off from the original, ***The Naked Gun*** was off to a solid start, while ***Together*** over-performed projections.\n\nThe Top 10 earned a combined $118.4 million this weekend. That's down 28.9% from last year, when ***Deadpool &amp; Wolverine*** held the top spot against other newcomers like ***Trap*** and ***Harold and the Purple Crayon***.\n\n***The Fantastic Four: First Steps*** added $38.6 million this weekend. That's down a very poor 67.2% from last week, which is the seventh worst in the MCU. That drop is worse than ***Doctor Strange in the Multiverse of Madness*** (67.0%) and it's not far off from ***Thor: Love and Thunder*** (67.7%), ***Black Widow*** (67.8%), and ***Captain America: Brave New World*** (68.3%). It's even worse than the 2005 film (59.4%) and ***Rise of the Silver Surfer*** (65.5%), and it's incredibly close to ***Fant4stic*** (68.2%)\n\nEven compared to this year, it's a far larger drop than ***Superman*** (53.2%). This is a very brutal drop, especially considering the film had the best reception of the ***Fantastic Four*** films and it still had PLF screens. But considering that it was very front-loaded on its opening weekend (the worst internal multiplier in the MCU), it was clear that fan hype didn't translate into general audience's interest. Or that maybe word of mouth isn't as good as it appears.\n\nThrough 10 days, the film has earned $197.1 million domestically. It has already surpassed the lifetime gross of all ***Fantastic Four*** films, although that was expected already. The opening weekend was $7.3 million behind ***Superman***, and ***F4*** is now $39.1 million behind it through the same point. The film is losing its IMAX screens to ***Weapons*** and ***F1*** this weekend, which means it's heading for another rough drop this weekend. The film seemed like an easy $300 million grosser, but right now it seems like it will close with around $280 million. Which means the film will finish with just a little above what the 2005 film did in adjusted inflation ($272 million).\n\nIn second place, Universal/DreamWorks' ***The Bad Guys 2*** debuted with $21.9 million in 3,852 theaters. That's not far off from the original's debut ($23.9 million), which is honestly a good sign, considering sequels often drop big from the originals.\n\nOn its own, this is a solid start. But it still feels like the film could've done a bit better than this. After all, the original legged out pretty well and the sequel still retained much of its humor and tone. But especially considering animated films have been faring poorly this year, so there wasn't much competition. Perhaps it looks like there's a ceiling to ***The Bad Guys***, and even great reviews (86% on RT) won't change that.\n\nAccording to Universal, the audience was a 50/50 split between men and women, 29% were parents, and 35% were kids under 12. They gave it a great \"A\" on CinemaScore, which is the same grade as the original. There's basically no animated competition until ***Zootopia 2*** in November (***Ne Zha 2*** opens this month, but it's more niche than these titles in America). Based on this, the film should earn around $75 million domestically.\n\nIn third place, Paramount's ***The Naked Gun*** debuted with $16.8 million in 3,344 theaters. That's the second best debut in the franchise, behind ***The Naked Gun 2½: The Smell of Fear*** ($20.8 million), although in terms of inflation, it had the least attended opening of the franchise. At least, it had the best debut for director Akiva Schaffer, and it has already outgrossed ***Hot Rod*** ($13.9 million) and ***Popstar: Never Stop Never Stopping*** ($9.6 million). It was also Liam Neeson's biggest debut as leading man since ***Taken 3*** ($39.2 million).\n\nThis is a very solid debut, considering theatrical comedies have been very scarse lately. Paramount has tried to revive the brand for decades; one with Leslie Nielsen reprising it one last time, and then Ed Helms after Nielsen's death. But it didn't gain real buzz until 2021, when Seth MacFarlane joined as producer and decided that Liam Neeson should take the mantle. Then Akiva Schaffer was hired as director, and the film was finally moving forward it.\n\nCredit must go to an excellent marketing campaign: the teaser trailer was absolutely hilarious, confirming it would maintain the same spirit as the original films (the OJ joke was just cherry on top). This was followed by hilarious posters, which raised awareness. And turns out Schaffer knew what he was cooking: it's sitting at a fantastic 90% on RT, which is the best in the franchise.\n\nAccording to Paramount, 62% of the audience was male and 31% was 45 and over. While there's the belief that young audiences don't go to theaters, it seems like they made an exception for ***The Naked Gun***; 47% of the audience was in the 18-34 demographic, meaning that the film succeeded in attracting Millennials and Zoomers. This is very encouraging, suggesting there's still an audience for comedies. They gave it a very good \"A–\" on CinemaScore, which is the same grade as the original. The film should enjoy some good holds through a very weak August. Depending on how it holds next week, ***The Naked Gun*** could finish with over $50 million domestically.\n\n***Superman*** dropped 45%, adding $13.7 million this weekend. The film has amassed $316 million so far, and it's still set to finish with over $350 million domestically.\n\n***Jurassic World Rebirth*** earned $8.7 million this weekend, easing 34%. The film's domestic total stands at $317.6 million. Last week, it was $30.8 million behind ***Dominion***, and that gap has grown to $32.8 million. It officially has no shot in hitting $350 million.\n\nNeon's ***Together*** hit sixth place with $6.7 million ($10.8 million) in 2,302 theaters. That's a pretty great start, and it's even better than Neon's ***Cuckoo***, which flopped with just $6.2 million lifetime around this point last year.\n\nThe film has gained considerable buzz after its debut at Sundance, achieving a great 91% on RT. Even though it was also plagued with controversy over a plagiarism lawsuit, general audiences don't really care about that. They only care if the film looks intriguing. With ***I Know What You Did Last Summer*** failing to light the world on fire, this was a pretty good spot to open a buzzy horror title.\n\nAccording to Neon, 52% of the audience was male, and 77% was 35 and under. They gave it a weak \"C+\" on CinemaScore, which is not actually bad for a horror film. The film faces tough horror competition this week, as the buzzy ***Weapons*** is making its way to theaters. But ***Together*** has enough gas to hit $25 million, which is pretty good for a body horror.\n\n***F1*** continues holding well. It added $4.1 million, which is off just 34% from last week. The film has earned $173.3 million domestically, and it's gonna be re-released in some IMAX theaters this week. \n\n***I Know What You Did Last Summer*** fell a rough 50%, grossing $2.6 million this weekend. The film has amassed $29.3 million, and it's set to finish as the lowest grossing film in the franchise.\n\nWell, ***Smurfs*** are now bluer than usual this weekend. With heavy competition from ***The Bad Guys 2***, the film collapsed an abysmal 67%, earning just $1.8 million this weekend. The film has earned a poor $29.3 million, and it will vanish quickly from theaters.\n\nRounding up the Top 10 was Universal's ***How to Train Your Dragon***, which dropped 54% for a $1.3 million weekend. The film's domestic total stands at $260.3 million.\n\n#**OVERSEAS**\n\nYou thought America was the only place where ***Fantastic Four*** collapsed?\n\n***The Fantastic Four: First Steps*** earned $39.6 million overseas, for a $367 million worldwide total. Good news: it's already the biggest ***Fantastic Four*** film, passing the 2005 film ($333 million). Now the real bad news: that's a poor 60% drop from last week, which is larger than usual even for a superhero film. For contrast, ***Superman*** dropped 53% and had a higher second weekend overseas ($45 million).\n\nThe film pretty much died in Asia, seeing a steep drop in China (93% drop) and flopping in South Korea with just $4.3 million (where ***F1*** is stealing all its thunder). The film's best markets are the UK ($20.5M), Mexico ($20.4M), France ($10.2M), Brazil ($9.3M), Australia ($8.2M), Italy ($7.1M), Spain ($6.4M), Germany ($5.9M), and China ($5.5M). Based on its poor drops, it really looks like the film will struggle to hit $550 million worldwide. Given a very high budget (more than $200 million) and a very extensive marketing campaign, this definitely looks like another disappointment for the MCU.\n\nIn Japan, ***Demon Slayer: Kimetsu no Yaiba Infinity Castle*** earned $17.4 million on its third weekend, for a gigantic $121 million in the market. It's already the biggest film of the year in Japan and the 10th biggest ever.\n\n***F1*** is already surpassing ***Jurassic World*** and ***Superman*** in weekend grosses, even though it opened prior to both. The film added $17.2 million overseas, which is just 17% off from last weekend, and taking its worldwide total to a fantastic $546 million. With this, it's officially Brad Pitt's highest grossing film as leading man, surpassing ***World War Z*** ($540 million). Its best markets are China ($55.1M), the UK ($28M), France ($26.7M), South Korea ($24M), Mexico ($19.3M), Australia ($17.4M), Germany ($15.1M), Taiwan ($14.9M), India ($12.8M), Japan ($12.5M), UAE ($9.5M), and Spain ($9.3M). Not content with recouping its $200 million budget already, the film is now set to cross $600 million worldwide, an insane mark. Even crazier fact: it's going to outgross all MCU titles this year and it won't be far off from ***Superman***'s total.\n\n***The Bad Guys 2*** earned $16.3 million overseas ($22.3 million if we add last week's overseas debut), taking its worldwide total to $44.4 million. The best markets are the UK ($6.4M), France ($2.6M), Mexico ($1.8M), Spain ($1.4M) and South Korea ($1.3M). There's still a lot of markets left, and there's not much animated competition.\n\n***Jurassic World Rebirth*** added $16.2 million overseas, for a $766 million worldwide total. The best markets are China ($77.4M), the UK ($42.7M), Mexico ($34.2M), Germany ($28.4M) and France ($25.2M).\n\n***The Naked Gun*** debuted with $11.5 million overseas, for a $28.3 million worldwide start. The best markets are the UK ($2.3M), Germany ($2.3M), Mexico ($674K), Netherlands ($590K) and Austria ($430K). Comedies are tough overseas, even though the original ***Naked Gun*** were big hits outside America. But it's not a bad start for this film.\n\n***Superman*** added $11.2 million overseas, allowing it to cross $550 million worldwide. The best markets are the UK ($32.8M), Mexico ($21.8M), Brazil ($15.3M), Australia ($14.6M), France ($13.2M), China ($8.9M), Spain ($8.9M), India ($6.8M), Germany ($6.6M), Japan ($6.4M), South Korea ($6.3M), and Italy ($5.9M).\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*The Phoenician Scheme* | May/30 | Focus Features | $6,271,652 | $19,555,015 | $38,767,466 | $30M\n*The Life of Chuck* | Jun/6 | Neon | $2,314,949 | $6,712,602 | $7,996,206 | N/A\n*M3GAN 2.0* | Jun/27 | Universal | $10,201,625 | $24,101,280 | $39,035,507 | $25M\n\n- Wes Anderson's ***The Phoenician Scheme*** has closed with $38.7 million worldwide, against a $30 million budget. That's another box office dud in Anderson's filmography, but let's face it, he's not going to be affected in the slightest. Too big to fall (and with Steven Rales' help).\n\n- Here lies Chuck Krantz (? - 2025). Neon's ***The Life of Chuck*** has already ended its run domestically with just $6.7 million and just $7.9 million worldwide. The film surprised many by winning the People's Choice Award at TIFF, which is usually a sign that the film could gain Oscar buzz. But instead of capitalizing on it, Neon released it 9 months after its debut in the middle of a competitive summer season, letting buzz die down. A very disappointing performance.\n\n- Yes, you read it correctly. ***M3GAN 2.0*** has closed after just 5 weeks with a pathetic $24.1 million domestically and $39 million worldwide. That's an insane 78.6% drop from the original film, which is one of the steepest for a sequel. Whether it was the genre shift, audience disinterest or the film's reception, it was simply a case of so many dominoes falling. Blumhouse, however, is on a very bad spot. Once a reliable hitmaker, this year has been filled with pure flops in theaters, something that seemed impossible years ago for this studio.\n\n#**THIS WEEKEND**\n\n***Fantastic Four***'s reign ends after 2 weeks, and it's gonna be a fierce battle.\n\nFirst, there's Disney's ***Freakier Friday***, once again bringing Lindsay Lohan and Jamie Lee Curtis back into their roles from the 2003 film. The 2003 version earned $160 million worldwide and its popularity has continued thanks to cable and home media. Comedies have been hit-and-miss in theaters (mostly the latter), but maybe the film could still hit all the nostalgia angles needed to succeed.\n\nAnd there's WB's new release, Zach Cregger's ***Weapons***, which follows the case of 17 children from the same classroom who mysteriously run out of their homes towards an unknown target in the middle of the night. The marketing has been excellent, managing to offer an eerie and creepy atmosphere and explaining just pretty much enough about the film without really spoiling it. Cregger hit gold with ***Barbarian***, and perhaps the same could happen here.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 298,
        "comments": 225,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bqD8X692EC4aqs_MxwJozorBdrAIilxqYCGAbUDbrbk.png?auto=webp&amp;s=119da0ef6337796b1b48996d38730004f3874558"
        },
        "permalink": "/r/movies/comments/1mhqmqa/august_13_box_office_recap_despite_staying_at_1/"
    },
    {
        "id": "1mhhfx2",
        "author": "MarvelsGrantMan136",
        "title": "Official poster for Hikari's 'Rental Family' - A lonely American actor (Brendan Fraser) living in Tokyo starts working for a Japanese \"rental family\" company to play stand-in roles in other people's lives. Along the way, he finds surprising connections and unexpected joys within his built-in family.",
        "content": "",
        "upvotes": 9443,
        "comments": 231,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0dbsuebnz0hf1.jpeg?auto=webp&amp;s=79788da4f52b44dec8bbc13713ad978cbafe3f95"
        },
        "permalink": "/r/movies/comments/1mhhfx2/official_poster_for_hikaris_rental_family_a/"
    },
    {
        "id": "1mhgtp1",
        "author": "CosmosisJones42",
        "title": "The Disney+ Curse: How the Streaming Service Hurt Marvel, Star Wars and Pixar Brands",
        "content": "",
        "upvotes": 7357,
        "comments": 1473,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OEfbcb8bwCMZ7M2v5knWu4jz2cCvn0TgGyl-13U_hqE.jpeg?auto=webp&amp;s=b09025c6edc8a8a2316fc710e83259785b48668c"
        },
        "permalink": "/r/movies/comments/1mhgtp1/the_disney_curse_how_the_streaming_service_hurt/"
    },
    {
        "id": "1mhx8me",
        "author": "BunyipPouch",
        "title": "New Image of Dev Patel in Horror-Thriller 'Rabbit Trap' - A married couple of musicians move from London to a cottage in Wales to complete their new album. They accidentally record a mystical sound never heard before and gradually disconnect from reality.",
        "content": "",
        "upvotes": 864,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ax2zzmre34hf1.jpeg?auto=webp&amp;s=3d1ea816c0e14ec93d1fe08c9054c1212e2c25dd"
        },
        "permalink": "/r/movies/comments/1mhx8me/new_image_of_dev_patel_in_horrorthriller_rabbit/"
    },
    {
        "id": "1mhnipu",
        "author": "ReztB",
        "title": "Name a movie where the supporting character completely steals the show from the main character",
        "content": "For me a clear example has to be [The Dark Knight](https://www.sceneit.app/movie/155). \n\nHeath Ledger's Joker steals the spotlight from Christian Bale's Batman. \n\nHe adds subtle little details, like the way he moves his tongue, that make the Joker impossible to forget. \n\nHe absolutely owns that movie! ",
        "upvotes": 1592,
        "comments": 1311,
        "media": null,
        "permalink": "/r/movies/comments/1mhnipu/name_a_movie_where_the_supporting_character/"
    },
    {
        "id": "1mhirfe",
        "author": "Ultimater3333",
        "title": "Shelby Oaks - Official Redband Trailer",
        "content": "",
        "upvotes": 2389,
        "comments": 217,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BFqWqR3boMgsVlCAHgsJ5ulEXCZ0vSuXdOZVukPObrc.jpeg?auto=webp&amp;s=08c7d0342eecafebbf8b036d0b70d3350d8e13c5"
        },
        "permalink": "/r/movies/comments/1mhirfe/shelby_oaks_official_redband_trailer/"
    },
    {
        "id": "1mhahw9",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for ‘The Toxic Avenger’",
        "content": "",
        "upvotes": 6418,
        "comments": 456,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8entwqvsjzgf1.jpeg?auto=webp&amp;s=eb1b528a9bcf1c36b26334faeecd1106ad44c024"
        },
        "permalink": "/r/movies/comments/1mhahw9/new_poster_for_the_toxic_avenger/"
    },
    {
        "id": "1mhn2h3",
        "author": "indiewire",
        "title": "Inside ‘The Naked Gun’ Scene Director Akiva Schaffer Had to Fight to Keep",
        "content": "",
        "upvotes": 1242,
        "comments": 126,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0uF-VnQBK5wJ2yWAq7cdQMuwM9wMfhs_J-qhnYqf3mY.jpeg?auto=webp&amp;s=ce5c164349fdbe13d001a0c53daa3136bbd01103"
        },
        "permalink": "/r/movies/comments/1mhn2h3/inside_the_naked_gun_scene_director_akiva/"
    },
    {
        "id": "1mht1kb",
        "author": "ThinWhiteDuke00",
        "title": "James Cameron Reveals the Colossal Challenges of his Upcoming ‘Ghosts of Hiroshima’ Film",
        "content": "“This might be the most challenging film I ever make. I don’t 100% have my strategy fully in place [right now] for how I want to see it, for how I want to shield people from the horror, but still be honest. Also, for how I can find some kind of poetry, beauty, or spiritual epiphany in it somehow, which I know must be there. It’s there in every human story. So, it’s going to be very challenging. I might not even be up to the task, but that never stopped me before.”",
        "upvotes": 548,
        "comments": 103,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6SiBmXL9CQwkU3ddecbPZOdvtO3aVN9s36k5mV0pNYI.jpeg?auto=webp&amp;s=22d2086b16ea77c28a63262f08b94a3f9a0a19a8"
        },
        "permalink": "/r/movies/comments/1mht1kb/james_cameron_reveals_the_colossal_challenges_of/"
    },
    {
        "id": "1mhhe8w",
        "author": "Comic_Book_Reader",
        "title": "SHELBY OAKS - Official Trailer - In Theaters October 3",
        "content": "",
        "upvotes": 1906,
        "comments": 214,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BFqWqR3boMgsVlCAHgsJ5ulEXCZ0vSuXdOZVukPObrc.jpeg?auto=webp&amp;s=08c7d0342eecafebbf8b036d0b70d3350d8e13c5"
        },
        "permalink": "/r/movies/comments/1mhhe8w/shelby_oaks_official_trailer_in_theaters_october_3/"
    },
    {
        "id": "1mhsreh",
        "author": "MarvelsGrantMan136",
        "title": "‘Greenland 2: Migration’ Sets January 9, 2026 Release Date From Lionsgate",
        "content": "",
        "upvotes": 376,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DUIwRsw_DkdSj04Z2Ic4avwfQI3VBTnky4VDHrGU9sU.jpeg?auto=webp&amp;s=5301fe7415797347d912098a352a0c7ddedba76e"
        },
        "permalink": "/r/movies/comments/1mhsreh/greenland_2_migration_sets_january_9_2026_release/"
    },
    {
        "id": "1mhpslq",
        "author": "Pleasant_Garlic8088",
        "title": "Who is the most believable married couple from a movie?",
        "content": "To my mind Roy Scheider and Lorraine Gary are entirely believable as Martin and Ellen Brody in \"Jaws.\"\n\nI'm not sure how much of the dialog and gestures and mannerisms between them were scripted or improvised, how many takes were shot to get everything right, etc.  But their chemistry and bond seem completely natural to me.",
        "upvotes": 507,
        "comments": 321,
        "media": null,
        "permalink": "/r/movies/comments/1mhpslq/who_is_the_most_believable_married_couple_from_a/"
    },
    {
        "id": "1mhg05g",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Mark Wahlberg and LaKeith Stanfield in Shane Black's 'Play Dirty' - Follows a thief and his crew who come across a major heist that pits them against a South American dictator, the New York mob and the world’s richest man.",
        "content": "",
        "upvotes": 1425,
        "comments": 581,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ec07300vp0hf1.jpeg?auto=webp&amp;s=acb41b27070242416440872de5978720bb189131"
        },
        "permalink": "/r/movies/comments/1mhg05g/first_image_of_mark_wahlberg_and_lakeith/"
    },
    {
        "id": "1mhcvzg",
        "author": "MarvelsGrantMan136",
        "title": "New Images from Noah Baumbach 'Jay Kelly' - Follows a friendship between a famous actor (George Clooney) and his manager (Adam Sandler) as they travel through Europe and reflect on their life choices, relationships, and legacies.",
        "content": "",
        "upvotes": 1739,
        "comments": 122,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zte7i3k740hf1.jpeg?auto=webp&amp;s=c53ec469fa483cf9289cc693a00e4d07fc0a3440"
        },
        "permalink": "/r/movies/comments/1mhcvzg/new_images_from_noah_baumbach_jay_kelly_follows_a/"
    },
    {
        "id": "1mhm6m5",
        "author": "bilhugs",
        "title": "IMDB is a swamp of advertising these days",
        "content": "IMDB is a swamp of advertising these days. I feel like it didn't used to be this bad. I used to be able to go to it as a source of information without having to play the stupid game of find-the-content. It's almost as bad as MSN for crying out loud. Do you think there's any hope for a return to functionality or... more realistically, that another service might pop-up and replace it at some point? Is there an app out there that I could use to look up movies by cast/crew and vice versa without subjecting myself to the parade of garbage?",
        "upvotes": 452,
        "comments": 118,
        "media": null,
        "permalink": "/r/movies/comments/1mhm6m5/imdb_is_a_swamp_of_advertising_these_days/"
    },
    {
        "id": "1mhywnn",
        "author": "Parking_Figure_7627",
        "title": "What's a movie you always assumed was considered good, only to find out much later it's largely considered terrible?",
        "content": "I know taste is subjective and whatnot, but I recently had this revelation with The Butterfly Effect (2004). I hadn't seen it in forever but at the time I thought it was fantastic. I had no idea critics hated it and was frequently ragged on (especially Ashton Kutcher) despite it being a commercial success. ",
        "upvotes": 54,
        "comments": 313,
        "media": null,
        "permalink": "/r/movies/comments/1mhywnn/whats_a_movie_you_always_assumed_was_considered/"
    },
    {
        "id": "1mhe8ch",
        "author": "KillerCroc1234567",
        "title": "Highest 2 Lowest | Official Trailer HD | A24",
        "content": "",
        "upvotes": 614,
        "comments": 169,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gDuoezCTJxAl8ac76OTBkHw7zjp_2WOWD5cfJML8bDM.jpeg?auto=webp&amp;s=4b44bcb19447dd99d50ebf5e7f3cd3ffad2f0e69"
        },
        "permalink": "/r/movies/comments/1mhe8ch/highest_2_lowest_official_trailer_hd_a24/"
    },
    {
        "id": "1mhmizp",
        "author": "MarvelsGrantMan136",
        "title": "Official Posters for Noah Baumbach's 'Jay Kelly'",
        "content": "",
        "upvotes": 194,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/d4ux70jbw1hf1.jpeg?auto=webp&amp;s=cde87986a77c1e38f9dcb24c3b0d0baa00bc5356"
        },
        "permalink": "/r/movies/comments/1mhmizp/official_posters_for_noah_baumbachs_jay_kelly/"
    },
    {
        "id": "1mhe4bf",
        "author": "Amaruq93",
        "title": "\"Hollow Man\" at 25 | Paul Verhoeven's bleak sci-fi flick is no classic, but it’s better than you remember",
        "content": "",
        "upvotes": 399,
        "comments": 123,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dh34EVZvAjb3aqy4MGlQdeZnzeGulUkM-Jm-Reqrjnw.jpeg?auto=webp&amp;s=eab00d3cca46c6f7f3c9511c011e9d22ba3e0ed5"
        },
        "permalink": "/r/movies/comments/1mhe4bf/hollow_man_at_25_paul_verhoevens_bleak_scifi/"
    },
    {
        "id": "1mhhkq3",
        "author": "KillerCroc1234567",
        "title": "Official Poster for \"Ella McCay\"",
        "content": "",
        "upvotes": 260,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gzz64irl01hf1.jpeg?auto=webp&amp;s=e8e00b0e0a9c25dc67aa1d3e16c5f6d4e48665e3"
        },
        "permalink": "/r/movies/comments/1mhhkq3/official_poster_for_ella_mccay/"
    },
    {
        "id": "1mhn1et",
        "author": "mayukhdas1999",
        "title": "Official Poster for cosmic-horror 'THE OCCUPANT' - Abby, stranded in the Georgian wilderness after a helicopter crash, is guided by a mysterious figure named John. As she battles to survive, her grip on reality falters until she is faced with an impossible choice",
        "content": "",
        "upvotes": 117,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/myf99y3wz1hf1.jpeg?auto=webp&amp;s=a2366bcfcd2a2a3be59d09ce27b684d9fc4e74d9"
        },
        "permalink": "/r/movies/comments/1mhn1et/official_poster_for_cosmichorror_the_occupant/"
    },
    {
        "id": "1mi34no",
        "author": "Thrusthamster",
        "title": "The Final Reckoning's diving scene is a copy of Tomorrow Never Dies",
        "content": "Spoilers for Mission Impossible: The Final Reckoning and Tomorrow Never Dies, obviously.\n\nI just rewatched Tomorrow Never Dies and it made me a bit disappointed in The Final Reckoning.\n\nThis is the scene:\n\n- James Bond does a HALO jump into the South China Sea to find and investigate the wreck of HMS Devonshire\n\n- The wreck is on an unstable shelf and is moving as pieces of rock fall down\n\n- He gets to the torpedo/missile room\n\n- The difference is he meets Michelle Yeoh there\n\n- The rock shifts the wreck and the missiles fall over and block the door\n\n- The only way out is a tube\n\n- Oh no, they don't fit with the oxygen tanks!\n\n- They take them off and swim up through the tube and to safety\n\nI mean, of course Tom Cruise did it better and that scene is more intense. But basically everything that occurs in the scene is copied from Tomorrow Never Dies beat for beat.\n\nhttps://youtu.be/-lKpFts8eGg?si=vlrMgQtFomw5lHsg",
        "upvotes": 10,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9h8n8GIEZKdsaypaUhyNF-5CWONdEGSPqOqc83lXmV0.jpeg?auto=webp&amp;s=21c230b515803af96be80993bc69a6cd4cad0a48"
        },
        "permalink": "/r/movies/comments/1mi34no/the_final_reckonings_diving_scene_is_a_copy_of/"
    },
    {
        "id": "1mhud98",
        "author": "SafeBodybuilder7191",
        "title": "Billie Lourd Joins Andrew Garfield In AI Pic ‘Artificial’ From Amazon MGM Studios which Luca Guadagnino is directing.",
        "content": "",
        "upvotes": 41,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/V3YVaYnMlF8ehAdxVXPcq_GxTbc0iawA30mrV9bHLpg.jpeg?auto=webp&amp;s=38eb66b3d1498dd17d64587c15c9f2130e7cc345"
        },
        "permalink": "/r/movies/comments/1mhud98/billie_lourd_joins_andrew_garfield_in_ai_pic/"
    },
    {
        "id": "1mgxe48",
        "author": "insanity2brilliance",
        "title": "Fall Guy (2024) with Ryan Gosling and Emily Blunt",
        "content": "Finally got around to watching this over the weekend. I loved the duality of the film about being a duality movie and also being just the movie with the complexities of directing a movie. \n\n“Should we do a split screen?” \n\n“Let’s do it all in a single take.”\n\nAnd, yes!!!!!! The credits highlighting all the stunt guys and gals was awesome. \n\nI wonder if any actual true stunt guys/gals watched this movie and thought this movie was close to accurate for what they go through on set or not. ",
        "upvotes": 3869,
        "comments": 359,
        "media": null,
        "permalink": "/r/movies/comments/1mgxe48/fall_guy_2024_with_ryan_gosling_and_emily_blunt/"
    },
    {
        "id": "1mht5mk",
        "author": "lazylad_007",
        "title": "Best movie where the setting feels like a character?",
        "content": "Some movies go beyond just having a cool location: the setting itself shapes the emotion, tone, and even the story, almost like it’s a character in the film.\n\nFor example, *In Bruges:* the city’s beauty vs. the characters’ inner darkness is a perfect contrast.\n\nWhat’s a movie where the place sticks with you just as much as the people?",
        "upvotes": 40,
        "comments": 148,
        "media": null,
        "permalink": "/r/movies/comments/1mht5mk/best_movie_where_the_setting_feels_like_a/"
    },
    {
        "id": "1mi2pai",
        "author": "moal09",
        "title": "The 1994 Crow has one of the best and simplest setups for a revenge movie that I've seen",
        "content": "It opens with one of the most brutal home invasion scenes of the '90s, establishes all the villains as absolutely irredeemable scumbags and then sets an invincible protagonist on them.  It barely wastes any time before he's on the first dude.\n\nI know it's based on a comic, but it almost reminds me of a precursor to John Wick in some ways.  The way the audience can easily root for every single dude on his list to die a horrible death.  ",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1mi2pai/the_1994_crow_has_one_of_the_best_and_simplest/"
    },
    {
        "id": "1mhlnwx",
        "author": "SanderSo47",
        "title": "Ari Aster’s Criterion Closet Picks",
        "content": "",
        "upvotes": 94,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sZJ59fI_q5U7DAaJZD2tUgvvPc65j2R1zYxrelXJfZw.jpeg?auto=webp&amp;s=30bef935f973c8117f1214873cd6a8eb5450ebe5"
        },
        "permalink": "/r/movies/comments/1mhlnwx/ari_asters_criterion_closet_picks/"
    },
    {
        "id": "1mhzobi",
        "author": "Snowyy921",
        "title": "Movie with the best ending",
        "content": "It could be the ending scene or ending sequence. One of my personal favorites is the ending to The Departed. The twists and turns and unexpected deaths, all culminating in Dignam killing Matt Damon’s character,(forget his name, haven’t watched the movie in a bit) is in my opinion amazing. Some others would be Inception, with the song “Time” by Hans Zimmer playing and the iconic final shot of the totem spinning and then the fade to black. Or maybe I could say the ending to each movie of the original Star Wars trilogy, with the explosion of the Death Star and the fights against Vader. Undoubtably i’m missing many more, let me know what you think. ",
        "upvotes": 11,
        "comments": 69,
        "media": null,
        "permalink": "/r/movies/comments/1mhzobi/movie_with_the_best_ending/"
    },
    {
        "id": "1mhhisb",
        "author": "darth_vader39",
        "title": "Ella McCay | Official Trailer | In Theaters December 12",
        "content": "",
        "upvotes": 108,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BTFBlvifJ-gWzii17K79lyX4CzfuLLXtA2n31tt2sMM.jpeg?auto=webp&amp;s=34060ef24d03f5f40eaccdc862834003e80225bc"
        },
        "permalink": "/r/movies/comments/1mhhisb/ella_mccay_official_trailer_in_theaters_december/"
    },
    {
        "id": "1mh61dl",
        "author": "NoCulture3505",
        "title": "Willem Dafoe to Receive Honorary Heart of Sarajevo at Sarajevo Film Festival",
        "content": "",
        "upvotes": 598,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SxEmqE4rr4NW9dE_pPHTI-nWBAB6XczJIUHCGYt6Lww.jpeg?auto=webp&amp;s=fcb294fa5f90edb175447c984b7a91184c07cfcd"
        },
        "permalink": "/r/movies/comments/1mh61dl/willem_dafoe_to_receive_honorary_heart_of/"
    },
    {
        "id": "1mi2lhb",
        "author": "Tasty-Garden-9151",
        "title": "Rich Sommer Confirms He Won’t Return for ‘The Devil Wears Prada’ Sequel",
        "content": "",
        "upvotes": 6,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aF-b1fuNI-BTdya-GMzEn9ukUUzI6EOBlPIluXxCLZs.jpeg?auto=webp&amp;s=06cc622f9119bc4863c2ed699b02f060d5fe770d"
        },
        "permalink": "/r/movies/comments/1mi2lhb/rich_sommer_confirms_he_wont_return_for_the_devil/"
    }
]