[
    {
        "id": "1ieoc9a",
        "author": "NotAnArtistAMA",
        "title": "Hello r/movies, we're Alexi Pappas, Jeremy Teicher, and Matt Walsh, the filmmakers behind the new comedy NOT AN ARTIST. It's got a great cast, including RZA, Haley Joel Osment, Clepatra Coleman (and Alexi and Matt). Check it out on demand everywhere starting today. AMA!",
        "content": "",
        "upvotes": 57,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8x36gtpz1ege1.png?auto=webp&amp;s=01506d967def311128c6d1524156038724c8d365"
        },
        "permalink": "/r/movies/comments/1ieoc9a/hello_rmovies_were_alexi_pappas_jeremy_teicher/"
    },
    {
        "id": "1idt8dy",
        "author": "-BVK",
        "title": "Hi /r/movies! We’re Ben Van Kleek, Alaina Huffman, Lincoln Huffman, Trevor Vandelac, and Josh Farnworth - the director, actors, writers, and producers of the movie Jonah. Ask us anything! Back at 5PM EST Friday, Jan 31st to answer your questions.",
        "content": "",
        "upvotes": 61,
        "comments": 106,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/falih1fk86ge1.jpeg?auto=webp&amp;s=e2991be210dc7c4b885413f123a11a767b61a32f"
        },
        "permalink": "/r/movies/comments/1idt8dy/hi_rmovies_were_ben_van_kleek_alaina_huffman/"
    },
    {
        "id": "1iexk7k",
        "author": "flashbang_out",
        "title": "Constantine [2005] Finally watched, holy shit was Peter Stormare amazing as Satan",
        "content": "The movie? It's good. Maybe even great. I definitely had a lot of fun watching it.I understand the complaints, sure, it's not perfect, but overall, it's a solid flick.\n\nWhat elevates it to amazing? Peter Stormare.\n\nHoly crap he gave the best satan performance I have ever seen. I was just completely glued to the TV the few minutes he was on screen. I don't know what it was, but something about him just gave off such an evil, conniving, terrifying monster vibe.",
        "upvotes": 2754,
        "comments": 299,
        "media": null,
        "permalink": "/r/movies/comments/1iexk7k/constantine_2005_finally_watched_holy_shit_was/"
    },
    {
        "id": "1if7crm",
        "author": "RandomConnections",
        "title": "Movies that teased sequels that never happened",
        "content": "Just watched Uncharted (2022) with Tom Holland and Mark Wahlberg.  It's total check-your-brain-at-the-door escapism.  I noticed that in the pre- and mid-credit scenes they teased more adventures for the characters, but as far as I know a sequel is not in the works for this movie based on a video game.\n\nThe same thing happened with The Man from U.N.C.L.E (2015) with Henry Cavill.  Further adventures were teased in the credits, but no sequel happened. \n\nI know there are multiple reasons why this happens.  The movie is a flop, or its stars movie on to bigger and better projects.  I'm just wondering what other movies teased sequels that just never happened.",
        "upvotes": 243,
        "comments": 631,
        "media": null,
        "permalink": "/r/movies/comments/1if7crm/movies_that_teased_sequels_that_never_happened/"
    },
    {
        "id": "1iei652",
        "author": "BunyipPouch",
        "title": "Oscar Nominated Donald Trump Biopic 'The Apprentice' Returning To Theaters Starting February 7",
        "content": "",
        "upvotes": 8752,
        "comments": 463,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tljalnNED5tZ-BO1SBL7KQTfdckiWlfAcCFEZuPY_z8.jpg?auto=webp&amp;s=08feba73e9a53aa4c51daba9972c69a6bb997ab7"
        },
        "permalink": "/r/movies/comments/1iei652/oscar_nominated_donald_trump_biopic_the/"
    },
    {
        "id": "1ies02y",
        "author": "MarvelsGrantMan136",
        "title": "Himesh Patel, Elliot Page, Bill Irwin &amp; Samantha Morton Join Christopher Nolan’s ‘The Odyssey’",
        "content": "",
        "upvotes": 1509,
        "comments": 275,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kzkoiG6m0vOZfhnrJJCqt7k9plJY85-eWYtdpIDDtKA.jpg?auto=webp&amp;s=30d715db641127a38ab789ecf34545a50f973634"
        },
        "permalink": "/r/movies/comments/1ies02y/himesh_patel_elliot_page_bill_irwin_samantha/"
    },
    {
        "id": "1iejjhk",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Monkey'",
        "content": "",
        "upvotes": 3414,
        "comments": 247,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sh29f27u1dge1.jpeg?auto=webp&amp;s=f5b4738d92787a55c14a05adb0bda4bc9e304ec5"
        },
        "permalink": "/r/movies/comments/1iejjhk/new_poster_for_the_monkey/"
    },
    {
        "id": "1iekqa1",
        "author": "MrShadowKing2020",
        "title": "‘Superman’ Estate Sues Warner Bros. Discovery, DC Comics To Block Release In Key Territories",
        "content": "",
        "upvotes": 1822,
        "comments": 187,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/u9PyrdkCjy-GBGBFEEipUTG6qgEjeQzJfJB-P51TSBc.jpg?auto=webp&amp;s=9a810e6915837e01782ff3fe305b5303a6fcf751"
        },
        "permalink": "/r/movies/comments/1iekqa1/superman_estate_sues_warner_bros_discovery_dc/"
    },
    {
        "id": "1iesl2t",
        "author": "AppleBottmBeans",
        "title": "“About Time” is one of the greatest time travel movies ever",
        "content": "About Time is one of the best time travel movies ever made. People are gonna say Back to the Future, Avengers, Interstellar, etc. But those movies are all about the mechanics of time travel. About Time is about the FEELING of it. \n\nMost time travel movies are about fixing mistakes or saving the world. This is about a guy trying to live a better life. be a better son, husband, dad. No crazy paradoxes or multiverse headaches. That alone makes it hit way harder than any other time travel movie.\n\nMost time travel movies make you wish you could go back and fix stuff. About Time makes you wanna enjoy what you’ve got right now. \n\nHIGHLY recommend. ",
        "upvotes": 594,
        "comments": 96,
        "media": null,
        "permalink": "/r/movies/comments/1iesl2t/about_time_is_one_of_the_greatest_time_travel/"
    },
    {
        "id": "1ifa6lv",
        "author": "stroll_on",
        "title": "The 37 Best Anti-Fascist Films of All Time",
        "content": "",
        "upvotes": 28,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/e7lmFuejcHTWcOXdxNwmAgQkjhS-CkzSV0d2K3lh8JM.jpg?auto=webp&amp;s=1138a2578272f4972c9b65499f819213ded766b8"
        },
        "permalink": "/r/movies/comments/1ifa6lv/the_37_best_antifascist_films_of_all_time/"
    },
    {
        "id": "1if75n8",
        "author": "infectiondepression",
        "title": "Your top 3 movies from 90’s &amp; early 00’s",
        "content": "I’d like to know your top 3 or recommendations for any genre, that is worth to watch.  \n\nI was a child in 90’s so I’m sure I have missed out on some hidden gems that are “must.. \n\nSome of my favs are things like Dogma, Clerks, The Crow, Blade, Chocolat, Fear and loathing in las vegas, Snatch, Airheads, American beauty, misery and much more.. \n\nGive me something good! \n\nThanks :) \n\nEdit:\nI was expecting 3-4 comments. But woa, I’ll have to create a list of movies I haven’t seen.  Thank you all! Great taste I have to say! ",
        "upvotes": 41,
        "comments": 119,
        "media": null,
        "permalink": "/r/movies/comments/1if75n8/your_top_3_movies_from_90s_early_00s/"
    },
    {
        "id": "1if9s77",
        "author": "Extension_Debt_2944",
        "title": "Sophie Thatcher in Control: The ‘Yellowjackets’ Star on ‘Companion’ and How the Film’s Toxic Relationship Goes ‘Far Deeper Than I Ever Imagined’",
        "content": "Thought this interview was super interesting and got into the psyche of this excellent film. Particularly interested in this part about her m bringing her real life into it:\n\n“I think me being nervous about it all worked, because she was so eager, and I find myself in relationships that way. Watching it the first time I was embarrassed for myself, because the character just wants to be loved. It felt desperate in a way that I haven’t done before, but I always see myself in roles.”",
        "upvotes": 24,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zN4q3raP1TgGLk8I08Qo0WoYP_ECPsIdwj_ZA3YK66Y.jpg?auto=webp&amp;s=1da1f0a58ac6f01327ef4d0a1e06ed200255e96d"
        },
        "permalink": "/r/movies/comments/1if9s77/sophie_thatcher_in_control_the_yellowjackets_star/"
    },
    {
        "id": "1ieh05f",
        "author": "lovelymissbliss",
        "title": "What's an obscure movie you LOVE but no one know wtf you're talking about when you mention it?",
        "content": "For me it's definitely The Science of Sleep starring Gael Garcia Bernal and Charlotte Gainsbourg. It's just a perfect little indie film that makes me laugh and cry every time. I've seen it well over a dozen times but hardly ever meet anyone to share in my adoration. At one point I couldn't even find it on any streaming service or iTunes to purchase digitally!",
        "upvotes": 2026,
        "comments": 5281,
        "media": null,
        "permalink": "/r/movies/comments/1ieh05f/whats_an_obscure_movie_you_love_but_no_one_know/"
    },
    {
        "id": "1ieke9n",
        "author": "KrymskeSontse",
        "title": "Mr. Nobody Against Putin. The film depicts recruitment training for war in a Russian primary school, as part of the ongoing war against Ukraine. The footage was shot by teacher Pavel Talankin, who has now left Russia",
        "content": "",
        "upvotes": 1180,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-6Q9TEgOicZ8kuQNSOZPiJmCjMEMkii-zSCCJr8W5Fw.jpg?auto=webp&amp;s=dc9fd2c003419bf6cb23d6a5d62486c915680dd9"
        },
        "permalink": "/r/movies/comments/1ieke9n/mr_nobody_against_putin_the_film_depicts/"
    },
    {
        "id": "1ieokpy",
        "author": "indiewire",
        "title": "John Carpenter’s ‘They Live’ Returns to VHS for Nostalgic Cult Film Fetishists",
        "content": "",
        "upvotes": 626,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Ucp0kw-xLokKdTecHI1OYj9SK2ygsf82KJ-oainy87I.jpg?auto=webp&amp;s=382514afc6105b698e5d7fe59318b7403b68f579"
        },
        "permalink": "/r/movies/comments/1ieokpy/john_carpenters_they_live_returns_to_vhs_for/"
    },
    {
        "id": "1iesaxr",
        "author": "DragonfruitSea8477",
        "title": "Which film made you laugh the hardest?",
        "content": "Following on from my previous question about the saddest songs you know, I thought I'd ask a happier question.\n\nI have a good sense of humour and like a good laugh, so there are a few films that have made laugh hard, but the following really made me laugh to the point of tears or agony:\n- Home Alone 2, when Marv gets electrocuted. The first time I saw that scene when I was 11, I was literally rolling on the floor laughing and in agony. It still makes me laugh like an idiot even now;\n- Blazing Saddles, the infamous farting scene. I thought I was going to have a heart attack the first time I watched that scene;\n- Scooby-Doo (the first live-actiom film), the part where Shaggy is farting and then lets loose a good one, unaware that Daphne is standing behind him;\n- Johnny English, when the title character shows the archbishop's bottom to the whole world;\n- Step Brothers, no part in particular as the whole film is just gleefully childish and outrageously funny;\n- Dumb and Dumber, the part where Harry has the worst case of the shits after Lloyd spikes his coffee with laxatives.\n\nFeel free to share the films that made you laugh the hardest.",
        "upvotes": 307,
        "comments": 1275,
        "media": null,
        "permalink": "/r/movies/comments/1iesaxr/which_film_made_you_laugh_the_hardest/"
    },
    {
        "id": "1iek6am",
        "author": "Chrono_Convoy",
        "title": "What’s a great misunderstood concept in a film’s script",
        "content": "Example: Bad Santa and when Thurman Murman asked Santa how can he be dropped on his own head?\n\nNSFW for reference below\n\nhttps://m.youtube.com/watch?time_continue=16&amp;v=3eFlyYQyeZs&amp;embeds_referring_euri=https%3A%2F%2Fwww.reddit.com%2F&amp;embeds_referring_origin=https%3A%2F%2Fwww.reddit.com&amp;source_ve_path=MTM5MTE3LDI4NjY2",
        "upvotes": 800,
        "comments": 315,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oKxpdljpHyV5wZOndEtj2K3AMv_-uYOs6kMx42XLARo.jpg?auto=webp&amp;s=6c4823b7f9c21b268505849960f61ac2e890fa0a"
        },
        "permalink": "/r/movies/comments/1iek6am/whats_a_great_misunderstood_concept_in_a_films/"
    },
    {
        "id": "1if0s7g",
        "author": "LessMulberry6388",
        "title": "What's your favorite Christopher Walken role?",
        "content": "Mine is 1986's \"At Close Range\" co-starring Sean Penn (great film)\n\nSome fun facts about Chris are that he probably doesn't like being called that lol \n\nHe's never owned a cellphone \n\nIn 1987 , if it were to be produced,which unfortunately it wasn't he was the favorite to play Norman Osborn in Spider-Man ",
        "upvotes": 64,
        "comments": 256,
        "media": null,
        "permalink": "/r/movies/comments/1if0s7g/whats_your_favorite_christopher_walken_role/"
    },
    {
        "id": "1iehjn9",
        "author": "West_Conclusion_1239",
        "title": "Greatest \"Lynchian\" films NOT directed by David Lynch??",
        "content": "In memory of David Lynch, a true legend of both film and television history, i ask you:\n\nWhat do you think are the greatest \"Lynchian\" films NOT directed by David Lynch?\n\nWhat are your suggestions about it?\n\nI will start with mine:\n\nBarton Fink (1991) [Coen Brothers]\n\nWhat are yours?\n\nShare in the comments down below.",
        "upvotes": 552,
        "comments": 693,
        "media": null,
        "permalink": "/r/movies/comments/1iehjn9/greatest_lynchian_films_not_directed_by_david/"
    },
    {
        "id": "1if7faf",
        "author": "dunitdotus",
        "title": "Shooter",
        "content": "I’m sure this has been asked before. \n\nSo Mark Wahlburg asks the question about making a bullet appear as though it was fired from another weapon. \n\nMy question is how did they get a bullet from his weapon to begin with?\n\nHe shot the can of stew, did someone then scour the countryside with a metal detector?  They couldn’t have fired it from his weapon in a ballistics tube because he changed the firing pin. \n\nSo how did they get a bullet to wrap in paper to shoot the arch bishop?\n\n",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1if7faf/shooter/"
    },
    {
        "id": "1if7oea",
        "author": "ExceedsTheCharacterL",
        "title": "Movies that make you feel sorry for terrible people",
        "content": "I’m referring to films that push the limits on what you would call a bad guy getting their comeuppance. We all like seeing it happen, but at what point are you just as bad as they are? The first movie in this category I want to talk about is Bully. It’s based on a True story, in the late 90s some kids came to hate a friend of theirs so they brutally murdered him. The most bizarre part of the story is that 2 of the boys that participated had never met him before in their entire lives.    \n   In the movie, the murder victim is definitely a rapist and an abusive bully towards his only friend. In real life, he was possibly a rapist, certainly an abusive bully to his friend but the movie omits the fact that they both were (they would often mock a man with Down syndrome in their neighborhood and throw things at him). Feeling sorry for him is a challenge, but if you read his autopsy you just might. He was bludgeoned in the head with a baseball bat hard enough to fracture 2 vertebrae, received multiple stab wounds in the neck, abdomen, and chest, before they finally slit his throat. All of that plays out on screen pretty faithfully. The director of the film is a known creep I believe, but it’s a solid crime flick imo. \n\nOne more movie I’ll name is Hard Candy. It’s a vigilante story. A teenage girl meets up with a grown man she spoke with in a chatroom and goes home with him, where she proceeds to drug and torture him. There’s a “castration” scene that had me thinking “this is probably what everyone wants, but…it’s just wrong” The movies ending fell flat for me, but I’d say give it a watch. Feel free to add movies that fit into this category.",
        "upvotes": 6,
        "comments": 66,
        "media": null,
        "permalink": "/r/movies/comments/1if7oea/movies_that_make_you_feel_sorry_for_terrible/"
    },
    {
        "id": "1if7ec5",
        "author": "Lucky_Plan7855",
        "title": "For those who have seen Watership Down (1978), should Woundwort be on the Pure Evil wiki?",
        "content": "Having surfed the Pure Evil wiki for a good enough time, I'm surprised that Movie Woundwort hasn't made the cut there despite being evil enough to do so. He enslaves other rabbits and has them tortured whenever they try to escape, threatened to wipe out Watership Down in revenge for helping the rabbits escape, and brutally killed Blackavar in what's possibly the most gruesome scene in the whole movie. He has none of the redeeming/sympathetic qualities of the TV series counterpart, nor the tragic backstory of the Netflix counterpart, and he's taken deathly seriously in the movie.",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1if7ec5/for_those_who_have_seen_watership_down_1978/"
    },
    {
        "id": "1ie3lbs",
        "author": "MarvelsGrantMan136",
        "title": "Christopher Nolan’s ‘The Odyssey’ Adds John Leguizamo",
        "content": "",
        "upvotes": 5923,
        "comments": 471,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vi48A2Yeuh3HMbtHJVm6fOQ8iYetkY-GVg1R_6sqKT4.jpg?auto=webp&amp;s=58f3b7dec2c5371de228b01bbf9837e6879ac688"
        },
        "permalink": "/r/movies/comments/1ie3lbs/christopher_nolans_the_odyssey_adds_john_leguizamo/"
    },
    {
        "id": "1if3uws",
        "author": "ohshit6969",
        "title": "Requesting suggestions for “tactical” movies with realistic firefights",
        "content": "I recently rewatched Sicario tonight, and its left me desperately looking for a specific type of movie. I’ve heard it described on the web as a “tactical itch”. To put it in my own words, I’m looking for movies with those more realistic firefights. Staggered entries with someone taking point. Isolating angles. Clearing rooms 1 by 1. That sort of stuff. Sicario, and Triple frontier on Netflix are the best references that come to mind. Any suggestions would be much appreciated🙏🏽🙏🏽",
        "upvotes": 11,
        "comments": 121,
        "media": null,
        "permalink": "/r/movies/comments/1if3uws/requesting_suggestions_for_tactical_movies_with/"
    },
    {
        "id": "1ieho0o",
        "author": "Plane_Muscle6537",
        "title": "Schindler's List is an amazing film and should be a required viewing for history classes",
        "content": "Such an incredible film that pulls no punches and is gut wrenching. I remember watching it around 15 and being so incredibly moved by it\n\nIt's one of those films where I say to myself that I'd never re-watch it, but now with the state of affairs and the epidemic rise in holocaust denial, I feel compelled to watch this again\n\nThis film should be mandatory for history classes in the western world. I was taught about the holocaust in school, but there's something different about the experience of watching a film that offers a glimpse into it\n\nI believe this film is more important than ever now and it is easily Spielberg's magnum opus. Also the apex of Liam Neeson's acting",
        "upvotes": 392,
        "comments": 170,
        "media": null,
        "permalink": "/r/movies/comments/1ieho0o/schindlers_list_is_an_amazing_film_and_should_be/"
    },
    {
        "id": "1ienlhz",
        "author": "TumToes",
        "title": "Really tight, well rounded, perfectly packaged movies?",
        "content": "Looking for movies that from beginning to end, are a pleasure to watch. It can be a comedy that always keeps you on your toes, or a movie with a great cast and captivating presence all the way through. I personally really like stuff that is shot and directed so well that you can't take your eyes off it. A cinema \"experience\" per se. So if you know of any of those that aren't necessarily talked about, I would appreciate it.",
        "upvotes": 124,
        "comments": 520,
        "media": null,
        "permalink": "/r/movies/comments/1ienlhz/really_tight_well_rounded_perfectly_packaged/"
    },
    {
        "id": "1ieg9qz",
        "author": "MarvelsGrantMan136",
        "title": "Cineverse Sets ‘The Toxic Avenger’ Theatrical Release Date (August 29)",
        "content": "",
        "upvotes": 322,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3ySnYNY8h1vvBK7RDUm2uRTbqJ9Plt9nb6Gg1EOd8dM.jpg?auto=webp&amp;s=74a9b1d90df14537e800865bd461c11a345b4d78"
        },
        "permalink": "/r/movies/comments/1ieg9qz/cineverse_sets_the_toxic_avenger_theatrical/"
    },
    {
        "id": "1if95z1",
        "author": "Motor_Lawfulness4322",
        "title": "Movie/show recommendations",
        "content": "I’m really picky with watching movies lol I don’t know why. It’s just really overwhelming to choose one. I’ve been feeling bored lately and I’ll like to watch something good and interesting and excites me. Does anyone have any good TV shows/movie recommendations? I’m 17 so more mature ones are okay as long as it’s not toooo intense. Any genre is good but mystery/comedy/action ones seem to appeal to me lol tyia\n",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1if95z1/movieshow_recommendations/"
    },
    {
        "id": "1if948n",
        "author": "TheKillingJoke1991",
        "title": "American Pie’s Understated Wholesomeness",
        "content": "Audiences have come to know the original American Pie series as an example of teen comedy revivalism that relies on crude humor to do most of the heavy lifting. I don’t really want to get into whether the humor or the manner of tackling certain subjects still holds up to this day. Personally I want to take this moment to highlight an ingredient which, in my humble opinion, is essential to the charm of the original series – I’m going to ignore the spin-offs here – and that is its subtle, but effective wholesomeness. \n\n Deep down American Pie 1 &amp; 2 in particular are movies about growing up, overcoming, learning and moving forward. The common thread throughout all of this is the search for and the preserving of a human connection, whether it’s a lifelong friendship or a family relationship. The characters, as immature as they may be, all stumble along the way but in the end find out that the world has other and better things in store for them than what they thought they were looking for in the beginning. It’s almost as if these movies when all is said and done do want to convey a message: you’re an ignorant kid who’s going to mess up and growing up you will continue to mess up, but you’ll learn and you’ll always have your friends and your family to learn from and they will always learn along with you.\n\n Adding to this is the fact that there seems to be a genuine chemistry between the cast members, which includes both the main as well as the side characters. To top it off the original movies serve up a nostalgic soundtrack that reminds me – and I do realize that I am showing my age here – of a time where the world at least seemed to be a much more hopeful and optimistic place. \n\n Maybe the jokes didn’t age well. Maybe the way these movies go about certain specific subjects didn’t age well. Be that as it may, there’s one thing to me that definitely does hold up. A quality that is missing from the vast majority of movies of that ilk which came out at the time: a nostalgic comforting heart. \n\n To the next step! ",
        "upvotes": 5,
        "comments": 23,
        "media": null,
        "permalink": "/r/movies/comments/1if948n/american_pies_understated_wholesomeness/"
    },
    {
        "id": "1if8qrv",
        "author": "Safe_Condition_8123",
        "title": "Ever After: A Cinderella Story's Romani bandit scene has some awesome historical basis.",
        "content": "In the film, Prince Henry is cornered and soon to be captured by Romani bandits(the depiction of the Romani didn't age very well) and The Prince demands that Danielle be released. After being accosted by Danielle with a list of demands, the leader of the bandits says \"My lady, you many take with you whatever you can carry\"\n\nShe promptly goes over to the Prince, put him in a Fireman carry, curtsies to the bandits, and walks away, much to general amusement.\n\nInterestingly, this is directly lifted from [The Siege of Weinsberg](https://en.wikipedia.org/wiki/Siege_of_Weinsberg) aka \"The Loyal Wives of Weinsberg\". Once the inhabitants of Weinsberg surrendered, King Conrad III proclaimed that The wives and womenfolk found there may leave with whatever they could carry on their shoulders. When a Duke of his objected, the King said that it would not be fitting to change his royal word.\n\nI don't know the extent to which this will be read as a \"did you know, Viggo Mortensen broke his toe when he kicked that helmet?!\" kind of post. So I hope that some of you, at least, are learning of this for the first time.\n\nAlso, if you haven't watched  Ever After, you really really should. ",
        "upvotes": 3,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IHa61x8QF8_SnDwfKCIeNPR-iJj1f7JGihRlwQ_xZP8.jpg?auto=webp&amp;s=a519c0bc8fc5dbc50ad56673b4fa2ebf89a855d8"
        },
        "permalink": "/r/movies/comments/1if8qrv/ever_after_a_cinderella_storys_romani_bandit/"
    },
    {
        "id": "1ie2hwq",
        "author": "MarvelsGrantMan136",
        "title": "Matthew Lillard Is Coming Back For ‘Scream 7’",
        "content": "",
        "upvotes": 3453,
        "comments": 346,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/70x7oCF_s7jLQbXdkMVz0s69RyRynjhHI_aNRSuLJ_s.jpg?auto=webp&amp;s=b6989147cff030cc19dd18d68694b95e16a64037"
        },
        "permalink": "/r/movies/comments/1ie2hwq/matthew_lillard_is_coming_back_for_scream_7/"
    },
    {
        "id": "1ieliye",
        "author": "Puzzled-Tap8042",
        "title": "Eric Bana Joins Charlize Theron In Netflix Thriller ‘Apex’",
        "content": "",
        "upvotes": 122,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GdICEALB6FMS_lxjtpO2r-BTA57jpb6KbR1pql3dcVk.jpg?auto=webp&amp;s=36ffe6bf2195e88191c9cf429a260c79d21be144"
        },
        "permalink": "/r/movies/comments/1ieliye/eric_bana_joins_charlize_theron_in_netflix/"
    }
]