[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 509,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 20,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1k5584i",
        "author": "BoredPandaOfficial",
        "title": "“It Takes Guts”: Netflix Star Nicola Coughlan Says ‘No’ To Harry Potter Reboot After UK Supreme Court Ruling",
        "content": "",
        "upvotes": 81,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1k5584i/it_takes_guts_netflix_star_nicola_coughlan_says/"
    },
    {
        "id": "1k4mfwh",
        "author": "TheMirrorUS",
        "title": "Netflix urged to prepare for 'long and messy' Baby Reindeer legal battle",
        "content": "",
        "upvotes": 467,
        "comments": 112,
        "media": null,
        "permalink": "/r/netflix/comments/1k4mfwh/netflix_urged_to_prepare_for_long_and_messy_baby/"
    },
    {
        "id": "1k535g0",
        "author": "ScottishDailyRecord",
        "title": "Netflix's Tiger King Joe marries behind bars as he ties knot with fellow inmate",
        "content": "",
        "upvotes": 25,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1k535g0/netflixs_tiger_king_joe_marries_behind_bars_as_he/"
    },
    {
        "id": "1k53xrl",
        "author": "Somethingman_121224",
        "title": "Acclaimed Hit Series 'Heartstopper' Will End with a Movie, Netflix Confirms",
        "content": "",
        "upvotes": 16,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k53xrl/acclaimed_hit_series_heartstopper_will_end_with_a/"
    },
    {
        "id": "1k58ykp",
        "author": "daylorer",
        "title": "My continue watching does not show up for certain shows?",
        "content": "It annoys me to no end when I’m binging a show and it wont show which episode I’m on, how long I played it or even if I watched it in general unless I click on/remember the correct episode. However, this only happens to certain shows. Is there a specific reason why Netflix does this? I watch one episode of black mirror or 10 minutes of a random Netflix original and it shows up but then for young royals or gossip girl it doesn’t? Is it a copyrights thing or hiding sensitive topics to protect the viewer or just a netflix issue? ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k58ykp/my_continue_watching_does_not_show_up_for_certain/"
    },
    {
        "id": "1k56ou7",
        "author": "S4v1r1enCh0r4k",
        "title": "Karol G Documentary ‘Tomorrow Was Beautiful’ Gets Trailer and Release Date on Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k56ou7/karol_g_documentary_tomorrow_was_beautiful_gets/"
    },
    {
        "id": "1k4t3gn",
        "author": "Routine-Agile",
        "title": "Raw - cannot rewind? bug",
        "content": "Hello\n\n  \nI normally watch Raw, but always get there late.  This week, the feature to rewind seems to have gone. Is this a bug or a new feature. Please don't be a feature as I really need the option to rewind. \n\n  \nalso i guess i need a post to have enough words or it gets deleted. weird.",
        "upvotes": 20,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1k4t3gn/raw_cannot_rewind_bug/"
    },
    {
        "id": "1k4iwr3",
        "author": "gotanygrapes88",
        "title": "Binge worthy netflix shows?",
        "content": "Need recommendations. Loved Wentworth, Shamless, Inventing Anna, 13 reasons and Greys.\n\n I liked all these at first but then i got bored and stopped watching  Ozark, walking dead, animal kingdom, the resident, good doctor, manifest, dexter, peaky blinders, this is us, lucifer, breaking bad, orange is the new black, lost, probably more i can't think of. \n\nAny binge worthy suggestions?",
        "upvotes": 70,
        "comments": 175,
        "media": null,
        "permalink": "/r/netflix/comments/1k4iwr3/binge_worthy_netflix_shows/"
    },
    {
        "id": "1k59vl0",
        "author": "Anxious_Attempt8656",
        "title": "Just watched season 7 of The Dragon Prince and honestly wtf was that??",
        "content": "The season just left me so confused, like what do you mean King Harrow was a bird all this time. Also I really dislike the romantic scenes between Rayla and Callum, I get that they are a couple but I don't need to see them kiss in every episode, it made me roll my eyes so much. I honestly hated that the last episode gave me nothing but more questions.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k59vl0/just_watched_season_7_of_the_dragon_prince_and/"
    },
    {
        "id": "1k58np5",
        "author": "OkOption2381",
        "title": "looking for what country has my show",
        "content": "Hello, i am trying to find out what country is streaming a specific drama called Accidentally in Love, which is a C-drama. as it no longer is on the American streaming.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k58np5/looking_for_what_country_has_my_show/"
    },
    {
        "id": "1k58h29",
        "author": "NoMacaroon5847",
        "title": "i hostage",
        "content": "Whats with the i hostage situation in this new netflix film? I mean theres only 1 perpetrator, and cameras are everywhere, clearly can see him and everything he does... so whats with the setup? Hahha. Is this how asterdam thinks terrorists setup their plan? Come on.. the police could have take him out easily... ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k58h29/i_hostage/"
    },
    {
        "id": "1k4azqt",
        "author": "no_wiz_hat_ho3",
        "title": "Bad Influence: The Dark Side of Kidfluencing",
        "content": "I have just got finished with watching this series. I am horrified. I’m only 18 myself and I feel sick just thinking about what these kids have had to endure. The manipulation. The lies. The cunning demeanour of Tiffany Smith. It’s all outrageous. How has a scandal of such great size been shoved down teen’s throats. \n\nInitially I had directed all my frustration towards Tiffany (the mother) but now I beginning to realise how sick household is.\n\nPiper Rockelle is most definitely a victim of pretty much anything you can think of. How child services have not stepped in is beyond me. \n\nI can see the pressure leading into her 18th birthday and we all know what turn folds. When she becomes of age, the exploitation will only skyrocket from there on out. \n\nMESSAGE TO PARENTS: GUIDE YOUR CHILDREN THROUGH HONEST AND MEANINGFUL CAREERS.",
        "upvotes": 71,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1k4azqt/bad_influence_the_dark_side_of_kidfluencing/"
    },
    {
        "id": "1k4v0jy",
        "author": "NoWhereNorth-II",
        "title": "Netflix MTV",
        "content": "\nWho would be in favour of having high quality music videos with high res audio on Netflix? Maybe produced by Netflix. \nThink of it as super charged MTV (genX would relate).\n",
        "upvotes": 4,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1k4v0jy/netflix_mtv/"
    },
    {
        "id": "1k55z6z",
        "author": "Awkward-Egg-411",
        "title": "I cant seem to find shows that should've existed on Netflix",
        "content": "So I recently tried to rewatch Orb: On The Movements Of The Earth on Netflix for my free time. I tried to search it, but I cant seem to find it (mind you that Orb is available just a few days ago as far as I remember), and it reccomended me some random Animes that are totally different from what it usually reccomends. I tried to type Re:Zero to see if this is just Orb getting removed, but it still didnt show up. I even searched Tensura just to make sure, but same results and all. Does anyone know why this happened, and how to fix it? I dont think its a licensing problem",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k55z6z/i_cant_seem_to_find_shows_that_shouldve_existed/"
    },
    {
        "id": "1k4zg0c",
        "author": "Sassyed",
        "title": "Idk if this is a new idea or not?",
        "content": "What if Netflix content supported haptics on mobile phone, just like controller haptics on a PlayStation game?\n\nJust imagine feeling car rumbles, gunshots, and so much!!!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k4zg0c/idk_if_this_is_a_new_idea_or_not/"
    },
    {
        "id": "1k4skdb",
        "author": "Mirades96",
        "title": "Netflix brightens (maybe it dimms it for others with the same issue) the video when in fullscreen",
        "content": "So I'm on a Desktop PC and watch Netflix through the Edge browser.  \nMy monitor is an OLED (PG27AQDP).  \nWhen ever I enter fullscreen in Netflix, after the UI (playback bar and the age info) disappears the screen gets brighter after a few seconds.  \nIf I move my mouse (to bring back the UI) or if I go to window mode the brightness goes back to normal.  \nAfter the UI disappears again, it will get bright again after a few seconds.  \nIn window mode it stays normal.  \nThe black borders are not affected by the brightness change.  \nThe higher brightness is a huge quality loss, it is like a white/grey filter on top of the video and a lot of detail goes missing.\n\nOnly happens on my OLED monitor, doesn't happen on my older LCD monitor.  \nOnly happens with Hardware Acceleration on. (But that is needed for the DRM/HDCP shizzle, so Netflix allows to play higher quality than 1080p)  \nOnly happens on Netflix (tested Disney+ and YouTube).  \nHappens with and without a second monitor connected. (which pretty much means it happens with and without HDCP 2.2)  \nHappens with HDR on and off.  \nHappens with monitor brightness 0 to 100.  \nHappens with monitor setting \"Uniform Brightness\" on and off.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k4skdb/netflix_brightens_maybe_it_dimms_it_for_others/"
    },
    {
        "id": "1k4rytr",
        "author": "worldsbestbrat",
        "title": "movie similar to the After film series and Culpa Mia",
        "content": "im about to lose my mind i just saw the trailer on netflix i think and now its as if its been scrubbed from the internet.\n\nmovie is in english. title has three words maybe?? my mind is telling me the movie title has something to do with fire or burning… idki could be wrong😑 the main character girl is caucasian, has dirty blonde/blonde hair, pouty lips. the guy is also white has short buzzed dark hair shit eating grin and hes taller than her. there is a sequel to it! i really dont remember too much of the plot because i only watched the trailer. they sleep together and he does something incredibly shitty to her if i remember. he is the bad boy type and i think its set in college. the second movie is after he does the shitty thing and he is taunting her and shes trying to get revenge maybe?? i only watched the trailer once or twice. PLEASE HELP OR I GO CRAZY😭🤬🫠 thank u",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k4rytr/movie_similar_to_the_after_film_series_and_culpa/"
    },
    {
        "id": "1k4rmav",
        "author": "Most_Comb_1879",
        "title": "Trying to find a movie",
        "content": "Its about a group of teen friends who created a comic together and try to get it published through a contest by going to a cosplay convention/comic con. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k4rmav/trying_to_find_a_movie/"
    },
    {
        "id": "1k4r7ub",
        "author": "NoCoStream",
        "title": "Best Character Development",
        "content": "I love series that develop strong leading and supporting characters. It’s a gift from good writers and directors. Some of the shows that did it well were Breaking Bad, Better Call Saul, Yellowstone, 1883 and 1923. What are your favorite shows that did a great job of character development?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1k4r7ub/best_character_development/"
    },
    {
        "id": "1k4al5h",
        "author": "throwRA-war",
        "title": "I struggle finding shows",
        "content": "Hi , I'd like a few suggestions on what to watch. Im not exactly sure what genre i like but I'll list shows I really enjoyed \n\nLucifer, the prodigal son , the mentalist,  the good doctor, the resident,  the big bang theory, the calling(on showmax though) , suits , bridgerton, queen Charlotte , the Lincoln lawyer,  harrow,  will trent, Wednesday \n\nThank you",
        "upvotes": 9,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1k4al5h/i_struggle_finding_shows/"
    },
    {
        "id": "1k48gty",
        "author": "wibble1234567",
        "title": "The decline of quality content on streaming services",
        "content": "A decade or more ago there were only a small number of platforms, e.g. netflix, Amazon. \nThen when Disney for example decided they wanted their own platform, along with a dozen other companies, it resulted in a hugely diluted market place where no one or two subscriptions can provide any meaningful breadth of content that existed back then. \nYet each of the subscription options offer about 10-20% of the content that Netflix and Amazon used to, but still think it's appropriate to charge £10-15 a month.\n\nFor me, this did not result in any improvements as a consumer but represented potential increases from &lt;£20 a month to &gt;£50 a month, which I wasnt willing to spend on 5-6 subscriptions.\n\nI occasionally run an Amazon sub under student pricing and cancel it the second the content I wanted it watched. \n\nSomething else I found frustrating is having to scroll through pages of foreign content or even worse, foreign content that's not obviously foreign until you press play and see/hear the awful dubbing. \n\nI'm looking at you netflix, using foreign content to supplement your lack of new content over the past few years.\n\nI would suggest they have options to filter content in the same way you can by age rating or content type only selecting your preferred language it was filmed in, sifting out any content not in your preferred language or dubbed content if that's your preference. \n\nAt this stage, if that option ever appears I suspect it would be behind a pay wall.",
        "upvotes": 13,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1k48gty/the_decline_of_quality_content_on_streaming/"
    },
    {
        "id": "1k4gtad",
        "author": "MysteriousDelay6266",
        "title": "Bet | Official Trailer | Netflix | MAY 15",
        "content": "",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k4gtad/bet_official_trailer_netflix_may_15/"
    },
    {
        "id": "1k4ndot",
        "author": "Brief-Worker-5331",
        "title": "The Ps5 app is bugged?",
        "content": "This started happening all of a sudden today and the help chat people don’t understand the issue and keep blaming the internet connection which is absurd because I kept telling them everything works perfectly and the show banners and previews works until these blank spaces appear and there are soo many of them before I reach the start of this row. And this happens on every row of recommendations and even at My List row which proves that it is not my internet but the Ps5 app is bugged…",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1k4ndot/the_ps5_app_is_bugged/"
    },
    {
        "id": "1k4mb9d",
        "author": "ssskirito",
        "title": "need 4k and atmos without external device",
        "content": "I’m running a Valerion VisionMaster Pro 2 (4K UHD projector with Google TV built-in), connected to my Yamaha RX-V6A via eARC. I’ve got the Netflix Premium plan, and while I do get Ultra HD content, I can’t seem to get Dolby Atmos only 5.1 audio shows up.\n\nHere’s where it gets weird: when I switch over to Netflix on my Windows laptop, the receiver actually does switch to Atmos (shows up right on the front panel), but the video quality is kinda trash because the app doesn’t handle 4K well.\n\nI’ve already made sure passthrough and eARC are enabled on the projector, so everything seems set up correctly on paper.\n\nSo now I’m wondering is this a known issue with the Netflix app on Google TV, or could there be something off in my setup? And most importantly… is it even possible to get both 4K and Dolby Atmos on a projector setup like this without needing an external streaming device?\n\nWould love to hear if anyone’s cracked the code on this. Appreciate any tips or ideas! 🙏",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k4mb9d/need_4k_and_atmos_without_external_device/"
    },
    {
        "id": "1k4k1oj",
        "author": "True-Ad-8253",
        "title": "Is the D&amp;D movie not available on Netflix anymore?",
        "content": "Hello. I wanted to rewatch the DnD movie as its quite a comfort movie for me. However as I went to Netflix, I couldnt find it anywhere. I had to look for it on Google only to see the option to set a reminder. I'm a bit bummed. I cant find anywhere if it got removed so I'm a bit confused. I'm in Spain, maybe it got removed here?\n\nhttps://preview.redd.it/4729kw6498we1.png?width=927&amp;format=png&amp;auto=webp&amp;s=be137186089995a4769a467306c5aa06bc94c16d\n\n",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1k4k1oj/is_the_dd_movie_not_available_on_netflix_anymore/"
    },
    {
        "id": "1k4jaim",
        "author": "Any-Definition-2741",
        "title": "Problème connexion",
        "content": "Good morning,\n\nQuick question, my friend wanted to subscribe to Netflix and there I noticed that the offer is already subscribed via her orange box. A premium offer with profiles blocked by a pin code and the screen is in Spanish… In fact, the offer has been active for a few months without their consent. \nPlease note that when you wish to modify or cancel your subscription, the premium offer is even reactivated with a confirmation message. \n\nHow is this done? What should I do? I think it's a hack...\n\nThanks in advance ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k4jaim/problème_connexion/"
    },
    {
        "id": "1k4j2os",
        "author": "crazedfishuk",
        "title": "Search by age rating?",
        "content": "Does anyone know the logic why Netflix won’t let us by age rating? It would massively help parents find a movie if we could filter movies by “12” or “PG”! ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k4j2os/search_by_age_rating/"
    },
    {
        "id": "1k4c4wy",
        "author": "Legitimate_Ad3625",
        "title": "Pride &amp; Prejudice director reveals writer Emma Thompson improvised much-memed 'no money, no prospects' speech",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k4c4wy/pride_prejudice_director_reveals_writer_emma/"
    },
    {
        "id": "1k4pahf",
        "author": "campionmusic51",
        "title": "PS5 netflix app suddenly broken",
        "content": "on every row, only the titles at the start of every row are loading. the ones you can see immediately on the browse page. when you scroll right, every title that follows is grey, not loaded and will not play. every single row. i have deleted/reinstalled. internet is fine. other streaming services work fine. the titles that do load on my PS5 netflix app play fine all the way through. they are all at the start of the category row. you can scroll two full shoulder button scrolls right, then the rest are grey. anyone else? i see somebody a little further down this sub has the exact same problem, also on PS5. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k4pahf/ps5_netflix_app_suddenly_broken/"
    },
    {
        "id": "1k4g0s9",
        "author": "Creativedog1079",
        "title": "Peplum shows",
        "content": "Hi everyone, I wanted to ask for some recommendations for a new show to watch. I'm a big fan of peplum shows — my favourites are Vikings and The Last Kingdom. I've also watched Knightfall.\nDo you have any recommendations for similar shows? It's important that they don't have any fantasy elements, like Game of Thrones or similar.\n\nP.S. I'm Italian, if that matters for availability of shows",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k4g0s9/peplum_shows/"
    }
]