[
    {
        "id": "1n5koa1",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 20,
        "comments": 356,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5koa1/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1n51lo0",
        "author": "scoreboard-app",
        "title": "[Match Thread] DUX Logroño - Real Madrid Femenino | Liga F, Matchday 1",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1n51lo0)",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n51lo0/match_thread_dux_logroño_real_madrid_femenino/"
    },
    {
        "id": "1n6bz6n",
        "author": "EffectiveTie3144",
        "title": "OTD September 2nd 2013, Gareth Bale was presented at the Santiago Bernabéu as a new Real Madrid player.",
        "content": "",
        "upvotes": 270,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6bz6n/otd_september_2nd_2013_gareth_bale_was_presented/"
    },
    {
        "id": "1n5tyk1",
        "author": "zains43",
        "title": "Deadline day as a madrid fan",
        "content": "",
        "upvotes": 1102,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c2k7nub62lmf1.jpeg?auto=webp&amp;s=c61e7e978b3a8c8521e28e9fcc8c929c349852aa"
        },
        "permalink": "/r/realmadrid/comments/1n5tyk1/deadline_day_as_a_madrid_fan/"
    },
    {
        "id": "1n5up1w",
        "author": "SeamenMobster",
        "title": "Xabi convincing Rodrygo to stay and challenge Vini for his position will end up one of the most important decisions by end of season.",
        "content": "Now that the market is closing and we can confirm that Rodrygo is staying (at least till Jan), I want to point out how important it is to have 2 world class wingers fight for the same position. They should push each other's level beyond what being a guaranteed starter can get you and WE WILL BE HERE FOR IT!",
        "upvotes": 344,
        "comments": 78,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5up1w/xabi_convincing_rodrygo_to_stay_and_challenge/"
    },
    {
        "id": "1n5jcrv",
        "author": "RecognitionPrudnt12",
        "title": "Players with most champions league titles.",
        "content": "",
        "upvotes": 1452,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/krlnnn0zlimf1.jpeg?auto=webp&amp;s=a83337a99016cd0ace9db82413e87e90eaa6f352"
        },
        "permalink": "/r/realmadrid/comments/1n5jcrv/players_with_most_champions_league_titles/"
    },
    {
        "id": "1n6a5my",
        "author": "clantz8895",
        "title": "Let's talk about it one of the most underrated players of the three peat era. It is Isco",
        "content": "I would have posted a picture too but it got removed. Isco was fundamental for like 4 years straight. One of the best footballers and I know people appreciate him at Betis but wow was this dude something else. I feel bad for anybody who didn't get to see his peak. Dude was doing shit only a handful of players can. Go watch his highlights and tell me he is not one of the most technical footballers of all time",
        "upvotes": 39,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6a5my/lets_talk_about_it_one_of_the_most_underrated/"
    },
    {
        "id": "1n5ox8l",
        "author": "Plane_Outside5646",
        "title": "Fede valvarde / Tchoumeni",
        "content": "When Bellingham returns, I think our midfield balance needs adjusting. If we play with 3 midfielders, we shouldn’t start both Valverde and Tchouaméni together since neither is very comfortable on the ball. Instead, we should pair Bellingham and Arda Güler for control and creativity, with either Valverde or Tchouaméni alongside them for ball-winning. Bellingham should play as a CM, while Güler plays higher up as the AM to avoid being bullied physically deeper. This setup gives us both ball control and defensive stability. However, if we go with a 4-man diamond, then both Valverde and Tchouaméni can fit in",
        "upvotes": 171,
        "comments": 154,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5ox8l/fede_valvarde_tchoumeni/"
    },
    {
        "id": "1n5me0t",
        "author": "Aggressive-Row-4489",
        "title": "Who will be sacrificed after bellingham returns?",
        "content": "After our back to back wins, i have been thinking about our lineup after bellingham comes back from the injuries. Ideally, i think the best lineup we would have at our disposal is the current defense, midfield of tchoumeni, valverde and Arda and an attack of Bellingham, Mbappe and Vini. I think that playing Bellingham in the central role would be perfect for our team to utilize those dangerous crosses from Trent(we don't have any attackers in the box when we cross) . Also, bellingham can play as a CM when arda or valverde is pushing high. Mbappe being Mbappe will thrive on either side of the wing and we also know what vinicius is capable of when he is in form . Also when we play a high pressing team , we can switch Arda for Ceballos as the closet player we have that is press resistant and control the tempo is him.  There are so many qualities and depth right now in our team I fear there will be problems in the dressing room due to the lack of playing time once everyone is fit. What do you guys think?",
        "upvotes": 102,
        "comments": 99,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5me0t/who_will_be_sacrificed_after_bellingham_returns/"
    },
    {
        "id": "1n5imc7",
        "author": "Lekanswanson",
        "title": "This season, tactically wise, performance wise so far has been way more enjoyable than any match last season",
        "content": "This post isn't to shit on Ancelotti, he was a fantastic manager for us and helped stabilize the cup and brought plenty of silverware and I will forever be grateful for that.\n\nWhat I will say is this season even though its obvious the team is still adapting to Xabi's instructions and playstyle and with the a lot of new additions to the team, it feels like for the first time in a long time, I am enjoying watching realmadrid actually play again. \n\nFor a long time it felt like I was watching because I had to watch it and there was no inspiration watching the team play and the only thing that mattered was the end result and while the results are truly the most important thing, as fans that is not what inspires us to start supporting the team and become lifelong fans.\n\nI want to sit down and watch a madrid game with excitement, expectations and enjoyment and I think Xabi is bringing that back slowly. The little intricate plays in tight spaces, the runs, the passing, movement and swagger this club has been known for feels like it's coming back and that was show in the marcelo like passing from Trent, the Ronaldo like chop from Vini and the ramos esque passing from Dean. \n\nThe results are obviously vital and very important but I urge the fanbase to give Xabi and the players time, let them cook and to support them when they eventually struggle but I believe sooner rather than later we will become a dominant force again.\n\nHala Madrid!",
        "upvotes": 131,
        "comments": 31,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5imc7/this_season_tactically_wise_performance_wise_so/"
    },
    {
        "id": "1n5jx7o",
        "author": "InsideCastilla",
        "title": "There is no better time to join the new Real Madrid Castilla sub! We are almost at 100 members",
        "content": "Every top Madridista should be taking an active interest in Castilla and the academy to fully understand how the club operates, and who their next big stars may be. Come and join us!",
        "upvotes": 64,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5jx7o/there_is_no_better_time_to_join_the_new_real/"
    },
    {
        "id": "1n52ekn",
        "author": "RecognitionPrudnt12",
        "title": "A new legend is here 💎",
        "content": "Thank you Real Madrid for this true master. Dean Huijsen is showing great signs for being one of Real Madrid legends . He will make history here . We can see it and feel it with every touch , pass , tackle he makes. The difference line is more ensuring and subtle with him in the field.\nWe are proud and happy to have a true master like him in our squad.\nHala Madeid",
        "upvotes": 826,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/s83qczpdgemf1.jpeg?auto=webp&amp;s=a99fd4d13162a909be7d9409027ca007c5c1191b"
        },
        "permalink": "/r/realmadrid/comments/1n52ekn/a_new_legend_is_here/"
    },
    {
        "id": "1n5wm3i",
        "author": "DapumaAZ",
        "title": "Espanyol date and time confirmation",
        "content": "Now that the Champions League Draw has been verified, how long is it going to take La Liga to firm up these dates and times for the Espanyol match ?  Right now the official sight has up to matchday 4 in the league and then matchday 1 and 2 for the champions league \n\n  \nla liga matchday 5, 6, and 7 all say date and time to be confirmed",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5wm3i/espanyol_date_and_time_confirmation/"
    },
    {
        "id": "1n4sfzl",
        "author": "No-Independent2522",
        "title": "The best signing this summer?",
        "content": "",
        "upvotes": 2207,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xdqs9qbcdcmf1.jpeg?auto=webp&amp;s=7ce989639e68ec27ed0a3064b7537bc42eb7c543"
        },
        "permalink": "/r/realmadrid/comments/1n4sfzl/the_best_signing_this_summer/"
    },
    {
        "id": "1n562um",
        "author": "FrrancondonaEra",
        "title": "Francadona highlight from last game",
        "content": "",
        "upvotes": 383,
        "comments": 100,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bltuu20h6fmf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n562um/francadona_highlight_from_last_game/"
    },
    {
        "id": "1n60e8p",
        "author": "Defiant_Health3469",
        "title": "Jornada 19-21 Septiempre",
        "content": "Guys, the match against Espanyol, it says it will be on Sunday 5pm (it says all la Liga games will take place at that time). Is that true or is this still something like a “placeholder” and will change eventually? We are in Madrid that weekend and would want to see the match. Thanks in advance. Oh and one of our mates would wear the Barca jersey, so both fans will hate him 😁",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n60e8p/jornada_1921_septiempre/"
    },
    {
        "id": "1n4vzjo",
        "author": "Fit_Advice_1919",
        "title": "Trent can be the kroos replacement",
        "content": "",
        "upvotes": 832,
        "comments": 89,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vawvye4p6dmf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n4vzjo/trent_can_be_the_kroos_replacement/"
    },
    {
        "id": "1n5kdh5",
        "author": "Massive_Resource6410",
        "title": "Translation of the song “Cibeles” by Sergio Ramos",
        "content": "So, our beloved captain Sergio Ramos has published a song called Cibeles: \n\nhttps://youtu.be/TU0AxQ2of7I?si=SkxOo9iKtHw6CFtW\n\nHere’s the translation of the lyrics (by ChatGPT):\n\n\n[Intro]\nThere are things I never told you\nThat still hurt me\nI never wanted to leave\nYou asked me to fly, woh-uoh-oh\nYou asked me to fly, uh-oh\nYou asked me\n\n[Verse 1]\nI would’ve killed for you, I loved you and I defended you\nBut it wasn’t within me\nYou asked me to fly\nI dressed up in gala, I gave you blood and sweat\nI enjoyed you and I suffered you\n\n[Chorus]\nI hope it goes well for you\nEven though without you I feel bad\nGood thing I walked away\nBecause you didn’t treat me the same\nYou loved me and I loved you\nBut someone always gives more\nIt was all just as I dreamed\nUntil it was time to wake up\n\n[Verse 2]\nI gave you a crown, you gave me wings\nI didn’t know they were only so I’d fly away\nAnd I look at you now, you’re still just as beautiful\nNobody is indispensable, life teaches you that\nA match lasts 90’, and I gave you ninety-three more on top\nI never got tired of trying, this story was a legend\nI’d rather die on my feet than live on my knees\nI’ll give my heart even if it’s returned to me damaged\n\n[Chorus]\nI hope it goes well for you\nEven though without you I feel bad\nGood thing I walked away\nBecause you didn’t treat me the same\nYou loved me and I loved you\nBut someone always gives more\nIt was all just as I dreamed\nUntil it was time to wake up\n\n[Outro]\nO-O-Ovy On The Drums\nYou forgot about me, you left me aside\nWithout being able to decide, that’s what hurts the most\nAnd even though it was like that, I’d come back delighted\nOnce and up to a thousand times\nAnd you know it, Cibeles, uh-oh-oh\nAnd you know it, Cibeles, uh-oh\nAnd you know it, Cibeles",
        "upvotes": 23,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4FMtgzaYD-MysbE5v-UUbwnoRbWkx_f-6HwX2gL5uUo.jpeg?auto=webp&amp;s=7f196576b1da185b195f2dfd00c0af4150e3e3f8"
        },
        "permalink": "/r/realmadrid/comments/1n5kdh5/translation_of_the_song_cibeles_by_sergio_ramos/"
    },
    {
        "id": "1n4xlbv",
        "author": "ReplacementUnited740",
        "title": "Our young goat's placements when he doesn't have the ball",
        "content": "The video criticizes the lack of decision and his lack of offensive effort without the ball.\n\nI think it's because of Mbappe's goalscoring instinct.  During the whole action he only thought about how he could score a goal himself.He was waiting for Vini to pass to the left so he could receive a cross and score.You don't score so many goals without having a great goalscoring instinct (32 goals in 35 matches is incredible).\n\nBut the problem is that he didn't think for a second that he wasn't the other 4 options during the counterattack:\nIf he had made a call to the left it could have created space for the player on the right \nIf he made a call to the right it would have created space for the player on the left \nIf he makes a call at the start of the action (vini seemed to be waiting for that) he could have been served in depth \nOr even Vini could have had plenty of space if the defenders misunderstood each other during Mbappe's deep run. \n\nI guess he thinks like that because he was often the only serious attacking option at PSG (Neymar was very often injured and Messi scored 7 goals during his first season at PSG) It would be good for the team if he made more offensive effort without the ball, I mean vini's goal is almost lucky (his luck = talent)\n\nAnd a question for the moderators: is it forbidden to make posts to talk about tactics outside of live matches? I mean one of my posts was deleted for no reason even though I just talked about tactics and was respectful/didn't insult anyone/no swear words/nothing +18\n\nIf it's forbidden for you, it would be cool to remove the ban, We always get better football analyses when we're not in the emotion of the live match.",
        "upvotes": 355,
        "comments": 72,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/przvl1h2idmf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n4xlbv/our_young_goats_placements_when_he_doesnt_have/"
    },
    {
        "id": "1n5mxuc",
        "author": "Enough_Impress23",
        "title": "Bernabeu Tour Dates?",
        "content": "Hi Madridistas!!\nI’m going to Madrid on September 20th to watch the game on the 21st.\nI also want to do a tour of the stadium, so I’m thinking what date to go. I’m arriving late on the 20th so that’s not an option.\nIs it better to go on the 21st early (matchday) or a day after? I’d like to see the grass on the pitch so I’m not sure when it’s on, do they remove it a day after the match, is there a lot of work on the dates around the matchdays. What are your suggestions? Any other tips?\nThanks!!!",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5mxuc/bernabeu_tour_dates/"
    },
    {
        "id": "1n4ogwe",
        "author": "Ready_Ad_1353",
        "title": "Alternate angle of Vini Jr's goal",
        "content": "",
        "upvotes": 953,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/s2hertqb4bmf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n4ogwe/alternate_angle_of_vini_jrs_goal/"
    },
    {
        "id": "1n4fcka",
        "author": "Miserable-Subject-87",
        "title": "Alvaro Carreras! What a player!",
        "content": "",
        "upvotes": 3045,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qwz8dq1zn8mf1.jpeg?auto=webp&amp;s=d25e926097c2eaeb8b299c48b5723ad0474082ee"
        },
        "permalink": "/r/realmadrid/comments/1n4fcka/alvaro_carreras_what_a_player/"
    },
    {
        "id": "1n4tp10",
        "author": "No-Independent2522",
        "title": "Bernabeu before kick off 🤍",
        "content": "",
        "upvotes": 243,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9ihxxtvrocmf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n4tp10/bernabeu_before_kick_off/"
    },
    {
        "id": "1n52m0t",
        "author": "absessive",
        "title": "Sergio Ramos- Cibeles",
        "content": "YouTube link https://youtu.be/TU0AxQ2of7I?si=2aUeWLzWwduDAyJd\n\nThe lyrics paint a picture of a forced departure. Clearly he’s still harboring some hard feelings against Florentino (and the club). \n\nGood first time video and he’s clearly put Madrid above anything else or he’s just using the popularity of the club for more views. ",
        "upvotes": 76,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4FMtgzaYD-MysbE5v-UUbwnoRbWkx_f-6HwX2gL5uUo.jpeg?auto=webp&amp;s=7f196576b1da185b195f2dfd00c0af4150e3e3f8"
        },
        "permalink": "/r/realmadrid/comments/1n52m0t/sergio_ramos_cibeles/"
    },
    {
        "id": "1n5k708",
        "author": "Striking_Mastodon489",
        "title": "Tattoo ideas related real madrid",
        "content": "I am thinking about getting a tattoo and i thought to have a real madrid tattoo give me some small minimal tattoos suggestions which are unique i need atleast 300 words soo i am just gonna paste a chatgpt coded para for rest of the words \n\n\n\nFirst post here so be nice lol.\n\nYo Madridistas, I’ve been thinking about getting my first tattoo and honestly the only thing that feels right for me is something related to Real Madrid. I don’t really want to risk a design I’ll regret later, and since this club has been a huge part of my life, it feels like the safest choice.\n\nI don’t want a big detailed crest or anything too flashy — more like minimal black ink, something simple but meaningful. I’ve been playing around with a few ideas:\n\t•\tJust a crown outline, inspired by the one on the badge 👑\n\t•\tThe founding year in Roman numerals (MCMII)\n\t•\tA small football with a crown above it\n\t•\t“RM” in a clean font, maybe with a crown on top\n\nThe thing I like about these is they don’t scream “football tattoo” to everyone. Like, if someone doesn’t know, it just looks like a crown or some numbers. But for me, it will always be about Madrid — history, greatness, loyalty, and the club’s mentality of never giving up.\n\nPlacement-wise, I’m leaning toward inside forearm, wrist, or back of the arm near the elbow. Basically somewhere that’s not too loud but still visible when I want it to be.\n\nI’m curious what you guys think. If you had to pick one of these designs, which would you say has the most long-term value? Has anyone here already gotten a Real Madrid tattoo? If yes, do you still love it or does it feel different with time?\n\nWould love to see pics if anyone wants to share too. Just trying to make sure I lock in something I’ll be proud of forever",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n5k708/tattoo_ideas_related_real_madrid/"
    },
    {
        "id": "1n4poi8",
        "author": "NamanGeneral",
        "title": "One of the last Happy Memories of 3 Peat squad together",
        "content": "",
        "upvotes": 399,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0awjhb3fibmf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n4poi8/one_of_the_last_happy_memories_of_3_peat_squad/"
    },
    {
        "id": "1n54gaa",
        "author": "ManuMora98",
        "title": "[Fem] DUX Logroño 2 - 2 Real Madrid | Isina 40', OG. 77'; Maria 33', Bruun 93' | Disappointing draw against a newly promoted team in a game in which we struggled to create danger. Playing with a false 9 doesn't work.",
        "content": "",
        "upvotes": 38,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nf1qp7vwuemf1.jpeg?auto=webp&amp;s=f8015bfbc5df817b1b0535383fb52bf8f0b67782"
        },
        "permalink": "/r/realmadrid/comments/1n54gaa/fem_dux_logroño_2_2_real_madrid_isina_40_og_77/"
    },
    {
        "id": "1n4ja27",
        "author": "o6ohunter",
        "title": "Mbappè’s story on Instagram regarding the offside verdict",
        "content": "",
        "upvotes": 877,
        "comments": 186,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mx2qvw5um9mf1.jpeg?auto=webp&amp;s=82d1f3f36defc71c93a6eb77ec39873bc68dd845"
        },
        "permalink": "/r/realmadrid/comments/1n4ja27/mbappès_story_on_instagram_regarding_the_offside/"
    },
    {
        "id": "1n4d819",
        "author": "Ready_Ad_1353",
        "title": "Arda Guler is the Man of the Match",
        "content": "",
        "upvotes": 2002,
        "comments": 120,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8hw3cxur68mf1.jpeg?auto=webp&amp;s=151b0fbcbee294b8f57a899611ce5838bc151096"
        },
        "permalink": "/r/realmadrid/comments/1n4d819/arda_guler_is_the_man_of_the_match/"
    },
    {
        "id": "1n4qv7x",
        "author": "Effective_Captain611",
        "title": "MATCH REVIEW [vs. Mallorca - LaLiga] ⚪✨",
        "content": "⚪🎭 Madrid skim past Mallorca 2–1 in a game of fine margins!\n\nArda and Vini struck in quick succession to seize control, while Mbappé’s threat was constant, even if the flag denied him twice. Carreras kept the lead alive with a jaw-dropping goal-line clearance, and Tchouaméni quietly dictated midfield rhythm. Xabi’s plan worked early, though a shaky set-piece showed there’s still work to do. Cooling breaks turned sparks into goals, and the bench added energy when needed.\n\nA win earned, lessons noted, and sparks of brilliance all around.\n\nWe’ve broken down every performance, player by player.\n\nVini reached 100G/A for Madrid, who's next?\n\n\\- MadridNoir 🤍👑",
        "upvotes": 194,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n4qv7x/match_review_vs_mallorca_laliga/"
    },
    {
        "id": "1n4citi",
        "author": "No-Independent2522",
        "title": "Crucial save by carreras",
        "content": "",
        "upvotes": 2077,
        "comments": 59,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o5k0nmzc18mf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1n4citi/crucial_save_by_carreras/"
    },
    {
        "id": "1n6b06g",
        "author": "Available_Ad_6995",
        "title": "Are we benching Valverde when Jude returns?",
        "content": "Don’t get me wrong I like to see Valverde in the starting 11. However someone has to be benched in the midfield when Bellingham returns from recovery.\n\nLet’s leave out the left and right flanks, between Arda, Tchou , and Valverde, who has to give way for Bellingham?? \n\nIt’s def not Tchouameni, right? We need him in that CDM. \n\nI liked Arda in the last game for sure but he was just playing that attacking midfield Jude plays. However he brings a LITTLE more creativity and pass accuracy than Bellingham. \n\nValverde on the other hand plays as a holding midfielder and a box-to-box, both of these roles Bellingham excels at. \n\nAt the cwc there were some instances of Jude and Arda bickering, they both like to be involved in the game. So maybe they would sub for each other? Maybe a vini-rodrygo situation?but come on it’s Bellingham lmao he’s not subbing on for anyone but then again Xabi has shown no one is bigger than the program. \nIdk lmk what you guys think would happen. ",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/realmadrid/comments/1n6b06g/are_we_benching_valverde_when_jude_returns/"
    }
]