[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 493,
        "comments": 271,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j87k40",
        "author": "Internal-Bed-3150",
        "title": "Greta Gerwig wants Charli XCX in her Narnia movies",
        "content": "",
        "upvotes": 285,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1j87k40/greta_gerwig_wants_charli_xcx_in_her_narnia_movies/"
    },
    {
        "id": "1j8ivi0",
        "author": "Way-of-Kai",
        "title": "How do we feel about 3-4 years for subsequent seasons",
        "content": "On one hand I understand the time required to deliver quality work, but a decade to conclude a story is really exhausting. Like people just move-on in life and even stop caring about something they watched 5 years ago. \n\nOnce concluded it will obviously be looked back as a peak animation that redefined its genre. But it’s frustrating for us bunch waiting for it to come out.\n\nIt’s similar case as spiderverse films, just notice how much your life has changed between each film.",
        "upvotes": 26,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ivi0/how_do_we_feel_about_34_years_for_subsequent/"
    },
    {
        "id": "1j85l1m",
        "author": "Last_Weird0717",
        "title": "American Manhunt Osama bin Laden: Not coming up on my Netflix??",
        "content": "I'm in the US and had this on my list to watch for today. Now it's suddenly not showing up at all. Anyone else having this issue? I know the release date was today, March 10th. \n\n",
        "upvotes": 162,
        "comments": 309,
        "media": null,
        "permalink": "/r/netflix/comments/1j85l1m/american_manhunt_osama_bin_laden_not_coming_up_on/"
    },
    {
        "id": "1j8ebhl",
        "author": "cuzforwhy",
        "title": "Recommend Netflix shows or movies for a dental office",
        "content": "I work in a dentist office and I like to keep the tv in my operatory on, most of my patients are older folks and I need some Netflix shows or movies to play throughout the day that are appropriate and don’t have any awkward sex scenes or something, thank you.😂",
        "upvotes": 36,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ebhl/recommend_netflix_shows_or_movies_for_a_dental/"
    },
    {
        "id": "1j8rogr",
        "author": "United-Break-5156",
        "title": "Shows like With Love, Meghan?",
        "content": "If you didn't like the show, just keep scrolling. But it made me really happy and was just a sweet calming joyful show to watch, but I ran out of episodes! Can anyone recommend similar shows to try?\n\nTIA!",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1j8rogr/shows_like_with_love_meghan/"
    },
    {
        "id": "1j8owc5",
        "author": "Spider-ManWasTaken",
        "title": "What show am I thinking about?!",
        "content": "I remember I watched it 2023 and it was about two girl best friends, one of them dies, only the best friend can see the dead one and they have to figure out a bunch of stuff and there’s drama etc, I think it was one blonde and one brunette. It had a plot twist at the end as well.\n\nEdit: it was a limited series!",
        "upvotes": 4,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1j8owc5/what_show_am_i_thinking_about/"
    },
    {
        "id": "1j89yi7",
        "author": "Josh1923",
        "title": "American Manhunt: Osama bin Laden",
        "content": "Just spoke with support and they’re saying there’s no official release date. This is annoying ",
        "upvotes": 59,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1j89yi7/american_manhunt_osama_bin_laden/"
    },
    {
        "id": "1j8qawp",
        "author": "MysteriousDelay6266",
        "title": "The Lady's Companion | Official Trailer | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j8qawp/the_ladys_companion_official_trailer_netflix/"
    },
    {
        "id": "1j8ulk5",
        "author": "S4v1r1enCh0r4k",
        "title": "Cristin Milioti has joined the cast of Netflix’s ‘In Your Dreams’ alongside Simu Liu and Craig Robinson.",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ulk5/cristin_milioti_has_joined_the_cast_of_netflixs/"
    },
    {
        "id": "1j8tx2g",
        "author": "theTexans",
        "title": "Any documentaries or shows that focus on the Ukraine war?",
        "content": "Is there any content on Netflix or outside that focuses on the current ongoing war in Ukraine? Trying to get a better understanding of what is going on, the history behind it, and really, how did Russia turn out to be such a paper tiger after decades of fear mongering being the big bad wolf and their spectacular failure in Ukraine. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j8tx2g/any_documentaries_or_shows_that_focus_on_the/"
    },
    {
        "id": "1j8ly56",
        "author": "SquareDrive45",
        "title": "What is this DV5 Codec on some Netflix 4k SDR movies?",
        "content": "These are the \"information\" pages while streaming those movies on Netflix app on LG OLED TV. These are 4k SDR movies (i repeat NOT DV). Pulled up the info page for some other 4K movies as well and they say codec AV1 or HEVC, which are well known.\n\nBut what is this DV5 codec that netflix is using? Its own? A modified version of any other codec? Couldn't find any info on internet.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ly56/what_is_this_dv5_codec_on_some_netflix_4k_sdr/"
    },
    {
        "id": "1j8ttyt",
        "author": "Gabe_H_Cuod24",
        "title": "Manhunt: Osama Bin Laden still not available?",
        "content": "So I’ve been waiting for the new Manhunt documentary to drop. Said it was coming March 10. So yesterday morning I went to watch and it wasn’t popping up in my watch list. I searched and it came up as coming soon. So I waited and today is same thing. Does anyone know why it hasn’t dropped yet? Or have they had this experience with any other show? I never have… usually by midnight on date they say the show always drops.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ttyt/manhunt_osama_bin_laden_still_not_available/"
    },
    {
        "id": "1j8iab5",
        "author": "SoupDog99",
        "title": "No Dolby Vision Season 7 Drive to survive",
        "content": "Just finished watching Season 6 that worked flawlessly with Dolby vision (and still does after going back to check). Haven't changed a thing, but Season 7 of Drive to survive is not delivering Dolby vision and it's driving me nuts. \n\nAnyone have insight for why? \nGoing back and forth is night and day in quality. I am paying extra everything month for the best experience and I am not getting it.",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1j8iab5/no_dolby_vision_season_7_drive_to_survive/"
    },
    {
        "id": "1j8nr9o",
        "author": "lucivero",
        "title": "Netflix keeps lowering quality in Brave browser, refuses to work at all in another browser or the app",
        "content": "Heya,\n\n  \nBeen having these issues for a while now, and can't seem to find a permanent fix for them:  \nWhenever I play Netflix in Brave (Chromium based browser) the quality lowers repeatedly once every \\~10 seconds, the quality gets lowered every \\~10 seconds in this order:  \n1080 -&gt; 720 -&gt; 540 -&gt; 432 -&gt; 342\n\nThis is exclusively with Hardware acceleration disabled (which I have to have off more often than not as it causes other issues at times), and if there's a solution for the above where I can leave it off that'd be grand. I could live with having to relaunch the browser for this (probably) but would prefer a permanent fix that doesn't require this as it can be a bit of a pain and feels unnecessary.\n\n  \nAs for the other issue: \n\nI am completely unable to use Netflix in any other browsers or in the app:  \nThey will forcibly log me out upon starting a video, it doesn't even get to play a single frame, usually accompanied with an UI3012 error code, or it just hangs on the loading symbol and a black screen forever. I'm always logged out of the app/browser (Edge) no matter if I signed in 5 seconds before upon restarting it or even hitting the home button.\n\n  \nThe only thing I can come up with is that it's somehow related to being Windows 11 Pro N, but I couldn't find anything regarding that and Netflix having issues when I googled just now (googling for Windows 11 Pro N seems to basically ignore the N part). \n\nHardware acceleration enabled and disabled makes no difference for this issue.\n\n  \nHoping someone knows a fix for either or both of these issues!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j8nr9o/netflix_keeps_lowering_quality_in_brave_browser/"
    },
    {
        "id": "1j7yf42",
        "author": "EthanWilliams_TG",
        "title": "New trailer for the final season of ‘YOUʼ has been released",
        "content": "",
        "upvotes": 50,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1j7yf42/new_trailer_for_the_final_season_of_youʼ_has_been/"
    },
    {
        "id": "1j8iati",
        "author": "AggravatingShow2028",
        "title": "Beauty in Black—what!!!",
        "content": "So I’m late to the game but I just binged both parts of Beauty in Black and WHAT!! I need season 2 now! Idk what I was expecting but it had me up all night trying to finish. I love Charles btw.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j8iati/beauty_in_blackwhat/"
    },
    {
        "id": "1j8n21s",
        "author": "brownniteowl_31",
        "title": "Funny shows on Netflix",
        "content": "Need recommendations for the days I’m too tired to socialize or come to the phone \nNothing overly vulgar please \nLove anything that’s animated but not picky ",
        "upvotes": 1,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1j8n21s/funny_shows_on_netflix/"
    },
    {
        "id": "1j8mhox",
        "author": "Robemilak",
        "title": "Geeta Gandbhir’s 'The Perfect Neighbor' to Release on Netflix in 2025",
        "content": "* **Director and Producer:** Emmy® Award winning filmmaker Geeta Gandbhir (*Lowndes County and the Road to Black Power, Black and Missing*)\n* **Producers:** Alisa Payne, Geeta Gandbhir and Nikon Kwantu for Message Pictures,  and Sam Bisbee for Park Pictures.\n* *The Perfect Neighbor* is a Message Pictures Production in association with SO'B Productions and Park Pictures.\n* **Executive Producers**: Sam Pollard for Message Pictures, Soledad O'Brien and Rose Arce for SO'B Productions, Jackie Kelman Bisbee and Wendy Neu for Park Pictures and Takema Robinson.\n* **Editor**: Viridiana Lieberman\n* **Logline**: A seemingly minor neighborhood dispute in Florida escalates into deadly violence. Police bodycam footage and investigative interviews expose the consequences of Florida’s “stand your ground” laws.\n* The film had its World Premiere at the 2025 Sundance Film Festival where it was awarded the Directing Award: U.S. Documentary. It is also an Official Selection at the SXSW Film Festival, CPH:DOX and the Miami Film Festival.\n* **Quote from Director Geeta Gandbhir**: “*The Perfect Neighbor* is a deeply personal project, created to transform grief into purpose and honor the lasting legacy of Ajike Owens and her family. My team at Message Pictures, along with our incredible partners at S’OB Productions and Park Pictures, are thrilled the film will be available on Netflix, offering audiences worldwide the chance to experience this urgent and powerful story.”",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j8mhox/geeta_gandbhirs_the_perfect_neighbor_to_release/"
    },
    {
        "id": "1j8k70t",
        "author": "TheGame81677",
        "title": "Why is Netflix censoring Monday Night Raw?",
        "content": "I watch Raw almost every week and there’s always some kind of censorship. Tonight I am watching the match between C.M Punk and Seth Rollins. They both gave the finger to one another and the screen went black for a few seconds. You could still kind of see it though. They also bleep if anyone says the F word. Why is anything being censored at all? This isn’t network tv, it doesn’t make any sense.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j8k70t/why_is_netflix_censoring_monday_night_raw/"
    },
    {
        "id": "1j80met",
        "author": "strawberrycheescak",
        "title": "Netflix only has the same crime shows/movies but with the plot worded differently",
        "content": "I was looking for a thriller yesterday and all I  could find that I didn’t watch were those crime movies where someone goes missing and their family member has to find them or save them. Every 5th movie I pressed on was like that and it was the same plot but worded differently. I feel like it happens also with tv shows like why do they keep on doing that? Can’t they release shows/movies with a different plot? Maybe it depends on the countrys content but its all I ever see on netflix when looking for shows/movies or thrillers. ",
        "upvotes": 15,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1j80met/netflix_only_has_the_same_crime_showsmovies_but/"
    },
    {
        "id": "1j7ji2j",
        "author": "WhileZestyclose2413",
        "title": "Any feel good happy shows to watch on Netflix?",
        "content": "I struggle with depression and anxiety and I was looking for a happy and feel good show to watch to help me wind down and relax. Nothing too old please. ",
        "upvotes": 227,
        "comments": 365,
        "media": null,
        "permalink": "/r/netflix/comments/1j7ji2j/any_feel_good_happy_shows_to_watch_on_netflix/"
    },
    {
        "id": "1j86py5",
        "author": "Affectionate_Mess488",
        "title": "What have we missed?",
        "content": "My husband and I had a baby a year and a half ago so we haven’t had any time for TV. We’re finally getting some quiet time at night so would love a new show to watch. What are some good shows we missed over the last year or two that are worth catching up on? We love $ or crime documentaries (I.e Tinder Swindler, Wild Wild Country) and drama shows (Peaky Blinders, Lincoln Lawyer, Ozark, Crown).",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1j86py5/what_have_we_missed/"
    },
    {
        "id": "1j810o1",
        "author": "Crazy_Ad_1545",
        "title": "Running Point - Jackie and the Cheerleaders",
        "content": "Is anyone else curious why all the cheerleaders want to sleep with Jackie? They were pissed at him at first for cutting them in lieu of Red Panda. No shade to the actor, but he's not particularly good looking or alluring. Is it just because they realized he's a Gordon?",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j810o1/running_point_jackie_and_the_cheerleaders/"
    },
    {
        "id": "1j8rb42",
        "author": "Wooden_Pin_8612",
        "title": "Love is blind NEEDS to change",
        "content": "I don’t feel like they are doing the contestants any favors in the show\n\nI don’t like how they let them interact with one another the guys should be confined to their pods while the girls should be able to talk to each other. \n\nThey should also not be able to choose dates with the men. The men should have no contact with the world only waiting for the women to choose a date with them for a week or 2. \n\nI wouldn’t be opposed to them adding a food aspect to it where they make them eat too much food and then make them go on the date so they are tired and possibly don’t feel good. \n\nThis is the real problem with love is blind. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1j8rb42/love_is_blind_needs_to_change/"
    },
    {
        "id": "1j84vwi",
        "author": "Fast-Discussion6538",
        "title": "Netflix Recommending My Watch History to Other Profiles?",
        "content": "Hi!♥\n\n I recently added two more Netflix profiles to my account for my parents. While explaining to them how to use the app, I noticed that Netflix is recommending movies and series that I have watched or am currently watching.\n\nI still don’t really want them seeing my watch history in their recommendations. \n\nI thought profiles were supposed to be separate, so I have no idea why this is happening.\n\nIs there a way to turn this off? Or is this just how Netflix works? Any advice would be appreciated!",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j84vwi/netflix_recommending_my_watch_history_to_other/"
    },
    {
        "id": "1j8d6w7",
        "author": "Flyfishskier",
        "title": "Any way to bypass household restrictions on macbook browser?",
        "content": "title basically says it all. I know of the airplane mode for mobile apps and it works but since I mainly watch on my MacBook I cannot figure a bypass out. VPNs have never worked for me. Pretty crazy how long I had my browser working compared to my app, but now its gone unfortunately. Anybody have any solutions?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j8d6w7/any_way_to_bypass_household_restrictions_on/"
    },
    {
        "id": "1j82128",
        "author": "ArmChairDetective84",
        "title": "Different series with the same name",
        "content": "So I started to watch La Reina del Sur a few days ago and it started with her being captured then later on in the episode the prison break BUT now , the first episode is completely different …instead of showing her being arrested and Landero coming to visit her at a Colorado Federal Prison - it’s all about her life before she was arrested. \n\nI wanted to re watch the prison scenes because the way she broke out was badass but it seems to have disappeared ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j82128/different_series_with_the_same_name/"
    },
    {
        "id": "1j8biaa",
        "author": "mikestergame01",
        "title": "Force highest quality for whatever I'm watching on netflix?",
        "content": "Is there a way to force 4k or whatever the highest quality of the video you're watching on youtube?  On windows 11 what's the best way to watch netflix in a browser or using the app?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j8biaa/force_highest_quality_for_whatever_im_watching_on/"
    },
    {
        "id": "1j7uo3r",
        "author": "Robemilak",
        "title": "Alan Ritchson Hypes That His Next Film Will Be \"The Biggest Movie Netflix Has Ever Had\"",
        "content": "",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j7uo3r/alan_ritchson_hypes_that_his_next_film_will_be/"
    },
    {
        "id": "1j7okbt",
        "author": "Odd-Network-3005",
        "title": "Tell me 8 shows that you liked too much",
        "content": "From netflix\n\n🙂 mines in no specific order:\n\n1)a series of unfortunate events\n2)the oa\n3)arcane\n4)The order\n5)archive 81\n6)dark\n7)death love robots season 3\n8)my name (korean)\n\n",
        "upvotes": 25,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1j7okbt/tell_me_8_shows_that_you_liked_too_much/"
    }
]