[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 50,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1reng13",
        "author": "RiskAndReason",
        "title": "What’s that one Netflix show you think is an absolute must-watch?",
        "content": "The kind where you’d say, “I can’t believe you haven’t seen this yet.”\n\nLooking for something great to start next, classics or hidden gems both welcome.",
        "upvotes": 421,
        "comments": 892,
        "media": null,
        "permalink": "/r/netflix/comments/1reng13/whats_that_one_netflix_show_you_think_is_an/"
    },
    {
        "id": "1recvyj",
        "author": "monroe099",
        "title": "Is there any way to hide movies that I already watched?",
        "content": "Netflix needs to stop recommending me the same movies I’ve already watched like I don’t pay a subscription to discover something new 😭 Is there any way to stop seeing these on my main page please ?  It takes me longer to find something to watch than to actually watch a movie.",
        "upvotes": 195,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1recvyj/is_there_any_way_to_hide_movies_that_i_already/"
    },
    {
        "id": "1retwvf",
        "author": "onlysummerxoxo",
        "title": "I just finished Night Agent, anyone have anymore good recommendations?",
        "content": "I’ve seen all the super popular shows like Waterfront , Lincoln Lawyer &amp;&amp; His &amp;&amp; Hers. I was just wondering if anyone had anymore recommendations. I need something binge worthy lol.",
        "upvotes": 18,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1retwvf/i_just_finished_night_agent_anyone_have_anymore/"
    },
    {
        "id": "1ren0gz",
        "author": "anjilleea",
        "title": "How to get to heaven from Belfast",
        "content": "Just finished this mini series and LOVED it. It was oddball quirky in all the right ways. Created by the same woman who made Derry Girls which I also loved (maybe I’m just a sucker for N Irish accents and humour?!?). ",
        "upvotes": 41,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ren0gz/how_to_get_to_heaven_from_belfast/"
    },
    {
        "id": "1reylt7",
        "author": "TheOttomanJanissary",
        "title": "Hot take: Marco Polo walked so Shōgun could run. Agree or disagree?",
        "content": "I rewatched it and honestly the production value was insane. Mongol Empire politics, brutal battles, massive sets. But it got cancelled after 2 seasons. With how well historical epics are doing now (like Shōgun), do you think Marco Polo would survive if it dropped today? Or was it just not that good? Curious what people think did it deserve to be cancelled? ",
        "upvotes": 8,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1reylt7/hot_take_marco_polo_walked_so_shōgun_could_run/"
    },
    {
        "id": "1rekvop",
        "author": "Zutara764",
        "title": "Why does Netflix time their ads SO BADLY",
        "content": "I'm rewatching Grey's, and it’s WILD that the ads aren’t just placed where the original commercial breaks were. Like the early seasons were made for cable, so they have obvious cuts to commercials, and Netflix just decides to throw them in whenever the hell they feel like it.   \nEven watching Love is Blind, they cut to ads literally in the middle of conversations all the time. Once it even happened in the middle of a sentence. \n\nLike was there not a single thought put towards when an ad should be played???",
        "upvotes": 36,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1rekvop/why_does_netflix_time_their_ads_so_badly/"
    },
    {
        "id": "1rf4cux",
        "author": "DaGeoffro",
        "title": "Has anyone seen the Russian show Better Than Us?",
        "content": "I don't feel like this show gets talked about enough, it's honestly one of my favorite sci-fi/futuristic offerings on the platform. I enjoy every storyline, which I can't say about a lot of shows where each character is off doing their own thing. They really managed to connect everything in a way that I found satisfying. And while it has a pretty run-of-the-mill take on life in the future, with some sillier elements like transparent smart phones, I do like that it takes place in the NEAR future (2029,) as opposed to 2058 or 2082 or something like that. And you can't mention Better Than Us without mentioning Arisa, the main character of the show who, despite being a robot, ends up being one of the most likeable and emotionally complex characters out of everyone.  \n  \nI'd definitely recommend checking it out if you're into sci-fi or robots. The story is definitely more of a slow burn, so if that isn't your thing you may not like it. There was never a season 2 unfortunately (but the first season has quite a few episodes). I heard something about another company renewing it for a second season but I'm not sure if anything ever came of that.",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1rf4cux/has_anyone_seen_the_russian_show_better_than_us/"
    },
    {
        "id": "1rewowh",
        "author": "azaman92x",
        "title": "Show suggestions",
        "content": "Hey all, hope you’re all well!\n\nI finished watching season 3 of the night agent on Netflix a few days ago. I’m looking for any recommendations of shows similar to this please? \n\nThankyou in advance ☺️",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1rewowh/show_suggestions/"
    },
    {
        "id": "1remzk1",
        "author": "tigercat300",
        "title": "What show would you bring back to Netflix?",
        "content": "There are so many great shows on Netflix that got canceled too soon. If you could bring any show back for another season or even a full reboot, what would it be? I’ve been thinking about *The OA,* I feel like it had so much potential that we’ll never get to see! What’s your pick, and why?",
        "upvotes": 6,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1remzk1/what_show_would_you_bring_back_to_netflix/"
    },
    {
        "id": "1reo88t",
        "author": "IndicaOatmeal",
        "title": "Hans Niemann says Netflix Untold documentary will “shift the narrative” about his chess cheating scandal",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1reo88t/hans_niemann_says_netflix_untold_documentary_will/"
    },
    {
        "id": "1rezdy4",
        "author": "EttaJamesKitty",
        "title": "Netflix says I've watched episodes I haven't.",
        "content": "Say there is a show with 10 episodes.  I will watch episodes 1, 2 &amp; 3 and log off.  Next time I go back, Netflix will show episodes 4, 5 &amp; 6 watched too, even though I never watched them, and start me on episode 7.  \n\nThis has been a problem for a while.  Happens regardless of platform (laptop vs my tv). I'm the only person on my account.  \n\nAny idea what is going on?  \n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1rezdy4/netflix_says_ive_watched_episodes_i_havent/"
    },
    {
        "id": "1relgoe",
        "author": "MovieFan1984",
        "title": "Netflix Originals on Disc (DVD, Blu-ray, 4K)",
        "content": "Is there a way to keep track of what Netflix originals are getting disc releases?  \nI have Stranger Things S1-2, the Target exclusive DVD/Blu-ray releases.  \nI know The Umbrella Academy S1-2 also saw a disc release.  \nThe two \"Haunting of\" miniseries saw a disc release.  \nI can keep listing, but you get the idea. Sometimes, Netflix does drop a disc release.  \nIs there any way to keep track, or just keep checking [Blu-ray.com](http://Blu-ray.com) every so often?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1relgoe/netflix_originals_on_disc_dvd_bluray_4k/"
    },
    {
        "id": "1rdub1c",
        "author": "Wonderful-Refuse642",
        "title": "‘The Night Agent’ Season 3 Viewership Down Up To 59% on Prior Seasons In Opening Week",
        "content": "",
        "upvotes": 76,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1rdub1c/the_night_agent_season_3_viewership_down_up_to_59/"
    },
    {
        "id": "1reqdfo",
        "author": "jackie_tequilla",
        "title": "The Watcher is very hard to watch. Spoilers.",
        "content": "Maybe unpopular opinion but a family of 4 don’t need that stupendous house especially when you can’t really afford it and have to make sacrifices elsewhere. But hey I’m not an American. I don’t have this mentality of bigger, better, more, more, more. \n\nThe husband said they needed their kids to have rheir oen room and outside space, of course there were smaller cheaper options elsewhere. \n\nDid they buy it fully furnished? Or their furniture just fits there perfectly?\n\nAlso only 6 weeks lead time? Is it that quick in the US? Didn’t they need to sell their previous house for cash to contribute to the new mortgage or deposit? \n\nThe idea of getting rid of authentic expensive marble kitchen tops because of spaguetti tomato sauce is ludicrous. The kitchen looks brand new. Why buy something so expensive just to refurb it? \n\nAlso they new that one set of neighbours seem to be crazy and the other unfriendly and rude. But no, no investigation, nothing. Talk about impulse buying. \n\nAlso who buys a fucking ferret for a pet? Buy a dog or a cat, you have the space now. \n\nAnd who is doing all the cleaning? \n\nI’m just coming at the end of E1. I hated this thing from the beginning and nearly gave up but after reading so many bad comments I am going to see how much I can endure. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1reqdfo/the_watcher_is_very_hard_to_watch_spoilers/"
    },
    {
        "id": "1renwn7",
        "author": "Blood_donut",
        "title": "HELP!  Why is my screen so dark in the Netflix app?",
        "content": "I wonder if anyone else has this issue, or even found a way to fix it with settings or something..  I have an iPhone 17 now, but I had the same issue when I had the 13.  My brightness is all the way up, true tone and auto brightness are both off.  Even when it is a light scene, it still seems dark.  It only happens in the Netflix app.  Hulu and Prime are both bright enough.  Maybe I am going crazy.",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1renwn7/help_why_is_my_screen_so_dark_in_the_netflix_app/"
    },
    {
        "id": "1rdcfs5",
        "author": "[deleted]",
        "title": "Why are all the shows made for 20 year olds? I mean, as the older bill payer of the house, I can't find anything new to watch.",
        "content": "Just saying... Every new series is... absolutely rubbish... Wouldn't hurt to try and appeal to demographics of all ages. \n\nPlease don't suggest K Pop demon Hunters to me...",
        "upvotes": 293,
        "comments": 321,
        "media": null,
        "permalink": "/r/netflix/comments/1rdcfs5/why_are_all_the_shows_made_for_20_year_olds_i/"
    },
    {
        "id": "1reo8zw",
        "author": "Lack_Potential",
        "title": "What does season 2 of season 3 mean?",
        "content": "Looking at a few shows but most recently Pokémon Horizons, they split season 3 (Rising Hope) into seasons. This isn’t the first time I’ve seen this happen. I’m just a little confused why they didn’t just call Rising Hope an arc.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1reo8zw/what_does_season_2_of_season_3_mean/"
    },
    {
        "id": "1reguxy",
        "author": "Worldly-Ebb-7891",
        "title": "What do you think about Netflix recommendation system?",
        "content": "I think it is using ML behind the system for personalization, just wondering what others think about it. Like good or bad or your thoughts. Pros and cons.   \nSorry for bad grammar, English is not my first language :}",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1reguxy/what_do_you_think_about_netflix_recommendation/"
    },
    {
        "id": "1remiae",
        "author": "Prior_Recipe_5999",
        "title": "Wild",
        "content": "I’ve been watching telenovelas on Netflix I’ve watched like six so far and like 4 of them had characters getting graped \n\n  \ntelenovelas are crazy man",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1remiae/wild/"
    },
    {
        "id": "1rdq6ha",
        "author": "Iamthelizardking887",
        "title": "I just want the credits to play after a movie ends. Is there a way to toggle this?",
        "content": "So I’m on a PS5, and when a movie ends, it plays the credits for 20 seconds before a pop up takes over the entire screen and tells you the title. You then have 3 seconds to quickly select watch credits for the movie credits to just play out as normal, otherwise the entire bottom half of the screen will then be filled with titles of other titles. If you try to find the watch credits option after that, it will just kick you out to the movie title.\n\nThis is such an annoying feature to me. Maybe I’m one of the 5% who actually care about the credits and want them to play normally, but they serve as a good outro to a film and let you relax and decompress after an intense film. I already have autoplay turned off, but is there another option to just turn off the pop ups altogether? I just want a movie to play from beginning to the end of the credits.",
        "upvotes": 35,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1rdq6ha/i_just_want_the_credits_to_play_after_a_movie/"
    },
    {
        "id": "1rd8svi",
        "author": "Prudent-Scar-9656",
        "title": "Netflix: Please do a documentary on 90s/00s Howard Stern next",
        "content": "I watched the ANTM documentary and have seen all the outrage from people who are shocked by the antics of Tyra and the 00's ANTM show. Yes, it was trashy, misogynistic reality tv, exploiting naive young women by forcing them into humiliating situations or into having emotional reactions. But you know who was the absolute king of exploiting women in the 90s/00s, and who has never had a documentary made about him, or had his disgusting reality radio/tv shows exposed to the younger generation? Howard Stern. Anyone who was alive back then knows exactly what I'm talking about. I don't even want to describe the misogynistic filth that man did to young women on his shows. If Tyra Banks is going to be raked over the coals for her middling at best reality tv show, which actually wasn't even the worst of the lot, then someone really needs to take a hard look at the biggest offender of them all: HS.  This man should have been called to account YEARS ago. Netflix, please make this your next documentary.",
        "upvotes": 382,
        "comments": 74,
        "media": null,
        "permalink": "/r/netflix/comments/1rd8svi/netflix_please_do_a_documentary_on_90s00s_howard/"
    },
    {
        "id": "1regpja",
        "author": "Financial-Donkey194",
        "title": "Virgin River Staffel 7: Dieses Highlight erwartet dich",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1regpja/virgin_river_staffel_7_dieses_highlight_erwartet/"
    },
    {
        "id": "1reikft",
        "author": "twcosplays",
        "title": "Looking for a long series that's perfect for background watching",
        "content": "I’m in need of a long series to binge that isn’t too popular but still worth the watch. Something I can put on while cleaning or cooking without having to pay full attention every second. Any recommendations? I’m looking for something easy to follow with a decent plot, but not too heavy. Would love to hear what you all are watching that fits this vibe!",
        "upvotes": 0,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1reikft/looking_for_a_long_series_thats_perfect_for/"
    },
    {
        "id": "1reefxm",
        "author": "FudgeAffectionate155",
        "title": "Netflix Referral",
        "content": "Hi — I’m planning to apply for Data Engineer roles at Netflix and was hoping to connect with someone willing to provide a referral.\n\nI have 15 years of experience in data engineering and distributed data platforms, including 5 years at Amazon working on large-scale data pipelines and analytics systems.\n\nHappy to share my resume and job IDs via DM. Really appreciate any help — thank you! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1reefxm/netflix_referral/"
    },
    {
        "id": "1rdaimf",
        "author": "Helpful_Peanut_860",
        "title": "Tyra and ATM",
        "content": "Did Tyra think this docuseries was some sort of soft attempt to make everything okay and cover up whatever bad image she has now after ATM? But have no idea that all the people around her were actually throwing her under the bus one by one? I watched the show in the first few seasons (never really into it) and had zero idea the awful things this show had turned into. But this docuseries made me legit dislike her immensely. She is smug and fake and just completely full of bullsh\\*t. And while she thought she was redeeming herself, all people around her just outed her for who she truly is. And I really love that for all of them to get the truth out. ",
        "upvotes": 59,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1rdaimf/tyra_and_atm/"
    },
    {
        "id": "1re4he0",
        "author": "vueltas88",
        "title": "maggie and bianca: fashion friends",
        "content": "when i was like 8 or 9 i used to watch this show maggie and bianca on kids Netflix, im trying to find people who used to watch it too because like i haven’t seen ANY one who has 😭 \n\nonly seasons 1 &amp; 2 were dubbed, how do i watch the others?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1re4he0/maggie_and_bianca_fashion_friends/"
    },
    {
        "id": "1reds7n",
        "author": "Ok_Following1323",
        "title": "Harlen Coben shows AI?",
        "content": "Are the scripts generally AI it’s like each show they make is compacted into like 2-3 sub plot twists that cohesively have nothing to do with each other and water down to the most thrill killing conclusions. It’s so in your face that you think it’s not what’s happening but it is. There’s some amazing actors without doubt but you’re so overwhelmed by the flashbacks and the connections all for them to lead back to nothing. The subplot about the secret child of the detectives husband in the show “ The Stranger” got given about 30 minutes of focus even though we literally didn’t care nor did it add to the actual plot.\n",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1reds7n/harlen_coben_shows_ai/"
    },
    {
        "id": "1re6jwd",
        "author": "glimmerware",
        "title": "HOW do I disable \"continue watching\" interruption popup???",
        "content": "I play netflix through a browser pulled over to my tv (I use it as a second monitor) and every hour or two while I'm fullscreen in a game on my main monitor, the stupid popup appears that says \"continue watching\" or \"back to browse\" and it halts the show and I have to alt tab out of my game to reset it\n\nI cannot find anything in settings to fix this...do I simply have to live with this annoyance? It literally causes my specific game lately to crash because it gets cranky when alt tabbed sometimes",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1re6jwd/how_do_i_disable_continue_watching_interruption/"
    }
]