[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1lhiqvd",
        "author": "Skizoid666",
        "title": "La Scuola Holden è come Scientology?",
        "content": "https://scrolloergodubito.substack.com/p/la-scuola-holden-e-la-filiera-della",
        "upvotes": 31,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yaAIK7T76kH_QlBBWe2j6RrVN4q4hVkcQ0msdA00cbY.jpeg?auto=webp&amp;s=ebb1f78153bfa8c3b46fc0a4bd54c123ea578b29"
        },
        "permalink": "/r/torino/comments/1lhiqvd/la_scuola_holden_è_come_scientology/"
    },
    {
        "id": "1lhqj9a",
        "author": "CallMeSaul1708",
        "title": "Uscita con una ragazza",
        "content": "Ciao a tutti, sono qui per chiedervi una mano, questa sera dovrei uscire con una ragazza che sta in zona Re Umberto (metro) ma non ho la più pallida idea di cosa fare, siccome non conosco per nulla la città. Mi chiedevo cosa potremmo fare in zone vicine, si era parlato anche del centro, lei ha proposto il cinema per poi tirarsi indietro siccome non è il miglior contesto per poter parlare. Grazie in anticipo🙏🏻",
        "upvotes": 6,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1lhqj9a/uscita_con_una_ragazza/"
    },
    {
        "id": "1lhrbn3",
        "author": "Competitive-Act3158",
        "title": "Hi, any lesbians or bisexual here.",
        "content": "I am an international student studying at the University of Torino, I am bisexual and would love to meet up new friends and maybe something more. I love reading books (erotica books), cooking, dancing, travelling etc if you’re interested in making acquaintances with me, please send me a DM .",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lhrbn3/hi_any_lesbians_or_bisexual_here/"
    },
    {
        "id": "1lhqjbi",
        "author": "Flukierx9",
        "title": "Torino e vita studentesca",
        "content": "Ciao a tutti, sono uno studente dell'università di bologna ma sto valutando di trasferirmi a torino.\nSto cercando di capire se questa città può darmi più opportunità di carriera e anche varietà a livello di vita sociale, so anche però che rispetto a bolo è meno \"unicentrica\".\nVolevo chiedervi allora quali sono i posti della movida, cosa fate per divertirvi qui a torino e in generale quanto e cosa offre secondo voi la città?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lhqjbi/torino_e_vita_studentesca/"
    },
    {
        "id": "1lhq27x",
        "author": "pulcininini",
        "title": "Compare x calciobalilla",
        "content": "Ciao cerco un attaccante per un torneo di calciobalilla il 26/06 in zona via Nizza. Non sono fortissima (forse neanche forte) ma posso sorprendere, preferisco stare in difesa ma mi adatto. Potrebbe essere anche umiliante ma di sicuro sarà divertente dai",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lhq27x/compare_x_calciobalilla/"
    },
    {
        "id": "1lhls3t",
        "author": "andre130410",
        "title": "Cercasi amicizie",
        "content": "\n\nCiao a tutti! \nMi chiamo Andrea,  M21 , ho voglia di ampliare il giro di amicizie  e conoscere persone nuove con cui condividere uscite e serate \n\nmi sposto spesso  tra Asti, Alba  e Torino. Mi piacciono le conversazioni profonde, le risate spontanee, stare all’aria aperta o anche semplicemente bere qualcosa in compagnia.\n\nSe anche tu stai cercando nuove amicizie genuine, scrivimi nei commenti o in privato. \n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lhls3t/cercasi_amicizie/"
    },
    {
        "id": "1lhlmf5",
        "author": "swimmerturkey",
        "title": "Negozi per vendere vestiti",
        "content": "Ciao a tutti! C'è un posto a Torino dove posso vendere vestiti invece di donarli? Ho controllato su Humana, ma accettano solo donazioni. Aiutatemi se conoscete qualche posto dove vendere vestiti! Grazie mille! ",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1lhlmf5/negozi_per_vendere_vestiti/"
    },
    {
        "id": "1lgtfdg",
        "author": "blunathan",
        "title": "Le facciate di Torino",
        "content": "",
        "upvotes": 88,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sonbivegc98f1.jpeg?auto=webp&amp;s=a5f61b6c27cd00b0e0387b305b40a1e756d1dcec"
        },
        "permalink": "/r/torino/comments/1lgtfdg/le_facciate_di_torino/"
    },
    {
        "id": "1lgtz9e",
        "author": "Typical-Buyer2901",
        "title": "Pfas nelle fontanelle dell'acqua, a Torino le più inquinate in Italia",
        "content": "1. Torino, casa dell’acqua, 920±300 ng/l;\n2. Firenze, piazza della Repubblica 880±280ng/l;\n3. Paesana (Cuneo) 850±280ng/l;\n4. Torino, piazza Galimberti 840±270ng/l;\n5. Luserna San Giovanni (Torino), 590±190 ng/l;\n6. Valdisotto (Sondrio) 530±180 ng/l;\n7. Galliano (Firenze) 480±160 ng/l;\n8. Bagolino (Brescia) 470±150 ng/l;\n9. Sondrio, via Orobie 450±150 ng/l;\n10. Graglia (Biella), 440±150 ng/l;\n11. Garessio (Cuneo), 370±120 ng/l;\n12. Rorà (Torino),  360±120 ng/l;\n13. Ormea (Cuneo), 360±120 ng/l;\n14. Darfo Boario Terme (Brescia) 287±95 ng/l;\n15. Milano, piazza Duca d’Aosta 274±91 ng/l.",
        "upvotes": 31,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yGK74IRHoKqJjT7r5YsxT8rnF3i1TO_Xf3RNrvpzO80.jpeg?auto=webp&amp;s=bf3e608e66fc0ba9614da48f95a079c2b37bb714"
        },
        "permalink": "/r/torino/comments/1lgtz9e/pfas_nelle_fontanelle_dellacqua_a_torino_le_più/"
    },
    {
        "id": "1lh0yvq",
        "author": "Adorable_Test399",
        "title": "Bar/eventi per conoscere gente il sabato sera?",
        "content": "Ciao, sono da poco a Torino. Esistono bar/eventi per conoscere gente nuova il sabato sera. Chiaramente ogni bar andrebbe bene, ma mi chiedevo se ci fossero gruppi/eventi già organizzati a tale scopo ",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lh0yvq/bareventi_per_conoscere_gente_il_sabato_sera/"
    },
    {
        "id": "1lh6mqc",
        "author": "ohhisofia",
        "title": "Dermatologist?",
        "content": "Anyone have a recommendation of an english speaking dermatologist in Turin? I am still learning Italian, and I have had a bad skin flare up and need to see someone quickly and communicate the issues without a language barrier. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lh6mqc/dermatologist/"
    },
    {
        "id": "1lgrni8",
        "author": "Confident-Art-8800",
        "title": "Stand up a Torino?",
        "content": "Ciao, avete posti che facciano stand up comedy di qualità a Torino?",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lgrni8/stand_up_a_torino/"
    },
    {
        "id": "1lgq6ph",
        "author": "aranor01",
        "title": "Easy Riders: Pedalata Notturna",
        "content": "Iscrizione: https://docs.google.com/forms/d/e/1FAIpQLSef2dwtgHlFbFu94bWLgERm5lXQIWY7UcJKEJh_FGhfXjTy_A/viewform",
        "upvotes": 7,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5tgla4ep888f1.jpeg?auto=webp&amp;s=1b3ec919074d97283fe0c1fad5984226af51a7dd"
        },
        "permalink": "/r/torino/comments/1lgq6ph/easy_riders_pedalata_notturna/"
    },
    {
        "id": "1lguw1m",
        "author": "Zarpenguin2091",
        "title": "C’è qualche negozio a Torino che può farmi questa riparazione?",
        "content": "Ho bisogno di trovare un negozio che mi ripari il cavo di queste cuffie,qualcuno può aiutarmi?",
        "upvotes": 1,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/u67u1edns98f1.jpeg?auto=webp&amp;s=5ec891e2546ad07eba9f059eb0e1348f1060cc69"
        },
        "permalink": "/r/torino/comments/1lguw1m/cè_qualche_negozio_a_torino_che_può_farmi_questa/"
    },
    {
        "id": "1lh7cpx",
        "author": "Alarming-Sand-4555",
        "title": "Via coppino nessuno mi ha fatto entrare nel bagno",
        "content": "Le pizzerie e i bar nessuno mi ha fatto entrare in bagno e ho dovuto farla adosso e non andate dalle pizzerie e i bar in via coppino ",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1lh7cpx/via_coppino_nessuno_mi_ha_fatto_entrare_nel_bagno/"
    },
    {
        "id": "1lgtv3k",
        "author": "thingsacaso",
        "title": "Donare giocattoli",
        "content": "Avete idea di qualche associazione che raccolga giocattoli usati? Ho provato a cercare ma ho trovato poca roba che accetti donazioni fuori dal periodo di Natale",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lgtv3k/donare_giocattoli/"
    },
    {
        "id": "1lfw05h",
        "author": "TheTrampIt",
        "title": "Ma Veramente?",
        "content": "A Modugno...\n\nQua vicino no?",
        "upvotes": 58,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ie1m5q5ap08f1.jpeg?auto=webp&amp;s=d61827b6d0b857b7909850ed504d5de49f7281a1"
        },
        "permalink": "/r/torino/comments/1lfw05h/ma_veramente/"
    },
    {
        "id": "1lfx5ml",
        "author": "Mf-2hd",
        "title": "Torino è alle prese con continui blackout - Il Post",
        "content": "",
        "upvotes": 43,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/o851T1UzfHwvL-kWoPOXN6FnvjdN6mCzfYkZB4TfQ5Y.jpeg?auto=webp&amp;s=035fffcfa81d384e1e1540a2f24d8446d595af52"
        },
        "permalink": "/r/torino/comments/1lfx5ml/torino_è_alle_prese_con_continui_blackout_il_post/"
    },
    {
        "id": "1lfxl8g",
        "author": "Lovelydayinbaltimore",
        "title": "dove andate in piscina a Torino? (relax no per allenamento)",
        "content": "",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1lfxl8g/dove_andate_in_piscina_a_torino_relax_no_per/"
    },
    {
        "id": "1lg9yr0",
        "author": "TOKYO6655",
        "title": "I Have Some Questions About UniTo",
        "content": "Hello, I'm an EU citizen (Austrian) wishing to study at the University of Turin. I do not live in Italy (and I wasn't born there, just went on a vacation once as a kid) and I'm currently outside of Europe hoping to move to Italy in September. While I've been emailing the university and frequently checking UniTo's website to figure out some things I'm confused about, I'm having a hard time with a couple of things. The responses I get to my emails are very brief and seem to only focus on one of many questions I have each time and I don't want to take away any more of their time. I'm running out of time here with the application deadlines. Due to me being an European citizen I'm able to apply late so I'm trying not to miss out on that but I have no idea how to plan this summer out.\n\nIf anybody could help me find an answer to my questions I'd really appreciate it.\n\n1. One question I asked in every single email I've sent them but never got an answer to has been whether or not I should provide my overall educational score when applying. I went to high school in Turkey so we don't really have a gpa kind of thing? I do have logs of all my yearly grades since they're stored in a website we have. Should I print those out somehow? How would I go about it if that was required of me to show?\n\n2. What are the exact documents needed for a non-Italian EU citizen to provide? I know the basics like ID, motivational letter etc. but I don't want to leave anything to chance.\n\n3. I know that free-access programs require students to take their corresponding TOLC exams, and my main goal is to study International Relations. But I don't know the subjects of said exam and what to prepare for. If anybody knows the premises of what subjects they focus on for that and could let me know that'd be amazing. That being said, I'm also debating trying out economics or something of the sort as a limited program first. But I haven't been able to figure out what kind of test limited programs require. So I'm also wondering about that aswell.\n\n4. I've paid for the university exams happening in the country I'm in and I will be attending them this weekend. Will my score on those matter or do I just need to provide proof that I've attended them? Either way I'll be doing my absolute best but I am pretty worried about how things will play out for me this upcoming educational year.\n\n5. Is anything different for EU citizens aside from the chance to still apply past the normal application dates? Anything I should keep in mind?\n\nI'm aware I'm pretty late to everything, I didn't want to rush for solutions before getting a response to my last email. I did today and like I said it was quite brief, so this is my last resort. My apologies if this is all over the place, I'm just really lost at this point.\n\nIncase it raises any questions I moved out of Austria and moved in with my mom in Turkey before high school started due to personal reasons. I have a dual citizenship from birth.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1lg9yr0/i_have_some_questions_about_unito/"
    },
    {
        "id": "1lg885y",
        "author": "Mindless_Debate2559",
        "title": "Italian classes in Torino",
        "content": "Hello lovely people I am a 35m and I am looking for some Italian classes in the afternoon so I can go after work. So if you know any decently priced and good Italian classes after 6pm I would appreciate if you can recommend me some. :) Grazzie mille.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1lg885y/italian_classes_in_torino/"
    },
    {
        "id": "1lfytz5",
        "author": "Loppo93",
        "title": "Motorizzazione civile",
        "content": "Domanda per chi ci è già passato. \n\nDevo richiedere la patente internazionale. Ho già stampato tutto, mancano solo le marche da bollo.\n\nSto cercando di prenotare l'appuntamento. Ho compilato il form online ad inizio settimana, ma non ho ricevuto risposta. Ora sto provando a chiamare telefonicamente, ma non riesco ad entrare in contatto con nessun operatore \n\nMi consigliate di andare direttamente?\n\nGrazie in anticipo per le risposte.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lfytz5/motorizzazione_civile/"
    },
    {
        "id": "1lfxhuv",
        "author": "bec0m1ng",
        "title": "Dentista per paziente fobica",
        "content": "Ciao! Sto cercando un* dentista su Torino che abbia esperienza con pazienti fobici o con forte ansia, per risolvere problemi importanti. Possibilmente no catene e franchising: cerco un* dentista non giudicante e umano, se non costasse troppissimo sarebbe meglio. Se potesse avere opzioni di sedazione cosciente ancora meglio (anche se so che costa tanto), ma non è indispensabile.\nAvete esperienze dirette o nomi da consigliare? Grazie a tutt*",
        "upvotes": 3,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1lfxhuv/dentista_per_paziente_fobica/"
    },
    {
        "id": "1lg53bi",
        "author": "One_Put_9182",
        "title": "Come scegliere una zona?",
        "content": "Ciao a tutti ragazzi, sto per trasferirmi a torino per lavoro, e sto cercando casa in affitto.  \nQuali sono le zone che dovrei evitare?  \nPremetto che dovrei lavorare a mirafiori nord, e che quindi mi farebbe comodo la vicinanza con i mezzi, ma non vorrei trovarmi troppo distante dal centro città.\n\nCi sono delle zone che mi hanno sconsigliato, ma leggendo qua e là non capisco bene se sia effettivamente così o meno. \n\nHo provato a guardare qualcosa in zona politecnico, ma purtroppo affittano solo a studenti viste le convezioni del comune di Torino. \n\nSapreste darmi qualche consiglio? ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1lg53bi/come_scegliere_una_zona/"
    },
    {
        "id": "1lfzh8b",
        "author": "chaoticbabe10",
        "title": "public transport",
        "content": "Hi! My boyfriend’s family and I are going to travel to Torino this September and we will stay for 10 days. We’re staying near the city center but will probably need to use public transport to explore the city. I would like to know what’s the best option for us, because we’re 5 in total so taxi will not be the best option. Thanks! \nP.D If you have any food, or places recommendations i’m open to listen! ",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1lfzh8b/public_transport/"
    },
    {
        "id": "1lfchb2",
        "author": "JackFr0st024",
        "title": "Casa corso Regina",
        "content": "Sto cercando casa da un po' e ho trovato una casa che potrebbe essere una buona occasione su corso regina praticamente attaccata alla fermata Livorno. So che andando verso porta palazzo inizia a diventare un po' sketchy, ma quel punto mi sembra abbastanza lontano e tranquillo. Voi avete avuto esperienze in zona/sapere com'è? Grazie in anticipo ",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1lfchb2/casa_corso_regina/"
    },
    {
        "id": "1lfkyhw",
        "author": "Just_Chain_366",
        "title": "universitari, cosa scelgo?",
        "content": "Ho un dubbio che mi tormenta da diverse settimane. Ho ottenuto di recente una triennale in lingue, e per la mia magistrale ho visto delle possibilità ad UniTO e alla Sapienza di Roma. Personalmente entrambe le città hanno diversi pro e contro, e quella verso cui sono più orientato è UniTo, ma volevo capire dai torinesi stessi, qual è la loro opinione sulla loro università. (domanda off topic, è vero o è un mito che l'aria è quasi velenosa?)",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1lfkyhw/universitari_cosa_scelgo/"
    },
    {
        "id": "1lfkt74",
        "author": "MedinisSuris",
        "title": "Torino places to visit",
        "content": "Hi,\nSo we're in Turin for 2 more days and so far many of planned activities didn't go to plan. Mole Antoneliana elevator is closed, due to strikes many of destinations around Turin are hard to get to, so Parco Gran Paradiso did not work either. Today we got to Basilica of Superga. No luck finding any places to rent a scooter either. \n\nSo the quesion is - any suggestions where else to go? Or does anyone know a place to rent a scooter in Turin?\n\nMuch appreciated!",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lfkt74/torino_places_to_visit/"
    },
    {
        "id": "1lfa3s0",
        "author": "Additional_Jello_429",
        "title": "C'è un'interruzione di corrente dove ti trovi?",
        "content": "Vivo a Crocetta e la nostra corrente si è appena spenta",
        "upvotes": 5,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1lfa3s0/cè_uninterruzione_di_corrente_dove_ti_trovi/"
    },
    {
        "id": "1lfdlbx",
        "author": "Similar_Profit_7298",
        "title": "Orologio da taschino",
        "content": "So che è una richiesta strana, ma ho urgente bisogno di trovare un orologio da taschino con catena a Torino. Non me ne serve uno figo o di qualità, cerco una cinesata da 20€ circa, conoscete un negozio di cianfrusaglie che potrebbe venderlo? Per la zona è indifferente.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lfdlbx/orologio_da_taschino/"
    }
]