[
    {
        "id": "1llt9z1",
        "author": "DontTellLarryAMA",
        "title": "Hi r/movies! We’re Patty Guggenheim, Kiel Kennedy, Kenneth Mosley (lead actors) &amp; Greg Porper (writer/director/producer) of Don’t Tell Larry - a dark office comedy about a lie that spirals out of control. One viewer called it “Office Space on crack.” Now on VOD. Ask us anything!",
        "content": "Hi r/movies! We’re Patty Guggenheim, Kiel Kennedy, Kenneth Mosley (lead actors) &amp; Greg Porper (writer/director/producer) of Don’t Tell Larry - a dark office comedy about a lie that spirals out of control. One viewer called it “Office Space on crack.” Now on VOD. Ask us anything!\n\n**Synopsis:**\n\nAn ambitious office worker tells a tiny lie to a truth-obsessed weirdo—and ends up trapped in a corporate nightmare of her own making.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=6xREP3uLf0Q](https://www.youtube.com/watch?v=6xREP3uLf0Q)\n\n**Available to rent/purchase:**\n\nAmazon Prime Video - [https://www.amazon.com/Dont-Tell-Larry-Greg-Porper/dp/B0F45BXJ39](https://www.amazon.com/Dont-Tell-Larry-Greg-Porper/dp/B0F45BXJ39)\n\nApple TV - [https://apple.co/4mL4UQ0](https://apple.co/4mL4UQ0)\n\nALSO: ED BEGLEY JR. WILL BE JOINING US FOR OUR FOLLOW-UP AMA NEXT TUESDAY, 7/1 AT 4P EST!\n\n*Ask us anything! We'll be back at 4 PM ET today to answer questions.*\n\n**Bios:**\n\n**Patty Guggenheim** appeared as Madisynn King on Marvel's SHE-HULK series. She also recently played Delray Donna in THE BINGE 2 on HULU and a variety of other characters on KILLING IT, MR. MAYOR, RENO 911, CURB YOUR ENTHUSIASM, SUPERSTORE, MODERN FAMILY, LA&gt;VEGAS, and NOBODIES. She starred as Erica on FLORIDA GIRLS and has recurred on SPIDERWICK CHRONICLES, SPLITTING UP TOGETHER, MARY+JANE, TOSH.0, and iCARLY. Patty voiced characters in MIKE TYSON MYSTERIES and SUPERMANSION, and wrote/acted on the series BARELY FAMOUS. Look out for her in the new season of TWISTED METAL on PEACOCK coming this summer and MATLOCK on CBS later this month. She’s a Main Company Groundling and a proud Indiana University graduate. Go Hoosiers! IG: u/patriscuit\n\n**Kiel Kennedy** is an actor, writer, and (current) director of the Groundlings Sunday Company. He recently made a standout debut with Rogue Machine in the critically acclaimed HUMAN ERROR at the Matrix Theater with his great bud, Lauren Burns. You can catch Kiel in the upcoming film DON’T TELL LARRY, which premiered at the Austin Film Festival and won Best Feature at the Pasadena International Film Festival, where he also earned a nomination for Best Actor. He’ll also appear in the horror film MCCURDY POINT, which he produced and starred in alongside fellow Groundling and other great bud, Ryan Gaul. Kiel earned an Emmy nomination for his work on ROBOT CHICKEN, where he also became an expert at picking up Hot Wheels that he launched off ramps. (It’s a thing at Stoopid Buddy Stoodios.) His other credits include SUPERSTORE, NOBODIES, LAZY SUSAN, THE MISADVENTURES OF VINCE AND HICK and THE BINGE 2.\n\n**Kenneth Mosley** is an actor, singer, writer, producer, and host. Kenneth is starring in the film Don’t Tell Larry and has guest star/recurring roles on NBC’s Night Court, Will Trent (ABC), and Hulu’s Reboot. Other TV/film appearances include: All American, Kenan, Terminal List, Duster, iCarly (revival), Grace &amp; Frankie, Black-ish, Jimmy Kimmel Live!, Grey’s Anatomy and NTB (written by and starring Kenneth in dual roles). As a theatre actor, Kenneth led Broadway national tours as “Lola” in the Tony award-winning musical, Kinky Boots, and as music mogul Berry Gordy, Jr. in the Tony-nominated show Motown the Musical. As a host, his celebrity interviews include: Steve Harvey, Angela Bassett, Mary J. Blige, Jordin Sparks, Morris Chestnut, Jaina Lee Ortiz, Michelle Williams of Destiny’s Child and many others. Mosley holds a Journalism degree from Southern Methodist University and continued to develop his acting craft, studying at the British American Drama Academy’s MIO program in Oxford and completing the conservatory program at The Second City.\n\n**Greg Porper** is an award-winning writer, director, and producer known for edgy, unexpected comedies that push rule-followers and rebels out of their comfort zones, blending humor and tension to spark laughs and gasps. In addition to writing and directing DON’T TELL LARRY, Porper served as the film’s lead producer, strategically crafting, pitching, and executing the film's business plan, securing all of the financing from over three dozen investors, and managing daily operations overseeing a team of more than 100 people throughout the film's lifecycle. Working as a development executive and freelance producer for over ten years, Porper has also developed and produced shows for Netflix, Fox, ESPN, MTV, truTV, Viceland, Discovery+, and more. He created, sold, and served as showrunner for the ten-episode CW digital series, Worst Birthday Ever. His pilot scripts and shorts have been featured on The Black List, College Humor, Funny or Die, and have screened at festivals all across the country.\n\n",
        "upvotes": 50,
        "comments": 189,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2u7e64w1ae9f1.png?auto=webp&amp;s=fd10a74448bc0a0809a26aaddc2be49cbe8348ab"
        },
        "permalink": "/r/movies/comments/1llt9z1/hi_rmovies_were_patty_guggenheim_kiel_kennedy/"
    },
    {
        "id": "1llihwl",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (F1: The Movie / M3GAN 2.0) plus throwback discussions!",
        "content": "**New In Theaters**:\n[F1: The Movie](https://old.reddit.com/r/movies/comments/1lli8lz/official_discussion_f1_the_movie_spoilers/?)\n\n[M3GAN 2.0](https://old.reddit.com/r/movies/comments/1lli8nm/official_discussion_m3gan_20_spoilers/?)\n\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Me, Myself, and Irene](https://old.reddit.com/r/movies/comments/1lli8ox/official_throwback_discussion_me_myself_and_irene/?)\n\n* [Chicken Run](https://old.reddit.com/r/movies/comments/1lli8q9/official_throwback_discussion_chicken_run_spoilers/?)\n\n**Still In Theaters**:\n\n* [28 Years Later](https://www.reddit.com/r/movies/comments/1lfsc91/official_discussion_28_years_later_spoilers/)\n* [Elio](https://www.reddit.com/r/movies/comments/1lfscb2/official_discussion_elio_spoilers/)\n* [The Life of Chuck](https://www.reddit.com/r/movies/comments/1la4c8g/official_discussion_the_life_of_chuck/)\n* [Materialists](https://www.reddit.com/r/movies/comments/1la4c8n/official_discussion_materialists/)\n* [How to Train Your Dragon](https://www.reddit.com/r/movies/comments/1la4c8v/official_discussion_how_to_train_your_dragon/)\n* [From the World of John Wick: Ballerina](https://old.reddit.com/r/movies/comments/1l4gwpn/official_discussion_from_the_world_of_john_wick/?)\n* [The Phoenecian Scheme](https://old.reddit.com/r/movies/comments/1l4gwrc/official_discussion_the_phoenecian_scheme_spoilers/?)\n\n\n**New On Streaming:**\n\n* [KPop Demon Hunters](https://www.reddit.com/r/movies/comments/1lghony/official_discussion_kpop_demon_hunters_spoilers/)\n* [Echo Valley](https://www.reddit.com/r/movies/comments/1lar0eb/official_discussion_echo_valley/) \n* [Deep Cover](https://www.reddit.com/r/movies/comments/1lar0ej/official_discussion_deep_cover/) \n* [Straw](https://www.reddit.com/r/movies/comments/1lar0h7/official_discussion_straw/)\n* [Predator: Killer of Killers](https://old.reddit.com/r/movies/comments/1l5aczx/official_discussion_predator_killer_of_killers/?)\n* [Mountainhead](https://old.reddit.com/r/movies/comments/1l0u3hy/official_discussion_mountainhead_spoilers/?)\n* [Lost in Starlight](https://old.reddit.com/r/movies/comments/1l0u3kg/official_discussion_lost_in_starlight_spoilers/?)",
        "upvotes": 29,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1llihwl/official_discussion_megathread_f1_the_movie_m3gan/"
    },
    {
        "id": "1ln0cnp",
        "author": "BunyipPouch",
        "title": "First Poster for Documentary 'Shari &amp; Lamp Chop' - Before Mr. Rogers and Jim Henson, Shari Lewis changed the face of children's television. A dancer, singer, magician and ventriloquist, Shari and her sock puppets became cultural icons.",
        "content": "",
        "upvotes": 619,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sgzgrhi25r9f1.jpeg?auto=webp&amp;s=48996c413d551d04378f55196147dd51ebd8465a"
        },
        "permalink": "/r/movies/comments/1ln0cnp/first_poster_for_documentary_shari_lamp_chop/"
    },
    {
        "id": "1lmpe0u",
        "author": "Correct_Way_8842",
        "title": "I need a movie that’s really really confusing",
        "content": "I’m talking like right after finishing it I have to immediately google what the hell just happened. Preferably good movies but just stuff where you have no idea what’s happening at any given time. Maybe a little more obscure but not too niche. I’m not really into horror movies but I’ll watch anything.",
        "upvotes": 974,
        "comments": 2895,
        "media": null,
        "permalink": "/r/movies/comments/1lmpe0u/i_need_a_movie_thats_really_really_confusing/"
    },
    {
        "id": "1lmvk81",
        "author": "Comfortable-Tea9542",
        "title": "Actors/actresses that were so good at a role you assume it's because that's just their real personality?",
        "content": "Sometimes an actor or actress fits a role so well, you start to wonder if that's just how they are in real life. It is something more effortless, like the script tapped into who they already were. These are the roles that didn’t need acting lessons, just a camera and a little direction. Tony Stark comes to mind. Any more?",
        "upvotes": 289,
        "comments": 482,
        "media": null,
        "permalink": "/r/movies/comments/1lmvk81/actorsactresses_that_were_so_good_at_a_role_you/"
    },
    {
        "id": "1lm5p6h",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Naked Gun'",
        "content": "",
        "upvotes": 84403,
        "comments": 1662,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0p04vr2yfj9f1.jpeg?auto=webp&amp;s=f3a618a31a90677c72afa6163c9d0641ee618117"
        },
        "permalink": "/r/movies/comments/1lm5p6h/new_poster_for_the_naked_gun/"
    },
    {
        "id": "1lmxmjb",
        "author": "rockstoned4",
        "title": "Something that bugged me in A League of Their Own.",
        "content": "Love this movie BUT It always bugged me how Marla Hooch “Hooch” just bailed on the team and the season right when Jimmy and the team were finally clicking and they were on a roll. I get getting married but why didn’t she come back? Seems like a decent amount of games were left. Like go on your honeymoon and come back.",
        "upvotes": 144,
        "comments": 66,
        "media": null,
        "permalink": "/r/movies/comments/1lmxmjb/something_that_bugged_me_in_a_league_of_their_own/"
    },
    {
        "id": "1ln2cyy",
        "author": "RetroBearDen",
        "title": "Actors who play tough guys but are total opposite in real life",
        "content": "Who are your picks or pick for an actor who usually plays a tough guy in movies but isnt like that in real life?   Obviously you may not \"know\" these actors personally, but through interviews or other actors - who are the real softies in the business bit play bad asses?  I have heard that Sam Elliot is a sweet human in real life for example.",
        "upvotes": 63,
        "comments": 186,
        "media": null,
        "permalink": "/r/movies/comments/1ln2cyy/actors_who_play_tough_guys_but_are_total_opposite/"
    },
    {
        "id": "1lmvkpv",
        "author": "IndyMLVC",
        "title": "Se7en - 30th Anniversary (Dailies &amp; Outtakes)",
        "content": "Gwyneth doesn't get enough credit for her performance in this. ",
        "upvotes": 166,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bOVc0uQhGvYvpVCUe2hPsSe7hOHed8rRetvkb-ubSZI.jpeg?auto=webp&amp;s=8ed36d9c9bc871226f85a263e11e35e0ba87832f"
        },
        "permalink": "/r/movies/comments/1lmvkpv/se7en_30th_anniversary_dailies_outtakes/"
    },
    {
        "id": "1lmi4dp",
        "author": "stekene",
        "title": "Roundhay Garden Scene: The oldest surviving film [1888]",
        "content": "Roundhay Garden Scene is a short silent motion picture filmed by French inventor Louis Le Prince at Oakwood Grange in Roundhay, Leeds, in Yorkshire on 14 October 1888. It is believed to be the oldest surviving film. The camera used, Le Prince's single-lens camera, was patented in the United Kingdom on 16 November 1888.\n\nhttps://ecency.com/roundhay/@blaffy/roundhay-garden-scene-the-oldest-surviving-film",
        "upvotes": 1079,
        "comments": 62,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/h574dzsxsm9f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1lmi4dp/roundhay_garden_scene_the_oldest_surviving_film/"
    },
    {
        "id": "1lmnqui",
        "author": "BunyipPouch",
        "title": "Sandra Hüller ('Anatomy of A Fall') &amp; Colman Domingo ('Sing Sing') to Star in Satirical-Drama 'True-ish'",
        "content": "",
        "upvotes": 402,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2p61YpxtOy4EsA8aMghn_FZp8MEVJ6RblBLkpNpbjh8.jpeg?auto=webp&amp;s=e12be196afc8ad92b40ead54cd3a4ccdc54f2860"
        },
        "permalink": "/r/movies/comments/1lmnqui/sandra_hüller_anatomy_of_a_fall_colman_domingo/"
    },
    {
        "id": "1ln1pc8",
        "author": "Due-Parsley-3936",
        "title": "They Came Together",
        "content": "Stumbled across this one when bring indecisive about what to watch. Have people seen this? It was laugh out loud hilarious. Later come to find out it’s from the wet hot american summer people. But holy shit, it’s hilarious. Was it ever even released in theaters?  If anyone hasn’t seen it it’s on prime right now, it’s probably not for everyone but man, I loved it. ",
        "upvotes": 59,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1ln1pc8/they_came_together/"
    },
    {
        "id": "1lmnoin",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Demon Slayer: Kimetsu no Yaiba Infinity Castle (Part 1)'",
        "content": "",
        "upvotes": 382,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jnccimdxdo9f1.jpeg?auto=webp&amp;s=aee416a35ad614e96ce9f8f904eab910f16fe3f7"
        },
        "permalink": "/r/movies/comments/1lmnoin/new_poster_for_demon_slayer_kimetsu_no_yaiba/"
    },
    {
        "id": "1lmsp7i",
        "author": "gotocze",
        "title": "The NeverEnding Story is still one of the most beautiful fantasy films ever made",
        "content": "I rewatched *The NeverEnding Story* recently and was honestly blown away all over again. It’s such a unique blend of childhood wonder, deep emotion, and surreal fantasy. The world of Fantasia still feels alive, mysterious, and full of imagination — even after all these years.\n\nAs a kid, it felt magical. As an adult, it hits even harder. The Nothing, the Swamp of Sadness, Atreyu’s journey, Bastian's grief… there are so many powerful themes hidden under the surface. And the practical effects, costumes, puppetry — just incredible. It has a soul that most modern fantasy films can’t replicate.\n\nIt’s wild how a film from 1984 can still feel more emotionally resonant and visually imaginative than much of what we see today. Curious how many of you grew up with this film — and how do you feel about it now?\n\nhttps://preview.redd.it/8ldq5b32gp9f1.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=0074e93523b26989a72b088865b459f35c724660\n\n",
        "upvotes": 192,
        "comments": 44,
        "media": null,
        "permalink": "/r/movies/comments/1lmsp7i/the_neverending_story_is_still_one_of_the_most/"
    },
    {
        "id": "1ln0z86",
        "author": "Educational_Copy_140",
        "title": "Young Guns 3",
        "content": "I just attended a panel at the Tidewater Comicon and got to listen to Lou Diamond Philips talk about his work and projects and he confirmed that Young Guns 3 is DEFINITELY happening. All the characters that did not die on screen will be back, himself and Christian Slater included. The movie will be set during the Mexican Revolution and will feature Pancho Villa as a character. \n\nIs anyone else as excited about this as I am?",
        "upvotes": 62,
        "comments": 38,
        "media": null,
        "permalink": "/r/movies/comments/1ln0z86/young_guns_3/"
    },
    {
        "id": "1lm63a9",
        "author": "lostmybih",
        "title": "The Rock is a terrible actor compared to John Cena and Batista",
        "content": "I've been watching lots of movies lately which some involved these 3 actors and I've come to the realization that The Rock is a terrible actor\n\nlike he actually doesn't even act he does the same things reactions talk faces for every movie and calls it a day\n\nwhile on the other hand both John and Batista showed very good acting in recent work they've done \n\nfor example Peacemaker John absolutely killed that rule he did a very good job with the character that I doubt Rock can even reach half of it\n\nso what are your opinions on this?",
        "upvotes": 7149,
        "comments": 988,
        "media": null,
        "permalink": "/r/movies/comments/1lm63a9/the_rock_is_a_terrible_actor_compared_to_john/"
    },
    {
        "id": "1lmsbem",
        "author": "ObjectPhysical6676",
        "title": "What movie do you have to watch at least once a year?",
        "content": "\nA lot of movies I’ve seen are one and done. I’ll probably never watch them again. That doesn’t mean the weren’t good, or even great. They just don’t have that rewatchable quality that I want. Some are masterpieces like Persona or 8 1/2. These are the movies that if you were flipping through cable channels and landed on one, even if it was at the halfway point you’d stay and watch the rest of it. Here’s my top ten. \n\n10. The original Star Wars trilogy \n9. Raiders of the Lost Ark \n8. Seven Samurai \n7. The Warriors\n6. The Thing \n5. Chinatown\n4. (Tie) The Godfather and The Godfather Part II\n3. Once Upon a Time in the West\n2. Die Hard\n1. Jaws\n\nOnes the didn’t make the list but deserved to. Blade Runner, Alien and Aliens, Boogie Nights, The Big Lewbowski, almost anything by Tarantino, same with Lynch and Cronenberg, not to mention Scorsese. Tell me some of yours.",
        "upvotes": 112,
        "comments": 484,
        "media": null,
        "permalink": "/r/movies/comments/1lmsbem/what_movie_do_you_have_to_watch_at_least_once_a/"
    },
    {
        "id": "1lmd9s7",
        "author": "NewPossibility4268",
        "title": "What’s a Movie You Grew Up Loving That Didn’t Age Well at All?",
        "content": "What is a movie you grew up watching as a kid and absolutely loved—but when you watched it again as an adult, it just didn’t hold up? Maybe it was cheesy, badly acted, or just completely lost its magic. For me, it’s Teen Witch. I adored it as a kid, but now I couldn't even get through a clip on youtube. It was so corny and bad. Curious what movies others feel this way about.",
        "upvotes": 1351,
        "comments": 2321,
        "media": null,
        "permalink": "/r/movies/comments/1lmd9s7/whats_a_movie_you_grew_up_loving_that_didnt_age/"
    },
    {
        "id": "1lmcdjw",
        "author": "Queasy_Guarantee_617",
        "title": "“There’s no I in threesome”",
        "content": "Pls tell me someone else watched this movie on max. Me and my roommate watched it tonight and I’ve never been so jaw dropped. I keep looking but no one seems to be talking about this. This dude literally started a documentary about his love story and ended up documenting his fiance fall in love w someone else.",
        "upvotes": 1236,
        "comments": 208,
        "media": null,
        "permalink": "/r/movies/comments/1lmcdjw/theres_no_i_in_threesome/"
    },
    {
        "id": "1lm6kaf",
        "author": "Lem__Mann7",
        "title": "News Anchor reads teleprompter scene - Scary Movie 3 (2003)",
        "content": "I’ve been binge watching early 2000s parody movies, so now I’m posting another hilarious scene. This time, from my favorite parody movie ever. I debated between this, the shotgun shovel scene, and the scene where the sheriffs hat keeps getting bigger lol. This is definitely one of the best comedies of the early 2000s and imo, the last good scary movie in the franchise. Everything after just didn’t have the same magic as the first 3, and especially this one. There are tons of  hilarious moments in this film it’s hard to pick just one. Which other scenes from this movie stand out to you? ",
        "upvotes": 2643,
        "comments": 177,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rqp8gp1dmj9f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1lm6kaf/news_anchor_reads_teleprompter_scene_scary_movie/"
    },
    {
        "id": "1lmv5nm",
        "author": "Icy-Address-9139",
        "title": "My top ten British films and why I like them",
        "content": "No more to add. Suggest your own! Here are mine. Do you agree or disagree?\n\n10. Local Hero.  \nNature vs. capitalism, belonging, environmentalism, community. Brilliant message and fantastic film.\n\n9. The Crying Game.\n\nNot interesting in the gender aspect, but it's about being different in general. And about love in different and difficult circumstances.\n\n8. Life of Brian  \nAbsurdity of religion, blind faith, mob mentality etc. And funny of course.\n\n7. Made in Britain  \nRage, working-class alienation, intelligence not recognised. Brilliance from Tim Roth!\n\n6. The Death of Stalin  \nPower, fear, stupidity, revisionism, narcissism. Intelligence not recognised.. Treating powerful ideas as a joke. Funny!\n\n5. Scum  \nPure brutality, survival, violence. Corruption of institutional systems. Intelligence not recognised (again!).\n\n4. Trainspotting  \nAlso Intelligence not recognised, addiction, escape, working class underclass. Tragic and funny.\n\n3. Withnail and I  \nFriendship, existential crisis, class, depression. Bleak and hilarious - very British.\n\n2. The Wicker Man  \nReligion, innocence, fear, total blind faith. Community (all be it extreme!). Powerful, strange horror.\n\n1. Kes Working class oppression, lack of opportunity, coming-of-age, finding beauty amid bleakness, and, of course, intelligence not recognised .",
        "upvotes": 50,
        "comments": 143,
        "media": null,
        "permalink": "/r/movies/comments/1lmv5nm/my_top_ten_british_films_and_why_i_like_them/"
    },
    {
        "id": "1llta3q",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Project Hail Mary' Starring Ryan Gosling",
        "content": "",
        "upvotes": 19382,
        "comments": 1984,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/l0fgrigwwg9f1.jpeg?auto=webp&amp;s=988876ddb5e5efde2e017198bc9fc062be03fd34"
        },
        "permalink": "/r/movies/comments/1llta3q/official_poster_for_project_hail_mary_starring/"
    },
    {
        "id": "1lmnmmr",
        "author": "darth_vader39",
        "title": "Demon Slayer: Kimetsu no Yaiba Infinity Castle | MAIN TRAILER",
        "content": "",
        "upvotes": 120,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6oWl0gYHUBLDBxbXp0fqnrIP_Lp6sUJpLhoza_U09cw.jpeg?auto=webp&amp;s=e8991bb8c442ebd9d8862bcaaac0b99bec0915b0"
        },
        "permalink": "/r/movies/comments/1lmnmmr/demon_slayer_kimetsu_no_yaiba_infinity_castle/"
    },
    {
        "id": "1lmy3ng",
        "author": "Low_Insurance_1603",
        "title": "Dangerous Liaison (1988) is simply magnificent!",
        "content": "New to this platform and love being able to engage about some of my absolute favorite movies as just a regular person. I would give this movie a score of 99/100 points (nothing’s perfect they say but DL comes very close imo.) Ahhh Glenn, John, Swoosie and the young Uma and Keanu all give stellar performances. It’s tradition I watch this movie at least twice usually during the holiday season for whatever reason?  I guess one can say I’m into ‘period dramas” perhaps DL is a precursor to Bridgerton? I think there’s a contemporary version re-do? Cruel Intentions’ w/ Reese, Sarah, Selma &amp; Ryan is a cool adaptation? Saw it once. It was entertaining but not like DL. Any recommendations  with  a similar vibe with exceptional acting like DL.",
        "upvotes": 29,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1lmy3ng/dangerous_liaison_1988_is_simply_magnificent/"
    },
    {
        "id": "1lm1cgz",
        "author": "cyanide4suicide",
        "title": "Amazon initially interested in Christopher Nolan for Bond and willing to give final cut. Villeneuve does not have final cut authority",
        "content": "",
        "upvotes": 4082,
        "comments": 846,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oGJVCyFYoOZUJ5AYqO_CK_pBGpkeN6NLdfsHaoBshHA.jpeg?auto=webp&amp;s=2f42bd35f308025b42089a9cd1b9954e00eee714"
        },
        "permalink": "/r/movies/comments/1lm1cgz/amazon_initially_interested_in_christopher_nolan/"
    },
    {
        "id": "1ln0k6l",
        "author": "USMCtwin24",
        "title": "Accountant 1&amp;2",
        "content": "Just watched The Accountant 2. After finishing it I was surprised 1&amp;2 were both directed by the same person. The 2nd one felt like a movie directed by 3 or 4 different people with several different writers. Didn't have the tone as the 1st one at all, the humor was a bit better than the 1st, but good lord #2 was such a let down.",
        "upvotes": 18,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1ln0k6l/accountant_12/"
    },
    {
        "id": "1llxm04",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Together'",
        "content": "",
        "upvotes": 3604,
        "comments": 739,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/apv7m3t9th9f1.jpeg?auto=webp&amp;s=0ba520d36063b95843e11738d26c615baf67f825"
        },
        "permalink": "/r/movies/comments/1llxm04/new_poster_for_together/"
    },
    {
        "id": "1lmu9t5",
        "author": "Express_Classic_1569",
        "title": "🎥The Man with the Flower in His Mouth (1930), the first-ever televised drama - is a forgotten but vital step in the evolution of cinema and screen storytelling.",
        "content": "",
        "upvotes": 23,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WTReD5mn8c8WCMN9sLLXjsm56QtZu9Z-O0xI27us1Dc.jpeg?auto=webp&amp;s=86227d18ab703555cd849c70f5d904ff9c2dd802"
        },
        "permalink": "/r/movies/comments/1lmu9t5/the_man_with_the_flower_in_his_mouth_1930_the/"
    },
    {
        "id": "1lm61u9",
        "author": "pinchhitter4number1",
        "title": "I liked John C. Reilly before, but now I think he is a treasure. This is such a good video of him talking about his characters.",
        "content": "I've watched several of these GQ videos with actors describing their characters but this is, by far, the best one. He seems like such a good guy. This sub likes to talk about range, well I think JCR has some pretty good range. He does a lot of comedy but his serious roles are good too. Just my opinion. ",
        "upvotes": 984,
        "comments": 112,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2GhlztmRQ2ScCd3pfeV5Q5XGFq6ULBGPqmxONHizhmI.jpeg?auto=webp&amp;s=cf7d279d3f5aa0ed2e4bc518f2decac724af7a58"
        },
        "permalink": "/r/movies/comments/1lm61u9/i_liked_john_c_reilly_before_but_now_i_think_he/"
    },
    {
        "id": "1lm674o",
        "author": "KillerCroc1234567",
        "title": "'Akira' Live-Action Rights Up for Grabs as Japanese Sci-Fi Leaves Warner Bros.",
        "content": "",
        "upvotes": 953,
        "comments": 196,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/b37Xk84ggsIc_Iz5SMfYdQX4IgKONYK6p3adl-l604M.jpeg?auto=webp&amp;s=83eea05556d18aeb8b0c960fbc3d259a89eacd40"
        },
        "permalink": "/r/movies/comments/1lm674o/akira_liveaction_rights_up_for_grabs_as_japanese/"
    },
    {
        "id": "1lmrxv2",
        "author": "RoninRobot",
        "title": "What’s the best road movie of all time?",
        "content": "It can be argued that The Lord of the Rings trilogy is a road movie (or three, as well as the Hobbit cashgrab trillogy) but it’s more than that to me. My personal favorite is Fandango. I also love the Bob Hope / Bing Crosby road movies where I assume the genre got its name. I’m interested to hear what everyone else thinks.",
        "upvotes": 28,
        "comments": 211,
        "media": null,
        "permalink": "/r/movies/comments/1lmrxv2/whats_the_best_road_movie_of_all_time/"
    },
    {
        "id": "1lmcn3a",
        "author": "PhantomKitten73",
        "title": "Mexico's first ever stopmotion animated feature film \"I Am Frankelda\"",
        "content": "",
        "upvotes": 351,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kmiOgq0QFkqIIUgYuTDNSiZBPO3TIV_FtNjJPwxyPy0.jpeg?auto=webp&amp;s=151acd03293288117103ef878561c1442b1fb9b6"
        },
        "permalink": "/r/movies/comments/1lmcn3a/mexicos_first_ever_stopmotion_animated_feature/"
    }
]