[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 486,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i9lgow",
        "author": "Whobitmyname",
        "title": "‘Pantheon’ Season 2 to Stream For The First Time on Netflix, All 8 Episodes Premiere February 21",
        "content": "",
        "upvotes": 84,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i9lgow/pantheon_season_2_to_stream_for_the_first_time_on/"
    },
    {
        "id": "1ia2id7",
        "author": "HehroMaraFara",
        "title": "Night Agent Season 2 = Massive Disappointment",
        "content": "I loved the first season and did not expect much from it, which might have been key. \n\nI was hoping for more of the same understated approach with brief bursts of action and situational resolution. \n\nThis was not that. This was a convulsed mess of overly complicated ideas and plot lines, with random characters that are just an inch deep on development. I’m not even gonna mention the whole first couple of episodes of him being a basketball coach protecting a kid from an abduction. They sooooo loosely tied it in with the main story that they might as well of labeled it as the “Peter is a great guy, remember?” Prologue. \n\nThe story is generally boring. They made Rose sadly annoying and inexplicably demanding and entitled. It got so stupid and lost that the head of the program was forced to say, in literal dialogue “Night Agent missions often hit deadends” as if accidentally being caught on a hot mic trying to explain away why there are so many dumb unnecessary twists. \n\nWatch season one and pretend this doesn’t exist. ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ia2id7/night_agent_season_2_massive_disappointment/"
    },
    {
        "id": "1i9tqqv",
        "author": "AmericanFurnace",
        "title": "Are the Turning Point documentaries any good?",
        "content": "These documentaries look interesting to me, especially the 9/11 one. But I do know that Netflix documentaries don't have that good of a reputation. So I'd like to know if these Turning Point documentaries are good documentaries or just outright terrible.",
        "upvotes": 7,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1i9tqqv/are_the_turning_point_documentaries_any_good/"
    },
    {
        "id": "1i9o0kq",
        "author": "Practical-Creme-6025",
        "title": "Netflix hikes prices in the US, Croatia and Egypt",
        "content": "Price changes are as follows:\n\nUnited States \n\n- Standard with ads - $7.99 (up from $6.99)\n- Standard - $17.99 (up from $15.49)\n- Premium - $24.99 (up from $22.99)\n\nCroatia \n\n- Basic - €5.99 (up from €4.99)\n- Standard - €9.99 (up from €7.99)\n- Premium - €12.99 (up from €9.99)\n\n*No ad-supported plans available in Croatia\n\nEgypt \n\n- Basic - $1.99 (up from $1.39)\n- Standard - $3.39 (up from $2.39)\n- Premium - $3.99 (up from $3.29)\n\n*No ad-supported plans available in Egypt\n\nArgentina \n\n- Basic - $5.79 (up from $3.99)\n- Standard - $9.59 (up from $6.89)\n- Premium - $12.99 (up from $9.29)\n\n*No ad-supported plans available in Egypt\n",
        "upvotes": 10,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i9o0kq/netflix_hikes_prices_in_the_us_croatia_and_egypt/"
    },
    {
        "id": "1i9gfsp",
        "author": "Witty-Two-343",
        "title": "Anybody know a fix around this ?",
        "content": "",
        "upvotes": 43,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1i9gfsp/anybody_know_a_fix_around_this/"
    },
    {
        "id": "1ia2hfp",
        "author": "gullzway",
        "title": "When does the price increase happen?",
        "content": "My Standard no Ads plan renews on Feb. 7th. No indication that the price is increasing, nor communication from Netflix about it.  \n\nWill it just charge me $17.99 on 2/7?\nIf so I may change to the ads plan before then.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ia2hfp/when_does_the_price_increase_happen/"
    },
    {
        "id": "1ia2dru",
        "author": "superpowers335",
        "title": "Did Netflix remove the season recaps?",
        "content": "Is it just me or do some of the season recaps seem to be missing? For example, Cobra Kai would often have recaps at the start of the seasons if it had been some time since you've watched. I checked the section that has the trailers and recaps and there don't appear to be any recaps listed. Not a big deal. It had just been a while since I've watched and it caught me by surprise. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ia2dru/did_netflix_remove_the_season_recaps/"
    },
    {
        "id": "1ia1mt4",
        "author": "Research_Tasty",
        "title": "American Primeval - character inconsistency *some spoiler*",
        "content": "Hi I'm only 3 episodes in.  \nso expect spoilers for 3 episodes.\n\nso Taylor kitsch' character for some reason decides to follow the woman and he son, stake out their party to see if they are attacked and then save the day and while under payment still decide to travel with them.\n\nNow 2 episodes later we find and even younger child alone in the woods, and his instinct is the leave the child behind.\n\nSoo..... did his character just suddenly develop in a totally different direction?   \ndoes he only have the urge to save some kids but not all kids ?",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ia1mt4/american_primeval_character_inconsistency_some/"
    },
    {
        "id": "1ia0auo",
        "author": "Shinola79",
        "title": "Question on Netflix with Ads",
        "content": "I would like to save money every month and go to the ad based service but what is holding me back are the types of ads. We have a 4 year old and I am amazed at the ads other services are showing during family shows and even kids shows. Heck even the banner at the top of Disney isn’t appropriate for their kids account…kid shows listed under a scary monster 🙄\n\nAnyone unhappy with the ad content their child might see?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ia0auo/question_on_netflix_with_ads/"
    },
    {
        "id": "1i9z1zg",
        "author": "Aware-Leg-6725",
        "title": "I need a show to watch",
        "content": "I have not watched much shows so there is lots for me to watch. I have seen the big hits of stranger things, Wednesday, and squid game plus a few miscellaneous reality shows like squid game the challenge. What are your top recommendations.",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1i9z1zg/i_need_a_show_to_watch/"
    },
    {
        "id": "1i94kc3",
        "author": "mntgoat",
        "title": "Kevin Can F**k Himself",
        "content": "If you have some time to check out a very unique show, please give Kevin Can F**k Himself a chance. \n\nI don't want to spoil it for anyone, I feel it is best to just be surprised by the format.\n\nSmall warning, you must make it past the first scene before giving up. \n\nApologies if this has been posted before but I just haven't seen it mentioned here before. \n\n",
        "upvotes": 109,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1i94kc3/kevin_can_fk_himself/"
    },
    {
        "id": "1i94xib",
        "author": "Honest-Regular-9561",
        "title": "Is the Night Agent actually good man?",
        "content": "I’ve been seeing so much promotion for the new season and it’s starting to intrigue me. I need to know is this show good. Not average because I could watch other stuff if it’s just a regular show. With all the hype is it some of the best when it comes to Netflix shows? The name always threw me off.",
        "upvotes": 84,
        "comments": 112,
        "media": null,
        "permalink": "/r/netflix/comments/1i94xib/is_the_night_agent_actually_good_man/"
    },
    {
        "id": "1i9vddz",
        "author": "No-Cantaloupe2132",
        "title": "Sand Castle: When 'psychological' means 'nonsensical'",
        "content": "Spoiler alert!\n\nThe first half:  vibes of thrill and a beautiful family working together to survive. \n\nThen it all turns for the worse.  The mom delves into the water to save her drowning kid.  And from this point onwards, little to nothing made sense.  Suddenly Jana(?) turned out not to be in the water.  Then the mom drowned?  Although it was never clear, because they dragged her into the cabin(?).  \n\nYep — dead I guess?  She never appeared again, so.  But the brother (Adam) tells Jana nothing.  The dad asks for a cup of coffee.  Then a bit later he crawls out to the shore and appears to have some sort of strange seizure.  The son (Adam) puts on his headphones.  Is the dad dead now too?\n\n\"We'll see mom and dad soon,\" the son tells his sister.  Ehm . . . okay, is that a look back to when they were alone in the boat, before it capsized (mentioned in the beginning)?  Nope, they seem to be on the island still, so it's the present.  \n\nAnd then too much psychological randomness to handle.  Pictures flashing by, views into different places without context.  All kids in a school being bombed (seemingly on the island too?).  And Yara, which I thought was Jana's late sister, wearing that shoe.  \n\nSuddenly the island is covered with water, rising and rising, and from the lighthouse a blow-up boat suddenly unfolds — which had previously been underneath the sand on the shore. \n\nThat's right after they managed to communicate their location on the radio and saw help pass by, upon which Adam thought he could swin out to the boat with a short rope for safety. \n\nWhat am I missing?  \nWhy was it so incomprehensible to me?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i9vddz/sand_castle_when_psychological_means_nonsensical/"
    },
    {
        "id": "1i9v7h2",
        "author": "Lil_Slice_PJ",
        "title": "Hidden gem",
        "content": "My gf and I have recently stumbled across the show Loudermilk. It’s about a substance abuse counselor also an ex addict, meetings that he host. Triggers, along with his events that take place in his life. \nAs a child of two alcoholic parents this series appeals to me. I find it very entertaining. \nRon Livingston, who plays the main character Sam loudermilk is an excellent actor . I feel as if he isn’t acting that’s just the type of person he is and I love it. If you haven’t seen it I encourage you to watch at least 2 episodes. \nEach which are 30 minutes long definitely worth the watch IMP. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9v7h2/hidden_gem/"
    },
    {
        "id": "1i8rjwk",
        "author": "Sweaty-Toe-6211",
        "title": "Netflix has reached an agreement and renewed the Breaking Bad series until April 18, 2027.",
        "content": "",
        "upvotes": 450,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1i8rjwk/netflix_has_reached_an_agreement_and_renewed_the/"
    },
    {
        "id": "1i9lush",
        "author": "HyperActive1DUK",
        "title": "Is there any way to see movies in my list that have been removed from the platform?",
        "content": "I tried asking Netflix support about this, but the agent didn't seem to understand the question no matter how I worded it, so I thought it might be a better use of my time to ask here.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i9lush/is_there_any_way_to_see_movies_in_my_list_that/"
    },
    {
        "id": "1i8muj5",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game Season 3 Is Coming ‘Sooner Than You Expect’ Director Says",
        "content": "",
        "upvotes": 1079,
        "comments": 137,
        "media": null,
        "permalink": "/r/netflix/comments/1i8muj5/squid_game_season_3_is_coming_sooner_than_you/"
    },
    {
        "id": "1i9rshq",
        "author": "Doonkeh",
        "title": "Unauthorised Password Change - Cannot Contact Netflix via Help Centre as Told to do so.",
        "content": "Email was just changed without my permission.\n\nhttps://preview.redd.it/du0738eua6fe1.png?width=822&amp;format=png&amp;auto=webp&amp;s=e6dd1ce746ad7b4fde59a72603e16d047106bda8\n\nWebsite states this, when I click on contact us, it takes me back to the help centre.\n\n  \nAny way to contact without being led in circles? I have emailed the email that had informed me the email had been changed but haven't had anything back. Is that email a no-reply?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9rshq/unauthorised_password_change_cannot_contact/"
    },
    {
        "id": "1i9ekkb",
        "author": "Thin_Reward4843",
        "title": "[REQUEST] does anyone know this show?",
        "content": "Recent English language (American) Netflix drama series about a suburban family where someone shows up out of nowhere to a party and won't leave or something. The trailer is a guy at a party and another guy asking him to leave. It's a drama, not a comedy. It was not popular, didn't get a ton of reviews, isn't talked about a lot on Reddit. Every time I try to google it the browser takes me to the stupid app. I saw the trailer at my in laws house. I think it was called the Stranger or the Invitation or the Gift or something but I know those are all other movies or shows. Ugh. Help please! Does not come up when you google any of this. ",
        "upvotes": 10,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1i9ekkb/request_does_anyone_know_this_show/"
    },
    {
        "id": "1i9z5d2",
        "author": "Old_Investigator_427",
        "title": "What Inspired the Squid Game Sets? Discover the Architectural Influences Behind the Iconic Design!",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9z5d2/what_inspired_the_squid_game_sets_discover_the/"
    },
    {
        "id": "1i9k9wx",
        "author": "North_Drummer2034",
        "title": "Tell Me Who I Am",
        "content": "I watched this last night at work and I’m confused about all the hate towards the brother after reading some other reviews. I feel like if I was Alex, I wouldn’t want to know. I don’t understand the whole “you kept this from me and it’s the ultimate betrayal” thing. What is the point of telling someone about trauma and abuse that they went through if they would’ve never remembered it. I think Marcus was right for trying to protect his brother. What do you guys think? I feel like I’m alone in this opinion ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9k9wx/tell_me_who_i_am/"
    },
    {
        "id": "1i9r90y",
        "author": "Disastrous_Note5286",
        "title": "Favourite part about Night Agent Season 2",
        "content": "Seems a lot of people arent fans of season 2 but I enjoyed it, my favourite character was Solomons. It honestly makes me want to see a show about a guy who does extremely bad things for a good reason, while having his demeanour. They could've done much more with him, sad.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i9r90y/favourite_part_about_night_agent_season_2/"
    },
    {
        "id": "1i8x25x",
        "author": "LauraEats",
        "title": "'Squid Game' Topped the 2024 Single-Week Charts with 4.9 Billion Minutes Watched",
        "content": "",
        "upvotes": 64,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i8x25x/squid_game_topped_the_2024_singleweek_charts_with/"
    },
    {
        "id": "1i9ym59",
        "author": "ItsUrBoiTyga78610917",
        "title": "Black Summer is terrible",
        "content": "They spent more time trying to make shots cinematic than actually be good. I wasn’t a fan of the non cuts. Camera work like that can be great but when you unnecessarily do it and overuse the shot it gets tiring. So many things happened that would just go unanswered. Like what happened to the kids in the school or what happened in the stadium? We get introduced to so many things and then we move on the next second. So many characters are killed off and we never revisit it either. Like no one feels bad that our friend just died? Or how spears is a criminal? Sun is the only enjoyable thing about the show and it’s funny because she can’t even speak English. On top of that does anyone know how to close a door? Maybe if the seasons had more episodes we could get more answers. On S2E5 and feel like I wasted so much time. I do realize that I have 3 episodes left and questions can be answered but I doubt it.",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1i9ym59/black_summer_is_terrible/"
    },
    {
        "id": "1i9swh2",
        "author": "SeaCattle8658",
        "title": "Any series you can recommend on Netflix?",
        "content": "I loved the Cable girls,money heist ,breaking bad ,society ,who killed sara ,Riverdale  (not on Netflix but i loved Handsmaid tale )i feel like i have watched almost anything i can think of please help ? I love psychological  series ",
        "upvotes": 0,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1i9swh2/any_series_you_can_recommend_on_netflix/"
    },
    {
        "id": "1i9gdbu",
        "author": "megs21111",
        "title": "Cant use netflix on my other phone",
        "content": "Does anybody else have the same problem? I already paid netflix for 2 devices but unfortunately its only working on one device everytime i try to sign in on my other phone its says wrong password but its the right password and its working normally in my other phone , why??? How to fix this? Its so annoying i want to watch with my other phone! Netflix is greedy or sumething?\n\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9gdbu/cant_use_netflix_on_my_other_phone/"
    },
    {
        "id": "1i9hm99",
        "author": "Potty-",
        "title": "Saturday Morning All Star Hits - What Do You Think?",
        "content": "This sketch series from Netflix, Saturday Morning All Star Hits, is somehow way better than The Who Was Show, a show which I think ripped off Horrible Histories. How about you? What do you think of Saturday Morning All Star Hits?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9hm99/saturday_morning_all_star_hits_what_do_you_think/"
    },
    {
        "id": "1i9pxxy",
        "author": "badicaldude22",
        "title": "How to see the \"previously on this show\" recap?",
        "content": "My wife and I have been slow-binging This Is Us (1-2 episodes/night) on Hulu. I recently realized it's also on Netflix and since we already have Netflix and have nothing else to watch on Hulu currently, we're canceling Hulu. But when we switched to watching it on Netflix the 30-second \"previously on This Is Us\" recap no longer plays. It always played on Hulu. When we didn't feel like watching it, it was very easy to skip by pressing the \"forward 10 seconds\" button a couple times, but I found it nice to watch if we took a break from the show or when they brought back characters/storylines from several episodes or seasons back. \n\nI've clicked through the settings and can't find a way to get it to play. I also searched on this sub. In one post from 3 years ago someone said \"it's in trailers and more at the bottom of the episode list.\" I scrolled to the bottom of the episode list and there is nothing that says trailers and more. In another post from a year ago, someone said to toggle the \"watch from the beginning\" setting. I couldn't find that setting, and furthermore, when I googled how to find it, I found several other posts about it that said the actual function of that setting is (was?) to reset your watch history on a show so that it starts from the first episode of the first season again. That's not what I want to do.\n\nIf there is a setting that works in 2025 to cause the recap to play at the beginning of each episode let me know",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i9pxxy/how_to_see_the_previously_on_this_show_recap/"
    },
    {
        "id": "1i90h6o",
        "author": "whokeshav",
        "title": "Finished watching The Night Agent Season 2",
        "content": "I believe the season 1 story line is way better than season 2 though they introduced lot of characters in new season but the thriller is missing I didn’t liked the Catherine’s character, Alice was way better overall watch is worth it’s Peter’s character which is keeping the whole storyline alive. ",
        "upvotes": 22,
        "comments": 113,
        "media": null,
        "permalink": "/r/netflix/comments/1i90h6o/finished_watching_the_night_agent_season_2/"
    },
    {
        "id": "1i9bo05",
        "author": "verxram",
        "title": "Help-Some contents won't show in other profiles",
        "content": "The netflix account  is from my wife. We're from the philippines. After we visit hongkong and macau, my wife noticed that some content are not showing up like the Apothecary Diaries after we visit those places. However, for my profile, the series is shown and i can watch it. Btw, she used esim while i used a physical sim for internet. How to troubleshoot this issue on my wife's profile? thanks",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i9bo05/helpsome_contents_wont_show_in_other_profiles/"
    }
]