[
    {
        "id": "1gojfbv",
        "author": "AutoModerator",
        "title": "L'Ammazzacaffè di r/Italia",
        "content": "L'Ammazzacaffé r\\/italiano. Posta quello che vuoi, quando vuoi. Nuovo thread ogni settimana.\n\n#Wiki di r/Italia\n\nServe un'intro a reddit? leggi qui:\n\nhttps://www.reddit.com/r/Italia/wiki/index/\n\n#Ti servono i mod?\n\nScrivi in modmail cliccando [qui](https://www.reddit.com/message/compose?to=/r/Italia)",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/Italia/comments/1gojfbv/lammazzacaffè_di_ritalia/"
    },
    {
        "id": "1gmm7ny",
        "author": "senove2900",
        "title": "Riapriamo r/Perugia!",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/Italia/comments/1gmm7ny/riapriamo_rperugia/"
    },
    {
        "id": "1gq8125",
        "author": "PM_me_your_evil_plan",
        "title": "No, i contromanifestanti a Bologna avevano ragione",
        "content": "A grande¹ richiesta, batto il ferro quando è caldo per spiegarvi un due cose sulle manifestazioni e sul perché questa vicenda sia stata creata ad hoc come spot elettorale per la destra. (n°1: una persona)\n\n\nParto subito col dire, ripudio ogni tipo di violenza senza se e senza ma, compreso in questo caso, ed è esattamente per questa ragione è doveroso castigare l'operato della Questura di Bologna.\n\nMa andiamo con ordine: in Italia per fare legalmente qualsiasi tipo di manifestazione questa deve essere \"autorizzata\" (tecnicamente è un avviso, ma di fatto è un'autorizzazione) dal questore che può porre prescrizioni e, in casi estremi, annullarle per motivi di ordine *e* sicurezza pubblici² (e qui metteteci una nota bella grande che è un punto molto importante). Fareste fare un raduno ad Al-Qaida in Vaticano sotto Natale con la specifica motivazione di portare giustizia agli infedeli? In questi casi il questore può decidere di annullare l'evento: capita relativamente spesso che manifestazioni, anche per motivi estranei all'organizzazione, possano subire pesanti prescrizioni. Ad esempio, se la tua festa di paese degenera col tempo e si riempie di gente il cui unico scopo è spaccarsi le ginocchia a metà, anche quando poi prendi provvedimenti tipo il divieto di servire alcolici, può essere che il Questore ti ponga restrizioni pesanti tanto da fartelo annulare. Tutto questo per dire, c'è sempre la possibilità che una dimostrazione venga vietata nel caso possa portare a problemi pubblici. Vi faccio un altro esempio più attinente: ora immaginate che quelli di PaP vogliano organizzare una protesta a Roma lì dove ogni anno i fascisti usano la scusa della commemorazione per radunarsi. È ovvio che tale manifestazione sarebbe una provocazione che porterebbe a scontri, quindi col ciufolo che il Questore te la lascia fare senza pesanti prescrizioni (tipo spostandola a Canicattì). E vi dirò, è anche giusto così, è chiaro che se porti l'avviso di manifestazione per una cosa del genere che in questura ti ridano in faccia, perché per quanto possa starmi sul cazzo è comunque giusto che i fascisti possano commemorare due ragazzi ammazzati ed è giusto che nessuno metta a rischio ciò. Ma è qui che tolgo la nota n°2: se le manifestazioni possono essere prescritte e annullate perché è stato permesso ai fascisti di farne una a Bologna? Perché l'autorizzazione è stata data nonostante il parere contrario del Comune e della Regione (e sì, conta)? Perché li hanno lasciati partire dalla stazione? Perché, nonostante questi gruppi siano notoriamente responsabili di atti di violenza e vandalici, non solo non hanno ricevuto prescrizioni ma il cordone di sicurezza era così fallace? Perché c'erano così pochi celerini? Perché fascisti e poliziotti erano in comunicazione? Perché i politici al governo sembravano aver già pronti i discorsi a protesta neanche conclusa, che parlavano di scontri tra manifestanti quando questi non ci sono stati (anche perché non ne parlano quando ci sono vere e proprie violenze fasciste ai danni degli eventi di \"sinistra\", ossia non necessariamente di destra)? Perché sotto campagna elettorale?\n\nQuesti sono un po' troppi perché, e soprattutto troppe domande a cui la risposta \"Il Questore di Bologna ha creato personalmente questa manifestazione in modo tale da creare una situazione in cui i fascisti, la destra al governo, vengono visti come i \"buoni\"\". E non solo quello: perché tutte le questioni che vengono risolte dalla semplice complicità tra fascisti e questura avrebbero in alternativa soluzioni che sarebbero *peggiori* nel qual caso la mia ipotesi fosse sbagliata, perché non fai partire un corteo di destra dalla Stazione Centrale di Bologna a meno che tu o sei in malafede o completamente e pericolosamente incompetente.\n\nOra che ho detto la verità andiamo a snocciolarla: non è detto che il Questore sia necessariamente colpevole, perché per quanto sia praticamente una delle cariche principali dello stato lui comunque risponde al Viminale, se Piantedosi gli dice di farlo lui è obbligato ad obbedire. È comunque sua responsabilità però, poteva denunciare le pressioni subite.\nPoi, è evidente la mancanza di chiaro intento violento dei contromanifestanti, so parla di cariche della polizia e di gente che sfonda cordoni ma non vedo i tipici elementi delle proteste violente, e sì ho visto i video, ma gente con sciarpa e bastone ci sono in tutte le manifestazioni. Non ho visto nessuno accerchiare e picchiare se non i celerini stessi.\nTre e ancora più importante, e seguitemi che è un punto importante ma difficile da comprendere, se la tua manifestazione è per la sicurezza allora dovrebbe essere consentito partecipare anche a quelli che ti credono te stesso rischio per la sicurezza, e siccome le proteste dovrebbero essere aperte a tutti anche ai normali italiani dovrebbe essere consentito farne parte, il problema è che se poi nascono scontri i responsabili sono quelli che hanno organizzato la manifestazione, che è il motivo per cui c'è stata così tanta continuità tra forze dell'ordine e fascisti, non volevano che la manifestazione implodesse a causa della violenza che la contraddistingueva ma facendo ciò hanno di fatto comunque violato il diritto di manifestare delle persone.\nInfine, una manifestazione di fasci a Bologna che davvero? Se non è diventata carneficina lo è solo per merito della sinistra: vuoi che avrà perso gli artigli, vuoi che in realtà sia moralmente più irreprensibile della destra, il sangue descritto dal governo non c'è stato.\n\n\nTl;Nl: la Questura è la sola responsabile degli scontri avvenuti a Bologna.",
        "upvotes": 39,
        "comments": 29,
        "media": null,
        "permalink": "/r/Italia/comments/1gq8125/no_i_contromanifestanti_a_bologna_avevano_ragione/"
    },
    {
        "id": "1gpqwcz",
        "author": "Lukedf9",
        "title": "Perle di Giorgia Meloni",
        "content": "Quante ne deve combinare o dire ancora?\nÈ una mi impressione o sta accumulando figure di merda una dopo l’altra? \nCosa pensa la gente che l’ha votata a distanza di qualche anno?",
        "upvotes": 224,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/at4jsgt8fi0e1.jpeg?auto=webp&amp;s=5cfe4ebae904b4a03fcaaa0f9147ed4b0b889696"
        },
        "permalink": "/r/Italia/comments/1gpqwcz/perle_di_giorgia_meloni/"
    },
    {
        "id": "1gq6ltd",
        "author": "teorm",
        "title": "Rapporto Caritas: 'In povertà assoluta un italiano su 10'",
        "content": "",
        "upvotes": 21,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fa4fjJmJoy-HqpDCFqnyrG3nn_zLAeaBgn8HBPgMHy0.jpg?auto=webp&amp;s=6425880efafb5cd5f325d58b4b0e416692fe1d58"
        },
        "permalink": "/r/Italia/comments/1gq6ltd/rapporto_caritas_in_povertà_assoluta_un_italiano/"
    },
    {
        "id": "1gpznok",
        "author": "91DarioASR",
        "title": "Rumore inquietante di notte 😰😰",
        "content": "Sono le 1:00 di notte. Ero in bagno a pisciare con la porta aperta e sento come il rumore di una maniglia tirata giù di violenza, come quando uno apre una porta di violenza.\n\nLa porta del bagno era aperta. Mi si gela il sangue perché penso che la mia ragazza non è così pazza da aprire di botto di notte.\n\nLa chiamo, non risponde. Dico si sarà aperta la porta con gli spifferi. Esco dal bagno e tutte le porte sono chiuse e lei stava dormendo 😰😰 cosa cazzo era quel rumore ? L’ho sentito e anche molto forte e veniva da dentro casa.  \n\nAdesso sento un sibilo che va e viene, anche molto forte. Mi è letteralmente passato il sonno. Soprattutto non riesco a darmi una spiegazione su cosa è stato quel rumore e cosa è questo sibilo che va avanti da mezz’ora.\n\nNon so come dormire, passerò la notte in bianco ",
        "upvotes": 50,
        "comments": 56,
        "media": null,
        "permalink": "/r/Italia/comments/1gpznok/rumore_inquietante_di_notte/"
    },
    {
        "id": "1gq71ba",
        "author": "teorm",
        "title": "Gruber: «Su di me fake news, se governo guida il Paese come manipola informazioni, bisogna preoccuparsi»",
        "content": "",
        "upvotes": 13,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PLYKaLwC9Z30lAJHuO-okxSl1bpGsf1w63MrmE4ZcxQ.jpg?auto=webp&amp;s=b19dc138816c7e0d059905e498ff2c99037db491"
        },
        "permalink": "/r/Italia/comments/1gq71ba/gruber_su_di_me_fake_news_se_governo_guida_il/"
    },
    {
        "id": "1gpvqax",
        "author": "TiLancioUnaMolotov",
        "title": "oggi sono stato investito",
        "content": "oggi stavo andando in palestra, ero arrivato propio di fronte all'entrata dove c'è una strada abbastanza affolata, una macchina si ferma gentilmente per farmi passare la strada e dopo aver passato la prima corsia guardo per la seconda e vedo arrivare una macchina che rallenta, essendo sicuro che mi avesse visto passo ma sto qua invece di fermarsi continua (stava andando almeno a 50/60), fortunatamente mi sono reso conto che mi arrivava addosso e ho avuto il riflesso di \"pararmi\" e quindi ho attutito molto l'impatto, comunque cado a terra e mi cago addosso, mi rialzo subito con l'idea di riempire di botte chi dietro al volante.\nquando stava per partire il gancio guardo la macchina e vedo il parabrezza sfondato (si, sono stato io) quindi mi fermo e nonostante il tipo insiteva di portarmi al pronto soccorso io ho rifiutato e sono andato ad allenarmi tranquillamente. l'unico errore è stato non prendere la targa ma a sangue caldo non c'ho propio pensato.\ncomunque dopo la botta di adrenalina mi sono sentito dio sceso in terra ahaha.\nVolevo condividere questa esperienza, se qualcosa non è chiara chiedete che non so scrivere\n\naggiornamento: domani mattina andrò in pronto soccorso, sta sera non riesco propio anche perché se vado in quello del mio paese mi mandano in un altro paese perchè da me il ps fa schifo e non hanno neanche un dottore per controllarmi\naggiornamento 2: sta mattina mi sono svegliato senza dolori, vado al ps e non ho nulla, si sono un testa di cazzo ma sono anche convinto che sono una bestia ",
        "upvotes": 55,
        "comments": 77,
        "media": null,
        "permalink": "/r/Italia/comments/1gpvqax/oggi_sono_stato_investito/"
    },
    {
        "id": "1gphzmq",
        "author": "Asiablog",
        "title": "12 NOVEMBRE 2003. Attentato di Nassiriya. In Iraq, un gruppo di militanti di al-Qāida a bordo di un’autocisterna forza l’entrata della base Maestrale e fa esplodere un'autobomba che uccide 28 persone: 9 iracheni e 19 italiani, di cui 12 carabinieri, 5 militari e 2 civili.",
        "content": "",
        "upvotes": 302,
        "comments": 84,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c9l2ufoz9g0e1.jpeg?auto=webp&amp;s=3ac83114f3bfb4230438db376c6074001e32b130"
        },
        "permalink": "/r/Italia/comments/1gphzmq/12_novembre_2003_attentato_di_nassiriya_in_iraq/"
    },
    {
        "id": "1gpl6ld",
        "author": "LePertichenelQLO",
        "title": "Elon Musk a \"Quarta Repubblica\": \"Natalità problema globale, in Italia dovete fare figli\"",
        "content": "**\"In Italia dovete fare figli\".** È questo il monito di **Elon Musk** durante la sua intervista esclusiva con **Nicola Porro** durante la puntata di **\"Quarta Repubblica\"** di lunedì 11 novembre. Inoltre \"These judges need to go\", \"questi giudici devono andarsene\". Così **Elon Musk** ha commentato su X il post di un utente che riportava la notizia della **sospensione della convalida del trattenimento per 7 migranti** decisa dalla sezione immigrazione del Tribunale di Roma, che si è anche rimesso alla Corte Ue.\n\nSinceramente non sto capendo come mai Musk intervenga in questo modo, così autoritario, sulla direzione che deve ottenere il governo italiano. Certo, la Meloni ha mostrato interesse nei suoi confronti, ma, presumo, per politiche commerciali ed internazionali. [Boh, io trovo del tutto fuori luogo questi suoi interventi](https://myspacecomrafaelcoche.blogspot.com/2024/11/elon-musk-quarta-repubblica-natalita.html)\n\n[https://www.tgcom24.mediaset.it/politica/elon-musk-quarta-repubblica-natalita\\_90211743-202402k.shtml](https://www.tgcom24.mediaset.it/politica/elon-musk-quarta-repubblica-natalita_90211743-202402k.shtml)",
        "upvotes": 156,
        "comments": 273,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1_qqnYW7HpxuR33xmAdbbD7zYLGw2QLlvWFBbWC68-Y.jpg?auto=webp&amp;s=32e163ed802f9c5956440502ea0f6f4687d33d17"
        },
        "permalink": "/r/Italia/comments/1gpl6ld/elon_musk_a_quarta_repubblica_natalità_problema/"
    },
    {
        "id": "1gpnowa",
        "author": "DualLegFlamingo",
        "title": "\"These judges need to go\": Elon Musk dice la sua riferendosi ai giudici che hanno bocciato l'opzione centri di accoglienza per migranti in Albania ",
        "content": "Mi chiedo cosa sarebbe successo se Musk (o miliardario simile e non italiano) avesse fatto una sorta di endorsement verso un governo PD/tecnico/non dell'attuale destra italiana.\n\n\nFonte dell'articolo Repubblica, lo so. Il focus non è l'editore ma l'eventuale universo parallelo di cui sopra.",
        "upvotes": 103,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DRLP_KaLHvtymE23YbbUaehHt3AR0qGOfhh37luptxg.jpg?auto=webp&amp;s=058674a27bb16b81ee27bc81ab0b68e19863f3c3"
        },
        "permalink": "/r/Italia/comments/1gpnowa/these_judges_need_to_go_elon_musk_dice_la_sua/"
    },
    {
        "id": "1gph00f",
        "author": "Solaredinotte",
        "title": "Come fanno i dottori ad evadere le tasse?",
        "content": "Sono stato nella sala d’attesa di un dottore privato normalissimo per due ore. Visitava una persona ogni 20 minuti, e il costo della visita era di 40 euro (a nero).\n\nMi sono fatto due calcoli veloci e si intasca la media di 960€ al giorno al ritmo di 8 ore.\n\nNon voglio fare polemica sull’evasione delle tasse ecc. Mi chiedo come si possono dichiarare circa &lt;30k al mese di nero? Posso capire €200 e ci fai la spesa in contanti, ma una somma così grande deve essere versata come minimo in banca no? Sbaglio qualcosa?",
        "upvotes": 315,
        "comments": 297,
        "media": null,
        "permalink": "/r/Italia/comments/1gph00f/come_fanno_i_dottori_ad_evadere_le_tasse/"
    },
    {
        "id": "1gpw3qk",
        "author": "DiegoFerra",
        "title": "Smettiamo di dare del furbo a chi aggira le regole",
        "content": "https://blog.urbanfile.org/2024/11/12/milano-trasporti-m2-stop-ai-furbetti-del-cancelletto/?unapproved=184728&amp;moderation-hash=d4ab07b42fc9de41fe5877ad7a91299e#comment-184728\nPrendo spunto da questo articolo che chiama \"furbetti\" quelli che saltano i tornelli/usano la metro senza pagare. Si dovrebbero usare termini come incivili o disonesti. Finché chi aggira le regole è definito \"furbo\" la cosa sarà vista come più intelligente",
        "upvotes": 32,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-HmEPC4Vw3BbJHRUzCZLebnuBGOanRTiDLuX8t-CcYw.jpg?auto=webp&amp;s=e4a3ca122d6ed1b26521b31f85615237aaa495f4"
        },
        "permalink": "/r/Italia/comments/1gpw3qk/smettiamo_di_dare_del_furbo_a_chi_aggira_le_regole/"
    },
    {
        "id": "1gpi464",
        "author": "Lower_Boysenberry794",
        "title": "Storia triste sul capitalismo in Italia.",
        "content": "Ho un amico d'infanzia (M35) che ha intrapreso la carriera di chef, il cui sogno è sempre stato aprire un locale tutto suo. Terminata la scuola, ha fatto esperienza in giro per il mondo, inizialmente su navi da crociera per poi passare a ristoranti in USA/Inghilterra fintanto che non è riuscito a racimolare abbastanza per aprire il suo locale.\n\nCirca un anno e mezzo fa ha deciso di fare il grande passo e tornare in Italia, aprendo un ristorantino di pesce in un paese vicino. Per via della mia mentalità con propensione al rischio pari allo zero assoluto, gli ho sconsigliato la mossa e piuttosto di continuare a fare lo chef da mercenario, visto che ora ha un buon nome e di conseguenza lavoro e paga ottima li trova molto facilmente.  \nPer aprire il locale ha dovuto affrontare parecchie spese, dai macchinari e strumenti per la cucina a sistemare il posto, motivo per il quale ha dovuto aprire un piccolo mutuo con la banca. A questo aggiungiamo il fatto che è in affitto.\n\nL'esperienza e la bravura degli anni però hanno fatto il loro, infatti mi diceva che per i primi mesi le cose gli sono andate molto bene, rientrava dai costi e tutto sommato vedeva una buona crescita della clientela.  \nTutto finchè non gli hanno aperto un altro ristorante (sempre specialità pesce) a 50 metri di distanza, con la stessa impronta del suo per clientela e prezzi.  \nVoi direte: normale concorrenza, e ci sta. Vince il migliore e ne beneficia la qualità.\n\nInvece salta fuori che il secondo ristorante è stato aperto da un tizio, figlio di un noto industriale della zona. Questo (ironia della sorte) è un nostro coetaneo, famoso perchè dedito alla bella vita e per aver lavorato qualcosa come mai in vita sua. Preciso che non parlo di gente benestante, ma di gente schifosamente ricca, per darvi un'idea ha la barchetta ormeggiata non so dove (con piscina sul ponte), ogni estate fa qualche settimana veleggiando a Ibiza e posti simili. E fin qui nulla di male.  \nSe non fosse che il tizio, giocando con i soldi del monopoli, da qualche anno a questa parte apre e chiude locali in provincia, non sapendo un beneamato cazzo di come si fa ristorazione. Prende un posto, lo rimodernizza, ci piazza dentro un *manager* che faccia tutto e gestisca il posto. Un paio sono ancora aperti, mentre ne ha chiusi 3 (di quelli che conosco io).  \nMia personale opinione è che cerchi di far vedere al papi che anche lui è un bravo ~~feudatario~~ imprenditore, ma le sfumature psicologiche le lascio da parte.\n\nTornando al ristorante, lo ha aperto da meno di un anno; ho un'amica che per pagarsi gli studi fa la cameriera lì il fine settimana, dice che lavoricchiano il sabato/domenica e basta, qualche tavolo ma poca roba. E la cosa si nota passandoci davanti.  \nAl mio amico girano un pò i maroni perchè per quanto poco qualche tavolo glielo porta via, ha notato un leggero calo ma se devi pagare utenze, affitto, mutuo e via dicendo, un solo tavolo ti fa la differenza.  \nE si chiede come fa questo a tirare avanti avendo da pagare personale (e *manager*), pure lui in affitto e come clienti fa meno di un quarto dei suoi.   \nCon la lieve differenza che il mio amico ci passa 12 ore al giorno dentro al ristorante.\n\nConcludo dicendo che questa storia (a mio avviso) rappresenta in pieno il fare impresa in Italia. O sei uscito dal buco giusto, o sei un fenomeno. E anche in quel caso, spera sempre che quello nato dal buco giusto rimanga a farsi le piste in barca.\n\n  \n",
        "upvotes": 193,
        "comments": 123,
        "media": null,
        "permalink": "/r/Italia/comments/1gpi464/storia_triste_sul_capitalismo_in_italia/"
    },
    {
        "id": "1gq7tp0",
        "author": "Zemiriel",
        "title": "Lamezia Terme, aggredito con un manganello il primario del Pronto soccorso: arrestato 28enne | Il medico: \"Non si lavora più serenamente, è inaccettabile\"",
        "content": "",
        "upvotes": 4,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VWKumZXLqCJYlXHIivQUEpF9s5Qy-2HSk82knOmS2_E.jpg?auto=webp&amp;s=780d779146ab4557d5b38aef89047a008a958d3d"
        },
        "permalink": "/r/Italia/comments/1gq7tp0/lamezia_terme_aggredito_con_un_manganello_il/"
    },
    {
        "id": "1gq8nf5",
        "author": "Zaku71",
        "title": "I napoletani sono i più grandi razzisti gastronomici d'Italia (rant semiserio, pieno di pregiudizi e generalizzazioni).",
        "content": "E non lo dico io: lo dicono loro con orgoglio.\n\nPer loro ogni cucina regionale d'Italia (eccetto la propria) fa schifo. Si salvano qua e là singoli piatti nelle altre regioni del sud, ma tutto quello cucinato a nord della Campania è una schifezza immangiabile, pretenziosa e assurdamente cara buona solo per l'umido.\n\nLo esprime benissimo Francesco Arienzo, monologhista napoletano, in questo video  \n[Come far incazzare un napoletano](https://youtu.be/dO-B-9WH0hY?si=eeU6akmMoiReVS9f&amp;t=443)\n\n\"Ma fatemi capire una cosa: come mai che da Napoli in su costa tutto il doppio e si mangia una chiavica?\" (sul prezzo ho un'ipotesi, sarà correlato al numero di scontrini emessi?)\n\nUn napoletano se si trova per qualche motivo al nord d'Italia (dopo essersi lamentato di quanto faccia schifo là), piuttosto che assaggiare degli strozzapreti o un risotto alla milanese mangerà sushi o kebab. Trova più fratellanza gastronomica nel nord Africa o nel sud-est asiatico che col settentrione del suo paese (solitamente si giustifica col prezzo, ma anche se glieli offrissero gratis gli si leggerebbe benissimo in faccia cosa penserebbe della cucina autoctona).\n\nMa il peggio, secondo la mia esperienza, lo da a Roma quando mangia una pizza alla romana. Quando mi è capitato di assistervi, ogni volta dicono. La. Stessa. Identica. Battuta:\n\n\"Ma che è 'na pizza questa? E' nu cracker condito! AHAHAHAHAAH\".\n\nAh, i grandi esempi della comicità partenopea, degni eredi di De Filippo e Totò!\n\nCari amici napoletani, si la nostra pizza è diversa dalla vostra, ma ha una tradizione e una dignità, i suoi estimatori e ha tutto il diritto di chiamarsi \"pizza\". E a differenza di voi non pretendiamo di spiegare a tutto il mondo che sbaglia e solo noi abbiamo ragione. E siamo aperti a diversi tipi di cucine regionali a differenza di voi. Noi abbiamo pizzerie napoletane. Se una pizzeria romana provasse ad aprire da voi chiuderebbe dopo circa 10 minuti per fallimento (se non le dessero direttamente fuoco prima).\n\n(Questo sfogo è nato dopo che ho fatto assaggiare un dolce della città di Trieste - la putizza - che amo a un collega napoletano: \"Si si buono ma vuoi mettere con 'nu babà???\")",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-uTCU1OZdLJSVggUeYPfSgqjIX-lXYeuZyiP0doJnnc.jpg?auto=webp&amp;s=0c9a724fe3d7a08ed05d00576067d96684b395b5"
        },
        "permalink": "/r/Italia/comments/1gq8nf5/i_napoletani_sono_i_più_grandi_razzisti/"
    },
    {
        "id": "1gpxyit",
        "author": "terenceill",
        "title": "A quando il reato di \"stupro culinario\"? ",
        "content": "",
        "upvotes": 18,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/r7n5cdwevj0e1.png?auto=webp&amp;s=8b5a9350d63addda80aed2ef47689fb5a35acc65"
        },
        "permalink": "/r/Italia/comments/1gpxyit/a_quando_il_reato_di_stupro_culinario/"
    },
    {
        "id": "1gq88pj",
        "author": "Italia_Permission272",
        "title": "Full remote e disadattamento sociale",
        "content": "Lavoro in full remote da ormai 5 anni. Sono andato in azienda in questi anni massimo 5 volte quindi si può dire che sono davvero sempre a casa.\n\nVolevo sapere se anche a voi che lavorate sempre da casa vi sentite ogni tanto disadattati.\n\nPasso spesso le mie giornate senza parlare con nessuno se non con qualche familiare ed amico. A lavoro ho pochi meeting ed interazioni.\n\nAggiungo che sono una persona introversa quindi probabilmente mi sentirei un disagiato anche ad andare tutti i giorni in ufficio ed anzi odierei la mia vita anche di più.\n\nAvete consigli? Anche voi vi sentire così?",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/Italia/comments/1gq88pj/full_remote_e_disadattamento_sociale/"
    },
    {
        "id": "1gpp3wi",
        "author": "vedinapoliepoimuori",
        "title": "È lo Stato che deve intervenire contro l'overtourism!",
        "content": "Dato che si può costringere i proprietari di casa con le buone d'altronde ognuno fa quello che vuole dei propri immobili e dato che gli affitti brevi sono molto più remunerativi deve essere lo Stato a fare qualcosa.\nMagari farsi garante per chi ha difficoltà a pagare l'affitto oppure comprare gli immobili sfitti e imporre un'affitto decente insomma tante cose che secondo i fasci al governo non faranno mai.",
        "upvotes": 51,
        "comments": 113,
        "media": null,
        "permalink": "/r/Italia/comments/1gpp3wi/è_lo_stato_che_deve_intervenire_contro/"
    },
    {
        "id": "1gpj7sd",
        "author": "DIeG03rr3",
        "title": "Oggi mi è arrivato questo libro per la tesi. Solo ora mi rendo conto che l'autore è uno dei due professori dietro il caso di Gioventù Ribelle",
        "content": "Per chi vuole saperne di più su Gioventù Ribelle, vi lascio con [il video di Yotobi](https://youtu.be/wF4P3jiHED4?si=3okofXDhXOfSEoVW) e [un video di Luca Wright](https://www.youtube.com/live/4XvCdOe6AnM?si=Sc-iLXTYB0iGXNwY) che approfondisce ulteriormente la questione",
        "upvotes": 114,
        "comments": 18,
        "media": null,
        "permalink": "/r/Italia/comments/1gpj7sd/oggi_mi_è_arrivato_questo_libro_per_la_tesi_solo/"
    },
    {
        "id": "1gpzjmt",
        "author": "Cosimo_68",
        "title": "Dal 2025 a Firenze saranno vietate le “keybox” fuori dalle case per i turisti - Il Post",
        "content": "",
        "upvotes": 10,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8Qhod85CiKOh35H495V_ayvVpUQ0i1tMTYR8IQnvj84.jpg?auto=webp&amp;s=3c5e4958e5a14763bf5d6039065c5ef7e9d88a73"
        },
        "permalink": "/r/Italia/comments/1gpzjmt/dal_2025_a_firenze_saranno_vietate_le_keybox/"
    },
    {
        "id": "1gpvo3o",
        "author": "DurangoGango",
        "title": "Amsterdam, la troupe del Tg1 aggredita da filopalestinesi: \"Accerchiati e spinti, video cancellati\"",
        "content": "",
        "upvotes": 16,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3ZpXiSaTE7ZZpXqZcmd72x49MHkDx8ebhMqG1QFoUpM.jpg?auto=webp&amp;s=a4b816368bdae60c620fc511bf8ab73b09c3c139"
        },
        "permalink": "/r/Italia/comments/1gpvo3o/amsterdam_la_troupe_del_tg1_aggredita_da/"
    }
]