[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 496,
        "comments": 271,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j87k40",
        "author": "Internal-Bed-3150",
        "title": "Greta Gerwig wants Charli XCX in her Narnia movies",
        "content": "",
        "upvotes": 221,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1j87k40/greta_gerwig_wants_charli_xcx_in_her_narnia_movies/"
    },
    {
        "id": "1j85l1m",
        "author": "Last_Weird0717",
        "title": "American Manhunt Osama bin Laden: Not coming up on my Netflix??",
        "content": "I'm in the US and had this on my list to watch for today. Now it's suddenly not showing up at all. Anyone else having this issue? I know the release date was today, March 10th. \n\n",
        "upvotes": 133,
        "comments": 266,
        "media": null,
        "permalink": "/r/netflix/comments/1j85l1m/american_manhunt_osama_bin_laden_not_coming_up_on/"
    },
    {
        "id": "1j8ivi0",
        "author": "Way-of-Kai",
        "title": "How do we feel about 3-4 years for subsequent seasons",
        "content": "On one hand I understand the time required to deliver quality work, but a decade to conclude a story is really exhausting. Like people just move-on in life and even stop caring about something they watched 5 years ago. \n\nOnce concluded it will obviously be looked back as a peak animation that redefined its genre. But it’s frustrating for us bunch waiting for it to come out.\n\nIt’s similar case as spiderverse films, just notice how much your life has changed between each film.",
        "upvotes": 19,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ivi0/how_do_we_feel_about_34_years_for_subsequent/"
    },
    {
        "id": "1j8ebhl",
        "author": "cuzforwhy",
        "title": "Recommend Netflix shows or movies for a dental office",
        "content": "I work in a dentist office and I like to keep the tv in my operatory on, most of my patients are older folks and I need some Netflix shows or movies to play throughout the day that are appropriate and don’t have any awkward sex scenes or something, thank you.😂",
        "upvotes": 25,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ebhl/recommend_netflix_shows_or_movies_for_a_dental/"
    },
    {
        "id": "1j89yi7",
        "author": "Josh1923",
        "title": "American Manhunt: Osama bin Laden",
        "content": "Just spoke with support and they’re saying there’s no official release date. This is annoying ",
        "upvotes": 42,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1j89yi7/american_manhunt_osama_bin_laden/"
    },
    {
        "id": "1j8iab5",
        "author": "SoupDog99",
        "title": "No Dolby Vision Season 7 Drive to survive",
        "content": "Just finished watching Season 6 that worked flawlessly with Dolby vision (and still does after going back to check). Haven't changed a thing, but Season 7 of Drive to survive is not delivering Dolby vision and it's driving me nuts. \n\nAnyone have insight for why? \nGoing back and forth is night and day in quality. I am paying extra everything month for the best experience and I am not getting it.",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1j8iab5/no_dolby_vision_season_7_drive_to_survive/"
    },
    {
        "id": "1j8ly56",
        "author": "SquareDrive45",
        "title": "What is this DV5 Codec on some Netflix 4k SDR movies?",
        "content": "These are the \"information\" pages while streaming those movies on Netflix app on LG OLED TV. These are 4k SDR movies (i repeat NOT DV). Pulled up the info page for some other 4K movies as well and they say codec AV1 or HEVC, which are well known.\n\nBut what is this DV5 codec that netflix is using? Its own? A modified version of any other codec? Couldn't find any info on internet.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ly56/what_is_this_dv5_codec_on_some_netflix_4k_sdr/"
    },
    {
        "id": "1j8k70t",
        "author": "TheGame81677",
        "title": "Why is Netflix censoring Monday Night Raw?",
        "content": "I watch Raw almost every week and there’s always some kind of censorship. Tonight I am watching the match between C.M Punk and Seth Rollins. They both gave the finger to one another and the screen went black for a few seconds. You could still kind of see it though. They also bleep if anyone says the F word. Why is anything being censored at all? This isn’t network tv, it doesn’t make any sense.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j8k70t/why_is_netflix_censoring_monday_night_raw/"
    },
    {
        "id": "1j7yf42",
        "author": "EthanWilliams_TG",
        "title": "New trailer for the final season of ‘YOUʼ has been released",
        "content": "",
        "upvotes": 45,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1j7yf42/new_trailer_for_the_final_season_of_youʼ_has_been/"
    },
    {
        "id": "1j8iati",
        "author": "AggravatingShow2028",
        "title": "Beauty in Black—what!!!",
        "content": "So I’m late to the game but I just binged both parts of Beauty in Black and WHAT!! I need season 2 now! Idk what I was expecting but it had me up all night trying to finish. I love Charles btw.",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j8iati/beauty_in_blackwhat/"
    },
    {
        "id": "1j8l4n9",
        "author": "Illustrious_Fox3357",
        "title": "i found cassandra version- planktons wife",
        "content": "Karen Plankton (birthday: December 20) is one of the ten main characters of the SpongeBob Squ…  \nAs a computer, Karen is the smartest resident of Bikini Bottom and has a clever, analytical personality. She has two main forms: a big monitor on the wall or a portable wheeled computer. Along with her role as co-owner of the Chum Bucket, she works as the chef and cashier.[plankton and karen ](https://en.wikipedia.org/wiki/Plankton_and_Karen)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j8l4n9/i_found_cassandra_version_planktons_wife/"
    },
    {
        "id": "1j80met",
        "author": "strawberrycheescak",
        "title": "Netflix only has the same crime shows/movies but with the plot worded differently",
        "content": "I was looking for a thriller yesterday and all I  could find that I didn’t watch were those crime movies where someone goes missing and their family member has to find them or save them. Every 5th movie I pressed on was like that and it was the same plot but worded differently. I feel like it happens also with tv shows like why do they keep on doing that? Can’t they release shows/movies with a different plot? Maybe it depends on the countrys content but its all I ever see on netflix when looking for shows/movies or thrillers. ",
        "upvotes": 15,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1j80met/netflix_only_has_the_same_crime_showsmovies_but/"
    },
    {
        "id": "1j7ji2j",
        "author": "WhileZestyclose2413",
        "title": "Any feel good happy shows to watch on Netflix?",
        "content": "I struggle with depression and anxiety and I was looking for a happy and feel good show to watch to help me wind down and relax. Nothing too old please. ",
        "upvotes": 221,
        "comments": 352,
        "media": null,
        "permalink": "/r/netflix/comments/1j7ji2j/any_feel_good_happy_shows_to_watch_on_netflix/"
    },
    {
        "id": "1j86py5",
        "author": "Affectionate_Mess488",
        "title": "What have we missed?",
        "content": "My husband and I had a baby a year and a half ago so we haven’t had any time for TV. We’re finally getting some quiet time at night so would love a new show to watch. What are some good shows we missed over the last year or two that are worth catching up on? We love $ or crime documentaries (I.e Tinder Swindler, Wild Wild Country) and drama shows (Peaky Blinders, Lincoln Lawyer, Ozark, Crown).",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1j86py5/what_have_we_missed/"
    },
    {
        "id": "1j810o1",
        "author": "Crazy_Ad_1545",
        "title": "Running Point - Jackie and the Cheerleaders",
        "content": "Is anyone else curious why all the cheerleaders want to sleep with Jackie? They were pissed at him at first for cutting them in lieu of Red Panda. No shade to the actor, but he's not particularly good looking or alluring. Is it just because they realized he's a Gordon?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j810o1/running_point_jackie_and_the_cheerleaders/"
    },
    {
        "id": "1j8d6w7",
        "author": "Flyfishskier",
        "title": "Any way to bypass household restrictions on macbook browser?",
        "content": "title basically says it all. I know of the airplane mode for mobile apps and it works but since I mainly watch on my MacBook I cannot figure a bypass out. VPNs have never worked for me. Pretty crazy how long I had my browser working compared to my app, but now its gone unfortunately. Anybody have any solutions?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j8d6w7/any_way_to_bypass_household_restrictions_on/"
    },
    {
        "id": "1j82128",
        "author": "ArmChairDetective84",
        "title": "Different series with the same name",
        "content": "So I started to watch La Reina del Sur a few days ago and it started with her being captured then later on in the episode the prison break BUT now , the first episode is completely different …instead of showing her being arrested and Landero coming to visit her at a Colorado Federal Prison - it’s all about her life before she was arrested. \n\nI wanted to re watch the prison scenes because the way she broke out was badass but it seems to have disappeared ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j82128/different_series_with_the_same_name/"
    },
    {
        "id": "1j8biaa",
        "author": "mikestergame01",
        "title": "Force highest quality for whatever I'm watching on netflix?",
        "content": "Is there a way to force 4k or whatever the highest quality of the video you're watching on youtube?  On windows 11 what's the best way to watch netflix in a browser or using the app?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j8biaa/force_highest_quality_for_whatever_im_watching_on/"
    },
    {
        "id": "1j84vwi",
        "author": "Fast-Discussion6538",
        "title": "Netflix Recommending My Watch History to Other Profiles?",
        "content": "Hi!♥\n\n I recently added two more Netflix profiles to my account for my parents. While explaining to them how to use the app, I noticed that Netflix is recommending movies and series that I have watched or am currently watching.\n\nI still don’t really want them seeing my watch history in their recommendations. \n\nI thought profiles were supposed to be separate, so I have no idea why this is happening.\n\nIs there a way to turn this off? Or is this just how Netflix works? Any advice would be appreciated!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j84vwi/netflix_recommending_my_watch_history_to_other/"
    },
    {
        "id": "1j8dh6o",
        "author": "Jazzydiva615",
        "title": "With Love, Meghan",
        "content": "Let's Discuss With Love Meghan, new on netflix\n\nPersonally thought too much talking to the director and in that game night episode, he had to eat his sandwich on camera! Come on! That's too much!\n\nFor someone that grew up eating TV Dinners, I can appreciate the growth and evolution!! \n\nEpisode one that guy cutting himself was hilarious! Somehow I suspect he didn't know his invite involved so much work! 😆\n\nMindy definitely didn't know she was going to be working so hard! All that make up and those thick lashes. She probably expected to be massaged all day and lounging\n\nNever seen an edible flower before this series, and I'm in my 50s\n\nOverall Enjoyable",
        "upvotes": 0,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1j8dh6o/with_love_meghan/"
    },
    {
        "id": "1j7uo3r",
        "author": "Robemilak",
        "title": "Alan Ritchson Hypes That His Next Film Will Be \"The Biggest Movie Netflix Has Ever Had\"",
        "content": "",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j7uo3r/alan_ritchson_hypes_that_his_next_film_will_be/"
    },
    {
        "id": "1j7okbt",
        "author": "Odd-Network-3005",
        "title": "Tell me 8 shows that you liked too much",
        "content": "From netflix\n\n🙂 mines in no specific order:\n\n1)a series of unfortunate events\n2)the oa\n3)arcane\n4)The order\n5)archive 81\n6)dark\n7)death love robots season 3\n8)my name (korean)\n\n",
        "upvotes": 24,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1j7okbt/tell_me_8_shows_that_you_liked_too_much/"
    },
    {
        "id": "1j86xf9",
        "author": "More-Quantity-6117",
        "title": "Unique problem with my account",
        "content": "I don't really know how to solve this issue\n\nI've created a Netflix account in the past year. Haven't used it in a while so I wanna cancel the account but when I try to log in it says there's no account for that mail address. They keep charging me though. How can this be solved, is there any real customer service? I'm not in the US\n\nThanks",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j86xf9/unique_problem_with_my_account/"
    },
    {
        "id": "1j7mxfx",
        "author": "questionsfordays22",
        "title": "HELP ME FIND NAME OF THIS SHOW",
        "content": "A man was framed for stealing documents or evidence, when he went to jail he tried figuring out what happened. He then connected with someone that was able to fake his death. He then pretended to be the nephew of a mob boss and killed everyone that was involved in framing him. \n\nHis wife was trying to figure out who wanted to frame her husband (she thinks he’s really dead). \n\nThe husbands best friend tries making a move on the wife and she turns him down and says she still in love and not over her husband…\n\nIt was a foreign Netflix limited series ",
        "upvotes": 20,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1j7mxfx/help_me_find_name_of_this_show/"
    },
    {
        "id": "1j84e2l",
        "author": "chrisarrant",
        "title": "Anora's studio Neon says A24 isn't their biggest competitor, it's Netflix. Here are the 6 movies they competed for",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j84e2l/anoras_studio_neon_says_a24_isnt_their_biggest/"
    },
    {
        "id": "1j8ewwo",
        "author": "redsoxfan1845245",
        "title": "Netflix keeps asking to update household",
        "content": "My mother and I share a plan. She’s the main acct holder in another state. I also use the acct and we only have 2 devices on it. Her TV and my TV. It’s also the plan without commercials so we should get 1 out of household device right?\n\nAny idea what is going on? I keep having to ‘update household’ and send her a text to let me log in. ",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1j8ewwo/netflix_keeps_asking_to_update_household/"
    },
    {
        "id": "1j89tqf",
        "author": "ellissabain",
        "title": "One of Running Point’s main filming locations is over 5,000 miles from LA where it’s set",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j89tqf/one_of_running_points_main_filming_locations_is/"
    },
    {
        "id": "1j7xoy2",
        "author": "kubawww1",
        "title": "Netflix Spams Notifications",
        "content": "Hello! Since yesterday the Netflix app on my Android (15, OPPO) phone started acting weird, whenever it sends a notification and I close it, it reappears almost instantly and it seems to do it for a while and then it stops.\n\nIt does that with the \"recommended for you\" thing and the \"upcoming title\". I don't want to disable them since they are useful sometimes.\n\nDoes anyone have this bug also?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j7xoy2/netflix_spams_notifications/"
    },
    {
        "id": "1j7tyvg",
        "author": "Robemilak",
        "title": "'You' Superfan Cardi B Teases the Trailer for the Series's Fifth and Final Season",
        "content": "",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j7tyvg/you_superfan_cardi_b_teases_the_trailer_for_the/"
    },
    {
        "id": "1j7x59x",
        "author": "Loner_Indian",
        "title": "What are some of the series or movies to be avoided ?",
        "content": "I mean bad is something where ending was subpar that it rendered entire previous viewing meaningless.\n\nFor example to me, and again \"Personally\", \"Lost\" was a disaster it kept on building up and building up but ending was ridiculous and  wasted my time.\n\nOn other hand Dexter (The early one not recent) also had horrible ending but it's subplot and thriller in (s1-s5) were so good that it was memorable and I still remember the scenes while for \"Lost\" I hardly recall anything. Both I watched 13 years ago.\n\nAnd coming to comedies I don't like comedies like \"Friends\", \"Seinfeld\", \"HIMYM\", \"BBT\", etc..though I like characters like Joey, Kramer, Howard but it becomes a slog waiting for them. \n\nI liked \"Office(US)\", \"Louie\", \"Two and a half men\", \"People just do nothing\", \"Silicon Valley\".\n\nEdit : Also any show you left midway because you became \"bored/tiresome\" or it lost the edge\n\nAgain this is all personal , please don't write things like \"you are too stupid\".\n\nThanks",
        "upvotes": 0,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1j7x59x/what_are_some_of_the_series_or_movies_to_be/"
    }
]