[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1qmfieq",
        "author": "EatMeImAMuffin",
        "title": "GATTO SMARRITO CERCA STALLO",
        "content": "ciao a tutti, ieri sera ho trovato questo micetto dolcissimo che vagava perso in zona Aurora/Parco Dora. Ho chiesto in giro nel mio palazzo e quelli vicini, ma nessuno lo reclama. è un maschio, mi sembra non castrato. Ha un carattere davvero calmo e dolce, sicuro è domestico.\n\nIo purtroppo non posso tenerlo, ho già un cane che non va d’accordo con il gatto e temo per l’ incolumità di entrambi.\n\nQualche anima buona riesce a tenerlo in stallo?\n\nGrazie in anticipo anche se farete girare!",
        "upvotes": 41,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1qmfieq/gatto_smarrito_cerca_stallo/"
    },
    {
        "id": "1qmjutm",
        "author": "zapatocaviar",
        "title": "Where to watch NFL tonight?",
        "content": "I live in Centro and I’m looking for somewhere that will show the early NFL playoff game tonight? It’s at 9pm. Anybody know somewhere? Grazie. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qmjutm/where_to_watch_nfl_tonight/"
    },
    {
        "id": "1qmknq5",
        "author": "speakisy",
        "title": "Quadrilatero vs San Salvario: quale è meglio per socializzare?",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qmknq5/quadrilatero_vs_san_salvario_quale_è_meglio_per/"
    },
    {
        "id": "1qluehy",
        "author": "Effective_Cherry_403",
        "title": "Truffa immobiliare Corso Chieri",
        "content": "Eh niente, mi hanno fatto firmare un contratto senza valore in CORSO CHIERI 168 e avendo visto la casa e preso le chiavi ho abbassato la guardia al livello -100. \n\nOggi ci vado e mi trovo i proprietari che mi spiegano che quella persona era semplicemente in affitto e se n'è andata via ieri. Arrivano altre persone anche loro vittime e si fa scena... \nSono stato truffato e (non) va bene, faccio denuncia e aspetto.\n\nPerò, più ci penso e più c'è qualcosa che non mi va giù. Tra il proprietario che arriva per caso 2 min dopo di me e mi dice che sono stato truffato e già sei mesi prima era successo.  Però non vuole fare denuncia perché non vuole avere problemi e non aveva pensato di mettere un qualche avviso??? \n\nTutto sommato, penso sia una truffa organizzata e vorrei saperne di più in modo da non denunciare anche i proprietari per niente.",
        "upvotes": 39,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1qluehy/truffa_immobiliare_corso_chieri/"
    },
    {
        "id": "1qmfdoh",
        "author": "Current_Emu4588",
        "title": "Vi andrebbe di creare un club del libro(età 15-20)",
        "content": "Io sono M17 è penso che sia veramente figo creare un discord per condividere le nostre letture.\nSe c'è qualcuno interessato mi scriva :3",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qmfdoh/vi_andrebbe_di_creare_un_club_del_libroetà_1520/"
    },
    {
        "id": "1qmi4o9",
        "author": "Empty_Explorer8292",
        "title": "Fare amicizia a torino",
        "content": "Sono med ho 25anni mi piachi guardare amine e altri activita",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qmi4o9/fare_amicizia_a_torino/"
    },
    {
        "id": "1qmf4kf",
        "author": "Exciting-Look-7721",
        "title": "Fair Priced Fashion:TORINO, 24/01/26",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qmf4kf/fair_priced_fashiontorino_240126/"
    },
    {
        "id": "1qlt7h1",
        "author": "Holiday_Song4022",
        "title": "Com’é questa zona? Sicura?",
        "content": "Non la conosco particolarmente, io ho sempre abitato più nelle zone metro bernini/racconigi.\n\nMi interessa particolarmente collegamenti (che teoricamente con la metro vicino sono a posto) sicurezza e supermercati/servizi in generale\n\nGrazie mille 🙏🏼 ",
        "upvotes": 20,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p0qn59k72cfg1.jpeg?auto=webp&amp;s=eb5149d556dc391f349e4a84df38c381be599cdc"
        },
        "permalink": "/r/torino/comments/1qlt7h1/comé_questa_zona_sicura/"
    },
    {
        "id": "1qmdrnt",
        "author": "Acrobatic-Opening286",
        "title": "CX Vanchiglia",
        "content": "Qualcuno di voi ha esperienze in merito (possibilmente recenti)? Sto valutando se prendere una stanza ma sento pareri troppo discordanti riguardo a staff e regole, sapete dirmi di più? \n\n ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qmdrnt/cx_vanchiglia/"
    },
    {
        "id": "1qm3j6r",
        "author": "No-Carrot-8515",
        "title": "Torino Aeroprta to Torino Porta Susa Train Help",
        "content": "Hey all, \n\nWe travel to Turnin next week to go skiing in Sestriere which we are super excited about. \n\nI was doing some travel planning this evening to make sure everything is in place in order to catch connections to the mountains. \n\nLooking at the trains from Torino Aeroporta to Torino Porta Susa has me scratching my head. Checking TrenItalia and Google Maps for the date we arrive (31st Jan) it's only showing the option to catch a bus and train, totalling a travel time of 1hr13 mins......Looking at our return date (4th Feb) its showing 30 mins direct by train, which is correct from what I have read online. \n\nTL:DR, Are the trains running from Turin Airport to the city at the moment, or are there rail replacement buses running this route until Feb 4th 2026 (based on train schedules)? Or is this simply a tech error online? \n\nI cant see any SFM service updates, so if anyone in Turin knows about this, it would be greatly appreciated. \n\nThanks \n\nA fellow Redditer ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1qm3j6r/torino_aeroprta_to_torino_porta_susa_train_help/"
    },
    {
        "id": "1qlj1z9",
        "author": "Obeah__Man",
        "title": "Torino, Piazza Castello, 23/01/2026",
        "content": "",
        "upvotes": 28,
        "comments": 63,
        "media": null,
        "permalink": "/r/torino/comments/1qlj1z9/torino_piazza_castello_23012026/"
    },
    {
        "id": "1qlxwsr",
        "author": "Temporary_Note5790",
        "title": "Curious where products from MD come from",
        "content": "I used to shop in places like Esselunga, Lidl, Conad, Coop, Pam, Ins, etc, and I found products in MD quite different from those places I’ve mentioned. \nI wonder why is that? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qlxwsr/curious_where_products_from_md_come_from/"
    },
    {
        "id": "1qllw1h",
        "author": "SpeakerEven6320",
        "title": "Nasty Club serata Erasmus stasera",
        "content": "Sono un ragazzo di 25 anni. \n\nQualcun* vorrebbe venire al nasty club con me stasera?\n\nC'è la serata universitaria Erasmus\n\nScrivetemi se siete interessat\\*",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qllw1h/nasty_club_serata_erasmus_stasera/"
    },
    {
        "id": "1qlvgoy",
        "author": "PipeOk5460",
        "title": "Carcere vita",
        "content": "Buona sera a tutti, avete qualche conoscente parente amico familiare che sta soggiornando per dire nel blocco B delle vallette di Torino?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qlvgoy/carcere_vita/"
    },
    {
        "id": "1qlj2ux",
        "author": "Opposite_Soil_3732",
        "title": "lo conoscete il ragazzo ?",
        "content": "ieri ero a porta sussa per prendere un treno e mi è capitato un ragazzo senzatetto sui 30 anni con capelli di rasta che mi chiedeva soldi ripetutamente e a un certo punto quando li dicevo che non avevo soldi per darli a un tratto si incazza e mi insulta. Mi chiedevo se qualcuno lo conoscesse e sapesse la su storia.\n\n",
        "upvotes": 9,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1qlj2ux/lo_conoscete_il_ragazzo/"
    },
    {
        "id": "1qltz0w",
        "author": "AnnieUK2024",
        "title": "Chi si ricorda come si chiamava questo Istituto Tecnico negli anni '80?",
        "content": "Ciao a tutti. Sto cercando di rintracciare un contatto. So che negli anni ’80 frequentava l’ITIS che si trova in via Sansovino 150. Oggi si chiama Istituto Superiore Paolo Boselli. So per certo che un tempo era un Istituto Tecnico Industriale per periti, ma non ricordo il nome. Si trovava nello stesso edificio in cui oggi ha sede il Boselli. Era già chiamato Boselli all’epoca o aveva un altro nome? Grazie.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qltz0w/chi_si_ricorda_come_si_chiamava_questo_istituto/"
    },
    {
        "id": "1qltiuc",
        "author": "mainapizza",
        "title": "Dove andare con rischio valanghe?",
        "content": "Ciao, ultimamente ogni weekend sembra sempre peggio con il rischio valanghe. Dove si può fare una bella passeggiata, anche in bassa quota, che non siano la Sacra di San Michele o i laghi di Avigliana? Qualcosa di impegnativo va benissimo, se siamo sui 10km perfetto. \n\nGrazie a tutt*❤️",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qltiuc/dove_andare_con_rischio_valanghe/"
    },
    {
        "id": "1qls3po",
        "author": "Wise-Accident3048",
        "title": "Passaggio Torino- Friuli Martedì",
        "content": "Scusate, non so se è il subreddit giusto ma cercavo qualcuno con cui condividere i costi di un viaggio verso il Friuli in macchina per Martedì! Quindi se qualcuno ha bisogno di un passaggio mi scriva pure c:",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qls3po/passaggio_torino_friuli_martedì/"
    },
    {
        "id": "1qkkdol",
        "author": "blunathan",
        "title": "Torino come Magritte il giorno del mio compleanno",
        "content": "",
        "upvotes": 231,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1qkkdol/torino_come_magritte_il_giorno_del_mio_compleanno/"
    },
    {
        "id": "1qll30n",
        "author": "DPPenjoyer18",
        "title": "Borgo San Pietro, Moncalieri: opinioni sulla zona?",
        "content": "Salve a tutti, come è la zona di borgo San Pietro a Moncalieri? Ho visto un appartamento interessante ed è in zona relativamente distante da piazza Bengasi, ma non riesco a capire che genere di zona sia e quanto sia tranquilla. Grazie a tutti dell'aiuto",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qll30n/borgo_san_pietro_moncalieri_opinioni_sulla_zona/"
    },
    {
        "id": "1qlkj69",
        "author": "emanueleoggiano",
        "title": "Campetti basket torino/Basketball Court Turin",
        "content": "Sapete dirmi dove si trovino i campi da basket all’aperto a Torino in zona metro Racconigi o Politecnico di Torino?\n\n——\n\nCan you tell me where the outdoor basketball courts are located in Turin near metro area Racconigi or Politecnico di Torino?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qlkj69/campetti_basket_torinobasketball_court_turin/"
    },
    {
        "id": "1qlj115",
        "author": "Nunzz66",
        "title": "Auto nuova a Torino in zona Santa Rita",
        "content": "Buongiorno a tutti,\n\nho appena comprato il nuovo modello della Lancia Ypsilon. La userò quasi esclusivamente per andare al lavoro, quindi l'auto resterà ferma 8-9 ore al giorno in strada di notte in zona Santa Rita a Torino.\n\n​Il mio dubbio è questo: lasciarla fuori alla mercé di ladri (visto che è il modello nuovo) e del meteo (grandinate improvvise, abbastanza frequenti credo) mi mette un po' d'ansia. Sono ovviamente assicurato per tutto, ma sappiamo bene che le assicurazioni su questi temi causano più disagi che altro.\n\n​Vi chiedo se nella mia situazione, voi cerchereste un garage/autorimessa a pagamento vicino al lavoro o la lascereste in strada senza pensarci troppo?\n\nAvevo visto quelli della GTT a 85 euro mentre le altre autorimesse mi chiedono dai 100 euro in su.",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1qlj115/auto_nuova_a_torino_in_zona_santa_rita/"
    },
    {
        "id": "1qkymxf",
        "author": "BroqueviNEGAR",
        "title": "Studente internazionale a Torino — idee per i weekend?(New in Turin- How do people usually spend weekends here?)",
        "content": "Ciao a tutti!\nSono a Torino da circa 3 settimane e sto ancora cercando di capire il ritmo della città. Sono uno studente internazionale, iscritto alla laurea triennale in Business Management all’Università di Torino (UniTo).\nPer dare un po’ di contesto: sono nato e cresciuto a Dubai, dove i weekend sono molto pieni, tutto resta aperto fino a tardi e c’è sempre qualcosa da fare. Torino mi sembra molto più tranquilla — cosa che sto cercando di apprezzare — ma vorrei capirla meglio.\nCosa fate di solito qui nei weekend?\nAvete consigli su:\nattività o eventi\nposti dove vanno studenti o internazionali\nattività sociali o sportive\nqualcosa di diverso dai soliti bar e passeggiate\nMi piacciono molto i film, cucinare, lo sport ed esplorare posti nuovi, quindi sono apertissimo a suggerimenti.\nGrazie in anticipo! \n(CHATGPT HELPED ME WRITE THAT😅😭,IF THERE'S ANY MISTAKE SORRY ABOUT THAT)\n\n\nHi everyone\nI’ve been in Turin for around 3 weeks now and I’m still getting used to the city and its rhythm. I'm an international students here studying Bachelor's in Business Management from UniTo.\n\nFor some context, I was born and raised in Dubai, so I’m coming from a place where weekends are pretty packed and things stay open late. Turin feels much calmer, which I’m actually trying to appreciate,just want to understand it better.\n\nWhat do people here usually do on weekends? Any recommendations for:\n\n1.activities or events\n2.spots where students/internationals hang out\n3.social or sports-related things\n4..anything beyond the usual cafés and walks\n\nI’m into movies(ANIME in particular), cooking, sports, and exploring new places, so open to any suggestions.\n\nThanks in advance!\n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qkymxf/studente_internazionale_a_torino_idee_per_i/"
    },
    {
        "id": "1qkl8gc",
        "author": "ps5cfw",
        "title": "Dov'è la nutella peanut",
        "content": "Buongiorno a tutti, sono proprio io, quello che presto verrà ammazzato potenzialmente dalle macchine sulla statale per risparmiare il parcheggio dell'aeroporto\n\nMa veniamo al dunque:\n\n[https://www.greenme.it/lifestyle/sai-cosa-compri/nutella-peanut-la-crema-spalmabile-con-burro-di-arachidi-e-arrivata-in-italia-ma-si-trova-solo-in-alcuni-supermercati/](https://www.greenme.it/lifestyle/sai-cosa-compri/nutella-peanut-la-crema-spalmabile-con-burro-di-arachidi-e-arrivata-in-italia-ma-si-trova-solo-in-alcuni-supermercati/)\n\nprima di morire vorrei assaggiare questa nutella peanut, ma nei carrefour vicino casa non l'ho trovata.\n\nSe l'avete spottata, siate buoni samaritani e dite dove, ormai sono ossessionato dal volerla provare ",
        "upvotes": 15,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/v5cMyHzPgk7A15i64t7U6PeEp97iLdyiwApJ0nzyhes.jpeg?auto=webp&amp;s=684d7470edabc083f0102c9345492b0697cbd054"
        },
        "permalink": "/r/torino/comments/1qkl8gc/dovè_la_nutella_peanut/"
    },
    {
        "id": "1qkm3mp",
        "author": "mattgwa",
        "title": "Weekly calendar of my favorite international meetings in Torino",
        "content": "Hello!\n\nHere is the weekly calendar of my favorite international events in Torino, the best way to make new friends, practice languages and have a good time with nice people!\n\n❤️ Monday 9pm - International karaoke night - organized by ISOT (International Students of Torino) - Rough Dive Bar, via Principe Tommaso 3 🔥 Whatsapp: [https://chat.whatsapp.com/K89LK5bXlc5BYhrm01Emf5](https://chat.whatsapp.com/K89LK5bXlc5BYhrm01Emf5)\n\n❤️ Tuesday 8pm - Make International friends and language exchange - Tipsy, piazza Vittorio Veneto 23B 🔥 Whatsapp: [https://chat.whatsapp.com/Glkd55ANFrXD468PVSih8q](https://chat.whatsapp.com/Glkd55ANFrXD468PVSih8q) 🔥 Meetup: [https://www.meetup.com/torino-international](https://www.meetup.com/torino-international)\n\n❤️ Wednesday 8pm - Apelinguistico - Murphy's Six Nations, corso Vittorio Emanuele II, 28 🔥 Meetup: [https://www.meetup.com/Tandem-Learning-Language-Exchange-Torino-coollanguages-org](https://www.meetup.com/Tandem-Learning-Language-Exchange-Torino-coollanguages-org)\n\nThursday 8pm - 🇮🇹 ... Speak Italian! ... 🇮🇹 (Italian conversation meeting) - La Drogheria, piazza Vittorio Veneto 16B 🔥 Meetup: [https://www.meetup.com/speak-italian-torino](https://www.meetup.com/speak-italian-torino) 🔥 Whatsapp: [https://chat.whatsapp.com/Gs15TFtXw6bLvoTOLSmMaR?mode=wwt](https://chat.whatsapp.com/Gs15TFtXw6bLvoTOLSmMaR?mode=wwt)\n\n❤️ Friday 10pm - Friday @ Jumping Jester (English speaking meeting)- via Giuseppe Mazzini, 2 🔥 Meetup: [https://www.meetup.com/englishspeakerinturin](https://www.meetup.com/englishspeakerinturin)\n\n❤️ Sunday 9pm - Make friends over English (English speaking meeting) - Margò, via Michele Buniva, 9 🔥 Meetup: [https://www.meetup.com/Vanchiglia-Culture-Club](https://www.meetup.com/Vanchiglia-Culture-Club)",
        "upvotes": 13,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qkm3mp/weekly_calendar_of_my_favorite_international/"
    },
    {
        "id": "1qkzaa7",
        "author": "UglycoreIT",
        "title": "Fitactive Fontanesi",
        "content": "Qualcuna di voi è iscritta?? \n\nVi prego allenarmi da sola a volte mi deprime ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qkzaa7/fitactive_fontanesi/"
    },
    {
        "id": "1qkxaye",
        "author": "ermesso",
        "title": "D&amp;D",
        "content": "Ciao a tutti! mi piacerebbe trovare qualcuno con cui poter giocare a D&amp;D. Ho provato solo una volta e devo dire che mi è piaciuto molto però non ho idea di come trovare dei gruppi con cui poter fare delle campagne serie :')",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qkxaye/dd/"
    },
    {
        "id": "1qkuusn",
        "author": "DryTumbleweed2455",
        "title": "Posti dove ripetere a Torino?",
        "content": "Ciao a tutt3, cerco un posto a Torino dove ripetere per gli esami dove si possa stare al caldo e non disturbare nessuno. Basta che non sia la Murazzi student zone, è impossibile concentrarsi. Grazie mille♡",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1qkuusn/posti_dove_ripetere_a_torino/"
    }
]