[
    {
        "id": "1hqxs0r",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1hqxs0r/la_piola_friends_meetup/"
    },
    {
        "id": "1hqud0l",
        "author": "Flat-Message6872",
        "title": "Ripetizioni tecnolgia",
        "content": "Ciao sono un giovane ragazzo che può dare ripetizioni e/o svolgere tavole di tecnologia per voi.\n\nScrivermi in privato per chi fosse interessato/a",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1hqud0l/ripetizioni_tecnolgia/"
    },
    {
        "id": "1hqnrsl",
        "author": "Bubbly-Ad-5111",
        "title": "Ciao sono solo per capodanno ",
        "content": "Ciao vengo a Torino e cosa che per fare staserra?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hqnrsl/ciao_sono_solo_per_capodanno/"
    },
    {
        "id": "1hpnh35",
        "author": "pietrino97",
        "title": "Cosa sono quei \"buchi\" sul Palazzo della Regione?",
        "content": "Ciao a tutti, dopo anni sono tornato a Torino, e mi sono fatto in giro a Moncalieri dal quale si vede tutta Torino Sud. Cosa sono quei \"buchi\" sulla facciata del grattacielo? Non ci sono le finestre? Non avevano finito di costruirlo e trasferito lì gli uffici dall'anno scorso?",
        "upvotes": 142,
        "comments": 47,
        "media": null,
        "permalink": "/r/torino/comments/1hpnh35/cosa_sono_quei_buchi_sul_palazzo_della_regione/"
    },
    {
        "id": "1hqcygj",
        "author": "Salty_Department_438",
        "title": "Karaoke?",
        "content": "Domani 1 Gennaio sapete se c’è qualche karaoke aperto?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hqcygj/karaoke/"
    },
    {
        "id": "1hpww6f",
        "author": "cawalli",
        "title": "Anno 2004 cantiere sottopasso piazza Rivoli.",
        "content": "",
        "upvotes": 31,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mb5ri9dqr1ae1.jpeg?auto=webp&amp;s=5530e1af1d4e82f6e14394e12d1d1ad7d898d393"
        },
        "permalink": "/r/torino/comments/1hpww6f/anno_2004_cantiere_sottopasso_piazza_rivoli/"
    },
    {
        "id": "1hq0khz",
        "author": "Nedissis",
        "title": "Luoghi di ristorazione adatti alla conversazione prolungata, a Torino?",
        "content": "A Torino, quali possono essere dei pub, bar, ristoranti (o simili), in cui si può veramente \"parlare\" bene con un gruppetto di 4-6 persone la sera? Intendo indoor per via del periodo invernale.  \n  \nOvvero:  \n\\- No musica o partite di calcio.  \n\\- No tavoli vicini, così la gente non deve urlare per farsi sentire nel suo stesso tavolo, che alza il volume generale, e più privacy.  \n\\- Poter rimanere lì ad oltranza fino a tarda serata, ordinando qualcosina qua e là.\n\nAlle volte mi incontro con persone con cui affrontare argomenti di discussione lavorativi complessi che richiedono attenzione e qualche ora di dialogo, ma in ambienti non ideali (pub a caso). Premesso che non sia possibile andare nelle case di ciascuno (sarebbe l'ideale), né avrebbe senso prenotare una sala conferenze, e che ci servirebbe comunque un tavolino.",
        "upvotes": 17,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1hq0khz/luoghi_di_ristorazione_adatti_alla_conversazione/"
    },
    {
        "id": "1hqd3ve",
        "author": "Intelligent-Deal-759",
        "title": "STAMPA MAGLIA",
        "content": "Salve ragazzi sono appassionato di grafica e faccio amatorialmente della magliette tipo (allego foto).\n\nSapreste consigliarmi un'ottima stamperia? \n\nGRAZIEEEEEEE :D\n\n(La stampa l'ho fatta a Napoli)\n\nhttps://preview.redd.it/8rlar7oa96ae1.png?width=1347&amp;format=png&amp;auto=webp&amp;s=54e5826b1b6d1fa868fa3f6d9244619dfdfe5620\n\n",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1hqd3ve/stampa_maglia/"
    },
    {
        "id": "1hq6yva",
        "author": "trastorn",
        "title": "Vacanze a febbraio. ",
        "content": "Ciao! Ne vale la pena andare in vacanze a Torino? \nNon so perché ma mi attira tantissimo la idea di soggiornare in una mansarda. \nNe ho trovata una in Borgo Po, cosa pensate?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hq6yva/vacanze_a_febbraio/"
    },
    {
        "id": "1hptrse",
        "author": "BothCondition7963",
        "title": "Il 2025 di Torino: apre il River Center, rinasce lo stadio Nebiolo. Il sindaco: «Grandi eventi, e task force sui cantieri»",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4UHJNg4APPJ09vBW3lzR7Z9unnYE2sr9U3QaiQ9XogA.jpg?auto=webp&amp;s=a5106069f249e021de18f36d88c5cb7767704a74"
        },
        "permalink": "/r/torino/comments/1hptrse/il_2025_di_torino_apre_il_river_center_rinasce_lo/"
    },
    {
        "id": "1hpm4of",
        "author": "EdgelordMcMeme",
        "title": "DnD e altri TTRPG",
        "content": "Ciao! Sono un ragazzo di 27 anni che da un po' di tempo sarebbe interessato a giocare a DnD o simili ma che non conosce nessuno nel giro e non sa bene come fare. Ci sono posti che organizzano eventi o siti o app per trovare gente o cose così? Ovviamente se voi stessi siete interessati ad aiutarmi scrivete pure! Idealmente vorrei trovare qualcuno con un po' di esperienza siccome io ne ho zero. I giochi che mi interessano di più sono DnD, VTM e Cyberpunk ma sono aperto a qualsiasi cosa! Grazie :)",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1hpm4of/dnd_e_altri_ttrpg/"
    },
    {
        "id": "1hpykus",
        "author": "bora907",
        "title": "How to find a place to stay for Erasmus?",
        "content": "Hi! I am coming to Torino in February and will stay there until July. How can I find a roommate or place to stay?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hpykus/how_to_find_a_place_to_stay_for_erasmus/"
    },
    {
        "id": "1hprs7v",
        "author": "Jus_Crik_00",
        "title": "Investimento immobiliare Torino",
        "content": "Ciao a tutti!   \nSto pensando di comprare un trilocale a Torino, vicino al Campus Einaudi.  \nIn una stanza starei io, mentre l'altra la affitterei a studenti.   \n  \nSto valutando zone come il centro o Vanchiglia.  \nSapreste consigliarmi un buon sito per farmi un’idea del valore medio degli immobili e dei prezzi degli affitti in queste zone?  \nSecondo voi, in questo momento un investimento del genere potrebbe essere una scelta sensata?\n\nVivo a Torino da circa un anno, quindi sto cercando di orientarmi al meglio.  \nSe avete esperienze personali o conoscete agenzie immobiliari affidabili, mi farebbe davvero piacere avere qualche dritta. Grazie mille!",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1hprs7v/investimento_immobiliare_torino/"
    },
    {
        "id": "1hpkj7u",
        "author": "xXCyb3rBu11yXx",
        "title": "Spikeball a Torino",
        "content": "Ciao a tutti!  \n\nAbbiamo un gruppo che gioca a Spikeball ogni settimana (di solito ogni domenica) a Torino. Se qualcuno volesse unirsi a noi, pubblichiamo i dettagli su dove e quando ci incontreremo sul nostro Instagram. \n\nIl nostro gruppo è composto da persone con diversi livelli di abilità, quindi sentitevi liberi di unirvi, anche se è la prima volta che giocate (: \n\nUltima cosa: siamo un gruppo molto internazionale, quindi parliamo sia italiano che inglese! ",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Zp2Gbndgw5-5hwPVYeIVP42P1xjLKoCu17nx6l_7ZrI.jpg?auto=webp&amp;s=336b0f1ee4692650bae7a6ba4142127556775718"
        },
        "permalink": "/r/torino/comments/1hpkj7u/spikeball_a_torino/"
    },
    {
        "id": "1hps5sj",
        "author": "pietrino97",
        "title": "Opinione Piazza Bengasi a Torino (o meglio, Moncalieri)?",
        "content": "Ciao a tutti, ho pubblicato un post simile qualche giorno fa, ma non ho avuto moltissimi riscontri da voi torinesi/moncalieresi quindi lo scrivo di nuovo post visita del bilocale a cui sono interessato.\n\nQuesta mattina l'ho visitato, e sono davvero molto interessato all'affitto. Si trova a 3 min a piedi da Piazza Bengasi, verso est, e affaccia su Giardino Battistini. La casa è in ottimo stato, molto silenziosa e luminosa.\nIl prezzo è davvero conveniente.\n\nPosso chiedervi (sperando in più opinioni) come sia la zona? Purtroppo su internet si trovano tantissimi articoli molto brutti su spaccio e attività illegali, ma a me stamattina è sembrato tutto molto tranquillo (avrei dovuto attendere le ore serali? ahah)\nCalcolate che sono abituato a Milano Lambrate (che porterò sempre nel mio cuore), quindi magari la cosa mi ha temprato🫶🏻!!\n\nPoi lavorerò a Moncalieri, quindi mi è anche comodo per il parcheggio della macchina e per raggiungere il posto di lavoro",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1hps5sj/opinione_piazza_bengasi_a_torino_o_meglio/"
    },
    {
        "id": "1hpqlds",
        "author": "One-Arm-4400",
        "title": "Day trip to a ski resort",
        "content": "Hi all,\n\nI’ll be visiting Turin in mid-January and am looking for recommendations for a day trip destination outside the city. I won’t have access to a car, so the place needs to be easily reachable by train or bus.\n\nI’m open to exploring charming towns, scenic spots, or unique attractions nearby. Any suggestions for places worth visiting in winter?\n\nThanks in advance! I \n\nEdit 1 - I was considering going to Chamonix using FlixBus but am open to other suggestions as well. Thank you for the suggestions already provided",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1hpqlds/day_trip_to_a_ski_resort/"
    },
    {
        "id": "1hplh0i",
        "author": "am_i_real1781",
        "title": "Capodanno in piazza",
        "content": "Ciao a tutti, per mancanza di tempo e per distrazione non ho potuto prenotare il posto per il concerto in piazza e ora sono esauriti i posti, se qualcuno non va e gli va di cedere il biglietto cosí gli verrà anche rimborsato. Grazie.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1hplh0i/capodanno_in_piazza/"
    },
    {
        "id": "1hpjqej",
        "author": "Anonymous_77_",
        "title": "Where can i find a cheap gym in Torino",
        "content": "Hello guys i just wanted to ask where can i find a gym that doesnt have the annual contract thing in Torino. I’ve seen mcfit offer but still it’s a bit too much for me to pay for an entire year. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1hpjqej/where_can_i_find_a_cheap_gym_in_torino/"
    },
    {
        "id": "1hp1f2g",
        "author": "Manag3r",
        "title": "Furto bici",
        "content": "Salve. Quando si deve lasciare la bici parcheggiata in luogo pubblico, quale pensate sia, per la vostra esperienza, il modo migliore per evitare che venga rubata?",
        "upvotes": 11,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1hp1f2g/furto_bici/"
    },
    {
        "id": "1hp408u",
        "author": "wherearemyburritos",
        "title": "IELTS ",
        "content": "Ciao a tutti, spero lei vacanze stiano proseguendo bene.\nCome da titolo sto cercando una struttura/scuola/associazione dove poter fare l'IELTS.\nQualcuno di vuoi potrebbe, nel caso l'avesse fatto, darmi dei consigli? \nGrazie mille ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1hp408u/ielts/"
    },
    {
        "id": "1hovy5b",
        "author": "kdb1104",
        "title": "Cinema con film in lingua inglese?",
        "content": "Ciao! Vorrei tanto vedere un film (Noseferatu!) ma preferisco vederlo in inglese (piuttosto che doppiato in italiano).  \n\nCi sono cinema a Torino che proiettano film recenti in lingua originale inglese?\n\nGrazie!  ",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1hovy5b/cinema_con_film_in_lingua_inglese/"
    },
    {
        "id": "1hp6pdd",
        "author": "Altruistic_Syrup_373",
        "title": "Consigli per un buon brunch a Torino vicino alla fermata FlixBus su Corso Vittorio Emanuele?",
        "content": "Ciao a tutti!\n\nSarò a Torino il 3 gennaio e cerco un posto dove fare un buon brunch vicino alla fermata FlixBus su Corso Vittorio Emanuele II. Sto cercando qualcosa di qualità, ma che non sia troppo caro. Qualcuno ha qualche suggerimento?\n\nGrazie in anticipo! 😊",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hp6pdd/consigli_per_un_buon_brunch_a_torino_vicino_alla/"
    },
    {
        "id": "1hozda7",
        "author": "Eye-Dust",
        "title": "Contenitori alluminio pressofuso",
        "content": "Ciao, per caso conoscete negozi che vendono questo tipo di contenitori?",
        "upvotes": 1,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ehz3jd9jct9e1.jpeg?auto=webp&amp;s=83dfcfd8bdb8feabd925b7f6dab9f1a92a9268d7"
        },
        "permalink": "/r/torino/comments/1hozda7/contenitori_alluminio_pressofuso/"
    },
    {
        "id": "1ho7ln7",
        "author": "lordmax10",
        "title": "Oggi Sì Oscuro Signore al Mufant.",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sv3783zgvl9e1.jpeg?auto=webp&amp;s=ada73da1276a695135a484cf424100dee2116fca"
        },
        "permalink": "/r/torino/comments/1ho7ln7/oggi_sì_oscuro_signore_al_mufant/"
    },
    {
        "id": "1ho2wsm",
        "author": "Top-Text-7727",
        "title": "Askatasuna è davvero così terribile o è un capro espiatorio?",
        "content": "Il titolo è già esplicativo. Vi chiedo di mantenere un linguaggio rispettoso a priori del colore politico. ",
        "upvotes": 50,
        "comments": 56,
        "media": null,
        "permalink": "/r/torino/comments/1ho2wsm/askatasuna_è_davvero_così_terribile_o_è_un_capro/"
    },
    {
        "id": "1ho6w8n",
        "author": "Boring-Painting823",
        "title": "CAPODANNO? ",
        "content": "Ciao! Siamo un piccolo gruppetto di ragazzi e ragazze che come al solito non si sono organizzati per capodanno sottovalutato l'impatto morale che la suddetta disorganizzazione avrebbe creato in questi ultimi giorni di dicembre. Conoscete o sapete di qualche di situazione assurda in cui potremmo infiltrarci all'ultimo? ",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1ho6w8n/capodanno/"
    },
    {
        "id": "1ho90tl",
        "author": "Designer_Speech2700",
        "title": "Parrucchiere uomo Pinerolo e dintorni",
        "content": "Sono alla ricerca di un parrucchiere nell’area del pinerolese, in grado di realizzare tagli dal respiro internazionale che non siano l’ormai onnipresente mullet e che sappia proporre tagli ad hoc a seconda della fisionomia del viso del cliente. Consigli?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ho90tl/parrucchiere_uomo_pinerolo_e_dintorni/"
    },
    {
        "id": "1ho4dzm",
        "author": "MorrowSky",
        "title": "Buying a yoyo in Torino",
        "content": "G'day everyone, would anyone be able to suggest where one can buy a yoyo in Torino. Was unable to find one in any of the toy stores. \nThanks in advance ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ho4dzm/buying_a_yoyo_in_torino/"
    },
    {
        "id": "1ho26bz",
        "author": "lordmax10",
        "title": "Al MuFant con Sì, OScuro Signore e i draghi di Andrea Wise",
        "content": "Fà Natale Fantasy  \n  \nOggi e domani al @MuFant  \n  \n  \nhttp://www.comune.torino.it/eventi/calendario/fa-natale-fantasy/\n\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ho26bz/al_mufant_con_sì_oscuro_signore_e_i_draghi_di/"
    },
    {
        "id": "1hoimn4",
        "author": "Immediate_Meeting_37",
        "title": "Esperienza Torinese",
        "content": "Ciao ragazzi da anni il mio lavoro mi porta in giro per il mondo, a ciò ho sommato il mio immenso amore per le donne e per l’arte del sesso e l’erotismo in tutte le sue sfaccettature e ovunque vada diciamo che mi piace amare al meglio le donne locali.\nGrazia vuole che mi capiti a Torino stavolta e dato che in Italia purtroppo non ci metto piede da vari anni chiedo a voi comunità di Reddit i migliori eventi e posti devoti al culto del sesso, come case del piacere o orgie, di solito mi porto a casa ragazze o signore che conosco in giro o alle feste e quindi se sapete consigliarmi qualche evento vi sarei grato, mi hanno parlato anche della red line e puttantour di Torino sapete darmi qualche informazione o dritta a riguardo? Sapete se c’è una suddivisione di aree per la prostituzione ? Ad esempio zona di ragazze del est o africane o trans (così da starci al sicuro) \nStarò un paio di mesi e non voglio perdermi niente \nCome funziona con la legge ? \nGrazie mille.\n",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1hoimn4/esperienza_torinese/"
    },
    {
        "id": "1ho2gem",
        "author": "pietrino97",
        "title": "Opinioni su Corso Fratelli Rosselli, a Moncalieri (Torino)?",
        "content": "Ciao a tutti, sto valutando l'affitto ad un prezzo davvero vantaggioso di un bilocale in Corso Fratelli Rosselli, proprio all'inizio di Via Ventimiglia.\nNon essendo di Torino, come è la zona? Sarei automunito, è sicuro lasciare la macchina parcheggiata in strada? Lavorerò a Moncalieri, quindi sarebbe comodo sia come distanza dal lavoro sia dal centro città e dai mezzi avendo vicino il capolinea della metro... Grazie!!",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ho2gem/opinioni_su_corso_fratelli_rosselli_a_moncalieri/"
    },
    {
        "id": "1hnoqeq",
        "author": "itslilou",
        "title": "Cosa fanno i torinesi per Capodanno?",
        "content": "Ciao! Sono nuova a Torino e non sono sicura di cosa fare il 31. Probabilmente sarò con un amico, ma anche lui è nuovo qui, quindi siamo entrambi all'oscuro. Ci sono fuochi d'artificio, la gente esce in una certa parte della città, ci sono feste?\nGrazie!",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1hnoqeq/cosa_fanno_i_torinesi_per_capodanno/"
    }
]