[
    {
        "id": "1on8se3",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 22,
        "comments": 2141,
        "media": null,
        "permalink": "/r/realmadrid/comments/1on8se3/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1ookp9c",
        "author": "soccer-stats",
        "title": "Post Match Thread: Liverpool vs Real Madrid",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1ookp9c)",
        "upvotes": 234,
        "comments": 1310,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ookp9c/post_match_thread_liverpool_vs_real_madrid/"
    },
    {
        "id": "1op4aeu",
        "author": "No-Independent2522",
        "title": "Its just a game, enjoy while you can 🤍",
        "content": "",
        "upvotes": 229,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gfisnwuo7gzf1.jpeg?auto=webp&amp;s=5e975d4dc5ecb4a704be3e81ba4db609f6b76228"
        },
        "permalink": "/r/realmadrid/comments/1op4aeu/its_just_a_game_enjoy_while_you_can/"
    },
    {
        "id": "1ooy1yw",
        "author": "dakdakdakp",
        "title": "Gareth Bale: \"Madrid need a number 9\"",
        "content": "“It was just a bit disappointing that final third there wasn’t really that kind of quality you’d expect from Real Madrid players.”  \n  \nThe main focus of Bale’s criticism fell on the attacking area. The Welshman lamented the **\"lack of quality\"** in the final third, directly pointing to figures like Mbappé and Vinicius Júnior: **\"They didn’t produce any magic. It was disappointing that in the final third there wasn’t the quality you expect from Real Madrid\"**. A statement that highlights the club’s reliance on individual brilliance that, on big nights, doesn’t always show up.\n\nThis offensive shortcoming led Bale to identify a structural need: the arrival of a reference center forward. The former footballer explained that crosses and attacking moves were left without a finisher, an obvious tactical gap. **\"Sometimes you need to go and test the defender. There was no one in the box for the crosses. Maybe you need a ‘9’\"**, he concluded, hitting the nail on the head regarding the role of a classic striker.",
        "upvotes": 587,
        "comments": 206,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LGldKGjhrYVUZ_uF5Q9rX1o-cH_mXbejKVyDxVXv0Vg.jpeg?auto=webp&amp;s=10031d6b23f6354635869c56f0d5d95967987363"
        },
        "permalink": "/r/realmadrid/comments/1ooy1yw/gareth_bale_madrid_need_a_number_9/"
    },
    {
        "id": "1op1s3r",
        "author": "brownberriess1",
        "title": "Our wall! 🧱 We've honestly been blessed when it comes to keepers",
        "content": "",
        "upvotes": 233,
        "comments": 22,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/k48hiiv0pfzf1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1op1s3r/our_wall_weve_honestly_been_blessed_when_it_comes/"
    },
    {
        "id": "1op6div",
        "author": "TheConnstant",
        "title": "WHERE WAS OUR STRIKER ?",
        "content": "Can't even find him in the Frame",
        "upvotes": 111,
        "comments": 54,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9w1k3t6vlgzf1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1op6div/where_was_our_striker/"
    },
    {
        "id": "1op1vil",
        "author": "Gaengsa",
        "title": "Nico Paz's stock last night",
        "content": "",
        "upvotes": 117,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/68px6a7spfzf1.jpeg?auto=webp&amp;s=2e1178d2eda54e8d77c7c4d1742e7b0410fef1af"
        },
        "permalink": "/r/realmadrid/comments/1op1vil/nico_pazs_stock_last_night/"
    },
    {
        "id": "1oonh60",
        "author": "More-Judgment-9253",
        "title": "Bro did all that for nothing",
        "content": "",
        "upvotes": 895,
        "comments": 233,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8nbmpof9vbzf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oonh60/bro_did_all_that_for_nothing/"
    },
    {
        "id": "1op54zw",
        "author": "martino732",
        "title": "One year since this clip, no improvement whatsoever",
        "content": "",
        "upvotes": 54,
        "comments": 31,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/c3v94tpadgzf1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1op54zw/one_year_since_this_clip_no_improvement_whatsoever/"
    },
    {
        "id": "1ooyzvn",
        "author": "Timothee_C02",
        "title": "Many fans on this sub have clearly never played 11v11 and it shows.",
        "content": "Have you never had a bad day at work? Seriously. How can one bad game suddenly mean we’re trash and need a lots of improvement? If Jude’s chance had gone in, or if Mbappé had just had a slightly better game, this sub would’ve been jerking off to “mentality monsters” posts right now. The hypocrisy is insane.\n\nJust saw a post with Mbappé circled in yellow like, “look, he didn’t close down on that Carreras run!” \n\nBro, have you even *played* football? You think it’s that fucking simple? You think all he had to do was magically predict the ball’s bounce and slot it in? Be serious.\n\nEveryone has off days man. You, me, and our players. Liverpool were just better yesterday. That happens. You can’t win every goddamn game. I wish we were the better team, we weren't. That's that.\n\nWhat really pisses me off though is the hate. The straight-up disrespect toward world-class players — it’s pure *small dick energy*. You don’t have to love everyone, but at least don’t act like you could do better sitting on your ass behind a keyboard.\n\nIf you love this club, act like it. Stop scapegoating. Stop turning on our own. You think throwing shit on a player makes you a smart? No it just makes you look like a clown.\n\nGo outside. Touch some fucking grass. Play an actual 11v11 game. Try tracking back, closing down, finding a smart pass (like Güler tried before getting chopped down in the box), or making a perfect run. You’ll realize half of what you complain about isn’t that simple.\n\nAnd sure let’s talk football, that’s fine by me. For instance, Valverde was uncomfortable at times? Yeah. But he wasn’t ass. He was just out of position. There’s a difference. \n\nThe quality of this sub has fallen off a cliff.\nIf you love this club act like it. Stop being salty little crybabies every time we lose. \n\nOur club is stacked with quality, and we have a top manager too. If it was some other manager and we weren't defensively disciplined it would've been much worse. I am still confident we're the best team in Europe. THE BEST! A 1-0 loss changes nothing.\n\nHala Madrid Y Nada Mas 🤍\n",
        "upvotes": 131,
        "comments": 64,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ooyzvn/many_fans_on_this_sub_have_clearly_never_played/"
    },
    {
        "id": "1ookyt8",
        "author": "SaniaXazel",
        "title": "Despite the defeat, the Real Madrid players come to thank the supporters who made the trip",
        "content": "",
        "upvotes": 716,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dxlnecogdbzf1/DASH_270.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ookyt8/despite_the_defeat_the_real_madrid_players_come/"
    },
    {
        "id": "1ooiej0",
        "author": "No-Independent2522",
        "title": "Courtois crucial save to deny Liverpool the opening goal",
        "content": "",
        "upvotes": 796,
        "comments": 52,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wxxavzhovazf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ooiej0/courtois_crucial_save_to_deny_liverpool_the/"
    },
    {
        "id": "1ool0jh",
        "author": "Sorry-Passenger4283",
        "title": "Anfield is crazy tbh",
        "content": "Weird game i'm not gonna lie, the ref was wilding too man\nbut we gotta talk about how insane the anfield atmosphere is, the pressure, the chanting and pretty much a different vibe from any other stadiums\n\nThe atmosphere and pressure at anfield has definitely took a big part in this match.. which leaves the question, how the hell do players handle this kind of pressure? or deal w it \n\nTrent has done nothing when he was subbed in, which of course may be understandable considering where he's playing and who he's playing against and man it must be awful listening to the fans chant whenever he just touches the ball lol\n\nLots of wrong passes and plays and missed chances aswell liverpool were ruthless, i gotta be honest vini went ghost mode aswell man their defense is on point specifically talking about bradley\n\nAnd the amount of tackles carreras was going for against salah is wild man\n\nGrateful for courtois bro saved us devastating and embarrassing goals that may have happend but it hasn't thanks to him, truly man of the match",
        "upvotes": 542,
        "comments": 114,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ool0jh/anfield_is_crazy_tbh/"
    },
    {
        "id": "1oogosp",
        "author": "[deleted]",
        "title": "A Real Madrid fan proposed to his girlfriend at Anfield.",
        "content": "❤️",
        "upvotes": 873,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bu6vpzi6kazf1.jpeg?auto=webp&amp;s=e1bc65e539bf570b9101765bf898aed7b47497c4"
        },
        "permalink": "/r/realmadrid/comments/1oogosp/a_real_madrid_fan_proposed_to_his_girlfriend_at/"
    },
    {
        "id": "1ooe8j7",
        "author": "brainybrit",
        "title": "Just leaving this out there🥲",
        "content": "",
        "upvotes": 1072,
        "comments": 54,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/yjb175qk4azf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ooe8j7/just_leaving_this_out_there/"
    },
    {
        "id": "1op4zqb",
        "author": "TheFeatherDiaries",
        "title": "Real Madrid conceded 8 shots directly from set pieces yesternight. They recorded just two shots on target , their fewest in a UEFA Champions League game since their 1-0 win over Liverpool in the 2021-22 final (also 2)",
        "content": "",
        "upvotes": 19,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NqWFtiqgEnxHu_jsFAziLLobu6rsiep2cgGLhZ-KroQ.jpeg?auto=webp&amp;s=90afd7c96bae665d773234ff55904e857e4a1273"
        },
        "permalink": "/r/realmadrid/comments/1op4zqb/real_madrid_conceded_8_shots_directly_from_set/"
    },
    {
        "id": "1oovpnu",
        "author": "Aizen2430",
        "title": "We have three elite LWs, a 18 years old RW and 2 raw teenage strikers.",
        "content": "Critisizing players is okay but we also have to understand that we have this situation of mis management right now and i don't know how we are gonna solve this problem. Mbappe was never a target man and we all knew that. Vini's form in inconsistent but we can't ques his potential. Rodrygo on the other hand has been great for us playing as a sub but at this point he also wants regular game time and his preferred position is left as well. \n\nLast night as well we didn't have a threat on right wing hence it was predictable for liverpool . Ofc they were better than us and the we couldn't match their intensity. \n\nXabi is new as well and ancelotti have spoiled us by giving us 2 champions league with limited players he had and it has the downside as well which we saw last year in the form of injuries. we have been lucky with ancelotti and i don't know if luck will be on our side with Xabi or not but one thing that is certain that we need to sign players based upon our needs now. \n\nIt's our responsibility as fans to trust in Xabi because he knows his players and what to expect from them . We have certain set of players and by bringing the best out of them , we can have a goood season. Yesterday was just a bad game for our players and it happens once in a while tho we can't forget that we lost again liverpool , psg , arsenal and Barca 4 times last year and this year as well we have lost to Atleti and liverpool ( 2 big teams we faced) . Barca isn't a strong team right now and Juve is also a mess.",
        "upvotes": 80,
        "comments": 105,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oovpnu/we_have_three_elite_lws_a_18_years_old_rw_and_2/"
    },
    {
        "id": "1oozbkh",
        "author": "Gaengsa",
        "title": "Did anyone see how Rodrygo doesn't have the same spark as before when he used to come as sub?",
        "content": "Earlier, he was full of fancy feet. Looking to make darting runs in the middle, burst of energy like you rarely see from anyone. Effortlessly technical. \n\nYesterday, his eyes and body language looked so dull, like he was just doing things for the sake of it. Not sure what to do or how to create spark in the dullness. \n\nBy the way, has he gotten slightly chubbier? \nWhat do you reckon his market value is? ",
        "upvotes": 37,
        "comments": 44,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oozbkh/did_anyone_see_how_rodrygo_doesnt_have_the_same/"
    },
    {
        "id": "1ool0gv",
        "author": "Finn_Madridista",
        "title": "‪The only positive 🤍 (OC)",
        "content": "",
        "upvotes": 303,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zpdnjl5sdbzf1.jpeg?auto=webp&amp;s=6f2a3b40a6189312d795566c6c7f24e9d3b942c3"
        },
        "permalink": "/r/realmadrid/comments/1ool0gv/the_only_positive_oc/"
    },
    {
        "id": "1ooizik",
        "author": "theguywhocantdance",
        "title": "Courtois appreciation post",
        "content": "He's a goalkeeper so he'll hardly get the recognition of a Di Stefano, a Zidane or a Cristiano Ronaldo, but he deserves as much praise as them, as he is as influential in the game as they were. How many goals has this guy denied Liverpool along the years? Hats off to Courtois, a true living Madridista legend!",
        "upvotes": 308,
        "comments": 26,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ooizik/courtois_appreciation_post/"
    },
    {
        "id": "1ooiwkl",
        "author": "kanon951",
        "title": "Liverpool fans seeing Courtois performance tonight",
        "content": "",
        "upvotes": 266,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qg4ge2p8zazf1.jpeg?auto=webp&amp;s=c162bf929e9e5b5d90d934eae223747c22249889"
        },
        "permalink": "/r/realmadrid/comments/1ooiwkl/liverpool_fans_seeing_courtois_performance_tonight/"
    },
    {
        "id": "1ooxf2t",
        "author": "AffectionateGift3560",
        "title": "Do we even have a set piece manager?",
        "content": "I don't know too much about corner tactics, but you know the Real Madrid team don't  as well; if they put Vini against Van Dijk and Konaté, especially,if  he just lets them run anyway with ease. At one point he had both of them like he was going to do much. \n\nThere's no way they connected back-to-back corner headers like we're playing EA or something. \n\nArsenal are going to eat us up if we can't defend corners. \n\nI don't have a problem with the fk defending we could have done better but every team makes mistakes.\n\nFinally why can't we score our corners ? We got everything to be dangerous 🤦",
        "upvotes": 29,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ooxf2t/do_we_even_have_a_set_piece_manager/"
    },
    {
        "id": "1oorrqe",
        "author": "dahelljumper",
        "title": "Ideally, Xabi Alonso should use the next 4 Liga fixtures to rotate and try more players",
        "content": "Considering the next few matches are against teams that are mid table and also the dead last one so far, Girona, it would be very stupid to continue using the main starting XI with barely any rotation or rest.\n\nAfter Endrick got those 10 minutes in the match against Valencia, and Mastantuono being injured, I think it would be fair to give him some more time. Gonzalo could come in for Mbappé after 60 minutes, especially if Mbappé has already scored once or twice.\n\nThese next few weeks could be great for testing new tactics and positions for players, and I'm worried that instead we're gonna get the same two or three systems that allow Mbappé, Vini and Bellingham to stat pad, only for the next big match to be a let down when the team suddenly only has threat on the left wing or doesn't have a centerback that can handle physical pressure.\n\nIt's a great sign that the team is winning so much at this point, but if the crucial matches go like this, it might mean that some new things need to be tested",
        "upvotes": 76,
        "comments": 55,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oorrqe/ideally_xabi_alonso_should_use_the_next_4_liga/"
    },
    {
        "id": "1oo6fkl",
        "author": "iminiki",
        "title": "Trent's mural in Liverpool has been repainted now",
        "content": "",
        "upvotes": 492,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rwzdk4jfn8zf1.jpeg?auto=webp&amp;s=532564dc5944c5ac73c637a795115782946ce1f6"
        },
        "permalink": "/r/realmadrid/comments/1oo6fkl/trents_mural_in_liverpool_has_been_repainted_now/"
    },
    {
        "id": "1oofzfm",
        "author": "scoreboard-app",
        "title": "Match Thread: Liverpool FC vs Real Madrid Live Score | UEFA Champions League 25/26 | Nov 4, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1oofzfm)",
        "upvotes": 156,
        "comments": 6685,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oofzfm/match_thread_liverpool_fc_vs_real_madrid_live/"
    },
    {
        "id": "1oo2q0s",
        "author": "No-Independent2522",
        "title": "I still remember Mbappe feeling down in the tunnel at anfield, I hope he gets his revenge 🤍",
        "content": "",
        "upvotes": 960,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0nzblrjyh7zf1.jpeg?auto=webp&amp;s=7eba9c99d229698758232ad3be810be941346cd1"
        },
        "permalink": "/r/realmadrid/comments/1oo2q0s/i_still_remember_mbappe_feeling_down_in_the/"
    },
    {
        "id": "1oofepq",
        "author": "basilkurian247",
        "title": "📋✅ Our Starting 𝗫𝗜 🆚 Liverpool",
        "content": "",
        "upvotes": 111,
        "comments": 81,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oofepq/our_starting_𝗫𝗜_liverpool/"
    },
    {
        "id": "1oobbze",
        "author": "External_Shape_7426",
        "title": "That's how we have to play tonight! Lets go Madrid! As they said around here..\"it's time for a show\"",
        "content": "",
        "upvotes": 177,
        "comments": 11,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dchapssmk9zf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oobbze/thats_how_we_have_to_play_tonight_lets_go_madrid/"
    },
    {
        "id": "1op6q5s",
        "author": "cyrusmancub",
        "title": "Real Madrid have made Bayern’s Dayot Upamecano their CB priority and are in pole position to sign him. Konaté is still on the club’s radar but is no longer the priority.",
        "content": "",
        "upvotes": 2,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1op6q5s/real_madrid_have_made_bayerns_dayot_upamecano/"
    },
    {
        "id": "1oo9axz",
        "author": "Midtharefaikh",
        "title": "Kylian Mbappe has more goals than Liverpool's main 4 attackers. 5 if you count Wirtz",
        "content": "https://preview.redd.it/m1vu6n7p79zf1.png?width=612&amp;format=png&amp;auto=webp&amp;s=14ad7a7b407da714dea8172689877564e90c5777\n\nCrazy stat. There's no excuse not to win today, considering the form we are in and the form they have been in.\n\nI know it's a bit delusional considering it's the Champions League at Anfield after all, but I hope the game gets concluded by half time. Go 3 goals up, maybe sub off Mbappe if he has scored a goal or brace.",
        "upvotes": 185,
        "comments": 47,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oo9axz/kylian_mbappe_has_more_goals_than_liverpools_main/"
    }
]