[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 483,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i123z9",
        "author": "HandsomeStarLord",
        "title": "This the movie we need the 1995 version not this crap version of Tom cruise Netflix UK ",
        "content": "",
        "upvotes": 145,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1i123z9/this_the_movie_we_need_the_1995_version_not_this/"
    },
    {
        "id": "1i132cg",
        "author": "dailystar_news",
        "title": "WWE fans confused as Netflix show with huge debut 'runs short' as new champ crowned",
        "content": "",
        "upvotes": 104,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1i132cg/wwe_fans_confused_as_netflix_show_with_huge_debut/"
    },
    {
        "id": "1i088vi",
        "author": "Robemilak",
        "title": "‘Squid Game’ creator explains why the new character is called Rapper Thanos: \"It doesn’t really suit a rapper as a name, it was to design him to be a character fans worldwide could love.\"",
        "content": "",
        "upvotes": 2632,
        "comments": 271,
        "media": null,
        "permalink": "/r/netflix/comments/1i088vi/squid_game_creator_explains_why_the_new_character/"
    },
    {
        "id": "1i17q1s",
        "author": "Robemilak",
        "title": "Anton David Jeftha and Mark Penwill have joined the cast of Netfix’s live-action ‘ONE PIECE’ series as K.M. and Chess.",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i17q1s/anton_david_jeftha_and_mark_penwill_have_joined/"
    },
    {
        "id": "1i17ydj",
        "author": "VeryStressedOwl",
        "title": "Academic research on criminal representation in entertainment",
        "content": "Hello everyone!\n\nI need a brief moment of your time.\n\nFor my master's thesis I'm conducting research on how criminal characters are presented in entertainment media and its effect on the participant's moral &amp; punishment attitudes. I still need 100+ responses to be able to start the analysis and I would be immensely grateful if you'd participate!\n\nIt won't take more than 5-10 minutes! Thank you so much!\n\n  \nhere's the link to the survey: [https://uva.fra1.qualtrics.com/jfe/form/SV\\_39lwKA0b2b8ZyQu](https://uva.fra1.qualtrics.com/jfe/form/SV_39lwKA0b2b8ZyQu)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i17ydj/academic_research_on_criminal_representation_in/"
    },
    {
        "id": "1i0syvm",
        "author": "tinabelchersupremacy",
        "title": "“Missing You“ Series ",
        "content": "Just finished watching this show with my Mom. I feel like I just got punked lmao. Are there any cameras around me? \n\nThey spent five episodes emphasizing how much Kat loved her dad  and how she would literally stop at nothing to find out what happened to him, including illegally visiting his supposed murderer in prison. Then she finds out that not only was the ex fiancé, who abandoned her and broke her heart, was the one who killed her dad. But that her best friend (who had lied to her before) WITNESSED IT. I realized then that the show was pretty much over so I was waiting to see her reaction. \n\nShe was gonna at least yell at the ex, right? WRONG. She reaches over after a few seconds and holds his hand. \n\nWhat the actual hell? \n\nThe show was pretty all over the place to begin with. The weird dog breeder plot, The detective constantly being lied to by her closest friends and family, All these forced “twists and turns“ about Josh that turned out to have nothing to do with him etc. \n\nI guess I should’ve kept my expectations low lol but I at least expected an ending that would be a teeny bit satisfying. ",
        "upvotes": 31,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i0syvm/missing_you_series/"
    },
    {
        "id": "1i15xtc",
        "author": "Atlast_2091",
        "title": "Back in Action | Jamie Foxx, Cameron Diaz | Official Trailer | Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i15xtc/back_in_action_jamie_foxx_cameron_diaz_official/"
    },
    {
        "id": "1i0utsx",
        "author": "Such-Possibility1285",
        "title": "Loudermilk suffers from arrested development and doesn’t require new seasons",
        "content": "Love to hear about shows that get a second life and a new audience on a different platform.    And Loudermilk picked up a new audience on NF with calls for new seasons.  I’ve enjoyed the show but leave well alone, cos everything interesting to say about the characters has already been done.  \n\nThe writers stymied the progress of Sam Loudermilk by blunting significant storylines that involved him having to grow beyond his hound dog persona.  \n\nIn S1 he pursues Allison then wins her in final episode, as he is league jumping he’ll have to evolve to keep her heart.  Her character is killed off in 1st episode of S2. \n\nBen marrying Sam’s Ex as S1 big finale story beat, is completely reset to starter positions early on in S2.  Mid S2 they are living back together like it never happened.   \n\nEnd S2 Sam is literally left holding the baby, he’ll sure have to grow up fast now.  Early S3 the baby subplot is wrapped up within 1 episode.  \n\nI wish the writers had the confidence to grow the characters and not contrive to have them in their starter positions every season. It feels like they were making it up on the hoof every season, with no story arc.  \n\nThe show is a gem to discover as a joyful distraction, with Ron Livingston perfecting the grouch.  But any more seasons will lose its charm and overstay the welcome.  It’s of its time and should be enjoyed as such.  ",
        "upvotes": 15,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i0utsx/loudermilk_suffers_from_arrested_development_and/"
    },
    {
        "id": "1i1832a",
        "author": "jp106gti",
        "title": "New update? Ruined the app for me (can't use mobile data) ",
        "content": "I'd use Netflix on the train going to college, now I can't use mobile data as it's \"not apart of the household\" and only works on home WiFi, is there a workaround or is this just a thing now? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i1832a/new_update_ruined_the_app_for_me_cant_use_mobile/"
    },
    {
        "id": "1i0n84v",
        "author": "Lil_Cam_5_1",
        "title": "Anyone else addicted to the Squid Game / I-Land / 3% genre?",
        "content": "# Or the Circle (2015) and Birdbox genre of Movies via Netflix.\n\n# Or outside Netflix movies like the Cube Trilogy... \n\n# Nine Dead (2010)... \n\n# Escape Room (2019)... \n\n# House of 9 (2005)...\n\n# The Belko Experiment (2016)...\n\n# The Killing Room (2009)...\n\n# Fermat's Room (2007)",
        "upvotes": 26,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1i0n84v/anyone_else_addicted_to_the_squid_game_iland_3/"
    },
    {
        "id": "1i0m65s",
        "author": "nomnomsquirrel",
        "title": "Rumor: Old Guard 2 Going Back for Reshoots in Early Summer 2025",
        "content": "Just when we thought Netflix was finally going to release the sequel this year (which they initially finished filming in summer 2022), the movie is rumored to be going back for another round of reshoots, which means it probably won't be released in 2025 if that's the case. It was a fairly popular movie with a good number of fans. Do you guys think this is a case of trying to ensure a good product or finding some excuse to bury it for tax purposes at some point? It's been ~~84~~ 5 years almost since the first movie... \n\n[https://m.imdb.com/news/ni65065549/?ref\\_=nmnw\\_art\\_plk](https://m.imdb.com/news/ni65065549/?ref_=nmnw_art_plk) has some more info on this rumor.",
        "upvotes": 28,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i0m65s/rumor_old_guard_2_going_back_for_reshoots_in/"
    },
    {
        "id": "1i14kxn",
        "author": "Cjale-sama",
        "title": "Video Play Bar won't go away on phone even if I tap the screen",
        "content": "Whenever I play a show, the buttons won't disappear for 14 seconds which is a bit irritating. I tried tapping the screen to make it go away but to no avail. Please help",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i14kxn/video_play_bar_wont_go_away_on_phone_even_if_i/"
    },
    {
        "id": "1i04q8i",
        "author": "Substantial-Class945",
        "title": "Top 5 Netflix limited series! In my opinion 😆 ",
        "content": "Please recommend yours!",
        "upvotes": 368,
        "comments": 149,
        "media": null,
        "permalink": "/r/netflix/comments/1i04q8i/top_5_netflix_limited_series_in_my_opinion/"
    },
    {
        "id": "1i0zmwt",
        "author": "Piece_Alarmed",
        "title": "The 8 Show",
        "content": "episode 6, or whenever the main character n the other innocent ppl were free, couldnt they just have bought through their time finally? like that route seems forgotten or idk if somehow smth happened that stops that.? \n\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i0zmwt/the_8_show/"
    },
    {
        "id": "1i0kfub",
        "author": "Mysterious-Ask-4414",
        "title": "need help finding a new show",
        "content": "I like to wind down at night watching a good show, however it's been ages since I've really been into something. I like intelligent and well written shows, where u get deeply involved with the characters and story and where there's also something important at stake, like real world issues. I have liked and like more comfort shows like The Office, Parks and Rec, Curb etc., but they tend to bore me in the end and feel a bit superficial/like a waste of time so that's not what I'm looking for. I would like something to really dig deep into, something that'll engange me and something that's preferebly about real world issues/power/politics/business.\n\nI've enjoyed Succession, BB, Better Caul Saul, Game of Thrones, House of Cards to name a few, and have lately been giving Mad Men a shot (currently in the last episode of season 1, but not really feeling it). Debating whether to start West Wing/The Newsroom/The Wire/Billions/Six Feet Under instead.\n\nAnything u can recommend? Would greatly appreciate it :))",
        "upvotes": 17,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1i0kfub/need_help_finding_a_new_show/"
    },
    {
        "id": "1i0b0j9",
        "author": "Robemilak",
        "title": "Netflix UK Audience Reach Overtakes BBC1 For First Time In 2024",
        "content": "",
        "upvotes": 68,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i0b0j9/netflix_uk_audience_reach_overtakes_bbc1_for/"
    },
    {
        "id": "1i0wgny",
        "author": "SgtClunge",
        "title": "Very strange occurrence where my Netflix account seems to have been deleted. Then it happened again.",
        "content": "I’ve been subscribed to Netflix for at least 5 years and never had any issues. Then, on Sunday, my password suddenly didn’t work. I reset it and logged in and it was as if I never had an account. All profiles were gone and it was asking me which plan to sign up for.\n\nSo I did this and subscribed again, then today, 2 days later, the same thing occurred again. Password didn’t work and after reset, all profiles are deleted and it’s asking me to sign up again.\n\nAnyone experienced this?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i0wgny/very_strange_occurrence_where_my_netflix_account/"
    },
    {
        "id": "1i0v9gx",
        "author": "CommercialWin4471",
        "title": "Expos documentary ",
        "content": "Hello! Does anyone have any insight about the expos baseball documentary that’s coming out? I thought it was supposed to be streaming around January 7th but haven’t noticed it or heard anything. Thanks!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i0v9gx/expos_documentary/"
    },
    {
        "id": "1i0xqiy",
        "author": "ButterscotchBoring36",
        "title": "Best series to binge ",
        "content": "Shows I’ve watched and loved: \nThe resident \nSuits\nThe rookie \nVirgin River \nStation 19\nFire country \nGrey’s anatomy \nFriends \n\nI like medical, romance, &amp; drama! \nThanks in advance 😊",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1i0xqiy/best_series_to_binge/"
    },
    {
        "id": "1i0wk5x",
        "author": "T4nat0s231",
        "title": "Record of Ragnarok ",
        "content": "Have you seen that series where gods and humans fight to the death? I've been watching it for a while, it caught me from the first fight and I don't know what you think of the story of the anime and those who also read the manga",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i0wk5x/record_of_ragnarok/"
    },
    {
        "id": "1i0zu7g",
        "author": "dylanalduin",
        "title": "WWE, please keep the full Raw episode on Netflix",
        "content": "This current system is horrible. I have the tier where I can continue to watch the show during commercials, but it's cut out of replay? Why? Are they just throwing that footage in the trash?\n\nThere is, as far as I can tell, no way to go back and watch the full broadcast *that I was able to see live.* What possible justification is there to not have the full show in the replay?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i0zu7g/wwe_please_keep_the_full_raw_episode_on_netflix/"
    },
    {
        "id": "1i0b2hm",
        "author": "Brave-Examination-72",
        "title": "Tv show recommendation",
        "content": "Hello everyone, can you recommend some good TV shows on Netflix? I love thrillers and crime series/documentaries and comedies (I’ve already watched Squid Game, Money Heist, Law and Order and the most popular ones).\n\nThank you! 🤗",
        "upvotes": 16,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1i0b2hm/tv_show_recommendation/"
    },
    {
        "id": "1i0u7dn",
        "author": "uneatenradish",
        "title": "Recommendations for showd",
        "content": "I have just finished squid game s2 and i can’t wait for s3 in June, is there any shows on netflix that are similar to squid game? I already watched alice in borderlands and all of us are dead and im hoping to find other shows that are related to those 3",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i0u7dn/recommendations_for_showd/"
    },
    {
        "id": "1i0ozp0",
        "author": "Mxxxuro",
        "title": "Recommended Series",
        "content": "Not a big fan of watching TV a lot but I obviously watched Squid games 2 I watched the first season when it dropped so I followed up with season 2 this past few days I’ve been watching Alice in borderland and I just finished (it’s was also a very great series) now I’m trying to figure out what Asian series should I watch next last time I actually sat down and watched a full series was when the Fallout one came out on Prime (because i played the game years back) recommendations would be appreciated!",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1i0ozp0/recommended_series/"
    },
    {
        "id": "1i0j52y",
        "author": "Atlast_2091",
        "title": "Castlevania: Nocturne Season 2 | Official Trailer | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i0j52y/castlevania_nocturne_season_2_official_trailer/"
    },
    {
        "id": "1i0tp1n",
        "author": "Levigobrr",
        "title": "Problem with netflix updating shows ive watched",
        "content": "Not sure if anyone else has been experiencing this problem recently either but netflix hasnt been updating the shows ive watched and its kinda annoying for shows with multiple seasons like special victims unit cause my watched episodes are all over the place, and i have to tap into episodes info and choose the season then the episode myself, and sometimes i can get forgetful and dont know which was the last episode i watched. Has anyone else experienced this? Is it possible to fix this problem?\nAlso im new to this subreddit so lmk if the flair is incorrect ill post it under a different one instead 😓🙏",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i0tp1n/problem_with_netflix_updating_shows_ive_watched/"
    },
    {
        "id": "1hzzkv6",
        "author": "Mysterious_Ad_6190",
        "title": "Jerry Springer Documentary ",
        "content": "Okay, I keep seeing comments about what a terrible documentary it was. Could it have touched on more? Of course. But I don’t think that was the point.\n\nI think the point of the film was to get at the heart of how this show, that loved the numbers it drew from shocking the public - because they literally wanted people to stop flipping the channel when they passed by and it worked - and how the impact of seeing people violent and pitted against each other had a horrible influence on all of us.\n\nWe see reality TV shows still push the boundaries in different ways, but they feed off of making us disconnect from our own lives and play comparison - at least my life isn’t that bad!\n\nBut we are further seeing the psychological impacts on our everyday lives in the political world. We are losing our empathy for each other when we are all each deeply shaped by our life experiences. I get that everyone is different, but we’ve become so divided and I have no doubt that Jerry Springer among other reality shows, among other factors in the media are doing an excellent job at feeding our apathy. We aren’t each other’s enemies. It’s the people at the top who are playing mind games. We aren’t going to see the change we long for until we stop turning on each other.\n\nThis is what I got out of the film at least. Anyone else?",
        "upvotes": 102,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1hzzkv6/jerry_springer_documentary/"
    },
    {
        "id": "1i0so7v",
        "author": "Guitar_Man1245",
        "title": "Anyone got show suggestions?",
        "content": "Idk what else to watch\nI watched:\nSquid Games\nGinny &amp; Georgia (3 times)\nOBX (4 times)\nCyberpunk Edgerunners (twice)\nThat 90's Show\nNever Have I Ever\nArcane\n21 &amp; 22 Jump Street",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1i0so7v/anyone_got_show_suggestions/"
    },
    {
        "id": "1i0dhtd",
        "author": "R33Dazza",
        "title": "Vikings",
        "content": "Has any body else watched Vikings yet ?? me and my partner have just finished watching it at the weekend and thoroughly enjoyed it, what are other peoples take on it",
        "upvotes": 8,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1i0dhtd/vikings/"
    },
    {
        "id": "1hzjlvc",
        "author": "S4v1r1enCh0r4k",
        "title": "'Squid Game's' Park Sung-hoon Drops Out of K-Drama, 'The Tyrant’s Chef,' After NSFW Social Media Controversy",
        "content": "",
        "upvotes": 1008,
        "comments": 219,
        "media": null,
        "permalink": "/r/netflix/comments/1hzjlvc/squid_games_park_sunghoon_drops_out_of_kdrama_the/"
    }
]