[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1oi550s",
        "author": "Vittoriooh",
        "title": "Tram metro e SFM",
        "content": "",
        "upvotes": 40,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/252t7kmmrtxf1.jpeg?auto=webp&amp;s=9ca6f826ed92176e9b55e93e6df3375f3438e0a5"
        },
        "permalink": "/r/torino/comments/1oi550s/tram_metro_e_sfm/"
    },
    {
        "id": "1oi72m6",
        "author": "zacchinator",
        "title": "Vista di Crocetta e delle Colline del Po",
        "content": "La luce autunnale a Torino è incredibile. Adoro il contrasto tra le ville signorili e l'esplosione di verde, giallo e rosso degli alberi. Un angolo di pace, nonostante siamo in piena città. 🌿🏘️",
        "upvotes": 9,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z9q86u2uauxf1.png?auto=webp&amp;s=4aff5190522b4835836ccd2ad17b90627fbb84d4"
        },
        "permalink": "/r/torino/comments/1oi72m6/vista_di_crocetta_e_delle_colline_del_po/"
    },
    {
        "id": "1oibhvh",
        "author": "Glad-Lecture-1700",
        "title": "Piscine Torino centro",
        "content": "Consigli per piscine con possibilità di nuoto libero per adulti a Torino centro con prezzi decenti? \n\nHo trovato la piscina comunale Cecchi ma pare che sia aperta per il nuoto libero solo fino alle 15.30 e, lavorando, potrei andare solo dopo le 18. \n\nHo provato a chiamare la \"Omniafit\" che pare avere buone recensioni ma mi hanno chiesto di andare fin là solo per sapere il prezzo, cosa idiota che purtroppo fan tutte le palestre, magari se qualcuno ci va sa dirmi quanto costa senza dovermi fare 30 minuti di bus per conoscere un prezzo nel 2025...",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1oibhvh/piscine_torino_centro/"
    },
    {
        "id": "1oi4j1c",
        "author": "Sufficient-Visit-440",
        "title": "Corso Principe Oddone angolo Dora, com'è?",
        "content": "Ciao a tutti, non sono di Torino e volevo chiedervi che ne pensate della zona tra corso Principe Oddone e il fiume Dora. Avrei trovato lì una palestra che mi interessa, ma non so come sia la zona soprattutto la sera.   \nQualcuno conosce la zona?  \nCom'è a livello di sicurezza, specialmente la sera? ",
        "upvotes": 5,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w54i17a6ktxf1.png?auto=webp&amp;s=28496593c91e6fa96fc7133717dc24d8ee55b8e4"
        },
        "permalink": "/r/torino/comments/1oi4j1c/corso_principe_oddone_angolo_dora_comè/"
    },
    {
        "id": "1oidk8g",
        "author": "Tough-Anybody1579",
        "title": "Consigli su cosa fare ad Halloween per una diciassettenne?",
        "content": "Titolo. Qualsiasi locale/attività va bene basta che non costi troppo ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oidk8g/consigli_su_cosa_fare_ad_halloween_per_una/"
    },
    {
        "id": "1oicpqu",
        "author": "Hyzev_",
        "title": "AAA Cercasi compagni di studio",
        "content": "Ciao ragazzi, dato che ogni giorno leggo dei post generici per fare gruppo e conoscere gente nuova ci provo anche io ma in modo più specifico.\n\nSono un ragazzo di 28 anni che lavora da 5 e per questo ha messo in pausa la propria carriera universitaria. Vorrei ricominciare a studiare decentemente e con costanza quindi vorrei creare un gruppo di studio per aumentare un po' la motivazione. Attualmente sono iscritto al corso di laurea triennale in Informatica presso UNITO, essendo uno studente lavoratore ho degli orari un po' stravaganti ma magari qualcuno vuole unirsi a me anche solo una volta a settimana. Fino ad ora ho sperimentato solo l'aula studio EDISU in San Salvario, per me va benissimo ma sono disponibile a valutarne altre. L'importante è che siano aperte fuori dall'orario d'ufficio, i miei orari sono:\n\nLunedi: -\nMartedi: 19:00/23:00\nMercoledi: -\nGiovedi: 19:00/23:00\nVenerdi: -\nSabato: 10:00/20:00 \nDomenica: 10:00/20:00\n\nVorrei creare un gruppetto (anche su wa/tg) per organizzarci, scrivetemi pure in dm (anche studenti stranieri ed erasmus sono ben accetti!)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oicpqu/aaa_cercasi_compagni_di_studio/"
    },
    {
        "id": "1ohtiof",
        "author": "Bella_Goldhood",
        "title": "Nuove amicizie a Torino post relazione tossica",
        "content": "Buonasera a tutti, sono nuova su Reddit quindi spero di star postando nel posto giusto e nel modo giusto.\n\nHo letto una sfilza di post su “come fare amicizie a Torino” ma oltre a constatare che a Torino siamo in molti a vivere questo problema, non ho trovato una soluzione brillante e definitiva per il mio caso.\n\nVorrei spiegare da cosa nasce la mia difficoltà: ho 24 anni e sono uscita da poco da una relazione problematica che per diversi motivi mi ha completamente isolata dal mondo e impedito di costruirmi solide amicizie, per cui adesso mi ritrovo quasi sempre da sola e senza nulla da fare se non per qualche uscita saltuaria.\n\nAvendo concluso l’università, è anche venuto meno l’ambiente in cui più potevo cercare di stringere nuovi rapporti e ora che comincerò a lavorare sono limitata ai pochi colleghi non coetanei che avrò in ufficio.\n\nNon mi aspetto e non pretendo di trovare un gruppo di amici qui su Reddit ma sono alla ricerca di nuove persone da conoscere e nuovi interessi da coltivare, pertanto mi sembrava un buon punto di partenza chiedere a chi ha vissuto una situazione come la mia cosa ha fatto/come ne uscito e a chi ha tante passioni cosa fa nella vita nel tempo libero.\n\nMi rendo conto suoni banale ma per riprendersi da relazioni del genere bisogna completamente mettersi in discussione, e sicuramente farlo in compagnia alleggerisce il carico.\n\nQuesto è quanto, grazie a chiunque risponderà e buona serata a tutti.",
        "upvotes": 15,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1ohtiof/nuove_amicizie_a_torino_post_relazione_tossica/"
    },
    {
        "id": "1oi4y16",
        "author": "DarkDoomDimension",
        "title": "Prefettura di Torino Appointment",
        "content": "Hey everyone,  \nI’m new here in Italy and a foreigner trying to figure out how to book an appointment for **document legalization** at the **Prefettura di Torino**.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1oi4y16/prefettura_di_torino_appointment/"
    },
    {
        "id": "1oi4isq",
        "author": "vasilnazarov",
        "title": "Parcheggi gratis zona San Salvario?",
        "content": "Studio fisica a UniTo (il dipartimento è accanto al Parco del Valentino), e volevo capire se mi conveniva andare col bus o con la macchina (siccome sto in un comune decentemente lontano).\n\nCi sono parcheggi gratis in questa zona? Va bene anche se è distante una mezz'oretta a piedi, basta che sia libero di mattina.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1oi4isq/parcheggi_gratis_zona_san_salvario/"
    },
    {
        "id": "1oi4dn2",
        "author": "AdThese6575",
        "title": "Collezionismo/Carte Torino",
        "content": "Ciao a tutti, quali sono secondo voi i migliori rivenditori Pokémon a Torino? Riuscireste a consigliarmi qualche negozio/edicola in città o poco fuori?\n\nGrazie in anticipo! ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1oi4dn2/collezionismocarte_torino/"
    },
    {
        "id": "1oi5h91",
        "author": "Slay3r024",
        "title": "Come arrivo all’inalpi arena?",
        "content": "Salve ragazzi, il 20/05/26 dovrò andare a un concerto all’inalpi arena e volevo chiedere consigli a qualcuno del posto, sia per come arrivarci (credo di arrivare dalla stazione porta nuova, anche qui se potreste dirmi se mi conviene arrivare qui da roma) sia come funziona il sistema di metro.\n\naereoporti invece?\n\ne in caso se qualcuno conosce qualche b&amp;b in zona.\n\n\novviamente, farò da ora ricerche online per rispondere a queste domande, ma nessuno conosce una città più di un suo cittadino.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1oi5h91/come_arrivo_allinalpi_arena/"
    },
    {
        "id": "1oi1yv3",
        "author": "Necessary-Luca01",
        "title": "Nuove conoscenze a Torino",
        "content": "Sono un ragazzo di 24 anni  in cerca di nuove amicizie, persone con cui organizzare uscite",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oi1yv3/nuove_conoscenze_a_torino/"
    },
    {
        "id": "1oi1xk9",
        "author": "GoodHorse1926",
        "title": "Torino festa bianca",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oi1xk9/torino_festa_bianca/"
    },
    {
        "id": "1ohsbnx",
        "author": "guigbd",
        "title": "Nuove connessioni e good vibes",
        "content": "Ciao a tutti!  \nAbbiamo messo in piedi un gruppo a Torino per chi ha voglia di conoscere gente nuova, bere qualcosa in compagnia e passare serate diverse dal solito. La cosa bella? Dentro ci sono studenti (ma anche no!) da ogni parte del mondo e con hobby di ogni tipo — dal gamer all’appassionato di cucina, fino a chi ama il trekking o semplicemente chiacchierare davanti a una birra.\n\nOrganizziamo eventi dal vivo dove si gioca, si ride, si scoprono posti nuovi in città e, ogni tanto, ci scappa pure una gita fuoriporta per prenderci una pausa insieme.  \nNiente stress, niente formalità: solo voglia di stare in buona compagnia e allargare un po’ il giro di amicizie.\n\n[Uno dei nostri eventi al Valentino](https://reddit.com/link/1ohsbnx/video/e64l1kv5bqxf1/player)\n\nSe vi va di unirvi o anche solo curiosare, fatevi vivi nei commenti o in DM. Più siamo, più ci divertiamo.  \n",
        "upvotes": 4,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1ohsbnx/nuove_connessioni_e_good_vibes/"
    },
    {
        "id": "1ohtmha",
        "author": "b1729",
        "title": "Hiking",
        "content": "Hi everyone! Which places near to Turin would you recommend for hiking? Thank you.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ohtmha/hiking/"
    },
    {
        "id": "1ohiawi",
        "author": "Marengard",
        "title": "Gay bar?",
        "content": "Premetto che non abito a Torino, ma in un paesino vicino ad Asti. \nVorrei sapere se c’è qualche bar frequentato principalmente da ragazzi gay, perché mi piacerebbe conoscere qualcuno, non solo per andarci a letto ma anche per qualcosa di un po’ più serio. \nNon essendo molto un tipo da discoteca non saprei dove altro incontrare qualcuno se non in qualche bar.\n\nNon essendo dichiarato con tutti non posso cercarne ad Asti, ma anche se fosse non saprei come trovarli haha.\n\nGrazie in anticipo per i suggerimenti!",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ohiawi/gay_bar/"
    },
    {
        "id": "1ohs8z2",
        "author": "Additional-One-9554",
        "title": "Posti interessanti in cui lavorare sul mio MacBook (smart working)",
        "content": "CIAO! Hai qualche consiglio su posti tranquilli, anche bar, dove poter lavorare in smart (coworking non a pagamento) a Torino? Grazie.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ohs8z2/posti_interessanti_in_cui_lavorare_sul_mio/"
    },
    {
        "id": "1ogtako",
        "author": "freddyravioli",
        "title": "Grazie Torino! Sei stata una favola. Thank you Torino, you were a dream!",
        "content": "I just spent the most wonderful solo weekend in Torino! The beautiful sun shining I’m sure helped, however I truly found it to be one of the most charming and underrated Italian cities I’ve visited.\n\nThe people were friendly and warm. \n\nThe food is to die for - from the traditional home cooking to the Michelin fine dining. The shopping is excellent. The chocolate delicious, the architecture gorgeous and the wine selection vast and moderately priced. \n\nI didn’t get to see and do everything I wanted to - particularly on the museum front as the weather was too nice to be indoors, but here were a few things I did do which I would recommend.\n\n1. Grab a drink at Banco. Whether wine or a great martini, it’s intimate and vibey and the staff are friendly. \n2. The Hilton Turin Centre is in a great location and comfortable. \n3. Splurge on a truly unforgettable dinner at one star Michelin restaurant Unforgettable. Unique concept and great staff. \n4. Take a nice long walk by the river Po \n5. Eat an incredible piemontese lunch at caffè dell’orologio. The wine selection was chef’s kiss and I honestly nearly ate two pasta dishes.\n\nWander, walk, get lost and look up.\n\nGrazie Torino, I’ll be back!! \n\n",
        "upvotes": 80,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ogtako/grazie_torino_sei_stata_una_favola_thank_you/"
    },
    {
        "id": "1ohbenj",
        "author": "GenauTurin",
        "title": "Techno parties in Turin with GENAU - November-December",
        "content": "https://reddit.com/link/1ohbenj/video/3mm3lo4kymxf1/player\n\n  \n  \nWinter is coming and we're ready to heat you with a new series of **GENAU parties** for November and December! Celebrate pure clubbing and join our techno community in some of the finest venues in Turin such us [@notoriusclubtorino](https://www.instagram.com/notoriusclubtorino/), [@gianca.murazzi](https://www.instagram.com/gianca.murazzi/) and [@bunkertorino](https://www.instagram.com/bunkertorino/): we will host a selection of the best techno djs and producers around to make you dance all night, supported by our residents!  \n  \n🎟 10€ Early Bird Tickets for all our events are already out on our LINKTREE (limited availability)  \n  \n08.011.25 (Saturday)  \nw/ **Ø \\[PHASE\\]** [@phase\\_modwerks](https://www.instagram.com/phase_modwerks/) (Modwerks - Mote Evolver / UK), Bassik, Polizei  \n📍Notorius Club  \n  \n21.11.25 (Friday)  \nw/ **FELICIE** [@felicie.music](https://www.instagram.com/felicie.music/) (Fastgroove - Clergy / FR), Black Crow, Gandalf  \n📍Gianca Club Murazzi  \n  \n06.12.25 (Saturday)  \nw/ **ESTELLA BOERSMA** [@estellaboersma](https://www.instagram.com/estellaboersma/) (eb\\_rex - Lobster Theremin / NL), Gandalf, Polizei  \n📍Notorius Club  \n  \n12.12.25 (Friday)  \nw/ **REKA ZALAN** [@rekanorazalan](https://www.instagram.com/rekanorazalan/) (Hardwax / DE), Delle Orfane, Saffio  \n📍Gianca Club Murazzi  \n  \n19.12.25 (Friday)  \nw/ **SETAOC MASS**  [@setaoc\\_mass](https://www.instagram.com/setaoc_mass/) (SK\\_eleven / UK), Gandalf, Max Sensation  \n📍Bunker\n\n**10€ Early Bird Tickets** on sale for all parties (limited availability) &gt; [https://xceed.me/world/events/all/all-events/channel--genau-secret](https://xceed.me/world/events/all/all-events/channel--genau-secret)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ohbenj/techno_parties_in_turin_with_genau/"
    },
    {
        "id": "1ohatps",
        "author": "Impressive_Lynx_7938",
        "title": "Ristorante Torino",
        "content": "Qualcuno mi sa consigliare un ristorante/osteria o comunque un posto dove andare a mangiare bene a Torino senza spendere troppo? \nVa bene sia cucina piemontese che alla you can eat interessanti (no sushi).\nGrazie ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ohatps/ristorante_torino/"
    },
    {
        "id": "1ohf4l8",
        "author": "Lostingoogle",
        "title": "Qualcuno a Torino ha attivato la fibra Digi?",
        "content": "Sto valutando varie offerte di internet a casa e ho visto che Digi offre fibra FTTH a prezzi davvero bassi (10 €/mese).  \nSembra quasi troppo bello per essere vero, quindi mi chiedevo com’è la qualità della connessione: stabile? ping decente? assistenza affidabile?  \nSe qualcuno la usa già a casa, mi piacerebbe sapere come si trova.",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1ohf4l8/qualcuno_a_torino_ha_attivato_la_fibra_digi/"
    },
    {
        "id": "1ohexb4",
        "author": "mainapizza",
        "title": "Posti in montagna per workshop",
        "content": "Ciao a tutti, ci provo. \n\nSto cercando dei posti che si trovino in montagna per organizzare workshop, in particolare mi interessa che:\n\nAbbiano proiettore e casse\nFacciano pensione completa (colazione, pranzo e cena)\nIn contesti immersivi, ad esempio Ceresole Reale o simili \nAvete qualche idea, anche se non sapete per certo? \n\nGrazie mille ❤️",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ohexb4/posti_in_montagna_per_workshop/"
    },
    {
        "id": "1ogtqzx",
        "author": "Abject-Analysis-4179",
        "title": "Qualcuno per nuove conoscenze a Torino?",
        "content": "Ciao! Sono una ragazza di 23 anni e mi piacerebbe ampliare un po’ il giro di conoscenze qui a Torino.  \nNon sono tipo da discoteca, quindi mi chiedevo se ci fossero posti più tranquilli dove socializzare.  \nAdoro invece i circoli culturali, i locali con musica dal vivo (soprattutto rock) e le chiacchierate senza troppa confusione.  \nCerco persone con cui uscire ogni tanto, scoprire eventi o semplicemente bere un caffè.  \nSe ti va, lascia un commento qui sotto. :)",
        "upvotes": 23,
        "comments": 56,
        "media": null,
        "permalink": "/r/torino/comments/1ogtqzx/qualcuno_per_nuove_conoscenze_a_torino/"
    },
    {
        "id": "1ogsn7r",
        "author": "BoudoirdiVeronica",
        "title": "Just looking for real, simple connection in Torino",
        "content": "Hey! I recently moved to Turin and I’m looking for real, simple connection not romance, just friendly, easy-going people to hang out with.\nThe kind of people you can go at vintage market, to the bar or exhibition.\nI’ve been to a few expat meetups they were fun, but I’d love something smaller and more spontaneous.\nWould be great to have a few people to text and meet regularly, not only during events.\n\nI sew lingerie and corsets, love art, cozy spots, vintage, museums, dancing or just walking around and talking about life.\nI have a small dog, speak English (but it’s not my first language), and I’m learning Italian and happy to practice together if you are too.\nOh, and Halloween is coming — if anyone’s looking for company to go out, I’m in!\nIf this sounds like something you’d enjoy too, feel free to message me.\nOr if you know where to find chill people in Turin , I’m all ears.",
        "upvotes": 26,
        "comments": 26,
        "media": null,
        "permalink": "/r/torino/comments/1ogsn7r/just_looking_for_real_simple_connection_in_torino/"
    },
    {
        "id": "1ohcemx",
        "author": "irmakinon",
        "title": "RC auto prezzo",
        "content": "Ciao, è normale pagare 1500 euro per l’RC Auto? Grazie. (ho 22 anni)",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1ohcemx/rc_auto_prezzo/"
    },
    {
        "id": "1ohezn4",
        "author": "mxschutz",
        "title": "Consigli sul parcheggio per raggiungere a piedi piazza Bodoni (di sera)? Ovviamente sono disposto a camminare un po'",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ohezn4/consigli_sul_parcheggio_per_raggiungere_a_piedi/"
    },
    {
        "id": "1oh9o71",
        "author": "isthisyasmin",
        "title": "Restricted driving times in Torino",
        "content": "Hello, I'm fairly new to the city. I have a car to commute to work north of the city about 2-3 times per week, but luckily I don't need to go near the ZTL areas in centro. I just learned there's winter driving restrictions, but I can't seem to find the official rules. Some sites say alternate days are restricted depending on your license plate, and another says only the first Sunday of the month. I haven't found anything about where the boundaries are, though. Can anyone provide insight or point me in the right direction?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oh9o71/restricted_driving_times_in_torino/"
    },
    {
        "id": "1ogz5s3",
        "author": "Tony_zer0five",
        "title": "Cerco amici con la passione dei fumetti, lego e videogiochi",
        "content": "Ciao sono un ragazzo di 20 che abita in provincia di torino.\nCerco qualcuno con cui fare amicizia che abbia la passione per i fumetti o lego o videogiochi \nVorrei conoscere qualcuno che si aggira nella mia età va bene sia maschi che femmine.\nMi piacciono i lego e li colleziono.\nLego fumetti Marvel, DC, image, Mirage, spawn, Tmnt, Punisher, Deadpool, spiderman e tantissimi ho una grande collezione.\nMi piacciono i videogiochi come Minecraft, GTA, the forest, Cod\nMi piacciono anche i giochi di carte ma non sono molto esperto a giocare.\nMi piacciono anche gli skateboard e sto cercando di imparare ad andarci \nFaccio arti marziali ora faccio brasilian jiu jitsu e in passato ho fatto altri sport \nMi piace andare ai mercatini delle pulci e del vintag\nSono molto socievole \nSe ti interessa contattami qui ho in privato.\nSpero di trovare qualcuno come me. ciao",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ogz5s3/cerco_amici_con_la_passione_dei_fumetti_lego_e/"
    }
]