[
    {
        "id": "1iim34y",
        "author": "RM_Official_Thread",
        "title": "[Post-Match Thread] Real Madrid defeat Leganes 3-2",
        "content": "Highlights here:\n\n[Modric 1-0](https://www.reddit.com/r/realmadrid/s/GSzBRsXo2y)\n\n[Endrick 2-0](https://www.reddit.com/r/realmadrid/s/mrc2gLzNf9)\n\n[Garcia 3-2](https://www.reddit.com/r/realmadrid/s/oK1WKUjpnU)",
        "upvotes": 109,
        "comments": 341,
        "media": null,
        "permalink": "/r/realmadrid/comments/1iim34y/postmatch_thread_real_madrid_defeat_leganes_32/"
    },
    {
        "id": "1igml0a",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 24,
        "comments": 1425,
        "media": null,
        "permalink": "/r/realmadrid/comments/1igml0a/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1iim0jp",
        "author": "AestheticEvan23",
        "title": "Gonzalo Garcia make it 3-2",
        "content": "",
        "upvotes": 1702,
        "comments": 152,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fugt502k6ehe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1iim0jp/gonzalo_garcia_make_it_32/"
    },
    {
        "id": "1iiwuyx",
        "author": "beekay8845",
        "title": "Vinícius Júnior in the last two matches: He got into a fight with Dani Ceballos during the Espanyol match. He got into a heated argument with Luka Modrić during the Leganés match.",
        "content": "ℹ️🗞️ Details of the quarrel and disagreement that happened yesterday between Modrić and Vinícius per @marca and Cadena Ser! \n\nFive minutes before the end of the match, Leganés took the ball and played a counterattack that ended in a corner. Then Modrić went towards Vinícius and asked him to return and support the team defensively.\n\nVinícius did not like that and responded to Modrić, who in turn raised his voice and scolded him publicly. Alfredi also did not like Vinícius's reaction and asked him to respect Modrić. \n\nModrić was annoyed with Vinícius more than once for not cooperating with the group defensively. He spoke to him twice and asked him to return, but the Brazilian ignored him. The third time, Modrić spoke to him and asked him the same thing. Vinícius responded with a gesture with open hands as if to say, \"What do you want from me?\" Modrić shouted at him, \"Go to hell.\"\n\nCadena Ser confirmed that these shots did not appear in the TV broadcast. Vinicius left the field immediately after the referee's whistle and did not celebrate with his teammates.\n",
        "upvotes": 193,
        "comments": 125,
        "media": null,
        "permalink": "/r/realmadrid/comments/1iiwuyx/vinícius_júnior_in_the_last_two_matches_he_got/"
    },
    {
        "id": "1iieve7",
        "author": "Zeus1196",
        "title": "Kroos to Valverde: Don’t Touch the Ball, Just Watch.",
        "content": "",
        "upvotes": 1998,
        "comments": 84,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/oc8mrpqxpche1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1iieve7/kroos_to_valverde_dont_touch_the_ball_just_watch/"
    },
    {
        "id": "1iifurj",
        "author": "SubjectTumbleweed216",
        "title": "Pepe: “Ronaldo offered me part of his salary to stay at Madrid”, “I remember I received a knock to the head by Iker Casillas, and had to go to the hospital. When I woke up, I had no idea what happened and saw Cristiano Ronaldo stayed there all night with my wife and kids”",
        "content": "Full transcript:\n\nYour leave from Madrid?\n\nThat's how it is, I talked to him a lot and he told me to stay at Real Madrid. But I think my time at the club had already arrived, because it was 10 years of great demand, where I gave up a lot of time. I tried to explain to him that I could no longer be there because of the difficulties I was having at that time and he said: \"If it's for the money, man, I'll give up my money to give it to you!\". And I said no: \"Thank God it's not for that, it's for other issues\". I also wanted to feel football again, and that's it, I chose to go to Turkey.\n\nThere were eight seasons in common in Madrid. There are surely good stories to remember and some less good ones too. Eight seasons is a lot...\n\nLook, I have a moment with Cris that will never leave my memory. Despite having lost my memory, I lost a piece of this game. It was in the first game of the championship against Valencia. I received a blow from Iker [Casillas], opened my head and went to the hospital. I still entered the game [before that]. There were five minutes left, I entered after the break and, that's it, from there I don't remember anything else.\n\nI remember that when I woke up the next day at the hospital, I was still with Real Madrid equipment tied to the bed. Then, I was going to ask my family what had happened, my wife, who was five days away from having my eldest daughter, who is Angeli, and in the news I see that Cris had been there in the hospital!\n\nAnd you didn't even give it for him?\nAnd I didn't even notise him! And then, of course, my mother was there, also worried because she had come to see the birth of my daughter, my mother and my father. Cris was there practically all night with me, with my family members. Not with me, with my family, because I was in the room. But he was there, giving strength and some comments he made only demonstrate the affection we have for each other.\n\n\nDid you have an ordinary social life in Madrid? Have you ever cooked for him or did he cook?\n\n[laughs] Not that! It was easier for me to go to his house, because he invited me a lot. We went to his house, we had dinner at his house, or sometimes we went out for dinner and then we came home [laughs].\n",
        "upvotes": 1357,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_z3kHA5Aggml2QLYw0JFdxh2MdfuqmunA7XZkbLPJ48.jpg?auto=webp&amp;s=2bd6978772a98f04e0f7f6afe91f9558b9c4234b"
        },
        "permalink": "/r/realmadrid/comments/1iifurj/pepe_ronaldo_offered_me_part_of_his_salary_to/"
    },
    {
        "id": "1iim8xp",
        "author": "Theme_Severe",
        "title": "Made in La Fabrica GG!",
        "content": "",
        "upvotes": 586,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/l7jhxrba8ehe1.jpeg?auto=webp&amp;s=80cc88d8ff123f9446ec5fb6e6c677239554ff6f"
        },
        "permalink": "/r/realmadrid/comments/1iim8xp/made_in_la_fabrica_gg/"
    },
    {
        "id": "1iikfcs",
        "author": "Ready_Ad_1353",
        "title": "Luka Modric makes it 1-0",
        "content": "",
        "upvotes": 604,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/x5cixm7wudhe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1iikfcs/luka_modric_makes_it_10/"
    },
    {
        "id": "1iigeoa",
        "author": "ae_babubhaiya",
        "title": "Our starting 11 against Leganes. I don't have like, so posting it as images. If this is not okay, mod you can delete it",
        "content": "",
        "upvotes": 729,
        "comments": 162,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/othkheww1dhe1.png?auto=webp&amp;s=342955de4cd0b974463c1985bc54c8a2f9148f72"
        },
        "permalink": "/r/realmadrid/comments/1iigeoa/our_starting_11_against_leganes_i_dont_have_like/"
    },
    {
        "id": "1iiklzs",
        "author": "AestheticEvan23",
        "title": "Endrick goal for the 2-0",
        "content": "",
        "upvotes": 417,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6aadfksawdhe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1iiklzs/endrick_goal_for_the_20/"
    },
    {
        "id": "1iiivpx",
        "author": "RM_Official_Thread",
        "title": "[Match Thread] Leganes versus Real Madrid, Copa del Rey",
        "content": "No auto updates today because the bot doesn't recognize Copa del Rey as an official tournament. \n\nAnd neither do we if we lose. ",
        "upvotes": 207,
        "comments": 2941,
        "media": null,
        "permalink": "/r/realmadrid/comments/1iiivpx/match_thread_leganes_versus_real_madrid_copa_del/"
    },
    {
        "id": "1iihsxl",
        "author": "justfootball101",
        "title": "Atlético madrid on twitter, before the derby.",
        "content": "Shameless.",
        "upvotes": 187,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/u9my7mjybdhe1.jpeg?auto=webp&amp;s=9849b5bb8c0385bbeec040a9151eb61b8a787967"
        },
        "permalink": "/r/realmadrid/comments/1iihsxl/atlético_madrid_on_twitter_before_the_derby/"
    },
    {
        "id": "1iiaj7o",
        "author": "SubjectTumbleweed216",
        "title": "[marca] West Ham came for Endrick during the winter market. Refused by both Real Madrid and Endrick.",
        "content": "",
        "upvotes": 416,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sIqdVzIvu_ey4Y5QDJV9dX2yJjv8mr2xd6PGTcDWKXo.jpg?auto=webp&amp;s=6326d116eaa70b60de94f2432ad12874ead6865e"
        },
        "permalink": "/r/realmadrid/comments/1iiaj7o/marca_west_ham_came_for_endrick_during_the_winter/"
    },
    {
        "id": "1iiqz79",
        "author": "m_____9",
        "title": "Is the original Real Madrid jersey worth it as a gift",
        "content": "My boyfriend's birthday is coming up, and he's a huge Real Madrid fan and one of his biggest dream is going to Santiago Bernabéu. He has TONS of RM jerseys, but none of them are original. I went to an Adidas showroom yday and saw the official jersey. I can afford it, so that's not an issue, but I'm unsure if it's worth it because before when I asked him why he never bought an original jersey, he said he doesn’t think it’s worth the price. And that he can get exact looking replicas for way lesser price. But I also feel if he had been making more money - he's studying, doing masters rn - he would have invested in at least one original jersey. (That's just me thinking, idk)\n\nFor those who own original jerseys or collect football merch, what do you think? Would an official jersey make a good gift or should I just get him something else instead.\n",
        "upvotes": 47,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1iiqz79/is_the_original_real_madrid_jersey_worth_it_as_a/"
    },
    {
        "id": "1ii43ty",
        "author": "Witty53",
        "title": "Scenes against man city",
        "content": "",
        "upvotes": 1102,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ensyzxs1o9he1.jpeg?auto=webp&amp;s=f4d92a58ba4724397da7f0e481e6d1f252202520"
        },
        "permalink": "/r/realmadrid/comments/1ii43ty/scenes_against_man_city/"
    },
    {
        "id": "1ihvffc",
        "author": "Dany130",
        "title": "Real Madrid congratulates Cristiano Ronaldo his 40th Birthday",
        "content": "",
        "upvotes": 3878,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cg7zeowwe7he1.jpeg?auto=webp&amp;s=71dc2c57c459a05eae0e8486edbe92a71e9e43a7"
        },
        "permalink": "/r/realmadrid/comments/1ihvffc/real_madrid_congratulates_cristiano_ronaldo_his/"
    },
    {
        "id": "1iiy7av",
        "author": "blueXwho",
        "title": "Stop spreading the media hate",
        "content": "Every day, I see post after post going against our own. The latest one is an argument between Vinicius and Modric. Don't you realize this is coming from the leeches in the antimadridista media? Maybe you do and are an antimadridista yourself.\n\nIn football, things happen on the pitch, players have arguments, they can be heated, especially when the team is in a tight situation, but that stays there. Of course, the media likes conflict, it gets them clicks, and some \"journalists\" have been on a payroll to damage Real Madrid image. Why would you help them?\n\nIt baffles me how much antimadridismo we see in this sub. Isn't the purpose of this community to support the club, our team? What do you gain from spreading the hate?",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1iiy7av/stop_spreading_the_media_hate/"
    },
    {
        "id": "1ii4xhv",
        "author": "77SidVid77",
        "title": "Real Madrid is currently #1 in UEFA 5 year club coefficient ranking",
        "content": "",
        "upvotes": 386,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jnuinq5oy9he1.png?auto=webp&amp;s=31f493784313ba0e566f5474a773d924b202c53a"
        },
        "permalink": "/r/realmadrid/comments/1ii4xhv/real_madrid_is_currently_1_in_uefa_5_year_club/"
    },
    {
        "id": "1ii86we",
        "author": "Finian_mbappe",
        "title": "Pre-Match Thread: Leganes vs Real Madrid",
        "content": "Since mods forgot to post pre-match thread, i decided to step in.",
        "upvotes": 175,
        "comments": 82,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i339gb2h6bhe1.jpeg?auto=webp&amp;s=46ae6d019508a8c456db33b79e7bba287b9bc4c0"
        },
        "permalink": "/r/realmadrid/comments/1ii86we/prematch_thread_leganes_vs_real_madrid/"
    },
    {
        "id": "1iim0fe",
        "author": "chui77",
        "title": "[Post Match Survey] Real Madrid 3-2 Leganés",
        "content": "",
        "upvotes": 23,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/75BOiWgBuh7Vpt-TxwmQAZf_z-nlCpgYKXm_2wLZFYo.jpg?auto=webp&amp;s=26f705c67b02271f83458aece7feaf378b14c5eb"
        },
        "permalink": "/r/realmadrid/comments/1iim0fe/post_match_survey_real_madrid_32_leganés/"
    },
    {
        "id": "1iiditp",
        "author": "UhhhhhNoThanks",
        "title": "Can i buy a Raúl Asencio shirt anywhere?",
        "content": "Hi everyone.\n\nSince the season started, i've really enjoyed Asencio's performances, and i've been wondering if i can buy an official Asencio shirt with the number 35 on the back.\n\nI've been looking at different websites that only has one with the number 5, so do i have to get a custom print, or are there any place that has it printed?\n\nThanks in advance",
        "upvotes": 31,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1iiditp/can_i_buy_a_raúl_asencio_shirt_anywhere/"
    },
    {
        "id": "1ii3jiv",
        "author": "Different_Craft5237",
        "title": "People never really think things through when asking why the club does not make moves in the Winter transfer",
        "content": "I'm gonna try to make this as simple as possible by changing the perspective one second and considering the combinations between these 2 elements :\n\n\\- Title contender vs Mid Table (or below) teams\n\n\\- Key starters vs bench (or rotation) players\n\n**Scenario 1:  We want to loan a key starter from a title contender team**\n\nNow why dafuq would any team in their right mind give up any key player while playing for trophies. That's never gonna happen. So we can already forget that.\n\n**Scenario 2:  We want to loan a bench player from a title contender team**\n\nOkay, yes these may be players that they can dispose of, but why would they want to help you strengthen your squad if they're likely competing against you (domestically or continentally).\n\n**Scenario 3:  We want to loan a key starter from a mid table team**\n\nAlso not gonna happen. Think about it, why would I loan you a guy who's having a stellar season for me and is helping my club finish higher in the league tables than usual (thus securing more revenue) right in the middle of the season ? Also, this player who's an X-factor for me, probably will get less minutes at your club (Real Madrid), which will kill his momentum and hype. So once he gets back from loan, his resell value will have taken a massive hit.\n\n*Imagine if Jovic went on loan in January 6 months before we bought him. He would have been exposed, and no way any sane club would pay the 80M we paid.*\n\nSo no, again, these types of players don't get loaned. If you want them, you're gonna pay a nice premium like City just did for Marmoush, cause Frankfurt's performance won't be the same going forward and they made sure City paid upfront for the upcoming $$ losses.\n\n**Scenario 4:  We want to loan a bench player from a mid table team**\n\nNow why the hell would we do that. Unless we want to end up with Mariano and Vallejo 2.0.\n\n\n\nSo you see where I'm trying to go here. \n\nHowever, there is one final scenario not mentioned, but the stars have to align.\n\n**Scenario 5:  A key starter from a title contender team falling off with the current coach and forces a move**\n\nThis is the only time when a club like Real Madrid could actually consider a loan move. Cause the player in cases like this did not become shit, he just did not fit the manager's plans/system anymore. But the player is still serviceable. And in situations like this, the loan actually makes everyone happy. The manager no longer has locker room drama, the players gets playtime, the new club gets a player who can help them. And bonus, once the players comes back from loan, his value didn't tank, cause he actually showed his quality at the club he was loaned to, unlike if he had stayed at his original club and rot on the bench. But again, the stars have to align for such players to be available when you need them.\n\nUltimately, the football world is not just Real Madrid being the main protagonist and everyone else being some retarded NPC. Teams have ambitions too. It does not have to be as high as ours, but they  have goals nonetheless, and they won't shoot themselves in the foot cause Real Madrid came knocking on the door, regardless of their status. So if you really want their player that bad, you gonna have to pay up. Which won't happen since Flo is not an idiot and we're not backed by PL and oil money.",
        "upvotes": 62,
        "comments": 40,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ii3jiv/people_never_really_think_things_through_when/"
    },
    {
        "id": "1ihqzy9",
        "author": "NoPartyGuy",
        "title": "Florentino Perez with Tommy Vercetti",
        "content": "",
        "upvotes": 330,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dpbskyk6i6he1.jpeg?auto=webp&amp;s=de043131e2406fa2bbed638c4685d244c76153dd"
        },
        "permalink": "/r/realmadrid/comments/1ihqzy9/florentino_perez_with_tommy_vercetti/"
    },
    {
        "id": "1ii2cr1",
        "author": "Next-Cardiologist838",
        "title": "Alphonso Davies extends till 2030",
        "content": "Alphonso Davies extends his contract till 2030\n\nIt’s been no secret that we had perused an interest in Davies so now that he has extended his contract for 5 more years what is our long term plan for LB/LWB if Xabi comes in.\n\nDo we try bring back Gutierrez from Girona. Or Theo from AC Milan. Alvaro from Benfica could be a cheap option but I don’t see him being a long term starter. I can’t lie Gvardiol would also be sick but is probably unrealistic.\n\nPersonally Gutierrez would be my pick but what are your thoughts ",
        "upvotes": 61,
        "comments": 58,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ii2cr1/alphonso_davies_extends_till_2030/"
    },
    {
        "id": "1ihih25",
        "author": "10Core56",
        "title": "Siiuuuuu with Nvidia",
        "content": "Some stuff you can make with the new AI. We need some robot defenders.\n",
        "upvotes": 758,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vkkkbjiwq4he1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ihih25/siiuuuuu_with_nvidia/"
    },
    {
        "id": "1ihm54v",
        "author": "Aladeen911MF",
        "title": "Ofc Everyone is injured",
        "content": "As of now 4th Feb, Rudiger, Miitao, Alaba, Carvajal are injured in defence\n\nMbappe has a bruise in calf possibly from that **Yellow** card challenge, Jude got a knock, so both will not play tomorrow, Camavinga has a muscle injury in the biceps femoris of his left leg,  Vini is not training on field with the team and may or may not start tomorrow\n\nOther than academy players and youngsters like Endrick, Arda we have Rodrygo, Brahim Diaz in attack and Our Labour Fede, Underrated Ceballos, about to be 40 Modric, Horrible form Tchouameni in midfield and Goat Vasquez for RB, Innocent Fran and Mendiddy for LB and JESUS VALLEJO for CB (you can also count Raul Asencio here and not in academy players).\n\nAncelotti said we are in an \"emergency situtation\" and I am sure he still doesn't like rotations, We don't sign anyone in Winter trasnfers but he have to play 2nd place Atletico, Man city for QUALIFYING to RO16 and infact *17 matches from 4Jan to 26Feb that's 17 in 52 days*, **one match every 3days 1Hr 24 Mins 42 sec** including 90 game time, stoppage time, travel time and everythingtime ffs",
        "upvotes": 285,
        "comments": 68,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ihm54v/ofc_everyone_is_injured/"
    },
    {
        "id": "1ihs4dq",
        "author": "CuteAction1698",
        "title": "Apparently this is going to be our squad list for tomorrow. Just look at that defense, it's actually unbelievable.",
        "content": "",
        "upvotes": 131,
        "comments": 96,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/n040pAt6XVf64QSYiVrAS_6B5zIfdshen5nhCFR3qxo.jpg?auto=webp&amp;s=c482d1b669954db209ba2597d61ae7a6097bb9cd"
        },
        "permalink": "/r/realmadrid/comments/1ihs4dq/apparently_this_is_going_to_be_our_squad_list_for/"
    },
    {
        "id": "1ihhjrg",
        "author": "SubjectTumbleweed216",
        "title": "[marca] Alaba was set to start tomorrow alongside Asencio to test the duo before the Atletico and City games. However, with his injury, Madrid are forced to start Asencio and Tchouameni, with no other choice possible",
        "content": "",
        "upvotes": 395,
        "comments": 112,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MXNK2QAJ0pmp4674MuS1S6QPoKAfzqvLgcbR93cHnNk.jpg?auto=webp&amp;s=483c985e2cb59122b7e4832eca991aac4e32092e"
        },
        "permalink": "/r/realmadrid/comments/1ihhjrg/marca_alaba_was_set_to_start_tomorrow_alongside/"
    },
    {
        "id": "1ihbo26",
        "author": "Total_Escape_9778",
        "title": "Even Carlo was telling Ceballos to pass the ball to Vini while he was free, but both him and Fran were loading it to the right flank instead...",
        "content": "",
        "upvotes": 1226,
        "comments": 211,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/snnsffodi2he1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ihbo26/even_carlo_was_telling_ceballos_to_pass_the_ball/"
    },
    {
        "id": "1iheqkg",
        "author": "TheBiasedSportsLover",
        "title": "Cristiano Ronaldo: \"I'm the most complete footballer ever. I head well, I take set pieces well, I shoot well with my left foot, I'm fast &amp; strong, I jump. I respect if someone would prefer Messi, Pele or Maradona, But to say that CR7 isn't complete is a lie. I don't see anyone better than me\"",
        "content": "",
        "upvotes": 572,
        "comments": 123,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zNpeVUMp0mlrdyTppZ3K8sxZwCB9MjIOcET_3q6eVO8.jpg?auto=webp&amp;s=e56e07bdaaf8ee95734b2ed0d54349a2ef70feed"
        },
        "permalink": "/r/realmadrid/comments/1iheqkg/cristiano_ronaldo_im_the_most_complete_footballer/"
    },
    {
        "id": "1ihqwb5",
        "author": "ManuMora98",
        "title": "[FEM] Real Sociedad 1 - 4 Real Madrid | Lucía 71'; Bruun 5', 27', OG 69', Alba 84' | Important win to leave the 3rd qualified comfortably 11 points behind, and position ourselves \"just\" 5 behind Barça after their lost this weekend",
        "content": "",
        "upvotes": 98,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/17ks8gvlh6he1.jpeg?auto=webp&amp;s=9dad00e0e458088a2892af2f471be6aea28267ea"
        },
        "permalink": "/r/realmadrid/comments/1ihqwb5/fem_real_sociedad_1_4_real_madrid_lucía_71_bruun/"
    },
    {
        "id": "1ihuqeb",
        "author": "Happy-Particular4412",
        "title": "My best Madrid Team so far",
        "content": "",
        "upvotes": 56,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/s0fjvi3i97he1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ihuqeb/my_best_madrid_team_so_far/"
    }
]