[
    {
        "id": "1kl0wm0",
        "author": "lionsgate",
        "title": "Hi! I'm Ana de Armas, star of the upcoming movie From the World of John Wick: Ballerina. Ask me anything!",
        "content": "Hi! I’m Ana de Armas, an actor, dog lover, and occasional stuntwoman. You might know me from Knives Out, Blonde, Knock Knock, or No Time to Die. I’ve been lucky to play a wide range of characters over the years, and I’m here to talk about all of it. From my first roles to what’s next, including From the World of John Wick: Ballerina, which hits theaters June 6. Ask me anything!",
        "upvotes": 20632,
        "comments": 3854,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8nnrisflde0f1.png?auto=webp&amp;s=1536a4a05d4e94b4febe2a311869257955e216f4"
        },
        "permalink": "/r/movies/comments/1kl0wm0/hi_im_ana_de_armas_star_of_the_upcoming_movie/"
    },
    {
        "id": "1l4gyyk",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Ballerina / The Phoenecian Scheme / Dangerous Animals) plus Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[From the World of John Wick: Ballerina](https://old.reddit.com/r/movies/comments/1l4gwpn/official_discussion_from_the_world_of_john_wick/?)\n\n[The Phoenecian Scheme](https://old.reddit.com/r/movies/comments/1l4gwrc/official_discussion_the_phoenecian_scheme_spoilers/?)\n\n[Dangerous Animals](https://old.reddit.com/r/movies/comments/1l4gwso/official_discussion_dangerous_animals_spoilers/?)\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Dogma](https://old.reddit.com/r/movies/comments/1l4gwu2/official_throwback_discussion_dogma_spoilers/?)\n\n[Big Momma's House](https://old.reddit.com/r/movies/comments/1l4gwuy/official_throwback_discussion_big_mommas_house/?)\n\n\n# Still in Theaters\n\n[Karate Kid: Legends](https://old.reddit.com/r/movies/comments/1kyson2/official_discussion_karate_kid_legends_spoilers/?)\n\n[Bring Her Back](https://old.reddit.com/r/movies/comments/1kysoob/official_discussion_bring_her_back_spoilers/?)\n\n[Tornado](https://old.reddit.com/r/movies/comments/1kysore/official_discussion_tornado_spoilers/?)\n\n[Mission: Impossible - The Final Reckoning](https://old.reddit.com/r/movies/comments/1kt8b6m/official_discussion_mission_impossible_the_final/?)\n\n[Lilo &amp; Stitch](https://old.reddit.com/r/movies/comments/1kt8b83/official_discussion_lilo_stitch_spoilers/?)\n\n[Friendship](https://old.reddit.com/r/movies/comments/1kt8b9q/official_discussion_friendship_spoilers/?)\n\n[Final Destination: Bloodlines](https://old.reddit.com/r/movies/comments/1knpnb1/official_discussion_final_destination_bloodlines/?)\n\n\n\n# On Streaming\n\n[Predator: Killer of Killers](https://old.reddit.com/r/movies/comments/1l5aczx/official_discussion_predator_killer_of_killers/?)\n\n[Mountainhead](https://old.reddit.com/r/movies/comments/1l0u3hy/official_discussion_mountainhead_spoilers/?)\n\n[Lost in Starlight](https://old.reddit.com/r/movies/comments/1l0u3kg/official_discussion_lost_in_starlight_spoilers/?)\n\n[Fountain of Youth](https://old.reddit.com/r/movies/comments/1ku0tg1/official_discussion_fountain_of_youth_spoilers/?)\n\n[Fear Street: Prom Queen](https://old.reddit.com/r/movies/comments/1ku0thn/official_discussion_fear_street_prom_queen/?)",
        "upvotes": 26,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1l4gyyk/official_discussion_megathread_ballerina_the/"
    },
    {
        "id": "1l75pit",
        "author": "MarvelsGrantMan136",
        "title": "Live-Action 'Legend of Zelda' Movie Delayed to May 7, 2027",
        "content": "",
        "upvotes": 495,
        "comments": 149,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sMBICsvGP2GuE8-LmoVIW329mOvTMMzOl_KATHZp1ro.jpg?auto=webp&amp;s=248b1d327b642a427abdfb978ddf67ac463f6b7f"
        },
        "permalink": "/r/movies/comments/1l75pit/liveaction_legend_of_zelda_movie_delayed_to_may_7/"
    },
    {
        "id": "1l72o6x",
        "author": "MarvelsGrantMan136",
        "title": "Warner Bros. Discovery to Split Into Two: Streaming and Studios, Global Networks",
        "content": "",
        "upvotes": 752,
        "comments": 143,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YiEFtEvuGFqV0ee7IXRYwvjPSN_Xm0PSrl7xpe4hz-A.jpg?auto=webp&amp;s=7b19d7e847bb7977b53ab7c2b41362f3d80a29e2"
        },
        "permalink": "/r/movies/comments/1l72o6x/warner_bros_discovery_to_split_into_two_streaming/"
    },
    {
        "id": "1l765rt",
        "author": "ChiefLeef22",
        "title": "'Materialists' - Review Thread",
        "content": "Director: Celine Song\n\nCast: Dakota Johnson, Pedro Pascal, Chris Evans\n\n*A young New York City matchmaker's lucrative business gets complicated as she finds herself torn between the perfect match and her imperfect ex.*\n\n**Rotten Tomatoes:** [90%](https://www.rottentomatoes.com/m/materialists)\n\n**Metacritic:** [73/100](https://www.metacritic.com/movie/materialists/)\n\nSome Reviews:\n\n[BBC - Caryn James](https://www.bbc.com/culture/article/20250606-materialists-review) \\- 5/5\n\n&gt;Moving on from its cynical beginning, Materialists takes the long way around to an ending that is decidedly hopeful. It offers an unblinkered, earned romanticism that suits this moment, and bolsters Song's reputation as one of our most astute observers of relationships.\n\n[SlashFilm - Bill Bria](https://www.slashfilm.com/1871812/materialists-review/)\n\n&gt;There's a bit of quiet courageousness to the movie in its commitment to depth over trying to nakedly appeal to others, and that's a quality which makes any person — and any film — more desirable. So, I'll follow the film's bravery by admitting, right here and now, that I'm in love with it.\n\n[San Fransisco Chronicle - Hannah Bae](https://www.sfchronicle.com/entertainment/article/materialists-review-celine-song-20363208.php) \\- 3/4\n\n&gt;Through most of “Materialists,” the director and screenwriter’s follow-up to 2023’s “Past Lives,” the camera casts its luxurious settings in a golden sheen. This is the world of a successful, high-end matchmaker in New York City. Responsible for nine marriages, Lucy (Dakota Johnson), as her boss crows during a sparkling office celebration, possesses “razor-sharp instincts and one hell of an eye.” Marketed as a romantic comedy, “Materialists” is a sharper, more thoughtful film than its genre would suggest. This is a story about perceived value and what its pursuit costs its characters -- emotionally, physically and materially.\n\n[Slant Magazine - Derek Smith](https://www.slantmagazine.com/film/materialists-review-dakota-johnson-chris-evans-pedro-pascal-celine-song/) \\- 2/4\n\n&gt;*Materialists* is beautifully lensed by Shabier Kirchner, who captures the unstained luxe-ness of Harry’s pricey condo and the upscale restaurants he takes Lucy to as lucidly as he does the ramshackle reality of John’s day-to-day life. But Song’s script works only in fits and starts, too often reliant on merely raising the subtext around the types of economic anxieties that affect relationships in numerous rom-coms to literal text. The central trio’s conversations become less entrenched in realism as the film goes on, with the characters sounding increasingly less like individuals in the throes of love and more like they’re espousing an authorial point of view.\n\n[The Wrap - William Bibbiani](https://www.thewrap.com/materialists-review-dakota-johnson-pedro-pascal-chris-evans-a24/)\n\n&gt;I’m not sure “Materialists” qualifies as a “date movie” by any conventional definition, unless you and your date love artful cinema and don’t mind having a complex, not-very-sexy conversation afterwards. But I do heartily recommend you see “Materialists,” and that you see it for what it is, not what it kinda looks like from the outside, as pitched to you by the very sort of romance-commodification salespersons that Celine Song’s movie criticizes. It’s a great movie about romance — whether it’s technically “romantic” or not.\n\n[AV Club - Natalia Keogan](https://www.avclub.com/materialists-review) \\- B-\n\n&gt;The rom-com has not been resurrected with *Materialists*. Though Song showed much promise with her Oscar-nominated foray into filmmaking, this screenplay feels less intentional in nearly every respect, and the performances from central cast members, save for Evans, don’t adequately enhance the narrative. The ham-fisted insistence that relationships are largely transactional—no matter the amount of money a couple may earn—is void of any meaningful insight, resulting in a story that simply doesn’t pay off. \n\n[The Hollywood Reporter - David Rooney](https://www.hollywoodreporter.com/movies/movie-reviews/materialists-review-dakota-johnson-chris-evans-pedro-pascal-1236257284/)\n\n&gt;Especially for someone relatively new to filmmaking, Song’s thoughtfulness as a writer is matched by unerring instincts as a director — nailing the balance between tonal variation and fluidity; getting superb work out of her actors; making judicious use of Daniel Pemberton’s gentle, melancholy score; and delivering a sweet, satisfying ending that keeps a lid on the sentiment. Song’s script avoids glibness in dealing with the transactional aspects of partnering and the commodification of certain attributes. There’s a frankness here that’s refreshing as *Materialists* explores ideas of personal value and increasing one’s worth — including via the obvious path of cosmetic surgery.",
        "upvotes": 344,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eOAg36xnety0PeHvCA6VpCpGZ2-k67vSHvHu3fnLvT8.jpg?auto=webp&amp;s=e990b11866cdae47f836b23d255b741534df86f5"
        },
        "permalink": "/r/movies/comments/1l765rt/materialists_review_thread/"
    },
    {
        "id": "1l76krm",
        "author": "lifesyndrom",
        "title": "What’s a hated sequel that you actually like?",
        "content": "Kingsman 2 for me\n\n\nI thought it was as good as the first. The only main flaw I’d say was killing off Roxy, especially so early in the film. And Harry’s return definitely could’ve been written better. I thought all the side characters stole the show too (Pedro pascal, Channing Tatum, Halle berry, etc) I’m still hoping for some type of spinoff involving those characters. The action was definitely better than the first as well in my opinion. ",
        "upvotes": 219,
        "comments": 595,
        "media": null,
        "permalink": "/r/movies/comments/1l76krm/whats_a_hated_sequel_that_you_actually_like/"
    },
    {
        "id": "1l6p2zl",
        "author": "Martipar",
        "title": "Jokes in films that have aged suspiciously well.",
        "content": "I am watching Wayne's World 2 from 1993 and they make a joke about how sleeping upside down adds 10 years to your life, if was taught to Del by Keith Richards which is why Keith cannot be killed by conventional means. It's been 32 years, Keith Richards is still \"alive\" and the joke is still very relevant, possibly even more so than it was. \n\n\n\n",
        "upvotes": 2534,
        "comments": 441,
        "media": null,
        "permalink": "/r/movies/comments/1l6p2zl/jokes_in_films_that_have_aged_suspiciously_well/"
    },
    {
        "id": "1l6q1i3",
        "author": "diablothe2",
        "title": "Did Meryl from the truman show have a life outside the show?",
        "content": "Did she? because how is it even possible to have a life when your work is being the wife of someone 24/7. I guess she could go on a vacation during a time of the year but it really doesn't make a lot of sense. This also goes for his best friend Marlon, because even though it's to a lesser extent he would still have to be inside the set pretty consistently. And if they don't have a life outside the show, what is even the point, they would be throwing their lives for a show, what would be the reason, money? but if you are on set everyday how would they enjoy the money they are making. Idk it just seems so weird.\n\nI haven't seen the movie in a while, so maybe I don't remember, but if the movie doesn't explain this what do y'all think is the answer",
        "upvotes": 1981,
        "comments": 242,
        "media": null,
        "permalink": "/r/movies/comments/1l6q1i3/did_meryl_from_the_truman_show_have_a_life/"
    },
    {
        "id": "1l713vy",
        "author": "mrjohnnymac18",
        "title": "The worst sports movie in history? I asked Sepp Blatter about FIFA's \"United Passions\"",
        "content": "",
        "upvotes": 228,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hbwacbURTVMMPq-UWejqJ0RuPrGdSXd38MXGVOPz_y8.jpg?auto=webp&amp;s=cad41682dc44e2788bb06adba6ccb9698c9dc9bd"
        },
        "permalink": "/r/movies/comments/1l713vy/the_worst_sports_movie_in_history_i_asked_sepp/"
    },
    {
        "id": "1l6va3o",
        "author": "SodaCake2",
        "title": "In the movie 300, what does Leonidas shout while he's 'kneeling' to Xerxes?",
        "content": "He's 'kneeling' on the ground, reflecting on his wife, then he shouts something, and the Spartan shield/spear ball formation breaks and dude comes out to spear the messenger in front of Leonidas.\n\nI've replayed the scene so many times but I can't make out what he says. Obviously something to initiate their battle 'plan'. Please help, it's bugging the hell out of me lol\n\n  \nEDIT/ANSWER: **\"STELIOS!!!!\"**",
        "upvotes": 604,
        "comments": 109,
        "media": null,
        "permalink": "/r/movies/comments/1l6va3o/in_the_movie_300_what_does_leonidas_shout_while/"
    },
    {
        "id": "1l6xe52",
        "author": "DemiFiendRSA",
        "title": "'How to Train Your Dragon' (2025) - Review Thread",
        "content": "**How to Train Your Dragon** (2025)\n\n* [Rotten Tomatoes](https://www.rottentomatoes.com/m/how_to_train_your_dragon_2025) 82% (44 Reviews)\n\n\n* [Metacritic](https://www.metacritic.com/movie/how-to-train-your-dragon-2025/): 65  (11 Reviews)\n\n**Reviews**\n\n[The Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/how-to-train-your-dragon-review-dreamworks-remake-1236258510/):\n\n&gt;How to Train Your Dragon honors the charm of the original. It’s not an essential remake, but at least it’s not an offensive one.\n\n[Deadline](https://deadline.com/2025/06/how-to-train-your-dragon-review-live-action-remake-1236426469/):\n\n&gt;John Powell’s return to compose the music and build on his previously established themes helps the story soar.\n\n[Variety](https://variety.com/2025/film/reviews/how-to-train-your-dragon-review-live-action-1236422053/):\n\n&gt;It's hard to improve on the first movie, though the last act looks positively iconic in this new incarnation, unlocking the expressionistic power of \"Heavy Metal\" toons and Boris Vallejo paintings.\n\n[Associated Press](https://apnews.com/article/how-to-train-your-dragon-movie-review-733ec3ea812e6940b65362e594b55fa6) (3.5/4):\n\n&gt;It’s the kind of immersive sensation and giddy wish fulfillment that might just have you forgetting momentarily to breathe and, maybe more importantly, that you’re still in a movie theater.\n\n[USA Today] (https://www.usatoday.com/story/entertainment/movies/2025/06/09/how-to-train-your-dragon-2025-movie-review/84075887007/) (3.5/4):\n\n&gt;Fortunately, the new “How to Train Your Dragon” does no harm. Instead, it lets loose a heartwarming, meaty adventure perfect for a new generation of young film fan but doesn't forget to entertain the older movie kids, either.\n\n[Screen Rant](https://screenrant.com/how-to-train-your-dragon-movie-review-2025/) (8/10):\n\n&gt;How To Train Your Dragon is fantastic, not just emulating the original but elevating it, all the while also delivering a blockbuster poised to thrill.\n\n[IndieWire] (https://www.indiewire.com/criticism/movies/how-to-train-your-dragon-review-2025-live-action-remake-1235129634/) (B-):\n\n&gt;That [director Dean DeBlois] can still find excitement and joy in this well-tread story is a testament to both his work and source material. No one needs a live-action remake, but ones this faithful and sweet are not the problem.\n\n[IGN] (https://www.ign.com/articles/how-to-train-your-dragon-review-2025) (7/10):\n\n&gt;Within all its rigid recitation, there’s a heart and soul that demonstrates how DeBlois has managed to get so much mileage out of the loving story of a Viking boy and the dragon he befriends.\n\n[AV Club] (https://www.avclub.com/how-to-train-your-dragon-review) (C+):\n\n&gt;Rather than trying to train something new, How To Train Your Dragon is riding an already proven beast... It can’t reach those old heights, let alone any new ones. And it doesn’t try to, nor does its audience really want it to.\n\n[Empire](https://www.empireonline.com/movies/reviews/how-to-train-your-dragon/) (3/5):\n\n&gt;It’s clearly made with real love and care, but shows far too much deference to its progenitor. Even in a remake, we need more originality and less playing the hits.\n\n[Slant Magazine](https://www.slantmagazine.com/film/how-to-train-your-dragon-2025-review/) (2/4):\n\n&gt;As heartwarming as this story remains at its core, it’s hard to shake that you already know how it will play out.\n\n[Slashfilm] (https://www.slashfilm.com/1881070/how-to-train-your-dragon-2025-remake-review/) (6/10):\n\n&gt;We have \"How to Train Your Dragon\" at home. It's the motion picture equivalent of turning tacos into nachos, and even though nachos can be delicious, they're not as good reheated.\n\n[Independent](https://www.the-independent.com/arts-entertainment/films/reviews/how-to-train-your-dragon-review-live-action-b2764174.html) (2/5):\n\n&gt;All that’s really changed is that How to Train Your Dragon is now distinctly less charming and less playful than before, with even its pièce de résistance Toothless losing some of the cute factor.\n\n[The Telegraph](https://www.telegraph.co.uk/films/0/how-to-train-your-dragon-review1/) (2/5):\n\n&gt;It somehow elongates its predecessor’s running time by 27 minutes without adding a single atom of noticeably fresh material. Perhaps all the dragons are just flying around a bit more slowly this time, or the vikings have to walk further between huts.\n\n[The Times] (https://www.thetimes.com/culture/film/article/how-to-train-your-dragon-remake-film-review-gtlslwbj9?region=global):\n\n&gt;It’s loud and diverting and very young children are sure to be entertained. But it’s also utterly dead, right down to its hollow, greedy, cash-grabbing core.\n\n**Synopsis**:\n\n&gt;On the rugged isle of Berk, where Vikings and dragons have been bitter enemies for generations, Hiccup stands apart. The inventive yet overlooked son of Chief Stoick the Vast, Hiccup defies centuries of tradition when he befriends Toothless, a feared Night Fury dragon. Their unlikely bond reveals the true nature of dragons, challenging the very foundations of Viking society.\n\n**Cast**\n\n* Mason Thames as Hiccup Horrendous Haddock III\n* Nico Parker as Astrid Hofferson\n* Gerard Butler as Stoick the Vast\n* Nick Frost as Gobber the Belch\n* Gabriel Howell as Snotlout Jorgenson\n* Julian Dennison as Fishlegs Ingerman\n* Bronwyn James as Ruffnut Thorston\n* Harry Trevaldwyn as Tuffnut Thorston\n* Ruth Codd as Phlegma\n* Peter Serafinowicz as Spitelout Jorgenson\n\nDirected by: Dean DeBlois\n\nScreenplay by: Dean DeBlois\n\nProduced by: Marc Platt, Dean DeBlois, and Adam Siegel\n\nCinematography: Bill Pope\n\nEdited by: Wyatt Smith\n\nMusic by: John Powell\n\nRunning time: 125 minutes\n\nRelease dates: June 13, 2025",
        "upvotes": 378,
        "comments": 213,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wpb2JdVbcrMDSVWF3kcX0Hm3O4qMAEkOUqG05ZGu1ng.jpg?auto=webp&amp;s=6978f25ed7c2bb6784557c1c1daca6c49efe9396"
        },
        "permalink": "/r/movies/comments/1l6xe52/how_to_train_your_dragon_2025_review_thread/"
    },
    {
        "id": "1l6fs7u",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Zach Cregger's 'Weapons'",
        "content": "",
        "upvotes": 5061,
        "comments": 315,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/abnuibou8q5f1.jpeg?auto=webp&amp;s=d34e1296dfdc2fa5c28170ae3b7cd145073074d8"
        },
        "permalink": "/r/movies/comments/1l6fs7u/new_poster_for_zach_creggers_weapons/"
    },
    {
        "id": "1l74v2i",
        "author": "MathTutorAndCook",
        "title": "Who is the best movie father figure?",
        "content": "I was recently watching To Kill A Mockingbird, and the portrayal of Atticus Finch by Gregory Peck, even after all these years... as a mixed race American I absolutely love how he held himself, how he treated others, and especially how he chose to raise his kids. For TV shows I've always felt Uncle Phil was up there as one of the best, but for movies all time I feel Atticus is a respectable role model. Who for you, across all of movie history, was the best father figure? ",
        "upvotes": 92,
        "comments": 197,
        "media": null,
        "permalink": "/r/movies/comments/1l74v2i/who_is_the_best_movie_father_figure/"
    },
    {
        "id": "1l6qonx",
        "author": "CrippledKidneys",
        "title": "That ending for the Truman Show…",
        "content": "Spoilers if you haven’t watched the movie in its entirety yet.\n\n\n\n\nTHE ENDING OF THIS MOVIE IS MAGNIFICENT. The last moments of the movie in particular are what I find brilliant. As Truman leaves the set, the movie comes to a close. We never get finality on what happens to him in the real world, and it’s an amazing parallel to how the people watching the show are no longer under full observation of Truman himself. It’s one of the best endings to a movie I’ve ever seen, even if it is a cliffhanger.",
        "upvotes": 1092,
        "comments": 177,
        "media": null,
        "permalink": "/r/movies/comments/1l6qonx/that_ending_for_the_truman_show/"
    },
    {
        "id": "1l6pd1k",
        "author": "BroccoliVendetta",
        "title": "What movies have fantastic opening scenes that they don’t get enough credit for?",
        "content": "\nWe all know the famous ones - but who deserves more credit? Which ones get more hate than they deserve?\n\nHere’s my two:\n\n-Star Trek (2009): Chris Hemsworth gave a better performance in 10 minutes of screen time than his entire run at Thor(Not that he wasn’t fantastic as Thor). I tear up on every rewatch.\n\n-Baby Driver (2017): I can’t get enough of it. The perfect song choice, the scene moving to the beat of the music. I need more movies like this.\n\nEdit: typo",
        "upvotes": 1212,
        "comments": 935,
        "media": null,
        "permalink": "/r/movies/comments/1l6pd1k/what_movies_have_fantastic_opening_scenes_that/"
    },
    {
        "id": "1l6euh5",
        "author": "BunyipPouch",
        "title": "First Image from 'I Am Frankelda', Mexico's First-Ever Stop-Motion Feature Film - Made by proteges of Guillermo del Toro (Rodolfo and Arturo Ambriz) - A young Mexican woman, a frustrated writer of the 19th century, travels in the form of a ghost to a realm of her own invention inhabited by scares.",
        "content": "",
        "upvotes": 4183,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/51nv0us41q5f1.png?auto=webp&amp;s=aec9f4733feed751a7b1280095acb5c4db240528"
        },
        "permalink": "/r/movies/comments/1l6euh5/first_image_from_i_am_frankelda_mexicos_firstever/"
    },
    {
        "id": "1l73zn4",
        "author": "Super-Address5721",
        "title": "Dead Poets Society has pushed me more than any other movie I've ever watched.",
        "content": "For the last year I've been in a constant cycle of anxiety, pressurised to keep up with my uni studies, \"keep going until you graduate then you can live a little\", I got rid of two travel ideas to Italy and Japan because it messed with my studies, I was forced to wait. A month ago, I had another chance, I found a perfect time for new zealand this december, I was terrified. My family was concerned, some even mad at the idea, I knew I wanted to, but I was scared of doing something without their acceptance -without a 'seal of approval'. Today I told myself to buy the tickets, but I got pulled back again by my parents' suggestions to push it back another year, but that all changed with one suggestion from my sister. \"Watch Dead Poet's Society\" it was a random suggestion not even connected to my struggle, just a movie she enjoyed. I left my laptop open with the qantas website still loaded, and watched the movie. I dont think I've ever watched a movie at such a perfect time as then. It was surreal, I knew what I needed to do. The next thing I did was open up my laptop again and buy those tickets. I'm now 6 months away from New Zealand. Some movies are more than just movies, they are an experience to keep us moving. Carpe Diem.",
        "upvotes": 74,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1l73zn4/dead_poets_society_has_pushed_me_more_than_any/"
    },
    {
        "id": "1l76lvz",
        "author": "BunyipPouch",
        "title": "'Sinners': Michael B. Jordan Becoming the Smokestack Twins - Behind the Scenes",
        "content": "",
        "upvotes": 50,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2Agg0T-dTgbB4mGGvZyNUzZQT3XeQZ7RIR1HdTFs074.jpg?auto=webp&amp;s=f844709e196af3f228c854d4613c4fc27dfe9f74"
        },
        "permalink": "/r/movies/comments/1l76lvz/sinners_michael_b_jordan_becoming_the_smokestack/"
    },
    {
        "id": "1l6smk3",
        "author": "methodwriter85",
        "title": "Movies that were incorrectly/deceptively marketed",
        "content": "The New Karate Kid Legends movie opened soft and it's dropping pretty hard. Personally I thought it was good enough to not flop the way that it is, but I also think the movie suffered from the way it was marketed as being a team up between Jackie Chan and Daniel LaRusso to teach Ben Wang. I mean, that does happen, don't get me wrong, but it takes a LONG time to get there, because they spend the first half of the movie setting up the actual conflict. The daughter and Joshua Jackson seem to have much more screentime than Jackie Chan does; just saying.\n\nI think if it had been a bit more honest about what the movie was actually going to be, it would be doing better.",
        "upvotes": 550,
        "comments": 895,
        "media": null,
        "permalink": "/r/movies/comments/1l6smk3/movies_that_were_incorrectlydeceptively_marketed/"
    },
    {
        "id": "1l6s81o",
        "author": "facebookboy2",
        "title": "Anybody interested in watching a Japanese movie?  Oshin (2013) free movie on Youtube with English sub",
        "content": "Every Japanese knows Oshin.  It was a very famous novel and later broadcasted on TV in the 80s.  The novel was based on the true story of the Supermarket owner of Yaohan.  Now its made into a movie.  Its a story of a girl who was contracted to work at a rich man's house when she was only 7.  (year 1907)  She grew up in the rich man's house and learned how to do business.  Survived ww2 and lost 2 sons to the war.  Later opened up the most famous supermarket chain in Japan.",
        "upvotes": 349,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Coh9cyaKKA1WUxQMLAOgyWVw-Qf6cTD7qDkjUXbODrI.jpg?auto=webp&amp;s=6d29c4766004b9636e0d3449b11fab0802ed4940"
        },
        "permalink": "/r/movies/comments/1l6s81o/anybody_interested_in_watching_a_japanese_movie/"
    },
    {
        "id": "1l6t0cl",
        "author": "Odd_Advance_6438",
        "title": "If the upcoming Animal Farm movie with Seth Rogen actually does follow the book and lets him be evil, I think it’s going to be insanely cool",
        "content": "Im super intrigued by the trailer. It uses kind of a cutesy art style and has that standard kid movie humor, but there’s definitely a sinister undercurrent. Seth Rogen has never really played a villain to my knowledge, and while a lot of people pointed out that it’s a weird casting choice, I think it could be super smart overall. People are so used to him as a goofy good guy that it would be extra crazy to see Napoleon become the tyrant of the farm.\n\nSince it’s directed by Andy Serkis, I have a hard time believing he would make the movie more sanitized. Even with the jokes at the end, there’s a very sinister undercurrent to the scene, especially with the music. Napoleon saying “pigs should stick with pigs” definitely foreshadows his cruel intentions",
        "upvotes": 306,
        "comments": 72,
        "media": null,
        "permalink": "/r/movies/comments/1l6t0cl/if_the_upcoming_animal_farm_movie_with_seth_rogen/"
    },
    {
        "id": "1l6pfgd",
        "author": "GenButter",
        "title": "Pippa Scott Dead: ‘The Searchers,’ ‘Auntie Mame’ Actress Was 90",
        "content": "",
        "upvotes": 469,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gxP00Kafr8BasHgX-5x3VgN0PMOPFw6PLtIPy7BNMHI.jpg?auto=webp&amp;s=04ce1057686f3da81e1c29d327a44a7b66e88811"
        },
        "permalink": "/r/movies/comments/1l6pfgd/pippa_scott_dead_the_searchers_auntie_mame/"
    },
    {
        "id": "1l6ywyb",
        "author": "FilmWaffle-FilmForum",
        "title": "What “bad” movies have pretty good action scenes?",
        "content": "Clash of the Titans (2010) has always been a perfect fit to this question in my opinion. Admittedly, I haven’t seen it in a while but from what I can remember the action is actually good when compared to the abysmal character development, dialogue and storytelling. The sequel fits as well. \n\nWhat other “bad” movies have strong action scenes? ",
        "upvotes": 83,
        "comments": 143,
        "media": null,
        "permalink": "/r/movies/comments/1l6ywyb/what_bad_movies_have_pretty_good_action_scenes/"
    },
    {
        "id": "1l735mr",
        "author": "BunyipPouch",
        "title": "Aneesh Chaganty (director of 'Searching' and 'Run') to direct 'Doppelgänger', an original spy-thriller with a story that is being kept under wraps. Many studios bid on the rights, and it's set to become a franchise-starter. Ryan Coogler ('Sinners') will produce.",
        "content": "",
        "upvotes": 30,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OA6qn_DUmmdBefHTC_tCLvNOOUNTXnw1L-P2h2q81U4.jpg?auto=webp&amp;s=1eb6389439a2b6b524dde40e925129fb8260bf0f"
        },
        "permalink": "/r/movies/comments/1l735mr/aneesh_chaganty_director_of_searching_and_run_to/"
    },
    {
        "id": "1l74f7b",
        "author": "Semi_ok24",
        "title": "I watched Lilya 4-ever movie last night and I can’t stop thinking about it",
        "content": "I knew about how depressing and disturbing this movie can be but I still wanted to watch it because I felt like it discusses a really important topic that I must know exists. \n\nIt’s like when you learn about a case and you know it’s horrible but you still have to see it because you know this happens to people in real life and this is someone’s reality right now and the least you can do for those people is to just open your eyes and see even if it hurts you. \n\nThat’s exactly how I felt about the movie, Lilya in my perspective embodied innocence and youth and seeing her struggle because of how adults around her are awful and irresponsible made me sad about how a lot of young people have to deal with situations that adults created. \n\nThe most disturbing part of the movie was the last 40 minutes as we see Lilya was actually used for sex trafficking which broke my heart. \n\nI must admit I tried to force myself to see the SA scenes but I couldn’t help but skip them, it makes me so mad and disturbed to see how they filmed her to be in pain and in an uncomfortable situation even if it was just an act. \n\nI felt like it triggered me as well especially that I’ve been assaulted many times from different people, and I ended up thinking about it all night and thinking about people who are living like this right now, you know about them and you know there’s nothing you can do for them which makes me hate how useless I feel. \n\nThe end of the movie broke me but I understand.. Lilya couldn’t help but end it all, if she went back home she’ll go back to poverty and being lonely because Volodya is not there anymore, and there’s a high chance that the bastard that took advantage of her will send someone to hurt her again.  \n\nAnd if she stayed in Sweden he will search gor her and she’ll be stuck in a country that she doesn’t know anything about, and even if she went to police they’ll discover that she faked her passport. \n\nI also realized how the only time Lilya thought she found a person she can trust he sent her to trafficking. \n\nAt the end I’d like to say fk Natasha and Andrei",
        "upvotes": 26,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1l74f7b/i_watched_lilya_4ever_movie_last_night_and_i_cant/"
    },
    {
        "id": "1l6jj42",
        "author": "CinemaWilderfan",
        "title": "What is an ending that isn’t as ambiguous as people make out to be, and what is an ending that deserves more credit for being ambiguous?",
        "content": "The Graduate is often mistaken for being deeply ambiguous, but this opinion came from Mike Nichols’ decision not to yell “cut” at the end of the final scene, allowing the characters to fade silent and stare at the camera to show uncertain expressions. This tonal shift feels profound, but it’s more of an aesthetic flourish than a true narrative or thematic ambiguity. The story itself is quite clear: Benjamin rebels against a future he doesn’t want, chases Elaine, and gets what he wants, and they laugh happily at each other when they board the bus. They look into the camera because they are looking into their future.\n\nOn the other hand, Rear Window is more genuinely ambiguous. While the murder is solved, the film raises unresolved ethical questions about voyeurism and whether Jeff's decisions are ethical or not. Was he a hero for stepping in and helping others solve a problem or was he stepping into peoples' boundaries? Even we don't know how Jeff and Lisa would end up.",
        "upvotes": 702,
        "comments": 551,
        "media": null,
        "permalink": "/r/movies/comments/1l6jj42/what_is_an_ending_that_isnt_as_ambiguous_as/"
    },
    {
        "id": "1l6tagy",
        "author": "Existing_Switch_4995",
        "title": "Tyler Perry’s Trauma Machine: When Storytelling Becomes Exploitation",
        "content": "I hate how Tyler Perry has moved over the years. And I say this not to tear down a Black creative — but to question why someone with so much power, influence, and access consistently chooses to recycle the same painful narrative over and over again, to the point where it feels less like representation… and more like exploitation.\n\nIt feels like his movies don’t just touch on trauma — they traumatize Black audiences.\n\nYes, Black people have endured and survived unimaginable things. Yes, there are deep-rooted issues in our communities that deserve to be spoken about. But there’s a difference between storytelling and trauma-dumping. There’s a line between bringing awareness and dragging your people through hell just because you can.\n\nTake his latest movie as an example — a single Black mother at the center, and every horrible thing imaginable happens to her. Her landlord kicks her out. Her boss fires her. A cop runs her off the road and threatens her. Her child gets taken away. And just when you think maybe she’ll catch a break… her child dies too.\n\nWhy? For what?\n\nAt what point does this stop being a story and start becoming suffering as spectacle? It’s not just emotionally exhausting — it’s deeply disturbing.\n\nThere’s a pattern here. In nearly all of Perry’s films and series, Black women are abused, broken, or abandoned. Black men are either abusers, cheaters, or saviors — never something in between. The characters lack depth. The pain is constant. The message? That suffering is part of being Black. That pain is our destiny. That endurance is our only virtue.\n\nBut that’s not true.\n\nWe are so much more than our trauma.\n\nWe are joy. We are excellence. We are innovators, leaders, healers, artists, and dreamers. We are breaking generational curses. We are loving each other. We are making it. And those stories deserve to be told just as loudly, just as boldly, just as frequently.\n\nWhat’s most disheartening is that someone like Tyler Perry could tell those stories. He has a studio. He has funding. He has a loyal audience. He has access to some of the best Black talent in the world. But instead of evolving his storytelling, he keeps feeding us the same pain — dressed up as entertainment.\n\nWhen I look at the landscape of Black film and television, I can name dozens of shows and movies that uplift, that stretch beyond trauma, that imagine something better for us: shows like Queen Sugar, Insecure, Abbott Elementary, Black Panther, The Photograph, The Harder They Fall. These works show that we can tell layered stories — ones that reflect struggle and joy.\n\nBut I truly cannot name a single Tyler Perry production that left me feeling uplifted.\n\nAt some point, we have to ask: Who is this really for? Who benefits from a never-ending loop of Black pain? And when will it be enough?\n\nBecause we deserve more than to see ourselves repeatedly battered by life, by each other, and by scripts that refuse to imagine us as anything but victims.\n\nWe deserve healing stories, hopeful stories, and whole stories.\n\nWe deserve better from someone who claims to love us.",
        "upvotes": 164,
        "comments": 75,
        "media": null,
        "permalink": "/r/movies/comments/1l6tagy/tyler_perrys_trauma_machine_when_storytelling/"
    },
    {
        "id": "1l70o8i",
        "author": "nimmoisa000",
        "title": "Watching The Untouchables at this point and TBH the film has aged like fine wine. Both as a cop film and a crime thriller.",
        "content": "It's perhaps the greatest cop film and the best crime thriller even though Ness is technically a federal agent so it's be more of a federal agent film but there's a cop in the main cast so technically it can be counted as a cop film.\n\nOh and the cast, was legendary, as this was when Costner's career was taking off, Connery had some pretty good Irish acting despite being British, and De Nero as Al Capone he fits the role pretty well.\n\nAlso when you think about it, The Untouchables laid the foundation for a great cop show 23 years later: Blue Bloods.",
        "upvotes": 38,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1l70o8i/watching_the_untouchables_at_this_point_and_tbh/"
    },
    {
        "id": "1l67cqw",
        "author": "mrjohnnymac18",
        "title": "'Slumming in a vision of hell': Why Requiem for a Dream is still so divisive, 25 years after its release",
        "content": "",
        "upvotes": 2604,
        "comments": 523,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uALkrXEDArqjOR8BkTywESxDeEGG6EvlB8_9oblOWRQ.jpg?auto=webp&amp;s=902856555b17834a4929b40f48ccf1c2d7c2514d"
        },
        "permalink": "/r/movies/comments/1l67cqw/slumming_in_a_vision_of_hell_why_requiem_for_a/"
    },
    {
        "id": "1l6oos0",
        "author": "DerpAntelope",
        "title": "The Best Stunts of All Time, Over Nearly 100 Years of the Oscars",
        "content": "",
        "upvotes": 190,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7PuQ_PEsa_vNeiY3kcP5Yz9q963wFux9FRctphxEO0I.jpg?auto=webp&amp;s=3ea57917e967d8184b984803a1da95141012718f"
        },
        "permalink": "/r/movies/comments/1l6oos0/the_best_stunts_of_all_time_over_nearly_100_years/"
    },
    {
        "id": "1l6foy0",
        "author": "MarvelsGrantMan136",
        "title": "The Lost Bus — Official Teaser | Apple TV+ (Directed by Paul Greengrass)",
        "content": "",
        "upvotes": 408,
        "comments": 101,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EZPKrdZqQZOdH65fJmVesnLjRcbGDEETct0PMmlyRAs.jpg?auto=webp&amp;s=e3e95933c10cdacdfbbe97f83b3110b4cd6102f0"
        },
        "permalink": "/r/movies/comments/1l6foy0/the_lost_bus_official_teaser_apple_tv_directed_by/"
    },
    {
        "id": "1l78ozp",
        "author": "MarvelsGrantMan136",
        "title": "New Character Posters for 'Jurassic World Rebirth'",
        "content": "",
        "upvotes": 13,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kugyopbedx5f1.jpeg?auto=webp&amp;s=dde0f12f75ad01dc794d76f1eff33a17d39e3d40"
        },
        "permalink": "/r/movies/comments/1l78ozp/new_character_posters_for_jurassic_world_rebirth/"
    }
]