[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 488,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hs3yi4",
        "author": "bluntprincess99",
        "title": "No Good Deed - Was it Lisa Kudrow's best performance till date?",
        "content": "No Good Deed had a lot of hangover of Dead To Me, especially the chronic ailments, feelings of loss and grief. Linda Cardellini just seemed like she was still a part of Dead To Me. Lisa Kudrow on the other hand was fantastic. She did the part of a grieving mother so well. Ray Romano too was so good and Luke Wilson as well. It seemed like such a sweet and a good holiday binge kind of a show that isn't too heavy or hard on your brains and eyes. They should bring it back for another season with different characters and a story. Just shame how it wasn't promoted as well or we don't have many people talking about it. ",
        "upvotes": 28,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1hs3yi4/no_good_deed_was_it_lisa_kudrows_best_performance/"
    },
    {
        "id": "1hrqrxt",
        "author": "Whobitmyname",
        "title": "Netflix Canceled the Most Shows in 2024 (16), More Than Any Other Streamer or Network",
        "content": "",
        "upvotes": 177,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1hrqrxt/netflix_canceled_the_most_shows_in_2024_16_more/"
    },
    {
        "id": "1hsegjl",
        "author": "Burning-Atlantis",
        "title": "Marco Antonio González Ospina",
        "content": "From 100 Years of Solitude. Wtf else has this actor starred in? I have absolutely seem him before, and it's driving me crazy because I've searched google, reddit, Wikipedia, IMDB, everything I can think of, and nothing comes up except his role as Jose Arcadio Buendia. ",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hsegjl/marco_antonio_gonzález_ospina/"
    },
    {
        "id": "1hs5ihh",
        "author": "Sensitive_Rock6788",
        "title": "Missing you?",
        "content": "Just started it yesterday because it was recommended to me, thought I’d like it because  the Harlan Coben world is usually pretty good; but I’m also starting to feel like once you’ve seen a few, you’ve seen them all. It’s like the old Lifetime network with repeat actors and actresses, but for whatever reason, I just can’t get into this one. I’ll have to wait a bit and give it another shot. Idk if there’s too much going on, or if I’m not wild about the casting, I cant put my finger on it. ",
        "upvotes": 11,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1hs5ihh/missing_you/"
    },
    {
        "id": "1hs9uc8",
        "author": "Frensisca-",
        "title": "True crime drama series",
        "content": "Hello, can you please recommen some true crime drama series? Not a documentary ,\na series based on a true crime story.\n Example: The staircase, OJ Simpson etc \nThanks so much ! #dramaseries #truecrime",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hs9uc8/true_crime_drama_series/"
    },
    {
        "id": "1hrc6ol",
        "author": "S4v1r1enCh0r4k",
        "title": " Netflix Accidentally Leaks 'Squid Game' Final Season Release Date -June 27 ",
        "content": "",
        "upvotes": 802,
        "comments": 108,
        "media": null,
        "permalink": "/r/netflix/comments/1hrc6ol/netflix_accidentally_leaks_squid_game_final/"
    },
    {
        "id": "1hshzrx",
        "author": "gorram1mhumped",
        "title": "Do people talk about Glow? I'm kinda shocked how good it is, but nobody every pushed it. If you haven't seen it, for whatever reason, consider this a push.",
        "content": "The show takes its time, don't expect to get hooked right away. But i think they nailed the tempo. Very fun, silly, touching, and cool. Really unique viewing experience, and everyone is acting their asses off, often with just a few lines an episode.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hshzrx/do_people_talk_about_glow_im_kinda_shocked_how/"
    },
    {
        "id": "1hrwg7s",
        "author": "Robemilak",
        "title": "First trailer for ‘THE RECRUIT’ Season 2, starring Noah Centineo and Teo Yoo.",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hrwg7s/first_trailer_for_the_recruit_season_2_starring/"
    },
    {
        "id": "1hs9jgw",
        "author": "TimelyHistory4410",
        "title": "Unable to watch some shows on my profile",
        "content": "For some reason \"Continue Watching\" has disappeared completely from my feed and when I look for those shows they are available but it shows no episodes. This only happens with my profile. I'm on mobile app. I deleted and downloaded the app but it hasn't been fixed. I logged in on website and the issue persists. How can I fix this?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hs9jgw/unable_to_watch_some_shows_on_my_profile/"
    },
    {
        "id": "1hs8svb",
        "author": "Kezzy00",
        "title": "Help",
        "content": "I have a Netflix premium account but can't watch any content in 4K. My Google TV  says everything is only \"HD\". The same thing happens to my phone. My Internet speed is more than 15 Mbps, my TV is a 4K, and the Chromecast is connected to an  4K HDMI port. Netflix playback settings are also set to \"High.\" I've done an update on both the Chromecast firmware and the Netflix app and confirmed that my devices support Widevine L1 DRM. I also checked my internet speed and reset my Chromecast. I even reinstalled Netflix, but still could not use Ultra HD 4K. Anyone else experienced this? Any solutions?\n\nAlso I have a premium plan.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hs8svb/help/"
    },
    {
        "id": "1hschw3",
        "author": "Wise-Moment8345",
        "title": "How long did it take you to figure out the killer in Time Cut.",
        "content": "It took me 40 minutes. In the school when they break the beaker and then when they originally tell Lucy not to do it. Not to time travel. Oh and the mask literally being on display at his work.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hschw3/how_long_did_it_take_you_to_figure_out_the_killer/"
    },
    {
        "id": "1hs7dq0",
        "author": "dumbbratbaby",
        "title": "reached yearly download limit in 2025?",
        "content": "this is annoying me sooo bad. i hit the yearly download limit on a few things last year. i’m trying to redownload them now and it won’t let me because apparently i’ve hit the yearly download limit despite not downloading anything this year ?? wtf netflix, if anyone has a solution i’d appreciate it",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hs7dq0/reached_yearly_download_limit_in_2025/"
    },
    {
        "id": "1hrm3qp",
        "author": "Neither_Technology74",
        "title": "Discussion: Too many low grade, effortless, productions.",
        "content": "Here's where I currently stand on Netflix as a whole:  \n  \nAs an example: If Netflix produced Star Trek: The Next Generation, it would have been cancelled after the first season and it would never have become as huge as it is today.  \n  \nNetflix needs to take more responsibility to bring stories to fruition and conclusion. Stop producing so much absolute C, D and F grade productions.   \n  \nFocus up and work to improve the shows that have traction to be there. You cancel shows with viewers measured in millions and waste money producing umpteen 100's of things with viewership measured in thousands. \n\nPeople pay good money to spend their time getting involved in concepts, plots, character development, etc., only to have Netflix repeatedly and relentlessly pull the plug on them. \n\nAlso becomes difficult to find things worth watching because you have to browse forever through low grade productions on the platform. \n\nPersonally, I think they should stop wasting so much money, only to pull the plug on good productions because of.... money, and stick to their guns and see things through. \n\nThere's a mathematical reality to having, for example, 10,000 things to watch, spread over your subscribership, vs 5,000 higher quality things spread over your viewership. Viewership hours are finite. They put so much out there, they distract viewership from coagulating onto good productions that rely on viewership to continue production. It seems like they do not understand this basic concept. \n\nCurious to hear what you all think, please comment below :) ",
        "upvotes": 24,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1hrm3qp/discussion_too_many_low_grade_effortless/"
    },
    {
        "id": "1hsammn",
        "author": "Kesonac",
        "title": "Ladies and gentlemen, I'm asking for my picky parents again!",
        "content": "Thanks to this sub and my last post in here, my parents finally watched money heist and love it as much as they loved prison break. These are the only 2 series they didn't stop watching and absolutely love. Now I need a third suggestion from you guys. Please only series that are already finished and where you think If they liked PB and MH, they could also love your suggestion. I know for a fact it isn't necessary the vibe of a \" escape heist\" which only made them like these 2 series, there must be something else about these series that are also in non \"escape heist\" series..",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hsammn/ladies_and_gentlemen_im_asking_for_my_picky/"
    },
    {
        "id": "1hrqrzv",
        "author": "ConfidenceUnited3757",
        "title": "Netflix keeps thinking I am currently watching a movie, but I am not",
        "content": "I have a bizarre issue that I could not solve by googling. When I want to watch anything on my smart TV Netflix app it tells me thus is not possible brcause I am currently watching Harry Potter on that same device and can only use one at a time. I did watch Harry Potter a month ago and didn't open it since and this only became an issue a few days ago. But what I am able to do is watch Harry Potter (and only that) on my TV and anything else concurrently on my phone, so their device tracking doesn't actually work at all. I have tried restarting and logging in and out of the app on my TV (it can't be uninstalled) but to no avail. Really frustrating and kind of unbelievable that a 400 billion dollar company can't get such a simple feature right.",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hrqrzv/netflix_keeps_thinking_i_am_currently_watching_a/"
    },
    {
        "id": "1hs493y",
        "author": "Rare-Comfort-1042",
        "title": "Just watched 'Dark Game'",
        "content": "And honestly dont bother, it was a -5/5 with a bad plot, zero character development and basically no message. Don't waste your time, you'e been warned.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hs493y/just_watched_dark_game/"
    },
    {
        "id": "1hs36ce",
        "author": "KajuZaratan",
        "title": "Download on windows app till somehow possible?",
        "content": "Is it still possible to download the Dee app version to get access to the download function? \n\nOr any other way to use it?\nI use my surface for travelling and it's convenient to watch movies in the plane for example. Don't want use my small phone for watching movies ...",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hs36ce/download_on_windows_app_till_somehow_possible/"
    },
    {
        "id": "1hr9xg9",
        "author": "MarlowInvests",
        "title": "La Palma - Ending really p***ed me off.",
        "content": "I've just finished watching the limited series of \"La Palma\", which I was really enjoying. Right up until the last 15mins of the last episode. So much so it's pi**ed me off.\n\nHow can someone survive a frigging tsunami after being hit with it whilst taking off in a plane? They must of been underwater for at least 15mins (that's being generous) whilst the rest of the island gets wiped out.\n\nThey should of ended it where she and her new girl friend died. \n\nHow does everyone else feel about the ending?",
        "upvotes": 78,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1hr9xg9/la_palma_ending_really_ped_me_off/"
    },
    {
        "id": "1hrq854",
        "author": "MagpieTower",
        "title": "Horizon: An American Saga should have been made as a TV series instead of movies.",
        "content": "I think Horizon is pretty good, even though the pacing is somewhat a bit off, but it's probably expected since it has large casts. I just feel it should have been made into TV series since that's the general feel I get from watching the movie, but that's just me. I feel like there's more stories to be told and I want to know more about the characters, but it feels like there's not enough since they had to cram everything in one movie and cut some parts out. Even though there's Part 2, if it ever comes at all and I would definitely look forward to that. I think Horizon has potential to become better.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hrq854/horizon_an_american_saga_should_have_been_made_as/"
    },
    {
        "id": "1hsefnh",
        "author": "Miserable-Part6261",
        "title": "Who made the choice of only a select Raw Episode from each Year are on the platform?",
        "content": "I'm scrolling on Netflix and all i see, all i come across is one episode of each year and each months raw episodes. i was just on the other platform they were  just on and saw the whole catalog is gone and now on here. i come here and this is what i see?\n\n\n\nmm mm mm. NETFLIIIIIIIX, whats happening here? i've been a watcher of Raw since 97 going into 98 and i have concerns.  ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hsefnh/who_made_the_choice_of_only_a_select_raw_episode/"
    },
    {
        "id": "1hs93ko",
        "author": "coteusa",
        "title": "Why aren’t more titles in 4K?",
        "content": "I recently upgraded to the Netflix Premium plan and was severely disappointed by the lack of 4K options on many movies. Seems like it is mainly reserved for Netflix originals\n\nThis week they added Interstellar, Dune pt 2, and Mad Max to Netflix streaming, but only Interstellar offers 4K. Why wouldn’t the other movies also support this?",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1hs93ko/why_arent_more_titles_in_4k/"
    },
    {
        "id": "1hsa8gn",
        "author": "BLANKNG",
        "title": "Don't watch AoB if you enjoyed Squid Games",
        "content": "The only people who market Alice in Borderland are people that like anime:\nThe dialogues, character appearances and behaviours are cringe and unrealistic.\nThis could of been the better Squid Games if they modified it away from all the unrealistic (and quite frankly stupid) poorly written anime style; am hugely disappointed. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hsa8gn/dont_watch_aob_if_you_enjoyed_squid_games/"
    },
    {
        "id": "1hsa6r8",
        "author": "IrnBruAndDepression",
        "title": "I‘m so fucking sick of this, what can I even watch anymore?",
        "content": "Is there literally any decent show that actually saw its natural conclusion? It feels like maybe a handful of the shows I liked got a proper ending, most were cancelled despite being received well. \nI just finished Dead Boy Detectives and loved it - cancelled. The Bastard Son and the Devil Himself seemed really interesting but I didn’t start it because I know it was cancelled and don’t want to get mad over a cliffhanger. Dead End: Paranormal Park, a great cartoon with queer and neurodivergent characters, cancelled while the season was already in production. \n\nI don’t even want to start a new show anymore because I know they’ll cancel it after one season anyway for not doing insane numbers all the time. \n\nAnyone have recommendations for shows similar to the ones above, preferably complete or confirmed renewed? I‘ll even take cancelled as long as there’s no cliffhanger.\nWould love something Fantasy with queer characters and a good story if y‘all know something",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1hsa6r8/im_so_fucking_sick_of_this_what_can_i_even_watch/"
    },
    {
        "id": "1hrnmm8",
        "author": "sassylilchix",
        "title": "Extra member forced ads ",
        "content": "So my parents added me as an extra member on their Netflix so I can watch squid game in peace.\n\nBUT the extra member account I have is with ads. I only found one other person on Reddit with the same issue.\n\nIf I were to buy Netflix with ads in my own it’s 6.99 but an extra member is 7.99…?",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hrnmm8/extra_member_forced_ads/"
    },
    {
        "id": "1hs0zvo",
        "author": "dwaynethevapejohnson",
        "title": "WWE on netflix and searching for specific episodes ",
        "content": "Now my wildest dreams have come true and I can watch WWE on netflix, has anyone worked out how to search for specific episodes of raw etc?\n\n(Tried posting in WWE sub but all my posts get deleted there for w/e reason)",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hs0zvo/wwe_on_netflix_and_searching_for_specific_episodes/"
    },
    {
        "id": "1hqq5d8",
        "author": "Sudden_Pop_2279",
        "title": "‘Squid Game’ Season 2 Opens With 68 Million Views, Netflix’s Biggest TV Debut Ever",
        "content": "",
        "upvotes": 1566,
        "comments": 183,
        "media": null,
        "permalink": "/r/netflix/comments/1hqq5d8/squid_game_season_2_opens_with_68_million_views/"
    },
    {
        "id": "1hrqkzv",
        "author": "aRJei45",
        "title": "Watched on Another Profile",
        "content": "Is there a feature that's something like my title? I already watched Squid Games S2 on my sister's profile. Now, I want to tag the show as already watched on my profile.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hrqkzv/watched_on_another_profile/"
    },
    {
        "id": "1hrlq1p",
        "author": "dacluelessbadger",
        "title": "Unable to watch specific titles on Netflix Apple TV",
        "content": "Since this morning I have been unable to watch certain shows on my Apple TV specifically on my Netflix profile. I tested other devices and other profiles and they did not have this issue. \n\nI initially thought that this issue was limited to the shows I was currently watching, given that I couldn’t find the “continue watching” tab or actually start watching those shows after searching for them. The only options I saw were “Remind Me” and “Watch Trailer.” Then I realized that this issue is also affecting almost every single non-Netflix original and some Netflix originals. These Netflix originals do not have title cards and are just text. Also, there are no titles on my watch list even though I remember having many shows and movies added.\n\nI contacted support and they were not helpful in the slightest (they suggested I just wait and that my request will be processed in the backend… whatever that means). \n\nIf anyone has experienced anything similar recently I would greatly appreciate any troubleshooting advice!",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hrlq1p/unable_to_watch_specific_titles_on_netflix_apple/"
    },
    {
        "id": "1hrk9qg",
        "author": "infallables",
        "title": "DOTA: Dragon’s Blood is Incredible",
        "content": "This is an absolutely incredible series. World class quality in the voice acting, action, animation, and above all dialogue. Does anybody know if there will be further seasons? Are Mitch Iverson or Ashley Edward Miller writing or producing any more series?",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hrk9qg/dota_dragons_blood_is_incredible/"
    },
    {
        "id": "1hrsmia",
        "author": "Rando522",
        "title": "Can you find this?",
        "content": "I need help finding the novie or tv series with this quote. It may not be exact.\n\n\"A mans wife and child died to soldiers after being hunted down for so long and breaks him\"\n\nIt was mentioned that he has a psychic break.\n\nHe has the ability to use flesh as a power and he uses this ability in the scene.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hrsmia/can_you_find_this/"
    }
]