[
    {
        "id": "1lzz8vz",
        "author": "Pinchus121",
        "title": "I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix and host of the Naked Lunch podcast. I travel the world eating incredible food and talking to even more incredible people. Let’s dish! AMA.",
        "content": "Hi Reddit! I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix, and host of the Naked Lunch podcast with my good friend David Wild. I’ve spent the last several years traveling the globe with a fork in hand, trying to prove that the best way to connect with people is through good food and a lot of laughs. Season 8 of Somebody Feed Phil is now streaming on Netflix and we’re serving up new episodes of Naked Lunch every week wherever you get your podcasts, including chats with legends like Jane Fonda, John Stamos, Allison Janney, and so many more!  \n  \nGot questions about the best food cities, behind-the-scenes stories from the road (or the sitcom world), or where I stand on pineapple on pizza? I’m all yours!  \n  \nLet’s eat and chat.  \n  \nPhil  \nu/Pinchus121\n\nhttps://preview.redd.it/4k4qn42nrwcf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=19b27cd4f54858b592249a41b78424ec7203a1e5\n\n\n\n&gt;Thanks everyone for joining in! Be sure to check out Season 8 of Somebody Feed Phil now on Netflix and listen to new episodes of my podcast \"Naked Lunch\" every week!",
        "upvotes": 90,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1lzz8vz/im_phil_rosenthal_host_of_somebody_feed_phil_on/"
    },
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1m4pyf9",
        "author": "AustinBaze",
        "title": "Stop Asking Me \"Who's Watching?\" Dammit.",
        "content": "[Please Stop Asking](https://preview.redd.it/vdi33l6te1ef1.jpg?width=890&amp;format=pjpg&amp;auto=webp&amp;s=efe046b37cc706f4349d0958c889462ec978c8f4)\n\nSingle, no kids.  There is only one Netflix profile.  There is only one subscriber. There has only ever been ONE profile and one subscriber. Ever.   \nThere has only been answer ever to this question for the 10 years or so you have been asking it.  I'm bored with it, are you Netflix?   \n",
        "upvotes": 850,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1m4pyf9/stop_asking_me_whos_watching_dammit/"
    },
    {
        "id": "1m5b559",
        "author": "mschiie",
        "title": "Just started Peaky Blinders… why didn’t anyone shake me sooner?!",
        "content": "As in… wow. I feel robbed for not watching this sooner.\nPeaky Blinders is everything I want in a show sharp, intense, stylish, and full of bite.\nEvery scene feels cinematic, the pacing is tight, and the characters? Complex AF.\n\nIt’s not just a gangster show it’s about trauma, ambition, and power plays wrapped in designer suits and razor hats.\nCillian Murphy eats every scene. The soundtrack? Chef’s kiss.\n\nIf you’re into smart, gritty crime dramas like Breaking Bad, Boardwalk Empire, or Narcos this is your next obsession.\n10/10. No notes.\n",
        "upvotes": 37,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1m5b559/just_started_peaky_blinders_why_didnt_anyone/"
    },
    {
        "id": "1m57ych",
        "author": "Tiger_Eagle06",
        "title": "Untamed - Question about the ending….(Spoilers)",
        "content": "I really enjoyed this show but one thing just seemed off. Close to the end, the Ranger finds the cell phone? Has this phone just been sitting in his living room for days and he just never checked her bag?  Or did I miss something?\n\nSeems like a HUGE writing mistake for him to just forgot to search the bag. ",
        "upvotes": 12,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m57ych/untamed_question_about_the_endingspoilers/"
    },
    {
        "id": "1m4mze7",
        "author": "Due-Needleworker-218",
        "title": "How to stop them recommending me shows I’ve already watched..",
        "content": "I watch quite a lot of shows and movies on Netflix and they still suggest/recommend stuff to me that I previously watched like a week ago. Is there a way to stop this or maybe hide certain titles after u watched them? ",
        "upvotes": 69,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1m4mze7/how_to_stop_them_recommending_me_shows_ive/"
    },
    {
        "id": "1m5dw1j",
        "author": "waynejohnson1985",
        "title": "A Netflix original that completely exceeded your expectations?",
        "content": "I just finished watching *The Platform* and honestly went in without expecting much. Maybe just another dystopian thriller. But wow, it completely blew me away. The concept was so unique, and the social commentary was intense without feeling forced. I didn’t think it would stick with me the way it did, but days later I’m still thinking about it.\n\nHave any of you had a similar experience with a Netflix original that really surprised you (in a good way)? Would love to hear your picks.\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m5dw1j/a_netflix_original_that_completely_exceeded_your/"
    },
    {
        "id": "1m5cz3g",
        "author": "Strong_Badger6249",
        "title": "Building the band pitch correction/autotune",
        "content": "I just wanted anyone else’s input on how much they are altering these people’s voices to make it sound better than it actually was , they are great singers but in certain moments I feel like you can hear where they clearly messed up , and they have just edited the audio to make it less noticeable … like in harmonies they will just make someone else’s voice more noticeable or they use obvious pitch correction .. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m5cz3g/building_the_band_pitch_correctionautotune/"
    },
    {
        "id": "1m5ca8a",
        "author": "schlock_",
        "title": "Untamed - filmed in …",
        "content": "Hard to express the disappointment I’m experiencing right now. \n\nI looked up filming locations to see where Untamed was filmed. \n\nI worked as a Park Ranger in Yosemite for 2 years. Very little of the movie was familiar to me. \n\nSeems like almost all of it was filmed in Canada. \n\nLost opportunity to showcase one of the most spectacular places on this planet. \n\nWas a rather good story IMO too. \n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m5ca8a/untamed_filmed_in/"
    },
    {
        "id": "1m57ynm",
        "author": "Derpitoe",
        "title": "Lg Tv App Update",
        "content": "Why is everything so large, in your face?  This has to be the worst ux ui experience I’ve ever seen on a television streaming platform, give us the option to A/B test this by letting us revert to the prior. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m57ynm/lg_tv_app_update/"
    },
    {
        "id": "1m5b8xz",
        "author": "pandadimsum",
        "title": "Experience with Netflix Shop?",
        "content": "Wanted to buy some Kpop Demon Hunter merch from the website because I really like the shirts, but just wanted to ask how true to size the pajama pants are and if anyone has had any good/bad experiences with buying from their website? (I know there’s always some risk with buying online, just wanted to ask though for other buyers experiences)\n\nThank you :) ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m5b8xz/experience_with_netflix_shop/"
    },
    {
        "id": "1m5b5w2",
        "author": "Deep_Fly_4773",
        "title": "Enola Holmes 2: Eudora and Edith",
        "content": "I just have one question while I was rewatching enola holmes 2. Why didn't Eudora and Edith go with enola after the fight scene? Is it because the mystery was just focused to enola and Sherlock to solve? Haha maybe that was the answer but I just could help thinking for them to have more screentime, especially as a one family. Even Sherlock did not see his own mother in that movie. Maybe in Enola holmes 3. And even Mycroft! Knowing the actor struggled in schedule that is why he is not in the movie.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m5b5w2/enola_holmes_2_eudora_and_edith/"
    },
    {
        "id": "1m5b27o",
        "author": "Cyrus99",
        "title": "I'm sick and tired of not being able to just select the resolution that I want.",
        "content": "YouTube has been around for over 20 years now. In my opinion it is the standard for video player quality and usability. Since as long as I can remember, you've been able to select whichever resolution you want for whatever video you're watching.\n\nI am so sick and tired of the fact that you cannot just select the resolution of the video you want on Netflix. The only options I can find on video quality are universal for your entire profile and include \"Low, Medium, High\" which is completely ambiguous and meaningless to any user with half their brain.\n\nWhy can't I just select the resolution that I want? If it's laggy or my hardware can't handle a specific resolution, then I can turn it down to something else. This is absolutely basic functionality that should exist for such a large company and it's obviously done intentionally. I also can't believe that more people don't complain about this. This should be changed. Why aren't a larger number of Netflix users complaining about this?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m5b27o/im_sick_and_tired_of_not_being_able_to_just/"
    },
    {
        "id": "1m4zpjy",
        "author": "hoozyrdaddy",
        "title": "Allow users to turn off Autoplay from TVs",
        "content": "It’s absurd that this is no longer allowed… And it’s a very obvious ploy to get people to have the app on their TVs and on their phones when it doesn’t need to be on every single device that we own.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m4zpjy/allow_users_to_turn_off_autoplay_from_tvs/"
    },
    {
        "id": "1m4r1zh",
        "author": "LilBitofSunshine99",
        "title": "Has anyone else watched Entitled?",
        "content": "Damn this show is so crazy. I don't know how else to describe it. Only 8 episodes for season 1 and they're only 30ish minutes apiece. I was hooked by the last 5 minutes of episode 1 and had to binge the rest. \n\nI'm curious about others' opinions. \n",
        "upvotes": 9,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m4r1zh/has_anyone_else_watched_entitled/"
    },
    {
        "id": "1m56hvd",
        "author": "eksukoon",
        "title": "Vanessa Kirby’s Fierce Transformation in Netflix’s “Night Always Comes”",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m56hvd/vanessa_kirbys_fierce_transformation_in_netflixs/"
    },
    {
        "id": "1m56d9t",
        "author": "Lonely_Fault_9599",
        "title": "Fear street question",
        "content": "\nFear street question \n\nAfter fear street prom queen who do you think should direct/write the next fear street movie and what book should be adapted next ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m56d9t/fear_street_question/"
    },
    {
        "id": "1m4vw7w",
        "author": "snowblindsided",
        "title": "NETFLIX KPop Demon Hunters sing-along theatrical release when?",
        "content": "So we can sing together and be Golden?   I will buy All The Popcorn Buckets.  \\o/\n\nOh, and contact the Hatsune Miku people.  You may be on to something here.\n",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m4vw7w/netflix_kpop_demon_hunters_singalong_theatrical/"
    },
    {
        "id": "1m4sz8w",
        "author": "James_15625_",
        "title": "Fubar Swedish Mafia",
        "content": "Not really a spoiler but the Swedish Mafia all driving a Volvo on Fubar is like next level 😂😂😂\n\nI loved the many quirks the show has. Like Arnold’s movies being referenced. Also I think after true lies, this is yet another story of him being the ladies guy. \n\nWhat really makes you want to watch the series are his wife and daughter though. Awesome casting!",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m4sz8w/fubar_swedish_mafia/"
    },
    {
        "id": "1m4zlfk",
        "author": "40-1Segert",
        "title": "Why is aways part 2 or the second film available...  But not the first one?",
        "content": "This is really doing my head in. I think hey i want to watch dune. Because people say those are really good movies. Cool. Netflix has those right? Only part 2.... WHY? Just... What is the purpose of only having part 2 on netflix. While not having the first movie? I cant watch part 2 now. Since i havent seen the first one. That is not enjoyable to me/\n\nAnd Dune is not the only example of this.  John wick film series is also not complete. For example.\n\nSurely im not the only one with this frustration right? Sometimes i set something aside to watch later. Maybe a month goes by. Since live is busy. And... its gone. It really is now or never sometimes now with netflix. This isnt how it used to be. I have netflix since... 8 years ago? 9? And it was complete freedom of watching whatever you wanted whenever. Now it feels very limited. And having the part 2 movies and not part 1 being available. Is very frustrating. \n\nI get it. Licences and all that. But to be honest. As a consumer. I dont care about that. I care about having the freedom to watch whatever i want. Whenever i want. Binge watching some movies. Like i was planning this evening. I wanted to binge watch dune 1 and 2. Sadly not possible...\n\nAnyone else get this frustation? Any specific series you had this with?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m4zlfk/why_is_aways_part_2_or_the_second_film_available/"
    },
    {
        "id": "1m491ao",
        "author": "Next-Wash-7113",
        "title": "Untamed - omfg, y’all!",
        "content": "Episode one - shocking!! And it just better as it went! I’m only through episode three so no spoilers but you guys??! \nCast is AMAZING! You really feel for them and their circumstances! \nAlso!! The views and images are absolutely BREATHTAKING!! I want to go there now ",
        "upvotes": 116,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1m491ao/untamed_omfg_yall/"
    },
    {
        "id": "1m4xx7r",
        "author": "Easy_Philosopher1023",
        "title": "Need recommendations please",
        "content": "Having trouble finding something not crappy or boring. Seems like everything has been done over and over again. Some things that I absolutely love:\nThe Witcher\nThe Umbrella Academy\nThe haunting of Hill House and Bly Manor (and anything Mike Flanagan, House of Usher, Midnight Mass, etc)\nThe Sandman\nStranger Things\nLost\nOne Piece\nSweet Tooth\nYou \nThe 100\nKaos\n\nHorror, Sci-Fi and Fantasy are my go tos. \n\nI’ve tried a few that were flops:\nDiscovery of witches\nDead boy detectives\n\nEverything just seems so played out. Don’t tell me Shadow and Bone, I want to read the books first!\n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m4xx7r/need_recommendations_please/"
    },
    {
        "id": "1m4y7qz",
        "author": "Similar-Toe4495",
        "title": "What's this film called?",
        "content": "Sorry I have such little to go on, I really cant remember anything about this film, except it had British actors in it, set in maybe Australia, a woman goes away to her families-friend's beach house and her little girl gets caught in a fire or a tornado while playing hide and seek",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m4y7qz/whats_this_film_called/"
    },
    {
        "id": "1m4wcq6",
        "author": "LookUpThenLookDown",
        "title": "Finished watching Dirk Gently. Really love it but sad it got cancelled",
        "content": "I spent a whole day watching Dirk Gently. I started watching it because of the clips I saw online. I watched episode one few years back, was very confused stop and didn't even finished the episode, big mistake because now it's on my top favorite shows. Such a great cast, and such a unique storyline. What I love even more is that I can feel the chemistry with the characters, Elijah Woods and Samuel Barnett together was something I didn't know I needed in life. Shame that it got cancelled. After s2 I really wanted to know what happened after especially my favorite characters Bert and Ken. But we have to move on. It's been almost a decade since it was cancelled, maybe if it's still possible even a little possibility of a book or comic but it's been so long, I get it if the show runners or writers moved on.\n\nAnyway what are your thoughts on the show?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m4wcq6/finished_watching_dirk_gently_really_love_it_but/"
    },
    {
        "id": "1m4hs0l",
        "author": "Content-Ad-5883",
        "title": "ADAM SANDLER MOVIES",
        "content": "Is anyone here also loves Happy Madison Productions by Adam Sandler? I could bingewatch his movies all day and night. Specially the comedy one, well most of them are comedies. I have this hint that, if Rob Schneider appears... that movie would be a 10/10! Idk, I'm just proud of him because his half-Filipino. Honestly, I just watched some of his film through Netflix and Loklok. \n\nHere's the films I've watch and I will rate it based on my experience while watching (or secret crush on cast. clue: AS) Consider this as my recommendations if you love his films so much!\n\n- Grown Ups 1 &amp; 2 8/10\n- 50 First Dates 1000/10\n- Just Go With It 8/10\n- The Longest Yard 7.5/10\n- Big Daddy 9/10\n- Hotel Transylvania 1, 2, 3 &amp; 4 10000/10\n- The Cobbler 4/10\n- Punch-Drunk Love 6/10\n- The Do Over 9.5/10\n- Murder Mystery 1&amp; 2 7/10\n- Your So Not Invited To My Batmitzvah 8/10\n- Hubbie Holloween 8.9/10\n- Don't Mess with the Zohan 10000000/10\n- Happy Gilmore 1 11/10\n- Billy Madison 7.6/10\n- The Click 8.5/10\n- Blended 6/10\n- That's My Boy 100000000000/10 \n- Pixels 8.6/10\n- Anger Management 5/10\n- The Ridiculous 6 10/10\n- Sandy Wexler 5/10\n- The Week Of 1000000000000/10\n\nI'm so excited about HAPPY GILMORE 2, JULY 25TH ON NETFLIX &lt;3333333\n\nI know there's movies of him that I still don't watch, I just can't find them. Maybe y'all can send hel:p where can I watch it.",
        "upvotes": 9,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1m4hs0l/adam_sandler_movies/"
    },
    {
        "id": "1m4kdzr",
        "author": "starmaxeros",
        "title": "Winx Club: The Magic is Back is coming to Netflix on October 2",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m4kdzr/winx_club_the_magic_is_back_is_coming_to_netflix/"
    },
    {
        "id": "1m4qze3",
        "author": "Exotic-College1042",
        "title": "Update household - no text option?",
        "content": "Has this happened to anyone? \nThis week, on the updating household page, the send text option is not longer available.\n\nThey only have a send email option. \n\nWhat's up with that? Anyone know?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m4qze3/update_household_no_text_option/"
    },
    {
        "id": "1m4o4h7",
        "author": "ves_2727",
        "title": "5.1 sound enable in windows",
        "content": "I have an external usb 5.1 DAC , how to view supported movies and shows  in 5.1,in  browser i'm only able to see stereo option in audio settings. P.S Windows detects 5.1 ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m4o4h7/51_sound_enable_in_windows/"
    },
    {
        "id": "1m4nr4y",
        "author": "dystopian_teen",
        "title": "shiny mobile app?",
        "content": "when i move my phone the poster goes shiny in different places... has anyone else noticed this as a new feature? \n\ni was wondering if maybe apple had an app running in the background that was causing the shininess like a sticker and this is nothing to do with netflix",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vonq3ccjw0ef1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1m4nr4y/shiny_mobile_app/"
    },
    {
        "id": "1m47v72",
        "author": "No_Chocolate_7401",
        "title": "Help — we miss Kaos!",
        "content": "\n*and can’t come to grips that there will never be more!* What else can we watch that is similar? Anything come close? The whole vibe, the comedy, the raunch, the gods and goddesses  — we are here for it. ",
        "upvotes": 13,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m47v72/help_we_miss_kaos/"
    },
    {
        "id": "1m4ltri",
        "author": "No_Caterpillar7863",
        "title": "Account hacked ?",
        "content": "Today I got a message from Netflix on my gmail saying that another device has been signed into my account and gave a location...the message came simultaneously after I signed from device...I tried changing the password and signing out of all devices but it kept on happening...my email account has not been hacked...is it a bug or something?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m4ltri/account_hacked/"
    },
    {
        "id": "1m4x4b9",
        "author": "NoCalAzoreana",
        "title": "Rejecting request to upgrade to 4k Subscription messed up my new TV",
        "content": "In the recent pre-Prime sale I bought a 55 in Insignia TV. Love it! I had to reload my apps but no problem. I was watching Netflix and a pop up says you have the 1080 subscription do you want to PAY MORE and get the 4K subscription? Ummm…no…I do not want to pay more…no thanks. Then, after that, any time I played something, the picture would flash and as it played an 8 inch bar across the tv had no picture and would flash. I set out to return it but was suggested to restore to factory settings. TV is back to normal. Has anyone had anything similar happen?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m4x4b9/rejecting_request_to_upgrade_to_4k_subscription/"
    }
]