[
    {
        "id": "1otauls",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 7,
        "comments": 155,
        "media": null,
        "permalink": "/r/realmadrid/comments/1otauls/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1osoz4q",
        "author": "soccer-stats",
        "title": "Post Match Thread: Rayo Vallecano vs Real Madrid",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1osoz4q)",
        "upvotes": 179,
        "comments": 827,
        "media": null,
        "permalink": "/r/realmadrid/comments/1osoz4q/post_match_thread_rayo_vallecano_vs_real_madrid/"
    },
    {
        "id": "1otdkwb",
        "author": "Bryam_h_m",
        "title": "Missing this Rodrygo performances like crazy",
        "content": "Now we just have a black void in the right wing, Xabi really is not taking all off the juice out of this squad.\nNowadays If you want to nullify real madrids attack, you just 7 man mark Vini and that is it, because there is no threat in the right wing, and the worst part, is that he is not responding when he is brought on as a sub or when he starts",
        "upvotes": 275,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z8o9blgmkf0g1.jpeg?auto=webp&amp;s=420861fb1e00f9e305f1d16451f32d96c3793836"
        },
        "permalink": "/r/realmadrid/comments/1otdkwb/missing_this_rodrygo_performances_like_crazy/"
    },
    {
        "id": "1otauqg",
        "author": "Modo97",
        "title": "Xabi Alonso has disappointed us regarding Gonzalo García.",
        "content": "After the Club World Cup ended, all of us Madridistas were happy about the emergence of a new striker — someone we thought we could rely on, at least as a backup, like Joselu in 2024 or Morata in 2017. I’m talking here about Gonzalo García.\n\nBut after 16 matches between La Liga and the Champions League, all I see is a player who doesn’t play — and when he does, it’s only for the last 3 or 4 minutes, either to waste time or to give Mbappé a brief rest so he doesn’t get injured in the final moments.\n\nI understand that Mbappé is the best player in the world, and that he’s untouchable — but even when you’re the best, that doesn’t mean you have every solution. When facing teams that defend deep inside their box, why not resort to what I like to call the “Joselu card”? A striker who can score with his head when all other options fail, who can play one-touch football and cause chaos for defenders inside the penalty area.\n\nWhy not move Mbappé to the left when Vinícius isn’t performing well and bring on Gonzalo as a center forward? Why not even substitute Mbappé himself in the last 15 minutes when he’s trapped and unable to make an impact? What’s the point of having a classic number 9 — physically strong and good in the air — if you’re not going to use him in matches like yesterday’s?\n\nWe all thought Xabi Alonso trusted young players, but it turns out Mbappé was only absent during the Club World Cup. His handling of Gonzalo has been deeply disappointing.",
        "upvotes": 207,
        "comments": 68,
        "media": null,
        "permalink": "/r/realmadrid/comments/1otauqg/xabi_alonso_has_disappointed_us_regarding_gonzalo/"
    },
    {
        "id": "1otgq64",
        "author": "soldier101br",
        "title": "Our boys arrives in London for National Duty with Carlo Ancelotti against Senegal",
        "content": "",
        "upvotes": 69,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dk7ugz767g0g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1otgq64/our_boys_arrives_in_london_for_national_duty_with/"
    },
    {
        "id": "1otaws8",
        "author": "TheFeatherDiaries",
        "title": "Real Madrid are UTTERLY OVER-RELIANT on Kylian Mbappe's Goalscoring. He has scored 53 PERCENT of team's total goals this season and dwarfs the contribution of Peak Lionel Messi who scored 39 percent of Barca's total goals in 2011/12 and Peak Cristiano Ronaldo who scored 38 percent of RM 14/15 Goals.",
        "content": "",
        "upvotes": 149,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ly96lu80we0g1.jpeg?auto=webp&amp;s=e8773b0d6aedfe5d42293a5e396555948c6251b8"
        },
        "permalink": "/r/realmadrid/comments/1otaws8/real_madrid_are_utterly_overreliant_on_kylian/"
    },
    {
        "id": "1ot8f4k",
        "author": "PlantComprehensive77",
        "title": "Why did we bring in Trent?",
        "content": "What was the purpose of bringing in Trent? If Xabi refuses to ever play a traditional 9, while Vini and Mbappe play patty cake at the edge of the box, what is Trent offering to this team? It’s definitely not defending, so what’s the deal? \n\nHe came on against Liverpool, puts a ball into the box, and other than Jude, nobody there. Comes on today, gets the ball, looks up, and sees fuck all movement up top. We acquired one of the most creative fullbacks in world football without a clear target man. \n\nThe only time our attackers do make runs into the box is on the counter. Problem is 99% of the teams in this league play ultra low block, so that’s pretty much useless. Might as well send Trent back to Liverpool. ",
        "upvotes": 106,
        "comments": 60,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ot8f4k/why_did_we_bring_in_trent/"
    },
    {
        "id": "1ot777z",
        "author": "chunchunmaru1129",
        "title": "Our Player Ratings against Rayo Vallecano by Fotmob, what was the main problem",
        "content": "",
        "upvotes": 133,
        "comments": 123,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zeb7zr4kpd0g1.png?auto=webp&amp;s=4686047e661a3d23511f3553cced68a3242c9d77"
        },
        "permalink": "/r/realmadrid/comments/1ot777z/our_player_ratings_against_rayo_vallecano_by/"
    },
    {
        "id": "1otfx05",
        "author": "Working-Put3560",
        "title": "Gonzalo Garcia helps carrying out the bags",
        "content": "After not playing any minute again, he isn't fuming or cursing at the coach. He helps the groundkeepers carrying the bags out from the dressing room. He is a very humble guy between world class egos 🤍🤍",
        "upvotes": 25,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1otfx05/gonzalo_garcia_helps_carrying_out_the_bags/"
    },
    {
        "id": "1ot71ay",
        "author": "chunchunmaru1129",
        "title": "You guy's will hate me for this but I think Güler should play as our 10 and Jude should play as our 8",
        "content": "When Güler was playing as our attacking playmaker Mbappe was also performing really well.It seemed they have this deep connection or understanding of each other.Its like Güler and Mbappe are soul mates in the footballing pitch who are made for each other.Güler is a unselfish player who will provide scoring opportunities for Mbappe even when he himself can score.Güler is possibly our best playmaker and also passer on our team with the best vision. \n\nJude is a amazing box crasher but he sometimes is at positions which should be Mbappe's to stay at.\n\nJude is a physical beast and having him play as our 8 would help us tremendously in our defensive aspect of our playstyle.\n\nYeah Güler is doing fine in the DLP role but I still think he is at his best playing as the Attacking Midfielder. \n\nHim playing up allows Mbappe to be at his best which also helps us perform way better. ",
        "upvotes": 75,
        "comments": 50,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ot71ay/you_guys_will_hate_me_for_this_but_i_think_güler/"
    },
    {
        "id": "1otdfh1",
        "author": "auctus10",
        "title": "Valverde medical report",
        "content": "",
        "upvotes": 22,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1otdfh1/valverde_medical_report/"
    },
    {
        "id": "1ospu9r",
        "author": "AbuElKess",
        "title": "Every run Kylian Mbappé made into the box against Rayo Vallecano",
        "content": "",
        "upvotes": 736,
        "comments": 192,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/po56po78s90g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ospu9r/every_run_kylian_mbappé_made_into_the_box_against/"
    },
    {
        "id": "1otdf19",
        "author": "No-Independent2522",
        "title": "Parte médico de Courtois",
        "content": "",
        "upvotes": 18,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1otdf19/parte_médico_de_courtois/"
    },
    {
        "id": "1ospsqs",
        "author": "SaniaXazel",
        "title": "Brilliant tackle by Asencio to stop a Rayo Counterattack",
        "content": "",
        "upvotes": 484,
        "comments": 25,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lpnikppyr90g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ospsqs/brilliant_tackle_by_asencio_to_stop_a_rayo/"
    },
    {
        "id": "1oshrzt",
        "author": "TheFeatherDiaries",
        "title": "Thierry Henry doesnt agree with Vinicius' decision making against Liverpool",
        "content": "",
        "upvotes": 792,
        "comments": 177,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4zt9y0sk280g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oshrzt/thierry_henry_doesnt_agree_with_vinicius_decision/"
    },
    {
        "id": "1otb6xy",
        "author": "KucoTheKing",
        "title": "is Huijsen really better than Asencio?",
        "content": "When the season started i knew that Xabi will count on Huijsen as a starter, first of all because Asencio was absolute terrible on the CWC maybe he had some other problems outside of football in that time, and i knew Huijsen will be ahead of him because Xabi wanted him so bad in the club despite the other figures in the club who wanted to wait for Konate or Upamecano. But now few months in the season we see big difference in quality again. Whenever Asencio plays he is playing without a mistake, tackling on time, fast, making a good passes everything that we thought Huijsen will be for this season. My opinion is that Xabi is unfair putting Huijsen ahead of him who since the injury he had he is not the same player and is playing without a confidence, i can’t remember when he did something good without making 10 more mistakes after.  Asencio is our academy boy, he is in great form and i don’t see a reason for him not to start with Militao. Xabi is just trying to prove that we didn’t waste 40+ millions on Huijsen despite being so young.",
        "upvotes": 9,
        "comments": 31,
        "media": null,
        "permalink": "/r/realmadrid/comments/1otb6xy/is_huijsen_really_better_than_asencio/"
    },
    {
        "id": "1ot7l3c",
        "author": "Fit_Wrap_9580",
        "title": "To me Xabi is not the only one to blame,",
        "content": "I think we are almost 75% complete in rebuilding, but our main issue is with low block, and high pressing. Anyways xabi was making team play well with 3-4-3, but after CWC he changed to 433 or 442, we are very good defensively, exclude Liverpool and Athleti match, that may be due to inexperience in defensive line, but I am happy with overall defence, but during low block we need to play a proper striker.\n\nI guess board doesn't make him allow Playing 3-4-3, or maybe because of Mbappe's arrival.\n\nIn my opinion(this is purely my opinion): Vini has been dropping stinger on the left, its like he doesn't have a single braincell for decision making, dude has immense talent but his decision making is some times shit, taking on 3 players at once instead of passing and moving forward. I think instead of making Vini competing with Rodrygo, they should make Vini compete with Mbappe on Lw, and in striker Gonzalo or Endrick, or play Endrick in Right wing until Eminem comes back.\n\nYesterday we were just passing and passing and passing nothing in final 3rd, we were playing like headless chicken.\n\nI saw a post saying Perez supports Vini than Xabi, he didn't like the Vini Substitution, that's why we didn't see Vini get substituted. Xabi should be allowed to do whatever he wants, he is senor, and coach.\n\nOur team is good, but to be greatest only few more tweaks and that's it.",
        "upvotes": 16,
        "comments": 42,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ot7l3c/to_me_xabi_is_not_the_only_one_to_blame/"
    },
    {
        "id": "1oszlkn",
        "author": "blueXwho",
        "title": "Where did the common sense go?",
        "content": "How can so many people hinestly believe Mbappé is not good for Real Madrid? This has to be the only fan base in the world that thinks having the European Golden Boot is a bad thing.\n\nFirst, they were laughing at supportive fans because they predicted Mbappé wouldn't get along with the rest of the team and he wouldn't score as many goals as in the French league.\n\nNow that he became the European top scorer, they say he is \"padding stats\" and \"not helping the team\", they say we need a 9, not him. But what do they want the new 9 to do? Isn't score goals? Or the idea is to replace Mbappé (which is what people are saying) with a 9 that assists? Isn't obvious that having the top scorer is a good thing.\n\nI get that Xabi should think about using a striker that dominates the aerial game, but that cannot be to replace Kylian, but to complement him.\n\nI honestly don't understand how so many people share this opinion. It's insane thinking being the top European scorer is somehow a bad thing.",
        "upvotes": 56,
        "comments": 55,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oszlkn/where_did_the_common_sense_go/"
    },
    {
        "id": "1osk19u",
        "author": "TheFeatherDiaries",
        "title": "Starting XI vs Rayo Vallecano",
        "content": "",
        "upvotes": 282,
        "comments": 113,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/esfn5ep4m80g1.jpeg?auto=webp&amp;s=cea8e860f506246c97d308da54513a7ae8f2a243"
        },
        "permalink": "/r/realmadrid/comments/1osk19u/starting_xi_vs_rayo_vallecano/"
    },
    {
        "id": "1osw3w0",
        "author": "Mastermind_737",
        "title": "Why an aerial threat striker is needed",
        "content": "Rewatch our goals from 23/24 when scored 87 goals in la liga which was the most since 2018 when Ronaldo left. And focus on Jude and Joselu, the space they create for others and each other. The game winning or opening goals, they both are almost always present. And pay attention to the space at the top of the box allowing nice shots without the defense suffocating the players there. Here is the short Madrid Official channel video of the goals: https://youtu.be/T_YjyTNAJ5M",
        "upvotes": 55,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/es-jjfxi3jEGRrMKDgJRvXSfs1RUuhyV7NBM6sZGPyA.jpeg?auto=webp&amp;s=ad2e9fc8f916320a365c295c56d59f2da9b4b8af"
        },
        "permalink": "/r/realmadrid/comments/1osw3w0/why_an_aerial_threat_striker_is_needed/"
    },
    {
        "id": "1ost0b2",
        "author": "andrewthenikka1",
        "title": "Will we ever see the 352 again?",
        "content": "I think most of us are already dumbfounded about how xabi has managed this team since after the CWC. It’s understandable somewhat because we had a good start of the season until now but recent performances cannot go unnoticed. \n\nTalking about today’s game, holy shit was there even a game plan? And what were those subs? Not only were they so late but he brought on two players we absolutely didn’t need for that game. We have Endrick and Franco who can play RW but he does Brahim and Rodrygo 💀 why did he even start. And wtf is the point of Trent coming on in the 85th minute? He should’ve started let alone barely get anything. Bro was signed to watch from the sidelines. Valverde was holding his hamstring for like 10 minutes too. Mbappe must have Xabi hostage for being on that field for the full 90\n\nOnto the main point which is the 352. Most of our players had their best games in that formation. Trent as RWB, Valverde as RCM (we do NOT want to see him in the pivot again 🙏🙏), Tchoua as the CB/CDM hybrid role. Guler and Bellingham also played really well tg too, now they both just want to be 10s. After Endrick goes on loan we won’t have a competent RW. And we actually had players inside of the box and aerial threat. Why has Xabi completely ditched this formation? It worked out so well and the players that we have are best fit for it, Xabi was seriously genius for setting it up like that. I don’t know what goes on in his mind every time he plays 433 it just doesn’t work with our team as it NEEDS creativity which we DON’T HAVE! Does he watch the same games we are watching or is he in another universe?? I hope when he finally starts Trent (if he even does) he’ll feel compelled to use it, maybe after the break when tchoua is also back. \n\nI want to iterate that I am not overreacting but just pointing out the flaws. I still trust in Xabi and know we will get better as the season goes on I just hope he has full control of the team and it’s not Perez putting a gun to his head, or maybe should hope for that so we know it’s not him lol and Perez gives him the freedom. A draw is a draw and we move on. Hala Madrid!",
        "upvotes": 60,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ost0b2/will_we_ever_see_the_352_again/"
    },
    {
        "id": "1oskga3",
        "author": "scoreboard-app",
        "title": "Match Thread: Rayo Vallecano vs Real Madrid Live Score | LaLiga 25/26 | Nov 9, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1oskga3)",
        "upvotes": 137,
        "comments": 3841,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oskga3/match_thread_rayo_vallecano_vs_real_madrid_live/"
    },
    {
        "id": "1os7otj",
        "author": "SaniaXazel",
        "title": "On this day last year, Raúl Asencio debuted for Real Madrid and provided an assist just 12 minutes after coming off the bench",
        "content": "",
        "upvotes": 1120,
        "comments": 29,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5cjadcfg750g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1os7otj/on_this_day_last_year_raúl_asencio_debuted_for/"
    },
    {
        "id": "1otibj8",
        "author": "o6ohunter",
        "title": "Forget Xabi or the players, our fractured fanbase is an issue that must be addressed",
        "content": "Everyone thought the egos of the players would be the team’s downfall. Plausible, but unlikely. They know the club they’re playing for. They know the fellow superstars they’re playing for. I think they’re intelligent to know the whole is only as good as is parts and have been playing professional football long enough to know teamwork makes the dream work. It’s not the players I want to discuss today, but the FANS of the individual players. Go on social media, all you’ll see is Mbappe fans attacking Vini, Vini fans retaliating (and vice versa), then Arda fans jumping into the mix, with Jude fans ready to pounce as well. It’s a shitstorm. We as a fanbase need to get it together and start uniting under the badge, not the individual players.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1otibj8/forget_xabi_or_the_players_our_fractured_fanbase/"
    },
    {
        "id": "1os0u8a",
        "author": "Mysterious-Prune3309",
        "title": "I’m back with my fan made Real Madrid manga/comic Chapter II: 92:48",
        "content": "Hey friends, I’m back with the Chapter II of my RM manga. I can’t seem to say this enough, but I appreciate the support from you on the first chapter!\n\nThe making of these manga are very time consuming, from sketching, colouring, arranging to coming up with texts. Everything took longer than expected, but your support kept me motivated and pushed me through this process🫡\n\nI really do hope y’all like this one too, and I look forward to reading your feedback, post your criticism here too, I don’t mind as they’d help me improve. \n\nLike you see here, I’m receiving 0 financial support or generating any revenue off of my work. They are for your entertainment and made with my passion. \n\nI’ve never received any formal art training and is still learning and improving each page or panel. You can see the art style is inconsistent and changes here and there, so please bear with me. \n\nHappy to share here and appreciate everyone who read the first one! \n\n\n\n",
        "upvotes": 1043,
        "comments": 117,
        "media": null,
        "permalink": "/r/realmadrid/comments/1os0u8a/im_back_with_my_fan_made_real_madrid_mangacomic/"
    },
    {
        "id": "1otfyq8",
        "author": "DANKWINGS",
        "title": "The potential solution to Xabi being put under pressure to play certain players and some amateur tactical analysis",
        "content": "So it's quite clear through multiple media outlets that Xabi Alonso at Madrid is being forced to start multiple players. Notably it appears to be Vini Jr, Mbappe and Bellingham. I'd say Bellingham is the least pressured out of this bunch, but the most I'd say are clearly Vini and Mbappe. \n\nAfter a draw away in the league and a loss in the UCL to a struggling Liverpool, it appears Xabi may have bit off more than he could chew in terms of formations.\n\nI've spoken a lot about the formation used in the Liverpool game. Playing Vinicius at right mid stalling the transition. Lack of midfielders actively fighting for the ball yet again killing the transition. Easy opportunities for Liverpool to win set pieces by barely pressing and giving them limitless channels to run into and so forth. It appears that formation was completely wrong and Xabi underestimated the size of the game. Liverpool had just lost to Galatasary. A club of their magnitude could not afford to lose again, every time we had possession, we were too slow to transition and build. This allowed them to drop back into a 4-4-2 and defend. The formation that day killed the game, and anyone who puts it on the players needs to rewatch the game. There were certain players (Vini, Arda, Bellingham and Camavinga) who clearly looked out of position and didn't look as fluid as in their regular spots.\n\nThere's been a lot of talks about aerial threat and whilst this is a great talking point, it's being blown out of proportion. In last years UCL campaign, most goals were scored by foot, by a large margin. They do not have a tall aerial threat. Dembele is tall but by no means is he threatening defences aerially. He always prefers the ball at his feet. To address some other interesting statements, their entire front 3 was wingers, and they went on to win the UCL, and dominate top European sides at that. \n\nWhat I think Xabi needs to try if we want a striker option to make best use of Vinicius Jrs good crossing / passing ability from out wide. Not only will this improve Vini's game, but it'll improve Trent's too. As well as Tchouameni's, Militaos and Bellingham's.\n\n4-3-3 \n\nWe go with the usual back 4, Carreras, Huijsen, Militao / Asencio and instead of Valverde, Trent. \n\nIn the midfield, Guler, Bellingham and Tchouameni. \n\nUp top, Vini, Gonzalo, Mbappe. \n\nThis gives Trent the option to feed long, low balls out to Mbappe as he'll be on the right wing, like he did for Salah at Liverpool. Furthermore in long possession spells he can push up and deliver long balls into the box for Tchouameni, Gonzalo, Huijsen, Bellingham and Militao. Gonzalo's presence in the middle of the front 3 also provides options to Vinicius Jr as he is a touchline winger who thrives with the presence of a striker. We've seen Gonzalo and Vini link up in the past. Vini has also linked up with arguably one of the best 9's of our generation, he knows how to play around a striker. He contributed massively to Karim's Balon D'or charge. The 4-3-3 will prevent our players sitting too deep and will actually get us involved in the midfield battle, so we can play quick transition football rather than hold up the ball in our own 3rd after sitting back and surviving attacks. \n\nThis may not work, but I'd like to see it tested as it may answer a lot of options for us. With balance in the front 3, two quick wingers and a tall natural 9, bred from our own academy at that, we could become seriously threatening. This could be a much more reliable way of breaking down low blocks, occupying defenders and creating danger from every side of the pitch. Trent can overlap Mbappe if needed. Carreras can overlap Vini as he has been. \n\nI hope Xabi tries this out at some point as it could seriously result in some beautiful football. The best part? He hasn't got to bench anyone the board forces him to start.\n\nHala Madrid!\n",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1otfyq8/the_potential_solution_to_xabi_being_put_under/"
    },
    {
        "id": "1otfwxc",
        "author": "ksuvuelalfusuwnsl",
        "title": "We shouldn’t have let Modric go",
        "content": "We should’ve kept Modric for one more year\n\nOur Rayo starting 11 average age was 24.1. We lack experience and a deep lying playmaker. He wouldn’t need to play every game but we are missing him. He would’ve been important at Rayo in a champions league week. We got rid of him so we could buy Stiller or Zubi and we never did. Should’ve kept him until we sealed one of those deals. He would’ve still dropped masterclasses for us. Dropping Modric and keeping Ceballos was not wise. Even though Ceballos was a drama queen and we tried to move him on \n\nWe won’t bring modric back cuz it’s too late. But we need to bring in some experience. Maybe Bernardo Silva from City? Kimmich? Calhanoglu? Anyone over 30 who still plays regularly ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1otfwxc/we_shouldnt_have_let_modric_go/"
    },
    {
        "id": "1osxhbw",
        "author": "More-Judgment-9253",
        "title": "Stop blaming Mbappe for Vini's decrease in ability.",
        "content": "I keep seeing people say that mbappe's the reason why vini isn't performing as well as he used to, are we serious? When mbappe was in the worst form of his life last season, vini was still playing insanely well, and as a matter of fact that was probably his best start to a season (idk for sure, I don't feel like checking). My point is, vini was carrying this team at the beginning of last season but then after he got injured around november/ December, he's been nowhere near that level. Even in the CWC when he had Gonzalo next to him he was even worse than he is right now. His decision making has dropped significantly along with his passing, which is tragic but it's the truth. So blaming mbappe for that is just cope. Vini still has his good games every once in a while but in general he's been average for a whole year now, I hope he can bounce back but that might not happen.",
        "upvotes": 3,
        "comments": 96,
        "media": null,
        "permalink": "/r/realmadrid/comments/1osxhbw/stop_blaming_mbappe_for_vinis_decrease_in_ability/"
    },
    {
        "id": "1os6ccs",
        "author": "RM-PostMatchSurveys",
        "title": "[Post-Match Survey Results] Real Madrid 0-1 Liverpool",
        "content": "",
        "upvotes": 107,
        "comments": 91,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2tjta4zov40g1.png?auto=webp&amp;s=232a8832130b74b4c6a8f7adf4df6d63c4c8474a"
        },
        "permalink": "/r/realmadrid/comments/1os6ccs/postmatch_survey_results_real_madrid_01_liverpool/"
    },
    {
        "id": "1osiosb",
        "author": "Known_Appeal7699",
        "title": "Santiago bernabeu stadium premium tour vs normal",
        "content": "Hi, \nIm going to madrid tomorrow staying for a week and wanted to go and see the stadium, because of the international break there is no game at that time. \nCan some1 tell me how the tour actually looks (is all available like pitch entry etc.) and is it worth to buy premium guided tour, or classic one ? \n\n",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1osiosb/santiago_bernabeu_stadium_premium_tour_vs_normal/"
    }
]