[
    {
        "id": "1j4xlby",
        "author": "NightoftheZooAMA",
        "title": "Hi reddit! We are Ricardo Curtis and Rodrigo Perez-Castro. We are the co-directors of the animated horror-comedy NIGHT OF THE ZOOPOCALYPSE, out in theaters this week. We've also worked on films like The Incredibles, Monsters Inc, Ice Age, Rio, Angry Birds &amp; much more as animators/story artists. AMA!",
        "content": "",
        "upvotes": 14,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gyg3safs43ne1.png?auto=webp&amp;s=6fef86cba930c40f6c3eed6528ca3e8ca261af86"
        },
        "permalink": "/r/movies/comments/1j4xlby/hi_reddit_we_are_ricardo_curtis_and_rodrigo/"
    },
    {
        "id": "1j4vgj6",
        "author": "Puzzled-Tap8042",
        "title": "Roy Ayers, ‘Everybody Loves the Sunshine’ Musician and ‘Coffy’ Composer, Dies at 84",
        "content": "",
        "upvotes": 699,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_2zWJe6L9_kXSst2UEfhfZYbjbMPVKQ_R20I6fq0FJU.jpg?auto=webp&amp;s=0d5004d139e7915cef4daff657ccc9c6fcf47664"
        },
        "permalink": "/r/movies/comments/1j4vgj6/roy_ayers_everybody_loves_the_sunshine_musician/"
    },
    {
        "id": "1j4vxg0",
        "author": "NimdokBennyandAM",
        "title": "I wasted too much of my life having never watched Paddington 2.",
        "content": "This movie has no right to be this good. So damn charming. It's so delightfully unserious at moments and them wham, you get hit by such genuine and moving moments of love, care, and for some of the characters, redemption.\n\n\n\n\nThe entire prison sequence is perfection. Paddington makes prison nice. Marmalade sandwiches, planters in front of cells, and the jump cut from Paddington noticing the red sock in the laundry to the prisoners all wearing pink clothing is top tier.\n\n\n\n\nHugh Grant? Perfect.\n\n\n\n\nSorry, Paddington 2. I knew not of your perfection.\n\n\n\nOh, also, the post-credits scene of Hugh Grant leading the prison in a big Broadway number? ::chef's kiss::",
        "upvotes": 424,
        "comments": 103,
        "media": null,
        "permalink": "/r/movies/comments/1j4vxg0/i_wasted_too_much_of_my_life_having_never_watched/"
    },
    {
        "id": "1j4s26r",
        "author": "amberlouiseb",
        "title": "'The Ugly Stepsister': Director Emilie Blichfeldt on reframing Cinderella as body horror",
        "content": "",
        "upvotes": 663,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vQlvVaUENZ_HKvt-JPVVoZdqKfY7tkGoHy9_DijAu-o.jpg?auto=webp&amp;s=8b2e06ef40c8496d69072efcc421282a68330ace"
        },
        "permalink": "/r/movies/comments/1j4s26r/the_ugly_stepsister_director_emilie_blichfeldt_on/"
    },
    {
        "id": "1j4vuq7",
        "author": "mbroda-SB",
        "title": "Pulp Fiction Question I’ve Pondered for 30 Years",
        "content": "So, Butch and Marcellus reach their truce after the “event” in the basement of the pawn shop, leaving Butch conditionally safe from Wallace’s retribution.  Do we think Marcellus may have changed his mind after finding out Butch killed Vincent in his apartment, or would Marcellus just consider this the cost/risk of doing business?\n\nSince it’s established that Marcellus and Vincent have a bit more of a professional relationship and seem to have some level of trust and friendship beyond business, would Butch ever truly be safe even if he stays out of LA?\n",
        "upvotes": 176,
        "comments": 182,
        "media": null,
        "permalink": "/r/movies/comments/1j4vuq7/pulp_fiction_question_ive_pondered_for_30_years/"
    },
    {
        "id": "1j46sx6",
        "author": "ChocolateOrange21",
        "title": "'Movies don't change but their viewers do': Movies that hit differently when you watch them at an older age.",
        "content": "Roger Ebert had this great quote about movies and watching them at different points in your life. Presented in full below.\n\n“Movies do not change, but their viewers do. When I saw La Dolce Vita in 1960, I was an adolescent for whom “the sweet life” represented everything I dreamed of: sin, exotic European glamor, the weary romance of the cynical newspaperman. When I saw it again, around 1970, I was living in a version of Marcello’s world; Chicago’s North Avenue was not the Via Veneto, but at 3 a.m. the denizens were just as colorful, and I was about Marcello’s age.\n\nWhen I saw the movie around 1980, Marcello was the same age, but I was 10 years older, had stopped drinking, and saw him not as a role model but as a victim, condemned to an endless search for happiness that could never be found, not that way. By 1991, when I analyzed the film a frame at a time at the University of Colorado, Marcello seemed younger still, and while I had once admired and then criticized him, now I pitied and loved him. And when I saw the movie right after Mastroianni died, I thought that Fellini and Marcello had taken a moment of discovery and made it immortal.”\n\n\\*\\*\n\nWhat are some movies that had this effect on you? Based on a previous discussion, 500 Days of Summer was one for me. When I first watched it, I just got out of a serious relationship, and Tom resonated with me. Rewatching it with some time, I realized Tom was flawed, and he was putting Summer on a pedestal and not seeing her as a person.\n\nDiscuss away!\n\n",
        "upvotes": 6253,
        "comments": 2280,
        "media": null,
        "permalink": "/r/movies/comments/1j46sx6/movies_dont_change_but_their_viewers_do_movies/"
    },
    {
        "id": "1j4lqwx",
        "author": "parkergallery",
        "title": "Movies where everything is a lie",
        "content": "Hi! I wanted some recommendations of movies like The Truman Show and Matrix where the main character just finds out that their reality is not real. Not necessarily movies where the character is being watched (like The Hunger Games), but movies where they didn't know and then found out.\n\nI know that asking for those recommendations is asking for spoilers but in this case i don't mind. \n\nEDIT: Thank you some much everyone!! I never expected this post to get so much attention and answers! I will make sure to watch everything and look back at the discussions! xx",
        "upvotes": 481,
        "comments": 837,
        "media": null,
        "permalink": "/r/movies/comments/1j4lqwx/movies_where_everything_is_a_lie/"
    },
    {
        "id": "1j4mzjy",
        "author": "one_pound_of_flesh",
        "title": "The Big Lebowski",
        "content": "Is it a perfect movie? It was a cult favorite in college. But giving it a rewatch and more analysis - the cast is entirely GOATS. The soundtrack. The editing. The cinematography of Roger Deakins. There is no wasted shot. \n\nThe script is funny and tight. It is absurd, self referential, a play. \n\nThe film more than holds up. ",
        "upvotes": 366,
        "comments": 186,
        "media": null,
        "permalink": "/r/movies/comments/1j4mzjy/the_big_lebowski/"
    },
    {
        "id": "1j4d0m1",
        "author": "NoCulture3505",
        "title": "Kathryn Newton Reteaming With Radio Silence For Searchlight’s ‘Ready Or Not’ Sequel",
        "content": "",
        "upvotes": 1348,
        "comments": 86,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5jbTh4jQtO5MBBwk6VO4MRizseNL5leF0KfJB1W8XUI.jpg?auto=webp&amp;s=9d5637a145d4005e3644b8b6e34f1f723aab5c57"
        },
        "permalink": "/r/movies/comments/1j4d0m1/kathryn_newton_reteaming_with_radio_silence_for/"
    },
    {
        "id": "1j4m8gy",
        "author": "Visual-Coyote-5562",
        "title": "Why do non-closed captioned subtitles no longer exist as an option on streaming?",
        "content": "When DVDs came out, many offered both closed captions and subtitles as an option.  In fact people would complain if subtitles weren't included.  You see, subtitles don't include words indicating sound effects, noises, or music and are much less intrusive than closed captions which are designed for people who are hard of hearing.   However from what I can tell subtitles outside of foreign titles no longer exist.  It seems like this would be such an easy thing to facilitate with current technology.  Is there a reason for it?",
        "upvotes": 306,
        "comments": 100,
        "media": null,
        "permalink": "/r/movies/comments/1j4m8gy/why_do_nonclosed_captioned_subtitles_no_longer/"
    },
    {
        "id": "1j4b0bc",
        "author": "DemiFiendRSA",
        "title": "‘Jaws’ Swims Back Into Theaters This Summer for 50th Anniversary on August 29",
        "content": "",
        "upvotes": 1337,
        "comments": 94,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YxzVKLqbhd2LhQDO1u-S0n9fOOJqqjOz9EzazTaG9fc.jpg?auto=webp&amp;s=d1531c974113396245b6cf1cec4c6b920599a992"
        },
        "permalink": "/r/movies/comments/1j4b0bc/jaws_swims_back_into_theaters_this_summer_for/"
    },
    {
        "id": "1j4q0mw",
        "author": "Torley_",
        "title": "Tom Hanks singing Talking Heads' \"Once in a Lifetime\"... same as it ever was (from A HOLOGRAM FOR THE KING)",
        "content": "",
        "upvotes": 135,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-pXndi4Ee34eHW9hJQSGywyN3J4RHP0XFFZkHJps9ZU.jpg?auto=webp&amp;s=0f36f45b1fe438647dbee38caed2d9a23757d957"
        },
        "permalink": "/r/movies/comments/1j4q0mw/tom_hanks_singing_talking_heads_once_in_a/"
    },
    {
        "id": "1j49cyv",
        "author": "LunchyPete",
        "title": "Captain America Co-Creator Jack Kirby Getting Definitive Documentary ‘Kirbyvision’",
        "content": "",
        "upvotes": 1244,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YNSVr2XSJpXmmxgqnwiWG85zJ7tBuKGIYY8NZg6-DWE.jpg?auto=webp&amp;s=fe5160167ee38373b0fa74b4196a201724933daa"
        },
        "permalink": "/r/movies/comments/1j49cyv/captain_america_cocreator_jack_kirby_getting/"
    },
    {
        "id": "1j4ukq9",
        "author": "zeusakash",
        "title": "What is a movie released on or after 2015 that you have watched multiple times",
        "content": "I'm asking to find the most rewatchable movies released in this decade, and I'd love your input! There are certain films that draw us in every time, whether due to their captivating storylines, incredible performances, or simply how comforting they are to watch again and again and im tired of seeing the same Jurassic Park,Matrix,Alien answers. I want to know which relatively new films you just can’t get enough of. What makes them so special for you? Share your thoughts and help build a list of films of the decade that are truly rewatchable!",
        "upvotes": 41,
        "comments": 351,
        "media": null,
        "permalink": "/r/movies/comments/1j4ukq9/what_is_a_movie_released_on_or_after_2015_that/"
    },
    {
        "id": "1j4y6wb",
        "author": "ChiefLeef22",
        "title": "Steven Soderbegh's 'Black Bag' - Review Thread",
        "content": "Soderbergh fans are eating good this year.\n\n**Rotten Tomatoes:** [94%](https://www.rottentomatoes.com/m/black_bag)\n\n**Metacritic:** [86/100](https://www.metacritic.com/movie/black-bag/)\n\nSome Reviews:\n\n[The Independent - Clarisse Loughrey](https://www.independent.co.uk/arts-entertainment/films/reviews/black-bag-review-steven-soderbergh-michael-fassbender-b2710141.html)\n\n&gt;While the supporting cast are impeccable across the board, it’s really Blanchett and Fassbender’s film to command, with performances that drip with old-school star power. Fassbender, when he delicately adjusts his glasses or cuffs, evokes the sly, chilled elegance of a Michael Caine or Dirk Bogarde, but with a sliver of vulnerability in the eyes that really begs the question of what exactly is going on in that head of his.\n\n[Screen Daily - Tim Grierson](https://www.screendaily.com/reviews/black-bag-review-fassbender-blanchett-spy-up-a-storm-for-steven-soderbergh/5202447.article)\n\n&gt;Highly entertaining from start to finish, the film benefits from David Koepp’s inventive screenplay and Soderbergh’s storytelling swagger.\n\n[The Daily Beast - Nick Schager](https://www.thedailybeast.com/obsessed/black-bag-review-the-sleek-sexy-spy-thriller-movie-theaters-need/)\n\n&gt;When it comes to sleek, stylish genre movies, Soderbergh remains a maestro at the top of his game. A spy thriller that feels like a cross between John le Carré and Agatha Christie, the director’s latest—written, as was his prior [*Presence*](https://www.thedailybeast.com/obsessed/presence-review-steven-soderbergh-does-his-own-haunted-house-movie/), by Oscar-winning screenwriter David Koepp—is at once clipped and fluid, as sharp as a dagger and as silky as luxury bedsheets.\n\n[The Wrap - William Bibbiani](https://www.thewrap.com/black-bag-review-steven-soderbergh-michael-fassbender-cate-blanchett/)\n\n&gt;Human weakness is 'Black Bag’s' greatest strength. It’s an insidiously great spy movie, mature and satisfying. “Black Bag” digs into the superficially erogenous spy genre and finds inside it a desperate need for therapy. It’s an intricately intertwined tale of sexual strife and political machinations, and a strong reminder at the heart of every drama, personal or political, there’s human weakness.\n\n[TIME - Stephanie Zacharek](https://time.com/7264825/black-bag-review-steven-soderbergh/)\n\n&gt;Black Bag succeeds on its chilly wit, and on the cool, nervy appeal of its two stars. Blanchett strides through the movie with lioness grace; Fassbender makes George’s robotic use of logic seem like an aphrodisiac.\n\n[IGN - Siddhant Adlakha ](https://www.ign.com/articles/black-bag-review-michael-fassbender-cate-blanchett-steven-soderbergh)\n\n&gt;Its story of three couples working at the same British agency turns all the right screws with impeccable timing, forcing its characters to examine the flaws in their relationships as its tale of state secrets gradually unravels. A film that projects domestic anxieties onto the espionage genre, Steven Soderbergh’s Black Bag is a slick, self-assured, wildly entertaining spy thriller about a husband-wife intelligence duo forced to question their trust.\n\n[Variety - Peter Debruge](https://variety.com/2025/film/reviews/black-bag-review-steven-soderbergh-cate-blanchett-michael-fassbender-1236329004/)\n\n&gt;Steven Soderbergh dashes off a sleek little genre exercise -- a doodle really, at a stage in his career when he’s clearly just having fun -- that proves to be one of his smartest and sexiest films yet.\n\n[Deadline - Pete Hammond](https://deadline.com/2025/03/black-bag-review-michael-fassbender-cate-blanchett-spies-steven-soderberghs-stylish-thriller-1236311971/)\n\n&gt;With an A+ cast at the top of their game, a tight 93 minute running time, and dialogue with wit and bite, this finds the director with one of his best opportunities to do what he does so well and give that older audience a reason to go back to the movies.\n\n[The Guardian - Peter Bradshaw](https://www.theguardian.com/film/2025/mar/07/black-bag-review-michael-fassbender-and-cate-blanchett-intrigue-in-marital-espionage)\n\n&gt;Steven Soderbergh’s downbeat, affectless tongue-in-cheek spy comedy (“caper” isn’t quite right) is in this new mode, though taking itself to the edge of self-satire, with a few 007 refugees in the cast, efficiently scripted by David Koepp.",
        "upvotes": 20,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LyN55qdE08G2QXtXUUU6_XF_EYmp7m-1vTJKKvl17to.jpg?auto=webp&amp;s=c004dd939ecdb775b3887c4e64d45fb16bc8669c"
        },
        "permalink": "/r/movies/comments/1j4y6wb/steven_soderbeghs_black_bag_review_thread/"
    },
    {
        "id": "1j48ukw",
        "author": "Fun_Protection_6939",
        "title": "Can we appreciate Quentin Tarantino's casting for the Manson family members in Once Upon a Time.....in Hollywood?",
        "content": "One an Oscar winner (Mikey Madison), the other an Oscar nominee (Austin Butler), another's Oscar nomination is a case of when, not if (Margaret Qualley), Maya Hawke who has been doing incredible work and had one of the biggest successes of the year in Inside Out 2.......and then there's Sydney Sweeney. ",
        "upvotes": 1078,
        "comments": 265,
        "media": null,
        "permalink": "/r/movies/comments/1j48ukw/can_we_appreciate_quentin_tarantinos_casting_for/"
    },
    {
        "id": "1j4iwl3",
        "author": "Rigamortus2005",
        "title": "Greatest actors without an Oscar win?",
        "content": "It's quite insane the number of legeendary actors without an oscar win for acting. If i had to list off the top of my head I'd personally say Ralph Fiennes, Jake Gyllenhaal,  Edward Norton, Samuel L Jackson, Liam neeson , Johnny Depp, ian mckellen and even willem defoe. Curious to see who else you guys have up there.   ",
        "upvotes": 235,
        "comments": 726,
        "media": null,
        "permalink": "/r/movies/comments/1j4iwl3/greatest_actors_without_an_oscar_win/"
    },
    {
        "id": "1j4z9t1",
        "author": "ChiefLeef22",
        "title": "David Lynch to Be Celebrated by World Soundtrack Awards | Belgian Film Fest Gent and the World Soundtrack Academy will honor the memory of David Lynch by having young composers score an excerpt from the late auteur’s “The Elephant Man” as part of their annual Film Music Composition Contest",
        "content": "",
        "upvotes": 13,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/U4MMOgRUhYx8Gls_UDIdAEV533bfdZRTXGda4JLCWaY.jpg?auto=webp&amp;s=a992d919a45d10ce8377aba1f423583af7d436e0"
        },
        "permalink": "/r/movies/comments/1j4z9t1/david_lynch_to_be_celebrated_by_world_soundtrack/"
    },
    {
        "id": "1j4514g",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Accountant 2'",
        "content": "",
        "upvotes": 1256,
        "comments": 292,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ldhor3tmyvme1.jpeg?auto=webp&amp;s=3cbdaa867060d4075fca5d50d555523a645e2080"
        },
        "permalink": "/r/movies/comments/1j4514g/new_poster_for_the_accountant_2/"
    },
    {
        "id": "1j4w4te",
        "author": "kassiusx",
        "title": "‘A certain kind of chaos’: Errol Morris unpacks Charles Manson theories",
        "content": "",
        "upvotes": 18,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ucXs_l-zYrpzwbVTLLsLPCEi64bXmZJpCIfCHLbSH0E.jpg?auto=webp&amp;s=3d182f83b23aa437098cd8ac2aa82786378776f7"
        },
        "permalink": "/r/movies/comments/1j4w4te/a_certain_kind_of_chaos_errol_morris_unpacks/"
    },
    {
        "id": "1j4lqdi",
        "author": "Spare_Ad6800",
        "title": "What movie totally changed the way you look at life?",
        "content": "We all have that one movie that hit us so hard, we walked out of the theater (or finished it on Netflix) with our minds completely blown. For me, it was The Pursuit of Happyness. The way it explored the struggle of never giving up, even when life is constantly knocking you down, changed the way I view perseverance and resilience. I honestly didn’t expect to get so emotional over it.\n\nSo I’m curious – which movie had a similar effect on you? The one that changed your perspective or made you see the world a little differently? Let’s hear those life-altering cinematic experiences! 🎬💥",
        "upvotes": 141,
        "comments": 375,
        "media": null,
        "permalink": "/r/movies/comments/1j4lqdi/what_movie_totally_changed_the_way_you_look_at/"
    },
    {
        "id": "1j3uct4",
        "author": "Sabiancym",
        "title": "Dad gets up during every movie without pausing.",
        "content": "My dad always does something I've only ever heard of people occasionally doing. No matter what movie or TV show he's watching at home, he will get up in the middle of it and with zero urgency, go to the bathroom, grab food, look out the window, or do any number of random things, all without pausing.  He'll then sit back down having missed 5-20 minutes without saying a word and never asks questions after the movie. \n\nIt used to drive me nuts when I lived at home over a decade ago and recently I stayed over one night and watched him do the same thing.  My mom doesn't even bother asking if she should pause. \n\nQuality doesn't matter either. It could be the greatest movie he's ever seen, but he'll still miss 10 minutes of it doing whatever. I've seen him take out the garbage, cook popcorn on the stovetop, and even fold laundry in another room all while a movie he wanted to watch was playing. \n\nThis is insane right? I understand not being in to a movie and getting bored, but in my 30+ years I've never seen or heard of him sitting through an entire movie.  This is the same guy who can sit on the porch for an hour or two doing nothing. I don't understand. \n\nTo be clear, I'm not trying to change him or anything. I just truly don't understand and want to see if anyone else knows someone like this.  \n&amp;nbsp;  \n****EDIT**** People keep saying it's about spending time with others or not wanting to interrupt. It's just my mom and dad at home, and if they disagree on what to watch she'll go upstairs to watch something while he watches what he wants alone....but still gets up without pausing.",
        "upvotes": 12196,
        "comments": 4412,
        "media": null,
        "permalink": "/r/movies/comments/1j3uct4/dad_gets_up_during_every_movie_without_pausing/"
    },
    {
        "id": "1j4wz4v",
        "author": "fleas_be_jumpin",
        "title": "Biggest Difference Between Beginning and End?",
        "content": "I'm looking for movies that have an insane contrast between how they start and how they end. Like if you were to plot how crazy things get on a graph, you would need the absolute tallest graph to demonstrate this difference. I don't necessarily mean movies with the craziest endings (although some of those may happen to fit this incidentally). I mean movies that start so slow and uneventful that you have no idea or even a hint at just how batshit insane it gets by the end. ",
        "upvotes": 11,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1j4wz4v/biggest_difference_between_beginning_and_end/"
    },
    {
        "id": "1j4crrc",
        "author": "indiewire",
        "title": "Neon Chief Says Netflix Is Their 'Biggest Competitor'",
        "content": "",
        "upvotes": 293,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/juSF6Seu2kFJBdL_TMzShhygn8aDjf50n_8EKrVvR0Q.jpg?auto=webp&amp;s=7d37a1c85600fbe5958518cfe1e44bd35cab671e"
        },
        "permalink": "/r/movies/comments/1j4crrc/neon_chief_says_netflix_is_their_biggest/"
    },
    {
        "id": "1j4ccrt",
        "author": "DemiFiendRSA",
        "title": "‘Monopoly’ Movie From Lionsgate And LuckyChap Lands John Francis Daley And Jonathan Goldstein As Writers",
        "content": "",
        "upvotes": 299,
        "comments": 89,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4VC_ft9CFWKQSr-cTbxeCoRlv3hsbwT3yILQ9b4kss4.jpg?auto=webp&amp;s=ed617534d769e2ed03ef137cc0023b8594aff50e"
        },
        "permalink": "/r/movies/comments/1j4ccrt/monopoly_movie_from_lionsgate_and_luckychap_lands/"
    },
    {
        "id": "1j43fjg",
        "author": "CloseCalls4walls",
        "title": "I appreciate how openly emotional the men were in Godzilla Minus One",
        "content": "This was an interesting action movie experience for me. It was good! Something especially notable was how men interacted with each other, being sensitive toward each other and openly expressing their emotions, crying lots of times. It was a refreshing departure from American media where I honestly just don't see anything like it happening. \n\nTypical gender norms sadden me. It's like years of cultural norms have stunted people's growth in so many ways when they otherwise could be processing their emotions in more authentic and likely healthier ways. Here in GMO you see companionship and empathy and it really displays an openness to the way the characters functioned as people. It was almost off-putting, yet their actions would perhaps be true to life, under those circumstances. ",
        "upvotes": 763,
        "comments": 113,
        "media": null,
        "permalink": "/r/movies/comments/1j43fjg/i_appreciate_how_openly_emotional_the_men_were_in/"
    },
    {
        "id": "1j4z2tl",
        "author": "swordsandspicywings",
        "title": "At-home date night movie recommendations?",
        "content": "Hey, everyone! My gf and I just completed an 8 week fitness challenge and tonight we’re loading up on junk food and watching a movie. \n\nWe were thinking Smile 2, but I’d love to get some recommendations for other newer releases (last couple of years). We’re big fans of thrillers/mysteries, but all genres are on the table aside from heavy dramas. We also enjoy foreign films!\n\nLooking forward to any recommendations you might have. ",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1j4z2tl/athome_date_night_movie_recommendations/"
    },
    {
        "id": "1j47x1t",
        "author": "Task_Force-191",
        "title": "Gunslingers (2025) Official Trailer - Stephen Dorff, Heather Graham, Nicolas Cage, Scarlet Stallone",
        "content": "",
        "upvotes": 353,
        "comments": 181,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XuZJp9D_4z5Lj0aFblc5GFPcS_MUvnPoVdYrkwimd8A.jpg?auto=webp&amp;s=281292c49315557c6fc4dbf8c34eba512f555cb0"
        },
        "permalink": "/r/movies/comments/1j47x1t/gunslingers_2025_official_trailer_stephen_dorff/"
    },
    {
        "id": "1j4jdbl",
        "author": "Educational-Leg-9466",
        "title": "watched an oscar-nominated movie at home and suddenly… krasnystaw?! the universe is playing tricks on me",
        "content": "okay, this is actually insane. a real pain, starring Jesse Eisenberg, was filmed in Krasnystaw, Poland a town that even most of my polish friends have never heard of (I’m Polish and I live in Poland) and yet, this small, random place somehow became the setting for an oscar-nominated movie. \n\nbut here’s where it gets even wilder. i was just watching the movie at home, totally unprepared, when suddenly they showed the welcome sign with “krasnystaw” by the end of the scene e. i literally froze. this was the krasnystaw, the place my grandma and mom are from. this is a place that’s such an enormous part of my childhood, just thinking about it makes me instantly nostalgic. just for context, I still live in Poland but 450km (280 miles) west of Krasnystaw. back in the day (omg i’m so old) it took around 9/10 hours to get there. it’s like a fairytale land for me \n\ndid quick research and i found out that Jesse Eisenberg grandma was from there too, i just lost it. i started crying so much. like, what are the actual odds? i had no idea this movie would be so personally significant. it felt like some invisible string was connecting everything, or some massive glitch in my matrix occurred.\n\nand just when i thought it couldn’t get any weirder I just found out that the movie premiered in Krasnystaw on November 8, 2024… which was my 30th birthday. i literally don’t know what to do with this information. this is actually too absurd when you think about it.\n\nis this real life?? Kieran received an actual oscar??? has anyone else had a moment where the universe just casually threw a personal plot twist at them like this? do you know if I can somehow talk to Jesse? what is going on?",
        "upvotes": 79,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1j4jdbl/watched_an_oscarnominated_movie_at_home_and/"
    },
    {
        "id": "1j4aup6",
        "author": "NoCulture3505",
        "title": "Matthew Modine Boarding Next Legendary 'Monsterverse' Film",
        "content": "",
        "upvotes": 228,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SafD_ztD9FOqw_-WYg8Ksa_k64Yk8Pj2Gu_fGG7m4uQ.jpg?auto=webp&amp;s=877a331a5d8b78afd6d33d13209a88857a5400ad"
        },
        "permalink": "/r/movies/comments/1j4aup6/matthew_modine_boarding_next_legendary/"
    },
    {
        "id": "1j4ri3m",
        "author": "acefreemok",
        "title": "The volume of ads for Mickey 17 has been incredible.",
        "content": "Has everyone else been subjected to an incredible barrage of advertising for Mickey 17? I never seen  anything like it. I would guess I've been subjected to the trailer (or associated advertising) at least 200 times, whether it be on reddit, at the cinema, watching sport on streaming services and through other means. I'm located in Australia btw.\nThe funny thing is, I specifically avoid trailers, and was always keen to see this movie. What I don't get is that the advertising spend thrown in my direction must far exceed the revenue of going to the cinema. Has everyone else been seeing the same thing? ",
        "upvotes": 15,
        "comments": 59,
        "media": null,
        "permalink": "/r/movies/comments/1j4ri3m/the_volume_of_ads_for_mickey_17_has_been/"
    }
]