[
    {
        "id": "1qab4e3",
        "author": "RM_Official_Thread",
        "title": "Post Match Thread : Barcelona vs Real Madrid, Supercopa de España, Final",
        "content": "We lost.\n\n  \nOur subs were bad.",
        "upvotes": 188,
        "comments": 1027,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qab4e3/post_match_thread_barcelona_vs_real_madrid/"
    },
    {
        "id": "1q4isk5",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 20,
        "comments": 3383,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q4isk5/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1qa926j",
        "author": "No-Independent2522",
        "title": "Vini equalizes 1-1 Barcelona",
        "content": "",
        "upvotes": 1403,
        "comments": 138,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/68lcur9ayrcg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qa926j/vini_equalizes_11_barcelona/"
    },
    {
        "id": "1qa96lb",
        "author": "No-Independent2522",
        "title": "Gonzalo garcia equalizes 2-2 Barcelona",
        "content": "",
        "upvotes": 1032,
        "comments": 101,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/z1b8jyq4zrcg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qa96lb/gonzalo_garcia_equalizes_22_barcelona/"
    },
    {
        "id": "1qa9gfv",
        "author": "Ready_Ad_1353",
        "title": "Vini’s amazing solo effort goal from the stands",
        "content": "",
        "upvotes": 991,
        "comments": 56,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/burouhow0scg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qa9gfv/vinis_amazing_solo_effort_goal_from_the_stands/"
    },
    {
        "id": "1qaanwi",
        "author": "Derindown",
        "title": "Endrick scores in his first appearance at Lyon",
        "content": "",
        "upvotes": 534,
        "comments": 67,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qaanwi/endrick_scores_in_his_first_appearance_at_lyon/"
    },
    {
        "id": "1qa9arl",
        "author": "madrid57911",
        "title": "With his goal today, Vinicius becomes joint-all time Real Madrid top G/A provider in finals. Big-Game Player🔥🔥🔥",
        "content": "16 G/A total",
        "upvotes": 532,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ain3sjpuzrcg1.png?auto=webp&amp;s=087728fb6783d99fb115d23bbcc22d0241bfea62"
        },
        "permalink": "/r/realmadrid/comments/1qa9arl/with_his_goal_today_vinicius_becomes_jointall/"
    },
    {
        "id": "1qabwww",
        "author": "cyrusmancub",
        "title": "Xabi Alonso: “Vini asked me to sub him off. He had cramps.”",
        "content": "",
        "upvotes": 394,
        "comments": 103,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qabwww/xabi_alonso_vini_asked_me_to_sub_him_off_he_had/"
    },
    {
        "id": "1qaddi0",
        "author": "Fit_Wrap_9580",
        "title": "Man this fanbase is so shit, When we lose #XabiOut, When we win #Hala Madrid, bunch of kids, LMAO",
        "content": "Why are we panicking, its not the end of the world, its just a narrow win and very lucky goal, but that's how it is, Yeah we lost the final and it hurts, but we played our best, look on the bright side, we managed to pin Barca down even with their full squad active, only leaving out Gavi, but we played like we are Real Madrid, look at our squad, we have Mbappe coming on as a Sub, No pure Right Back, and Many lack of Defensive players, but we played really well.\n\n  \nShit happens, just say F\\*\\*\\* and restart, thats it, we are Real Madrid and we always come back, And Dont say #Xabi Out or #Vini Out, that's not the time.\n\nI mean yeah Xabi took Vini out, but as he said in Media, Vini had cramps.\n\nSo Fuck It, We are Real Madrid, And We will be with our team till the end. ",
        "upvotes": 247,
        "comments": 81,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qaddi0/man_this_fanbase_is_so_shit_when_we_lose_xabiout/"
    },
    {
        "id": "1qa3sao",
        "author": "dark4403",
        "title": "Yesterday, Xabi Alonso said that Vinícius needed support, and today we've all decided that in the 7TH MINUTE we're going to chant his name 🥹🤍👏🏻",
        "content": "",
        "upvotes": 667,
        "comments": 57,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/nj656gx7zqcg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qa3sao/yesterday_xabi_alonso_said_that_vinícius_needed/"
    },
    {
        "id": "1qa9fui",
        "author": "Pallav_Pokhrel",
        "title": "Couldn't have written any better",
        "content": "",
        "upvotes": 184,
        "comments": 7,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t32xup7t0scg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qa9fui/couldnt_have_written_any_better/"
    },
    {
        "id": "1q9yuhg",
        "author": "Ill-Improvement-8670",
        "title": "Mbappe once he heard we are facing barca",
        "content": "",
        "upvotes": 611,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/weqbrb7yxpcg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1q9yuhg/mbappe_once_he_heard_we_are_facing_barca/"
    },
    {
        "id": "1qaerbb",
        "author": "cyrusmancub",
        "title": "Madrid’s results in Xabi Alonso’s first 34 matches: 24 wins, 4 draws, 6 losses. Barça’s results in Hansi Flick’s first 34 matches: 24 wins, 4 draws, 6 losses.",
        "content": "",
        "upvotes": 86,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qaerbb/madrids_results_in_xabi_alonsos_first_34_matches/"
    },
    {
        "id": "1qada7o",
        "author": "TheFeatherDiaries",
        "title": "[Fotmob] With only 97 passes made in FIRST 52 minutes, having 24 percent possession, Real Madrid recorded the least amount of possession in a single half since 2010.",
        "content": "",
        "upvotes": 87,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zjlb1yfzqscg1.png?auto=webp&amp;s=5d9294e71fa2ebe472855b563d7cf32d4bf97b7f"
        },
        "permalink": "/r/realmadrid/comments/1qada7o/fotmob_with_only_97_passes_made_in_first_52/"
    },
    {
        "id": "1qa7g8i",
        "author": "No-Independent2522",
        "title": "Match Thread : Barcelona vs Real Madrid, Supercopa de España, Final",
        "content": "***FULL TIME***\n\n# BARCELONA (3) - REAL MADRID (2)\n\n# Goalscorer : Raphina (36', 73'), Vini (45'+2'), Lewandowski (45'+4'), Gonzalo (45'+6')\n\n***Cards*** **:** 🟨 ***Asencio, Valverde, Eric Garcia, Carr***ers, ***Flick, P***edri\n\n🟥***De Jo***ng\n\n***Subs:***\n\n***Barcelona:***\n\n***Fermin, Lewandowski OUT.***\n\n***Ferran, Olmo IN.***\n\n***Madrid:***\n\n***Arda Güler is ON. Fede Valverde is OFF.***\n\n***Gonzalo, Huijsen are OFF.***\n\n***Mbappe, Alaba are ON.***\n\n***Camavinga, Vini are OFF.***\n\n***Ceballos, Mastantuono are ON.***\n\nWill update score Manually please don't forget to SORT by NEW for latest comments\n\n[ https://www.sofascore.com/football/match/real-madrid-barcelona/rgbsEgb#id:15335105 ](https://www.sofascore.com/football/match/real-madrid-barcelona/rgbsEgb#id:15335105)\n\nCreating this UnOfficial match thread, as I do not see an official one, I assume the bot is down. Please delete this mods if we have an official thread. In meantime lets keep this thread for all updates regarding todays match.",
        "upvotes": 162,
        "comments": 8667,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qa7g8i/match_thread_barcelona_vs_real_madrid_supercopa/"
    },
    {
        "id": "1q9uggr",
        "author": "No-Independent2522",
        "title": "Carvajal turns 34 today 🎉. If he wins tonight, he would equal Luka Modrić as the most decorated player in Real Madrid history.",
        "content": "",
        "upvotes": 808,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7zo7f2x3oocg1.jpeg?auto=webp&amp;s=b80cb6a0f052b74292d21f03614ee6122776e749"
        },
        "permalink": "/r/realmadrid/comments/1q9uggr/carvajal_turns_34_today_if_he_wins_tonight_he/"
    },
    {
        "id": "1qadogr",
        "author": "Scary-Procedure-6018",
        "title": "Blame no one but the medical/fitness team.",
        "content": "Injures and missed chances is yet again the reason we lose a crucial game.\n\nThis game was correctly directed by xabi from start to finish...Everything made sense, first 15 minutes we had 2 big 1v1 chances that were stupidly missed (we love passing the ball to joan garcia), which then led to the raphinha goal.\n\nVini was very good in the first half, becuase his main aim was to attack and press tf out of kounde (which he succeeded at), but then came the second half where we missed more than 6 1v1 chances because of how reckless our finishing is. Our players have SBT syndrome (Shoot before thinking syndrome), no one sees the net when they want to shoot in tight situations, they just air it and hope for the best. We could have the most perfect build up play in years and our attackers somehow always fail to finish it, even when they're right infront of the goal\n\nOur midfield in terms of composure was shyte, but in terms of getting the ball to the final third and work rate they were actually decent. the 2 chances we missed in the first 20 minutes is the first reason why we lost this game. I really cant blame anyone rn, everyone did their job.\n\nThe subs by xabi were nothing but common sense, valverde was clearly limping a bit and was already booked, thats just what every manager with a brain would do. Vini was subbed off because he was clearly tired, he was letting way too many passes go through and was jogging while losing 3-2 instead of pressing.\n\nFinal review: Solid game in terms of work rate (especially jude and cama), but i must repeat, the chances missed has really let us down again, In the first 20 minutes and the last ones, all of those chances ended up in a state where our player passes the ball to joan garcia, and it happened 3 times in the last 2 minuts alone. And i repeat injuries is the MAIN reason why we lost today, xabi orchestrated the perfect plan with the little options he had. And the missed chances were just the chillies on top.\n\nPS: Our defense has been shit for almost 3 years now, there is no point of me writing the same sh\\*t after every game, just act like i crashed out about it again.",
        "upvotes": 52,
        "comments": 21,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qadogr/blame_no_one_but_the_medicalfitness_team/"
    },
    {
        "id": "1qa616w",
        "author": "cyrusmancub",
        "title": "Amended Starting Lineup v. Barça. Gonzalo starts instead of Arda",
        "content": "",
        "upvotes": 121,
        "comments": 95,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qa616w/amended_starting_lineup_v_barça_gonzalo_starts/"
    },
    {
        "id": "1qa6sxr",
        "author": "cyrusmancub",
        "title": "Tchouameni is expected to play CB tonight alongside Huijsen with Asencio at RB. Valverde will play in midfield.",
        "content": "",
        "upvotes": 92,
        "comments": 54,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qa6sxr/tchouameni_is_expected_to_play_cb_tonight/"
    },
    {
        "id": "1qa0zlb",
        "author": "DamnThatsInsaneLol",
        "title": "Madrid's lineup vs Barca: Vini &amp; Rodrygo on the wings, Mbappé or Gonzalo as striker. Rüdiger is expected to start despite his muscle issues. Mendy's calf problems make him a doubt. Valverde will line up at RB, with Tchouaméni &amp; Camavinga at CM. Bellingham will be the link between midfield &amp; attack",
        "content": "",
        "upvotes": 176,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XCSoLJBjdV34OgSVAoLR9Zp-5x2zLxsFd6zCZdbpMps.jpeg?auto=webp&amp;s=14bc105311aefe075ff0749ce06e6dadb3202e75"
        },
        "permalink": "/r/realmadrid/comments/1qa0zlb/madrids_lineup_vs_barca_vini_rodrygo_on_the_wings/"
    },
    {
        "id": "1qa6dp8",
        "author": "cyrusmancub",
        "title": "The starting lineup was always set to feature Gonzalo Garcia instead of Arda Güler. Güler’s inclusion in the initial lineup was a mistake.",
        "content": "",
        "upvotes": 59,
        "comments": 55,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qa6dp8/the_starting_lineup_was_always_set_to_feature/"
    },
    {
        "id": "1qafg7u",
        "author": "AmadisHali",
        "title": "Looking for level-headed and rational takes only: what could Xabi have done differently?",
        "content": "I feel like Fede’s injury was just completely debilitating. It turned him into a defensive burden, he needed Asencio’s help, and as a result that caused Tchou to basically play the full 90 minutes as a CB. That allowed either Yamal or Raphinha (mostly Yamal) to drop into midfield to fill the vacuum and essentially create a 4v2 scenario in midfield, with Jude and Cama by themselves.\n\nAlso, in contrast to the Atleti game where Fede and Rodrygo were able to combine to create a goal down the right flank, Fede’s injury also caused the right flank to be completely dead today. All of our attacks were concentrated on the left, with Rodrygo coming to the left to help combine with Vini. We were able to create chances when Vini was doing well, but obviously it’s not ideal to only have one functional flank and not two of them.\n\nIt didn’t get any better when Fede got substituted, because obviously Asencio isn’t capable of bringing life to the flank, so it’s not like starting without Fede in the XI and putting Asencio at RB from the beginning would’ve been a good option. Vini being forced to come off from cramps was, of course, yet another big blow, but not much could be done about that.\n\nIf Xabi was going to do anything differently, there only really two options I can think of:\n\nStarting David Jimenez at RB rather than Valverde — no one’s blaming Xabi for not doing this of course, this is too big a game to trust a Castilla player that’s only made one or two first team appearances. If Valverde was to be benched though, between Jimenez and Asencio, I would much prefer to see Jimenez at RB.\n\nSacrificing Rodrygo up front to play a 4-4-2 — maybe starting Guler or Ceballos would’ve given the midfield more of a chance to have better control and avoid leaving Jude and Cama stuck in that 4v2 battle. But we know that Guler can often be a defensive liability, and it’s hard to argue Ceballos would provide a better net-positive than Rodrygo. Rodrygo did have some fitness doubts though, but our attack probably would’ve felt more toothless without him, so I think he was necessary.\n\nAre there any other ideas I’m missing that could’ve led to a better performance? Or is it reasonable to just chalk this loss down to the injuries?\n\nSidenote: If we’re not going to sign any new midfielders until the summer, we need to learn if Thiago Pitarch is a feasible option for us. Guler and Ceballos shouldn’t be the only other midfield options we have.",
        "upvotes": 20,
        "comments": 80,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qafg7u/looking_for_levelheaded_and_rational_takes_only/"
    },
    {
        "id": "1qa2o6n",
        "author": "Ready_Ad_1353",
        "title": "Ollie Watkins: “Morgan Rogers has shown what he can do. I wouldn’t be surprised if one day he ends up at Real Madrid or something “",
        "content": "",
        "upvotes": 86,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xtttjl3lrqcg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qa2o6n/ollie_watkins_morgan_rogers_has_shown_what_he_can/"
    },
    {
        "id": "1q9xt1o",
        "author": "showerliftr",
        "title": "Turkish commentator calls Valverde Kroos, sad edit.",
        "content": "Translation;  \nKroos - sorry Valverde.. For a moment... The white shirt... and the number 8... I've rolled back the years...",
        "upvotes": 167,
        "comments": 11,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ly46xz0qnpcg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1q9xt1o/turkish_commentator_calls_valverde_kroos_sad_edit/"
    },
    {
        "id": "1q9xaxb",
        "author": "Emergency-Hornet-594",
        "title": "Following Friendship paused. Rivalry activated. It's El Clásico time! Letsgooo. HalaMadrid",
        "content": "",
        "upvotes": 147,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/43y6qjw2jpcg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1q9xaxb/following_friendship_paused_rivalry_activated_its/"
    },
    {
        "id": "1qaemna",
        "author": "Mediocre-Pie2535",
        "title": "I hope I'm wrong but I don't see us going too far in the UCL.. Again",
        "content": "I'm not basing it off of just this Loss. But also the last clasico the win was a difficult one. And other recent ucl loss. We don't have Quality subs and the injury curse is never ending. I don't want to be too quick to blame Xabi but in my opinion he's still yet to prove himself.\nThere's something that isn't clicking in the \"bigger picture\". Using Vini as an example, despite being too good at times and also bad, still makes rash decisions like not passing. Is it chemistry? Ego? ",
        "upvotes": 9,
        "comments": 31,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qaemna/i_hope_im_wrong_but_i_dont_see_us_going_too_far/"
    },
    {
        "id": "1qaezl2",
        "author": "No-Obligation1336",
        "title": "The current state of the team.",
        "content": "I don't know what those players practice but it sure as shit looks like Ancelotti never left.\n\nThey don't press and they look clueless when faced with ANY opposition pressing system. \n\nThey run around like headless chickens and every time they face Barca especially they look like scared children who have NO idea what to do with a football. \n\nToday as expected went how most of us practical fans thought it would. That first half was one of thee worst display's of football I've seen all year, which has become a common theme with these crop of players. However before Vini scored, these guys looked like a couple of lads from the local pub having a scrim after some drinks. No one but JUDE could actually hold the football and try to actually play the sport, everyone else vanished or the ball bounced off of like a hot potato. Are these guys paid million's of dollars every year? Can't be.\n\nBarca play like rabbit dogs when against us, NO ego, JUST BALL. However RMCF CANNOT get a cohesive press or ANY press for that matter going AT ALL, and we all know Xabi wants them to press. Besides Jude and of course Gonzalo, it's a joke.\n\nRMCF play as the most disconnected group of individual's I've ever seen. Yet even when they got back in the game, they REFUSE to adapt or adjust what they were doing and Barca just did as they wanted in that first half. Somehow the boys weren't 0-3 down and manage with the individual spirit to tie the game at 2-2.\n\nNow comes the second half, here we see a completely different side of the same players, who go on to create chance after chance to take the lead but still look so defensively fragile every time Barca came forward. The stark contrast is in the final third Barcelona look so composed every time but RMCF even though creating chances, everything is FRANTIC and chaotic, zero composure. Look at all of the chances that fell to WIDE OPEN players in their penalty box with a man advantage, these guys still played like scared and thoughtless kids, panicking at every key moment. This lost was an absolute shame because of HOW it happened, they have let Barca for the first time in HISTORY win three straight finals against RMCF. \n\nVini in the biggest moment of the season SHOWED UP and must be given credit. Jude worked hard but his teammates all HID in the moment, no outlet passes and no courage on the ball to show why you're paid the big bucks. The defenders are a JOKE. Huijsen is overrated and can BARELY defend, Asencio is always running forward and leaving the CB's exposed when he offers nothing going forward, make it make sense, what was the plan when Fede went off injured ? Tchou &amp; Cama VANISHED. Carreras tried but again, besides Jude no one could keep the football for more than two seconds. When Vini went off, for me I knew it was over because he was the ONLY threat. Kylian was CLEARLY not fit. Rodrygo was gassed and he didn't have a good game either.\n\nSHAME- SHAME- SHAME.\n\nWhat are your thoughts?",
        "upvotes": 4,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qaezl2/the_current_state_of_the_team/"
    },
    {
        "id": "1q9b8p2",
        "author": "o6ohunter",
        "title": "[Score90] Kylian Mbappé’s tally against Barcelona ahead of the Supercup final",
        "content": "",
        "upvotes": 909,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z3d9nadzckcg1.jpeg?auto=webp&amp;s=4b8441c51c1f8d3ac81f24d08fc36053a2342aff"
        },
        "permalink": "/r/realmadrid/comments/1q9b8p2/score90_kylian_mbappés_tally_against_barcelona/"
    },
    {
        "id": "1qahspe",
        "author": "GangsterAdaikalam",
        "title": "Visiting Bernabeu is my dream ❤️",
        "content": "Hola Madridistas!\n\nI am a Madridista from Singapore and I was planning to visit Madrid in Feb to watch my beloved RM play in the Bernabeu.\n\nI was hoping we would win the supercopa and I could book tickets to Madrid the next day. However, things didn’t turn out to be good. But guess what, you still have to support your team no matter what. In highs and lows ❤️\n\nIf you guys were in my position, what would y’all do? Would you still come now? I even saved 5 days end may hoping we would play UCL final at Budapest. Being too much delusional 😅😆",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qahspe/visiting_bernabeu_is_my_dream/"
    },
    {
        "id": "1q9tspv",
        "author": "RM_Official_Thread",
        "title": "Pre Match Thread: barcelona vs Real Madrid, Supercopa de España, Final",
        "content": "[https://www.sofascore.com/football/match/real-madrid-barcelona/rgbsEgb#id:15335105](https://www.sofascore.com/football/match/real-madrid-barcelona/rgbsEgb#id:15335105)\n\n  \nThis is it, the dumb bot is down.",
        "upvotes": 44,
        "comments": 106,
        "media": null,
        "permalink": "/r/realmadrid/comments/1q9tspv/pre_match_thread_barcelona_vs_real_madrid/"
    }
]