[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1p8ozor",
        "author": "PlatanoThorn69",
        "title": "Pareri palestre",
        "content": "Ciao a tutti! \nQuali sono le migliori palestre a Torino e dintorni? Stavo pensando di iscrivermi alla FitActive che aprirà l'anno prossimo a Borgaro, ma mi piacerebbe avere un parere generale di qualcuno, grazie",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p8ozor/pareri_palestre/"
    },
    {
        "id": "1p8cf87",
        "author": "gioorgis",
        "title": "Nuove conoscenze",
        "content": "Ciao sono una ragazza di 28 anni, trasferita da poco a Torino e come molti quì sto facendo veramente tanta fatica a conoscere persone più o meno della mia età con cui fare \"amicizia\" e organizzare qualcosa\nAnche solo una passeggiata/un aperitivo/una serata \nSe qualcun altro si trovasse nella mia situazione e avesse voglia di uscire con qualcuno di nuovo, non esitate a scrivermi :)",
        "upvotes": 16,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1p8cf87/nuove_conoscenze/"
    },
    {
        "id": "1p8qgdw",
        "author": "CakeProper4562",
        "title": "Luci Sfatte di Natale",
        "content": "Local di Torino vi chiedo semplicemente se secondo voi l’opera sia completata o ci saranno nuovi sviluppi 😅",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ga3q2e3usy3g1.jpeg?auto=webp&amp;s=b17525c26b541bc4d45856670089a9221f80c605"
        },
        "permalink": "/r/torino/comments/1p8qgdw/luci_sfatte_di_natale/"
    },
    {
        "id": "1p8clhf",
        "author": "asilorepublic95",
        "title": "Fare benzina",
        "content": "Ma quando si fa benzina ,per pagare lo si fa al totem dove selezioniamo la pompa o bisogna pagare alla cassa dentro del negozio ( quando c'è) ... sto prendendo la patente e a volte vedo che si paga alla cassa e altre volte al totem...quindi ogni benzinaio è differente ?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1p8clhf/fare_benzina/"
    },
    {
        "id": "1p8l72y",
        "author": "Ok-Mouse-7256",
        "title": "Online or Presencial?",
        "content": "The TIL, test of admission to PoliTo of Turim have a online test?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p8l72y/online_or_presencial/"
    },
    {
        "id": "1p7ycho",
        "author": "vamphorse",
        "title": "Dibatito sui semafori ripetitori a Torino",
        "content": "Visto il dibattito di questa settimana sui semafori ripetitori a Torino, volevo aggiungere un altro esempio che non ho mai capito.\n\nPremetto che sono completamente d’accordo con quanto scritto da\nu/dave-lon nel suo [post](https://redd.it/1p6l3ca) di ieri, anche riguardo al fatto che l’articolo 41, comma 11 del Codice della Strada non si applichi ai ripetitori, perché il semaforo a cui fa riferimento non riguarda chi ha già impegnato l’incrocio con il verde, per esempio in caso di svolta a destra, ma è rivolto a chi, dall’altra parte della strada, deve ancora entrare nell’incrocio.\n\nVorrei però portare un esempio che continuo a non comprendere: Piazza Sabotino. Ci sono tre semafori indicati nell’immagine. I semafori 1 e 3 sono chiari, con la relativa striscia di arresto. Ma il numero 2, cosa fa esattamente? Diventa rosso quando il semaforo pedonale torna verde, quindi sembrerebbe un semaforo dedicato a dare precedenza ai pedoni, ma non ha alcuna striscia di arresto. Dunque è un ripetitore? E di cosa, del semaforo 1 che si trova cento metri prima, dall’altra parte della piazza? Se ti trovi al semaforo 1, il numero 2 non lo vedi nemmeno. La stessa situazione si trova anche dall'altre parte della piazza, nel senso di marcia opposto.\n\nNon riesco a darmi una spiegazione. Voi come la vedete?",
        "upvotes": 22,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oqniz918ur3g1.png?auto=webp&amp;s=9e22d469c0c575524d28a1348742782a08d97172"
        },
        "permalink": "/r/torino/comments/1p7ycho/dibatito_sui_semafori_ripetitori_a_torino/"
    },
    {
        "id": "1p8f0c4",
        "author": "Famous-Print7360",
        "title": "Consigli per trovare alloggio",
        "content": "Buongiorno,\nSono un neolaureato e ho intenzione di venire a lavorare a Torino. Allora inizio la ricerca di un alloggio. Avete qualche sito di monolocali/affitti condivisi a Torino da consigliarmi? (Troppa paura delle truffe).\nQuali zone della città pensate siano le migliori o da evitare?\nGrazie per le risposte",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p8f0c4/consigli_per_trovare_alloggio/"
    },
    {
        "id": "1p7ykf2",
        "author": "nicco_lo",
        "title": "Posti per mangiare a torino senza spendere le madonne",
        "content": "Ciao a tutti, sono a torino da poco e sabato verrà a trovarmi un mio amico. Vorrei portarlo a mangiare qualcosa magari di tipico ma non vorrei arrivare a spendere un rene, diciamo non oltre i 100 euro totali, meglio ancora dentro gli 80. Grazie!",
        "upvotes": 8,
        "comments": 34,
        "media": null,
        "permalink": "/r/torino/comments/1p7ykf2/posti_per_mangiare_a_torino_senza_spendere_le/"
    },
    {
        "id": "1p7ztyy",
        "author": "gh0stxfyou",
        "title": "posti abbandonati",
        "content": "ciao \nsto cercando dei posti abbandonati per girare un cortometraggio vicino a TORINO e provincia, avete idea di dove posso andare?",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1p7ztyy/posti_abbandonati/"
    },
    {
        "id": "1p87tzz",
        "author": "fratifresh",
        "title": "Looking for language exchange/meeting new people",
        "content": "Hi everyone!\n\nI'm an Italian student in my first year of Economics and Finance here in Turin. \nI'd love to meet new people in the city, especially international students or anyone who's up for a language exchange.\n\nI’m looking to improve my English, and I’m also really interested in learning new languages (especially Russian and French).\nIn return, I can help with Italian (and I’m always down for a coffee ☕).\n\nIf you're interested in language exchange, meeting up sometimes, or just chatting, feel free to reach out!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p87tzz/looking_for_language_exchangemeeting_new_people/"
    },
    {
        "id": "1p7xbk7",
        "author": "HermitCup",
        "title": "Palestra con piscina a buon prezzo",
        "content": "Per via di una condizione medica devo incominciare a fare attività fisica e la dottoressa a indicato il nuoto come l'opzione migliore, ma purtroppo non so nulla delle palestre qui a Torino e se c'è qualcuno che può darmi qualche dritta su questo campo gli sarei molto grato🙏",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p7xbk7/palestra_con_piscina_a_buon_prezzo/"
    },
    {
        "id": "1p7xznh",
        "author": "Powerful-Ostrich-120",
        "title": "Con la nuova Fiat 500 Ibrida, a Mirafiori torna il secondo turno: l'annuncio di Filosa",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XihZr11-Gr5q7LiszWR2WlB67q-n1ybaOVwdE-tcsc0.jpeg?auto=webp&amp;s=6a2c55e8e07ac205dbbd7884800143fb1124f43d"
        },
        "permalink": "/r/torino/comments/1p7xznh/con_la_nuova_fiat_500_ibrida_a_mirafiori_torna_il/"
    },
    {
        "id": "1p7xuxu",
        "author": "DPPenjoyer18",
        "title": "Dove parcheggiare nel periodo natalizio?",
        "content": "Salve a tutti. Dato che nel periodo natalizio dovrò lasciare la macchina qui, dove potrei parcheggiarla per non lasciarla ferma in mezzo la strada? Si tratterebbe solo di 5 giorni e non vorrei spendere troppo.\n\nGrazie ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1p7xuxu/dove_parcheggiare_nel_periodo_natalizio/"
    },
    {
        "id": "1p803mm",
        "author": "Famous_Steak7354",
        "title": "Palestre Bodybuilding torino e dintorni",
        "content": "Ciao a tutti!  \nSto cercando palestre ben attrezzate con tante macchine professionali tipo Panatta, Hammer Strength e simili. Qualcuno sa consigliarmi qualche palestra con una bella sala pesi ricca di questi macchinari? Grazie mille!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p803mm/palestre_bodybuilding_torino_e_dintorni/"
    },
    {
        "id": "1p7z18a",
        "author": "minidonnie",
        "title": "Cerco modell* o aspiranti per model test 📸",
        "content": "Cerco modell* e aspiranti tali a 📍Torino per dei model test per aggiornamento portfolio\nSe sei un aspirante e non sai da dove iniziare io posso fornire tutto il necessario per iniziare a lavorare come modelli\nDm su IG se interessati (@viaggiovisivo.ph)\nPortfolio: https://viaggiovisivo.mypixieset.com/",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p7z18a/cerco_modell_o_aspiranti_per_model_test/"
    },
    {
        "id": "1p7xr59",
        "author": "insearch4sunrise",
        "title": "parcheggio aereoporto Caselle: check-out dopo la data prenotata",
        "content": "Mi sono reso conto che ho fatto la prenotazione del P-A \"Sosta lunga\" per meno giorni di quelli che effettivamente mi servono; non posso più modificarla ma solo annullarla (ma non lo faccio sapendo che a ridosso delle Feste è impossibile trovare disponibilità). Pagherò l'extra-sosta, ovviamente.  \nPossono mica farti multe o rimuoverti l'auto? Non ho esperienza precedente di parcheggio lì",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1p7xr59/parcheggio_aereoporto_caselle_checkout_dopo_la/"
    },
    {
        "id": "1p7f06h",
        "author": "dathena649",
        "title": "Help with rent problems",
        "content": "My friend who is EU is an international student in politecnico. He managed to get a flat but he wanted to register residency in Italy for tax purposes. When this was raised with the landlord to provide a contract for residency, landlord became agitated and asked him to leave the flat immediately. He is trying to look for a place who has the contract that can be used for residency, but no one is accepting. They only have contract but not for residency purposes. What is the deal with that? Why is it so difficult to get a place that can be used for residency purposes??\n\nHe’s worried he will be homeless. Any advice appreciated.",
        "upvotes": 8,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1p7f06h/help_with_rent_problems/"
    },
    {
        "id": "1p7bf4j",
        "author": "Arel45",
        "title": "Cinema in lingua originale con sub in inglese",
        "content": "Ciao, sto cercando un cinema a Torino che proietti i film in lingua originale (inglese) con sottotitoli necessariamente in inglese. Finora sono riuscito a trovare solo cinema che programmano dei film in lingua originale ma con sottotitoli in italiano, sapete se ce n'è qualcuno che li abbia in inglese? ",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1p7bf4j/cinema_in_lingua_originale_con_sub_in_inglese/"
    },
    {
        "id": "1p77s4o",
        "author": "whateverguy59",
        "title": "Where can I find a barber/salon that cuts long hair on men?",
        "content": "Anyone know any good barber that specializes in long haired men? I am just trying to get the sides around the ears cleaned up a bit and not touch the length much, don’t want some idiot to fuck it up.\n\nGrazie! Sorry for the lack of Italian in this specific post. ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1p77s4o/where_can_i_find_a_barbersalon_that_cuts_long/"
    },
    {
        "id": "1p7kr25",
        "author": "torinoverdcioccbianc",
        "title": "Torino meet up",
        "content": "Ciao meet up Drosso adesso party",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p7kr25/torino_meet_up/"
    },
    {
        "id": "1p7ijuw",
        "author": "TroubleDesigner5441",
        "title": "Psicoterapeuta a Torino",
        "content": "Ciao! \nMi consigliate psicoterapeuti bravi donne a Torino che adottino tariffe agevolate? (50 a seduta o meno)? \nE se siete a conoscenza degli orientamenti, mi sapreste consigliare qualcuno che segue orientamento psicoanalitico / psicodinamico \n\nGrazie!! ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1p7ijuw/psicoterapeuta_a_torino/"
    },
    {
        "id": "1p79fal",
        "author": "goldenels",
        "title": "Informazioni Scuola Artigiani e Restauratori Maria Luisa Rossi",
        "content": "Ciao a tutti! 😊\nQualcuno di voi conosce o ha frequentato la Scuola per Artigiani e Restauratori Maria Luisa Rossi? Mi piacerebbe avere qualche opinione o esperienza diretta sulla scuola, l’ambiente ed in particolar modo sul corso per Tecnico del Restauro di Beni culturali.\nGrazie in anticipo per ogni informazione! 🙏",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1p79fal/informazioni_scuola_artigiani_e_restauratori/"
    },
    {
        "id": "1p7eux0",
        "author": "Spirited_Currency_30",
        "title": "Negozio di cuffie",
        "content": "Ciaoo.\nVorrei sapere se per caso ci sono dei negozi dove potrei acquistare delle cuffie tipo da €300-500.\nSì, so che posso trovarli online. E tipo so che Amazon ne ha degli sconti adesso. Ma besos mi sta sul cazzo. \nSì so che non dovrei usare neanche internet però vabbè penso che nessuno di voi pensa da dove arriva il caffè che bevete al mattino. \n",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1p7eux0/negozio_di_cuffie/"
    },
    {
        "id": "1p7d7ud",
        "author": "SkytechMC",
        "title": "La metropolitana si è mai fermata durante uno sciopero generale?",
        "content": "Come ben saprete, il 28 novembre ci sarà lo sciopero generale, e da quanto ho capito anche la metro sarà ferma. Tuttavia, alcuni miei colleghi mi han detto che funziona anche durante gli scioperi.\nMa la metro è mai stata (davvero) ferma durante uno sciopero?",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1p7d7ud/la_metropolitana_si_è_mai_fermata_durante_uno/"
    },
    {
        "id": "1p6c1kj",
        "author": "bohnonlosoahahahah",
        "title": "Incroci di merda (aiuto)",
        "content": "Allora. Voi dovete aiutarmi a capire che cazzo è successo/come devo comportarmi la prossima volta.\n\n  \nLa situazione è questa: è la prima volta che mi immer~~d~~**g**o nel pieno della contorta viabilità di Torino. Come in foto, mi trovo su corso Vittorio Emanuele II, all'incrocio con via Cesana. Voglio svoltare a destra, quindi attendo che il semaforo diventi verde, al chè (*in assenza di ulteriori segnalazioni*) lo prendo come un segnale che POSSO PASSARE, DATO CHE IL SEMAFORO E' VERDE. Se non chè, udite udite, mentre svolto a destra mi rendo conto che all'usicta del cazzo di incrocio c'è lì bello bello un ALTRO semaforo, ma rosso. A questo punto io ormai sono già in mezzo alla strada, se mi fermo blocco o il controviale o l'attraversamento ciclabile, (anche perchè non c'è una minchia di linea d'arresto quindi cosa ne so io di dove mi devo ficcare?), inoltre so di altri casi a Torino in cui il secondo semaforo va ignorato, quindi in una frazione di secondo decido di completare la svolta, ma proprio mentre attraverso il controviale mi trovo un'altra macchina (linea blu nell'immagine) che stava andando sparatissima ed inchioda ad un metro dalla carrozzeria della mia macchina uscita dalla concessionaria una settimana fa. Mi aspetto una strombazzata di 45 minuti in classico stile torinese, invece io e l'altro autista ci guardiamo nelle palle degli occhi per un secondo, entrambi spaesati e sperduti, poi io riparto e mi levo dai maroni (nonostante il semaforo ancora rosso.)\n\nIn sostanza, cosa minchia si fa in queste situazioni per non farsi ammazzare da qualcuno che arriva dal controviale e non essere megamultati?",
        "upvotes": 173,
        "comments": 172,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fhn6kej8je3g1.png?auto=webp&amp;s=5145e886e63e9b2eebce72f8f53389ba293c72bd"
        },
        "permalink": "/r/torino/comments/1p6c1kj/incroci_di_merda_aiuto/"
    },
    {
        "id": "1p7d4el",
        "author": "nickname1917",
        "title": "Trasformare i negozi in luoghi di esperienza, cultura e socialità",
        "content": "Belle parole. Terminato l'evento la maggioranza di quelli in foto, ma è solo una mia ipotesi, sono andati a comprare online i regali di Natale su piattaforma di un certo Jeff.\n\nComunque, come si diceva un po' di tempo fa, è il capitalismo bellezza.\n\n[https://www.ansa.it/piemonte/notizie/2025/11/26/a-torino-alleanza-contro-la-desertificazione-commerciale\\_140b1a74-b3b0-4825-b0a5-d43084ba208c.html](https://www.ansa.it/piemonte/notizie/2025/11/26/a-torino-alleanza-contro-la-desertificazione-commerciale_140b1a74-b3b0-4825-b0a5-d43084ba208c.html)",
        "upvotes": 1,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Rm8TZknxDpYLM7GBO-oB-R-uxJFP340SBeJUy5kHaCM.jpeg?auto=webp&amp;s=e9f6cf95faf9910c510eeebfc4f4d3d96b64331a"
        },
        "permalink": "/r/torino/comments/1p7d4el/trasformare_i_negozi_in_luoghi_di_esperienza/"
    },
    {
        "id": "1p755rb",
        "author": "stressed_student_01",
        "title": "Buona merceria",
        "content": "Ciao a tutti! \nVivo a Torino ormai da 3 anni ma sono ancora alla disperata ricerca di una merceria di fiducia, nello specifico per lana e filati vari per ferri e uncinetto. Qualcuno saprebbe darmi qualche consiglio? La zona non importa troppo, basta che non sia fuori da Torino.",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1p755rb/buona_merceria/"
    },
    {
        "id": "1p78sw0",
        "author": "timponem21",
        "title": "Best Movie Theaters in Torino",
        "content": "I'm visiting from NYC and would love to watch Italian films (and other European and Asian films) while I'm in Torino, but I only speak English.\n\nAre there theaters that screen movies from around the world with English subtitles?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1p78sw0/best_movie_theaters_in_torino/"
    }
]