[
    {
        "id": "1grzjbd",
        "author": "GladiatorMovie",
        "title": "AMA: We're the costume designers for Ridley Scott’s latest epic “Gladiator II.” Ask us anything about our longtime careers in film and TV, and about working on such a huge project. ",
        "content": "We are **Janty Yates** (Costume Designer) and **David Crossman** (Costume Designer – Military Costumes) and we had the pleasure of working on Ridley Scott’s new film, Gladiator II. We’ve both spent decades working in the industry, garnering awards, and working on some of the biggest movies in Hollywood.\n\nWe’ve been on Ridley Scott projects previously, and between the two of us, we’ve worked on franchises like Harry Potter, Star Wars, and Alien. With an eye for detail, and a love of storytelling, our passion for outfitting the right actors in the perfect wardrobes is very special to us both.\n\nIf you want to know more about the process, the methods, and the artistry of costume design for big, epic movies, we’re here to take your questions. \n\nWe are:\n\n* [Janty Yates](https://www.google.com/url?q=https://www.imdb.com/name/nm0946765/&amp;sa=D&amp;source=docs&amp;ust=1731688586703178&amp;usg=AOvVaw3l_HfawFgp6Rgx07DWbfZl), Costume Designer. Yates has worked in this field since 1989 and has two Academy Award nominations, including one win. Gladiator II marks Yates 18th collaboration with Ridley Scott\n\n* [David Crossman](https://www.google.com/url?q=https://www.imdb.com/name/nm0189366/&amp;sa=D&amp;source=docs&amp;ust=1731688586703575&amp;usg=AOvVaw382KB9AjxnnfM3CtG96Jeu), Costume Designer – Military Costume. Crossman has worked as a costume designer since the late 90s and has one Academy Award nomination for Napoleon, which he shares with Yates.\n\nhttps://preview.redd.it/6rn3v7kv731e1.png?width=1988&amp;format=png&amp;auto=webp&amp;s=9248ede2359a90b2ca141dbe26e0fb993ece6c1d\n\n&gt;Thank you all so much for joining us and asking so many wonderful questions about our lives and careers. \n&gt;This has been such a memorable experience for both of us. We could not be more appreciative.\n&gt;Can’t wait for you all to see the costumes on the big screen!\n&gt;",
        "upvotes": 138,
        "comments": 86,
        "media": null,
        "permalink": "/r/movies/comments/1grzjbd/ama_were_the_costume_designers_for_ridley_scotts/"
    },
    {
        "id": "1gt6kt0",
        "author": "DonnieDarkoRabbit",
        "title": "We all know by now that Heath Ledger's hospital explosion failure in The Dark Knight wasn't improvised. What are some other movie rumours you wish to dismantle? ",
        "content": "I'd love to know some popular movie \"trivia\" rumours that bring your blood to a boil when you see people spread them around to this day. I'll start us of with this:\n\nThe rumour about A Quiet Place originally being written as a Cloverfield sequel. This is not true. The writers wrote the story, then upon speaking to their representatives, they learned that Bad Robot was looping in pre-existing screenplays into the Cloververse, which became a cause for concern for the two writers. It was Paramount who decided against this, and allowed the film to be developed and released independently of the Cloververse as intended. \n\nEdit: As suggested in the comments, don't forget to provide sources to properly prevent the spread of more rumours. I'll start:\n\n[Here's my source about A Quiet Place](https://www.indiewire.com/features/general/a-quiet-place-cloverfield-1201950098/)",
        "upvotes": 577,
        "comments": 314,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2XaePXmFWO1NrIlrFo0cbkq283vkL8gCoUNnbcwypak.jpg?auto=webp&amp;s=789e0240701cb79a7ba2f05de6fcfb69be491756"
        },
        "permalink": "/r/movies/comments/1gt6kt0/we_all_know_by_now_that_heath_ledgers_hospital/"
    },
    {
        "id": "1gsqd9x",
        "author": "BunyipPouch",
        "title": "Zach Braff Announces ‘Garden State’ 20th Anniversary Benefit Concert With Soundtrack Artists - The event will feature The Shins, Iron &amp; Wine, Frou Frou, Colin Hay, Cary Brothers, Remy Zero, and more, all of whom appeared on the Grammy-winning film soundtrack. It will benefit homeless shelters.",
        "content": "",
        "upvotes": 5422,
        "comments": 316,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZtNNTtgFvO7uLqPP9_0tS-6cRVkxTHwcxnxOMWsz3us.jpg?auto=webp&amp;s=167389db8424cf18e515a2c95a8b8c6bbc84d825"
        },
        "permalink": "/r/movies/comments/1gsqd9x/zach_braff_announces_garden_state_20th/"
    },
    {
        "id": "1gt56nr",
        "author": "Kind_Mastodon_1585",
        "title": "The ‘Sideways’ Revolution: How a Single Joke Upended the Wine World\n",
        "content": "",
        "upvotes": 457,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mjuy77fk9qb13CVdg9yjJPgntvCY_YDQPyWOadN5BjY.jpg?auto=webp&amp;s=9483ac2c17b8ca691ec80b651088ff0f842a1d33"
        },
        "permalink": "/r/movies/comments/1gt56nr/the_sideways_revolution_how_a_single_joke_upended/"
    },
    {
        "id": "1gt259f",
        "author": "BunyipPouch",
        "title": "I Like Movies - Official US Trailer - A socially awkward 17-year-old cinephile takes a part-time job at a local video store, where he forms a complicated friendship with his older store manager. He hopes to earn enough money to achieve his dream of attending film school at NYU.",
        "content": "",
        "upvotes": 414,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dXonZRplX6PLpWC0CXnFLuwmb1J5EGEa0vYQgj62z1I.jpg?auto=webp&amp;s=5b013a2ec63a0bf5e0a302ef4ac5d8bd8ccbc86c"
        },
        "permalink": "/r/movies/comments/1gt259f/i_like_movies_official_us_trailer_a_socially/"
    },
    {
        "id": "1gt1iwj",
        "author": "hukfin",
        "title": "Movies you love but don't recommend to your friends for fear they'll sh*t all over it...",
        "content": "Hey all,\n\nI'm sure this has been asked before...\n\nJust like the title says. Are there movies you absolutely love but don't recommend because you may not like the reaction you'll get? I'll start...Local Hero. I have a reputation among my circle for being very critical and this movie means to much to me to have someone run it down just to throw it in my face. \n\nWhat ya got?\n\nThanks!",
        "upvotes": 314,
        "comments": 888,
        "media": null,
        "permalink": "/r/movies/comments/1gt1iwj/movies_you_love_but_dont_recommend_to_your/"
    },
    {
        "id": "1gsyhm8",
        "author": "Odd_Advance_6438",
        "title": "The opening Black Friday scene from Thanksgiving (2024) was the stuff of nightmares. Great way to start the movie",
        "content": "I myself am not super familiar with a lot of Eli Roth’s work, but I really enjoyed Thanksgiving. From what I’m aware, that’s considered one of his few good ones. It was a very fun movie all around with some pretty wild and creative kills\n\nHowever, the Black Friday scene stuck out to me as the highlight of the movie, a hilariously grim opening of a violent shopping spree. Seeing people cruelty snatch waffle makers out of each others hands as they bleed from broken glass was pretty wild, then the scalp getting torn off when the woman’s hair was stuck to the customers shopping cart. Great opening",
        "upvotes": 403,
        "comments": 91,
        "media": null,
        "permalink": "/r/movies/comments/1gsyhm8/the_opening_black_friday_scene_from_thanksgiving/"
    },
    {
        "id": "1gt38fh",
        "author": "indiewire",
        "title": "'An Almost Christmas Story': How Disney+ Short Honors Stop Motion",
        "content": "",
        "upvotes": 103,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/z6jGuikFx93odIXNXkCaZO7Px5N0FYLi6cDST2kHxss.jpg?auto=webp&amp;s=4faa3610ee8130ebff41d298dac23792a10d2ed6"
        },
        "permalink": "/r/movies/comments/1gt38fh/an_almost_christmas_story_how_disney_short_honors/"
    },
    {
        "id": "1gsq2d5",
        "author": "cenrepute",
        "title": "Punk Drama 'Out Come the Wolves,' Based on Rancid Album, Finds Cast",
        "content": "",
        "upvotes": 670,
        "comments": 100,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j4ZZj-0FP-b3pQxQDoX-r8jfNc0uahTLK9PqmfLtmAU.jpg?auto=webp&amp;s=90566734593010b5f805e5a52bc14f2161537237"
        },
        "permalink": "/r/movies/comments/1gsq2d5/punk_drama_out_come_the_wolves_based_on_rancid/"
    },
    {
        "id": "1gsp1a8",
        "author": "Bennett1984",
        "title": "Heavenly Creatures at 30: The Story Behind Peter Jackson's Complex and Visually Stylish True Crime Drama",
        "content": "",
        "upvotes": 438,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2cP9mYiCUCPWyC8PHciX9wm0FXSWeUYCOsoYeLvAMwg.jpg?auto=webp&amp;s=f1826758271063d3c6a6ac478899595944345e5a"
        },
        "permalink": "/r/movies/comments/1gsp1a8/heavenly_creatures_at_30_the_story_behind_peter/"
    },
    {
        "id": "1gt48cx",
        "author": "IKnowWhereImGoing",
        "title": "Miracle Mile (1988)",
        "content": "I watched this for the first time today, and now can't believe this film isn't mentioned more frequently.\n\nIt's fun and frankly...nuts. Starts as a sweet and gentle romance, and ends as a dark reminder of the impact of nuclear war.\n\nGreat performance from Anthony Edwards, with Mare Winningham as the woman he falls for, plus brilliant support from Mykelti Williamson and Kurt Fuller.\n\nA strange and entertaining ride, with about as much '80s' crammed into a film as is humanly possible.\n\nIt also has the sweet bonus of the two leads getting married IRL, over 30 yrs after they both starred in it.",
        "upvotes": 46,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1gt48cx/miracle_mile_1988/"
    },
    {
        "id": "1gs83ry",
        "author": "MarvelsGrantMan136",
        "title": "Disney Pulls 2026 ‘Star Wars’ Movie From Release Calendar",
        "content": "",
        "upvotes": 9714,
        "comments": 1508,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wrimKjD6M8Y-QdusR3mK5fJAVsmt9cEfFyZ9F_OdMFY.jpg?auto=webp&amp;s=718a7193097b8c13e37f9ca09298645121645736"
        },
        "permalink": "/r/movies/comments/1gs83ry/disney_pulls_2026_star_wars_movie_from_release/"
    },
    {
        "id": "1gt1nwm",
        "author": "Quidam1",
        "title": "The Fall (2006) - Tarsem Singh. Now, finally available on Mubi after years of distribution purgatory.",
        "content": "For those cinephiles searching for this movie, it is now available on Mubi (November 2024); either through their direct website or through Amazon Prime Video. It is not a perfect movie and yet the storytelling and the visuals are stunning. Even David Fincher and Spike Jonze attached their names to it years ago to try to get it more widely distributed. As a movie fan, if you have not watched this film, you should really check it out. Not sure how long it will be available.",
        "upvotes": 57,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1gt1nwm/the_fall_2006_tarsem_singh_now_finally_available/"
    },
    {
        "id": "1gsbw8o",
        "author": "UhohSantahasdiarrhea",
        "title": "Tarantino always sidesteps the most interesting part of the story, its his biggest strength.",
        "content": "He's such a strong writer he can come up with a story that would make a whole series on its own and totally ditch it, in favor of focusing on another part of the story that SHOULD be less interesting and make it all that matters.\n\nReservoir Dogs they skip the heist.\n\nPulp Fiction they skip over what Bret and his friends actually did, what made Vincent to run to Amsterdam, the conversation between Jules and Marcellus when Jules quit, Butch and Vincent's previous interactions, and the fight.\n\nJackie Brown may be the exception.\n\nKill Bill they skip over almost everything Faux Force 5 did as killers, even the discussion when they decided ***** needed to die.\n\nInglorious Basterds they skip almost everything they did on the ground.\n\nDjango, most of Hans Landa the First's backstory is glossed over.\n\nAnd such and such.",
        "upvotes": 4178,
        "comments": 435,
        "media": null,
        "permalink": "/r/movies/comments/1gsbw8o/tarantino_always_sidesteps_the_most_interesting/"
    },
    {
        "id": "1gsxg0e",
        "author": "Competitive_Pop9002",
        "title": "Requiem For A Dream",
        "content": "What a crazy movie. I have seen my fair share of psychologically bent flicks but damn, I would call it a cinematic masterpiece. Absolutely brilliant cinematography. Props for the BGM. Definitely nihilistic, but left me asking for *more* for some reason. The title couldn't have been better. And oh, Ellen Burstyn, you have my heart.",
        "upvotes": 64,
        "comments": 57,
        "media": null,
        "permalink": "/r/movies/comments/1gsxg0e/requiem_for_a_dream/"
    },
    {
        "id": "1gspuzi",
        "author": "MarkyGalore",
        "title": "Best Phone Call Scenes in Movies?",
        "content": "\"Hello Martha,\" Hannibal Lecktor, spelled with a \"K,\" in Manhunter. [https://www.youtube.com/watch?v=sAjSxdwwFbQ](https://www.youtube.com/watch?v=sAjSxdwwFbQ)\n\nA French movie called Red Lights.  A guy wakes up and while in a brutal hangover uses a phone at a cafe to try to locate his wife who booted him out of the car the night before.  The counter girl gets so involved in the conversation she give him a free sandwich as he desperately tries to gather information in a pre smart phone era.  [https://en.wikipedia.org/wiki/Red\\_Lights\\_(2004\\_film)](https://en.wikipedia.org/wiki/Red_Lights_(2004_film))\n\n  \nEthan Hunt, \"You're in Prague?\"  Phone call made to Kittridge. [https://getyarn.io/yarn-clip/9aad4c40-c28b-42f0-9b5f-e1a7a1d3f499](https://getyarn.io/yarn-clip/9aad4c40-c28b-42f0-9b5f-e1a7a1d3f499) Sorry I couldn't find the full conversation. \n\n",
        "upvotes": 140,
        "comments": 372,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/d_fEOCI2LjUKzVrffwmQgMNQd83B0agvwFSP0ZOWYvI.jpg?auto=webp&amp;s=82db230795f3ee3be154b034b5f295eaa792263b"
        },
        "permalink": "/r/movies/comments/1gspuzi/best_phone_call_scenes_in_movies/"
    },
    {
        "id": "1gt4xmo",
        "author": "-Clayburn",
        "title": "What do actors' production companies actually do?",
        "content": "I'm sure there's a range here, but generally when you see something like Seven Bucks for The Rock or Plan B for Brad Pitt, what can you expect the behind the scenes work to be to get this production credit?  In The Rock's case it almost seems like it's just a requirement for him appearing in the movie.  Does he actually get involved in getting the movie made beyond slapping his name on it?  Meanwhile I've seen a lot of Plan B movies that don't have Brad Pitt in them, so I'm guessing they're actually involved in getting the movie produced.\n\nSo what's the typical involvement like? What differentiates a movie Starring Dwayne Johnson from a movie Starring Dwayne Johnson &amp; Produced by Seven Bucks?  And why/how are these different than just \"Executive Producer Nicole Kidman\" or something?",
        "upvotes": 15,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1gt4xmo/what_do_actors_production_companies_actually_do/"
    },
    {
        "id": "1gt1ndv",
        "author": "Ok-Bar601",
        "title": "Thoughts on Nic Cage’s performance in Vampire’s Kiss",
        "content": "So I watched this movie yesterday not really knowing anything about it except that Nic Cage was in it. The movie itself was pretty average although I now understand it’s a cult classic having read up on it after watching.\n\nI gotta say, Nic Cage gives an incredibly wild performance which I’m still trying to determine if this was a classic case of Nic Cage overacting antics or he was in fact just brilliant. \n\nThe only thing I know for sure is he was 100% committed to the role, and I was there with him all the way despite the quality of the movie. It’s like watching someone who is way over the top, but he makes you believe that he believes in himself and what he is doing.\n\nHe’s a remarkable person, strange and fascinating, eccentric and spot on at times in his acting performances. The guy can act when he puts his mind to it, as witnessed in Pig where he was much more subtle. Then you see him in something like Colour Out Of Space, his performance was eccentric to say the least but still watchable all the same like you can’t take your eyes off of him. At times you cringe when he goes off the reservation and other times you’re in awe of his more memorable performances thinking “Is this the same guy??”\n\nWhat are your thoughts on his Vampire’s Kiss role?",
        "upvotes": 21,
        "comments": 45,
        "media": null,
        "permalink": "/r/movies/comments/1gt1ndv/thoughts_on_nic_cages_performance_in_vampires_kiss/"
    },
    {
        "id": "1gsodyq",
        "author": "theatlantic",
        "title": "‘Emilia Pérez’ Review, by Shirley Li: A Film Impossible to Have Mild Feelings About",
        "content": "",
        "upvotes": 142,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TEj8rdk28W0EEkea37v0wuNV-tw6t1XHQcr_gAgRWwE.jpg?auto=webp&amp;s=4edc7a915abeed9bc6714ee7b3c035e0942f3ce7"
        },
        "permalink": "/r/movies/comments/1gsodyq/emilia_pérez_review_by_shirley_li_a_film/"
    },
    {
        "id": "1gs2odv",
        "author": "Puzzled-Tap8042",
        "title": "Snow White has an estimated net budget of $214m\n",
        "content": "",
        "upvotes": 6542,
        "comments": 1685,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GJHCMTifjXmdrUz5PqKXVqjFknM8mVeQj0LPznVvTzw.jpg?auto=webp&amp;s=0ce35fed014e784838e64311c81af229e9b0df5c"
        },
        "permalink": "/r/movies/comments/1gs2odv/snow_white_has_an_estimated_net_budget_of_214m/"
    },
    {
        "id": "1gsvxsp",
        "author": "lawns",
        "title": "\"Werewolf Game\" trailer, Horror Movie starring Tony Todd as the villain, one of his last movies",
        "content": "",
        "upvotes": 54,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/B0MipkVFe40vsUJTO-O_QcPxH4Etl2AKHuwsjZ7lgPM.jpg?auto=webp&amp;s=1e5044a24f118b0f4e038e66f000c8e6dfeab160"
        },
        "permalink": "/r/movies/comments/1gsvxsp/werewolf_game_trailer_horror_movie_starring_tony/"
    },
    {
        "id": "1gs5whw",
        "author": "MarvelsGrantMan136",
        "title": "‘The Substance’ Director Coralie Fargeat Pulls Film From Camerimage Following Festival Head’s Comments About Women",
        "content": "",
        "upvotes": 3516,
        "comments": 516,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5CQp8r0CAhthHRP3tpLIqQSfA-hFFCGJhDpycmR0e-8.jpg?auto=webp&amp;s=444cf6906b282b1bd825e4f0b792a94d8643ba7c"
        },
        "permalink": "/r/movies/comments/1gs5whw/the_substance_director_coralie_fargeat_pulls_film/"
    },
    {
        "id": "1gsda6d",
        "author": "Rossum81",
        "title": "Savage Entertainment: A new version of ‘Caligula’ (1979) provides a valuable record of one of the most fascinating disasters in cinema history.",
        "content": "",
        "upvotes": 1154,
        "comments": 94,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mjxFr2fhPOdZ0826wpbYSy-2PfEu5LH7L4rrrMXXF2Y.jpg?auto=webp&amp;s=a773debd63a739826e2e3d011522c220afd1cb9a"
        },
        "permalink": "/r/movies/comments/1gsda6d/savage_entertainment_a_new_version_of_caligula/"
    },
    {
        "id": "1gt26h1",
        "author": "SAKingWriter",
        "title": "Best movies of your childhood that I can show my kid?",
        "content": "My daughter recently just turned one year old, now I gotta create a list of movies that are essential, but I need help not only picking those movies, but matching those up to ages. I'm thinking of 3 movies per year up until she's like 8. So 24? Damn. My baby will be a cinephile if I have anything to say about it, in this family anyway.\n\nLike I love The Goonies, but I'm not gonna show that to her at 2. \n\nBedknobs and Broomsticks can probably be shown around 2, but that's what I'm trying to figure out. Please /r/movies, you're my only hope.",
        "upvotes": 16,
        "comments": 161,
        "media": null,
        "permalink": "/r/movies/comments/1gt26h1/best_movies_of_your_childhood_that_i_can_show_my/"
    },
    {
        "id": "1grwfhy",
        "author": "MarvelsGrantMan136",
        "title": "Conan O’Brien to Host 2025 Oscars Ceremony",
        "content": "",
        "upvotes": 12803,
        "comments": 697,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Ms9A9tYgYWyusoRqNpUYTmsVynOooqeGYzFYDe1T6xM.jpg?auto=webp&amp;s=6761fa07f8d3a65d7080f5be6bd09f42b9b67365"
        },
        "permalink": "/r/movies/comments/1grwfhy/conan_obrien_to_host_2025_oscars_ceremony/"
    },
    {
        "id": "1gt53ma",
        "author": "kitkat-9",
        "title": "Recommend me stuff to watch while recovering from surgery?",
        "content": "I’m having brain surgery in a little over a week and will just be sitting around for a while so I’m looking for some good movies and/or tv shows to put on my list. Preferably nothing that makes me think too hard lol. I like shows like schitt’s creek, Abbott elementary, and Ted lasso. For movies I like a pretty wide range, from Get Out to The Fall Guy to cheesy Hallmark type stuff for the holidays. I’m 31F btw if it matters. Thanks in advance!",
        "upvotes": 6,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1gt53ma/recommend_me_stuff_to_watch_while_recovering_from/"
    },
    {
        "id": "1gt1vcc",
        "author": "NillaWafer3461",
        "title": "Endlessly Rewatchable",
        "content": "Every year during the Holidays I have Sunday night gift wrapping marathons, wherein I shut myself in our library/parlor and wrap like I’m trying to impress Mrs. Claus.\n\nI like to “watch” (in quotes because I don’t actually watch- mostly just listen) a mindless yet wholesome movie on repeat while I gift wrap.\n\nIn past years I’ve put on movies such as ‘The Sound of Music’, ‘Willy Wonka and the Chocolate Factory’, and ‘Moana’. So I suppose a good soundtrack helps me work faster/happier.\n\nI’m searching for this year’s cinematic indulgence.  What are your favorite movies that might match my vibe? Doesn’t have to be holiday related: Bonus points if your suggestion can be found on one of the major streaming platforms.",
        "upvotes": 13,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1gt1vcc/endlessly_rewatchable/"
    },
    {
        "id": "1gt8vuk",
        "author": "Dizzy-Traffic",
        "title": "Primal fear - \"There was no Aaron, counselor\" scene ",
        "content": "In the movie Primal Fear - in the scene where Aaron/Roy reveals that there is actually only one person, Martin Vail concludes that there was no Roy and smiles. But he is corrected by Aaron/Roy that there was no Aaron actually and Vail seems kind of shocked.\n\nWhat is the significance of this part? The person that existed was the murderer in the end and it doesn't matter, right? Or is he just astonished by the level of trickery?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1gt8vuk/primal_fear_there_was_no_aaron_counselor_scene/"
    },
    {
        "id": "1gsdt6u",
        "author": "galaxystars1",
        "title": "John Waters Says the 'Liarmouth' Movie Won't Be Happening",
        "content": "",
        "upvotes": 525,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gH1_XYH-PZYdyQnx5fwbaFItB5yIUI9ll9B5D_czVzs.jpg?auto=webp&amp;s=6a2f0b465eec1c655f3b1c491de8e8ef4c316ce9"
        },
        "permalink": "/r/movies/comments/1gsdt6u/john_waters_says_the_liarmouth_movie_wont_be/"
    },
    {
        "id": "1gt7h7f",
        "author": "nightcitytrashcan",
        "title": "Favorite movies set in New York City? ",
        "content": "Inspired by [this](https://www.reddit.com/r/AllThatsInteresting/s/PRr3tzu2NM) post, I was reminded of how many of my favorite films are set in New York City, and also how many of those were made in the 70s and 80s.\n\nMy list:\n\n- Taxi Driver\n- Ghostbusters \n- Teenage Mutant Ninja Turtles\n- Maniac\n- The New York Ripper\n- Dog Day Afternoon\n- Escape from New York\n- Coming to America\n- Dressed to Kill\n\nWhat are your favorites? \n",
        "upvotes": 3,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1gt7h7f/favorite_movies_set_in_new_york_city/"
    },
    {
        "id": "1gt854v",
        "author": "iakgk",
        "title": "Looking for Free Websites to Watch Documentaries! 🎥",
        "content": "Hey everyone!\n\nI’m a huge documentary fan and love exploring all genres, from history and science to true crime and nature. The only problem is that a lot of the good ones require a paid subscription or rental fees, and it really adds up!\n\nDoes anyone know any legit, free websites where I can watch documentaries without needing a subscription? I'm open to suggestions for specific platforms or any hidden gems you all use. Thanks in advance for the help!\n\nP.S. If there are any good YouTube channels with high-quality docs, feel free to drop those as well!",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1gt854v/looking_for_free_websites_to_watch_documentaries/"
    }
]