[
    {
        "id": "1grzjbd",
        "author": "GladiatorMovie",
        "title": "AMA: We're the costume designers for Ridley Scott’s latest epic “Gladiator II.” Ask us anything about our longtime careers in film and TV, and about working on such a huge project. ",
        "content": "We are **Janty Yates** (Costume Designer) and **David Crossman** (Costume Designer – Military Costumes) and we had the pleasure of working on Ridley Scott’s new film, Gladiator II. We’ve both spent decades working in the industry, garnering awards, and working on some of the biggest movies in Hollywood.\n\nWe’ve been on Ridley Scott projects previously, and between the two of us, we’ve worked on franchises like Harry Potter, Star Wars, and Alien. With an eye for detail, and a love of storytelling, our passion for outfitting the right actors in the perfect wardrobes is very special to us both.\n\nIf you want to know more about the process, the methods, and the artistry of costume design for big, epic movies, we’re here to take your questions. \n\nWe are:\n\n* [Janty Yates](https://www.google.com/url?q=https://www.imdb.com/name/nm0946765/&amp;sa=D&amp;source=docs&amp;ust=1731688586703178&amp;usg=AOvVaw3l_HfawFgp6Rgx07DWbfZl), Costume Designer. Yates has worked in this field since 1989 and has two Academy Award nominations, including one win. Gladiator II marks Yates 18th collaboration with Ridley Scott\n\n* [David Crossman](https://www.google.com/url?q=https://www.imdb.com/name/nm0189366/&amp;sa=D&amp;source=docs&amp;ust=1731688586703575&amp;usg=AOvVaw382KB9AjxnnfM3CtG96Jeu), Costume Designer – Military Costume. Crossman has worked as a costume designer since the late 90s and has one Academy Award nomination for Napoleon, which he shares with Yates.\n\nhttps://preview.redd.it/6rn3v7kv731e1.png?width=1988&amp;format=png&amp;auto=webp&amp;s=9248ede2359a90b2ca141dbe26e0fb993ece6c1d",
        "upvotes": 9,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1grzjbd/ama_were_the_costume_designers_for_ridley_scotts/"
    },
    {
        "id": "1grwfhy",
        "author": "MarvelsGrantMan136",
        "title": "Conan O’Brien to Host 2025 Oscars Ceremony",
        "content": "",
        "upvotes": 5425,
        "comments": 365,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Ms9A9tYgYWyusoRqNpUYTmsVynOooqeGYzFYDe1T6xM.jpg?auto=webp&amp;s=6761fa07f8d3a65d7080f5be6bd09f42b9b67365"
        },
        "permalink": "/r/movies/comments/1grwfhy/conan_obrien_to_host_2025_oscars_ceremony/"
    },
    {
        "id": "1grgcjc",
        "author": "JonasKahnwald11",
        "title": "Tom Hardy's Splinter Cell Movie Is Officially Dead (Exclusive)",
        "content": "\"'That movie would have been awesome... Just couldn't get it right, script-wise, budget-wise. But it was going to be great. We had a million different versions of it, but it was going to be hardcore and awesome. That's one of the ones that got away, which is really sad.\" - Basil Iwanyk, producer.",
        "upvotes": 6781,
        "comments": 521,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rhNQb9pPaKA0THD_2P8SFAtdmhry_wNK2PO9YVyfdEo.jpg?auto=webp&amp;s=2554b0af816fd7e38c2eea715b1cc2ed9322274d"
        },
        "permalink": "/r/movies/comments/1grgcjc/tom_hardys_splinter_cell_movie_is_officially_dead/"
    },
    {
        "id": "1grzn77",
        "author": "MarvelsGrantMan136",
        "title": "'Predator: Badlands' Will Have The Predator As Its Hero (First BTS Look Revealed)",
        "content": "",
        "upvotes": 108,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xnRhXx5mkairGkJmsdsi_6r1JSmcOFC15vo7uncnsMc.jpg?auto=webp&amp;s=0e422de590a79619e32a8379e9eb666763357d55"
        },
        "permalink": "/r/movies/comments/1grzn77/predator_badlands_will_have_the_predator_as_its/"
    },
    {
        "id": "1grybhd",
        "author": "TadzioRaining",
        "title": "Katharine Hepburn doesn't get enough praise for her work in \"The African Queen\" (1951)",
        "content": "I know The African Queen is more known for Humphrey Bogart winning the Academy Award for his performance as Charlie Walnut, deserved because he completely transformed himself into an atypical character, away from the usual gumshoe roles he often got.\n\nKatharine Hepburn, though, was outstanding. Seeing her Rose Sayer go from being a conservative spinster into a adrenaline-crazed adventuress and have it come across as organic instead of contrived never ceases to be impressive. She was overshadowed by Humphrey Bogart for many critics. In my mind, she was as equally good as he was. \n\nSpeaking of \"The African Queen\", more film aficionados must discover it. It's a very good picture.",
        "upvotes": 90,
        "comments": 49,
        "media": null,
        "permalink": "/r/movies/comments/1grybhd/katharine_hepburn_doesnt_get_enough_praise_for/"
    },
    {
        "id": "1grn0ii",
        "author": "LiteraryBoner",
        "title": "Official Discussion - Red One [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/ceaZ6NBXL84O)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/ceaZ6NBXL84O)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ZPi3H5nAwrkj) to see the rankings of 2024 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n---\n**Summary:**\n\nAfter Santa Claus (code name: Red One) is kidnapped, the North Pole's Head of Security (Dwayne Johnson) must team up with the world's most infamous bounty hunter (Chris Evans) in a globe-trotting, action-packed mission to save Christmas.\n\n**Director:**\n\nJake Kasdan\n\n**Writers:**\n\nChris Morgan, Hiram Garcia\n\n**Cast:**\n\n* Dwayne Johnson as Callum Drift\n* Chris Evans as Jack O'Malley\n* Lucy Liu as Zoe\n* J.K. Simmons as Nick\n* Bonnie Hunt as Mrs. Claus\n* Kristofer Hivju as Krampus\n* Kiernan Shipka as Gryla\n\n**Rotten Tomatoes:** [33%](https://www.rottentomatoes.com/m/red_one)\n\n**Metacritic:** [34](https://www.metacritic.com/movie/red-one/)\n\n**VOD:** Theaters",
        "upvotes": 500,
        "comments": 374,
        "media": null,
        "permalink": "/r/movies/comments/1grn0ii/official_discussion_red_one_spoilers/"
    },
    {
        "id": "1grv4rw",
        "author": "InevitableSoundOf",
        "title": "A fair number of great movies get remade but what are the ones that missed but should get another shot",
        "content": "I watched The Keep a 1984 Michael Mann movie. I really liked the premise of this ancient evil being held prisoner by an ancient order only for Nazis to kill them and accidentally release it, and a subsequent fight to lock it back up. Great 80's soundtrack and cool visuals, especially the evil being. However the movie feels chopped in half and stapled back together, with massive jumps in story. It doesn't recover and so I understand the movie's low rating.\n\nI feel this movie would be perfect to remake. They could set it in Syria or Iraq where you'd have a similar play out with an ancient evil being released during the war and destruction of the cultural sites. Showcase some of the ancient Mesopotamian evil monster mythology. You could really play into the horror.\n\nWhat would be another example you feel for a movie deserving of a remake?\n\n\n\n\n\n",
        "upvotes": 85,
        "comments": 176,
        "media": null,
        "permalink": "/r/movies/comments/1grv4rw/a_fair_number_of_great_movies_get_remade_but_what/"
    },
    {
        "id": "1grws1a",
        "author": "Admirable_Toe_3897",
        "title": "Disney+ has released a new poster for \"Beatles '64\"",
        "content": "",
        "upvotes": 62,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/05pui9ojl21e1.jpeg?auto=webp&amp;s=309562923f66cb9a65dfb080f9a746c9382d1f8c"
        },
        "permalink": "/r/movies/comments/1grws1a/disney_has_released_a_new_poster_for_beatles_64/"
    },
    {
        "id": "1grppxf",
        "author": "herewego199209",
        "title": "I was literally 3 at the time so I have no clue how this movie was received when it came out, but is Showgirls one of the weirdest bombs for a director who was on an absolute all time tear? Verhoeven just came off of directing Robocop, total recall, and basic instinct 3 iconic classics in a row. ",
        "content": "I always wondered how a director can make three iconic movies that are still viewed today as all time great and influential movies and then direct one of the worst movies of all time. It's not like he was out of his prime either cause his next movie was Starship Troopers. I'm just curious what the reaction was for the time. I also always felt bad for Elizabeth Berkley because that role had to have been seen as a gigantic get after Saved by the bell got cancelled. I have to imagine she thought she was going to be a megastar. ",
        "upvotes": 260,
        "comments": 213,
        "media": null,
        "permalink": "/r/movies/comments/1grppxf/i_was_literally_3_at_the_time_so_i_have_no_clue/"
    },
    {
        "id": "1grs7my",
        "author": "doofwarrior2007",
        "title": "How is Independence day resurgence so bad",
        "content": "I am rewatching Independence Day Resurgence. The amount of exposition in this movie is some of the clunkiest dialog in a movie I have ever had to watch. The characters are acting they are in a mock buster. This movie doesn't even feel like it's sequal to its own franchise. What a waste of an opportunity to have science fiction franchise not based on existing Intellectual property. ",
        "upvotes": 138,
        "comments": 95,
        "media": null,
        "permalink": "/r/movies/comments/1grs7my/how_is_independence_day_resurgence_so_bad/"
    },
    {
        "id": "1grmknh",
        "author": "flowerhoney10",
        "title": "Thomasin McKenzie Joins Gothic Horror Movie ‘Victorian Psycho’",
        "content": "",
        "upvotes": 318,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2le3VDdAorVSGnbV9Omh6DS-51m1akRYpjqmMiCqv6Y.jpg?auto=webp&amp;s=f505802969767169ffe9d175d4e509ca87e9a24b"
        },
        "permalink": "/r/movies/comments/1grmknh/thomasin_mckenzie_joins_gothic_horror_movie/"
    },
    {
        "id": "1grpwkk",
        "author": "Sisiwakanamaru",
        "title": "‘The Bibi Files’ Review: Alex Gibney-Produced Benjamin Netanyahu Doc Paints a Damning Portrait of Arrogance",
        "content": "",
        "upvotes": 154,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3K_KvwH0Qj6lyeqJQeN0J7IBa9rMKcDO_CVNtJZyXJk.jpg?auto=webp&amp;s=f6570b5b69403bfb11c761ac70566136d3503ebb"
        },
        "permalink": "/r/movies/comments/1grpwkk/the_bibi_files_review_alex_gibneyproduced/"
    },
    {
        "id": "1gr9o4c",
        "author": "KillerCroc1234567",
        "title": "THE LAST SHOWGIRL | Official Teaser",
        "content": "",
        "upvotes": 1522,
        "comments": 265,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/skl_VjktMgY_gIVtKj26jddTzc3bYc13e3Lwud104xc.jpg?auto=webp&amp;s=7161162aeafdf07ed30cdafca59057613479a86c"
        },
        "permalink": "/r/movies/comments/1gr9o4c/the_last_showgirl_official_teaser/"
    },
    {
        "id": "1gre4uf",
        "author": "MarvelsGrantMan136",
        "title": "Michael Biehn Returns to Studio Action Movies With Adam Wingard’s ‘Onslaught’ at A24; Reginald VelJohnson &amp; Comedien Eric Wareheim Also Join the Cast",
        "content": "",
        "upvotes": 839,
        "comments": 94,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bLGhqpXkhMA-LcRuWsyR3qCcFQFfzIIbUpzp4j9_8Oo.jpg?auto=webp&amp;s=2619afc5e9662167b087c8446c60db68fb5ff014"
        },
        "permalink": "/r/movies/comments/1gre4uf/michael_biehn_returns_to_studio_action_movies/"
    },
    {
        "id": "1grxex9",
        "author": "bostoncrabsandwich",
        "title": "Corey Feldman on his unearthed 2004 cult classic-to-be, The Birthday",
        "content": "",
        "upvotes": 26,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4oAtqlp0wZRtWMhMWkept22p9cCSoEVahUELP4g_DPI.jpg?auto=webp&amp;s=988be89a772a45009ed34605e56788f8a771aab9"
        },
        "permalink": "/r/movies/comments/1grxex9/corey_feldman_on_his_unearthed_2004_cult/"
    },
    {
        "id": "1grn0jw",
        "author": "LiteraryBoner",
        "title": "Official Discussion - A Real Pain [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/PmdeqIY5UqHs)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/PmdeqIY5UqHs)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ZPi3H5nAwrkj) to see the rankings of 2024 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n---\n**Summary:**\n\nMismatched cousins reunite for a tour through Poland to honor their beloved grandmother. The adventure takes a turn when the odd-couple's old tensions resurface against the backdrop of their family history.\n\n**Director:**\n\nJesse Eisenberg\n\n**Writers:**\n\nJesse Eisenberg\n\n**Cast:**\n\n* Kieran Culkin as Benji Kaplan\n* Jesse Eisenberg as David Kaplan\n* Will Sharpe as James\n* Daniel Oreskes as Mark\n* Liza Sadovy as Diane\n\n**Rotten Tomatoes:** [95%](https://www.rottentomatoes.com/m/a_real_pain)\n\n**Metacritic:** [85](https://www.metacritic.com/movie/a-real-pain/)\n\n**VOD:** Theaters",
        "upvotes": 151,
        "comments": 45,
        "media": null,
        "permalink": "/r/movies/comments/1grn0jw/official_discussion_a_real_pain_spoilers/"
    },
    {
        "id": "1grixlg",
        "author": "Jonny_the_Rocket",
        "title": "I have just finished watching Charlie Chaplin's City Lights (1931). The ending scene is hands down one of the most phenomenal pieces of acting I have ever seen, and it moved me to tears.",
        "content": "",
        "upvotes": 241,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TRY52KIthWx-IH4SAyIr78a8eWDu1ONtp1Mrva8vgG8.jpg?auto=webp&amp;s=d041d12d752d09077024438791dfcdf7b31f5c6e"
        },
        "permalink": "/r/movies/comments/1grixlg/i_have_just_finished_watching_charlie_chaplins/"
    },
    {
        "id": "1gr9qhr",
        "author": "Dracko705",
        "title": "With the newly announced \"Back in Action\" I've hit my breaking point - why are there so many of these disposable streaming movies with massive actors phoning it in?",
        "content": "Can't share more than 1 image but here is an [album I made just now by quickly browsing though similar cash grab-ey comedy/action streaming movies](https://imgur.com/a/X4HIPzy) I'm sure there's plenty more I'm missing.\n\nThis year (2024) really seems to be another level. (Re)uniting huge names known for their collaborations on massive critical/financial successes, but usually putting them in a much \"easiler\" (read: lazier) role or story. \n\nMatt Damon and Casey Afflect, Pitt and Clooney, names like Halle Berry, Christoph Waltz and now Cameron Diaz coming back from long acting breaks... For these piles of crap?!?! \n\nObviously big money is involved which brings up my other confusion, how long are these streamers going to play this arms race continuing to justify losing money on these kinda films?? \n\nAt least back in the day when actors would take the easy \"buddy comedy\" route they have to eat that failure at the box office - these movies don't look cheap either (just crappy-cheap)\n\nWho is asking for these movies?!? And further, who is actually watching/enjoying them!?? (the handful I've seen push me away from the \"genre\")",
        "upvotes": 779,
        "comments": 421,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5ELNwT81M6zqbs1K83BfMHRzwv7X07nxSwRZUONoOus.jpg?auto=webp&amp;s=9fcbd2b67e8f0924783417c6757e237e47aa7cf0"
        },
        "permalink": "/r/movies/comments/1gr9qhr/with_the_newly_announced_back_in_action_ive_hit/"
    },
    {
        "id": "1grgt5z",
        "author": "TadzioRaining",
        "title": "Stand By Me is such a relatable movie, especially if you're a guy and you miss the childhood friendships you once had.",
        "content": "I feel like when we're boys, there is a kind of bonding which we lose as we ger older. As kids, we are more vulnerable, more honest, more able to express our feelings and I must say the first time I saw Stand By Me, I felt the movie was so honest and so real about how young teen boys interact with one another. \n\nThe four leads looked like your average kids and they didn't have perfect families, they all had something going on. Even Gordie, who seemed to have the most stable family life, was dealing with the loss of his older brother and being the \"invisible kid\" in his home life. \n\nThe four boys going on this adventure, looking for a dead body, ends up being a journey where they get to find themselves and grow up. By the end, you feel a change has happened. \n\nAnd it's such a sad movie. River Phoenix was in a league of his own, Chris had everything to be a Juvenile delinquent given how much of an outcast he was in the small town he was stuck in, and instead, he's the nicest and most reasonable boy in ther group, the one who tries to stop the fight and have everyone get along but at the same time, he was tortured by how rejected he was, to the point where he had his heart broken after being betrayed by a grown up, a teacher whom he trusted. \n\nAnd then that last scene breaks your heart. You never forget how impactful it is.\n\nAnd the narrator was right, you never get the kind of friendships you had at 12 as you have as an adult. I didn't understand that as a kid but as an adult,. I now get it.",
        "upvotes": 301,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1grgt5z/stand_by_me_is_such_a_relatable_movie_especially/"
    },
    {
        "id": "1gr7dow",
        "author": "LundgrensFrontKick",
        "title": "When it comes to Dwayne Johnson’s filmography, his films that feature wildly sweaty performances (Fast Five, The Rundown, Pain &amp; Gain) have higher critic and user averages than his less sweaty performances. This isn’t great for Red One, but it’s promising for The Smashing Machine",
        "content": "This is insane. It really is; however, after watching the [*Red One* trailer](https://www.youtube.com/watch?v=7l3hfD74X-4) and seeing the first image from [*The Smashing Machine*](https://www.reddit.com/r/movies/comments/1cx7e6g/first_image_of_dwayne_johnson_in_benny_safdies/)*,* I became convinced that there was a correlation between the sweatiness of a Dwayne “The Rock” Johnson performance and its impact (good or bad) on his career. Between T*he Rundown, Fast Five, Pain &amp; Gain*, and *The Game Plan*, his career heats up when his body is trying to cool down. This is why I’m optimistic about *The Smashing Machine*, as it seems like Johnson is going back to basics to escape his recent VFX-heavy run. *The Smashing Machine* will be a sweaty reset – which is what Johnson has relied on for 20+ years of success. \n\nJohnson has made a career out of talking/posting/writing about his sweat. The tagline for his Under Armour collaboration is “[BLOOD, SWEAT, RESPECT](https://about.underarmour.com/en/stories/2018/11/blood--sweat--respect.html),” and when [talking about his career,](https://www.telegraph.co.uk/films/0/young-rock-inside-dwayne-johnsons-turbulent-delinquent-pre-fame/) he said, “You gotta get up in the morning, you gotta get after it, you gotta put in the work, you gotta sweat. There’s gonna be heavy iron, and there’s gonna be a lot of sweat, and it’s gonna be dirty.” His Instagram posts almost always make sure to include the word “[Sweat](https://www.instagram.com/reel/C-Qr-GNyoYk/?img_index=therock).”. He’s basically worked sweat into his persona ([Sweat Equity ](https://www.instagram.com/therock/p/CQpiWpdFyRq/?hl=en)is his thing), so this data isn’t as random or dumb as you’d think.\n\nThe sweat levels should only go to 10, but after watching his movies again, I had to create an “11” category because there are a handful of movies in which Johnson’s sweat glands work overtime. To place each film in their respective categories, I rewatched his movies, looked for sweaty scenes/moments (Yes – it’s wild, but I had to follow the idea), and came up with a chart. It wasn’t too hard because, since 2017, I’ve been assigned a [handful of Dwayne Johnson data posts ](https://editorial.rottentomatoes.com/article/dwayne-johnsons-12-trillion-movie-damage-bill/)and research assignments, so they’ve familiarized me with his filmography. Also, if you're want to learn more about the data collection I recorded a podcast episode about it (Movies, Films and Flix pod - you can find it anywhere).\n\n* **Category 11 – Red** – The distribution makes me happy\n* **Category 9 – 10 – Purple** – on average, it’s the most lucrative category\n* **Category 5 – 8 – Green** – Hasn’t made a category 5-8 movie since 2017’s **The Fate of the Furious**. \n* **Category 0 – 4 – Orange** – 6 of his last 10 movies fall in this category. \n\nhttps://preview.redd.it/pshv2wn5sv0e1.png?width=1352&amp;format=png&amp;auto=webp&amp;s=11b210c750904264b8e3d997d8f364e0ac701180\n\nSix films fall into the 11 category: *The Rundown, The Game Plan, Fast Five, Pain &amp; Gain, Skyscraper*, and *The Smashing Machine* (it’s hypothetical). In their own way, these movies have proven important in The Rock’s  evolution as an actor and act as cornerstones of his filmography that have influenced his career.\n\nHere’s a quick breakdown. I included longer explanations of their importance below, but these work as nice cliff notes if you are in a hurry or hate reading. \n\n* **The Rundown (2003)** – In an interview with [The Boston Globe](https://www.goupstate.com/story/news/2004/04/02/the-rock-by-any-other-name-would-still-walk-tall/29712571007/), Johnson said that when *The Rundown* was met with praise from critics, action fans, and general audiences, he went from “The Rock” to Dwayne “The Rock” Johnson – which to him meant that people were starting to take him seriously. \n* **The Game Plan (2007)** – After *Walking Tall, Doom, Gridiron Gang,* and *Be Cool,* Johnson needed a hit, which came in the form of the PG-Rated Disney film *The Game Plan*. Not only did it help him build a new fanbase, but it was his first non-action film to make more than $100 million worldwide. \n* **Fast Five (2011)**– Once again, after *Southland Tales, Race to Witch Mountain, Tooth Fairy,* and *Faster*, Johnson found new management and reset his career path. He shaved his head, gained 30 pounds, and got mean again for *Fast Five.* This propelled him into the action stratosphere.\n* **Pain &amp; Gain (2013)** – Not only does it feature his best performance, but it’s also his best R-rated film, and he will probably never play a character like this again. In 2013, both *Pain &amp; Gain* and *Snitch* failed to clear $100 million at the worldwide box office – that hasn’t happened since. \n* **Skyscraper (2018)** – The movie underwhelmed at the box office and kicked off a new era of “immortal Superman” Johnson. It’s wild watching this film now and seeing a Dwayne Johnson character crying while cradling his daughter atop a burning skyscraper (don’t worry, Neve Campbell saves the day). \n\n**Here are longer explanations of why these films are important (if you read the above section, you can skip to the numbers below)**\n\n**1. The Rundown (2003)** – Johnson’s first starring role in *The Scorpion King* was a success, and it did well theatrically. Still, Johnson wanted other roles to prove he could carry a dialogue-heavy action film that wasn’t part of an existing franchise. Johnson took *The Rundown* role to step up his acting game and credits director Peter Berg as his “personal acting coach on set every day.” After watching the film, [Ebert gave it 3.5 stars](https://www.rogerebert.com/reviews/the-rundown) and dropped this doozy of a compliment\n\n* [Ebert ](https://www.rogerebert.com/reviews/the-rundown)– “Early in “The Rundown,” The Rock enters a nightclub to confront some tough guys, and he passes Arnold Schwarzenegger on the way out. ‘Have a good time,’ Arnold says. It’s like he’s passing the torch. Whether The Rock will rival Schwarzenegger’s long run as an action hero is hard to say — but on the basis of “The Rundown,” he has a good chance.”\n\n* I like this David Shoemaker paragraph from his [Grantland](https://grantland.com/features/a-look-career-dwayne-rock-johnson-eve-wrestlemania-29-new-film-pain-gain/) days – “For the first time, Johnson feels like a legitimate star, but that’s mostly thanks to director Peter Berg, who understood that Johnson’s true talent was his humor. Rather than portray Johnson as a muscly automaton in some hard-boiled revenge tale, Berg made a grimy comedy and allowed Johnson to have fun. Even the fight scenes (of which there are many) are played for chuckles.”\n\nJohnson went all out ([he lost 20 pounds for the role to be more lean](https://www.muscleandfitness.com/features/9-rock-s-greatest-movie-roles-and-unique-body-he-brought-each-one/)), and the positive reviews proved that he could headline a reasonably successful action film. It was a big step in his acting career, and in an interview with [The Boston Globe](https://www.goupstate.com/story/news/2004/04/02/the-rock-by-any-other-name-would-still-walk-tall/29712571007/), Johnson said that after acting in *The Rundown*, he went from “The Rock” to Dwayne “The Rock” Johnson – which to him meant that people were starting to take him seriously.\n\n**Importance of the Sweaty Role**—He carried a critically appreciated action film and proved he could act alongside people like Christopher Walken. It was his first critically adored film and his only Fresh (60% or higher Tomatometer score) film for eight years (2003 – 2011). It’s still his highest-rated “Dwayne Johnson” film (*Hobbs and Shaw,* he’s a co-lead, and he’s part of an ensemble in *Fast Five* and the *Jumanji* films). \n\n**Best Moment(s)** – His character does wipe out an entire army, but it’s nice when he looks fallible. There are some good scenes [when he has his butt kicked](https://www.youtube.com/watch?v=WJXF9gcUcNU&amp;list=PLZbXA4lyCtqrLErljYah2rRpWvQANP9Ut&amp;index=7&amp;pp=iAQB), [gets harassed by baboons](https://www.youtube.com/watch?v=VdYPqVZIB9M&amp;list=PLZbXA4lyCtqrLErljYah2rRpWvQANP9Ut&amp;index=6&amp;pp=iAQB), and [rolls down hills](https://youtu.be/jKyhNbLEKxY?list=PLZbXA4lyCtqrLErljYah2rRpWvQANP9Ut). \n\n**2. The Game Plan (2007)** – *The Game Plan* was Johnson’s first $100 million grossing film since *The Scorpion King* (2002), proving he could headline family-friendly comedies. Johnson said he wanted to make a [movie that his daughter could watch,](https://www.blackfilm.com/20070921/features/dwaynejohnson.shtml) but it was mainly a smart pivot after *Doom, Be Cool*, and *Walking Tall* didn’t take off. It definitely boosted his box office marketability, and he went on to appear in *Get Smart, Tooth Fairy, Race to Witch Mountain*, and *The Other Guys* (which all grossed over $100 million). \n\n**Importance of Sweaty Role** – Johnson picked up a new fan base, and the role helped re-spark his career for a short time. \n\n**Best Moments** – He [cries](https://youtu.be/ZD8wDJKzEgY), [dances](https://www.youtube.com/watch?v=NFwBMwCOF-Q&amp;pp=ygUYdGhlIGdhbWUgcGxhbiAyMDA3IGRhbmNl), [sings](https://www.youtube.com/watch?v=VQuA6Iobmqw&amp;pp=ygUYdGhlIGdhbWUgcGxhbiAyMDA3IGRhbmNl), [sweats](https://youtu.be/XGQRDirweUM), [reads](https://www.youtube.com/watch?v=CI17vaYpW1A&amp;list=PLBtsbn2MpaQ83fKOnSR0dt4Wqwe7-QOR7&amp;index=9&amp;pp=iAQB), and [sings more](https://www.youtube.com/watch?v=MfKjInbMjnw&amp;list=PLBtsbn2MpaQ83fKOnSR0dt4Wqwe7-QOR7&amp;index=20&amp;pp=iAQB). You can legitimately feel the desperation and willingness to do anything to make the movie work.\n\n**3. Fast Five (2011) –** *Fast Five* currently has his highest IMDb and Letterboxd scores of any Johnson film, and it legitimately propelled him into the big leagues. On the set of *Fast Five*, he told his makeup artist to [leave him alone and let him be sweaty](https://x.com/TheRock/status/1336855153719185408)—this paid off. \n\n[In an interview with Esquire](https://www.esquire.com/entertainment/interviews/a36037/dwayne-johnson-the-rock-0815/), Johnson said he had a moment of clarity in 2010 when he realized he had to “stop, readjust, reassess, and change everything around me—and I gotta take one more shot.” He needed to take one more shot at superstardom after years of movies like *Faster, Race to Witch Mountain, Tooth Fairy*, and *Planet 51* (*Southland Tales* didn’t help either), lowered his stock, and halted any growth as an actor. So, he changed up his management, and after years of talking to Vin Diesel about joining the *Fast and Furious* franchise, he shaved his head, grew an insane goatee, and put on [30 pounds of weight](https://www.muscleandfitness.com/features/9-rock-s-greatest-movie-roles-and-unique-body-he-brought-each-one/#:~:text='Fast%20Five'%20(2011),-Johnson's%20turn%20as&amp;text=of%20crime%20fighter.-,After%20years%20of%20leaner%20roles%20in%20films%20like%20Tooth%20Fairy,doughy%2Dby%2Dcomparison%20Diesel.) (after years of being encouraged to lose weight) to play Luke Hobbs in *Fast Five*. The film was a gigantic hit, propelling Johnson into the action stratosphere. It’s worth noting that this is easily his sweatiest film – and probably his best action movie. \n\n**Importance of the Sweaty Role** – He got mean again and kicked some ass. \n\n**Best Moment** – [He loses a fight to Vin Diesel](https://www.youtube.com/watch?v=k2PsfXZ3wyY&amp;pp=ygUPZmFzdCBmaXZlIGZpZ2h0). This won’t happen again. \n\n**4. Pain &amp; Gain (2013)** – *Pain &amp; Gain* features Johnson’s best performance (he’s perfect in it), and it was nice seeing him back in R-rated territory after *Faster, Southland Tales*, and *Doom* didn’t click with the mainstream. Johnson accepted a massive pay cut (the main actors all did this for a cut of the backend) because he loved the complexity of the role, and it was a nice departure from his typical type of role. The film didn’t make much money, but it’s a beautifully sweaty (and nasty) piece of Michael Bay R-rated Bayhem. What’s interesting is that since *Pain &amp; Gain*, he’s veered away from performances like this and, in 2018, said, “[No one’s going to see me play a borderline psychopath suffering from depression](https://www.rollingstone.com/tv-movies/tv-movie-features/dwayne-johnson-the-pain-and-the-passion-that-fuel-the-rock-630076/).” This is kind of a bummer because he’s given up on edgy performances that push him as an actor and instead dove into more safe comedies and action films. \n\n**Quick Note** – [During a 2024 GQ article](https://www.gq.com/story/dwayne-johnson-men-of-the-year-cover-2024) he backtracked on his 2018 comments and said “I don’t know who the f\\*\\*k that guy is.”\n\n**Importance of the Sweaty Role** – It proved he still had an edge and could push himself in non-blockbusters. Also, as Johnson said, “[The biggest departure](https://theultimaterabbit.com/2019/06/09/dwayne-johnson-on-getting-pumped-up-for-pain-gain/) (for me) was the vulnerability, showing this type of vulnerability and playing a character who is easily influenced and who’s just out of prison and looking for salvation.”\n\n**Best Moments** – [The neighborhood watch](https://www.youtube.com/watch?v=diiaCw3frzo&amp;pp=ygUSUGFpbiBhbmQgR2FpbiAyMDEz) scene is wonderful. [He’s terrible at robbing banks](https://www.youtube.com/watch?v=J8lQy1CTlZk&amp;pp=ygUSUGFpbiBhbmQgR2FpbiAyMDEz), and [I’m pretty sure we’ll never see him grill a hand again](https://www.youtube.com/watch?v=esg4w4b2xvc&amp;list=PLZbXA4lyCtqr50cPGNoGN1w-TAWqYwpMr&amp;index=10&amp;pp=iAQB).\n\nOverall, it’s easily his best R-rated film. \n\n**5. Skyscraper (2018)** – *Skyscraper* didn’t make globs of money or achieve critical praise, BUT it features a different type of Johnson performance. SPOILER – At the end of the film, he’s sitting atop a skyscraper and awaiting his death while he clings to his daughter (he’s also crying, which is rare). At the last second, Neve Campbell saves the day and resets the skyscraper’s fire extinguishers. The movie received a lot of pre-buzz because Johnson’s character lost a leg and had to save the day with a prosthesis. It’s an odd choice (I guess it takes away from his superhuman prowess), but he went on an all-out promotional campaign and seemed to genuinely care about normalizing disabilities. \n\nInterestingly, this is probably the last time we’ll see this kind of character from Johnson. He tried to play a “normal guy,” and it didn’t work. He followed it up with *Hobbs and Shaw* (Hobbs becomes a superhero in it), *Jumanji: The Next Level* (plays a dude named Smolder Bravestone), *Jungle Cruise* (no spoilers – you’ll see), *Red Notice* (barf) and *Black Adam* (wildly powerful). They are miles away from his *Skyscraper* character and more in line with his over-the-top persona. So, even though *Skyscraper* wasn’t a hit, his decisions were somewhat altered because of its lack of success. \n\n**Importance of the Sweaty Role** – His plan didn’t work, and he slowed his film output. He played a major role in seven films between 2016 and 2018, and has appeared in six films in the last five years. \n\n**Best Moment** – [The finale of the film sees him cradling his daughter while they wait to be burnt alive (he’s also crying)](https://www.youtube.com/watch?v=M06KzvYxlsc&amp;pp=ygURc2t5c2NyYXBlciBlbmRpbmc%3D). He REALLY wanted to seem fallible. \n\n**Why do I think The Smashing Machine will be a sweaty success?**\n\n[Here’s a quote from a recent GQ article](https://www.gq.com/story/dwayne-johnson-men-of-the-year-cover-2024) – “It was also an opportunity for me, I realized, to stretch myself in ways that I hadn’t been stretched yet, and also challenge myself in ways that I hadn’t been challenged.”\n\nBetween *Red Notice, Black Adam, Jungle Cruise,* and the upcoming *Red One,* Johnson has taken a lot of flak for reportedly being the alleged reason for the swelling budgets and less-than-stellar critical and box office results (there are other reasons, of course…). His *Fast X* appearance didn’t light the world on fire either. So, when it was announced that he was going to star in the Benny Safdie-directed *The Smashing Machine*, a film adaptation named after the excellent 2002 documentary about MMA fighter Mark Kerr ([watch the doc – it’s awesome](https://youtu.be/-7DO5c7gWNw)) – I knew it was Johnson pulling a hard reset on his VFX heavy blockbuster run. When I saw the sweaty first image, it became obvious that Johnson was up to his old tricks he’s used throughout his career (hard resets and sweaty pivots). What’s funny is that Safdie and Johnson had talked about making the film since 2019, when Johnson bought the rights to Kerr’s story. Johnson admittedly [ghosted Safdie for several years](https://www.indiewire.com/news/general-news/dwayne-johnson-benny-safdie-mark-kerr-movie-1234940165/) (“Benny thought I ghosted him, and maybe I was just a f\\*\\*\\*in’ asshole”), but after years of not-so-great movies and a chat with Emily Blunt, Johnson called Safdie back, and now they’ve made the movie. Johnson says he hasn’t quit “four-quadrant blockbusters,” but he needed a career reset to explore films with more humanity. It’s a smart move – and it all points back to sweaty performances. \n\n**The Numbers**\n\nWhat’s really interesting is that his incredibly sweaty films have a slightly higher critical/user average than his less-sweaty movies. The differences aren’t anything big, but they prove that a little extra sweat helps.  \n\n**11 – Wild Amounts of Sweat**\n\n* Tomatometer Average – 55.2\n* Letterboxd Average – 2.9\n* IMDb Average – 6.5\n* Box Office Average  – $249 million\n* Movies – *The Rundown, The Game Plan, Fast Five, Pain &amp; Gain, Skyscraper*\n* *Fast Five* has the highest IMDb score (7.3) and Letterboxd score (3.4)\n* *The Game Plan* was his first non-action film to clear $100 million worldwide\n* *The Rundown* was his first film with a Fresh Tomatometer Score\n\nThe biggest drawback to sweat-heavy movies is that they aren’t huge earners. However, when done right, they lead to bigger box office results. This is why Johnson is taking the role in the A24-produced *The Smashing Machine*. \n\n**9-10 – Sweat City**\n\n* Tomatometer Average – 54%\n* Letterboxd Average – 2.58\n* IMDb Average – 6.2\n* Box Office Average – $613 million (Aside from *Doom*, these movies make money. )\n* Movies – *Furious 7, Doom, Fast and Furious Presents: Hobbs and Shaw, Rampage,*\n* *Furious 7* is his highest-grossing film and most critically lauded\n* *Hobbs and Shaw* is his highest-grossing film, with only one co-lead (Statham)\n* *Rampage* is the fourth highest-grossing video game adaptation\n\n\n\n**5-8 – Gonna Need a New Shirt**\n\n* Tomatometer Average – 40.9%\n* Letterboxd Average – 2.48\n* IMDb Average – 6\n* Box Office Average – $268 million\n* Movies – *Hercules, Journey 2: The Mysterious Island, Walking Tall, The Scorpion King, Tooth Fairy, GI Joe Retaliation, The Fate of the Furious, The Gridiron Gang, Race to Witch Mountain, Faster*\n* *Note –* None of these films feature an overly excessive amount of sweat. \n* Only one of these films scores 60% or more on Rotten Tomatoes.\n* He hasn’t made a 5-8 category movie since 2017’s *The Fate of the Furious*. \n\n**0 – 4 – Zero to Light Sweaters**\n\n* Tomatometer Average – 53.2\n* Letterboxd Average – 2.72\n* IMDb Average – 6.28\n* Box Office Average – $356 million\n* Movies – *Southland Tales, Jumanji: Welcome to the Jungle, Jumanji: The Next Level, Jungle Cruise, San Andreas, The Mummy Returns, Baywatch, Fast &amp; Furious 6, Snitch, Get Smart, Central Intelligence, Be Cool, The Other Guys, Empire State, Black Adam, Red Notice*\n* *Red Notice, Black Adam, and Red One* fall in this category, and they have a 38% Tomatometer average. Not great. \n* *Notes – Race to Witch Mountain and San Andreas* feature sweaty shirts but very little sweat. \n* *Jumanji 2 &amp; 3* and *Central Intelligence* are all wildly popular and prove the Hart/Johnson connection is strong. \n\n**In conclusion** – *The Smashing Machine* is a smart reset for Johnson.\n\n**Make sure to check out my other Reddit data posts if you like this one! Also, if you're bored, I've covered many films on The Movies, Films and Flix podcast (it's available wherever you listen to podcasts). Also, make sure to listen to Deep Blue Sea - The Podcast**\n\n[Movies featuring snowmobile action scenes are way cooler than movies featuring jet ski action scenes](https://www.reddit.com/r/movies/comments/a6pkia/movies_featuring_snowmobile_action_scenes_have_an/)\n\n[Analyzing the unnecessarily large trap in Predators](https://www.reddit.com/r/movies/comments/8lazju/the_unsuccessful_and_unnecessarily_large_trap/)\n\n[How old is MacGruber?](https://www.reddit.com/r/movies/comments/gf78us/using_clues_from_the_2010_film_macgruber_i/)\n\n[In the scream franchise, less screams are better](https://www.reddit.com/r/movies/comments/s29j45/i_rewatched_the_scream_franchise_and_recorded/)\n\n[Who is the meanest person in Mean Girls?](https://www.reddit.com/r/movies/comments/w4jzqv/i_rewatched_mean_girls_2004_counted_the_mean/)\n\n[The Con Air seating chart](https://www.reddit.com/r/movies/comments/jsa8hc/after_several_viewings_of_con_air_that_involved/)\n\n[Jacked Up - A Perfectly Bad Adam Sandler Film](https://www.reddit.com/r/movies/comments/ha4t7t/adam_sandler_said_he_would_make_a_terrible_film/)\n\n[Deep Blue Sea is the most shark movie ever](https://www.reddit.com/r/movies/comments/1e9fiq3/when_it_comes_to_shark_cinema_jaws_is_the_best/)\n\n[In Bloodsport, Chong-Li lost on purpose](https://www.reddit.com/r/movies/comments/r0gkr2/after_analyzing_every_fight_punch_split_headbutt/)\n\n[What is the most Fast &amp; Furious film in the Fast &amp; Furious franchise?](https://www.reddit.com/r/movies/comments/gnzkuk/i_wanted_to_know_which_of_the_nine_fast_furious/)\n\n[How long did it take The Joker's henchmen to build the cash pyramid in The Dark Knight?](https://www.reddit.com/r/movies/comments/d86rxc/in_the_dark_knight_im_thinking_it_took_16/)\n\n[Brad Pitt eating and box office numbers](https://www.reddit.com/r/movies/comments/b3fgxb/brad_pitt_movies_featuring_him_consuming_200/)\n\n[Ranking all the times that “Murph” or “Murphy” is mentioned in Interstellar (2014)](https://www.reddit.com/r/movies/comments/1f2jiae/i_ranked_the_85_times_that_murphy_murph_cooper_is/)\n\n[JCVD and his splits](https://www.reddit.com/r/movies/comments/6slzyy/movies_that_feature_jcvd_doing_3_splits_have_a/)\n\n[Encino Man and the Ice Chunk Movement](https://www.reddit.com/r/movies/comments/uwsbbs/im_a_big_fan_of_encino_man_1992_and_brendan/)\n\n[How Far Did the Shark Travel in Jaws: The Revenge?](https://old.reddit.com/r/movies/comments/922rgz/during_its_18_day_brody_hunt_the_psychic_shark_in/)\n\n[Matthew McConaughey's massive jump in Reign of Fire](https://www.reddit.com/r/movies/comments/6r5tjv/matthew_mcconaughey_broke_every_long_jump_record/)\n\n[People love cold Stallone](https://www.reddit.com/r/movies/comments/18z9fns/between_first_blood_rocky_cliffhanger_rocky_iv/)\n\n[How Far Does the Creature From It Follows Travel?](https://www.reddit.com/r/movies/comments/7xzadn/im_a_big_fan_of_the_creature_in_it_follows_so_i/)\n\n[People love a bearded Kurt Russell](https://www.reddit.com/r/movies/comments/6mvjgj/movies_that_feature_a_beardedmustachioed_kurt/?utm_content=title&amp;utm_medium=api&amp;utm_source=reddit&amp;utm_name=movies)\n\n[Tracking the Merman's Murderous Journey](https://www.reddit.com/r/movies/comments/6k2kwl/after_analyzing_the_underground_corridors_and/)\n\n[Michael Myers road trip in Halloween H20](https://www.reddit.com/r/movies/comments/6bicq9/after_researching_various_maps_1971_buick_skylark/)\n\n[Stellan Skarsgard's journey in Deep Blue Sea was gnarly](https://www.reddit.com/r/movies/comments/6adtem/after_a_fair_amount_of_research_calculations_and/)\n\n[How Fast Can Leatherface Run?](https://www.reddit.com/r/movies/comments/6g10u4/the_texas_chainsaw_massacre_remake_has_taught_me/)\n\n[Jet Ski Action Scenes Are the Worst](https://www.reddit.com/r/movies/comments/5ckqc0/movies_that_feature_jet_ski_action_scenes_have_an/)\n\n[A Breakdown of the Events Leading Up to Sam Jackson's Demise in Deep Blue Sea](https://www.reddit.com/r/movies/comments/cf7vdp/in_honor_of_the_upcoming_20th_anniversary_of_deep/)\n\n[The Fast &amp; Furious &amp; Corona](https://www.reddit.com/r/movies/comments/64tine/the_fast_and_the_furious_movies_that_feature/)\n\n[How Did the Geologist Get Lost in Prometheus?](https://www.reddit.com/r/movies/comments/6ogg4n/after_lots_of_research_guesswork_and_analyzing/)\n\n[How Long Does it Take Horror Villains to Travel From NYC to San Francisco?](https://www.reddit.com/r/movies/comments/6xe3ra/after_analyzing_hiking_trails_gas_stops_and_how/)\n\n[Michael Myers Hates Using His Turn Signal](https://www.reddit.com/r/movies/comments/79nnfd/i_originally_guessed_that_michael_myers_used_his/)\n\n[Can Jason Voorhees teleport?](https://www.reddit.com/r/movies/comments/764lpp/after_analyzing_the_dimensions_of_the_disco/)\n\n[How Long Did the Joker Need to Setup the Weapon Circle in Suicide Squad?](https://www.reddit.com/r/movies/comments/7dd36u/the_joker_needed_at_least_65_minutes_to_lay_out/)\n\n[How Much Time Did Batman Need to Setup the Bat Fire Symbol in The Dark Knight Rises?](https://www.reddit.com/r/movies/comments/aztwvv/based_on_the_12hour_ticking_clock_it_took_batman/)\n\n[How Much Sand Did Elektra's Sandbag Trainer in Daredevil (2003) Require?](https://old.reddit.com/r/movies/comments/905y4r/elektras_sandbag_trainer_in_daredevil_2003/)\n\n[Breaking down The Mariner vs. Sea Eater battle in Waterworld](https://www.reddit.com/r/movies/comments/7qsqzr/the_kevin_costner_vs_sea_eater_scene_in/)\n\n[Analyzing the Posters for Nicholas Sparks' Book Adaptations](https://www.reddit.com/r/movies/comments/7xj0wq/movies_adapted_from_nicholas_sparks_books_that/)\n\n[How far Did Nic Cage Run Around in a Bear Suit in The Wicker Man Remake?](https://www.reddit.com/r/movies/comments/84diy0/i_love_it_when_nic_cage_runs_amok_while_disguised/)\n\n[How Many Bullets Missed John Matrix in Commando?](https://www.reddit.com/r/movies/comments/994tn1/an_estimated_3007_bullets_flew_past_john_matrix/)\n\n[How Much Blood Poured Out of the Sprinklers During the \"Blood Rave\" in Blade?](https://www.reddit.com/r/movies/comments/al1p43/blades_blood_rave_required_at_least_425_gallons/)\n\n[Michael Myers Loves Doing Laundry](https://www.reddit.com/r/movies/comments/9p9nch/halloween_movies_featuring_michael_myers_using/)\n\n[Dolph Lundgren and His Front Kicks](https://www.reddit.com/r/movies/comments/9qpeu4/im_pleased_to_announce_that_dolph_lundgren_movies/)\n\n[How Many Calories Did Shaggy and Scooby Doo Ingest When They Ate the Cotton Candy Glob?](https://www.reddit.com/r/movies/comments/adwqbr/shaggy_and_scoobydoo_consumed_at_least_35000/)",
        "upvotes": 958,
        "comments": 91,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LDoj8leTgxKkqNaTtwqzWjCTUQBBxK-Yw1tCNk03rW8.jpg?auto=webp&amp;s=c74e4e3b2e5b0efabfff01c4b3a7486416e777be"
        },
        "permalink": "/r/movies/comments/1gr7dow/when_it_comes_to_dwayne_johnsons_filmography_his/"
    },
    {
        "id": "1grgfjx",
        "author": "KillerCroc1234567",
        "title": "Jay Baruchel Reteaming With ‘Goon’s Michael Dowse On Comedy ‘The Stunt Driver’ ",
        "content": "",
        "upvotes": 270,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ArMRFhlBa949CZYX-8wbC5UJDbSZ08QSifoglJOd0hE.jpg?auto=webp&amp;s=cf61b22fc211feb02386e5ac42e24c1a43b610ab"
        },
        "permalink": "/r/movies/comments/1grgfjx/jay_baruchel_reteaming_with_goons_michael_dowse/"
    },
    {
        "id": "1gryfti",
        "author": "Bennett1984",
        "title": "Emmanuelle - Official Trailer",
        "content": "",
        "upvotes": 10,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZcC1cCcAEX-YEu-gR-CszHGVQdES4wMLihWR2ggrGo8.jpg?auto=webp&amp;s=9ee0207c39b362a0541b8745f675e1dde8732697"
        },
        "permalink": "/r/movies/comments/1gryfti/emmanuelle_official_trailer/"
    },
    {
        "id": "1grup7b",
        "author": "SyrupKitchen",
        "title": "Is there a movie similar to The Devil wears Prada?",
        "content": "I recently watched it after years and years and what a great movie it is. Now I always put it on to relax to.\n\nDo you guys know something else that’s this smart, easy, classy, funny, well made, with a similarly great cast? And set in NYC would be a big bonus.\n\nIf you don’t share the same opinion about this movie, please refrain from commenting.\n\nThank you so much!",
        "upvotes": 22,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1grup7b/is_there_a_movie_similar_to_the_devil_wears_prada/"
    },
    {
        "id": "1gs0b48",
        "author": "KillerCroc1234567",
        "title": "'Forbidden Planet' Set By Warner Bros: Brian K. Vaughan Writing &amp; Emma Watts Producing Revisionist Version Of Touchstone 1956 Sci-Fi Pic",
        "content": "",
        "upvotes": 6,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j7mzz60UBseS9-0sJohCYcy8zcEtO-soSLow_QfrtdA.jpg?auto=webp&amp;s=ce2f1250b2c08ba3e590b4c4fb7a3f7ce3a90c77"
        },
        "permalink": "/r/movies/comments/1gs0b48/forbidden_planet_set_by_warner_bros_brian_k/"
    },
    {
        "id": "1grzifb",
        "author": "horse_renoir13",
        "title": "What's an example of an outstanding trailer for a film, that turned out to be a sub-par/bad movie?",
        "content": "With the upcoming release of Wicked, I stumbled upon the trailer for \"Oz, the Great and Powerful\". The effects looked visually stunning from the outset, along with the stinger for the Wicked Witch of the West at the end. The movie seemed to have all the hype back in the day, but managed to fall well short of expectations. \n\nhttps://www.youtube.com/watch?v=DylgNj4YQVc",
        "upvotes": 6,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mRSdPHgXEh-cvmolA_7i2idZRidwxKrpXCBQROFffb0.jpg?auto=webp&amp;s=7ee8ca48e6c6632e1a02b9610cccdb54910b6e82"
        },
        "permalink": "/r/movies/comments/1grzifb/whats_an_example_of_an_outstanding_trailer_for_a/"
    },
    {
        "id": "1gr7vr4",
        "author": "TimberLanduae",
        "title": "Netflix Release the latest Poster for \"Spellbound\"",
        "content": "",
        "upvotes": 493,
        "comments": 281,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bux8mugh2w0e1.jpeg?auto=webp&amp;s=640e4ee14a88ab972f8cd73578875621216f3a91"
        },
        "permalink": "/r/movies/comments/1gr7vr4/netflix_release_the_latest_poster_for_spellbound/"
    },
    {
        "id": "1grq129",
        "author": "dcterr",
        "title": "Across the Universe",
        "content": "Who here has seen this movie? I've watched it about 5 times, and I never get tired of it! I've loved the Beatles for most of my life, and this is about the best movie I've seen that features their music and is largely based on their history, in particular, on what was going on during the 60s, both in England and in the USA. The story, acting, music, and cinematography are all excellent IMO!",
        "upvotes": 25,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1grq129/across_the_universe/"
    },
    {
        "id": "1grzv2n",
        "author": "OneHellOfAPotato",
        "title": "The Adventures of Baron Münchausen(1988) - The life of a story",
        "content": "So, a few years ago, I was able to watch for the first time the amazing movie called \"The Adventures of Baron Munchausen, and it blew me away. However, whenever I tried to read about it online, people only ever seemed to talk about the hellish production and how much of a bomb it was, which, sure, that's interesting, but no one seemed to discuss the story!\n\n  \nI don't know how many of you have seen this movie, but to me, its main theme is the phenomena of transmission. This can be seen with the Baron (who is supposed to be an in-universe fictional character) who starts the movie as a decrepit old man but, through his adventures with the young girl Sally, he starts to get rejuvenated, his hair unwhitens, his face uncrinkles, as he is being ressucitated through contact with the younger generation, much like a story.\n\n  \nI'm not sure how much of this theory is purely me overanalyzing the movie, but it seemed so obvious to me. The Adventures of Baron Munchausen tells the life of a story, of the way culture stays living. It's all about the importance of telling stories. In fact, this movie both discusses transmission and acts out transmission at the same time! \n\n  \nBecause who remembered Baron Munchhausen, the old german tall-tale-teller? I didn't. But that movie allowed me to learn about his existence and read his stories (which bangs btw go read it especially the version with the Gustave Doré illustrations). It was able to transmit the story of the Baron onto me, and so I have read some of his stories to my younger cousins.\n\n  \nAnyway, didn't really want to write such a huge wall of text, but I mostly wanted to discuss the story of the Terry Gilliam movie about the Baron. What do you guys think about the story? Am I just overanalyzing?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1grzv2n/the_adventures_of_baron_münchausen1988_the_life/"
    },
    {
        "id": "1gr6xpt",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Back in Action' - Years after giving up life as CIA spies to start a family, Emily (Cameron Diaz) and Matt (Jamie Foxx) find themselves dragged back into the world of espionage when their cover is blown",
        "content": "",
        "upvotes": 376,
        "comments": 270,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/16dltpv8vv0e1.jpeg?auto=webp&amp;s=bc6fa57a3325881a48fd17184b141f49ac4be397"
        },
        "permalink": "/r/movies/comments/1gr6xpt/official_poster_for_back_in_action_years_after/"
    },
    {
        "id": "1grypqe",
        "author": "Impossible_Werewolf8",
        "title": "Favorite movie by european country: Italy",
        "content": "Hello there,\n\nyesterday I've asked you about your favorite movie set in Ireland, and we have a clear winner: I'm honestly surprised that it isn't *The Banshee of Inisherin*, and I haven't seen it yet, but I'm sure that ***The Wind That Shakes the Barley*** is at least as worthy a winner.\n\nDespite the fact that there were some exhausting discussions about whether Northern Ireland is part of the UK or not and  of what is actually a country or not, I have to say: Wow, that was quite a round! I don't think any thread from this little game has ever had this much participation. Thanks for that in any case! And now I ask you to continue just as diligently when it comes to **Italy**. As always, there are only two rules:\n\n* It's about where the movie is set plot-wise and not about where the movie was filmed. In case of historical movies, it's important that the bigger part of the movie takes place in a geogprahical territory, that is official part of the given country today.\n* Winner movie is the movie with the most upvotes (minus the given downvotes) after 24 hours. Therefore, it's important that you only mention one movie per comment and that you check up if you're movie was mentioned in an earlier comment before you suggest it.\n\nI'm really looking forward to your film suggestions!\n\n\n\n&gt;Day 22: Ireland - The Wind That Shakes the Barley\n\n&gt;Day 21: Iceland - Englar Alheimsins (engl.: Angels of the Universe)\n\n&gt;Day 20: Hungary - Sátántangó\n\n&gt;Day 19: Greece - Κυνόδοντας (engl.: Dogtooth)\n\n&gt;Day 18: Germany - Das Leben der Anderen (engl.: The Lives of Others)\n\n&gt;Day 17: Georgia - ცისფერი მთები ანუ დაუჯერებელი ამბავი (engl.: Blue Mountains)\n\n&gt;Day 16: France - La Haine\n\n&gt;Day 15: Finland - Mies vailla menneisyyttä (engl.: The Man Without a Past)\n\n&gt;Day 14: Estonia - Vehkleja (engl.: The Fencer)\n\n&gt;Day 13: Denmark - Jagten (engl.: The Hunt)\n\n&gt;Day 12: Czechia - Spalovač mrtvol (engl.: The Cremator)\n\n&gt;Day 11: Cyprus - Smuggling Hendrix\n\n&gt;Day 10: Croatia - Kako je počeo rat na mome otoku (engl.: How the War Started on My Island)\n\n&gt;Day 9: Bulgaria - Източни пиесиИзточни пиеси (engl.: Eastern Plays)\n\n&gt;Day 8: Bosnia and Herzegovina - Ničija zemlja (engl.: No Man's Land)\n\n&gt;Day 7: Belgium - In Bruges\n\n&gt;Day 6: Belarus - Иди и смотри (engl.: Come and See)\n\n&gt;Day 5: Azerbaijan - Yuxu (engl.: The Dream)\n\n&gt;Day 4: Austria - Funny Games\n\n&gt;Day 3: Armenia - Նռան գույնը (engl.: The Color of Pomegranates)\n\n&gt;Day 2: Andorra - El fred que crema (engl.: The Burning Cold)\n\n&gt;Day 1: Albania - Lulekuqët mbi Mure (engl.: Red Poppies on Walls)",
        "upvotes": 4,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1grypqe/favorite_movie_by_european_country_italy/"
    },
    {
        "id": "1gr9mb8",
        "author": "mayukhdas1999",
        "title": "THE ROOM NEXT DOOR - Official Trailer | A film by Pedro Almodóvar starring Tilda Swinton &amp; Julianne Moore",
        "content": "",
        "upvotes": 221,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LSc9WPIN2eAkwBBNShlgRYrqHWAF0DLa9zx2BiB1vHc.jpg?auto=webp&amp;s=b8b0ebdd39289a121b19382bf48cc6fa8c5fcd1c"
        },
        "permalink": "/r/movies/comments/1gr9mb8/the_room_next_door_official_trailer_a_film_by/"
    }
]