[
    {
        "id": "1orqkms",
        "author": "ViolentEndsAMA",
        "title": "Hi reddit! We're Billy Magnussen (actor) &amp; John-Michael Powell (director/writer) of VIOLENT ENDS, a Southern crime-thriller that also stars Alexandra Shipp &amp; James Badge Dale. It's out in theaters now. You might also know Billy from GAME NIGHT, ALADDIN, and ROAD HOUSE. Ask us anything!",
        "content": "Hi reddit! We're Billy Magnussen (actor) &amp; John-Michael Powell (director/writer) of VIOLENT ENDS, a Southern crime-thriller that also stars Alexandra Shipp &amp; James Badge Dale. It's out in theaters now. You might also know Billy from GAME NIGHT, ALADDIN, and ROAD HOUSE. Ask us anything!\n\nIt also stars Alexandra Shipp, James Badge Dale, Nick Stahl, Kate Burton, and Ray McKinnon.\n\n**Here's our trailer:**\n\n[https://www.youtube.com/watch?v=5ByaX0LJkds](https://www.youtube.com/watch?v=5ByaX0LJkds)\n\n**Synopsis:**\n\nA southern revenge thriller of star-crossed lovers set against the backdrop of the Ozark Mountains, Violent Ends chronicles the life of Lucas Frost, an honest man brought up in a crime family whose only legacy is violence.\n\nIt's out in theaters now via IFC.\n\nYou might know Billy from roles in things like GAME NIGHT, ALADDIN, ROAD HOUSE, LILO &amp; SITCH, NO TIME TO DIE, MANY SAINTS OF NEWARK, VELVEZ BUZZSAW, MANIAC, INGRID GOES WEST, INTO THE WOODS, BRIDGE OF SPIES, and lots more. Credits here: [https://www.imdb.com/name/nm2915105/](https://www.imdb.com/name/nm2915105/)\n\nAsk us anything! We'll be back later today Saturday 11/8 at 5:00 PM ET to answer your questions (disregard the wrong time/date in my sign!).\n\n",
        "upvotes": 84,
        "comments": 114,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fout5hlgvzzf1.png?auto=webp&amp;s=29979df2e2b4af9072223c2964f642f00c708b59"
        },
        "permalink": "/r/movies/comments/1orqkms/hi_reddit_were_billy_magnussen_actor_johnmichael/"
    },
    {
        "id": "1oqk2ik",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Predator: Badlands / Die, My Love / Christy / Nuremberg) plus throwbacks",
        "content": "**New In Theaters**:\n\n* [Predator: Badlands](https://old.reddit.com/r/movies/comments/1oqjexr/official_discussion_predator_badlands_spoilers/?)\n* [Die, My Love](https://old.reddit.com/r/movies/comments/1oqjez7/official_discussion_die_my_love_spoilers/?)\n* [Christy](https://old.reddit.com/r/movies/comments/1oqjf0b/official_discussion_christy_spoilers/?)\n* [Nuremberg](https://old.reddit.com/r/movies/comments/1oqjf1e/official_discussion_nuremburg_spoilers/?)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Chatlie's Angels](https://old.reddit.com/r/movies/comments/1oqjf2k/official_throwback_discussion_charlies_angels/?)\n* [The Legend of Bagger Vance](https://old.reddit.com/r/movies/comments/1oqjf3v/official_throwback_discussion_the_legend_of/?)\n\n**Still In Theaters**:\n\n* [Bugonia](https://www.reddit.com/r/movies/comments/1okihoi/offcial_discussion_bugonia_spoilers/?)\n* [Blue Moon](https://www.reddit.com/r/movies/comments/1okihrc/official_discussion_blue_moon_spoilers/?)\n* [If I Had Legs I'd Kick You](https://www.reddit.com/r/movies/comments/1okihu6/official_discussion_if_i_had_legs_id_kick_you/?)\n* [Springsteen: Deliver Me from Nowhere](https://old.reddit.com/r/movies/comments/1oelypv/official_discussion_springsteen_deliver_me_from/?)\n* [Chainsaw Man - The Movie: Reze Arc](https://old.reddit.com/r/movies/comments/1oelyre/official_discussion_chainsaw_man_the_movie_reze/?)\n* [Shelby Oaks](https://old.reddit.com/r/movies/comments/1oelysx/official_discussion_shelby_oaks_spoilers/?)\n* [Regretting You](https://old.reddit.com/r/movies/comments/1ofgyzw/official_discussion_regretting_you_spoilers/?)\n\n\n**New On Streaming:**\n\n* [Frankenstein (2025)](https://old.reddit.com/r/movies/comments/1orfrtf/official_discussion_frankenstein_2025_spoilers/)\n* [Hedda](https://old.reddit.com/r/movies/comments/1orfruj/official_discussion_hedda_spoilers/?)\n* [Ballad of a Small Player](https://www.reddit.com/r/movies/comments/1okihwe/official_discussion_ballad_of_a_small_player/?)\n* [A House of Dynamite](https://old.reddit.com/r/movies/comments/1ofgyx9/official_discussion_a_house_of_dynamite_spoilers/?)\n* [The Hand that Rocks the Cradle (2025)](https://old.reddit.com/r/movies/comments/1ofgz2p/official_discussion_the_hand_that_rocks_the/?)\n* [The Twits](https://www.reddit.com/r/movies/comments/1oae8r7/official_discussion_the_twits_spoilers/?)\n* [I Like Me](https://www.reddit.com/r/movies/comments/1oae8u5/official_discussion_i_like_me_spoilers/?)\n* [The Lost Bus](https://old.reddit.com/r/movies/comments/1o8p3is/official_discussion_the_lost_bus_spoilers/?)\n* [Play Dirty](https://old.reddit.com/r/movies/comments/1ny4mel/official_discussion_play_dirty_spoilers/?)\n* [Steve](https://old.reddit.com/r/movies/comments/1ny4mgo/official_discussion_steve_spoilers/?)",
        "upvotes": 35,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1oqk2ik/official_discussion_megathread_predator_badlands/"
    },
    {
        "id": "1os223b",
        "author": "SanderSo47",
        "title": "Casino (1995, dir. Martin Scorsese) – Sam \"Ace\" Rothstein deals with cheaters.",
        "content": "",
        "upvotes": 2856,
        "comments": 312,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7fu0x5q0x30g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1os223b/casino_1995_dir_martin_scorsese_sam_ace_rothstein/"
    },
    {
        "id": "1os7agi",
        "author": "einsteinfrankenstein",
        "title": "I feel Jackie Brown is one of Tarantino’s most mature films.",
        "content": "I’ll try to speak quite vaguely about the movie so I’m not giving anything away, but I’ve seen most of Tarantino‘s movies and I feel that Jackie Brown is one of his most mature.\n\nYeah, you still get to be usual violence and shock value and really fantastic conversation, \ngreat music (very catchy Across 110th Street),  and the other typical signs of Tarantino signature style, but at the heart of it, Jackie Brown it’s a pretty mature film. I mean it’s about getting older and about connection betweena middle-age woman trying to survive in a messed up sexist and racist world and an older guy who feels lonely.\n\nI like that there are so many moments where you’re just kind of watching the characters and you have time to really reflect on things. It’s not like nonstop action. Nothing against nonstop action of course, but the character study is quite fascinating. And you got complex characters. Nobody is a hero and nobody is a villain.\n\nFunny, until recently, I didn’t know that this was actually based on a novel. And that’s rare for a Tarantino film. Maybe that’s why Jackie Brown feels different to me. \nUnfortunately, I haven’t read the novel so I don’t really know how close of an adaptation it is.\n\nNevertheless, I really like Jackie Brown and I think it’s one of those movies you can just watch it again and again and as you get older, you relate to it more and more.\n\nOh, and the movie is also got some pretty funny dialogue and one liners. I’ll leave you with a quote. \n\n Robbie: My ass may be dumb, but I ain't no dumbass.\n\nEdit: christ, I forgot to mention the great cast (Pam Grier, Samuel L Jackson, Robert Forster, Michael Keaton, Robert De Niro, Bridget Fonda), and fantastic acting. Even a young Chris Tucker does a pretty good job too with his minor role too.",
        "upvotes": 525,
        "comments": 133,
        "media": null,
        "permalink": "/r/movies/comments/1os7agi/i_feel_jackie_brown_is_one_of_tarantinos_most/"
    },
    {
        "id": "1ort7bz",
        "author": "MarvelsGrantMan136",
        "title": "Zach Cregger's 'Resident Evil' Movie is Set in Raccoon City, Production Photos Reveal, With Hints to Place in the Timeline",
        "content": "",
        "upvotes": 2331,
        "comments": 310,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Ohjj_AF7AOr8q3McJDQ9cZkJjUro1lJ9vzxyX83Eue4.jpeg?auto=webp&amp;s=aea6c68f8b3de9641353e420354ef7867f91fdd9"
        },
        "permalink": "/r/movies/comments/1ort7bz/zach_creggers_resident_evil_movie_is_set_in/"
    },
    {
        "id": "1orx2kl",
        "author": "nosotros_road_sodium",
        "title": "Why Everyone in Hollywood Wants Their Movie in IMAX",
        "content": "",
        "upvotes": 804,
        "comments": 122,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IVcAmDhVpcGX7QoeBmJ4YGz10XJlRcxz6ic9a5ZY_rE.jpeg?auto=webp&amp;s=0aa703c41c9be74f578d08996352ef244407523f"
        },
        "permalink": "/r/movies/comments/1orx2kl/why_everyone_in_hollywood_wants_their_movie_in/"
    },
    {
        "id": "1os53jh",
        "author": "Fhujeth",
        "title": "The Mitchells vs the Machines deserved better",
        "content": "I don't remember it getting a theatrical release but holy...\nI think it went straight to Netflix because of the pandemic.\n\nThis movie is so creative and appealing that it's hard to look away. It's like National Lampoon's Vacation meets that newer movie Y2K. \n\nThe animation, by Sony Pictures (Spiderverse and Kpop Demon Hunters) is so fun. Not to mention it's this family from Michigan just trying to get their weird, artistic daughter to California. \n\nIf you haven't seen it, this movie deserved better. I'd love it to get a full theatrical release. As it was intended to get. It had a limited one but was cut out because of the pandemic.\n\nSo give it love on Netflix. It's so insanely fun.",
        "upvotes": 217,
        "comments": 44,
        "media": null,
        "permalink": "/r/movies/comments/1os53jh/the_mitchells_vs_the_machines_deserved_better/"
    },
    {
        "id": "1os4rom",
        "author": "Smallville1938",
        "title": "Who's looking forward to Project Hail Mary?",
        "content": "Just curious how many people are looking forward to Hail Mary? Based on Andy Weir's novel. Author of The Martian. I've read the book and listened to the audio book twice. It is wonderful. I highly recommend the audiobook. It's an amazing novel about friendship and perseverance even beyond normal boundaries of human comprehension. Being directed by Lord and Miller gives me nothing but hope for this film. ",
        "upvotes": 144,
        "comments": 108,
        "media": null,
        "permalink": "/r/movies/comments/1os4rom/whos_looking_forward_to_project_hail_mary/"
    },
    {
        "id": "1os8ul3",
        "author": "Big-War-7632",
        "title": "Thoughts on 10 Cloverfield Lane?",
        "content": "I’m currently rewatching 10 Cloverfield Lane and I do feel that it is an underrated psychological sci-fi thriller. Without a doubt I believe John Goodman makes the movie what it is but I am having some trouble connecting the dots between 10 Cloverfield Lane and the original Cloverfield. Do any of you have some insight into how these two tie into each other? ",
        "upvotes": 74,
        "comments": 68,
        "media": null,
        "permalink": "/r/movies/comments/1os8ul3/thoughts_on_10_cloverfield_lane/"
    },
    {
        "id": "1orw9n4",
        "author": "dantedoomsday",
        "title": "The Phantom (1996) - The Fourth Skull Scene",
        "content": "",
        "upvotes": 396,
        "comments": 158,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L0FA4AVC8tvxVUMUoIuoR4s8v3GE5rZaLhoNLuKbZCk.jpeg?auto=webp&amp;s=842267ec0c63f1c87b371b3e1b09d66361b89d64"
        },
        "permalink": "/r/movies/comments/1orw9n4/the_phantom_1996_the_fourth_skull_scene/"
    },
    {
        "id": "1orriza",
        "author": "Stet-it",
        "title": "What is your absolute favorite comedic exchange in a movie?",
        "content": "For me, it’s Monty Python and the Holy Grail’s peasant scene, where they discuss political philosophy.  The back and forth on the absurdity of the Lady of the Lake legend still kills me every time I watch it.   The historiographic frame only adds to the brilliance of it, though it would still be my favorite just on the strength of the writing in that entire scene. ",
        "upvotes": 608,
        "comments": 550,
        "media": null,
        "permalink": "/r/movies/comments/1orriza/what_is_your_absolute_favorite_comedic_exchange/"
    },
    {
        "id": "1orjhl6",
        "author": "No_Stretch312",
        "title": "Movies with healthy masculinity",
        "content": "Watching Lord of the Rings right now (for the 400th time). I feel that there are so few movies like this.\n\nI have two young boys and I’m truly afraid of the world right now for young men and the charlatans trying to lure them into misogynistic bullshit.\n\nI hope my kids like Lord of the Rings, but also realize they may think it’s old man bullshit by the time they’re old enough to watch it. What is there in this vein to introduce the idea of healthy masculinity that’s newer or geared to younger audiences? ",
        "upvotes": 1550,
        "comments": 987,
        "media": null,
        "permalink": "/r/movies/comments/1orjhl6/movies_with_healthy_masculinity/"
    },
    {
        "id": "1orstct",
        "author": "DemiFiendRSA",
        "title": "‘Michael’ Teaser Traffic Racks Up 116.2M Views, Record Trailer Launch For Lionsgate",
        "content": "",
        "upvotes": 327,
        "comments": 173,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UpATE_QZyCACnPi85J8P_9d6Li_m1pIqBKSTE9UsF0Q.jpeg?auto=webp&amp;s=3391f1b59e514dce0dd0b832e84f48ec369f1278"
        },
        "permalink": "/r/movies/comments/1orstct/michael_teaser_traffic_racks_up_1162m_views/"
    },
    {
        "id": "1orokoe",
        "author": "Mundane_Moron",
        "title": "Fargo is such a beautiful movie.",
        "content": "I just got the Shout! Factory 4K copy of Fargo and watched it three times last weekend. This movie might be my new comfort film. It is perfect. The snowy setting in Minnesota, the screenplay, Buschemi and Stormare as the bumbling dim-witted criminals, Macy as the easy-to-hate greedy husband and son-in-law, and McDormand as the lovable chief of police. The Minnesota nice stereotype is well played out throughout the film. \n\nI don't know. I know this is a crime film, but there is something comforting about this film that is unexplainable. ",
        "upvotes": 435,
        "comments": 170,
        "media": null,
        "permalink": "/r/movies/comments/1orokoe/fargo_is_such_a_beautiful_movie/"
    },
    {
        "id": "1osc165",
        "author": "Mrtom987",
        "title": "Watched Tinker Tailor Soldier Spy yesterday. The Gary Oldman Spy movie.",
        "content": "I liked it a lot.\n\nSince I knew nothing of le Carré's work or Smiley, and went into it blind, I wasn't sure most of the movie and before the reveal whether Smiley was the mole or not and playing everyone. He gives this smirk whenever key information is revealed and it's like he is amused how far people before him/catching upto him have come but it isn't going to matter since HE IS THE MOLE and they lost now.\n\nWhile he was he narrating the story to Benedict Cumberbatch's character about meeting Karla for the first time, I was wondering the whole time whether he was bullshitting and giving a fake story. Maybe he IS the real Karla and the one in Russia is a \"fake one\" setup by him himself. Basically Usual Suspect-ing us. Also the way that shot was framed and filmed, it was like he was talking to himself(since I thought he IS karla) and the other chair was empty meaning There IS NO KARLA strong arming my suspision that he could be the mole. Also he doesn't remember the face of the now \"HEAD OF RUSSIA\"? That was pretty sus to me. I guess he saw him too long time ago but he should atleast remember his important features.\n\nI honestly don't know if it was intentional or not or if that was just how I was interpreting it. Was Smiley intentionally made to be a Red herring for newbies like me? I later learnt that Smiley is a famous character in the books and other media so for a newbie coming into this movie, were people like me also sus of smilie too? Or did a majority of the target audience knew he was a \"good\" guy beforehard and were never sus of him and were just focusing on the real mole between the 4 main candidates.\n\nAlso Benedict Cumberbatch's character, since I was so sus of Smiley, I felt was the perfect fall guy since he was doing most of the dirty work. I felt smiley was setting him up so he would die at somepoint and blame one of the 4 so Smiley will be free of any suspicious and keep on continue being the mole now being the head of the department.\n\nAnd was the woman who was executed in front of Jim in the torture chamber, the same one Tom Hardy's character got the mole info from? That's pretty grim honestly. Doesn't he still think she is alive and they are going to trade her back?\n\nAll The deaths in this movies are just so brutal and bloody.\n\nAnd at the end, Bill was going to be traded back to the Russians? But then Jim killed him because the betrayl was just too much? That would just fk up the deal that were going to do with the Russians. And Bill will get arrested. I suppose he had nothing left to loose. He is a true loner now. Drove the kid away too.\n\nHonestly Pretty smart move planned by Karla to throw off Smiley by Bill seducing his wife.\n\nI liked the Christmas scenes. Everyone was \"happy\"\n\nThe ending montage was great with that french song.\n\nThis feels like those movies that get better on a rewatch. Am excited to rewatch it again someday.",
        "upvotes": 16,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1osc165/watched_tinker_tailor_soldier_spy_yesterday_the/"
    },
    {
        "id": "1os34np",
        "author": "MlD-CENTURY-MOD",
        "title": "Happy 30th Birthday \"Ace Ventura: When Nature Calls\" – the sequel premiered on this day in 1995!",
        "content": "No one (grown up) thought an r/AceVentura sequel would work but my adolescent brain was seated some thirty years ago and couldn't wait to see more Jim on the big screen. But instead of recycling the original's jokes, Carrey and co swerved and made something different, which is rare for comedy follow-ups, especially today when we all know comedies are often forced into repeating the same jokes from studio interference or audience demand. And because this is \"Ace Ventura,\" that left-turn is exactly why it stuck.\n\nThe OG Miami pet-detective hijinks became a full-blown jungle quest. Tom Shadyac gave way to Steve Oedekerk as writer/director; and Carrey leaned into the live-action cartoon energy *even* harder. Oedekerk called their pace “definitely go, go, go,” and you feel it in the rhino scene, the Slinky bit, and every bat-averse yelp... &gt;!Guano!!&lt;\n\nIt premiered on this day in November 8, 1995 at Westwood’s Regency Village Theatre and opened nationwide on November 10 at #1, ultimately clearing over $200M worldwide. Thirty years later, it’s still a case study in how a comedy sequel can change lanes and land. ",
        "upvotes": 38,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1os34np/happy_30th_birthday_ace_ventura_when_nature_calls/"
    },
    {
        "id": "1os8emb",
        "author": "whitemikesf",
        "title": "What Director do you Most Associate with a Distinctive Musical Sensibility?",
        "content": "What Director do you Most Associate with a Distinctive Musical Sensibility? In terms of song curation and needle drops (not talking about score here)? \n\nMy first thought is Guy Ritchie. His early films always had such a cool and interesting collection of music, which drove the action and added character to each scene. ",
        "upvotes": 17,
        "comments": 75,
        "media": null,
        "permalink": "/r/movies/comments/1os8emb/what_director_do_you_most_associate_with_a/"
    },
    {
        "id": "1orfrtf",
        "author": "LiteraryBoner",
        "title": "Official Discussion - Frankenstein (2025) [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/N17yDxBffJnq)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/N17yDxBffJnq)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ItnAgr4mX7QR) to see the rankings of 2025 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done\n\n---\n\n**Summary**\nVictor Frankenstein, a brilliant and ambitious scientist, defies natural law when he brings a mysterious creature to life in a remote arctic lab. What begins as a triumph of creation spirals into a tragic tale of identity, obsession, and retribution as creator and creation clash in a gothic, unforgiving world.\n\n**Director**\nGuillermo del Toro\n\n**Writer**\nGuillermo del Toro (screenplay); based on *Frankenstein* by Mary Shelley\n\n**Cast**\n\n* Oscar Isaac as Victor Frankenstein\n* Jacob Elordi as the Creature\n* Mia Goth as Elizabeth\n* Christoph Waltz as Henrich Harlander\n\n**Rotten Tomatoes**: [86%](https://www.rottentomatoes.com/m/frankenstein_2025)\n\n**Metacritic**: [78](https://www.metacritic.com/movie/frankenstein-2025/)\n\n**VOD / Release**\nIn select theaters October 17, 2025; streaming on Netflix November 7, 2025\n\n**Trailer**\n[Watch here](https://www.imdb.com/video/vi3487352857/)\n\n---",
        "upvotes": 1066,
        "comments": 1202,
        "media": null,
        "permalink": "/r/movies/comments/1orfrtf/official_discussion_frankenstein_2025_spoilers/"
    },
    {
        "id": "1ordu5s",
        "author": "thespindle",
        "title": "Major Payne is a great movie",
        "content": "Maybe it’s the nostalgia talking but I’m rewatching this move for the first time in a long time and it’s funny and well done. The jokes are on point, it’s a great “hate until I understand” the character movie. I have quoted the line “sen si tive” ever since I first watched this. I highly recommend giving it a watch for those who have not seen it. And please let me know if you think it holds up!",
        "upvotes": 1345,
        "comments": 367,
        "media": null,
        "permalink": "/r/movies/comments/1ordu5s/major_payne_is_a_great_movie/"
    },
    {
        "id": "1oryht7",
        "author": "Cherryredsocks",
        "title": "Genuinely scary movies to watch?",
        "content": "Some movies that usually scare me are usually psychological thrillers like “the Others” or “1408”, movies with a creepy atmosphere/premise like “Vivarium” or movies with demonic entities like “it follows” or “smile”. Do you have any recommendations. Im also ok with movies that don’t fit these sub genres as long as it’s actually scary something that could keep me up at night checking the corners of my room. ",
        "upvotes": 57,
        "comments": 191,
        "media": null,
        "permalink": "/r/movies/comments/1oryht7/genuinely_scary_movies_to_watch/"
    },
    {
        "id": "1os8c6i",
        "author": "Savings-Wallaby7392",
        "title": "The Replacements",
        "content": "One of my favorite football movies. But to be honest Shane Falco had a great college career. Only blew one big game in Sugar-bowl in college. He then led team to playoffs beating the Dallas Cowboys the best team in Football . Why was his chance to play in NFL over? Unlike others in replacements he was a major college QB and he won nearly every game he started during strike and beat Cowboys with their full starting squad. It makes no sense. ",
        "upvotes": 14,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1os8c6i/the_replacements/"
    },
    {
        "id": "1orv1eo",
        "author": "Hot-Remove-1252",
        "title": "Thanks everyone for your wild recommendations on WTF films, here’s the full list you came up with! Ive seen a total of 22! Now the real question is… where do I even start? Drop your top 3 below",
        "content": "1.A Clockwork Orange (1971)\n\n\t2.\tA Field in England (2013)\n\n\t3.\tA Serbian Film (2010)\n\n\t4.\tAltered States (1980)\n\n\t5.\tAmerican Beauty (1999)\n\n\t6.\tAnnihilation (2018)\n\n\t7.\tAsteroid City (2023)\n\n\t8.\tAzrael (2024)\n\n\t9.\tBarbarian (2022)\n\n\t10.\tBasket Case 2 (1990)\n\n\t11.\tBasket Case 3: The Progeny (1991)\n\n\t12.\tBeau Is Afraid (2023)\n\n\t13.\tBegonia (2025)\n\n\t14.\tBeing John Malkovich (1999)\n\n\t15.\tBelladonna of Sadness (1973)\n\n\t16.\tBeyond the Black Rainbow (2010)\n\n\t17.\tBlack Box (2020)\n\n\t18.\tBlue Velvet (1986)\n\n\t19.\tBones and All (2022)\n\n\t20.\tBrightwood (2023)\n\n\t21.\tBring Her Back (2025)\n\n\t22.\tCaddo Lake (2023)\n\n\t23.\tCarnival of Souls (1962)\n\n\t24.\tClimax (2018)\n\n\t25.\tCoherence (2013)\n\n\t26.\tColour Out of Space (2019)\n\n\t27.\tCrash (Cronenberg) (1996)\n\n\t28.\tCrazy Fat Ethel (1975)\n\n\t29.\tCube (1997)\n\n\t30.\tDeadgirl (2008)\n\n\t31.\tDesperate Living (1977)\n\n\t32.\tDream Scenario (2023)\n\n\t33.\tEl Incidente (2014)\n\n\t34.\tEnemy (2013)\n\n\t35.\tEnter Nowhere (2011)\n\n\t36.\tEnter the Void (2009)\n\n\t37.\tExcision (2012)\n\n\t38.\tExit 0 (2019)\n\n\t39.\tEye, Origins (I Origins) (2014)\n\n\t40.\tFaster, Pussycat! Kill! Kill! (1965)\n\n\t41.\tFight for Your Life (1977)\n\n\t42.\tFire in the Sky (1993)\n\n\t43.\tForbidden Zone (1980)\n\n\t44.\tFour for the Apocalypse (1975)\n\n\t45.\tFunny Games (1997)\n\n\t46.\tGummo (1997)\n\n\t47.\tGymkata (1985)\n\n\t48.\tHalloween III: Season of the Witch (1982)\n\n\t49.\tHappiness (1998)\n\n\t50.\tHappy Death Day (2017)\n\n\t51.\tHappy Death Day 2U (2019)\n\n\t52.\tHellraiser (2022)\n\n\t53.\tHereditary (2018)\n\n\t54.\tHobo with a Shotgun (2011)\n\n\t55.\tHoly Motors (2012)\n\n\t56.\tHunter Hunter (2020)\n\n\t57.\tI Am a Knife with Legs (2014)\n\n\t58.\tI Am Trash (2014)\n\n\t59.\tI ♥ Huckabees (2004)\n\n\t60.\tIchi the Killer (2001)\n\n\t61.\tIncendies (2010)\n\n\t62.\tInfinity Pool (2023)\n\n\t63.\tInland Empire (2006)\n\n\t64.\tIt’s What’s Inside (2024)\n\n\t65.\tJacob’s Ladder (1990)\n\n\t66.\tKids (1995)\n\n\t67.\tKill Her Goats (2023)\n\n\t68.\tKinds of Kindness (2023)\n\n\t69.\tLamb (2021)\n\n\t70.\tL’Amour braque (1985)\n\n\t71.\tLost Highway (1997)\n\n\t72.\tLove Exposure (2008)\n\n\t73.\tMen (2022)\n\n\t74.\tMidnight Meat Train (2008)\n\n\t75.\tMidsommar (2019)\n\n\t76.\tMother! (2017)\n\n\t77.\tMr. Nobody (2009)\n\n\t78.\tMulholland Drive (2001)\n\n\t79.\tNaked Lunch (1991)\n\n\t80.\tNocturnal Animals (2016)\n\n\t81.\tOldboy (2003)\n\n\t82.\tPalindrome (2004)\n\n\t83.\tPalm Springs (2020)\n\n\t84.\tPennies from Heaven (1981)\n\n\t85.\tPig (2021)\n\n\t86.\tPink Flamingos (1972)\n\n\t87.\tPink Floyd’s The Wall (1982)\n\n\t88.\tPossession (1981)\n\n\t89.\tPredestination (2014)\n\n\t90.\tPrimer (2004)\n\n\t91.\tRequiem for a Dream (2000)\n\n\t92.\tResolution (2012)\n\n\t93.\tRubber (2010)\n\n\t94.\tSalo, or the 120 Days of Sodom (1975)\n\n\t95.\tSave the Green Planet! (2003)\n\n\t96.\tSecret Window (2004)\n\n\t97.\tSilent Night Deadly Night Part 4: Initiation (1990)\n\n\t98.\tSomething in the Dirt (2022)\n\n\t99.\tSorry to Bother You (2018)\n\n\t100.\tSouthland Tales (2006)\n\n\t101.\tSpontaneous Combustion (1990)\n\n\t102.\tSpring (2014)\n\n\t103.\tSpun (2002)\n\n\t104.\tStrange Darling (2023)\n\n\t105.\tStrange Rituals (2017)\n\n\t106.\tSympathy for Lady Vengeance (2005)\n\n\t107.\tTetsuo: The Iron Man (1989)\n\n\t108.\tThe 4th Man (1983)\n\n\t109.\tThe Addiction (1995)\n\n\t110.\tThe Beach (2000)\n\n\t111.\tThe Black Phone (2021)\n\n\t112.\tThe City of Lost Children (1995)\n\n\t113.\tThe Coffee Table (2022)\n\n\t114.\tThe Cook, the Thief, His Wife &amp; Her Lover (1989)\n\n\t115.\tThe Crash (1996)\n\n\t116.\tThe Dark Backward (1991)\n\n\t117.\tThe Death of Dick Long (2019)\n\n\t118.\tThe Endless (2017)\n\n\t119.\tThe Exorcist II: The Heretic (1977)\n\n\t120.\tThe Face of Another (1966)\n\n\t121.\tThe Game (1997)\n\n\t122.\tThe Gift (2015)\n\n\t123.\tThe Girl With the Needle (2024)\n\n\t124.\tThe Greasy Strangler (2016)\n\n\t125.\tThe Holy Mountain (1973)\n\n\t126.\tThe Hunger (1983)\n\n\t127.\tThe Idiots (Idioterne) (1998)\n\n\t128.\tThe Killing of a Sacred Deer (2017)\n\n\t129.\tThe Kingdom (1994)\n\n\t130.\tThe Lighthouse (2019)\n\n\t131.\tThe Lobster (2015)\n\n\t132.\tThe Lodge (2019)\n\n\t133.\tThe Machinist (2004)\n\n\t134.\tThe Mustache (2005)\n\n\t135.\tThe Others (2001)\n\n\t136.\tThe Passenger (1975)\n\n\t137.\tThe Perfection (2018)\n\n\t138.\tThe Platform (2019)\n\n\t139.\tThe Poughkeepsie Tapes (2007)\n\n\t140.\tThe Sadness (2021)\n\n\t141.\tThe Salton Sea (2002)\n\n\t142.\tThe Seven Lives of Lea (2022)\n\n\t143.\tThe Sixth Sense (1999)\n\n\t144.\tThe Skin I Live In (2011)\n\n\t145.\tThe Strange Thing About the Johnsons (2011)\n\n\t146.\tThe Unbearable Weight of Massive Talent (2022)\n\n\t147.\tThe Wounds (1998)\n\n\t148.\tThe Zombie King (2013)\n\n\t149.\tTideland (2005)\n\n\t150.\tTime Lapse (2014)\n\n\t151.\tTimecrimes (2007)\n\n\t152.\tTitane (2021)\n\n\t153.\tTokyo Gore Police (2008)\n\n\t154.\tTriangle (2009)\n\n\t155.\tTurbo Kid (2015)\n\n\t156.\tTusk (2014)\n\n\t157.\tTwin Peaks: The Missing Pieces (2014)\n\n\t158.\tUnder the Silver Lake (2018)\n\n\t159.\tUnder the Skin (2013)\n\n\t160.\tUpstream Color (2013)\n\n\t161.\tValerie and Her Week of Wonders (1970)\n\n\t162.\tVideodrome (1983)\n\n\t163.\tVisitor Q (2001)\n\n\t164.\tVivarium (2019)\n\n\t165.\tZardoz (1974)\n",
        "upvotes": 82,
        "comments": 87,
        "media": null,
        "permalink": "/r/movies/comments/1orv1eo/thanks_everyone_for_your_wild_recommendations_on/"
    },
    {
        "id": "1oqvdnb",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Quentin Tarantino's ‘Kill Bill: The Whole Bloody Affair’",
        "content": "",
        "upvotes": 19920,
        "comments": 1301,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vpxnij0eeuzf1.jpeg?auto=webp&amp;s=fe64be92311df65fcc9c36847722856f7224e90f"
        },
        "permalink": "/r/movies/comments/1oqvdnb/official_poster_for_quentin_tarantinos_kill_bill/"
    },
    {
        "id": "1ordh1k",
        "author": "EuphoricButterflyy",
        "title": "Frankenhooker (1990)- kiss of death scene. Directed by Frank Henenlotter",
        "content": "",
        "upvotes": 1217,
        "comments": 104,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ngtc8zkzzxzf1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ordh1k/frankenhooker_1990_kiss_of_death_scene_directed/"
    },
    {
        "id": "1os4e6k",
        "author": "Top_Report_4895",
        "title": "Zoey Deutch on Nouvelle Vague, Netflix Bloopers, &amp; Truman Show Remake",
        "content": "",
        "upvotes": 20,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9SnduNhJDGDxHN-4xT2-jM-lx-nemknDma_9nOnp1PU.jpeg?auto=webp&amp;s=90c31cd9f59f5afe9c5cb41486137620cc78e0cc"
        },
        "permalink": "/r/movies/comments/1os4e6k/zoey_deutch_on_nouvelle_vague_netflix_bloopers/"
    },
    {
        "id": "1oro221",
        "author": "Due_Grapefruit7518",
        "title": "A Working Man, even for a Jason Statham movie, sucked.",
        "content": "This was the epitome of formulaic action movies. The dialogue was campy, the villains did things purely for the sake of being the villains of an action movie. I’ve never had a complaint about Statham movies. Even The Expendables wasn’t this bad. \n\nThe stunts too were a bit odd to me. Statham’s character is supposed to be ex Royal Marines, and he enters rooms before firing his gun in a very unprofessional way, though maybe that’s just bad editing??\n\nAll of his recent movies I have enjoyed. The Beekeeper was great, and the money truck heist one is a blast, but this one just missed the mark on a lot of things.",
        "upvotes": 133,
        "comments": 106,
        "media": null,
        "permalink": "/r/movies/comments/1oro221/a_working_man_even_for_a_jason_statham_movie/"
    },
    {
        "id": "1oqv5uq",
        "author": "MarvelsGrantMan136",
        "title": "Kill Bill: The Whole Bloody Affair | Official Trailer",
        "content": "",
        "upvotes": 3819,
        "comments": 484,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ca76NSiENLP0wNegj6ZO69Uytz7NopOVgepMXCnTTvM.jpeg?auto=webp&amp;s=95b9b35fbbf1414d426d1bd5922c22e0cc363ae5"
        },
        "permalink": "/r/movies/comments/1oqv5uq/kill_bill_the_whole_bloody_affair_official_trailer/"
    },
    {
        "id": "1oqyvge",
        "author": "NoCulture3505",
        "title": "'KPop Demon Hunters' Lands 3 Grammy Nominations",
        "content": "",
        "upvotes": 2328,
        "comments": 208,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ugVUxRolngKuEmNFG9ewchSrhPyV5S8CVCzbUfNOIKM.png?auto=webp&amp;s=f6fc2443ba9f69965ea79a0459b06d22685f5d47"
        },
        "permalink": "/r/movies/comments/1oqyvge/kpop_demon_hunters_lands_3_grammy_nominations/"
    },
    {
        "id": "1os3ro4",
        "author": "Local-Chemist-1928",
        "title": "Watched Columbus (2017) recently",
        "content": "After I found Lost in Translation last year and loved it I saw lots of posts referring to Columbus as a film with similar vibe/mood.\n\nI love the music, the melancholic atmosphere and the connection between the main characters and the fact that it’s not about romance or love but just about a deep understanding of the other person and a real momentary connection because they share something at the same time in the same place. \n\nWhat films can you recommend that you felt have that similar mood and revolve around that deep connection and mutual understanding of two human beings? \n",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1os3ro4/watched_columbus_2017_recently/"
    },
    {
        "id": "1or8ulu",
        "author": "LiteraryBoner",
        "title": "Tom Hanks on what makes an American. Bridge of Spies (2015, dir. Steven Spielberg)",
        "content": "",
        "upvotes": 559,
        "comments": 67,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g5e54nszywzf1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1or8ulu/tom_hanks_on_what_makes_an_american_bridge_of/"
    }
]