[
    {
        "id": "1gtubkm",
        "author": "BunyipPouch",
        "title": "Join us Thursday 11/21 at 3:00 PM ET for a live AMA/Q&amp;A with Malcolm Washington, director and co-writer of Netflix's 'The Piano Lesson' - It stars Samuel L. Jackson, John David Washington, Ray Fisher, Michael Potts, Erykah Badu, Danielle Deadwyler, and Corey Hawkins.",
        "content": "",
        "upvotes": 12,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wqq0htc5lk1e1.jpeg?auto=webp&amp;s=29d0bc95d2fae0161a06fa739bdd53fc8cf7c73d"
        },
        "permalink": "/r/movies/comments/1gtubkm/join_us_thursday_1121_at_300_pm_et_for_a_live/"
    },
    {
        "id": "1gtk95y",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Red One / A Real Pain / Emilia Perez)",
        "content": "[Red One](https://old.reddit.com/r/movies/comments/1grn0ii/official_discussion_red_one_spoilers/)\n\n[A Real Pain](https://old.reddit.com/r/movies/comments/1grn0jw/official_discussion_a_real_pain_spoilers/)\n\n[Emilia Perez](https://old.reddit.com/r/movies/comments/1grn0lz/official_discussion_emilia_p%C3%A9rez_spoilers/)",
        "upvotes": 22,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1gtk95y/official_discussion_megathread_red_one_a_real/"
    },
    {
        "id": "1gtuxd8",
        "author": "tiduraes",
        "title": "Kevin Smith Says ‘Dogma 2’ Is Happening With Ben Affleck &amp; Matt Damon Returning",
        "content": "",
        "upvotes": 12706,
        "comments": 1067,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QS9Umbm3ZcWQYkqX1WfMZ0xqNAHrF9hnnYLlPRS3sX4.jpg?auto=webp&amp;s=0ab09af130fd7349e71eaeb895da8e5693b94b54"
        },
        "permalink": "/r/movies/comments/1gtuxd8/kevin_smith_says_dogma_2_is_happening_with_ben/"
    },
    {
        "id": "1gu5a4z",
        "author": "MarvelsGrantMan136",
        "title": "New Image from 'Tron: Ares'",
        "content": "",
        "upvotes": 874,
        "comments": 177,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0n776unn1o1e1.jpeg?auto=webp&amp;s=eca128d2e3bfc32240f303be65984117662ede55"
        },
        "permalink": "/r/movies/comments/1gu5a4z/new_image_from_tron_ares/"
    },
    {
        "id": "1gu38mx",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Tom Hardy in Gareth Evans’ ‘HAVOC’",
        "content": "",
        "upvotes": 605,
        "comments": 141,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/u6qz7pe2in1e1.jpeg?auto=webp&amp;s=b336a17ae8bf095da1acbbb4aec2a8fa59134800"
        },
        "permalink": "/r/movies/comments/1gu38mx/first_image_of_tom_hardy_in_gareth_evans_havoc/"
    },
    {
        "id": "1gu3f21",
        "author": "cjmmoseley",
        "title": "\"The Substance\" made me cry more than any movie I've ever watched. ",
        "content": "CW: discussion of eating disorders\n\nI don't think I've ever felt more called out by a movie.\n\nI'm a 19y/o woman and have never seen a movie perfectly encapsulates the HATRED from body dysmorphia and low self-esteem. I've seen so many movies romanticize it and make it look \"'pretty\", but it's violent, disgusting, and often embarrassing. I've seen so many conventionally gorgeous women (like Elisabeth) be ASHAMED to admit they hate how they look because it can come off as attention-seeking and as if they're compliment-fishing.\n\nI hate body horror and can't handle it, but I found myself SOBBING at some of the most violent scenes. I had a very severe eating disorder a couple years ago and often ENVY who I was before I recovered. I can't even look at photos from then- because a \"trigger\" for me isn't sadness or trauma, it's a DEEP resentment towards myself for recovering. I feel that I was \"better\" before I recovered, like that version was &gt;!\"the most lovable part of me\". !&lt;\n\nI hated that I, at 19, identified more with Elisabeth than Sue. I hated that I related to almost every second of the movie, and realized that I live my life a lot like Elizabeth. I speak to myself like her, treat myself like she does, and realized I should probably go back to therapy lol. This was a wake-up call in every way.\n\nFantastic movie... prob would not recommend to anyone lol\n\n\\*\\*\\*Edited acronym ED to \"eating disorder\" to clear up confusion",
        "upvotes": 374,
        "comments": 101,
        "media": null,
        "permalink": "/r/movies/comments/1gu3f21/the_substance_made_me_cry_more_than_any_movie_ive/"
    },
    {
        "id": "1gu82x5",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Bob Odenkirk in 'Nobody 2'",
        "content": "",
        "upvotes": 145,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/orcbo1euno1e1.jpeg?auto=webp&amp;s=0f75c167ffc375fd7bc5c17eea617e6e2ea1f610"
        },
        "permalink": "/r/movies/comments/1gu82x5/first_image_of_bob_odenkirk_in_nobody_2/"
    },
    {
        "id": "1gu38p6",
        "author": "HorzaDonwraith",
        "title": "Disney's John Carter of Mars is actually good",
        "content": "I am soon to dive into the book series the movie is based off of and decided to give the movie a re-watch. To my surprise it is actually good, surprisingly good compared to what we are served now. I remembered when it did come out and how it was ~~basically~~ a flop grossing only $73 mill vs the $250 mill that it cost to make.\n\nIt is a beloved SciFi classic and often considered the template that most SciFi films/books are based off of. Not bad for something written in 1912. I can't help be see modern hits like Dune taking some inspiration from the books. It has all the elements that most audiences like and has CGI that holds its own.\n\nMy only critique is the characters lack depth. Aside from John Carter (Taylor Kitsch) himself, but the Sab Than (Dominic West) and Dejah Thoris (Lynn Collins) lack any depth beyond the obviously stated motivations throughout the film. Even Tars Tarkas (Willem Dafoe) has more depth than the other two combined. But beyond this, the movie itself was good and I'd recommend a re-watch from anyone",
        "upvotes": 195,
        "comments": 105,
        "media": null,
        "permalink": "/r/movies/comments/1gu38p6/disneys_john_carter_of_mars_is_actually_good/"
    },
    {
        "id": "1gu5d86",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Sonic 3'",
        "content": "",
        "upvotes": 99,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7k35wz2d2o1e1.jpeg?auto=webp&amp;s=387d507a43e1f15888a76d580533cc8647a2e83e"
        },
        "permalink": "/r/movies/comments/1gu5d86/new_poster_for_sonic_3/"
    },
    {
        "id": "1gtt0o4",
        "author": "QwertyVirtuoso",
        "title": "The real meaning of the phrase 'The Quick and the Dead'.",
        "content": "https://preview.redd.it/skeogtwb6k1e1.jpg?width=312&amp;format=pjpg&amp;auto=webp&amp;s=46b580fe6ce5512c0481fa262cdaccb9b90e56b2\n\nI always thought the title of this kitschy western about cowboys &amp; girls duels was cool. But I didn't realise it's a word play on the olde English meaning.\n\nI was watching an episode of 'Wolf Hall' on the BBC. A drama about 16th century English king Henry the 8th.  \nIn the drama, Thomas Cromwell laments that he has wronged people who are no longer alive. He talks about how you can change the mind of someone who is alive but not someone who is dead. But he uses odd middle English phrasing.  \n  \nHe says, \"*You can persuade the quick, but how do you remake your reputation with the dead*?\"  \n  \nInstead of 'alive' he uses the phrase 'quick'. Which made me think of The Gene Hackman, Russel Crow, Sharon Stone, Leonardo Decaprio movie 'The Quick and the Dead'. A title which obviously refers to those who are a quick draw surviving and those who are not quick being killed.  \n  \nUpon researching how a phrase 'quick and dead' made it into medieval dialogue, I found that the movie title is actually inspired by the Apostles' Creed used in some Catholic and Protestant church services \"*He shall come to judge the quick and the dead*\"  \n  \nIn this case, ‘quick’ is derived from the Olde English ‘cwic’ to mean, ‘alive’ or ‘moving’ or ‘animated’.  \n  \nSo the movie title of ‘The Quick and the Dead’ literally just means ‘The living and the dead’. But of course, it’s also a clever wordplay about quick draw gunfighters.",
        "upvotes": 884,
        "comments": 98,
        "media": null,
        "permalink": "/r/movies/comments/1gtt0o4/the_real_meaning_of_the_phrase_the_quick_and_the/"
    },
    {
        "id": "1gts8el",
        "author": "BunyipPouch",
        "title": "Huckleberry Fox, Child Actor Best Known For Best Picture-winning 'Terms Of Endearment', Dies at 50",
        "content": "",
        "upvotes": 897,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uuCKArlg-D43kur13sChvp_YWxF0eOu5PyVlAVYBph8.jpg?auto=webp&amp;s=bf0e3234d7c9f080b20691017354edf0d9390d2f"
        },
        "permalink": "/r/movies/comments/1gts8el/huckleberry_fox_child_actor_best_known_for_best/"
    },
    {
        "id": "1gtgfn7",
        "author": "bob1689321",
        "title": "Robert Downey Jr and Ben Stiller improvising a scene from Tropic Thunder - 10 minutes of un-edited camera footage",
        "content": "",
        "upvotes": 4724,
        "comments": 230,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HLLNbGKdtLXnZkonw13lEA802uHb0X189reysjBhX-o.jpg?auto=webp&amp;s=923ecd3658084b2d9c6470055682d29f58485a08"
        },
        "permalink": "/r/movies/comments/1gtgfn7/robert_downey_jr_and_ben_stiller_improvising_a/"
    },
    {
        "id": "1gu76sz",
        "author": "johntentaquake",
        "title": "25 Years Ago, Sleepy Hollow Gave Us Peak Tim Burton Aesthetic",
        "content": "",
        "upvotes": 58,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/iOGHdsoUB0vyxct8poF5qqcv2fz-nUkUWWJUnv_RigM.jpg?auto=webp&amp;s=0434c60c830c3c0c345106d0ce774988284174c0"
        },
        "permalink": "/r/movies/comments/1gu76sz/25_years_ago_sleepy_hollow_gave_us_peak_tim/"
    },
    {
        "id": "1gtrl2o",
        "author": "anonyfool",
        "title": "Demi Moore's 'The Substance': Making the Film's Crazy Scenes (SPOILERS in text of article)",
        "content": "",
        "upvotes": 681,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cSg_9GzlcOz0p8UUrUuFFm__6X5__drzKD3zG-L-vA0.jpg?auto=webp&amp;s=4ab43c63ef38ad1133db76066ae65894058b05b9"
        },
        "permalink": "/r/movies/comments/1gtrl2o/demi_moores_the_substance_making_the_films_crazy/"
    },
    {
        "id": "1gtpq9q",
        "author": "trpnblies7",
        "title": "I watched and rated every 1990s Pauly Shore movie this weekend",
        "content": "As we all know, Pauly Shore was the pinnacle of comedy in the 1990s, and Hollywood has been chasing that high ever since. With recent real world events wreaking havoc on my mental health, I decided to spend this weekend zoning out with The Weasel and bringing myself back to the simpler days of my childhood. It's been a long time since I've watched a Pauly Shore movie, and I knew before I started that this could possibly turn into a harrowing experience, but I was determined to stick it through.\n\nFull spoilers ahead.\n\n___\n\n**Encino Man – 1992**\n\nPauly Shore’s leading man career started with *Encino Man*. As you’re probably aware (unless you're too young to remember), this movie also served as Brendan Fraser’s breakout role, and he would then go on to carve his own path through the ‘90s. Co-starring Sean Astin, *Encino Man* tells the story of best friends Dave (Astin) and Stoney (Shore). After an earthquake uncovers a frozen caveman (Fraser) in Dave’s backyard, the two friends thaw him out and discover that he’s still alive. They name him Link, get Dave’s parents to believe he’s a foreign exchange student from Estonia, and enroll him in high school as a senior. Link is immediately popular, shenanigans ensue, and at the end of the movie, he gives bad boy villain Matt (Michael DeLuise) his comeuppance at prom by spinning him in circles and throwing him into a cake. He’s then crowned prom king, and the movie ends with a party at Dave’s house where Stoney and Link discover that another earthquake has uncovered a living cavewoman—Link’s partner from the ice age.\n\n*Encino Man* is a strong introduction to everything Pauly Shore sort of represented at the time: being yourself, shunning cultural expectations, and just having a good time. The biggest surprise upon re-watching this film was realizing that Matt isn’t the real villain in the story (although he is an asshole). The real villain is Sean Astin’s character Dave. From the very beginning, he makes it clear that he only wants to use Link so he can get popular and finally grab the attention of his crush, Robyn. And he sticks with this until the final act when he realizes that Link is more trouble than he’s worth—so he literally ditches him on the side of the road like a dog, leading to [the most dramatic scene in the film]( https://www.youtube.com/watch?v=npOGUD3g454). Stoney, meanwhile, is the voice of reason. He teaches Link important things like weezing the juice, eating grindage, and flirting with nugs. But most importantly, he teaches him about friendship.\n\nWhile Encino Man isn’t my favorite Pauly Shore movie, I definitely consider it necessary viewing if you want to understand what it means to be The Weasel. And a fun fact for those doing their own Pauly Shore marathon: Brendan Fraser’s Link makes a cameo appearance in several other Pauly flicks!\n\nRegular movie rating: 6/10\n\nPauly Shore movie rating: 7.5/10\n\n___\n\n**Son in Law – 1993** \n\nThe Weasel goes to the country in this fish out of water tale. Becca (Carla Gugino) is a South Dakotan farmgirl. After graduating from high school, she goes to college in the lawless land of California. Her first two months are rough, and right when she’s about to give up, her RA Crawl (Pauly Shore) intervenes and convinces her to stick around and let loose. One transformation montage later, Becca is now weezing and munching grindage with the best of them. Now it’s Thanksgiving break, and it’s time to see her family for the first time since becoming Becca 2.0. When she learns that Crawl will be alone over break, she brings him home to South Dakota. At dinner on their first night back, Becca’s high school boyfriend Travis (Dan Gauthier) proposes. Becca doesn’t want to marry him, so Crawl intervenes by saying that he and Becca are already engaged! Everyone is shocked, and the rest of the film is Crawl learning to be a bit more country while teaching everyone else to live a bit more like the Weasel. The movie ends with the family finding out that Travis roofied Crawl and Becca’s best friend Tracy (Tiffani-Amber Thiessen) to make it look like they slept together. Becca and Crawl kick him to the curb, and the two announce that they’re putting the wedding on hold for now.\n\nI legitimately enjoy this movie, and it’s my second favorite Pauly Shore film. Yes, it’s dumb and critically panned like all his movies, but Pauly shines through much better in this than in Encino Man since he contrasts so well with the good ol’ country folk of South Dakota. He even gets through to Becca’s parents and grandparents about not judging people by first appearances. This movie also has a great supporting cast including Lane Smith (fresh off *The Mighty Ducks*), Cindy Pickett (aka Mrs. Bueller), and Patrick Renna (who won our hearts as Ham in *The Sandlot* that same year).\n\nRegular movie rating: 7/10\n\nPauly Shore movie rating: 9/10\n\n___\n\n**In the Army Now – 1994** \n\nDespite the ‘90s homophobia and Arabphobia, I think this movie is Pauly Shore’s strongest, as he mostly abandons his Weasel persona for a straight up goofball comedy. Bones (Pauly Shore) and his best friend Jack (Andy “I’m a piece of shit” Dick) want to open their own stereo store but don’t have enough money—so they join the army reserves. Under the impression that after basic training they’ll never see combat, they of course get called up due to a conflict in Chad. Specializing in water purification along with their squad mates Christine (Lori Petty) and Fred (David Alan Grier), they discover that they’re actually really good at their jobs. But after a mission they’re assigned to goes wrong, they become stranded in the desert until they’re eventually captured by Libyans, who are preparing to fire chemical weapons at U.S. bases. With the help of another captured American soldier, Sgt. Stern (Esai Morales), they escape the prison during an attack, rendezvous with a special ops supply drop, and pinpoint the weapons with a laser targeting system so the Americans can blow up the Libyan base and save the day. The movie ends with Bones and Jack opening their new store.\n\nI’ve seen this movie way more times in my life than any reasonable person should, and it’s definitely one of my favorite guilty pleasures. Having Pauly Shore just be a regular idiot rather than his Weasel character makes all the silliness much more palatable, as his usual schtick would be way too annoying and unbelievable in a military situation. Once again, a strong supporting cast makes this film better than it should be (even Andy Dick is bearable). Lori Petty doesn’t disappoint as the badass female soldier and Bones’ love interest, and one of my favorite character actors, Art LaFleur, appears as the squadron’s commanding officer. However, since this is Pauly Shore at his highest, things can only go down from here…\n\nRegular movie rating: 7.5/10\n\nPauly Shore movie rating: 10/10\n\n___\n\n**Jury Duty – 1995** \n\nAnd the decline is incredibly steep. Even on the Pauly Shore bell curve, this movie is awful, just absolute shit all around. Tommy Collins (Pauly Shore) has no job, no money, and nowhere to live when his mother and her boyfriend decide to drive their trailer to Vegas to get married. Luckily for Tommy, he’s just been chosen for jury duty. He manipulates the system to get put onto a case that will take a long time to prosecute so he can keep taking advantage of the free lodging and food (he gets himself into a fancy hotel suite while the rest of the jurors are staying in crappy rooms). Once jury deliberations begin, he continually stalls by claiming the defendant is innocent, pulling off his worst Henry Fonda in 12 Angry Men impression (a scene of which literally features in this movie to hammer home to the audience what’s happening). All good things come to an end, though, when another juror, Monica (Tia Carrere) discovers Tommy’s plan. The judge declares a mistrial and the jury is dismissed. But Tommy believes in himself, discovers that the real killer was actually on the jury the whole time, and the killer is caught at the end thanks to plot conveniences.\n\nI laughed *once* during this movie, and it was near the beginning after a dumb but clever joke about tuna fish. While this was obviously written for Pauly Shore, I can’t actually put all the blame on him because the writing is dreadful and does him no favors. The three credited screenwriters are clearly trying to go for a Zucker brothers vibe with the humor a la *The Naked Gun* and *Top Secret!*, but they fail at almost every opportunity. That, along with way too many dated transphobia jokes, make this an absolute slog to watch. The real crime, though, is that this movie wastes an absolutely STACKED cast. Just look at this [IMDB page]( https://www.imdb.com/title/tt0113500/)! Along with Stanley Tucci and Shelley Winters (in a very small role as Tommy’s mom), this trash is filled with some amazing character actors. It’s such a shame that so much talent was wasted here.\n\nRegular movie rating: 2/10\n\nPauly Shore movie rating: 2/10\n\n___\n\n**Bio-Dome – 1996** \n\nNot as bad as Jury Duty, but still terrible, *Bio-Dome* is the story of stoner best friends Bud (Pauly Shore) and Doyle (Stephen “Definitely the worst brother” Baldwin), who accidentally get trapped in a Bio-Dome—a yearlong environmental science experiment to see if humans can survive in a carefully crafted microcosm world. After completely destroying the experiment to the chagrin of the scientists inside, they realize that they owe it to everyone to try and save the dome. Several plot conveniences later, they do, and the movie mercifully ends.\n\nThe first two thirds of this movie made me want to claw my eyes out, but the final third does have a handful of jokes that made me chuckle (though I literally can’t remember them even though I’m writing this 10 minutes after finishing the movie). My biggest issue with this film compared to other, much better stoner flicks, is that Bud and Doyle seemingly go out of their way to be complete inconsiderate assholes. They have less common sense than a six-year-old and are so selfish for most of the movie, it defies logic. Most of the “jokes” throughout the film are for their own amusement, as they constantly laugh at their own antics. There are also a couple of horribly dated “sexual assault for laughs” jokes, such as when Bud and Doyle sneak into bed with two of the female scientists (one of whom is played by Kylie Minogue). The high point of this movie is a very brief appearance from a young Tenacious D.\n\nRegular movie rating: 3/10\n\nPauly Shore movie rating: 3/10\n\n___\n\n**The Curse of Inferno – 1997** \n\nEven though I grew up in the ‘90s and saw what I thought was every Pauly Shore movie that decade, I somehow never even heard of this. I only found out about it when looking at his IMDB page to see what order to watch these films in. It doesn't even have a [Rotten Tomatoes score](https://www.rottentomatoes.com/m/the_curse_of_inferno), and that site lists this as 1996, while IMDB lists it as 1997. Was this actually released in theaters?\n\nRegardless, this one was a surprise, as it’s not a “Pauly Shore movie,” but rather a movie with Pauly Shore in it. *The Curse of Inferno* is sort of a Coen Brothers-esque caper about two friends, Chuck (Pauly Shore) and Harold (Max Perlich), who rob a bank at the same time as two other robbers. They hide the money in the bank before escaping, but when Chuck has a change of heart and decides to return the money, he finds out it’s gone. The rest of the story is a bit of a mess. The money is actually being laundered by a greedy local businessman, Moles Huddenel (Ned Beatty), who wants to get it back. At the same time, the local sheriff (Blue Deckert) is also trying to get the money. And the police officer, Layla (Janine Turner), who Chuck falls in love with, is actually an FBI agent who’s using Chuck to take down Moles. Everything works out in the end, and the FBI take down both the sheriff and Moles.\n\nI was not expecting a “serious” Pauly Shore film. It’s not a great movie, but it’s definitely not terrible. Pauly does an admirable job reeling in his usual zaniness for a more restrained, dimwitted country boy character. The biggest problem is that the plot is just very convoluted. With a better script, this could’ve been a “diamond in the rough” film of his career. He certainly doesn’t have the acting chops of other comedians in serious roles like Robin Williams or Jim Carey, but I can’t help feeling that this film did him a disservice and might have dissuaded him from attempting other more serious roles in the future. I'd love to live in the alternate reality where Pauly Shore abandoned his past stereotypes and tried to be a real actor. Even though it’s not a great movie, I do recommend checking this one out simply for the novelty of seeing Pauly Shore in a drama.\n\nRegular movie rating: 5/10\n\nPauly Shore movie rating: Not applicable\n\n___\n\nSo, what did I learn from this marathon? Probably that Pauly Shore is exactly who I remembered him to be, but in another timeline, perhaps he could have been something more? His comedy is absolutely a relic of the '90s, and even though two of these movies were hot garbage, I am glad I decided to watch them all. He's still kicking around today and collecting paychecks, but the heyday of The Weasel is certainly over.",
        "upvotes": 758,
        "comments": 281,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qaJLSPf4xrHQ036POlnvWJTSDlxIfwO6t7XSr6pKFUQ.jpg?auto=webp&amp;s=00467afcec24cae07416c3311a754df0c5040f41"
        },
        "permalink": "/r/movies/comments/1gtpq9q/i_watched_and_rated_every_1990s_pauly_shore_movie/"
    },
    {
        "id": "1gtum1y",
        "author": "Kind_Mastodon_1585",
        "title": "Pierce Brosnan on Becoming a 92-Year-Old Vet for ‘Last Rifleman’ and the Latest About ‘Mamma Mia 3’\n",
        "content": "",
        "upvotes": 366,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5IrIvR6DIz6mNr_MmoVaFwvLrNpebtbYY1dm6qr6l4s.jpg?auto=webp&amp;s=710edec69b226065ffeeef61e534a303c515539a"
        },
        "permalink": "/r/movies/comments/1gtum1y/pierce_brosnan_on_becoming_a_92yearold_vet_for/"
    },
    {
        "id": "1gtt8uj",
        "author": "Radiant_Philosophy_6",
        "title": "What is your best 2024 movie recommendation? ",
        "content": "I haven’t seen too many new movies recently so would love to get everyone’s best 2024 recommendation. I’ve been watching lots of repeats lately(not a bad thing), and would like to see something made this year. Any genre will do. Just something that came out in the last year that you really enjoyed!! \n\nHit me with your favorites!! ",
        "upvotes": 365,
        "comments": 615,
        "media": null,
        "permalink": "/r/movies/comments/1gtt8uj/what_is_your_best_2024_movie_recommendation/"
    },
    {
        "id": "1gt6kt0",
        "author": "DonnieDarkoRabbit",
        "title": "We all know by now that Heath Ledger's hospital explosion failure in The Dark Knight wasn't improvised. What are some other movie rumours you wish to dismantle? ",
        "content": "I'd love to know some popular movie \"trivia\" rumours that bring your blood to a boil when you see people spread them around to this day. I'll start us of with this:\n\nThe rumour about A Quiet Place originally being written as a Cloverfield sequel. This is not true. The writers wrote the story, then upon speaking to their representatives, they learned that Bad Robot was looping in pre-existing screenplays into the Cloververse, which became a cause for concern for the two writers. It was Paramount who decided against this, and allowed the film to be developed and released independently of the Cloververse as intended. \n\nEdit: As suggested in the comments, don't forget to provide sources to properly prevent the spread of more rumours. I'll start:\n\n[Here's my source about A Quiet Place](https://www.indiewire.com/features/general/a-quiet-place-cloverfield-1201950098/)",
        "upvotes": 9726,
        "comments": 2258,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2XaePXmFWO1NrIlrFo0cbkq283vkL8gCoUNnbcwypak.jpg?auto=webp&amp;s=789e0240701cb79a7ba2f05de6fcfb69be491756"
        },
        "permalink": "/r/movies/comments/1gt6kt0/we_all_know_by_now_that_heath_ledgers_hospital/"
    },
    {
        "id": "1gu5g30",
        "author": "KillerCroc1234567",
        "title": "New posters for A24’s “Babygirl”",
        "content": "",
        "upvotes": 19,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4hvm0Q1er_YLG2YKKZ_ryHujFTLpXcFmDqg-wZr_7EY.jpg?auto=webp&amp;s=0c89454c5c605e7c8157a6eb790c68fed8d90d3b"
        },
        "permalink": "/r/movies/comments/1gu5g30/new_posters_for_a24s_babygirl/"
    },
    {
        "id": "1gtgqji",
        "author": "Dragava",
        "title": "What director has only gotten better with age?",
        "content": "The circus surrounding Coppola and [Megalopolis](https://m.imdb.com/title/tt10128846/mediaviewer/rm1769630721/?ref_=tt_ov_i) got me thinking, there’s plenty of filmmakers who have worsened as their careers have progressed (the Wachowskis, as another instance) but I’m hard-pressed to think of one who has definitively improved with theirs.  \n\nI suppose an arguable example could be David Fincher, who began by directing music videos and commercials he himself loathed doing, but even the first half of his filmography I would say I would choose to watch over his second.  \n\nIs there a director, living or dead, you can think of that clearly has a superior latter half to their filmography? ",
        "upvotes": 1070,
        "comments": 922,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/obkXYpZN-Z9XnYSXmSxZyuCJtZTJEC4QPGHay9ll2y0.jpg?auto=webp&amp;s=e1f64d0941384a8951b302ca8b4160fe5bde8273"
        },
        "permalink": "/r/movies/comments/1gtgqji/what_director_has_only_gotten_better_with_age/"
    },
    {
        "id": "1gu5d95",
        "author": "indiewire",
        "title": "The 100 Greatest Movie Musicals of All Time",
        "content": "",
        "upvotes": 16,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uxukdWaNl0JpAk9VZVm5fMKjxoCWhDoKlZ7x0MwVaB8.jpg?auto=webp&amp;s=566acea32dd80c721464816493569fe02cb15ee5"
        },
        "permalink": "/r/movies/comments/1gu5d95/the_100_greatest_movie_musicals_of_all_time/"
    },
    {
        "id": "1gu06d7",
        "author": "RobertCampion18",
        "title": "Good movies to sleep to",
        "content": "I have a habit of sleeping to dramatic movies on my own and am looking for other suggestions?\n\nMy favorites are Spotlight (2015) and All the Presidents Men (1976). Why? Both are a slow burn and steadily paced. There's no dramatic, hair-raising moments to wake me up. Just people talking and the story unfolds. The familiar conversations lull me to sleep. Also I find it comforting listening to top class actors producing a film with a positive message (educational on history or raising political consciousness).\n\nDoes anyone else do this and what are your suggestions to expand my short list?",
        "upvotes": 32,
        "comments": 71,
        "media": null,
        "permalink": "/r/movies/comments/1gu06d7/good_movies_to_sleep_to/"
    },
    {
        "id": "1gtxg4o",
        "author": "Mitka69",
        "title": "The Hateful Eight",
        "content": "Just watched \"The Hateful Eight\". What a gorgeous, \"a movie like they did it them in the 1970s\" masterpiece. Tarantino even managed to get Ennio Morricone to write the score which makes the movie iconic just because of that.\n\nThe plot is rather believable, the set, the costumes, the dialogue and acting are superb.\n\nBut.... I have a simple question (spoiler alert!). Wasn't poisoning coffee pot  too risky and turned out to be gangsters' fatal mistake. Instead of waiting for John Ruth to fall asleep, or I dunno, go to to  the outhouse. This poisoned coffee led to the failure of the whole scheme that the gang had conceived. Were they presumably spooked by extra company of Warren and Mannix and the coach driver. But given unpredictability of poison action the more people were involved the more likely it was to fail (all 4 people should take coffee at about the same time, and then poison acts at different speed for different people, plus depends on how fast they drink their coffee etc). OTOH, one may argue, the gansters should have started shooting using their planted pistols as soon as commotion caused by poisoning ensued.  What I am saying that this bit seemed a little contrived. But then, you can say that, as humans, they just made mistakes.\n\nAs for Ruth and Warren.... Warren should have called Ruth outside under some pretext and told him about his suspicions from the outset instead of getting sucked into proceedings.",
        "upvotes": 50,
        "comments": 48,
        "media": null,
        "permalink": "/r/movies/comments/1gtxg4o/the_hateful_eight/"
    },
    {
        "id": "1gtfcwh",
        "author": "Curious_Feature_7532",
        "title": "Glengarry Glen Ross they really stole the leads for $2,500?",
        "content": "Watched Glengarry Glen Ross for the first time last night and rewatched it to get everything.\n\nFor the amount of money they could make on a sale versus what they got for selling the leads really makes me wonder just how desperate they must've gotten if they really burgled their own office and sold all for allegedly five grand total. Seems like peanuts, kinda made Levene trying to bribe Williamson with $2,500 almost comical.",
        "upvotes": 607,
        "comments": 207,
        "media": null,
        "permalink": "/r/movies/comments/1gtfcwh/glengarry_glen_ross_they_really_stole_the_leads/"
    },
    {
        "id": "1gtfztb",
        "author": "BunyipPouch",
        "title": "How Neon Flipped Movie Marketing on Its Head to Make ‘Longlegs’ the Indie Hit of the Year - A guerrilla campaign involving cipher codes and a creepy hotline but no TV ads (and no Nick Cage) got horror fans hooked on Osgood Perkins' serial killer thriller.",
        "content": "",
        "upvotes": 526,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YNdG8bO3BOn4I9E0ojVXdhnwARmGQ-GKtGB5qoBOYEo.jpg?auto=webp&amp;s=6028ddef6d5e735a54bf8b297ad0b7c2c4358ce5"
        },
        "permalink": "/r/movies/comments/1gtfztb/how_neon_flipped_movie_marketing_on_its_head_to/"
    },
    {
        "id": "1gtbzh9",
        "author": "Both_Sherbert3394",
        "title": "I might just be dumb but I genuinely enjoyed 'Trap'",
        "content": "I actually saw this at an early screening so it was before any of the reviews had come out, and having been all over the board with M Night, I never really know what to expect, but the concept for this one was more interesting to me than either of the last two movies he's made, so I was at least curious to check it out.\n\nAs far as the 'believability' of it, I was a little surprised how many people seemed to just totally be in shock that M Night would make a film with a ridiculous concept, given that he also made a movie about a beach that makes you old, meaning I wasn't exactly holding out for stark realism. I admit, it is an absurd premise, but when the movie is being pitched as 'Silence of the Lambs at a Taylor Swift concert', I'm not going into it expecting anything other than entertaining schlock, which is exactly what I got. It feels like a slightly shitty De Palma movie, but I'll take a flawed, original concept over fucking Venom 3 or Red One any day.\n\nThe main reason this works at all, for me at least, is Josh Hartnett. M Night movies live or die on their characters, and while this is nowhere near Bruce Willis in Unbreakable or James McAvoy in Split, I still thought he really understood exactly what he needed to bring, and the fact that it was contextualized as 'an obsessive serial killer in a highly tense situation having to feign normalcy' made the signature weird Shyamalan dialogue make a lot more sense, especially when the daughter would call him out on sounding weird.\n\nHis performance (and the film in general) has been compared to the Hitman games, and I think that's pretty apt. It's also a movie where the overall quality of the production combined with the ridiculousness helps make it feel like 'polished/\"elevated\" schlock', which studios aren't really making a lot of anymore, for better or for worse.\n\nAfter rewatching it on streaming the other night just to see if anything had changed from the early version I saw (it hadn't), I can definitely admit the hype of being at a screening gave me a bit of a rose-tinted view of it the first time, but in general I still thought it was a fun movie with more self awareness than Shyamalan usually has, and had enough fun with its concept that I was a little bummed when it seemed like most people really weren't digging it, at least at first. Curious how y'all felt about this one.",
        "upvotes": 736,
        "comments": 318,
        "media": null,
        "permalink": "/r/movies/comments/1gtbzh9/i_might_just_be_dumb_but_i_genuinely_enjoyed_trap/"
    },
    {
        "id": "1gt56nr",
        "author": "Kind_Mastodon_1585",
        "title": "The ‘Sideways’ Revolution: How a Single Joke Upended the Wine World\n",
        "content": "",
        "upvotes": 2882,
        "comments": 295,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mjuy77fk9qb13CVdg9yjJPgntvCY_YDQPyWOadN5BjY.jpg?auto=webp&amp;s=9483ac2c17b8ca691ec80b651088ff0f842a1d33"
        },
        "permalink": "/r/movies/comments/1gt56nr/the_sideways_revolution_how_a_single_joke_upended/"
    },
    {
        "id": "1gtpoam",
        "author": "NoobMaster2636",
        "title": "What are your guilty pleasure Movies? ",
        "content": "We all have those movies that we know aren’t technically great, but we can’t help but enjoy them anyway. For me, *Madame Web* is one of those—it’s not a masterpiece, but its goofy, offbeat vibe makes it strangely fun to watch. Similarly, *Halloween Ends* might have been a poor conclusion to the trilogy, but I still found myself having a good time with it, despite its flaws. Sometimes, the movies we’re \"supposed\" to dislike are the ones we love the most. What are your guilty pleasure movies—the ones that may not be perfect but still bring you joy?",
        "upvotes": 81,
        "comments": 425,
        "media": null,
        "permalink": "/r/movies/comments/1gtpoam/what_are_your_guilty_pleasure_movies/"
    },
    {
        "id": "1gu82yp",
        "author": "GizmosArrow",
        "title": "Can you recommend some good black magic/voodoo/ancient evil movies?",
        "content": "Got an appetite for something deep and unnerving. This comes from my recently seeing Heretic (no spoilers) and hoping it went one way when it kind of copped out and didn’t. Another one I’ve enjoyed was The Skeleton Key. Maybe even The Void for its Lovecraftian ancient evil aspects. \n\nAny recommendations for similarly themed or aesthetically similar movies? Deep bayou south. Small town dark magic. Puritan persecution that’s actually not just shitty humans behind it?",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1gu82yp/can_you_recommend_some_good_black/"
    },
    {
        "id": "1gu7kp7",
        "author": "Onlytrutalk",
        "title": "What is the movie? Horror",
        "content": "I watched it years ago. Plot went something like that: Group of friends are going somewhere and their car break. Two fake cops see them and they do illegal body search (kind of rape). \n”Cops” take those people to the woods and keep them in sea containers. \n\nThey torture them and i think one or two of them died. One has really bad tooth infection and her face swell cause she cant get her antibiotics.\n\nThen one real cop almost finds them but fake cops kill him also. I have been trying to find this movie for ages. Thanks for helping. ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1gu7kp7/what_is_the_movie_horror/"
    },
    {
        "id": "1gtcuzk",
        "author": "PrintOk8045",
        "title": "Sergio Leone, ‘the Man with No English’, mimed directions to spaghetti western star Clint Eastwood",
        "content": "",
        "upvotes": 422,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qFiH_5b7mQL4dIkbaPO2b7WvfWnZa7oEKHDIe1DJhM4.jpg?auto=webp&amp;s=384f5d2b998ae3c138ae682984f95e5b166f8153"
        },
        "permalink": "/r/movies/comments/1gtcuzk/sergio_leone_the_man_with_no_english_mimed/"
    },
    {
        "id": "1gu7cvt",
        "author": "joesen_one",
        "title": "Jamie Foxx Honors Quincy Jones | The 15th Governors Awards",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wjoJzq2zuc8SkMMteZ_p6chAiQb1O-8eX2l6shtgRRA.jpg?auto=webp&amp;s=e10738a2326b367753088fd52c309f65737dd368"
        },
        "permalink": "/r/movies/comments/1gu7cvt/jamie_foxx_honors_quincy_jones_the_15th_governors/"
    }
]