[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1r14g0c",
        "author": "ofekgold",
        "title": "Owner demand I pay for a clog caused by shitty instalment of the dishwaser",
        "content": "Hey everyone,\n\nThe sink in my apartment got clogged, apparently because of detergent buildup from the dishwasher. The plumber had to use special equipment to clear it. He explained that the problem occurred because there isn’t a separate drain installed for the dishwasher, so the detergent doesn’t drain properly.\n\nI’ve only been using the dishwasher in a normal way, but the owner is asking me to pay €360 for the repair.\n\nIs this something I’m actually responsible for? Has anyone dealt with a similar situation, and is this considered normal?\n\nThanks ",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1r14g0c/owner_demand_i_pay_for_a_clog_caused_by_shitty/"
    },
    {
        "id": "1r0ea4s",
        "author": "TheOstrich369",
        "title": "A small act of kindness in Torino that I won’t forget",
        "content": "Last week I was in Torino for a conference, and Friday, February 6, was my last day in the city — and it ended with a really beautiful moment. I was traveling with my mother and we tried to buy tickets for tram 16 using the app, but it didn’t work, so I did what everyone does and asked a guy nearby if there was another way to pay (SMS, card inside the tram, anything). He was incredibly kind, explained everything patiently, and told me we could try paying by card on the machines inside the tram. Well… surprise — they weren’t working either. So what did this awesome stranger do? He offered to pay for both our tickets. After that, I tried to give him the money (cash or Revolut), but he wouldn’t accept anything and simply said it was nothing. Maybe this doesn’t sound like a huge deal to some people, but I was truly touched. I come from a modest family and I work hard for every penny, so this gesture meant a lot to me personally — it wasn’t about the price of the tickets, it was about the kindness. I also feel a bit disappointed with myself because I didn’t get to talk to him more; I was nervous leaving my mom alone (she understands Italian but doesn’t speak English, and she’s older), so I had to move down the tram. But honestly, this guy made my day. He was warm, smiling, genuinely interested in talking — just a really good human being. So this is why I’m writing here: I don’t know if you’ll ever see this, but if you’re reading, thank you for your help, your generosity, and your kindness. You said the tickets weren’t expensive, but for me, the gesture was powerful. Please stay exactly the awesome person you are.",
        "upvotes": 166,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1r0ea4s/a_small_act_of_kindness_in_torino_that_i_wont/"
    },
    {
        "id": "1r0zdey",
        "author": "kacokaj_kejdis",
        "title": "Domanda stupida (non prendetemi per matto per favore)",
        "content": "L'altro giorno mi trovavo con un mio amico nel capolinea del 58/ di fronte alla caserma del ros dei carabinieri. Li stavamo parlando del piu e del meno e ci è venuta la domanda ma ci sara qualche caserma (se si chiamano cosi) dei servizi segreti italiani da qualche parte a Torino? Se si sapetene indicare una?",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1r0zdey/domanda_stupida_non_prendetemi_per_matto_per/"
    },
    {
        "id": "1r0wm78",
        "author": "Peppi_the_staffie",
        "title": "Cooking class Torino",
        "content": "Ciao, sto cercando un corso di cucina autentico Torino per me e le mie amiche nel mese di aprile. Preferibilmente qualcosa secondo il principio sip&amp;cook con cocktail o vino. Qualcuno può consigliarmi qualcosa? Grazie mille! ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r0wm78/cooking_class_torino/"
    },
    {
        "id": "1r13mtx",
        "author": "Big-Spite-8599",
        "title": "Colloquio per la magistrale uni Torino",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r13mtx/colloquio_per_la_magistrale_uni_torino/"
    },
    {
        "id": "1r135w5",
        "author": "Time_Nerve3028",
        "title": "Conocer gente/eventos IT ES EN",
        "content": "Hola! soy nueva en la ciudad, tengo 31 años, pero con espíritu bastante jovial (no parece que tenga mi edad) vivo por el centro y me gustaría empezar a socializar un poco, me gusta el arte, viajar, cocina, moda, naturaleza, cine… Soy una persona tranquila, pero hago muchas actividades y, de hecho, me gustaría empezar a organizar eventos y cenas pequeñas para facilitar el hecho de conocer gente. Hablo español, inglés e italiano, así que para cualquier cosa, estoy por aquí! ✨✨✨\n\n  \nCiao! Sono nuova in città, ho 31 anni, ma con uno spirito piuttosto giovanile (non dimostro la mia età). Vivo in centro e mi piacerebbe iniziare a socializzare un po’.  \nMi piacciono l’arte, i viaggi, la cucina, la moda, la natura, il cinema…\n\nSono una persona tranquilla, ma faccio molte attività e, infatti, mi piacerebbe iniziare a organizzare eventi e piccole cene per facilitare il fatto di conoscere nuove persone.\n\nParlo spagnolo, inglese e italiano, quindi per qualsiasi cosa, sono qui! ✨✨✨\n\n  \nHi! I’m new in the city, I’m 31 years old, but with quite a youthful spirit (you wouldn’t say I’m my age). I live in the city center and I’d love to start socializing a bit.  \nI like art, traveling, cooking, fashion, nature, cinema…\n\nI’m a calm person, but I do many activities and, in fact, I’d love to start organizing events and small dinners to make it easier to meet people.\n\nI speak Spanish, English and Italian, so for anything, I’m here! ✨✨✨",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1r135w5/conocer_genteeventos_it_es_en/"
    },
    {
        "id": "1r0z26l",
        "author": "yashonredit",
        "title": "From where to rent a tuxedo in Torino?",
        "content": "Looking for a limited budget options to rent a tuxedo in Torino. Can anyone please suggest some options?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1r0z26l/from_where_to_rent_a_tuxedo_in_torino/"
    },
    {
        "id": "1r0jqfb",
        "author": "New-Trifle-7544",
        "title": "Book club a Torino!",
        "content": "Ciao! Mi sono da circa un mesetto trasferita a Torino, sono una ragazza di 24 anni al primo anno magistrale, mi piacerebbe molto trovare un club del libro a cui andare, io vivo in San Salvario. Ogni consiglio è ben accetto! Grazie :)",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1r0jqfb/book_club_a_torino/"
    },
    {
        "id": "1r098de",
        "author": "OverhandLake69",
        "title": "mi hanno rubato la bici. Se qualcuno ha informazioni, mi contatti!!!",
        "content": "Sorry my italian isn't very good, I moved here a few months ago. \nIt was parked in my courtyard, the bike lock was stuck so it had been sitting there for a while. This is in the Centeo area.",
        "upvotes": 24,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1r098de/mi_hanno_rubato_la_bici_se_qualcuno_ha/"
    },
    {
        "id": "1r0wxri",
        "author": "Comfortable_Room6619",
        "title": "Medici di base buoni ce ne sono a torino?? Possibilmente torino Nord",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1r0wxri/medici_di_base_buoni_ce_ne_sono_a_torino/"
    },
    {
        "id": "1r0m61i",
        "author": "startcinematography",
        "title": "Turin is more than a collection of sights; it is an experience where light, history, silence and an indescribable beauty come together.........Torino nem csupán látnivalók sora, hanem élmény: fény, történelem, csend és egy megfoghatatlan szépség találkozása.",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/l8aYCpwdsHIp7XyYCjvfXnlhwkOZnIlPBVzpJpmUmoc.jpeg?auto=webp&amp;s=556c90f90019df5c3b3e9e1ea040e1257eb9ac02"
        },
        "permalink": "/r/torino/comments/1r0m61i/turin_is_more_than_a_collection_of_sights_it_is/"
    },
    {
        "id": "1r0c3a3",
        "author": "IzanamiNoCane",
        "title": "Consigli ristoranti per questo weekend? Tutto pieno 😅",
        "content": "Ciao a tutti, sto bestemmiando.\n\nQuesto weekend andrò a torino  per la prima volta in vita mia.  \nSto cercando un posto carino dove andare a mangiare venerdì e sabato sera, ma dopo aver chiamato un po’ di ristoranti che avevo in mente ho trovato praticamente tutto occupato.\n\nAvete qualche consiglio su posti dove si mangia bene e dove magari si riesce ancora a trovare posto all’ultimo?  \nVorrei qualcosa di tipico, zona centro/San Salvario/Crocetta ma ho la macchina e mi sposto senza problemi se ne vale la pena.\n\nGrazie mille a chi risponde 🙏",
        "upvotes": 3,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1r0c3a3/consigli_ristoranti_per_questo_weekend_tutto_pieno/"
    },
    {
        "id": "1r0i7oq",
        "author": "-xGarnet99x-",
        "title": "Per disegnare..",
        "content": "Conoscete qualche negozio piuttosto serio che venda articoli per disegnare/dipingere/chi più ne ha ne metta?\n\nIl classico negozio dove un appassionato spenderebbe tutto il suo stipendio se potesse.\n\nIn sostanza stavo cercando dei buoni Sketchbook e matite, grazie!\n\nEDIT: Grazie a tutti/e per i consigli, valuterò!",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1r0i7oq/per_disegnare/"
    },
    {
        "id": "1r03xao",
        "author": "Hungry_Kale8330",
        "title": "Oneshot di Dragonbane in biblioteca - cercasi players",
        "content": "Ciao gente!  \n  \nMi chiamo Massimo, faccio il bibliotecario e sono un nerdone. Nella biblioteca dove lavoro sto cercando di organizzare un appuntamento ricorrente per delle sessioni di GDR aperte a chiunque, a prescindere dal grado di esperienza.   \n  \nSiccome in questo subreddit ho letto parecchi post di persone che cercano un party per giocare, ho pensato di condividere la locandina dell'evento. Faremo una oneshot di Dragonbane, personaggi pregenerati e partecipazione completamente gratuita.\n\nSe vi va, ci sono ancora un paio di posti liberi. Ciao!",
        "upvotes": 10,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sm8pnpkaxgig1.png?auto=webp&amp;s=7ae2a674f2082a24feafbf45506283c3fffa6721"
        },
        "permalink": "/r/torino/comments/1r03xao/oneshot_di_dragonbane_in_biblioteca_cercasi/"
    },
    {
        "id": "1r0m30x",
        "author": "lilyssmx",
        "title": "chi vuole far parte di una band?",
        "content": "ciao a tutti, mi chiamo isabella e cerco qualcuno che sia disposto a creare una band, io vivo in zona alessandria, ma posso muovermi. \n\ncanto  e scrivo, solo che non sono capace a suonar nulla (disposta ad imparare uno strumento), il genere che vorrei fare é indie pop, ma sono aperta a sperimentare più di un genere, ascolto tanta musica diversa quindi mi piacerebbe non fermarmi a un genere solo. \n\ngli artisti da cui prendo più ispirazione sono: baby bugs, we are dirt, her’s, the neighbourhood, mitski, bambi baker ecc, per menzionarli pochi.\n\nsolitamente scrivo testi che hanno una melodia soft, dolce, ma le parole sono più sul macabro e tristi, per me quello che dico devo avere sempre un grande impatto emotivo e per la maggior parte dei testi, sono in inglese, un paio in italiano, ma fare un mix non é una cattiva idea.\n\nho una marea di testi pronti per chi fosse interessato! ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1r0m30x/chi_vuole_far_parte_di_una_band/"
    },
    {
        "id": "1r077cv",
        "author": "DDDDAZED",
        "title": "Rimappo centralina ECO (da professionisti) su Torino",
        "content": "Ciao Reddit,\n\nsto pensando di ri-mappare la centralina del mio GLK, non lo voglio fare per fare le fiamme e mettere i neon, vorrei una mappa ECO perché praticamente è una petroliera, ma la macchina ha pochi KM e obiettivamente è troppo comoda, se riuscissi ad abbattere i consumi sarei contento.\n\nQualcuno conosce centri specializzati e seri che fanno questi lavori?  \nNon proponetemi cugini\\\\amici\\\\parenti perché non li prenderei in considerazione.\n\nGrazie",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1r077cv/rimappo_centralina_eco_da_professionisti_su_torino/"
    },
    {
        "id": "1qzx8vd",
        "author": "Putrid_Vegetable8735",
        "title": "Due settimane vuote",
        "content": "Ciao ho 22 anni, sono uno studente fuorisede. Ho finito gli esami della sessione e ora mi restano due settimane completamente vuote qui a torino prima dell'inizio delle lezioni. Praticamente non ho amici e penso che la noia si farà sentire. Che cosa potrei fare nei prossimi giorni? Ci sono dei luoghi carini da visitare nei dintorni di Torino? Esistono gruppi che fanno escursioni facili? \n(Se qualcuno/a vuole scrivermi per due chiacchiere io ci sono)",
        "upvotes": 8,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1qzx8vd/due_settimane_vuote/"
    },
    {
        "id": "1qzfxv1",
        "author": "Individual_Bug_517",
        "title": "Domanda forse stupida sul nuoto a Torino",
        "content": "    CIAO. Mi scuso in anticipo, non parlo italiano (ancora), quindi ho dovuto Google Translate. Allora sono a Torino da qualche mese e vorrei andare a nuotare in una delle piscine pubbliche come Aquatica o Palazzo del Nuoto, ma sono aperto a consigli. Le mie domande principali sono le seguenti:\n    1. Per nuotare da solo è necessario avere un certificato medico?\n    2. Quali piscine consiglieresti per le corsie di nuoto (25 o 50 m) un paio di volte a settimana la sera?\n    3. Ho cercato delle piscine e le tariffe mi sembravano molto alte solo per il nuoto (8,50 euro più 40 euro di quota di iscrizione) NUOTO ASSOCIATIVO è solo l'ingresso in piscina o è una specie di corso?  \n    \n    Grazie mille",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1qzfxv1/domanda_forse_stupida_sul_nuoto_a_torino/"
    },
    {
        "id": "1qzyxgj",
        "author": "Naso_Coraggioso",
        "title": "Come sarebbero delle ipotetiche olimpiadi estive 2036 Milano - Torino - Genova ?",
        "content": "Sarebbe fattibile ?\n\nSe non erro a Milano no n hanno uno stadio olimpico con la pista d'atletica per questo molti sport da stadio potrebbero essere divisi tra Milano e Torino, invece gli sport acquatici a Genova.\n\nChe ve pare come proposta ?\n\nSe ci fate caso tutti stanno facendo i complimenti per le olimpiadi invernali italiane",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1qzyxgj/come_sarebbero_delle_ipotetiche_olimpiadi_estive/"
    },
    {
        "id": "1qze20h",
        "author": "asilorepublic95",
        "title": "Boxe sacco",
        "content": "ciao,ci sono delle palestre di boxe dove andare e magari sfogarti solo a fare il sacco? senza dover pagare chissà cosa.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qze20h/boxe_sacco/"
    },
    {
        "id": "1qzq9sk",
        "author": "Tony_zer0five",
        "title": "Lego e cate",
        "content": "C'è un posto dove posso scambiare o vendere carte bakugan e pezzi lego?\nA Torino o in provincia.\nPerché ho delle carte bakugan \nE un sacco di pezzi lego diversi che vorrei vendere ho scambiare\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qzq9sk/lego_e_cate/"
    },
    {
        "id": "1qzp0oh",
        "author": "Mauriizio",
        "title": "portare 🍃 in treno",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qzp0oh/portare_in_treno/"
    },
    {
        "id": "1qzocnz",
        "author": "VelvetUltramarine",
        "title": "Qualcuno conosce la band Neon Strays di Torino?",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6VKUtKEAs4-DvIKDLhoW1nRMSVJ7EZtW4BOaMzYXQQs.jpeg?auto=webp&amp;s=1c8fc4f57bd6c4ad678fb23e9d7ad92a60c06041"
        },
        "permalink": "/r/torino/comments/1qzocnz/qualcuno_conosce_la_band_neon_strays_di_torino/"
    },
    {
        "id": "1qzihuo",
        "author": "asilorepublic95",
        "title": "Palestre",
        "content": "delle palestre che non siano mcfit, Orange,Virgin,, tutte queste commerciali che più che palestre sembrano sfilate di moda ,montati ,brlinnantinati e fili nel culo..per carità tutto lecito...però qualche palestra stile old School o qualcosa di simile zona santa Rita ,mirafiori ,san paolo?.grazie .",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qzihuo/palestre/"
    },
    {
        "id": "1qzadah",
        "author": "AleSatt",
        "title": "Quartiere torino",
        "content": "Ciao! Mi sto trasferendo a Torino per alcuni mesi e ho trovato casa a Moncalieri corso roma ma verso piazza bengasi (di cui mi hanno parlato male) e un’altra a via beaulard. Io lavoro all’ospedale sant’anna ma piu che la vicinanza vorrei sapere quale mi consigliereste come zona per quanto riguarda la sicurezza",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1qzadah/quartiere_torino/"
    },
    {
        "id": "1qzn4m1",
        "author": "alessia_1818281",
        "title": "Ciaooo cerco amicizia mi chiamo Alessia ho 26 anni",
        "content": "Ciaooo cerco amicizia mi chiamo Alessia ho 26 anni",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1qzn4m1/ciaooo_cerco_amicizia_mi_chiamo_alessia_ho_26_anni/"
    },
    {
        "id": "1qz9eib",
        "author": "NoYogurtcloset3227",
        "title": "LAUREA MAGISTRALE IN COMUNICAZIONE E CULTURE DEI MEDIA UNITO",
        "content": "Sto valutando questo corso di laurea magistrale UNITO e mi piacerebbe capire meglio com’è l’esperienza, sia dal punto di vista delle lezioni che dell’organizzazione in generale.  \nSe qualcuno ha voglia raccontarmi la sua esperienza o darmi qualche consiglio, gliene sarei davvero grato. Grazie mille!\n\nI'm evaluating UNITO master's degree program and would like to better understand what the experience is like, both from the perspective of the lessons and the organization as a whole.  \nIf anyone would like to tell me about their experience or give me some advice, I would really appreciate it. Thank you very much!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qz9eib/laurea_magistrale_in_comunicazione_e_culture_dei/"
    },
    {
        "id": "1qz7l4g",
        "author": "the-n-bit",
        "title": "Alimentari francesi a Torino?",
        "content": "Ciao, qualcuno sarebbe a conoscenza di posti dove comprare degli ingredienti francesi per cucinare (burro, formaggi, ecc.)?\n\nGrazie",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1qz7l4g/alimentari_francesi_a_torino/"
    }
]