[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1ov4re6",
        "author": "Optimal_Bet_5243",
        "title": "Best show u ever watched ❤️.",
        "content": "Kindly tell me the best show(s) u have ever watched that u wish u could forget just to watch again with awe, i m looking for some fast paced thriller which ll keep me hooked in every episode.(But all the genres r welcome)",
        "upvotes": 19,
        "comments": 209,
        "media": null,
        "permalink": "/r/netflix/comments/1ov4re6/best_show_u_ever_watched/"
    },
    {
        "id": "1oulle8",
        "author": "Interesting_Lab5792",
        "title": "Netflix Might Finally Be Forced To Put Its Movies In Theaters",
        "content": "",
        "upvotes": 201,
        "comments": 125,
        "media": null,
        "permalink": "/r/netflix/comments/1oulle8/netflix_might_finally_be_forced_to_put_its_movies/"
    },
    {
        "id": "1ov8c5j",
        "author": "layinlow-playinslow",
        "title": "I need new tv shows to binge",
        "content": "Please tell me atleast 1 or 2 shows I can binge , I'm into crime drama , italian mob shows like sopranos, gangster tvs shows and horror if anybody has anything good lmk!",
        "upvotes": 2,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1ov8c5j/i_need_new_tv_shows_to_binge/"
    },
    {
        "id": "1ov8alw",
        "author": "Qu4ckAttack",
        "title": "Netflix subs jumping about top and bottom.",
        "content": "I get why they move subs up and down position if the screen is darker or lighter, but why can't they keep them at the bottom of the screen and just change the colour of text instead for readability. I feel like I'm constantly chasing subs around a screen, especially if in PT or ES that can speak quickly and you miss the EN text. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ov8alw/netflix_subs_jumping_about_top_and_bottom/"
    },
    {
        "id": "1oui0dv",
        "author": "GlasgowRose2022",
        "title": "The Perfect Neighbor - Susan Lorincz sues AJ’s family",
        "content": "Because of course she has to torture this poor family even more…\n\nhttps://thetab.com/2025/11/11/susan-lorincz-threatens-to-sue-ajike-owens-children-and-family-in-shocking-handwritten-letter",
        "upvotes": 38,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1oui0dv/the_perfect_neighbor_susan_lorincz_sues_ajs_family/"
    },
    {
        "id": "1ov6705",
        "author": "ashleycat720",
        "title": "Does netflix increase ad frequency/ duration after first month?",
        "content": "I purchased netflix ad plan last month to watch Wednesday. I have not had netflix in years. I didnt think the ads were too bad but now that its the second month of netflix, im getting commercials more frequently, some breaks its 1.5 minutes. A 40 minute show will have 4 commerical breaks. It doesnt seem worth it; there are free steaming channels with commericals. Did you notice an increase in commericals? ",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ov6705/does_netflix_increase_ad_frequency_duration_after/"
    },
    {
        "id": "1ov3jb0",
        "author": "niketax_",
        "title": "Frankenstein (2025): Conversation between God and Human",
        "content": "Before anything else, it is a complete feast for the eyes and the soul. The cinematography, costumes, locations, atmosphere, and characters were grotesquely beautiful. In the words of Kant — beauty moves us deeply without desire or obsession. That’s exactly what I felt after watching this fantasy film.\n\nI’m not qualified to assess the actors’ performances, because they were simply magnificent and magical. It’s pure Guillermo del Toro — his signature way of storytelling and visual poetry.\n\nHowever, what truly jolted me was the conversation between Victor the human and Victor the creature. It felt like a juxtaposition of God speaking with man. The arguments, the rejection, and the final acceptance without humiliation reflect the entire lifespan of the relationship between God and humankind.\n\nIt all ends, fittingly, with Nietzsche’s words — “God is dead.”\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ov3jb0/frankenstein_2025_conversation_between_god_and/"
    },
    {
        "id": "1ouz8gm",
        "author": "CM-Edge",
        "title": "New WWE content from this week on 720p only?",
        "content": "I noticed with Monday Night Raw yesterday and now with NXT on Netflix, that both shows only go up to 720p and not higher under any circumstances. However, if I just put on any episode from last week or older it's immediately 1080p.\n\nWhat's going on? Anyone noticed that?\n\n[https://a.l3n.co/fAQwg9.jpg](https://a.l3n.co/fAQwg9.jpg)  \n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ouz8gm/new_wwe_content_from_this_week_on_720p_only/"
    },
    {
        "id": "1ov2eav",
        "author": "bottlecoco",
        "title": "Suggest me some informative shows on Netflix",
        "content": "Hey guys,\nI’m looking for some informative shows or docuseries on Netflix — something I can actually learn from.\nIt could be about space, psychology, history, science, or anything interesting and educational.\nBasically, I don’t want fiction right now — only stuff that teaches or expands knowledge.\n\nWhat are your best recommendations?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ov2eav/suggest_me_some_informative_shows_on_netflix/"
    },
    {
        "id": "1ov16a1",
        "author": "dumerthanaglobe",
        "title": "Where to buy physical FYC dvds",
        "content": "So I’m wondering if Netflix still releases some shows on dvd and I’m reading that target was the place to get them but since target no longer sells dvds, where would I go to get new fyc copies? Thanks. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ov16a1/where_to_buy_physical_fyc_dvds/"
    },
    {
        "id": "1ouqyg4",
        "author": "DobroGaida",
        "title": "Much the best thing on Netflix is the fireplace channel",
        "content": "Granted the episodes at an hour long are too short, and I’d swear I’ve seen this one before. But the action is unrelenting. And the dialogue crackles with wit.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ouqyg4/much_the_best_thing_on_netflix_is_the_fireplace/"
    },
    {
        "id": "1ouxqnm",
        "author": "Kurtz62",
        "title": "Taken in Plain Sight",
        "content": "Maybe I’m just not a hard a guy to please because I thought “Taken in Plain Sight” was a really good, intense movie. \n\nNow I’m not movie connoisseur so maybe that’s why I genuinely enjoyed it but I’m also a stinker for abduction thrillers. \n\nI don’t know… I’ve seen people trash but I thought it was a good movie and I would definitely watch it again. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ouxqnm/taken_in_plain_sight/"
    },
    {
        "id": "1ounfnf",
        "author": "Imblurryfaced",
        "title": "The Diplomat plot hole",
        "content": "I'm watching episode 6 of S3, and I can't get over the plot hole. I binged from s1e1 to s3e2 within like 2-3 days. I loved the show! S3 wasn't feeling too good, and now it's unwatchable \n\nIn what world would Roylin tell Lenkov about the American involvement? Hal and Kate would be the only 2 people she would've ever told, that too because they threatened to turn her in to the police. Even the other British MPs in on the attack wouldn't know about it. If anything, members of Lenkov's group could know about British involvement, and a leak about that would make sense. I can't get past this, and I don't even want to watch the rest of the episodes anymore",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ounfnf/the_diplomat_plot_hole/"
    },
    {
        "id": "1otuwg4",
        "author": "JamieLTR",
        "title": "Documentary",
        "content": "Looking for a good documentary to watch! Just got done with unknown number the high school catfish. I’ve watched several other documentaries on Netflix (Murdaugh murders, Gabby’s petito, take care of maya, etc). Any recommendations?\n",
        "upvotes": 204,
        "comments": 409,
        "media": null,
        "permalink": "/r/netflix/comments/1otuwg4/documentary/"
    },
    {
        "id": "1oth71o",
        "author": "Candiez89",
        "title": "“Beef” on Netflix",
        "content": "Wow. Just wow. I’d never even heard of the tv series “Beef” on Netflix and randomly stumbled upon it when I was browsing Netflix last night looking for something to watch. I ended up binge watching the whole thing in one go, and I have to say it was hands down one of the best tv series I’ve watched in a very long time. It had me laughing, crying, and just feeling all the feels.\n\nSerious credit to the actors, producers, and screenwriters for real. A special shoutout to the actor Steven Yeun in particular, who played the main character, Danny 👏👏🙌... Amazing.\n",
        "upvotes": 764,
        "comments": 97,
        "media": null,
        "permalink": "/r/netflix/comments/1oth71o/beef_on_netflix/"
    },
    {
        "id": "1ouulcq",
        "author": "FriedSamuraii",
        "title": "Can’t watch using mobile data anymore",
        "content": "I was watching last night using data with no issues. I still have plenty and other apps are working but when I try to watch on Netflix it tells me “WiFi network required, your phones streaming settings require you to connect to a WiFi network(10048)” I’ve checked my app settings and it’s on automatic not WiFi only. Mobile data setting is also turned on under Netflix in my iPhone settings so I’m confused as to why I could watch last night but now it’s giving this error Anyone have a fix around this? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ouulcq/cant_watch_using_mobile_data_anymore/"
    },
    {
        "id": "1otvvzj",
        "author": "57829",
        "title": "‘Wednesday’ Star Catherine Zeta-Jones Wants Danny DeVito to Play Cousin It: ‘He’s Gonna Kill Me for That’",
        "content": "",
        "upvotes": 76,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1otvvzj/wednesday_star_catherine_zetajones_wants_danny/"
    },
    {
        "id": "1oua7s8",
        "author": "AffectionateAge1448",
        "title": "Love is blind",
        "content": "I think people  forget reality tv is NOT real. It's set up to cause drama. If you dont know how reality tv works you should look into it. I think it's interesting reading these threads, but at the same time I have to remember myself how staged all of it is. So i will explain a little, basically the producers set up scenes for them. The producers will say stuff like \" why dont you go confront so and so\" or \"why dont you leave so and so and go talk to blank\" \n\nFor example joes comment about Madison's body. \nIn this case im 99% sure the producers said something along the lines of \"joe what is your typical body type\" and he explained it. They just chop it up to make it look worse for shock value. &amp; based on how the shows are edited Joe could have even said that at a completely different time, such as auditions.  The producers  could have said \"what type do you usually  go for\"  and then they edidted the clips to make it seem like he was talking down on Madison. \n\nAlso edmond.. poor edmond. Remember theres hundreds of hours of him and they clipped out the parts where he was acting how he was shown, to make him look that way. Even the bed scene could have been edidted and clipped to shit to make him look pushy. I guarantee it was a different conversation about how he is always the nice guy and gets walked over, and then producers edidted it to be about sex, or they chopped clips together, or they told them to say those things, or turn it into a convo about sex. \n\nPeople need to remember that theres likley hundreds of hours of filming,  chopped down to 8 hours. Those 8 hours are highly edited to create a storyline. They move clips around to create a story line, one scene could be from 3 different nights. I remember watching a documentary and they said the producers sometimes add words in, so if you ever look at someone and dont see their mouth lining up with the words, this is why. \n\n-Franken-bites\": This is a technique where editors take parts of sentences from different times and stitch them together to create a new, often out-of-context, quote that wasn't said in that exact way.\"\n\n-Narrative Construction: Producers and editors work to build a story, and they select footage that fits the pre-planned narrative, even if it occurred at a different time. The goal is to tell the \"best story,\" not necessarily present events in a strictly chronological or unvarnished way.\n\n-Reaction Shots: Editors often use \"cutaways\" or reaction shots filmed at separate times and locations to show a contestant's reaction to an event, even if that reaction was originally for something else entirely.\n\n-Confessionals/Interviews: The \"talking head\" interviews are typically filmed after the events have occurred and can be shot over multiple days. Producers often guide participants with specific questions to get sound bites that help explain or set up a storyline, which are then edited into the main action.\n\n- Continuity: To maintain the illusion of a single, continuous scene, participants are often asked to wear the same outfits and jewelry for interviews or pick-up shots filmed on different days.\n\n\n-Time Compression: Long periods of filming (e.g., a week or even 21 days for shows like Naked and Afraid) are compressed into a 30-42 minute episode, requiring significant manipulation of time and sequence to create a flowing episode. \n\nNow apply this to every single person on LIB. \n\nReality tv is not real. Which is why its crazy to me that strangers online are so comfortable with bullying the contestants. \n",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1oua7s8/love_is_blind/"
    },
    {
        "id": "1ouliw6",
        "author": "Particular-Leg-2392",
        "title": "Beautiful Morgan. Nobody wants this.",
        "content": "\nI’m honestly a bit surprised that Morgan is written as if she’s not supposed to be that attractive. She keeps saying that Dr. Andy’s ex is “way, way, way prettier” than her, which just isn’t true. She’s also constantly shocked when someone is really good-looking (like Rebecca, for example, completely stuns her “oh no, she’s still hot! I’m so sad”).\n\nIn Season 1 she even mentioned that she was always “the second one” compared to her sister, everyone loved her sister and Morgan was just kind of meh.\n\nBut to me, Morgan is absolutely gorgeous. Stunning, radiant, magnetic. Sure, she’s shallow, but so is Joanne, and somehow Morgan still has this lightness and humor that make her incredibly charming.\n\nI get that confidence and popularity don’t always line up with looks, but still… I can’t help feeling like the writers originally imagined someone far less striking.\n",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1ouliw6/beautiful_morgan_nobody_wants_this/"
    },
    {
        "id": "1otxqx3",
        "author": "[deleted]",
        "title": "What’s one song that became so iconic because of the movie it was used in, that you can’t hear it without instantly thinking of that film?",
        "content": "Love Me again by John Newman.\nThe song was used in the film \"Edge of Tomorrow\" and with its increased popularity found its way into the FIFA 15 game's soundtrack which boosted its success even more. However, those who've watched Edge Of Tomorrow, now can't remember the movie without remembering the song first!",
        "upvotes": 30,
        "comments": 281,
        "media": null,
        "permalink": "/r/netflix/comments/1otxqx3/whats_one_song_that_became_so_iconic_because_of/"
    },
    {
        "id": "1ouhkk6",
        "author": "Striking_Discount_38",
        "title": "Black Rabbit",
        "content": "Starts at the end, then starts over. I personally hate shows/films that do this. It's a good show buuut I know what happens so imma just fast forward to see if we catch up ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ouhkk6/black_rabbit/"
    },
    {
        "id": "1ougihe",
        "author": "DetectiveFrequent482",
        "title": "WHAT IS GIGN",
        "content": "When I was searching I came across a title that was black and had the letters GIGN in all black. When I click it, it has no episodes, but it says elite force, French thriller,drama, and crime. Now when I searched it up I couldn't find anything of it. Does anyone have any information on what this is?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ougihe/what_is_gign/"
    },
    {
        "id": "1oubtd7",
        "author": "umnomecreativo",
        "title": "Have any of them worked?",
        "content": "Has any petition been successful yet? I believe we made petitions to return: Anne with an \"e\", Insatiable, The society, The hollow, One of Us Is Lying, I Am Not Okay With This... And as far as I know none of them worked unfortunately, I wanted to know if this effort has ever yielded results?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1oubtd7/have_any_of_them_worked/"
    },
    {
        "id": "1otcxn2",
        "author": "FinalLightNL",
        "title": "Another price hike... Are you guys serious???",
        "content": "€20,99 for the new plan is ridiculous, how are you guys oblivious to why people are taking other roads to watch shows and movies?\n\nThat's it, i couldn't give less of a ...   i'm canceling my sub.",
        "upvotes": 105,
        "comments": 83,
        "media": null,
        "permalink": "/r/netflix/comments/1otcxn2/another_price_hike_are_you_guys_serious/"
    },
    {
        "id": "1ou9yis",
        "author": "Specialist_Job_2897",
        "title": "Halo 🥲",
        "content": "Im watching Halo and I thought it would be really bad like every other halo big screen adaptation but it shocked me how good it was. Im almost finished with season 2 and im getting SO depressed that it’ll never return because I know it’s a cliff hanger at the end. What do you guys think of it? Season 3?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ou9yis/halo/"
    },
    {
        "id": "1ou13yo",
        "author": "bbsquirell",
        "title": "Finishing Nurse Jackie soon and I need a plan for what to watch when I finish it",
        "content": "Im very into the drug addict aspect of this show. I’d like to lean into that as I search for a new show. I also like the drama! I’m probably going to stay away from more medical shows because the whole time I’ll just be thinking “nurse Jackie is better” looking for suggestions for shows that are really good and dramatic but not soapy. Preferably with multiple seasons! I’m patiently waiting for stranger things season 5, but I’m going to finish this series before that is released. \n",
        "upvotes": 4,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1ou13yo/finishing_nurse_jackie_soon_and_i_need_a_plan_for/"
    },
    {
        "id": "1ou8blm",
        "author": "Da-Vin-chi",
        "title": "Does anyone know how to get this thing off my screen in the top left corner?",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ou8blm/does_anyone_know_how_to_get_this_thing_off_my/"
    },
    {
        "id": "1otqbal",
        "author": "MasterSparrow",
        "title": "Man Vs Baby trailer",
        "content": "There's something weirdly AI generated about the baby. But good trailer overall.\n\nAnything with Mr Bean/Rowan Atkinson in it gets my watch and Man Vs Bee was amazing.",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1otqbal/man_vs_baby_trailer/"
    }
]