[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1mf2uwq",
        "author": "Careful_Molasses_496",
        "title": "Trovare un bilocale da studente è impossibile (rant)",
        "content": "Le garanzie non vanno bene: nemmeno le buste paga di qualche familiare al di sotto di 1500€ vengono prese in considerazione. I garanti devono essere in Italia, così come il contratto di lavoro a tempo indeterminato. Le agenzie chiedono due o tre mensilità, e ci sono anche agenzie fuffa e privati che truffano o vogliono affittare in nero. Spesso le richieste di affitto non vengono accettate per motivi non specificati: “la proprietà ha deciso di procedere con un altro candidato”. Prendere casa è peggio di un colloquio di lavoro. \n\nI prezzi non saranno quelli di Milano, ma è possibile che dopo quattro mesi sia ancora al punto di partenza? Non so se rassegnarmi e smettere di cercare durante agosto, ogni giorno controllo i gruppi Facebook e i principali siti d’affitto, ho anche le notifiche attive.\n\nTroverò una casa? A settembre compariranno magicamente centinaia di affitti che potranno esaudire la domanda? Chissà. \n\nP.S.: dimenticavo i bilocali di 40mq a 700€ che cadono a pezzi ",
        "upvotes": 9,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1mf2uwq/trovare_un_bilocale_da_studente_è_impossibile_rant/"
    },
    {
        "id": "1meu7rj",
        "author": "vah_man_",
        "title": "Saturday market- Torino",
        "content": "",
        "upvotes": 14,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1meu7rj/saturday_market_torino/"
    },
    {
        "id": "1mfa3i0",
        "author": "yunitacuba",
        "title": "Cerco un gruppo o una comunità di mamme single.",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mfa3i0/cerco_un_gruppo_o_una_comunità_di_mamme_single/"
    },
    {
        "id": "1mewkcj",
        "author": "_jorjoVhanni",
        "title": "Gtt e abbonamento mensile",
        "content": "Sono da poco in città e volevo fare l'abbonamento mensile. Ma che razza di app/sito avete per la mobilità? Per fare l'abbonamento mensile devo fare la carta bip ma nelle opzioni nemmeno mi esce la possibilità di comprarlo. Lasciando stare la cagata di comprare un anno online e dover aspettare una tessere (tranne per la deroga di 7gg) ma mi sembra la classica cagata all' italiana per  autocomplicare le cose al cittadino. A Monaco tra un po' manco interessava chi ero quando facevo l'abbonamento.",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1mewkcj/gtt_e_abbonamento_mensile/"
    },
    {
        "id": "1mf2bz1",
        "author": "4L3X_525",
        "title": "Ho trovato un mazzo di chiavi in via Caraglio",
        "content": "Vicino al lidl del palazzo lancia, se sapete scrivetemi in dm se siete i proprietari e date dettagli del mazzo. Questo lunedì lo porterò agli oggetti smarriti di via Antonio Meucci 4",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mf2bz1/ho_trovato_un_mazzo_di_chiavi_in_via_caraglio/"
    },
    {
        "id": "1mf2777",
        "author": "Forward_Try3053",
        "title": "palestra a Torino: Mcfit o Fitactive?",
        "content": "Ciao!\nvivo a Torino da un po’ e stavo cercando una palestra non troppo costosa, ma con un buon rapporto qualità prezzo.\nDopo qualche ricerca sono arrivata a scegliere tra la Mcfit e la Fitactive, avete consigli? Si accettano anche altre proposte.\nIo sono circa in zona politecnico, quindi se sono ben collegate con i mezzi è anche meglio🙏🏼",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mf2777/palestra_a_torino_mcfit_o_fitactive/"
    },
    {
        "id": "1meuixw",
        "author": "JazzlikeCommission30",
        "title": "Bardonecchia",
        "content": "Hello guys, my Friend and I want to spend a day in Bardonecchia  I would love to hear your advice on how to spend the day to enjoy the most of our time there. and one question how much we have to walk to get to the lake? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1meuixw/bardonecchia/"
    },
    {
        "id": "1metnx1",
        "author": "Connect-Speech-7694",
        "title": "Persone al CCA",
        "content": "Ho da poco ricevuto la mail di ammissione al CCA di Torino. Questo post ha lo scopo di farmi entrare in contatto con persone che frequentano il CCA e con persone che si trovano nella mia stessa posizione.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1metnx1/persone_al_cca/"
    },
    {
        "id": "1mec7aw",
        "author": "whos_there1234",
        "title": "cerco di fare nuove amicizie questo agosto",
        "content": "Ciao a tutti. Sono 24 anni. Sono nuovo a Torino e dato che ad agosto tutti sono fuori, cerco di conoscere nuove persone. In genere la sera mi ritrovo spesso a voler uscire ma non so cosa fare (forse per mancanza di eventi o per mancanza di amici disponibili per uscite serali). Quindi spero di incontrare nuove persone con cui uscire... anche solo per un drink.",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1mec7aw/cerco_di_fare_nuove_amicizie_questo_agosto/"
    },
    {
        "id": "1me7pqh",
        "author": "DANYMATT47",
        "title": "Parcheggio retro Torino Stura",
        "content": "Ciao a tutti. Sapete per caso se il parcheggio all'aperto sul retro della stazione Torino Stura sia gratuito o meno? Lascio foto di Maps con posizione per riferimento.\n\nGrazie",
        "upvotes": 3,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/iq5vsqf2v8gf1.jpeg?auto=webp&amp;s=82c6d3c0a2c241d8eb7724820dfaafc2faa501f4"
        },
        "permalink": "/r/torino/comments/1me7pqh/parcheggio_retro_torino_stura/"
    },
    {
        "id": "1mdwtzm",
        "author": "0rk4n",
        "title": "Torino o Urbino? Consigli per scelta universitaria e vita in coppia",
        "content": "Ciao a tutti, io lavoro full remote nell’IT, mentre lei si è appena laureata in Scienze Farmaceutiche (triennale) e ora vorrebbe completare il percorso con la magistrale in Farmacia per poi iscriversi all’albo. Stiamo valutando dove trasferirci e le opzioni sono Torino e Urbino, perché in entrambe le sedi il corso di Farmacia non ha obbligo di frequenza – caratteristica fondamentale, visto che vorrebbe lavorare part-time mentre studia.\n\nPremetto che non siamo mai stati in nessuna delle due città, quindi ci stiamo basando su ricerche online e pareri raccolti qua e là. Vi spiego i dubbi.\n\nUrbino: cittadina molto carina, tranquilla, a misura d’uomo. Non ci piace la movida o la discoteca, quindi da questo punto di vista sarebbe perfetta. È vicina a Pesaro e al mare (ok, non la Sardegna da cui vengo io, ma sempre meglio di niente). Il costo della vita è basso e gli affitti sembrano accessibili. Però… sembra davvero molto isolata. Trasporti scarsi, nessun aeroporto vicino, collegamenti complicati. E mi sembra un po’ carente anche dal punto di vista dei servizi sanitari (mi pare che per molte cose si debba andare a Pesaro).\n\nTorino: città molto più grande e ben servita, sia a livello sanitario che trasporti (aeroporto, treni, ecc.). Più opportunità anche per lei, sia per trovare un lavoretto durante l’università, sia post-laurea. La sede della mia azienda è proprio a Torino, quindi ogni tanto potrei lavorare in sede e conoscere i colleghi dal vivo. Tante cose da fare nei weekend (senza bisogno di essere festaioli): musei, mercatini, montagne vicine, città storiche nei dintorni. Di contro: costo della vita più alto, città più dispersiva, e il corso di farmacia potrebbe essere più impegnativo rispetto a Urbino (lei teme questo).\n\nInfo aggiuntive: ho la macchina, quindi potrei tranquillamente spostarmi anche da zone un po’ più esterne.  \nA Torino, quali quartieri consigliereste per vivere tranquilli ma senza essere troppo isolati? Con un budget di circa 500/600 euro per un bilocale è ancora possibile trovare qualcosa di decente)?\n\nInsomma: qualcuno ha vissuto in una (o entrambe) le città? Come vi siete trovati?E per chi ha studiato farmacia: quanto cambia davvero la difficoltà tra le sedi? E sui costi/zone: che ne pensate?\n\nOra devo in qualche modo \"convincere\" la mia ragazza ahahaaha. In ogni caso é una cosa temporanea, male che vada, post laurea ci si sposta a Torino o altrove (se si sceglie Urbino in quanto l'universitá é piu semplice).",
        "upvotes": 6,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1mdwtzm/torino_o_urbino_consigli_per_scelta_universitaria/"
    },
    {
        "id": "1mdgf9n",
        "author": "asilorepublic",
        "title": "Ma perché se non si conosce la strada a Torino, è così difficile guidare Soprattutto agli incroci con semafori?",
        "content": "Vedo incroci con semafori fatti alla cavolo, cartelli messi alla cavolo sulla carreggiata, proprio come dire io ve l ho messo poi se lo vedete bene se no amen... Ci dovrebbe essere una regola univoca... Agli incroci senza controviali si può svoltare, Mentre quando c'è ilccontro Viale, bisogna prendere quello.. Boh.. Ci voleva tanto? ",
        "upvotes": 31,
        "comments": 50,
        "media": null,
        "permalink": "/r/torino/comments/1mdgf9n/ma_perché_se_non_si_conosce_la_strada_a_torino_è/"
    },
    {
        "id": "1me0l55",
        "author": "Texas-Gold",
        "title": "Laboratorio per Riparazione Piumino (The North Face) a Torino?",
        "content": "Ciao a tutti e a tutte!  \n  \nDurante un'escursione ho danneggiato il mio **piumino (giubotto)** e vorrei farlo riparare. Ha un piccolo **strappo** a L sulla spalla (1.5cm x 1.5cm circa).  \n  \nNon lo uso non solo per le **escursioni** ma anche per la **città** durante l'inverno, quindi cerco qualcuno che faccia un **buon lavoro**, possibilmente **senza spendere troppo**.\n\nStarei cercando qualche **laboratorio** dove effettuano riparazioni in **zona centro**;  se qualcuno ha delle raccomandazioni o sa dove posso portarlo, fatemi sapere!\n\n**Grazie mille**! 😊",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1me0l55/laboratorio_per_riparazione_piumino_the_north/"
    },
    {
        "id": "1mdiifr",
        "author": "lospavaldo",
        "title": "dove si possono fare graffiti a torino legalmente",
        "content": "ciao cerco una zona in cui fare un graffiito in totalmente legale stavo pensando al parco dora qualcusa sa indicarmi dove farli?",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1mdiifr/dove_si_possono_fare_graffiti_a_torino_legalmente/"
    },
    {
        "id": "1mdv5t2",
        "author": "gianfresca",
        "title": "Carte Pokemon",
        "content": "Buongiorno a tutti. Dove posso rivendere carte Pokemon a Torino? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mdv5t2/carte_pokemon/"
    },
    {
        "id": "1mdhm4u",
        "author": "Lost_Spring_3298",
        "title": "Gruppo uscite: nuova vita sociale",
        "content": "Ciao a tutti, ragazzi e ragazze!  \nMi chiamo Thomas, oggi faccio 24 anni, e sono di Torino. Volevo sapere se ci fosse qualcuno che, come me, ha come obiettivo quello di migliorare la vita sociale e conoscere persone nuove. Sicuramente per \"vita sociale\" non intendo avere qualche conoscente in più da poter salutare una volta ogni due anni, ma delle persone con cui potermi confrontare, uscire, divertire, fare serate, viaggiare ed ovviamente puntare in alto.  \nSe sei in questa situazione fammi sapere, o addirittura se conosci gruppi, pagine o eventi al quale potrebbero essermi d'aiuto, ben venga!\n\nVolete sapere nel caso più su di me? Lavoro nel mondo dell'IT in una multinazionale (per fortuna c'è una sede proprio qui a Torino), mi piace pertanto l'informatica, la formula 1, le auto, la moda, i videogiochi, viaggiare, la palestra e... un mucchio di altre cose che non mi vengono in mente (la finanza forse?)  \nSto cercando di puntare in alto sia come persona che a livello professionale. Reputo di avere la \"testa sulle spalle\", nonostante mi piaccia sognare e sto ancora pian piano cercando di trovare la mia strada.\n\nFatemi sapere! Nel caso vi aspetto numerosi. Chissà, magari un gruppo di uscite, pieno di vita?",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1mdhm4u/gruppo_uscite_nuova_vita_sociale/"
    },
    {
        "id": "1md1jnt",
        "author": "HolidayScallion8502",
        "title": "lavori notturni",
        "content": "ma vi sembra normale che in via berthollet zona San salvario facciano i lavori con martello pneumatico alle 1.30 di notte? \nAnticipo che faccio cameriere di sala quindi non è una lamentela legata al mio orario lavorativo, ma proprio di disturbo del sonno.\nchissene frega se durante la giornata viene bloccata una via porcamadonna, lasciate la gente dormire e imparate a muovervi senza macchina figli di troia.",
        "upvotes": 22,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1md1jnt/lavori_notturni/"
    },
    {
        "id": "1md00xy",
        "author": "No_Bug_3501",
        "title": "Techno in Turin",
        "content": "heyoooooo\n\nI came across this post 'cause I’ll be in Turin for a month in October, and I was checking out all the events on Resident Advisor — between Azimut Club, Q35 Warehouse, and Club To Club in November (which I already knew about)!\nHonestly, I was blown away by how many big-name artists they bring in every weekend. I had no idea Turin had such a solid international club scene! :)\nEven the ticket prices seem super low to me.\nIs the city really that cheap overall? Anyone got tips on how to live there for a month without breaking the bank?\n\n",
        "upvotes": 28,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k5m8q3pupyff1.jpeg?auto=webp&amp;s=00948c1609f906ed42e9a98185e8071a2ffeecc1"
        },
        "permalink": "/r/torino/comments/1md00xy/techno_in_turin/"
    },
    {
        "id": "1md9c3d",
        "author": "_pigreco_",
        "title": "negozi streetwear torino e provincia",
        "content": "intendo negozi dove poter trovare della roba bella e delle chicche, non foot looker e aw lab. e risparmiate atipici, che oltre al fatto che sia stato fondato dal tipo dei duplici l’ho sempre trovato uno scam. ",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1md9c3d/negozi_streetwear_torino_e_provincia/"
    },
    {
        "id": "1mdbwwy",
        "author": "Pharrus",
        "title": "Pagamenti Passaporti Torino",
        "content": "Ciao a tutti, devo richiedere il passaporto e devo fare i pagamenti di 73.50 e 42.50, mi hanno detto degli amici che si possono fare anche ai tabacchini, sapete mica quali lo permettono o se ci sta qualche sito per vederlo?  \nGrazie mille a tutti.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mdbwwy/pagamenti_passaporti_torino/"
    },
    {
        "id": "1mde1pn",
        "author": "Zestyclose-Tank9125",
        "title": "Edisu piemonte accomodation",
        "content": "CIAO! Sto richiedendo il contributo alloggio EDISU Piemonte per l'a.a. 2025/26, e ho visto che la data effettiva di trasloco è dal 2 ottobre in poi. Ma per quelli di voi che hanno ottenuto l'alloggio negli anni precedenti, quando avete potuto trasferirvi esattamente? Le mie lezioni iniziano il 22 settembre e non sono sicuro di cosa facciano di solito le persone nel frattempo. La maggior parte degli studenti trova un alloggio temporaneo per quei primi giorni? Grazie!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mde1pn/edisu_piemonte_accomodation/"
    },
    {
        "id": "1mddrqt",
        "author": "Olengu-29",
        "title": "Negozio attrezzature/utensili da cucina",
        "content": "Ciao!\nMi chiedevo se a Torino ci fosse qualche negozio di attrezzature da cucina professionali, con padelle, coltelli e utensili di ottima qualità e non il solito Kasanova",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mddrqt/negozio_attrezzatureutensili_da_cucina/"
    },
    {
        "id": "1mdbw0s",
        "author": "Ilovefootball_it205",
        "title": "Amicizie",
        "content": "Ciao a tutti! Sono un ragazzo di 17 anni della zona di Torino. Mi farebbe piacere conoscere ragazzi e ragazze più o meno della mia età per uscire, chiacchierare e fare nuove amicizie 😊\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mdbw0s/amicizie/"
    },
    {
        "id": "1md79o6",
        "author": "Flukierx9",
        "title": "Dubbio su punteggio tolc per scienze biologiche",
        "content": "Ciao a tutti, ho fatto 32,25 punti al tolc b, vorrei fare richiesta per il corso di scienze biologiche di torino.\nQualcuno sa se è un punteggio con cui ci sono buone probabilità di entrare? È meglio riprovare il mese prossimo per aumentare il punteggio?\nGrazie in anticipo",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1md79o6/dubbio_su_punteggio_tolc_per_scienze_biologiche/"
    },
    {
        "id": "1md4f1x",
        "author": "irmakinon",
        "title": "Parcheggio",
        "content": "Salve, non sarò in Italia per due mesi. Potreste indicarmi un parcheggio economico dove posso lasciare la mia macchina",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1md4f1x/parcheggio/"
    },
    {
        "id": "1mcd0zs",
        "author": "MoSeMagna",
        "title": "A Torino c’è chi fa solo fiordilatte. Ma c’è più di un modo per farlo bene.",
        "content": "",
        "upvotes": 16,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nnf0x6joptff1.jpeg?auto=webp&amp;s=12a417944c1b66260268792e54649a86a2768762"
        },
        "permalink": "/r/torino/comments/1mcd0zs/a_torino_cè_chi_fa_solo_fiordilatte_ma_cè_più_di/"
    },
    {
        "id": "1mce4i5",
        "author": "glorious-ahole",
        "title": "How is Mirafiori Sud as an area",
        "content": "I am shifting soon to Mirafiori Sud, specifically Via plava and wanted to know how the area in general is..like is it safe? The apartment is good but the only problem is that it's a bit far from downtown. However I'm fine with it because its very close to the place I work",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1mce4i5/how_is_mirafiori_sud_as_an_area/"
    },
    {
        "id": "1mcglei",
        "author": "External_Cow_2392",
        "title": "Cerco ragazz*(non discrimino nessuno) per fare urbex",
        "content": "Un gruppo per fare urbex e magari registrare anche chi ci sta? \nPremessa ho 20 anni e soni maschio",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1mcglei/cerco_ragazznon_discrimino_nessuno_per_fare_urbex/"
    },
    {
        "id": "1mc8hsq",
        "author": "jk-9551",
        "title": "Informazioni mirafiori sud",
        "content": "Salve a tutti, mi sono recentemente trasferito a Torino in zona lingotto vicino al politecnico.\nHo trovato una palestra a sud del grattacielo regione Piemonte. Siccome si trova vicino al quartiere mirafiori sud volevo sapere se la zona sarebbe abbastanza sicura di sera (gli orari che frequenterei sono appunto serali)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mc8hsq/informazioni_mirafiori_sud/"
    },
    {
        "id": "1mc6w8v",
        "author": "NoAttention795",
        "title": "Orchestra a Torino?",
        "content": "Ciao a tutti! Vado a Torino a febbraio per l'Erasmus e volevo sapere se c'è qualche orchestra in città con ingresso libero. Sono una violista :)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mc6w8v/orchestra_a_torino/"
    }
]