[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 506,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jxhlvs",
        "author": "MamaMia1325",
        "title": "Black Mirror-Common People",
        "content": "This was by far, the most depressing episode/show I've ever seen. I couldn't watch the next episode because I was too depressed. It was well written and all that- amazing episode but I don't like watching things that make me feel like that. ",
        "upvotes": 56,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1jxhlvs/black_mirrorcommon_people/"
    },
    {
        "id": "1jx7q7s",
        "author": "starcityguy",
        "title": "Just finished Adolescence",
        "content": "Really was not sure what to make of the show at first.  Told my friend after two episodes it’s either the dullest thing I have seen or it’s brilliant.  I just wasn’t sure which, but I kept watching.  \n\nMidway through episode 4 it hit me that I was watching something closer to a play than a tv show.  A play with four acts.  Each act presented in one take.  And I decided it’s brilliant.  Not for everyone, but the end of episode 4 clinched it for me.  ",
        "upvotes": 118,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1jx7q7s/just_finished_adolescence/"
    },
    {
        "id": "1jxgd7w",
        "author": "Legitimate_Ad3625",
        "title": "‘They’ve Completely Got It Wrong’: Stephen Graham Speaks Out on Deliberate Misreadings of Adolescence",
        "content": "",
        "upvotes": 8,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jxgd7w/theyve_completely_got_it_wrong_stephen_graham/"
    },
    {
        "id": "1jxk4p1",
        "author": "Reasonable_Priority",
        "title": "What did you think of the ending of episode 3 in Adolescence?",
        "content": "Hey everyone,\n\nI’m really curious what others thought of that final scene.\n\nThe therapist suddenly ends the session with the boy, and to me it felt really abrupt and sad after he opened himself up to her.. One other guy I know had the same reaction – we both felt kinda bad for him.\n\nBut then I heard about three women (all therapists, though only for a few years), and they didn’t get that reaction at all. Sounded to me like they identified more with the therapist than the boy. \n\nIt got me wondering – is this difference just about being a therapist or not? Or could it also be about gender, or who you identify with emotionally?\n\nCurious to hear how others experienced that scene. Did it feel unfair or necessary?\n\n\n",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jxk4p1/what_did_you_think_of_the_ending_of_episode_3_in/"
    },
    {
        "id": "1jxcj0i",
        "author": "Due-Beginning-1443",
        "title": "Is that Pop a baloon some kind of joke?",
        "content": "Who are these men, I hoped it will be some kind of cool dating show but these men are horrible. Outfits, attitude. Women are constantly joking around and I feel like no one is really serious - it’s not funny, it’s not entertaining. ",
        "upvotes": 11,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jxcj0i/is_that_pop_a_baloon_some_kind_of_joke/"
    },
    {
        "id": "1jxe066",
        "author": "HotAd4795",
        "title": "Million Dollar Secret",
        "content": "I just finished watching Million Dollar Secret, it was honestly one of the best reality games shows I’ve watched in a while, however, in the finale I thought Corey made a huge mistake when swapping the boxes. Let me explain…\n\nHe was right about convincing Cara that he swapped with Sam but if he wanted to follow through with that plan he should have swapped Cara and Sam’s boxes not his and Cara’s. He would then need Cara to swap Sam and his box  (thinking that they were both empty and she still has the million) for him to win. There is no situation where he would have won after swapping his box with either of them. If he swapped with Sam, Cara would have swapped them back leaving Sam the winner and if he swapped with Cara she would have taken it back. Therefore the odds were very heavily stacked against him and he messed up massively.",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jxe066/million_dollar_secret/"
    },
    {
        "id": "1jwnkaz",
        "author": "dailystar_news",
        "title": "Adolescence series two in talks as Brad Pitt gets involved",
        "content": "",
        "upvotes": 383,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1jwnkaz/adolescence_series_two_in_talks_as_brad_pitt_gets/"
    },
    {
        "id": "1jxcmu4",
        "author": "prisongovernor",
        "title": "Olivia Colman to star in Netflix’s Pride and Prejudice written by Dolly Alderton",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jxcmu4/olivia_colman_to_star_in_netflixs_pride_and/"
    },
    {
        "id": "1jxfu0n",
        "author": "Jumpy-Beginning3686",
        "title": "Cobra kai",
        "content": "After watching the full cobra kai final season I need to change my negative review ; the last 3 episodes were on point ; closed the series perfectly. \n\nIn all it was a good tv series I do think they stretched it out a bit too much and at times ie the barcelona tournament part of s6 was dreadful. \n\nThe nostalgia,  humour and character were solid ; apart from Terry Silver his character is ridiculous and he had too much of a part . Would have been better just bringing him in for a few episodes ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jxfu0n/cobra_kai/"
    },
    {
        "id": "1jxj6q9",
        "author": "Ok-Data-7672",
        "title": "What are some German films on Netflix you would recommend I watch?",
        "content": "Hi everyone! I'm looking for German films—romantic, thriller, or adventure—that were released in the past two decades and truly left an impression on you. Any favorites you’d recommend? I’d really appreciate your suggestions. Thanks in advance!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jxj6q9/what_are_some_german_films_on_netflix_you_would/"
    },
    {
        "id": "1jwua7q",
        "author": "shimikobop",
        "title": "BAD INFLUENCE documentary",
        "content": "\nI just finished the documentary about Piper Rockelle and the ex SQUAD. I feel bad for Piper. She’s such a beautiful, talented little girl. She has so much potential but looking through her socials, it seems like she’s really manipulated by her mother and she believes that everyone who left her is the bad guy. She’s also been really acting inappropriately whilst being a minor. She had so many boyfriends and she doesn’t even delete the contents she made with them (ex bfs)\n\nI think her mom taking advantage of her would similarly lead to her like Sky Bri whose mom is very much supportive on her “career”. Piper also hangs out with OF creators like Sophie Rain which looks like foreshadowing of what she will choose to become when she turns legal age.\n\nLooking forward to her response to all the allegations when she turns 18. ",
        "upvotes": 53,
        "comments": 79,
        "media": null,
        "permalink": "/r/netflix/comments/1jwua7q/bad_influence_documentary/"
    },
    {
        "id": "1jxhw9w",
        "author": "Top-Three-USA",
        "title": "Finn Wolfhard Opens Up About the Emotional Complexity of ‘Stranger Things’ Ending: ‘I’m Happy, but I’m Also Very Confused’",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jxhw9w/finn_wolfhard_opens_up_about_the_emotional/"
    },
    {
        "id": "1jxg6ah",
        "author": "IrishStarUS",
        "title": "Netflix announces thrilling new drama from Dawson’s Creek star and fans 'can't wait'",
        "content": "",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jxg6ah/netflix_announces_thrilling_new_drama_from/"
    },
    {
        "id": "1jxau76",
        "author": "RedHeadRedeemed",
        "title": "My husband cried at Love on the Spectrum Season 3",
        "content": "So I have been with my husband almost a decade and I have only seen the man cry *once*. But she started watching Love on the Spectrum Season 3 and (spoilers) when Abbey sang her song to David my husband straight started CRYING y'all. Not sobs, but tears in his eyes, having to wipe his eyes and sniffling. He said it was the sweetest shit he has ever heard. This man didn't even cry at the birth of his own KID. The entire season we enjoyed watching; cheering for the couples we enjoyed. But he said the show is \"the most wholesome show he has ever seen\". Cheers to the people directing and on this show for making a man cry at the emotions of this show ❤️",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jxau76/my_husband_cried_at_love_on_the_spectrum_season_3/"
    },
    {
        "id": "1jx1nc5",
        "author": "ImaginativeHobbyist",
        "title": "\"Black Mirror\" Season 7 Posters by The Imaginative Hobbyist (Me)",
        "content": "",
        "upvotes": 14,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jx1nc5/black_mirror_season_7_posters_by_the_imaginative/"
    },
    {
        "id": "1jxdvh0",
        "author": "yumyumchacha",
        "title": "How to Sell Drugs Online: Season 4 | Review, 5 things I liked &amp; disliked",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jxdvh0/how_to_sell_drugs_online_season_4_review_5_things/"
    },
    {
        "id": "1jxde3f",
        "author": "Sound_User",
        "title": "Downloading for offline.",
        "content": "Netflix says I can download because I have stuff downloaded on another device. \n\nDo they want me to fix my old phone to uninstall netflix? \n\nMy post is too short. So I would like to also ask is netflix just trying to get me to cancel? They already made it hard for me to watch with my mobile router.... ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jxde3f/downloading_for_offline/"
    },
    {
        "id": "1jx9q7u",
        "author": "N3UR0TIMX",
        "title": "Netflix Payment update issue",
        "content": "I paid money for my Netflix, My next billing date is also May 5 of 2025 and yet when I open any series it shows off this (The next image), Is there somthing I'm supposed to know? Or is this a glitch where i can fix",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jx9q7u/netflix_payment_update_issue/"
    },
    {
        "id": "1jx2ykt",
        "author": "BeeOk4748",
        "title": "How to disable play next on Netflix Tv?",
        "content": "Recently, it’s been bothering me a lot that autoplay of netflix just ends the episode immediately. Back then it didn’t bother me that much since I could just play back to the episode when Netflix was playing an episode in 20 seconds, but now it just outright ends the episode immediately, and sometimes I just wanted to watch the last part of that episode either for an outro I really like or a sneak peak or extra scene at the very end of that episode. I tried searching on how to turn it off, but nothing that I found was for a tv that had a different format. Can someone help me me please?",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jx2ykt/how_to_disable_play_next_on_netflix_tv/"
    },
    {
        "id": "1jwxpqu",
        "author": "indiewire",
        "title": "The Best Movies on Netflix in April 2025",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jwxpqu/the_best_movies_on_netflix_in_april_2025/"
    },
    {
        "id": "1jx72pp",
        "author": "One_Spaceman",
        "title": "Monster Season 4 Herman Webster Mudgett?",
        "content": "Just came across this guy, and would make a crazy show if done llike Dahmer/haunting of hill house. What do you think about Herman Webster *Mudgett*'s \"Castle\" where he lured tourists to their deaths using, a huge hundred-room mansion with trap doors, lime pits, fake walls, acid vats, and secret entrances?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jx72pp/monster_season_4_herman_webster_mudgett/"
    },
    {
        "id": "1jw6j2p",
        "author": "Longjumping_Land_977",
        "title": "All the creepy Google searches found on Long Island killer suspect Rex Heuermann’s computer",
        "content": "",
        "upvotes": 266,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1jw6j2p/all_the_creepy_google_searches_found_on_long/"
    },
    {
        "id": "1jwk4u9",
        "author": "Free-Combination5627",
        "title": "*Cheating Exposed* Million Dollar Secret",
        "content": "Cara and Sam made a deal off camera to split the money from the beginning. If you rewatch the show with that in mind everything makes sense.\n\nThey tell each other when they are the millionaire off camera. They have to fool the producers and the audience too “the ultimate lie” to pull it off, so they sell it as best they can.\n\nWhen Sam is the millionaire, despite obvious clues pointing to her, Cara keeps coming up with reasons to go for someone else.\n\nSam gets away with her Justin Timberlake agenda by using it with Cara, how does she not realize when she hears her do it a second time at the table? Cause she’s on her side, she only has to worry about Jaymie catching on.\n\nSam’s go to “fake lying face” when she’s the millionaire was a wide open mouth, she uses it when the person they voted for has no money in the box at the elimination dinner. \n\nWhen Cara is the millionaire she tells sam off camera. They masterfully break up the guys alliance and start voting them out.\n\nSam tells Cara off camera the clue about the millionaire was 2 sisters. Later, on camera she asks and Cara knows to lie.\n\nCara has the guts to sabotage her laser challenge with Sydney because she has the assurance that sam will not vote for her no matter what and that sam can probably sway corey. Only reason she takes that “risk”. If corey moves to vote Cara out, sam would just deadlock it. Both Cara and sam view Sydney as their biggest threat and corey easy manipulated.\n\nWhen Sydney opens her box, fake big open mouth from sam.\n\nAt the end when Cara wins, Sam is kind of weirdly excited and not that upset. After seeing Cara cry due to winning and corey cry due to losing, Sam figures she needs to cry to to sell it and no tears actually come out cause they are fake crocodile tears.\n\nWatch the show again there are more tells not listed here but it’s plain as day. Cheaters Cara and Sam need to be exposed! \n\n\n",
        "upvotes": 30,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1jwk4u9/cheating_exposed_million_dollar_secret/"
    },
    {
        "id": "1jwon0t",
        "author": "Traditional_Reach_53",
        "title": "Which is the best thriller to watch on Netflix now?",
        "content": "Thriller/Murder Mystery/ International espionage/ Homicide Investigation/ Any investigation \nAbove are the genre I am looking at. \nPl shoot your recommendations mate!",
        "upvotes": 9,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1jwon0t/which_is_the_best_thriller_to_watch_on_netflix_now/"
    },
    {
        "id": "1jx4nbw",
        "author": "Skreidle",
        "title": "Account recovered then cancelled, “nothing they can do”",
        "content": "About two weeks ago, my wife’s Netflix account was hacked, and they changed the email to something else. I called their support line, verified the old account info, old payment info, etc., and they were able to restore the account to us, assign it to my email address, I set a secure password and phone number, set up new payment, good to go! Success!\n\n… until a week later, when I got notification from my bank of a refund of my most recent Netflix payment! Weird. Logged in, account still there, but subscription cancelled — and it vaguely errors out on the payment screen when I try to subscribe again. Tried a different payment method, and a different browser, no dice.\n\nCalled support again, they put me on hold for about ten minutes, then came back to say that the system had “detected unusual activity, automatically cancelled my plan, refunded my last payment, and removed all payment methods.” Oh, and it can’t be reactivated, sorry. My only option, they said, is signing up for a new account with a different email. So long, 9 years of watch history and ~80 shows in my queue! 😠\n\nAnyone else had this happen? Is there no appeal?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jx4nbw/account_recovered_then_cancelled_nothing_they_can/"
    },
    {
        "id": "1jxgp51",
        "author": "TheMirrorUS",
        "title": "Netflix's Pop the Balloon leaves viewers 'switching off' as they issue same complaint minutes in",
        "content": "",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jxgp51/netflixs_pop_the_balloon_leaves_viewers_switching/"
    },
    {
        "id": "1jx2qbg",
        "author": "DramaticOffer5114",
        "title": "“Your device isn’t part of the Netflix Household for this account” Issue/Confusion",
        "content": "this issue started to happen recently with me on my phone and laptop and i tried that hack to turn the airplane on and open the app then turn it off but it didn't work. any advice? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jx2qbg/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1jwn4w7",
        "author": "Maui_k",
        "title": "Million Dollar Secret, Winner Opinion",
        "content": "I seriously enjoyed this show, BUT I felt like the timing of when Cara received the money was odd. We never really saw her game play, at all, but we saw Corey’s the entire season yet he never had a chance to be the millionaire. I feel like they built up Sam’s story, and her great gameplay as the Millionaire, just to have filler time on the show. I had a large feeling that the last person to receive the money, would win the show, and as soon as we got to hear Cara’s I hate to call it “sob story”, but we all know tv plays those up lol, I knew she had it in the bag. Her reasoning for needing the money, and them mentioning over and over again how she was a burger cook and didn’t have as glamorous of a job as a lot of the rest, would have connected best with the audience at home. I wholeheartedly believe that production made sure to give her the money last, out of the ones that were left, when she received the money. And in doing so we got to finally see a tiny bit of her gameplay, and a lot of her story at the very end, almost as a way to justify her win that would be confusing to a lot of viewers.",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jwn4w7/million_dollar_secret_winner_opinion/"
    },
    {
        "id": "1jwv6al",
        "author": "S4v1r1enCh0r4k",
        "title": "Mackenyu Explains How He Stayed True to Zoro in One Piece Live-Action Series",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jwv6al/mackenyu_explains_how_he_stayed_true_to_zoro_in/"
    },
    {
        "id": "1jwiod1",
        "author": "a-dollar-in-my-jeans",
        "title": "Here’s What I’ve Watched So Far. What Should I Watch Next?",
        "content": "I just wrapped up Queen of the South and now I’m in that random phase where I don’t know what else to watch. But this time, I’m really stumped. Here are the shows that I can remember off the top of my head that I’ve watched (and finished) so far in alphabetical order:\n\n1. Bojack Horseman\n2. Brooklyn 99\n3. Designated Survivor\n4. Disjointed\n5. Godless\n6. Good Girls\n7. Grey’s Anatomy\n8. Maid\n9. Manifest\n10. Midnight Gospel\n11. Money Heist\n12. New Amsterdam\n13. Orange is the New Black\n14. Paradise PD\n15. Queen of the South\n16. Rookie Blue\n17. Space Force\n18. Superstore\n19. The Blacklist\n20. The Night Agent\n21. The Resident\n22. The Residence\n23. Wanted\n24. Wentworth\n25. Zero Day\n\nI’ve watched a few movies here and there but I’m more of a tv show guy because with shows I don’t have to worry about watching something else after two hours or so - tv shows are like an extra long movie.\n\nIf anyone has watched any of these shows and is a fan of other shows, please let me know!! I’m absolutely dying for something new to watch!!! I’m open to suggestions from both American and Canadian Netflix!",
        "upvotes": 16,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1jwiod1/heres_what_ive_watched_so_far_what_should_i_watch/"
    }
]