[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 490,
        "comments": 261,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iq9bom",
        "author": "Practical-Creme-6025",
        "title": "Netflix pricing in Europe (as of February 2025)",
        "content": "*Premium plan only",
        "upvotes": 63,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1iq9bom/netflix_pricing_in_europe_as_of_february_2025/"
    },
    {
        "id": "1iq8c02",
        "author": "fermulator",
        "title": "Canada Pricing Increases (again) Feb 2025",
        "content": "Netflix year over a year continues to increase their prices and they are no longer competitive. (in my opinion.)\n\nBecause of this ongoing increase last year we downgraded to the standard with ads plan, which has been fine . The cost was $5.99.\n\nHere are the changes \n- Standard with ads $5.99 to $7.99\n- standard $16.49 to $18.99\n- premium $20.99 to $23.99\n\nAbsolutely unacceptable . (to me)\n\nWe have cancelled our membership .  I encourage others to do the same in solidarity.",
        "upvotes": 16,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1iq8c02/canada_pricing_increases_again_feb_2025/"
    },
    {
        "id": "1iqnrex",
        "author": "AnusChakra",
        "title": "Netflix editing in distortions in old footage",
        "content": "After watching a bunch of Netflix real crime I noticed that literally EVERY old piece of footage was distorted one way or another. It can be discoloring, lines of white noise or distortion of parts of the screen.\n\nI know that even footage from the 90s can look ancient, but at some point I realized that Netflix does this to \"help the viewer\". When they again show footage from some time ago they add the distortion so that viewer subconsciously can place the footage in time (\"ah, right, we're having a flashback\").\n\nDid anyone else notice this? And is it indeed an editing trick to help the viewer? Or is really all their archived footage damaged?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iqnrex/netflix_editing_in_distortions_in_old_footage/"
    },
    {
        "id": "1iqdhoq",
        "author": "anushkaaaaaaaaaaa",
        "title": "Cassandra",
        "content": "This show was so good, oh my god! Yes, there were plenty of obvious dumb decisions, but overall, it was a really great watch. I ended up binging it in one night. It actually made me sad—she just wanted a family, and it breaks my heart. A victim turned villain.",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iqdhoq/cassandra/"
    },
    {
        "id": "1iprjma",
        "author": "TheMirrorUS",
        "title": "Netflix says Emilia Perez controversy is 'bummer' for Selena Gomez and Zoe Saldana",
        "content": "",
        "upvotes": 235,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1iprjma/netflix_says_emilia_perez_controversy_is_bummer/"
    },
    {
        "id": "1iq60c1",
        "author": "AnthologicalAnt",
        "title": "Watch list question...",
        "content": "Am I the only person that fills their watch list of shows and films that I would love to watch. And as soon as I want to watch something, everything looks like a load of crap I wouldn't ever want to watch? ",
        "upvotes": 16,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1iq60c1/watch_list_question/"
    },
    {
        "id": "1iq809f",
        "author": "Upstatealphamama",
        "title": "Dead Boy Detectives",
        "content": "Did anyone watch Dead Boy Detectives? Did you like it? It's in the same universe as Sandman. I really enjoyed both shows and was really looking forward to season 2 of Dead Boy Detectives but found out it was canceled due to low views. I feel like Netflix cancels so many shows super quickly. ",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iq809f/dead_boy_detectives/"
    },
    {
        "id": "1iqi886",
        "author": "ProfessionalMusic414",
        "title": "Trailer for #aSTRANGERdarkly #earlyrelease #trailer",
        "content": "I tagged my project on ig &lt;aSTRANGERdarkly&gt;\n\n#ASTRANGERDARKLY\n#PARTTWO of #PKD’s\n#aSCANNERDARKLY",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iqi886/trailer_for_astrangerdarkly_earlyrelease_trailer/"
    },
    {
        "id": "1iqi5yl",
        "author": "Key_Training_2484",
        "title": "Broken Netflix?",
        "content": "So oddly enough years ago I subscribed to Netflix over my Playstation and have yet to actually get charged on my payment method.  Yeah I know it's weird but I'm not complaining free Netflix right? Well I got a message today saying they're increasing rates.  My question is will my account start getting charged or do you think that when it updates will I be lucky enough to avoid there payments lol. Side note when I subscribed to PS+ I also never have been charged for a single payment it's almost as if my Playstation account just has unlimited PS+ as not one payment came out other than the initial first payment and this was a long long time ago. To this day I don't have to pay for it am I just lucky or has anyone else had this happen to them?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iqi5yl/broken_netflix/"
    },
    {
        "id": "1iq662j",
        "author": "SlothSnoozes",
        "title": "Feel like there is nothing for me to watch, help me out!",
        "content": "A list of some of the things I’ve watched. 13 reasons why, breaking bad, TWD, better call Saul, stranger things, Bojack Horseman, avatar, on my block, school spirits, squid games, dark, the end of the fucking world, umbrella academy, everything sucks, beef, cyberpunk, insatiable, i am not okay with this. \n\nI am probably missing a couple but most of these shows had me somewhat hooked and I’m looking to find that in another show. It feels like maybe I’ve watched all there is for me on Netflix so if anyone could help me out that would be great! ",
        "upvotes": 5,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1iq662j/feel_like_there_is_nothing_for_me_to_watch_help/"
    },
    {
        "id": "1iqbu35",
        "author": "tabloidjournalism",
        "title": "When watching in Dolby Vision, are HD-only shows supposed to look slightly more washed out?",
        "content": "If I'm watching a show that supports 4K and Dolby Vision, it looks great. If I'm watching an older show like Lost which is only in HD, it's nowhere near as colourful and I have to manually turn up the saturation. Is this supposed to happen or do I need to reconfigure something? I'm watching via Xbox Series X. Thank you",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iqbu35/when_watching_in_dolby_vision_are_hdonly_shows/"
    },
    {
        "id": "1iqg00g",
        "author": "Victor-Romeo",
        "title": "Scene change flicker",
        "content": "Why are there so many of these flickering cuts between scenes in Netflix?  Clip from The Courier for example.\n\nI've seen these in Android and Apple TV netflix apps.  \n\nDoes Netflix re-edit films before they are made available to stream?  Is this a streaming artefact or something in the source film?",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ujvkepg1deje1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1iqg00g/scene_change_flicker/"
    },
    {
        "id": "1iq9tfw",
        "author": "Ok_Group_1322",
        "title": "Games with friends?",
        "content": "Every Sunday we have friends come over and I see our subscription gives us games. Is there a recommended game that you would say would work for a crowd of all ages??",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iq9tfw/games_with_friends/"
    },
    {
        "id": "1iqee1b",
        "author": "KiwiBubbly9246",
        "title": "Cobra kai season 6 part 3 was good but",
        "content": "There were definitely some problems. First of all their were way to many call backs like I get it the shows about the end and they were about to fight in the biggest karate tournament in the world but did they really have to add a callback to literally every scene. Next how did the sekai tekai get brought back that early seriously only a month I felt like they should have made it a bit longer. Also why would the Sekai Tekai even be the valley I get that it's better narratively but realistically it made no sense. When kreese and silver died it felt so abrupt and also how did kreese even kill that guy that silver hired even daniel could barely beat him so how in the world did he kill him without a weapon. They also didn't even address at all their deaths. Axel got so heavily debuffed it was crazy. The guy went from getting barely hit from being beaten by miguel. Also this is a small detail but why was the Russians even there you could see them right before the fight was about to start. Also Wolf I like his character but honestly it made no sense why he was abusing Axel so much without even doing anything to Zara. I feel like he would be even more frustrated at her because she's not focused. Another huge misoppurtunity was I kinda of wished that Johnny would go back to him and just console him a bit after losing a final. It would be so sweet and awesome. Feel free to critique my points but I'm just curious what you guys think.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iqee1b/cobra_kai_season_6_part_3_was_good_but/"
    },
    {
        "id": "1ipw8zj",
        "author": "Robemilak",
        "title": "‘XO, KITTY’ has been renewed for Season 3 at Netflix.",
        "content": "The announcement was made on Netflix’s official X account on Friday. Season 2 of the YA series premiered on Netflix on Jan. 16.\n\n“I’m so excited to head back to Seoul for another season with our incredible cast and crew. If you thought junior year at KISS brought the drama…just wait,” said series showrunner, executive producer and writer Jessica O’Toole. “I know we left fans on a cliffhanger at the end of Season 2 but I can promise season 3 will be worth the wait, including our first summer episode — not to mention plenty of romance, friendship, adventure…and kissing. Lots of kissing.”",
        "upvotes": 16,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ipw8zj/xo_kitty_has_been_renewed_for_season_3_at_netflix/"
    },
    {
        "id": "1iq0m37",
        "author": "EthanWilliams_TG",
        "title": "Netflix Reveals Clip from 'Demon City' Manga Live-Action Adaptation, Debuts Late February",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iq0m37/netflix_reveals_clip_from_demon_city_manga/"
    },
    {
        "id": "1ipdaia",
        "author": "Somethingman_121224",
        "title": "Netflix's Bela Bajaria Believes Amazon Overpaid 'Beast Games' To Snatch It From Netflix",
        "content": "",
        "upvotes": 188,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1ipdaia/netflixs_bela_bajaria_believes_amazon_overpaid/"
    },
    {
        "id": "1ipxuje",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix has shared a new clip from Demon City, a live-action adaptation of Masamichi Kawabe’s popular manga",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ipxuje/netflix_has_shared_a_new_clip_from_demon_city_a/"
    },
    {
        "id": "1ipwatd",
        "author": "Robemilak",
        "title": "Guillermo del Toro’s ‘FRANKENSTEIN’ will be getting a “bespoke qualifying run” in theaters from Netflix.",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ipwatd/guillermo_del_toros_frankenstein_will_be_getting/"
    },
    {
        "id": "1ip9i52",
        "author": "brownieekb",
        "title": "Ralph Macchio on the new Karate Kid movie as Cobra Kai returns on Netflix",
        "content": "",
        "upvotes": 201,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1ip9i52/ralph_macchio_on_the_new_karate_kid_movie_as/"
    },
    {
        "id": "1iqakc8",
        "author": "humdrumalum",
        "title": "Cancelled, but still charged",
        "content": "I tried calling and chat options but both are currently unavailable. Has anyone else experienced this? What do I need to do moving forward? When I open my app, it gives me the option to restart my subscription, so I know that the cancellation went through. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iqakc8/cancelled_but_still_charged/"
    },
    {
        "id": "1ipjm2l",
        "author": "MikeChatman",
        "title": "Big mistake",
        "content": "I actually like this feature. There’s no point in making it less likely I’d open my Netflix app. The only reason I renewed my subscription because I was told they finally integrated into Apple TV. Like I don’t mind that I’m basically paying for cable again with all the subscriptions I have. But taking away the convenience of the modern day tech is stupid. I like that Apple tells me about shows that are coming out from all my apps and and I just click continue watching. I don’t want to load up an app and scroll through all the ways companies organize their apps to show me what they want, not what I want. Ugh honestly I’m sure they have their financially sound reasons and I’m just venting. Either way, all these battles companies are having is preventing us from having an enjoyable experience and I guess im about to cancel Netflix again. I watch everything from Apple TV. I always end up forgetting about Netflix then I’m paying for an app I haven’t used in a year. 🤷🏾‍♂️",
        "upvotes": 39,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ipjm2l/big_mistake/"
    },
    {
        "id": "1iqdocb",
        "author": "Dizzy-Detail-8982",
        "title": "Hacked?",
        "content": "So i log into Disney yesterday and all my profiles are wiped and replaced with Joe and Joe B so I go about making new passwords and everything on my emails and such get into Netflix today and same thing all is wiped replaced with Joe has anyone else had this issue this year or lately still not sure how it was even done when I have google authentication which rotates a code every minute and I use norton 360 password manager and you'd have to have my biometrics to even log into that same to get into and see or copy any password I have for anything In there so how can someone get past my 2 factor authentication on top of biometrics ?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iqdocb/hacked/"
    },
    {
        "id": "1iqanin",
        "author": "bitcoin_10",
        "title": "Bitrate/resolution Bad on Windows client",
        "content": "I like to watch Movies on my new Samsung Notebook with its brillinant Display.  Look at the pictures, how can I improve the bitrate? Movies just look bad.\nIs it a Windows issue?\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iqanin/bitrateresolution_bad_on_windows_client/"
    },
    {
        "id": "1ipius4",
        "author": "Knightbear49",
        "title": "Netflix says its brief Apple TV app integration was a mistake. The short-lived support for Apple’s watchlist has been rolled back, according to a spokesperson",
        "content": "",
        "upvotes": 18,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1ipius4/netflix_says_its_brief_apple_tv_app_integration/"
    },
    {
        "id": "1ipvrb3",
        "author": "Just_another_gamer_",
        "title": "Anyone know why Netflix keeps playing the last episode of a series first?",
        "content": "This is so annoying, every time I go to watch a new show it plays the most recent episode first. Just went to watch Scavengers Reign and was a third of the way through what I thought was a flash forward until I remembered to check. So that's spoiled now.\n\nI'm using the Netflix app on my Roku TV, on my own profile nobody else uses, and none of the episodes show as \"already watched\".",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ipvrb3/anyone_know_why_netflix_keeps_playing_the_last/"
    },
    {
        "id": "1ipy0zi",
        "author": "megumiwife",
        "title": "profiles keep disappearing",
        "content": "last nigt, the profiles in our shared netflix account disappeared and only has the profile of the person paying for our netflix and a guest one. we added profiles last night, not minding it, but this morning it disappeared again while i was watching a show.\n\nit says that netflix has redirected me too many times. what does that mean? does anyone know the issue here?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ipy0zi/profiles_keep_disappearing/"
    },
    {
        "id": "1ipdeik",
        "author": "DaviddStewartt",
        "title": "What film could you rewatch forever",
        "content": "Was looking for some films to watch, and wanted to get some ideas from everyone.\n\nWhat films could you rewatch over and over again without fail, i wanna join in\n\nIm planning to watch a film with anyone who is down with the new Public Cinema Extension. Just drop down some suggestions below:\n\nhttps://chromewebstore.google.com/detail/public-cinema/mfedjoeaeahicdibponegkifgdmbagai?hl=en",
        "upvotes": 27,
        "comments": 151,
        "media": null,
        "permalink": "/r/netflix/comments/1ipdeik/what_film_could_you_rewatch_forever/"
    },
    {
        "id": "1iq5am2",
        "author": "ellie1398",
        "title": "Is there a list of shows that are NOT cancelled?",
        "content": "Has anyone made a comprehensive list of all shows on Netflix that currently have 1 or 2 seasons out and are **NOT** cancelled? \n\nI want to watch something new but I don't want to get invested in a show if it's never going to be finished. Knowing how the geniuses at Netflix keep cancelling 99.99% of anything new, I avoid even opening the app/website because I know I'll see a glimpse of something amazing that will inevitably leave me disappointed, miserable, and angry, once I find out it was cancelled. I don't want to waste my time and feelings so I'm looking for a list of the 0.01% of shows that aren't cancelled. \n\nI *could* just google every single show Netflix recommends before watching it, but it would be way more convenient to have a list of active series to choose from, where none of the choices would make you question if life is worth living when even escapism lets you down. The one thing that's supposed to distract you from how shit life is. But anyway, I digress. Feel free to share any info you guys have or any recommendations.  ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iq5am2/is_there_a_list_of_shows_that_are_not_cancelled/"
    },
    {
        "id": "1ip5wqs",
        "author": "Robemilak",
        "title": "A Live-Action ‘Dungeons &amp; Dragons’ Series ‘The Forgotten Realms’ Is in the Works at Netflix",
        "content": "",
        "upvotes": 49,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ip5wqs/a_liveaction_dungeons_dragons_series_the/"
    }
]