[
    {
        "id": "1nekeg4",
        "author": "lionsgate",
        "title": "Hi /r/movies, I'm Garrett Wareing, actor in Lionsgate's THE LONG WALK from legendary author Stephen King and director Francis Lawrence (CONSTANTINE, THE HUNGER GAMES). It's out in theaters today. Ask me anything!",
        "content": "Hi r/movies, I'm Garrett Wareing, actor in Lionsgate's THE LONG WALK from legendary author Stephen King and director Francis Lawrence (CONSTANTINE, THE HUNGER GAMES). It's out in theaters today and also stars Cooper Hoffman, David Jonsson, Charlie Plummer, Ben Wang, Mark Hamill, and Judy Greer.  \n\nYou might also know me from things like Manifest, God Is A Bullet, Ransom Canyon, and Pretty Little Liars: The Perfectionists. Here to answer your questions!\n\nTrailer: \n\n[https://www.youtube.com/watch?v=vAtUHeMQ1F8](https://www.youtube.com/watch?v=vAtUHeMQ1F8)\n\nSynopsis:\n\nFrom the highly anticipated adaptation of master storyteller Stephen King’s first-written novel, and Francis Lawrence, the visionary director of The Hunger Games franchise films (Catching Fire, Mockingjay – Pts. 1 &amp; 2 , and The Ballad of Songbirds &amp; Snakes), comes THE LONG WALK, an intense, chilling, and emotional thriller that challenges audiences to confront a haunting question: how far could you go?\n\nOut in theaters today.\n\nAsk me anything! Back tomorrow Friday 9/12 at 12:00 PM ET to answer your questions.",
        "upvotes": 185,
        "comments": 117,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wyz6nv6bmlof1.png?auto=webp&amp;s=f693f5d1d583890b80b7dbbb830d97d2f923dbb1"
        },
        "permalink": "/r/movies/comments/1nekeg4/hi_rmovies_im_garrett_wareing_actor_in_lionsgates/"
    },
    {
        "id": "1nf38wo",
        "author": "TheThreesomeAMA",
        "title": "Hey /r/movies! I'm Chad Hartigan, director of THE THREESOME, a comedy-drama that's out now in theaters and stars Zoey Deutch, Jonah Hauer-King, and Ruby Cruz. I've also directed LITTLE FISH (starring Olivia Cooke &amp; Jack O'Connell) and MORRIS FROM AMERICA. Ask me anything!",
        "content": "Hey r/movies! I'm Chad Hartigan, director of THE THREESOME, a comedy-drama that's out now in theaters and stars Zoey Deutch, Jonah Hauer-King, and Ruby Cruz. I've also directed LITTLE FISH (starring Olivia Cooke &amp; Jack O'Connell) and MORRIS FROM AMERICA. Ask me anything!\n\nMy credits:\n\n[https://www.imdb.com/name/nm1029961/](https://www.imdb.com/name/nm1029961/)\n\nMore information about the film:\n\n**Official Trailer:**\n\n[https://youtu.be/Mafhm2\\_5Pzc](https://youtu.be/Mafhm2_5Pzc)\n\n* Directed by Chad Hartigan - Written by Ethan Ogilby\n* Starring Zoey Deutch, Jonah Hauer-King, Ruby Cruz, Jaboukie Young-White, Josh Segarra, Robert Longstreet, Arden Myrin, Kristin Slaysman, Allan McLeod, and Julia Sweeney\n\n&gt;An impulsive night leads to a wild threesome between Olivia (Zoey Deutch), Connor (Jonah Hauer-King), and Jenny (Ruby Cruz), leaving both women facing unexpected consequences, thrusting all three into the raw and beautifully messy chaos of adulthood.\n\nOut now in theaters! Ask me anything I'll be back at 3 PM ET today (Friday 9/12) to answer your questions.\n\n",
        "upvotes": 53,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cufizw27jqof1.png?auto=webp&amp;s=bad2315869f069f5f47524beafd7a70585644ebc"
        },
        "permalink": "/r/movies/comments/1nf38wo/hey_rmovies_im_chad_hartigan_director_of_the/"
    },
    {
        "id": "1ng6s29",
        "author": "MarvelsGrantMan136",
        "title": "Ice Cube Says He Shot His ‘War of the Worlds’ Scenes in 15 Days Without the Director or Other Actors",
        "content": "",
        "upvotes": 22612,
        "comments": 1302,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rVrRAw0k3j2rptO-AUoaXwXDT7xYMjVIFfsY2KPJExs.jpeg?auto=webp&amp;s=f5737ece3ace9be4e37848b7774830344a010487"
        },
        "permalink": "/r/movies/comments/1ng6s29/ice_cube_says_he_shot_his_war_of_the_worlds/"
    },
    {
        "id": "1ngpmri",
        "author": "Laurie_Barrynox",
        "title": "\"Last Action Hero\" nearly ended Arnold Schwarzenegger's career and it ended up being a cult favorite. Why did the public didn't get it?",
        "content": "It probably was marketed as a generic action film and it was anything but. The film was more of a satire of the genre and Schwarzenegger, who's got a inate talent for comedy, gleefully plays with his image, mocking the films he's known for and even himself. \n\nAustin O'Brien is a decent kid lead, a solid focal point for the public, and a strong supporting cast. Switching from humor into big action scenes, Last Action Hero was a good time. \n\nUnfortunately, the public didn't get it. They expected a \"straight# action film and it wasn't what they got. You can sense the passion and fervor for film as an art throughout.",
        "upvotes": 556,
        "comments": 442,
        "media": null,
        "permalink": "/r/movies/comments/1ngpmri/last_action_hero_nearly_ended_arnold/"
    },
    {
        "id": "1ngsskh",
        "author": "bilhugs",
        "title": "Movies with sequels that start immediately after the previous one ends.",
        "content": "I was trying to think of movies where the story starts immediately after when the previous one leaves off. This came up when my son and I were about to watch the Back to the Future sequels. I think Quantum of Solace is like that too. Can you think of any others?\n\n\n(These are some more characters so I can abide by the goofy rules.)\n\n\n\n\n\n\n\n\n",
        "upvotes": 224,
        "comments": 450,
        "media": null,
        "permalink": "/r/movies/comments/1ngsskh/movies_with_sequels_that_start_immediately_after/"
    },
    {
        "id": "1ngt5e5",
        "author": "adrrriz",
        "title": "Saddest movies you’ve ever seen.",
        "content": "My friend has never cried at a movie. I have pitched the following movies for her to watch that made me blubber like an idiot. Please share your recommendations in the comments. Do your absolute worst. I want her to regret this. Movies I pitched;\n\nStepmom, 98’\nSimon Birch, 98’\nGloria, 99’\nBicentennial Man, 99’\nA Walk to Remember, 02’\n\n\n",
        "upvotes": 126,
        "comments": 803,
        "media": null,
        "permalink": "/r/movies/comments/1ngt5e5/saddest_movies_youve_ever_seen/"
    },
    {
        "id": "1ngfqqt",
        "author": "LadyDirtyMartini",
        "title": "What film opened your eyes to what good acting really is?",
        "content": "For a very long time, I never understood \"good\" acting or what made a good actor. My parents love Tom Hanks, and I remember them obsessing over his performance in \"Cast Away\" and \"Captain Phillips\".\n\nBut, I finally watched \"Monster\" (2003) a few years ago in high school and was completely gagged by Charlize Theron's performance. Her Oscar win was the \"ah ha\" moment for me. I mean... her acting and transformation was SHOCKING and incredibly enjoyable to watch on screen.\n\nAnyone else experience this with other actors/actresses?\n\nEdit: Just thought of another performance that gagged me. Javier Bardem in “No Country for Old Men” was extraordinary.",
        "upvotes": 1104,
        "comments": 1238,
        "media": null,
        "permalink": "/r/movies/comments/1ngfqqt/what_film_opened_your_eyes_to_what_good_acting/"
    },
    {
        "id": "1ngn6j8",
        "author": "KlutchAtStraws",
        "title": "Movies that were terrible adaptations of their source material",
        "content": "There are so many to choose from but one of the worst adaptations for me by far is 'World War Z.' The movie is a generic zombie uprising movie with CGI fast zombies and ridiculous product placement that misses just about everything that made the book so immersive and compelling. No Battle of Yonkers, no LOBOs, no blind Japanese swordsman, no downed pilot scene, no Tiger Singh fighting square... It's almost an achievement how badly they messed this up.\n\n  \n",
        "upvotes": 232,
        "comments": 551,
        "media": null,
        "permalink": "/r/movies/comments/1ngn6j8/movies_that_were_terrible_adaptations_of_their/"
    },
    {
        "id": "1ngvgp3",
        "author": "1961Deckard",
        "title": "Ann Miller dances in the musical 'Time Out For Rhythm', 1941",
        "content": "",
        "upvotes": 61,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/cbpqyr34o5pf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ngvgp3/ann_miller_dances_in_the_musical_time_out_for/"
    },
    {
        "id": "1ngtw79",
        "author": "ChiefLeef22",
        "title": "TIFF 2025: Chloe Zhao's 'Hamnet' wins People's Choice Award, Guillermo Del Toro's 'Frankenstein' finishes as runner-up and 'Wake Up Dead Man' as 2nd runner-up; Park Chan Wook's 'No Other Choice' wins International People's Choice Award",
        "content": "",
        "upvotes": 48,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zx0rljAAmOFK3_s1LX8X2poiS01H3O8yr1k1MAU8wmc.jpeg?auto=webp&amp;s=30761de6a9cb2d771c018b6c5f66cb0733a7f4da"
        },
        "permalink": "/r/movies/comments/1ngtw79/tiff_2025_chloe_zhaos_hamnet_wins_peoples_choice/"
    },
    {
        "id": "1ngsdlb",
        "author": "LabLeather8006",
        "title": "Appreciating the Knives Out franchise. 100%",
        "content": "With the third film coming out soon, who else has been enjoying and loving and wanting for some more of this movie series???\n\nNever expected anything before watching the first film.\n\n1) Great and diverse cast. You do have some all-star celebs in this franchise. Different stories but one awesome, charismatic leading man - Benoit Blanc is in for a long, long, epic run!! \n\n2) Smart and socially relevant writing - masterclass in mystery storytelling. Plot is layered but not confusing. Tight and clever. Everything has a purpose. It’s all in the details!\n\n3) Thematic and high visual production - sharp and unique tone with great cinematography. Classic genre turn into modern flair - realistically grounded. \n\n4) Simple and fun! - you don’t need to be stressed throughout the movie and just enjoy the humor and ride all the way. The most rewatched films I’ve had in recent years - and it’s get better every time. \n\nKnives Out 9.5/10\n\nGlass Onion 9/10",
        "upvotes": 56,
        "comments": 45,
        "media": null,
        "permalink": "/r/movies/comments/1ngsdlb/appreciating_the_knives_out_franchise_100/"
    },
    {
        "id": "1ngs8wn",
        "author": "MarkWhittington",
        "title": "Apollo 13 made Jim Lovell a legend generations after the space race",
        "content": "",
        "upvotes": 56,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/70yYEqsG0d5xoDp0lc7WKYebubADAhPLYUCtuvlfAlY.jpeg?auto=webp&amp;s=42de935df10258260e57f0caf168edcbc7ee4bf5"
        },
        "permalink": "/r/movies/comments/1ngs8wn/apollo_13_made_jim_lovell_a_legend_generations/"
    },
    {
        "id": "1ngvsnf",
        "author": "spank-you",
        "title": "I just now realized, after watching Wayne's World for 30 years, that \"Noah's Arcade\" is a play on \"Noah's Ark\".",
        "content": "What other obvious things in a movie did you not get when you saw it as a child, and should have gotten, but only got it far too long after?\n\nA bonus for me was when the blue ray for princess bride came out and I could finally turn on subtitles for Fezzik. I could never understand what he was saying during his fight with the man in black.",
        "upvotes": 28,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1ngvsnf/i_just_now_realized_after_watching_waynes_world/"
    },
    {
        "id": "1ngpdnv",
        "author": "JasonVorhehees",
        "title": "Dog Man (2025) - What an unhinged kids movie",
        "content": "Threw this on this morning to entertain my kid for a bit and it’s just absolutely crazy. I don’t know who came up with this movie, but the number of adult jokes and everytbing going on has me laughing my ass off and entertained. The animation, whatever this style is, is also beautiful. I don’t generally wish for movie sequels, but hope we can get more movies like this. ",
        "upvotes": 57,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1ngpdnv/dog_man_2025_what_an_unhinged_kids_movie/"
    },
    {
        "id": "1ngonzd",
        "author": "Direct-Attention-712",
        "title": "What Movie Wrecked You So Bad You Haven't Been Able To Watch Again?",
        "content": "me. Requiem For  A Dream\n\nSchindlers List and Sophie's Choice. \n\nThese movies gave me nightmares and even after 20 plus years I can not bring myself to watch them again. Just watched Deer Hunter again after all these years and was glad I did. wrecked me again but i needed it. \n\nSo what movie has done this to you?",
        "upvotes": 65,
        "comments": 267,
        "media": null,
        "permalink": "/r/movies/comments/1ngonzd/what_movie_wrecked_you_so_bad_you_havent_been/"
    },
    {
        "id": "1ngvnkv",
        "author": "BunyipPouch",
        "title": "First Poster for Psychological-Horror 'Somnium' - At the experimental sleep clinic Somnium, dreams become real. Side effects include hallucinations, confusion, paranoia, sleep paralysis, detachment from reality, a lost sense of self and permanent nightmares.",
        "content": "",
        "upvotes": 25,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uvhdpviap5pf1.jpeg?auto=webp&amp;s=fb3fbbc4c81190ff84bd388189d5bf3922847929"
        },
        "permalink": "/r/movies/comments/1ngvnkv/first_poster_for_psychologicalhorror_somnium_at/"
    },
    {
        "id": "1ng37sl",
        "author": "BunyipPouch",
        "title": "First Poster for Documentary 'Slasher Trash' - A deep dive into the dark waters of obscure, low-budget slasher films.",
        "content": "",
        "upvotes": 1587,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uyhj45gauyof1.jpeg?auto=webp&amp;s=dcc3e72e9372c44d2b92a399ffeab286c4b337db"
        },
        "permalink": "/r/movies/comments/1ng37sl/first_poster_for_documentary_slasher_trash_a_deep/"
    },
    {
        "id": "1ngffsm",
        "author": "uncre8tv",
        "title": "Your favorite \"the movie is better than the book\" films?",
        "content": "Favorite has to be Drive. Not a terrible book but very cheap dimestore novel feeling. Lots of action, shaky plot, cool guy not aloof guy protagonist, and the kid played a much bigger role (not a good thing).\n\nI was really surprised at how bad the Bourne books were (mid-century \"machismo\" that is alternatively silly and disgusting), and have always heard that The Godfather books were pulpy dreck. \n\nSo - what's your favorite movie that improved on the book?",
        "upvotes": 296,
        "comments": 754,
        "media": null,
        "permalink": "/r/movies/comments/1ngffsm/your_favorite_the_movie_is_better_than_the_book/"
    },
    {
        "id": "1ngqeua",
        "author": "mrman12000",
        "title": "Holes(2003) is a great movie.",
        "content": "Now I know it’s a Disney movie, but for what it is they pack in some good twists and mature themes. I remember watching it as a kid and being traumatized by the Sam getting shot scene. I rewatched it with my brother recently and it still held up. I think they did an amazing job of making me actually like the characters, I felt really bad for zero and Stanley 4. The plot was good, but I think the character development was great, and I really like the kkb story as well as the curse story.",
        "upvotes": 41,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1ngqeua/holes2003_is_a_great_movie/"
    },
    {
        "id": "1ngi7z2",
        "author": "HazelsWarren",
        "title": "30 years later, \"Now and Then\" holds up as a testament to girlhood",
        "content": "This is such a solid movie about girlhood and its influence on messy, complicated adulthood. I first saw this movie when I was the age of the younger cast (the \"Then\" group), and now I'm closer in age to the \"Now\" cast. Everything resonated about their reunion in their thirties -- from the awkward conversations, the guilt of not being around each other often, and then the hospital scene with the baby delivery. The back-and-forth narrative really holds up in showing how the girls' last summer before they drifted apart really planted seeds for their complicated adult lives: \n\n* Chrissy (Ashleigh Ashton Moore, Rita Wilson), the most cautious and naive of the friends but also curious about 'the birds and the bees,' is the one who doesn't leave the neighborhood and marries her high school sweetheart. She's also the first of the friends to have a baby;\n* Teeny (Thora Birch, Melanie Griffith) is obsessed with movies and her body image; she later becomes a celebrated actress who experiments with breast augmentation; \n* Samantha (Gaby Hoffmann, Demi Moore) goes through it - her parents divorce, she almost drowns, her interest in the occult gets sidelined during their last seance scene. She finds refuge in science fiction writing, but struggles with being vulnerable; \n* Roberta (Christina Ricci, Rosie O'Donnell) is still grieving her mother's death; as an ob-gyn, older Roberta helps shepherd her best friend (Chrissy) safely into motherhood. Both Ricci and O'Donnell said the character was initially written as a lesbian, but some of the context was written out last minute due to test audience feedback--  however, it would have been compelling to keep the queer context in for the character, considering her 1970s arc (taping her chest, pretending to drown to see if her friends would perform CPR, disinterest in Devon Sawa for most of the movie, etc). \n\nI know Christina Ricci is now in Yellowjackets (which is also about a 90s group of girls in a back-and-forth timeline, but add cannibalism) but I could seriously see \"Now and Then\" being the premise for a limited series -- think \"This is Us\" crossed with \"Big Little Lies.\" ",
        "upvotes": 161,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1ngi7z2/30_years_later_now_and_then_holds_up_as_a/"
    },
    {
        "id": "1ng2qd2",
        "author": "Muhaisin35",
        "title": "30 years later, does Jurassic Park still hold up as “movie perfection”?",
        "content": "Rewatching it, the suspense, sense of discovery, and sheer wonder still feel unmatched, even after all these years. Personally, I think Dr. Grant is the soul of the film, his mix of awe, fear, and responsibility captures the heart of the story for me. But I’m curious, which character do you think truly made the movie unforgettable and left the biggest impact?",
        "upvotes": 1278,
        "comments": 564,
        "media": null,
        "permalink": "/r/movies/comments/1ng2qd2/30_years_later_does_jurassic_park_still_hold_up/"
    },
    {
        "id": "1ngr7sa",
        "author": "StrongHeart2462",
        "title": "What movie is the most historically accurate?",
        "content": "Hi All,\n\nOk. I was thinking about the movie 'Troy' and thinking there must be so many historical inaccuracies in there just to make an entertaining movie! \n\nMade me wonder, are there any movies made that are pretty close to real life events? Most real life event films do have experts on set but there's always artistic licence! ",
        "upvotes": 31,
        "comments": 207,
        "media": null,
        "permalink": "/r/movies/comments/1ngr7sa/what_movie_is_the_most_historically_accurate/"
    },
    {
        "id": "1ng6o62",
        "author": "CoolBDPhenom03",
        "title": "What’s something you only learned after watching a movie with subtitles?",
        "content": "An example would be like in “UP” where the golden retriever is named DUG, not Doug as I initially thought. The short that came out after the film is how I noticed the actual spelling, before I happened to rewatch with subtitles. \n\nThat’s less pivotal to the plot, but I’m sure you can think of better ones. \n\nGenerally, I don’t watch with subtitles unless it’s a foreign language film, since they can spoil details, like a specific character or if the timing is slightly early. \n\n",
        "upvotes": 673,
        "comments": 294,
        "media": null,
        "permalink": "/r/movies/comments/1ng6o62/whats_something_you_only_learned_after_watching_a/"
    },
    {
        "id": "1ng6lpu",
        "author": "indiewire",
        "title": "Michael Shannon on Finally Getting His Big Courtroom Drama with ‘Nuremberg,’ His Next R.E.M. Tour, and Playing Bill Parcells",
        "content": "",
        "upvotes": 638,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CmZp0Ef5sFpo2iMMzu0oZdM-i7cf8jYOieS85on4jC4.jpeg?auto=webp&amp;s=3803382d963c4a722e05e36494b1b9ff7411ccb4"
        },
        "permalink": "/r/movies/comments/1ng6lpu/michael_shannon_on_finally_getting_his_big/"
    },
    {
        "id": "1ngcay4",
        "author": "EuphoricButterflyy",
        "title": "‘Ryan’s Daughter’ (1970)- Major Doryan in state of Shell Shock scene",
        "content": "",
        "upvotes": 280,
        "comments": 28,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ze946ojtq0pf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ngcay4/ryans_daughter_1970_major_doryan_in_state_of/"
    },
    {
        "id": "1ng2sp9",
        "author": "MarvelsGrantMan136",
        "title": "‘Practical Magic 2’, Starring Nicole Kidman and Sandra Bullock, Wraps Filming",
        "content": "",
        "upvotes": 742,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nXRi6MveTVrjugwUhIMt_K0VwSBm8Vd__MlSViYMRhw.jpeg?auto=webp&amp;s=6b4cce4c623a4f7a75ea5f0e04290b4efd6c62e8"
        },
        "permalink": "/r/movies/comments/1ng2sp9/practical_magic_2_starring_nicole_kidman_and/"
    },
    {
        "id": "1ngeifg",
        "author": "ofthedappersort",
        "title": "Horror-Comedy That Really Does Both?",
        "content": "What is a horror-comedy that truly embodies both genres? I know there are a lot of \"horror-comedies\" where it's basically just a comedy but there happen to be monsters or whatever. I fail to think of any movies that are basically horror movies with a couple jokes thrown in but I'm sure they exist. Anyways, what are some movies you feel are truly a real blend of both horror and comedy?",
        "upvotes": 141,
        "comments": 595,
        "media": null,
        "permalink": "/r/movies/comments/1ngeifg/horrorcomedy_that_really_does_both/"
    },
    {
        "id": "1ngg764",
        "author": "EuphoricButterflyy",
        "title": "‘Hustlers’ (2019)… Destiny sees Ramona for the 1st time",
        "content": "",
        "upvotes": 108,
        "comments": 26,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/i24z7t6pp1pf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ngg764/hustlers_2019_destiny_sees_ramona_for_the_1st_time/"
    },
    {
        "id": "1nfifo2",
        "author": "MarvelsGrantMan136",
        "title": "‘Lord of the Rings’ star Sean Astin elected SAG-AFTRA president",
        "content": "",
        "upvotes": 51681,
        "comments": 935,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0Bl8CwgY7p8epppNOD7olsfTosyDZHFVUs3OL8ch7ZU.jpeg?auto=webp&amp;s=c375785f77acf06cf7c3721606dc1cdda8763010"
        },
        "permalink": "/r/movies/comments/1nfifo2/lord_of_the_rings_star_sean_astin_elected/"
    },
    {
        "id": "1ngnex2",
        "author": "TransportationUp",
        "title": "Degrassi Cast Reunite for Doc World Premiere",
        "content": "",
        "upvotes": 20,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kVU0IKSpwoVFsbDRGFwvOLR95vZyNmMb2EDhKKMeN0o.jpeg?auto=webp&amp;s=b77be3873ae36dd8d8af96fd31deb7482dbe93a7"
        },
        "permalink": "/r/movies/comments/1ngnex2/degrassi_cast_reunite_for_doc_world_premiere/"
    },
    {
        "id": "1ngvsjb",
        "author": "cyPersimmon9",
        "title": "It would be cool if Disney made another Fantasia",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YxCInuk7DEXjvLn3Dc8oHrb-IQueIwKFf18BQxGlqU4.jpeg?auto=webp&amp;s=f3e905a81b0ed15c395bb634b8a8ced88a789c94"
        },
        "permalink": "/r/movies/comments/1ngvsjb/it_would_be_cool_if_disney_made_another_fantasia/"
    },
    {
        "id": "1ngt6af",
        "author": "Lopsided-Cattle-2322",
        "title": "What movie completely changed the way you see the world?",
        "content": "Movies can be more than just a distraction; they can be a mirror that makes you question everything. I'm looking for films that didn't just tell a story, but fundamentally altered your perspective on life, morality, or humanity itself. For me, Arrival did it. The way it explored communication, time, and empathy left me speechless and genuinely shifted how I think about language and connection.",
        "upvotes": 6,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1ngt6af/what_movie_completely_changed_the_way_you_see_the/"
    }
]