[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 501,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 17,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jkqcdb",
        "author": "RevolutionaryRip2504",
        "title": "I don't think the show adolescence is vilifying men",
        "content": "  \nThere’s been a lot of debate about whether *Adolescence* demonizes men and masculinity. But is that really the case? Here’s what the show *actually* explores:\n \n- It critiques toxic environments, not men themselves. The series stars Jamie Miller a 13 year old boy who is arrested for the murder of Katie Leonard. But Adolescence doesn’t portray Jamie as inherently violent, he became this way due to loneliness, suppressing emotions, and exposure to harmful online spaces. ([Time](https://time.com/7267884/adolescence-netflix-explained/?utm_source=chatgpt.com))\n\n- Jamie struggles with emotional repression, something many young boys face due to societal expectations. For me the show is more about how important it is for young boys to learn how to manage their emotions and be vulnerable so they do not become violent like Jamie. ([News.com.au](https://www.news.com.au/lifestyle/real-life/news-life/casual-brutality-hidden-meaning-behind-adolescence-emojis/news-story/a8d7e4d2dbf8260f48e2af5c4c9a0858?utm_source=chatgpt.com))\n\n- Jamie’s exposure to incel forums and online radicalization is a key theme. The show critiques these dangerous spaces, not men in general. Just like we discuss unrealistic beauty standards for women, Adolescence examines toxic influences affecting young men.\n\nAt its core, *Adolescence* isn’t about vilifying men—it’s about understanding the challenges they face. Instead of rejecting its message, let’s ask: How can we better support young boys before they reach a breaking point?",
        "upvotes": 146,
        "comments": 109,
        "media": null,
        "permalink": "/r/netflix/comments/1jkqcdb/i_dont_think_the_show_adolescence_is_vilifying_men/"
    },
    {
        "id": "1jkwa8x",
        "author": "OccasionAmbitious449",
        "title": "Adolescence: It's OK to not like something",
        "content": "I feel like I've had to make this post because even though I thought Adolescence was OK, I didn't think it was great. The supporters of this show have become SO hateful online it's ridiculous!\n\nPeople are saying \"It's a masterpiece\", \"This will be studied in Media classes\", \"This show was eye-opening and life-changing\" and that's FINE! You know why? Because everybody is entitled to an opinion!\n\nTikTok, X, Facebook, Reddit, everywhere I leave my opinion saying \"I thought it was alright, pretty good, I probably wouldn't watch again though\" I get people saying...\n\n\"You obviously didn't get it 🙄 \"\n\"You must have a low IQ, this is only for deep thinkers to watch\"\n\"Sorry that TikTok has rotted you're brain and you can't go more than 5 mins without getting bored\"\n\"You're part of the problem with society\"\n\"We found the Andrew Tate supporter who hates women!!!\" (I'm gay lol)\n\nMy point is that it's OK to not be a big fan of a fictional TV show lol Everybody has an opinion. But it just seems like fans of this show are actively going out of their way to be rude and aggressive towards those who weren't big fans of the show.\n\nI can understand the obvious hate towards those who are wearing tin foil hats or who are actual Andrew Tate supporters, but what is the deal with getting angry with a random person who just didn't like it? Lol\n\nI know it explores sensitive topics but people really need to chill out over this show. One of the key messages was how we behave online and some of the fans are completely contradicting that message imho. They're being SO hateful towards people who have a different opinion. \n\nRant over, thank you for coming to my Ted Talk. ",
        "upvotes": 25,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1jkwa8x/adolescence_its_ok_to_not_like_something/"
    },
    {
        "id": "1jkwlm4",
        "author": "DorothyMortimer",
        "title": "I love The Residence!",
        "content": "Don’t worry, no spoilers! I just want to shout from the rooftops about how much I love Uzo Aduba and The Residence. I knew it was a Shonda show going in, so was expecting excellence, and guess what? I was not disappointed ❤️ I love it, binged it all, and highly recommend it. Done!",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jkwlm4/i_love_the_residence/"
    },
    {
        "id": "1jkiost",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Orders Live-Action Scooby-Doo Origin Series",
        "content": "",
        "upvotes": 62,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1jkiost/netflix_orders_liveaction_scoobydoo_origin_series/"
    },
    {
        "id": "1jkglwg",
        "author": "asurangonne",
        "title": "What would happen after the ending of Adolescence according to UK laws?",
        "content": "After bawling at the ending. (the aurora song was unfair too seriously)  \nI got curious to know what would happen to J after he pleads guilty?\n\nI googled and it seems for first degree murder, its life in prison for 15 and up, but J should be 13 when he committed the crime.\n\nIs he as good as dead to the millers? Because the ending really felt that way too in some sense.",
        "upvotes": 55,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1jkglwg/what_would_happen_after_the_ending_of_adolescence/"
    },
    {
        "id": "1jkydfb",
        "author": "Robemilak",
        "title": "Netflix Sets Korean Series ‘Scandals’ Starring Son Ye-jin, Ji Chang-wook &amp; Nana",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jkydfb/netflix_sets_korean_series_scandals_starring_son/"
    },
    {
        "id": "1jkz5jq",
        "author": "Plane-Cloud-5837",
        "title": "Why Jamie wasn't in the last episode of Adolescence",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jkz5jq/why_jamie_wasnt_in_the_last_episode_of_adolescence/"
    },
    {
        "id": "1jktb8q",
        "author": "Wuellig",
        "title": "The Hot Spot",
        "content": "It seems like the whole rest of this season so far set up this latest episode to be hilarious from beginning to end. \n\n\nWe've been introduced to the characters one or two at a time, so by the time there's this ensemble on screen, the interpersonal dynamics just keep firing, not only with the dialogue, but the looks. \n\n\nI enjoy the contrast of the extraordinary circumstances with the relatively mundane but caring friendship.The way this whole episode played out was a lot of fun, and I'm really looking forward to seeing what happens next.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jktb8q/the_hot_spot/"
    },
    {
        "id": "1jkvacv",
        "author": "hogswristwatch",
        "title": "Adolescence no surround in original english: just me?",
        "content": "Italian etc work fine, home theater shows 5.1 audio. The options also lists 5.1 for the descriptive English and it works fine. Why doesn't the orig8nal English have 5.1?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jkvacv/adolescence_no_surround_in_original_english_just/"
    },
    {
        "id": "1jkv95i",
        "author": "Severe_Pie_517",
        "title": "I’m looking for some recommendations.",
        "content": "I’m looking for a tv show that has sad depressing moments but like a rom-com also doesn’t have to be strictly Netflix but examples like Gilmore girls, “how I met your mother”, parenthood, “love”, “chuck”, Derek, after life is a good example also like I said chuck is a good example",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jkv95i/im_looking_for_some_recommendations/"
    },
    {
        "id": "1jkut5f",
        "author": "Internal-Bed-3150",
        "title": "The Witcher finishes filming (the first leg of) its final season",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jkut5f/the_witcher_finishes_filming_the_first_leg_of_its/"
    },
    {
        "id": "1jkx6da",
        "author": "lyfe_Wast3d",
        "title": "Dear Netflix thank you for daredevil",
        "content": "I've seen all the episodes and loved it from the start. My girlfriend however hasn't we recently started watching the new daredevil on Disney and I wasn't feeling it and I didn't know why. Then we started to watch the first season. Let's just say gf understands why daredevil is actually cool now. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jkx6da/dear_netflix_thank_you_for_daredevil/"
    },
    {
        "id": "1jkpmmc",
        "author": "KMaior",
        "title": "Psychology behind Adolescence Episode 3",
        "content": "I have no competences in psychology. If you have it please answer this sub and let’s talk about the psychologist in adolescence episode 3\n\n•\t⁠Do you think she did a good job? \n•\t⁠Can you explain why she acted like that?maybe give me examples about specific moments of the episode, like why she bring chocolate and sandwich? Why she started with such questions like father, sexuality? Was she trying to make him confess or just trying to delineate his psychological profile? \n•\t⁠What do you see in the kid about his reactions and answers?\n\nNo need to answer these specific questions i made. Just say whatever comes in your mind.\n\nIn my opinion, but i repeat that i have no competences in this field, I see the psychologist a bit inexperienced in some moments (maybe is done on purpose for cinematic reasons). I think she was way too emotionally involved and some times gave him the opportunity of taking too much space and to attack her\n\nBy the way… the kid is a phenomenal actor.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jkpmmc/psychology_behind_adolescence_episode_3/"
    },
    {
        "id": "1jjjsmn",
        "author": "Somethingman_121224",
        "title": "'Adolescence' Becomes First-Ever Streaming Show to Top British T.V. Ratings",
        "content": "",
        "upvotes": 425,
        "comments": 103,
        "media": null,
        "permalink": "/r/netflix/comments/1jjjsmn/adolescence_becomes_firstever_streaming_show_to/"
    },
    {
        "id": "1jko9a6",
        "author": "Extrivio24",
        "title": "Shows appearing in different regions?",
        "content": "In my binge watching phase of Prison Break however I’ve noticed that I can watch Prison Break at work in Central London, but when I’m at home (outside of London) Prison Break gives me an error that’s it’s outside of my region? Is that really a thing where I can’t watch a show when I’m not in London?\n\nNot just Prison Break either - happens for a few shows and movies.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jko9a6/shows_appearing_in_different_regions/"
    },
    {
        "id": "1jk3yr3",
        "author": "greasypancakes69",
        "title": "Adolescence - How was Jamie created?",
        "content": "I’ve been going through the subreddit and I’m seeing a lot of comments about how the problem isn’t psychological but rather sociological, whereas my take is that it’s an intersection between the two…\n\nKindly share your thoughts and opinions, but to me it seems obvious that this kid has traits/behaviours that line up so well with Antisocial Personality Disorder, and I say this as someone who has both extensively studied and had very close people to me with this disorder. If anything I tried to find signs that contradicted my original analysis and I really couldn’t find many.\n\nThe entire third episode characterised it so well, down to the body language of the psychologist as she was trying to make her assessment of him. Then the fourth episode gave a lot of context as to how he was raised – negligent parents, *possibly* a narcissistic father – on top of the bullying and rampant insecurities, I could go on…\n\nFor those who work in mental health and related fields, themselves have ASPD or have experiences with people who do… Like am I off base here?",
        "upvotes": 26,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1jk3yr3/adolescence_how_was_jamie_created/"
    },
    {
        "id": "1jkn81b",
        "author": "tinuz84",
        "title": "Move extra member profile back to main account?",
        "content": "So I recently added the “extra member” option to my account, and moved my friends profile to that extra member seat. We quickly found out that with a “extra member” account you can’t add a Kids profile to it, which my friend needs for her family. \n\nI want to move her profile to my main account, so I can later move that profile to my friends full account which she is going to make in nearby future. In the account settings I have the option to remove the “extra member” with my friends profile attached to it, but I don’t see how I can move the profile back to my main account. Does anyone know if that is even possible? Or is this profile forever locked a “extra member” seat in my account?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jkn81b/move_extra_member_profile_back_to_main_account/"
    },
    {
        "id": "1jk3ahd",
        "author": "__SummerSky",
        "title": "Has anyone watched Con Mum?",
        "content": "I thought it was a pretty interesting documentary! I feel so sorry for Graham and how he found out who his mom really was and how it destroyed all aspects of his life.\n\nWhat are your thoughts?",
        "upvotes": 22,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1jk3ahd/has_anyone_watched_con_mum/"
    },
    {
        "id": "1jjsevm",
        "author": "Junior_Apartment6388",
        "title": "Has everyone seen how they filmed the van scene in Adolescence! It looks so bizarre there’s literally a guy sitting on top of the van driving it",
        "content": "",
        "upvotes": 91,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1jjsevm/has_everyone_seen_how_they_filmed_the_van_scene/"
    },
    {
        "id": "1jk7jg7",
        "author": "DCorvid_Art",
        "title": "Is Wolf King any good?",
        "content": "So I remember a fair bit of hype when it was first announced then nothing for years. It's been out for like 5 days now and I haven't seen a single person talk about it and my twitter is 99.5% animation stuff.\nSome 19 year old swede made a 13 second animatic and I heard about it the next day, Wolf King came out and literally nobody is talking about it. Is it bad? Is it good?",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1jk7jg7/is_wolf_king_any_good/"
    },
    {
        "id": "1jjwghy",
        "author": "mez1337",
        "title": "Dear Netflix, Belgium is not France Lite",
        "content": "Here I am, browsing Netflix with my partner, and I see multiple animé shows we could watch. She gets excited for Demon Slayer, I put it on and... It's Japanese dubbed. No problem, I'll just put on subtitl--There's only French subtitles. And Japanese subtitles.  \nUhh... Well that sucks. I'm pretty decent at holding conversations in french but I'm not so good at speed reading it. And my gf doesn't understand french at all.\n\nWell fine, I'll just put on Frieren. I watched it already, and was pretty hyped to see it on the homepage, and now I can watch it with her-- It's japanese dubs with french subs only.  \nFml alright I'll just try Konosuba--  \nYeah guess what. French subs only.\n\nI don't know if you realize this, Netflix, but 60% of Belgians have dutch/flemish as their native language. That's what we call a \\~**majority\\~**.  \n  \nSo why do I get the feeling Netflix is only catering to the francophones? Is it because we Belgians are almost always depicted as french-speakers in American movies and shows?  \nOr is Netflix not able to afford the rights to dutch subtitles? We would even settle for English subtitles ffs.",
        "upvotes": 43,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jjwghy/dear_netflix_belgium_is_not_france_lite/"
    },
    {
        "id": "1jk85em",
        "author": "GGZoey11",
        "title": "Need suggestions.",
        "content": "I finished watching Adolescence  and was blown away. Does anyone have a suggestion for something similar? I love docusiries, and quirky movies. A Dark Song is my favorite \"horror \" movies. I like psychologically stimulating and tenseness. \nNow I watch a Lot of Netflix. I can only afford that and youtube.  So I might have seen a lot of suggestions.  But please throw a couple my way. Thanks ❤️ ",
        "upvotes": 3,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1jk85em/need_suggestions/"
    },
    {
        "id": "1jke5z2",
        "author": "Cartapouille",
        "title": "Dolby Atmos with Android TV Benq X500i projector",
        "content": "Greetings guys,\n\n  \nSo I have the premium plan and a 4k projector with Android TV. And it's hooked to a Denon avr x1800h through eARC. ANd Netlfix proposes me 4k content, but never atmos, only 5.1 . It's getting frustrating, as from my Windows PC I get Atmos sound from the Netflix app (and receiver display Atmos on the front screen), buuuuuut no 4k as the app is crap.\n\nANd yes passthrough is selected on the projector, as well as eARC. Seems the Android TV app just refuses to see I can play Atmos. \n\nAny idea? Or should I never receive the 4k and Atmos at the same time because you can never win in this life? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jke5z2/dolby_atmos_with_android_tv_benq_x500i_projector/"
    },
    {
        "id": "1jjjvnw",
        "author": "BackgroundAvocado224",
        "title": "Con Mum",
        "content": "Dare I say the only person I feel sorry for is Peng and the other couple. Why on earth would you spend £300K on a mum who hasn’t been in your life for 45 years abandoning your partner and child for her. \n\nDare I also say Dionne is actually a successful business woman - she sure knows how to run a scam. ",
        "upvotes": 108,
        "comments": 172,
        "media": null,
        "permalink": "/r/netflix/comments/1jjjvnw/con_mum/"
    },
    {
        "id": "1jke00k",
        "author": "Fun-Ad9428",
        "title": "An Idea of a New Reality Show",
        "content": "What if instead of perfect match, it’s different reality with all the villains of each reality show. Not a mix of genuine people like they do but straight villians from each reality show.\n Then instead of just dating but a mix with trust and genuine challenges. Like the mole or survivor type of way. Where they do need to form bonds to survive but have options to back stab their partner and etc ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jke00k/an_idea_of_a_new_reality_show/"
    },
    {
        "id": "1jkd0w0",
        "author": "Junior_Apartment6388",
        "title": "Wow an actual PVC door specialist had to fit a new door 12 times for Adolescence after the actors rammed it down in each take",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jkd0w0/wow_an_actual_pvc_door_specialist_had_to_fit_a/"
    },
    {
        "id": "1jkuotn",
        "author": "chloe-decker666",
        "title": "Netflix ruins shows.",
        "content": "I’ve noticed that every time Netflix takes over a show that was originally on another platform the drama goes up 100% they’ve taken shows that albeit somewhat serious still had humor and lightness and just completely plunge it into darkness and drama. They kill off characters for no reason and the ending of the shows make no sense. I’m just tired of it. ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jkuotn/netflix_ruins_shows/"
    },
    {
        "id": "1jklgdk",
        "author": "indiewire",
        "title": "Every ‘Black Mirror’ Episode, Ranked",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jklgdk/every_black_mirror_episode_ranked/"
    },
    {
        "id": "1jkbzd5",
        "author": "Ready-Airline-3178",
        "title": "Can I select HDR10+ over Dolby Vision?",
        "content": "Hey! On my Android TV that supports both HDR10+ and Dolby Vision, HDR10+ usually looks better than Dolby. Now that Netflix supports both, is there a way for me to kind of disable Dolby and having HDR10+ prefered whenever it is possible \nBest regards ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jkbzd5/can_i_select_hdr10_over_dolby_vision/"
    },
    {
        "id": "1jk9ckt",
        "author": "Visual_Conference144",
        "title": "Can you use old icons?",
        "content": "Hey guys the heading says everything. Is there still a way to use old netflix icons that have been deleted? I lost my old demogorgon icon and i would really like to have it back but its gone on the offfical way",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jk9ckt/can_you_use_old_icons/"
    }
]