[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1pbdb97",
        "author": "Ha8lpo321",
        "title": "Netflix quietly killed casting from phones to newer Chromecasts and Google TV Streamer",
        "content": "",
        "upvotes": 49,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pbdb97/netflix_quietly_killed_casting_from_phones_to/"
    },
    {
        "id": "1pbgp78",
        "author": "Such_Environment5893",
        "title": "What is the justification of increasing subscription prices when Netflix continues to cancel shows after 2 seasons?",
        "content": "It doesn't make any sense to me.\n\nWhy get me hooked on shows if they are not going to be finished?\n\nWhat is the justification of this cycle of killing shows after 2 seasons only to start new shows?\n\nIs the price difference THAT MUCH between a renewal vs a new show?\n\nOr is it this overwhelming desire to find the next \"Walking Dead\" or \"Game of Thrones\" mega hit? Is it a case of \"unless it goes viral, its a failure?\"\n\nThe economy of streaming services is pissing me off. These price increases don't seem justified in the slightest.\n\nThis is why I've more often switched to watching YouTube, as at least I can rely on those content creators to keep giving me content I want to watch instead of \"well, my last video didnt get 1 million views, so I guess I'm calling it quits!\".",
        "upvotes": 13,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pbgp78/what_is_the_justification_of_increasing/"
    },
    {
        "id": "1patdun",
        "author": "f41ryb0n3s777",
        "title": "Removed a movie while i was watching it",
        "content": "Honestly just sharing it cus it’s funny but a little annoyed by it too. I was watching “Now You See Me 2” and i paused it for like 5 minutes to take a pee break. I come back and turn on the movie and it says title not available. I just brush it off as a typical Netflix glitch and refresh the page to see THAT THEY REMOVED THE MOVIE OFF THE WEBSITE 😭😭😭 REALLY NETFLIX\n",
        "upvotes": 351,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1patdun/removed_a_movie_while_i_was_watching_it/"
    },
    {
        "id": "1pbdvk9",
        "author": "TheMirrorUS",
        "title": "Linda Carman was 'warned' not to go on boat trip with son before death",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbdvk9/linda_carman_was_warned_not_to_go_on_boat_trip/"
    },
    {
        "id": "1pb93gz",
        "author": "Boredpoquito31",
        "title": "Recommend me some animals documentary",
        "content": "Can you recommend me some of the best animals documentary on Netflix right now? I want something that will be so interesting to watch , even of it's a series of a full movie. Thank you!",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pb93gz/recommend_me_some_animals_documentary/"
    },
    {
        "id": "1patbpk",
        "author": "StunningComment6064",
        "title": "True crime",
        "content": "Which is the best Netflix TV show based on true crimes? Which one do you recommend, or which one has stayed in your memory even today after you watched it?",
        "upvotes": 31,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1patbpk/true_crime/"
    },
    {
        "id": "1pbfvc1",
        "author": "gronbek",
        "title": "Beast in me grain filter",
        "content": "Started watching the beast in me and noticed directly that the image is very grainy. Like there is a filter with lots of small dots everywhere. \nIs this normal?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbfvc1/beast_in_me_grain_filter/"
    },
    {
        "id": "1pbfiay",
        "author": "Wooden-Butterfly7339",
        "title": "Cool Screen shot filter",
        "content": "When you turn on Netflix, you get a carousel of screen shots of available shows. Many of those shots have a subtle filter that I really like! \nSpartacus is a good example. Does anyone know what it's called or how it's done?\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbfiay/cool_screen_shot_filter/"
    },
    {
        "id": "1pbehai",
        "author": "Lost_Transportation1",
        "title": "Streaming Services and Movie Night Habits Survey (UK/EU Based)",
        "content": "For my university course, I'm conducting research into a specific modern pain point: the high-friction workflow of deciding on a movie or TV show when multiple streaming services and multiple people are involved.\n\nOur goal is to create a final year app designed to solve this.\n\nIf you watch movies with at least one other person (partner, family, flatmates) or even by yourself, your participation would be immensely valuable to this research.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pbehai/streaming_services_and_movie_night_habits_survey/"
    },
    {
        "id": "1pbedne",
        "author": "RingRevolutionary552",
        "title": "Where is sesoan 1 of Gilmore Girls ?",
        "content": "I started watching Gilmore Girls and I am on sesoan 1 and now I see that they removed only sesoan 1. I can watch other sesoans but not 1, why ? How do I fix this ?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pbedne/where_is_sesoan_1_of_gilmore_girls/"
    },
    {
        "id": "1pbeb7g",
        "author": "Apprehensive-Care690",
        "title": "Series recommendation",
        "content": "Please please give me a good recommendation series or movies that is SciFi or movies with zombies plot. My netflix is getting cobwebs. Just not Godzilla.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pbeb7g/series_recommendation/"
    },
    {
        "id": "1pbauuq",
        "author": "hey_Imokie",
        "title": "Why did they discontinue Spinning out???",
        "content": "So I randomly remembered this show and now I’m annoyed all over again.\n\nIt actually had a pretty solid plot, good casting, and the chemistry was great. And the best part? The way they portrayed Kat’s bipolar disorder was so nuanced, no glamorizing, no over-the-top chaos, just a very real, very human depiction.\n\nIf only they’d bring it back. Honestly, it deserved so much better.\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pbauuq/why_did_they_discontinue_spinning_out/"
    },
    {
        "id": "1pan4i2",
        "author": "Remarkable-Slide-750",
        "title": "Stranger things season 5! What’s your thoughts?",
        "content": "I loved season 5! I had low expectations because it’s hard for a show to keep me engaged after season 3 and the fact so much time has passed between seasons but I think season 5 was carefully orchestrated! The characters weren’t overly exaggerated, the storyline had a lot of hooks so you’re not just waiting for that “one” thing to happen, and the relatable symbolizations of inner battles we all good through. I say bravo for keeping season 5 evolved while maintaining a steady baseline story! ",
        "upvotes": 26,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1pan4i2/stranger_things_season_5_whats_your_thoughts/"
    },
    {
        "id": "1pb0za5",
        "author": "GuineaPKilledMe",
        "title": "I really wish they'd bring Hoops back",
        "content": "Ever since it released in 2020 it's been my comfort show. I don't know why it was so universally disliked. It's funny and silly and personally I enjoy how they go overboard with vulgarity. Apparently the reason it was cancelled after one season was due to the vulgarity, but why even allow season 1 then? \n\nUgh I miss Ben :(",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pb0za5/i_really_wish_theyd_bring_hoops_back/"
    },
    {
        "id": "1pb5edr",
        "author": "harpreetthind",
        "title": "Question",
        "content": "Looking for movie recommendations already watched good girls watching Wednesday and finished watching\nThe haunting of Hill House what does everybody else recommend watching?\nThanks",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1pb5edr/question/"
    },
    {
        "id": "1pb8q42",
        "author": "Notoriously_So",
        "title": "Thank you Netflix",
        "content": "Thank you Netflix for having all 5 Rurouni Kenshin movies and being literally the only place these movies are available to watch in my region.  \n\nAfter the Last Samurai Standing Season 1 ending, this will definitely be on my watchlist. I really hope we get a Season 2. Fantastic show. 👍💯",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pb8q42/thank_you_netflix/"
    },
    {
        "id": "1p9vc1e",
        "author": "Affectionate_Key7206",
        "title": "The stranger things aren't strange anymore",
        "content": "I know a lot of people are gonna come for me, but it's just my opinion. And don't get me wrong, this show will *always* have a special place in my heart, but it's clear that it's outgrown itself.\n\nThe 80s appeal no longer really has its charm, the kids are no longer kids, and most importantly, the stranger things aren't strange anymore. The unknown is what makes something unsettling. When you begin to spell out all the aspects, it doesn't have that eerie feeling anymore. This show has over-explained its lore to the point where it's very convoluted and no longer uncanny. The whole point of the Upside Down was the unknown, another world that's beyond human comprehension. All of that goes away when you reveal that it's just some guy who's been pulling the strings since the first season. Not only is it overly detailed, but it's also been the same thing for nearly a decade now. The monsters were creepy at first, but now we've seen it a hundred times, so it doesn't have that effect anymore.\n\nI rewatched seasons 1 and 2, and it's honestly crazy how much the show has detached from itself. If somebody watches season 1 and then watches the first episode of season 5 right after, they would be completely baffled. Remember when this show was just about a boy who went missing? And the characters have so much plot armor. I love how the demogorgon slaughters the background characters almost instantly, but when it comes to our protagonists, it stands and screams, so they always run away. Not to mention, the dialogue is also really bizarre, lots of exposition dumps, etc.\n\nThere's a lot more I could say, but I don't want this to be too long. I just needed to voice my thoughts somewhere cause anytime you complain on TikTok or the ST subreddit, you just get attacked lol. But I'm glad others are enjoying it. I wonder if it will be one of those shows with an ending that's divisive among fans.",
        "upvotes": 1350,
        "comments": 462,
        "media": null,
        "permalink": "/r/netflix/comments/1p9vc1e/the_stranger_things_arent_strange_anymore/"
    },
    {
        "id": "1pbg9kn",
        "author": "Dazzling_Cheetah_270",
        "title": "Can Netflix fix the subtitle system for anime?",
        "content": "I wanted to start watching Fullmetal Alchemist Brotherhood, and the english audio is great, all fine, but the subtitles never fit the words, it was absolutely atrocious, even for FMAB or Dandadan they never fit at all, then theres the issue of not even having the dub of an anime (like eminence shadow) for english, i want to be able to listen and watch the show instead of focusing on the subtitles, but it bugs me when it doesnt fit the words (yes i have Autism and ADD and yes thats relevant to the subtitles and why i need them)",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pbg9kn/can_netflix_fix_the_subtitle_system_for_anime/"
    },
    {
        "id": "1pavdny",
        "author": "Notoriously_So",
        "title": "New Layout",
        "content": "I don't know if this is a beta thing or whatever, but the new Netflix layout on Chromecast and TV is pure garbage. The icons are way too big and it's basically impossible to navigate. Why can't they just leave things how they were before?",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pavdny/new_layout/"
    },
    {
        "id": "1pbfqa7",
        "author": "Stunning-Cupcake-545",
        "title": "Can I share my Netflix account with my sister in a different country?",
        "content": "I’m currently living in the Philippines and planning to use the **“Add Extra Member”** feature since my sister is in a different \"household\".\n\nHowever, Netflix states:\n\n&gt;*Extra members need to be in the same country where the account owner signed up.*\n\nDoes this mean it’s not possible to share my account with my sister who lives in Singapore? Has anyone tried this before?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pbfqa7/can_i_share_my_netflix_account_with_my_sister_in/"
    },
    {
        "id": "1pb6nl0",
        "author": "Successful-Break-585",
        "title": "Rust Valley restorers missing after S3",
        "content": "I am trying to watch Rust valley restorers on Netflix in India and can only find episodes upto S3 nothing after that. Where can I find remaining episodes?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pb6nl0/rust_valley_restorers_missing_after_s3/"
    },
    {
        "id": "1pb5snp",
        "author": "grahamalondis",
        "title": "Anyone else unable to stream particular episodes of Stranger Things S5 in 4K?",
        "content": "I'm on a wired connection at about 100 Mbps and I've tested it multiple times. Other seasons of Stranger Things, the trailers, and even the first episode of season 5 stream in 4K no problem. But for some reason episodes 2 and 3 (haven't checked 4) are only streaming 1080 and look like they're on a DVD from 2007. Like the bit rate of the video won't go beyond 1.87 Mbps while the episodes that play normally are above 12mbps. Awful.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pb5snp/anyone_else_unable_to_stream_particular_episodes/"
    },
    {
        "id": "1palmyi",
        "author": "Texanlivinglife",
        "title": "Sweet Magnolia's",
        "content": "Perfect day for binge watching. I love Sweet Magnolia's but, I'm having a hard time finding anything like it. I'm really not watching Christmas movies. Recommendations please and thanks.",
        "upvotes": 13,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1palmyi/sweet_magnolias/"
    },
    {
        "id": "1pb47ue",
        "author": "Notoriously_So",
        "title": "Top and bottom black bars",
        "content": "Why do most shows on Netflix show top and bottom black bars when streaming on TV, when most other streaming services don't do this? Is there a setting to remove them?",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pb47ue/top_and_bottom_black_bars/"
    },
    {
        "id": "1pb32mv",
        "author": "Outofcontexttacoboi",
        "title": "Netflix extra member slot not working",
        "content": "Whenever my partner tries to sign up with an extra member slot on Netflix it completely kicks me out of the household, she has tried on her phone and tv and for some reason every time she signs in it signs her into her phone only and then kicks me out of the household but I'm paying for the extra slot and the actual subscription. What does she need to do set up? We tried signing into the slot with password, qr code, and link but the extra slot never gets used. What is the step by step process to fully set up the extra member slot?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pb32mv/netflix_extra_member_slot_not_working/"
    },
    {
        "id": "1pbbttn",
        "author": "KotaSamich",
        "title": "Stranger Things Season 5 thoughts?",
        "content": "Is it just me or was season 5 kinda meh? It kind of felt rushed for me and too much was being thrown at you at the same time.\n\nI don't really know how to explain it but comparing it to the other 4 seasons, they were more paced and flowed through more easily and gave enough time to process the information in every scene. It didn't cut so quickly to other characters either, meanwhile in season five it's just BOOMBOOMBOOMBOOM, and everyone is constantly arguing 😦.\n\nI'm not trying to poke fun or be overly critic, it's just how I felt watching it. ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pbbttn/stranger_things_season_5_thoughts/"
    },
    {
        "id": "1pa32qj",
        "author": "Samurai_Geezer",
        "title": "Why is it so difficult to just watch the credits after the movie is done",
        "content": "I do not want a commercial right after an emotional ending of a movie, I want to think about it a bit more, pay respects to the people who made it, check out if that one actor I vaguely recognized was really the one I thought it was. Now I have to scroll through the entire movie just to get back to the credits that was automatically skipped. Goddamnit ",
        "upvotes": 184,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1pa32qj/why_is_it_so_difficult_to_just_watch_the_credits/"
    },
    {
        "id": "1paqznm",
        "author": "luckyywallflower",
        "title": "True Crime Docus",
        "content": "Are there other true crime documentaries that are the same format (use only bodycam footage, interviews) or same vibe with THE PERFECT NEIGHBOR?\n\nReally loved that docu. I understand the hype.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1paqznm/true_crime_docus/"
    },
    {
        "id": "1pastl6",
        "author": "PropertySuspicious35",
        "title": "Trying to watch a downloaded episode but it tells me I’ve reached the end of the download.",
        "content": "Netflix says my episode is fully downloaded (phone with checkmark symbol), but then 20 minutes in it says that I have reached the end of the downloaded portion. This is the first time it’s ever happened after 5+ years of downloading downloading stuff on Netflix.  How can I fix this? Why is Netflix lying to me about what I have downloaded?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pastl6/trying_to_watch_a_downloaded_episode_but_it_tells/"
    }
]