[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 491,
        "comments": 270,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j29utw",
        "author": "hiatitae",
        "title": "I want to watch the credits, why am I now not allowed to?",
        "content": "",
        "upvotes": 37,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/p8s0k1tyceme1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1j29utw/i_want_to_watch_the_credits_why_am_i_now_not/"
    },
    {
        "id": "1j2jsij",
        "author": "MysteriousDelay6266",
        "title": "The Electric State | Final Trailer | Netflix",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j2jsij/the_electric_state_final_trailer_netflix/"
    },
    {
        "id": "1j2f9a3",
        "author": "SphincterRelaxer",
        "title": "What Jennifer did",
        "content": "This documentary is crazy. A bit of spoiler here but Jesus Christ I feel for her. What horrible parents. What they did to her when she was obviously suffering under all that pressure is beyond cruel . They didn’t treat her like their child, how could they been so strict and cold is beyond me. I know what she did is horrid but I can’t really judge her. Poor kid ",
        "upvotes": 12,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1j2f9a3/what_jennifer_did/"
    },
    {
        "id": "1j2jy6h",
        "author": "S4v1r1enCh0r4k",
        "title": "'The Electric State: Kid Cosmo' Prequel Game To Follow Film's Release On Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2jy6h/the_electric_state_kid_cosmo_prequel_game_to/"
    },
    {
        "id": "1j2mg69",
        "author": "Illustrious_Gear_471",
        "title": "Zero Day TV Show Classified Folder Actually Unclassified",
        "content": "In S1E2, 4 minutes and 42 seconds before the end, a folder is shown for a top secret government program known as Proteus. However, on this TOP SECRET folder is a sticker that says “U//FOUO” which literally means UNCLASSIFIED, for official use only. I thought this was funny and wanted to share.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2mg69/zero_day_tv_show_classified_folder_actually/"
    },
    {
        "id": "1j27a3d",
        "author": "SnooTomatoes7723",
        "title": "Is it worth to watch 1899 even tho it got cancelled? | Or similar shows like From and Lost?",
        "content": "Hey, I finished the show \"From\" which is a horror mystery, and I heard that 1899 should have a similar vibe. But people said it is not worth starting the show because it ends on a cliffhänger and the second season got cancelled, so I would be just mad after watching it. Do you think it is still worth it, and more importantly, do you have recommendations for shows like From or Lost?",
        "upvotes": 24,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1j27a3d/is_it_worth_to_watch_1899_even_tho_it_got/"
    },
    {
        "id": "1j2mj6e",
        "author": "Mean_Ice8261",
        "title": "Need a watch buddy",
        "content": "Hey folks,  been on and off Netflix for a while, and I figured it'd be more fun to watch something with company. Looking for someone to join me for a Netflix watch party\nPS: You can pick the movie!\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2mj6e/need_a_watch_buddy/"
    },
    {
        "id": "1j2m7we",
        "author": "S4v1r1enCh0r4k",
        "title": "The trailer for Astérix &amp; Obélix: The Big Fight is out now! The series premieres on Netflix on April 30.",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2m7we/the_trailer_for_astérix_obélix_the_big_fight_is/"
    },
    {
        "id": "1j2kx0v",
        "author": "ScaleTimely4145",
        "title": "Ricken x Jake from ITOET",
        "content": "If anyone has watched the netflix movie “I’m thinking of ending things”, you might agree with me. Doesn’t Ricken remind you of Jake? I’m rewatching the film and his passive insistence and love of overusing and disrespecting the english language with garbage literature REALLY reminds me of Ricken  ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2kx0v/ricken_x_jake_from_itoet/"
    },
    {
        "id": "1j2kuh8",
        "author": "emberdenver",
        "title": "is there a reason the same episodes repeating",
        "content": "I’m rewatching Breaking Bad and everytime I click on the show on the Home Screen, it keeps repeating s1e7 a no rough stuff type deal, when im on season 2 episode 3, this bug keeps happening where it takes me to a previous episode and it’s only been BrBa since it’s the only one I’m on now",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2kuh8/is_there_a_reason_the_same_episodes_repeating/"
    },
    {
        "id": "1j2fnvy",
        "author": "Jemster768",
        "title": "Casting question",
        "content": "I have Netflix Standard and was recently at a friends house and was going to stream a movie onto my iPad and cast it to his Chromecast HD (or straight to his Panasonic TV). \n\nFirst off, Should this be possible?\n\nI could start the movie on the iPad and select cast and pick the Chromecast HD but all that happened was the TV switched to the chromecast and it started its copy of the Netflix app and asked me to sign in. Totally not what I was trying to do. \n\nSame thing happened picking the Panasonic TV as the target. Obviously I don’t want to sign in my account on someone elses device, and that’s not the way casting works for, say, Amazon Prime Video. \n\nSo is this not a thing? Is the casting only to an existing logged in Netflix account?\n\n(Edit: just adding I tried netflix support chat and they had me verifying the chromecast was on the same network, despite me telling them Amazon Prime streamed fine. Then trying to tell me how to log in. Seemed more like an AI chatbot so I gave up)",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j2fnvy/casting_question/"
    },
    {
        "id": "1j2998w",
        "author": "Inspired_Owl",
        "title": "The Girl in the Picture",
        "content": "It’s my theory that she fell pregnant when her father was prostituting her. I think Floyd might have fathered the first child, that was supposedly put up for adoption. But I think the other two were results of paid sex. I don’t believe Floyd would have given her enough freedom to do anything other than his exact bidding ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2998w/the_girl_in_the_picture/"
    },
    {
        "id": "1j15v5s",
        "author": "ellissabain",
        "title": "Gabby Petito’s parents have revealed what happened to the van",
        "content": "",
        "upvotes": 1291,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1j15v5s/gabby_petitos_parents_have_revealed_what_happened/"
    },
    {
        "id": "1j26df8",
        "author": "MOJOBWA",
        "title": "Lip sync issues",
        "content": "I know this isn’t new but numerous shows and movies have this lip sync issue, but why hasn’t Netflix fixed this issue? I’m thinking certain shows have been redubbed to English I’m guessing. ",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1j26df8/lip_sync_issues/"
    },
    {
        "id": "1j1ykpe",
        "author": "Lola_ry08",
        "title": "Good comedies/sitcoms",
        "content": "I love sitcoms so I’m looking for more similar shows! \nSome I’ve watched so far: \nFriday night dinner \nKim’s convenience \nThe office \nSuperstore \n\nAny similar shows would be great! ",
        "upvotes": 9,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1j1ykpe/good_comediessitcoms/"
    },
    {
        "id": "1j1upda",
        "author": "CharmingPie9424",
        "title": "Question about the trust fund set-up in The Perfect Couple",
        "content": "In The Perfect Couple, the trust fund is set up so that none of the children receive their trusts until the youngest child turns 18. I've never heard of this structure before, so I'm just wondering, is this really a thing? Is it common? Would the trust have really automatically reset because of Merritt's child or could they have legally changed it?",
        "upvotes": 11,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1j1upda/question_about_the_trust_fund_setup_in_the/"
    },
    {
        "id": "1j2adzt",
        "author": "thatbodyartgirl",
        "title": "Running Point",
        "content": "Has anyone else started the new show called Running Point with Kate Hudson? I’m a few episodes in and it is such a snooze fest. I do love Brenda Song in it though. Has anyone binged all 10 episodes and can say whether or not it gets better and is worth watching? ",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1j2adzt/running_point/"
    },
    {
        "id": "1j2lqwr",
        "author": "My3Dogs0916",
        "title": "Disliking Netflix",
        "content": "I’m not really a tv watching person. I much prefer reading. However I enjoy watch murder mysteries.. who dunnit type shows.  The last few I have watched always has same sex male scenes. I am not against same sex couples but I don’t want to see them together either.\nAre there any good shows that don’t have same sex going on?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1j2lqwr/disliking_netflix/"
    },
    {
        "id": "1j1eisa",
        "author": "bvmdavidson",
        "title": "Every show I like gets cancelled",
        "content": "Title. It’s seriously unbelievable how many shows get cancelled after their first season. For me, the first big hit was Marco Polo. So good. It got cancelled on a cliff hanger. Its high production cost was cited. Fine, I guess. \n\n1899- had me hooked in the first few minutes. Cancelled. \n\nArchive 81- 8 episodes. The first one was slow to get through, granted, but by the end it was easily one of my favorite horror/suspense shows. CANCELLED. And it’s certainly not the production costs since very little special effects were used. \n\nThere were more shows that got canceled, obviously, but these were the three that really got to me. Seriously considering cancelling\n Netflix now since all they seem to care about is producing trash. \n\n\n“New on netflix” flair because it’s ironically relevant.",
        "upvotes": 125,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1j1eisa/every_show_i_like_gets_cancelled/"
    },
    {
        "id": "1j1szlf",
        "author": "EthanWilliams_TG",
        "title": "'Suits' Breaks Streaming Records and Earns Big Money for Streaming Services",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j1szlf/suits_breaks_streaming_records_and_earns_big/"
    },
    {
        "id": "1j1ctgk",
        "author": "HowNow101",
        "title": "I Hate Netflix's new visual update",
        "content": "Just switched on Netflix and theres a new visual update in the UK anyway, and I hate it. When scrolling through on TV the images are just too big, I want to be able to see more options on the screen without scrolling right. Is there a way to change back to before this crappy update?",
        "upvotes": 40,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1j1ctgk/i_hate_netflixs_new_visual_update/"
    },
    {
        "id": "1j1sefn",
        "author": "Atlast_2091",
        "title": "Devil May Cry (2025) - Preview",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j1sefn/devil_may_cry_2025_preview/"
    },
    {
        "id": "1j1aw7p",
        "author": "Simple_Beat6344",
        "title": "Don’t Look Up on Netflix",
        "content": "I watched this movie when it was first released and watched again today. I couldve sworn the last dinner scene was gory and showed everyone dying in slow motion. \n\nWas the movie edited or am I getting it confused with something else? ",
        "upvotes": 26,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1j1aw7p/dont_look_up_on_netflix/"
    },
    {
        "id": "1j11xwq",
        "author": "StorthTheElder",
        "title": "Help! Adult content showing on kids profile",
        "content": "How do I fix this? The kids icon is displaying in the bottom-right and the correct profile icon showing, so I'm on the right profile. You can see configuration settings appear to be correct on the second screen. Please help!",
        "upvotes": 87,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1j11xwq/help_adult_content_showing_on_kids_profile/"
    },
    {
        "id": "1j1foz7",
        "author": "fuxandfriends",
        "title": "Is there a way to increase font size?",
        "content": "so I have newly terrible vision and watch netflix through samsung smart tvs. is there a hidden accessibility setting menu to make descriptions and menus a larger font? \n\ni’m so sick of having to look through my phone camera or my phone app to figure out what episode I’m on or even titles of shows. \n\n(this is not a netflix only issue i’m having so any insight is helpful at this point)",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j1foz7/is_there_a_way_to_increase_font_size/"
    },
    {
        "id": "1j1qhyt",
        "author": "Recdave98",
        "title": "Why do some 4k titles stream in 4k but others don’t?",
        "content": "On my 4k Apple TV I can see what it’s playing in by pressing the down button and some 4k available titles always say HD no matter what but when I check another 4k title it says 4k. For example Love is Blind is always in HD but Stranger things 4k. I do have crappy WiFi (I’m getting 22mbps wired due to my area) but still it’s able to handle some titles in 4k but this one show never ? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j1qhyt/why_do_some_4k_titles_stream_in_4k_but_others_dont/"
    },
    {
        "id": "1j1pr1g",
        "author": "KitchenBeneficial302",
        "title": "5 Films from Netflix Animation in 2025",
        "content": "# Five Films from Netflix Animation in 2025\n* In Your Dreams - April 4, 2025\n* The Twits - June 13, 2025\n* Untitled Robert Marianetti, Robert Smigel and David Wachtenheim film - August 22, 2025\n* Untitled Charlie Bean, Paul Briggs and John Ripa film - October 17, 2025\n* Untitled Don Bluth, Gary Goldman and Dexter Fletcher film - December 5, 2025",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j1pr1g/5_films_from_netflix_animation_in_2025/"
    },
    {
        "id": "1j1osz7",
        "author": "Fando92",
        "title": "No HDR on Windows PC?",
        "content": "Hi guys. Around a week ago I upgraded my Netflix plan to Premium with the idea to watch HDR content on my new OLED monitor. The thing is, whatever I do, there is no HDR on my PC with Windows 11 Pro. It is only working on my TV.\n\nI have already contacted Netflix support 3 times with no luck, no one was even close to help. Believe me I have already tried what I could. I installed the HEVC video extensions from the Microsoft store, I have tried with several browsers like Edge, Opera, Firefox and of course Chrome. The weird thing is that it was working on Chrome then it stopped there too and I can't make it work again. There's just no HDR indicator anywhere.\n\nI have disabled and enabled the GPU hardware acceliration several times with no luck. I have enabled forced HDR in Edge and it is still not working. I have Auto HDR enabled on Windows and still doesn't make a difference. I am using HDMI 2.1 cable if that matters with a RX 7900 XT if that matters. I have even tried with DP and it is still not working.\n\nI am using HDR in games and Youtube content all the time so I know it is working, it is not wokring only on Netflix. I have installed the Desktop App too and it is not workinig there too. I have set the playback settings quality to \"High - Best video and audo quality etc\". \n\nSo I was just wondering if there is anything else I could try before downgrading my plan. Any advice would be of help, thanks!",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1j1osz7/no_hdr_on_windows_pc/"
    },
    {
        "id": "1j19elo",
        "author": "backrollerpapertowel",
        "title": "\"Your device isn’t part of the Netflix Household for this account\" while sitting in my house?",
        "content": "I've suddenly started getting the above message when logging in on my PC to Netflix. The thing is, I am part of the household, I'm in my house on the same wifi and everything. it won't allow phones, PCs, nothing to log in without a code now all while in the same house/wifi. everything except the smart tv makes us put in the code every 14 days.  \n\n  \nhow do we fix this? ",
        "upvotes": 12,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1j19elo/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1j1fmba",
        "author": "leffy5",
        "title": "Any recommendation for government coverups or conspiracy shows?",
        "content": "I love stranger things but after watching it 7 or 8 times i want to watch something else. I’m very into government coverup shows so I’m wondering if there are any recccomendations you all have since i can’t seem to find any.",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1j1fmba/any_recommendation_for_government_coverups_or/"
    }
]