[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 486,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hm18t3",
        "author": "AutoModerator",
        "title": "NFL Christmas Gameday Megathread",
        "content": "1:00pm ET - Kansas City Chiefs @ Pittsburg Steelers\n\n4:30pm ET - Baltimore Ravens @ Houston Texans",
        "upvotes": 36,
        "comments": 616,
        "media": null,
        "permalink": "/r/netflix/comments/1hm18t3/nfl_christmas_gameday_megathread/"
    },
    {
        "id": "1hof2qz",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game season 2 is the first show in history to be #1 in 93/93 countries",
        "content": "",
        "upvotes": 681,
        "comments": 134,
        "media": null,
        "permalink": "/r/netflix/comments/1hof2qz/squid_game_season_2_is_the_first_show_in_history/"
    },
    {
        "id": "1homj8d",
        "author": "ashekyux",
        "title": "I didn't expect this message ",
        "content": "",
        "upvotes": 46,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1homj8d/i_didnt_expect_this_message/"
    },
    {
        "id": "1hon4p1",
        "author": "Zeroyhme",
        "title": "More Squid Game Season 1 vs Season 2 Comparisons (Updated)",
        "content": "",
        "upvotes": 13,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hon4p1/more_squid_game_season_1_vs_season_2_comparisons/"
    },
    {
        "id": "1hp0701",
        "author": "VesnaKostic",
        "title": "Something more similar to Who were we running from? ",
        "content": "I need a recommendation for a tv show like Who were we running from? People who live on the run, murders, mystery, thriller as similar as possible to this show I am delighted with it, it is now my favorite series.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hp0701/something_more_similar_to_who_were_we_running_from/"
    },
    {
        "id": "1hozmrp",
        "author": "nope_nope_nope_yep_",
        "title": "Account protection is broken",
        "content": "I have two home internet connections. One with Spectrum for my home, and one with AT&amp;T fiber for my home office.  But with Netflix’s BS account protection it keeps thinking I’m in a different household even though it’s one address. I can even be signed into Netflix from the same network and it will tell me I’m outside my household. \n\nThis is such a flawed system they’ve setup. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hozmrp/account_protection_is_broken/"
    },
    {
        "id": "1hov7yc",
        "author": "SensitiveLimit",
        "title": "Your search for \" [ name of the TV show] \" did not have any matches",
        "content": "Hello everyone, \n\nSince couples days, I've had this technical issue on my Netflix account 'Your search for \\[name of the TV show\\] did not have any matches\". For information I'm using Safari version 18.2 on my MacBook Air M3. \n\nHow can I solve this issue ? \n\nThanks in advance and sorry for my English mistakes ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hov7yc/your_search_for_name_of_the_tv_show_did_not_have/"
    },
    {
        "id": "1howp9z",
        "author": "djst3rios",
        "title": "Netflix account keeps getting hacked after signing in through Microsoft Store's Netflix app",
        "content": "A while ago I texted my brother to send me the netflix credentials so I can login through my PC and watch a show I wanted. A few days later, someone logged in our account from the Philippines. My brother changed the password, used a unique one, and it was safe for a few months. I didn't ask for the new password since I rarely use it, and all was well. Then, few days ago, same story happened. He texted me the password through discord (could be related to discord but I think one time he entered it himself on the PC), I logged in to the app, and today we got a notification that someone from Philippines has logged in our account. Has anyone noticed similar behavior? No other accounts have been compromised, it's only Netflix.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1howp9z/netflix_account_keeps_getting_hacked_after/"
    },
    {
        "id": "1ho0t2y",
        "author": "Robemilak",
        "title": "'Carry-On' Set to Enter Netflix's \"Top 10 of All Time\" Movie List",
        "content": "",
        "upvotes": 232,
        "comments": 157,
        "media": null,
        "permalink": "/r/netflix/comments/1ho0t2y/carryon_set_to_enter_netflixs_top_10_of_all_time/"
    },
    {
        "id": "1houky6",
        "author": "Sheila3134",
        "title": "Question about Netflix? ",
        "content": "Does Netflix even care about their original shows and movies?\n\nI've seen more commercials in the last 3 days for Raw on Netflix then I ever had for a Netflix original in the last 6 months. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1houky6/question_about_netflix/"
    },
    {
        "id": "1hnz9w9",
        "author": "Robemilak",
        "title": "Hwang Dong-hyuk confirms that David Fincher is developing an English-language ‘SQUID GAME’ remake set in America",
        "content": "",
        "upvotes": 232,
        "comments": 167,
        "media": null,
        "permalink": "/r/netflix/comments/1hnz9w9/hwang_donghyuk_confirms_that_david_fincher_is/"
    },
    {
        "id": "1hotgrr",
        "author": "il0v3f0odto0much",
        "title": "Questions about Squid Game S2 (1)",
        "content": "Only got Netflix this year and have never watched S1 before. Since it’s about 7-8 hours long for the whole season, i’m not planning on watching it either way since i’ve already been spoiled from Tiktok in 2021. \n\nWould anyone mind answering these questions for me? \n\n1 .  Why did the salesman killed own his dad when he was working as one of the squid game guards when he was younger? \n\n( I understand he recognised his face during one of the games, but instead of letting him go and accepting his plead etc, why did he choose to kill him?) \n\n2 . What happened to the No-eul’s Daughter? and why was she searching for her? \n\n( No-eul , the girl that was dressed up as the bunny mascot )\n\n3 . What happened to Jun-Ho’s Brother? What happened to him and his wife? \n\n( In-ho ) \n\n\n4 . What happened to Jun-Ho on the “ island “ and How did he get there? \n\n5. what were they talking about saying Gi-Hun should have gotten on the plane? what do they mean?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hotgrr/questions_about_squid_game_s2_1/"
    },
    {
        "id": "1hotcnq",
        "author": "S4v1r1enCh0r4k",
        "title": "Hwang Dong-hyuk says Squid Game season 2 served as a comeback for T.O.P. following his Marijuana Scandal, the director said that it took a lot of guts to portray rapper with drugs problems considering his past",
        "content": "",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hotcnq/hwang_donghyuk_says_squid_game_season_2_served_as/"
    },
    {
        "id": "1hoo407",
        "author": "ItsWillster17",
        "title": "All of my favorite shows are coming to an end next year. 😢😭 Any recommendations on a new series I should get into?",
        "content": "Stranger Things, Cobra Kai, Squid Game and possibly Outer Banks are all coming to an end with their final seasons in 2025. It’s sad because I’ve spent the last few years really being into those. I got into Stranger Things in 2018 and loved it! I got into Outer Banks and Cobra Kai in 2020 and they were both my comfort shows while I was going through a tough time, and Squid Game was a show I discovered in December 2021 through watching Mr. Beast and through my friends who watched it and I have rewatched Squid Game Season 1 at least twice every year since it came out, and I finally watched Season 2 today and Loved that as well! It’s sad because all of the shows I have listed have been shows I’ve been into for years but are now coming to an end. 😓😢😢😓\n\nAnyways, with those shows all coming to an end, does anybody have any other Netflix Originals that are good that I should check out? I’m open to any suggestions. Thank you in advance! 😃😁",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hoo407/all_of_my_favorite_shows_are_coming_to_an_end/"
    },
    {
        "id": "1hosxnl",
        "author": "chikenenen",
        "title": "Monitor switching off while trying to watch netflix",
        "content": "I've been trying to watch squidgame 2 today but it keeps switching my monitor off every few seconds.\n\nI've googled and found it's apparently part of netflix's DRM and people have suggestions, but none of those seem to apply to me. I'm not running a HDMI splitter or video recording software.\n\nI'm running netflix on a dell laptop connected to a dock and a monitor/keyboard/mouse plugged into the dock.\n\nCan anyone help with how to fix this?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hosxnl/monitor_switching_off_while_trying_to_watch/"
    },
    {
        "id": "1hosk6k",
        "author": "DogeManFromMars",
        "title": "Netflix crashing my pc",
        "content": "Every time I paused or closed Netflix it would completely freeze my PC 10 seconds later it's not my browser, graphics or any hardware for that matter it's literally just Netflix website doing that.  Wtf",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hosk6k/netflix_crashing_my_pc/"
    },
    {
        "id": "1hoseo2",
        "author": "Jalapeno023",
        "title": "Triple Six Eight",
        "content": "We just watched this movie and it is really good. Kerry Washington, as usual, did a great job. It made me want to know more about these women and how their hard work helped in WWII. I am glad Tyler Perry made this movie. \n\nLike Hidden Figures, it is a shame that these brave, hardworking, intelligent and dedicated women’s history was kept out of the press. Their contributions to the war efforts in WWII and the Space Race in the 1950s and going forward should be celebrated &amp; honored. Being women and being black made their successes and contributions that much more significant. \n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hoseo2/triple_six_eight/"
    },
    {
        "id": "1hos8h3",
        "author": "Crafty-Bunch-2675",
        "title": "Why did Netflix remove the Download option for Desktop? How does this benefit the customer experience ?",
        "content": "Ok, so I haven't tried using Netflix on my laptop for a few weeks, and surprise surprise...looking to download some Christmas movies to watch at my leisure....only to discover that, the download option is no longer available for desktop, and is only for mobile devices.\n\nLike really? why ??\n\nMobile devices typically have smaller screens than computers. It's a lot more comfortable to watch a movie on the computer.\n\nNot everyone has 24/7 internet connection, the download feature was very good. I don't understand the logic of this decision.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hos8h3/why_did_netflix_remove_the_download_option_for/"
    },
    {
        "id": "1hokv13",
        "author": "Itsme903",
        "title": "Happy shows? ",
        "content": "Ive gotten tired of the “apocalyptic everything going wrong the characters are always in crisis” adult shows. I just need some happy palate cleansers lol \n\nWould love some recs ",
        "upvotes": 5,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1hokv13/happy_shows/"
    },
    {
        "id": "1horfmw",
        "author": "No_Leader1868",
        "title": "Do Netlix games have a precedent on including more supported devices?",
        "content": "Edit: There is a typo in the title, sorry.\n\nHey everyone!\n\nI'm keeping it short. Civilization 6:Netflix has been out for quite some time now. My gf can download it on her iPad 9. I can't do the same on my Samsung S9 FE, because it is incompatible, although the non-Netflix edition works like a charm. Hell, it even works on the first gen iPhone SE.\n\nIs there any news or chance on other devices being included later on?\n\nI have read that you can sideload it, but I won't download random apk-s from websites.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1horfmw/do_netlix_games_have_a_precedent_on_including/"
    },
    {
        "id": "1hofj4t",
        "author": "Thecumbitch69",
        "title": "\"Your device isnt part of the netflix household\" issue",
        "content": "Preface info : So i live with my parents in a small guesthouse on their property which is a small 15sqm guest house. I use the same account as them, and same internet network although i use a wifi extender. \n\nRecently i have been getting issues with the household thing mentioned in title. This came from nowhere. Have been using the same account without issue for years. Each time i start netflix or my parents start netflix i need to verify the account. \n\nAnybody know what to do? As we are literally the same household. Same adress and everything and according to the law where i live, we literally live in the same household. I even have to use their bathroom as i am just living in the guesthouse in their garden which is just a room basically..... \n\nIts getting a tad annoying for both of us having to verify emails every time the other logs in. ",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hofj4t/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1hopjl0",
        "author": "anonymous231722",
        "title": "Must watch Netflix thriller series!! ",
        "content": "I have watched : stranger Things, Money heist, GOT, Sex education, Wednesday. Recently I watched Alice in borderland and pretty much liked it. I watched The OA and loved it but disappointed that it's not having further seasons.Can you all suggest some more good series to watch with adventure, good plot twists and satisfying ending. ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1hopjl0/must_watch_netflix_thriller_series/"
    },
    {
        "id": "1ho7sbj",
        "author": "Heavy_Committee",
        "title": "Why some of the Netflix movies play on low quality ",
        "content": "I paid for the premium plan and have a good internet connection and some movies won't play on 1080p.\n\nMovies like Panic Room, Thanksgiving, Dumb Money etc\n\nOther movies and shows play on 1080p.\n\nDO YOU GUYS KNOW THE SOLUTION? ",
        "upvotes": 10,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1ho7sbj/why_some_of_the_netflix_movies_play_on_low_quality/"
    },
    {
        "id": "1ho0nhl",
        "author": "yogeshroud",
        "title": "Isn't it crazy to think, Netflix earned about $2.07 billion from anime, nearly double Crunchyroll's $1.16 billion.",
        "content": "Despite crunchyroll's dedicated user base, Netflix’s massive subscriber count of 230 million far surpassing Crunchyroll's 15 million gives it a significant advantage.",
        "upvotes": 49,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1ho0nhl/isnt_it_crazy_to_think_netflix_earned_about_207/"
    },
    {
        "id": "1hnjxjj",
        "author": "Robemilak",
        "title": "Netflix execs tell screenwriters to have characters “announce what they’re doing so that viewers who have a program on in the background can follow along”",
        "content": "",
        "upvotes": 544,
        "comments": 152,
        "media": null,
        "permalink": "/r/netflix/comments/1hnjxjj/netflix_execs_tell_screenwriters_to_have/"
    },
    {
        "id": "1hon5va",
        "author": "imthat_chavy",
        "title": "Inglorious basterds ",
        "content": "I believe Netflix is showing a version of the film I haven't previously seen,so far I've noticed at least two scenes removed from the film,,has this happened to other films?\nAre there netflix edits?\nOr is it just my imagination failing me?\nHas anyone else noticed this with other films?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hon5va/inglorious_basterds/"
    },
    {
        "id": "1homywt",
        "author": "ProgTym",
        "title": "Fewer subtitles on TV than on app",
        "content": "Why is it that on the Netflix app and in the computer browser there are more subtitle options (languages)  available than on my Samsung TV's Netflix app? And it seems it's not the case for all shows because I've watched a few with the specific language but some other shows don't have the language on TV but do in the app/browser.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1homywt/fewer_subtitles_on_tv_than_on_app/"
    },
    {
        "id": "1hot1me",
        "author": "strawberrycheescak",
        "title": "Am I the only one that didn’t really enjoy A Man on the Inside? ",
        "content": "I watched it cause so many people said it was amazing but tbh I was kinda disappointed. I felt like I was kinda bored most of the time and certain things could have been done better. Some parts were good and I felt added to the plot well but it wasn’t as good as people were saying. I normally enjoy shows like this but was just disappointed for this one. ",
        "upvotes": 0,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1hot1me/am_i_the_only_one_that_didnt_really_enjoy_a_man/"
    },
    {
        "id": "1hok73z",
        "author": "LordSnuffleFerret",
        "title": "Can't chromecast",
        "content": "So relatively recently, the option to broadcast via Chromecast from my phone (Samsung Galaxy A10s) to a chromecast disappeared.  I've done a little googling and haven't come across anything that helps.\n\nHas anyone encountered this? I can still broadcast Amazon Prime, so I'm not clear what is going wrong.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hok73z/cant_chromecast/"
    },
    {
        "id": "1hok5pm",
        "author": "indiewire",
        "title": "Best Movies of 2024 Streaming on Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hok5pm/best_movies_of_2024_streaming_on_netflix/"
    },
    {
        "id": "1hojd0u",
        "author": "XxLiyahKnowsthingsXx",
        "title": "Anyone else having these issues?",
        "content": "So I have the Netflix app on my ipad &amp; phone and for sometime it allowed me to watch the show I wanted to watch is a corner of the screen while doing something else. Well now I can’t and have no clue how to fix it or if it just changed.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hojd0u/anyone_else_having_these_issues/"
    }
]