[
    {
        "id": "1hun2p2",
        "author": "BunyipPouch",
        "title": "Official Golden Globes 2025 Discussion",
        "content": "Sorry for the delay.\n\n[This is the Official 2025 Golden Globes discussion thread.](https://i.imgur.com/brkn0M2.png)\n\nPlease keep any discussion of the Golden Globes in this thread. Separate threads for winners will be judged based on context, but the winners will be updated in this thread as they happen. I'll only be adding the movies winners and not the television ones. It's starting at 8:00 PM ET on CBS.\n\n* Best Supporting Actress: Zoe Saldana, **Emilia Perez**\n* Best Supporting Actor: Kieran Culkin, **A Real Pain**\n* Best Screenplay: Peter Straughan, **Conclave**\n* Best Non-English Language Film: **Emilia Perez**\n* Best Actress in a Motion Picture Musical or Comedy: Demi Moore, **The Substance**\n* Best Actor in a Motion Picture Musical or Comedy: Sebastian Stan, **A Different Man**\n* Best Animated Film: **Flow**\n* Best Director: Brady Corbet, **The Brutalist**\n* Best Actor in a Motion Picture Drama: Adrien Brody, **The Brutalist**\n* Best Score:  Trent Reznor and Atticus Ross, **Challengers**\n* Best Song:  El Mal, **Emilia Perez**\n* Cinematic Box Office Achievement: **Wicked**\n* Best Picture Musical or Comedy: **Emilia Perez**\n* Best Actress in a Motion Picture Drama: Fernanda Torres, **I'm Still Here**\n* Best Picture Drama: **The Brutalist**\n\nThis thread will have comments sorted by new to keep fresh discussion at the top.",
        "upvotes": 575,
        "comments": 1632,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pXpNxC_K4jTKM_h3hzL1gT6fHlIdXRJbf43X2IC5CoQ.png?auto=webp&amp;s=1ae6647ad745e85e580690f7f91c2bab6ba33e51"
        },
        "permalink": "/r/movies/comments/1hun2p2/official_golden_globes_2025_discussion/"
    },
    {
        "id": "1hruk2x",
        "author": "ICumCoffee",
        "title": "What is the Best Film You Watched from 2024?",
        "content": "Happy New Year! /r/movies. A little bit of fun to start the year. **The way this works is that you post a review of the Best Film you watched from the past year, 2024.**\n\n**Here are some rules:**\n\n1.\t**Check to see if your favorite film from 2024 has been posted already.**\n2.\t**If not, Please post your favorite film released in 2024. \\[Limit to one Film only\\]**\n3.\t**Explain why you enjoyed your film.**\n4.\t**ALWAYS use SPOILER TAGS.**\n5.\t**The Best Films of 2024 will be chosen by UPVOTES. So if your film has been mentioned, upvote that comment and discuss in child comments.**\n6.\t**Someone already commented Dune: Part Two**",
        "upvotes": 651,
        "comments": 1066,
        "media": null,
        "permalink": "/r/movies/comments/1hruk2x/what_is_the_best_film_you_watched_from_2024/"
    },
    {
        "id": "1huq35b",
        "author": "YoureASkyscraper",
        "title": "Demi Moore wins her-ever first major acting award at the Golden Globes for 'The Substance'",
        "content": "",
        "upvotes": 7225,
        "comments": 415,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rRzVxTgBPoVQDcvSD_R9AW7aod85JfIcYp12P79E2vA.jpg?auto=webp&amp;s=14819ee14692a375a2fe0f86075f42eff977743a"
        },
        "permalink": "/r/movies/comments/1huq35b/demi_moore_wins_herever_first_major_acting_award/"
    },
    {
        "id": "1hupv13",
        "author": "YoureASkyscraper",
        "title": "Trent Reznor and Atticus Ross win Best Original Score at Golden Globes 2025 for Challengers",
        "content": "",
        "upvotes": 2348,
        "comments": 142,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8q0k7neozicciQsCsph8eQ2pHk0aiDBq6LDd9oK67Mo.jpg?auto=webp&amp;s=42c27fe2fc204191e09d695955cdd2d5fd734522"
        },
        "permalink": "/r/movies/comments/1hupv13/trent_reznor_and_atticus_ross_win_best_original/"
    },
    {
        "id": "1huw09g",
        "author": "ConcernedHumanDroid",
        "title": "Actors doing biopics overwhelmingly get praise and awards. What were the times they didn't? ",
        "content": "Posting this after seeing Timothee Chalamet getting praise for his Bob Dylan performance. But in general I've noticed time after time actors making easy dunks by doing biopics. Why is that? \n\nWhy do they get it so easy? \n\nA lot of times, they're not even mimicking the person they're impersonating. I can think of Jesse Eisenberg as Mark Zuckerberg. Mark definitely never speaks that fast. \n\nI have enjoyed many of these biopic performances though. Notable ones for me are:\n\nMeryl Streep as Margaret Thatcher\nForest Whitaker as Idi Amin\nChristian Bale as Bob Dylan \n\nBut I am interested in knowing what biopics had actors who did a terrible job? \n\nFor me the worst one is Ashton Kutcher as Steve Jobs. One of the worst things I've ever seen. \nWhat are our worst top 5 biopic performances? \n\n",
        "upvotes": 620,
        "comments": 585,
        "media": null,
        "permalink": "/r/movies/comments/1huw09g/actors_doing_biopics_overwhelmingly_get_praise/"
    },
    {
        "id": "1hura3z",
        "author": "PrimeTimeJobber",
        "title": "Fernanda Torres Wins Golden Globe 25 Years After Her Mom Was Nominated in Same Category",
        "content": "",
        "upvotes": 1074,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cfUDBrdvvKQUR7xSagezz0XddX8sWXDSDDxxOEZ8pV0.jpg?auto=webp&amp;s=27fb3722d11397016487d3aebf4e73f82f1ff96f"
        },
        "permalink": "/r/movies/comments/1hura3z/fernanda_torres_wins_golden_globe_25_years_after/"
    },
    {
        "id": "1hv31bc",
        "author": "BunyipPouch",
        "title": "First Poster for Action-Thriller 'Fight or Flight' - Starring Josh Hartnett - A mercenary takes on the job of tracking down a target on a plane but must protect her when they're surrounded by people trying to kill both of them.",
        "content": "",
        "upvotes": 120,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nerhburehebe1.jpeg?auto=webp&amp;s=8b0bfab1370fd434e73b808adddde3d220192e84"
        },
        "permalink": "/r/movies/comments/1hv31bc/first_poster_for_actionthriller_fight_or_flight/"
    },
    {
        "id": "1huqfvu",
        "author": "DemiFiendRSA",
        "title": "2025 Golden Globe Winners (Full List): 'The Brutalist' &amp; 'Emilia Pérez' Win Best Picture Awards",
        "content": "",
        "upvotes": 1029,
        "comments": 391,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CkaLs9yeFwkhI0JQPU9uYrnWdfM98IT9lIenrAWCC0c.jpg?auto=webp&amp;s=5e8aadd50cce194cda66ec0f2884a020942bd6f3"
        },
        "permalink": "/r/movies/comments/1huqfvu/2025_golden_globe_winners_full_list_the_brutalist/"
    },
    {
        "id": "1huqehy",
        "author": "outremer_empire",
        "title": "The climatic fight in Rob Roy was touted by Siskel &amp; Ebert as the best sword fight in motion picture history. Does it still hold up? ",
        "content": "",
        "upvotes": 535,
        "comments": 208,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5cWUpOtR2VYVxhfFSWU-NUgg3Uc7staddH_d7IcRD2I.jpg?auto=webp&amp;s=9acb44380b4f5e6c0492433eee574e46869e307a"
        },
        "permalink": "/r/movies/comments/1huqehy/the_climatic_fight_in_rob_roy_was_touted_by/"
    },
    {
        "id": "1huxu08",
        "author": "Tolkien-Faithful",
        "title": "Bring Back the Campy But Somehow Awesome 90s Action Movie",
        "content": "Bring back Bruce Willis and friends walking slo mo to the shuttle and Nicholas Cage fighting through a plane full of convicts with a bullet in his arm and being thrown through the air in front of an explosion for three movies in a row and a Diane Warren song over the credits that plays every 20 minutes on the radio for the next four months.\n\nI don't know how a movie could have a plot so stupid and characters so dumb yet could make you tear up when Harry says goodbye to Gracie or Cameron meets Casey for the first time. Will we ever see the like again? \n\nhttps://preview.redd.it/s33alz6o8dbe1.png?width=462&amp;format=png&amp;auto=webp&amp;s=dbdbdf1102c465e875e45f02e482215c0cb98ab1\n\n",
        "upvotes": 105,
        "comments": 73,
        "media": null,
        "permalink": "/r/movies/comments/1huxu08/bring_back_the_campy_but_somehow_awesome_90s/"
    },
    {
        "id": "1hv15la",
        "author": "BunyipPouch",
        "title": "Cinemark to Offers BYOB (Bring Your Own Popcorn Bucket) to Celebrate National Cinema Day on Sunday January 19 - For $5, guests will be allowed to bring their own containers to fill up on popcorn (up to 3.5 gallons).",
        "content": "",
        "upvotes": 38,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/768hxr41VaBgr3HH9lm0UMf7C1ZZ4_T0-p7j0TCUnQc.jpg?auto=webp&amp;s=4f223f2b63596e61c29018001367f5591641d491"
        },
        "permalink": "/r/movies/comments/1hv15la/cinemark_to_offers_byob_bring_your_own_popcorn/"
    },
    {
        "id": "1huahnf",
        "author": "JiskiLathiUskiBhains",
        "title": "I watched 3:10 to Yuma and damn it is good.",
        "content": "** The 2007 one. **\n\nWhat I didnt like:\n\nIts a 2 hour movie that doesnt get interesting until 55 minutes have passed. And that is a solid commitment for a casual watcher to make.\n\n\nWhat I liked: \n\nAfter minute 55, the movie is friggin rivetting. I didnt want to stop it to get up to pee. \n\nThe acting is excellent. And I mean excellent. There was one point where I teared up a little. And another where I chuckled along with the characters just because it was just a good moment. The character building and relationship building is top notch.\n\nEven the small characters do well. If you dont watch westerns you forget that &gt;!anyone can die. and goodamn it characters drop like flies in this film.!&lt;  And that really sells a story to me.\n\nRussel Crowe. You forget how good of an actor he is.\n\nMusings: \n\n\nI fell asleep watching this movie back when it came out and I just kinda forgot about it. I've heard many people say its a good movie so its been on my list for a long time. Just took me around 18 years to get around to watching it. Oddly enough, I fell asleep watching it this time too. So I watched the rest of the movie today. And I'm happy to have watched it. I'm already excited to watch it again. \n\nThe good part is things makes sense at the end. There were a few things that bothered me after I watched it so I read up the reddit posts about the movie and that cleared it up for me. I watched the scenes redditors talked about and I found that, yeah, it all adds up. In a convincing way. \n\nIf you liked this movie, I will recommend you watch Appaloosa, if you havent already.",
        "upvotes": 1381,
        "comments": 256,
        "media": null,
        "permalink": "/r/movies/comments/1huahnf/i_watched_310_to_yuma_and_damn_it_is_good/"
    },
    {
        "id": "1hui3a7",
        "author": "AgeOfFakeness",
        "title": "'Harold and Maude' had Cat Stevens music, and 'The Graduate' had Simon &amp; Garfunkel music...",
        "content": "Can you think of other examples of cinema that showcased specific musicians in the film? Sergio Leone had Ennio Morricone score many of his films, and The Who showcased themselves in Tommy, but I'm searching for films that showcase a singular artist/bands music that already existed before the film was made. ",
        "upvotes": 487,
        "comments": 860,
        "media": null,
        "permalink": "/r/movies/comments/1hui3a7/harold_and_maude_had_cat_stevens_music_and_the/"
    },
    {
        "id": "1hujg0p",
        "author": "branwithaplan",
        "title": "Physical comedy is often instantly associated with cheap humor, not because it’s inherently cheap, but because it’s significantly more difficult to create intelligent and subtle humor with Physical Comedy.",
        "content": "This scene from *Young Frankenstein (1974)* is a perfect example of why I think physical comedy is at its best when it’s subtle, clever, and nuanced. What elevates the comedy of this scene into something much more intelligent is not the physicality itself, it’s the way the characters interact with their environment and each other in a perfectly choreographed way. The humor comes from the precision and restraint, not just chaos. That’s what makes it so brilliant. \n\nWhat are some other examples of physical comedy in film that are smart and creative, rather than cheap or overly slapstick? I’d love to hear about moments where physical comedy added depth to the humor instead of just relying on surface-level laughs.\n\n\nAnd just to be clear, I don’t think people believe it’s just lowbrow humor, but it does seem like slapstick or cheap gags are often the first things that come to mind when you hear the term “physical comedy.” Things like pratfalls, exaggerated movements, or over-the-top antics dominate the perception, and there’s a very good reason why. \n\nIt’s because it’s far easier to make cheap humor from physical comedy because it relies on immediate and exaggerated visual cues that require very little thought to elicit laughter. That’s the reason why 95% of the time, this is how we see Physical Comedy predominantly being used in film. Unfortunately, because of this, the term “Physical Comedy” has become somewhat synonymous with lowbrow humor. \n\n\n",
        "upvotes": 399,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Mhe5PgdKGBls8YX0xy-z__rUN0e_lDxem2pOkzhixNw.jpg?auto=webp&amp;s=0a54273dd847a81c261bb49188dcc2c400261ec7"
        },
        "permalink": "/r/movies/comments/1hujg0p/physical_comedy_is_often_instantly_associated/"
    },
    {
        "id": "1hv272q",
        "author": "Jackieirish",
        "title": "What made Die Hard (1988) so good in my opinion",
        "content": "Context:\n\nI was in my mid-teens when I saw Die Hard, for the first time, in the theaters. A natural film-lover, I was still pretty young and naive when it came to how movies go and could fall completely into the moment of films without cynically \"knowing\" how films work to create the audience experience. Nevertheless, I was a pretty astute kid and could spot bullshit a lot of the time when I saw it.\n\nSeeing Die Hard in the theater was probably the first time I had ever wondered if the protagonist in an action film might not make it out alive. I'd seen Star Wars, Raiders, Terminator, etc. And while all of those other films were thrilling, I never had the sense that the main good guy would fail/die. It didn't really matter because they were still fun to watch. But it wasn't until Die Hard that I actually wasn't able to assume John McClane was just going to make it no matter what.\n\nSpecifically, the scene where he digs a massive piece of glass out of his foot –showing his physical vulnerability, followed immediately with the conversation with Al [here](https://www.youtube.com/watch?v=bYkXeqVQXdk), I suddenly realized that he could conceivably be killed by the end. To be sure, I never questioned that the bad guys would not prevail, but would there be a heroic sacrifice? An inevitable decision he couldn't escape? Everything was on the table after that scene.\n\nThere haven't been many films I can say that about since then. Don't know if it's because I've gotten too jaded, know too much about how the movie business works, gotten better at picking up on clues in films or any kind of combination of factors. But I'll always cherish that memory of sitting in that theater as a teenager completely wrapped up in the moment of not knowing how it would turn out.\n\nPost note: Before anyone chimes in with \"how could you have ever questioned whether he would survive or not?!\" A. As I said, I was a teenager who didn't necessarily know that the heroes almost never die in action movies, B. Sometimes the hero actually *does* die in adventure movies (e.g. Charlton Heston and James Franciscus in \"Beneath the Planet of the Apes, which I had seen previous to Die Hard), C. Bruce Willis was still looking for his big cinematic break to get him out of TV, so there was no guarantee his character couldn't be killed –he just wasn't that kind of movie star at that point.",
        "upvotes": 15,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/J_HnDnaYxzxnOY9JgyyVgCO_2pBJMY5Eisp9ERPsqYo.jpg?auto=webp&amp;s=4c225386d8433f73dbd0585476617e97e7993937"
        },
        "permalink": "/r/movies/comments/1hv272q/what_made_die_hard_1988_so_good_in_my_opinion/"
    },
    {
        "id": "1hu8076",
        "author": "Amaruq93",
        "title": "Aardman Animations maintains its stop-motion ideal of a cozy &amp; simpler England",
        "content": "",
        "upvotes": 1555,
        "comments": 50,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-zJ8p-KianwvvRoNH5xwCR_9zks_Yy7IWwwn48QuIvk.jpg?auto=webp&amp;s=39be801e49abfe0a6650e79d887298c2d4326687"
        },
        "permalink": "/r/movies/comments/1hu8076/aardman_animations_maintains_its_stopmotion_ideal/"
    },
    {
        "id": "1hv3oma",
        "author": "Apprehensive_Fly9352",
        "title": "How Feathers McGraw Became Cinema’s Most Terrifying Villain",
        "content": "",
        "upvotes": 10,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GIcKv_gLGpuaPq6aL6Gf4bANAILRE4N0nn3bh9Ybd4c.jpg?auto=webp&amp;s=f746cbf4c19829e15331496c7e3b303893af7cd3"
        },
        "permalink": "/r/movies/comments/1hv3oma/how_feathers_mcgraw_became_cinemas_most/"
    },
    {
        "id": "1huj8t3",
        "author": "DanGleenutz",
        "title": "\"Field of Dreams\" is absolutely ridiculous... but it's pure magic nonetheless ",
        "content": "Just watched *Field of Dreams* and as completely absurd as the film is, I couldn't help but enjoy it. It has that same sentimental magic that you get from Christmas classics like *It's a Wonderful Life*. It's sappy and at times, it's outright stupid, but it makes me wonder when it was that I myself stopped believing in magic. Being a Sunday afternoon and all, I can't help but feel that the Monday blues will be in full swing tomorrow as I clock in to sit in front of a computer for 8 hours while somewhere out there, the ghost of Ray Liotta plays baseball.\n\nOn a side note, it feels like an extended episode of the Twilight Zone or some other anthology series that doesn't concern itself with the rigid truths of the real world. It's very much an exercise of imagination. A \"what if?\" type story. I don't think they make enough of those these days.\n\nAnywho, time to watch *Waterworld.* It can't be as bad as they say, right?",
        "upvotes": 251,
        "comments": 174,
        "media": null,
        "permalink": "/r/movies/comments/1huj8t3/field_of_dreams_is_absolutely_ridiculous_but_its/"
    },
    {
        "id": "1hucm4s",
        "author": "BunyipPouch",
        "title": "Supermodel And Actress Dayle Haddon Dies at 76 In Suspected Carbon Monoxide Poisoning Accident - She Starred in The World’s Greatest Athlete (1973), Cheaters (1975), Madame Claude (1977), North Dallas Forty (1979), Desert Chase (1986), Cyborg (1989) and Bullets Over Broadway (1994).",
        "content": "",
        "upvotes": 551,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4zSp5qiLDgUQnhTL7XpZp886W__uKE-ezjfeO0kjPeA.jpg?auto=webp&amp;s=a57190efacba862e51ee064950d6cf484560d4c9"
        },
        "permalink": "/r/movies/comments/1hucm4s/supermodel_and_actress_dayle_haddon_dies_at_76_in/"
    },
    {
        "id": "1huen7f",
        "author": "Dinierto",
        "title": "Total Recall (1990)- Wait what's the deal with the reactor?",
        "content": "I've seen this a million times but last night I watched it and I had new questions I never thought to ask.  Googling didn't really bring up a good answer either, which makes me wonder if there is an official answer for the film adaptation.\n\nBasically... what's the deal with the terraforming reactor?  Mainly I have two questions:\n\n1. Why didn't the Martians turn it on?  It clearly seems to work perfectly and EXTREMELY quickly, so what, did they die off the second they finished it?  Unless it's some sort of a setup for humans, i.e. 2001 monolith kind of thing (as someone asked years ago and is apparently what might be in the original story?) this seems crazy\n\n2. Why would the Martians need Mars terraformed?  Presumably they evolved there and their bodies would be used to that atmosphere/environment.  Even if they came there from another planet what are the odds they would want to Terraform Mars to an atmosphere that humans could breathe?  Coincidence?\n\nI think the only logical explanation is that they somehow for whatever reason designed and left it for humans to find once they reached the point where they could colonize Mars, but that still brings up the question of what happened to the Martians.\n\nBTW this movie still kicks ass and holds up, and also it's some of the craziest most efficient story telling in all of cinema.  There's like 5 seasons of a TV show you could milk out of this today and they just cram it into a 2 hour balls-to-the-wall action feast that somehow seems coherent despite having some wacky twists and mind bending concepts.",
        "upvotes": 314,
        "comments": 184,
        "media": null,
        "permalink": "/r/movies/comments/1huen7f/total_recall_1990_wait_whats_the_deal_with_the/"
    },
    {
        "id": "1htq8om",
        "author": "AlwaysBi",
        "title": "Perry, the donkey who served as the Donkey model for Shrek, has passed away at the age of 30.",
        "content": "",
        "upvotes": 27572,
        "comments": 418,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j7TlbrfnfYHYqohIJLAWmQgSlF5S0kA30hmyAD6h8yg.jpg?auto=webp&amp;s=147f388f38c8a79ad35cecad15ba001bf8a5ae29"
        },
        "permalink": "/r/movies/comments/1htq8om/perry_the_donkey_who_served_as_the_donkey_model/"
    },
    {
        "id": "1hv3i95",
        "author": "KillerCroc1234567",
        "title": "Oscar-Nominated Cinematographer Roger Pratt (“The End of the Affair”) Dies at 77",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vM-c7fgOAE2V1oQ6hdco0mbRZqbi9OVmzn6U0uEgx-U.jpg?auto=webp&amp;s=71d075373681715717249be3c0338369670bdd74"
        },
        "permalink": "/r/movies/comments/1hv3i95/oscarnominated_cinematographer_roger_pratt_the/"
    },
    {
        "id": "1hv1bru",
        "author": "pm9000dk",
        "title": "Space opera with three \"nations\"?",
        "content": "I am looking for a movie or mini series, which i partly saw as a child. It must have been between 1985-1995, but the movie looked at least pre-nineties.  It had some sort of space theme and was about three civilizations battling each other. Each nation had a distinct colour out of red, yellow and blue, and I believe that they had distinct ly different spacecraft as well. I remember the colour grading to be quite vivid. The reds, yellows and blues really popped.\nAny suggestions?",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1hv1bru/space_opera_with_three_nations/"
    },
    {
        "id": "1hv41am",
        "author": "Old_Session5449",
        "title": "Best examples of the retired badass coming back into the game?",
        "content": "I think the best example I've seen so far is the first John Wick. There was something special about the movie, wherein all the major bad guys (except for the brat kid) well and truly knew how fucked they were once they heard the name John Wick. There was no question that he was capable of single handedly bringing down their empire, which was alluded to be extremely powerful. The mob boss started grieving for his son before his death, that's how inevitable he felt it was. It also helps that the action was absolutely world class, the mechanisms of the underworld were just alluded to, rather than being explicitly spelt out, and John's past was a mystery to us.",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1hv41am/best_examples_of_the_retired_badass_coming_back/"
    },
    {
        "id": "1hueki3",
        "author": "PassionCertain8405",
        "title": "Jumpscares in non horror movies",
        "content": "Which non-horror movies do you remember having a jumpscare that made you jump?\n\nUpon rewatches, are there any movies where you know the jump is coming yet it still gets you every time?\n\nExamples:\n\nThat body in the Batman costume hitting the window in The Dark Knight got me and everybody else in the theater good when it happened.\n\nAlso, when Daniel Craig is on the hill in The Girl with the Dragon Tattoo and he gets shot at.\n\nFellowship of the Ring -- in Rivendell, when Bilbo gives Frodo the Mithril shirt and sees the Ring hanging around his neck, and goes all psycho goblin on him for a split-second.\n\nAlso, when the fireworks start right after Bilbo and Gandalf are smoking at the beginning.",
        "upvotes": 132,
        "comments": 160,
        "media": null,
        "permalink": "/r/movies/comments/1hueki3/jumpscares_in_non_horror_movies/"
    },
    {
        "id": "1hub1rw",
        "author": "gunslanger21",
        "title": "Gwen Van Dam Dead: Character Actress for 70 Years Was 96",
        "content": "",
        "upvotes": 193,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XH1OhwAjAiSmVAbf0RHA35c5qexoYM3kBO3f55XDbtc.jpg?auto=webp&amp;s=f3d63ee8dae0307d25340ce46862e3bebd3555de"
        },
        "permalink": "/r/movies/comments/1hub1rw/gwen_van_dam_dead_character_actress_for_70_years/"
    },
    {
        "id": "1hux5tw",
        "author": "Alternative_Bid_360",
        "title": "Any movies with a feel of nostalgia/wanting for better days?",
        "content": "I’m a screenwriter looking for some inspiration, and I’m in the mood for movies that really hit that nostalgic or melancholic vibe. Think *Eternal Sunshine of the Spotless Mind*, *Before Sunset*, or even *About Time*.\n\nI’m talking about films that make you feel something—whether it’s bittersweet moments, beautiful cinematography, or those glimpses of old love and life that stick with you. Bonus points if it has great dialogue or a unique way of telling the story.",
        "upvotes": 3,
        "comments": 26,
        "media": null,
        "permalink": "/r/movies/comments/1hux5tw/any_movies_with_a_feel_of_nostalgiawanting_for/"
    },
    {
        "id": "1hukkqf",
        "author": "pilot-wings135",
        "title": "One Flew Over The Cuckoos Nest",
        "content": "One of my favorite films. A professor once had us write a paper explaining whether or not McMurphy was indeed crazy or just a man with a temper. Of course providing facts backing up your opinion .\n\nPersonally I believe he had some sort of disorder due to a possible bad upbringing.  What are your thoughts?",
        "upvotes": 25,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1hukkqf/one_flew_over_the_cuckoos_nest/"
    },
    {
        "id": "1hv41a9",
        "author": "Old_Session5449",
        "title": "Best examples of the retired badass coming back into the game?",
        "content": "I think the best example I've seen so far is the first John Wick. There was something special about the movie, wherein all the major bad guys (except for the brat kid) well and truly knew how fucked they were once they heard the name John Wick. There was no question that he was capable of single handedly bringing down their empire, which was alluded to be extremely powerful. The mob boss started grieving for his son before his death, that's how inevitable he felt it was. It also helps that the action was absolutely world class, the mechanisms of the underworld were just alluded to, rather than being explicitly spelt out, and John's past was a mystery to us.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1hv41a9/best_examples_of_the_retired_badass_coming_back/"
    },
    {
        "id": "1huaf3k",
        "author": "Dirk_Dingham",
        "title": "Movie recommendations for a snowstorm?",
        "content": "The snow is coming down pretty hard and i’d like to be able to watch a movie before my power inevitably goes out. I’m looking for something that kind of fits the atmosphere of The Thing. I usually always watch that movie during a snowstorm but i watched it a few weeks ago so i’m kinda burnt out on it rn and want to find something with a similar vibe",
        "upvotes": 83,
        "comments": 232,
        "media": null,
        "permalink": "/r/movies/comments/1huaf3k/movie_recommendations_for_a_snowstorm/"
    },
    {
        "id": "1husi44",
        "author": "JeffersonSmithIII",
        "title": "The Deliverance by Lee Daniels ",
        "content": "I thoroughly enjoyed it from start to finish, the tropes, the lines, the camp, hated that they worked in McDonalds placement, and that’s about it. \n\nIt was like a black version of the Exorcist, with some Stigmata and Amityville horror thrown in. \n\nGlenn Close delivering some lines I thought I’d never hear her say. The score was great, the acting was phenomenal even from the non main characters, like the nurse at the desk, “I’m not fuckin going back in there” and gives the side eye. \n\nI don’t know that I’ve seen one of his movies before but I’m going to have to check them out. ",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1husi44/the_deliverance_by_lee_daniels/"
    },
    {
        "id": "1hu9mqt",
        "author": "CrazyFinnishdude",
        "title": "What are some of your favorite \"Best [A Well-Known Director] Movie, not made by [A Well-Known Director]\" Movies?",
        "content": "Or more clearly, what are some of your favorite cases, where a movie (whenever through style, tone and/or certain tropes) feels like it was made by a certain filmmaker, but actually wasn't?\n\nFor me, *Death Becomes Her* is the best Tim Burton movie, not made by Tim Burton. It has certain \"cartoonishly macabre\" tone to it and \"the snobbish high society is dumb\" social commentary, both of which are pretty typical in Burton's movies. It helps that the movie to this day stands-out from the rest of Zemeckis' filmography, which is more known for fun adventures and grounded dramas, so it never comes to my mind first, when thinking about his movies.",
        "upvotes": 63,
        "comments": 190,
        "media": null,
        "permalink": "/r/movies/comments/1hu9mqt/what_are_some_of_your_favorite_best_a_wellknown/"
    }
]