[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 471,
        "comments": 249,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gpas31",
        "author": "Kamala_lost",
        "title": "Enough Mark Wahlberg!",
        "content": "He plays the same character in every movie! He's not that charasmatic and in my opinion can't carry a movie alone. He's fine in something like The Departed. He must have one hell of an agent - he is the star in half the movies on Netflix. \n\nAlso, Chris Pratt is not a good voice actor. I wanted to watch the new Garfield movie but can't tolerate his voice acting. \n\nBoth Wahlberg and Pratt are better off in ensemble casts - they're not interesting enough on their own.  ",
        "upvotes": 512,
        "comments": 137,
        "media": null,
        "permalink": "/r/netflix/comments/1gpas31/enough_mark_wahlberg/"
    },
    {
        "id": "1gpqr6c",
        "author": "AffectionateBit5872",
        "title": "Why is every new show 6 eps?",
        "content": "The diplomat is my favorite show on Netflix and it's 6 ep run was way to short compared to it's 8 ep first season which also felt to short. As well as the excellent new show Territory was only 6 eps. I was also looking ahead and 2 shows I'm insanely excited for Black Doves and American Primevil are also going to be only 6 eps. It's insane that every few years it feels like they push the ep count lower. Which is extra crazy because they count shows on minutes watched which basically sets new shows up to fail and is the reason we have no new shows.",
        "upvotes": 14,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1gpqr6c/why_is_every_new_show_6_eps/"
    },
    {
        "id": "1gpl3gt",
        "author": "KimScotte",
        "title": "Any good horror series on Netflix? Looking for something scary!",
        "content": "Hey everyone! I’m in the mood for some seriously scary and thrilling web series to binge on Netflix. I’m into a mix of supernatural, psychological, and even gory horror—basically anything with a strong story and plenty of chills. If you've got any recommendations that will keep me up at night, I’d love to hear them!",
        "upvotes": 7,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1gpl3gt/any_good_horror_series_on_netflix_looking_for/"
    },
    {
        "id": "1gptul5",
        "author": "disdkatster",
        "title": "Who is responsible for recommendations on Netflix?",
        "content": "I have more shows show up on my recommendations that I have down voted that ones I have upvoted. It isn't just recommendations though. They have a sorting of \"Because you liked....\" and do the same thing. I sometimes wonder if they are trying to justify bad shows they have put on the site by pushing people to watch them. Honestly Netflix, when I say I don't like it I really meant I don't like it. I will bend over backwards to not do a thumbs down on a show. Do others notice this or am I just too difficult to profile?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1gptul5/who_is_responsible_for_recommendations_on_netflix/"
    },
    {
        "id": "1gpnyzp",
        "author": "Simple-Ceasar",
        "title": "How can a non Netflix user see a list of currently available movies and series on Netflix in Spain?",
        "content": "Hi,\n\nI had Netflix before. I live in Spain.\n\nBefore i first subscribed to Netflix I saw a list of available movies on Netflix. When i took Netflix i saw that a good amount of those movies were not available on Netflix in Spain.\n\nI don't have Netflix anymore but I am thinking about subscribing again.\n\nThe ones found on Google just show a general list. Therefore is there a list that shows specifically what available in Netflix Spain? \n\n\nThank you.\n",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1gpnyzp/how_can_a_non_netflix_user_see_a_list_of/"
    },
    {
        "id": "1gp72oi",
        "author": "OriginalSammy",
        "title": "Windows lagging?",
        "content": "Just a quick question \nIs anyone elses netflix lagging and not showing the controls on the web ?\n\nIt was working fine yesterday for me and now it isn’t. I have tried restarting the laptop and a different browser. \n\nIts fine on the app and tv. \n\nEdit:\n It’s the next day for me and so far it is fixed.\nThank you all for sharing and relieving the stress of one another :)",
        "upvotes": 65,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1gp72oi/windows_lagging/"
    },
    {
        "id": "1gpme55",
        "author": "MovieGuyTravis",
        "title": "New Trailer for Carry-On with Taron Egerton and Jason Bateman",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gpme55/new_trailer_for_carryon_with_taron_egerton_and/"
    },
    {
        "id": "1gptucb",
        "author": "Great_Eye701",
        "title": "Tyson vs Jake paul",
        "content": "Hi, I'm in the UK and the fight won't be on until 4am here. I have to work the next day so don't really want to get up that early but want to watch the fight. Does anyone know if it will be available to watch a replay after the event? And if so from when will it be available?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gptucb/tyson_vs_jake_paul/"
    },
    {
        "id": "1gp75y3",
        "author": "RamblesTheGent",
        "title": "No Netflix interface when watching on PC?",
        "content": "As said in the title, what happened to the interface (show timer and progress bar, pause, etc)?\n\nI guess I have to ramble on for the 150 word requirement.\n\nI really hope this is not a recent change made to Netflix because it is impossible to watch if you have to get up and do things mid-show. Only way I can get it to pause is my refreshing the page or closing down the tab. ",
        "upvotes": 40,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1gp75y3/no_netflix_interface_when_watching_on_pc/"
    },
    {
        "id": "1gprho1",
        "author": "mte87",
        "title": "Netflix account gets hacked a few times",
        "content": "This time they changed the email address and phone number on the account so I can’t reset the password. It still charged my card so I cancelled my card right now. \n\nI can’t get a hold of someone because I technically don’t have an account. \n\nWill someone be able to get back into it in the future?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gprho1/netflix_account_gets_hacked_a_few_times/"
    },
    {
        "id": "1gpqxmh",
        "author": "Doc-Brown1911",
        "title": "New TV app? ",
        "content": "So yeah, went to turn on some music and everything is not the same. \n\n\nIt doesn't find anything I'm looking for. It's on my phone but not on the TV. \n\nTrying to find the history but I'll be damned if I can find it. Anybody know where it's at?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gpqxmh/new_tv_app/"
    },
    {
        "id": "1gpqdlm",
        "author": "Sea-Note-2858",
        "title": "Outer Banks season 4 ",
        "content": "Does anybody know why they keep making some scenes in episodes blue? Like we don’t know if it’s dark or day because the whole scene turns blue. Example, the scene when JJ and his dad is on the boat with those dangerous ppl and John came to rescue him. That whole scene was blue and it hurt my eyes to watch. It’s other scenes that change as well",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gpqdlm/outer_banks_season_4/"
    },
    {
        "id": "1gp7n93",
        "author": "Substantial-Song-242",
        "title": "Netflix broken?",
        "content": "So, I'm assuming netflix is broken for everyone atm? \n\nCan't see episode progress, can't pause, cant rewind, fast forward, can't do anything, usually episodes also just freeze after 1 second of playing......",
        "upvotes": 23,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1gp7n93/netflix_broken/"
    },
    {
        "id": "1gph1hg",
        "author": "Glittering_Stuff_996",
        "title": "give me some horror movie recommendations!!!",
        "content": "i want some good horror movies to watch on here, ive watched incantation and i found it so good!! any other recommendations are fine i dont mind slasher, or paranormal just anything would be helpful!!!",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1gph1hg/give_me_some_horror_movie_recommendations/"
    },
    {
        "id": "1gpsf60",
        "author": "MeringueSea3729",
        "title": "i need a banging series",
        "content": "i recently watched breaking bad and it was fucking amazing, i was so hooked. its sadly over now and i need a new one, could u guys maybe recommend smth? maybe smth similar like breaking bad?",
        "upvotes": 0,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1gpsf60/i_need_a_banging_series/"
    },
    {
        "id": "1gpikuo",
        "author": "YourMamasMemeDealer",
        "title": "Everything is in german",
        "content": "I moved to the Netherlands recently and now when I when I want to watch an anime It doesn't even give me an option of English subtitles, only German ones. Is there a way to fix this without using a vpn? I have already checked that my preferred languages are correct.\n\nEdit: It works for some but it only shows German ones for jujutsu kaisen.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gpikuo/everything_is_in_german/"
    },
    {
        "id": "1gp7jbn",
        "author": "slickdeuceman123",
        "title": "Netflix stops playing after a split second.",
        "content": "Hey everyone, I'm running into a problem where I load up Netflix in the browser (of my PC). I play something, and it then immediately stops playing after a couple of frames and a split second of audio. There are none of the options, like the playback scroll bar at the bottom, the full screen icon, nothing. I thought this might be an issue with the browser, so I cleared the cache for just Netflix, cleared the cache for the whole browser, restarted my PC, closed the browser and opened it again, closed the tab and opened it again, and still nothing. I downloaded the Netflix windows app, and I have the exact same problem.\n\nI'm just wondering if anybody has any idea what I can do, because as far as the evidence goes, I don't think it's a problem with my machine.",
        "upvotes": 13,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1gp7jbn/netflix_stops_playing_after_a_split_second/"
    },
    {
        "id": "1gp79vn",
        "author": "Sensitive-Cherry-792",
        "title": "I keep getting the “Not apart of this household” error message when I am in the household?",
        "content": "This is getting ridiculous. I live in the same house as my dad (who owns the netflix account) and my TV is connected to the same wifi. Every time he updates the household to allow my TV it works for a short period of time, like a few hours, then it prompts me with the same error “not apart of the household” message. Does anyone know how to resolve this? ",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gp79vn/i_keep_getting_the_not_apart_of_this_household/"
    },
    {
        "id": "1gpe6gt",
        "author": "CarmenWilde1",
        "title": "Error message won't go away even after allowing sites to play protected content",
        "content": "https://preview.redd.it/unoj4bn6ve0e1.png?width=1262&amp;format=png&amp;auto=webp&amp;s=da2f6509089f0315bf8b1db8685b5de1489bd2b3\n\nAnyone have any advice? This has been an issue for a while. I've already followed the troubleshooting instructions Netflix gives you and still nothing. It works fine on Microsoft Edge, but Teleparty doesn't work on that.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gpe6gt/error_message_wont_go_away_even_after_allowing/"
    },
    {
        "id": "1gopvga",
        "author": "Still_Boat_233",
        "title": "Arcane Season 2 Smashes Netflix Charts &amp; Becomes Most Popular Show in Over 60 Countries",
        "content": "",
        "upvotes": 90,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gopvga/arcane_season_2_smashes_netflix_charts_becomes/"
    }
]