[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1ocjm2a",
        "author": "WillingAd2160",
        "title": "Primi tentativi di street con la mia X-t5 con 35 mm… cosa ve ne pare? Consigli e opinioni?",
        "content": "",
        "upvotes": 32,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ocjm2a/primi_tentativi_di_street_con_la_mia_xt5_con_35/"
    },
    {
        "id": "1od19he",
        "author": "AsenaPC888",
        "title": "Qualcuno conosce un parrucchiere donna economico a Torino?",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1od19he/qualcuno_conosce_un_parrucchiere_donna_economico/"
    },
    {
        "id": "1ocnjpl",
        "author": "Few_Willingness_5198",
        "title": "Invasione di zanzare",
        "content": "Appartamento all'ottavo piano ma non ultimo, vicino al centro. \nMai avuto grossi problemi di zanzare a parte quest'anno. Se la vita è rilassante ci pensa lei a sistemare le cose con le cose più assurde.\nChe so... Pipistrelli sul balcone, allagamenti dal vicino di sopra, lavori sfondamuri sul pianerottolo, l'importante è che non si stia mai sereni. Infatti, quest'anno c'è un invasione di zanzare senza precedenti, meno male che abbiamo le racchette anti zanzare. Solo questa settimana ne abbiamo ammazzate 40. Quaranta dentro casa. E la settimana precedente non era da molto meno. Le maledette entrano da fuori, nessuna pozza visibile, non ho piante esterne, da dove vengono? L'unica cosa che so è che si ingnegnano, trovano nuovi posti per nascondersi, non stanno più sui muri visibili ma si cammuffano. Avranno letto un libro su tattiche militari probabilmente. \nDormire non è più concesso, il ronzio nelle orecchie non è sopportabile mentre lancio un allarme di INVASIONE ZANZARE!! ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ocnjpl/invasione_di_zanzare/"
    },
    {
        "id": "1ociynf",
        "author": "0rk4n",
        "title": "Conoscete altri eventi a tema informatica e formazione simili al Red Hat Summit?",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ociynf/conoscete_altri_eventi_a_tema_informatica_e/"
    },
    {
        "id": "1ocele9",
        "author": "Longjumping_Deal_592",
        "title": "Realtà lavorative settore IT a Torino",
        "content": "Buonasera,\nvorrei trasferirmi in Piemonte, magari vicino Torino, nel prossimo futuro, per stare più vicino ai miei cari. Quindi sto cercando lavoro lì. \nA vostro avviso, quali sono le aziende migliori nel settore IT di Torino o in generale del Piemonte a cui potrei fare domanda? \nNon ho chissà quale esperienza lavorativa:\n- 5 anni come sviluppatore Front-End\n- 1 anno come sviluppatore Back-End\n- Laurea Magistrale in Informatica\nNon pretendo chissà quale stipendio, quanto basta per poter vivere nonostante un affitto.\nUtilizzo diversi portali del lavoro, ma credo che un parere di chi ha vissuto un'esperienza diretta di lavoro in Piemonte possa essere illuminante. Grazie in anticipo\n\n",
        "upvotes": 9,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1ocele9/realtà_lavorative_settore_it_a_torino/"
    },
    {
        "id": "1ocgfjf",
        "author": "PanettoneFannullone",
        "title": "Cosa fareste al posto di Anastasio, il pizzaiolo di Torino che aprì un \"Crazy Pizza\" 25 anni fa?",
        "content": "",
        "upvotes": 4,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/stlfx05o4hwf1.jpeg?auto=webp&amp;s=3708286d5e926c5433d5cc24889348619b3e1355"
        },
        "permalink": "/r/torino/comments/1ocgfjf/cosa_fareste_al_posto_di_anastasio_il_pizzaiolo/"
    },
    {
        "id": "1oclr1m",
        "author": "PresentationLess6537",
        "title": "Orange via san Paolo",
        "content": "Ciao\nVorrei iscrivermi alla orange di via san Paolo e vorrei delle informazioni: ci si riesce ad allenare oppure è impossibile?\n\nPosso fare l’abbonamento al mese senza sottoscrivere robe per cui pago un anno e posso bloccare il mese e recuperare perché é sempre un anno. Io vorrei fare un mese e man mano decido senza vincoli \n\ngrazie ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oclr1m/orange_via_san_paolo/"
    },
    {
        "id": "1ocjyl9",
        "author": "Zveiner",
        "title": "Quanto posso esplorare l'aeroporto senza biglietto?",
        "content": "Devo fare delle foto promozionali per un passaporto (finto) che produciamo con il Patreon del progetto per cui lavoro. Qualcuno familiare con l'aereoporto sa se si possono vedere gli aerei/le lobby/ qualcosa di interessante anche senza biglietto, o si è limitati all'ingresso?\n \nGrazie",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ocjyl9/quanto_posso_esplorare_laeroporto_senza_biglietto/"
    },
    {
        "id": "1oc9qjv",
        "author": "LocalRaviolo",
        "title": "Biciclettaro economico cercasi",
        "content": "Ciao! \nDovrei far mettere a posto una vecchia bici (cambio ruote e check freni) ma non vorrei perderci un rene. \nZona centro/cenisia/san Donato/cit Turin ma consigliatene pure da altre parti :) Grazie! ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1oc9qjv/biciclettaro_economico_cercasi/"
    },
    {
        "id": "1oc9gsw",
        "author": "RedditFlint",
        "title": "Judo in Torino",
        "content": "Dear Torinesi,\nI will be in your city for half a year as part of an internship in my studies.\nI wanted to ask if there are judo classes for students/erasmus at the university. I only found classes for kids. :D \nI am 24 and have done judo now for around 3/4 of a year. I am a yellow belt. I trained twice a week at my club here in germany.\nOther than the university classes, any recommendations are very welcome.\nThank you so much!\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oc9gsw/judo_in_torino/"
    },
    {
        "id": "1obt81m",
        "author": "Cao_Vy",
        "title": "cerco aziende per stage",
        "content": "salve a tutti, sono uno studente che sta frequentando l'its ict corso web developer e sono al secondo anno. Al secondo anno è obbligatorio un periodo di stage e come studenti possiamo proporre delle aziende all'its. Scrivo su questo sub per chiedere se conoscete aziende disposte ad assumere per uno stage in ambito di ux/ui design in collaborazione con l'its",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1obt81m/cerco_aziende_per_stage/"
    },
    {
        "id": "1obnc67",
        "author": "Least-Gear330",
        "title": "Letture condivise",
        "content": "Ciao!\nSono un ragazzo di (circa) Torino di 22 anni che ha la lettura per passione principale, (perlopiù classici, perlopiù francesi). Purtroppo non conosco nessuno che condivida questa passione, e mi chiedevo se qui ci fosse qualcuno interessato a fare una sorta di lettura condivisa, magari trovandosi una volta ogni tanto per scambiarsi opinioni, osservazioni, ecc. su quel che si è letto (o, perché no, anche su altro: attualità, altre arti, fare amicizia insomma).\nAnche per ragioni di studio, leggerò prossimamente la Porta stretta di André Gide, chissà che qualcuno non sia interessato :)",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1obnc67/letture_condivise/"
    },
    {
        "id": "1obiksz",
        "author": "ImpressionOk8195",
        "title": "See Devfest Alps 2025 at Google Developer Groups GDG Torino",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eEf3MrF2RqAN9zGzqB8x-rnDidy4y1MV2N6bL7nk9zs.png?auto=webp&amp;s=e947f963f509b8ae6505492a197ea8a0078f16a2"
        },
        "permalink": "/r/torino/comments/1obiksz/see_devfest_alps_2025_at_google_developer_groups/"
    },
    {
        "id": "1obcsq1",
        "author": "vongomben",
        "title": "Ristoranti per Bagna Caoda [Autunno 2025 edition]",
        "content": "Amiche e amici, è arrivato quel momento dell’anno in cui dobbiamo proteggerci dal maligno ingerendo grandi quantità di aglio misto ad acciughe miste a verdure di varie dimensioni e forma.\n\nIo farò almeno una bagna caoda a casa, ma volevo chiedervi consigli per ristoranti che la facessero buona, sono tentato di provarla in giro e anche amici mi hanno chiesto consiglio. \n\nAttendo i vostri preziosi consigli! ",
        "upvotes": 13,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1obcsq1/ristoranti_per_bagna_caoda_autunno_2025_edition/"
    },
    {
        "id": "1obm4et",
        "author": "spilled_almondmilk",
        "title": "Ci sono aree in cui è possibile accendere falò nei parchi cittadini?",
        "content": "Buona sera! Con l'arrivo dell'autunno mi piacerebbe organizzare con i miei amici una serata in cui stare insieme e possibilmente scaldarci attorno a un falò, raccontando storie, suonando la chitarra e arrostendo marshmallow come nei film 😅 solo che non so se ci siano delle zone in cui è permesso, ho visto qualche volta dei resti di falò in alcuni parchi (ad esempio il parco Colletta) ma non sono sicura che fossero legali e non abusivi.\n\nNon vorrei avere problemi con la legge e correre pericoli, per cui mi piacerebbe sapere se esistano da qualche parte a Torino e dintorni delle aree attrezzate e autorizzate. Avete dei consigli? 🙏🏻",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1obm4et/ci_sono_aree_in_cui_è_possibile_accendere_falò/"
    },
    {
        "id": "1oblx0t",
        "author": "sylvieatica",
        "title": "Palestre a torino",
        "content": "Tra le varie palestre di Torino a portata di metro, quali consigliereste (specificando il prezzo dell'abbonamento annuale/mensile) e quali sono da evitare? Parlo di sale pesi sufficientemente attrezzate e ampie da non doversi mettere in fila per ogni attrezzo, se poi offrono anche corsi specifici (calisthenics, crossfit etc) ben venga ma non è essenziale",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oblx0t/palestre_a_torino/"
    },
    {
        "id": "1obka0d",
        "author": "Holtrws",
        "title": "Ciao a tutti ho una domanda riguardo gli abbonamenti",
        "content": "ho fatto un abbonamento studenti che comprende bus e treno, il fatto é che mi é arrivata a casa la tessera BIP, io ne avrei diritto alla tessera bip peró non la ho richiesta.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1obka0d/ciao_a_tutti_ho_una_domanda_riguardo_gli/"
    },
    {
        "id": "1obcfbq",
        "author": "West-Stand5637",
        "title": "Where to live in Turin?",
        "content": "Hello! I’m attending a program for 7 months along the Po River (near Nizza Millefonte). I’m moving with my wife and two dogs and a cat, and need an apartment big enough for all of us (so student housing wouldn’t work). \n\nI don’t mind a commute, we just want a walkable, safe neighborhood, close enough to grocery and cafe’s. I’ve never been to Turin so having to make accommodations before we move there has been tough! \n\nThanks!!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1obcfbq/where_to_live_in_turin/"
    },
    {
        "id": "1ob0d4c",
        "author": "_L_-",
        "title": "GTT indifendibile",
        "content": "La domenica è totalmente impossibile affidarsi ai mezzi se non ti dai un margine di 1h.",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ob0d4c/gtt_indifendibile/"
    },
    {
        "id": "1ob28ph",
        "author": "NonPinoz",
        "title": "Cerchiamo un batterista",
        "content": "Siamo un gruppo formatosi da poco e siamo disperatamente in cerca di un batterista per completare la formazione. (Più dettagli per chi è interessato, ovviamente)\n\nSo che ci sono altri posti online più adatti dove chiedere, li abbiamo provati tutti. Piuttosto mi chiedo se qualcuno qui sa quali sarebbero dei luogi reali dove trovare/mettere annunci fisici.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ob28ph/cerchiamo_un_batterista/"
    },
    {
        "id": "1oa808k",
        "author": "melkijades",
        "title": "Do people in Turin have zero spatial awareness or is it just me😅",
        "content": "I’ve been living in Turin for a while now and noticed something kind of funny (and sometimes annoying). I swear I’m not trying to trash talk Italians (love the people here!!) but has anyone else noticed how *spatial awareness* seems to be… optional? 😅\n\nLike on small sidewalks for example... I often see groups of friends walk side by side and rarely move an inch to let someone coming the other way pass. You basically have to step onto the street to get by or stand there until they pass you by.\n\nToday I was walking in the city center near the shops, and I saw two people stopping to greet each other at right at the narrowest part of a sidewalk under construction... literally the worst spot possible... and they stopped there to greet each other like long-lost cousins, completely oblivious to the angry crowd piling up on both sides...\n\nAnd in bars it’s the same story. This morning a guy with a big backpack ordered his coffee, got it, and just stood *right there* at the counter drinking it exactly where the barista serves people instead of moving at least 1m to the right so that the next person could order/pay.\n\nIs it just me, or have others noticed this too?",
        "upvotes": 211,
        "comments": 103,
        "media": null,
        "permalink": "/r/torino/comments/1oa808k/do_people_in_turin_have_zero_spatial_awareness_or/"
    },
    {
        "id": "1oaw52p",
        "author": "bottomwin",
        "title": "Parco della Pellerina",
        "content": "Ciao, pensavo di andare al parco della Pellerina con un amico la prossima settimana e volevo chiedere se ci fosse qualcosa di vicino da fare o visitare (abbiamo 22 e 24 anni). Pensavo di passare là la mattinata e poi magari fare un pranzo al sacco dato che ci dovrebbe essere l'area picnic, e dopo fare qualcosa nel pomeriggio. Già da Porta Susa, viaggiando con i mezzi, ci impiegheremmo una mezz'oretta per arrivare al parco e non vorrei allontanarmi troppo, massimo altri 15 minuti di bus/tram. Sapete quindi consigliarmi qualche posto là vicino dove si può fare o visitare qualcosa? Non necessariamente musei, andrebbe bene anche qualcosa di semplice come un libreria, un negozietto di musica o una parte carina della città dove farsi un giretto tranquillo. Andremmo in mezzo alla settimana.",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1oaw52p/parco_della_pellerina/"
    },
    {
        "id": "1oavzop",
        "author": "Marameos",
        "title": "Qualità della vita per expats",
        "content": "Ciao! Sto considerando di trasferirmi a Torino con mia moglie, Olandese. Attualmente viviamo a Monaco di Baviera, ma ho ricevuto un'ottima proposta in zona e sarei propenso ad accettare.\nMia moglie non parla, ancora, italiano e abbiamo una bambina di 9mesi. Come trovate la vita per una famiglia internazionale intorno ai 37/40 anni? Ci sono \"comunità\" di expat di quell'età o solo studenti?",
        "upvotes": 4,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1oavzop/qualità_della_vita_per_expats/"
    },
    {
        "id": "1oakwn6",
        "author": "TemporaryIceCream",
        "title": "Should I go to Oktoberfest at Parco della pellerina?",
        "content": "I'm interested in going since it seems really cool, but I mostly speak english and have no one to go with. From other travellers/locals experience is it something worth going to even if you're alone?",
        "upvotes": 14,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1oakwn6/should_i_go_to_oktoberfest_at_parco_della/"
    },
    {
        "id": "1oa12x1",
        "author": "RoutineCherry3027",
        "title": "techno on the streets of torino",
        "content": "made some cool pics of people, anyways now the question, what is this party about and until what time will it be? i wanna go back, i had to go home unfortunately cause my phone was empty.",
        "upvotes": 187,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1oa12x1/techno_on_the_streets_of_torino/"
    },
    {
        "id": "1oaofwk",
        "author": "Fair-Panda8233",
        "title": "making friends",
        "content": "hello everyone ive just recently moved to torino from rome and im looking to make friends here since its kinda boring not knowing anyone im 19 if anyone wants to hangout message me!!",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1oaofwk/making_friends/"
    },
    {
        "id": "1oam769",
        "author": "Loose_Biscotti9075",
        "title": "Maratona di Torino",
        "content": "Correrò la maratona di Torino questo novembre, esperienze su come è l’atmosfera e come sono le stazioni di ristoro?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oam769/maratona_di_torino/"
    },
    {
        "id": "1oak02p",
        "author": "sleeping__late",
        "title": "Dog sitters!",
        "content": "Ciao, I am hoping to find a lovely local dog sitter in Torino for this upcoming week. If you have any recommendations please message me, grazie mille!",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1oak02p/dog_sitters/"
    }
]