[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 105,
        "comments": 326,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mnu8dy",
        "author": "L0v3_1s_War",
        "title": "HUNTR/X’S ‘GOLDEN’ from ‘KPOP Demon Hunters’ Hits No. 1 on Billboard Hot 100",
        "content": "",
        "upvotes": 109,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1mnu8dy/huntrxs_golden_from_kpop_demon_hunters_hits_no_1/"
    },
    {
        "id": "1mo9fkx",
        "author": "YisusButAtWhatCost",
        "title": "So i finally start Dexter..",
        "content": "After seeing most of the show through Youtube Shorts for at least a year, i finally open netflix and start seeing it, even if i saw most major spoilers, i still find myself entertained watching it, can’t comprehend how didn’t notice this show back years… still, is worth it",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mo9fkx/so_i_finally_start_dexter/"
    },
    {
        "id": "1mo9akg",
        "author": "Beautiful_Belt4306",
        "title": "Odd sound issues",
        "content": "Netflix makes sound when you click on an account, the boot up sound if you will. But, once you click on a show, nothing. I've tried closing the app via the \"Get Help\" button, also changed off the HDR selection in hopes of that changing it. I'm using the RCA Smart TV app, no third-party speakers. Every other app plays sounds perfectly. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mo9akg/odd_sound_issues/"
    },
    {
        "id": "1moc090",
        "author": "Disastrous_Bedroom60",
        "title": "Finding a series",
        "content": "Hi everyone (delete if not allowed ) I remember watching a series on netflix maybe as far back as 2015. It was a series about food and why certain food became famous in certain places. For example the first 2 episodes consisted of NY and how the water became integral to the rise in falafels (i think) and the next episode was how a girl rescued the original sourdough mix during the san Francisco fire. It also gave a brief history on how the cities originated. I've tried everything, even going back through my viewing history with no luck. I'm beggining to think I've imagined this ! Any help would be appreciated",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1moc090/finding_a_series/"
    },
    {
        "id": "1mnp3fl",
        "author": "sirius_2025",
        "title": "Wednesday first episode puppy review",
        "content": "Netflix owes my 5 month old puppy an apology for being so scary! It should come with a puppy rating 😅 He was on edge every time he heard a bird for the rest of the episode ",
        "upvotes": 24,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/y9i08tbufgif1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mnp3fl/wednesday_first_episode_puppy_review/"
    },
    {
        "id": "1mob6ki",
        "author": "Capable_Transition97",
        "title": "Help me find a show",
        "content": "All I remember about it is the character dynamics so the main character is a blonde boy who uses a sword he also has a master that turns into a monster in like the later half of the first season the main heroine is a girl with brown hair who uses magic and also start to date one of the main villains that turned good he also killed the girls master  so now it’s this low triangle between the mc main heroine and bad guy it had a second season that ended on a cliffhanger with them entering a new realm also pretty sure the bad guy uses a ice sword or some sorta ice power ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mob6ki/help_me_find_a_show/"
    },
    {
        "id": "1mo8r2e",
        "author": "Mattyman2004mom",
        "title": "Good netflix movies",
        "content": "I cant seem to find good movies on netflix, i find a lot of good movies but they are only on apps like hbo max and others. The movies can also be on disney+ anybody know?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mo8r2e/good_netflix_movies/"
    },
    {
        "id": "1mo3m6o",
        "author": "ShinyRockAid",
        "title": "Restaurant War Thailand",
        "content": "I’m really loving this show A LOT. I hope it will be popular like the Culinary Class Wars. Anyway, asking it because I haven’t seen any blogs or lists on the internet, so I’d like to know the locations of the contestants’ food stalls/restaurants I would really love to visit them as soon as I get back in Thailand. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mo3m6o/restaurant_war_thailand/"
    },
    {
        "id": "1mo5o62",
        "author": "riosunset",
        "title": "New on Netflix",
        "content": "Just finished Department Q which I loved and binged in 2 days. Any recommendations for anything similar / new? \nI seem to be stuck in limbo of everything I like beibgbin mid season break / end of season\nThe rookie. 911. Greys anatomy. Criminal minds. \nFinished station 19 recently and sad it’s over. ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mo5o62/new_on_netflix/"
    },
    {
        "id": "1mo1yc6",
        "author": "p1ssc0nsum3r",
        "title": "help finding a good show",
        "content": "hello everyone:)\ni have been looking for shows to watch, ive been watching a lot of movies recently. i have a hard time finding shows i truly enjoy, because truthfully i am kind of picky😭 the shows i can think of that i really really enjoyed were Lost, the 100(except the last season of these shows got sorta weird and i didnt finish either), money heist, the end of the f'ing world, and shameless. netflix does have bangers, you sometimes just have to dig if you kind of have a certain preference. the movies i enjoy are like The electric state, Choose or die, Antiviral (with caleb landry jones), Bug (with ashley judd), Its whats inside, The florida project, The butterfly effect, and i also enjoyed Spree and We need to talk about Kevin. i know some of those arent on netflix, but just to give everyone an idea. a lot of psychological shows/movies. i often have a  difficult time finding a show on netflix that will make me want to binge like i did the 100❤️. if anyone else also likes these kinds of shows/movies help a sister out and lmk what u have been watching because im soo bored and need something",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mo1yc6/help_finding_a_good_show/"
    },
    {
        "id": "1mo0n1n",
        "author": "ImoutoCompAlex",
        "title": "I see very few people discussing the upcoming Japanese show, Final Draft on Netflix so I created a subreddit for it: r/FinalDraft",
        "content": "If you're a fan of Physical 100 or Culinary Class Wars, Japan decided to make their own Athletic competition show featuring 25 Athletes engaged in a series of Physical challenges for a cash prize, similar to Korea's Physical 100.\n\nI see very few people talking about this show so I made a subreddit for it: r/FinalDraft. We're putting up discussion threads in a few hours when the show airs. Come discuss it with us!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mo0n1n/i_see_very_few_people_discussing_the_upcoming/"
    },
    {
        "id": "1mnoet8",
        "author": "Timely-Hovercraft-76",
        "title": "I’m thinking of watching rebel ridge tonight. Has anyone watched it and is jt good?",
        "content": "Thinking of watching Rebel Ridge tonight. The trailer caught my attention. I’m not expecting AAA quality, just hoping it’s at least fun. Is it worth it? ",
        "upvotes": 12,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1mnoet8/im_thinking_of_watching_rebel_ridge_tonight_has/"
    },
    {
        "id": "1mnwtla",
        "author": "UnicornVoodooDoll",
        "title": "The Residence: the blink and the note SOLVED",
        "content": "MAJOR SPOILERS for the end of The Residence!\n\nI think I figured out the issue with Lilly's blink and the note! I looked a bit to see if anyone else has already explained this but didn't see anyone so if I'm just super unobservant I apologize.\n\nThe problem we all have is that Cupp claimed that knowing about the note in the jacket pocket identified the killer, because only the killer could have known it was there prior to the discovery/investigation. Lilly claimed to have seen Bruce put the note in Wynter's jacket, which Cupp would find later.\n\nThe problem is that anyone could have told her the note was found in his jacket, and in her version of events she \"knew\" it was there because she \"saw\" Bruce put it there. Lilly could absolutely know the location of the note in her version of events, making the fact that she had the location of it not a gotcha at all.\n\nSo what was Cupp getting at when she said that detail identified her as the killer?\n\nIn order to understand this, we have to do what Cupp taught us to do earlier in the season - establish context.\n\nThe Lilly reveal and the investigative hearing are intercut with one another. What is happening in the hearing is giving us context for Cupp's frame of mind during the reveal.\n\nThe biggest thing she emphasized to the committee was all about context and possibility. She had to entertain the idea that Elsyie and Bruce and Doumbe were ALL innocent. That there was a fourth person.  She needed to consider this option, and she did.\n\nBefore Lilly's \"blink\" Cupp jumped up on the table and announced that the existence of the door meant that anyone in the room could have done the crime. THIS was her flashing her wings.\n\nShe then made a point of saying \"If I'm wrong (about none of the most likely guilty three being involved), one [points to Bruce] of [points to Elsyie] you [points to Doumbe] definitely did it.\" This is her establishing that she was operating under the assumption that the three of them were NOT involved. She was entertaining the possibility that the three were already ruled out.\n\nIf she was wrong about ruling them out and flashing her wings and no one blinked, it was safe to put the three back in the running as the killer. But if she was right and the flash revealed someone else...\n\nSo if Bruce, Elsyie, and Doumbe were not involved at all, HOW did the note get in the jacket?\n\nLilly admitted to being in possession of the note right up to Wynter's death. The note needed to go from her possession into Wynter's jacket. Either Wynter put it there himself or the murderer put it there, but no other person was in possession of the note between Lilly tearing it out and it being placed in Wynter's jacket.\n\nKnowing, not WHERE the note was, but the sheer fact that the note DID return to Wynter, was what gave her away, because only the killer could have known (not WHERE it was, but) HOW he got the note back after Lilly tore it out.\n\nIn Lilly's story, the note goes from her to Wynter via Bruce, making Bruce the last known possessor of the note. Without Bruce - and again, this was the CONTEXT Cupp was operating under at the time - there is no one in possession of the note between Lilly tearing it out when he was alive, and it being discovered in his jacket when he was dead. Lilly's own admissions give us no reason to believe otherwise.\n\nSo if the three - and Bruce in particular - weren't there for the murder, the only way the note gets from Lilly to Wynter is if she gave it to him at the time of the crime. If she had given him the note earlier and not been connected to that period of time, she would have had no reason whatsoever not to share that fact, as it distanced her from the crime. But she herself admits having it up until his death. This is how, if Bruce, Elsyie and Doumbe were not there, Lilly's the only possible suspect.\n\nAnd here's a huge piece of the puzzle: WHY did Lilly tear a page out of Wynter's journal? What possible scenario could allow this detail to happen? Why would Wynter's journal be in her presence, much less the target of her anger?\n\nI think it's because of Wynter's records. I believe that Wynter showed her the journal when he threatened to expose her, and Lilly, realizing that the journal was his record of her crimes, tried to take it from him, but he wrestled it away from her and she only tore out a scrap.\n\nIf Lilly had just said nothing about the note, she could have gotten away with it. If she'd not given such a specific detail, she could claim that, for example, she left it at his desk, or lost it, or even not tell anyone she tore it out in the first place.\n\nTelling Cupp she had the note up until his death was one detail too many, and in the CONTEXT of the other three NOT being in the room, identified her as the only possible killer.\n\nSo when Lilly was the only one to \"blink\" at the flash of Cupp's wings, in conjunction with the fact that she alone had the note she herself tore out of Wynter's journal, along with her overwhelming motive, she made any other culprit impossible.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mnwtla/the_residence_the_blink_and_the_note_solved/"
    },
    {
        "id": "1mnvn0t",
        "author": "notofuspeed",
        "title": "Subtitles suddenly huge size, no changes to browser and was watching same series earlier in the day. Anyone experience this? How to fix?",
        "content": "Subtitles suddenly huge size, no changes to browser and was watching same series earlier in the day. Anyone experience this? How to fix?\n\nI tried deleting cache and different browsers, so seems to be Netflix server side related.",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mnvn0t/subtitles_suddenly_huge_size_no_changes_to/"
    },
    {
        "id": "1mo00t0",
        "author": "Murdoc427",
        "title": "14 day sign out so annoying",
        "content": "I get netflix through my phone plan, but because im in the navy on deployment I have to constantly ask to be temporary family member because its based off home wifi. So annoying",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mo00t0/14_day_sign_out_so_annoying/"
    },
    {
        "id": "1mo7dq9",
        "author": "LucyLovesApples",
        "title": "Netflix movies",
        "content": "One time Netflix was good for making movies but with the recent disasters like Happy Glimour 2 and My Oxford Year, I was think that they’ve given up and is spending more money and focus on TV series and sports events which have upped their game?\nI think it’s a shame Netflix has given up on making new movies so easily ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mo7dq9/netflix_movies/"
    },
    {
        "id": "1mntg5l",
        "author": "Wise-Smile-1965",
        "title": "Blindspot Binge, 3rd rewatch, answer to the finale",
        "content": "Sorry for this in depth response, but as you can see I was a fan of this show and I’ve been coming on here lately because it came back to the forefront. I have always thought that Jane lived in the end and always believed the ultimate clue was in her final words, “I’m good.” The reason I’m posting this after 5 years is because when it was on TV and I watched the finale, there wasn’t much buzz around it because of COVID and everything going on in the country during that summer, which obviously, and rightly, had people’s attention and focus. \n\nThen it came back to the forefront through Netflix about a month ago and all I’m seeing is how she definitely died, which was not the case. This is for a number of reasons. My first point is that basically it would mean the whole central theme of the show and character arc of Jane, Roman’s sacrifice and ultimate realization that Weller was the key to Jane’s living on due to his ability to ground and surround her with happiness and positive meaning, which he (as her brother) never could, was all for not. To dive a little deeper, the point of Jane’s character is redemption and proving good can be found in evil and eventually turn complete evil into complete goodness. With that being the central theme, you don’t have redemption if you ultimately fail at your mission and die. I get some will argue self sacrifice as the ultimate show of love and care for others, but that’s not what Jane was, she was a survivor and a fighter. Her ultimately dying would be the antithesis of her characters whole persona. \n\nMoving on to my next point, a secondary theme that comes up in one of the tattoo cases is Remi and Roman are an ode to Remus and Romulus, the ill fated siblings, one who died and one who went on to found one of the greatest empires to exist on this planet. In this case the roles were reversed obviously, Remi was the Romulus, the survivor who achieved what both sought too, but only one could. In her case it was a life of “boredom”, but happiness with Weller, hence the finale’s title “Iunne Ennui”, which is the word ennui backwards and forwards, and is an ode to Remi and Roman (Remus and Romulus) switching fates.\n\nThis title also alludes to Jane’s character, again in that it is the word written backwards first and then correctly second. It suggests she entered (first appearance) Time Square with her character’s morale compass being completely non-existent, but a life full of excitement and left it (finale) with her morale compass being overly high, with a life of boredom in front of her. This is demonstrated and emphasized by Time Square being empty during the cut away scene with just the body bag in the middle. This is done to illustrate the emptiness is gone and happiness and belonging is what she is a part of, which is what the dinner scene is all about. \n\nYou also must consider that EVERYONE of those characters at the table is alive, not died like with the hallucinations and they have even grown since the events in Time Square and found some semblance of happiness in there own (now boring) lives. Everyone says it is too perfect of an ending when in actuality it is just life, think of drifting apart from friends and then coming together one time a year or every couple years. Do you commiserate over how your life isn’t what you wanted it to be or do you remember the good times you had and how you grew and had awesome experiences together? (If the answer is you commiserate over depressing stuff then you’re definitely doing it wrong). \n\nLastly and most importantly are her final words. The “I’m good” response is to Roman’s overall questions of, “Can we be good, can we be forgiving and forgive ourselves for our past sins and can we find happiness (or a happy ending)”? This is explicated expressed in the final episode of season three as he lay dying under the tree (episode 3.22), he asks her this directly. It’s truly a very good bit of TV and highlights the central theme and plot of the entire, can evil become good and does a redeemed evil thing deserve happiness in the end? This question ultimately isn’t answered for 2 seasons, and I know the show got outrageous in terms of storyline, but how much of that was a hallucination also? Honestly, I’ve always wondered that and still do after my third rewatch. \n\nAnyways, overall, I know some think it’s “open to interpretation”, but people never mention that in the same interview where Gero himself said this, he follows that up with, if one analyzes the “authorial intent” of the show in totality and the finale at a macro level, there is a correct answer. To me, if you’re writing a story, this would be the authorial intent of any good author to bring the ultimate closure to plot and central theme. Jane saying “I’m good,” literally means she changed from evil to good, was finally able to let go of her past evils and realized that even if your evil, sometimes you do deserve that second chance and happy ending, which Jane did deserve. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mntg5l/blindspot_binge_3rd_rewatch_answer_to_the_finale/"
    },
    {
        "id": "1mnreli",
        "author": "Pristine-Bar7453",
        "title": "Season 2 Wednesday opinions? No Xavier why?",
        "content": "So I started watching the new Season after watching the first one bc yes I never watched it before. It gives me an immediate comparison and after watching Ep 1 of the new season so far I’m not getting into it at all. Honestly the fact that Xavier is not in it is a huge loss for the show, I googled why he’s not in it and it’s just ridiculous. Nothing has been said officially! I read he has been seeing working the door at some bar …not sure if it’s true. But whatever happened to him getting cancelled so easy. It’s just weird. To me he was a huge part of the series and the storyline between him and Wednesdays in my opinion was the most interesting one! I’ll obviously continue watching just to see if it gets better but I’m actually upset he’s not in it. He was to me the most interesting character, artistically, of all besides Wednesday of course! What do y’all think? ",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1mnreli/season_2_wednesday_opinions_no_xavier_why/"
    },
    {
        "id": "1mnv15o",
        "author": "maxclifford1",
        "title": "netflix just started saying my device is not part of the netflix household...",
        "content": "...even though i'm at home and i've never had this problem before. All the Help is about what to do on your TV, but i just have my laptop so i can't do what it's saying to do. also, it doesn't appear there's any way to access my account now because the landing page is just this \"your device isn't part of the netflix household...\" and no way to get to my Settings from there.\n\nmy ideas on possible solutions include: 1) clear history, cookies, etc, which i did and did not fix problem. 2) wait and see if it magically fixes itself tomorrow. \n\nif anyone knows how to fix this i would appreciate any suggestions! thank you!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mnv15o/netflix_just_started_saying_my_device_is_not_part/"
    },
    {
        "id": "1mnndi0",
        "author": "ThunderDragonSpice",
        "title": "How to get subtitles fixed?",
        "content": "I've run into this problem several times, usually with anime, where the subtitles are WAY off from what the characters are saying. The general meaning is the same, so I'm guessing the subtitles came from the subbed version, and they used different translation for the dub. So, is there any path to getting this fixed? Will customer service be able to do anything? Bc at this point I'll do it myself and send them the transcript if I have to",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mnndi0/how_to_get_subtitles_fixed/"
    },
    {
        "id": "1mnpekp",
        "author": "ToonAdventure",
        "title": "Netflix’s live-action ‘SCOOBY DOO’ series is looking to begin filming this Fall.",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mnpekp/netflixs_liveaction_scooby_doo_series_is_looking/"
    },
    {
        "id": "1mnn4zt",
        "author": "ChemistryMinute9530",
        "title": "I need movie recommendation",
        "content": "Usually I watch movies while eating, can someone recommend movies, no horro please. and I love plot twists or any knew korean movies? not into series today hhahahaha ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mnn4zt/i_need_movie_recommendation/"
    },
    {
        "id": "1mnn488",
        "author": "lol9086-",
        "title": "What’s the best show rn?",
        "content": "I really have no skills about watching series/ tv shows and when I tried to watch something it was so basic (stranger things) it was great ngl but what is the best series or tv shows rn that I could watch? ",
        "upvotes": 2,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1mnn488/whats_the_best_show_rn/"
    },
    {
        "id": "1mnv2zh",
        "author": "Background_Two7677",
        "title": "Pulse… Oof",
        "content": "Yikes…\n\nDon’t know if I can make it through the first episode. There’s so much wrong already. Series opening up with a woman who’s experience sexual harassment? How fucking original. God forbid a woman makes it on her own without sexual trauma. 🙄\n\nThen they make her chief? No hospital or workplace in their right mind would do that. It’s a welcome mat to people thinking she just got the job because of her compliant (which sounds like it cause Dr. Cruz says she’s trying to handle a PR nightmare)\n\nSide note, not only would they not make her chief, wouldnt she be under mandatory therapy or leave as well after something traumatic? Seems like she’s back on the floor the day after filing a huge traumatic complaint. I feel like anyone in a profession like that would have to be psychologically cleared. We already see her having flashbacks of him when she’s trying to treat patients..\n\nAs if that’s not bad enough, the same doctor now admits to permanently putting her sister in a wheelchair from pushing her down the steps. Just seems weird af she continued a normal life after something so major? \n\nHorrible character writing and super unoriginal plot. \n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mnv2zh/pulse_oof/"
    },
    {
        "id": "1mmsveh",
        "author": "Antique-Salad-9249",
        "title": "Love Life. Why is no one talking about the show?",
        "content": "Just came across Love Life, which was released in 2020 and had two seasons. I’ve binge watched both of them and I thought they were both really great. Very realistic in terms of talking about dating lives and emotions and difficulties that arise. I also love that it was shot in NYC where I live. I have never heard of this show before and I’m a pretty picky person, but I thought it was fantastic with the exception of a few unrealistic scenes/occurrences in the series. It also had some really great people in it, namely Anna Kendrick, Jessica Williams, and Ego Nwodim. What are you guys think?",
        "upvotes": 64,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1mmsveh/love_life_why_is_no_one_talking_about_the_show/"
    },
    {
        "id": "1mnfdgw",
        "author": "ToonAdventure",
        "title": "Haunted Hotel | Official Trailer | Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mnfdgw/haunted_hotel_official_trailer_netflix/"
    },
    {
        "id": "1mnjxh7",
        "author": "ClarenceTheClam",
        "title": "Picture-in-Picture for Additional Household?",
        "content": "Hi all,\n\nFor ages now I've been frustrated by not being able to use picture-in-picture mode for Netflix on my phone. It works for all other apps (YouTube etc).\n\nI know that PiP isn't available for ad supported plans. I'm not on one of those, but I do get it as an \"additional household\" of a family member paying the additional fee on the top tier. Does anyone know if this comes with any restrictions on PiP?\n\nIf not, would love any suggestions for troubleshooting! I'm running Netflix on a Xiaomi Redmi Note 12 Pro+ 5G, on HyperOS 2.0.5.0. Picture-in-picture mode is set to on for Netflix and all other relevant settings seem fine.\n\nThank you very much.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mnjxh7/pictureinpicture_for_additional_household/"
    },
    {
        "id": "1mnj5dx",
        "author": "WhatDoYaKnowHuh",
        "title": "A bunch of shows just randomly disapeared for me on netflix UK. Anyone else experiencing this",
        "content": "I was just watching an episode of always sunny in Philadelphia when it came up with an error occured. i check my continue watching and all of my continue watching shows are gone, including always sunny, breaking bad, better call saul, arcane you name it. Anyone know whats going on?\n\nEdit: This only happens on my profile, when i go onto another persons profile everything is back. My age rating settings are set to 18+",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mnj5dx/a_bunch_of_shows_just_randomly_disapeared_for_me/"
    },
    {
        "id": "1mnu0o3",
        "author": "crestroncp3user",
        "title": "Prince Harry, Meghan Markle extend Netflix deal, announce upcoming projects",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mnu0o3/prince_harry_meghan_markle_extend_netflix_deal/"
    },
    {
        "id": "1mn8arb",
        "author": "Celestialey",
        "title": "I finished watching the season 4 of 'Stranger Things' and here are my observations",
        "content": "I just finished the 4th season of 'Stranger Things' and I observed:\n\n\n1. The demogorgon in the Russian prison when released on the captives, is so much extremely fast and powerful, kills most of the men in blink of an eye, but for some reason it goes slowly and easy on Hopper and Enzo, waits for Hopper to lit a fire and then doesn't even go away from fire, just gets very slow. It is shown to easily break the prison walls and structures and create havoc, but was for some reason waiting until now.\n\n\n2. The plan to defeat Vecna didn't seem like a plan. They all knew how fatal is upside down, but they went there casually with a few normal guns and no special weapon, while completely ignoring many scenarios which could happen. They didn't even have a proper serious discussion about the plan and any what-ifs. \n\n\n3. Everywhere these guys went they kept talking loudly and kept arguing, instead of keeping a watch and being careful, looking for any clues. They never cared if something undesired hears them or attacks them. \n\n\n4. Lucas and Max didn't even lock the house from inside or had any plan on what will they do if someone disturbs them when Max goes in trance (they were aware that Jason was on lookout for them all). This situation was not something they could compromise with. (Even though I hate Jason for being there at wrong time)\n\n\n5. It was brutal to watch Max finally getting folded by Vecna.\n\n\n6. I am tired of stupidity from characters like Eddie who had no business jumping back into upside down, when it wasn't even helping anyone. He and Dustin had already distracted the bats for a good amount of time, and just needed to take care of themselves. It was an unnecessary and meaningless loss.\n\n\n7. Found Joyce to be very irritating at certain moments. \n\n\n8. Joyce and Murray casually deciding to attack the pilot Yuri in sky without really caring about how will they survive, and then comfortably getting out of the crash with minor scratches. \n\n\n9. Seeing Hopper alive was such a normal moment for everyone like he just returned from a long vacation. \n\n\n10. After Max final gets unconscious, the gate to upside down gets cracked open throughout the city (atleast) which should completely change everything immediately. But 2 days later we see the headline on TV calling it an earthquake? Everyone in Hawkins including the police ignored the miles long (atleast) giant orange crack which is a portal to another world going through the city for 2 days? Why and how they completely ignored that? Even the kids didn't talk about it. (During the very last of the episode when the snow like particles started raining, we could see some orange gates or cracks spread throughout an area) \n\n",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mn8arb/i_finished_watching_the_season_4_of_stranger/"
    }
]