[
    {
        "id": "1qz65g3",
        "author": "IcefoxX5",
        "title": "[Match Thread] Pontevedra CF - Real Madrid Castilla | Primera Federación, Matchday 23",
        "content": "#FT: PONTEVEDRA 0:0 CASTILLA\n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\nHT - a very intense first half with lots of fouls, yellow cards and rough duels, but not a lot of shots so far - the main difficulty for the teams is probably the pitch, which is more mud than grass, a complicated match in very complicated conditions\n\n46' - 2nd half underway\n\n🔄 54' - Aguado on for Pitarch, Raúl's 5atb is back\n\n62' - spectacular 1v1 leg save by Fran, two good saves by him this half already\n\n🔄 62' - Arnu and Pol Fortuny for Loren and Yáñez\n\n66' - a penalty got reviewed for a handball by Joan, but it gets dismissed as his hand couldn't have been any more tucked in \n\n🔄 82' - Liberto and Leiva come on for Valde and Palacios\n\n⚽ 90' - goal for Pontevedra, it was coming... Corner cleared awkwardly by Cristian David, and Resende fires the rebound under the bar... Castilla's free fall without Arbeloa continues... \n\n❌⚽ 90'+6 - after a very very long revision, the goal is disallowed for passive offside by the player who is right behind Cristian before he clears the ball so badly. If it was offside, it's a correct decision, but they only showed the main camera perspective so it is impossible to tell from that angle\n\nFT - a fight of a football match with 10 yellow cards on a muddy football field comes to an end - Castilla showed good attitude today, but struggle to find the way back to the controlling nature they had under Arbeloa. In the end Fran needed to save the team twice and a lucky and close VAR revision made sure it stays at 0:0. 3 draws and 1 loss under Julian López so far, with this form, Castilla will not be able to finish the season in the playoff spots\n\n&amp;#x200B;\n\n**Kickoff:** 12:00 CET\n\n**Venue:** Estadio Municipal de Pasarón, Pontevedra \n\n**Referee**: \n\n**Competition:** Primera Federación, Grupo 1, Matchday 23\n\n**Viewing options:** \n[LaLiga+](https://www.laligaplus.laliga.com/) (subscription - 14.99€/month) (only available in Spain)\n\n&amp;#x200B;\n\n**Castilla XI** (4-3-3): Fran González - Víctor Valdepeñas ‘Valde’ (82' Liberto Navascués), Mario Rivas, Joan Martínez, Jesús Fortea - Cristian David, Manuel Ángel, Thiago Pitarch (54' Diego Aguado) - César Palacios (82' Álvaro Leiva), Loren Zúñiga (62' Adrián Arnuncio 'Arnu'), Dani Yáñez (62' Pol Fortuny)\n\nBench: Guille Súnico (GK), Lamini Fati, Dani Mesonero, Bruno Iglesias. \n\nUnavailable: David Jiménez (first team call-up), Manu Serrano (injury), Jorge Cestero (first team call-up), Roberto Martín (injury), Hugo de Llanos (injury), Rachad Fettal (injury). \n\nCoach: Julián López de Lerma\n\n&amp;#x200B;\n\n**Castilla last five matches:** WLDLD\n\n**1ª RFEF stats:** 9th | 33pt | 10-3-9 | 29:31\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qz65g3/match_thread_pontevedra_cf_real_madrid_castilla/"
    },
    {
        "id": "1qz318a",
        "author": "scoreboard-app",
        "title": "[Pre-Match Thread] Valencia vs Real Madrid, La Liga Round 23",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1qz318a)",
        "upvotes": 56,
        "comments": 73,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qz318a/prematch_thread_valencia_vs_real_madrid_la_liga/"
    },
    {
        "id": "1qzblis",
        "author": "ManuMora98",
        "title": "Real Madrid W [1] - 0 Espanyol W | Signe Bruun 6' (Athenea assist)",
        "content": "",
        "upvotes": 14,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KB0MoyyPxa03Ca6_rvrxx8vCTRGUqee-YKXuU2M7OUw.jpeg?auto=webp&amp;s=f00dfd0fdb4c426d8651230ddbaf17fb8a255c01"
        },
        "permalink": "/r/realmadrid/comments/1qzblis/real_madrid_w_1_0_espanyol_w_signe_bruun_6/"
    },
    {
        "id": "1qz5ql3",
        "author": "cyrusmancub",
        "title": "Squad list @ Valencia",
        "content": "",
        "upvotes": 20,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qz5ql3/squad_list_valencia/"
    },
    {
        "id": "1qzdlj1",
        "author": "ManuMora98",
        "title": "Real Madrid W [3] - 0 Espanyol W | Sara Holmgaard 60' (Bruun assist)",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Qis6_SAUAcjQEN9Z1jf5spJvBA9NfgxyV8WLDCqhQD4.jpeg?auto=webp&amp;s=2394536b6b550e757f3103e6875a245b0706e58c"
        },
        "permalink": "/r/realmadrid/comments/1qzdlj1/real_madrid_w_3_0_espanyol_w_sara_holmgaard_60/"
    },
    {
        "id": "1qycdcr",
        "author": "o6ohunter",
        "title": "Mbappè not looking too happy during training",
        "content": "",
        "upvotes": 771,
        "comments": 103,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g9n8qp8fe2ig1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qycdcr/mbappè_not_looking_too_happy_during_training/"
    },
    {
        "id": "1qyg1u9",
        "author": "No-Independent2522",
        "title": "[Official] Barcelona hereby announces that today it has formally notified the European Super League Company and the clubs involved of its withdrawal from the European Super League project",
        "content": "",
        "upvotes": 344,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kpxAZLDii9ymH4gHXpqnlC5goT95hamgRC9Pz6X0yN8.jpeg?auto=webp&amp;s=d071a4af5ce4c43f8ca37854f047132304f9116f"
        },
        "permalink": "/r/realmadrid/comments/1qyg1u9/official_barcelona_hereby_announces_that_today_it/"
    },
    {
        "id": "1qz2nzn",
        "author": "GangsterAdaikalam",
        "title": "Benfica vs Real Madrid",
        "content": "To be honest, I am not sure if its worth to go for the playoff 1 at Lisbon. However, I am an international Madridista who is long been waiting to see Real Madrid play and I believe I have a good opportunity to watch them play now.\n\nI looked at the Benfica website for tickets but it is open for members only and I am not sure on how to purchase the tickets. Are tickets sold separately for away fans? Does anyone know how to get it? Are 3rd party websites like StubHub and SeatPick legitimate? Can we buy through them?\n\nMods please don't delete my post, thanks!",
        "upvotes": 14,
        "comments": 9,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qz2nzn/benfica_vs_real_madrid/"
    },
    {
        "id": "1qyfjhy",
        "author": "DANKWINGS",
        "title": "25/26: Vinicius Junior V Kylian Mbappe's defensive actions this season",
        "content": "I think this warrants a healthy discussion. \n\nI'm personally of the opinion that Mbappe tracking back is also very much to do with him playing as a CF. Because of the fact he is in this position, I feel he has a lot more area to cover or \"walk around in.\" \n\nBecause of this, I feel like he makes less runs back. When I watched him as a LW at the start and early years of his career, he did actually contribute a little defensively. \n\nThis makes me want to see Vini left, Garcia CF and Mbappe right more than ever. When Mbappe has to work harder for his goals, a lot of his 'bad' qualities may automatically disappear. ",
        "upvotes": 312,
        "comments": 215,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qyfjhy/2526_vinicius_junior_v_kylian_mbappes_defensive/"
    },
    {
        "id": "1qzbye5",
        "author": "ManuMora98",
        "title": "Real Madrid W [2] - 0 Espanyol W | Athenea del Castillo 18'",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vBply9i_yW4nINUFcOt7n9DgTOmpnwV89TyamIVgaBY.jpeg?auto=webp&amp;s=deabaaa58ca5d338a37957b438cc48abcbe2c3d0"
        },
        "permalink": "/r/realmadrid/comments/1qzbye5/real_madrid_w_2_0_espanyol_w_athenea_del_castillo/"
    },
    {
        "id": "1qyo8pt",
        "author": "TwoBallPlayer",
        "title": "Carvajal’s Entension depends solely on him recovering ‘peak form’",
        "content": "“Real Madrid captain’s renewal not a given, must be earned”\n\nThe clock is ticking on Dani Carvajal’s future at Real Madrid. Once viewed as an automatic extension candidate, the 34-year-old club captain now faces an uncertain road to a new contract, with performances between now and May set to decide whether he remains in white beyond the summer, according to a report published by AS.",
        "upvotes": 103,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/M8MHuDTw_R5yeg4QC0F8miWPn6-pNo9W-vErLp7p0Hw.jpeg?auto=webp&amp;s=fd3c928087b208b7ca36304c827be2e92a843049"
        },
        "permalink": "/r/realmadrid/comments/1qyo8pt/carvajals_entension_depends_solely_on_him/"
    },
    {
        "id": "1qyn3dv",
        "author": "Goat23231",
        "title": "Why do fans use Kroos as a tool to discredit our current midfielders?",
        "content": "I couldn’t be more grateful for his contributions. It’s not a mystery that our current guys relied on Kroos and Modric. With that being said, our legends equally relied on the younger guys as they aged. Kroos impact was big enough that there’s no need to diminish what the other guys did just to prop him up.\n\nTalking about the great 2024 season specifically. We wouldn’t have been as successful without Jude sense of goal, Valverde being the engine he was, and Tchouameni’s defensive stability. Camavinga, Modric, and Brahim also played their role perfectly off the bench. Obviously Kroos being the controller that he was played a significant role. The board clearly failed to replace his profile, and things fell apart shortly after. If the others suddenly left without being replaced, we wouldn’t be as good either. Again, there’s no need to discredit their contributions.\n\nA part of me will always be happy that Kroos retired on top, and Modric gets to dominate in Italy. There’s no doubt that people in this sub would be hating on them too if things stopped going well. You could start to see it in 2023. Fans would beg Carlo to play the younger guys over them. Calling Kross &amp; Modric too old and slow to compete against the top teams. It’s funny how the tables turn. Now the younger guys are “unworthy” / not “Real Madrid caliber” players.",
        "upvotes": 47,
        "comments": 56,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qyn3dv/why_do_fans_use_kroos_as_a_tool_to_discredit_our/"
    },
    {
        "id": "1qz6xbu",
        "author": "Alternative-Olive952",
        "title": "Elche game timing and date",
        "content": "Sorry this is not a sports related query \n\nI'm looking at the fixtures and the Getafe game is being played on a Monday. \n\nI know that this is a possibility but what are the chances of this happening for the Elche game scheduled for the 3/14 weekend? The press said the Getafe match was Monday due to the midweek fixture so I'm hoping this is a one off. \n\nVisiting from the states and I already have VIP tickets and need to know if I'm going to have to move my hotel/ plans around. I am in Madrid for the weekend and was planning to leave on Monday am for Barcelona.  And I'm reticent to book my train ticket and any other plans. \n\nThanks. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qz6xbu/elche_game_timing_and_date/"
    },
    {
        "id": "1qyfehw",
        "author": "RoronoraTheExplora",
        "title": "We won the UCL the year before last",
        "content": "Based off the discourse in this subreddit, I’m not sure if people are aware, but we did win the Champions League in 2024. To give this some context: this is the 70th rendition of the UCL. Assuming we don’t win this year, we will have won the UCL about once every 5 years. The second winningest club, AC Milan, will have won once every 10. Barca has not made it to the UCL final in over a decade. There are currently 17 players on our roster who have won the UCL with Real Madrid. They did not win due to coincidence.\n\nWe had a bad year last year due to the departure of some major players, and the addition of a new major component who has been more challenging to adapt to. This year we had a coach who, for whatever reason, did not work out. I think that the pessimism and dooming that has become so common is unfair to the current players, many of who have been instrumental in winning us 2 UCLs, a feat any other club would go crazy for. Unfair to the leadership of the club who for a decade and a half have been overseeing the most successful era in the history not of this club, but of this sport. And unfair to Arbeloa, a coach who was very successful during his stint in the youth teams, a man who sided with CR7 and Mourinho during a tumultuous time that ended up defining the next decade, and a new figure for the club who should be met with excitement and optimism but is instead greeted with bitterness due to feelings about the exit of his predecesor.\n\nI still believe that the leadership of this club which has been so successful knows what they are doing. I believe that the players who have won us more in the last 5 years than most do in their whole careers will win for us again. While I am saddened by how Xabi’s stint turned out, I believe in Arbeloa as a man and as a manager. Above all, I believe in Real Madrid’s ability to come back when everything is stacked against us and all but Madridistas have lost hope. ",
        "upvotes": 61,
        "comments": 35,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qyfehw/we_won_the_ucl_the_year_before_last/"
    },
    {
        "id": "1qy9fdy",
        "author": "Sparrow_tora_999",
        "title": "Direct Free Kick Goals",
        "content": "Most free-kicks scored for Real Madrid since 2009: \n1. Cristiano Ronaldo (33) \n2. Gareth Bale (4) \n3. Mesut Özil and James Rodriguez (3)\n4. Kylian Mbappé, Alaba, Rodrygo and Fede Valverde (2).\n\nSince Cristiano Ronaldo left Real Madrid, the team has missed a reliable free-kick scorer.During his 9 years at the club, Real Madrid averaged 6.1 free kicks per season. That figure has dropped to 1.6 per season since he left. Now, there is a “power vacuum” and only a few players stand out, and all of their output is far from Ronaldo’s.\n\nWho should be RM's free kick taker now?",
        "upvotes": 137,
        "comments": 58,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qy9fdy/direct_free_kick_goals/"
    },
    {
        "id": "1qyawgw",
        "author": "Ghioxs",
        "title": "Why Toni Kroos was the greatest midfielder",
        "content": "Hello everyone, I know this title will have many in doubts, but let me explain. In this story I want to show you some of the numbers of Toni Kroos, which no one see's. I would say, Kroos forces the game being played like he wants it. I will go through different statistics and give you also some comparable other players stats as well. The values inside the tables are all rounded just for readability, but this doesn't change anything for the facts!\n\n1. Pass volume &amp; accuracy (2017 - 2023)\n\n* **Pass volume** = total attempted passes\n* **Pass accuracy** = percentage of successful passes\n\n|Name|Passing Volume|Passing Accuracy|\n|:-|:-|:-|\n|Sergio Busqusts|18.300|90|\n|Toni Kroos|18.700|90|\n|Joshua Kimmich|19.800|85|\n|Rodri|20.000|92|\n\nThey are the top 4, the best of the best and what can see? Toni Kroos is not number 1, but don't stop reading yet!\n\n2. Ball contacts before losing the ball\n\n* **Touches per ball loss** = how many touches a player makes before losing the ball\n* **Minutes played** = total minutes played (2017–2023)\n\n|Name|Minutes Played|Touches per ball loss|\n|:-|:-|:-|\n|Joshua Kimmich|23.300|57|\n|Rodri|23.500|67|\n|Sergio Busquets|23.000|78|\n|Toni Kroos|20.800|95|\n\nThis metrics doesn't look to relevant, but it gives us one important information. No matter what game situation you're in - you could pass to Kroos and he could calm the situation for you. In average Toni Kroos losses the ball after touching it 95 times before. However this could bring up the idea, he is just playing safe and doesn't take risks. Wrong!\n\n3. Progressions per ball loss\n\n* **Progressions per ball loss** = how many forward/progressive actions a player makes before losing the ball\n* **Minutes played** = total minutes played (2017–2023)\n\n|Name|Minutes Played|Progressions per ball lose|\n|:-|:-|:-|\n|Joshua Kimmich|23.300|12|\n|Rodri|23.500|12|\n|Sergio Busquets|23.000|15|\n|Toni Kroos|20.800|23|\n\nThis table shows us, that Toni Kroos is not just a player that hides, has a lot of touches and doesn't do anything with it. He is still creating more progression than any of his competitors with having also a comfortable lead. However progression doesn't always mean dangerous, that's what we will look at next.\n\n4. Passes into final third\n\n* **Passes into final third** = number of passes played into the attacking third\n* **Minutes played** = total Champions League minutes (2017–2023)\n\n|Name|Minutes Played|Passes into final third|\n|:-|:-|:-|\n|Luka Modric|5.700|500|\n|Rodri|5.000|510|\n|Joshua Kimmich|7.500|660|\n|Toni Kroos|5.800|740|\n\nDespite him being the safest midfielder of all time, he is also the most dangerous creator of all time - since UCL 2003. While we were waiting for Cristiano, Vini Jr. and everyone else scoring goals, Kroos was the one directing the game into the dangerous zones. He didn't wait for the moment, he created it - for more than a decade.\n\nTaken together, the data shows why Toni Kroos was indispensable to Real Madrid’s success: with unmatched passing accuracy, ball security, progression efficiency, and elite volume of passes into the final third, he consistently controlled games while advancing play with minimal risk—turning dominance in possession into sustained attacking pressure.\n\nIn case you've read everything, please tell me your opinion and have a great day!",
        "upvotes": 73,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qyawgw/why_toni_kroos_was_the_greatest_midfielder/"
    },
    {
        "id": "1qya7ys",
        "author": "cargo-culture",
        "title": "RM needs a deep restructuring",
        "content": "This Real Madrid doesn’t work. That I think we can all agree on. Then I hear some blaming Vini, some Mbappe, others remembering Kroos and Luka and many looking at Florentino. How divided we are as fans is a reflection of how complex are Madrid’s problems.\n\nSo here’s my hot take:\n\nMadrid and Florentino haven’t outgrown the phase where they can just buy players and simply trust top world talent with a people manager. It worked with the generation of CR7, Modric, Kroos, Ramos, etc. It didn’t with the galacticos, and now it’s not working again.\n\nIn today’s world, with state owned clubs and both money and talent pouring into the Premier League, this approach is much harder - we just can’t compete financially or as the attractive top league we were 10 years ago, and it’s starting to show. \n\nWe can’t easily buy top talent like we did before. Zidane was signed in months, CR7 didn’t take much longer. Now we are relying on our legacy more than ever before and waiting years for contracts to expire to sign top talent. Instead of signing what is needed, when it’s needed. You can’t build a team like that.\n\nReal Madrid needs to pivot into becoming a team that wins by playing football collectively, a team that has a long term manager with a long term strategy - from the youth squad to the senior squad. The pay to win strategy just doesn’t work for us anymore.\n\nMadrid needs a deep restructuring or we risk becoming the next Manchester United. \n\nWhat do you guys think? \n\nCan Madrid continue to win long-term with the same model (and president) that both gave us the galacticos disaster but later brought us 6 Champions Leagues? ",
        "upvotes": 35,
        "comments": 32,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qya7ys/rm_needs_a_deep_restructuring/"
    },
    {
        "id": "1qxxowi",
        "author": "nogokeo",
        "title": "Raúl #7 𝐸𝑙 𝐴́𝑛𝑔𝑒𝑙 𝑑𝑒 𝑀𝑎𝑑𝑟𝑖𝑑 2002 Centenary Season",
        "content": "",
        "upvotes": 66,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qxxowi/raúl_7_𝐸𝑙_𝐴𝑛𝑔𝑒𝑙_𝑑𝑒_𝑀𝑎𝑑𝑟𝑖𝑑_2002_centenary_season/"
    },
    {
        "id": "1qxc4qx",
        "author": "laman-78",
        "title": "1% of Vini Jrs Stats",
        "content": "",
        "upvotes": 687,
        "comments": 214,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qxc4qx/1_of_vini_jrs_stats/"
    },
    {
        "id": "1qxyuex",
        "author": "Galego_ACB",
        "title": "ACB paid tribute to Walter Szczerbiak on the 50th anniversary of his scoring record of 65 points in the Spanish league with Real Madrid (and in an era with no threes)",
        "content": "",
        "upvotes": 29,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qxyuex/acb_paid_tribute_to_walter_szczerbiak_on_the_50th/"
    },
    {
        "id": "1qxm9z7",
        "author": "Constant-Gas8234",
        "title": "Where can i find a hi-res photo of this",
        "content": "Yooh hi i was asking where i could get a high quality photo of this screenshot i took while watching the real madrid documentary of the champions league final where u can see vini walking out and the cameraman gets the shot from behind i have been looking for it for ages now but i cant seem to find it online.thanks",
        "upvotes": 79,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vxxtfr23iwhg1.jpeg?auto=webp&amp;s=867fa423aec8b85017dbf8fcd4f6303b5f29c3f1"
        },
        "permalink": "/r/realmadrid/comments/1qxm9z7/where_can_i_find_a_hires_photo_of_this/"
    },
    {
        "id": "1qylj17",
        "author": "lligerr",
        "title": "Team Assessment and Future plans",
        "content": "Forwards:\n\n• Mbappe: Guaranteed \\~50 Goals a season, clutch player, nerves of steel, penalty king. • Vinicius: One of best LW who can Penetrate any defence, let it be minute 1 or 120 (highly volatile and emotional though) • Rodrygo: Proven himself as reliable roaming RW/SS and UCL clutch player (somehow Xabi and now Arbeloa can't see it) • Endrick: Destroying Ligue 1 and can potentially start as RW/SS; huge upside • Gonzalo Garcia: Excellent backup • Brahim Diaz: Excellent backup \n\nIssues: Mbappe and Vinicius chemistry and individual efficiency, avoiding overlapping zones; Rodrygo and Endrick must rotate patiently, Gonzalo with risk of no improvement and rotting on bench\n\n\n\nMidfielders:\n\n• Jude: Top notch CM • Valverde: Better of as RB, still can be a good CM • Arda: Breakout season, can start most matches as attacking playmaker already • Tchouaméni: Excellent destroyer/6. Needs bit more polish • Camavinga: Top 6/8 hybrid, needs to start more, very useful and skilled player but risky as sole DM • Mastantuono: Good upside, better as a right drifting CAM, not RW, good rotation player now • Ceballos: Good backup, but needs to go to make space for a playmaker/orchestrator so leave\n\n  \nIssues: Needs to sign a world class Playmaker CM; Maybe Nico Paz is such a player but he's not ready yet if we need results from year 1\n\n\n\nDefenders:\n\n• Carreras: Good LB, good upside and continues to be a starter now (Remember how Carvajal and Marcelo was at 21?; he'll improve) • Fran: Good backup LB • Trent: Proven world class attacking RB/Quarterback, defending is a weakness though • Valverde: A bonus RB, a good defensive and solid RB (if he agrees to rotate with Trent) • Dean Huijsen: Very good ball playing tall LCB for his age and higher upside, still needs improvement against top sides • Militao: Top RCB, but Post ACL, struggling to maintain fitness and peak form. If this continues, better buy another RCB (Saliba?!) • Raul Asencio: Good backup RCB (Bit reckless and hot headed, costing points so that needs to be sorted) • Carvajal, Alaba, Rudiger, Mendy: Legends but needs to be phased out like Marcelo/Ramos etc to free space\n\nIssues: Needs to sign a ball playing LCB like Schlotterbeck who is plug and play from day 1 at highest level (BVB/GermanNT already); Huijsen alone risky. Also might need to sign another RCB if Militao situation continues. Maybe a backup RB will be needed after Carva leaves. If Carreras fails to perform even after 2 or more years, will need to sign another world class LB and Fran will have to leave.\n\n\n\nGoalkeepers: • Courtois: Best since last 5 years. Has few more years to go as world's best. No debate • Lunin: Very good backup or even can start long term after Courtois leaves (Proven in 23/24)\n\n Issues: None\n\nWhat do you think Folks? Any suggestions?",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qylj17/team_assessment_and_future_plans/"
    },
    {
        "id": "1qxfue1",
        "author": "johnmason125",
        "title": "The contradiction between transfers and the reality of football",
        "content": "Football is a very short lived sport. Managers nowadays barely last more than two seasons, after two losses in a row it´s crisis, what happened the season before doesn´t really count, what could potentially happen in two years after also doesn\\`t.  Real Madrid is probably the pinnacle of that.\n\nOn the other side more and more big clubs are signing project players. Players who obviously have talent, but who are still raw and who still need a bit of time. So Real Madrid signed the likes of Vinicius, Rodrygo, Reinier, Endrick, Mastantuono, Camavinga, Hujisen. Man City signed the likes of Khusanov, Victor Reis, Doku, Savinho. Chelsea signed so many like talented 20 year olds, they are basically hoarding talent.\n\nNow this works as long as there is an experienced core of players around kind of leading them. So Real Madrid were fine when the likes of Kroos, Modric, a fit version of Carvajal, Benzema...were still around. It actually looked like they got the transition spot on. Man City were fine when they still had De Bruyne, Walker, the peak versions of Ruben Dias and Rodri leading the team. \n\nProblems start when the experienced core of players is starting to fail. In Real Madrid´s case the current experienced core of players age wise (apart from Courtois) is Carvajal, Alaba, Rüdiger, Mendy, maybe Ceballos. 4 players who have had massive injury issues and one player who has never really been more than a squad player. After that you have the likes of Militao and Trent, who have also had big injury problems this season. The oldest outfield player who is actually playing is Valverde at 27. \n\n3 of Real Madrid´s back four currently are Carreras, Hujisen and Asencio. I´m happy all three of them are at the club, I think they could all have good careers at the club but they probably shouldn´t be starting together at this point in their career. \n\nCompare that to the Champions League winning sides of Real Madrid in the last 15 years. The youngest starting 11 in a final was the la decima starting eleven and the average age was 26.7 years and it would have been older if Xabi Alonso hadn´t been suspended and Pepe had been fit to start. \n\n",
        "upvotes": 39,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qxfue1/the_contradiction_between_transfers_and_the/"
    },
    {
        "id": "1qx7jd8",
        "author": "Moreplatesmoregains",
        "title": "Franco mastantono is not good to be starting games ahead of anyone.",
        "content": "I have been focusing on Franco lately and everytime i notice more and more that he is an average player at best, he has potential to be very good but i can’t see anything special about him.. his touches on the ball sometimes are very bad .. decision making is horrendous.. he has given us sometimes glimpses and nice passes but we all know this nothing so special.. we have made a mistake with sending endrick on loan and leaving him , it should have been the opposite. I personally think endrick will do a better job than him on rw or even arda is more dangerous on rw.. he may has the pressing thing better than others and that’s why arbeloa and even xabi likes to start him. But i think this transfer window we should have bought someone a bit better and a natural rw .. i maybe wrong in the future i hope im wrong and he will succeed and be our next Di maria.",
        "upvotes": 154,
        "comments": 89,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qx7jd8/franco_mastantono_is_not_good_to_be_starting/"
    },
    {
        "id": "1qwoj73",
        "author": "TheFeatherDiaries",
        "title": "Arda Güler; Real Madrid’s best in Pintus’ fitness test. Finished FIRST in the demanding physical assessments on Wednesday. He even increases intensity after halftime: +8% sprints and +6% sprint distance compared to first half showing elite recovery, explosiveness, and energy management.",
        "content": "",
        "upvotes": 951,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O2SZFVPZv0GoxxlnSBynhh8-z99C7J-FoEATLEFJ5cs.jpeg?auto=webp&amp;s=7eecb3e76694426aff94b802d999bc231be74e5c"
        },
        "permalink": "/r/realmadrid/comments/1qwoj73/arda_güler_real_madrids_best_in_pintus_fitness/"
    },
    {
        "id": "1qwvmlg",
        "author": "Majestic-Nobody-3178",
        "title": "Casemiro is the only Top-7 League Midfielder with more interceptions than Chema Andres this season. Seems like this guy is a bigger talent than we thought.",
        "content": "",
        "upvotes": 334,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/23570t1tdqhg1.jpeg?auto=webp&amp;s=134a9387870c394adecd6506ea1c6e5a5fb82b9a"
        },
        "permalink": "/r/realmadrid/comments/1qwvmlg/casemiro_is_the_only_top7_league_midfielder_with/"
    },
    {
        "id": "1qwu0bc",
        "author": "ceaguila84",
        "title": "Real Madrid’s Rodrygo to miss Champions League play-off games due to two-match ban",
        "content": "",
        "upvotes": 235,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LrwqQuLFm9mfTHL6Wj8IEDwxy9fRwlASKWfxRmLb3eA.jpeg?auto=webp&amp;s=a765f0dd4e6c4ceed30fb9815941ccf60838e8d0"
        },
        "permalink": "/r/realmadrid/comments/1qwu0bc/real_madrids_rodrygo_to_miss_champions_league/"
    },
    {
        "id": "1qwrcrw",
        "author": "InspectorExact3836",
        "title": "Real Madrid has uploaded all 451 Goals scored by Ronaldo for club on its youtube channel on his 41st birthday",
        "content": "",
        "upvotes": 300,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j0S-q1A6cMxg7OgB-f8LPojvvDV5Jig9iGfaJP5jpt0.jpeg?auto=webp&amp;s=474066fe5f0a73690646195ed1e5bf5be893c5eb"
        },
        "permalink": "/r/realmadrid/comments/1qwrcrw/real_madrid_has_uploaded_all_451_goals_scored_by/"
    },
    {
        "id": "1qx1lc2",
        "author": "redsox490",
        "title": "Real Madrid Femenino lost 4-0 today to Barcelona in the Copa de la Reina quarterfinals.",
        "content": "[https://www.realmadrid.com/en-US/news/football/womens-team/reports/real-madrid-barcelona-clasico-05-02-2026](https://www.realmadrid.com/en-US/news/football/womens-team/reports/real-madrid-barcelona-clasico-05-02-2026)\n\nI feel like I'm one of the only ones on this reddit page to actually care about them. I saw no mention that it was even happening to I thought I would share the news with you all about the loss today.\n\nReal Madrid Femenino have not won a trophy yet. The 2020–21 season was their first season. This was the 22nd meeting of the women's Clásico and Real Madrid has only won once. The matches are very rarely close. Real Madrid has scored 10 goals and given up 77. So as a fan who watches the matches, they are pretty painful to watch to be honest.",
        "upvotes": 80,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Yc6jWBIjobAAXLF_Yql6gsiOM9FvKsdZ8_NTxhB642g.jpeg?auto=webp&amp;s=fd65298b33c5f21ae660c6822ff956476c847634"
        },
        "permalink": "/r/realmadrid/comments/1qx1lc2/real_madrid_femenino_lost_40_today_to_barcelona/"
    },
    {
        "id": "1qwo77y",
        "author": "AlekhineAl",
        "title": "Still in awe of this goal. Every player showcasing his best trait.",
        "content": "",
        "upvotes": 325,
        "comments": 41,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6s5u6b052phg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qwo77y/still_in_awe_of_this_goal_every_player_showcasing/"
    }
]