[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 486,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i7c7cu",
        "author": "TheExpressUS",
        "title": "Bling Empire New York star Lynn Ban dies aged 51 after brain surgery",
        "content": "",
        "upvotes": 132,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1i7c7cu/bling_empire_new_york_star_lynn_ban_dies_aged_51/"
    },
    {
        "id": "1i7a5uk",
        "author": "Glitchy_McGee",
        "title": "Is Netflix shooting itself in the foot with these constant price hikes?",
        "content": "I’ve been a Netflix subscriber for years, but with the latest price hike for the Premium plan (now $24.99/month!), I’m really starting to question if it’s worth it anymore. They keep raising prices while pushing out content that, honestly, doesn’t always hit the mark. It feels like they’re making us pay for their poor-performing shows and movies instead of focusing on producing quality content that people actually want to watch.\n\nAnd the password-sharing crackdown? I get that they want to boost profits, but it feels like they’re ignoring how modern households actually function. Not everyone under one account lives in the same house 24/7—people go to college, travel for work, or stay with family temporarily. It just seems dumb to alienate loyal customers who aren’t trying to cheat the system but just have a normal life.\n\nA lot of people I know have either canceled their subscriptions or switched to other streaming services that offer just as much—if not more—for less money. It just doesn’t make sense to me. If they’re losing subscribers because of price hikes, why keep doing it? Shouldn’t they focus on improving their content and keeping people around instead of squeezing every dollar out of us?\n\nWhat do you guys think? Are you sticking with Netflix, or are you moving on to other platforms?",
        "upvotes": 79,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1i7a5uk/is_netflix_shooting_itself_in_the_foot_with_these/"
    },
    {
        "id": "1i6tod5",
        "author": "misana123",
        "title": "Netflix Raising Prices in U.S. Again, Including First Hike on Ad-Supported Tier",
        "content": "",
        "upvotes": 947,
        "comments": 436,
        "media": null,
        "permalink": "/r/netflix/comments/1i6tod5/netflix_raising_prices_in_us_again_including/"
    },
    {
        "id": "1i7cn9m",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix's 'Zero Day' limited series starring Robert De Niro and Angela Bassett releases trailer, the show will be released on February 20",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i7cn9m/netflixs_zero_day_limited_series_starring_robert/"
    },
    {
        "id": "1i78ysr",
        "author": "TimesandSundayTimes",
        "title": "The fourth quarter of 2024 was the last for which Netflix will report numbers of paying subscribers, suggesting growth in numbers is slowing",
        "content": "",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1i78ysr/the_fourth_quarter_of_2024_was_the_last_for_which/"
    },
    {
        "id": "1i7ae17",
        "author": "MissingJJ",
        "title": "Netflix movies are designed for people who aren’t focused and scrolling.",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i7ae17/netflix_movies_are_designed_for_people_who_arent/"
    },
    {
        "id": "1i6tlbq",
        "author": "misana123",
        "title": "Netflix Reaches 302 Million Paid Subscribers with 19 Million Adds in Q4",
        "content": "",
        "upvotes": 60,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1i6tlbq/netflix_reaches_302_million_paid_subscribers_with/"
    },
    {
        "id": "1i7blk9",
        "author": "FunctionAsUare4",
        "title": "Just finished squid games and it was phenomenal",
        "content": "I think I started ut on the 1st of January this year. Subbed of course. From the get go, I was highly entertained. Not for a second, was I anything but loving it.\n\nThe Gganbu episode just sealed it for me. That was the most emotional episode(and the best—at least for now) I've ever watched in any form of entertainment. The ending was good, and although I initially told myself I would wait a bit before starting the next season, I ended up starting season 2 the next day or so.\n\nAnd....\n\n\nIt was Great as well. Didn't exactly have the emotional attachment that to characters that season 1 did, but in terms of entertainment, it was just about the same.\nThanos is really funny\n\nThe ending was good for me. \n\nDespite what a lot of people say, I had no problem whatsoever with when the season ended. Obviously, I would prefer it went longer, but stopping the season there,I have no problem with. I can definitely wait and I realise that not everything the season started with needed to be finished before then(like character's development).\n\nSeason 1 was 10/10\n\nSeason 2: 8,5/10\n\nTherefore,by calculation, I rate Squid game:9,2/10\nAbsolutely phenomenal.\nMy favourite show so far except for One Piece(not live action).\n\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i7blk9/just_finished_squid_games_and_it_was_phenomenal/"
    },
    {
        "id": "1i7fdi8",
        "author": "mrk55",
        "title": "Cancel Netflix for 3 Month to Send a Message",
        "content": "Like a trend on TikTok recently with people mass unfollowing certain influencers, if enough people agree to cancel Netflix for 3 months (or whatever time period) and just use a different subscription site, it would send a clear message about the frustration of constant price hikes and cut into the profits of said price hikes. \n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i7fdi8/cancel_netflix_for_3_month_to_send_a_message/"
    },
    {
        "id": "1i7dmnj",
        "author": "popthatkunt",
        "title": "Are all Netflix originals equally available in all countries?",
        "content": "I'm from South Africa and had a random thought. \n\nNetflix has original South African series and I was wondering if the rest of the world can watch these too?\nExample: Blood and Water, a South African Netflix original series ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1i7dmnj/are_all_netflix_originals_equally_available_in/"
    },
    {
        "id": "1i7bxum",
        "author": "Cultural-Strategy609",
        "title": "Has there ever been a worse adaptation of a book than “All the light we cannot see?”",
        "content": "This is the first book that I’ve read of 2025 and I loved it, so when I saw it on Netflix I thought it must also be good… wrong!\n\nThe accents are bad, but they did not bother as much as the awful deviations from the novel. \n\n1. All of the Nazis are very standard evil characters with no ambiguity. It’s just “do this or I shoot you.” In the book they are complex characters with varying motivations. \n\n2. A major part of the whole story is Werner Trapped in the basement of the hotel with his friend (I assume in the show its the guy who dies in the bombings at the beginning). They have to survive days in the dark with no food or water before finally finding a way out, in which Werner immediately goes searching for Marie. \n\n3. Werner’s entire backstory is ignored. The characters he interacts with, how he struggles to stay himself while at the school, all ignored. \n\n4. The entire resistance in the show is ridiculous. Etiene wanted nothing to do with it because it endangered Marie, that is until Madam Manec died, then he starts broadcasting codes, but not riding motorcycles and wielding tommy guns. \n\n5. A huge part of the story is how her dad always made puzzle boxes for her to figure out, and the diamond in the house was a puzzle box that she figured out BEFORE Von Rumple shows up. \n\n6. I think the most bothersome for me revolves around the house itself. In the book It’s described as one of the tallest in the town. It is 6 stories high, and the access to the attic is through Etiene’s brother’s room where there is a trap door that he builds into an old, extremely heavy wardrobe. The attic is described as being too short to stand up in and there are no windows. Marie hides in the attic for four days while Von Rumple is searching her house for the diamond, afraid to even move for he may hear her. \n\nThere is so much more missing or altered in the series that I could list, but overall I’m really disappointed in how Netflix took so many liberties with a story that was really well written. \n\nRent over",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i7bxum/has_there_ever_been_a_worse_adaptation_of_a_book/"
    },
    {
        "id": "1i72t0v",
        "author": "blackblonde13",
        "title": "Just finished watching Red Rose",
        "content": "I really enjoyed it and have SO many questions but did anyone else pick up on the fact that at the end, Wren placed a yellow rose on Roch’s grave (yellow rose represents friendship) and then skip to the Tokyo friend scene and the notification chimes on the guy’s phone and it’s a YELLOW ROSE icon instead of the previous red rose.\n\nDid anyone else pick up on this or am I looking too much into it?",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i72t0v/just_finished_watching_red_rose/"
    },
    {
        "id": "1i6dmlf",
        "author": "LauraEats",
        "title": "Netflix is expected to add 8.2 million subscribers in the quarter, reaching 290.9 million",
        "content": "",
        "upvotes": 161,
        "comments": 90,
        "media": null,
        "permalink": "/r/netflix/comments/1i6dmlf/netflix_is_expected_to_add_82_million_subscribers/"
    },
    {
        "id": "1i78yl1",
        "author": "Boy_Wond3rr",
        "title": "Netflix household",
        "content": "Does anyone have any accurate stats on whether the household setting has really benefited Netflix in the long run or done more damage ? Subscribers ? Packages ? And have people figured a way around it or have we all just accepted it ? Is there anything we can do as well like a petition or is the only option to leave, cause at this point I’m fed up with the household thing it’s so annoying and so backwards but on the other hand I still use Netflix regardless of that dumb thing ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i78yl1/netflix_household/"
    },
    {
        "id": "1i77gyv",
        "author": "Fair_Dog_1223",
        "title": "Suggest me web series theme like Sabrina, Locke and key, Riverdale , Lockwood and co Wednesday, the witcher type .....",
        "content": "I'd be delighted if someone will suggest me themes that resonate with  my above description fascination for the dark, mystical, and magical. I've  mentioned vampires, magic, and Viking-inspired themes, which evoke a sense of mystery, adventure, and ancient lore. Like these which I've mentioned in question toooo recommend me more like these web series.....!! ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1i77gyv/suggest_me_web_series_theme_like_sabrina_locke/"
    },
    {
        "id": "1i77fr3",
        "author": "forevony_0904",
        "title": "Helppp",
        "content": "Okay updateee as now I decided I only wanna watch Netflix shows from now on \n\nI watched Ginny and Georgia, spinning out and nearly done Never Have I Ever.\n\nI'm thinking of watching Sex Education, Atypical and heartbreak high \n\nAny other recommendations. Please let me know. And let me know if the 3 shows I put up are they completed \n\nThanks in advanced all",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i77fr3/helppp/"
    },
    {
        "id": "1i778xp",
        "author": "MochiMush1",
        "title": "need some good romcom, main chara is WILD, and easy to watch like Never Have I Ever please",
        "content": "hi im looking a teenager movie / well series, high school or university is okay to me. but the genre must be romance, COMEDY, easy to watch + A PLUSSS POINT IF THE MAIN CHARACTER IS NAUGHTY WILD LOOOL",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i778xp/need_some_good_romcom_main_chara_is_wild_and_easy/"
    },
    {
        "id": "1i7eonu",
        "author": "EmbarrassedTackle264",
        "title": "Did you ever forgot to pay Netflix?",
        "content": "Just wondering what happens if I forget. If it ever happened to you, tell me how did they warn you about it and what do you do to avoid forgetting again",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1i7eonu/did_you_ever_forgot_to_pay_netflix/"
    },
    {
        "id": "1i65s3b",
        "author": "Nejiflower",
        "title": "XO kitty acting is garbage, everything about that show is garbage",
        "content": "Okay, XO, Kitty is proof that not everyone needs to be on TV. I mean, was there even an audition process? Or did Netflix just scroll through creators on insta and say, “You look okay, congrats, you’re now an actor”? The acting felt like a bunch of people who’d never been in front of a camera before\n\nAnd don’t even get me started on the dialogue. It’s like the script was written in TikTok comment sections. Nobody actually talks like that in real life  Hearing those lines come out of their mouths was physically painful, like they were trying to make TikTok slang happen, but no just stop this aint it.\n\njust cast actual actors next time. And get a script that sounds like it was written by humans and not an algorithm trying to go viral. And everyone is suddenly gay and bisexual on a korean school? How unrealistic😹😹 is netflix just trying to check the lgbt boxes or something???",
        "upvotes": 227,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1i65s3b/xo_kitty_acting_is_garbage_everything_about_that/"
    },
    {
        "id": "1i77f55",
        "author": "Fair_Dog_1223",
        "title": "Suggest me web series theme like Sabrina, Locke and key, Riverdale , Lockwood and co Wednesday, the witcher type .....",
        "content": "I'd be delighted to suggest themes that resonate with your fascination for the dark, mystical, and magical. You've mentioned vampires, magic, and Viking-inspired themes, which evoke a sense of mystery, adventure, and ancient lore. Like these which I've mentioned in question toooo recommend me more like these web series.....!! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i77f55/suggest_me_web_series_theme_like_sabrina_locke/"
    },
    {
        "id": "1i79nv0",
        "author": "zamb00",
        "title": "A Review and Blog System in the Netflix Portal: What Would It Look Like?",
        "content": "Hello People, \n\nNetflix, as a leader in digital streaming, offers a wide variety of content, but I have a question for you. Does Netflix's platform lack community interaction features? \n\nWhat if, one day you get to know that Netflix is Introducing a **Review and Blog System** which could bridge the gap between passive viewing and active engagement, potentially redefining how users connect with content and each other. \n\nif yes, then what features would you want Netflix to have? Could dedicated review sections for each title, categorized by elements like acting, plot, and pacing, make feedback more impactful? Would user blogs discussing themes, character arcs, or societal implications foster deeper connections? Could threaded discussions allow debates and theories to flourish, with moderation ensuring quality and relevance? Social features like a follower system, reaction options such as “Helpful” or “Insightful,” and the ability to share posts might enhance user interaction. \n\nFurthermore, what benefits would this system bring? Could it encourage users to spend more time on the platform, build a stronger sense of community, or highlight hidden gems for better content discovery? Might it also provide Netflix with valuable feedback to refine its offerings while differentiating the platform as a community hub rather than just a streaming service? However, challenges such as content moderation, privacy concerns, and managing overwhelming volumes of reviews and blogs must be addressed. Would AI moderation tools, robust privacy controls, and filtering options help Netflix tackle these issues effectively? Should the system be introduced through a phased rollout, offering incentives like badges or discounts to encourage participation? By seamlessly integrating the feature across platforms and collaborating with influencers to set a quality benchmark, could Netflix successfully implement this idea?\n\nIn the end, the most important thing to know is, what's your take on it, \"is such a system worth pursuing\"? Could it elevate Netflix from being just a content provider to a vibrant community platform? By addressing these questions and challenges, Netflix could transform user interaction, making entertainment more engaging, personalized, and interactive. Would you welcome this feature on Netflix?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1i79nv0/a_review_and_blog_system_in_the_netflix_portal/"
    },
    {
        "id": "1i6xljn",
        "author": "Piggysmolls",
        "title": "Alice in Borderland Dealers Momoka and Aasahi",
        "content": "  \nNow that season 3 has been allegedy announced to be released as of late, I wanted to talk about some elements of the series - starting with the concept of dealers\n\n\n\nhttps://preview.redd.it/dyjwe0qptfee1.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;s=9ec6710eb858dad9e92cc49ca56e45a1e1219578\n\nMomoka and Asahi, pivotal characters in *Alice in Borderland*, are revealed to be \"dealers,\" individuals coerced pehraps into orchestrating and supervising games in the Borderlands where their survival seems to depend on their compliance. However, this role turns them into indirect agents of death, complicit in the system that preys on other players. Their roles add a layer of complexity to the narrative, raising questions about free will, morality, and the cyclical nature of life and death as well as how one becomes a dealer and what final result this means when linked back to the real world. So here are some of my questions as someone who hasn't finished reading the manga and is open to spoilers by any means if anyone has any answers!\n\n**1. What Motivates the System to Create Dealers?**\n\nWhy does the Borderland system require participants to act as dealers? Is it a mechanism to ensure complicity and spread guilt, or is it a test of moral resilience\n\n**3. Why do dealers have to try and 'kill' people?**\n\nIn the video recording, Momoka says 'a lot of people have died because of us', not only do they go to supervise but they mention 'we made sure many players died' in order to manipulate the games but why? What's the point of this as a lot of games seem to be based of merit or just pure luck - so why would the system want dealers to come in and purposefully sabotage the outcome?\n\n**2. Does the role of dealers tie closely to the randomness of the meteor strike in the real world?**\n\nJust as the meteor arbitrarily determined who lived and died, does the system of the Borderland places individuals into roles that often leave them with no choice such as dealers? or are these roles perhaps something individual players choose for themselves at some point similar to choosing 'citzenship at the boarderlands' like in the end scene? If not, what happens to dealers once the game has been completed? do they also get to choose to go back?\n\nI have a lot more questions but these are just a few about the dealers specfically. The scene where they're in that room full of a bunch of screens really altered my perspective of the show as you can expect and I still have difficulties connecting everything in a way where it makes somewhat sense.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i6xljn/alice_in_borderland_dealers_momoka_and_aasahi/"
    },
    {
        "id": "1i790jz",
        "author": "JustaCucumber91",
        "title": "Is Netflix “calling out” their audience?",
        "content": "I just finished watching the Jerry Springer episodes and have seen “don’t f**k with cats”, both series ended with someone pretty much saying this craziness wouldn’t have happened without you, the audience and the fact you’re watching a Netflix series about this issue shows that drama/violence/etc all happens because you’re going to watch it. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i790jz/is_netflix_calling_out_their_audience/"
    },
    {
        "id": "1i6ygy1",
        "author": "sven0341",
        "title": "Stand-Up gone?",
        "content": "I watched Ari Shaffir's new special last night. today I am searching for it again and nothing comes up for him. So I search Tom Segura, and nothing, Bert Kreischer nothing, joe rogan nothing, dave chappelle nothing any comedian i KNOW that has a stand-up special on netflix i can no longer search for in the past 24 hours or so.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i6ygy1/standup_gone/"
    },
    {
        "id": "1i6auay",
        "author": "VanQuackers",
        "title": "What everyone missed about La Palma (SPOILERS)",
        "content": "So I just finished re-watching La Palma for the sixth time and I hopped on reddit to see what people were saying about my new favorite cinematic masterpiece, and I'm absolutely amazed at how wrong everyone seems to be about Erik's \"death\".  Just thought I'd clear up any confusion on the matter.\n\nErik never died.  In the final scene Erik was revealed to actually have been a sea turtle the entire time, who ended up surviving the gunshot due to his hard shell blocking the bullet.  In the last scene of the final episode it literally shows him reuniting with his sea turtle family and slowly fading away as he swam off into the distance 🙄\n\nThere were actually several signs throughout the show to hint at this being the case:\n\n* Erik's obsession with sea turtles and the many boat trips he took to visit them.  \nHe even divulges that he was in debt to the boat guy because of this.\n\n* Erik's need for his sister to take care of him.  \nTowards the beginning of the story he asks his sister for $100 to buy vegetables (sea turtle diet)\n\n* Halfway through the series the police start to arrest Erik but eventually realize he is a sea turtle (you can't arrest sea turtles) and then switch to arresting Marie when she gets involved, which gave away that she was his owner and therefore responsible for him.  \n\n* In the jail when he finally gets ahold of the keys, he struggles to unlock Marie's cell due to his  lack of opposable thumbs.  She even has to steady his flippers to help him out.\n(I honestly debated whether or not to even include this one it was so obvious, I seriously hope no one missed this)\n\nI could go on but I really feel like those are the main points and if you still can't see it then I don't know what to tell you.\n\nAll in all I really loved this series and thought it had a really heartwarming ending and message about how Sara should've died when the tsunami absolutely turbo-fucked the shit out of the airplane like seriously what the fuck was that",
        "upvotes": 25,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1i6auay/what_everyone_missed_about_la_palma_spoilers/"
    },
    {
        "id": "1i6lq0o",
        "author": "S4v1r1enCh0r4k",
        "title": " ‘Bridgerton’ Celebrates Valentine’s Day with Exclusive Fan Event Featuring Season 4 Leads Luke Thompson and Yerin Ha, RSVPs open at 7:30 a.m. PT / 10:30 a.m. ET on January 21 ",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i6lq0o/bridgerton_celebrates_valentines_day_with/"
    },
    {
        "id": "1i6y77e",
        "author": "golfguy1985",
        "title": "Does anyone else have this issue?",
        "content": "You’re watching regular tv and a Netflix thing comes up randomly. This happens several times. It’s hard to explain. Has anyone else experienced this and how have you fixed it, if at all?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i6y77e/does_anyone_else_have_this_issue/"
    },
    {
        "id": "1i6ox04",
        "author": "scushman246",
        "title": "Firestick vs. AppleTV versions ",
        "content": "I just noticed that the new Games category is listed on my Amazon Firestick version of Netflix.  But for some reason, in the AppleTV version of Netflix, it’s not listed.  Does anyone know why this would be? I assume it’s because it’s different versions. That being the case, why would there be a different experience between the two different streaming devices. If this is the case, is there a work around? I would hate to have to use my Firestick TVs just to try out the play games area of Netflix.   ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i6ox04/firestick_vs_appletv_versions/"
    },
    {
        "id": "1i6zhj9",
        "author": "kdex86",
        "title": "Netflix tying to nickel and dime me?",
        "content": "I bought one month of the ad-supported Netflix plan on Christmas to watch the NFL games on that day.  My 1 month subscription is therefore up for renewal this Saturday.  But I want to upgrade to the ad-free plan because there are some movies \"content-locked\" to that tier.\n\nSo I went online to change my plan just now, and it's saying I need to pay **$17.99** to upgrade to ad-free.  I thought it was $15.49?  What the fuck, Netflix????????",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1i6zhj9/netflix_tying_to_nickel_and_dime_me/"
    },
    {
        "id": "1i6mnj0",
        "author": "Plane-Arugula-9117",
        "title": "I wish netflix could hurry with Ginny and Georgia season 3 release and other shows? does anyone feel like they're trying to space some of the shows out? when do you we get new information? I thought it was this month of January.",
        "content": "what the deal with netflix taking their time release our favorite shows we likes. anyone else feel that way?",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1i6mnj0/i_wish_netflix_could_hurry_with_ginny_and_georgia/"
    }
]