[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 48,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qp894z",
        "author": "Salty_Pangolin_6163",
        "title": "Netflix Faces Backlash After Famous Climber Discloses Low Pay For 500-Meter Skyscraper Climb",
        "content": "",
        "upvotes": 839,
        "comments": 202,
        "media": null,
        "permalink": "/r/netflix/comments/1qp894z/netflix_faces_backlash_after_famous_climber/"
    },
    {
        "id": "1qohkbx",
        "author": "IncompleteBM",
        "title": "Which Netflix shows should’ve been cancelled earlier?",
        "content": "In contrast to the “which shows were killed too soon?” discussion.  \n\nI’ll say that:\n\n“You” - I thought it peaked at season 2. Season 3, ok fine. After that? Ridiculous. \n\n“Stranger things” - yeah, lots of hype. It’s been on way too long and is a shell of itself. \n\n“Emily in Paris” - “fun” escapist show for a couple seasons. Not sure what the point of it is now. \n\n“In the dark” - I know it wasn’t a Netflix produced show but it’s obviously had more viewership on there. It should’ve ended at season 3. \n",
        "upvotes": 381,
        "comments": 240,
        "media": null,
        "permalink": "/r/netflix/comments/1qohkbx/which_netflix_shows_shouldve_been_cancelled/"
    },
    {
        "id": "1qopzzl",
        "author": "No-Description-2138",
        "title": "‘Star Search’ Fails To Break Through For Netflix",
        "content": "",
        "upvotes": 119,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1qopzzl/star_search_fails_to_break_through_for_netflix/"
    },
    {
        "id": "1qpcfrt",
        "author": "Different-Ice-8703",
        "title": "Is Frieren not available in English DUB/SUB on Netflix? Can anyone please comfirm?",
        "content": "It only gives two options for audio, my country's native language and Japanese and there is no option for SUB. I have never watched anime in my native language so it will take time to adjust... I really wanna watch it in Japanese with English SUB. My region is India btw so if anyone from India can check for me, I would be grateful. Also, the anime was released in 2023 so it feels weird that there is no SUB...",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qpcfrt/is_frieren_not_available_in_english_dubsub_on/"
    },
    {
        "id": "1qolg2p",
        "author": "cheno103",
        "title": "Love on the Spectrum quietly renewed for 5th season as producers make 3 big changes to Netflix reality show",
        "content": "",
        "upvotes": 120,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qolg2p/love_on_the_spectrum_quietly_renewed_for_5th/"
    },
    {
        "id": "1qp09fk",
        "author": "MediocrePiece1267",
        "title": "Getting surgery next week and need a new series to binge.",
        "content": "What’s the last show you couldn’t stop watching? \n\nFor me, the two that come to mind are Breaking Bad and Better Call Saul. Ozark was great- just third tier compared to these two. \n\nWhat do you suggest?",
        "upvotes": 14,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1qp09fk/getting_surgery_next_week_and_need_a_new_series/"
    },
    {
        "id": "1qoewi2",
        "author": "Deep20779",
        "title": "Which Netflix shows got cancelled way too early and were seriously underrated?",
        "content": "Netflix cancels a lot of stuff, but some shows really didn’t deserve it.\n\nFor me, it’s Locke &amp; Key — great concept, solid world-building, and it felt like it still had so much story left to tell.\n\nCurious what everyone else thinks — which cancelled Netflix show do you think was underrated and ended too soon?",
        "upvotes": 183,
        "comments": 729,
        "media": null,
        "permalink": "/r/netflix/comments/1qoewi2/which_netflix_shows_got_cancelled_way_too_early/"
    },
    {
        "id": "1qpg5h8",
        "author": "Due_Signature_1137",
        "title": "Is it just me or did the 2nd season of Sandman feel a bit \"rushed\"? it was an epic show nonetheless but still lucifer's arc didnt feel much connected to what we got to see in the finale of season one...",
        "content": "Is it just me, or did Season 2 of Sandman feel a little rushed? I still enjoyed it overall and I’m not saying it was bad (nein, not at all), but something about the pacing felt off compared to Season 1. In the first season, everything had time to breathe like characters, motivations, even silence mattered. Season 2 felt more like “okay, next plot point, next scene” without letting things fully settle.\n\nLucifer especially stood out to me. After how intense and meaningful the finale of Season 1 was, I expected that arc to have more weight or long-term impact. Instead, it felt kind of disconnected, like der buildup didn’t fully pay off. Not bad, just… lighter than expected.\n\nI’m not a hardcore Sandman fan or comic reader, so maybe that’s part of it. Still, as a casual viewer, the shift was noticeable. The ideas were cool, the visuals were great, but the emotional glue wasn’t always there. Maybe I’m overthinking it (ja, possible), but I’m curious if others felt the same or if this is just how the story goes.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qpg5h8/is_it_just_me_or_did_the_2nd_season_of_sandman/"
    },
    {
        "id": "1qopf7k",
        "author": "No-Description-2138",
        "title": "Alex Honnold's Taipei 101 Climb Attracts 6.2M Views On Netflix",
        "content": "",
        "upvotes": 36,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1qopf7k/alex_honnolds_taipei_101_climb_attracts_62m_views/"
    },
    {
        "id": "1qo513x",
        "author": "Illrollonshabbos",
        "title": "Watch Secret Mall Apartment …",
        "content": "I went by this several times before I finally had to stop and see what it was about. The trailer doesn’t do it justice. Just when I think I’ve seen everything a gem like this appears. ",
        "upvotes": 345,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1qo513x/watch_secret_mall_apartment/"
    },
    {
        "id": "1qol58c",
        "author": "Lucariusssss96",
        "title": "What do you think of The OA?",
        "content": "I’ve always wanted to watch this show but I know that it’s been discontinued. \n\nIs it still worth watching despite it being cancelled?\n\nHow did you feel after watching the show? Do you think it’s life changing?? ",
        "upvotes": 37,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1qol58c/what_do_you_think_of_the_oa/"
    },
    {
        "id": "1qp2i93",
        "author": "Time-Education2710",
        "title": "Limited series",
        "content": "Are people forgetting about \"The Island\" and \"Manic\" and \"Red Rose\" and \"Chambers\" people keep bringing up \"Behind Her Eyes\" and saying it’s better than \"His and Hers\" also being the best limited series but they are forgetting other ones.",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qp2i93/limited_series/"
    },
    {
        "id": "1qpfigj",
        "author": "Competitive_Gene_898",
        "title": "Netflix Can’t Afford Another Long Wait for Wednesday Season 3",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qpfigj/netflix_cant_afford_another_long_wait_for/"
    },
    {
        "id": "1qp2vka",
        "author": "False-Succotash-8870",
        "title": "Finding Her Edge",
        "content": "i'll be honest, this is one of the few shows i watched that delivered peak intimacy without sex. adriana and braydens chemistry was insane.\n\nand honestly, even though s2 opens up alot of possibilities for cheating, which i absolutely detest, i need them to get back together!!\n\ncale ambrozic is really good looking, ngl. and the scene where he looks up after they all crash on the ice, he actually looks like joseph zada which is funny because they hook up on we were liars. (i was wondering why brayden looked familiar).",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qp2vka/finding_her_edge/"
    },
    {
        "id": "1qp6lcs",
        "author": "BeautifulCase5743",
        "title": "Does anyone else feel like Netflix releases way too many shows now?",
        "content": "It honestly feels like Netflix just throws new shows at the wall nonstop to see what sticks. Every time I open the app, there’s something “brand new,” and half of it feels gone a month later.\n\nThe worst part is getting invested in a show, only to find out it’s quietly canceled because it didn’t blow up in the first two weeks. It makes me hesitate to start anything that isn’t already confirmed for multiple seasons.\n\nI get that variety is nice, but at this point it feels more overwhelming than exciting. Fewer shows with better promotion and longer breathing room might actually make the platform stronger.\n\nAm I just getting old, or does anyone else feel the same way?",
        "upvotes": 0,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1qp6lcs/does_anyone_else_feel_like_netflix_releases_way/"
    },
    {
        "id": "1qo6f7b",
        "author": "TriggeredEvil",
        "title": "How did you feel about His &amp; Hers?",
        "content": "Did anyone else feel kind of bored or confused at first watching His &amp; Hers?\nThe first couple episodes felt slow and a bit odd to me and I almost stopped watching, but I’m glad I didn’t because I actually really liked the ending. It was so unexpected.\nI just wish the earlier episodes had done more to keep my attention. Curious what everyone else thought about it.",
        "upvotes": 102,
        "comments": 143,
        "media": null,
        "permalink": "/r/netflix/comments/1qo6f7b/how_did_you_feel_about_his_hers/"
    },
    {
        "id": "1qonj16",
        "author": "Lavender-Donut-",
        "title": "Run Away - what a mess?",
        "content": "I just finished the series, and it was such a mess. I don't even know how to describe the disappointment. It just felt a waste of time. \n\nDid anyone else feel the same? ",
        "upvotes": 9,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qonj16/run_away_what_a_mess/"
    },
    {
        "id": "1qp3uzx",
        "author": "No-Assistant6369",
        "title": "The new legends of Monkey",
        "content": "Wow, so many rules.  \nI can't even mention certain terms without them being removed by a bot.  Well then, how about my take on this show?\n\nOkay, so firstly I commend the effort to have a very quirky and different type of story telling. I am unfamiliar with this universe, so I had an open mind. Quickly I noticed that the acting, while over the top at times, was actually pretty good, but there are things in it that make me wonder about the writers.  \nSecondly but also possible spoiler if you read this first but holy carp a DINO EGG?! Come on. Not a fireball, not a rematerialization, no not at all instead a rather round huge egg way far off from where the group was...very interesting direction leaving it open to possibly another chapter however strange of a twist, which I am not gonna lie, I would watch it too.\n\nThis feels more like a anime with less over the top action than a real motion show...it is strange and satirical at times and I am not sure it was meant to be...\n\nI really love that farm hand in the one scene was Hammish from Viva La Dirt League over on youtube. Honestly some of the VLDL crew are wonderful actors and so fun.\n\nI guess if I was giving it a rating I would probably rate this as a solid 8 out of 10, but add a bonus point for the naivety of the entire thing. Normally something like this would not hit but somehow works with this series. SO deal with a 9 out of 10. If you want that last single digit point you are gonna have to make another season!\n\nSecond time posting this, hope it does not get auto removed this time.\n\nThanks.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qp3uzx/the_new_legends_of_monkey/"
    },
    {
        "id": "1qoyw2w",
        "author": "LegitimateCurve8525",
        "title": "Netflix Animation Studios joins the Blender Development Fund as Corporate Patron — Blender",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qoyw2w/netflix_animation_studios_joins_the_blender/"
    },
    {
        "id": "1qp2p0b",
        "author": "athiest_classyguy",
        "title": "Household issue on mobile internet",
        "content": "So I am using netflix on four different networks, my two mobile network sim and two wifi (home and office) but only on three devices, my laptop, mobile and tv. How can I make the stupid netflix understand that people are supposed to be in diffrent places of the same city in a given day ? Like i cant use my mobile internet since it's much faster with 5G coz my household is wifi it seems. Is there any way we can add devices or locations instead of IP address ? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qp2p0b/household_issue_on_mobile_internet/"
    },
    {
        "id": "1qoxf82",
        "author": "sweetmaggiesan",
        "title": "Netflix Animation Studios joins the Blender Development Fund as Corporate Patron",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qoxf82/netflix_animation_studios_joins_the_blender/"
    },
    {
        "id": "1qp5y7h",
        "author": "Southern-Brother5693",
        "title": "Take That - The Documentary Series (2026)",
        "content": "Watched all 3 eps of this yesterday.\n\nI have only a passing interest in BritPop, but I recognised a lot of the songs that the Band did. They sounded so familiar. The entire series is voiced by Gary Barlow (He's more or less the main character here), Robbie Williams and the rest of Take That.\n\nA fairly standard tale of how they peaked and (with the exception of Robbie Williams) dropped to obscurity when they broke up. It was cool seeing how their reunion tour revitalised their careers again. I wasn't aware the band has been active for the past 10 years.\n\nDidn't Robbie Williams have a biopic movie last year? I remember it flopping because nobody knows who he is in the States. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qp5y7h/take_that_the_documentary_series_2026/"
    },
    {
        "id": "1qoufk9",
        "author": "Scottishvillanelle",
        "title": "Internet gaslighting me!",
        "content": "The internet tells me ALL seasons of Good Doctor are on Netflix UK but i can only watch 1-5 ? Where are 6&amp;7? Help I just finished s5 and desperate to watch next two seasons. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qoufk9/internet_gaslighting_me/"
    },
    {
        "id": "1qoypfl",
        "author": "billybankrs",
        "title": "Glitches Anyone?!",
        "content": "anyone having issues attempting to use Netflix? it will not let me navigate to the right at all, I can get two shows over and it whips back to the start of the list. Try to play whatever show is first in the line, does the same thing but for the thumbs down and barely lets you navigate away for five seconds. Try to watch a show, just reverses to the beginning and kicks you out. I’m going to scream; I’ve tried everything. persistent for two days now",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qoypfl/glitches_anyone/"
    },
    {
        "id": "1qo1zuo",
        "author": "Danaeger",
        "title": "Why are there never any subtitles when characters are speaking in foreign languages?",
        "content": "Watching Homeland right now and whenever anyone speaks Arabic zero subtitles.\n\nI suppose you’d expect this to be included in the original media, but still annoying as fuck.\n\nAlso for Homeland specifically, enabling subtitles changes the position depending on the scene.\n\nBottom left, bottom right, some text on the left and some text on the right? WTF?! Why not keep it centred?\n\nI would upload a photo but I can’t here.. check it out for yourselves.. strange as fuck.",
        "upvotes": 56,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1qo1zuo/why_are_there_never_any_subtitles_when_characters/"
    },
    {
        "id": "1qow8c2",
        "author": "pottehd",
        "title": "Culinary Class Wars S2 — Talented ≠ Likeable? (No spoilers pls)",
        "content": "I’m still in the middle of Culinary Class Wars Season 2, so please no spoilers on the winner 🙏\n\nThat said… is it just me, or is there that one chef who is undeniably insanely talented but comes off way too arrogant? Like yes, the skills are there, the plates are clean, the concepts are strong — but the attitude toward teammates, judges, or even the process itself kinda ruins the experience for me.\n\nI get that confidence is important in a competition like this, but there’s a thin line between confidence and straight-up ego. Sometimes it feels less like passion and more like looking down on everyone else.\n\nCurious what you all think:\n\nDoes attitude matter to you in shows like this, or is skill everything?\n\nDo you think arrogance is just editing… or part of their real personality?\n\nHave you ever ended up rooting against someone despite their talent?\n\nAgain, no spoilers please, I’m still watching 😅",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qow8c2/culinary_class_wars_s2_talented_likeable_no/"
    },
    {
        "id": "1qp6dtb",
        "author": "BeautifulCase5743",
        "title": "Which Netflix show got canceled way too early? Mindhunter still hurts.",
        "content": "I’m still not over Netflix canceling Mindhunter. The atmosphere, the writing, the performances, everything felt so carefully crafted, and it seemed like the story was just getting started.\n\nIt had so much long-term potential, especially with the real-life cases they were building toward.\nAnyone else still disappointed about this one? What Netflix show do you think ended far too soon?",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qp6dtb/which_netflix_show_got_canceled_way_too_early/"
    },
    {
        "id": "1qosywg",
        "author": "No_Pop7296",
        "title": "Companion website to Dark?",
        "content": "I’m giving Dark another shot. I don’t mind the subtitles at all, I love the Scandi murder mystery shows and the Korean romcom. I think it got too convoluted for me the first time around and I was having trouble keeping track of who’s who, especially since there are so many teens and flashbacks. Someone had posted a companion website that mapped out all the different characters and family lines. Can’t find it, can someone please repost? TIA ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qosywg/companion_website_to_dark/"
    }
]