[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 550,
        "comments": 4188,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nddsmr",
        "author": "punchtheface",
        "title": "Kaos - What a disappointment!",
        "content": "Not in the show of course, but disappointed I am to hear it was cancelled and we may never reach a conclusion. I loved every minute of it. It was such an authentic and original take on a story as old as we can remember.\n\nThe cast was amazing, every character was so rich and engaging I could not honestly pick a favourite… apart from Dionysus of course.\n\nI was wondering what the majority of people felt about it though, it appears to not have drawn in the audience numbers to keep going.",
        "upvotes": 45,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nddsmr/kaos_what_a_disappointment/"
    },
    {
        "id": "1nczjt7",
        "author": "CitygirlCountryworld",
        "title": "Need a Recommendation to watch as a couple that husband likes",
        "content": "Hey all, \nWhat do you recommend my husband and I watch next. (It doesn’t even have to be Netflix). My husband liked: \n- Justified \n- Yellowstone/1923 (1889 was too dreary) \n- Reacher \n- Prison Break \n- Outlander \n- Ozark\n- American Primeval \n- Narcos\n- Queen of the South \n- Landman \n- Tulsa King\n- We couldn’t get into Breaking Bad but could try again. (Life interfered and then we got out of it) \nPlease give any suggestions you might have for us! :) \n\n ",
        "upvotes": 35,
        "comments": 265,
        "media": null,
        "permalink": "/r/netflix/comments/1nczjt7/need_a_recommendation_to_watch_as_a_couple_that/"
    },
    {
        "id": "1ndh6th",
        "author": "Top-Three-USA",
        "title": "From Spice Girl to style icon, Victoria Beckham shares her journey in a new Netflix docuseries premiering October",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ndh6th/from_spice_girl_to_style_icon_victoria_beckham/"
    },
    {
        "id": "1nddxn0",
        "author": "Official_vegito",
        "title": "Exciting titles upcoming on Netflix",
        "content": "Hi, is anyone aware of the upcoming exciting shows on Netflix? I am specifically looking for crime thriller based shows which may be coming up on Netflix exclusively ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nddxn0/exciting_titles_upcoming_on_netflix/"
    },
    {
        "id": "1ndds2r",
        "author": "youryoungversion",
        "title": "Cobra Kai 🐍",
        "content": "I just finished watching the entire 6 seasons in just 2 days. Man, what an amazing series. Loved everyone’s role.\n\nIt does make you feel badass from the get go! #CobraKaiNeverDies 👊🏻",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ndds2r/cobra_kai/"
    },
    {
        "id": "1ncn0hz",
        "author": "ZestycloseFig4025",
        "title": "Ever wish your doctor explained things like Shaun does?",
        "content": "I been watching The Good Doctor and it really got me thinking about how rare it is to have a doctor who actually takes the time to explain things clearly. Shaun walks patients through their options breaks down complicated medicalinfo and never talks down to them its the kind of care a lot of people just don’t experience in real life. Most appointments I had feel rushed Lab results get thrown at me with no explanation or I get a quick everything looks fine with zero context. It leaves a lot of questions hanging and makes it hard to know what to do next or what even matters.Thats part of what led me to try out EurekaHealth. It’s an AI tool that’s built specifically for health questions not just general chatbot stuff. I use it to make sense of test results, get second opinions based on visit notes, and ask follow up questions I didn’t get to bring up during appointments.  \nWatching The Good Doctor just kind of reinforced how helpful it is to have something that brings that kind of clarity and support into real life even if its through tech.",
        "upvotes": 85,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ncn0hz/ever_wish_your_doctor_explained_things_like_shaun/"
    },
    {
        "id": "1nd9q1t",
        "author": "-hwaberry",
        "title": "Netflix automatically looping movies?",
        "content": "Recently has anyone else found that netflix is automatically repeating what they just watched? I had Kpop Demon Hunters on the other day while doing something, and then it just played it again, and bc I just had it on in the background I was like okay sure I'll watch it again, and then it looped it a third time, so it seems my netflix will just continually repeat movies now, is it a glitch or a new feature??? I've never had it automatically repeat before so I'm just curious 😂",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nd9q1t/netflix_automatically_looping_movies/"
    },
    {
        "id": "1ncag2d",
        "author": "powcatnipdoll",
        "title": "The new layout of Netflix is so lame",
        "content": "One of the most iconic things about Netflix was their distinct layout compared to other streaming platforms and now it looks boring, it doesn’t feel iconic anymore, plus the amount of disappointing not good shows, Hulu and Disney hotstar might just be better idk",
        "upvotes": 482,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1ncag2d/the_new_layout_of_netflix_is_so_lame/"
    },
    {
        "id": "1ndfz91",
        "author": "hestooopinionated",
        "title": "Love Con Revenge Is A Joke",
        "content": "I thought this documentary series was a joke and I was surprised to Cecilie again, but I guess she would be an expert in this subject since she willingly gave away all her money too. ",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9t6v8f4hmcof1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ndfz91/love_con_revenge_is_a_joke/"
    },
    {
        "id": "1nd4iyt",
        "author": "steffi8",
        "title": "Downloaded content survives an upgrade to iPadOS26?",
        "content": "I'm traveling at the moment and have content downloaded on my iPad but I don't want to upgrade iPadOS to iPadOS26  if there's any chance that the content may no longer work afterwards. Does Netflix have any history of invalidating (intentionally or otherwise) downloaded content due to iPadOS upgrades?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nd4iyt/downloaded_content_survives_an_upgrade_to_ipados26/"
    },
    {
        "id": "1ncxa7b",
        "author": "harshdavra",
        "title": "Just watched Sweet Bobby: My Catfish Nightmare and I’m mind blown",
        "content": "I just finished watching Sweet Bobby and I’m shocked. How is it even possible for someone to catfish like this for years without being caught?\n\nThere are things that just don’t add up. Bobby supposedly lived only about an hour away from Kirat yet she never managed to meet him in person or even properly google him? In today’s world that feels almost impossible.\n\nAnd then the layers of fake accounts, the endless lies, the way he kept the story alive for so long… it’s wild. Was there someone else involved helping him cover tracks? Or was Bobby just that good at manipulation?\n\nAlso makes me wonder how many red flags got ignored or brushed off. Did he have access to some kind of insider info about her life? How did he always know what to say to keep her hooked?\n\nHonestly it almost feels bigger than a one-person catfish. Either he was way too clever or there’s more to the story that’s never been revealed.\n\nAnyone else feel like some pieces are missing here?",
        "upvotes": 12,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1ncxa7b/just_watched_sweet_bobby_my_catfish_nightmare_and/"
    },
    {
        "id": "1nd6hvm",
        "author": "DraterTheTaurus",
        "title": "Any shows like Riverdale?",
        "content": "I really like mystery shows where you’re trying to figure out who the criminal is. But I also really like the drama aspect of shows. Something i didn’t love about riverdale was the over sexualized teenagers but beyond that i really enjoyed the show and the mysteries and the dynamics of all the characters and just the characters themselves. I need more shows similar to that. Please!!",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nd6hvm/any_shows_like_riverdale/"
    },
    {
        "id": "1nd6rxf",
        "author": "zephyr822",
        "title": "Suggestions about \"You\"",
        "content": "Hi everyone. I have been recently thinking about watching \"You\" but I am not sure if it is worth it. The kind of person I am, I always try to avoid shows that are being talked about and created hype for but \"You\" feels like something that resonates with me and I feel it could be a good watch. What are you opinions/suggestions about it? Is it suspenseful?",
        "upvotes": 0,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1nd6rxf/suggestions_about_you/"
    },
    {
        "id": "1nbwkfu",
        "author": "Elegant-Spare6527",
        "title": "Nothing worth watching",
        "content": "Netflix used to be the bomb. For months, and it's getting worse, there is very literally nothing worth watching. Anything new is likely some 3rd rate movie with subtitles and actors you've never heard of. Or passing off as new, movies from years ago. Used to look forward to checking each day for something good (and there was always something new). Now. Just sucks! What happened?! ",
        "upvotes": 529,
        "comments": 168,
        "media": null,
        "permalink": "/r/netflix/comments/1nbwkfu/nothing_worth_watching/"
    },
    {
        "id": "1ncrvfx",
        "author": "Ami_geas0111",
        "title": "Dept Q",
        "content": "So in Netflix’s Dept.Q, Merritt’s kidnapping was hinted to be tied to corruption and pressure from powerful people. Same with Sam Haig’s case getting closed as suicide while other evidence suggested otherwise. But by the end it feels like that whole corruption angle related to the kidnapping is just dropped. Did I miss something, or is this just a loose end the show never explained?\n\n",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ncrvfx/dept_q/"
    },
    {
        "id": "1ndbmsd",
        "author": "KaceyLunatic",
        "title": "I wonder if lau-ryn is still getting texts from you know who",
        "content": "Even with Ken-dra being caught wonder if shed want to start it back up. I'd bet there was copy cats when the news broke and idk addiction is hard to stop cold turkey.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ndbmsd/i_wonder_if_lauryn_is_still_getting_texts_from/"
    },
    {
        "id": "1ndc4cl",
        "author": "NiceChokra",
        "title": "Many of you don't know but Dr. Jack Abbott is elder brother of Colonel Carrillo.",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ndc4cl/many_of_you_dont_know_but_dr_jack_abbott_is_elder/"
    },
    {
        "id": "1ncx3v1",
        "author": "LouisTully9000",
        "title": "Chaos, Brothers, and Black Rabbit Stew on Netflix",
        "content": "Netflix, ever the overeager valedictorian of the Streaming High School Class of 2025, continues its tradition of slamming down original series the way an overcaffeinated sous-chef slams espresso shots before brunch service. Every month, the platform releases a new parade of shows, documentaries, and limited-run experiments that suggest some poor junior executive has a spreadsheet labeled “CONTENT = GOD.” And you know what? It works. The business is good. The business, in fact, is booming.\n\nThe streamer has always had a soft spot for Jason Bateman, who, after perfecting the art of deadpan futility on ***Arrested Development***, decided to go full Walter White Lite with ***Ozark****,* a show so darkly violent it made money laundering look almost quaint. Bateman didn’t just star in it; he co-created, directed, and sprinkled his Bateman-brand sardonic seasoning all over it. That partnership was too profitable to end with ***Ozark***, so naturally, Netflix backed the truck up for another project. One that feels like ***Ozark*****’s** younger, cooler, slightly better-dressed sibling.\n\nEnter ***Black Rabbit***, an eight-episode limited series created by Zach Baylin, who previously wrote ***King Richard***, ***Creed III***, and ***The Order***. This time, Bateman teams up with Jude Law for a story about estranged brothers, set against the backdrop of a Manhattan hotspot so exclusive that you, yes you, will never get a reservation no matter how many points you’ve hoarded on Resy...",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ncx3v1/chaos_brothers_and_black_rabbit_stew_on_netflix/"
    },
    {
        "id": "1nd479d",
        "author": "insightwithdrseth",
        "title": "Why Smart, Successful Women Fall for Love Scams: A Psychologist Breaks I...",
        "content": "Why smart, successful women fall for romance scams or con men -- Netflix's Love Con Revenge is just the latest show on the topic.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nd479d/why_smart_successful_women_fall_for_love_scams_a/"
    },
    {
        "id": "1ncf6rd",
        "author": "rmajor86",
        "title": "\"This account is not authorised to view recently released titles\" - I get this error on ALL devices - phone, laptop and TV. Help! (Info in body text)",
        "content": "I can watch older content, but cannot watch anything marked as \"recently added\". I have a Premium plan. I can stream in UHD with HDR etc, but any time I go to watch things that are marked \"recently added\" it says I can't watch them. This is fairly new, certainly I watched the new (half) season of Wednesday when that came out.\n\n\nThe E100 error would suggest that there's maybe a cacheing issue or something similar, but I've not used my laptop to stream in a very, very long time, there's no cache there, and like I say, its only 'Recently added\" stuff that gives this problem.\n\nI've tried streaming lots of older stuff - works great.\n\n\nI've tried streaming a variety of \"recently added\" - the same error.\n\n\nAny advice or help? I briefly tried the online chat, but they just wanted me to reset my TV, and that's obviously not going to fix what would appear to be an account level issue.\n\n\nETA - this happens on my home WiFi, as well as on 4G/5G.\n\n\nHelp!",
        "upvotes": 11,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ncf6rd/this_account_is_not_authorised_to_view_recently/"
    },
    {
        "id": "1ncwzj9",
        "author": "Formal_Fig1078",
        "title": "Netflix aint working",
        "content": "Soo today i opend netflix to watch a series and when i went to see the episode i got a erro 5.8, the netflix site said it was something to do with storage problems.\nSoo i was like, i will watch later, maybe the error will be gon by then, it isnt.\nI searched a bit and seems like uninstalling does the work, and it did, but only as long as i dont close the phone or app .\nAnd i dont wanna unistall every time i finish watching something.\nYou guys get the problem right?\nDoes anyone know how to fix this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ncwzj9/netflix_aint_working/"
    },
    {
        "id": "1nblgi9",
        "author": "Deanno0",
        "title": "List the best true crime documentary’s on Netflix",
        "content": "List the best true crime documentary’s on Netflix it can be either a movie or a series just list something that’s actually like a bizarre twist or a crazy story !!! Thanks everyone ",
        "upvotes": 569,
        "comments": 458,
        "media": null,
        "permalink": "/r/netflix/comments/1nblgi9/list_the_best_true_crime_documentarys_on_netflix/"
    },
    {
        "id": "1ncwacx",
        "author": "seb135",
        "title": "A lot of Will Smith movies on Netflix Netherlands suddenly",
        "content": "All of a sudden there are a lot of Will Smith movies on Netflix Netherlands. And I mean A LOT. Pretty sure they weren't there before. Did anyone notice this in other countries as well? It almost feels like it's a promotional campaign or something. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ncwacx/a_lot_of_will_smith_movies_on_netflix_netherlands/"
    },
    {
        "id": "1ncwa09",
        "author": "TimmyVoyage",
        "title": "Lots of shows disappeared",
        "content": "Last night i was watching both House MD and Dexter (I live in the UK) and everything was fine. Today, I turn on my tv and both these shows along with many others have disappeared. When i search for them I receive nothing, not even the ‘we don’t have this title’ thing. I look online and the shows seem to still be on netflix UK just fine. I don’t have the account password so I can’t risk logging out. What can I do?\nThanks",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ncwa09/lots_of_shows_disappeared/"
    },
    {
        "id": "1ncuz8n",
        "author": "gregwaterloo",
        "title": "Keep needing to add TVs / Fire sticks back to household",
        "content": "Support has been of no help. I am going to error on the side of supplying to much information. \n\nI have an EERO 3 node mesh network, 4 fire sticks and one smart TV running Netflix, and one wifi only IPad. \n\nAll devices are on wifi. \n\nI have confirmed that there are no devices part of my household that are not on my network. \n\nSeemingly at random, I need to add devices back to the household. Not all at once. Just one every couple days.  \n\nSupport has twice reset my household, requiring me to logon to each device again and re-add it to the household. It seemed to help for a week or so. \n\nAny thoughts?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ncuz8n/keep_needing_to_add_tvs_fire_sticks_back_to/"
    },
    {
        "id": "1nc3jau",
        "author": "dat-bitch16",
        "title": "best documentaries",
        "content": "what are the best/most controversial documentaries on netflix? im looking for ones similar to the train wreck series, tinder swindler, things like that",
        "upvotes": 49,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1nc3jau/best_documentaries/"
    },
    {
        "id": "1ncdjgi",
        "author": "Artdiction",
        "title": "Worst Roommate Ever left out the nuance: Jamison Bachman wasn’t just a villain — losing his pets may have triggered his collapse”",
        "content": "Honestly, I think Worst Roommate Ever made Jamison Bachman look way too one-dimensional. Yes, he was manipulative and parasitic for decades, but he wasn’t openly violent until very late in life. What really stood out to me was how things escalated after he lost his pets.\n\nThe dog being taken away, the court banning him from having animals, then the cat dying while he was in jail — those weren’t small things. Pets may have been his only real anchor, the only beings that didn’t reject him. Once those were gone, plus his reputation in court and his brother refusing to house him, he basically collapsed.\n\nThat’s why I don’t fully buy the “he killed his cat” angle — if he was such a bad pet parent, why were his animals alive and well for years? To me it feels more like two unstable people clashing (the last roommate probably had her own issues) until it became explosive. His suicide in jail also says a lot — not a guy who loved life ruining others, but someone full of self-hatred once stripped of control. Netflix flattened him into a villain, but the real story feels way more tragic and complicated.\n\nIf you look at people like Ricky Morrisey who scammed women and abandoned his dog, or con man like Todd Dean, that’s much colder and more psychopathic than Bachman, who at least took care of his pets. Bachman spiraled after losing them, which shows he had attachments — twisted, yes, but real.\n\nWhat do you guys take on this? Why did the latest roommate took his dog? Some Reddit posts even suggest she had her own issues (e.g. drugs), which would make this more of a “two unstable people colliding” tragedy. If this was handled better, perhaps his brother’s life can be saved. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ncdjgi/worst_roommate_ever_left_out_the_nuance_jamison/"
    },
    {
        "id": "1nbryhq",
        "author": "PinEasy2215",
        "title": "Love on the Spectrum tears",
        "content": "I had this fight with my partner that started because I didn’t reply to a text for like 5 hours. I was deep in a task and totally lost track of time but he took it as me being cold or avoiding blla bllaa It escalated way more than it should. That night I threw on Love on the Spectrum to distract myself and there was this one woman who said something like Sometimes I feel like I love people wrong. And I just started crying cuz its how i feel [sometimes.Im](http://sometimes.im/) def doing everything I can but it lands wrong anyway. Why is it so easy to be misunderstood when youre doing your best? How do you explain that quiet doesnt mean distant and space doesnt mean disinterest?  \n  \nThe next day I put on an episode of Couples Therapytotal emotional spiral I know and Dr. Orna was working with this couple where one partner kept shutting down emotionally and said something like Its not that you dont feel it’s that youre overwhelmed by feeling and freeze. And HOLY HELLL !!! I paused it and just sat there. It was my mirror, exactly me. Not cold just flooded. Weve been trying to work on things since. I use OurRitual on my own sometimes to help get thoughts straight before we talk it’s structured but I still have moments where I feel like Im speaking an emotional dialect no one else quite understands.He still gets frustrated and I still shut down. We havent solved it at times I still avoid my phone for half a day and brace for the guilt when I finally open it but I’m not pretending its nothing anymore. That’s new.",
        "upvotes": 74,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1nbryhq/love_on_the_spectrum_tears/"
    },
    {
        "id": "1ncdlaj",
        "author": "UrthMayn",
        "title": "A worse plot hole I noticed in supacell:",
        "content": "something that’s irked me is that their abilities came outta nowhere. like yeah yeah they got powers cause of sickle cell hence why it’s called supacell but like it’s not like sickle cell is like cancer where it comes from radiation or sum else it’s an inherited genetic mutation, why didn’t their powers just be a thing already like laying dormant in them? The thing that’s annoying is there were people with powers in the very first sequence of episode 1 (a healer was tryna escape the organization’s facility) and all their powers come in randomly later on at like different times (or I guess the same time technically cause it was different episodes but that’s… kinda worse?!) Likee when the series kicks off they all randomly just acquire abilities this late in their lives with no rhyme or reason even though though sickle cell is a genetic mutation you inherit since birth and it’s been established that there are already people with powers being held captive by the evil org feels a bit (immensely) hard for me to suspend disbelief ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ncdlaj/a_worse_plot_hole_i_noticed_in_supacell/"
    },
    {
        "id": "1nc0mpq",
        "author": "Ravenmn",
        "title": "Orphan Black - good memories!",
        "content": "Has anyone tried it yet? I loved this show and just watched the first episode. So good! Great set up. Interesting throughout and what an amazing ending!",
        "upvotes": 15,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nc0mpq/orphan_black_good_memories/"
    }
]