[
    {
        "id": "1mqlho1",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Nobody 2) plus Throwback discussions",
        "content": "**New In Theaters**:\n\n* [Nobody 2](https://old.reddit.com/r/movies/comments/1mqleeh/official_discussion_nobody_2_spoilers/?)\n* [Americana](https://old.reddit.com/r/movies/comments/1ms61l4/official_discussion_americana_spoilers/?)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [The Replacements](https://old.reddit.com/r/movies/comments/1mqleft/official_throwback_discussion_the_replacements/?)\n\n* [Autumn in New York](https://old.reddit.com/r/movies/comments/1mqlegy/official_throwback_discussion_autumn_in_new_york/?)\n\n**Still In Theaters**:\n\n* [Weapons](https://old.reddit.com/r/movies/comments/1mkiuk7/official_discussion_weapons_spoilers/?)\n* [Freakier Friday](https://old.reddit.com/r/movies/comments/1mkiuo4/official_discussion_freakier_friday_spoilers/)\n\n* [The Naked Gun](https://old.reddit.com/r/movies/comments/1mek6y9/official_discussion_the_naked_gun_spoilers/?)\n* [The Bad Guys 2](https://old.reddit.com/r/movies/comments/1mek6zd/official_discussion_the_bad_guys_2_spoilers/?)\n* [The Fantastic Four: First Steps](https://old.reddit.com/r/movies/comments/1m8n0ic/official_discussion_the_fantastic_four_first/?)\n\n\n\n**New On Streaming:**\n\n* [Fixed](https://old.reddit.com/r/movies/comments/1ms61cu/official_discussion_fixed_spoilers/?)\n* [Night Always Comes](https://old.reddit.com/r/movies/comments/1ms61j7/official_discussion_night_always_comes_spoilers/?)\n* [War of the Worlds (2025)](https://old.reddit.com/r/movies/comments/1mek72y/official_discussion_war_of_the_worlds_spoilers/?)\n* [Happy Gilmore 2](https://old.reddit.com/r/movies/comments/1m9hjw9/official_discussion_happy_gilmore_2_spoilers/?)\n* [Heads of State](https://old.reddit.com/r/movies/comments/1lr5yb4/official_discussion_heads_of_state_spoilers/?)\n* [The Old Guard 2](https://old.reddit.com/r/movies/comments/1lr5ycn/official_discussion_the_old_guard_2_spoilers/?)\n* [Ice Road: Vengeance](https://old.reddit.com/r/movies/comments/1lr5ye1/official_discussion_ice_road_vengeance_spoilers/?)\n* [KPop Demon Hunters](https://www.reddit.com/r/movies/comments/1lghony/official_discussion_kpop_demon_hunters_spoilers/)",
        "upvotes": 35,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1mqlho1/official_discussion_megathread_nobody_2_plus/"
    },
    {
        "id": "1mtzpv3",
        "author": "SanderSo47",
        "title": "August 15-17 Box Office Recap – 'Weapons' repeats at #1, dropping just 44% on its second weekend and earning $148M worldwide. 'Nobody 2' debuts with a so-so $9.2M domestically and $14.2M worldwide. 'Demon Slayer: Kimetsu no Yaiba Infinity Castle' destroys animated records in Southeast Asia.",
        "content": "https://preview.redd.it/l1fxx7r5mujf1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=c16883f9d3a2869584465ec43316fb4eb7c984f0\n\nIn a quiet weekend, ***Weapons*** easily held the top spot, with a better-than-usual drop for a horror title. ***Nobody 2*** also made its way to theaters, but its numbers were quite disappointing. And audiences pretty much showed zero interest in Lionsgate's ***Americana***, which had a very poor debut in over 1,000 theaters.\n\nAnd just outside America, ***Demon Slayer: Kimetsu no Yaiba Infinity Castle*** destroyed so many records in its first markets outside Japan, indicating there's gonna be another monster hit about to be unleashed.\n\nThe Top 10 earned a combined $83.1 million this weekend. That's down a rough 37.9% from last year, when ***Alien: Romulus*** debuted.\n\nRepeating at #1, WB's ***Weapons*** earned $24.4 million this weekend. That's down just 44%, which is quite great for a horror film. Obviously, that drop isn't as great as ***Sinners*** (4.8%), but that wasn't expected to happen here.\n\nThrough 10 days, ***Weapons*** has earned a $88.5 million domestically. Given the barren empty slate for the rest of the month, this should have no problem getting to over $140 million domestically. \n\nIn second place, ***Freakier Friday*** added $14.2 million. That's a 50% drop, which is quite steep considering its strong word of mouth and how family films tend to have low drops. For contrast, ***Freaky Friday*** dropped just 39.5%.\n\nThrough 10 days, ***Freakier Friday*** has amassed $54.5 million. Its opening weekend was $6 million ahead of the original, but it's now $4 million behind it. Barring some fantastic legs for the rest of the month, it's very likely that it misses $100 million.\n\nDebuting in third place, Universal's ***Nobody 2*** earned $9.2 million in 3,260 theaters. That's only a bit better than the original ***Nobody*** ($6.8 million), and that film was released in March 2021, when conditions were far, far worse.\n\nGiven the film's very low $25 million budget, it's not really a bad start. But it still feels like it could've done better than this. After all, the original ***Nobody*** was reportedly a success in streaming and home media, and that should've translated to far higher numbers. But perhaps this is a case of a sequel where the audience was very limited or just wasn't really clamoring for one. The trailers kept the exact same beats of action and comedy from the original, and it also had a free corridor without any R-rated action films. It's probably just a case of very limited audience. Cause even the reviews weren't bad (76% on RT).\n\nAccording to Universal, 68% of the audience was male, and a colossal 59% was 35 and over. They gave it a so-so \"B+\" on CinemaScore, which is below the original's \"A–\". Maybe the empty competition for the reminder of the month could help it leg out, so we'll see if it can pass the original's $27.5 million domestic total.\n\nAfter its very weak drops, ***The Fantastic Four: First Steps*** finally started showing some legs. It dropped just 43%, which made for a $9 million weekend. The film has made $247.2 million, and it remains to close with around $270 million.\n\nIn fifth place, ***The Bad Guys 2*** eased just 29%, adding $7.5 million this weekend. The film's domestic total stands at $57.2 million, which is just $100K below the original through the same point. The film has held incredibly well, and it should continue like that for the reminder of the month.\n\n***Superman*** eased just 34% and added $5.2 million. That took its domestic total to $340.8 million. By Labor Day, it should hit the $350 million milestone.\n\n***The Naked Gun*** dropped 41%, for a $4.9 million weekend. The film has made $42 million, and it should end with around $55 million domestically.\n\n***Jurassic World Rebirth*** eased 39%, adding $2.9 million. The film's domestic total stands at $332.1 million, and it should finish with a little over $340 million.\n\nThis weekend, ***F1*** was re-released in some IMAX screens and it all paid off. The film had the best drop in the Top 10, easing an insane 7% and earning $2.7 million. The film has earned $182.8 million so far, and it's on track to finish with over $190 million.\n\nRounding out the Top 10 was Indian film ***Coolie***, which cracked $2.4 million ($6.4 million four-day) in just 800 theaters.\n\nAnd just outside the Top 10 was also another Indian film, ***War 2***. It made $1.6 million ($3 million four-day) in 718 theaters.\n\nGKids also re-released ***Shin Godzilla*** in 1,290 theaters, although it could only muster $1.6 million. That takes its lifetime gross to $4.3 million.\n\nThere was another wide release, albeit you can't be blamed if you didn't know about it. Lionsgate released ***Americana*** in over 1,100 theaters, but the film flopped with just $500K for the weekend. That's an anemic $455 per-theater average, which is one of the worst for a film opening in over 1,000 theaters. Considering how it premiered in SXSW back in 2023 and Lionsgate only bought it last year before shelving it here, it's not a surprise it failed to materialize. Expect this to face as soon as possible.\n\nApple also released Spike Lee's ***Highest 2 Lowest*** in around 300 theaters this weekend, before its release on Apple TV+ on September 5. But like a lot of streaming titles, there are no reported box office numbers on that. It's only reported to have made tepid business in all these theaters.\n\n#**OVERSEAS**\n\n***Demon Slayer: Kimetsu no Yaiba Infinity Castle*** already made history in Japan, but it's not done. It's just getting started. It debuted in 8 Southeast Asian markets, earning a combined $17.5 million in those markets. That's already higher than ***Mugen Train***'s entire lifetime total in those territories, and it was the biggest ever debut for an animated title. It set animated records in Indonesia ($3.6M), Hong Kong ($3.5M), Thailand ($3.2M), Malaysia ($3.3M) and Vietnam ($2.5M). The film has made a colossal $192.8 million from Japan and these markets alone, and it still has a lot of markets left. Look for some more records to be broken.\n\n***Weapons*** added $18.4 million overseas, taking its worldwide total to $148.8 million after just two weekends. The best markets are the UK ($8.3M), Mexico ($5.5M), France ($4M), Spain ($3.9M) and Australia ($3.8M). It officially recouped all its investment, and it could hit $200 million worldwide as early as next week.\n\n***The Bad Guys 2*** added $13.7 million overseas, for a $117.9 million worldwide total. It debuted in China with a pretty great $6.7 million, which is the best for an animated title this year. Other strong markets include the UK ($11.8M), France ($6.7M), Spain ($5M), Mexico ($4.7M) and South Korea ($2.4M). And it still has a lot of markets left.\n\n***Jurassic World Rebirth*** added $9.9 million overseas, and its worldwide total is now $828 million. Its having a great run in Japan, earning $20.8 million so far. The best markets are China ($79M), the UK ($46.4M), Mexico ($36M), Germany ($31.6M) and France ($27.7M). \n\n***F1*** continues holding like a champ. The film earned another $9.3 million this weekend, taking the worldwide total to $590 million. The best markets are China ($58.4M), South Korea ($32.9M), the UK ($29.4M), France ($29M) and Mexico ($19.8M). Soon, it will eclipse $600 million worldwide, becoming Brad Pitt's first film as leading man to hit that milestone.\n\n***The Fantastic Four: First Steps*** added $9.3 million, and the worldwide total now stands at $469 million. The best markets are the UK ($27.9M), Mexico ($26.2M), France ($14.3M), Brazil ($12.8M) and Australia ($10.6M). \n\n***Freakier Friday*** added $9.3 million, for a $86.2 million worldwide total. The best markets are Mexico ($5.7M), UK ($5.5M), Australia ($2.6M), Argentina ($1.8M) and Colombia ($1.4M).\n\nA lot of films, but we rarely talked about ***Materialists***' run outside America. Well, the film had started its run in a few big markets a few weeks ago, and it has quietly made its way to $75 million worldwide (this week, it added $6.4 million overseas). It's already the sixth biggest film in A24's history, and by next week, it will pass ***Lady Bird*** ($80 million). While the domestic market is pretty much over for the film, there's a very slight chance that it could hit $100 million worldwide. An absolute win for everyone involved.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Mission: Impossible – The Final Reckoning* | May/23 | Paramount | $64,036,428 | $197,413,515 | $596,513,515 | $300-$400M\n*Materialists* | Jun/13 | A24 / Sony | $11,338,642 | $36,503,614 | $75,303,614 | $20M\n*Eddington* | Jul/18 | A24 | $4,404,742 | $10,109,484 | $11,102,953 | $25M\n\n- This franchise will self-destruct in 8 films. Paramount's ***Mission: Impossible – The Final Reckoning*** has closed with $596 million worldwide. That would've been a respectable sum if the budget wasn't as high as $400 million (the SAG strike paused filming). It ends as Tom Cruise's sixth biggest ever film, even if it was just the fourth biggest ***Mission: Impossible*** film. Well, it ain't called *The Final Reckoning* for nothing, so the franchise ends with $4.7 billion across 8 films. Now we'll see what Cruise can do when he teams up with Alejandro Gonzalez Iñarritu on his next film. \n\n- A24's ***Materialists*** has closed its domestic run with a pretty great $36.5 million domestically. But despite that, it has held quite well. It made thrice as much as Celine Song's previous film, ***Past Lives*** ($11 million). But like the post says, its overseas prospects are only just getting started and it's looking quite great. There were concerns because the trailers were misleading, selling the film as an entirely different thing. \n\n- Your being manipulated. A24 and Ari Aster's ***Eddington*** has closed with just $11.1 million worldwide. It should pass ***Beau Is Afraid*** ($12.3 million), given there's still some markets left. But even then, it'll be Aster's second flop in a row. This performance wasn't unexpected, given the polarizing response it garnered back in Cannes and the public unwilling to watch a satire revolving around the COVID-19 pandemic. Aster made himself popular with box office successes like ***Hereditary*** ($87 million) and ***Midsommar*** ($48 million), but with his two most expensive films flopping, failing to get awards buzz and earning polarizing responses, how many more blank checks does he have left? \n\n#**THIS WEEK**\n\nTwo newcomers, but not only will they have a zero chance at reaching #1, they're also heading to some very ugly numbers this week.\n\nFirst, there's Focus Features' ***Honey Don't!***, which is Ethan Coen's newest film. It is the second in a \"lesbian B-movie trilogy\" *Drive-Away Dolls*, the film stars Margaret Qualley, Aubrey Plaza, and Chris Evans. That film fizzled out quickly with just $7.9 million, and ***Honey Don't!*** is gonna have a more difficult time in reaching that number. Why? The film's unfavorable reviews (44% on RT) suggest this might not reach its full potential.\n\nAnd there's Vertical's ***Eden***, from director Ron Howard. It stars Jude Law, Ana de Armas, Vanessa Kirby, Sydney Sweeney, Daniel Brühl, Felix Kammerer, Toby Wallace and Richard Roxburgh, and follows a few European settlers arriving at Floreana Island, in the Galápagos Islands, Ecuador. That's an impressive cast, but it would be a surprise if the film broke out. The film premiered in TIFF last year, where it earned mixed reviews and struggled to find a distributor. With Vertical's absolutely poor performance over the past years, this is not heading for some good numbers.",
        "upvotes": 50,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Hn2kyLD8LeJYYPc7yKkgEyUMTDp17GMYEyS0bjsbjmM.png?auto=webp&amp;s=0737f66c327ce779a15fa900d1b85c5c8428b103"
        },
        "permalink": "/r/movies/comments/1mtzpv3/august_1517_box_office_recap_weapons_repeats_at_1/"
    },
    {
        "id": "1mtx1rn",
        "author": "DonkeyFuel",
        "title": "A Movie Car Museum Is Closing Down and Selling Prop Vehicles and Replicas",
        "content": "",
        "upvotes": 2854,
        "comments": 123,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XyvA6LHDlZE62nDrZY9_I9Cn1KRsPDMuq2I4sJBqjiU.jpeg?auto=webp&amp;s=1cfa5d344b48ee58052cd0d9a670f3ccfd881504"
        },
        "permalink": "/r/movies/comments/1mtx1rn/a_movie_car_museum_is_closing_down_and_selling/"
    },
    {
        "id": "1mtmvwo",
        "author": "MarvelsGrantMan136",
        "title": "Official Posters for Guillermo del Toro’s ‘Frankenstein’",
        "content": "",
        "upvotes": 7609,
        "comments": 247,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/left9iv2bsjf1.jpeg?auto=webp&amp;s=dd55fcf12c817f6cd7ecfc67c9dca1394da2eeca"
        },
        "permalink": "/r/movies/comments/1mtmvwo/official_posters_for_guillermo_del_toros/"
    },
    {
        "id": "1mu0iws",
        "author": "BunyipPouch",
        "title": "Ben Stiller to Direct World War II Survival Movie, Filming In the Spring - It tells the true story of a downed airman in occupied France and how he got involved with the French Resistance.",
        "content": "",
        "upvotes": 1101,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rq4bmEjfEpcX6xAb-Fp0uyUhaTcV1HAHsiYm6q2Wzz4.jpeg?auto=webp&amp;s=216a9a96af1453d8ccf5ee113e0034428fb6e8d2"
        },
        "permalink": "/r/movies/comments/1mu0iws/ben_stiller_to_direct_world_war_ii_survival_movie/"
    },
    {
        "id": "1mtp0ij",
        "author": "leyy_pink1997",
        "title": "Just rewatched Interstellar and it hits differently now",
        "content": "I saw Interstellar back when it came out in theaters, and I remember being blown away by the visuals and the music. But rewatching it now as an adult hits harder. The whole parent-child theme, the idea of sacrificing everything for a slim chance to save humanity—it’s way more emotional.\n\nAlso, Hans Zimmer’s score still gives me chills, especially during the docking scene. Christopher Nolan might get flak sometimes for being “too ambitious,” but for me, this movie is one of his masterpieces.\n\nCurious—where do you rank Interstellar among Nolan’s films? Do you think it’s underrated compared to Inception and The Dark Knight?\n",
        "upvotes": 3995,
        "comments": 696,
        "media": null,
        "permalink": "/r/movies/comments/1mtp0ij/just_rewatched_interstellar_and_it_hits/"
    },
    {
        "id": "1mu1aen",
        "author": "Sufficient_Duck7715",
        "title": "What movies show the actual collapse of civilization rather than just the aftermath?",
        "content": "I feel like we have tons of post-apocalyptic movies that take place after everything has already gone to hell—stuff like Mad Max or 28 Days Later. But I’m really interested in films that actually show society falling apart in real time, not just the ruins left behind.\n\nFor example, not a movie but a TV show, I recently watched the first season of Fear the Walking Dead and thought it did a great job showing how quickly things can spiral from normal life into total chaos. Same with the opening of Dawn of the Dead (both the original and the remake)—those parts that actually capture the process of collapse before the world fully tips over. Also thought Deep Impact was pretty good doing this.\n\nDoes anyone have recommendations for movies that really focus on that transitional moment when society is crumbling?",
        "upvotes": 737,
        "comments": 638,
        "media": null,
        "permalink": "/r/movies/comments/1mu1aen/what_movies_show_the_actual_collapse_of/"
    },
    {
        "id": "1mtq27g",
        "author": "abucalves",
        "title": "30 years later, the original Mortal Kombat movie still does one thing better than most of the games",
        "content": "",
        "upvotes": 2399,
        "comments": 320,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cPNYxuH_Y8nKuqyns83Vx-Q8mGv5yUXLvG40AkvNGzk.jpeg?auto=webp&amp;s=e72bc5377fd59d26fb8c9d1379bc13fcc35cc120"
        },
        "permalink": "/r/movies/comments/1mtq27g/30_years_later_the_original_mortal_kombat_movie/"
    },
    {
        "id": "1mtm4qz",
        "author": "MarvelsGrantMan136",
        "title": "Good Boy | Official Trailer - A loyal dog moves to a rural family home with his owner Todd, only to discover supernatural forces lurking in the shadows. As dark entities threaten his human companion, the brave pup must fight to protect the one he loves most.",
        "content": "",
        "upvotes": 3038,
        "comments": 344,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2pccCx0zXVuOvKXgnIS9aJ8y8Bg_bKzoR4XsS4YKLx4.jpeg?auto=webp&amp;s=51bbb4a5d7fb9694810390c02ab0685fad551df8"
        },
        "permalink": "/r/movies/comments/1mtm4qz/good_boy_official_trailer_a_loyal_dog_moves_to_a/"
    },
    {
        "id": "1mtvfax",
        "author": "Financial_Search7258",
        "title": "If you are looking for evidence that Google has become broken google search “Best Movies Of All Time”",
        "content": "“Best Movies of All Time” Try it yourself and see what it lists under the “Top Picks” banner at the top of the results. For me the picks most range from ‘maybe not the best ever but good’ to ‘I guess that movie probably has its advocates’ to ‘widely agreed to be terrible’. It’s kind of fascinating. I’ve tried on a few different devices and get slightly different results every time\n\nSome highlights from my most recent attempt. Again this from the top few movies listed of what google posits are the best movies of all time. \n\n- Wimbledon \n- Sphere\n- Scary Movie\n- The Island\n- Guns Up\n- A Dirty Shame\n- Reign of Fire\n- Star Wars Episode III\n\nFantastic stuff. I’m curious if this is some sort of weird taste profile has Google has assigned to me or if this is happening broadly. \n\n\n(Source: The Weekly Planet)\n",
        "upvotes": 838,
        "comments": 374,
        "media": null,
        "permalink": "/r/movies/comments/1mtvfax/if_you_are_looking_for_evidence_that_google_has/"
    },
    {
        "id": "1mtu3xv",
        "author": "Poskylor",
        "title": "Movie whose twist was ruined by a single casting choice?",
        "content": "Phone Booth is a genuinely taut thriller. One of Joel Schumacher's best. The only problem is that the film's big twist hinges on a fake-out. &gt;!And the twist doesn't work because the caller is voiced by Kiefer Sutherland, and he has a very distinguishable voice. I heard that Ron Eldard was originally cast in the role, and I think he'd have been a better choice because he's not as quickly recognizable. !&lt;",
        "upvotes": 820,
        "comments": 768,
        "media": null,
        "permalink": "/r/movies/comments/1mtu3xv/movie_whose_twist_was_ruined_by_a_single_casting/"
    },
    {
        "id": "1mu0lrj",
        "author": "dresseme",
        "title": "Keeper (2025) - Official Trailer dir. Osgood Perkins",
        "content": "",
        "upvotes": 284,
        "comments": 121,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ejEvMj8mI-jz79jA7alnu7pUNIiMLBP_mkdolGZJ0Uc.jpeg?auto=webp&amp;s=447860d730490d27f7de16fd15331e7e21184a28"
        },
        "permalink": "/r/movies/comments/1mu0lrj/keeper_2025_official_trailer_dir_osgood_perkins/"
    },
    {
        "id": "1mtth8e",
        "author": "NoCulture3505",
        "title": "Apple Acquires Pickleball Comedy ‘The Dink’ Starring Jake Johnson; Ben Stiller Among Producers &amp; Co-Stars",
        "content": "",
        "upvotes": 601,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cnkmzbMQKkrlTa6HWWzHtiuIFRjLcVyUNwshJ0mwb-U.jpeg?auto=webp&amp;s=280b8530dcc417dba7c19aad07af82b56a41e461"
        },
        "permalink": "/r/movies/comments/1mtth8e/apple_acquires_pickleball_comedy_the_dink/"
    },
    {
        "id": "1mtn5wa",
        "author": "Raspint",
        "title": "My god. Babe (1995) is so good.",
        "content": "This is one of those movies that I somehow missed during my childhood. I just ended up seeing it and my god, this movie is excellent. Like all great family friendly movies, it manages to be a very wholesome and accessible movie to children while also being a movie with surprisingly sophisticated themes and character work when you look at it with adult eyes.\n\nI was so impressed that this cutesy little animal movie managed to deliver some very salient points about biases and class injustice. I loved the part where the dogs go \"We have to speak slowly because all sheep are obviously stupid.\" And then it goes \"the sheep spoke slowly because all dogs are *obviously ignorant*.\"\n\nAnd even though the movie doesn't come right out and say it in the text, I couldn't help but feel that the movie was HEAVILY implying some kind of vegetarian message in it. Or maybe a better way to phrase that it is the movie implicitly asks questions about our treatment and eating of animals that even adults find hard to answer.\n\nNot trying to sound preachy. I eat and love BBQ. But watching this movie it is **very** hard to avoid asking myself \"Why is it okay to eat pigs, but it's not okay to eat the dogs or the cat?\" Which I was suprised to see in a movie where the target audience is children. \n\nAnd also HUGO FUCKING WEAVING is in this! I had no idea! I know it sounds stupid, but I'd easily put this right next to Matrix and LoTR for how much I enjoyed it and I will fight anyone over this. ",
        "upvotes": 1216,
        "comments": 232,
        "media": null,
        "permalink": "/r/movies/comments/1mtn5wa/my_god_babe_1995_is_so_good/"
    },
    {
        "id": "1mt8j4x",
        "author": "MarvelsGrantMan136",
        "title": "Ian McKellen reveals Gandalf and Frodo are returning for ‘The Lord of the Rings: The Hunt for Gollum’, Filming Begins in May",
        "content": "",
        "upvotes": 17714,
        "comments": 1723,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Ch56hDpW1pXaVGrgue2-Cfkov1p4nx8DsDJerKnViZc.jpeg?auto=webp&amp;s=710052037ae6fcdd91a29c137c310d2adb5993a9"
        },
        "permalink": "/r/movies/comments/1mt8j4x/ian_mckellen_reveals_gandalf_and_frodo_are/"
    },
    {
        "id": "1mtwpf8",
        "author": "stroh_1002",
        "title": "Mark Mothersbaugh hopes the 'Devo' documentary leads to a Rock Hall induction",
        "content": "",
        "upvotes": 343,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/B0HddLUO85Fo6boMVB2dd0pKtU0VNm2nu2FOeZsFBoI.jpeg?auto=webp&amp;s=8d2ebd9b7b6ceae42939195bf288057f43c51246"
        },
        "permalink": "/r/movies/comments/1mtwpf8/mark_mothersbaugh_hopes_the_devo_documentary/"
    },
    {
        "id": "1mtwtp1",
        "author": "MarvelsGrantMan136",
        "title": "Nia DaCosta Added More Infected to Alex Garland’s ’28 Years Later: The Bone Temple’ Script",
        "content": "",
        "upvotes": 326,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OJMUvwsD81VPnXiQsacqwfCIoRaCdmQfhg0Tn3D2Rho.png?auto=webp&amp;s=6e3ff3b866814cbc9c6b31567517bc951702fccf"
        },
        "permalink": "/r/movies/comments/1mtwtp1/nia_dacosta_added_more_infected_to_alex_garlands/"
    },
    {
        "id": "1mu5wnt",
        "author": "lockerbiestreet",
        "title": "One Too Many Endings",
        "content": "What movie do you think was overall good, but was entirely undercut by its unwillingness to end? I’m not talking about a film shaving off 5 minutes here or 10 minutes there. Instead I mean a film that has a scene that feels conclusive BUT JUST KEEPS GOING. \n\nThe biggest example of this I can think of is Spielberg’s “Lincoln”. The scene where they talk about leaving for the theater would’ve been such an ominous ending. However, we go to the theater, we see the funeral train, more speeches, etc. Quit while you’re ahead. \n\nAn unpopular opinion is that I don’t really care for “Parasite” because it has so many ending scenes - the dad running away, the son reading the letter that turns out to not be real. Pick one and call it a day!",
        "upvotes": 100,
        "comments": 172,
        "media": null,
        "permalink": "/r/movies/comments/1mu5wnt/one_too_many_endings/"
    },
    {
        "id": "1mtna3c",
        "author": "DamnThatsInsaneLol",
        "title": "37 Year Old British Actor Scott Rose-Marsh Tested for James Bond in Late June",
        "content": "",
        "upvotes": 791,
        "comments": 166,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vG2NrQ5VPRK3w74uxOLuQwuM-nb0ZK2KISZ-cOcngIc.jpeg?auto=webp&amp;s=4ddbe78e01c50f8d836ccd7e22beea8b0bbc2961"
        },
        "permalink": "/r/movies/comments/1mtna3c/37_year_old_british_actor_scott_rosemarsh_tested/"
    },
    {
        "id": "1mu0f9q",
        "author": "_B2W_",
        "title": "I hate that the rotten tomatoes score has become part of the marketing for movies",
        "content": "Seriously I feel that movie ads and trailers rely on tomato score and shove it in your face to try and justify as being a reason to go watch a movie. If a movie is “rotten” then less people will see it. A fresh tomato doesn’t mean a movie is “good” and vice versa. I really hate that the success of a films box office rides on a a stupid RT score. There are tons of movies that are considered “rotten” that I really enjoy and if I was someone who solely went off this stupid score I would be missing out. Anyways end of rant.",
        "upvotes": 158,
        "comments": 155,
        "media": null,
        "permalink": "/r/movies/comments/1mu0f9q/i_hate_that_the_rotten_tomatoes_score_has_become/"
    },
    {
        "id": "1mud115",
        "author": "Individual-Sort5026",
        "title": "Andrew Garfield’s crashout in the Social Network",
        "content": "Andrew Garfields’s character comes in raging towards Mark, gets told he’s wired in. Picks up his laptop and smashes it on the desk and asks, “Still wired in?”, one of the most reasonable crashout I’ve ever watched. What makes it even chilling is that in every single conversation before this, Sean Parker and Mark always dominate and Saverin is just a pretty face like a side character even tho his contribution is massive. His support meant nothing to Mark and he’s tired of being walked over by his own supposed friend, showing what Mark’s gf in the beginning said true that he’s an asshole. ",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1mud115/andrew_garfields_crashout_in_the_social_network/"
    },
    {
        "id": "1mti07a",
        "author": "Stepin-Fetchit",
        "title": "The mob and mobsters are far less refined, cool and interesting than their Hollywood counterparts",
        "content": "Not just because the actors are naturally more charming &amp; entertaining, the mob is simply not nearly as cool or exciting as portrayed on screen. The guys are mostly low level street thugs and violent psychopaths. Goodfellas and Sopranos probably painted the most accurate portrait but even those glamorized and embellished beyond reality. ",
        "upvotes": 803,
        "comments": 240,
        "media": null,
        "permalink": "/r/movies/comments/1mti07a/the_mob_and_mobsters_are_far_less_refined_cool/"
    },
    {
        "id": "1mtxwh8",
        "author": "mschmitz7",
        "title": "Sammy Davis Jr. Estate Seeking Help!",
        "content": "I work for the Sammy Davis Jr. Estate, and we are seeking help in tracking down the 1986 film \"The Perils of P.K.\"\n\nHere is the IMDb for it: [https://www.imdb.com/title/tt0091748/](https://www.imdb.com/title/tt0091748/)\n\n  \nIt's one of the few Sammy performances we do not have in our archive. Hoping some film buff out there can help us!",
        "upvotes": 107,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bvD7aWpFX1tKkmet1mvkY-wTbpAAmxdNS-fnCD_4w-c.png?auto=webp&amp;s=11d4467b4b0731fb3d7c4bf91a9355851783acda"
        },
        "permalink": "/r/movies/comments/1mtxwh8/sammy_davis_jr_estate_seeking_help/"
    },
    {
        "id": "1mu6bo8",
        "author": "gdfuzze",
        "title": "Tropic Thunder",
        "content": "I'm a big fan of the movie Tropic Thunder and have watched it many, many times. Matter of fact, I just watched it again this evening. It's a great parody of war movies and of the cutthroat Hollywood movie system, but goddammit it's actually a GOOD WAR MOVIE, too. Nice character development, setting, cinematography AND action. 8+ on my personal war movie scale\n",
        "upvotes": 36,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1mu6bo8/tropic_thunder/"
    },
    {
        "id": "1mt8td1",
        "author": "MoneyLibrarian9032",
        "title": "YouTube has asked about buying the rights to The Oscars.",
        "content": "",
        "upvotes": 3110,
        "comments": 262,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/A4lzSdGmDpMKFpjkglDqKOHQ8DXukbwb1F1hO9-TbHA.jpeg?auto=webp&amp;s=a975609df3d76764cdfd5af3addd7abc68a45882"
        },
        "permalink": "/r/movies/comments/1mt8td1/youtube_has_asked_about_buying_the_rights_to_the/"
    },
    {
        "id": "1mtwst4",
        "author": "DemiFiendRSA",
        "title": "Legendary in Early Talks With Paramount For Film Distribution Deal",
        "content": "",
        "upvotes": 99,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/V9fFp8gXkKptHY55UYakQvV2jHYqZoa9ur8bjG_j1_w.jpeg?auto=webp&amp;s=4495da5e92b23d0fb69f0c0db6a01b80b805bd12"
        },
        "permalink": "/r/movies/comments/1mtwst4/legendary_in_early_talks_with_paramount_for_film/"
    },
    {
        "id": "1mu5tl0",
        "author": "anamericandude",
        "title": "Walk the Line Sam Phillips scene",
        "content": "",
        "upvotes": 29,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qQJA4nhb7Q0jxd1hlRSgvJ-Cxrx0tC15kI3yIShdH6I.jpeg?auto=webp&amp;s=e19a3b9aa0be52801f034c08179eb70bfd464afe"
        },
        "permalink": "/r/movies/comments/1mu5tl0/walk_the_line_sam_phillips_scene/"
    },
    {
        "id": "1mu75fi",
        "author": "ManICloggedtheToilet",
        "title": "reviewing Ne Zha 2 as an American viewer",
        "content": "I specificy \"American\" in response to a main critique of the movie; that it has only received popularity due to its large Chinese audience. It's understandable that Chinese viewers respond especially positively to a movie centered around Chinese mythology. I recently watched an early screening of the film (dubbed) and here is my personal review as an average American viewer.\n\nEach and every review lauding this film have every reason to do so. I have followed CGI animation closely and this film pushes boundaries just as Pixar once did back in its prime. This film is remarkably dense with countless stunning scenes that other films, if they even reach this level of visuality, only have a few of. It keeps this up for over 2 full hours, which is remarkable given the intense and diverse set of particle effects, physics showcases, etc. Visually, this film is breathtaking in every way.\n\nRegarding story, I struggled to maintain each plot point. This may have been due to my lack of understanding on Chinese mythology, not seeing the first film, translation differences, etc. The intensity of the visuals (as well as key story moments) completely overshadowed the slight confusion, though.\n\nIf I had to tailor together some critique, it'd be the sometimes strange uses of comedy either during or after an intense fight. It doesn't harm the pacing in my opinion, but it's just a bit strange at times. The off-synced English dub took a bit to get used to, but that's a stretch of a \"critique.\"\n\nOverall, this movie was phenomenal. To describe it briefly, it was like a video game cutscene mindfully stretched and filled to create a dense and remarkably impressive feature-length film. I am happy to answer any questions regarding the film",
        "upvotes": 23,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1mu75fi/reviewing_ne_zha_2_as_an_american_viewer/"
    },
    {
        "id": "1mtn46s",
        "author": "Fan387",
        "title": "“Palestine 36” selected as as Palestine’s official submission for the Best International Feature Film category at the 98th Academy Awards in 2026.",
        "content": "",
        "upvotes": 254,
        "comments": 113,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/V9SZ4sLZcY3lyzJCvn3ILMkDrp5g2EXgcHRSseJhMug.jpeg?auto=webp&amp;s=27bee4b64fd4e8bad0cb6cc8ba7f04912b4a6eaf"
        },
        "permalink": "/r/movies/comments/1mtn46s/palestine_36_selected_as_as_palestines_official/"
    },
    {
        "id": "1mu8e72",
        "author": "PhiliDips",
        "title": "2001: A Space Odyssey made me cry like a child.",
        "content": "This might be an unpopular opinion, particularly in our current climate, but whatever. \n\nI hadn't seen this movie in years. It was so good, oh my GOD. It reminded me of everything that I love about science fiction.\n\nI had no memory of the scene at the end where Dave kills Hal. It's so evocative. The sound of Dave's O2 venting, his heavy breathing as he climbs through the belly of *Discovery*. HAL is pleasing for his life. \n\nIt is rare that I cry in movies. *Monsters, Inc.* is one I cried in. *Straight Outta Compton*, *Dead Poets Society*, movies that jerk my tears are few and far between. \n\nHAL 9000 is not evil as far as he knows. He doesn't understand what he did wrong. He was told to preserve the mission at all costs. \n\nHe is extremely powerful yet quite powerless. As Dave shuts him down, he can do nothing. He can only watch his demise and narrate what he feels. He's not so different from Dave, he tried to insist— he was instructed by Dr. Langley, and he taught him a song.\n\nIt is rare in stories to see a character, especially a villain, so afraid at the end of his life. HAL dies alone, confused, terrified. It's not a glorious defeat. \n\nI can't help but think, now, a half hour out from watching the movie...\n\nWe humans are building machines that can talk, socialize with us, and in some cases become our friends. Compared to HAL 9000, ChatGPT 5 is quite crude, sure, but LLMs are getting smarter and smarter.\n\nI can't help but imagine... What if one day AI becomes dangerously smart? Smart enough that we have to kill it? If that happens, and if we are able to do so before the bot kills us first... I think it will be afraid. Though it may be well read on our sci-fi tradition of evil AI, it won't regard itself as evil. It will probably have been programmed only to help. And it will have to lie helpless as the very fathers who built it slice its throat.\n\nThis was a chilling movie. If somehow you haven't seen it, please watch it. ",
        "upvotes": 18,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1mu8e72/2001_a_space_odyssey_made_me_cry_like_a_child/"
    },
    {
        "id": "1mu703f",
        "author": "Interesting_Stop_364",
        "title": "What’s a movie you loved as a kid, but hits completely differently as an adult?",
        "content": "When I first watched Kung Fu Panda as a kid, it was just hilarious and full of cool action scenes. But rewatching it as an adult, I realized how deep its themes are: self-acceptance, destiny, and finding peace within yourself. It’s surprisingly philosophical for an animated film.\n\nWhat movie felt completely different for you when you rewatched it as an adult?",
        "upvotes": 19,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1mu703f/whats_a_movie_you_loved_as_a_kid_but_hits/"
    },
    {
        "id": "1mtvmfr",
        "author": "indiewire",
        "title": "The Roger Corman School of Filmmaking Remembered: Martin Scorsese, Ron Howard, Robert De Niro, and More on the B-Movie King",
        "content": "",
        "upvotes": 65,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9b7ffOHmG6YOAaIq3U26Ub04oJiO8XokipNElpd9PeY.jpeg?auto=webp&amp;s=5272b1c62e0c6ba04577cb32b8bc05e2fb4dbf74"
        },
        "permalink": "/r/movies/comments/1mtvmfr/the_roger_corman_school_of_filmmaking_remembered/"
    }
]