[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 482,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 29,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1he12y9",
        "author": "Whobitmyname",
        "title": "Netflix Says Shooting ‘One Hundred Years of Solitude’ Series In Colombia Delivered A $52 Million Boost To The Country’s Economy",
        "content": "",
        "upvotes": 56,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1he12y9/netflix_says_shooting_one_hundred_years_of/"
    },
    {
        "id": "1hdxppq",
        "author": "MechanicalKiller",
        "title": "I think Carry On was amazing",
        "content": "They somehow made a movie about a TSA agent pretty entertaining. I thought it was similar to The Guilty starring Jake Gylenhall. \n\nJason Bateman is… Jason Bateman who basically plays himself a lot in these drama’s, similar to his role in Ozark.\n\nThe Car Action scene was so cool and well choreographed (camera work and fight)\n\nIf your looking for something entertaining tonight or over the weekend, I’d give it a shot.\n\n\n\n",
        "upvotes": 27,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1hdxppq/i_think_carry_on_was_amazing/"
    },
    {
        "id": "1hdz4b0",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix recently removed the \"Coming Soon\" label from the 'You' homepage leading to rumors that the season is delayed ",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hdz4b0/netflix_recently_removed_the_coming_soon_label/"
    },
    {
        "id": "1he2bxp",
        "author": "AggressiveTraining78",
        "title": "Senna",
        "content": "Out of nowhere Senna went missing from my Netflix and i was in the third episode quite desperate as u all can see ... Please help me what hpnd why is it not shown suddenly",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1he2bxp/senna/"
    },
    {
        "id": "1he3aq5",
        "author": "IMHBTR",
        "title": "Plan change affects existing log-ins?",
        "content": "I may not be asking my question properly.\nI purchased the top plan, ($22.99) for use by 2 elderly relatives.\nI very rarely watch anything on Netflix, they love it. They each have a Roku that I set up and logged them in to Netflix.\nMy question is this, if I switch to the basic plan, (ads, only 2 devices), will that switch require a new login on each device?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1he3aq5/plan_change_affects_existing_logins/"
    },
    {
        "id": "1hcrn8m",
        "author": "AccurateInflation167",
        "title": "Netflix ‘walking back’ one-year parental leave after too many workers take year off",
        "content": "",
        "upvotes": 5505,
        "comments": 532,
        "media": null,
        "permalink": "/r/netflix/comments/1hcrn8m/netflix_walking_back_oneyear_parental_leave_after/"
    },
    {
        "id": "1he5k91",
        "author": "Potential-Plenty7318",
        "title": "[REQUEST] 10 Days Of A Curious Man (2024) - Need help to identify the name of the music/song",
        "content": "This song plays before Sadik breaks into the house of Yuksel Zinchirli.\n\nThe first words are sung when Yuksel is swimming in his pool.\n\nSong goes like \"I close my eyes And I turn to the sun. Brought to life at the touch of your hand.....\"\n\n\n\nSong ends when Sadik greets Yuksel.\n\n\n\nSong is quite catchy. Does anyone knows the title of the song/singer. Thank youuuuuuuuu",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1he5k91/request_10_days_of_a_curious_man_2024_need_help/"
    },
    {
        "id": "1he5hvj",
        "author": "DelayDifficult3376",
        "title": "Slow dialogue ",
        "content": "When watching tv on screen. The dialogue is too low. I need to turn off my AC or fan so that I can understand the conversation. I have also my remote in my hands to add volume when dialogue is low sounding and when sound effects is too loud. I minus the volume. So annoying. Watching with phone is perfect but small screen... \n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1he5hvj/slow_dialogue/"
    },
    {
        "id": "1he15le",
        "author": "FifiFoxy12",
        "title": "What to watch next ",
        "content": "I've just finished the finale of outer banks and looking for somting new to watch.\n\nPrevious shows I've watched:\n\nThe Rookie, Gilmore Girls, My life with the Walter boys and of course Outer Banks.\n\nAny and all suggestions welcome 💕",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1he15le/what_to_watch_next/"
    },
    {
        "id": "1hduaf5",
        "author": "Rainbow_Vortexx",
        "title": "Cartoon Show Cars",
        "content": "i’m looking for a not toddler but younger cartoon show where the plot of the story is about people that control toy cars and this show was previously removed off of netflix.",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hduaf5/cartoon_show_cars/"
    },
    {
        "id": "1he1ns4",
        "author": "Thin_Marionberry5209",
        "title": "Carry-On on Netflix: Die Hard at the Airport... or Paul Blart in First Class?",
        "content": "Just finished Carry-On on Netflix, and I gotta say, it felt like they were aiming for Die Hard at the airport but ended up with Die Hard meets Paul Blart: Mall Cop.\n\nTaron Egerton killed it in Kingsman, but here? He gave it his best shot, but pulling off a Bruce Willis vibe is not as easy as it looks. As for Jason Bateman as the bad guy? I love the guy, but he felt more like he was about to launch into an awkward Ozark-style monologue than actually terrorize anyone.\n\nAnd then there’s Theo Rossi. The guy has “creepy dude” locked down—it’s like he’s always one ominous head tilt away from asking if you’ve seen his missing ferret. At least he stayed consistent. \n\nAnyone else get the feeling this movie was just one overly ambitious TSA officer away from becoming a full-blown comedy? What’d you guys think?",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1he1ns4/carryon_on_netflix_die_hard_at_the_airport_or/"
    },
    {
        "id": "1hduasi",
        "author": "fyrefl1es",
        "title": "Netflix blocking: what does it look like?",
        "content": "Netflix mysteriously stopped working at my local gym. Its saying I'm not connected to a wifi but I am.  Fast, speedofme, etc shows 60down, 50up.  Youtube still works.  \n\nSo the questions ate: what does netflix do when a network blocks that app or parts of that app that allow streaming?  What does it look like when public wifi somehow triggers Netflix's safety measures?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hduasi/netflix_blocking_what_does_it_look_like/"
    },
    {
        "id": "1hdk455",
        "author": "mari_xoxo",
        "title": "Jentry Chau vs the Underworld | Official Trailer | Netflix",
        "content": "i just finished “jentry chau vs the underworld” it’s new to netflix , it’s sooo good if your looking for something new (and animated) to watch then watch jentry chau , \n\nit’s about a 16 year old chinese-american girl who lives in happily in seoul until she has to go back to her hometown where she once lived as a child , a small town in Texas because she is being hunted by demons. Now she has to balance highschool life , relationships , friendships while trying to stop the demon’s that’s coming after her “ all while having fire powers” i really recommend it! ",
        "upvotes": 12,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hdk455/jentry_chau_vs_the_underworld_official_trailer/"
    },
    {
        "id": "1hd4w9g",
        "author": "IamVBull",
        "title": "Is Lost worth a watch if you are going in completely blind?",
        "content": "I know absolutely nothing about the show, aside from the fact it's considered to have one of the worst endings in Television history. Knowing this, is Lost still worth a watch?",
        "upvotes": 140,
        "comments": 215,
        "media": null,
        "permalink": "/r/netflix/comments/1hd4w9g/is_lost_worth_a_watch_if_you_are_going_in/"
    },
    {
        "id": "1hdf7co",
        "author": "XOXITOX",
        "title": "A New King is Born",
        "content": "\nThe Kings of Tupelo was entertaining from beginning to end. Not since the Tiger King has a Netflix docu-series been so.. bizarre. \n\nBut unlike Tiger King, this is a true crime. A campy, real life, Elvis true crime story. \n\nI can’t explain what happened, just tell you it’s one of the great American odd ones. This tall tale from Tupelo really made my day. I laughed my ass off. Justice did prevail. And I think you’ll get a kick out of it. An Elvis high kick. He-yuah!\n\nMost importantly, these Elvis impersonators reminded me that the King lives. And for that I love them. ",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hdf7co/a_new_king_is_born/"
    },
    {
        "id": "1he4hwo",
        "author": "coconutsndaisies",
        "title": "more classist crap from this company",
        "content": "first they disabled screen in screen mode for users who pay less, and now there are restricted movies if you pay less. the company is worth a billion dollars and is taking more and more from the “small” people. it’s honestly fucking gross. we should just find free websites again, i’m over it. boycott netflix",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1he4hwo/more_classist_crap_from_this_company/"
    },
    {
        "id": "1hdtocf",
        "author": "NestingBun",
        "title": "Netflix and Safari Issue on MacBook Pro",
        "content": "I've noticed that when I use Safari to watch Netflix, the red \"watched\" bar is not showing after watching episodes of shows. I only see a \"watched\" bar on the first episode of each season, but not on any other episode. \n\nI don't have this problem with Chrome. But I've been trying to get away from using Chrome and am hopeful for a solution to watch Netflix on Safari. \n\nAny suggestions are appreciated!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hdtocf/netflix_and_safari_issue_on_macbook_pro/"
    },
    {
        "id": "1hdtcgp",
        "author": "Avault-Vorce",
        "title": "The Best Series",
        "content": "I recently found a Netflix show called If My Wife Became an Elementary Student. It’s a live-action version of the anime, and I kind of regret watching it because every episode made me cry. The show was a bit awkward at times, but I couldn’t stop myself from getting emotional. It’s so sad that it only has 10 episodes. I can’t stop thinking about it, and I really hope they make a continuation.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hdtcgp/the_best_series/"
    },
    {
        "id": "1hdsugp",
        "author": "Sudden_Pop_2279",
        "title": "THE AMAZING DIGITAL CIRCUS - Ep 4: Fast Food Masquerade, is out on YouTube and Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hdsugp/the_amazing_digital_circus_ep_4_fast_food/"
    },
    {
        "id": "1he11ez",
        "author": "Character_Reveal_859",
        "title": "Request for Netflix!!! ",
        "content": "Netflix,\n\nPlease buy the rights to “Locked up abroad” and release new seasons.\n\nI am sure there are plenty of smugglers who got caught, and myself along with millions of others would love to hear and see their stories.\n\nThis used/is my favorite show of all time, promise instant success!!\n\nLet’s bring this back!!!!!!!!\n\nComment if you’re also a fan!!! \n\nSincerely,\nNot a smuggler ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1he11ez/request_for_netflix/"
    },
    {
        "id": "1hdvris",
        "author": "Ordinary_Set6499",
        "title": "Carry On",
        "content": "If the Hallmark Channel made an action movie, this would be it. I feel that I should get at least a one month membership discount for the 1 hr 45 min it took from my life 😆",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1hdvris/carry_on/"
    },
    {
        "id": "1hdc1rv",
        "author": "Pogrebnik",
        "title": "Netflix's Colombian Series Spurs Economy",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hdc1rv/netflixs_colombian_series_spurs_economy/"
    },
    {
        "id": "1hdvbyc",
        "author": "LittleShinyRaven",
        "title": "Thumb ratings missing",
        "content": "Did a search and didn't see any other posts. I rate shows mostly to remember that I've watched some of them already. I noticed some of the holidays movies/shows I watched last year that I know I rated are missing my ratings. Is this a system error or on purpose? Anyone else have this issue?\n\nI still see them and can rate again so the thumbs themselves aren't missing to clarify.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hdvbyc/thumb_ratings_missing/"
    },
    {
        "id": "1hdqwyb",
        "author": "BattyBr00ke",
        "title": "How can I fix this? ",
        "content": "A new movie came to Netflix today and it was nowhere in my suggested watching or newly added until I searched for it. I feel like I'm missing a lot of things I would watch because they don't show up in these categories on my homepage, but what does show up on my homepage are things I would never watch, particularly foreign films where I have to read subtitles. Don't get me wrong, there are wonderful foreign films, but I have to read a computer screen all day for work, so it's really not what I'd like to do in my spare time, not even to enjoy a film that may be worth watching. How can I change the algorithm, I guess you would call it, for Netflix to better suit me?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hdqwyb/how_can_i_fix_this/"
    },
    {
        "id": "1hdgu48",
        "author": "Rabbidraccoon18",
        "title": "Just finished watching Girl Haunts Boy and it was surprisingly good! ",
        "content": "The movie definitely made me feel something. I thoroughly enjoyed watching it. It was pretty short and simple but I guess that made it even more effective. The ending was really bittersweet but I like it because it felt like it was something different if that makes sense. What do y'all think? Did y'all like it?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hdgu48/just_finished_watching_girl_haunts_boy_and_it_was/"
    },
    {
        "id": "1hcyzwt",
        "author": "RainH2828",
        "title": "Will someone watch a movie with me?",
        "content": "   I’m feeling lonely tonight and I just want to be able to feel like I have some companionship tonight. Would anyone be willing to watch the same movie at the same time with me? Or if someone knows of a watch party thing we can do? We could do a tv show like Ultimatum or something that, too, so we can gossip about it over reddit PMs while we watch. I genuinely have no friends in person to invite over and my health has been iffy so if I had friends to come over, I’d feel awkward and just don’t want to deal with the social anxiety attached. Anyone? ❤️",
        "upvotes": 68,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1hcyzwt/will_someone_watch_a_movie_with_me/"
    },
    {
        "id": "1hdbnt9",
        "author": "balloontrap",
        "title": "Thoughts on “One Hundred years of Solitude”",
        "content": "\n \nI’ve recently come across screen adaptation of Gabriel García Márquez’s masterpiece One Hundred Years of Solitude, and I can’t stop wondering how this incredible novel will translate to the screen. it’s a dense, multi-generational saga filled with magical realism, complex characters, and deeply rooted cultural nuances.\n\nFrom what I’ve read, Márquez’s family is involved in the production, and it seems Netflix is taking the helm. This gives me hope that they’ll preserve the integrity of the novel. Still, I’m left with so many questions about how they’ll approach this:\n\n\t•\tis it be a faithful adaptation or a more modern reinterpretation?\n\t•\tHow will they tackle the intricacies of the Buendía family tree without overwhelming viewers?\n\t•\tCan the magical realism elements—like the rain of yellow flowers or Remedios the Beauty’s ascension—be done justice on screen without losing their surreal, poetic essence?\n\t\n\nFor those of you have read it,  what do you think. Are there particular scenes or themes you’re especially excited about. I’m curious to hear everyone’s thoughts—especially from those who hold this book as dearly as I do. ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hdbnt9/thoughts_on_one_hundred_years_of_solitude/"
    },
    {
        "id": "1hdzqbd",
        "author": "Wild_Landscape_6550",
        "title": "Unpopular opinion: Netflix really needs to take shows off the platform when they cancel it",
        "content": "I’m so done with having to look up if a show ended properly when they cancel it. I just instantly get turned off when I have seen a show has been cancelled. A lot of the times people don’t watch thing a for the same reason … waiting until everything’s out and then they cancel it because of lack of views but in reality it’s their fault. Ugh!! ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hdzqbd/unpopular_opinion_netflix_really_needs_to_take/"
    },
    {
        "id": "1hdc8fv",
        "author": "TimesandSundayTimes",
        "title": "Netflix’s Black Doves — the truth about female spies. Television is catching up with the reality of women in espionage, says intelligence expert Gordon Corera",
        "content": "",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hdc8fv/netflixs_black_doves_the_truth_about_female_spies/"
    },
    {
        "id": "1hdb6rs",
        "author": "korucraftstudios",
        "title": "Does anyone know what this means?",
        "content": "https://preview.redd.it/f2vjmqhp0m6e1.jpg?width=1405&amp;format=pjpg&amp;auto=webp&amp;s=aa991debbb1165471bd27d57e3954a526d7831b9\n\nThere’s a show coming soon on Netflix (new season), and there‘s some kind of countdown with a bell close to it (that is wrong and goes the other way around, every second the timer increases). Does anyone know what it means?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hdb6rs/does_anyone_know_what_this_means/"
    }
]