[
    {
        "id": "1qd13z7",
        "author": "scoreboard-app",
        "title": "Post-Match Thread: Albacete Balompie vs Real Madrid | Copa del Rey 25/26 | Jan 14, 2026",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1qd13z7)",
        "upvotes": 135,
        "comments": 571,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qd13z7/postmatch_thread_albacete_balompie_vs_real_madrid/"
    },
    {
        "id": "1qarzcp",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 18,
        "comments": 4980,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qarzcp/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1qd0qvp",
        "author": "dark4403",
        "title": "and we lose the match....",
        "content": "",
        "upvotes": 2638,
        "comments": 480,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/50acr01qzddg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qd0qvp/and_we_lose_the_match/"
    },
    {
        "id": "1qd909h",
        "author": "OwnWitness2836",
        "title": "Xabi : I’m doing very well, I’m calm.",
        "content": "",
        "upvotes": 630,
        "comments": 42,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jcsqbosgqfdg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qd909h/xabi_im_doing_very_well_im_calm/"
    },
    {
        "id": "1qd1wny",
        "author": "Due_Requirement_1170",
        "title": "Oh how I so badly miss this",
        "content": "",
        "upvotes": 1173,
        "comments": 116,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1xm3n9wq7edg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qd1wny/oh_how_i_so_badly_miss_this/"
    },
    {
        "id": "1qd2ge1",
        "author": "ace-s",
        "title": "Alvaro Arbeloa acting like Vini scored a hatrick tonight during post game press conferance was unbelievable",
        "content": "Alvaro Arbeloa: \"THIS is the Vini I want. took all responsibility and tried to put the team on his back. Tonight's Vini was a CAPTAIN Vini.\"\n\n  \nMeanwhile, these were his stats tonight:\n\n90 Minutes.\n\nO Goals/Assists.\n\n1/3 Shots on Goal.\n\n23 Possessions Lost.\n\n2 Offsides.\n\n25m\n\nAgainst a team that's 17th in the second division\n\n  \nIs Alvaro real???? Didnt he say Mou is his inspiration? Mou would have ripped Vini to shreds",
        "upvotes": 734,
        "comments": 119,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qd2ge1/alvaro_arbeloa_acting_like_vini_scored_a_hatrick/"
    },
    {
        "id": "1qdd5k3",
        "author": "TheFeatherDiaries",
        "title": "Arda Güler's deliveries yesterday",
        "content": "",
        "upvotes": 122,
        "comments": 35,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/k6qmt4d7tgdg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qdd5k3/arda_gülers_deliveries_yesterday/"
    },
    {
        "id": "1qcu1bh",
        "author": "ryujinitzylover",
        "title": "Xabi today in Madrid",
        "content": "",
        "upvotes": 1426,
        "comments": 147,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qcu1bh/xabi_today_in_madrid/"
    },
    {
        "id": "1qd2b0o",
        "author": "Dizzy-Psychology-262",
        "title": "The only happy Madridista detected today",
        "content": "",
        "upvotes": 551,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ozro59ulaedg1.jpeg?auto=webp&amp;s=0fa06065924910b2477ca96a851c392a81b08c29"
        },
        "permalink": "/r/realmadrid/comments/1qd2b0o/the_only_happy_madridista_detected_today/"
    },
    {
        "id": "1qdam0e",
        "author": "Lonely-Paint-7876",
        "title": "What a player he could have been at Madrid if Pérez had listened to Xabi.",
        "content": "",
        "upvotes": 149,
        "comments": 30,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/izp5fjbj4gdg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qdam0e/what_a_player_he_could_have_been_at_madrid_if/"
    },
    {
        "id": "1qd3c4z",
        "author": "New_Orange_9901",
        "title": "Bernabeu you know what to do.",
        "content": "Real Madrid had also just won the Champions League, but the Bernabéu, fed up with their attitude, gave them a historic booing. Cristiano Ronaldo, who saved that elimination round, remained a champion, listening to the criticism. Such greatness.\nFans need to run it back vs Levente this Saturday so that they know this is ain’t right.",
        "upvotes": 389,
        "comments": 35,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7bv44q1zhedg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qd3c4z/bernabeu_you_know_what_to_do/"
    },
    {
        "id": "1qd2owd",
        "author": "asensia-kopfschmerz",
        "title": "Carvajal: \"Today we have hit rock bottom. Starting tomorrow, each of us individually and collectively must engage in self-criticism. We still have time to turn the season around; we have two fantastic competitions and we're going to fight for them.\"",
        "content": "",
        "upvotes": 375,
        "comments": 68,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qd2owd/carvajal_today_we_have_hit_rock_bottom_starting/"
    },
    {
        "id": "1qdchqe",
        "author": "arthur_kane",
        "title": "Real Madrid helping financially struggling club battling relegation in Segunda Divisón",
        "content": "",
        "upvotes": 77,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ftvtnr8kmgdg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qdchqe/real_madrid_helping_financially_struggling_club/"
    },
    {
        "id": "1qd8leg",
        "author": "drakos500",
        "title": "The individuality era is Over. Time to move on.",
        "content": "I do not understand why so many fans refuse to actually support the club instead of players or top executives.  \n\nThis club is rotten to the core. And don't be mistaken  Real madrid is heading (again) down the manchester united path or even worse. this administration is completely outdated and old ad senile. This is 2026, the concept of playing superstars and relying on  the to shine is not feasible. Why ? because :\n\n1) Real madrid does not have a stacked deck like in 2016. way to many overrated and moody at best players. the only decent 'superstar' is Mbappe. And even then he is not good enough to build an ENTIRE system on him alone. \n\n2) buying ready superstars, is too expensive. our Club just ran out of all it's elite veterans that made it seem easy. especially in midfield with modric and kroos.\n\n3) Football has become more intense and more team oriented. people seem to forget that although there were a lot of egos in 2016+ but they were so good at their roles that they synchronized into an unstoppable team. this is definitely not the case for these current players.\n\nAlonso was just disappointed by how immature and very unprofessional these players are. and the rest of the fans will soon know it.",
        "upvotes": 125,
        "comments": 35,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qd8leg/the_individuality_era_is_over_time_to_move_on/"
    },
    {
        "id": "1qd0zp3",
        "author": "Lucky_Reading_3757",
        "title": "Another shaky match for Vinicius Junior today as Real Madrid lose to a Segunda Division side in a relegation battle.",
        "content": "He is valued at 11x Albacete’s entire squad on Transfermarkt",
        "upvotes": 318,
        "comments": 153,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mcfd4tg31edg1.jpeg?auto=webp&amp;s=735e26152facfa05e54c351ba71454f39560bff3"
        },
        "permalink": "/r/realmadrid/comments/1qd0zp3/another_shaky_match_for_vinicius_junior_today_as/"
    },
    {
        "id": "1qd6umz",
        "author": "stoicismmoral",
        "title": "Hear me out: if you wanted to get Arbeloa as a short term coach, we should have hired this guy instead.",
        "content": "I mean with how much he loves the club even though he is not benefitted or supported by the club, he still manages to show what the club needs. If we wanted to experiment and ruin Arbeloa’s career why not bring someone who knows how to atleast bring the team to some conscience?\n\nArbeloa is going to be hated with the bigger disaster on the horizon and no one is going to take the repercussions. The board will sack him and get new one. Why not just get Khabib for a month and just get back to at least having players who behaves. ",
        "upvotes": 131,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yoa8ra9z8fdg1.jpeg?auto=webp&amp;s=01d4992e0980368fa8e8e059fe05366411333137"
        },
        "permalink": "/r/realmadrid/comments/1qd6umz/hear_me_out_if_you_wanted_to_get_arbeloa_as_a/"
    },
    {
        "id": "1qd13p7",
        "author": "senormadridista9248",
        "title": "Old Madrid fans dilemma, am I the only one feeling this way?",
        "content": "If I witnessed Zizou, Raúl, Iker, Cristiano, Ramos, without them getting even half the love and protection players get today… who the hell is Vinícius Jr supposed to be to me? Legit question.\n\nI watched the man who delivered the mighty three peat get disrespected. I watched the ones who dragged us back into glory get whistled, doubted, and torn apart after one bad game. No shielding. No narratives. No patience projects.\n\nSo tell me, in Real Madrid terms:\n\nWho is Viní Jr really?\nWho the hell is Jude Bellingham?\nAnd Mbappé, or as my brain keeps calling him, Mpaypal?\n\nAt Madrid it used to be simple. You perform, or you fuck off.\n\nI’m not saying these players are bad. I’m saying my standards are completely broken by what I grew up watching. Legends who got destroyed by the press, booed at the Bernabéu, questioned constantly, and still delivered year after year.\n\nNow it feels like every decent run of form needs to be crowned as a new era.\n\nI want to enjoy this generation. I really do. I want that emotional connection again. That inevitability. That fear opponents used to have before kickoff.\n\nBut honestly? It still feels far away. Like 2028 or 2029 far.\n\nBefore you come at me, take a look at what OG Madrid fans are saying.",
        "upvotes": 316,
        "comments": 90,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qd13p7/old_madrid_fans_dilemma_am_i_the_only_one_feeling/"
    },
    {
        "id": "1qd5zkj",
        "author": "BackgroundAthlete425",
        "title": "Florentino Pérez: Step Down Now Before You Ruin Your Own Legacy",
        "content": "Florentino Pérez, you are already one of the most successful club presidents in football history. You delivered six Champions League titles and built the new Bernabéu, and global dominance — no one can take that away from you.\n\nBut right now, you are no longer running Real Madrid with logic or sporting vision. You are running it with ego. Your decisions feel stubborn, disconnected, and driven by personal pride rather than what’s best for the club.\n\nIt’s time to step down and hand the club to the next generation before you do real damage to the legacy you once built.",
        "upvotes": 129,
        "comments": 41,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qd5zkj/florentino_pérez_step_down_now_before_you_ruin/"
    },
    {
        "id": "1qddtoq",
        "author": "OkRecommendation7341",
        "title": "We know how you're feeling right now💔",
        "content": "",
        "upvotes": 38,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1ldvnj0r0hdg1.jpeg?auto=webp&amp;s=5bc1b13a073491c6a3d9ae24d37073dc85db361c"
        },
        "permalink": "/r/realmadrid/comments/1qddtoq/we_know_how_youre_feeling_right_now/"
    },
    {
        "id": "1qd4qlg",
        "author": "OwnWitness2836",
        "title": "Xabi Was Never the Problem",
        "content": "After watching today’s game, Xabi was not the problem. It was the players.\n\nHe had a very good season at Bayer Leverkusen, and his tactics worked there.\nAt Leverkusen, the players played according to his style without arguing, and they were respectful toward him.\n\nThe real problem is that the club sacked him at the wrong time. If they didn’t like his playstyle, it would have been more sensible to part ways with him after the season.\n\nNow we don’t have a coach until next season.\n\nI also believe Xabi had a good chance to become one of the best coaches of our era at Real Madrid, but he wasn’t given enough time. Some players didn’t like his playstyle.",
        "upvotes": 147,
        "comments": 57,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qd4qlg/xabi_was_never_the_problem/"
    },
    {
        "id": "1qd11r1",
        "author": "ace-s",
        "title": "I just wish Xabi got more time, 25/26 Arsenal/Bayern is what happens when the entire organization have full faith in their manager.",
        "content": "They are arguably the strongest team in the world right now.\n\nWe could have built something great with Xabi. Our roster is imbalanced, we have a mix of players that fill the same role and a group of players that feel they are above the manager.\n\nI just wish they invested more into Xabi, they empowered him to decide on who to play and how to play them. Allowed him to buy the players he needs to make his system work,\n\nWhat makes me depressed is that eventually they will buy the players that Xabi needed (cuz they will be forced to) and Xabi wont be there to utilize them.",
        "upvotes": 216,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qd11r1/i_just_wish_xabi_got_more_time_2526_arsenalbayern/"
    },
    {
        "id": "1qcvr3m",
        "author": "Informal-Onion8544",
        "title": "Albacete fans racist chants outside the stadium: “You are a monkey, Vinicius you are a monkey\"",
        "content": "",
        "upvotes": 382,
        "comments": 117,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/q37hernj2ddg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qcvr3m/albacete_fans_racist_chants_outside_the_stadium/"
    },
    {
        "id": "1qdc208",
        "author": "Emergency-Hornet-594",
        "title": "🚨 Alvaro Arbeloa: \"Do I regret leaving star ?“Tonight's team was a FANTASTIC team that can beat ANY TEAM IN THE WORLD, not just Albacete.\" ⚠️‼️ . . . (What in the world is he on about? Truly delusion. Man o man",
        "content": "🚨 Alvaro Arbeloa: \"Do I regret leaving star players in Madrid? No, no, if I could do it again, I would do it 1000 TIMES!”\n\n“Tonight's team was a FANTASTIC team that can beat ANY TEAM IN THE WORLD, not just Albacete.\" ⚠️‼️\n.\n.\n.\n \n\n(What in the world is he on about? Truly delusion. Man o man i think preze kidnapped his family or smt.)\n.\n.\n \n.\n \n ",
        "upvotes": 41,
        "comments": 59,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdc208/alvaro_arbeloa_do_i_regret_leaving_star_tonights/"
    },
    {
        "id": "1qd4t3u",
        "author": "bslawjen",
        "title": "Perez is ultimately the main culprit here.",
        "content": "I remember when just a few months ago this subreddit would religiously downvote anybody that spoke against Perez, his ridiculous sporting decisions or his stupid Super League. However, because of recent results the tide has shifted and I guess more people will agree now:\n\nPerez has to go, the best time would've been a few years ago; the second best time is now. The dude has no clue about football so it's insane that he's the one making sporting decisions, like transfers. This has been going on, and plenty of coaches suffered because of it. Zidane, ultimately, left because of that fact; Ancelotti wasn't given full support literally after winning CL and then his replacement doesn't get full support either.\n\nThe ESL stuff alone should have been enough for a vote of no confidence, but since Perez has spent years buttering up the board and socios to essentially be his mindless drones we have to watch his miserable attempts of forming this stupid competition until he decides he doesn't want to be the president anymore. Which won't happen, so we'll have to wait until he dies.\n\nAll of this stems from Perez. And yet it will continue while the old fart points fingers at everybody else (mainly the coach).",
        "upvotes": 112,
        "comments": 29,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qd4t3u/perez_is_ultimately_the_main_culprit_here/"
    },
    {
        "id": "1qcz0lb",
        "author": "No-Independent2522",
        "title": "Mastantuono equalizes 1-1 Albacete",
        "content": "",
        "upvotes": 203,
        "comments": 25,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g6d7uraznddg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qcz0lb/mastantuono_equalizes_11_albacete/"
    },
    {
        "id": "1qdawzg",
        "author": "Lost-Mention",
        "title": "We need to recognise our Nachos and Vazquezs",
        "content": "If this Madrid team is to succeed in future, one of the most important steps will be to recognise who in our team are the new Nachos and Vazquezs. \n\nThese are players that are good enough to be at Madrid, to be in match day squads, but not to be regular starters. These are players that can plug in gaps with high quality, or provide quality off the bench, but who are not to be relied upon week in and week out. \n\nWe have fond memories of Joselu because we did not rely on him for goals week in and week out. He was often a substitute or played when some other players were injured, or against specific opposition - and when used in that limited role he excelled. \n\nNacho was always excellent when he would come off the bench or play 5-6 games while someone was injured. But when he played a stretch of 15+ games (when Alaba and Militao were injured) his short comings soon became apparent. \n\nWe need to recognise who those kind of players are in this team soon. I will be controversial and name 2:\n\nFede Valverde and Camavinga. \n\nBoth are utility players that offer good quality in most of the roles they can be deployed in. But not the highest quality required for the best club in the world. Both are supposed to be box to box CMs but they cannot operate under a high quality press. Both cannot organise an attack. \n\nCama is extremely one footed, cannot shoot and rarely provides quality final balls in the last 3rd.\n\nFede cannot dribble and isn't the best passer either so again he can be shut down against quality presses.\n\nSuch limited players cannot be the mainstay of top class midfields, especially of 3 man midfields.\n\nBut there are other players who fall into this category. Ascencio and Fran Garcia being other obvious ones. But until the club recognises who all these players are and brings in the actual quality we need to properly compete, we are going to continue to struggle. ",
        "upvotes": 40,
        "comments": 30,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdawzg/we_need_to_recognise_our_nachos_and_vazquezs/"
    },
    {
        "id": "1qd0n08",
        "author": "dark4403",
        "title": "GONZALO MAKES IT 2-2",
        "content": "",
        "upvotes": 158,
        "comments": 29,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vx0nqy00zddg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qd0n08/gonzalo_makes_it_22/"
    },
    {
        "id": "1qdd1r2",
        "author": "MOUZANNAR40",
        "title": "Mbappe is the problem they said",
        "content": "Vini fanboys really tried to push an agenda against mbappe that he was the reason xabi left/sacked and the reason about the downfall of our team etc.. while as u see vini clocking bad performances in and out game after game with and without mbappe on the team and still arguing and creating conflicts with EVERYONE team or opponents. Vini is the only player that didn’t lost a farewell message to xabi. He was the most player that wanted xabi out because xabi was the first brave coach that caught up with his bullshit and started subbing him which vini didn’t like. Vinicius plays 1 good game and he dips again for 10 games. Mbappe was saving our asses game after another (almost) im not saying mbappe doesn’t have some flaws but what i know is he was more help than a problem for us more than vini jr. ",
        "upvotes": 26,
        "comments": 30,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdd1r2/mbappe_is_the_problem_they_said/"
    },
    {
        "id": "1qcwp5k",
        "author": "No-Independent2522",
        "title": "Thibaut Courtois statement against Albacete fans for calling Vini Jr. a ‘m*nkey’: “This is DISGUSTING. Enough with the racism.”",
        "content": "",
        "upvotes": 235,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jnmhxhpm8ddg1.jpeg?auto=webp&amp;s=91a231f7c5feb611d46915cfdbea84948a9a21ed"
        },
        "permalink": "/r/realmadrid/comments/1qcwp5k/thibaut_courtois_statement_against_albacete_fans/"
    },
    {
        "id": "1qd7vyb",
        "author": "Kavazou77",
        "title": "The rest of the year is guaranteed to be as entertaining on the field as it is off.",
        "content": "And I don't mean because we're fun to watch but because we really have no idea what this team will look like come Saturday and Tuesday. But, it's all irrelevant, because the buck stops with Flo and the team lives and dies by his decisions.\nThis team is more likely to bring in Haaland and play with 5 forwards than buy a defender, and they've always been like this.\nI'm just a long for the ride. What can you do when you were born into a fandom? Leave? It's as much a part of me as the color of my eyes and hair.\nThe team won't change the structure because until they have a financial loss, they don't need to because there talent will eventually push through as it always has and winning erases everything else. This is what Real Madrid is.\nIf you've had enough, this is the time to get off the train. If not, buckle up.",
        "upvotes": 50,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nb02xdu8hfdg1.jpeg?auto=webp&amp;s=9377ded16427d83654ef74ffb787cc75bac27d8a"
        },
        "permalink": "/r/realmadrid/comments/1qd7vyb/the_rest_of_the_year_is_guaranteed_to_be_as/"
    }
]