[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 13,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 63,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lepskj",
        "author": "S4v1r1enCh0r4k",
        "title": "'Mindhunter' Season 3 Isn’t Dead Yet – Star Reveals Surprising Update Fans Didn’t See Coming\"",
        "content": "",
        "upvotes": 346,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1lepskj/mindhunter_season_3_isnt_dead_yet_star_reveals/"
    },
    {
        "id": "1leu633",
        "author": "NoSweat_PrinceAndrew",
        "title": "Is there a way to remove the 'Add account' on the Netflix home screen? Our 8 year old has worked out he can just create a new account with adult content",
        "content": "Seems like a bit of a design flaw on Netflix part. Our 8 year old has worked out that if he loads Netflix on the TV when it gets to the screen to select a profile he can just create a new profile and just leave the children content box unlocked, enabling all the adult content to him\n\nI've looked everywhere on the app to see if the 'add profile' option can be removed but haven't been able to work it out\n\nAny suggestions??",
        "upvotes": 34,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1leu633/is_there_a_way_to_remove_the_add_account_on_the/"
    },
    {
        "id": "1lete3i",
        "author": "ThrowALifeline89",
        "title": "How is anyone supposed to hear all the dialogue that's being said with the audio being the way it is?",
        "content": "Hey everyone! Audio in movies not being great is at this point a well documented thing I believe. Yet it almost seems to be getting worse. I just watched *Extraction* on Netflix because someone recommended it to me. I mostly enjoyed the movie but the audio was so bad. Like there was an emotional scene between two characters but I couldn't understand a single word that one of them was saying. But then the explosions and gun shots are way louder. Sure, to a degree this can be used as a stylistic choice to make the violence more intimdating and such. However it can not be in the interest of the filmmakers that I, as a viewer, end up moving the volume up and down constantly depending if there are people talking or if there is fighting going on. Constantly.\n\nWhen are TV &amp; movie producers going to adress this problem? People have made videos about this on YouTube for years yet nothing is being done about it; what's up with that?",
        "upvotes": 15,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lete3i/how_is_anyone_supposed_to_hear_all_the_dialogue/"
    },
    {
        "id": "1lep5xz",
        "author": "Cartman",
        "title": "Netflix House to open in Philadelphia in late 2025",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lep5xz/netflix_house_to_open_in_philadelphia_in_late_2025/"
    },
    {
        "id": "1leofd9",
        "author": "berrey7",
        "title": "Trainwreck: I have been looking forward to each Tuesday release.",
        "content": "I actually really like it, and I think they have done a really good job with it.  \n\nIt's been awhile since My wife and I have had something to look forward to each week as a series.",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1leofd9/trainwreck_i_have_been_looking_forward_to_each/"
    },
    {
        "id": "1leylve",
        "author": "ninarinaa",
        "title": "i need show recs like now pleaseeee",
        "content": "watching shows is literally the best part of my day but i haven’t been able to find a good one in ages. \n\ni’ve enjoyed shows like game of thrones, desperate housewives, shameless, greys, money heist, derry girls, friends, breaking bad, gossip girl, the originals, the walking dead, dead to me, oitnb.\n\ni did NOT enjoy the last kingdom, lost, superstore, supernatural and succession. just found them boring. \n\ni thought i was into 2000s shows but i found the OC, gilmore girls and one tree hill extremely boring. i need shows that have loads of seasons and episodes. please im literally soooooo bored. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1leylve/i_need_show_recs_like_now_pleaseeee/"
    },
    {
        "id": "1le525o",
        "author": "Ionazano",
        "title": "Is there anything new in \"Titan: the Oceangate Submersible Disaster\"?",
        "content": "So a new addition on Netflix that I noticed is \"Titan: the Oceangate Submersible Disaster\". It's currently in the top 10 most watched. On the one hand as someone with an engineering background I'm very interested in engineering cautionary tales. On the other hand I've already read about everything that happened leading up to the Titan submersible disaster in great detail.\n\nSo my main queston in deciding whether it's worth watching for me is the following: does this documentary contain any new information or perspective?",
        "upvotes": 93,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1le525o/is_there_anything_new_in_titan_the_oceangate/"
    },
    {
        "id": "1leyj4h",
        "author": "Puncake_Yoshi",
        "title": "KPop Demon Hunters Analysis",
        "content": "What are your guy’s thoughts on the trailer and interview that the directors had for this movie? Are you guys excited to watch this movie in just 2 days or did this not peak your interest? Let’s talk!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1leyj4h/kpop_demon_hunters_analysis/"
    },
    {
        "id": "1lewte2",
        "author": "-i-am-nowhere-",
        "title": "Autoplay controls under Playback Settings no longer working on Chromecast with latest app update. Any workaround?",
        "content": "Logged into Netflix via Chromecast and noticed the app had been overhauled with a brand new layout.  Additionally, everything autoplays instantly.  I had previously [disabled this under Playback Settings](https://i.imgur.com/TZaAvzp.png) and those settings appear to be unchanged, but no longer effective.  I went to the settings on desktop because I haven't been able to find them through Chromecast.  Is there another way to access these settings?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lewte2/autoplay_controls_under_playback_settings_no/"
    },
    {
        "id": "1lew6ya",
        "author": "LoonyToony1",
        "title": "Any ideas for mobile and pc tools to add subtitles to a show or a movie that don't have the language you know?",
        "content": "I am trying to watch one piece and solo leveling but they don't have subtitles and it's really annoying and I am trying to learn Japanese when watching but they only got Japanese sub any ideas?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lew6ya/any_ideas_for_mobile_and_pc_tools_to_add/"
    },
    {
        "id": "1lebpwh",
        "author": "Successful_Blood3995",
        "title": "Your device isn't part of your household BS?",
        "content": "I am the account holder.  There is no one outside of my house using my account.  It's me and my two sons.  I am pretty much the only one who uses Netflix.  My kids are gamers.  All 4 pcs (2 kids, one me, one living room) are hardwired through the wall ethernet jack.  \n\nToday, I clicked on Netflix (Chrome browser) and it said that both my living room and bedroom pcs are not part of my household!  What? Lol.  I can sign in temporarily for 2 weeks and then I must create my own account lmao or use wifi.  How tf do I use wifi when I'm directly connected through the wall jack?  Netflix is crazy.  Anyone know how to deal with this?  \n\nIf this doesn't resolve I'm cancelling my subscription.  ",
        "upvotes": 14,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1lebpwh/your_device_isnt_part_of_your_household_bs/"
    },
    {
        "id": "1letoru",
        "author": "stuntman_matt",
        "title": "Subtitles",
        "content": "I’m watching a film on Netflix, it’s in English (Equalizer 3) but there are no “in film” subtitles for the foreign speaking bad guys. If I want to know what they are saying, I need to turn the subtitles on manually, which means that everyone in the film has subtitles now, not just the people speaking a foreign language. Does anybody know why or how to fix this please?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1letoru/subtitles/"
    },
    {
        "id": "1lehdfn",
        "author": "bearsbeetspie",
        "title": "Justin Willman's New Netflix Special",
        "content": "TL;DR - Two things: \nFirst, the special - thoughts?\nSecond, upcoming tour - who's going?\n\n\n\nHow did everyone feel about the recently released special? \n\nI always wonder if I'm the only one who gets this feeling like I'm both happy AND want to cry after watching his performances Lol \nI know nothing he's doing is a \"miracle\", but he's just so uplifting even when he's cheeky or the jokes get going. At the end of his shows, it's like we all went on this journey, and I didn't realize how much I needed that lately. \n\n\nAnyways - as we were watching, I thought to myself \"huh, it seems that when comedians do a comedy special on Netflix, they're going on tour and they might come to Toronto\"... \nAnd sure enough, Justin is! \n\nWe got tickets to his show in Toronto, and I'm super stoked for it. \nAnyone else going? \nAnyone here seen him live before? What was your experience?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lehdfn/justin_willmans_new_netflix_special/"
    },
    {
        "id": "1ldssxz",
        "author": "Swordfish353535",
        "title": "Having a lazy day at home, any good Netflix docu-series things of recent years to watch?",
        "content": "Haven't watched one in a while but have seen a lot of the old ones so wondering if there's any good ones released in the last 2 years or so?\n\nI'm seeing this Osama Bin Laden one although seeing mixed reviews. Ideally something that'll keep me gripped.",
        "upvotes": 128,
        "comments": 125,
        "media": null,
        "permalink": "/r/netflix/comments/1ldssxz/having_a_lazy_day_at_home_any_good_netflix/"
    },
    {
        "id": "1lenv60",
        "author": "DanAbnormal94",
        "title": "Sirens Paint Color Identification",
        "content": "Hi. I just wanted to see what the green color is in kitchen It is around the doors and on the island. If there is a Benjamin Moore match that would be great. My partner will be thrilled.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lenv60/sirens_paint_color_identification/"
    },
    {
        "id": "1ldrjv1",
        "author": "Sea_Cookie2373",
        "title": "Too long ago",
        "content": "Does anyone else ever just start a whole show over because they forgot what happened, because it was so long since they made the last episode? Sometimes it's been what feels like a year...",
        "upvotes": 111,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1ldrjv1/too_long_ago/"
    },
    {
        "id": "1lenp24",
        "author": "PurchaseWonderful536",
        "title": "Cocaine Air Documentary",
        "content": "First of all, this is by far the BEST work Netflix has done with a documentary in my opinion. First of all EVERYONE spoke, when I saw the ex French president on I couldn’t believe it. The mix of comedy with the facts and different perspectives is just perfect. \n\nOnly one question, why were money never mentioned? There was no mention of any sort of money being in the hands of any pilots, and I don’t mean from the flight they got caught on but the previous flights. If they were involved, they did other flights too, where is the money tho? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lenp24/cocaine_air_documentary/"
    },
    {
        "id": "1lemtoc",
        "author": "smcneal",
        "title": "Charly Barby and Kelly Villares Are the Comeback Queens of the Dallas Cowboys Cheerleaders",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lemtoc/charly_barby_and_kelly_villares_are_the_comeback/"
    },
    {
        "id": "1lev4az",
        "author": "gaywidgeon_528",
        "title": "Ai ads coming for netflix??",
        "content": "I was searching netflix standard with ads because I read that apparently there is one and I wanted something cheaper. Turns out that isn't available in my country but I found something else. There's gonna be ai generated advertisement on Netflix starting in 2026. Um what? Why? Literally no one asked for this.  AND WHY IS AI PART OF EVERYTHING NOWADAYS \n\n(Sorry if this has already been discussed in this sub) ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lev4az/ai_ads_coming_for_netflix/"
    },
    {
        "id": "1leafxn",
        "author": "BerryDolly171819",
        "title": "I wanna watch more movies",
        "content": "The Kingsman movies are my favorite. I also loved the following:\nHunger Games,\nThe Match (Korean),\n7 Women and a Murder,\nThe Six Triple Eight\n\nI don’t really like movies that are pure romance. \n\nCan you please recommend something?",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1leafxn/i_wanna_watch_more_movies/"
    },
    {
        "id": "1lenspm",
        "author": "sasuke-san",
        "title": "WHY CANT YOU WATCH NARCOS ONLY IN SPANISH!",
        "content": "I love both of these shows and I’m bilingual so it doesn’t really affect me in any way but I’m trying to watch with my girlfriend who doesn’t speak any English and I can’t get the narrator to be in Spanish. BUT if I put the show in Japanese or German the narrator actually speaks those languages it makes no sense.",
        "upvotes": 0,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1lenspm/why_cant_you_watch_narcos_only_in_spanish/"
    },
    {
        "id": "1lebfhh",
        "author": "Strong-Intention-596",
        "title": "La Brea",
        "content": "The introduction in the pilot is the most cookie cutter Shi I’ve ever seen 😭 “hey sister that disability you have” “yes brother and you’re going to college soon” (the brother proceeds to see a girl in a opposite car and tries to hit on her which is summed up to) “oh brother you’re such a flirt” “La is too hard mom we should move back to old town and give divorced dad a chance” why does every show nowadays insist on telling instead of showing ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lebfhh/la_brea/"
    },
    {
        "id": "1lehdd5",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix Reveals Nevermore Academy’s Dark Return, Fans Can Apply &amp; Meet The New Principal",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lehdd5/netflix_reveals_nevermore_academys_dark_return/"
    },
    {
        "id": "1leotta",
        "author": "Successful-Sky1178",
        "title": "My Netflix account got hacked and I’m not sure if the recovery process is legit",
        "content": "Hey everyone,\nMy Netflix account was hacked. First, the scammer changed the payment method, and then they changed the email address associated with the account, so now I’ve basically lost access to everything, including my viewing history.\n\nI received an email with a phone number for support, and Netflix’s customer service page also seemed to direct me to that same number. But something feels off. The number isn’t clearly listed on the main website, and when I called, it seemed like the call center was based in India.\n\nNo offense intended at all, but I’m a little cautious since a lot of scams originate from there. What made me more uncomfortable is that they asked me to provide my old 16-digit card number, which I’m obviously not willing to do.\n\nHas anyone else dealt with this before? Is this part of the real Netflix recovery process or am I being scammed again?\n\nEnglish is not my first language so I used AI to correct my mistakes. ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1leotta/my_netflix_account_got_hacked_and_im_not_sure_if/"
    },
    {
        "id": "1le4tof",
        "author": "Wild-Resolution-6703",
        "title": "Need Feel Good Netflix Recs",
        "content": "I’m having surgery soon and I’ll be off work for about a week while I recover. I’m looking for some good rom-coms or anything light and funny on Netflix. Just stuff that’ll make me laugh or feel good. Nothing too serious.\n\nWould love your recs. Thanks!",
        "upvotes": 5,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1le4tof/need_feel_good_netflix_recs/"
    },
    {
        "id": "1le38m7",
        "author": "Blue_Steve945",
        "title": "Why Does Netflix Always Skip the Second Movie?",
        "content": "Anyone else notice Netflix has the first, third, and even fourth movies in a series—but never the second? Like with Kung Fu Panda, it’s so frustrating!\n\nI get there are rights issues, but why tease us with an incomplete series? If they can’t have the whole thing, maybe don’t show any of it.\n\nAnyone know why the second movie always disappears? Would love to hear other examples!",
        "upvotes": 8,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1le38m7/why_does_netflix_always_skip_the_second_movie/"
    },
    {
        "id": "1ldt8wy",
        "author": "RepairmanJack2025",
        "title": "I need a tv series to watch on Netflix.",
        "content": "Comedy or drama fine, but not too dark.  \n\nSave me from boredom, especially with a show that is maybe not the water cooler talk.  If you have a moment, tell us why we should watch. [US]",
        "upvotes": 23,
        "comments": 138,
        "media": null,
        "permalink": "/r/netflix/comments/1ldt8wy/i_need_a_tv_series_to_watch_on_netflix/"
    },
    {
        "id": "1lec500",
        "author": "Airiririforlife",
        "title": "Movie Recommendations",
        "content": "I’m a teenage girl and I absolutely fell in love with the to all the boys I’ve loved before movies. I haven’t been able to find a teen rom-com like it. Any recommendations for a good rom com?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lec500/movie_recommendations/"
    },
    {
        "id": "1ldm4r8",
        "author": "moon-1992",
        "title": "Do you know similar psychological thriller shows like “the sinner” or “broadchurch”?",
        "content": "I love these kind of shows. The vibe of both is irreplaceable. I love the detectives, they are broken but not the depressive fallen kind like in “river” and the whole trauma mystery vibe. “The fall” is also a show I really loved!",
        "upvotes": 32,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1ldm4r8/do_you_know_similar_psychological_thriller_shows/"
    },
    {
        "id": "1leawrd",
        "author": "_AvgCanadianEh_",
        "title": "Audio keeps cutting out",
        "content": "So here is what I am using. LG C1 Oled smart TV. Got Netflix downloaded on it. And for audio, I have a pair of Sony Wireless Headphones connected through bluetooth to my tv\n\nMy issue is, everytime I watch Netflix with this exact set up, the audio always cuts out while whatever im watching keeps playing. Ive looked it up before and something about Dolby audio settings in Netflix, but that's not a thing, the only options are subtitles and audio language. Thats all. I need to know why this is happening and if there is a fix please 🙏 😭",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1leawrd/audio_keeps_cutting_out/"
    }
]