[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 441,
        "comments": 3041,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1na08er",
        "author": "Putrid_Care_9888",
        "title": "wednesday jenna ortega portrait, by me",
        "content": "",
        "upvotes": 47,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1na08er/wednesday_jenna_ortega_portrait_by_me/"
    },
    {
        "id": "1n9wkf3",
        "author": "HotBoot3354",
        "title": "So Tom Martens in Knoxville TN just got away with murder?",
        "content": "I've never seen a more pathetic, cowardly, frail looking man. Dude conspired with his daughter and his someone from behind with a baseball bat. What a piece of crap. Movie is A Deadly American Marriage. I hope that POS Tom rots in hell",
        "upvotes": 29,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1n9wkf3/so_tom_martens_in_knoxville_tn_just_got_away_with/"
    },
    {
        "id": "1na2rfs",
        "author": "Training-Plastic1457",
        "title": "Rewatching Vampire Diaries",
        "content": "I have today started rewatching Vampire Diaries from season one. And I gotta say that Elena is as insufferable as ever. Good thing is I am still Team Damon. ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1na2rfs/rewatching_vampire_diaries/"
    },
    {
        "id": "1n9xhl5",
        "author": "AppropriateAdagio972",
        "title": "Question about the Michigan High School Documentary",
        "content": "Did Kendra Licari get paid for her part in the documentary? Just curious because I watched when high and am genuinely curious. Hope anyone reading haves a good day!!",
        "upvotes": 9,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1n9xhl5/question_about_the_michigan_high_school/"
    },
    {
        "id": "1n9tcqi",
        "author": "ysleez",
        "title": "The Chestnut Man, a really engrossing Nordic thriller!",
        "content": "I really liked it. It's a great crime thriller with a ton of climax and tense atmosphere all around. The whole vibe is perfect, super dark, gloomy Scandinavia and I love the role the little chestnut mans play in it. The main detectives, Thulin and Hess, have that classic clashing-partners dynamic that totally work. The story may not make a lot of sense until you know the chain but it does well to ask you to just go with it. Also, a heads-up, it is quite graphic. Even with its flaws, it’s an awesome watch if you're looking for a dark, fast-paced thriller with some good twists and turns that'll keep you hooked, go for it!\n\nI'd give it a 7.8/10\n\nFlaws: some may feel its a bit predictable (I didn't feel that way) at the end and you have to suspend your beliefs about the killer's abilities lol.",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n9tcqi/the_chestnut_man_a_really_engrossing_nordic/"
    },
    {
        "id": "1na30y8",
        "author": "Proper_Bridge_1638",
        "title": "Love Con Revenge - Question re. Dr. Wickerson",
        "content": "If you’ve watched Love Con Revenge and the episode “A Fraudster in the Family,” I can somewhat understand why there was nothing they could do about the money that was “stolen” from his wife. I assume she was investing in a business that she had ownership in and the money was used to pay for operating costs.\n\nHere is my question… Why didn’t the stepdaughter go after him for identity theft if he was taking out loans in her name? I wish they explored this more. The episode felt anti-climactic when they tracked him down, only to say nothing happened afterwards. \n\nWhat are your thoughts? 🕵️‍♀️🕵️‍♀️🕵️‍♀️",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1na30y8/love_con_revenge_question_re_dr_wickerson/"
    },
    {
        "id": "1n9pu3u",
        "author": "ExpensiveOstrich3559",
        "title": "Katrina: Come Hell and High Water",
        "content": "One of the best modern day documentaries I’ve watched. Few documentaries have made me cry at the end of it, however my heart ached for the people of New Orleans. The Federal Government incompetence and lack of support made me angry as well. The interviewees were very good at helping you make sense of what really happened. I’ve heard that some people didn’t like the Spike Lee episode, but I loved it. The personality and culture of New Orleans shone through the people. It also that the aftermath of Katrina still has a major impact on Modern day New Orleans. Very well done Netflix.",
        "upvotes": 17,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n9pu3u/katrina_come_hell_and_high_water/"
    },
    {
        "id": "1n9ft4n",
        "author": "im_a_reddituser",
        "title": "Love Revenge Con is badly scripted/edited reality investigation but I’m glad those women had support",
        "content": "I wanted this to be engaging but this was not up to the usual quality I expect from Netflix. It was clear that much of the material was scripted and planned before on camera which made it feel wooden from these real people doing a great thing for these women who were struggling to move on.  The spacing and editing made me wish the 2x speed play feature was available on the tv. \n\nI wished it was more buttoned up because the investigator shared some good info but it’s a slog to get through and it feels like not enough people will see it. \n\nWhat did you think? ",
        "upvotes": 45,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1n9ft4n/love_revenge_con_is_badly_scriptededited_reality/"
    },
    {
        "id": "1n9yix9",
        "author": "zkburnah",
        "title": "If I download movies can I watch them in a country if they’re unavailable in?",
        "content": "So im in Portugal and their selection is really good here. So if I download movies like Intersteller, Fast &amp; Furious etc then fly to the UK will I be able to watch them there or not?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n9yix9/if_i_download_movies_can_i_watch_them_in_a/"
    },
    {
        "id": "1na3cqv",
        "author": "Warm-Big1567",
        "title": "What Happened to The Summer Hikaru Died?",
        "content": "I was in the middle of watching this anime and when it was supposed to go to the next episode is wasn’t there. The info page then has no episodes listed, only teasers and more like this. I closed Netflix and reopened it but when I searched the show up again it wasn’t even there. \n\nWhat’s happening?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1na3cqv/what_happened_to_the_summer_hikaru_died/"
    },
    {
        "id": "1n9qnd3",
        "author": "GlitterJerboa",
        "title": "How do I get it to let me watch the credits at the end of an episode?",
        "content": "I tried watching something (on tv, not mobile) today, and it wouldn’t let me watch the credits. It cut to a bunch of options, including “rate the episode”, “watch next episode” and “go to list of episodes”, but it didn’t have an option for me to go back to the credits to watch them. I checked the settings and couldn’t find a setting that turns this off.\n\nPlease don’t comment “why would you want to watch the credits anyway?”. There are personal reasons I want to watch the credits that I don’t feel are necessary to explain, I just want an answer if there is one.",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n9qnd3/how_do_i_get_it_to_let_me_watch_the_credits_at/"
    },
    {
        "id": "1n91xk3",
        "author": "Sweaty-Toe-6211",
        "title": "‘Halo’ Season 1-2 Joining Netflix in the United States in October",
        "content": "",
        "upvotes": 85,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1n91xk3/halo_season_12_joining_netflix_in_the_united/"
    },
    {
        "id": "1n9o1y6",
        "author": "cariesonmywaywardson",
        "title": "Great British Baking show Not showing up",
        "content": "Great British Baking show disappeared from all our accounts. Can’t search it. Deleted from list. On all accounts on all devices. Can’t find other titles too now. \n\nChat was totally useless and told me great British baking show is not a title and that it’s not a show.  \n\nAny ideas? \n\nThis is sole reason we get Netflix. And the utter uselessness of their chat help was comical. ",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n9o1y6/great_british_baking_show_not_showing_up/"
    },
    {
        "id": "1n95ehj",
        "author": "photoshop_2023",
        "title": "Have you watched Love Con Revenge?",
        "content": "What do you think of Love Con Revenge? I cant believe this happens to people! some of the stories are shocking and i feel so sorry for the victims. Its very well put together and worth a watch. ",
        "upvotes": 34,
        "comments": 110,
        "media": null,
        "permalink": "/r/netflix/comments/1n95ehj/have_you_watched_love_con_revenge/"
    },
    {
        "id": "1n9u5ze",
        "author": "swisssf",
        "title": "Watching \"The Seduction of Joe Tynan\" on Netflix - Meryl's Streep's accent is very distracting",
        "content": "After years of being curious about the hard-to-find, acclaimed 1979 film, *The Seduction of Joe Tynan,* it has popped up on Netflix (Alan Alda, Meryl Streep, many others in supporting roles).\n\nI realize Meryl Streep is known as the great virtuoso of accents, but I'm finding *The Seduction of Joe Tynan* challenging to get through it, due to her character's \"Southern\" accent.\n\nStreep plays the daughter of an influential aristocratic Southern powerhouse of the Democratic Party but her accent is.......cloying, hammy, overdone, and inauthentic. It \"feels\" self-indulgent, like Streep determinedly set out to *master* a Southern accent. It seems self-conscious and affected to the point of caricature.\n\nI looked into it, and in a 1980 NY Times' interview, she says she modeled the accent after the way actress/singer/talkshow host, Dinah Shore speaks. Here's a video[ clip of Dinah Shore](https://www.youtube.com/watch?v=sI-pDqAe2do).  What Meryl Streep wields in *The Seduction of Joe Tynan* is not even in the same universe, much less state or region, as Dinah Shore.  It sounds more like a put-on or parody of a mish-mash of a dozen Southernesque accents.\n\nFurthermore, being the daughter of a rich man from Louisiana, and undoubtedly having been educated in the northeast, Streep's character would not have much of an accent at all in the late '70s.  But if she did, it would be a soft but distinctive accent from her particular area of Louisiana.  Instead we get a **gross distortion of Dinah Shore's** ***Tennessee*** **accent** by way of Florida Panhandle cracker--with a dash of Andy Griffith rural North Carolinian hick twang, a sprinkling of Scarlet O'Hara--and swallowed words and droppin' those G's as if she copied Sissy Spacek channeling Loretta Lynn in *Coalminer;s Daughter.*\n\nIn vibe it's precious---very smug, Yale Drama School MFA actress--and ironically, ultimately *inaccurate.*\n\nThe movie otherwise so far is pretty good, tho it unmistakably reflects the culture and \"liberal values\" circa 1979, which is a somewhat dated.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n9u5ze/watching_the_seduction_of_joe_tynan_on_netflix/"
    },
    {
        "id": "1n9t2nv",
        "author": "Ambitious_Classic_",
        "title": "English dubs are inaccurate sometimes",
        "content": "I’m watching Biohackers. The English dubs totally change the meaning of sentences sometimes, like saying “affair” instead of “situation” or “ordeal.” It’s confusing! Get it right.. ",
        "upvotes": 1,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1n9t2nv/english_dubs_are_inaccurate_sometimes/"
    },
    {
        "id": "1n9wea0",
        "author": "RayDaMan7",
        "title": "Why is the captioning/subtitles on Netflix so off?",
        "content": "This is not the only instance, but in much of the content I watch the closed caption differs from the spoken audio.  Does anyone know why this is? Who does their closed captioning? ",
        "upvotes": 0,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zhdui1h0winf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1n9wea0/why_is_the_captioningsubtitles_on_netflix_so_off/"
    },
    {
        "id": "1n95gqg",
        "author": "LegitimateWeekend341",
        "title": "Love Con Revenge",
        "content": "Is anyone else watching this series and genuinely angry with the police’s inaction? Public safety costs millions of dollars in state taxes, yet these types of crimes are treated as civil matters instead of criminal offenses. ",
        "upvotes": 23,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1n95gqg/love_con_revenge/"
    },
    {
        "id": "1n9n5gs",
        "author": "bigdotcid",
        "title": "Different English subtitles for same show in different user accounts",
        "content": "I watched the first two episodes of Beyond The Bar, a K-Drama, in my user account and mentioned it to my wife. So we then watched the first episode together in her user account and the English subtitles shown in her account are slightly different from the ones I saw. I just went back to my account to confirm I wasn’t crazy and it’s true. Why would we get different translations and different word choices?  One small example is my translation said, “My apologies” while her version said, “I’m sorry” for the exact moments in the show. The overall content is basically the same but why are they different?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n9n5gs/different_english_subtitles_for_same_show_in/"
    },
    {
        "id": "1n8dqlm",
        "author": "BlackDoom_26",
        "title": "Shows that totally lost you halfway through",
        "content": "Have you ever started a Netflix show that was amazing at the start but then kind of fell apart later on? Curious which ones had you hooked and then left you feeling disappointed.",
        "upvotes": 785,
        "comments": 2473,
        "media": null,
        "permalink": "/r/netflix/comments/1n8dqlm/shows_that_totally_lost_you_halfway_through/"
    },
    {
        "id": "1n8ysba",
        "author": "unluckyducky0",
        "title": "Uplifting, Bingeworthy TV Shows for Sad Times?",
        "content": "Hi, I’ve been going through it a little lately and feeling sad like i’ve run out of my usual light, interesting and humorous binging tv series (reality), and need suggestions for other shows to put on that are interesting and make you feel good/comforting when you’re down?\n\nI usually turn on a show for background noise and only 1/2 pay attention to it but i do like it to be interesting and feel good when i am paying attention haha. Any recommendations for shows that are comforting and uplifting that can be binged?\n\nScripted shows I’ve watched in the past i liked enough to actually finish the whole series (this is a big deal for me if it’s not a reality show):\n\n- Schitt’s Creek** (Fav)\n- Dead to Me** (fav… until the sad end)\n- New Girl\n- The Office \n- Gilmore Girls \n- probably forgetting some but maybe these help give guidance? ",
        "upvotes": 36,
        "comments": 110,
        "media": null,
        "permalink": "/r/netflix/comments/1n8ysba/uplifting_bingeworthy_tv_shows_for_sad_times/"
    },
    {
        "id": "1n9o94c",
        "author": "xNickgazordx",
        "title": "Netflix not playing Glass Onion and only Glass Onion in Dolby Vision",
        "content": "I have a Google tv hooked up to my LG G4 OLED tv and I'm trying to watch Glass Onion in 4k Dolby Vision. It's just defaulting to SDR and the kicker is every thing else I've clicked on that has Dolby Vision works fine. Anyone run into this issue? Not sure why only one movie would be doing this. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n9o94c/netflix_not_playing_glass_onion_and_only_glass/"
    },
    {
        "id": "1n94j5i",
        "author": "Prestigious_Tie_4451",
        "title": "First time watching K-pop Demon hunters",
        "content": "I was expecting this movie to be crap, but I surprisingly enjoyed it. The music and animation was emotional, and the ending left me surprised. I was afraid that the plot was going to be childish and predictable so that is why it took me so long to finally watch it.",
        "upvotes": 10,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n94j5i/first_time_watching_kpop_demon_hunters/"
    },
    {
        "id": "1n9mj2p",
        "author": "GamerGirlLondyn",
        "title": "I have an Error Code D7702-1290",
        "content": "I was playing a show on Netflix when the graphics suddenly froze. I paused it and reloaded, but in never stopped loading. I restarted my laptop and it worked for a time, but it eventually starts having the same problems. Twice while it was loading, I got an Error screen. I didn't get the code the first time, but the second time, I got Code D7702-1290.\n\nI tried looking it up, but I never found a solution. Does anyone know who I can fix this without be restarting by laptop every time I what to watch Netflix, and ever 30 mins after that?\n\nI have an Alienware laptops, if that matters at all.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n9mj2p/i_have_an_error_code_d77021290/"
    },
    {
        "id": "1n9lkcu",
        "author": "57829",
        "title": "Catherine Zeta-Jones Unpacks Wednesday and Morticia’s Strained Relationship as She Looks Ahead to Season 3",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n9lkcu/catherine_zetajones_unpacks_wednesday_and/"
    },
    {
        "id": "1n9l36s",
        "author": "Silly-Mountain-6702",
        "title": "Favorite grown up animation? So far, it's \"Carol and the End of the World\" for me. \"Twilight of the Gods\" is great. \"Archer\" I can only do one show at a time he's so off-putting.",
        "content": "Loved the raunch of \"Big Mouth\" and \"Human Resources\" - nice and absurd. \"Common Side Effects\" just didn't have a lot going for it. I've seen and loved \"Venture Brothers\", as well as it's weird cousin \"Captain Fall\". \n\nAnything up this alley I have missed, or that you'd recommend? ",
        "upvotes": 1,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1n9l36s/favorite_grown_up_animation_so_far_its_carol_and/"
    },
    {
        "id": "1n8o5tu",
        "author": "Princessrage",
        "title": "\"Jinx\" from Arcane. Mixed media by my 13yo.",
        "content": "Hello, fellow Netflix fans! I'm a long time reddit lurker, and very rarely post, but my daughter requested that I share her creation with you fine folks. (She's the one who introduced me to Arcane.) Please be kind, I'm hoping to have some friendly feedback to show her tomorrow. TIA!❤️",
        "upvotes": 73,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1n8o5tu/jinx_from_arcane_mixed_media_by_my_13yo/"
    },
    {
        "id": "1n8lagq",
        "author": "huffpost",
        "title": "Best international or foreign-language shows on Netflix that deserve more attention?",
        "content": "What are some bingeworthy international or foreign-language shows you’ve found on Netflix that completely blow any American show out of the water? Are there any you love that are flying under? What do you love about the show?",
        "upvotes": 83,
        "comments": 192,
        "media": null,
        "permalink": "/r/netflix/comments/1n8lagq/best_international_or_foreignlanguage_shows_on/"
    },
    {
        "id": "1n9n4bt",
        "author": "based-sam",
        "title": "How much does Netflix pay families for their stories to use in documentaries?",
        "content": "When Netflix makes documentaries about the tragic things that happen to people (jonbenet, the licari girl, gabby petito), how much are these people being compensated for their story? It feels like Netflix could get away with paying them like $100k and making a lot more from their worst moments ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n9n4bt/how_much_does_netflix_pay_families_for_their/"
    },
    {
        "id": "1n9eamu",
        "author": "Wyldstallyn80",
        "title": "Ad free",
        "content": "So I was under the impression the impression that the ad free version of Netflix was just that. People pay more cos they cba with adverts. Got told by someone today that he can’t watch the new season of “it’s always Sunny” because he doesn’t have the ad free subscription. Is that a common thing? ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n9eamu/ad_free/"
    }
]