[
    {
        "id": "1gwj4n3",
        "author": "ThePianoLessonAMA",
        "title": "Hi, /r/movies! I am Malcolm Washington, director and co-writer of 'THE PIANO LESSON', starring Samuel L. Jackson, John David Washington &amp; Danielle Deadwyler. It will be released on Netflix tomorrow— Ask me anything!",
        "content": "",
        "upvotes": 198,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ggeqp7uu5a2e1.jpeg?auto=webp&amp;s=9268aa985f3b12b6467a944b05f5a56dd9daca98"
        },
        "permalink": "/r/movies/comments/1gwj4n3/hi_rmovies_i_am_malcolm_washington_director_and/"
    },
    {
        "id": "1h0uf7h",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Gladiator II / Wicked: Part I / Moana 2)",
        "content": "[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/?)\n\n[Wicked: Part I](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/?)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/?)",
        "upvotes": 58,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1h0uf7h/official_discussion_megathread_gladiator_ii/"
    },
    {
        "id": "1h3owte",
        "author": "indiewire",
        "title": "Cannes: 17 Unsimulated Sex Scenes in the Festival's History",
        "content": "",
        "upvotes": 6921,
        "comments": 798,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/klhSSzn9TFAttOFbgAdQifduNyaRMdsHu6zBIsqyXy4.jpg?auto=webp&amp;s=a68a320fc8faeb2986a0f53760b14a04c8901ebf"
        },
        "permalink": "/r/movies/comments/1h3owte/cannes_17_unsimulated_sex_scenes_in_the_festivals/"
    },
    {
        "id": "1h3vis7",
        "author": "newredditaccount_24",
        "title": "What \"true\" movie did the greatest injustice to its main character?",
        "content": "As in, most people who see the movie will come away with the completely wrong belief about that real person? Either the movie emphasized the wrong things, bungled facts, filled in a lot of blanks, or just straight up lied.\n\nI imagine ones about world leaders or hugely impactful figures will necessarily attract a ton of controversy, but there's definitely got to be ones where there's no question about how wrong the portrayal was.",
        "upvotes": 552,
        "comments": 550,
        "media": null,
        "permalink": "/r/movies/comments/1h3vis7/what_true_movie_did_the_greatest_injustice_to_its/"
    },
    {
        "id": "1h45pqs",
        "author": "Scoreback",
        "title": "What are your favorite uncommon Christmas movies?",
        "content": "Everyone watches Home Alone 1-2, Die Hard, Love Actually, The Holiday, Gremlins, Elf, The Grinch, Nightmare before Christmas, Christmas Vacation...., but what are some movies you started watching as a new tradition? For me its The Hateful Eight. The location together with the snow storm always puts me in a good Christmas mood.",
        "upvotes": 62,
        "comments": 318,
        "media": null,
        "permalink": "/r/movies/comments/1h45pqs/what_are_your_favorite_uncommon_christmas_movies/"
    },
    {
        "id": "1h3fv4e",
        "author": "LosIsosceles",
        "title": "\"Hundreds of Beavers\" review: This bizarre movie about beavers is a clarion call for human creativity in the age of AI",
        "content": "Reposting with movie title in the header. ",
        "upvotes": 4269,
        "comments": 255,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZSMVMENVMcY80gwE889Ogj75YPogDrbzeCVt8I5WJNA.jpg?auto=webp&amp;s=06ed4251d6c7d6ed2938f3b80e59b9ad9aa66146"
        },
        "permalink": "/r/movies/comments/1h3fv4e/hundreds_of_beavers_review_this_bizarre_movie/"
    },
    {
        "id": "1h45fx3",
        "author": "Beefyvalkyrie",
        "title": "You Favourite Movies of 2024 so far ",
        "content": "We've almost reached the end of 2024 and it's been a subtle \"fresh breeze of air \" kind of a year , with low quantity but high quality of movies coming out .\n\nWhat are your Top 5 favourite movies of this year so far ?\n\nMine are                       -\n\n1. Dune Part 2  - No doubt the greatest movie of the year and a perfect balance between  spectacle and detailed world building .\n\n\n2. The Wild Robot   - Dramwork's best in years and one of the most hard hitting movies of the decade.\n\n\n\n3. Kill     - An Indian movie which surpasses the level of modern Hollywood Action movies with ease imo . Non Stop insane ride of high octane realistic action sequences . ( Chad Stahelski is going to remake this movie in English )\n\n\n\n4. The Substance    - The craziest a movie can get .\n\n\n\n5. Smile 2      - A fresh engaging horror flick which lives up to the hype.\n",
        "upvotes": 58,
        "comments": 158,
        "media": null,
        "permalink": "/r/movies/comments/1h45fx3/you_favourite_movies_of_2024_so_far/"
    },
    {
        "id": "1h3wdub",
        "author": "starbycrit",
        "title": "Watching The Sound of Music all the way thru instead as an adult ",
        "content": "Not even halfway thru and I was sobbing. This movie is so beautiful. It is literally perfect. It ebbs and flows with happiness and the bittersweet human experience and optimism + building connection with children in such a wholesome way. Really soothing to my inner child. This is the kind of movie that can be played while sleeping or cooking or on a movie night when it’s like a slumber party or smth. This is just the best most wholesome and artistically lovely movie everrrrrrrr\n\nETA: I see now why Julie Andrews made it to like Superstar Status after this movie. This is like a cinematic gem. If we could leave movies behind from earth, like 10 movies from each category, this would be up there with Forrest Gump &amp; The Wizard Of Oz for wholesome, nostalgic artistic masterpieces fr",
        "upvotes": 301,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1h3wdub/watching_the_sound_of_music_all_the_way_thru/"
    },
    {
        "id": "1h42zyc",
        "author": "Strawb3rryflowers",
        "title": "Why hasn't Glenn Close won any Oscars? ",
        "content": "She's a phenomenal actress and among one of the greats. She was beyond convincing and disturbingly iconic in Fatal Attraction and the fact that she lost to Cher?? I love Cher so nothing against her, but come on now :/\n\nShe also lost (she was nominated for Dangerous Liasons) to Jodie Foster in The Accused, which i also don't get?? I saw The Accussed and thought it was a mediocre Tv-movie. To think it was more deserving than Glenn in Dangerous Liasons? Absolutely ridiculous. ",
        "upvotes": 67,
        "comments": 136,
        "media": null,
        "permalink": "/r/movies/comments/1h42zyc/why_hasnt_glenn_close_won_any_oscars/"
    },
    {
        "id": "1h468gb",
        "author": "MarvelsGrantMan136",
        "title": "Marshall Brickman, Oscar-Winning Screenwriter on ‘Annie Hall,’ Dies at 85",
        "content": "",
        "upvotes": 53,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8rJmh4dTGRbp4eGeLW-bhVMBF-4rJ9ylc_bPjDUpdBs.jpg?auto=webp&amp;s=504ffd34ccf44acac92671207a146163eeb87d95"
        },
        "permalink": "/r/movies/comments/1h468gb/marshall_brickman_oscarwinning_screenwriter_on/"
    },
    {
        "id": "1h3v4gk",
        "author": "Browns_Bucks78",
        "title": "What Silly/Stupid movie just gets you",
        "content": "For some reason The Eurovision Song Contest just gets me in the feels every time when she starts singing My Hometown.  The rest of the movie is fine but for some reason that part always gives me goosebumps and brings tears to me eyes and I can't explain it. There are many more obvious tear jeans jersey type movies out there so what silly/stupid movie just gets you for some reason?",
        "upvotes": 181,
        "comments": 368,
        "media": null,
        "permalink": "/r/movies/comments/1h3v4gk/what_sillystupid_movie_just_gets_you/"
    },
    {
        "id": "1h44px9",
        "author": "BunyipPouch",
        "title": "Niels Arestrup, known for his Cesar-winning performances in Jacques Audiard’s 'The Beat That My Heart Skipped' and 'A Prophet', has died at 75. His other credits include 'War Horse', 'At Eternity's Gate', and 'The Diving Bell and the Butterfly'.",
        "content": "",
        "upvotes": 21,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7NHK5ZjCtu5wpZ98k3hhozlpOruAHbwf7ZQD_o7z5r4.jpg?auto=webp&amp;s=85673277c4f60966f35aaed5d1b2800b896a8a66"
        },
        "permalink": "/r/movies/comments/1h44px9/niels_arestrup_known_for_his_cesarwinning/"
    },
    {
        "id": "1h3phtg",
        "author": "dvsinla",
        "title": "Saw Moonraker last night first time and in a theater. What a ridiculous fun movie. Anyone else a fan?",
        "content": "Saw it last night at  midnight screening in a really great palace theater in LA called the Vista owned by Tarantino so it was an original 35mm print. He only screens movies on film. A bit faded and a few cuts but I love that stuff. \n\nA few things I know of the Roger Moore bond movies is that they were a little sillier and they had the best songs... and I tend to like them a lot.  \n\n* Moonraker was the only one I never saw and wow it's so crazy like one silly crazy set piece after another with nothing much in between. \n* The jaws guy was hilarious. \n* Bond hits on women so fast in this one it's a little odd even for him.\n* Holly Goodhead... great name.\n* The space station stuff so great with the laser blasts totally going for a star wars thing. \n* The villain keeps trying to kill bond in the most ridiculous elaborate ways instead of just shooting him in the head. \n* Feels like Austin Powers got a ton of their gags from this movie.\n\nLoved it.  Though I suspect people who like a more serious bond are not fans? ",
        "upvotes": 311,
        "comments": 166,
        "media": null,
        "permalink": "/r/movies/comments/1h3phtg/saw_moonraker_last_night_first_time_and_in_a/"
    },
    {
        "id": "1h3nwpo",
        "author": "KillerCroc1234567",
        "title": "Jeff Nichols Reveals He Is Writing New Original Script Alongside Cormac McCarthy Adaptations",
        "content": "",
        "upvotes": 364,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rklGyTd6sjkMN1--kXzDd0rz3Cy_Z3zhi_E8UeBOTJE.jpg?auto=webp&amp;s=13c0282ba9739ec6ba459444ed9f3c87f7ef0ecb"
        },
        "permalink": "/r/movies/comments/1h3nwpo/jeff_nichols_reveals_he_is_writing_new_original/"
    },
    {
        "id": "1h3m2s4",
        "author": "BunyipPouch",
        "title": "First Poster for Comedy 'Heavier Trip' - Metal band Impaled Rektum breaks out of prison to perform at a major festival and save their guitarist's home, facing obstacles from police and a record exec.",
        "content": "",
        "upvotes": 434,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0ld4xtmdq34e1.jpeg?auto=webp&amp;s=62297253a741ce1351e0d77c6dbdabc0c1b33e1f"
        },
        "permalink": "/r/movies/comments/1h3m2s4/first_poster_for_comedy_heavier_trip_metal_band/"
    },
    {
        "id": "1h3j1gv",
        "author": "HeyAriAxyss",
        "title": "What did you think of Big Trouble in Little China (1986)?",
        "content": "I just finished watching Big Trouble in Little China for the first time! I hit 'Play' and went into it pretty much completely blind with no context - and what a ride LOL!\n\nWas a fun watch - had some good laughs and funny WTF moments. It had a fun amount of absurd and cheesy moments as well 😆 I really respect the amount of creativity that went into the writing and set design, and fun characters too!\n\nWhat were your thoughts on the movie when first seeing it? 🙂 Keen to hear, and thanks for reading!\n\nUpdate: WOAH, over 100+ comments in just over an hour! Love it and thanks again for sharing the enthusiasm guys lol! 😆😄👌\n\nUpdate: Wow, almost 250 comments! Let's go!! 😆 haha\n\nUpdate: Almost 400 comments in a day let's gooo!! 🤣 haha. Now this is the sort of positive response you'd hope for when making a film - one that people remember fondly and still really enjoy. Awesome 😄",
        "upvotes": 513,
        "comments": 390,
        "media": null,
        "permalink": "/r/movies/comments/1h3j1gv/what_did_you_think_of_big_trouble_in_little_china/"
    },
    {
        "id": "1h3dn4i",
        "author": "Rebel_bass",
        "title": "I had no idea that Kevin Smith and Scott Mosier produced Good Will Hunting ",
        "content": "Digging deep this weekend for good movies that I haven't seen for a while, saw their names pop up in the opening credits. No wonder Affleck and Damon are still showing up for Smith all these decades later. \n\nAny other Hollywood connections like this you guys can think of, where relations spanning so many years have shaped the face of cinema?",
        "upvotes": 790,
        "comments": 145,
        "media": null,
        "permalink": "/r/movies/comments/1h3dn4i/i_had_no_idea_that_kevin_smith_and_scott_mosier/"
    },
    {
        "id": "1h3f28t",
        "author": "Odd_Advance_6438",
        "title": "I loved the little things in the Substance that makes Dennis Quaid’s character extra gross.",
        "content": "Specifically the way he ate the shrimp and the fact that he never washes his hands.\n\nPretty great performance relative to how little screentime he has. He plays an incredibly sleazy, misogynistic, douchey tv show executive. However, I like the less crazy things about him that add to what a creep he is. The way he eats the shrimp was pretty gross, which is impressive in a movie that’s full of so many disgusting moments. I didn’t even notice the bathroom thing until someone pointed it out, but it really emphasizes how dirty he is both figuratively and literally",
        "upvotes": 568,
        "comments": 114,
        "media": null,
        "permalink": "/r/movies/comments/1h3f28t/i_loved_the_little_things_in_the_substance_that/"
    },
    {
        "id": "1h46m27",
        "author": "salaryboy",
        "title": "\"Slowly spiraling downward into destruction\" films",
        "content": "I love films where we watch people's lives fall apart at the seams as their inner flaws and bad choices gradually bear fruit. Done best when a small group of family members or friends dip their toes into crime and are unable to handle the consequences. Call it schadenfreude or just the pleasure of watching someone else's life go worse than mine.\n\nClassics of the genre:\n\nBefore the Devil Knows You're Dead - One of Philip Seymour Hawthorne's masterclasses with a stunning Marisa Tomei and desperate Ethan Hawke. Great soundtrack and vibes reminiscent of David Mamet films.\n\nA Simple Plan - The story flows flawlessly from beginning to end. Bill Paxton and Billy Bob Thornton are perfect casting. One of the few films I loved so much that I read the book (the first 80% is beat for beat the same as the film, but that last 20%, damn).\n\nThe Way of the Gun - Brilliant film by Christopher McQuarrie before he became tied at the hip with Tom Cruise. Benicio del Toro's best performance IMHO.\n\nHonorable mention - Bloodline (season 1 especially), Full Circle on Max has a lot of these vibes.\n\nWhat others?",
        "upvotes": 6,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1h46m27/slowly_spiraling_downward_into_destruction_films/"
    },
    {
        "id": "1h3nl0p",
        "author": "nbaisbest4",
        "title": "Found out Steve Buscemi tried to make Queer in the early 2000s, it's in the last question of the article. ",
        "content": "",
        "upvotes": 165,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/T7qvzeDuCgok1oHbqfhoWrui2xBjiX-BtsUBwnF02c4.jpg?auto=webp&amp;s=e55124fa6c6eaea423959850eed3b4782edb70df"
        },
        "permalink": "/r/movies/comments/1h3nl0p/found_out_steve_buscemi_tried_to_make_queer_in/"
    },
    {
        "id": "1h3l4ct",
        "author": "kanna172014",
        "title": "Movies during the 70s-80s weren't very optimistic for the future",
        "content": "You have all kinds of movies like Logan's Run, Soylent Green, Blade Runner, Escape from New York, The Running Man and Robocop, all set in dystopian hell-holes. New York City especially got it bad. It was so bad that movies back then thought it would eventually become little more than a prison city as shown in Escape From New York. I wonder what the writers and producers/directors would think if they got a glimpse of what cities like New York are like now?",
        "upvotes": 239,
        "comments": 214,
        "media": null,
        "permalink": "/r/movies/comments/1h3l4ct/movies_during_the_70s80s_werent_very_optimistic/"
    },
    {
        "id": "1h42fj5",
        "author": "drizzydrill27",
        "title": "Let's take a timetravel to 1989: All Dogs Go to Heaven",
        "content": "As most of you know, this movie has one of the saddest backstories ever. The main girl Anne-Marie was played by a 10 year old girl by the name of Judith Barsi, who prior to the film being released her and her mom were murdered by the father. \n\nIn the iconic scene \"You know goodbyes arent forever\" by Burt Reynolds (the dog), it was his actual goodbyes to the late actress, he requested a private date to do his lines with a select few amount of people, and he added the lines \"I'm Sorry I'm So Very Sorry\" as his final goodbye to Judith. \n\n\nThe movie overall was very well written imo. \n\nRest in Peace to Judith, and her mother Maria.",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1h42fj5/lets_take_a_timetravel_to_1989_all_dogs_go_to/"
    },
    {
        "id": "1h43drd",
        "author": "Ultimate-Rubbishness",
        "title": "Anybody interested in a hd-trailers/Apple trailers reloaded? ",
        "content": "I'm a bit of a high quality trailer nerd and was pretty sad that hd-trailers which extracted trailers from apple trailers isn't working anymore. So I coded a bit and found a way to make it happen again. \nI'm just thinking if i'm the only one who is interested in this or if more people would use a page like this. If enough people are interested I would probably take the time and build something nice. ",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1h43drd/anybody_interested_in_a_hdtrailersapple_trailers/"
    },
    {
        "id": "1h3bchy",
        "author": "aucunautrefeu",
        "title": "Which movie influenced you to make a decision in your life after watching it",
        "content": "Is there a movie you’ve seen that moved you so profoundly that it actually impacted your personal life and influenced you to make a change or decision? If so, what aspect about the film influenced it?\n\nFor me it was the being buried alive monologue in I Saw the TV Glow. I went back to the theaters three days in a row and sobbed in the theater each time. I have never felt more seen or exposed by a film in my life. After that; I started unmasking more around people in my life.\n\n",
        "upvotes": 816,
        "comments": 998,
        "media": null,
        "permalink": "/r/movies/comments/1h3bchy/which_movie_influenced_you_to_make_a_decision_in/"
    },
    {
        "id": "1h3mly2",
        "author": "dave_tk421",
        "title": "Remember when Michael Paré was the “it” actor?",
        "content": "\nEddie and The Cruisers - A television newswoman picks up the story of a 1960s rock band whose long-lost leader Eddie Wilson may still be alive, while searching for the missing tapes of the band's never-released album.\n\nStreets of Fire - A mercenary is hired to rescue his ex-girlfriend, a singer who has been kidnapped by a motorcycle gang.\n\nThe Philadelphia Experiment - A United States Navy destroyer escort participates in a Navy \"invisibility\" experiment that inadvertently sends two sailors forty years into the future.\n\nHe had a pretty good run for a flash of an eye",
        "upvotes": 133,
        "comments": 156,
        "media": null,
        "permalink": "/r/movies/comments/1h3mly2/remember_when_michael_paré_was_the_it_actor/"
    },
    {
        "id": "1h44ag3",
        "author": "IMustBust",
        "title": "Non-Giallo 70s/80s Italian Thrillers?",
        "content": "Are there any good Italian thrillers from that era (1970s-80s) that are actually filmed and set in Italy, i.e not pretending to be set in America with mixed English and overdubbed italian cast? I know there are some good Italian movies made in the last 2 or so decades but I'm particularly interested in that specific era. Is there anything close to say, Manhunter, but more, you know, Italian?\n\nIf you got some recommendations, please do not hesitate to post them here.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1h44ag3/nongiallo_70s80s_italian_thrillers/"
    },
    {
        "id": "1h3o7al",
        "author": "otter-otter",
        "title": "What was the first film to use the trope of criminals going to a vet when they get shot etc?",
        "content": "I get the reason behind the plot point, to not draw attention of authorities etc etc, but have always wondered what the first film a criminal went to a vet to get stitched up after being shot. \n\nI can think of films in 70’s/80’s/90’s/00’s that had the vet trip. Any earlier? Any one know the first? \n\nSide quest - do you think it’s based on any fact?",
        "upvotes": 92,
        "comments": 44,
        "media": null,
        "permalink": "/r/movies/comments/1h3o7al/what_was_the_first_film_to_use_the_trope_of/"
    },
    {
        "id": "1h3vlpu",
        "author": "Fairy-Styles1999",
        "title": "Do you think Jeff Goldblum’s character in Earth Girls are Easy fits the “born sexy yesterday” trope usually given to naive female characters?",
        "content": "I’m rewatching the movie tonight and Mac’s naivety is obvious and I was thinking about those characters who are often naive or a little bit dense but have a lot of sex appeal. Zeebo and Wiploc are the same but they seem a lot more aware than Mac, despite Mac being the more intellectually intelligent one.",
        "upvotes": 30,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1h3vlpu/do_you_think_jeff_goldblums_character_in_earth/"
    },
    {
        "id": "1h3jgz1",
        "author": "McNasty420",
        "title": "They just made Ghost World free on youtube",
        "content": "This movie is fantastic.  It stars Thora Birch, Scarlett Johansson and Steve Buscemi.  They play two girls who just graduated from high school and have no plans for the future.  They befrend Steve Buscemi's character.  I recommend giving it a watch, it's so great!\n\n[https://www.youtube.com/watch?v=pmW61ytcI18](https://www.youtube.com/watch?v=pmW61ytcI18)",
        "upvotes": 165,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/42F7Qe_zAH40Qd8bV3ErdXMbzIs6eg0dBoUiDC0TSVA.jpg?auto=webp&amp;s=e45898297eeb73d0eb9046556f16d996a34cd786"
        },
        "permalink": "/r/movies/comments/1h3jgz1/they_just_made_ghost_world_free_on_youtube/"
    },
    {
        "id": "1h3awx1",
        "author": "Strawb3rryflowers",
        "title": " Which role(s) do you think Leonardo Dicaprio should have gotten an Oscar for instead of The Revenant? ",
        "content": "I've never seen The Revenant (edit not saying he didn't deserve that win since i've obviously haven't seen it, i'm simply asking those of you who did see it) anyway, in my opinion Leo should have definitely gotten an Oscar for his roles in What's Eating Gilbert Grape and Django Unchained. I've recently watched Django Unchained again and he was really briliant in it.\n\nHe was obviously also great in The Departed, Catch Me If You Can, Revolutionary Road, etc but those are his stand-out performances in my personal opinion\n\nedit: not sure why some people want to argue with me and are downvoting this? I can still think he deserved Oscar wins for his other roles, especially because him not winning an Oscar for so long became a meme for the longest, his smirk when he finally won for The Revenant at the Oscars said everything. ",
        "upvotes": 558,
        "comments": 585,
        "media": null,
        "permalink": "/r/movies/comments/1h3awx1/which_roles_do_you_think_leonardo_dicaprio_should/"
    },
    {
        "id": "1h444nt",
        "author": "Hika__Zee",
        "title": "Unique Animated Films for Family",
        "content": "What are some unique and lesser known animated films for family and kids? Stuff similar to Studio Ghibli movies or the examples I've listed below. Looking for good stories, unique presentation, distinct visual style, etc. Characters should not have heavy attitudes or behavioral problems. Lesser known animated films.\n\nBad Examples: I did not like 'The Boy and The Beast' because it starts out with the kid full of anger expressing how much he hates everything and everyone. Not something I'd want my kid to watch. Poupelle of Chimney Town starts off with a terribly loud and annoying musical scene.\n\nGood Examples:\n\nAll of the family friendly Studio Ghibli films (Ponyo, Totoro, Secret World of Arietty, Howls Moving Castle, Spirited Away, Boy and the Heron, Castle in the Sky, Nausicaa, etc.).\n\nLong Way North\n\nApril and the Extraordinary World\n\nSirocco and the Kingdom of Winds\n\nKensuke's Kingdom\n\nBig Fish and Begonia\n\nWolfwalkers\n\nThe Secret of Kells\n\nSong of the Sea\n\nMy Father's Dragon\n\nThe Magician's Elephant\n\nEleanor's Secret\n\nSea Beast\n\n\nThese classic animated films:\n\nTreasure Planet\n\nAtlantis\n\nRoad to El Dorado\n\nTitan A.E.\n\nThe Iron Giant\n\nPrince of Egypt\n\nFilms like Encanto, Moana, Rayaa, etc. are all very good but are not exactly underrated films.\n\n\nAny recommendations similar to those above?\n",
        "upvotes": 4,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1h444nt/unique_animated_films_for_family/"
    },
    {
        "id": "1h330ci",
        "author": "Bennett1984",
        "title": "Robert Downey Jr., Mickey Rourke, Demi Moore and the Great Hollywood Comeback Performances",
        "content": "",
        "upvotes": 2534,
        "comments": 203,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oOIjNJkceH1NAhXSkox7ROcsoFkUubMOXaglACGcva8.jpg?auto=webp&amp;s=4f955233d1c910bffa01f48ead81e8f8843f6281"
        },
        "permalink": "/r/movies/comments/1h330ci/robert_downey_jr_mickey_rourke_demi_moore_and_the/"
    }
]