[
    {
        "id": "1hdfh0w",
        "author": "MudbrickAMA",
        "title": "Hi r/movies! We are Nikola Petrovic &amp; Andrew Howard (TENET, LIMITLESS), a writer/director &amp; star of MUDBRICK, the new XYZ FILMS and MIR MEDIA movie available On Demand today! Ask Us Anything!",
        "content": "",
        "upvotes": 34,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/adywqdclzm6e1.png?auto=webp&amp;s=02d6da371feeb782b4b8f7b40cc9125c07d0fcd3"
        },
        "permalink": "/r/movies/comments/1hdfh0w/hi_rmovies_we_are_nikola_petrovic_andrew_howard/"
    },
    {
        "id": "1hd2xa8",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Kraven the Hunter / The Lord of the Rings: The War of Rohirrim / Queer / Flow / Maria / The Piano Lesson)",
        "content": "# New Theatrical Releases\n\n[Kraven the Hunter](https://old.reddit.com/r/movies/comments/1hd2v8v/official_discussion_kraven_the_hunter_spoilers/?)\n\n[The Lord of the Rings: The War of Rohirrim](https://old.reddit.com/r/movies/comments/1hd2vab/official_discussion_the_lord_of_the_rings_the_war/?)\n\n[Queer](https://old.reddit.com/r/movies/comments/1hd2vby/official_discussion_queer_spoilers/?)\n\n[Flow](https://old.reddit.com/r/movies/comments/1hd2vdk/official_discussion_flow_spoilers/?)\n\n# Streaming Releases\n\n[Maria](https://old.reddit.com/r/movies/comments/1hd2vew/official_discussion_maria_spoilers/?)\n\n[The Piano Lesson](https://old.reddit.com/r/movies/comments/1hd2vg7/official_discussion_the_piano_lesson_spoilers/?)\n\n[Carry-On](https://old.reddit.com/r/movies/comments/1hdths9/official_discussion_carryon_spoilers/?)\n\n# Still in Theaters\n\n[Y2K](https://old.reddit.com/r/movies/comments/1h7rhq7/official_discussion_y2k_spoilers/?)\n\n[Werewolves](https://old.reddit.com/r/movies/comments/1h7rhry/official_discussion_werewolves_spoilers/?)\n\n[The Return](https://old.reddit.com/r/movies/comments/1h7rht7/official_discussion_the_return_spoilers/?)\n\n[Wicked: Part 1](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)\n\n[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/)",
        "upvotes": 38,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hd2xa8/official_discussion_megathread_kraven_the_hunter/"
    },
    {
        "id": "1hew03m",
        "author": "BunyipPouch",
        "title": "First Image from Sci-Fi Thriller 'Didn't Die' - A podcast host desperately clings to an ever-shrinking audience in the zombie apocalypse.",
        "content": "",
        "upvotes": 3153,
        "comments": 152,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xkw9udhdf17e1.jpeg?auto=webp&amp;s=7f88f0bc22a30cff70bd7fdd6aa0a0c2a8ccafbc"
        },
        "permalink": "/r/movies/comments/1hew03m/first_image_from_scifi_thriller_didnt_die_a/"
    },
    {
        "id": "1henqg6",
        "author": "ICumCoffee",
        "title": "‘Peaky Blinders’ Movie Wraps Filming - Starring Cillian Murphy, Rebecca Ferguson, Barry Keoghan, Tim Roth, and Stephen Graham",
        "content": "",
        "upvotes": 3517,
        "comments": 137,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lzSCB872GjTfi7SDeeKyvvxFUZfMfrbX9e5nvghs3ys.jpg?auto=webp&amp;s=20349e3bec6835d072be6264fea34ab3e8d1ec34"
        },
        "permalink": "/r/movies/comments/1henqg6/peaky_blinders_movie_wraps_filming_starring/"
    },
    {
        "id": "1hewv0u",
        "author": "YohannT",
        "title": "Weirdest end credit songs in movies",
        "content": "",
        "upvotes": 578,
        "comments": 428,
        "media": null,
        "permalink": "/r/movies/comments/1hewv0u/weirdest_end_credit_songs_in_movies/"
    },
    {
        "id": "1hf40nv",
        "author": "seveer37",
        "title": "Soylent Green is still one of the most terrifying dystopia’s I’ve ever seen! ",
        "content": "It’s definitely dated in a few spots but gosh I don’t think any other future film has felt so disturbing to me. Particularly because the human population is still very much alive but now extremely overpopulated. Planet of the Apes, I Am Legend, or most post apocalypse films have very few humans left. Granted I know the population will never get this bad but it felt more real to me. \n\nAnd the final twist which I’m sure everyone knows by now, most humans are processed to be converted into food for the rest also feels real. I’ve recently learned much of the food we eat is grown in sewage! A shocking truth but hey what else can we do? We need food! And the rich practically get away with everything! Again who do we know recently this has happened with? \n\nGosh the film has really left me shaken still all these years.",
        "upvotes": 206,
        "comments": 96,
        "media": null,
        "permalink": "/r/movies/comments/1hf40nv/soylent_green_is_still_one_of_the_most_terrifying/"
    },
    {
        "id": "1hf3trx",
        "author": "Mees51",
        "title": "What are the best ‘slice of life’ movies? ",
        "content": "I love movies that depict every day life, but with a bit of absurdity thrown in. The plot doesn’t revolve around saving the world or a big bank heist that’s happening, just small stuff that people experience. \n\nSome examples are Napoleon Dynamite, Once Upon a Time in Hollywood and Kikujiro. \n\nWould really appreciatie some suggestions! ",
        "upvotes": 201,
        "comments": 411,
        "media": null,
        "permalink": "/r/movies/comments/1hf3trx/what_are_the_best_slice_of_life_movies/"
    },
    {
        "id": "1hf6viz",
        "author": "BunyipPouch",
        "title": "First Poster for Action-Comedy 'The Gardener' - Starring Jean-Claude Van Damme - Serge holds a state secret. He, his family and gardener Leo appear on a government death list. They attempt to devise a plan to stay alive.",
        "content": "",
        "upvotes": 71,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2rfzezf7w37e1.jpeg?auto=webp&amp;s=6089c99c8883524ac4409264c91838e006067d9a"
        },
        "permalink": "/r/movies/comments/1hf6viz/first_poster_for_actioncomedy_the_gardener/"
    },
    {
        "id": "1hetrq0",
        "author": "Mst3Kgf",
        "title": "I have a soft spot for \"Die Hard 2\" even though I admit it's basically the least of the original three \"Die Hard\" entries.",
        "content": "There's no way, of course, that \"2\" could hope to escape the shadow of the legendary original, but it's also overshadowed by \"Vengeance\" given that features such things as Bruce Willis and Sam Jackson's interplay and Jeremy Irons's terrific villain turn. It plays often like a rehash of the original (even making fun of it, like when Willis asks how it can happen to him twice). The villains are fine, but not anywhere near as memorable as Alan Rickman or Irons. And so on.\n\nBut I still really like it as a fun action flick and a worthy successor even if it doesn't quite compare to its predecessor and successor. The setting is great as an airport at Christmas is a fabulous setting for maximum carnage and chaos. Willis still has John McClane in this one as a beleaguered everyman thrown into a situation he didn't expect or want (guy just wants to pick up his wife and get back for Christmas with the in-laws) and we see him at arguably his most vulnerable at certain points. And it keeps the tradition of the first one by having even minor characters be memorable (like the cute Avis clerk who both aids and flirts with John or Holly's Taser-wielding seatmate). I frankly like watching both this and the original at Christmas as a pair for some good holiday-themed action.\n\nI'd also add another aspect that stands out; this is the darkest and most brutal entry in the franchise. Not only does it have arguably the most graphic deaths of the series (see John stabbing the mook Baker through the eye with an icicle or Major Grant getting kicked into the plane turbine), but the villains are genuine terrorists in this one, not just using it for cover. Bill Sadler plays Lt. Col. Stuart as a cold-blooded sociopath with none of Hans or Simon's charisma or likable traits, which makes him arguably the scariest \"Die Hard\" villain (easily the most hatable; Sadler apparently considers it a compliment when people tell him how much they hate the character, because that's what he intended). And worst of all, THEY CRASH A PLANE. A plane with over 200 people on it, including children. And no one makes it out alive. You have to respect an action film with the guts to do that to show just how serious the threat is.",
        "upvotes": 288,
        "comments": 250,
        "media": null,
        "permalink": "/r/movies/comments/1hetrq0/i_have_a_soft_spot_for_die_hard_2_even_though_i/"
    },
    {
        "id": "1heunkv",
        "author": "Odd_Advance_6438",
        "title": "Hugh Jackman is phenomenal in Les Miserables",
        "content": "I always loved Hugh Jackman as an actor since I was young, but really only just from playing Wolverine for a while. Now that I’ve seen a lot of his other roles, I’ve realized just how versatile and talented he really is.\n\nI haven’t seen the musical, but I really enjoyed the film version of Les Mis, and it has a pretty incredible performance from Jackman. All the performances were great (I even enjoyed Russell Crowe as Javert) but he really stands out as Jean Valjean, particularly in the scene early on where he decides to turn his life around after being touched by the man’s kindness",
        "upvotes": 237,
        "comments": 125,
        "media": null,
        "permalink": "/r/movies/comments/1heunkv/hugh_jackman_is_phenomenal_in_les_miserables/"
    },
    {
        "id": "1hf5t3k",
        "author": "Lower_Love",
        "title": "What's the saddest/most unfair thing to happen to a character that didn't deserve it?",
        "content": "It doesn't necessarily have to be a massive Earth-shattering tragedy, but what's something that happened to a film character that made you go \"Man, that's not fair\"\n\nI'd say in The Big Lebowski &gt;!Donny was a complete innocent and he needlessly died from fright!&lt;\n\nJaws &gt;!Quint was getting deranged there by the end, but seeing him being eaten by the shark (his greatest fear) is still disturbing and very sad!&lt;\n\nHow about you?",
        "upvotes": 52,
        "comments": 217,
        "media": null,
        "permalink": "/r/movies/comments/1hf5t3k/whats_the_saddestmost_unfair_thing_to_happen_to_a/"
    },
    {
        "id": "1hesdiv",
        "author": "Physical_Plastic138",
        "title": "What are the more incredible “must-see” films you’ve ever watched, that you never want to watch again? ",
        "content": "Some films just evoke that paradoxical sense of, “what a masterpiece… And I never want to see any of it ever again.”\n\nSaving private ryan is firmly atop this list for me. No country for old men and the green mile spring to mind too. I loved all three of them, especially NCFOM… And yet. \n\nWhat’s on your list - and why? These much loved but “un-rewatchable” films are in their own very interesting category, especially when a large audience feels the same way about it. ",
        "upvotes": 262,
        "comments": 782,
        "media": null,
        "permalink": "/r/movies/comments/1hesdiv/what_are_the_more_incredible_mustsee_films_youve/"
    },
    {
        "id": "1hf21l2",
        "author": "mrjohnnymac18",
        "title": "Karolyn Grimes looks back on her role as Zuzu in It's a Wonderful Life",
        "content": "",
        "upvotes": 52,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3cn0L9YmF6Zd7PnwrtJE1MG4GR8vzwiSrZmPN66TVbY.jpg?auto=webp&amp;s=079fd58b0e276a5903adbfc027017bb7fcbe5b3a"
        },
        "permalink": "/r/movies/comments/1hf21l2/karolyn_grimes_looks_back_on_her_role_as_zuzu_in/"
    },
    {
        "id": "1hey2ql",
        "author": "harrychapp",
        "title": "The ultimate Oscars Checklist",
        "content": "I've made a website called OscarsChecklist.com. It's similar to IMDB or Letterboxd, where you can mark which films you've watched, but this one is specifically for ALL the Oscar nominated movies since 1929.\n\nAll of the 10,000+ nominations are here, and you can browse by category, year, film, person and more! You can see your friends' progress, and you'll be able to predict winners, which then allows a live scoreboard to gamify the ceremony!\n\nIt's all free, there's no ads, l've just made it because I knew if I wanted it to exist, other people in the world probably do too.",
        "upvotes": 81,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dBuQ9gRq7c5NbQoOu3JdwrARnTzadGGA_TTDdhmP7rM.jpg?auto=webp&amp;s=101e461b3e4f2e6bf1fe7eb398129828411e2475"
        },
        "permalink": "/r/movies/comments/1hey2ql/the_ultimate_oscars_checklist/"
    },
    {
        "id": "1hf1757",
        "author": "BeginningwithN",
        "title": "Nice alien movies",
        "content": "Hoping I can get some recommendations for movies with aliens where they aren’t intent on human annihilation. Somewhere in the middle of Arrival, E.T., Paul, and the book (soon to be movie!) Project Hail Mary. Something where humans work together with them, even if it is against another alien species. (I’m of course aware Star Trek exists)",
        "upvotes": 45,
        "comments": 160,
        "media": null,
        "permalink": "/r/movies/comments/1hf1757/nice_alien_movies/"
    },
    {
        "id": "1heijcx",
        "author": "broncosmang",
        "title": "Finally got around to watching Trap and couldn’t help but feel like it was supposed to be… spoilers ahead",
        "content": "I feel like this was originally supposed to be a part of his super hero, super villain universe. There's all these little clues in there that have no real pay off. Like him snatching the box of swag like it's nothing, the whole weirdly inserted psycho-analyst that seemed way too important (like it was supposed to be the chick who ran that weird organization from Glass), tanking like 3 stun guns, and him escaping at the end. \n\nAnyway, movie was whatever, but honestly just felt like it was originally something different - and not just a $20 million dollar investment in his daughter's career.",
        "upvotes": 1087,
        "comments": 213,
        "media": null,
        "permalink": "/r/movies/comments/1heijcx/finally_got_around_to_watching_trap_and_couldnt/"
    },
    {
        "id": "1hf1iao",
        "author": "SundayRabbit",
        "title": "Looking for Medieval, and Knightfiction movies like A Knight's Tale, or Ladyhawke",
        "content": "Knights are my favorite thing like ever. I love medieval romantic literature, and tales of knights and fairies and ti my knowledge, there is a severe LACK of those movies. I try every now and again to find movies that fit the right tone as Ladyhawke or A Knight's Tale but it's almost impossible. Either the movie is trying to be historical (which I have less than 0 interest in), or is straight up bad (like that one King Arthur Movie a while ago with the dude from Sons of Anarchy) So really wanna learn if there would be more!!!\n\nThanks a bunch if you have any suggestions.\n\nEdit: Y'all have been so great with all of these suggestions, thanks SO much. I'm happy to know there are so many others passionate about this niche like me. Keep it up!! Let's make this post the definitive post to go to when you need to know what kinda Knight Movies anyone would wanna watch.",
        "upvotes": 26,
        "comments": 74,
        "media": null,
        "permalink": "/r/movies/comments/1hf1iao/looking_for_medieval_and_knightfiction_movies/"
    },
    {
        "id": "1hegku9",
        "author": "Dingus_Squatford",
        "title": "Ninth Gate (Johnny Depp, dir. Roman Polanski, 1999)",
        "content": "Does anyone else have a soft spot for this movie?  Something about it just does it for me.  Pre weird-era Johnny Depp as a rare books dealer; part Indiana Jones adventure, part National Treasure, but with satanic manuscripts instead of doodads and geegaws.  Not really horror, but still spooky and unsettling at times.  Impeccable vibes,\nnot really sure how to describe other than mellow and dusty?  Still plenty entertaining and engaging though- this is one of my go-to rewatches and always hits the spot.\n\n “Why the devil?”\n\n“I saw him one day. I was fifteen years old, and I saw him as plain as I see you now. It was love at first sight.”",
        "upvotes": 961,
        "comments": 394,
        "media": null,
        "permalink": "/r/movies/comments/1hegku9/ninth_gate_johnny_depp_dir_roman_polanski_1999/"
    },
    {
        "id": "1he8w3a",
        "author": "meatloafpoptarts",
        "title": "When does an actor officially know they’re in a bad movie? ",
        "content": "I wonder at what point does an actor begin to understand the movie they’re in is not gonna be good? Is it the choice of director, producer, or the script? Or is it something else? With the recent movie Kraven the Hunter I was curious if Aaron Taylor-Johnson had seen the previous installments of their “universe” and if he had, how could he have possibly come to the conclusion this movie was gonna turn out any different? I’m just curious as to why most actors even bother associating themselves with something that is pretty much dead on arrival.",
        "upvotes": 2505,
        "comments": 1170,
        "media": null,
        "permalink": "/r/movies/comments/1he8w3a/when_does_an_actor_officially_know_theyre_in_a/"
    },
    {
        "id": "1hex6fe",
        "author": "4t1tguy",
        "title": "The Lies (and Deaths) of Christopher Nolan",
        "content": "I’ve noticed a major plot point in many of Nolan’s movies often revolve around lies and false realities being deployed either selfishly or selflessly. \n\nMemento is about a serial killer taking advantage of his faded memory and creating a completely false narrative in order to avoid confronting his role in the death of his wife. \n\nIn The Prestige, there is a constant game of lies played between Angier, Borden, Olivia, and Sarah all in the name of one-upmanship and dedication. A film not only about illusions themselves but also the balance of art and relationships, and the obfuscation of the true ugly nature of how these illusions operate and the massive physical and mental toll they take on the performer, such as Angier’s constant suicidal water tank trick, recreating for himself over and over again the same experience that led to the death of his wife.\n\nAt the end of The Dark Knight , Gordon and Batman decide to lie to the public about Harvey Dent’s final moments and intentions in order to avoid a scenario where all optimism had disappeared from Gotham. This is mirrored by Alfred choosing to set Rachel’s letter on fire, hoping to avoid an even deeper heart break within Bruce who’s already grieving from her death.\n\nA large plot point in Inception revolves around Cobb making Mal come to terms with the false world they live in, ultimately making her naturally untrustworthy of her surroundings even upon coming back to reality, leading to her (wait for it) death.\n\nInterstellar is in large part about the lies you tell others in order to make them feel safe, such as Coop (dead wife) not being forward with the extent of his mission to his children, Coop not being forward with the extent of his role and fate in the mission over Gargantua to Brand (Hathaway), and Professor Brand (Caine) not being forward with the probability of Plan A ever working. By contrast, the supposedly brave and virtuous Dr. Mann lies about the prospects of his planet in order to save himself at the expense of humanity.\n\nNolan’s often known for having a fascination with time manipulation and fractured narratives and he also gets a lot of flack for overly theatrical and complicated screenplays but I find his fascination with people’s perceptions and how they either accept fake narratives or create them for others to be what really makes me appreciate him as a writer. Just an unabashed interest in the psychological that I find to be endlessly entertaining.\n\nThere was another common plot point that comes up a lot in Nolan’s movies but I can’t remember it now. ",
        "upvotes": 36,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1hex6fe/the_lies_and_deaths_of_christopher_nolan/"
    },
    {
        "id": "1he1wj8",
        "author": "MarvelsGrantMan136",
        "title": "‘Dune’ at 40: David Lynch’s Odball Adaptation Remains a Fascination",
        "content": "",
        "upvotes": 5823,
        "comments": 824,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cbHk3KKC1vwNExpO08iqlsv3WCyfNhuRgAStqvrI9MQ.jpg?auto=webp&amp;s=241557c922e336f40e12b5cf3d689b098d1bbc1c"
        },
        "permalink": "/r/movies/comments/1he1wj8/dune_at_40_david_lynchs_odball_adaptation_remains/"
    },
    {
        "id": "1hf543l",
        "author": "PhotographWorldly349",
        "title": "Memoir of a Snail is the best animated movie this year",
        "content": "I loved how well-made it was; every scene had lots of personality and emotion. Go watch it if you haven't—it's seriously amazing. The ending made me cry. It's a very brutal and sad movie, and I recommend going in blind without seeing any of the trailers (it's a much better experience, in my opinion). The voice actors also did a great job.",
        "upvotes": 10,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1hf543l/memoir_of_a_snail_is_the_best_animated_movie_this/"
    },
    {
        "id": "1hekcqs",
        "author": "majung33",
        "title": "I finally had the courage to go to the cinema on my own and I'm so glad I did",
        "content": "Hey all, I love going to watch movies in the theatre as I truly believe it can make a huge difference for many films compared with watching at home. Unfortunately I don't always have friends or family that want to join but I've always felt too socially uncomfortable to go by myself as I feel people will judge me.\n\nI just recently decided I should give it a try and man am I happy I did. Some movies are great to watch with friends, but sometimes it's awesome to be able to fully focus and engage with a film without being distracted by others, especially at the theatre. Most recently I went to catch the re-release of Interstellar in 70mm on my own and it was genuinely one of the best movie theatre experiences I've ever had. \n\nLong story short, if you've ever held back on going to a see a film alone, do yourself a favor and go to the movies on your own you won't regret it. Nobody is judging you!",
        "upvotes": 312,
        "comments": 125,
        "media": null,
        "permalink": "/r/movies/comments/1hekcqs/i_finally_had_the_courage_to_go_to_the_cinema_on/"
    },
    {
        "id": "1he58zc",
        "author": "PinkThaiShorts",
        "title": "Debra Paget's snake dance in the 1959 movie The Indian Tomb",
        "content": "",
        "upvotes": 2663,
        "comments": 396,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zWgm1JdS8pWTHgH21ZUdnwfveua3zMaORu94N3xpt8k.jpg?auto=webp&amp;s=ce68d36762cffcbe2c40d18bf5d12b551fd759ec"
        },
        "permalink": "/r/movies/comments/1he58zc/debra_pagets_snake_dance_in_the_1959_movie_the/"
    },
    {
        "id": "1hf3c83",
        "author": "MatiasMJK",
        "title": "A.I. See Dead People",
        "content": "",
        "upvotes": 10,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XSJXHQTK2E3lg31n3InKM7afMf5KosE1pjg9t4gpUVs.jpg?auto=webp&amp;s=fac07e40f496bb52a21549d798fac24bb3c42b7d"
        },
        "permalink": "/r/movies/comments/1hf3c83/ai_see_dead_people/"
    },
    {
        "id": "1hekhen",
        "author": "ajurban24",
        "title": "I realize now why I love “About Time” so much",
        "content": "First and foremost I know this is a much discussed movie. When I first saw the promo pic for it, it looked like any other rom com. Plus Rachel macadams had done The Vow and Time travelers wife before it. So I initially judged it harshly.\n\nI fell in love with this movie around 2018 when I finally got around to it and it’s become one of my top movies to watch.\n\nI’ve realized why I love it so much and find it so comforting. The father and son relationship reminds me so much of my husband and his dad. They have a wonderful relationship of friendship, respect, playfulness and love. Whenever my husband is out of town and I’m missing him, I watch this movie and I’ve only just realized it’s because it reminds me of him in a way. \n\nWe have 2 daughters and while he won’t have the son and father relationship, I know he will have the same silly and playful relationship with them rooted in love.\n\n\nSorry that was a lot! lol \n\n\nWhat movie reminds you of family?",
        "upvotes": 195,
        "comments": 44,
        "media": null,
        "permalink": "/r/movies/comments/1hekhen/i_realize_now_why_i_love_about_time_so_much/"
    },
    {
        "id": "1he84we",
        "author": "beasterne7",
        "title": "That’s Not Entirely Accurate - Independence Day (1996) - a thorough examination of one of the least likable characters in the history of cinema: Secretary of Defense Albert Nimziki, played by true genius and legend James Rebhorn.",
        "content": "",
        "upvotes": 916,
        "comments": 117,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/l-mV634Fe5aQZfGCYe6NdPE3rfbSqggnEbadPXHx19A.jpg?auto=webp&amp;s=c628b67dea9b65591ae8af599c8e35d6bfcd3297"
        },
        "permalink": "/r/movies/comments/1he84we/thats_not_entirely_accurate_independence_day_1996/"
    },
    {
        "id": "1hf6coa",
        "author": "DaRealHighMay",
        "title": "Michel Gondry short on Directors Label Bonus Disc",
        "content": "Back in the early 2000s, Palm Pictures released dvd compilations of a few directors' music video and commercial work called Directors Label. The first 3 were Spike Jonze, Chris Cunningham, and Michel Gondry. \n\nAfter its initial release, they were packed together with a bonus disc featuring a few bonus videos. All of the videos are available online except one of Gondry's: Ossamuch!.\n\nI was wondering if anyone knew of somewhere online I could find this video, I've looked for what seems like years and had had no luck. Any help searching is appreciated!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1hf6coa/michel_gondry_short_on_directors_label_bonus_disc/"
    },
    {
        "id": "1hewlkj",
        "author": "batikfins",
        "title": "A Christmas Prince (2017)",
        "content": "I just watched this Netflix Christmas movie for the first time and it's left me with some questions. \n\nOne, the tiny nation of Aldovia has so many orphaned children they can fill an enormous and stately orphanage. What happened a generation ago to kill all these children's parents? The statue of the late king shows him in military uniform - was he a war hero? When was the war in Aldovia?\n\nThe second bit of world building was in the climax of the movie where &gt;!the King's secret note in the acorn Christmas ornament changed the law to allow non-blood relations to still be in the royal line of succession!&lt;. Aldovia has a Prime Minister, which suggests it is a constitutional monarchy, but this plot makes it seem like the king is the head of both the executive AND legislative branches of government. The head of this nation had extraordinary, unchecked power - perhaps the result of the hinted-at civil war?\n\nThe last question is about the posh accents of the entire royal family. All of the official royal decrees and ceremonies are held in English. There's no sign of a native Aldovian language. Is Aldovia a colony of the British Empire? What happened to the Native Aldovians and their language? Could this perhaps be the seed of the conflict that led to the former king becoming a war hero, and the leagues of orphans in the care of the state?\n\nI am yet to watch the second and third movies, hopefully they expand on the world building in A Christmas Prince, if not I'd love to hear peoples thoughts about the history of the Aldovan nation state.",
        "upvotes": 11,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1hewlkj/a_christmas_prince_2017/"
    },
    {
        "id": "1hf7vlh",
        "author": "joesen_one",
        "title": "THR Animation Roundtable: Chris Sanders (The Wild Robot), Dana Ledoux Miller (Moana 2), Josh Cooley (Transformers One), Kelsey Mann (Inside Out 2), Morgan Neville (Piece by Piece) and Nick Park (Wallace &amp; Gromit: Vengeance Most Fowl)",
        "content": "",
        "upvotes": 4,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mUazJFrFdHeAwF908Vxb8hZfVjjkesSy2gelEDhHbF8.jpg?auto=webp&amp;s=cebbabb7dce42170f6c510227ba34c10ecaf9f35"
        },
        "permalink": "/r/movies/comments/1hf7vlh/thr_animation_roundtable_chris_sanders_the_wild/"
    },
    {
        "id": "1hf45fa",
        "author": "cleopatraandcaesar63",
        "title": "Swiss Family Robinson (1960) - A great adventure and is similar to the series Lost in Space with Guy Williams and Robinson Crusoe.",
        "content": "Swiss Family Robinson is a 1960 adventure film starring John Mills, Dorothy McGuire, James MacArthur, Janet Munro, Tommy Kirk, and Kevin Corcoran in a tale of a shipwrecked family building an island home. It was the second feature film based on the 1812 novel The Swiss Family Robinson by Johann David Wyss.\n\nThe film is not a classic, it is a more naive and fun adventure. It's as if Robinson Crusoe got lost with his family on an island.\n\nThe book The Swiss Family Robinson (Der Schweizerische Robinson) is a novel by the Swiss author Johann David Wyss which was inspired by the book Robinson Crusoe by Daniel Defoe and inspired the series Lost in Space with Guy Williams\n\nThe basic story is a husband and wife want to get away from the rat race and are traveling by ship from their home in Switzerland to New Guinea to start a new life. But before they arrive they are caught in a bad storm and are shipwrecked on a deserted tropical island. The captain and crew must have seen it coming and deserted early, leaving the family, with three sons, to fend for themselves.\n\nThey do the best they can to salvage useful items and supplies from the wrecked ship and set about building their new home. It ends up being a quite elaborate 3-cottage cluster in a very large tree with nicely spread limbs.\n\nThe family finds a number of animals, a Tiger, a small elephant, and several others that lead them to think it might be a land bridge, so they build a small boat and set sail to try to go around the island. Another shipwreck and an encounter with a band of pirates results in their rescuing a teenage girl as her grandpa is captured.\n\nIn the end the pirates return, the Family Robinson work hard with improvised defenses to hold off the pirates and, when it seems the pirates will prevail a ship arrives and starts shooting at the pirates and their ship to save the day.\n\nWhen it was all over the parents decided they wanted to stay in this \"New Switzerland\" with the prospects of additional settlers.",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1hf45fa/swiss_family_robinson_1960_a_great_adventure_and/"
    },
    {
        "id": "1hea6bu",
        "author": "Puzzled-Tap8042",
        "title": "Luca Guadagnino Says ‘After the Hunt’ Won’t Tackle ‘Sexuality or Love’ as His Other Films Have",
        "content": "",
        "upvotes": 405,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DzTuCBNM6zUUWgrfHFib7X1Ynnuy0YUwqKtxk8F9bao.jpg?auto=webp&amp;s=f33a759501353fa08750da7464312ee9b0d25730"
        },
        "permalink": "/r/movies/comments/1hea6bu/luca_guadagnino_says_after_the_hunt_wont_tackle/"
    }
]