[
    {
        "id": "1lzl8ai",
        "author": "OxyMoronsAMA",
        "title": "Hey r/movies! I'm Sarah Cayce, the director of the new, raunchy, unapologetic, crime-action-comedy Oxy Morons. I'm joined by cast member Jeremy Holm. We're excited to be here to discuss the film and answer your questions. Ask us anything!",
        "content": "Hey [r/movies](https://www.reddit.com/r/movies/)! I'm Sarah Cayce, the director of the new, raunchy, unapologetic, crime-action-comedy Oxy Morons. I'm joined by cast member Jeremy Holm. We're excited to be here to discuss the film and answer your questions. Ask us anything!\n\nHere's our trailer:\n\n[https://www.youtube.com/watch?v=WPOdTwvSlUE&amp;pp=0gcJCfwAo7VqN5tD](https://www.youtube.com/watch?v=WPOdTwvSlUE&amp;pp=0gcJCfwAo7VqN5tD)\n\nSynopsis:\n\nA nobody and a crew of underachievers hatch a half-baked plan to strike it rich by out hustling a large pharmaceutical company at their own game.\n\nIt's now out on digital.\n\nCo-star Jeremy Sumpter is also doing an AMA today here:\n\n[https://www.reddit.com/r/movies/comments/1lyzknn/hey\\_rmovies\\_im\\_jeremy\\_sumpter\\_you\\_might\\_know\\_me/](https://www.reddit.com/r/movies/comments/1lyzknn/hey_rmovies_im_jeremy_sumpter_you_might_know_me/)\n\nWe'll be back at 5 PM ET today to answer questions. Ask us anything!",
        "upvotes": 0,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ydsr168v3ucf1.png?auto=webp&amp;s=fa76310d955e7060d6650d1f5070eaa244fd628f"
        },
        "permalink": "/r/movies/comments/1lzl8ai/hey_rmovies_im_sarah_cayce_the_director_of_the/"
    },
    {
        "id": "1lyzknn",
        "author": "JeremyAMA",
        "title": "Hey /r/movies! I'm Jeremy Sumpter. You might know me as Peter Pan from 2003's Peter Pan or from Friday Night Lights. I'm starring in Oxy Morons, a new, raunchy, crime-action-comedy. Ask me anything!",
        "content": "Hey r/movies! I'm Jeremy Sumpter. You might know me as Peter Pan from 2003's Peter Pan or from Friday Night Lights. I'm starring in Oxy Morons, a new, raunchy, crime-action-comedy. Ask me anything!\n\nHere's our trailer:\n\n[https://www.youtube.com/watch?v=WPOdTwvSlUE&amp;pp=0gcJCfwAo7VqN5tD](https://www.youtube.com/watch?v=WPOdTwvSlUE&amp;pp=0gcJCfwAo7VqN5tD)\n\n&gt;A nobody and a crew of underachievers hatch a half-baked plan to strike it rich by out hustling a large pharmaceutical company at their own game.\n\nIt's out now on digital. It's directed by Sarah Cayce (who will also be doing an AMA tomorrow), and also stars Jeremy Holm (AMA tomorrow as well!), Laura Ashley Samuels, Rae Gray, John Pirruccello.\n\nI've also been in Frailty, Into the Storm, Soul Surfer, An American Crime, and more.\n\nFull list of credits:\n\n[https://www.imdb.com/name/nm0838911/?ref\\_=tt\\_ov\\_3\\_1](https://www.imdb.com/name/nm0838911/?ref_=tt_ov_3_1)\n\nI'll be back Monday at 5 PM ET to answer your questions. Ask me anything reddit!\n\n",
        "upvotes": 109,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/auk3zre5mocf1.jpeg?auto=webp&amp;s=4928f6d6f60b8933efdc7b0bfa70b8652fb3cb24"
        },
        "permalink": "/r/movies/comments/1lyzknn/hey_rmovies_im_jeremy_sumpter_you_might_know_me/"
    },
    {
        "id": "1lzmso3",
        "author": "shmu_",
        "title": "Donkey Kong is finally getting his own movie adaptation, Nintendo copyright filing suggests",
        "content": "",
        "upvotes": 929,
        "comments": 138,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/urz_TK-d5CLY3037rS4nfj8MHsE797JT-16yACsfj1Y.jpeg?auto=webp&amp;s=a9de8a407898eae3466ef54fec5ac6b058e32b98"
        },
        "permalink": "/r/movies/comments/1lzmso3/donkey_kong_is_finally_getting_his_own_movie/"
    },
    {
        "id": "1lzhhno",
        "author": "Vegetable_Star8931",
        "title": "What’s one movie you loved as a kid but realized was terrible when you rewatched it as an adult?",
        "content": "We all have that one film we swore was the greatest thing ever growing up — until we rewatched it years later and went, *“Wait... what was I thinking?”*\n\nFor me, it was **\"The Master of Disguise.\"** I thought it was peak comedy when I was 10. Rewatched it recently and... yeah, not so much 😅\n\nCurious to know yours — which movie didn’t age well for you, or just lost the magic over time?",
        "upvotes": 1343,
        "comments": 1695,
        "media": null,
        "permalink": "/r/movies/comments/1lzhhno/whats_one_movie_you_loved_as_a_kid_but_realized/"
    },
    {
        "id": "1lzmiux",
        "author": "CamelReds73",
        "title": "The Big Lebowski is the perfect movie to explain the tenets of Taoism.",
        "content": "Firstly, this is a 5/5 movie for me, easily have watched this over ten times but this is the first time I really tried to apply the ideas of the Tao to what I was watching. I don’t think this is a groundbreaking take but it was really special to me to just have that “ah-ha” moment.\n\nWhen you think about The Dude and how much of a ~go with the flow~ kind of person he is, constantly adapting, you can then really see how he is the embodiment of living by Taoists principles. Just an entire movie dedicated to shit happening over and over to a singular individual wrapped up in the strands and complications of everyone else’s problems. You would expect that to be a terrible experience, and at times it can be, but rather than submitting to despair he just abides. As he abides, there are moments of serenity, more often than not in the bowling alley. Now he does go through the range of human emotion as you would expect one to go through during all these events, but not only is that normal, that is what is expected of trying to live and abide in balance with all there is and all that can be. The ol ying and the yang you know? The Dude just simply continues to be. I find that deeply moving and deeply spiritual. We are all just travelers in this iteration of who we are and all we can do is continue to trying to abide and not spill our beverage.",
        "upvotes": 465,
        "comments": 122,
        "media": null,
        "permalink": "/r/movies/comments/1lzmiux/the_big_lebowski_is_the_perfect_movie_to_explain/"
    },
    {
        "id": "1lz3ahl",
        "author": "ihopnavajo",
        "title": "What's the worst case of a movie breaking its own rule",
        "content": "I remember when It Follows came out, Quentin Tarantino made a post about how the movie broke its own rule (having the \"It\" touch someone without killing them). \n\nHowever, my top pick for a movie that broke its own rule is The Butterfly Effect. \n\nThe whole premise of the movie is that, with time travel, the smallest changes can have enormous consequences. You change one little thing and the future can change drastically. \n\nAnd yet ... The main character, in a situation where he wants to prove to someone that he has special Jesus like powers, goes back to his own childhood to a moment in class and makes a drastic change by violently mutilating himself in front of everyone, and then *ZIP* somehow we're back to the same point in the future and the only thing that changed was that he now has scars on his hands?!?\n\nWHACK\n\nAnyone have some other candidates?",
        "upvotes": 8953,
        "comments": 3294,
        "media": null,
        "permalink": "/r/movies/comments/1lz3ahl/whats_the_worst_case_of_a_movie_breaking_its_own/"
    },
    {
        "id": "1lzqaw5",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for Zach Cregger's 'Weapons'",
        "content": "",
        "upvotes": 99,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oful89bj4vcf1.jpeg?auto=webp&amp;s=4f2242c088163f939f6f87b6347ae33cde82ee0d"
        },
        "permalink": "/r/movies/comments/1lzqaw5/new_poster_for_zach_creggers_weapons/"
    },
    {
        "id": "1lz0nr6",
        "author": "ChiefLeef22",
        "title": "Christopher Nolan's 'Inception' Turns 15: A Look Back At The \"BRAAM\" Sound From Nolan's Film that Invaded the Hollywood Soundtrack",
        "content": "",
        "upvotes": 4639,
        "comments": 400,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tPmBuLJN4CkgIraMn22dRvUTCxviibyVDEnVM8x16Ao.jpeg?auto=webp&amp;s=00f269dcdeef227ef297573e677e9c9ece1f472a"
        },
        "permalink": "/r/movies/comments/1lz0nr6/christopher_nolans_inception_turns_15_a_look_back/"
    },
    {
        "id": "1lzm6vm",
        "author": "These_Feed_2616",
        "title": "What food scene in movies always make you hungry?",
        "content": "What scene in a movie involving food really makes you want to get whatever is in the scene in real life? I have 2, I always want burgers and fries after the big kahuna burger and sprite scene in Pulp Fiction. Also, whenever I watch GoodFellas, I always want to eat Italian food whether it be spaghetti or pizza!",
        "upvotes": 78,
        "comments": 290,
        "media": null,
        "permalink": "/r/movies/comments/1lzm6vm/what_food_scene_in_movies_always_make_you_hungry/"
    },
    {
        "id": "1lzp3rz",
        "author": "KillerCroc1234567",
        "title": "Andrew Garfield Officially Boards Luca Guadagnino’s ‘Artificial’ at Amazon MGM",
        "content": "",
        "upvotes": 46,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VfFmN6QsivNF99Spz6Xsv49tPPTG47iFZ0ICrlCbKEQ.jpeg?auto=webp&amp;s=2371fd0bb66c64aff63dd9b8fc9acbed62d3a2dc"
        },
        "permalink": "/r/movies/comments/1lzp3rz/andrew_garfield_officially_boards_luca/"
    },
    {
        "id": "1lzimlt",
        "author": "One-Complex-9267",
        "title": "Just finished watching Braindead (Aka Dead Alive) and possibly the goriest movie ever made",
        "content": "Sorry if it’s been discussed but I have to. \n\nI have watched many horror/gory/zombie movies and I was chatting with a friend about how it never usually weirds me out and in fact I enjoy them so he recommended me Braindead as it was one of those movies he could never finish. \n\nI usually get skeptical about low budget horror comedy but got super interested as I saw it was Peter Jackson movie. As New Zealander myself, I felt obligated and watched it. And boy I’m so shocked and surprised that it’s a Peter Jackson movie lol\n\nIn beginning when they showed cgi monkey, I got so disappointed that ok, this is gonna be shit show but I’m already 20 minutes in so let’s just keep watching and thank god I did that. It is officially the best zombie movie I’ve seen. The whole “I kick arse for lord”, breakfast with zombie to baby’s day out was just hilarious. And the last act was truly beyond words. I can’t be thankful enough of my friend after that.",
        "upvotes": 110,
        "comments": 63,
        "media": null,
        "permalink": "/r/movies/comments/1lzimlt/just_finished_watching_braindead_aka_dead_alive/"
    },
    {
        "id": "1lyv5u5",
        "author": "MarvelsGrantMan136",
        "title": "New Images of Daniel Bernhardt in ‘Deathstalker’, Directed by Steven Kostanski (‘Psycho Goreman’)",
        "content": "",
        "upvotes": 3455,
        "comments": 262,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/swudib2sqncf1.jpeg?auto=webp&amp;s=ea6d32408b4be5859055faee36896bc2f7ffd38c"
        },
        "permalink": "/r/movies/comments/1lyv5u5/new_images_of_daniel_bernhardt_in_deathstalker/"
    },
    {
        "id": "1lz40xn",
        "author": "MaxRichter_Enjoyer",
        "title": "Samurai duel from the movie Twilight Samurai. Featuring Hiroyuki Sanada. Movie was amazing too.",
        "content": "",
        "upvotes": 860,
        "comments": 99,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/60AOixlrYBOYwi6rF21_BLBYCXvOyxIW2ZfGAsiJ1A4.jpeg?auto=webp&amp;s=94b4dfed40a0d839203b9a06a130c60b419425b8"
        },
        "permalink": "/r/movies/comments/1lz40xn/samurai_duel_from_the_movie_twilight_samurai/"
    },
    {
        "id": "1lz9912",
        "author": "MrGittz",
        "title": "What movie did you always just assume was a big hit but turned out not to be? For me it’s the 2003 Peter Pan film.",
        "content": "I use to love looking up box office numbers for movies and there were so many times I would be surprised a movie i thought was a huge hit turned out to be a flop or barely made a profit. \n\nA big one is the 2003 Peter Pan movie. I just assumed it was a big hit. Like…how could it not be? Releases during the Harry Potter LOTR era? English kids with awesome visuals, flying, pirates? This should’ve been huge. \n\nThe original Tron is another movie I thought was a big hit. I guess that’s why it took them so long to make a sequel.",
        "upvotes": 409,
        "comments": 295,
        "media": null,
        "permalink": "/r/movies/comments/1lz9912/what_movie_did_you_always_just_assume_was_a_big/"
    },
    {
        "id": "1lyz4wl",
        "author": "15052025",
        "title": "Suggest me some \"Go in blind\" movies.",
        "content": "I'm in the mood for something fresh and surprising—can you suggest me some amazing “go in blind” movies? I’m talking about those kinds of films where the less you know, the better the experience. No spoilers, no trailers—just pure, unexpected movies. What do you recommend?\n\nWould prefer it in English language.",
        "upvotes": 1053,
        "comments": 2560,
        "media": null,
        "permalink": "/r/movies/comments/1lyz4wl/suggest_me_some_go_in_blind_movies/"
    },
    {
        "id": "1lzc9wn",
        "author": "WantonReader",
        "title": "What superhero movie should be the industry gold standard?",
        "content": "Cinemas today truly live in the age of superheroes. But they aren't actually new. We've seen major superheroes in cinemas since at least the 70s.\n\nBut looking back at all past superhero movies, and to all those that will be made in the future, which one should be considered the industry's gold standard?\n\nWhat movie has the right balance of all necessary parts, understands its characters the best and executes its vision the best? In other words, which superhero movie should be the inspiration for future movies to learn from?\n\nAll admit that I thought of this question after leaving the new Superman. NO SPOILERS....but I will admit that I still think another should be considered the industry gold standard: Spider-Man 2.\n\nA film so well planned, understood and executed that (according to some I've heard) it basically made it cool to like comics. And over 20 years later, it still holds up so well.\n\n.\n\nBut what does other people think should be the gold standard?",
        "upvotes": 160,
        "comments": 564,
        "media": null,
        "permalink": "/r/movies/comments/1lzc9wn/what_superhero_movie_should_be_the_industry_gold/"
    },
    {
        "id": "1lzl848",
        "author": "darth_vader39",
        "title": "Lizzy Greene &amp; Harry Collett Confirmed For Adaptation Of New Adult Bestseller ‘Easy’ As Filming Wraps In Malta",
        "content": "",
        "upvotes": 30,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xBUBpTU-sAbM60fXgZ7pYittKFDmJX9lRlFSOh7YO14.jpeg?auto=webp&amp;s=d3ac27d16ab87a7ed1fbac4c9a93fde45f63c15d"
        },
        "permalink": "/r/movies/comments/1lzl848/lizzy_greene_harry_collett_confirmed_for/"
    },
    {
        "id": "1lywl03",
        "author": "retired-tweeter",
        "title": "What's a movie trope that is stupid but you still enjoy it anyway",
        "content": "I love the end of disaster movies when, like millions of people have died, we still get the scene of the protagonist being happy and saying some corny one-liner. The \"Roland Emmerich' specialty. San Andreas. 2012. Day After Tomorrow. Moonfall (lol). A catastrophic event that changes the entire globe/area can occur, but if a few group survives, hey, it's all good. \n\nI love the \"random character says one thing out of context that pushes the plot forward\". Like in Die Hard with a Vengeance, some kid is like \"it's Christmas, you could steal City Hall\" and McClane is like \"OHHHHHHH, that's what the bad guys are doing\". Contrived way to push a plot forward, but I can enjoy it for being \"movie\" logic.",
        "upvotes": 1153,
        "comments": 732,
        "media": null,
        "permalink": "/r/movies/comments/1lywl03/whats_a_movie_trope_that_is_stupid_but_you_still/"
    },
    {
        "id": "1lzhmtt",
        "author": "Training_Shame8494",
        "title": "What’s a movie you could rewatch endlessly and never get tired of?",
        "content": "I’ve rewatched *Ocean’s Eleven* more times than I can count. It’s not even my favorite movie, but it just hits the perfect balance of fun, clever, and chill. I can throw it on anytime and still enjoy it.\n\nWhat’s that movie for you? The one that never gets old, no matter how many times you’ve seen it?",
        "upvotes": 53,
        "comments": 200,
        "media": null,
        "permalink": "/r/movies/comments/1lzhmtt/whats_a_movie_you_could_rewatch_endlessly_and/"
    },
    {
        "id": "1lzjl1c",
        "author": "TenK_Hot_Takes",
        "title": "The Untitled Tom Cruise Comedy",
        "content": "Frankly, that title would be comic enough, but I'm talking about the Alejandro Iñárritu project that just wrapped photography.  \n\nIt's been 10 years since Tom Cruise filmed anything that wasn't Tom Cruise being Tom Cruise (Mission Impossible or Top Gun).  His last not-Tom-Cruise film was \"American Made,\" which had some comic elements in it.  But the Iñárritu film is supposed to be an actual comedy.  [\"This is a wild comedy of catastrophic proportions. It’s insane.\"](https://deadline.com/2025/05/alejandro-gonzalez-inarritu-tom-cruise-amores-perros-cannes-1236405475/)\n\nSo, what's everybody think about Tom Cruise going full Les Grossman again?\n\n",
        "upvotes": 31,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YwU2X-J-CS3EVwsNIF3brOH6zvBjs30ZPxXnz-jsqgw.jpeg?auto=webp&amp;s=cf23b92b82968f16cea45e1082dcbdbb0242aafa"
        },
        "permalink": "/r/movies/comments/1lzjl1c/the_untitled_tom_cruise_comedy/"
    },
    {
        "id": "1lziqnh",
        "author": "shaneo632",
        "title": "Movies you've seen at festivals that never got released",
        "content": "I saw the film R#J - a screenlife version of Romeo and Juliet - at Sundance 2021. It also screened at SXSW that year (where it won an award) and yet 4.5 years later it still hasn't had any sort of release.\n\nWeird as it wasn't terrible by any means, and had a few recognisable actors like David Zayas and RJ Cyler, but it's just not even been dumped on VOD. Every so often I'll remember it and check on its status and see nothing.\n\nVery strange that something that premiered at one of the biggest festivals in the world has just evaporated like it never even got made and nobody associated with it seems to have talked about it since it premiered either.\n\nAny other examples folk can think of?",
        "upvotes": 30,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1lziqnh/movies_youve_seen_at_festivals_that_never_got/"
    },
    {
        "id": "1lz5kjr",
        "author": "Independent_Act_8054",
        "title": "Movies where the good guys are just good?",
        "content": "Having watched superman last night, what are some other movies where the good guys are just good because its the right thing to do?  It was so refreshing.  I don't need compelx motivations, it is just the right thing to do because its the right thing to do? I can't think of many examples that do this - everything seems to have a complex back story. ",
        "upvotes": 278,
        "comments": 140,
        "media": null,
        "permalink": "/r/movies/comments/1lz5kjr/movies_where_the_good_guys_are_just_good/"
    },
    {
        "id": "1lz778k",
        "author": "Galaga68",
        "title": "The Wraith • 1986 • Theatrical Trailer",
        "content": "",
        "upvotes": 197,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mRycd5KAZ2nA-IGOTyh9o7SZ_zbowiGxlmyYce1hj8o.jpeg?auto=webp&amp;s=d2ae4083c5fc49ac169b26263646433044a85ca9"
        },
        "permalink": "/r/movies/comments/1lz778k/the_wraith_1986_theatrical_trailer/"
    },
    {
        "id": "1lz2zwj",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Nick Offerman - Thursday 7/17 at 3:00 PM ET - Actor in 'Parks and Recreation', 'Civil War', 'The Last of Us', 'Mission Impossible: The Final Reckoning', 'Dumb Money', 'Devs', 'Dicks: The Musical', 'Sovereign', 'The Founder', and lots more.",
        "content": "",
        "upvotes": 310,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0876fszjbpcf1.png?auto=webp&amp;s=459df7b8c04748ed90658b0f5cbb5bcd2fd23e11"
        },
        "permalink": "/r/movies/comments/1lz2zwj/amaqa_announcement_nick_offerman_thursday_717_at/"
    },
    {
        "id": "1lz77y9",
        "author": "Express_Basis_8710",
        "title": "2001: A Space Odyssey completely broke my Rating System",
        "content": "Usually when I watch a movie, I can figure out my rating pretty quickly, either right after or within a day or two. I always land on some score out of 5. But with 2001: A Space Odyssey, I’m just stuck. I’ve been left in awe, confusion, and something I can’t even put into words.\n\nI’ve already watched breakdowns and analyses of the film and its ending, and yet I still can’t decide if I absolutely love it or just really like it. I’ve never had a movie make me feel this way, like the issue is that I’m not even sure how to process it, let alone rate it.\n\nDoes anyone else feel this way about the movie? If so is it because it’s some sort of masterpiece or is just rlly good cinema?",
        "upvotes": 150,
        "comments": 238,
        "media": null,
        "permalink": "/r/movies/comments/1lz77y9/2001_a_space_odyssey_completely_broke_my_rating/"
    },
    {
        "id": "1lzogrr",
        "author": "Bennett1984",
        "title": "Heidi: Rescue of the Lynx - Trailer",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/T6esPAKrlCH8E7qzIWPmlEyzOxojBFTa2JdvFUzjmmc.jpeg?auto=webp&amp;s=2f17fe672f85555ef0d6a6b059caf36b30db307d"
        },
        "permalink": "/r/movies/comments/1lzogrr/heidi_rescue_of_the_lynx_trailer/"
    },
    {
        "id": "1lypkex",
        "author": "DontDeleteMee",
        "title": "What movie quote was transformed by a pause?",
        "content": "I recently caught The Truman Show on TV again. I'd forgotten how that show-runner says to Truman, \"I am the creator...of a tv show\"...\nThat pause communicates so much. \n\nNot quite the same, but just as delightful is the ever famous, \"It's not a tumor...not a tumor at all\" \n\nCan anyone think of any other examples?\n\n",
        "upvotes": 999,
        "comments": 409,
        "media": null,
        "permalink": "/r/movies/comments/1lypkex/what_movie_quote_was_transformed_by_a_pause/"
    },
    {
        "id": "1lyul78",
        "author": "keepfighting90",
        "title": "'Apocalypse Now' is one of the greatest - if not THE greatest - cinematic experiences I've ever had",
        "content": "An ever-degrading fever dream. That's what watching Apocalypse Now I felt like. It probably didn't help that I watched it while coming down from a fever, sweating and a little uncomfortable, with an overcast, drizzling sky outside - but damn, the *atmosphere* this movie creates is second to none.\n\nIt's a bad trip that gets worse and worse, as Willard and his crew undertake their hellish odyssey down the river to find Kurtz. I've read Joseph Conrad's Heart of Darkness, and I was aware that Apocalypse Now is loosely based on that story. It's a masterful interpretation of that story, widening the scope and scale and making it feel somehow even more sinister.\n\nA lot of this is due to how the movie *looks.* Apocalypse Now might be the most visually stunning movie I've ever watched. It's frankly insane to me that it came out almost *50* years ago because it would still blow away pretty much anything released by even the best directors today. It looks so bold, lush and vibrant, with incredible shot composition and lighting. A sickly orange-yellow glow suffuses the landscape, and mist and fog always shrouds the horizon. It's like the characters are traversing through hell, and it adds to the dreamlike feel of the movie.\n\nIt also has one of my favourite cinematic interpretations of war in a movie. Sure, it shows war as bad, and Americans as imperialists and all of that. But more than that, in Apocalypse Now, war is much more abstract, a dark, primordial force that acts as both catalyst and conduit for humanity's darkest urges. It affects everyone. Killgore, Kurtz, the boys on the boat, Willard. Everyone becomes a beast prowling through the jungle. \n\nMarlon Brando's limited screen time is as impressive as advertised - both the writing and his performance, along with how he's shot - portray him as almost a mythical figure out of a twisted fairy tale. Kurtz is more a concept and an idea than a man. Martin Sheen is more restrained, but you can always see the madness just under the surface.\n\nAnd there's that steadily escalating nightmare-feel of the movie, and what makes it so damn incredible. Each sequence and set piece feels more surreal, bleak and unhinged than the last, culminating with the ritual slaughter/assassination at the temple that's one of the most jaw-dropping scenes I've seen in a long time. Honestly, even if you choose not to overanalyze the movie or interpret what it's trying to say, I think it would still be a 5-star watch based simply on the power of its audiovisual presentation alone. It's such a staggering achievement in filmmaking, I can't say enough about it.\n\nNote: I watched the 2 hr 27 min. theatrical cut. At some point in the future I'll probably check out Redux or The Final Cut",
        "upvotes": 406,
        "comments": 117,
        "media": null,
        "permalink": "/r/movies/comments/1lyul78/apocalypse_now_is_one_of_the_greatest_if_not_the/"
    },
    {
        "id": "1lz9flr",
        "author": "BoneMachine427",
        "title": "“Get Shorty”",
        "content": "“Get Shorty” is one of the smoothest films to digest on a night with no worries. Looking for a fun and quirky comedy with a tinge of drama? Check. Everyone involved in this movie from Travolta to Sonnenfeld deserved their flowers for this kitschy little ode to Hollywood. \n\nThey did the source material justice. \n\nWhy doesn’t Hollywood make these kinds of movies anymore?\n",
        "upvotes": 58,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1lz9flr/get_shorty/"
    },
    {
        "id": "1lzfvst",
        "author": "keysgetbusy",
        "title": "If you can save any movie character who would it be?",
        "content": "If you can save any movie character from dying who would it be and why? Or even just save them from a certain situation. \n\nSome basic examples; imagine saving tony stark from dying and he continued to mentor Peter Parker and give him stark tech. \n\nOr imagine saving Anakin Skywalker from joining the dark side and him and Luke take down the empire together. \n\nI know these events would change the movies completely and in the case of Anakin star wars would just be a completely different film but I want to hear your opinions!!",
        "upvotes": 20,
        "comments": 110,
        "media": null,
        "permalink": "/r/movies/comments/1lzfvst/if_you_can_save_any_movie_character_who_would_it/"
    },
    {
        "id": "1lzaeuv",
        "author": "jeejeeviper",
        "title": "Copycat (1995) has the most incompetent cops I’ve ever seen in a serious thriller",
        "content": "- allowing Sigourney Weavers character to get attacked in the first scene by being piss-poor at checking bathroom stalls \n- continually leaving Sigourney Weaver’s character alone throughout the rest of movie when she’s supposed to protected from an active serial killer\n- cops letting a suspect steal their gun while the suspect is in their police station and handcuffed\n- a detective not taking a kill-shot when said suspect with the stolen gun takes her detective partner hostage, leading to the detective getting fatally shot\n- main female detective discovered Weaver’s apartment was broken into and covered in blood and went in alone without immediately calling for backup \n- female detective almost dies at the end because she’s also piss-poor at clearing out bathroom stalls\n\n- I have to reiterate the second point. There are four separate times in the movie where they leave Weaver alone and the killer either breaks into her place, stalks her, or kidnaps her. 4 times.",
        "upvotes": 50,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1lzaeuv/copycat_1995_has_the_most_incompetent_cops_ive/"
    },
    {
        "id": "1lzndd9",
        "author": "godzilabob",
        "title": "The only 2 movies I’ve EVER watched back to back.  Do you have any?",
        "content": "When I was 13 I took my paper route money and watched Raiders of the Lost Ark in the theater back to back.  No explanation necessary.      \n\n    \nWhen I was stuck in purgatory at work, I watched the original SAW then ran it back. Why?  I had heard nothing about it and both the story and the quality surprised me. \nYou?",
        "upvotes": 6,
        "comments": 84,
        "media": null,
        "permalink": "/r/movies/comments/1lzndd9/the_only_2_movies_ive_ever_watched_back_to_back/"
    }
]