[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 484,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1humnmr",
        "author": "Safe-Adhesiveness713",
        "title": "How do I turn my language to English? It randomly turned to this language and I don’t know how to switch it",
        "content": "",
        "upvotes": 165,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1humnmr/how_do_i_turn_my_language_to_english_it_randomly/"
    },
    {
        "id": "1huy2wc",
        "author": "Whobitmyname",
        "title": "The Sequel to Jean-Claude Van Damme's Revenge Thriller Is Topping Netflix Charts",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1huy2wc/the_sequel_to_jeanclaude_van_dammes_revenge/"
    },
    {
        "id": "1hv2v1n",
        "author": "xxchar_xoxo",
        "title": "Need new netflix obsession show recommendations ",
        "content": "I was wondering if anybody had recommendations for shows similar to heartstopper, Anne with an e and Bridgerton. Preferably on netflix, but could be prime or Disney plus too or even BBC iPlayer. Just any recommendations please!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hv2v1n/need_new_netflix_obsession_show_recommendations/"
    },
    {
        "id": "1huuwpc",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix took home 6 Golden Globe awards 2 for Baby Reindeer and 4 for Emilia Pérez",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1huuwpc/netflix_took_home_6_golden_globe_awards_2_for/"
    },
    {
        "id": "1hv08pp",
        "author": "SigmaProtocal",
        "title": "Show idea",
        "content": "Netflix has been doing immersive experiences in select cities for new shows like strangers things l. \n\nI was thinking it would be such a good idea to do a cooking competition show like culinary class wars, where patrons could pay to go into a screening of say 3 episodes, and be served a handful of dishes from the show as you watch them make it. I could easily see this being an incredible experience and seeing tickets go for hundreds of dollars. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hv08pp/show_idea/"
    },
    {
        "id": "1huw3jl",
        "author": "Important_Use6452",
        "title": "Have you seen the shameless Brita advertising on recent Netflix shows?",
        "content": "I've seen Brita being plugged in the last 3 shows I've watched and I think I'm getting pissed lmao:\n\n\\- Black Doves: very prominent scene where the Brita and the product packaging is placed in the very center of a scene, and discussed and mentioned by name several times.\n\n\\- Man on The Inside: The main character wants a Brita as his birthday gift and two characters go out to buy one.\n\n\\- Love Is Blind: One of the main contestants says he can't do much except fill a Brita up with water (could be just a coincidence not necessarily a plug)\n\nHave they been plugging it on other shows?",
        "upvotes": 3,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1huw3jl/have_you_seen_the_shameless_brita_advertising_on/"
    },
    {
        "id": "1hv2u4r",
        "author": "umimmissingtopspots",
        "title": "Netflix Series",
        "content": "Happy New Year everyone!\n\nI had some downtime these past few days and decided to binge a couple of Netflix series. One to see what the fuss was all about and an older one just because I like the actor who is in it.\n\nThe first series I watched was The Gentlemen. The first four episodes were okay but I told my wife I don't understand what the fuss is about. This isn't even close to being as good as Breaking Bad, Sopranos or Sons of Anarchy or even The Walking Dead (only because of the first four absolutely amazing seasons). It's not even as good as Yellowstone and I am not all that fond of it either. But at least it has moments of greatness. I told her unless it picks up I really don't know why people like it. \n\nI watched the next episode and was quickly eating my words. It really picked up and by the end of it I was like damn that was good. I would rank it better than Yellowstone but I still don't think it's as good as these other four shows. I hope season 2 ramps things up a notch too. I'm optimistic it will.\n\nThe other series I watched was Clickbait. I actually enjoyed this way more than I did The Gentlemen because it was engaging from the first episode until the last. I really thought I figured out by episode two who did it. I told my daughter it's quite commonly a pheriperal character and the character I suspected lined up with that notion. During episode 7 I was screaming \"Touchdown\" (as I was walking on my treadmill) because I thought my prediction was confirmed. Episode 8 proved me wrong and I am okay with that. It was a unique twist that I am sure very few would have suspected. \n\nAll in all they were both good series and I would recommend them to anyone who hasn't seen them.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hv2u4r/netflix_series/"
    },
    {
        "id": "1huoykl",
        "author": "PowerDubs",
        "title": "Since it's launch on Netflix games Oct 8th... Atari's RollerCoaster Tycoon has over 100,000 downloads on Google Play",
        "content": "",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1huoykl/since_its_launch_on_netflix_games_oct_8th_ataris/"
    },
    {
        "id": "1hv1d4r",
        "author": "DarkKnight1799",
        "title": "Help me find this English web series",
        "content": "[ToMT][Netflix] A Netflix series where a couple adopt a puppy\n\nIn the opening scene of this web series, a couple went to adopt a puppy. \nThe adoption center caretaker show the wife a picture of her husband with another girl and refused the puppy. \nThis revelation led to an argument between the couple. \n\nAll I can remember is this much. \nAfter this, I could not continue it for some reason. \nAnd I can't find this series in my continue watching list. \n\nPlease help me find it. \nThanks. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hv1d4r/help_me_find_this_english_web_series/"
    },
    {
        "id": "1huuxgk",
        "author": "moderngamer327",
        "title": "Opening Netflix in any browser causes screen to glitch",
        "content": "Having an issue where after opening Netflix without even opening a video causes the whole screen to be glitchy. Everything looks like it’s vibrating slightly and at the top of the screen there is thin stripes of rainbow glitches. This occurs in any browser with or without hardware acceleration. Even after closing Netflix the entire screen will remain glitchy until the monitor is turned off and on again. Disabling widevine prevents this from happening but obviously that’s not a solution as it prevents me from watching video.\n\nI had thought this may have been because of Nvidia Overlay but the issue persisted even after disabling it. I also tried to update drives and have the same issue",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1huuxgk/opening_netflix_in_any_browser_causes_screen_to/"
    },
    {
        "id": "1huntic",
        "author": "lgh0614",
        "title": "will it not allow people at home to use my netflix account if i say i'm traveling?",
        "content": "i've (18) used my step moms netflix account for YEARS, which hasn't been a problem when i'm not at her place as long as i'm watching stuff on my laptop instead of my tv (i'm guessing because i bring my laptop with me when i go to her and my dads house). recently i've bought a bigger tv and theres this movie on netflix i've been wanting to watch, but i'd rather watch it on the tv instead. my step mom wouldn't mind me saying i'm traveling and giving me the code, i'm just wondering if that would mess up the ability for her to watch netflix at her house.",
        "upvotes": 8,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1huntic/will_it_not_allow_people_at_home_to_use_my/"
    },
    {
        "id": "1huwlyn",
        "author": "littlemoosehead",
        "title": "My profile isn't even appearing",
        "content": "My Netflix account has five profiles, and I use the fifth profile (not too sure if that matters but I figure any information could be helpful). When I use Netflix on a television, my profile appears and I can use it with no issues. However, on both my iPad and my PC browser, my profile doesn't even show up. I know it wasn't deleted because I can still use it, but then I'm forced to use my television. I've tried logging out and logging back in, I've tried uninstalling and reinstalling the app. I'm truly stumped and would appreciate some assistance.\n\nThanks in advance :)",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1huwlyn/my_profile_isnt_even_appearing/"
    },
    {
        "id": "1husfm3",
        "author": "GullibleRanger2616",
        "title": "Shows disappearing from continue watching ",
        "content": "Afew days ago the shows I’ve been watching disappeared from my continue watching and I tried to search them up and they weren’t on Netflix, I went onto a different profile and the shows were there still, does anybody experiencing the same issues and have a fix for this",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1husfm3/shows_disappearing_from_continue_watching/"
    },
    {
        "id": "1hv1kxa",
        "author": "SadHistorianUkr",
        "title": "Squid Game but its in Ukraine",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hv1kxa/squid_game_but_its_in_ukraine/"
    },
    {
        "id": "1huva7u",
        "author": "kingseyb",
        "title": "New on Netflix in January 2025",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1huva7u/new_on_netflix_in_january_2025/"
    },
    {
        "id": "1huv61m",
        "author": "Naiivee",
        "title": "Netflix HDR not working ",
        "content": "Anyone now how to fix this? HDR content on Netflix is doing this. I don’t even know how to describe this issue so I figured I’d ask here.",
        "upvotes": 0,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5n8z42m1dcbe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1huv61m/netflix_hdr_not_working/"
    },
    {
        "id": "1huv432",
        "author": "Negative-Radio9713",
        "title": "Why do netflix thumbnails look so bad??",
        "content": "Most of the time, the thumbnails for shows and movies (specifically on Netflix) have seemingly altered thumbnails that look like random screenshots from the show/movie it represents.\n\nThis really feels like it takes away from the contents of the show/movie and often just leaves me skipping stuff to find better things to watch bc everything (for whatever reason) looks like a sitcom.\n\nI cannot be the only person to think this is a problem cuz we all pay for netflix but get shown half-baked thumbnails, making me wanna just use something else or cancel my subscription entirely since i just cant seem to find a ton of content that screams ate anymore.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1huv432/why_do_netflix_thumbnails_look_so_bad/"
    },
    {
        "id": "1hudvh3",
        "author": "CM-Edge",
        "title": "Since start of 2025 Netflix stopped working in 4K / 2160p on my Chrome Browser on PC",
        "content": "Netflix suddenly stopped working being in 4K for me on my Chrome browser from one day to the other. Maybe since start of the new year? I noticed it yesterday, while I still watched stuff on there in 4K right before the end of the year.\n\nEverything only has the HD tag there now, so that's confirmation, but in the Edge browser, 4K things still have the 4K tag, so an issue with Chrome? Is this new?\n\nChrome:\n\n[https://a.l3n.co/i/MdjKbQ.png](https://a.l3n.co/i/MdjKbQ.png)\n\n  \nEdge:\n\n[https://c.l3n.co/i/Mdj4lM.png](https://c.l3n.co/i/Mdj4lM.png)",
        "upvotes": 10,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hudvh3/since_start_of_2025_netflix_stopped_working_in_4k/"
    },
    {
        "id": "1huep2f",
        "author": "fayestarr",
        "title": "what are the best rom/thriller movies/series? ",
        "content": "here me out, I’ve been trying to find some good movies/series that would be like the books yk yk yk, I WANT ENEMIES TO LOVER TROPE but I just can’t find any good ones or maybe I’m just too bad at searching, do you guys have any suggestions for netflix?",
        "upvotes": 10,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1huep2f/what_are_the_best_romthriller_moviesseries/"
    },
    {
        "id": "1huxoq9",
        "author": "ShaivRoy",
        "title": "Wwe Raw On Netflix Premiere Predictions",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1huxoq9/wwe_raw_on_netflix_premiere_predictions/"
    },
    {
        "id": "1huop3y",
        "author": "PixelVapor",
        "title": "Did it really happen?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1huop3y/did_it_really_happen/"
    },
    {
        "id": "1hun9n6",
        "author": "Cri1709",
        "title": "household problem",
        "content": "I use Netflix mainly on my phone, and I've recently started to watch Netflix on my tv, although not very often\nthe problem is that on my phone it says I'm not part of the household, and while my tv is connected to wifi, I use mobile data on my phone cause it's faster (usually bad wifi connection)\nand I even tried to connect my phone to the same wifi and it still doesn't work \nis there any way to remove my household like it was before, and just use Netflix on my phone? or is there any other solution other than using the 14 days code?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hun9n6/household_problem/"
    },
    {
        "id": "1hun1ie",
        "author": "Historical_Coyote245",
        "title": "Just finished interview w a vampire 😭😭 need suggestions PLEASE ",
        "content": "Here’s some of my favorites \n\nInterview w a vampire \n\nTrublood\n\nBuffy\n\n\nYou \n\nKilling eve \n\nLincoln lawyer \n\nYour honor \n\nEmily in Paris \n\nSuits \n\nDexter\n\nWalking dead \n\nBehind her eyes \n\nLucifer \n\nMidnight club \n\nMidnight mass \n\nFall of the house of usher \n\nHaunting hill house \n\nHaunting of bly manor (love Mike Flanagan) \n\nBlack list \n\nGood girls \n\nWednesday \n\nMoney heist \n\nDark \n\nIn the dark \n\nA brand new cherry flavor \n\nMoney heist \n\nShameless \n\nWeeds \n\nGilmore girls \n\nThe OC \n\nThe flash \n\nArrow \n\nRaising dion \n\nThe order \n\nThe sinner \n\nBlack mirror \n\nHow to get away with murder \n\nTiny pretty things \n\nOzark \n\nGinny and Georgia \n\nGrace and Frankie \n\nParenthood \n\nHouse of cards \n\nThe good place \n\nOrange is the new black \n\nSchitts creek \n\nPrison break \n\nZnation \n\n13 reasons why \n\nNew girl \n\nSnowfall \n\nVikings \n\nHart of Dixie \n\nWorking moms \n\nSilvana sin Lana \n\nThe Woman in the House Across the Street from the Girl in the Window\n\nPower series ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hun1ie/just_finished_interview_w_a_vampire_need/"
    },
    {
        "id": "1humb82",
        "author": "2017_JKU",
        "title": "Netflix Preview Club?",
        "content": "Anyone done this?  It says after the show I will have a 10-20 minute survey but depending on the runtime 40 minutes to 3.5 hours.  WTH?\n\nI'm not taking a survey that long.  Is that realistic?\n\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1humb82/netflix_preview_club/"
    },
    {
        "id": "1husz1e",
        "author": "Miserable_Island_339",
        "title": "I don’t think Mildred Ratched is a bad person.",
        "content": "This is based off the ratched series. I never watched the movie it was based off of. I don’t think she’s a bad person though. She went through a lot of fucked up things in life. She changed a lot during the show. She is a badass and I really enjoy her character. She killed people but they were all bad people anyways. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1husz1e/i_dont_think_mildred_ratched_is_a_bad_person/"
    },
    {
        "id": "1hum1wz",
        "author": "azaanu7",
        "title": "Having problems downloading stuff",
        "content": "Only one device has downloads out of the max 2 however it wont let me download on my phone after I powered my phone off which is what it said to do. The download button is not showing up on anything. Why?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hum1wz/having_problems_downloading_stuff/"
    },
    {
        "id": "1hu9311",
        "author": "Anonythrowthetrash",
        "title": "Should I Worry about “New Sign In” from Netflix email",
        "content": "I was worried when I got an legit email from Netflix saying there was a new sign in on iPhone Safari - Mobile Browser from Michigan. This was a few days ago. Then I try to go into my account settings on my app, which does bring me into a browser submenu, then I got the same email but from Texas. I did this the same thing and still got the same email. I think it thinks going into the account settings is a new sign in.\n\nWhat I did notice is that time was from Michigan but this time was Texas. Is this anything I should be worried about?",
        "upvotes": 5,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1hu9311/should_i_worry_about_new_sign_in_from_netflix/"
    },
    {
        "id": "1hufi8x",
        "author": "iamamazing1355",
        "title": "Netflix plan for live content",
        "content": "I'm planning on getting Netflix to watch monday night raw and NFL games in the future.  Does it matter what plan I get?  Like is that stuff going to stream with better quality with premium?",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hufi8x/netflix_plan_for_live_content/"
    },
    {
        "id": "1huqshb",
        "author": "mateoelpro332minecra",
        "title": "Looking for an old netflix ahow hat was removed",
        "content": "Helo im searching for an animated show i watched way back i think it was 2014 or around that time about a a kid looking for her sister i remember in one episode him and other guy went look for a guys that was really good at swimming and in another episode there was a bunker in a desert if some1 could help me out i would really appreciate it",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1huqshb/looking_for_an_old_netflix_ahow_hat_was_removed/"
    },
    {
        "id": "1hujbek",
        "author": "Lamborghini_Gallardo",
        "title": "I have an issue… you too ?",
        "content": "I have an issue with the section « continue reading » that just disappeared from the app so I’m a bit curious to know if anyone has the same issue (it’s not a big deal thought but it’s not useful cuz I need to remember the serie / movie I started) \nThanks for your answers ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hujbek/i_have_an_issue_you_too/"
    }
]