[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 497,
        "comments": 260,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1ip9i52",
        "author": "brownieekb",
        "title": "Ralph Macchio on the new Karate Kid movie as Cobra Kai returns on Netflix",
        "content": "",
        "upvotes": 82,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ip9i52/ralph_macchio_on_the_new_karate_kid_movie_as/"
    },
    {
        "id": "1ip5wqs",
        "author": "Robemilak",
        "title": "A Live-Action ‘Dungeons &amp; Dragons’ Series ‘The Forgotten Realms’ Is in the Works at Netflix",
        "content": "",
        "upvotes": 31,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ip5wqs/a_liveaction_dungeons_dragons_series_the/"
    },
    {
        "id": "1ip0ytf",
        "author": "journothoughts",
        "title": "Real life Chanelle from Apple Cider Vinegar speaks out about the series",
        "content": "Chanelle McAuliffe recently spoke on a podcast about he show's depiction and what it got right and wrong about Belle Gibson's fake cancer story.\n\nKinda expected it to be dramatised, especially the show saying it was a true-ish story, but wondering where the line was in still being sensitive to people who were affected or just those in general suffering from cancer.\n\nIt was interesting to listen to and also hear her thoughts on the whole situation.\n\n[https://articles.listnr.com/news/what-you-need-to-know-from-the-friend-who-exposed-belle-gibsons-lie/](https://articles.listnr.com/news/what-you-need-to-know-from-the-friend-who-exposed-belle-gibsons-lie/)",
        "upvotes": 63,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ip0ytf/real_life_chanelle_from_apple_cider_vinegar/"
    },
    {
        "id": "1ipdaia",
        "author": "Somethingman_121224",
        "title": "Netflix's Bela Bajaria Believes Amazon Overpaid 'Beast Games' To Snatch It From Netflix",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ipdaia/netflixs_bela_bajaria_believes_amazon_overpaid/"
    },
    {
        "id": "1ipa24r",
        "author": "alanmcgeeny",
        "title": "What’s the best fantasy series on Netflix right now?",
        "content": "something with immersive world-building, interesting characters, and a story that pulls you in. I’d love some recommendations! What’s your top fantasy series on Netflix right now?",
        "upvotes": 7,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1ipa24r/whats_the_best_fantasy_series_on_netflix_right_now/"
    },
    {
        "id": "1ipdeik",
        "author": "DaviddStewartt",
        "title": "What film could you rewatch forever",
        "content": "Was looking for some films to watch, and wanted to get some ideas from everyone.\n\nWhat films could you rewatch over and over again without fail, i wanna join in\n\nIm planning to watch a film with anyone who is down with the new Public Cinema Extension. Just drop down some suggestions below:\n\nhttps://chromewebstore.google.com/detail/public-cinema/mfedjoeaeahicdibponegkifgdmbagai?hl=en",
        "upvotes": 2,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1ipdeik/what_film_could_you_rewatch_forever/"
    },
    {
        "id": "1ipafuz",
        "author": "MysteriousDelay6266",
        "title": "My family | Official Trailer | Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ipafuz/my_family_official_trailer_netflix/"
    },
    {
        "id": "1ipeo17",
        "author": "brownieekb",
        "title": "Inspo if you're looking for a Valentine's day rom-com!",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ipeo17/inspo_if_youre_looking_for_a_valentines_day_romcom/"
    },
    {
        "id": "1iped87",
        "author": "PyCoder2000",
        "title": "Netflix Incoming Intern - Need Advice",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iped87/netflix_incoming_intern_need_advice/"
    },
    {
        "id": "1ipdow7",
        "author": "Final_Artist9645",
        "title": "Can anyone recommend me some series to watch?",
        "content": "I've just finished Never I Have Ever and I'm about to finish Squid Game 2 too, so I'm running out of series to watch. I watched Wednesday too, and maybe someone can recommend me some series like those ones. Can you help me?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ipdow7/can_anyone_recommend_me_some_series_to_watch/"
    },
    {
        "id": "1ip1iyb",
        "author": "BusinessConcept8396",
        "title": "Surviving Blackhawk Down Documentary",
        "content": "Just finished watching the new Ridley Scott documentary about the actual battle of Mogadishu in 1993. I’m wondering how in the world they were able to track down people in Somalia and send a production crew there to interview them?!",
        "upvotes": 10,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1ip1iyb/surviving_blackhawk_down_documentary/"
    },
    {
        "id": "1ip75db",
        "author": "v4mp_x",
        "title": "any recommendations to help cope with a passing?",
        "content": "this might be a weird thing to ask, but i’m at a loss rn and just need shows to help cope. i apologize if this goes against any rules this is my first post here but any recommendations would help! hope everyone has a wonderful day/night :) ",
        "upvotes": 1,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ip75db/any_recommendations_to_help_cope_with_a_passing/"
    },
    {
        "id": "1ip3zvy",
        "author": "Classic_Bass_1824",
        "title": "“Dark” and the excess of mystery storytelling",
        "content": "Did you enjoy watching Dark, or did your brain? \n\nUpon finishing Netflix’s German-language sci fi, following four families in the fictional town of Winden, whose lives all get upended when a child goes missing, then another child, then a man in a preacher’s outfit appears, then the weird cave all the locals theorise about winds up being a portal that can catapult you 33 years forwards or backwards, or sometimes it doubles up and you go 66 years back, or your future selves show up to intervene in current events and—oh my god this show is exhausting. Good, and unquestionably clever, boasting a script brainy and twisted enough to make M. Night Shyamalan wide-eyed, but incredibly fucking exhausting. The first word a charade says in the show is an exasperated “fuck” which signals what watching the show is actually like. Especially when you binge it, Dark is not so much enjoyable as it is engaging. You’re always thinking, but never really being entertained. \n\nWhen asked on how they came up with Dark, an inevitable question given how absurdly planned-ahead the show is for its three season run, showrunners Baran bo Odar and Jantje Friese said they read up on science and philosophy, and a lot of it. Piles of books as research for your sci fi show that tries to be the popular spin on Primer is almost a necessity, and the effort was well worth it given the final product, but you can definitely feel the work that went into this script as you’re watching it play out. After reaching a certain point of familiarity with Dark’s groove, the twists are less surprising because you’re imminently expecting them episode after episode, and at a certain point the story leaves centre stage as you subconsciously applaud bo Odar and Friese for even thinking of that. Dark is thoughtful, but there’s little humanity left to breathe within all that clever narrative swerving. \n\nAs Winden is a pretty small town, the cast of characters is pretty thin. Even with the added junction of seeing them across various time periods and even parallel worlds, you’d think by Season 3 that an average viewer would have a good grasp on who these people are. But alas you really don’t, and this lack of true empathy or even relatability to any of them is mainly the show’s blame, as it so often likes to remind us how every character is a pawn in a much bigger game. Watching one person be manipulated on their entire journey can make for engaging TV, but when the puppet strings are hanging over everyone, it’s a lot more difficult to see them as people. By the time Adam compares them to chess pieces for the fiftieth time while he stares at that gawdy ainting, you start seeing them that way as well. \n\nThe main character gets the worst of this coldness. Jonas Kahnwald is the show's protagonist in tradition only; rarely have I have encountered a main character so scant of agency and actual vavavoom to their decisions. It becomes something of a running joke how much he gets hoodwinked by his peers. As he’s the figurehead of a thinking-man’s mystery story, nearly every thread ties back to Jonas, narratively and genetically. The whole town is essentially a slinky dog of DNA mixing, but any moral engagement over this incest hotbed about this is unfortunately airbrushed. The longer Dark goes the less time it gives its character to feel like people at all, because it has to keep that plot moving. Season 3 stands out as pretty bad for this, feeling somehow rushed and plodding at points due to how much is happening with so little deliberation over it, but even by Season 2 the wheels fall off a bit. It becomes far less dramatic and emotionally resonant past the first season form 2017, and morphs sharply into genre fare. I don’t want to sound hyperbolic here - Dark genuinely gives no time to its characters over these life changing revelations. Most people would choose to die than suffer fates that various characters here endure. Who wants to be Ulrich or Helge? No thanks. \n\nOne can learn that their husband’s secret love affair mistress also slept with her son in the 80’s, and we don’t see much difference between scenes of them discovering that baffling fact and processing it. One can discover that their daughter is actually their mother and have to time travel to an apocalyptic future to ensure their daughter freaks out over losing their daughter who’s actually their mother—do you see the point being made here? I wouldn’t expect the writers to offer a plausible response to a scenario so convoluted and existential that it would make your brain implode, but Dark makes stunningly little effort to show any sort of mental strain this twisted web of a storyline weighs on anyone. I’m sorry but music montages don’t cut it. Each episode is bookended by an atmospheric track playing over characters looking glum. Assuming this is the stand-in for their contemplation for anything that the plot throws on their plate, I’m still not convinced it’s anywhere close to enough. Docking points off Dark for poor realism would be silly, but I think you can definitely notch it down a peg or two from that Masterpiece podium for how little it cares for its characters.\n\nAgain, maybe the point I harp against here isn’t exclusive to Dark and is moreso a broad symptom in mystery-led storytelling. The characters become chess pieces. The same effect can naturally spring up in any media that dabbles with time travel. Combine these two together and you get Dark, a show that’s indefinitely interesting but could’ve been so much than just interesting. Maybe if there was a fourth season, or just a little dash of filler so we might see these people smile or laugh or something, you’d have something deeply intellectual AND emotional. \n\nThat’s my biggest bugbear with the show is the missed potential, especially when it seems like an easy amendment with all the hard work done. We could get a searing character drama with these four families, but Dark has no interest in doing that, therefore I doubt we’ll really see how this core idea works at its empathetic best, because Dark already did half of these aspects the best it’s ever been done. \n",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ip3zvy/dark_and_the_excess_of_mystery_storytelling/"
    },
    {
        "id": "1ipe24p",
        "author": "EthanWilliams_TG",
        "title": "Netflix's Bela Bajaria Believes 'Oppenheimer' Would Have Had the Same Impact as a Netflix Original",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ipe24p/netflixs_bela_bajaria_believes_oppenheimer_would/"
    },
    {
        "id": "1ip4vfi",
        "author": "milm0ur",
        "title": "Emails In a different Language",
        "content": "Netflix has started sending me emails in what I think is Vietnamese. I’m trying to reset my password but every time I request a password reset email or a code to login it’s sent to me in Vietnamese? I’m pretty sure they’re official emails as the codes work but I can’t reset my email because I can’t read it. I also can’t contact Netflix Help for I don’t know what reason and I can’t find anything else online. These emails also aren’t random scam emails, they’re emails I’m specifically requesting when trying to login. Can anyone suggest any help?\n\nEdit to add: I just called 1800 404 982 and someone there talked me through getting my account back and I was able to log back in (had to resubscribe but needing to do that is what started this whole debacle) and I could log back in on the app. Would it be safe to say that it’s safe now?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ip4vfi/emails_in_a_different_language/"
    },
    {
        "id": "1iosq90",
        "author": "Weak-Inspector4382",
        "title": "Bodies : Uniqueness in storytelling and why It is a perspective I never guessed",
        "content": "This series I witnessed holds a perspective I ached for a while. Every time I watched a series with varying timelines, the best of them gave me a satisfying ending but this one got me rethinking those endings and the overall storyline and the linear timeline of it all. This is one unique watch that focuses on filling the gaps regardless of the good vs evil debate I had in my mind accustomed to previous watches. Those of you, if had watched, Please confirm this{And sorry to rely on reddit for this (and believe you me I am not googling this trivia)}, I have a strong belief the lead is in Pirates of the Caribbean!",
        "upvotes": 13,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iosq90/bodies_uniqueness_in_storytelling_and_why_it_is_a/"
    },
    {
        "id": "1ioug3i",
        "author": "thenicepunk",
        "title": "House MD subtitles bug",
        "content": "I'll explain myself, i'm french and i'm currently watching House MD in original version with subtitles and i noticed that, every two episodes the style of the subtitles is changing. Like, on S1 Ep 4 i'm having the normal Netflix subtitles, then on the next episode, i'm having the subtitles with a black background. I tried to change the subtitles but it's not working. \n\nDoes anybody has the same problem ? (I hope everybody understand what i wrote, English is not my first language sry guys)",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ioug3i/house_md_subtitles_bug/"
    },
    {
        "id": "1ioocjg",
        "author": "MysteriousDelay6266",
        "title": "Ransom Canyon | Official Teaser | Netflix",
        "content": "",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ioocjg/ransom_canyon_official_teaser_netflix/"
    },
    {
        "id": "1ionxrt",
        "author": "dil-dil-dil",
        "title": "A Second-Watch Feature: Backstory Snippets for Cryptic Scenes",
        "content": "What if Netflix introduced a feature that unlocks only during your second watch? Similar to Amazon’s X-Ray, but instead of showing cast details, it provides backstory snippets or explanations for cryptic or subtle scenes.\n\nFor example, during a rewatch of shows like Dark, The OA, or Black Mirror, key moments could trigger contextual insights—like the backstory of a mysterious item, the significance of a subtle gesture, or how a scene foreshadows later events. These would only appear on a second watch, so the first viewing experience remains unspoiled.\n\nThis would make rewatching feel fresh and rewarding, offering fans new layers of depth while encouraging even more buzz around Netflix originals.\n\nWould this feature enhance your rewatch experience?",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ionxrt/a_secondwatch_feature_backstory_snippets_for/"
    },
    {
        "id": "1iov745",
        "author": "ImActuallyAnOG",
        "title": "Is Mob Psycho 100 Season 3 ever coming to Netflix?",
        "content": "so mob psycho 100 s1 and s2 are on on netflix. (i am in the united states) but where is s3 i know its been out for a while so why isn’t it on netflix? does anyone know why/when it will come to netflix, if ever.\n\nThanks in advance!",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iov745/is_mob_psycho_100_season_3_ever_coming_to_netflix/"
    },
    {
        "id": "1io8wzo",
        "author": "Somethingman_121224",
        "title": "Netflix’s New Thriller Based on 'The Boys from Brazil' Casts Jeremy Strong",
        "content": "",
        "upvotes": 56,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1io8wzo/netflixs_new_thriller_based_on_the_boys_from/"
    },
    {
        "id": "1iouzm8",
        "author": "EffReddit420",
        "title": "Looking for a movie to watch up to 2 hours",
        "content": "Ill be on a bus ride for 2-3hrs and i want to watch one last movie before basic training. Preferably action/adventure type. \n\nSome movies i have seen and liked\n\n\nSeven Kings must Die\nCarry On\nArmy of Thieves (and the dead) \nDamsel\nGunpowder Milkshake\nBack In Action \nThe Old Guard\n6 Underground \nPolar\nDont Move\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iouzm8/looking_for_a_movie_to_watch_up_to_2_hours/"
    },
    {
        "id": "1io6lg5",
        "author": "Cold_Reference_3497",
        "title": "Kinda Pregnant",
        "content": "I’m ngl it’s not like I expected something amazing and original from an Amy Schumer movie but when I tell you this movie is a carbon copy of Lindsay Lohan’s Labor Pains from the early 2000’s it’s insane 😭 don’t get me wrong I know this shit happens all the time but they’re so similar it’s like atp use the same name and call it a remake. ",
        "upvotes": 40,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1io6lg5/kinda_pregnant/"
    },
    {
        "id": "1iol9z4",
        "author": "peoplemagazine",
        "title": "Last Chance U Subjects Claim They Weren’t Paid and Were ‘Taken Unfair Advantage of’ by Netflix Series in Lawsuit",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iol9z4/last_chance_u_subjects_claim_they_werent_paid_and/"
    },
    {
        "id": "1iobbp7",
        "author": "jokerfest",
        "title": "Aftermath at number 1?",
        "content": "Okay, I didn't have a lot of time this evening so I just clicked it. It's the most watched movie, it can't be horrible, right?\n\nHow is this movie at number one? This movie is so bad. I could tell right away, but I had to keep watching. Have you watched it? Am I wrong? ",
        "upvotes": 15,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1iobbp7/aftermath_at_number_1/"
    },
    {
        "id": "1iofwb3",
        "author": "BethCab4Cutie",
        "title": "Recommendations for shows similar to Love Next Door",
        "content": "I watched Hometown Cha-Cha-Cha shortly after its release on Netflix and just finished Love Next Door. I'm wanting another kdrama with a similar vibe to both. Cozy, small town, heartwarming, happy ending. Any suggestions? :)",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iofwb3/recommendations_for_shows_similar_to_love_next/"
    },
    {
        "id": "1iovddg",
        "author": "WarmHighway5349",
        "title": "recommend me a show to watch while im eating :))",
        "content": "i’m writing this super fast as i have a sandwich waiting for me lol but i rlly want to start watching a good show! any genre is fine by me as long as it’s in english, i’m willing to be \nadventurous this one time :))",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1iovddg/recommend_me_a_show_to_watch_while_im_eating/"
    },
    {
        "id": "1ioyq7j",
        "author": "Canada-t157t",
        "title": "Imagine if cobra kai got abruptly cancelled after the conclusion of season 2?",
        "content": "remember the time a little before covid-19, the series was not getting renewed on youtube red. And people thought this was it. But what if netflix never picked it up? i think that would have been depressing considering how season 2 ended, it would have sucked. having the season end on a cliffhanger, and then having the series cancelled like firefly and spectacular spider-man would have been terrible.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ioyq7j/imagine_if_cobra_kai_got_abruptly_cancelled_after/"
    },
    {
        "id": "1iod7q8",
        "author": "Internal_Idea_5554",
        "title": "Somebody changed my email adress on Netflix",
        "content": "Hello! Somebody has changed my email adress on netflix. I cant change the password or anything. Tha links on their website doesnt work for me. On chat, they said to help myself and sent a link. What can i do?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iod7q8/somebody_changed_my_email_adress_on_netflix/"
    },
    {
        "id": "1iol8ff",
        "author": "MysteriousDelay6266",
        "title": "Tyler Perry’s Beauty in Black | Part 2 Official Trailer | Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iol8ff/tyler_perrys_beauty_in_black_part_2_official/"
    }
]