[
    {
        "id": "1kfbpxz",
        "author": "NeighborhoodWatchAMA",
        "title": "Hi /r/movies! I'm Duncan Skiles, director of NEIGHBORHOOD WATCH (starring Jack Quaid and Jeffrey Dean Morgan). It's out now on VOD via RLJE Films. I also directed 2018's THE CLOVEHITCH KILLER. Ask me anything!",
        "content": "Hey reddit, Duncan here. I'm the director of NEIGHBORHOOD WATCH (out now, starring Jack Quaid and Jeffrey Dean Morgan) and 2018's CLOVEHITCH KILLER (starring Dylan McDermott, Charlie Plummer, Samantha Mathis) which was inspired by the story of the real-life BTK Killer.\n\nFeel free to ask me any questions. I'll be back at 7 PM ET for answers.\n\n  \nMore information about the film:\n\n  \nNeighborhood Watch is a 2025 American crime thriller film written by Sean Farley and directed by Duncan Skiles, starring Jeffrey Dean Morgan, Jack Quaid, Cecile Cubiló, Jim Klock, and Malin Akerman. The story follows Simon, a mentally ill young man, who thinks he witnessed a woman being abducted. He gets his neighbor Ed, a retired security guard, to help him find the missing woman.\n\nThe film was released on video on demand and in theaters on April 25, 2025, by RLJE Films.\n\nTrailer:\n\n[https://www.youtube.com/watch?v=U-ACHHn8VvY](https://www.youtube.com/watch?v=U-ACHHn8VvY)\n\n  \nTalk to you all later! Ask me anything.",
        "upvotes": 38,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lyy52njotyye1.png?auto=webp&amp;s=d8e3afc659d0e501e26607d54ac15fdafcfa1a9c"
        },
        "permalink": "/r/movies/comments/1kfbpxz/hi_rmovies_im_duncan_skiles_director_of/"
    },
    {
        "id": "1kfo6ll",
        "author": "SanderSo47",
        "title": "May 2-4 Box Office Recap: 'Thunderbolts*' debuts with a solid $74.3 million domestically and $160.4 million worldwide. Meanwhile, 'Sinners' crosses $200 million worldwide, while 'A Minecraft Movie' nears $900 million worldwide.",
        "content": "https://preview.redd.it/wngz60kwb1ze1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=7c1eddccb860443e3e769a9c792de4692c33d63c\n\nWell, the summer season is officially underway.\n\nThe MCU returned to the first weekend of May, earning another #1 spot with ***Thunderbolts***. Which hopefully will be a sign of good legs ahead. Meanwhile, ***Sinners*** had another incredible hold, despite losing IMAX and other premium-large formats.\n\nThe Top 10 earned a combined $142.3 million this weekend. That's up a massive 108.2% from last year, when ***The Fall Guy*** flopped and delivered the worst start to the summer season in decades.\n\nDebuting on top, Marvel Studios' ***Thunderbolts*** earned $74.3 million in 4,330 theaters. That's below ***Captain America: Brave New World*** ($88.8 million), which premiered on February. Compared to other MCU titles, that's below ***Ant-Man and The Wasp*** ($75.6 million) and ***Shang-Chi and the Legend of the Ten Rings*** ($75.3 million) and above ***Eternals*** ($71.2 million).\n\nAll in all, this is a solid (but not fantastic) debut. At the end of the day, it's a team-up film following secondary characters that aren't very popular, with the exception of Bucky and Yelena. Marvel probably wasn't expecting this film to open at $100+ million, considering ***Brave New World*** didn't get that with a more well known character. ***Thunderbolts*** only had one hook: the introduction of Sentry. There's also curiosity surrounding the meaning behind the asterisk in the title (we'll get to that in a moment).\n\nMarvel knows that audiences haven't been fully on board with some of their previous projects (***Quantumania***, ***The Marvels***, ***Brave New World***, etc.), but they still hoped the audience could be interested in ***Thunderbolts***. To the point that one of its trailers highlighted the crew's involvement in multiple projects (most of which were A24). Well, the crew's involvement at least resulted in some great reviews (88% on RT). Not to mention the fact that back in March, Marvel confirmed that a lot of cast members from the film would be back in ***Avengers: Doomsday*** next year. While that spoiled the fate of the characters, it might have helped boost interest.\n\nAccording to Disney, 65% of the audience was male. Marvel has had a problem in attracting younger audiences, and this film is another proof of that: only 30% of the audience was under 25. What does this mean? That they're losing ground with Gen Z. This has been noted a few years, and it doesn't look like it will be fixed any time soon.\n\nIn some good news, the audience gave the film an \"A–\" on CinemaScore. That represents a solid response from the audience, although the MCU mostly falls in the \"A\" score. At the very least, that's better than ***Brave New World***'s poor \"B–\". There's no competition over the coming weeks, although ***Final Destination: Bloodlines*** will probably dethrone it in its third weekend. We'll see how it goes, but for now, a final total around $200 million is likely for ***Thunderbolts***.\n\nMarvel didn't even wait until the second week just to finally confirm on social media the meaning of the asterisk in the title. Just today, they've started promoting the film [under a new title](https://variety.com/2025/film/news/thunderbolts-poster-the-new-avengers-title-change-1236386731/) (big spoilers in that article). That's a bit too early, but will the audience be more interested in the film now?\n\nEven with the arrival of ***Thunderbolts*** and losing IMAX and other formats, ***Sinners*** was not affected in the slightest. The film dipped just 28% this weekend, adding another $33.1 million. That's almost on par with ***Get Out***'s third weekend drop (26.5%), which is simply insane. The film has earned a fantastic $179.8 million domestically, and it should continue legging out. For now, the film should hit $270 million domestically. The fact that it's getting close to $300 million is simply spectacular.\n\n***A Minecraft Movie*** dropped 40%, adding $13.7 million this weekend. One thing on its favor was [the \"rowdy screenings\" for this weekend.](https://www.hollywoodreporter.com/movies/movie-news/minecraft-movie-block-party-edition-1236202463/) Have theater employees in your hearts, for this might have been a very ugly experience. The film has earned $398.2 million so far.\n\nWell, the math is out and the numbers aren't good for ***The Accountant 2***. The film earned $9.4 million, which is a very poor 61% drop from last week. In contrast, the original dropped just 44.8%. Through 10 days, the film has earned just $41.1 million, which is $6 million below the original through the same point. That gap will continue to widen. For now, the film should finish with around $60 million domestically.\n\n***Until Dawn*** won't see a sunrise any time soon. The film dropped 52%, adding $3.8 million this weekend. That's not a horrible drop for a horror, but considering how low it began, it's simply unremarkable to make a difference. Through 10 days, the film has earned $14.3 million, and it only has one weekend before facing tough competition with ***Final Destination: Bloodlines***.\n\nIn sixth place, ***The Amateur*** dropped 48%, earning $1.9 million. That takes its domestic total to $37 million, and while it should cross $40 million, it won't be by much.\n\n***The King of Kings*** continues losing steam. This weekend, it collapsed another 59%, earning $1.7 million. The film has earned $57.7 million so far, and it won't make it much further than $60 million.\n\nA24's ***Warfare*** dropped 52%, adding $1.2 million this weekend. The film's domestic total stands at $24 million so far.\n\nIn ninth place, the Indian film ***HIT: The Third Case*** earned $955,000 in 950 theaters.\n\nRounding up the Top 10 was another Indian film, ***Guru Nanak Jahaz***. Despite playing in just 119 theaters, it earned $685,000 this weekend.\n\nOutside the Top 10, we find Nicolas Cage's new film, ***The Surfer***. Unsurprisingly, it didn't fare well. It made just $698,114 from 884 theaters. It's not gonna last long on theaters, so hurry up.\n\nA24's ***The Legend of Ochi*** fell outside the Top 10. It collapsed a brutal 76% this weekend, earning just $341,951. The film has earned a meager $2.1 million so far.\n\n#**OVERSEAS**\n\n***Thunderbolts*** also topped the overseas box office, debuting with $86.1 million abroad, for a $160.4 million worldwide debut. That's below ***Brave New World*** ($193.4 million), although that had an extra day on Monday. It was a mixed bag all around; some were pretty good, but others were soft. The best markets were China ($10.4M), UK ($7.7M), Mexico ($7.3M), Brazil ($4M), France ($3.8M), Germany ($3.6M), Korea ($3.5M), Australia ($3.4M), Japan ($3.2M) and Spain ($2.8M). Some of these markets were also boosted from local holidays (Labor Day). We'll wait for the second weekend to see if it has a chance of recouping its $180 million budget.\n\n***A Minecraft Movie*** added $26.6 million, taking its worldwide total to $874.6 million. The best markets are the UK ($69M), Germany ($35.7M), Australia ($33.5M), Mexico ($31.2M) and China ($27.5M). It's still fighting to hit the $1 billion milestone.\n\n***Sinners*** is also holding very well overseas, adding $10.4 million, for a $237.3 million worldwide total. The best markets are the UK ($13.8M), France ($6.7M), Australia ($4.3M), Mexico ($3.4M) and Germany ($2.7M). It's obviously going to skew domestically, but it looks like it could get close to $100 million overseas by the end of its run.\n\n***The Accountant 2*** added $7.2 million overseas, for a $66.3 million worldwide total. Ouch, that's not actually great. Or good at all. It should still hit $100 million worldwide, but it feels like it should've done that without problem.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Black Bag* | Mar/7 | Focus Features | $7,607,250 | $21,474,035 | $39,284,035 | $50M\n*The Day the Earth Blew Up: A Looney Tunes Movie* | Mar/14 | Ketchup | $3,158,830 | $8,875,344 | $13,896,775 | $15M\n*The Woman in the Yard* | Mar/28 | Universal | $9,395,255 | $22,405,985 | $23,175,286 | $12M\n\n- \"Make a good original movie and people will watch it.\" Yeah, where were you when ***Black Bag*** played in theaters? Steven Soderbergh's film earned critical acclaim, but it has ended its run with just $39 million worldwide. How frustrating, isn't it? A film that deserved much better. Don't cry for Soderbergh tho; he has just recently said that Focus Features confirmed that the film would eventually be profitable thanks to home media and PVOD. He also recently said that his new film ***The Christophers*** has wrapped filming and could come out this year. Damn, 3 Soderbergh films in a year????\n\n- That's all, folks. ***The Day the Earth Blew Up: A Looney Tunes Movie*** has closed with $13 million worldwide, failing to recoup its $15 million budget. But maybe Ketchup Entertainment is content with its performance, considering they just spent $50 million in buying ***Coyote vs. Acme***, which will come out next year. Let's just hope it fares better than this.\n\n- Universal/Blumhouse's ***The Woman in the Yard*** has closed its run with just $23 million worldwide. That's the second flop in a row for Blumhouse, after the unremarkable run of ***Wolf Man*** back in January. Not to mention ***Drop*** is fading quickly. What's going with Blumhouse?\n\n#**THIS WEEKEND**\n\nNothing lol. For some reason, studios avoided releasing anything noteworthy. The only major release is Lionsgate's ***Shadow Force***, but that has no chance of hitting #1. Probably not even Top 5.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 492,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Iw9byx2wC2SG6Ob24wOxVxQMBj4MpG4-PNO_KDdWCws.png?auto=webp&amp;s=c462741f51ece1ce0db8ed6b07cfb41372f08911"
        },
        "permalink": "/r/movies/comments/1kfo6ll/may_24_box_office_recap_thunderbolts_debuts_with/"
    },
    {
        "id": "1kfo1o1",
        "author": "MarvelsGrantMan136",
        "title": "‘The Toxic Avenger’ Is Officially UNRATED for Ultra Violence, Mutant Nudity, and More",
        "content": "",
        "upvotes": 4487,
        "comments": 310,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/T9qvM8ayvSFtsD6loxrCsFtGtdkLHYwAQpgqbJonVrY.png?auto=webp&amp;s=7b9db109886878cef37dd1b3cb636ec1fa13d5ad"
        },
        "permalink": "/r/movies/comments/1kfo1o1/the_toxic_avenger_is_officially_unrated_for_ultra/"
    },
    {
        "id": "1kfhlk6",
        "author": "Lulcielid",
        "title": "A24’s $3.5B Valuation Pushes the Indie Studio Toward Blockbusters",
        "content": "",
        "upvotes": 7367,
        "comments": 436,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oeN1A_tY-KvZWMgFukOMTWGwvjs8JU-gOlqjVdI3QxY.jpeg?auto=webp&amp;s=88d61fdc6ecb327f44b644c64cd8094f544cdc3c"
        },
        "permalink": "/r/movies/comments/1kfhlk6/a24s_35b_valuation_pushes_the_indie_studio_toward/"
    },
    {
        "id": "1kfvu00",
        "author": "FunShorts",
        "title": "What movie has the most \"all-star\" cast, all time?",
        "content": "\nWhat movies most come to mind when thinking of movies with the most big names?\n\nNot necessarily saying each star has to have a large role, just a credit in the movie.\n\nAny era, even if it was before someone became a big star.\n\nThe 2000s Oceans movies come to mind for me. Also, The Godfather movies, where it's possible Part 2 has more names due to De Niro being in that one.",
        "upvotes": 283,
        "comments": 638,
        "media": null,
        "permalink": "/r/movies/comments/1kfvu00/what_movie_has_the_most_allstar_cast_all_time/"
    },
    {
        "id": "1kff7vp",
        "author": "MarvelsGrantMan136",
        "title": "TOGETHER - Official Trailer - In Theaters July 30",
        "content": "",
        "upvotes": 1318,
        "comments": 123,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/caG3Ma6bnqSJY7E8kZZVgtcOViyj_e83DxF_t0BJl2g.jpg?auto=webp&amp;s=12f679c51eae2938754882e4a2037f84c43db5a8"
        },
        "permalink": "/r/movies/comments/1kff7vp/together_official_trailer_in_theaters_july_30/"
    },
    {
        "id": "1kfb18m",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Spike Lee's 'Highest 2 Lowest' Starring Denzel Washington",
        "content": "",
        "upvotes": 2096,
        "comments": 288,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9asi3dvooyye1.jpeg?auto=webp&amp;s=f53a633528ce7c214ff918a10d07644b8fd53dfa"
        },
        "permalink": "/r/movies/comments/1kfb18m/official_poster_for_spike_lees_highest_2_lowest/"
    },
    {
        "id": "1kfl8f3",
        "author": "ADAP7IVE",
        "title": "What's a movie quote you regularly use in daily life? I'll start",
        "content": "One of mine is from Ocean's Twelve. Brad Pitt's Rusty: \"In the physical universe that we occupy, it cannot be done.\"\n\nTo this day, no one has noticed. Might be because Ocean's Twelve is generally considered a meh film. 😅\n\nI'm curious what quotes have snuck their way into your lexicon, from popular or obscure films.\n\nETA: \n\"I have no responsibilities here whatsoever\" from A Few Good Men\n\n\"Fuck you, Mars\" and \"I am going to have to science the shit out of this\" from The Martian.\n\n\"Mr. Hammond, I think we're back in business.\" - Sattler in JP\n\n\"[Are you ready?] Let's find out.\" From X Men First Class\n\n\"What, like it's hard?\" -Elle in Legally Blonde\n\n\"Okey dokey,\" in Hannibal Lecter voice, from Hannibal.",
        "upvotes": 497,
        "comments": 1403,
        "media": null,
        "permalink": "/r/movies/comments/1kfl8f3/whats_a_movie_quote_you_regularly_use_in_daily/"
    },
    {
        "id": "1kfd1i4",
        "author": "MarvelsGrantMan136",
        "title": "Rina Sawayama to Reprise Role as Akira in Donnie Yen’s ‘John Wick’ Spinoff ‘Caine,’ Lionsgate Launching Sales in Cannes",
        "content": "",
        "upvotes": 1118,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8GGlnxrRCullDK_2P44hINhTd-J7taTcKxcpgEctS3w.jpg?auto=webp&amp;s=6be813e930ea4654f10dfa0437a9e42bfe960c20"
        },
        "permalink": "/r/movies/comments/1kfd1i4/rina_sawayama_to_reprise_role_as_akira_in_donnie/"
    },
    {
        "id": "1kfvr7d",
        "author": "Suspicious_Abroad484",
        "title": "Final released Tony Todd flick - shot in 2005, film thought missing or destroyed.  Negatives found and released 5/1/2025",
        "content": "Just starting it.  Enjoy!\n\n[Cutter's Club on TUBI](https://tubitv.com/movies/100039678/cutter-s-club)\n\n[IMDB - no reviews yet](https://www.imdb.com/title/tt36727311/?ref_=nm_flmg_job_1_cdt_c_1)\n\nHorror icon [Tony Todd](https://www.imdb.com/name/nm0865302/?ref_=ttpl) stars in this \"lost\" Full Moon film, a gory sci-fi-fueled horror/thriller from director [Charles Band](https://www.imdb.com/name/nm0023929/?ref_=ttpl) that sees a pair of young student doctors getting involved in a secret society of surgery fetishists and monster makers called the \"Cutters Club\", overseen by the maddest of doctors. Creatures, carnage, mayhem and macabre malpractice combine in this maniacal movie, brought back from the brink of oblivion to take its rightful place as Todd's fevered cinematic swan song.\n\nRIP Candy Man",
        "upvotes": 72,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uwwznTmkpZSOKkbYKPATu7eYhZgP8mvZ0-Tk4AgLGk0.jpg?auto=webp&amp;s=5a0ca4b5701f281e37847e96efdc308e4376333e"
        },
        "permalink": "/r/movies/comments/1kfvr7d/final_released_tony_todd_flick_shot_in_2005_film/"
    },
    {
        "id": "1kfmtnr",
        "author": "NoCulture3505",
        "title": "Chris Pine to Lead Action Film ‘Run the Night’ for Lionsgate and Hidden Pictures, Sales Launching in Cannes",
        "content": "",
        "upvotes": 203,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lr_SvSjtTfArwmrnNvSmqOXngBwyoBLqg3dXwybquso.jpg?auto=webp&amp;s=a41ecd083bc1cac5118a710ba9e1bb1c7b855138"
        },
        "permalink": "/r/movies/comments/1kfmtnr/chris_pine_to_lead_action_film_run_the_night_for/"
    },
    {
        "id": "1kfye80",
        "author": "TrueEntertainment933",
        "title": "What's a perfect movie that you would not change a single frame of ?",
        "content": "Not necessarily the best movie ever - but that one film where, every time you rewatch it, you think: Yep, they nailed it. Could be for emotional impact, pacing, cinematography, even nostalgia. For me, it's Before Sunset. Just two people walking and talking, but it's so precise and raw that I would not change a second of it. Curious what movie you think is perfect exactly as it is - no edits, no updates, no director's cut needed.",
        "upvotes": 23,
        "comments": 213,
        "media": null,
        "permalink": "/r/movies/comments/1kfye80/whats_a_perfect_movie_that_you_would_not_change_a/"
    },
    {
        "id": "1kfmbcu",
        "author": "queen-adreena",
        "title": "One word movie titles that don’t exist",
        "content": "With thousands of films released every year, I was wondering if all the single (real) word movie titles have been taken already. \n\n- No non-English words\n- No proper nouns\n- Have to have been used in English speech at some point \n- No words that couldn’t reasonably be published on a poster\n\nIf you’ve got any ideas, what would your movie be about?\n\nGive us a quick plot summary of your movie. ",
        "upvotes": 174,
        "comments": 400,
        "media": null,
        "permalink": "/r/movies/comments/1kfmbcu/one_word_movie_titles_that_dont_exist/"
    },
    {
        "id": "1kfcimt",
        "author": "EbmocwenHsimah",
        "title": "Highest 2 Lowest - Teaser Trailer",
        "content": "",
        "upvotes": 510,
        "comments": 149,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lTgswy_4gEh6bJatOrGfPQJDslj0Hwor3KR1Vb7jj1c.jpg?auto=webp&amp;s=6aedef995023321a5bec2f60a19c1fef8fc7c1fc"
        },
        "permalink": "/r/movies/comments/1kfcimt/highest_2_lowest_teaser_trailer/"
    },
    {
        "id": "1kf6vtd",
        "author": "FilmWaffle-FilmForum",
        "title": "What movies pulled the ultimate “uno reverse” card?",
        "content": "Recently watched a movie called Stranger Darling (2023) expecting your typical run of the mill slasher. The non-linear storytelling made me think the guy was the serial killer, turns out it was the supposed “damsel in distress” the whole time. \n\nWhat other movies tricked you into believing something only to do a complete 180? ",
        "upvotes": 831,
        "comments": 676,
        "media": null,
        "permalink": "/r/movies/comments/1kf6vtd/what_movies_pulled_the_ultimate_uno_reverse_card/"
    },
    {
        "id": "1kfccgb",
        "author": "NoCulture3505",
        "title": "David O. Russell To Direct Robert De Niro &amp; Jenna Ortega In Pool Hustler Movie ‘Shutout’ For RK Films &amp; Black Bear – Cannes Market Hot Project",
        "content": "",
        "upvotes": 282,
        "comments": 132,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/r6KqdlRcFyBmGYmg3nb7w2gudrBR3Rqm0lWtsO785N0.jpg?auto=webp&amp;s=66e2c18a907d80ea6739d1c3e7a7915f3dc22759"
        },
        "permalink": "/r/movies/comments/1kfccgb/david_o_russell_to_direct_robert_de_niro_jenna/"
    },
    {
        "id": "1kfjbkg",
        "author": "indiewire",
        "title": "Steven Soderbergh’s Advice to First-Time Filmmakers",
        "content": "",
        "upvotes": 103,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/emhaNaLyfYxMbhoBQ4MLin6dNzU__41sI_dfLw7o5pY.jpeg?auto=webp&amp;s=452e5ea47314b8a9c73bc24dd5140f23d068b264"
        },
        "permalink": "/r/movies/comments/1kfjbkg/steven_soderberghs_advice_to_firsttime_filmmakers/"
    },
    {
        "id": "1kes7p8",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Tim Heidecker in 'Fior Di Latte' - A playwright, hooked on sniffing perfume to relive memories from an Italian vacation, spirals into obsession as his life falls apart.",
        "content": "",
        "upvotes": 7063,
        "comments": 339,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hlkq1hw1htye1.png?auto=webp&amp;s=ef9272576e1b0e3103f2a096c8960be4e34393a2"
        },
        "permalink": "/r/movies/comments/1kes7p8/first_image_of_tim_heidecker_in_fior_di_latte_a/"
    },
    {
        "id": "1kf1tav",
        "author": "today_okay",
        "title": "Are films becoming too literal and heavy-handed these days?",
        "content": "I read an interesting piece in The New Yorker by Namwali Serpell, where she points out a growing trend in movies toward excessive literalism, leaving little room for audiences to interpret meaning on their own. Films now seem to patronize viewers by relying on overly explicit metaphors and heavy-handed commentary. For instance, The Substance shows Demi Moore literally giving birth to her younger self through her back. She points out The Brutalist for visualizing its metaphors too explicitly: immigrants' lives being depicted as literally turned upside down and showing the American Dream as something that, \"literally fucks you.\" Did anyone else read it and just curious about thoughts about whether they feel that movies are spelling out symbolism instead of trusting the audience's intelligence.",
        "upvotes": 1547,
        "comments": 423,
        "media": null,
        "permalink": "/r/movies/comments/1kf1tav/are_films_becoming_too_literal_and_heavyhanded/"
    },
    {
        "id": "1kfn9rc",
        "author": "Admirable-Cat7434",
        "title": "People talk about Sandler performances in uncut gems and such but his character in funny people is amazing and overlooked.",
        "content": "Rewatching funny people right now currently on MAX! And Adam sandlers character is amazing. Full self awareness but also funny as any comedian would probably be in that situation. He also eventually takes full control of his past mistakes it seems and knows wrong from right. Anyone else feel this way about this movie? ",
        "upvotes": 57,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1kfn9rc/people_talk_about_sandler_performances_in_uncut/"
    },
    {
        "id": "1kfbgrw",
        "author": "cinefilucho",
        "title": "Paddington 2 turns eight this year. Do you think it deserves a place among the greatest family adventure films of all time?",
        "content": "What the title says, where does Paddington 2 rank among the greats like E.T., The Goonies, The Princess Bride or The Iron Giant? Do you think it has stood the test of time so far?\n\nI’d say it's definitely one of the best family adventure films to come out since the 2000s, so it certainly deserves a place in the conversation.",
        "upvotes": 166,
        "comments": 81,
        "media": null,
        "permalink": "/r/movies/comments/1kfbgrw/paddington_2_turns_eight_this_year_do_you_think/"
    },
    {
        "id": "1kfaqls",
        "author": "JazzlikeTea7432",
        "title": "Who is the most forgotten 80s celebrities that was amazing or they are just completely not well remembered?",
        "content": "In my opinion I think Bo Derek is forgotten I didn't even know who she was until this year when I was watching the film Tarazan the ape man 1981 who I never even heard of her and I checked her up and realised some people forgotten about her.\n\nAnother one was Kelly Mcgillis is nowadays completely forgotten but some of you would still remember her from Top Gun, The Accused and the other film Witness with Harrison Ford. But she was never asked back in Top Gun Maverick like she aged a lot and left Hollywood forever. \n\nJennifer Beals who is known for Flashdance 1983 film, she was huge that time but nowadays she has been forgotten. Even now generation wouldn't know Jami Gertz but if you was in the 80s you probably remember her from the lost boys, Sixteen Candles and others but nowadays she retired and she is a million, but I don't think she is well remembered that well as soon as you see her face bow compared to the 80s where you would recognise her well.\n\nWell can you guys think of more 80s celebrities that are completely forgotten as you watch them again and some others you recognise their face, but didn't know their name from a classic 80s film as you searched them up. Well any suggestions about this?",
        "upvotes": 179,
        "comments": 622,
        "media": null,
        "permalink": "/r/movies/comments/1kfaqls/who_is_the_most_forgotten_80s_celebrities_that/"
    },
    {
        "id": "1kfozev",
        "author": "AvailableReality557",
        "title": "What makes Tony Montana’s rise and fall arc still so captivating, even when we know he’s a monster? Is it just Pacino’s raw magnetism, or is Scarface a darker reflection of our own fascination with power and downfall?",
        "content": "I’ve always found it fascinating how Scarface remains a cultural touchstone, decades later, not because Tony Montana is likable, but because he embodies the twisted American Dream ambition without brakes, loyalty tainted by paranoia, and a hunger that can never be satisfied. Why do we still idolize Tony despite knowing he’s a doomed figure? Is it Pacino’s brilliance, or something deeper about our obsession with excess and destruction?",
        "upvotes": 26,
        "comments": 69,
        "media": null,
        "permalink": "/r/movies/comments/1kfozev/what_makes_tony_montanas_rise_and_fall_arc_still/"
    },
    {
        "id": "1kfg2xb",
        "author": "schnauzersisters",
        "title": "Susan Sarandon, Everly Carganilla &amp; Aubrey Plaza Starring In Zach Woods’ Film Directing Debut ‘The Accompanist’",
        "content": "",
        "upvotes": 65,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KE0_bvqfqe1oKEXx7-RYTFqbSXWM4LyE_eOfTX-tmzo.jpg?auto=webp&amp;s=4aa4d337124031e4fc27a3a5fdd471aff15a486d"
        },
        "permalink": "/r/movies/comments/1kfg2xb/susan_sarandon_everly_carganilla_aubrey_plaza/"
    },
    {
        "id": "1kfenfp",
        "author": "Pleasant_Garlic8088",
        "title": "People they've never made a biopic about, but they should",
        "content": "Pretty simple, who have they never made a biopic about that you think they really should?\n\nI'll acknowledge I'm from Boston, so I'm a little biased, but I was checking out another post in r/baseball about recommendations for good baseball movies and it occurred to me they should make a movie about Ted Williams.  Not only was he the greatest hitter who ever played the game, he fought in two wars.  There's gotta be a story worth telling somewhere in there.  Plus, we all know how much Hollywood loves a good \"Boston Movie.\"  Just please don't let Ben Affleck play him.\n\nMaybe his life isn't controversial enough for a film?  Maybe there aren't enough movie goers left from age groups that would care enough to go see it?  I know I would, though.\n\nSo who is your choice for someone that never had a biopic made about them, but you think it'd be a pretty good movie if they did?",
        "upvotes": 69,
        "comments": 413,
        "media": null,
        "permalink": "/r/movies/comments/1kfenfp/people_theyve_never_made_a_biopic_about_but_they/"
    },
    {
        "id": "1kewtab",
        "author": "BunyipPouch",
        "title": "Chloë Sevigny Pitched Herself to Luca Guadagnino to Play Jean (Patrick Bateman’s Secretary) Again in New ‘American Psycho’ Film",
        "content": "",
        "upvotes": 1420,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kc9gusKjU34ghTDefjPcB1za1e7F0_aVdlW2eTfnBaI.jpg?auto=webp&amp;s=3bc818dd139c2e6fec692b7bbbd0f2d97578d417"
        },
        "permalink": "/r/movies/comments/1kewtab/chloë_sevigny_pitched_herself_to_luca_guadagnino/"
    },
    {
        "id": "1kep590",
        "author": "ForeverBlue101_303",
        "title": "California, Once a Mecca for Animation Work, Is Rapidly Losing Ground, Report Claims",
        "content": "",
        "upvotes": 3804,
        "comments": 201,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-bCJr2z4oJZUxKnlIF0fN-sEAhvoLhtaWCpaWcAHLjg.jpg?auto=webp&amp;s=8a672f6ccb6737bdf0805ccf4a329b2c429a43e4"
        },
        "permalink": "/r/movies/comments/1kep590/california_once_a_mecca_for_animation_work_is/"
    },
    {
        "id": "1kfm4dq",
        "author": "Davis_Crawfish",
        "title": "\"The Glass House\" (2001): When you have Stellan Skarsgaard and Diane Lane for foster parents, run. Fun Thriller.",
        "content": "I love this movie, even though it flopped and got bad reviews. But do I care? No. I felt engrossed by the story and Leelee Sobieski made her character believable and likably engrossing. You want her to survive her unfortunate circumstances. \n\nAnd how can you hate a movie with Stellan Skarsgaard as a sleazy psychopath creeping on his niece and Diane Lane as his drug-addicted wife/accomplice? And set in a chic glass house. It's a Lifetime TV Movie with better production values. \n\nYes, the film is often ludicrous and often unintentionally funny. I mean, the plagiarized homework, Diane Lane having a drug overdose while watching cheesy home videos? I was hollering!!!!",
        "upvotes": 23,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1kfm4dq/the_glass_house_2001_when_you_have_stellan/"
    },
    {
        "id": "1kfzw63",
        "author": "FilmWaffle-FilmForum",
        "title": "What is the greatest female villain performance of all time?",
        "content": "When the question of “what is the greatest villain performance of all time” comes up, people tend to list the same actors. I very rarely see any female villain performances mentioned. \n\nFirst one that comes to mind is Allison Williams in Get Out. She played a sadistic, manipulative villain to an absolute T. ",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1kfzw63/what_is_the_greatest_female_villain_performance/"
    },
    {
        "id": "1kfpajm",
        "author": "Human-Gap-1054",
        "title": "What are your best and worst movie trailers",
        "content": "I almost skipped catching Sinners in the theatre because the trailer was so bad. It made me think about how much a trailer can make or break a movie, especially at the box office. What are your favourite examples of good trailers and bad trailers. \n\nEspecially if there are good trailers for bad movies and vice versa. Those ones are the most entertaining.",
        "upvotes": 13,
        "comments": 80,
        "media": null,
        "permalink": "/r/movies/comments/1kfpajm/what_are_your_best_and_worst_movie_trailers/"
    },
    {
        "id": "1kezfs7",
        "author": "AaronRodgersVaxCard",
        "title": "What’s a movie you want a sequel to but know you’ll never get?",
        "content": "Mine is and always will be BASEKETBALL. Even with Zucker not producing and directing anymore, Matt and Trey have proved to be smart enough to take on satire of anything and make it worthwhile. Plus they’re actually sports fans so you know they know about all the scandals that have been happening across all sports that are ripe for parodying.",
        "upvotes": 679,
        "comments": 1285,
        "media": null,
        "permalink": "/r/movies/comments/1kezfs7/whats_a_movie_you_want_a_sequel_to_but_know_youll/"
    },
    {
        "id": "1kf0a6f",
        "author": "_kevx_91",
        "title": "Two years late but finally got around watching They Cloned Tyrone and to me, it's the best racial satire to come out since Get Out.",
        "content": "\n\nThe whole premise is bonkers but so clever it how it serves as a metaphor for how ethnic minorities, black people in this case, are utilized as drones of consumption and how this perpetuates negative stereotypes (e.g. Fried chicken, obsession with hair products, selling drugs, etc.). It shows how to be critical of those consumer goods we're obsessed with. What makes us feel good or \"look cool\" to others isn't necessarily good for us. \n\nI also love the point it made when Fontaine almost gave up and accepted his fate as a mere clone living in a vicious cycle. Even after people figure out the trap, that knowledge alone won't keep you from falling into it again and again. We might be products of our environment and even our genetics, but at the end of the day, we have free will, and it's up to us to break free from the cycle we are stuck in.\n\n\nI myself am Latino (Puerto Rican to be exact) and I feel like many points made in the film apply to my culture as well. In recent years, Puerto Rican culture has become a bit more known internationally, thanks to things like Bad Bunny and the Despacito song. While there is nothing wrong with people being curious of and being entertained by the culture, there is also a concerted effort to perpetuate pretty offensive and harmful stereotypes about my people: From sexual promiscuity thanks to reggaeton music to the idea that we all live in slums next to the beach. And many fellow Puerto Ricans end up internalizing these stereotypes and thinking it makes us \"cool\". \n\nThe film just really spoke to me this way, and feel it even applies to other ethnicities or minority groups. Great film. It was like Us, but actually good. Also had no idea Boyega had such range in acting. He was phenomenal.",
        "upvotes": 561,
        "comments": 35,
        "media": null,
        "permalink": "/r/movies/comments/1kf0a6f/two_years_late_but_finally_got_around_watching/"
    }
]