[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 50,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1r8m788",
        "author": "Pluckyplatypus26",
        "title": "Reality Check - Jay is also a villain",
        "content": "I feel like everyone is focusing on Tyra, and don’t get me wrong, she’s terrible. But Jay saying that Tyra wouldn’t talk to him off camera so he was being mentally tortured by having to work there for another season…. All while he’s watching teenage girls be actually mentally tortured. So out of touch. He’s at least getting paid to be there. He’s making a career out of it still. Those girls had no idea what they were signing up for.",
        "upvotes": 131,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1r8m788/reality_check_jay_is_also_a_villain/"
    },
    {
        "id": "1r8qjmd",
        "author": "RexiRocco",
        "title": "Tyra is proud of her “legacy”",
        "content": "NFLX ANTM doc. I said it. Not only is Tyra not sorry, she did not at any point go into this interview aiming to apologize for anything. She gave the network sky high ratings while being horrible to people and the network and every person involved in the edits that made it on-air enabled Tyra to continuously strive to be even more deranged than before. She made bank off controversy then and she’s making bank off controversy now. I believe her takeaway from ANTM is that controversy sells. I don’t believe she went into this documentary to reclaim her narrative. She went into it knowing she would create controversy and that the world would continue to buzz over her beloved show and that she would make a shit ton of money because of it. She does not care emotionally for anyone involved. I genuinely think she is proud, she feels smart, and she feels in full control. Tyra rage-baited us and is thriving off our continued buzz about her, her show, and this doc about her and her show. I would so badly love to read her deal memo.",
        "upvotes": 41,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1r8qjmd/tyra_is_proud_of_her_legacy/"
    },
    {
        "id": "1r8lwwj",
        "author": "bigmamachuddies",
        "title": "Reality Check: ANTM",
        "content": "Tyra started off wanting to do something great for models. \nBy the end, she had sold her soul for fame.\n\nI believe that ANTM could've been like Queer Eye. Bringing in wannabe models, coach them, learn about them, share their stories of how they got here, be their big sister, erase the \"vapid stereotype\", get them good contracts. Save them. \n\nIt could've even been like Shark Tank where some judges are still hardasses. \n\nInstead, she continued the trauma cycle. It's unbelievable. \n\nAnd she's unapologetic. Honestly, I feel like everyone just blamed it on the times and moved forward. So I know everyone is saying that the J's and Nigel were apologetic but I technically don't see that. Where's the direct \"I'm sorry for literally creating a hostile environment in multiple ways\" from any of them? \n\nLook, don't get me wrong, I like the J's and Nigel more than Tyra and I think that they did a little better than her in this doc, but they are not blameless either. \n\nAnd that dude? Ken? Equivalent to Tyra. Despicable!!!!!!!! ",
        "upvotes": 25,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1r8lwwj/reality_check_antm/"
    },
    {
        "id": "1r8mrw7",
        "author": "Glass-Pianist2491",
        "title": "\"The Rip\" hype is overblown",
        "content": "Maybe it's me but after watching it I felt the lack of realism on the many shooting events was head shaking. The writing was poor imo. It's set in Hialeah which it isn't a backwoods town, it's a dense urban/suburban major city in South Florida with over 220,000 residents. I'll cite one example of what I am referring to. How many rounds were shot into the house and outside yet not one call was ever made from any resident. Yeah, they said the homes in the short cul de sac were all stash houses or cartel owned but that kind of machine gun fire and # of rounds would be heard for blocks. Affleck &amp; Damon are the draw for sure but this was a B-movie compared to Affleck's \"The Town\", which was good but not great",
        "upvotes": 21,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1r8mrw7/the_rip_hype_is_overblown/"
    },
    {
        "id": "1r947cr",
        "author": "G48ST4R",
        "title": "Netflix reset my watch progress on Animal Kingdom across all devices",
        "content": "I was binge-watching Animal Kingdom and was on Episode 3 of Season 4. About a minute ago I opened Netflix on my Apple TV, and Animal Kingdom was no longer on my homepage. All the episodes are marked as unwatched, even though I am logged in with my account and using my profile.\n\nIt is also not an issue with my Apple TV, because I see the same problem in the Netflix app on my iPhone. \n\nWhat could have caused this? And why is it still not possible to mark episodes or entire seasons and shows as watched?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r947cr/netflix_reset_my_watch_progress_on_animal_kingdom/"
    },
    {
        "id": "1r92mtp",
        "author": "purpleflex4ever",
        "title": "Watched Too Much. Is Variations on Girls only thing Lena Dunham is capable of?",
        "content": "I didn't know much about it and watched it because Andrew Scott was in the thumbnail lol. I feel like every one of her work is just a Variation on Girls. Is that just the entirety of her world and experiences?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1r92mtp/watched_too_much_is_variations_on_girls_only/"
    },
    {
        "id": "1r92e1w",
        "author": "One-Performance-1270",
        "title": "Young Sheldon",
        "content": "I just finished this and it was so good but last season was so short why is that only 14 episodes \nNow suggest some more sitcom like this\nNot TBBT or Georgie and Mandy first marriage",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r92e1w/young_sheldon/"
    },
    {
        "id": "1r91j33",
        "author": "Eojte",
        "title": "I would love if netflix add this feature",
        "content": "im a big fan of anime bit I watch most of my anime on dub. The one thing I hate about certain dubs is that they dub the song in English aswell and it just sound terrible. There should be and audio choice for everything but the singing ro be dub and the songs remain in Japanese ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r91j33/i_would_love_if_netflix_add_this_feature/"
    },
    {
        "id": "1r9150c",
        "author": "Baapofmovies_123",
        "title": "‘The Night Agent’ Season 3 Review (2026) – Is This the Best Season Yet?",
        "content": "The Night Agent Season 3 is easily the most complete and confident season of The Night Agent so far. The season may not reach the prestige level of crime dramas like The Wire or Ozark, but it is executed well enough to stand comfortably alongside modern mainstream thrillers such as The Blacklist.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r9150c/the_night_agent_season_3_review_2026_is_this_the/"
    },
    {
        "id": "1r7r53d",
        "author": "TonyTaranteeno",
        "title": "Netflix is single-handedly ruining podcasts",
        "content": "The recent multi-year deals that Netflix made with all these podcasts is going to be the downfall of the podcasts. The podcast companies hold blame as well for being greedy. But this was a major miscalculation by both sides. Completely pulling the full content from YouTube, Apple etc to instead place it all on Netflix and only clips on the previous platforms was a bad move. I’m never gonna go to Netflix to watch a podcast. I’d rather just not watch the podcast. The numbers will reflect the sentiment because I know I’m not alone. ",
        "upvotes": 662,
        "comments": 227,
        "media": null,
        "permalink": "/r/netflix/comments/1r7r53d/netflix_is_singlehandedly_ruining_podcasts/"
    },
    {
        "id": "1r8zaha",
        "author": "flankermigrafale",
        "title": "POLL: Vote for the 3 series listed you most wish had not been cancelled!",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r8zaha/poll_vote_for_the_3_series_listed_you_most_wish/"
    },
    {
        "id": "1r8v6v2",
        "author": "Q_OpheliaV",
        "title": "Last Samurai Standing",
        "content": "Hey everyone 🤗 \n\nI recently discovered online that the second season will be filmed. I just wanted to ask whether it’s actually true as you imagine it, and if you’re as excited as I am about what’s going to happen. This idea is something that comes from people on the internet worldwide fans of manga and fans of series like Squid Game, Alice in Borderland, etc. I’m eagerly looking forward to your thoughts.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r8v6v2/last_samurai_standing/"
    },
    {
        "id": "1r8ubce",
        "author": "PLUSsignenergy",
        "title": "Another great series I recommend!",
        "content": "I am a huge fan of DARK, The Rain &amp; OA. \n\nI just watched “The Glass Dome,” a limited series from Sweden! It’s weirdly exciting! It s about a woman who visits her small town after her adopted mother passes away. Haunted by memories when she was kidnapped as a child! 8/10! ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r8ubce/another_great_series_i_recommend/"
    },
    {
        "id": "1r8tzze",
        "author": "guest2354672",
        "title": "Outer banks audio",
        "content": "It’s a fun show but Is it just me or does outer banks have bad audio mixing. It feels like the music is so loud but sound effects are not. And something about the audio just feels off. Character voices have a metallic sound and sometimes there is dirty bass but I see no one talking about it. Is the audio in this show bad or is it my sound system because other content like stranger things sounds much better.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r8tzze/outer_banks_audio/"
    },
    {
        "id": "1r8rfn5",
        "author": "Sufficient-Curve2951",
        "title": "Heartbreak High",
        "content": "Here's a quick recap of Heartbreak High Season 2 before the final season drops. So much happened in the second season and I almost lost track of everything but the final school fire was everything. Excited to see how the Hartley High students transition into adulthood, I am sure it will be equally chaotic lol. Drop your theories for S3\n\n[https://www.soapcentral.com/shows/ahead-heartbreak-high-season-3-here-s-recap-need-netflix-comedy-series-previous-chapter](https://www.soapcentral.com/shows/ahead-heartbreak-high-season-3-here-s-recap-need-netflix-comedy-series-previous-chapter)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r8rfn5/heartbreak_high/"
    },
    {
        "id": "1r93mon",
        "author": "Whiskeybaby22",
        "title": "So now I have to go buy a new console ?!",
        "content": "No longer available for ps3 is so crazy ?! Like I get it’s old but it still works great. Seems like just another thing to force you into spending money and consumerism 😫",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1r93mon/so_now_i_have_to_go_buy_a_new_console/"
    },
    {
        "id": "1r8p6c1",
        "author": "Substantial_Log_2244",
        "title": "Show shows up on google but I can't watch it nor look it up on netflix",
        "content": "so I wanted to watch Friendly Rivalry and when I looked it up on google, it showed me that it's on netflix. When I click on the site it shows as normal and there is a play button but when I click it, the ui3012 error shows up. When I tried to look it up on netflix another day to see if it will still show the error, I can't look the show up on netflix site or the app, but it's on google. I talked with a friend about it and she can look up and play the show as normal so what is happening and how can I fix it?\"}]}]}",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r8p6c1/show_shows_up_on_google_but_i_cant_watch_it_nor/"
    },
    {
        "id": "1r8olfy",
        "author": "RedClay9",
        "title": "Run Away was the parody all along",
        "content": "Before starting to watch Run Away I had recently watched Tim Robinson’s The Chair Company. I appreciate in retrospect how The Chair Company nails the trope of vigilante conspiracy mystery genre so well, while in absurdity, that it makes poorly executed earnest attempts at the same feel more than silly.\n\nI got through half the episodes when I thought, maybe the ridiculous &amp; unsatisfying ending of TCC is a sign that Run Away will end similarly, because how couldn’t it.  Reading some spoilers I feel like not seeing it through was the right move.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r8olfy/run_away_was_the_parody_all_along/"
    },
    {
        "id": "1r8niix",
        "author": "fledgling66",
        "title": "I would love a second season of Pressure Cooker",
        "content": "We just had so much fun watching one episode a night and I was crushed to see that there was only one season! \n\nThe show is three years old yet they still recommend it to people from the main page, so it couldn’t have been a complete flop. Let’s see season two please!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r8niix/i_would_love_a_second_season_of_pressure_cooker/"
    },
    {
        "id": "1r8mr0y",
        "author": "HRJafael",
        "title": "Netflix takes global rights to “Ticket to Ride” board game with feature as first project in development",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r8mr0y/netflix_takes_global_rights_to_ticket_to_ride/"
    },
    {
        "id": "1r8l8eg",
        "author": "misterpopculture",
        "title": "Gabriel Basso Talks Storytelling, Pressure, and a More Dangerous Peter in The Night Agent Season 3 - INTERVIEW",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r8l8eg/gabriel_basso_talks_storytelling_pressure_and_a/"
    },
    {
        "id": "1r896r4",
        "author": "GoodGur9276",
        "title": "The Gardener opening sequence!",
        "content": "The opening credits are absolutely beautiful to watch. If Netflix had a “ never show intro” setting, I could click I would absolutely wait until the second episode to do that.  ⏭️ ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r896r4/the_gardener_opening_sequence/"
    },
    {
        "id": "1r8ts22",
        "author": "FantasticAd9478",
        "title": "Scooby Doo Fans Rally Behind Controversial Pick For Velma After Daphne’s Casting Is Revealed",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r8ts22/scooby_doo_fans_rally_behind_controversial_pick/"
    },
    {
        "id": "1r869mu",
        "author": "CarelessQuail8121",
        "title": "Give Some Suggestions",
        "content": "Completed the Breaking Bad Universe watching all 3 Breaking Bad, Better Call Saul, El Camino and have previously watched Peaky Blinders and I enjoyed every single show now the case is I don’t really like the hype behind Squid Game, Money Heist kinda shows so give me some real good binge worthy shows that I probably end up enjoying more than Better Call Saul because till now it’s the best show I’ve watched ",
        "upvotes": 1,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1r869mu/give_some_suggestions/"
    },
    {
        "id": "1r837hr",
        "author": "largogoat",
        "title": "His and Hers, help me understand the ending?",
        "content": "I enjoyed H&amp;H and would conditionally recommend it to others. However there are a few plot holes that I can’t wrap my head around. Maybe someone here has read the book which may have more details, or just has a plausible theory on these questions.\n\n1.\t⁠Rachel and Helen were attempting to blackmail Lexi/Catherine, but for what? They couldn’t have known about L’s sister. What then?\n\n2.\t⁠When Richard took Anna to the lake house to clear the air / bury the hatchet with Lexy, what was their true intention? Did Richard confess to Lexy that he banged Anna? When Jack beat him up at the bar and Anna told him she’d tell Lexy they slept together if he pressed charges, he seemed to genuinely not want Lexy to know and agreed not to press charges if Anna kept quiet. Were they planning on murdering Anna? Was that why the bleach and other stuff was on the pool table? He had purchased that stuff days before so there must have been some kind of plan to harm her, but if so what was their motive?\n\n3. Here’s the biggest hole for me. How did the mother know that cancelling their hotel reservation would make both Anna and Richard go to the lake house and how did she know lexi would be there? How did she know it would lead to an altercation in which the cops would come, search the house and find the planted evidence? That seems like a big reach. Seems like a lot of ifs, conditions and leaps of faith to make that all happen the way it did. Seems like anna would have been more likely to go to Jack or her mom’s house, after all her and Jack had just recently somewhat reconciled (aka banged in his truck). Maybe if that didn’t work out, if Anna didn’t go to the lake house, she would have tried again another day another way?\n\nTLDR\n\n1. What did Rachel and Helen have on Lexi?\n\n2. Was Lexi and Richard planning to harm Anna and why?\n\n3. How did the mother know the stars would align and the cops would find the planted evidence?\n\nThanks for reading this far and thanks for any insight offered.",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1r837hr/his_and_hers_help_me_understand_the_ending/"
    },
    {
        "id": "1r7pxq0",
        "author": "AttorneyFun4901",
        "title": "First youtube, now netflix",
        "content": "is it down for everyone or just me?\n\nYoutube server just went down about an hour ago. Just opened netflix and started to face problems in netflix as well.",
        "upvotes": 14,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1r7pxq0/first_youtube_now_netflix/"
    },
    {
        "id": "1r8767j",
        "author": "120000milespa",
        "title": "Netflix Issues with HSBC Credit cards",
        "content": "I had my CC cloned so got a new one and Netflix asked me to update my details - entirely reasonable.\n\nNo matter what I do on the update page, using text code security check or using the App to validate the transaction, the card is declined. the card is entirely valid and has no issues on it. HSBC say theres no attempted/failed transactions from Netflix so its unclear why Nertlfix wont accept a valid card.\n\nThe previous cards used on the account are all of the same type, exact same bank and theres never been an issue so its not 'My Account' thats the issue.\n\nNetflix chat help is stumped as they say theres no issues they can see but I still get the same messages up.\n\nAnyone got any ideas ? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r8767j/netflix_issues_with_hsbc_credit_cards/"
    },
    {
        "id": "1r80sfz",
        "author": "fraction00",
        "title": "Can anyone recommend me good Scottish and Irish crime thrillers on Netflix?",
        "content": "I have been really digging in and enjoying Scottish and Irish crime thriller lately. I have watched Dept Q.\n\nI am just obsessed with Scottish accent. I am thinking of leanring it.\n\nCan anyone recommmed me any Scottish and Irish crime thrillers on Netflix?\n\nThanks in Advance mate!",
        "upvotes": 2,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1r80sfz/can_anyone_recommend_me_good_scottish_and_irish/"
    }
]