[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 480,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 30,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1hfa77v",
        "author": "lauren22zo",
        "title": "Santa Clarita Diet rewatch",
        "content": "I loved this show when it was on originally and was devastated when they cancelled it. I decided to do a rewatch and it’s just as good as I remember and I want a follow up to the ending so bad! Ending this show prematurely was a huge misstep for Netflix, but this was when they were cancelling everything 😭",
        "upvotes": 31,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hfa77v/santa_clarita_diet_rewatch/"
    },
    {
        "id": "1hezcl7",
        "author": "peachykeencandy",
        "title": "“Subservience” mom Maggie, was also Emma in “The Hand That Rocks The Cradle” Discussion",
        "content": "I don’t know if anyone noticed this, but I just found it ironic that she's playing the mother in a film that has a similar story line in a different format, to a film she starred in as a child.\n",
        "upvotes": 46,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hezcl7/subservience_mom_maggie_was_also_emma_in_the_hand/"
    },
    {
        "id": "1hf4a46",
        "author": "Gullible-Arm2702",
        "title": "what is your favorite show on netflix? ",
        "content": "hi everyone! i am looking for something to watch right now. i would love any recommendations you have. some shows i love: outer banks, grey’s anatomy, gilmore girls, summer i turned pretty. i would love similar recommendations. thank you in advance!!!",
        "upvotes": 21,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1hf4a46/what_is_your_favorite_show_on_netflix/"
    },
    {
        "id": "1hf9roo",
        "author": "Sanzio-G",
        "title": "Netflix AI mouth replacement on dubs looks terrible",
        "content": "Has anyone else noticed the weird AI mouth replacements on dubbed content that morphs actor's mouths to match the dubbing? Was trying to kill some time watching La Palma, and I noticed the actors mouths just seemed to look... wrong. Half the time it tracked with the english spoken word, then sometimes it didn't. When I switched back to Norwegian with subtitles, the actors' mouths and teeth looked VERY different.\n\nAs far as I can tell, there doesn't seem to be an option to turn this \"feature\" off... Netflix, if you're listening, please add the option to remove this cuz it's just extremely off-putting... we already lose a ton of emotion and context with dubs, but at least the physicality of an actor's face would make up for it somewhat. But now... we've even lost those minute facial expressions from actors with this terrible AI replacement feature... please make it an option and not a forced (bug) feature.",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1hf9roo/netflix_ai_mouth_replacement_on_dubs_looks/"
    },
    {
        "id": "1hfbakg",
        "author": "SuzieSnowflake212",
        "title": "Constant glitches rant",
        "content": "Constant increases in subscription amount, now ads, and every time we try to watch there are freezes, random uncontrollable fast-forwards, or just kicks us out completely.  I dare not try to pause or increase volume cause those actions kick us off the channel too. Wtf.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hfbakg/constant_glitches_rant/"
    },
    {
        "id": "1hf9gf0",
        "author": "PerizzHilton",
        "title": "Coincidence or Calculated? WIRED reports on tentacly Russian crypto hacking/laundering network same week Biggest Heist Ever releases.",
        "content": "These stories/people gotta be related somehow. I just know it!!    \n     \n**Synopsis A:**    \nShe Was a Russian Socialite and Influencer. Cops Say She’s a Crypto Laundering Kingpin\nWestern authorities say they’ve identified a network that found a new way to clean drug gangs’ dirty cash. WIRED gained exclusive access to the investigation. (Dec 4th)    \n    \n**Synopsis B**:    \nMorgan, a hipster rapper otherwise known as Razzlekhan and Forbes contributor and her husband Lichtenstein were arrested after being accused of conspiring to launder nearly 120,000 Bitcoin. (Dec 6th)     \n    \n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hf9gf0/coincidence_or_calculated_wired_reports_on/"
    },
    {
        "id": "1hfce9n",
        "author": "MSLogan07",
        "title": "Questions regarding WWE coming on Netflix",
        "content": "1. Will Raw live stream all over the globe where Netflix is available?\n2. I live in Pakistan. So, Raw will be live streaming in my country too?  Netflix is available in my country.\n3. Also, only Raw will be available for us live and for replays? or Smackdown, NXT and other PPV like Royal Rumble, WrestleMania, Survivor Series and other PPV will be live streaming on Netflix too?\n4. I have heard about the replays too? Will Netflix be like another WWE Network for people outside US?\n\nNetflix Pakistan shows this. So, any chances of it gets live in my country?\n\nhttps://preview.redd.it/l0i9ximbh57e1.jpg?width=1374&amp;format=pjpg&amp;auto=webp&amp;s=057095eae3994d5df5687b704e690f7eea719775",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hfce9n/questions_regarding_wwe_coming_on_netflix/"
    },
    {
        "id": "1hfc41e",
        "author": "DelayDifficult3376",
        "title": "Phone or TV?",
        "content": "Which do you prefer to watch movie series Phone or Television?\n\n I don't think if I am the only one having trouble listening with low voice dialogue when watching television. The series if long. You need to understand the conversation or else you'll get confuse. I am not a native English speaker. Need to learn through conversation.. ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hfc41e/phone_or_tv/"
    },
    {
        "id": "1hepyqp",
        "author": "Unusual-Base-4939",
        "title": "I was bored yesterday so I created a movie recommender.",
        "content": "Okay, so the other night me and a buddy were trying to pick a movie, and I swear we spent like 45 minutes just scrolling through Netflix, Prime, Hulu, etc., arguing about what to watch. By the time we agreed on something, I was like, “Dude, we basically wasted an entire evening doing nothing.” It was ridiculous.\n\nIn a fit of frustration, I threw together this weird little site: cineswipe[dot]com Think of it like swiping on Tinder, but instead of deciding if you like Becky or Brad, you’re deciding if you’d watch Jaws or some random French indie flick. You swipe left or right on whatever comes up, and hopefully land on something you both can actually get behind before your popcorn goes cold.\n\nI’m not selling anything, it’s just a random idea I had to fix a personal annoyance. Not saying it’s perfect—there’s probably some bizarre movies in there—but it might help break that cycle of “what do you wanna watch?” “I dunno, what do YOU wanna watch?” and so on, until the heat death of the universe.\n\nIf anyone tries it and has thoughts, I’m all ears. If not, that’s cool too. Just figured I’d share because it’s 100% better than staring blankly at endless streaming menus. Enjoy or ignore—no biggie.",
        "upvotes": 28,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hepyqp/i_was_bored_yesterday_so_i_created_a_movie/"
    },
    {
        "id": "1hf9gr1",
        "author": "Big-Distribution8422",
        "title": "Absolutely broken need help",
        "content": "I been watching Netflix on my PC but for some reason now when I open a show to play it it will just make the screen completely black and I can’t see anything it’s only for netflix when I play a show \n\nCan someone help thanks ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hf9gr1/absolutely_broken_need_help/"
    },
    {
        "id": "1heesvy",
        "author": "Alarming-Ad-5955",
        "title": "Anyone can explain these scenes from Carry-On ",
        "content": "So Ethan switch cases. Red ribbon case is the bomb and bigger case is just some random case with some stranger’s belongings in it im assuming. \n\nNow the second picture shows the Traveler trying to fit the bigger case which he thinks is the bomb. When he couldn’t fit it in, the flight attendant asked him to check it in which he does because its a different case now. \n\nThen we find out later that the bigger case actually has the bomb in it ?? Did Ethan take the whole bomb and placed it in the bigger case ? I must’ve missed something but someone please clarify lol",
        "upvotes": 140,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1heesvy/anyone_can_explain_these_scenes_from_carryon/"
    },
    {
        "id": "1hf0a6k",
        "author": "Available-Bath9546",
        "title": "how do I fix the subtitles on Netflix? ",
        "content": "So I'm watching beastars with the English audio and English subtitles, but the subtitles are different than the actual audio. I kind of need the subtitles because I have auditory processing issues and they help me know what is going on without having to skip back every few seconds. Is there a way to fix this? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hf0a6k/how_do_i_fix_the_subtitles_on_netflix/"
    },
    {
        "id": "1hf7oc0",
        "author": "emobands2213",
        "title": "Weird freezing???",
        "content": "Does anyone have a problem with Netflix freezing? It’s not every time and it doesn’t have the loading screen it’ll just just freeze. We wait the tv will go to sleep mode then kick us out of Netflix. It on our Roku tv so idk exactly how to fix it or if there is a way to fix. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hf7oc0/weird_freezing/"
    },
    {
        "id": "1heny2u",
        "author": "m2knet",
        "title": "CIV VI Netflix game!!!",
        "content": "Not sure if anyone brought this up but NETFLIX now has civ 6 FREE as an iOS game. Amazing addition! Maybe not in your market?\n\nBut anyone notice this and are you happy? It’s nice when they actually give something of quality to us for free, isn’t it?",
        "upvotes": 19,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1heny2u/civ_vi_netflix_game/"
    },
    {
        "id": "1hf5ety",
        "author": "OkStuff381",
        "title": "Trying to find a series",
        "content": "I can't remember the name, but all I can remember is this, someone puts on a I think gold mask (like a vr) in a bedroom then he gets teleported to a desert somewhere, then this woman kills him but he gets teleported back to the bedroom, also girl I think is siting next to him.\n\nThis is all I can remember, if you know what it is please let me know. I think it's also from a show that came out this year. Thanks. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hf5ety/trying_to_find_a_series/"
    },
    {
        "id": "1hf31ks",
        "author": "SupahGualtah",
        "title": "The Witcher ",
        "content": "So i watched the first season of the witcher show back when it came out, or close to that (i haven't played any games yet, nor read any of the books) i liked it and was hyped for S2.\n\nyou know how it is these days There's so much of everything, everywhere, Too much in fact, so it's hard to keep up\n\ni know the show went downhill and most viewers even dropped it or are dropping it because of Henry Cavill\n\ndo you advise me to pick it up again and keep going, or nah ?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hf31ks/the_witcher/"
    },
    {
        "id": "1he12y9",
        "author": "Whobitmyname",
        "title": "Netflix Says Shooting ‘One Hundred Years of Solitude’ Series In Colombia Delivered A $52 Million Boost To The Country’s Economy",
        "content": "",
        "upvotes": 362,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1he12y9/netflix_says_shooting_one_hundred_years_of/"
    },
    {
        "id": "1hexqmk",
        "author": "maevemutt",
        "title": "Sam? Max?",
        "content": "This might be some fever dream of mine but does anyone remember the time that netflix had a guy with a quiz and then it would show you what you would most likely enjoy watching? It was like a mini game show, I used to be obsessed with it when I was a kid. HELP! IM GOING CRAZY! I’m SURE it exists.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hexqmk/sam_max/"
    },
    {
        "id": "1hedz5y",
        "author": "Bright-Tomatillo-391",
        "title": "Tv shows similar to Tulsa king/breaking bad/sons of anarchy?",
        "content": "Does anyone have any tips on any serie similar to to Tulsa king/breaking bad/sons of anarchy? A gangster/criminal serie that doesn’t play out in a big city but more like the countryside? \nPlease leave all your suggestions! 🙏🙏🙏",
        "upvotes": 27,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1hedz5y/tv_shows_similar_to_tulsa_kingbreaking_badsons_of/"
    },
    {
        "id": "1hez97k",
        "author": "ensiferum888",
        "title": "Weird customer service request",
        "content": "Hi everyone, I'm a bit baffled by a situation that is happening. I've had Netflix for over a decade with the same e-mail address. \n\nA few days ago I noticed I couldn't get into an the old e-mail that was tied to the netflix account due to too many attempts at logging in with the wrong password. I did a reset on the e-mail and moved on. Later I tried watching Netflix and I couldn't log in because of a wrong password, again I reset my Netflix password and logged in. Someone probably got that old email and attempted to log in most popular platforms. \n\nHowever when logging in it forces me to pay before I can access any of my account information, payment history, etc. I can't edit my profiles or anything. They took a payment 4 days ago on the same day they normally do so I don't want to re-enter my credit card info just yet. \n\nHere's the part that makes no sense to me, I went on the Netflix support site. (help.netflix.com) and the certificate appears valid. However when I connect with an agent they ask me for my name and e-mail (I'm already logged in but ok weird) and then they send be a form, directly on the chat that asks me to enter my credit card number and it even says on there that the agent will not be able to see what I type.....\n\nAm I going insane or is that like the most common type of scam ever? Obviously I did not enter anything and ended the chat, I mean, I can't believe that a company would ever identify  their customers through their credit card numbers but everything on the site appears to be valid otherwise I'm completely lost. \n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hez97k/weird_customer_service_request/"
    },
    {
        "id": "1hf50p9",
        "author": "panman341",
        "title": "Mary",
        "content": "It is to bad the producers of Mary did not stick to the real story,   it would have been far more interesting and believable.  The Sorrow's of Mary are profound as it her Child.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hf50p9/mary/"
    },
    {
        "id": "1hek3ld",
        "author": "lollyfleur",
        "title": "No Good Deed",
        "content": "This show is a funky-mystery rollercoaster that should be experienced twice! It is silly, dark, random, FUNNY. There’s a moment - the scene where Luke Wilson plays the piano/sings “Your Song” to Lisa Kudrow - that made me love this cast of characters and all the small heartwarming moments of the show. I restarted the series and am finding it just as interesting, heartfelt &amp; wacky as the first round. \n\noh and…Ray Romano/Matt Rogers/Miss Squirrel in the coke episode was 👌 ",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hek3ld/no_good_deed/"
    },
    {
        "id": "1hf4krn",
        "author": "APeacefulPlace",
        "title": "If I downvote a show…",
        "content": "If I downvote a show in a genre I like, will Netflix adjust my algorithm to show me less of that genre, or just that I didn’t like that particular show? Thanks. ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hf4krn/if_i_downvote_a_show/"
    },
    {
        "id": "1hegegw",
        "author": "villanelle1991",
        "title": "Any fans of Girls5Eva here? Let’s help them get a renewal",
        "content": "So it seems like Girls5Eva is cancelled based on Busy's podcast when she was asked by Danny Pellegrino about it since Netflix only signed up for 1 season, and it seems like they're not likely to renew it. We figured maybe we can do something to help.   \n  \nWhy not show Netflix how much we love this show by making some noise! Please sign our petition:\n\n[https://www.change.org/p/save-girls5eva](https://www.change.org/p/save-girls5eva)\n\nPlease help spread the word as well. Thank you!",
        "upvotes": 10,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hegegw/any_fans_of_girls5eva_here_lets_help_them_get_a/"
    },
    {
        "id": "1he8fxi",
        "author": "zagbertrew",
        "title": "I want to mark a show as watched or disliked, either way, don't show me the show again.",
        "content": "We watch shows, we either like them or hated them, but either way, we are done with the show and don't want to see the show again. This could be done by setting a \"Hide\" flag attached to the entire show, it would apply to all shows in the series. For example, we watched all of \"Monk\", so we could set the \"Hide\" flag and we'd never see \"Monk\" again in any search, except a search for \"Hidden\" shows. The thumbs up and down would indicate why the show was hidden.\n\nThere are other shows that we start watching and do not like, will never like, and don't watch to be bothered with ever again. Usually, these are Hallmark movies, but could be anything for anybody. We would mark these as thumbs down and Hidden. Then we are never bothered again with the show. Again, if we change our minds, we can go to the \"Hidden Shows\" page and unhide anything we want.\n\n\\[Edit\\] Some people seem to misunderstand. First - this is a completely optional feature, if you don't mark something as \"hidden\", you would never know the feature exists. Second - filtering out \"hidden\" shows is the default, but can be disabled (un-checked) so all shows would appear if you are looking for something that might be hidden.\n\nOn Netflix's side, this is more data to evaluate user preferences. It will also reduce network data by reducing the results of any report, so should be cost savings after implentation.",
        "upvotes": 20,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1he8fxi/i_want_to_mark_a_show_as_watched_or_disliked/"
    },
    {
        "id": "1hefzh3",
        "author": "inter_stellaris",
        "title": "This Year’s Christmas Shows",
        "content": "I started this year‘s Christmas season with the Pentatonix promotion show „Meet me next Christmas“, but it was so bad, I had to quit after a couple of minutes. \n\nThen I switched to „Our little secret“. \n\nIt was slightly better, but I‘ve never seen so many plastic surgeried, botoxed and fillered faces in one spot.\n\nPlus the amount of orange and soft focus filters in their faces was hilarious. \n\nIn the last years I loved the „Home for Christmas series“, too bad it wasn’t continued. \n\n",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hefzh3/this_years_christmas_shows/"
    },
    {
        "id": "1hegu1w",
        "author": "Present-Ferret5397",
        "title": "Help me find this show pls",
        "content": "I remember a tv show (I think) that's in Spanish (again, I think) I saw years ago on Netflix (possibly around 2018/19). It was a girl who was poor or bullied went to this school where a lot of them were rich. This guy (pretty sure he was blonde) secretly likes her, takes her on dates, etc... but doesn't want anyone to know. I wanna say she was a brunette if that helps.\nHe is insanely popular and rich (possibly royal) invites her to a vacation with his friends. But he rents out a separate place for her to sleep because he was to be able to secretly sneak in at night to stay with her. There was also a scene where she stops by his house to drop off a bag of candy or something and meets his family and realizes he's insanely rich or royal and eats dinner with his family.\nI can't find anything. It's also not Elite since that's the first thing that pops up every time.",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hegu1w/help_me_find_this_show_pls/"
    },
    {
        "id": "1hew4nw",
        "author": "No_Leg_1116",
        "title": "looking for a tv show, i don't know if it exist",
        "content": "so, a murder detective show about a guy who killed someone, and he works as a murder detective so he can hide proof from the inside about his murder case, and he cant go to jail because someone depends on him, and its like a psychological drama, a murder solving crime psychological drama, and the story is about him, the one who is depended on him, and him solving crime out of just doing his job, no venging, or out of trying to deal with him murdering someone with catching other murderers, so, a murderer catching other murderers,  but not like how Hannibal did it, the protagonist is a good person, not bad, the audience knows that he is a murderer, but the one who depends on him or the other characters don't",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hew4nw/looking_for_a_tv_show_i_dont_know_if_it_exist/"
    },
    {
        "id": "1heeupx",
        "author": "TX3931FB",
        "title": "movie auto starts when reading synopsis",
        "content": "I want to turn off the auto start when reading a synopsis or audio language info. This is NOT the preview. When I'm trying to read about a movie or TV series, Netflix will auto start the show and remove the content I'm reading. It's very annoying. I have turned off the auto preview and auto start next episode. How do I turn off the auto show start? Thanks",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1heeupx/movie_auto_starts_when_reading_synopsis/"
    },
    {
        "id": "1hefy2e",
        "author": "Achenar459",
        "title": "How do I disable Games?",
        "content": "How do I disable Games? I just finished watching a good Anime on the Netflix website and decided to scroll to see what else to watch and there is a giant list of games I could play. I checked out the \"Manage profile and preferences\" and couldn't find a setting for it. I would very much appreciate to not have to scroll past Games and then again past \"Popular Mobile Games for You\" every time I am looking for a good TV show or movie to watch, since I'll never click on any of them. That list is definitely not for me. Am I missing seeing the setting somewhere?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hefy2e/how_do_i_disable_games/"
    }
]