[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 39,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pzz9da",
        "author": "UnsleekGeek",
        "title": "I have watched the entire run of Ozark twice now and now I'm certain it's my all-time favorite show.",
        "content": "Prior to Ozark, Breaking Bad was my all-time favorite show (yeah there are definite thematic similarities). The suspense, pacing, and stylistic elements of this show were amazing, perhaps only outdone by the production and the acting.  I've never watched an entire run of any show until Ozark (for context I did wait a couple of years before I watched it again).  Seriously, watch this show.  It's a gem.  ",
        "upvotes": 127,
        "comments": 115,
        "media": null,
        "permalink": "/r/netflix/comments/1pzz9da/i_have_watched_the_entire_run_of_ozark_twice_now/"
    },
    {
        "id": "1q00sx0",
        "author": "Time-Philosophy0323",
        "title": "I can’t believe it - I actually won on Best Guess Live!",
        "content": "Won $666 on Best Guess Live tonight, with the guess of “Sandcastle” after clue 3, and claimed the prize shortly after. \n\nStill stunned I won out of 80,000 people! \n\nFor those wondering, I claimed the prize by linking my PayPal account and within 5 minutes the funds were added to my account. Cool to receive a payment from Netflix, Inc.",
        "upvotes": 17,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1q00sx0/i_cant_believe_it_i_actually_won_on_best_guess/"
    },
    {
        "id": "1pzvsds",
        "author": "RiskAndReason",
        "title": "On the last day of the year… what was the BEST SHOW or MOVIE Netflix released?",
        "content": "With the year coming to an end, I’m curious what everyone thinks Netflix absolutely nailed this year.\n\nWhat was the best series, movie, or overall production Netflix released, in your opinion?",
        "upvotes": 23,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1pzvsds/on_the_last_day_of_the_year_what_was_the_best/"
    },
    {
        "id": "1q07bpp",
        "author": "hammonit",
        "title": "Wake up dead man: does Jud remind anyone else of Linguini from Ratatouille?",
        "content": "I mean, the resemblance is uncanny. The mannerisms spot on. And I crush on him just the same. All in all, great movie. Now just yapping to reach my character minimum. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q07bpp/wake_up_dead_man_does_jud_remind_anyone_else_of/"
    },
    {
        "id": "1q019ip",
        "author": "wildwoman_smartmouth",
        "title": "Goodnite comfort shows",
        "content": "SUPERNATURAL and LOST are both leaving.  Im new to this sub, but was surprised how briefly LOST was run.  Either ready to cancel or start something new? Im open to suggestions bc there isnt much else I use it for. ",
        "upvotes": 6,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1q019ip/goodnite_comfort_shows/"
    },
    {
        "id": "1pz3051",
        "author": "McNasty420",
        "title": "\"Emily In Paris\" goes beyond hate watching.  This show is  offensive and lazy",
        "content": "Is this what passes as a show now?  This is bad, like \"Sex and the city 2\" bad. The acting.  Jfc.  I've never felt bad for actors before.  What is the point of this?  To anger people? So basically, people just hate watch this show?  How exactly do the pitch meetings go?  \"Let's disgust people!\"",
        "upvotes": 668,
        "comments": 212,
        "media": null,
        "permalink": "/r/netflix/comments/1pz3051/emily_in_paris_goes_beyond_hate_watching_this/"
    },
    {
        "id": "1pzvnb1",
        "author": "thepurplethorn",
        "title": "Anybody see Evil Influencer yet?",
        "content": "Oh Gosh , I am not okay. This show had me shaking I was so upset!\n\nThese two sick women ….., I swear there is so much weird and evil going on in these religious communities which suppose to be the opposite of evil. All this nonsense being poured in their heads ..  some of the commentary was spot on",
        "upvotes": 10,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pzvnb1/anybody_see_evil_influencer_yet/"
    },
    {
        "id": "1pzhqeq",
        "author": "Initial_Ebb_9742",
        "title": "The Witcher, season 4–incredibly bad",
        "content": "I’m nearly done with season four and I’m floored at how bad it is. The setups, the dialogue, the acting. I could stop but I’ve gotten this far so I’ll see it through. Maybe I’ve forgotten how bad the other seasons were or maybe they weren’t quite as bad. It’s one of those shows that I really want to like. But it’s embarrassingly awful. The whole Rats storyline is annoying and boring and all the characters dull as rocks with not a good actor in the bunch. I hope the last two episodes at least have a decent payoff. Hemsworth is doing an ok job as Geralt but I def prefer Cavill. I’m not even up to speed on the future of the series but if a season five is planned I may have to nope out at this point. I can see why Cavill wanted out.",
        "upvotes": 32,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1pzhqeq/the_witcher_season_4incredibly_bad/"
    },
    {
        "id": "1pzjogf",
        "author": "damn_it_beavis",
        "title": "Murder in Monaco AI",
        "content": "I like documentaries and it sounded interesting. It took me a few minutes, but I realized that much — if not most, if not all — of the purported voiceovers are AI. You know the drill: To provide exposition or background, documentaries show news footage and you hear a newscaster’s voice. In this show, the “newscasters” are AI. Once I heard it happening, I couldn’t unhear it and turned it off after 20 mins. Bummer and a waste of time.\n\nEdit: Downvote to your little hearts’ content. AI fucking sucks, and you won’t change my mind.",
        "upvotes": 15,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pzjogf/murder_in_monaco_ai/"
    },
    {
        "id": "1q04pgl",
        "author": "Fit_Significance_846",
        "title": "Android + Netflix FHD 4K",
        "content": "Hi all, I just realized Netflix app on iPhone and Android max support FHD. Anyone found out a way to unlock 4k streaming? I would use my great dpi screen on my honor magic v3. Thank u ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q04pgl/android_netflix_fhd_4k/"
    },
    {
        "id": "1q04l4q",
        "author": "monyetguru",
        "title": "Black Rabbit was not bad but not great either.",
        "content": "\"shit show\" the show is my description of this series. and not in a derogatory way, its just everything that could go wrong, did go wrong plot wise.\n\nboth vince and jake have got to be one of the unluckiest characters in all fiction, literally nothing they did ever gone the way they wanted.\n\nim not familiar with the behind the scene but i felt like the show was some kind of an answer from Netflix to The Bear with all the similarities. but with that all the show was somehow enjoyable and made me intrigued each episodes. would probably give it 7/10, not that recommended if im being honest.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q04l4q/black_rabbit_was_not_bad_but_not_great_either/"
    },
    {
        "id": "1pzcxbx",
        "author": "Kurtz62",
        "title": "Adolescence",
        "content": "I got bored tonight so I decided to watch *Adolescence* and I can see why it swept the Emmy’s. \n\nThe fact this show was genuinely good while it was all done in one-shot is very, very impressive. \n\nIt was the third European crime thriller that caught my attention from the beginning to end. \n\nDoes Europe know how to do it better than the U.S.? \n\nWhy do their crime thrillers seem 100x better than ours?",
        "upvotes": 36,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1pzcxbx/adolescence/"
    },
    {
        "id": "1pzx2pg",
        "author": "Heapsees",
        "title": "Tea with Judi Dench",
        "content": "Having seen an excerpt from Tea With Judi Dench and having found that it’s carried by Sky Arts and having read somewhere that it’s available on Netflix I’m just gonna cast out a ring buoy for flotation here.\nOr HEY Y’all!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pzx2pg/tea_with_judi_dench/"
    },
    {
        "id": "1pzw1m8",
        "author": "roydogaroo",
        "title": "I was watching episode 1 of The Gentlemen Netflix TV show yesterday, and today the whole series is just gone! (Australia)",
        "content": "Can anybody else in Aus find the Netflix created show The Gentlemen? its not in Continue Watching or searchable for me? Seems really weird. Please help!",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pzw1m8/i_was_watching_episode_1_of_the_gentlemen_netflix/"
    },
    {
        "id": "1pznawe",
        "author": "Important-Story3858",
        "title": "Netflix Double Charge",
        "content": "Hi everyone ! Is this common knowledge or am I missing something? \n\nI joined netflix this month, and was charged the basic package (19$) for the month of December (7th). \n\nI then added on the additional member, and was charged (27$) again on the 30th. \n\nIs it expected to be charged 46$ in a month’s span for signing up plus adding a member? ",
        "upvotes": 6,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1pznawe/netflix_double_charge/"
    },
    {
        "id": "1pzc4cz",
        "author": "Previous-District309",
        "title": "Watching The Diplomat S3 feels like reading tomorrow's headlines",
        "content": "The geopolitics are scarily realistic, the betrayals hit hard, and every conversation feels like it could start WW3.\n\n  \nYet I'm glued to the screen yelling \"just tell him the truth Kate!\"\n\n  \nBest political thriller since West Wing?\n\n  \nFavorite \"oh shit\" moment this season? (No spoilers!)",
        "upvotes": 20,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pzc4cz/watching_the_diplomat_s3_feels_like_reading/"
    },
    {
        "id": "1pzxl3t",
        "author": "wBrite",
        "title": "Red Road",
        "content": "I thought it said 2025 and now I'm disappointed it only has two seasons. Suggest something similar, or maybe funny. Otherwise I'm rewatching something.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pzxl3t/red_road/"
    },
    {
        "id": "1pzrsxp",
        "author": "dimbulb8822",
        "title": "King of Corruptibles: The Moldin Touch",
        "content": "So I have thrown on previous seasons as background noise with them occasionally showing off a cool collectible or two. \n\nThis season is egregiously slimy and the fact checking is even worse with abysmal storytelling. The worst part was them talking to a PEZ dispenser collector and simultaneously mentioning them merging with eBay (it’s mentioned every episode) yet not a single electron was devoted to the idea that eBay was founded to trade PEZ dispensers. Moreover, they tell the guy his collection is niche. \n\nWas pretty shocked. This show was already bad but season three is hot garbage. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pzrsxp/king_of_corruptibles_the_moldin_touch/"
    },
    {
        "id": "1pz07wg",
        "author": "No_Newspaper4989",
        "title": "Suggest a movie that will help me cry my heart out.",
        "content": "Tried searching for a movies that I can watch to cry my heart out, on chatgpt and other platforms, but could not really figure out which are actually worth watching. If you could share some good names that will help me cry, it would a huge help for me. Thanks",
        "upvotes": 94,
        "comments": 447,
        "media": null,
        "permalink": "/r/netflix/comments/1pz07wg/suggest_a_movie_that_will_help_me_cry_my_heart_out/"
    },
    {
        "id": "1pzqpa2",
        "author": "militarywife84",
        "title": "Horror movies/series",
        "content": "Wondering what horror movies or series on Netflix that I may have missed? Maybe a hidden gem, an original or even a block buster? I appreciate your input! Thank you! ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pzqpa2/horror_moviesseries/"
    },
    {
        "id": "1pz4ppk",
        "author": "Greenfrog2023",
        "title": "Members Only: Palm Beach",
        "content": "What on earth..... Has anyone watched this yet? I will reserve judgement until the end (if I make it through) but first episode has me thinking these women are diabolical and gross. \n\nUPDATE: Since posting this I found a thread in the BravoHouseiwves Sub and the comments perfectly describe this show... \n\nI just watched the one episode in the end. I have a very low standard but even Members Only: Palm Beach was not for me...  ",
        "upvotes": 50,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1pz4ppk/members_only_palm_beach/"
    },
    {
        "id": "1pzvrnh",
        "author": "PurrplexedMochi",
        "title": "What’s your binge style - drip, drop, or something else entirely?",
        "content": "Do you prefer a weekly drip or a full drop? Personally I can live with either, but split seasons just feel off (looking at you, Stranger Things).\n\nCurious where people land - does release style actually change how much you enjoy a show?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pzvrnh/whats_your_binge_style_drip_drop_or_something/"
    },
    {
        "id": "1pzvads",
        "author": "TerriblePen8054",
        "title": "Ripple dubbing",
        "content": "I can’t quite put my finger on what’s making the dialogue so off in Ripple but my best guess is that for whatever reason the “room noise” and recorded dialogue were added as two totally separate tracks in post, as opposed to mixed. Very strange. Maybe I’m totally off. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pzvads/ripple_dubbing/"
    },
    {
        "id": "1pzkfgq",
        "author": "dicedtomatoes55",
        "title": "“Evil Influencer” Director Says She Would Have Loved To Get Jodi Hildebrandt’s Perspective",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pzkfgq/evil_influencer_director_says_she_would_have/"
    },
    {
        "id": "1pztbfs",
        "author": "pronos2020",
        "title": "cant listen to movies in my native language",
        "content": "i have a netflix account where me and my family watch movies, one movie my little brother wanted to watch is the grinch the one with jim carry, only problem is that it puts it in the original language, aka, english, but we're italian, we try to change the language but when we go to the option there the italian language simply does not appear, i can put the italian subtitles but not the actual audio, its weird because on the preview when you hover over the movie the whole thing IS in italian, but now it doesnt work, and i know for a fact that the movie has an italian dub",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1pztbfs/cant_listen_to_movies_in_my_native_language/"
    },
    {
        "id": "1pzynuf",
        "author": "IwanBW",
        "title": "TBBT &amp; Friends",
        "content": "Both my comfort shows The Big Bang Theory &amp; Friends have been removed off UK Netflix now.\nAbsolutely nowhere else to watch them over here and i can say my disappointment is on another level.\n\nShocking decision ",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1pzynuf/tbbt_friends/"
    },
    {
        "id": "1pz3kur",
        "author": "ILoveSteelPanther",
        "title": "Since when has this been a thing?",
        "content": "I've just noticed that certain shows on Netflix can only be watched if you subscribe to their ad-free plan. This is in the UK so not sure if it's worldwide.\n\nIt has a padlock and says \"unavailable on advert-supported plan\"",
        "upvotes": 27,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1pz3kur/since_when_has_this_been_a_thing/"
    },
    {
        "id": "1pzop42",
        "author": "NocerinoCarmine",
        "title": "Serie TV simili a Breaking Bad: cosa guardare se ami le trasformazioni criminali",
        "content": "Se *Breaking Bad* ti ha conquistato, non è solo per la droga o il crimine. È per **la trasformazione**. Per quel momento preciso in cui un uomo qualunque decide di oltrepassare il limite — e non torna più indietro.  \nSe stai cercando [**serie TV simili a Breaking Bad**](https://www.cinefatti.it/serie-tv-simili-a-breaking-bad-cosa-guardare-se-ami-le-trasformazioni-criminali/), preparati a storie di ascesa e caduta, scelte morali impossibili e personaggi che cambiano sotto i tuoi occhi.\n\nSe ami serie che ti fanno dubitare del presente, recupera anche [**Serie TV simili a Black Mirror**](https://www.cinefatti.it/serie-tv-simili-a-black-mirror-cosa-guardare-se-ami-la-fantascienza-distopica/).\n\nQui trovi una selezione curata per **tensione narrativa, profondità psicologica e realismo criminale**. Perfette per riempire il vuoto lasciato da Walter White.\n\n**Perché queste serie TV sono simili a Breaking Bad**\n\nLe serie affini a *Breaking Bad* condividono alcuni elementi fondamentali:\n\n* **Anti-eroi complessi** che evolvono (o degenerano) nel tempo\n* **Crimine come scelta, non come destino**\n* **Conseguenze reali**, personali e familiari\n* **Scrittura lenta ma implacabile**, costruita sui personaggi\n\nNon si tratta di azione fine a sé stessa: è **dramma criminale psicologico**. Se conosci altre serie commenta pure!!!!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pzop42/serie_tv_simili_a_breaking_bad_cosa_guardare_se/"
    }
]