[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1q90g5a",
        "author": "ps5cfw",
        "title": "Torinesi, dove lasciate la macchina per l'aeroporto?",
        "content": "Salve a tutti, ormai vivo nel torinese da 6 anni e ho sempre fatto la combo autobus (ora treno) + metro e mezzi pubblici eventuali per andare e tornare dall'aeroporto.\n\nSolo che questa volta tornerò a casa ad un orario in cui i mezzi pubblici non ci sono, quindi mi sono pensato essendo povero: ma perché non lascio la macchina da qualche parte e poi mi faccio tutta la strada che mi serve per l'aeroporto a piedi? Farmi 4 8 10 km non è necessariamente un problema per me.\n\nQuindi la domanda è: quale è il posto più vicino in cui posso lasciare parcheggiato il mio rottame di veicolo per andare poi a piedi in Aeroporto?\n\nGrazie a tutti a priori per I suggerimenti ",
        "upvotes": 8,
        "comments": 29,
        "media": null,
        "permalink": "/r/torino/comments/1q90g5a/torinesi_dove_lasciate_la_macchina_per_laeroporto/"
    },
    {
        "id": "1q8qoxq",
        "author": "Key_Leg_6503",
        "title": "Cambiereste mai Torino con Milano?",
        "content": "",
        "upvotes": 14,
        "comments": 38,
        "media": null,
        "permalink": "/r/torino/comments/1q8qoxq/cambiereste_mai_torino_con_milano/"
    },
    {
        "id": "1q96cqu",
        "author": "mds1926",
        "title": "Looking for language partner in Turin M23 (English for Italian)",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q96cqu/looking_for_language_partner_in_turin_m23_english/"
    },
    {
        "id": "1q937ff",
        "author": "juulu",
        "title": "Fastweb/OpenFibre interruzione del servizio?",
        "content": "Ciao a tutti. Qualcuno stamattina ha avuto problemi con fastweb/open fiber?\n\nNon riesco a trovare un ‘service status update’ sul sito web di Fastweb, e prima di chiamarli, controllo se è un problema per gli altri.\n\nGrazie.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q937ff/fastwebopenfibre_interruzione_del_servizio/"
    },
    {
        "id": "1q8jejl",
        "author": "Tatjana_queen",
        "title": "Non riesco a capire bene la situazione immobiliare a Torino",
        "content": "Ciao, aiuto perfavore. Mi sono imbattuto su immobiliare e Idealista perché mi sto trasferendo a Torino.\n\nVedo annunci sia di affitti che di vendite. Vivo a Milano da una vita, e i prezzi mi sembrano una favola. I prezzi al metro quadro vanno da un minimo di 1.200€ a un massimo di 2.000€... comunque sono tra i più bassi in Europa. Ormai neanche in Bulgaria li trovi.\n\nGli appartamenti, tutto sommato, non sono case di ringhiera e non mi sembra che cadano a pezzi. Anzi, spesso hanno costruzioni più recenti di quelli di Milano, e si vede che ci ha vissuto gente con famiglia. È l'opposto dei soliti appartamenti in affitto a Milano, da 10 studenti in 5 camere doppie per 20 anni consecutivi.\n\nPoi guardi i prezzi degli affitti, in linea con quelli di vendita: un bilocale va dai 550€ ai 1.000€, dipende dalla zona.\n\nDopo guardi i prezzi delle stanze, e lì trovi i soliti **500€ per una singola e 350€ per una doppia**.\n\nCioè, com'è possibile che il prezzo di un bilocale sia quasi come quello di una singola (dove vivi con altre persone)? Com'è possibile che tu possa comprare un trilocale a 120/130k (un costo da favola) e poi affittarlo a 500€ a stanza? Non mi torna per niente.\n\nUn trilocale a Milano in una zona normale va dai 300 ai 350k, e una stanza costa comunque tra i 500€ e i 650€. Quindi qui, a Torino, parliamo di circa un terzo del prezzo.\n\nLa mia domanda è: come mai la gente affitta le stanze singole a 500€ quando con 50€ in più ti prendi un mono/bilocale? E come mai i proprietari affittano le stanze a 500€ quando il prezzo al mq è di 1.200/1.500€ al massimo?",
        "upvotes": 19,
        "comments": 40,
        "media": null,
        "permalink": "/r/torino/comments/1q8jejl/non_riesco_a_capire_bene_la_situazione/"
    },
    {
        "id": "1q828l9",
        "author": "living_direction_27",
        "title": "Qual è la cosa piú bella/caratteristica ma nascosta da vedere a Torino?",
        "content": "Son di Torino, quindi pura curiosità. Magari scopro cose nuove. \n\nNe lancio due:\n- fetta di polenta: la casa progettata da Antonelli prima di far la mole. Un capolavoro di ingegno, in quanto costruita in un pezzo di terreno molto piccolo. È davvero caratteristica (si trova vicino alla Mole)\n- la posizione sulla griglia di partenza da cui partí Ascari durante il gran premio del Valentino del 1955. È stata preservata, e si trova vicino al castello del Valentino",
        "upvotes": 35,
        "comments": 26,
        "media": null,
        "permalink": "/r/torino/comments/1q828l9/qual_è_la_cosa_piú_bellacaratteristica_ma/"
    },
    {
        "id": "1q8i3s9",
        "author": "guigbd",
        "title": "Facciamo qualcosa di buono per il nostro territorio",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q8i3s9/facciamo_qualcosa_di_buono_per_il_nostro/"
    },
    {
        "id": "1q8cfv8",
        "author": "ahahfilip",
        "title": "Autolavaggio per interni della macchina?",
        "content": "Ciao a tutti!  \nMi chiedevo se qualcuno conoscesse un buono autolavaggio a Torino con un buon rapporto qualità prezzo per far pulire gli interni di una macchina.  \nFinora ho solo trovato lavaggisti che puliscono la parte esterna della macchina.  \n\n\nGrazie in anticipo per i suggerimenti :)",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1q8cfv8/autolavaggio_per_interni_della_macchina/"
    },
    {
        "id": "1q8bylo",
        "author": "GiuseppeAlletto",
        "title": "Finissage imperdibile a Torino 🎨 Arte, Estasi e Sensualità | Giuseppe Al...",
        "content": "Ti invito sabato 10 gennaio 2026 alle 18:00 da Csa Farm Gallery (Via Vanchiglia 36, Torino) per la chiusura della mostra di Giuseppe Alletto.  \n  \n[\\#arte](https://www.youtube.com/hashtag/arte/shorts)  \n[\\#mostredarte](https://www.youtube.com/hashtag/mostredarte/shorts)  \n[\\#finissage](https://www.youtube.com/hashtag/finissage/shorts)  \n[\\#artemodernaecontemporanea](https://www.youtube.com/hashtag/artemodernaecontemporanea/shorts)  \n[\\#alletto](https://www.youtube.com/hashtag/alletto/shorts)  \n  \nUn evento speciale tra arte e letteratura: Davide Galipò leggerà testi di De Sade e Bataille sul tema \"Estasi mistica e sensualità\".  \n  \nInsieme all'artista Giuseppe Alletto, saranno presenti Giuseppe Biasutti e Marcello Corazzini.  \n  \nTi aspetto per l'ultimo saluto alla mostra.  \n  \nBellezza rivelata  \n  \nContorni che seguono i colori del corpo, quasi come una grande luce che si espande e si riversa su chi osserva. Un mondo interiore, una visione, un pensiero a raccontare, senza vergogna, la bellezza femminile.  \nEterna e romantica. Spirituale ed ideale. Tormentata e sublime.  \nBellezza di donna, timida, pudica, raffinata e forte, di un qualcosa concepito da un’idea sconosciuta ed inafferrabile.  \nGiuseppe Alletto traccia, unisce, racconta tante storie. Parla attraverso opere che hanno una grazia d’esecuzione precisa ed impeccabile. Un segno grafico che ti porta lontano e quando sembra perdersi arriva ad un’idea finita. In esse trova spazio, probabilmente, anche il dolore di cui non si riesce a parlare. L’incanto che ci racconta è quello che ognuno di noi cerca, come sollievo, come cura, per dimenticare le difficoltà e tornare al sereno.  \nBellezza come pensiero contemporaneo, unico ed inconfondibile, raccolto prima di poggiare la matita sul foglio bianco. Espressione di dono e identità di artista.  \nBellezza che non è un soffio di memoria, ma una presenza trasformata per dare voce ad un vero trasporto. Una conoscenza estetica permeata di profondità e di senso, una fermezza contro l’indifferenza e la superficialità del quotidiano.  \nBellezza che oltrepassa i confini del femminile per farsi segno dell’umanità intera. Autentica, complessa, vulnerabile, ma viva.  \nLa donna, interpretata da Alletto, guarda lo spettatore e gli chiede di riconoscere non solo il fascino, ma allo stesso tempo la storia, fatta di lotta e di verità.  \nBellezza che non chiede di essere vista, ma compresa.  \n  \nGiuseppe Biasutti",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KBAcysJXzeg4S4IVvRxEFZdvxbboaB20MNqQKuwDJ24.jpeg?auto=webp&amp;s=0922a1d3d0bfc4642b2d0b16f7416b8ad0b37c48"
        },
        "permalink": "/r/torino/comments/1q8bylo/finissage_imperdibile_a_torino_arte_estasi_e/"
    },
    {
        "id": "1q8baed",
        "author": "Phanetis",
        "title": "Scuole di danza classica",
        "content": "Ciao! Qualcuno conosce o frequenta scuole di danza con prezzi accessibili? \n\nHo già praticato danza classica per diversi anni, e cerco qui una scuola che offra corsi per adulti – magari anche con persone non troppo adulte — con la possibilità di mettere le punte. \n\nPurtroppo le scuole che ho contattato finora hanno prezzi troppo alti per le mie possibilità",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1q8baed/scuole_di_danza_classica/"
    },
    {
        "id": "1q85gtx",
        "author": "JazzlikeCommission30",
        "title": "hike",
        "content": "Hello, guys. Do you know of any hiking groups that plan hikes regularly?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1q85gtx/hike/"
    },
    {
        "id": "1q78fwu",
        "author": "Mountainfox1974",
        "title": "La mole, gennaio '26. E' vero che per i torinesi d.o.c. questo monumento non è il simbolo della città?",
        "content": "",
        "upvotes": 181,
        "comments": 125,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/03spvi8yr3cg1.jpeg?auto=webp&amp;s=1cb7901603824231b146d885617db20a3875b572"
        },
        "permalink": "/r/torino/comments/1q78fwu/la_mole_gennaio_26_e_vero_che_per_i_torinesi_doc/"
    },
    {
        "id": "1q836qr",
        "author": "Niceorg",
        "title": "1 Maltese e 1 Polacca in visita",
        "content": "Hello,\n\nI 24m am visiting Torino w my 25f girlfriend right now (about to board the flight). Will be there for the next 5 days and looking for a couple things:\n\nBar buddies;\nPeople to take us the local way;\n vintage/flea markets (especially camera gear)\n\nAlso any suggestions are welcome!\n\nThanks and hope to hear from someone :)",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1q836qr/1_maltese_e_1_polacca_in_visita/"
    },
    {
        "id": "1q7pxge",
        "author": "Overall_Task_2783",
        "title": "scippano ad un anziano in \"crocetta\"",
        "content": "Più o meno all'altezza di largo orbassano dove passa il 12, un anziano che conosco quando stava scendendo dall'auto per andare a lavoro gli hanno rubato la borsa, lui praticamente stava scendendo dalla macchina e aveva la borsa nel sedile accanto, arriva uno che gli chiede indicazioni e poi un altro gli apre lo sportello della macchina e prende la borsa scappando in monopattino, lui aveva già difficolta motorie quindi poteva farci poco niente, vi chiedo se anche voi è mai successa una cosa del genere se sì in che zona e come, e come si può combattere questa delinquenza",
        "upvotes": 11,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1q7pxge/scippano_ad_un_anziano_in_crocetta/"
    },
    {
        "id": "1q76190",
        "author": "Few_Party395",
        "title": "GTT Merda",
        "content": "This might be the worst transportation system I ever used in my life",
        "upvotes": 79,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1q76190/gtt_merda/"
    },
    {
        "id": "1q79uh0",
        "author": "Avidey",
        "title": "Sono il fondatore di Ladalo, una nuova app di dating per chi cerca relazioni serie. Lancio il 18 gennaio in Piemonte. AMA",
        "content": "Ciao a tutti,  \nsono il fondatore di **Ladalo**, una nuova app di dating che lanceremo ufficialmente il **18 gennaio**, partendo dal **Piemonte** e poi con un’espansione graduale nel resto d’Italia nei mesi successivi.\n\nVi scrivo qui perché prima ancora del marketing mi interessa **parlare con persone vere**, raccogliere feedback e rispondere a domande senza filtri.\n\n# Cos’è Ladalo (in breve)\n\nLadalo è un’app di dating pensata **solo per chi cerca una relazione seria**.  \nNasce da una frustrazione molto semplice: le app di dating tradizionali funzionano benissimo per swipe, match e chat… ma **malissimo per creare relazioni che durano**.\n\nIl cuore dell’app è un **algoritmo di compatibilità** che non si basa solo su foto o interessi superficiali, ma soprattutto su:\n\n* valori personali\n* obiettivi di vita\n* visione della relazione\n\nL’idea è ridurre drasticamente:\n\n* match a caso\n* conversazioni vuote\n* perdita di tempo\n\ne aumentare la probabilità di incontrare qualcuno **davvero compatibile**, fin dall’inizio.\n\n# In cosa è diversa dalle altre app\n\n* Niente swipe compulsivo fine a sé stesso\n* Profilo più profondo (non solo foto e bio)\n* Algoritmo che privilegia **compatibilità valoriale e prospettive future**\n* Ambiente più ordinato e rispettoso (con filtri contro messaggi espliciti)\n* Funzioni pensate per chi non ha voglia di perdere mesi a chattare a vuoto\n\nNon è un’app “per tutti”, ed è una scelta voluta.\n\n  \nLadalo si differenzia dalle altre app perché utilizza un **questionario strutturato di 25 domande** che alimenta un **algoritmo proprietario di compatibilità**.  \nL’obiettivo non è abbinare le persone in base a gusti superficiali, ma **in base a valori e prospettive di vita**.\n\nLe domande sono state progettate per coprire diverse **aree valoriali e relazionali fondamentali** (modo di vivere le relazioni, visione del futuro, priorità personali, compromessi accettabili e non). Quando la percentuale di compatibilità è alta (70% o più), significa che due persone tendono a pensarla allo stesso modo su aspetti realmente importanti.\n\nQuesto serve a evitare una dinamica molto comune nelle app tradizionali: frequentarsi per mesi e scoprire solo dopo che su temi non negoziabili si è completamente incompatibili.  \nL’idea è **ridurre queste fratture a monte**, aumentando le probabilità di costruire relazioni più consapevoli, stabili e durature.\n\n# Lancio ed espansione\n\n* **18 gennaio**: lancio ufficiale in **Piemonte**\n* Nei mesi successivi: espansione graduale in altre regioni italiane L’espansione dipenderà molto dall’adozione e dal feedback degli utenti.\n\n# Perché scrivo qui\n\nNon sono qui a vendervi nulla.  \nSono qui perché:\n\n* voglio rispondere a dubbi, critiche e domande\n* mi interessa capire cosa funziona e cosa no\n* credo che un progetto del genere debba nascere dal confronto\n\n👉 **AMA – Ask Me Anything**  \nPotete chiedermi qualsiasi cosa: idea, algoritmo (nei limiti), modello, visione, problemi del dating oggi, scelte di prodotto, ecc.\n\n# Dove seguirci (se vi va)\n\nPer aggiornamenti sul lancio e sul progetto:\n\n* 🌐 Sito: [**https://www.ladalo.com/**](https://www.ladalo.com/)\n* 📸 Instagram: [https://www.instagram.com/ladalo\\_app/](https://www.instagram.com/ladalo_app/)\n* 🎵 TikTok: [**https://www.tiktok.com/@ladalo\\_app**](https://www.tiktok.com/@ladalo_app)\n\nGrazie a chi leggerà fino in fondo e a chi vorrà partecipare alla discussione.  \nSono qui.",
        "upvotes": 29,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KNhMf2iOnTKvffvV6ypFBRldxpNaY37Nao--29fYm5s.png?auto=webp&amp;s=8c20432a9fc03388a338d818d3118bd0e59938df"
        },
        "permalink": "/r/torino/comments/1q79uh0/sono_il_fondatore_di_ladalo_una_nuova_app_di/"
    },
    {
        "id": "1q842hp",
        "author": "Few_Party395",
        "title": "What's going on with the streets of the city?",
        "content": "Another post of complaints after the GTT one, you will end up hating me:  \n  \nWhat's going on with the infrastructure of the streets around the city? I've been driving around the outskirts (Borgo Vittoria, Cenisia, etc) and the streets looks like a war zone, I believe in Poland we even have better streets in a quite considerable size city like this one\n\nI'm not trying to receive comments such as: \"oh bro but drive in Palermo!\", I mean I'm paying tons of taxes for what? half of the city is covered in graffitis and the other half is covered with holes in the street\n\nI'm thinking about changing my city car since it's literally annoying to drive\n\nHow come the city consul does not do ANYTHING at all? Is it JUST me that complain about these things? ",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1q842hp/whats_going_on_with_the_streets_of_the_city/"
    },
    {
        "id": "1q7tg4m",
        "author": "blueseas2015",
        "title": "Vintage Cassette Players or Recorders",
        "content": "Ciao! Qualcuno sapete dove io posso comprare cassette-recorder antiche?\n\nHi! Does anyone know where I can buy vintage cassette players?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1q7tg4m/vintage_cassette_players_or_recorders/"
    },
    {
        "id": "1q7aqsf",
        "author": "NailMuted6705",
        "title": "Compagnia per librerie e musei",
        "content": "Ciao qui F20, cerco qualcuno interessato a visitare mostre e musei qui a Torino, al momento miro al MAO e al museo di Cesare Lombroso, ma qualsiasi altra mostra (soprattutto d'arte) va benissimo. \nAmo leggere, ascoltare musica, la cucina etnica, la montagna e la fotografia- che non pratico ma apprezzo da umile spettatrice ahahaha\nSe qualcuno (con interessi simili ma anche no) avesse voglia di fare amicizia, vedersi un museo o girare per le librerie mi faccia sapere :)\n\n\n",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1q7aqsf/compagnia_per_librerie_e_musei/"
    },
    {
        "id": "1q77pxq",
        "author": "KindheartednessRich1",
        "title": "Ma il mercato del lavoro di Torino fa così schifo?",
        "content": "Ciao a tutti, oggi vorrei capire quanto c'è di vero in questa affermazione che sento dire spesso, dato che a breve mi ritroverò a cercare un lavoro post laurea magistrale. \n\nInvito chi sta cercando un lavoro e chi invece ce lo ha già di raccontarmi la sua esperienza (in quanto tempo ha trovato lavoro, che ambito, se gli/le piace...). Grazie mille in anticipo! ",
        "upvotes": 16,
        "comments": 36,
        "media": null,
        "permalink": "/r/torino/comments/1q77pxq/ma_il_mercato_del_lavoro_di_torino_fa_così_schifo/"
    },
    {
        "id": "1q7gcgz",
        "author": "futureaddict8",
        "title": "nightlife",
        "content": "Ciao! I was interested in some information about Torino’s nightlife, basically i want to know if it is suitable for someone that is really social and enjoys a good nightlife(not something crazy like ibiza but still have choices and events to attend)",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1q7gcgz/nightlife/"
    },
    {
        "id": "1q7r1cw",
        "author": "Famous-Print7360",
        "title": "Hai esperienza con Joivy?",
        "content": "Ciao a tutti,\nMi chiedevo: qual è la vostra esperienza con Joivy?\nHo trovato un post su Joivy di un anno fa in questo subreddit: le persone sembrano aver avuto un'esperienza davvero positiva. Tuttavia, la maggior parte delle recensioni recenti su Google sembrano essere negative.\n\nQuindi mi chiedevo: qualcuno ha prenotato di recente con Joivy e potrebbe condividere la sua esperienza?\nPosso fidarmi?\n\nVorrei prenotare una camera con loro per un periodo piuttosto lungo, quindi vorrei evitare brutte esperienze...\n\nGrazie!!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1q7r1cw/hai_esperienza_con_joivy/"
    },
    {
        "id": "1q7b2z2",
        "author": "AxelRowley",
        "title": "Cerco assemblaggio pc a torino",
        "content": "Ciao a tutti! Qualcuno saprebbe chi potrei contattare per assemblare un pc a domicilio? Possiedo già tutti i componenti necessari ma non ho possibilità di andare in un centro per procedere al montaggio.",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1q7b2z2/cerco_assemblaggio_pc_a_torino/"
    },
    {
        "id": "1q7heqo",
        "author": "quarta_g",
        "title": "la barriera di Trofarello fa pagare se esci a Santena?",
        "content": "oggi sono passato per la A55 ma alla barriera di Trofarello ho passato il bancomat e non mi ha addebitato nulla, è normale che non faccia pagare o è anomalo?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1q7heqo/la_barriera_di_trofarello_fa_pagare_se_esci_a/"
    },
    {
        "id": "1q76jqu",
        "author": "Extension-One-2771",
        "title": "Incontrare persone come un tedesco",
        "content": "Ciao a tutti,\n\n\nVolevo chiedere dove posso andare per incontrare gente italiana. Le persone che incontro al lavoro sono tutte molto gentili, ma purtroppo non hanno tempo libero. Domani vado a un piccolo concerto, quindi forse avrò un po' di fortuna. Sono tedesco, faccio molta musica, sono molto socievole e cerco persone rilassate 🫠 Ci sono piccoli locali per eventi organizzati da collettivi? Se sì, come ci arrivo?\n\n\nGrazie per i consigli!!",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1q76jqu/incontrare_persone_come_un_tedesco/"
    },
    {
        "id": "1q7it59",
        "author": "Witty_Elk_9814",
        "title": "Ragazzi di san salvario?",
        "content": "Ciao, M17 di San Salvario sud, c'è qualche ragazzo/ragazza interessati a fare amicizia, magari uscire per andare a bere qualcosa.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1q7it59/ragazzi_di_san_salvario/"
    },
    {
        "id": "1q6rfs5",
        "author": "gufhao",
        "title": "Terra Madre Slowfood Festival",
        "content": "Ciao a tutti! 😊\nSono di Berlino e vorrei andare con alcuni amici a fine settembre al *Terra Madre Salone del Gusto* a Torino.\n\nQualcuno ha consigli, raccomandazioni o esperienze da condividere?\n\nGrazie mille! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1q6rfs5/terra_madre_slowfood_festival/"
    },
    {
        "id": "1q6ddpe",
        "author": "lllllloro",
        "title": "Non ricordo il nome",
        "content": "Tre o quattro anni fa mi avevano parlato di un associazione (credo) che si occupava di orientamento psicologico. Praticamente offrivano la possibilità di fare un colloquio di persona per indirizzare chi volesse iniziare un percorso verso uno specialista adatto alle sue esigenze ed ai suoi obbiettivi. Se non sbaglio ricevevano all’aula studio dei murazzi.\nQualcuno se ne ricorda e sa dirmi se esiste ancora?",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1q6ddpe/non_ricordo_il_nome/"
    }
]