[
    {
        "id": "1jucgre",
        "author": "WarfareA24",
        "title": "Hey /r/movies! We're Ray Mendoza and Alex Garland, co-directors of A24's upcoming WARFARE. Alex has also directed EX MACHINA, ANNIHILATION, MEN, and CIVIL WAR. WARFARE stars Joseph Quinn, Will Poulter, Charles Melton, Kit Connor, Cosmo Jarvis, Michael Gandolfini and more. Ask us anything!",
        "content": "",
        "upvotes": 220,
        "comments": 242,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7ljbfe7qulte1.png?auto=webp&amp;s=43431f53455ea22b13d63191f8dafb02bd992516"
        },
        "permalink": "/r/movies/comments/1jucgre/hey_rmovies_were_ray_mendoza_and_alex_garland/"
    },
    {
        "id": "1jxy5se",
        "author": "BunyipPouch",
        "title": "Official Discussion Megathread (Warfare, Drop, The Amateur, Freaky Tales) + 25th Anniversary Discussions (Ready to Rumble, Return To Me, Rules of Engagement)",
        "content": "**New Theatrical Releases**\n\n[Warfare ](https://www.reddit.com/r/movies/comments/1jwev1e/official_discussion_warfare_spoilers/)\n\n[Drop](https://www.reddit.com/r/movies/comments/1jwevax/official_discussion_drop_spoilers/)\n\n[The Amateur](https://www.reddit.com/r/movies/comments/1jwev63/official_discussion_the_amateur_spoilers/)\n\n[Freaky Tales](https://www.reddit.com/r/movies/comments/1jwevax/official_discussion_drop_spoilers/)\n\n**25th Anniversary Throwback Discussion Threads**\n\n[Ready to Rumble](https://www.reddit.com/r/movies/comments/1jwewks/official_throwback_discussion_ready_to_rumble/)\n\n[Return to Me](https://www.reddit.com/r/movies/comments/1jwewhk/official_throwback_discussion_return_to_me/)\n\n[Rules of Engagement](https://www.reddit.com/r/movies/comments/1jwewf2/official_throwback_discussion_rules_of_engagement/)",
        "upvotes": 19,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1jxy5se/official_discussion_megathread_warfare_drop_the/"
    },
    {
        "id": "1jy6hgd",
        "author": "MarvelsGrantMan136",
        "title": "Official 30th Anniversary Posters for ‘A Goofy Movie’",
        "content": "",
        "upvotes": 981,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/47hintygilue1.jpeg?auto=webp&amp;s=e3abd42c1ac1f303e33f7f86716965d08aaae10d"
        },
        "permalink": "/r/movies/comments/1jy6hgd/official_30th_anniversary_posters_for_a_goofy/"
    },
    {
        "id": "1jy0aoc",
        "author": "P3ptide",
        "title": "The HBO movie \"2073\" used the sound clip known as \"Loud Nigra\" online as a fill in for a protester getting beat up, lol",
        "content": "",
        "upvotes": 1222,
        "comments": 88,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zg6k0s1jdjue1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1jy0aoc/the_hbo_movie_2073_used_the_sound_clip_known_as/"
    },
    {
        "id": "1jxv0bj",
        "author": "dresoccer4",
        "title": "About Time (2013) - he’s already rich!",
        "content": "Just started watching About Time and, early on, he asks his dad why he can’t use his power to get rich, and his dad said no! You must use your powers for your hobbies and work a normal job though or else you’re cursed or something. \n\nHe says this as he spends the entire summer sunbathing on the massive back lawn of his English chateau and playing tennis on private grass courts overlooking the sea. \n\nI thought it was a joke at first because they’re obviously extraordinarily rich, but he was actually complaining that he couldn’t use his power to get even more rich. Anyone else find this perplexing? ",
        "upvotes": 2416,
        "comments": 258,
        "media": null,
        "permalink": "/r/movies/comments/1jxv0bj/about_time_2013_hes_already_rich/"
    },
    {
        "id": "1jxo2dr",
        "author": "indiewire",
        "title": "'A Minecraft Movie' Director Supports The Chaos That's Happening During Theater Screenings of His Film",
        "content": "",
        "upvotes": 4518,
        "comments": 750,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WP90HhamO-A8XhEeoA5EEpkCcxVDON0WntNyHCgUzDE.jpg?auto=webp&amp;s=2b60c1fd2e91f374abe7f93858e838512c0e6de8"
        },
        "permalink": "/r/movies/comments/1jxo2dr/a_minecraft_movie_director_supports_the_chaos/"
    },
    {
        "id": "1jxjp5d",
        "author": "cmaia1503",
        "title": "New image of Aaron Taylor-Johnson &amp; Alfie Williams in Danny Boyle’s ‘28 Years Later’",
        "content": "",
        "upvotes": 6331,
        "comments": 374,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nx4t2bau8fue1.jpeg?auto=webp&amp;s=f0f5b0194bc9bf49078f6a401eb98d1c63547eb0"
        },
        "permalink": "/r/movies/comments/1jxjp5d/new_image_of_aaron_taylorjohnson_alfie_williams/"
    },
    {
        "id": "1jxygpv",
        "author": "The_ZombyWoof",
        "title": "There are weird, 80s art house movies, and then there is The Lair of the White Worm (1988) - For those times when you absolutely need to see Peter Capaldi fight a vampire with bagpipes.",
        "content": "",
        "upvotes": 577,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XXw0EzCd37wN-WxTql9Vz9d3eq8P4r1tw-ceIp9nv3c.jpg?auto=webp&amp;s=91a5b04fcca0b287abfa04eb54b625cc5646bc8e"
        },
        "permalink": "/r/movies/comments/1jxygpv/there_are_weird_80s_art_house_movies_and_then/"
    },
    {
        "id": "1jxo3bm",
        "author": "ChiefLeef22",
        "title": "Actor's Actor Nicky Katt ('Dazed and Confused', 'Insomnia', 'A Time to Kill') Has Died At 54",
        "content": "",
        "upvotes": 2654,
        "comments": 301,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ke77bLjuBiVGczO0K3qM39GhBsbN4IkvTkqcDJt4JhM.jpg?auto=webp&amp;s=8880cc24b680d4f34425af6e356f9f41031514f6"
        },
        "permalink": "/r/movies/comments/1jxo3bm/actors_actor_nicky_katt_dazed_and_confused/"
    },
    {
        "id": "1jxy1d0",
        "author": "16car",
        "title": "Which movie? A soldier wakes up in hospital in 1946, with a paper cut?",
        "content": "Grandfather is trying to find a movie he loved, possibly as long ago as the 1960s. It involves an American soldier waking up in an English hospital in 1946. \n\nAs the movie goes on, the audience discovers that he's actually in a German hospital in 1945, and the war is still on. \n\nThe protagonist realises he's being lied to, and it's still 1945, when he notices he still has a paper cut he got before he lost consciousness.\n\nETA: I said \"36 hours\" out of the blue, and the old man's face lit up. We're hoping to find it, and watch it tonight. Thank you!",
        "upvotes": 561,
        "comments": 51,
        "media": null,
        "permalink": "/r/movies/comments/1jxy1d0/which_movie_a_soldier_wakes_up_in_hospital_in/"
    },
    {
        "id": "1jy9fkv",
        "author": "keepfighting90",
        "title": "The Lives of Others (2006) is incredible",
        "content": "The Lives of Others, or *Das Leben der Anderen*, is a German movie that came out to a lot of critical acclaim in 2006, and eventually won the Best International Film Oscar over Pan's Labyrinth. I finally got around to watching it, and ended up loving it. Highly recommended to anyone looking for an intelligent, mature historical drama with fantastic performances\n\nThe summary is as follows: In 1983 East Berlin, dedicated Stasi officer Gerd Wiesler begins spying on a famous playwright and his actress-lover Christa-Maria. Wiesler becomes unexpectedly sympathetic to the couple, and faces conflicting loyalties when his superior takes a liking to Christa-Maria.\n\nWhile the above makes the movie sound like a spy thriller, it really is more of a character study with social commentary. There are some thriller-esque elements to it, and the movie *can* be pretty tense at times - this isn't really the focus however, as it's more concerned with making a point about the impact of a political and socially repressive regime on its people, whether they're against it or are complicit in supporting it. \n\nThe performances are what really make this such a great experience. Ulrich Mühe as Wiesler is fantastic, especially considering how restrained and low-key the role is. He expresses so much with just his eyes and facial expressions alone. It almost feels like he created this entire person on screen without saying a single word about his personality, because pretty much all of his dialogue is strictly about the work he does. Sebastian Koch and Martina Gedeck are really good in their roles as well.\n\nThis is definitely a slow-burn narrative that grows in power and impact as it moves along. Honestly, for the first hour or so, I thought it was just \"good\" - well-acted and directed, but not really exceptional in any way. But halfway through, it hits another gear, the screws are tightened around the characters and it gradually transforms into a tense, anxiety-inducing story before eventually ending up as a bittersweet tragedy. \n\nI also have to applaud the ending, as it's one of the most cathartic and emotional conclusions to a movie I've seen in a while. The scene in the bookstore, with Wiesler going \"it's for me\" and the camera freezing on his face for a while - just beautifully done.\n\nAny other fans of this movie?",
        "upvotes": 53,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1jy9fkv/the_lives_of_others_2006_is_incredible/"
    },
    {
        "id": "1jxxix9",
        "author": "Sisiwakanamaru",
        "title": "Bryce Dallas Howard's New Documentary Uncovers the Emotional Ties Between Humans and 'Pets'",
        "content": "",
        "upvotes": 429,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/idSlxQJn0iPCczebFUS2BQEsI2enbIwnJOEmN8oKGT0.jpg?auto=webp&amp;s=dfffb249102e5704742cc423ff71b03b17525d10"
        },
        "permalink": "/r/movies/comments/1jxxix9/bryce_dallas_howards_new_documentary_uncovers_the/"
    },
    {
        "id": "1jyb411",
        "author": "Donbeakant",
        "title": "Recommend classic dark comedies like Fargo",
        "content": "I’ve seen Fargo about 2-3 times before but it had been a while so I watched it again because I couldn’t remember how it unravelled and ended. \n\nWhat I love about this movie is how Marge (Frances McDormand) and her husband never bring work home.\nDialogues are fantastic and acting is phenomenal. \n\nOne of my favourite scenes: \nCarl (Steve Buscemi) calls Jerry (William Macy), says there’s a problem. Jerry asks, “How’s Jean?” Carl pauses and goes, “Who’s Jean?”\nKilled me. \nHe didn’t even know the name of the woman he kidnapped.\n\nAll the ‘yeaaaah’’s always stuck. The accents also did play a huge part in making the movie so loveable. \nThey should do a serious sequel with Scotty (the son) and how he grows up all messed up. \n\nI love Steve Buscemi and William Macy together. (They’ve done a few more movies together but I haven’t watched any of them)\n\nI’d love to watch more classics like this. Please recommend.\n",
        "upvotes": 33,
        "comments": 72,
        "media": null,
        "permalink": "/r/movies/comments/1jyb411/recommend_classic_dark_comedies_like_fargo/"
    },
    {
        "id": "1jxf29i",
        "author": "StevenSanders90210",
        "title": "Warner Bros. Discovery's David Zaslav's Pay Rises to $52 Million",
        "content": "",
        "upvotes": 4626,
        "comments": 442,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vqxYOmQ3D63_7pKVmE4rRNgxoce_1R49ao0IwTFrxRY.jpg?auto=webp&amp;s=40230cd744989b00622e0ba3700faf314363ad2a"
        },
        "permalink": "/r/movies/comments/1jxf29i/warner_bros_discoverys_david_zaslavs_pay_rises_to/"
    },
    {
        "id": "1jxpgbd",
        "author": "mayukhdas1999",
        "title": "Official Poster for 'ELSE' - A reclusive young man and his outgoing new acquaintance, find themselves trapped in an apartment together when a mysterious virus causes people’s bodies to merge with objects. As the world outside falls into chaos, they must confront this terrifying new reality together",
        "content": "",
        "upvotes": 806,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8wmwb3m6ufue1.jpeg?auto=webp&amp;s=33e5a89b89ac02a9f58519b3faf6e3971830fe33"
        },
        "permalink": "/r/movies/comments/1jxpgbd/official_poster_for_else_a_reclusive_young_man/"
    },
    {
        "id": "1jxt2ct",
        "author": "mystery5009",
        "title": "Give me an absurd comedy.",
        "content": "I love comedies, especially those with an absurd plot. Like, Hot Rod, movie about a guy who thinks he's the son of a stuntman and therefore tries to perform stunts, but unsuccessfully, he also tries to save money for his stepfather's medical treatment, so that he can kick his ass so that he recognizes him as his son, or An American Pickle, about a man from 1920 who got into the modern world because he was canned in brine. In general, can you name your favorite absurd comedies?",
        "upvotes": 426,
        "comments": 1394,
        "media": null,
        "permalink": "/r/movies/comments/1jxt2ct/give_me_an_absurd_comedy/"
    },
    {
        "id": "1jyas0p",
        "author": "Phantom_Play",
        "title": "The Phantom of the Opera (1925) - 100th Anniversary",
        "content": "The Phantom of the Opera (1925) 100th Anniversary\n\nA movie that has a complicated history. Lost versions, found footage, remade with sound, the opening scene of a man holding a lantern etc.\n\nIt premiered September 6th 1925 in New York City. Lon Chaney’s most famous role and unfortunately last time playing the a monster for Universal. ",
        "upvotes": 17,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cCdiSIgxMlj3c0ChQKcUysaizhNN4jwgG0c8J-uxN50.jpg?auto=webp&amp;s=7746e1baf8dcafe83dcc76bbf6ebd1aac9215910"
        },
        "permalink": "/r/movies/comments/1jyas0p/the_phantom_of_the_opera_1925_100th_anniversary/"
    },
    {
        "id": "1jxmkqd",
        "author": "Abtino11",
        "title": "Terminator 2 hits so much harder as an adult.",
        "content": "I was born in 1993, my first time watching Terminator 2 was with my family (when age appropriate, probably 10 years old or so lol) in preparation for us going to the Universal Studios theme park where they had the Terminator 3-D experience (does that even exist anymore?). \n\nMy brothers and I became obsessed and would literally put the DVD in just to watch the Minigun/Helicopter scene or the Motorcycle/Truck chase through the storm drains. \n\nWatched it with my wife last night, it’s probably been at least 15 years since I watched it front to back, I could still quote most lines but now that I’m an adult with a career, wife and pets that depend on me it felt completely different. \n\nThe scene that hit me the hardest was Sarah Connor attacking Miles Dyson’s house. The man is brilliant, successful, has a beautiful house/family and is a part of a groundbreaking technology but also oblivious to the potential that this technology makes him “responsible for the death of 3 billion people” because it hasn’t happened yet. Why would he have thought of that? At the end he’s willing to sacrifice himself for the good of mankind. \n\nSkynet doesn’t even feel that farfetched at this point, in fact it’s probably going to be worse considering there’s no politics involved in the movie. \n\nI feel like my perspective on the movie completely changed from someone that idolized Arnold for being a badass to realizing how scary the reality is of the situation. \n\nAll of this is not mentioning the acting, special effects cinematography and everything that helped make the movie such an incredible experience. I hate to say it but it’s as close to a perfect movie if I’ve ever seen one. \n",
        "upvotes": 1033,
        "comments": 245,
        "media": null,
        "permalink": "/r/movies/comments/1jxmkqd/terminator_2_hits_so_much_harder_as_an_adult/"
    },
    {
        "id": "1jy6zth",
        "author": "Common-Anxiety",
        "title": "Comedy movie suggestions as I'm having a difficult time finding something that isn't just leaning on shock humour. I think I have a broad scope of genres with comedy that I like, even horror or thrillers, so long as the main focus is the comedy. (No spoilers please)",
        "content": "Looking for more comedy movies and TV shows to watch as I'm kind of at a loss to find more. Here is a extensive list of comedy movies I like ranging from horror comedy to slapstick in no particular order. I'll also list at the end what I'm not looking for.\n\nFreaky\n\nKeeping Mum\n\nGoing in Style\n\nSome Like it Hot\n\nMy Favorite Brunette\n\nRoad to Bali\n\nKung Fu Panda\n\nGroundhog Day\n\n8 Heads in a Duffle Bag\n\nElf (although that's more of a Christmas movie)\n\nBlackbeards Ghost\n\nWeekend at Bernie's \n\nThe Invention of Lying\n\nThe Man Who Knew Too Little\n\nReady or Not\n\nThe Frighteners\n\nRenfield\n\nGalaxy Quest\n\nIT crowd (series)\n\nSupernatural (comedy episodes such as Mystery Spot and Bad Day At Blackrock)\n\nFrasier (such as The High Holidays)\n\nPaul\n\nThe Last Supper (1995)\n\nThe Brand New Testament\n\nUp in Smoke\n\nThe Pink Panther (2006)\n\nVamps\n\nWalk of Shame\n\nDharma and Greg\n\nThe Simpsons (in general)\n\nBuffy The Vampire Slayer (movie but also the series has some funny episodes)\n\nDeath Becomes Her\n\nMy Favorite Martian\n\nPlains Trains and Automobiles\n\nYes man\n\nGhost town\n\nEven almighty\n\nTucker and Dale VS Evil\n\nWhat We Do In The Shadows (TV series, the movie was ok)\n\nClue\n\nI DONT like comedy's that rely on a lot of shock, nudity or gross out humour such as as Movie 54.\n\nI'm not a fan of comedy movies that have a focus on relationships BUT if there is a big element of humor such as Even Almighty I'm cool with it.\n\nI also like dark comedy but again it has to have a lot of humor such as Groundhog day.\n\nI'm good with comedy movies that have a lot of gore in such as Tucker and Dale vs Evil, Ready or Not and Freaky.\n\nI'm good with slapstick humor such as Pink Panther 2006, Death Becomes Her and Plains Trains and Automobiles.\n\nPlease help me find more comedy movies (and no spoilers please!), if you have any questions I'd be happy to answer.\n\nEdit: I also liked\nHot Fuzz but not Shaun of The Dead or Worlds End\n\nMonty Python and The Holy Grail\n\nStan VS Evil\n\nRed Dwarf\n",
        "upvotes": 19,
        "comments": 213,
        "media": null,
        "permalink": "/r/movies/comments/1jy6zth/comedy_movie_suggestions_as_im_having_a_difficult/"
    },
    {
        "id": "1jxomw0",
        "author": "Rurikar1016",
        "title": "We need more movies like Dungeons and Dragons. Especially in this era.",
        "content": "I recently rewatched the movie, put it on as background noise, but found myself looking at it critically. I realized just how good of a movie it is and not just based off being a fan of DND. There’s so much to like about this movie even if you don’t like or care about DND.\n\nThe dialogue is tight. The plot is simple, but endearing. Characters are defined quickly and are all played really well. You can feel the sincerity and fun they had being these characters and being in the movie. \n\nWith Snow White being all over with comments from the actress disparaging romance in movies. I like how the movie counters the romantic plot being needed without having to call attention to it. I especially love Ed and Holga’s relationship and how naturally platonic it is without needing one of them being secretly in love with the other or something cliche like that. I love how it ties into the overall plot as well with Ed realizing Holga was the mother his daughter loved and deserved. It reinforces the platonic dynamic and gives you an alternative family dynamic without feeling like it needs to justify it or parade it around unlike other movies that see it as a selling point. \n\nAll in all, this movie is amazing and something we need more of. I need another movie with this much depth and sincerity. ",
        "upvotes": 536,
        "comments": 97,
        "media": null,
        "permalink": "/r/movies/comments/1jxomw0/we_need_more_movies_like_dungeons_and_dragons/"
    },
    {
        "id": "1jy2ljh",
        "author": "FilmWaffle-FilmForum",
        "title": "Which small budget movies are a great example of cost efficient filmmaking?",
        "content": "For example, Incendies (2010) had a budget of $6.5 million dollars, which isn’t a “small” budget per se but considering it looks and feels larger scale than most Hollywood blockbusters, I’d say it was an extremely cost efficient production. \n\nObviously, actors salaries can take up a large percentage of a films budget. Makes you wonder how much better movies would look if they focused on the film itself rather than casting the most “on trend” actors. \n\nWhat other examples can you think of?",
        "upvotes": 48,
        "comments": 155,
        "media": null,
        "permalink": "/r/movies/comments/1jy2ljh/which_small_budget_movies_are_a_great_example_of/"
    },
    {
        "id": "1jxosfr",
        "author": "Retrofusion11",
        "title": "Heat (1995) is the most epic crime film I have ever seen",
        "content": "i want to differentiate that I don't think its the best crime film, but in terms of sheer scale its the biggest I have ever seen. from the various characters, subplots, the representation of Los Angeles. To the greatest shootout ever put on in film. Everything about this film is ambitious\n\nOne issue I have with it though is Neil is presented as a highly intelligent and calculated criminal. When he is talking to Michael telling him that he has other sources of income **\"t-bonds, real estate\"** and that he should cut lose. Shouldn't Neil also have other sources of income as well, alternative ways of making money. it almost makes it sound like he is dependent on the bank job and the scores he does, but maybe I am looking into it too much in that scene\n\nAll in All an epic film, and how do you guys feel about Mann trying to get Heat 2 off the ground, He just submitted his script which I assume is based off the book (which i haven't read yet)",
        "upvotes": 419,
        "comments": 109,
        "media": null,
        "permalink": "/r/movies/comments/1jxosfr/heat_1995_is_the_most_epic_crime_film_i_have_ever/"
    },
    {
        "id": "1jxtp1e",
        "author": "Sugar_Plum_Mouse",
        "title": "Wayne’s World",
        "content": "Now this is a classic. It’s been so many years since I’ve seen this movie and I’m telling you it’s still holds up as absolutely being hilarious. It will be Mine . Oh yes, it will be mine. There’s so many memorable one-liners in this movie. It was absolute 90s comedy bliss. this was top tier  comedy for me when I was younger. It’s streaming on Paramount+.",
        "upvotes": 110,
        "comments": 96,
        "media": null,
        "permalink": "/r/movies/comments/1jxtp1e/waynes_world/"
    },
    {
        "id": "1jxh90r",
        "author": "BunyipPouch",
        "title": "Alan Ritchson &amp; Arnold Schwarzenegger Christmas Comedy 'The Man With The Bag' Gets October 3 Theatrical Release Date",
        "content": "",
        "upvotes": 580,
        "comments": 68,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3WT8iXUnKzPyK6tpzzQsSg3t3FXHTAd5LdfZCmvtKRA.jpg?auto=webp&amp;s=98e5e7e061f321afffc9af1cfd5006aa3551ea66"
        },
        "permalink": "/r/movies/comments/1jxh90r/alan_ritchson_arnold_schwarzenegger_christmas/"
    },
    {
        "id": "1jx8ze9",
        "author": "Sonia341",
        "title": "Warner Bros. Confirms New ‘Gremlins’ Movie and ‘Beetlejuice Beetlejuice’ Sequel",
        "content": "",
        "upvotes": 2938,
        "comments": 753,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xFY8a4j0L1cSZ530I0Gl-todRIOanX6TGteWf6fBdaU.jpg?auto=webp&amp;s=01ec31b4c4f75831b59c3201d5816050cfc9f54e"
        },
        "permalink": "/r/movies/comments/1jx8ze9/warner_bros_confirms_new_gremlins_movie_and/"
    },
    {
        "id": "1jxvqxf",
        "author": "Martipar",
        "title": "The Back to the Future Trilogy. The perfect trilogy.",
        "content": "Today is day two of a three day BTTF rewatch. Yesterday i watched BTTF, i've just finished watching BTTF 2 and tomorrow i'll watch 3.\n\nI have seen all three films multiple times, I have read and watched all sorts of behind the scenes trivia and details about them. I know these films and yet they, especially 2, are flawless. I know what to look for, the subtle clues that all is not as it seems and even knowing what i'm looking at and where I still either don't notice or it's not distracting.\n\nFor example i know at some point Marty appears to have three hands, i didn't notice as I was so engrossed in the film I forgot to look.\n\nThe dinner scene is still my favourite scene, it is so perfect, you have three copies of Michael J. Fox interacting around the same table and even knowing that and seeing the scene multiple times over pretty much all my life I still find it utterly perfect. As a young child I didn't realise Marlene was also played by Michael J. Fox, i thought they got an actress in. I realised later on though, possibly the third or fourth time I watched it,\n\nThere is a scene just as they arrive back in 1985 and the car lands and turns into a driveway, in real life this is a model landing then the lamppost is used to cover up the transition between model and real car yet it is superb, i have watched the scene many times and yet its perfect, it is so smooth. [See it here](https://youtu.be/rhNDsPMaK_A?t=454) I have watched it frame by frame and it's still flawless. \n\nThen there are the plot threads, there are no loose ends, it just all works, there are elements used from the first film and in 2 there are setups for scenes in 3. Everything is neat, Well apart from the second car in the third film but i'm sure the lack of spare parts for a DeLorean in the 1950s stopped them from cannibalising it for parts, it's mostly just an educated guess though.\n\nI love the first film, I do, the little changes in the 1980s setup in the 1950s are really quite nice and they add much to a rewatch. Like I said though, the second film is the best, utterly amazing, some of the effects are a bit dated but so are the effects in Jason and the Argonauts and I still watch that. I'm not going to criticise any old film for dated effects, it's not like they had access to modern tech.\n\nAnyway if, for some bizarre reason, you have not seen these films go and watch them.",
        "upvotes": 58,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VZbQ16xRmTTMAqzwKmmOYeSbU2_nKVuo1c94Oa8sFIA.jpg?auto=webp&amp;s=8511a0e4c044772d5fc7178ed23daf87a839e3c3"
        },
        "permalink": "/r/movies/comments/1jxvqxf/the_back_to_the_future_trilogy_the_perfect_trilogy/"
    },
    {
        "id": "1jy64ei",
        "author": "Fit_Crazy9458",
        "title": "The Art of The Late NIght Movie",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gTJsvvjrUFainFJsnAWKjpott8eTmAdjdcQ20GkpjGA.jpg?auto=webp&amp;s=4fa827e9ca3e1ada4d5b6a7b8bbb4b205a6fbd44"
        },
        "permalink": "/r/movies/comments/1jy64ei/the_art_of_the_late_night_movie/"
    },
    {
        "id": "1jxr2l7",
        "author": "mayukhdas1999",
        "title": "Official Poster for Joel Potrykus's 'VULCANIZADORA' - Two friends trudge through a Michigan forest with the intention of following through on a disturbing pact. Once their plan goes shockingly awry, the haunting consequences of their failure can't stay hidden for long",
        "content": "",
        "upvotes": 81,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gnxkdo18sfue1.jpeg?auto=webp&amp;s=ae0feae89b9c9cafccd399d009422e305c2232bc"
        },
        "permalink": "/r/movies/comments/1jxr2l7/official_poster_for_joel_potrykuss_vulcanizadora/"
    },
    {
        "id": "1jybskj",
        "author": "Moist_Operation6462",
        "title": "Should live actions stay true to the original?",
        "content": "I have watched a few live action remakes recently and have noticed many changes in plot and charachters that aren't congruent with the cherished original. \n\nSometimes I feel that the live action should almost just be a copy of the animated version just with real people. Don't change the plot or character arc or anything. Don't even try to change the lines too much, just stick to what works. I'm looking at you Avatar the Last Airbender. \n\nDo you agree, live actions should be almost exact copies of the original, or disagree, they should make something new? ",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1jybskj/should_live_actions_stay_true_to_the_original/"
    },
    {
        "id": "1jyb8y3",
        "author": "railway_me",
        "title": "Movie tips for what Im looking for?",
        "content": "Anyone has some ideas? I would love a movie where there are people living in the present or even the past, that have wolf, tiger, lions, powerful animals as conpanions that help them fight and protect them. I just love movies with animals that fight and protect humans. It has to be available on Netflix, amazon prime video or sky.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1jyb8y3/movie_tips_for_what_im_looking_for/"
    },
    {
        "id": "1jxlyjw",
        "author": "mayukhdas1999",
        "title": "First Poster for 'SONS OF THE NEON NIGHT' starring Takeshi Kaneshiro - A detective goes against the successor to a drug-trafficking crime syndicate, who aspires for a society free of drugs by orchestrating anarchy in Hong Kong | A film by Juno Mak ('Rigor Mortis')",
        "content": "",
        "upvotes": 136,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z2bzfl7nqfue1.jpeg?auto=webp&amp;s=875643926260a3ee02e17e581184a081ebfb165e"
        },
        "permalink": "/r/movies/comments/1jxlyjw/first_poster_for_sons_of_the_neon_night_starring/"
    },
    {
        "id": "1jxmbho",
        "author": "mystery5009",
        "title": "Which biopic do you like despite the historical inaccuracy?",
        "content": "Do you have a film of this genre that you liked, despite the fact that the film may not follow historical facts very well?\n\nFor me, it's Spike Lee's \"Blackkklansman.\" This is a good crime thriller based on a true story about Ron Stallworth, a black policeman who infiltrated the ranks of the Ku Klux Klan in the 70s. But it's full of historical inaccuracies. Starting from the minor ones, like the fact that Ron's partner wasn't Jewish. And starting with the fact that the whole bomb storyline was invented for a movie and hiding the fact that Ron had been the mole in the Black Panthers for much longer.",
        "upvotes": 121,
        "comments": 295,
        "media": null,
        "permalink": "/r/movies/comments/1jxmbho/which_biopic_do_you_like_despite_the_historical/"
    }
]