[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1kc1pnd",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 25,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1kc1pnd/la_piola_friends_meetup/"
    },
    {
        "id": "1knckwr",
        "author": "MatteVat25",
        "title": "Ha un senso?",
        "content": "Questa è una delle principali vie trafficate della città. Come si vede dalla foto, la corsia è talmente larga che quasi sembrerebbe fatta per due auto affiancate... peccato che in realtà due non ci stanno.\nNon ci sono linee che separano le corsie, quindi è tecnicamente una corsia singola, solo spropositatamente larga. Il risultato? Chi guida si mette un po' dove capita, creando confusione e rischi.\nPerché fare una corsia così larga se poi non è pensata per due veicoli?",
        "upvotes": 32,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/89mxaolz2z0f1.jpeg?auto=webp&amp;s=a6befc87a82a696d07d3bc4862fa1b327d11bcf8"
        },
        "permalink": "/r/torino/comments/1knckwr/ha_un_senso/"
    },
    {
        "id": "1knovyo",
        "author": "Pablo65t",
        "title": "Notturni per 2 chiacchiere?",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1knovyo/notturni_per_2_chiacchiere/"
    },
    {
        "id": "1kndi5l",
        "author": "tommodacoolio",
        "title": "Solo In Torino 22nd May - 26th May",
        "content": "Ciao a tutti\n\nNext Thursday I will arrive in your beautiful city on a solo trip for about 4 days. Usually when I go on my solo city breaks I use apps such as meetup etc as well as Reddit and getting chatting to strangers in bars etc.\n\nIf anyone who is also on a trip here or a local who lives here would like to get a drink, food, explore the city etc then please drop me a message. I am 32M from the UK.\n\nI appreciate that some people would not be comfortable meeting a random person online, which is why I would also like to ask for recommendations regarding which places, areas, bars and pubs are good for meeting people solo? (I don't do nightclubs personally)\n\nI am looking forward to exploring and eating my way around your fantastic city and I am particularly looking forward to trying tajarin, agnolotti and drinking bicerin as well as seeing the view from Chiesa di Santa Maria del Monte dei Cappuccini.\n\nIt will also be my birthday whilst I am in Torino so looking to treat myself to some fantastic good and great experiences.\n\nI've done a bit of research but I'm still open to all kinds of recommendations.\n\nGrazie",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1kndi5l/solo_in_torino_22nd_may_26th_may/"
    },
    {
        "id": "1kn1uyl",
        "author": "VecchiaPrugna",
        "title": "Com’è Avigliana?",
        "content": "Mi rivolgo a chi ci vive, ci ha vissuto o comunque conosce un po’ la città.\nDa un punto di vista turistico sicuramente è interessante, ma com’è viverci?\nCosto della vita, servizi, vita sociale, come sono le persone… raccontatemi 😊",
        "upvotes": 15,
        "comments": 28,
        "media": null,
        "permalink": "/r/torino/comments/1kn1uyl/comè_avigliana/"
    },
    {
        "id": "1kmmquk",
        "author": "Chiaraphsi",
        "title": "Cane abbandonato a Torino",
        "content": "Ciao ragazzi, 2 giorni fa questa cagnolina è stata abbandonata in pieno giorno a Torino. In zona Corso Casale.\nLa signora che l'ha abbandonata l'ha legata ad una grata di un'associazione cinofila. Purtroppo non abbiamo fatto in tempo a beccarlo sul fatto, perché era già scappata. \nLa piccola è terrorizzata, non ha microchip, non ha collare con il nome...ha iniziatl a mangiare solo ieri sera.\nPer fortuna è stata recuperata immediatamente da persone esperte e oggi è stata anche dal veterinario. \nSono davvero senza parole per il gesto di questa signora, ma la cucciola ora è in mani super sicure. Probabilmente verrà adottata a breve ma sarebbe davvero importante conoscere il suo nome per poterla tranquillizzare e farla sentire più a casa.\nSe qualcuno di voi l'ha mai vista in zona, o per caso conoscesse la situazione, non importa davvero sapere perché o per come, ma almeno conoscere il nome. \nForza reddit, magari ci riusciamo 💜",
        "upvotes": 132,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ipi3fhr3ks0f1.jpeg?auto=webp&amp;s=904114cbd813b027713c161e8474de21d161c2a0"
        },
        "permalink": "/r/torino/comments/1kmmquk/cane_abbandonato_a_torino/"
    },
    {
        "id": "1knbn69",
        "author": "marmelade_von_circe",
        "title": "acommodationnn",
        "content": "hi everyoneee, i m 23 and i have the possibility to visit torino from july 14 to september 13,  ill be doing traineeship at the uni there. i will be applying for university's dorms too but what are your reccommendations about finding a place to rent in turin? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1knbn69/acommodationnn/"
    },
    {
        "id": "1knafzn",
        "author": "Jynxmyqueen",
        "title": "Iliad: 5g VS 4g",
        "content": "Ciao a tutti, qualcuno sa dirmi se valga la pena passare al 5g di iliad per migliorare la ricezione? Ho sempre avuto Pixel (il 6, l'8 e ora il 9 pro) e sempre avuto il 4g. Ma in metro è una tragedia (praticamente tutta la tratta da principi d'acaja fino a Bengasi). Per non parlare di Villa della Regina, li prende assolutamente niente anche all'aperto. Mi chiedevo se passare al 5g migliorasse la situazione o se invece mi convenga tenermi la mia offerta da 7€",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1knafzn/iliad_5g_vs_4g/"
    },
    {
        "id": "1kn2m50",
        "author": "blackv0idd",
        "title": "AURORA RESISTE",
        "content": "Ciao ragazzi\n\nVolevo condividere con voi un bel gruppo whatsapp, soprattutto per chi vive in zona aurora! \n\nhttps://chat.whatsapp.com/J0pzVyhNhX43XevwPHCCTH\n\n",
        "upvotes": 6,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VK3SyXg5Xl6YrbsSz0AJwiw_XYrYZufjMC5xacCR0f4.jpg?auto=webp&amp;s=14f76b063b72e7fe31f76ae287f5d19f57e6ac50"
        },
        "permalink": "/r/torino/comments/1kn2m50/aurora_resiste/"
    },
    {
        "id": "1kn208p",
        "author": "grovio8888",
        "title": "Cinema All'Aperto",
        "content": "Ciao! \nForse sono io che non riesco a trovare nulla, ma è possibile che Torino - città che ha il museo nazionale del cinema - non abbia in programma serate di cinema all'aperto per l'estate? \nQualcuno sa qualcosa a proposito?\nGrazie ",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1kn208p/cinema_allaperto/"
    },
    {
        "id": "1knatba",
        "author": "LIB8RATO",
        "title": "Costo del servizio",
        "content": "Ciao a tutti! Qualcuno può per favore darmi un'idea del costo del servizio per raccogliere vecchie suture di mobili e vecchia cucina con elettrodomestici per la spazzatura e l'utilizzo? Qualcuno ha avuto un'esperienza recente? Grazie. Qualsiasi informazione aiuta. Il mio preventivo è di oltre 1200, è troppo alto?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1knatba/costo_del_servizio/"
    },
    {
        "id": "1kn7pz0",
        "author": "Legalsaurus_55",
        "title": "Looking for friends in Torino and students from Turin University",
        "content": "Italiano qui sotto. Hello, everyone! I'm an incoming student in Turin University. I will be there in September and would like to find someone from there. Either current international students who could help me with my enrollment issues or anyone else to be friends and make a good acquaintance. I'm 22 y.o. male, lawyer and, if believing my friends, quite a good friend:). Feel free to contact me!  P.S. If this is not an appropriate subreddit, please let me know!\n\n Ciao a tutti! Sono uno studente in arrivo all'Università di Torino. Sarò lì a settembre e vorrei trovare qualcuno di lì. O studenti internazionali che possano aiutarmi con i miei problemi di iscrizione o chiunque altro con cui stringere amicizia e fare una buona conoscenza. Ho 22 anni, sono un avvocato e, a dire il vero, un ottimo amico :) Non esitate a contattarmi! P.S. Se questo non è un subreddit appropriato, fatemelo sapere!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kn7pz0/looking_for_friends_in_torino_and_students_from/"
    },
    {
        "id": "1kncz94",
        "author": "Hour_Nose2840",
        "title": "Il nuovo canale per fare amicizia e incontrarsi - Broken Chat",
        "content": "Ciao a tutti, sono uno sviluppatore e ultimamente ho creato questa piattaforma per trovare persone nei dintorni con cui fare amicizia.  \nIl progetto è nato a Bologna e volevo condividerlo anche qui a Torino, spero vi piaccia e che soprattutto sia utile a qualcuno se vuole fare amicizia e nuove conoscenze in una grande città.  \nNessuna email o registrazioni complesse sono necessarie, basta solo un nickname!\n\nLink: [Broken Chat](https://broken.chat)",
        "upvotes": 0,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y24xy5v63z0f1.png?auto=webp&amp;s=c6fe6a3fc1767cebf462859891635e9bd2e7e206"
        },
        "permalink": "/r/torino/comments/1kncz94/il_nuovo_canale_per_fare_amicizia_e_incontrarsi/"
    },
    {
        "id": "1kn5h6c",
        "author": "jollanza",
        "title": "Muoversi a Torino – Portale dell’infomobilità di Torino",
        "content": "",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1kn5h6c/muoversi_a_torino_portale_dellinfomobilità_di/"
    },
    {
        "id": "1kn2lgn",
        "author": "sweetener6",
        "title": "Meeting and dating!",
        "content": "Hi, I’d like to ask where in Turin can I meet foreigners or Italians who speak English? Honestly, so far I’ve only been to the Vogue Club, but the guys there were only looking for something casual, which I’m absolutely not into.\nWhere do you usually go if you're looking to meet someone seriously?\nDo you think there’s even a chance for that here in Turin?\n",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1kn2lgn/meeting_and_dating/"
    },
    {
        "id": "1kmqwqn",
        "author": "devilseden",
        "title": "Live music?",
        "content": "(English below) \nCiao a tutti!\nSarò presto a Torino (domani lol) e mi chiedevo se conoscete bar o caffè che offrono musica dal vivo gratuita. Inoltre, esiste una pagina Instagram o Facebook che pubblica gli eventi del giorno in città? Mi piacerebbe seguirla per rimanere aggiornato.\nGrazie in anticipo!\n\nHey everyone!\nI’ll be in Torino soon (tomorrow lol) and I was wondering if you know any bars or cafés that offer free live music. Also, is there an Instagram or Facebook page that posts daily events happening in the city? I'd love to follow something like that to stay updated.\nThanks in advance!\n\n\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kmqwqn/live_music/"
    },
    {
        "id": "1kmsy75",
        "author": "eventi_del_tano",
        "title": "evento per socializzare",
        "content": "Ciao ragazzi il 29 maggio ci sarà un evento creato appositamente per fare nuove amicizie, si svolgerà in Sansalvario",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Wi-LZInPoAFXQzurKlzVgDzMdAx1zUNyycqcd8s3cxY.jpg?auto=webp&amp;s=c0f2f57db62914ae5e68017e37c9cd8919160c94"
        },
        "permalink": "/r/torino/comments/1kmsy75/evento_per_socializzare/"
    },
    {
        "id": "1kmjv3y",
        "author": "Kayabiko",
        "title": "D&amp;D campaign looking for players (and a host)!",
        "content": "Ciao [r/torino](https://www.reddit.com/r/torino/), sono di nuovo io che propongo campagne per giocatori stranieri/Erasmus, questa volta D&amp;D 5e! Il resto del messaggio sarà in inglese - giocatori italiani che vogliono entrare sono benvenuti ma la priorità sarà data ai non-italiani data la rarità dei GDR in inglese a Torino.\n\nHi guys, I'm looking for 4/5 players to host a D&amp;D 5e campaign set in a homebrew 1920s setting! It will be a themed campaign in which the characters are detectives working for the local police department - very detective noir, full of action, car chases and a little bit of X-Files-type paranormal investigations. The only thing I need is someone to host at their house, as I like to play music during sessions and I can't do that at a gaming bar, on top of some hearing issues. Thank you in advance for anyone wishing to host!\n\nThe campaign is still work in progress but I'm starting to look for players to get the ball rolling. Feel free to message me if you're interested, reach me also on Telegram: username Fraticoso, or on Discord: username [zu.lu](http://zu.lu/), and please take a look at this [quick introduction](https://docs.google.com/document/d/10oMzKXclHCJdA3ba9Y78swscgFX43OJPEm1TpKNiXh8/edit?usp=sharing) I wrote if you'd like to join.\n\nPlease share this and forward this so people who'd like to play D&amp;D but don't speak Italian can play 🫡",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kmjv3y/dd_campaign_looking_for_players_and_a_host/"
    },
    {
        "id": "1kminf7",
        "author": "Normalfed86",
        "title": "alla ricerca di pallet",
        "content": "A scuola di mio figlio devono fare diversi lavoretti e le maestre hanno richiesto a noi genitori di procurarci dei pallet.\n\nConoscete qualche attività commerciale/supermercato in zona San Salvario/Nizza Millefonti/Crocetta dove potremo recarci per prenderne alcuni senza troppe difficoltà? Grazie",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1kminf7/alla_ricerca_di_pallet/"
    },
    {
        "id": "1kmiisn",
        "author": "IlGattoViaggiatore",
        "title": "Il 37° Salone Internazionale del Libro di Torino",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8hTwOxnelRuvY43UM5ILCJksv2KF1R4bnvHvJM-z34E.jpeg?auto=webp&amp;s=0d1cbaddc9281c17e980d386935d236081a6381d"
        },
        "permalink": "/r/torino/comments/1kmiisn/il_37_salone_internazionale_del_libro_di_torino/"
    },
    {
        "id": "1kmlar8",
        "author": "gamma50g",
        "title": "Great chocolates, Vegetarian street food and food options in Torino",
        "content": "Im not a coffee drinker but where can I find good hot cocolaye and amazing chocolates?\n\nWhat great vegetarian food restaurants are there at Torino? \n\nAnd what are the vegetarian street foods I shouldnt miss in Torino?\n\nThanks!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1kmlar8/great_chocolates_vegetarian_street_food_and_food/"
    },
    {
        "id": "1kmhx9q",
        "author": "actuallymensamensa",
        "title": "Football in Torino",
        "content": "Ciao!\n\nVisiting Torino over the weekend with two friends from university. We love football, especially finding new lower division teams, and would love to know if any clubs other than Torino FC and Juventus have matches soon. Always enjoy seeing smaller venues and having more local experiences. Thanks in advance for any recommendations! ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kmhx9q/football_in_torino/"
    },
    {
        "id": "1kmn9gh",
        "author": "Deurox",
        "title": "Eurovision final",
        "content": "Ciao,\n\nIs there a good place in/around the center to watch the Eurovision final?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1kmn9gh/eurovision_final/"
    },
    {
        "id": "1kmmw6l",
        "author": "Obvious-Return-4282",
        "title": "CANALI MEET UP TELEGRAM.",
        "content": "Come da titolo cerco. Solo gente seria, come lo sono io. ",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1kmmw6l/canali_meet_up_telegram/"
    },
    {
        "id": "1km8gec",
        "author": "-Spinal-",
        "title": "Graffiti??",
        "content": "Ho preso il FlixBus a Torino; e passa per zone che di solito non vedo.\n\nLa quantità di “graffiti” è spaventosa. Neanche fatti bene, solo frasi ed imbratti senza stile. \n\nMi porta alla domanda. Vedendo un messaggio politico imbrattato sul muro; a me almeno, porta a disassociarmi con quel messaggio. \n\nSe vedo “liberiamo la pizza” in un modo così vandalico, non voglio la pizza libera…\n\nQuindi cos’è l’obiettivo???",
        "upvotes": 11,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1km8gec/graffiti/"
    },
    {
        "id": "1kma7jv",
        "author": "enrico451",
        "title": "Il rimborso tasse di Unito?",
        "content": "Qualcuno l’ha ricevuto? I 90 gg previsti per il rimborso sono ormai diventati 180?",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1kma7jv/il_rimborso_tasse_di_unito/"
    },
    {
        "id": "1kma1gv",
        "author": "EdgelordMcMeme",
        "title": "Qualcuno ha idea del perché dei continui blackout vicino a Santa Giulia?",
        "content": "Già il secondo nel giro di una settimana, ogni tanto ci sono dei periodi dove succede ogni tre per due e spesso la corrente non torna per anche più di un'ora, in tutto il quartiere semafori compresi",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1kma1gv/qualcuno_ha_idea_del_perché_dei_continui_blackout/"
    },
    {
        "id": "1kmc5kv",
        "author": "Winter-Western-8526",
        "title": "Scuole danza a Torino",
        "content": "Ciao! Sono una ragazza di 20 anni che vorrebbe tornare a fare un po’ di ballo.\nVolevo chiedere se qualcuno conoscesse una scuola di danza valida dove potrei rivolgermi. \nUna scuola che comprenda più di tipi di danza (moderna, contemporanea, hip hop etc)\nGrazie :)",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1kmc5kv/scuole_danza_a_torino/"
    },
    {
        "id": "1kmbutv",
        "author": "everythingisplanned",
        "title": "Smaltimento dei rifiuti elettronici in città",
        "content": "Ciao! Dove posso smaltire i rifiuti elettronici in città (preferibilmente a San Salvario o in Centro)? Ho un vecchio caricabatterie per laptop e alcune batterie.\nGrazie",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1kmbutv/smaltimento_dei_rifiuti_elettronici_in_città/"
    },
    {
        "id": "1kmcssh",
        "author": "lemiche_",
        "title": "Zona Filadelfia",
        "content": "Ciao a tutti, da settembre mi trasferirò a Torino per la magistrale in economia. Non conoscendo la città, com’è l’ambiente universitario (in particolare la scuola di management)? Come quartiere è tranquillo e in generale come lo definireste? Grazie  ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1kmcssh/zona_filadelfia/"
    },
    {
        "id": "1kmcb9b",
        "author": "mario_grondaia",
        "title": "Cercasi consiglio fisioterapista",
        "content": "Come da titolo sto cercando un fisioterapista sportivo per togliere una contrattura ai lombari/erettori di destra, per info faccio powerlifting ed ho necessità perché gareggio fra un mese e mezzo e mi sta limitando negli allenamenti. Non devo fare riabilitazione né niente, è già successo più volte in passato e solitamente basta solo una sessione di massaggio, al massimo pistola.\nGrazie in anticipo 🙏",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1kmcb9b/cercasi_consiglio_fisioterapista/"
    }
]