[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1no8nef",
        "author": "NervousDependent177",
        "title": "Dolce casa di Torino corso vittorio 260 euro per nulla!!!",
        "content": "Si tratta di una vera truffa paghi per non avere nulla .non cascateci",
        "upvotes": 16,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1no8nef/dolce_casa_di_torino_corso_vittorio_260_euro_per/"
    },
    {
        "id": "1nokd8t",
        "author": "Hot_Score3868",
        "title": "Cos'è il Balon?",
        "content": "Salve, voglio visitare per la prima volta Torino e qui ho visto dei post parlare del Balon. Ma cos'è? Un posto interessante?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1nokd8t/cosè_il_balon/"
    },
    {
        "id": "1nofwfn",
        "author": "Professional_Law28",
        "title": "Stampa 3d al dettaglio?",
        "content": "Conoscete una tipografia o uno studio che si occupa parzialmente o interamente di stampa 3d al dettaglio? O magari siete voi degli stampatori 3d? Esistono dei servizi online affidabili? Ho provato fiverr e altri servizi simili ma la maggior parte ti fa anche il design, cosa di cui non ho bisogno, che gonfia un botto il prezzo. Devo stampare in linea di massima solo 4-5 master per dei dadi. Grazie a tutti per l'aiuto. ",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1nofwfn/stampa_3d_al_dettaglio/"
    },
    {
        "id": "1nod6fm",
        "author": "Charming_Egg_5299",
        "title": "Consigli ristorante proposta matrimonio",
        "content": "Questa settimana vorrei fare la proposta alla mia ragazza e sto cercando un ristorante a Torino o zone limitrofe con una bella atmosfera/vista e buon cibo. Insomma, qualcosa che lasci un bel ricordo. Qualcuno ha consigli? ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1nod6fm/consigli_ristorante_proposta_matrimonio/"
    },
    {
        "id": "1noh3e4",
        "author": "FelipeMestre",
        "title": "Trip to Turim",
        "content": "Hi,  \nMy name is Felipe and I’ll be visiting Turin in February 2026 on my first trip to Europe.  \nIt’s a business trip, but I’ll have plenty of time for leisure, so I’m hoping to experience some of the local cuisine, attractions, and the everyday things people who live there actually do — not just the overpriced tourist stuff.  \n\nIf you have any recommendations for parties, restaurants, cafés, museums, shops, etc., they would be greatly appreciated!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1noh3e4/trip_to_turim/"
    },
    {
        "id": "1nodcy5",
        "author": "Ibrahimt51",
        "title": "Cheapest place to buy from",
        "content": "Hey, I am a student and I should arrive in Turin next week, as most students I'm on a budget and I would like to know the cheapest places to get food and all different groceries from, preferably from stores near Porta Nuova/San Salvario area, thank you! ",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1nodcy5/cheapest_place_to_buy_from/"
    },
    {
        "id": "1no5tzf",
        "author": "Phanetis",
        "title": "Casa Mirafiori nord, lezioni Palazzo Nuovo",
        "content": "Ho preso una stanza in zona Mirafiori nord, ma ho lezione a Palazzo Nuovo. Scelta poco avveduta data la distanza, ma dopo settimane di ricerca ho colto la prima occasione che sembrava finalmente concretarsi, perché sfinita dalle inconcludenti situazioni in cui mi sono trovata ormai innumerevoli volte. \nOra, quale sarebbe il modo più semplice e veloce per raggiungere l’università dalla mia zona (restringo il campo: dalle parti di Piazza Pitagora)? \nOgni aiuto è apprezzato, grazie!! ",
        "upvotes": 3,
        "comments": 37,
        "media": null,
        "permalink": "/r/torino/comments/1no5tzf/casa_mirafiori_nord_lezioni_palazzo_nuovo/"
    },
    {
        "id": "1nnxsms",
        "author": "fede2409",
        "title": "Cerco opportunità per conoscere nuove persone a Torino",
        "content": "Ciao,\nAbito a Torino da 35 anni e negli ultimi 4 anni ho viaggiato assiduamente per l'Europa per cui ho perso molti contatti a Torino e molte amicizie si sono trasferite all'estero nel frattempo.\nContinuo a viaggiare spesso e trovo particolarmente difficile conoscere nuove persone in questa città.\nConoscete eventi/serate/gruppi/siti dove fare nuove conoscenze (no intendo tinder, o siti di incontri)?\n\nGrazie!\n",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nnxsms/cerco_opportunità_per_conoscere_nuove_persone_a/"
    },
    {
        "id": "1noaa90",
        "author": "ImpressedGuy95",
        "title": "Corsi Scuola Holden",
        "content": "Ciao! Qualcuno di voi potrebbe darmi dei pareri sui corsi della Scuola Holden? In.modo particolare un corso di sue giorni intitolato \"Meditazione e creatività, Mente, corpo, cuore.\"\n\nHo sentito molti parrei contrastanti e vorrei capire se qualcuno che ha avuto esperienza con questo tipo di corsi saprebbe dirmi se è interessante o un corso fuffa.  \n",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1noaa90/corsi_scuola_holden/"
    },
    {
        "id": "1no8qkg",
        "author": "Pretend_Steak_4210",
        "title": "Accomodation Near ESCP Turin",
        "content": "Hi , I am from India and i will be visiting Turin for Spring semester next Year. Can Someone tell me good places near ESCP turin for accomodation costing about 400-500 Euro. Also How can i Book these apartments( I dont have card to make payments in Euro right now)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1no8qkg/accomodation_near_escp_turin/"
    },
    {
        "id": "1nnqgnz",
        "author": "_L_-",
        "title": "La metro sta scioperando?",
        "content": "La metro sta scioperando? C'è ancora bordello in giro? Tra poco dovrei attraversare Torino e volevo capire la situazione ",
        "upvotes": 10,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1nnqgnz/la_metro_sta_scioperando/"
    },
    {
        "id": "1nnj8fm",
        "author": "SamSamuele",
        "title": "Gli affitti per studenti hanno rotto il cazzo",
        "content": "",
        "upvotes": 21,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1nnj8fm/gli_affitti_per_studenti_hanno_rotto_il_cazzo/"
    },
    {
        "id": "1nnnyeu",
        "author": "Murky_Giraffe8700",
        "title": "Non esiste un'app per segnalare i veicoli che commettono infrazioni?",
        "content": "Da dove vengo io, abbiamo un'applicazione che permette di scattare una foto di un'auto e inviarla alle autorità competenti affinché intervengano.\n\nEsiste qualcosa di simile qui?   \n  \nSe non esistesse, inizierò a crearlo",
        "upvotes": 6,
        "comments": 66,
        "media": null,
        "permalink": "/r/torino/comments/1nnnyeu/non_esiste_unapp_per_segnalare_i_veicoli_che/"
    },
    {
        "id": "1no29ps",
        "author": "glorious-ahole",
        "title": "Do they allow you to cycle on old lingotto factory?",
        "content": "Hey guys, i am new to turin and I'm very much into cycling. So i was looking for some places where they only allow cycles. No pedestrians or cars. I found they have opened the old fiat lingotto factory's racecourse to people. So i was wondering if they allow you to cycle there",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1no29ps/do_they_allow_you_to_cycle_on_old_lingotto_factory/"
    },
    {
        "id": "1nnherx",
        "author": "Subject-Store-1982",
        "title": "Vorrei trasferirmi in una città più grande",
        "content": "Ciao sono un ragazzo di 20 anni e abito in un piccolo paese in provincia di Bergamo e vorrei trasferirmi in una città più grande, \nPer avere più opportunità lavorative, di svago e servizi ma comunque stare in una città dove senza fare troppa strada posso raggiungere la montagna o comunque posti in mezzo alla natura dato che ogni tanto mi piace stare in mezzo a verde.\nVoi cosa mi consigliate? Dove abitate e consigliereste la vostra città?\nScrivetemi i vari pro e contro della vostra città\n(Ovviamente se abitate in una città grande ) \nMilano la scarto a prescindere perché troppo costosa e non me la potrei permettere, volevo anche evitare Bergamo città perché volevo spostarmi un po' dalla mia zona, e stavo pensando a Torino.\nSento tanta gente che ne parla e tanta che ne parla male soprattutto sento chiunque dire che Torino è bella ma  la gente che ci vive non lo è, e non so se è così in tutta l'Italia o solo li.\nDatemi per favore la vostra opinione ed esperienza.\nGrazie mille ",
        "upvotes": 13,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1nnherx/vorrei_trasferirmi_in_una_città_più_grande/"
    },
    {
        "id": "1nnkvxt",
        "author": "Omyrr",
        "title": "Need a lawyer",
        "content": "Hello everyone, I am an international student in Torino and I need a lawyer for both commercial and civil cases. Do anyone of you know a lawyer who help students with very affordable prices or a hardcore leftist who won’t charge a penny for racist issues. ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nnkvxt/need_a_lawyer/"
    },
    {
        "id": "1nnygek",
        "author": "Cultural_Raisin_260",
        "title": "Dj neofiti/emergenti o anche esperti di torino. aiuto!!!!",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nnygek/dj_neofitiemergenti_o_anche_esperti_di_torino/"
    },
    {
        "id": "1nnx6my",
        "author": "No-Disaster-2966",
        "title": "Valutazione collana di corallo",
        "content": "Ciao a tutti!\nHo una vecchia e grossa collana di corallo antica e vorrei farla valutare. Ha la chiusura d'oro 18 carati ed è abbastanza antica. Conoscete qualche negozio di Torino che tratta questo genere di articoli? \nGrazieee",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nnx6my/valutazione_collana_di_corallo/"
    },
    {
        "id": "1nmxx01",
        "author": "Murky_Giraffe8700",
        "title": "Violenza al Balon",
        "content": "Oggi al Balon (3PM) ho vissuto una situazione assurda e frustrante. \n\nUn uomo nordafricano, completamente ubriaco, ci ha urlato contro solo perché stavamo passando, cercando persino di spingerci e colpirci.\n\nIn più, poco distante, due ragazzi marocchini gridavano alle donne che entravano al Balon dalla parte di Barriera.\n\nMa dove sono la polizia o comunque delle misure di sicurezza che possano garantire un minimo di tranquillità?\n\nÈ inaccettabile che scene del genere siano ormai “normali” per tutti\n\nNon riesco a immaginare di essere donna e passare davanti di qui sola da notte",
        "upvotes": 109,
        "comments": 175,
        "media": null,
        "permalink": "/r/torino/comments/1nmxx01/violenza_al_balon/"
    },
    {
        "id": "1nnug8s",
        "author": "Fresh-Ruin-5487",
        "title": "Aiuto per trovare un autista",
        "content": "Ciao! La prossima settimana io e la mia ragazza ci trasferiamo in Spagna. Abbiamo deciso di farlo in auto, dato che abbiamo alcuni scatoloni e valigie. Il problema è che nessuno dei due ha la patente e assumere un autista professionista è incredibilmente costoso. Esiste un'app dove è possibile trovarne uno a un prezzo ragionevole? Grazie in anticipo.",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1nnug8s/aiuto_per_trovare_un_autista/"
    },
    {
        "id": "1nns8n1",
        "author": "heromatte",
        "title": "Pagamento GTT sui mezzi non scalato dalla carta",
        "content": "Sono nuovo di Torino, e mi è capitato sti giorni di prendere 3-4 biglietti sui mezzi pagando col contactless direttamente sul mezzo, ma sul conto non mi sono stati scalati ancora i soldi.\n\nÈ normale? O ho sbagliato qualcosa nell’acquistare i biglietti?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1nns8n1/pagamento_gtt_sui_mezzi_non_scalato_dalla_carta/"
    },
    {
        "id": "1nnqknt",
        "author": "Lost_Letter112",
        "title": "Traduzione ufficiale per documenti scolastici?",
        "content": "Ciao a tutti,avrei bisogno di tradurre delle pagelle scolastiche ,e dei certificati di alcune attività, in inglese,perchè il processo per entrare all'università all'estero dove voglio studiare, lo richiede:la traduzione deve perciò essere ufficiale/giurata.Qualcuno conosce alcuni nomi di servizi/associazioni a cui rivolgersi?E' la prima volta che ho necessità di tradurre documenti,perciò non saprei proprio dove andare.Grazie mille",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nnqknt/traduzione_ufficiale_per_documenti_scolastici/"
    },
    {
        "id": "1nnf07p",
        "author": "EuphoricPrinciple134",
        "title": "Ricerca di tesi",
        "content": "Ciao, sono una studentessa di Psicologia Clinica (F32) e sto conducendo una tesi di ricerca in Psicologia per cui sto reclutando partecipanti (non psicologi e non studenti di psicologia) a Torino. La ricerca si tiene in presenza. Se sei interessatə scrivimi",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1nnf07p/ricerca_di_tesi/"
    },
    {
        "id": "1nnnrhn",
        "author": "m0rningst4r420",
        "title": "tekno a Torino?",
        "content": "Ciao a tuttx!! Sono una studentessa fuorisede e volevo capire dove trovare free party interessanti. Se qualcuno vuole farmi compagnia per andare sarebbe top!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nnnrhn/tekno_a_torino/"
    },
    {
        "id": "1nmx59j",
        "author": "RevolutionaryLog3631",
        "title": "Questa cosa davanti alla mia finestra. Voi capite che cos'è?",
        "content": "https://preview.redd.it/y0zzo6cvsjqf1.jpg?width=1728&amp;format=pjpg&amp;auto=webp&amp;s=d647221a657975d9f46d3ca15cbc8c978fb9b23e\n\ncalcolate che è in cima ad un albero almeno 12-15metri.\n\nCosi pensavo che qualcuno avesse lanciato da un 5-7° piano un qualcosa.\n\nPoi guardando la foto mi sembra una roba tipo i nidi di alcuni uccelli?\n\nVoi riuscire a capire? mi sembra inquietante anche perchè e poco distante dalle finestre di casa mia :D",
        "upvotes": 19,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1nmx59j/questa_cosa_davanti_alla_mia_finestra_voi_capite/"
    },
    {
        "id": "1nmpl96",
        "author": "Iaco_V8",
        "title": "Cosa ne pensate del nuovo sistema bibliotecario BI.TO?",
        "content": "Come ben saprete, il BI.TO è il nuovo sistema bibliotecario che, oltre a essere il più grande d’Italia, unisce le biblioteche delle BCT e dello SBAM.  \nCon un’unica tessera si può ora accedere a oltre 130 biblioteche, ampliando notevolmente la scelta di contenuti.\n\nPersonalmente trovo l’idea ottima, ma al momento mi crea un po’ di confusione per i seguenti motivi:\n- Sotto ogni libro compaiono tantissime biblioteche, sia di Torino che della cintura, e bisogna cliccare più volte per capire dove è effettivamente disponibile.  \n- Non essendo ancora attivo il prestito tra Torino e cintura, devo controllare manualmente che il libro sia presente in una biblioteca torinese per poterlo prenotare e ritirare.  \n- Un’altra cosa che mi manca sono le liste dei nuovi arrivi per ogni singola biblioteca, che prima aiutavano molto a orientarsi.\n\nE voi cosa ne pensate? Preferite il sistema vecchio o quello nuovo? Pensate che in futuro riusciranno a renderlo più intuitivo, come lo era prima?",
        "upvotes": 43,
        "comments": 35,
        "media": null,
        "permalink": "/r/torino/comments/1nmpl96/cosa_ne_pensate_del_nuovo_sistema_bibliotecario/"
    },
    {
        "id": "1nmvo8s",
        "author": "Miserable_Crow7085",
        "title": "se sei di Torino io e i miei amici facciamo un mercatino l’11 e il 12 ottobre!",
        "content": "Iscriviti al form se sei interessato 🌷 https://forms.gle/NUo8VzFDb26aX8cEA",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wC7eM1iQxMZb5kCzmlJD48-bn8jVxu6yautVEdwWbVQ.png?auto=webp&amp;s=9ddaae4d2cfb094a2490dfd807fb3496ad0b8a2f"
        },
        "permalink": "/r/torino/comments/1nmvo8s/se_sei_di_torino_io_e_i_miei_amici_facciamo_un/"
    },
    {
        "id": "1nnawtk",
        "author": "Icy-Distribution-765",
        "title": "Visiting Torino for Juve vs Milan",
        "content": "Hi, I’ll be visiting Torino from Canada in October for the game against Milan….my wife will go to Venezia so I’ll be on my own for the match day. Wondering if there are people who want to connect and maybe I can go to Allianz with locals, and maybe I meet some people that I can stay in touch for my future trips to Torino? I’m also learning Italian and can communicate a bit in Italian. Fino alla fine, forza Juve🤍🖤",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nnawtk/visiting_torino_for_juve_vs_milan/"
    },
    {
        "id": "1nmvngz",
        "author": "Frengo_17",
        "title": "Sport",
        "content": "Ciao a tutti, conoscete un posto dove fare sport all'aperto vicino a corso unione sovietica, parlo di un parco con attrezzi come sbarra ecc...",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nmvngz/sport/"
    },
    {
        "id": "1nmtr56",
        "author": "jdrin28",
        "title": "Come trovare casa in affitto a Torino (Venaria per la precisione)",
        "content": "Come avete fatto a trovare una casa in affitto (bi o trilocale a circa 500/60/€ al mese) nella zona di Venaria? I vari immobiliare ecc. non stanno dando i risultati sperati",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nmtr56/come_trovare_casa_in_affitto_a_torino_venaria_per/"
    }
]