[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 478,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hm18t3",
        "author": "AutoModerator",
        "title": "NFL Christmas Gameday Megathread",
        "content": "1:00pm ET - Kansas City Chiefs @ Pittsburg Steelers\n\n4:30pm ET - Baltimore Ravens @ Houston Texans",
        "upvotes": 36,
        "comments": 616,
        "media": null,
        "permalink": "/r/netflix/comments/1hm18t3/nfl_christmas_gameday_megathread/"
    },
    {
        "id": "1hof2qz",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game season 2 is the first show in history to be #1 in 93/93 countries",
        "content": "",
        "upvotes": 445,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1hof2qz/squid_game_season_2_is_the_first_show_in_history/"
    },
    {
        "id": "1homj8d",
        "author": "ashekyux",
        "title": "I didn't expect this message ",
        "content": "",
        "upvotes": 25,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1homj8d/i_didnt_expect_this_message/"
    },
    {
        "id": "1hon4p1",
        "author": "Zeroyhme",
        "title": "More Squid Game Season 1 vs Season 2 Comparisons (Updated)",
        "content": "",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hon4p1/more_squid_game_season_1_vs_season_2_comparisons/"
    },
    {
        "id": "1ho0t2y",
        "author": "Robemilak",
        "title": "'Carry-On' Set to Enter Netflix's \"Top 10 of All Time\" Movie List",
        "content": "",
        "upvotes": 220,
        "comments": 145,
        "media": null,
        "permalink": "/r/netflix/comments/1ho0t2y/carryon_set_to_enter_netflixs_top_10_of_all_time/"
    },
    {
        "id": "1hoo407",
        "author": "ItsWillster17",
        "title": "All of my favorite shows are coming to an end next year. 😢😭 Any recommendations on a new series I should get into?",
        "content": "Stranger Things, Cobra Kai, Squid Game and possibly Outer Banks are all coming to an end with their final seasons in 2025. It’s sad because I’ve spent the last few years really being into those. I got into Stranger Things in 2018 and loved it! I got into Outer Banks and Cobra Kai in 2020 and they were both my comfort shows while I was going through a tough time, and Squid Game was a show I discovered in December 2021 through watching Mr. Beast and through my friends who watched it and I have rewatched Squid Game Season 1 at least twice every year since it came out, and I finally watched Season 2 today and Loved that as well! It’s sad because all of the shows I have listed have been shows I’ve been into for years but are now coming to an end. 😓😢😢😓\n\nAnyways, with those shows all coming to an end, does anybody have any other Netflix Originals that are good that I should check out? I’m open to any suggestions. Thank you in advance! 😃😁",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hoo407/all_of_my_favorite_shows_are_coming_to_an_end/"
    },
    {
        "id": "1hnz9w9",
        "author": "Robemilak",
        "title": "Hwang Dong-hyuk confirms that David Fincher is developing an English-language ‘SQUID GAME’ remake set in America",
        "content": "",
        "upvotes": 236,
        "comments": 167,
        "media": null,
        "permalink": "/r/netflix/comments/1hnz9w9/hwang_donghyuk_confirms_that_david_fincher_is/"
    },
    {
        "id": "1honfza",
        "author": "Paparmane",
        "title": "Gi-Hun does absolutely nothing to alter the votes in Squid Game 2, and it’s making me crazy.",
        "content": "The guy has 45 billions to himself. He could literally offer players to give them more money than there is in the bank.\n\nHe does not even try to convince people, he’s the most passive guy ever.  He could have said that even if you win, they might bring you here. That the next game may ask you to kill your allies.\n\nThat the next game may be completely about luck. There is so much more he could do to try.\n\nI am so disappointed in this season. I can’t believe it took 3 years for this. The drama is not interesting, and the entire voting system makes you hate pretty much every character.\n\nThe voting itself makes no sense. Isn’t the goal of the games to entertain rich people? Where’s the fun if everybody decides to go home after one game? ",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1honfza/gihun_does_absolutely_nothing_to_alter_the_votes/"
    },
    {
        "id": "1horfmw",
        "author": "No_Leader1868",
        "title": "Do Netlix games have a precedent on including more supported devices?",
        "content": "Hey everyone!\n\nI'm keeping it short. Civilization 6:Netflix has been out for quite some time now. My gf can download it on her iPad 9. I can't do the same on my Samsung S9 FE, because it is incompatible, although the non-Netflix edition works like a charm.\n\nIs there any news or chance on other devices being included later on?\n\nI have read that you can sideload it, but I won't download random apk-s from websites.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1horfmw/do_netlix_games_have_a_precedent_on_including/"
    },
    {
        "id": "1hokv13",
        "author": "Itsme903",
        "title": "Happy shows? ",
        "content": "Ive gotten tired of the “apocalyptic everything going wrong the characters are always in crisis” adult shows. I just need some happy palate cleansers lol \n\nWould love some recs ",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hokv13/happy_shows/"
    },
    {
        "id": "1hofj4t",
        "author": "Thecumbitch69",
        "title": "\"Your device isnt part of the netflix household\" issue",
        "content": "Preface info : So i live with my parents in a small guesthouse on their property which is a small 15sqm guest house. I use the same account as them, and same internet network although i use a wifi extender. \n\nRecently i have been getting issues with the household thing mentioned in title. This came from nowhere. Have been using the same account without issue for years. Each time i start netflix or my parents start netflix i need to verify the account. \n\nAnybody know what to do? As we are literally the same household. Same adress and everything and according to the law where i live, we literally live in the same household. I even have to use their bathroom as i am just living in the guesthouse in their garden which is just a room basically..... \n\nIts getting a tad annoying for both of us having to verify emails every time the other logs in. ",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hofj4t/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1ho0nhl",
        "author": "yogeshroud",
        "title": "Isn't it crazy to think, Netflix earned about $2.07 billion from anime, nearly double Crunchyroll's $1.16 billion.",
        "content": "Despite crunchyroll's dedicated user base, Netflix’s massive subscriber count of 230 million far surpassing Crunchyroll's 15 million gives it a significant advantage.",
        "upvotes": 46,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1ho0nhl/isnt_it_crazy_to_think_netflix_earned_about_207/"
    },
    {
        "id": "1ho7sbj",
        "author": "Heavy_Committee",
        "title": "Why some of the Netflix movies play on low quality ",
        "content": "I paid for the premium plan and have a good internet connection and some movies won't play on 1080p.\n\nMovies like Panic Room, Thanksgiving, Dumb Money etc\n\nOther movies and shows play on 1080p.\n\nDO YOU GUYS KNOW THE SOLUTION? ",
        "upvotes": 12,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1ho7sbj/why_some_of_the_netflix_movies_play_on_low_quality/"
    },
    {
        "id": "1hon5va",
        "author": "imthat_chavy",
        "title": "Inglorious basterds ",
        "content": "I believe Netflix is showing a version of the film I haven't previously seen,so far I've noticed at least two scenes removed from the film,,has this happened to other films?\nAre there netflix edits?\nOr is it just my imagination failing me?\nHas anyone else noticed this with other films?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hon5va/inglorious_basterds/"
    },
    {
        "id": "1hnjxjj",
        "author": "Robemilak",
        "title": "Netflix execs tell screenwriters to have characters “announce what they’re doing so that viewers who have a program on in the background can follow along”",
        "content": "",
        "upvotes": 535,
        "comments": 149,
        "media": null,
        "permalink": "/r/netflix/comments/1hnjxjj/netflix_execs_tell_screenwriters_to_have/"
    },
    {
        "id": "1homywt",
        "author": "ProgTym",
        "title": "Fewer subtitles on TV than on app",
        "content": "Why is it that on the Netflix app and in the computer browser there are more subtitle options (languages)  available than on my Samsung TV's Netflix app? And it seems it's not the case for all shows because I've watched a few with the specific language but some other shows don't have the language on TV but do in the app/browser.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1homywt/fewer_subtitles_on_tv_than_on_app/"
    },
    {
        "id": "1hopjl0",
        "author": "anonymous231722",
        "title": "Must watch Netflix thriller series!! ",
        "content": "I have watched : stranger Things, Money heist, GOT, Sex education, Wednesday. Recently I watched Alice in borderland and pretty much liked it. I watched The OA and loved it but disappointed that it's not having further seasons.Can you all suggest some more good series to watch with adventure, good plot twists and satisfying ending. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hopjl0/must_watch_netflix_thriller_series/"
    },
    {
        "id": "1hok73z",
        "author": "LordSnuffleFerret",
        "title": "Can't chromecast",
        "content": "So relatively recently, the option to broadcast via Chromecast from my phone (Samsung Galaxy A10s) to a chromecast disappeared.  I've done a little googling and haven't come across anything that helps.\n\nHas anyone encountered this? I can still broadcast Amazon Prime, so I'm not clear what is going wrong.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hok73z/cant_chromecast/"
    },
    {
        "id": "1hok5pm",
        "author": "indiewire",
        "title": "Best Movies of 2024 Streaming on Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hok5pm/best_movies_of_2024_streaming_on_netflix/"
    },
    {
        "id": "1hojd0u",
        "author": "XxLiyahKnowsthingsXx",
        "title": "Anyone else having these issues?",
        "content": "So I have the Netflix app on my ipad &amp; phone and for sometime it allowed me to watch the show I wanted to watch is a corner of the screen while doing something else. Well now I can’t and have no clue how to fix it or if it just changed.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hojd0u/anyone_else_having_these_issues/"
    },
    {
        "id": "1hopynw",
        "author": "bbsomemoney",
        "title": "Squid Game S2 and cliffhanger endings. ",
        "content": "Let’s talk about the cliffhanger. I see a lot of people crying about this. If it made you upset, good. That means it did exactly what it was supposed to do. A cliffhanger’s purpose isn’t to satisfy; it’s to provoke. It’s meant to leave you unsettled, questioning, and desperate for what comes next. If you’re angry or frustrated, it’s because you’re invested.\n\nBinge-watching culture is the real culprit behind your disappointment. When you consume an entire season in a single day, you’re not allowing the story to breathe. The anticipation, the buildup, and the time to process each episode are lost. Without that, of course, you’re going to feel dissatisfied when you don’t get an immediate conclusion. Stories aren’t always meant to be devoured all at once—they’re crafted to unfold over time, and the impact is diminished when you rush through it. \n\nI give the season a 9/10. I was thoroughly entertained. I'm glad it didn't follow the same notes of season 1. The story is progressing naturally and the last episode was effective. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hopynw/squid_game_s2_and_cliffhanger_endings/"
    },
    {
        "id": "1hoers1",
        "author": "FriggenMitch",
        "title": "Anyone have an eta on Splinter Cell Deathwatch ?",
        "content": "“Anyone know the ETA for [Show Name]? Been waiting and can’t find any updates. Hoping someone here has the scoop! Let me know if you’ve heard anything!” lol ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hoers1/anyone_have_an_eta_on_splinter_cell_deathwatch/"
    },
    {
        "id": "1honce8",
        "author": "ramakrishnasurathu",
        "title": "Which Netflix Shows Depict Post-Apocalyptic Societies That Could Benefit From Sustainable Living?",
        "content": "In many post-apocalyptic series, society struggles due to resource depletion. How might the concept of regenerative practices, such as sustainable housing and agriculture, shift the narrative of these dystopian worlds?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1honce8/which_netflix_shows_depict_postapocalyptic/"
    },
    {
        "id": "1hocfb3",
        "author": "Primary-Sir-1004",
        "title": "Squid Game Season 2! ",
        "content": "I finally binged Squid Game Season 2 yesterday, and wow—what a ride! The show and the characters are as gripping as ever, and the twists kept me glued to the screen. But there’s this nagging feeling I can’t shake—like something was missing, or maybe not quite right.\n\nThe story had all the elements of a great follow-up, but I kept thinking: wouldn’t it have been amazing if the detective had shown the picture of his brother’s face earlier in the story? Imagine Gi-hun discovering that the Front Man was the detective’s brother—and instead of immediately trying to blow up the system, he played along in the games to dig deeper.\n\nPicture Gi-hun maneuvering through the games with this knowledge, inching closer to exposing the truth. And then—boom!—a climactic face-off between Gi-hun and the Front Man in the end. The layers of drama, the personal stakes, the moral dilemmas—it could’ve been an incredible payoff for both characters…. May be this is what we will get in season 3! ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hocfb3/squid_game_season_2/"
    },
    {
        "id": "1hntxkj",
        "author": "Spectacularsquid42",
        "title": "Need a good show to binge!",
        "content": "Hey! Me and wifey are looking for a new TV series to binge on we have watched a lot so I’ll reply to comments if I’ve already watched versus trying to remember all the names and listening them. We are pretty open minded when it comes to shows, we have prime and hbo as well! Thank you ! ",
        "upvotes": 23,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1hntxkj/need_a_good_show_to_binge/"
    },
    {
        "id": "1hohdqa",
        "author": "LouisW89",
        "title": "UK TV license for live shows ",
        "content": "I know the official answer to this question. You need a TV license for all live broadcasts. I don't have one. I don't watch live TV or BBC services.\n\nHowever, with WWE coming to Netflix in the new year, I may or may not be interested in watching some broadcasts. \n\nMy question is can and how does the TV Licensing Agency find out if I've watched a live broadcast on Netflix, outside being caught in the act by an agent at the door? ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hohdqa/uk_tv_license_for_live_shows/"
    },
    {
        "id": "1hn2ir0",
        "author": "alkosz",
        "title": "Squid Game Season 2 was actually good",
        "content": "i know a lot of people here hate the second season and admittedly sure its not as good as the first one, however its a pretty close tie. having our antagonist directly involved into the game a second time yet we now know the entire time who it is probably has to be the best writing switch in any series ive ever watched. it was very entertaining not knowing when he'll switch up back to his own side and felt oddly satisfying watching him do so at the end. granted there was barely any sad moments in the series like the first one had, not as memorable of characters but it still got the job done it set out to do. at the end of it all i still wanted to watch more and any series that makes me feel that way deserves a great score.\n\ni would rate the first season a definite 10/10\n\nthis new season is definitely a 8/10\n\ncould've done better, better pacing, better characters and more drama but definitely not bad at all.",
        "upvotes": 1310,
        "comments": 1041,
        "media": null,
        "permalink": "/r/netflix/comments/1hn2ir0/squid_game_season_2_was_actually_good/"
    },
    {
        "id": "1ho7igi",
        "author": "Pokemechanics",
        "title": "What time for new anime episode release?",
        "content": "What time does Netflix release new episodes for anime usually. I'm waiting for Blue Lock episode 37 and 38 specifically. Should be today but it's not released for some reason.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ho7igi/what_time_for_new_anime_episode_release/"
    },
    {
        "id": "1hnwvrl",
        "author": "SpicyTortiIla",
        "title": "Carry on - What did I miss?",
        "content": "Ethan received an earbud from a girl, she is also seen later giving a backpack to the traveler, (I think it was the gas mask and parachute) \n\nWhat happened to her? What about the second bomb? Mateo was boarding with bomb 1. Which was token by the traveler. Am I missing something?",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hnwvrl/carry_on_what_did_i_miss/"
    },
    {
        "id": "1hobgcx",
        "author": "CodingKittenYT",
        "title": "Netflix keeps getting stuck every few minutes ",
        "content": "So i have this issue were every few minutes the netflix app gets stuck and shows a loading percentage but it doesn’t load by itself, the only way to resume play is to press the back button and start playback again then it loads in a few seconds. So i did a network test on our tv and it had a speed of 117 mbps that should be easily sufficient for streaming. I reinstalled the app on our tv signed out and then in again and i did a network reset. Has anyone else had this issue or does anyone know a fix?\nThanks ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hobgcx/netflix_keeps_getting_stuck_every_few_minutes/"
    },
    {
        "id": "1hnnmde",
        "author": "LeBichour",
        "title": "What happened in regards to the quality of Netflix shows these last years ?",
        "content": "I just finished Squid Game season 2 and I really do not understand what is happening at Netflix.\n\nSince 2023, they produced completely terrible seasons of shows that destroyed every single time the subreddits of each of those shows. I’m thinking of : \n\n- Squid Game season 2\n- Outer Banks season 4\n- You season 4\n- The Witcher season 3\n- The Umbrella Academy season 4\n- Sex Education season 4\n- Disenchantment part 5 \n- Virgin River season 6 \n\nDoes someone have an explanation for all of those messes ? Should we be scared for Stranger Things season 5 ?  ",
        "upvotes": 24,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1hnnmde/what_happened_in_regards_to_the_quality_of/"
    }
]