[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 478,
        "comments": 249,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gqkqem",
        "author": "Atlast_2091",
        "title": "The Night Agent: Season 2 | Official Teaser | Netflix",
        "content": "",
        "upvotes": 68,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1gqkqem/the_night_agent_season_2_official_teaser_netflix/"
    },
    {
        "id": "1gqzgsf",
        "author": "Still_Boat_233",
        "title": "Lady Gaga Joins Wednesday Season 2 With Jenna Ortega in Undisclosed Role",
        "content": "",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gqzgsf/lady_gaga_joins_wednesday_season_2_with_jenna/"
    },
    {
        "id": "1gqjzs3",
        "author": "ALVARO39YT",
        "title": "A 70-Million-User Success: Netflix's Ad-Supported Plan Pays Off",
        "content": "",
        "upvotes": 48,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1gqjzs3/a_70millionuser_success_netflixs_adsupported_plan/"
    },
    {
        "id": "1gr084y",
        "author": "mr_blankenship",
        "title": "Mike Tyson and Jake Paul final interview ",
        "content": "Hmmmm.. mikes ambiguity was definitely odd. I means, he’s always odd, but he seemed kinda off.. playing the ‘give absolutely nothing’ card, but it almost looked like he had absolutely nothing. Which is ridiculous of course. Perhaps the micro dose of mushrooms before this interview was a little high.  \nBut yeh jake is an exceptional tool and it’s going to be amazing to see Mike in the ring one more time.\nThoughts ?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1gr084y/mike_tyson_and_jake_paul_final_interview/"
    },
    {
        "id": "1gqwj8e",
        "author": "Movielover718",
        "title": "Emilia Perez ",
        "content": "So what did everyone think?\n\nMy\nOpinion \n\nZoe saldana was great like she always is in things,\nSelena Gomez def showed her acting skills in this movie.\nHer Spanish was terrible lol I know her character is a Mexican who was raised in states but her Spanish was just terrible especially\nConsidering she is actually Mexican!! She should have went to months of Spanish classes before doing this movie cus when she speaks Spanish it’s like she’s reading off the script word by word idk if I’m explaining it right lol it’s doing flow.\n\nThe musical part wasn’t bad except the English musical part with the doctor it was weird overall i give it a 6.5/10 \nI think it should have been a mini series honestly ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gqwj8e/emilia_perez/"
    },
    {
        "id": "1gqrshh",
        "author": "Alan_Stamm",
        "title": "'The Lost Children:' Extraordinary story of four missing kids in Colombian rainforest [3-star review]",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gqrshh/the_lost_children_extraordinary_story_of_four/"
    },
    {
        "id": "1gqq2ao",
        "author": "iPhone13pm",
        "title": "Carry-On | Official Trailer | Netflix",
        "content": "",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1gqq2ao/carryon_official_trailer_netflix/"
    },
    {
        "id": "1gqvldu",
        "author": "Mik_Will",
        "title": "Looking for animated show I can’t remember the name of",
        "content": "As the title suggests I can’t remember the name and I really want to rewatch the show. I’m pretty certain it was on Netflix maybe a Netflix original. It centered around this character who lived in a perfect world with a sentient mountain and his monster friend. He then wakes up forward in time and the current world is ruled by an elephant dictator. The world sucks and his friend is working a boring job. He goes on an adventure to wake up the mountain and eventually ends up in a vampire night club. It was a weird series hope that info can help identify it. Thanks!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gqvldu/looking_for_animated_show_i_cant_remember_the/"
    },
    {
        "id": "1gqn6o6",
        "author": "antoinefbm",
        "title": "Looking for a specific Netflix show from around 2019",
        "content": "I've been looking for a show I had watched at this time but can't remember the name. The main character was a girl and she lived in this poor city under better one that was over a cliff. there was also a sand tornado I think that broke a lot of things in the poor city. to get to the better place, people had to do challenges in a sort of closed building. at the end after the girl wins there's a plot twist which is that to get to that better place, people must get sterilized. ",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gqn6o6/looking_for_a_specific_netflix_show_from_around/"
    },
    {
        "id": "1gpynmr",
        "author": "opheliasdinosaur",
        "title": "Stop first season cliffhangers",
        "content": "Is anyone else ever really frustrated with a good, unique first series that ends on a cliff hanger and then gets cancelled because it didn't hit the top 5 viewing figures in week 1 or 2?\n\nNetflix needs to stop this crap. Either have a rule that all first seasons have a closed story arc or give shows time to build viewership.\n\nGood example - dead boy detectives = I'm devastated there's no season 2, but it was a closed arc, all major ploy points resolved and I don't feel that netflix stole 8 hours of my life.\n\nBad example - the midnight club, or a whole bunch of others that I had on a watch list and then removed when I found out they were cancelled but left on a cliff hanger. I have no incentive to watch them now. \n\nAt least where there is a closed arc, I may still go and watch a cancelled show.\n\nDoes anyone else feel like this?",
        "upvotes": 96,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1gpynmr/stop_first_season_cliffhangers/"
    },
    {
        "id": "1gqr836",
        "author": "West-Weakness-753",
        "title": "Is Standard with ads worth it? Looking for specific shows!",
        "content": "I'm going to be getting netflix again, but after reading that there are limited movies and TV shows, I'm really unsure if what I want to watch will be available. \nI'm wanting to watch The 100, Breaking Bad, The Haunting of Hill House, and Shameless. There's a bunch more, but I can't think of them! \nCan anyone tell me if these are available? And possibly let me know of some good movies or shows that won't be available so I'm prepared? I've tried researching, but literally every result had a different answer. \nPlease spam me with any information! ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gqr836/is_standard_with_ads_worth_it_looking_for/"
    },
    {
        "id": "1gqqd1y",
        "author": "Promax1127",
        "title": "How do I fix this problem ",
        "content": "So I let my friend borrow my account, and when I watch a show it doesn’t save my progress on what part I was in the show, but it does for him. How can I possibly fix this?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gqqd1y/how_do_i_fix_this_problem/"
    },
    {
        "id": "1gq7a6x",
        "author": "LetterheadFun3697",
        "title": "'Avatar: The Last Airbender' Season 2 Finds Its Joo Dee, Long Feng, The Boulder and Casts 'Sympathizer' Star Hoa Xuande",
        "content": "",
        "upvotes": 18,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1gq7a6x/avatar_the_last_airbender_season_2_finds_its_joo/"
    },
    {
        "id": "1gqk51v",
        "author": "Separate_Ad_9223",
        "title": "Quick question ",
        "content": "So my friends and I want to watch the Paul vs Tyson fight at my house and I do not have a Netflix account but one of my friends does. \n\nIs it possible for him to log into his Netflix account for the day at my house so we can watch it here? I’ve heard you can use your Netflix account on vacation so I thought this plan might work.\n\nWe are located in Canada btw I’m not sure if that makes a difference atall.\n\nThanks in advance everyone!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gqk51v/quick_question/"
    },
    {
        "id": "1gqmre9",
        "author": "Mawzipan_",
        "title": "Help finding a show ",
        "content": "Hey all, I recently remembered a show from Netflix and I can not remember what it's called. I watched it a while back. Briefly what I remember is a tomboy ish girl who lives in like a weird house/bunker thing with her parents and I think they were dommsdayers ? She meets some other girl and they try to befriend each other. At some point in the show the girl goes to some meeting and finds out her mother never hugged her/ did the skin to skin contact move with her after birth and thinks that's why she is the way she is. Some of this may be wrong but it's driving me crazy. If anyone knows what this could be plz lmk ! Thanks in Advance ! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gqmre9/help_finding_a_show/"
    },
    {
        "id": "1gpxwsn",
        "author": "D01211",
        "title": "Netflix offers lower quality  for extra members ",
        "content": "I’ve noticed that 4K isn’t available on my account that has been invited as an extra member to a 4K account. Looks like Netflix lowers the quality on the extra account if you purchased the plan with ads even if the main account is 4K. This isn’t communicated anywhere on the website as the website clearly says:\n\nThe same video and audio quality as the member who invited them.\n\nI asked the customer service and apparently you have to contact them in order to find out that the plan you’ve purchased is different to what Netflix advertises. ",
        "upvotes": 52,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1gpxwsn/netflix_offers_lower_quality_for_extra_members/"
    },
    {
        "id": "1gqvmq6",
        "author": "Puzzleheaded2734",
        "title": "Will the Paul vs Tyson fight be available to watch after the fight is over?",
        "content": "I may not be able to watch it live.  Would like to know if it is a live stream only or if there will be streaming available after the fight.  Wonder if it would be available immediately after too or if would take longer to put up for continued streaming.  Avoiding all news and not knowing who won before I have a chance to watch it would probably be a bigger challenge fighting Tyson!",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1gqvmq6/will_the_paul_vs_tyson_fight_be_available_to/"
    },
    {
        "id": "1gqjssh",
        "author": "Hunbjor",
        "title": "Subtitles read differently than actual dialogue ",
        "content": "Long story short, I suffer from a neurological disorder, specifically inattentive ADHD and High-Functioning Autism, so I usually keep subtitles on no matter what language I am watching in. Recently, I noticed subtitles are completely different from what is actually being said on screen. Anybody else?",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1gqjssh/subtitles_read_differently_than_actual_dialogue/"
    },
    {
        "id": "1gqw5iq",
        "author": "EggplantBeneficial12",
        "title": "@netflix can we please have a comment section on episodes ",
        "content": "Imagine processing your favorite show with everyone else who is also processing their favorite show\n\nThe shit talk, the “no she did not just say that”, the “are we all just going to ignore what they said”, the little details that we miss.\n\nRun to the comment section \n\nThoughts?\n",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1gqw5iq/netflix_can_we_please_have_a_comment_section_on/"
    },
    {
        "id": "1gpas31",
        "author": "Kamala_lost",
        "title": "Enough Mark Wahlberg!",
        "content": "He plays the same character in every movie! He's not that charasmatic and in my opinion can't carry a movie alone. He's fine in something like The Departed. He must have one hell of an agent - he is the star in half the movies on Netflix. \n\nAlso, Chris Pratt is not a good voice actor. I wanted to watch the new Garfield movie but can't tolerate his voice acting. \n\nBoth Wahlberg and Pratt are better off in ensemble casts - they're not interesting enough on their own.  ",
        "upvotes": 704,
        "comments": 179,
        "media": null,
        "permalink": "/r/netflix/comments/1gpas31/enough_mark_wahlberg/"
    }
]