[
    {
        "id": "1m31589",
        "author": "NickOffermanAMA",
        "title": "Good Day, reddit, my name is Nick Offerman. You may have seen me in such fare as Parks &amp; Rec, The Last of Us, Civil War, MI: The Final Reckoning, DEVS, or heard my voice in The Lego Movie. I’m here today to discuss a new film in which I am an actor, SOVEREIGN. Ask me anything, please &amp; thank you.",
        "content": "Good Day, reddit, my name is Nick Offerman. You may have seen me as an actor in such fare as *Parks &amp; Rec*, *The Last of Us*, *Civil War*, *Mission: Impossible 8 - The Final Reckoning*, *DEVS*, or *Umbrella Academy* or maybe you heard my voice in *The Great North* or *Smurfs* or *The Lego Movie*. You might also have read one of my five books or seen me perform as a humorist, or maybe you have checked out some of my woodworking at [Offermanwoodshop.com](http://Offermanwoodshop.com)   In any case, I’m here today to discuss a powerful new film from Christian Swegal in which I am an actor, called SOVEREIGN. Ask me anything, please and thank you.\n\nSOVEREIGN is out now.\n\nIn this tense and provocative true-crime thriller inspired by true events, a father and son who identify as \"sovereign citizens\" follow a belief system deeply rooted in distrust of government authority. The pair's view turns deadly after a police confrontation, setting off a tragic chain of events that forces a reckoning with power, principle, and the limits of freedom.\\]\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=\\_T4JHPowGbg](https://www.youtube.com/watch?v=_T4JHPowGbg)\n\nAsk me anything, reddit. Back at 12:00 PM ET.\n\n",
        "upvotes": 48407,
        "comments": 4902,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7gle1rubakdf1.jpeg?auto=webp&amp;s=4b9c51892ca7789dc9384c18d7427976ef85d74a"
        },
        "permalink": "/r/movies/comments/1m31589/good_day_reddit_my_name_is_nick_offerman_you_may/"
    },
    {
        "id": "1mbt6oq",
        "author": "SanderSo47",
        "title": "July 25-27 Box Office Recap – 'The Fantastic Four: First Steps' opens with a fantastic $117.6M domestically. But it disappoints overseas, earning just $99M. Worldwide, 'Jurassic World Rebirth' crosses $700M, 'How to Train Your Dragon' crosses $600M, while 'F1' and 'Superman' cross $500M.",
        "content": "https://preview.redd.it/xsjwl82rooff1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=1e60b1d0bb682648b1530548843f425176fa001e\n\nAfter years of teasing, Marvel's First Family made its way to the MCU.\n\n***The Fantastic Four: First Steps*** easily topped the box office, achieving one of the best debuts of the year domestically. Outside America, though, it was a mixed bag, as it came in below estimates. In some other news, we've got a bunch of films hitting new milestones worldwide this weekend.\n\nThe Top 10 earned a combined $179.1 million this weekend. That's down a rough 36.7% from last year, when ***Deadpool &amp; Wolverine*** obliterated so many records.\n\nDebuting at #1, ***The Fantastic Four: First Steps*** earned a pretty fantastic $117.6 million in 4,125 theaters. That's easily the best debut for the characters, doubling the debuts of the 2005 film ($56 million) and 2007 sequel ($58 million). And it also already doubled the domestic lifetime of the terrible ***Fant4stic*** ($56.1 million). For 2025 releases, it's the fourth best debut, behind ***Superman*** ($125 million), ***Lilo &amp; Stitch*** ($146 million) and ***A Minecraft Movie*** ($162.7 million).\n\nSince Disney bought 20th Century Fox, one of the main assets was ***Fantastic Four***. Fans were heavily anticipating the characters making their way to the MCU, especially after Kevin Feige confirmed at the 2019 Comic-Con that they were coming. Instead of rushing it, they took their time to make sure the final product would be worth it for fans.\n\nDevelopment didn't fully move forward until 2022, when Matt Shakman, coming off the success of ***WandaVision***, was hired as the director. It wasn't until February 2024 when Pedro Pascal, Vanessa Kirby, Joseph Quinn, and Ebon Moss-Bachrach were confirmed as the new team. All four were buzzy stars, which helps with getting people interested. Subsequently, Marvel smartly decided to avoid the typical origin story seen in so many superhero films, opting to have the film when the team is already established. \n\nThe marketing was very efficient, promising audiences that this would be an entirely different ***Fantastic Four*** film. The key point: besides skipping the origin story, the retro-futuristic 1960s setting. That made it stand out, not just from the prior ***F4*** films, but the MCU itself. Disney was aggressive on the marketing, giving it lots of press tours and interviews. So far, it has paid off: it's sitting at a great 87% on RT, easily the best ***F4*** film. And another selling point: announcing that the characters were set to return in ***Avengers: Doomsday*** next year, raising awareness even further.\n\nSo far, everything has panned out. Well, almost. The one downside for the film's performance: it was front-loaded, even for MCU standards. The film opened with $24.4 million in Thursday previews, but the film had a rough 42% drop on Saturday. In contrast, ***Thunderbolts*** dropped 22.4% on Saturday. Thursday previews represented 20.72% of its weekend gross, which is the biggest share for the MCU. So basically it had the worst Internal Multiplier (weekend gross/Thursday previews) in the whole MCU. That means it was more fan-driven than usual for the MCU.\n\nAccording to Disney, 58% of the audience was 25 and over, indicating that the ***F4*** attracted some young audiences. A colossal 68% of the audience was male, which is insanely high even for the MCU or superhero films in general.\n\nAudiences gave ***The First Steps*** an \"A–\" on CinemaScore. That's solid, but not fantastic word of mouth, although it's the best score for the ***F4*** in general. August is practically empty from blockbusters, but ***F4*** will still experience some competition, even if the films don't open as high as this. For now though, a $300 million domestic total is likely for ***The First Steps***. But that depends on its second weekend drop.\n\nDue to the arrival of ***Fantastic Four***, ***Superman*** saw a rough drop this weekend. It fell 57%, earning $24.8 million. While it's a rough drop, it could've been worse considering it lost IMAX and we're talking about a $100+ million opener arriving. The film has earned $289.4 million, and it will soon pass ***Man of Steel*** ($291 million). Given that its only direct competitor is out of the way, it should stabilize from this point on. For now, it's still set to finish with over $350 million domestically.\n\n***Jurassic World Rebirth*** dropped 44%, adding $13.2 million this weekend. The film has now crossed $301.7 million domestically. Last week, it was $26.6 million behind ***Dominion*** through the same point, and now that gap has grown to $30.8 million. Given that it will continue losing ground, its chances of hitting $350 million are over.\n\n***F1*** actually moved up one spot, as it eased just 36%, earning $6.3 million. The film has amassed a pretty great $165.6 million, and the film should continue holding well through August, especially with an IMAX re-release coming up.\n\nOn its second weekend, ***Smurfs*** grossed $5.4 million. That's a 51% drop, which is very weak for an animated film. Through 10 days, the film has earned a meager $22.8 million, and with ***The Bad Guys 2*** opening this week, it will continue dropping.\n\nIn sixth place, ***I Know What You Did Last Summer*** added $5.2 million this weekend. That's a very rough 59% drop, far worse than the original (20.9%) and the sequel (57.5%). Through 10 days, the film has made just $23.6 million, and it only has very little left in the gas before ***Together*** and ***Weapons*** steal its audience. Whatever the case, it's now guaranteed to finish as the lowest grossing film in the franchise.\n\n***How to Train Your Dragon*** dropped 46% for a $2.9 million weekend. The film's domestic total stands at $257.1 million.\n\nTo the surprise of no one, the worst drop in the Top 10 belonged to Ari Aster's ***Eddington***. It collapsed 62%, the worst second weekend drop in Aster's career, for a pretty weak $1.6 million. A crazy drop, but considering the arrival of a blockbuster and the film's divisive word of mouth, it's not really a surprise. Through 10 days, the film has earned just $8.1 million. Today, it will pass ***Beau Is Afraid***'s domestic lifetime, but it won't make it much further than $10 million at most.\n\nThe Indian film ***Saiyaara*** made its way to the ninth spot, earning $1.4 million this weekend from just 210 theaters. The film has earned $3.3 million so far.\n\nRounding up the Top 10 was Sony Pictures Classics' ***Oh, Hi!***, which cracked $1.1 million in 866 theaters. That's an okay start, given the film's mixed reviews (63% on RT), although it's unlikely the film will expand much further.\n\nRoadside Attractions released James DeMonaco's ***The Home*** in 1,015 theaters, but the film wound up outside the Top 10 with just $1 million this weekend. It will fade quickly from theaters.\n\n#**OVERSEAS**\n\n***The Fantastic Four: First Steps*** had a pretty promising debut domestically. Overseas, however, is less fantastic.\n\n***First Steps*** debuted with $99 million overseas, for a $216.7 million worldwide debut. That's very underwhelming, coming in below expectations. Its best debut was in Mexico ($12M), which was the best ever for the characters. It also had solid debuts in the UK ($10.8M), France ($5.1M) and Brazil ($5.1M). The rest of the bunch, however, ranged from mediocre to downright terrible. In China, the film flopped with just $4.5 million, which is even worse than ***Superman*** (along with absolutely terrible word of mouth causing it to crash). It had unremarkable performances in Australia ($4.8M), Italy ($4.3M), Spain ($3.1M), Germany ($3M), South Korea ($2.9M), India ($2.8M), and Japan ($2.5M).\n\nThis is not a great start, managing to have a lower worldwide debut than ***Superman***, and suggests it will be domestic-heavy. Which is weird, because all the ***Fantastic Four*** films were stronger outside America. It remains to be seen if it will hold well, but right now, $600 million is not guaranteed. Given its high $200 million and extensive marketing campaign, it'd be disappointing if it misses it. That would be a crazy performance, considering how high the interest was for the characters when they joined the MCU.\n\n***Jurassic World Rebirth*** added $24.8 million overseas, taking its worldwide total to $719 million. Its best markets are China ($75.6M), the UK ($39.1M), Mexico ($32.4M), Germany ($24.8M) and France ($21.3M). Japan is the only market left, which means it will have enough gas to hit $800 million.\n\n***Demon Slayer: Kimetsu No Yaiba Infinity Castle*** continues destroying records in Japan. On its second weekend, it posted 3.25 billion yen ($22M), taking its run to a gigantic 14.2 billion yen ($89M) after 2 weeks. It's outgrossing ***Mugen Train*** in yen, but it's below it due to exchange rates. Regardless, this film is heading for some insane numbers in the country. Its performance also diluded interest in ***Fantastic Four*** this weekend, as the film debuted with a weak $2.5 million, basically just over one tenth of ***Demon Slayer***'s second weekend.\n\n***F1*** earned $20.7 million overseas, allowing it to take its worldwide total to $510 million. Given the reported $200 million budget, the film has officially crossed the break-even point, everything from this point on is pure profit. Its best marekts are China ($51.4M), the UK ($26.7M), France ($24.7M), Korea ($18.7M) and Mexico ($18.7M). Given its insane holds and without much blockbusters on their way, there's a very strong possibility it could cross $600 million.\n\n***Superman*** was the top Hollywood title at the overseas box office last week, but it has dropped all the way to fourth place, even below older titles like ***Jurassic World*** and ***F1***. This week, it added $19.9 million overseas, for a $503 million worldwide total. Its best markets are the UK ($29M), Mexico ($20.3M), Brazil ($13.9M), Australia ($13.3M) and France ($11.5M). Given its holds, it should definitely hit the $600 million milestone.\n\n***Smurfs*** added $11.9 million this weekend, taking its worldwide total to $69 million. That's a very weak drop for an animated title, indicating that the film is not attracting audiences. It should hit $100 million, but that's still flop territory.\n\n***How to Train Your Dragon*** was another film that crossed a milestone. With $5.2 million, it passed the $600 million milestone. The best markets are China ($38.9M), Mexico ($36.9M), the UK ($29.1M), Brazil ($20.9M) and France ($19.1M).\n\nBut there's actually another film hitting a milestone. Earning just $1 million overseas, Sony's ***28 Years Later*** has crossed $150 million worldwide. That's pretty much 2.5x its $60 million budget, which means it has finally broke even. And that's before ancilliaries. \n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Final Destination: Bloodlines* | May/16 | Warner Bros. | $51,600,106 | $138,130,814 | $285,307,993 | $50M\n*Ballerina* | Jun/6 | Lionsgate | $24,501,663 | $58,051,327 | $131,796,712 | $90M\n\n- Death, taxes and profit. That's the inevitability of the ***Final Destination*** films, as ***Bloodlines*** has finished its run with a fantastic $285 million worldwide. Easily the highest grossing in the franchise (and its best-reviewed), proving that there's still a lot of life left in here. You can be certain that WB will greenlight a follow-up any minute now.\n\n- ***John Wick*** may be unstoppable, but turns out ***Ballerina*** is pretty much stoppable, as the film closed with a very disappointing $131 million worldwide, failing to recoup its investment. Spin-offs are tricky, especially when it's a character the audience never knew before. So despite positive reviews and word of mouth, along with a star like Ana de Armas, audiences weren't really interested. This is unlikely to change plans for ***John Wick: Chapter 5***, but what about the planned universe that Lionsgate banked on? Is that Caine spin-off still coming out?\n\n#**THIS WEEKEND**\n\nWe've got two newcomers, but none stand a chance in dethroning ***Fantastic Four***.\n\nThe first is DreamWorks' ***The Bad Guys 2***. The original film surprised by earning $250 million worldwide, so a sequel was pretty much inevitable. Given that summer has been pretty weak for animated films (the failure of ***Elio*** and ***Smurfs***), families will probably choose a familiar property to take their kids. Just how close will it perform to the original?\n\nParamount is resurrecting one of their comedy IPs, ***The Naked Gun***, with Liam Neeson taking over Leslie Nielsen's leading star. The marketing has been pretty great, showing that despite Nielsen's absence, it's still the same ***Naked Gun*** everyone loved. The one risk is that comedies have been hit-and-miss at the box office for the past years. Can ***The Naked Gun*** wind up closer to hit?\n\nNeon is also releasing body horror film ***Together***, starring Dave Franco and Alison Brie, which opens on Wednesday. The film earned high buzz following its Sundance premiere, and some bad PR after a plagiarism lawsuit. But general audiences don't pay much attention to that, they only care if the product looks intriguing. It can benefit from the poor reception to ***I Know What You Did Last Summer***, but competition with ***Weapons*** next week might impact it.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 303,
        "comments": 135,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/F4o_sFLHoEqoLJNAqSYwZx5JuEqK0aZ9LboVXemeBIg.png?auto=webp&amp;s=f191c73d1150730cb950507703deb05b60ac0552"
        },
        "permalink": "/r/movies/comments/1mbt6oq/july_2527_box_office_recap_the_fantastic_four/"
    },
    {
        "id": "1mbqd4b",
        "author": "MarvelsGrantMan136",
        "title": "Steven Yeun Confirmed to Voice Adult Zuko in 'The Legend of Aang: The Last Airbender'",
        "content": "",
        "upvotes": 14073,
        "comments": 685,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OYtX7dBCE4QCElnCpZ--Jt7Dn1Fj-OiuSwIpFT5WUYg.jpeg?auto=webp&amp;s=df4531eef904c6de594ebdda0df1a9c76ec48b01"
        },
        "permalink": "/r/movies/comments/1mbqd4b/steven_yeun_confirmed_to_voice_adult_zuko_in_the/"
    },
    {
        "id": "1mbwfdy",
        "author": "DemiFiendRSA",
        "title": "Lionsgate will release Kevin Smith’s ‘Dogma’ on a newly-remastered 4K Ultra HD and Blu-ray later this year",
        "content": "",
        "upvotes": 2026,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KAuHSziQdU5wDVOAY9E8pSQBVOBti6j12N_8lVWqslg.jpeg?auto=webp&amp;s=6f33536aee69e3af9847ef9428898dabc1c5a812"
        },
        "permalink": "/r/movies/comments/1mbwfdy/lionsgate_will_release_kevin_smiths_dogma_on_a/"
    },
    {
        "id": "1mbiis4",
        "author": "RobotiSC",
        "title": "Avatar: Fire and Ash | Official Trailer",
        "content": "",
        "upvotes": 8400,
        "comments": 2592,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gcd6R6Cq1OxDxmKuFzWB1XlB0R1eMoNEI5_E9ePsPrU.jpeg?auto=webp&amp;s=23efaf13133253c0442daa218aafa4888721a2f3"
        },
        "permalink": "/r/movies/comments/1mbiis4/avatar_fire_and_ash_official_trailer/"
    },
    {
        "id": "1mbksl4",
        "author": "MarvelsGrantMan136",
        "title": "Warner Bros. Discovery’s Post-Split Companies Will Be ‘Warner Bros.’ and ‘Discovery’",
        "content": "",
        "upvotes": 4852,
        "comments": 682,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sYZLjb3n8VheHNkElsWG-SkJAUQ6Ds-bIHhecK9CIww.jpeg?auto=webp&amp;s=4972db5f8f7f11fa5166ba14506943693ae870c2"
        },
        "permalink": "/r/movies/comments/1mbksl4/warner_bros_discoverys_postsplit_companies_will/"
    },
    {
        "id": "1mbed70",
        "author": "MarvelsGrantMan136",
        "title": "New Images from Guillermo del Toro's ‘Frankenstein’",
        "content": "",
        "upvotes": 10640,
        "comments": 328,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xdi4qffevlff1.jpeg?auto=webp&amp;s=1e3bf9adbc0b8e7322687e6576f46ba929ef26e3"
        },
        "permalink": "/r/movies/comments/1mbed70/new_images_from_guillermo_del_toros_frankenstein/"
    },
    {
        "id": "1mbjb8q",
        "author": "nbcnews",
        "title": "Eddie Murphy reveals he will star in new 'Pink Panther': 'I'm the new Clouseau'",
        "content": "",
        "upvotes": 4875,
        "comments": 630,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YpE71pgZU5xPMPj92kqirFWxHhpLX8rO6Xgut2I8i_o.jpeg?auto=webp&amp;s=cfa6a278b88080d39f3939eb9f1846144ed55a71"
        },
        "permalink": "/r/movies/comments/1mbjb8q/eddie_murphy_reveals_he_will_star_in_new_pink/"
    },
    {
        "id": "1mbts05",
        "author": "Amaruq93",
        "title": "\"Waterworld\" at 30: Kevin Costner's 1995 aquatic epic evolved from a Hollywood flop into a misunderstood cult classic",
        "content": "",
        "upvotes": 1095,
        "comments": 235,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7ky-A8GkfPpcX4C691LTE-fiQBfVwr-ohFyzdlA5DDU.jpeg?auto=webp&amp;s=2d8bf6a3aafb01e5e6f9f20acaea6d2c7c5a3577"
        },
        "permalink": "/r/movies/comments/1mbts05/waterworld_at_30_kevin_costners_1995_aquatic_epic/"
    },
    {
        "id": "1mbsxf1",
        "author": "BunyipPouch",
        "title": "‘Game of Thrones’ Actor Pilou Asbæk Joins Benedict Cumberbatch, Aaron-Taylor Johnson, Ben Mendelsohn, Eva Green in Thriller ‘Blood on Snow’ from Director Cary Fukunaga ('True Detective) - A hit man (Taylor-Johnson) falls in love with his mob boss’ wife (Eva Green) after being hired to kill her.",
        "content": "",
        "upvotes": 1198,
        "comments": 132,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xarLDCOOgonZ6Csl4LlMd2z2ZfA-uz-vXBU0t_B5YRI.jpeg?auto=webp&amp;s=0493b43053c7aa5af0c837e533894f8d4ac045f9"
        },
        "permalink": "/r/movies/comments/1mbsxf1/game_of_thrones_actor_pilou_asbæk_joins_benedict/"
    },
    {
        "id": "1mbz76t",
        "author": "an_iconoclast",
        "title": "Weapons | Perfect Score",
        "content": "",
        "upvotes": 493,
        "comments": 157,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zRhLXbtYfJTQ_bOkabaiEr5_LbkzMxdkexRqFDBkfdo.jpeg?auto=webp&amp;s=c63c287d0527520df52564aff178ed029ce5663f"
        },
        "permalink": "/r/movies/comments/1mbz76t/weapons_perfect_score/"
    },
    {
        "id": "1mbk5rw",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Eternity' Starring Miles Teller, Elizabeth Olsen, and Callum Turner",
        "content": "",
        "upvotes": 2765,
        "comments": 503,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j9ajhrzg1nff1.jpeg?auto=webp&amp;s=10289307ccde199a2e4e4c4a929f6f52245335d0"
        },
        "permalink": "/r/movies/comments/1mbk5rw/official_poster_for_eternity_starring_miles/"
    },
    {
        "id": "1mbkoew",
        "author": "LunchyPete",
        "title": "‘Meet the Parents 4’ Officially Titled ‘Focker in Law’",
        "content": "",
        "upvotes": 1733,
        "comments": 184,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Yql7XptBYnvPw0o7igawE6Df4SdtzlJWzXqv6ta3cHA.jpeg?auto=webp&amp;s=ebb444a9bc4e07840362d87c1b5d7f852048cf78"
        },
        "permalink": "/r/movies/comments/1mbkoew/meet_the_parents_4_officially_titled_focker_in_law/"
    },
    {
        "id": "1mc2hvm",
        "author": "Sonia341",
        "title": "‘The Monkey’ Streaming on Hulu Beginning August 7, 2025.",
        "content": "",
        "upvotes": 150,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7HhF7FcK2qA0j8dP0CiDdjtzUuYfJZfHz5S_RiPCkXU.jpeg?auto=webp&amp;s=e3206c31b080a77ff91251d10244bc0c5142fa81"
        },
        "permalink": "/r/movies/comments/1mc2hvm/the_monkey_streaming_on_hulu_beginning_august_7/"
    },
    {
        "id": "1mbb8hf",
        "author": "tylerthe-theatre",
        "title": "Horror’s middle class is vanishing – and that’s bad news for all film fans",
        "content": "",
        "upvotes": 4674,
        "comments": 487,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/v3SvUXYD2x2OhUTcJHuKUMyPlA65LAJbtAiWsPwhplo.jpeg?auto=webp&amp;s=1d5527e006dd51e16c598fdcbb620c4d89593c23"
        },
        "permalink": "/r/movies/comments/1mbb8hf/horrors_middle_class_is_vanishing_and_thats_bad/"
    },
    {
        "id": "1mbkeen",
        "author": "tylerthe-theatre",
        "title": "Star Wars: Episode I reclassified as PG in Britain, after 26 years",
        "content": "",
        "upvotes": 798,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-HIo4xmRlszrUgtrGaefqTVH-3u3f161qUCGgJ4v1Eg.jpeg?auto=webp&amp;s=29482132e9495cdd9d7fa64ad050f0d53d07fac2"
        },
        "permalink": "/r/movies/comments/1mbkeen/star_wars_episode_i_reclassified_as_pg_in_britain/"
    },
    {
        "id": "1mblwji",
        "author": "darth_vader39",
        "title": "‘Star Wars: A New Hope’ Stormtrooper Helmet Sold for $256,000 at Auction",
        "content": "",
        "upvotes": 645,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SYeNVEIiJFCcxWwjOyNESLA-y4IJQ_3pC5Jh3bRTnSw.png?auto=webp&amp;s=f98bced6d6a7eb6edd6127b55657e751bf8f4290"
        },
        "permalink": "/r/movies/comments/1mblwji/star_wars_a_new_hope_stormtrooper_helmet_sold_for/"
    },
    {
        "id": "1mbqss2",
        "author": "Apprehensive_Day212",
        "title": "Whistle: Official Teaser | Dafne Keen, Nick Frost | HD | IFC Films",
        "content": "",
        "upvotes": 263,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BxwXiFQxc4lgIopTEHVVBdGNsDWKHR7jXP6YxVgPEJc.jpeg?auto=webp&amp;s=63476aa9c2e728c8067e6d71c660c1652425aa7e"
        },
        "permalink": "/r/movies/comments/1mbqss2/whistle_official_teaser_dafne_keen_nick_frost_hd/"
    },
    {
        "id": "1mbu3ox",
        "author": "ImpressFederal4169",
        "title": "The Road is the best/worst movie I've ever seen.",
        "content": "I remember watching it for the first time. I was probably 17 and on a apocalypse kick. I had just finished all the Mad Max movies and was ready for a new post-apocolyptic world. I read that The Road was \"the most realistic\" and so my mom brought it home from the library for me to watch. \n\nThe movie ended and it was like 1:30am. I just sat there in the dark watching the credits roll. I remember feeling distinctly depressed. I made up my mind on the couch that night that if it ever truly got that bad, I'd off myself because that was ROUGH. \n\nIts been years since I've seen it and I still feel things when I think about it. As much as I hate it, I have to admit that it was immensely impacting. For those out there who have seen it, do you agree that it's the most depressing movie ever made, or do you have something else in mind? ",
        "upvotes": 155,
        "comments": 182,
        "media": null,
        "permalink": "/r/movies/comments/1mbu3ox/the_road_is_the_bestworst_movie_ive_ever_seen/"
    },
    {
        "id": "1mc4xk2",
        "author": "Branagh-Doyle",
        "title": "What's Behind Francis Coppola's 'Megalopolis' Roadshow",
        "content": "",
        "upvotes": 18,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WTJjMW8G6HBWEezLztrmVBG6KAzMbqmf1-ZHOahYApw.jpeg?auto=webp&amp;s=4b1163f1548aa967f4eba945b3ae181c98aceec7"
        },
        "permalink": "/r/movies/comments/1mc4xk2/whats_behind_francis_coppolas_megalopolis_roadshow/"
    },
    {
        "id": "1mbj7q9",
        "author": "movie5short",
        "title": "New Poster for \"Afterburn (2025)\" starring Samuel L. Jackson and Dave Bautista",
        "content": "",
        "upvotes": 335,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gsc1ekk5vmff1.jpeg?auto=webp&amp;s=dabc05299f57931980c01ba39c85b7745c01dd55"
        },
        "permalink": "/r/movies/comments/1mbj7q9/new_poster_for_afterburn_2025_starring_samuel_l/"
    },
    {
        "id": "1mbqxmi",
        "author": "OurHeroDeNiro",
        "title": "What's your favorite car chase in a film?",
        "content": "Just watched *Bullitt* (1968) for the first time. While I have some reservations about the film overall, the iconic car chase lived up to its reputation. It got me reminiscing about some of the best car chases in film. What’s your favorite?\n\nConsider me biased, but I’ll throw my hat in the ring for *Ronin* (1999), the Robert De Niro–starring vehicle (no pun intended).",
        "upvotes": 103,
        "comments": 313,
        "media": null,
        "permalink": "/r/movies/comments/1mbqxmi/whats_your_favorite_car_chase_in_a_film/"
    },
    {
        "id": "1mbrsmw",
        "author": "darth_vader39",
        "title": "Monica Barbaro Officially Joins Luca Guadagnino’s ‘Artificial’",
        "content": "",
        "upvotes": 89,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZT1t1P4IR1_31zdwHGuc-FDjU9PkTxP4HZWSmwoBciQ.jpeg?auto=webp&amp;s=4c381d55375aae692e384914dafcaa90d0705acd"
        },
        "permalink": "/r/movies/comments/1mbrsmw/monica_barbaro_officially_joins_luca_guadagninos/"
    },
    {
        "id": "1mbt1qt",
        "author": "NoCulture3505",
        "title": "Rosalind Eleazar, Adam Driver, Daniel Kaluuya &amp; Anna Kendrick Join Chris Rock In His Debut Feature For A24",
        "content": "",
        "upvotes": 69,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hzU_VJX47-AEseMrCo8q3EU5rjGZkHdUpRV5HI0qD1w.jpeg?auto=webp&amp;s=f1fa3c55170b9322ef469930177696849470efcf"
        },
        "permalink": "/r/movies/comments/1mbt1qt/rosalind_eleazar_adam_driver_daniel_kaluuya_anna/"
    },
    {
        "id": "1mb0ywn",
        "author": "Abject-Translator-32",
        "title": "The Jungle Book movie Disney Pretends Doesn't Exist",
        "content": "",
        "upvotes": 3101,
        "comments": 530,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TQ-I1GZd1hWpvL2GSOMlkCT-db4-WCiPy5Bk7PlUCDM.jpeg?auto=webp&amp;s=8e4fec28e1440bbf0a7086b5d8244cd3cac70f1f"
        },
        "permalink": "/r/movies/comments/1mb0ywn/the_jungle_book_movie_disney_pretends_doesnt_exist/"
    },
    {
        "id": "1marpaz",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Alan Ritchson in ‘Motor City’ - In 1970s Detroit, a wrongly imprisoned auto worker seeks revenge against the gangster who framed him after being released from prison.",
        "content": "",
        "upvotes": 11121,
        "comments": 733,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oehfb98r8gff1.jpeg?auto=webp&amp;s=7afaf1d5e4226502bad2c8fab3d063ae940500a3"
        },
        "permalink": "/r/movies/comments/1marpaz/first_image_of_alan_ritchson_in_motor_city_in/"
    },
    {
        "id": "1mc66wu",
        "author": "ubcstaffer123",
        "title": "What are AVX, IMAX, VIP, 4DX, ScreenX and D-BOX? Here’s how to take movie night to the next level",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1mc66wu/what_are_avx_imax_vip_4dx_screenx_and_dbox_heres/"
    },
    {
        "id": "1mbxsyq",
        "author": "Perfect-Persimmon-23",
        "title": "She Devil (1989)",
        "content": "Today I watched She Devil for the first time ever on a whim. It was sticking out to me for the past week and I kept skipping over it but today I started my period and knew I was going to rot so why not.\n\nI love that movie now. Added it to my favorites\n\nI love sweet sweet, SWEET revenge and Ruth played the hell out that role and gave me the confidence I never knew I needed and i’m not even married.\n\nDid not know Merly Streep was in it, love her. It’s funny because Death Becomes Her is also a favorite of mine and as soon as i seen her, i thought, “She’s taking another woman’s man, again, smh” lol. I love her in all movies she plays in it seems. \n\n",
        "upvotes": 23,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1mbxsyq/she_devil_1989/"
    },
    {
        "id": "1mbh54f",
        "author": "MoneyLibrarian9032",
        "title": "Amazon MGM Studios Sets ‘Der Tiger’ as First German Amazon Original Movie to Get Local Theatrical Release",
        "content": "",
        "upvotes": 143,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SV8b0sZS8w1XCygSGu2HPl3wOKAct1BIFoe3Ne3qNRk.jpeg?auto=webp&amp;s=c08423d223a611f0bacb6194958d4d6c9cff286a"
        },
        "permalink": "/r/movies/comments/1mbh54f/amazon_mgm_studios_sets_der_tiger_as_first_german/"
    },
    {
        "id": "1mayr4r",
        "author": "MoneyLibrarian9032",
        "title": "Subtle Cameron Boyce Tribute Featured in Adam Sandler’s ‘Happy Gilmore 2’",
        "content": "",
        "upvotes": 2758,
        "comments": 130,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2iVhmugJwTsyIdw44z99CKackmoGGGbWNqLFiTQUSRQ.png?auto=webp&amp;s=2b6ab11909353eb961da55bcb5242c7d30942ebd"
        },
        "permalink": "/r/movies/comments/1mayr4r/subtle_cameron_boyce_tribute_featured_in_adam/"
    },
    {
        "id": "1mbiy8g",
        "author": "bostoncrabsandwich",
        "title": "Whistle: Official Teaser | Dafne Kee, Nick Frost -- IFC, Shudder horror flick about Aztec death whistles",
        "content": "",
        "upvotes": 105,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BxwXiFQxc4lgIopTEHVVBdGNsDWKHR7jXP6YxVgPEJc.jpeg?auto=webp&amp;s=63476aa9c2e728c8067e6d71c660c1652425aa7e"
        },
        "permalink": "/r/movies/comments/1mbiy8g/whistle_official_teaser_dafne_kee_nick_frost_ifc/"
    },
    {
        "id": "1mbjz72",
        "author": "NoCulture3505",
        "title": "'Adventures Of Cliff Booth' Adds Corey Fogelmanis To Cast",
        "content": "",
        "upvotes": 95,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HJqaiNFSZ7-JEwRN6VEfRYa5mQxs5RBJztnuAIWIT3w.jpeg?auto=webp&amp;s=55646cf70adc03f7e314cd34fac8c6071213584e"
        },
        "permalink": "/r/movies/comments/1mbjz72/adventures_of_cliff_booth_adds_corey_fogelmanis/"
    }
]