[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 500,
        "comments": 275,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 18,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jv7nlj",
        "author": "S4v1r1enCh0r4k",
        "title": "Jack Lowden Tipped for Mr. Darcy Role in Netflix's Upcoming 'Pride and Prejudice' Series",
        "content": "",
        "upvotes": 18,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jv7nlj/jack_lowden_tipped_for_mr_darcy_role_in_netflixs/"
    },
    {
        "id": "1jv4s11",
        "author": "Alan_Stamm",
        "title": "'Bad Influence: The Dark Side of Kidfluencing' review – nothing about this shocking tale feels OK",
        "content": "",
        "upvotes": 18,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jv4s11/bad_influence_the_dark_side_of_kidfluencing/"
    },
    {
        "id": "1jv9157",
        "author": "Interesting_Fan_3096",
        "title": "Million Dollar Secret Winner",
        "content": "This is one of the best reality game shows in Netflix. I was hooked from the beginning.\n\nThere were plenty of times I wanted to scream at the contestants, “why don’t you tell them this…” to convince them you’re not the millionaire, but they end up getting emotional, defensive and raising voices. I learnt that getting defensive like your “life” is on the line can be a truth / honestly signal instead of a signal for deceit. It happened every time in the game (eg Chris, Jaimi) \n\nFor example, Jaimi was twice a suspect. One for voting Lydia and telling the truth. (Sam and Sydnee lied so they wouldn’t be targets) No one believed Jaimi. To me, if I was the millionaire (or not), I would lie about voting Lydia because it instantly puts a target on my back because that was the clue. Jaimi admitted to voting Lydia. So it was obvious she was telling the truth! If you were worried of being caught, you would lie.\n\nStill, no one believed Jaimi. When they found out from the clue that she wasn’t the millionaire, Jaimi could have used that as proof to the group for the next time they suspect her.\n\nAgain, when she was the suspected millionaire, everyone thought it’s her because she told Sam to having two sisters (clue) and everyone refused to believe that another person would conceal it or lie about it. They would always target truth tellers (eg Jaimi or Corey in this case) When Jaimi was in the chopping block, again, she just screamed and cried to defend herself which we already know does not change people’s minds.She could have used the last time she was suspected as proof that she was telling the truth (eg Last time you didnt believe me, and you found out I was telling the truth. This is a game of deception, someone is lying. Anyone who has been honest has been an easy target and has been pinned as the millionaire)\n\n Next, I feel terribly bad for Corey in a way. I don’t think he would ever be able to trust anyone after this show. Lol but in a way, he was naive and his intuition was off throughout the show. He always suspected easy targets instead of thinking deeper (if I was the millionaire, how would I act?) this was missing from him throughout so in a way he was easily manipulated by Cara.\n\nFinally, I feel conflicted about Cara winning because she wasn’t that exciting to watch. But by the end of episode 6, I had a feeling she would win or at least play big in the finale. Why? Because she flew under the radar, everyone trusted her, and she actively kept information about herself hidden. She chose not to share. Her intuition was correct almost all of the time too (Sam was asking info about her sisters because she knew she had the clue, Corey and Sam would vote Sydnee out, Sydnee had immunity, Corey took her box etc) She played the game so very well because of her intuition but I so wanted the winners to either be Sydnee or Sam. They just actively played the game and revealed just enough, but because they were threats that put them in everyone’s radars to be voted off either way! \n\nSam was correct most of time but her emotions got in the way in which she trusted Cara. She kept saying she didn’t have it in her to think Cara would even ever be the millionaire because she wouldn’t let herself go there - that Cara is capable of deceit. This was Sam’s downfall and toxic trait lol Had she kept people at bay and not let her emotions cloud her I believe she would have won. Corey was the same but Corey was off throughout lol \n\nI wonder how they are and what they think about how they were all duped as Sydnee would put it.\n\n\n",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jv9157/million_dollar_secret_winner/"
    },
    {
        "id": "1jv3e2e",
        "author": "Turbulent-Humor5424",
        "title": "Winner of Million Dollar Secret Finale",
        "content": "YO WHY DID CARA WIN IT BRUH\n\nOk look man I don’t care what any of y’all say, but I think Sam and Cory deserved it way more, like Cara didn’t even have any struggles or previous problems in the game, she got lucky at the end. \n\nAlthough her under the radar type of play was incredibly effective in the end game as it kept her protected in a sense, just the rest of the game she didn’t get a whole lot of screen time or any agendas or literally anything.\n\nDo y’all agree with this?",
        "upvotes": 7,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1jv3e2e/winner_of_million_dollar_secret_finale/"
    },
    {
        "id": "1juiwlm",
        "author": "ToonAdventure",
        "title": "LOVE DEATH + ROBOTS VOLUME 4 | Official Teaser | Netflix",
        "content": "",
        "upvotes": 123,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1juiwlm/love_death_robots_volume_4_official_teaser_netflix/"
    },
    {
        "id": "1juwjxv",
        "author": "le_disappointment",
        "title": "Recommendations for sad shows",
        "content": "I just finished watching Violet Evergarden. It was absolutely beautiful and heartbreaking. I want to watch more emotionally charged shows and movies. What other shows/movies would you recommend for me? The more devastating, the better",
        "upvotes": 9,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1juwjxv/recommendations_for_sad_shows/"
    },
    {
        "id": "1jv7dmh",
        "author": "Mechy2001",
        "title": "SPOILERS! Question about the Netflix Japanese TV series Asura",
        "content": "In Episode 6, the youngest sister's boxer husband got badly injured. In the hospital, after hugging her, her father left the room and stood guard outside and even stopped a nurse from entering. The youngest sister stripped off her clothes and lay down beside her comatose husband. What is the meaning of this? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jv7dmh/spoilers_question_about_the_netflix_japanese_tv/"
    },
    {
        "id": "1jusp24",
        "author": "dragoono",
        "title": "Why is the Netflix redesign so awful?",
        "content": "I didn't see any posts about this so I guess I will. Why does it look like this? Somebody should petition Netflix to go back to the old design. It looks ugly now. ",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1jusp24/why_is_the_netflix_redesign_so_awful/"
    },
    {
        "id": "1jv34z1",
        "author": "GamerAKB",
        "title": "Recommend me Nice/good guyx Bad girl",
        "content": "As the title says.\n\nKeep in mind:\nONLY HAPPY ENDING\nShows/movies/anime are fine\nnsfw and spoilers are fine \nLot of emotions, drama and even painfull moments fine\nNO religious things please\n\nThank you",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jv34z1/recommend_me_nicegood_guyx_bad_girl/"
    },
    {
        "id": "1jv2mde",
        "author": "New-Strength-6448",
        "title": "When I pause netflix and press play the sound comes on but the video won't come back on??",
        "content": "This keeps happening, pause, leave room and come back in. Press play and sound starts but the video doesn't come back on. When I press back the video is there for a second and it goes back to the menu screen. I have to press play again and try to get it to go on. Its very annoying. Anyone else have issues?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jv2mde/when_i_pause_netflix_and_press_play_the_sound/"
    },
    {
        "id": "1juxgg8",
        "author": "Independent_Sound234",
        "title": "Can I share my account if I don’t have wifi?",
        "content": "My girlfriend and I have unlimited data on our phones so we decided to cut the internet at home. Can I still share my account with her? \nWe live together so it is one household",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1juxgg8/can_i_share_my_account_if_i_dont_have_wifi/"
    },
    {
        "id": "1juz7ak",
        "author": "abhilash512",
        "title": "WWE WrestleMania 41: 5 Shocking Returns That Could Steal the Show",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1juz7ak/wwe_wrestlemania_41_5_shocking_returns_that_could/"
    },
    {
        "id": "1juqrfe",
        "author": "shedoesntknowathing",
        "title": "Thoughts on 'The Life List'",
        "content": "okay, in the beginning, i totally loved Brad. I thought he was such a cutie young lawyer who was sincerely interested in Alex's case and helping her with her inheritance. He seemed like a trusted person who he valued her moms wishes for her. HOWEVER.\n\nNina, his girlfriend, was so wonderful and sweet. And the whole time Brad had to play BFF'S with Alex and get WAY too close to her for no reason. I didn't understand why he was so bent on entertaining Alex so much and becoming too friendly with her. She was his client. And he had a great girlfriend (who he seemed like he loved).\n\nAlso the fact that Alex showed no respect for Nina. And how she showed very little remorse for being the reason that Brad could have cheated. \n\nSo no, I was never rooting for Alex and Brad. Though I get why Alex would like him -- he's wonderful, cute, successful, kind, and somehow intertwined with her mom's passing.\n\n\n\nI really saw potential for this plot and film. I thought everything her mother said about Alex was true when the film started. That Alex was not truly living her fullest life for some reason. And I think bringing out 'The List' was a wonderful idea. It was poignant, touching, and sweet everything that her mom articulated about what her daughter may not able to see for herself, or ignoring.\n\nHowever, I think that having it become a thing, of now Alex has to go out and achieve every single goal in order to receive her inheritance and videos of her mom pretty strange, and rigid.\n\nPointing out 'The List' was a great thing to do. But not to make Alex go out and do them for a goal. She has to find it in herself, in her time, to do those things. Not for someone else, like a little checklist. But yes, to give a nice acknowledgement and nudge to Alex- I like. I feel like acknowledging 'The List'  was supposed to be about giving a general outline of things that may bring meaning to Alex's life, who seems lost at the time.\n\n  \nI know this was based off a book, and to be fair it was a cute book idea. But seeing it visually made me realize, that some of these things would not be great in real life. just my thoughts. what are your thoughts on the movie?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1juqrfe/thoughts_on_the_life_list/"
    },
    {
        "id": "1jtzxga",
        "author": "MaybeEddy23",
        "title": "What were your thoughts on Netflix's whodunnit series \"The Residence\" set in The White House?",
        "content": "",
        "upvotes": 256,
        "comments": 167,
        "media": null,
        "permalink": "/r/netflix/comments/1jtzxga/what_were_your_thoughts_on_netflixs_whodunnit/"
    },
    {
        "id": "1juk3gh",
        "author": "HANAquax",
        "title": "Comfort show",
        "content": "Hi everyone,\n\nI want a new comfort show to watch on Netflix.\n\nPreferably the show is: \n\n1- American or British \n2- has mostly women characters \n3- realistic and not too silly or cringe \n4- can handle a bit of a drama but I would love something funny \n5- nothing too politically correct \n\nSomething like derry girls or never had I ever shall do. \n\nNote: please recommend as many shows as possible cause some shows aren’t available in my region. \n\nThanks a lot ❤️",
        "upvotes": 9,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1juk3gh/comfort_show/"
    },
    {
        "id": "1jud410",
        "author": "Somethingman_121224",
        "title": "Netflix Acquires 'Monopoly' Reality Game Show",
        "content": "",
        "upvotes": 15,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jud410/netflix_acquires_monopoly_reality_game_show/"
    },
    {
        "id": "1juwp33",
        "author": "Educational-Roof2651",
        "title": "Nothing is updating in “continue watching”",
        "content": "When i watch a show on my phone or iPad it never updates in continue watching to the episode im up to so i have to remember and find my current episode, and when i start a new show/movie it doesn’t show up.\n\nBut if i watch on my tv it’s fine and works as it should.\n\nI’ve updated Netflix multiple times since this started happening but nothing has changed.\n\nI don’t know how to fix it, does anyone know why this is happening or how to help",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1juwp33/nothing_is_updating_in_continue_watching/"
    },
    {
        "id": "1juqse3",
        "author": "Remote-Lecture2192",
        "title": "What is this movie",
        "content": "I remember my sister showed me this netflix original we watched. It was a horror movie in set in the 90s in Mexico about this girl who had 2 younger siblings in which she always took care of them cause her mom was almost never there. They summoned some demon and i remember at some point the little brother accidentally drew some symbol that brought back the demon. I don't remember the name of this movie but I vividly remember it and I can't find it. If someone knows the name, can you tell me?​​",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1juqse3/what_is_this_movie/"
    },
    {
        "id": "1jtjt44",
        "author": "TheMirrorUS",
        "title": "Florida boy's 'violent murder' of teen girl sparks 'real life' comparisons to Netflix's Adolescence",
        "content": "",
        "upvotes": 493,
        "comments": 186,
        "media": null,
        "permalink": "/r/netflix/comments/1jtjt44/florida_boys_violent_murder_of_teen_girl_sparks/"
    },
    {
        "id": "1juu39i",
        "author": "Z-Man_Slam",
        "title": "So this is a preview of Fear the Walking Dead or?",
        "content": "So I went to continue watching Fear the Walking Dead and it started showing this instead of the normal Walking Dead clips.... Anyone have this happen before? Also nyone know what anime it is? And is it worth watching lol",
        "upvotes": 0,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xsog5lauopte1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1juu39i/so_this_is_a_preview_of_fear_the_walking_dead_or/"
    },
    {
        "id": "1ju252b",
        "author": "Sad-Computer9869",
        "title": "Unpopular Opinion (maybe idk): people getting mad on game shows over people literally playing the game the way it’s meant to be played is infuriating",
        "content": "I’ve been watching “Million Dollar Secret” on Netflix and I’ve been enjoying it, but there’s a trend I notice with all of these types of game shows that’s honestly infuriating to me… why do people get so mad about people playing the game the way it’s meant to be played? \n\nLike for example: when people get so up in arms about a player “lying” when the whole premise of the game is to lie… it makes no sense. Like if you don’t want people to lie to you don’t sign up for a game that is predicated around it. \n\nIdk maybe this is not an unpopular opinion at all, I just needed to vent about it ",
        "upvotes": 32,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ju252b/unpopular_opinion_maybe_idk_people_getting_mad_on/"
    },
    {
        "id": "1juc03g",
        "author": "Mundane-Week-2145",
        "title": "Dr. Coto's Clinic",
        "content": "For me, this show is something that helps me rejuvenate hundred percent after a day's labor. Flawless storyline, best casting, and setting in a small island, with serene surroundings. But that's just my opinion. How about yours??",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1juc03g/dr_cotos_clinic/"
    },
    {
        "id": "1jtwdee",
        "author": "PickTheNick1",
        "title": "I just discovered Million Dollar Secret",
        "content": "I just discovered Million Dollar Secret show, didn't even knew it's a brand new show and was pretty shocked to find out that it's not yet fully out so I need to wait for another 2 days for the next episode to come out.\n\nDid you try it out? How do you like it so far? Any favorites from the people left? :)",
        "upvotes": 49,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1jtwdee/i_just_discovered_million_dollar_secret/"
    },
    {
        "id": "1juyeh1",
        "author": "cindylooboo",
        "title": "All the awards need to go to the cast of adolescence.",
        "content": "The acting was INCREDIBLE from everyone. I was riveted. What an incredible, engrossing, moving, performance from everyone. I'm astounded at how emotional their performances made me. Best series I've seen in at least a decade. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1juyeh1/all_the_awards_need_to_go_to_the_cast_of/"
    },
    {
        "id": "1jur9hj",
        "author": "weirdo4909",
        "title": "Anyone from Netflix’s EyePatch team",
        "content": "I am longtime r/netflix lurker. Just curious if there are Netflix software engineering employees lurking around here.\n\nI am particularly very interested in EyePatch team since that is closely related to what I do. Can any employee please dm me or reply here so I can get the ball rolling? For context I work in an equivalent team at Disney.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jur9hj/anyone_from_netflixs_eyepatch_team/"
    },
    {
        "id": "1juhbj8",
        "author": "sannareesi2503",
        "title": "How to delete game profile?",
        "content": "Hello!\nIs there a way to delete a game profile without actually deleting a netflix profile? Is there a way of minimising the impact netflix games have on my profile? I just don't want my main reccommended thing to be a game anymore.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1juhbj8/how_to_delete_game_profile/"
    },
    {
        "id": "1jucik1",
        "author": "S4v1r1enCh0r4k",
        "title": "‘The Witcher’ Final Season Set Leak Reveals Northern Army Camp in the Making",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jucik1/the_witcher_final_season_set_leak_reveals/"
    },
    {
        "id": "1ju4k0j",
        "author": "Consistent_Wing_6113",
        "title": "Secret Millionaire Show FLAW",
        "content": "I feel like the millionaire agenda is immediately superseded by the Trophy room hint.\n\nSo as a millionaire - you're best not to accept risky agendas.\n\nThe hints are nearly so obvious that it extinguishes any fun.\n\nEither that or the millionaire agendas are silly. Better to place something somewhere instead of engaging people.\n\nShow could have been better thought out.\n\n",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ju4k0j/secret_millionaire_show_flaw/"
    },
    {
        "id": "1jtovdt",
        "author": "Longjumping_Land_977",
        "title": "Gone Girls: The dark story of where Shannan Gilbert’s three sisters are now",
        "content": "",
        "upvotes": 35,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jtovdt/gone_girls_the_dark_story_of_where_shannan/"
    },
    {
        "id": "1ju94ok",
        "author": "huffpostuk",
        "title": "'It's Triggering': UK teachers weigh in on Adolescence’s school episode",
        "content": "Thanks to everyone who contributed in this thread - your comments were incredibly helpful for our piece. [https://www.reddit.com/r/netflix/comments/1jgc5mm/uk\\_teachers\\_how\\_real\\_are\\_the\\_school\\_scenes\\_in/](https://www.reddit.com/r/netflix/comments/1jgc5mm/uk_teachers_how_real_are_the_school_scenes_in/)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ju94ok/its_triggering_uk_teachers_weigh_in_on/"
    }
]