[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 15,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 50,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l2tlqw",
        "author": "Northeast4life",
        "title": "Animal Kingdom.. how is this the first time I’m seeing or hearing about this show.",
        "content": "Maybe it’s the lack of decent shows on Netflix recently but after 4 episodes I’m hooked. And how is this the first time I’ve heard of this show. It’s amazing!",
        "upvotes": 37,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1l2tlqw/animal_kingdom_how_is_this_the_first_time_im/"
    },
    {
        "id": "1l2wrrb",
        "author": "thescatteroflight",
        "title": "Netflix search now useless",
        "content": "Sure, the first few results were accurate, but why in the hell is it showing me a Richard Pryor movie and 50 First Dates for Adam Driver, and Hoarders and The Breakfast Club for Pedro Pascal?! If you only have three or four movies with these actors, then show me that.",
        "upvotes": 21,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l2wrrb/netflix_search_now_useless/"
    },
    {
        "id": "1l2pwts",
        "author": "paharibilli",
        "title": "Four seasons",
        "content": "ok so i started watching this out of boredom and but im so pleasantly surprised. 19F here and im pretty sure im not exactly the targeted audience but i feel like if i had to compare it with white lotus (dont come at me for this u cant deny the parallels) this ones better? also the point where i really started liking the show was nicks daughter lilas play. Netflix really needs to up its game waise most of the shows dont hit the same anymore \n",
        "upvotes": 38,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1l2pwts/four_seasons/"
    },
    {
        "id": "1l26ugd",
        "author": "iLikeDinosaursRoar",
        "title": "Dept Q",
        "content": "Going to need everyone reading this to please watch this show ASAP. Even if you don't like it, just let it run so Netflix thinks it was watched! Really be a shame not to get a 2nd season. \n\nJust need a few dozen million...thanks.\n\nNot to mention it was a fun crime drama with some enjoyable characters, it's Sherlock Holmes vs House. \"But they are the same!\" Yes yes, but imagine the detective an enjoyable grouch like House but it has all the detective and crime qualities of Sherlock. \n\nGive it a watch or the very least let it run in the background! ",
        "upvotes": 306,
        "comments": 108,
        "media": null,
        "permalink": "/r/netflix/comments/1l26ugd/dept_q/"
    },
    {
        "id": "1l306ge",
        "author": "Sweaty-Toe-6211",
        "title": "‘Adolescence’ Beats ‘Stranger Things 4’ to Become Netflix’s No. 2 Most-Watched English-Language Series Ever",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l306ge/adolescence_beats_stranger_things_4_to_become/"
    },
    {
        "id": "1l2hdqx",
        "author": "ProbablyHere4Help",
        "title": "Netflix’s interface is AWFUL and permanent. Best part: you can’t leave feedback anywhere!",
        "content": "I could be wrong but wouldn't less title visibility induce quicker scroll fatigue? I have no desire to hunt for new titles and the once PERFECT interface now resembles all the others. Might as well spread my time and money elsewhere now that there's no difference in how annoyed I get navigating these streaming apps. \n\nYeah, most people are naturally resistant to change but this is probably their worst decision yet. I've been actively trying to avoid this ugly layout by keeping my testing feature off but I guess it's here to stay.\n\nI hope Netflix considers revising toward something that feels more like Netflix but my expectations are in Hell.",
        "upvotes": 32,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1l2hdqx/netflixs_interface_is_awful_and_permanent_best/"
    },
    {
        "id": "1l2gb8o",
        "author": "chrisarrant",
        "title": "Queen's Gambit creator mixes Scandi Noir with UK crime shows like Prime Suspect for Netflix's Dept. Q (with a side of Matthew Goode)",
        "content": "",
        "upvotes": 36,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l2gb8o/queens_gambit_creator_mixes_scandi_noir_with_uk/"
    },
    {
        "id": "1l2uy1r",
        "author": "Southern-Brother5693",
        "title": "The \"Coming This Week\", \"Wait For It\" Features are missing",
        "content": "Just received the new Netflix UI design today on my Sony Bravia TV.\n\nI liked it as a whole. The layout looks more fluid and more streamlined. The suggestions feel more on point as well. I wish there were a way to immediately scroll up to the top of the page, though using the back button.\n\nMy biggest issue is that the \"Coming This Week\", \"Coming Next Week\" and \"Wait For It\" bars are all gone now. There is no longer any easy way to keep track of what is coming in the future and set reminders.\n\nI hope Netflix rectifies this in the future. But on a positive note, let me say again I like the new UI design.",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l2uy1r/the_coming_this_week_wait_for_it_features_are/"
    },
    {
        "id": "1l2z9p3",
        "author": "ThrowALifeline89",
        "title": "For anyone looking to fill the gap that the cancellation of 'Heartstopper' left: check out 'Smiley*",
        "content": "A lot of people loved *'Heartstopper'* and are understandably broken up about the show not getting renewed. **But** there is one shimmer of hope: *'Smiley'* is a netflix show from a few years ago that did not make a big splash **(sadly**) that has a lot of the same appeal however. If there is one thing that people liked to criticise about *'Heartstopper'* it is that it's a bit \"too clean and whimsical\" (not my opinion just something that I saw online a few times). Now *'Smiley'* is definetely more raunchy and adult oriented.\n\n  \n\\[Yes, I know there is movie supposedly coming out next year to wrap up things with Charlie &amp; Nick - but that is likely more than a full year away\\]. Anyhoo, I hope this post can get people to give *'Smiley'* a well deserved watch and bring some happiness to the world. Bye!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l2z9p3/for_anyone_looking_to_fill_the_gap_that_the/"
    },
    {
        "id": "1l20y5d",
        "author": "Aggressive_Data_6291",
        "title": "A Show That’s Going To Have Me Gagged and Shocked",
        "content": "I need to feel something. I wanna watch something that’s going to have me floored multiple times throughout watching. I’m talking jaw dropping , unexpected and applause worthy. I’m not really into documentaries. ",
        "upvotes": 147,
        "comments": 287,
        "media": null,
        "permalink": "/r/netflix/comments/1l20y5d/a_show_thats_going_to_have_me_gagged_and_shocked/"
    },
    {
        "id": "1l2x5g0",
        "author": "ItsTheSweeetOne",
        "title": "Shiny Flakes: the Teenage Drug Lord song question",
        "content": "Anybody know the song that starts playing at 36:30? It’s driving me nuts, not in the credits and Shazam didn’t pick it up. Help\n\nSide note, pretty good documentary. Don’t recommend watching it with the English dub though",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l2x5g0/shiny_flakes_the_teenage_drug_lord_song_question/"
    },
    {
        "id": "1l2kmav",
        "author": "Reasonable_Copy_8070",
        "title": "A Widow’s Game",
        "content": "I just finished watching this movie today and it also says it’s based on true events so I read what happened after. this is good!! especially the video at the end. to anyone who already watched it, what are your thoughts? ",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l2kmav/a_widows_game/"
    },
    {
        "id": "1l22i52",
        "author": "portezbie",
        "title": "Why does Netflix change the UI constantly but almost never add actual new features?!",
        "content": "So the goddamn Netflix app on my TV is different again, apparently it was really important to make the cover images huge and make the buttons rounder. \n\nAnd yet for some reason all these super basic things still don't exist, like asking if you want to remove something from My List when you finish it, or easier access to subtitle options. \n\nOr heaven forbid having more than one list, like I dunno a \"watched favorites\" list and a \"want to watch\" list? It's so friggin basic! \n\nSorry, just really needed to vent. Rant over.",
        "upvotes": 51,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1l22i52/why_does_netflix_change_the_ui_constantly_but/"
    },
    {
        "id": "1l2srdb",
        "author": "OneBadDog",
        "title": "Sword Master",
        "content": "Just finished it. Started it last night and stayed up longer than I should have, but it's hard to stay so pretty when you don't get any sleep, so had to finish it today.\n\nIt is unfortunately a subtitled movie, unless you speak Mandarin, but an excellent movie nonetheless. I don't think it detracted from the movie at all, maybe even made it a tad better.\n\nIt is set in feudal China, where fights were solved with swords and the gap between upper and lower class was substantial. Tons of action, tough guys, some blood, some love interest stuff, even some interesting period stuff that might possibly be made up. \n\nI guess you'd have to like these types of movies to begin with, but I suspect even MrsBadDog would be down if I were to watch it in front of her. \n\ntldr: great movie, will watch a few times. Is in Mandarin- not a deterrent ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l2srdb/sword_master/"
    },
    {
        "id": "1l2h0ub",
        "author": "Street-Opening-5166",
        "title": "Series Recommendations",
        "content": "Hey everyone!\nI’ve barely watched any series in the past because work kept me super busy. But now that I finally have some free time, I want to dive in! 😄\n\nI’m looking for Netflix recommendations—I enjoy courtroom dramas, thrillers, mysteries, fiction, and even light-hearted comedies like Friends or The Big Bang Theory.\n\nWould love your suggestions—drop your favorites below! 🍿✨",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1l2h0ub/series_recommendations/"
    },
    {
        "id": "1l2bej5",
        "author": "Internal-Bed-3150",
        "title": "Led Zeppelin’s story like you’ve never seen it, is coming to Netflix soon",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l2bej5/led_zeppelins_story_like_youve_never_seen_it_is/"
    },
    {
        "id": "1l21wda",
        "author": "FryingAir",
        "title": "Maid",
        "content": "So good! I’ve been glued to it for the past 24 hours. It’s so real and makes you really think of how hard it is to stay afloat. I know it’s not new but how many of you have seen it? Highly recommend.",
        "upvotes": 39,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1l21wda/maid/"
    },
    {
        "id": "1l2zruv",
        "author": "Odd-Glove8031",
        "title": "BBC license compliance",
        "content": "In the U.K. a TV license is required to legally watch live broadcasts, with upcoming live events on Netflix citizens must have a current license.\n\nWhy doesn’t the law require that streaming providers take steps to ensure their subscribers have valid TV licenses through some API in order to authorise streaming?\n\nAt the very least, they should be required to supply names and addresses of all subscribers who have streamed live broadcasts to the BBC for compliance checking.\n\nWorking in partnership with the BBC our streaming providers could aid in the legal compliance process.\n\nDo people know of a reason why this isn’t done?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l2zruv/bbc_license_compliance/"
    },
    {
        "id": "1l2asnq",
        "author": "Mycroft_xxx",
        "title": "Guillermo del Toro’s Frankenstein, official teaser trailer.",
        "content": "Very excited about this.  Can’t wait to see it in theaters.  I love the look and the musical score .  I know this is  Del Toro’s dream project and I am super excited to see his vision.",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l2asnq/guillermo_del_toros_frankenstein_official_teaser/"
    },
    {
        "id": "1l2i5cu",
        "author": "ChindianIceQueen",
        "title": "Greenleaf",
        "content": "I’m neither religious or Christian but I enjoyed this series very mucho ✨🤍 whilst it did drag out here and there I found so much comfort and epiphanies throughout the series. Heartwarming but required some amount of patience. ",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1l2i5cu/greenleaf/"
    },
    {
        "id": "1l1kjs3",
        "author": "Top-Ring9619",
        "title": "Is it just me or….?",
        "content": "",
        "upvotes": 253,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1l1kjs3/is_it_just_me_or/"
    },
    {
        "id": "1l2nes0",
        "author": "indiewire",
        "title": "Netflix's Alfred Hitchcock Screening Series Comes to Egyptian Theatre",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l2nes0/netflixs_alfred_hitchcock_screening_series_comes/"
    },
    {
        "id": "1l2rylt",
        "author": "Remote_Valuable_2134",
        "title": "(DARK)I Just Started Dark and I Think I Already Figured Things Out",
        "content": "So I just started watching Dark after seeing a reel on IG that intrigued me. It mentioned characters who are both protagonists and antagonists at the same time. It showed Eren, Paul Atreides, and then I recognized the dude in the yellow raincoat, realized it was from Dark. I had been thinking of watching it for a while, but that reel pushed me to finally start. I’ve been keeping away from spoilers to get the full experience, since I heard the show has a lot of twists. Right now, I’m on episode 3, around the 4–5 minute mark, and as I was watching, I started putting a few theories together. \n\nTheory #1: \n\nEarly on, Ulrich (the cop) mentions how he lost his brother a long time ago. Then when Erik and Mikkel go missing, the police find a kid’s body, but it’s not either of them. His clothes look old, and he has an old Walkman, so I started thinking: “What if that’s Ulrich’s brother that somehow came back?” Later they say the body isn’t identifiable, which kinda supports my idea, maybe he doesn’t match anyone in their time period. That made me feel like I might actually be onto something. \n\nTheory #2: \n\nThen Mikkel disappears and I thought he came back, but turns out he’s actually in the past. The newspaper said 1986, and he even saw his own dad as a kid. That’s when I started thinking back to my Ulrich’s brother theory, if Mikkel went to the past, could it be that Ulrich’s brother went to the future instead? Just a thought I had. Curious if anyone else thought the same thing this early on. \n\nTheory #3: \n\nNow, because of the IG reel, I got a tiny spoiler that Jonas is both the protagonist and antagonist. That got me thinking: “What if the antagonist is Jonas from the future?” It kinda makes sense. The story revolves around time travel, so maybe future Jonas is trying to stop present Jonas from doing something, maybe mistakes that future Jonas already made himself. Like he’s trying to rewrite things but ends up being the villain from his younger self’s perspective. \n\nTheory #4: \n\nThis one might be a stretch, but hear me out. We know Jonas’ dad (the one who killed himself) was named Michael, right? That sounds a lot like Mikkel. What if Mikkel stays in the past, grows up there, and ends up becoming Michael? That would make him Jonas' dad. It would explain why he knows so much and why his suicide is so important. Maybe it was all part of the timeline. But then I started wondering, wouldn’t killing himself mess up the timeline? Or maybe that’s just how it’s supposed to happen? Maybe everything is already destined to happen a certain way, like the characters don’t really have free will. \n\nTheory #5: \n\nI’ve also been thinking about the hooded guy we keep seeing but never see his face. Could that be Michael (Jonas’ dad) trying to fix the past after messing it all up? Maybe he caused the time travel stuff, saw the damage, and tried to reverse it but couldn’t, so he gave up and killed himself? Or maybe the man in the hoodie is actually future Jonas, since he’s supposed to be the antagonist. Or could it be that guy in the hotel?? I don’t know, I’m just ranting at this point lol. One last question, do the birds have meaning? Every time something happens, the birds die. Is that a side effect of time travel or something? Some kind of natural consequence? Just thought that was interesting. \n\nThis show is wild already and I’m only a few episodes in. I love the whole time travel mystery vibe and I’m tryna stay spoiler-free, but I wanted to drop my thoughts so far and see if I’m on the right track or just reaching. Either way, let me know what y’all think, just please no major spoilers, I’m still early into it. \n\nThanks! ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1l2rylt/darki_just_started_dark_and_i_think_i_already/"
    },
    {
        "id": "1l2ui4q",
        "author": "freezetime311",
        "title": "10 ads to watch a movie now on Netflix",
        "content": "I usually don't watch Netflix on my TV anymore because of the ads. Well I get a little bit better picture and so I decided to watch the movie airport. I was greeted with an ad in the beginning and then I paused it and they were nine more ad breaks. Just absolutely insane! I then see they added Hitchcock movies and same thing. I go to check out vertigo and I'm greeted with a beginning ad and then there are nine more scattered throughout the movie and they are pretty close together.\n\nThis is just pathetic! How are most people out there just putting up with all of these ads? You pay 8 bucks a month or whatever it is and still have to sit through all of these ads. I'll stick with watching on my laptop I guess. Picture quality isn't as good but at least I'm not inundated with all of these ads. \n\nI know they don't have the same programming Netflix does but sites like Tubi are 100% free and they have ads. How is it that Netflix charges us and still has ads? I'm actually very surprised It has that many ads for a movie. The only show I really watch on my TV app is Seinfeld because there aren't any ads. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1l2ui4q/10_ads_to_watch_a_movie_now_on_netflix/"
    },
    {
        "id": "1l1fz1e",
        "author": "Wyldstallyn80",
        "title": "Dept Q",
        "content": "Watched this over the weekend, really enjoyed it. Thought the relationships between all the main characters were very well written and acted. Now I’m just looking forward to the 3 year wait for the next season. ",
        "upvotes": 216,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1l1fz1e/dept_q/"
    },
    {
        "id": "1l2a4d0",
        "author": "ameliabebe",
        "title": "Sirens - possible plot hole?",
        "content": "I just finished watching Sirens and I enjoyed it for the most part. There was something that really threw me off though and I was wondering if anyone else noticed it or if I have got it wrong.\n\nSo, when Simone and Devon's mum dies Simone is 7 and Devon is 12. But the show makes it out like no one was around for Simone after, but where was Devon? She didn't go straight to college at 12 years of age.. she would of been like 18 when she went to college right? (I am not from the US, so I don't know the exact age most kids go to college) Which means Simone would have been 13 when Devon left. So why was Simone the one that was neglected, and put into foster care but not Devon!?!? Unless I misheard the ages they said they were when their mum died it doesn't make sense!? Did I miss something???",
        "upvotes": 2,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1l2a4d0/sirens_possible_plot_hole/"
    },
    {
        "id": "1l2l12u",
        "author": "ResidentAlien90",
        "title": "Movies Reappearing on Netflix",
        "content": "Every now and then, I come across a movie that I could have sworn had left Netflix a few months ago, only to see it quietly return without much fanfare. The most recent example is *Lucy*, which disappeared around January or February (at least in my country), and lo and behold, it's back — currently ranked #10 among the most popular movies locally.\n\nWhat I don't understand is, if Netflix had every intention of retaining the rights to a movie, why wouldn't they renegotiate the renewal before the contract expires? Seems silly to me.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l2l12u/movies_reappearing_on_netflix/"
    },
    {
        "id": "1l297nd",
        "author": "bingewatchgal",
        "title": "Sirens - more thoughts/questions",
        "content": "&gt;!Loved the show! So much to think about! I've read the other threads on here which have made me see some things I missed and think about other things a little differently, but I still have some thoughts/questions...\n\nWas Devon actually thinking Simone should feel obligated to care for an abusive father part of Devon's trauma response? A \"misery loves company\" mentality? Devon spent her life trying to protect and support Simone. Why is she now, all of a sudden, trying to bring her down? Simone was totally justified in not wanting to do a damn thing for her dad. Did Devon feel it was more about helping her than the dad and it was finally time for Simone to start paying her back for all she did for her?\n\nJose!! I thought he was the most mysterious/interesting character! At the end, when he called Simone \"my love\" (I think that was the term)...so creepy and so telling. If anyone was  being \"cultishly\" controlled, it was him!\n\nThe girl in jail. What did she represent?\n\nI really need to watch it again knowing what I know now. I'm sure so many things will look very different!!&lt;",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l297nd/sirens_more_thoughtsquestions/"
    },
    {
        "id": "1l2csba",
        "author": "MysticCrest1830",
        "title": "Eiichiro Oda Hypes the Fandom for Season 2 of Live-Action 'One Piece' and the Series' Chopper",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l2csba/eiichiro_oda_hypes_the_fandom_for_season_2_of/"
    },
    {
        "id": "1l2b5v4",
        "author": "indiewire",
        "title": "‘Squid Game’ Creator Teases Potential Spinoff: ‘I Want to Show What They Did’ Between Seasons 1 and 2",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l2b5v4/squid_game_creator_teases_potential_spinoff_i/"
    }
]