[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 36,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1knwtjs",
        "author": "theipaper",
        "title": "TV show Adolescence sparks rise in hate on world's biggest incel site",
        "content": "",
        "upvotes": 1045,
        "comments": 408,
        "media": null,
        "permalink": "/r/netflix/comments/1knwtjs/tv_show_adolescence_sparks_rise_in_hate_on_worlds/"
    },
    {
        "id": "1kogqh1",
        "author": "pinkglue99",
        "title": "The Quilters",
        "content": "I don’t usually have time to pop in and pick a new show, but tonight I decided to go with something I don’t usually watch. This is a absolutely magical ",
        "upvotes": 42,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1kogqh1/the_quilters/"
    },
    {
        "id": "1ko1ym1",
        "author": "Emma086",
        "title": "Underrated Netflix Gem You Need to Watch!",
        "content": "Just found The OA and it’s criminally underrated. Mind-bending plot, emotional depth, and major Black Mirror vibes.\n\nIf you’re bored scrolling,,,watch this. You won’t regret it.\n\nWhat hidden Netflix gem do you recommend?",
        "upvotes": 115,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1ko1ym1/underrated_netflix_gem_you_need_to_watch/"
    },
    {
        "id": "1koja6n",
        "author": "Certain_Thoughts",
        "title": "Everybody’s Dead With John Mulaney",
        "content": "Experiencing this season of Everybody’s Live feels like a carefully calibrated Charlie Kaufmann narrative: unreal and increasingly unstable. The collective madness required of all participants—from host to guest to audience—throws into question the reliability and the sustainability of not just the show but the larger moment from which it emerges.\n\nIt’s Mulaney’s unhinged world; we’re just living in it. This ambitious show need not end with the cliché of Mulaney waking up from a deep slumber, relieved to find that it was all just one long fever dream. But the show must come to an end—and not because all good things come to an end, but because it’s totally insane. \n\nDeath by three fourteen-year-olds would spell violence for the sake of authenticity, in the name of outdoing the insanity of the internet and exposing final form internet brain rot for its deeply dangerous implications.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1koja6n/everybodys_dead_with_john_mulaney/"
    },
    {
        "id": "1ko1l6g",
        "author": "Internal-Bed-3150",
        "title": "David Fincher and Netflix in a \"feud\" over title of Squid Game spinoff",
        "content": "",
        "upvotes": 23,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1ko1l6g/david_fincher_and_netflix_in_a_feud_over_title_of/"
    },
    {
        "id": "1kom7g8",
        "author": "m00nman559",
        "title": "Venture Bros blurry",
        "content": "I just started watching Venture Bros and it gets pretty blurry or out of focus on some scenes. Is this normal? My quality is set to the highest setting so I assume it just hasn't aged well.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1kom7g8/venture_bros_blurry/"
    },
    {
        "id": "1ko1bwu",
        "author": "DayOfTheDeb",
        "title": "American Manhunt: Osama Bin Laden, How does Zero Dark Thirty hold up against the documentary",
        "content": "I just finished the new American Manhunt series for Osama Bin Laden. It was very interesting to hear the perspective of the CIA including the analysts and see the tense atmosphere inside the White House. \n\nI watched Zero Dark Thirty when it originally came out and I am now rewatching it. What do you feel like was left out of the movie or changed or just felt different in the movie versus the documentary? ",
        "upvotes": 15,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1ko1bwu/american_manhunt_osama_bin_laden_how_does_zero/"
    },
    {
        "id": "1kok2ks",
        "author": "Historical_Garden896",
        "title": "Any way to use my Netflix account on PS5 outside my household?",
        "content": "So Netflix is hitting me with that household restriction thing on my PS5, Is there a way to bypass Netflix household restrictions on the PS5? I desperately want to finish Brooklyn 99😖",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1kok2ks/any_way_to_use_my_netflix_account_on_ps5_outside/"
    },
    {
        "id": "1ko2kag",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix is promoting Squid Game, the caption reads: \"A legend in the making. Player 456. June 27.\"",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/i3yzdr8lo51f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ko2kag/netflix_is_promoting_squid_game_the_caption_reads/"
    },
    {
        "id": "1ko49d4",
        "author": "scorpionZftw",
        "title": "Need some recommendations",
        "content": "Hey everyone, i have been looking for a show to watch for some time but have no clue what to start. Here are my favorite shows:\n\nMindhunter, Arcane(loved it so much), DMC, Dota Dragons blood, Brooklyn 99, Rick and Morty, Better Call Saul, Bodyguard, Lucifer, Lupin, The Witcher, Ragnarok, Blue eye samurai and Outer Banks.\n\nI couldn’t complete these: Dark (got bored), Stranger Things (loved the first 2 seasons only) and Money Heist.",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ko49d4/need_some_recommendations/"
    },
    {
        "id": "1ko9df3",
        "author": "Empty-Instruction282",
        "title": "The Chaos Of Prison- Un Prophète A Prophet on Netflix!",
        "content": "A Prophet (2009), directed by Jacques Audiard, is a gripping French crime drama that follows Malik El Djebena, a 19-year-old French-Algerian sentenced to six years in a brutal prison. Illiterate and alone, Malik, played by Tahar Rahim, navigates a dangerous world divided by Corsican and Muslim gangs. Initially vulnerable, he’s coerced by Corsican mob leader César Luciani (Niels Arestrup) to kill a Muslim prisoner, earning protection but entangling him in the gang’s power structure. As Malik learns to read and secretly studies Corsican, he gains cunning and ambition, balancing loyalty to César with covert alliances, including with Muslim inmate Ryad.Through gritty realism and intense performances, the film charts Malik’s transformation from naive outsider to calculating player, orchestrating drug deals and manipulating rival factions. Haunted by visions of his victim, Malik grapples with guilt and identity while seizing opportunities during prison leaves to build his own criminal network. The story explores themes of survival, power, and cultural tension in a claustrophobic prison setting. As Malik outmaneuvers César, he emerges as a new kind of leader, blending ruthlessness with strategic brilliance, setting the stage for his inevitable rise in the criminal underworld upon release.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ko9df3/the_chaos_of_prison_un_prophète_a_prophet_on/"
    },
    {
        "id": "1kng9wq",
        "author": "Brutal-Juice",
        "title": "Netflix will show generative AI ads midway through streams in 2026",
        "content": "",
        "upvotes": 123,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1kng9wq/netflix_will_show_generative_ai_ads_midway/"
    },
    {
        "id": "1knm6el",
        "author": "Sufficient_Ebb_5694",
        "title": "Whats your favorite Netflix original?",
        "content": "I'm looking for a captivating show that will keep me interested so im curious of your favorites. So far I think Stranger Things or Altered Carbon S1 are my favorites",
        "upvotes": 59,
        "comments": 168,
        "media": null,
        "permalink": "/r/netflix/comments/1knm6el/whats_your_favorite_netflix_original/"
    },
    {
        "id": "1koavrd",
        "author": "alexxx729",
        "title": "Have originals higher resolution by default?",
        "content": "I have the Standart-Subscription an noticed recently that originals apper much sharper when compared to normal movies that are not owned by nnetflix (arrival in my chase), those are super mushy maybe they have a lower bitrate or something?\n\nWould love to hear if this is normal",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1koavrd/have_originals_higher_resolution_by_default/"
    },
    {
        "id": "1koa3rt",
        "author": "alamakjan",
        "title": "Does anyone else ever get charged after canceling their subscription?",
        "content": "I canceled my subscription this February and today all of a sudden my subscription was renewed and my card was charged without me even opening the app and website at all after the cancellation. Should I dispute this with Netflix or with my bank?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1koa3rt/does_anyone_else_ever_get_charged_after_canceling/"
    },
    {
        "id": "1ko9ifv",
        "author": "Empty-Instruction282",
        "title": "K.O.: A Fight Beyond the Ring in a World of Vengeance on Netflix!",
        "content": "In the gritty French action thriller K.O. (releasing June 6, 2025, on Netflix), ex-fighter Bastien (Ciryl Gane) is haunted by an opponent’s death. Seeking redemption, he aids a widow (Alice Belaïdi) in finding her missing son, plunging into a dark underworld of crime and betrayal. As Bastien confronts his past through brutal fights, he uncovers a conspiracy threatening those he swore to protect. Directed by Antoine Blossier, this intense, emotional journey blends raw action with a heartfelt quest for atonement, showcasing Gane’s powerful debut.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ko9ifv/ko_a_fight_beyond_the_ring_in_a_world_of/"
    },
    {
        "id": "1ko31gf",
        "author": "Savings_Entrance380",
        "title": "Denzel Washington and Robert Pattinson thriller coming to Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ko31gf/denzel_washington_and_robert_pattinson_thriller/"
    },
    {
        "id": "1ko8i59",
        "author": "Awoon01",
        "title": "Question about disabling HDR in Netflix settings",
        "content": "Firstly, yes you can disable HDR on the Netflix app (on smart TV atleast)  \n\\-&gt; Netflix home screen -&gt; press the back button -&gt; select Get Help -&gt; Video -&gt; Disable HDR\n\nSecondly, yes I need to disable dolby vision because it is poorly optimized on my Sony Bravia from 2018 :/\n\nThirdly, my question, does anyone know if I disable HDR if it does affect the 4K format. Maybe it is because of the serie I was watching (Vikings Valhalla) but I can't really tell if I lose quality or not. But I am very happy this setting exists, otherwise I was thinking about buying firestick 4K which you can disable HDR there as well, and if with the latter option I keep the 4K I would go this route. Otherwise all good!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ko8i59/question_about_disabling_hdr_in_netflix_settings/"
    },
    {
        "id": "1knlkfo",
        "author": "Illustrious_Cry9722",
        "title": "American Manhunt - Osama Bin Laden",
        "content": "I just finished watching the new series and what an emotional roller coaster ride. I usually don’t get too caught up on documentaries but this one had me on edge. Partly bc 9/11 is deeply personal for me and even to this day, my eyes tear up when I see images of the planes hitting the towers. And they always trigger my memories of how the city smelled (I lived in Brooklyn) the days following 9/11. Anyway, I’m no history bluff and I’m sure people will debate on the accuracy of the events that unfolded but from my standpoint, I thought the documentary was well-made and yes, I wish it was a little longer.",
        "upvotes": 39,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1knlkfo/american_manhunt_osama_bin_laden/"
    },
    {
        "id": "1kobpde",
        "author": "tara_uwu",
        "title": "Your device isn’t part of the Netflix Household for this account",
        "content": "Hey everyone, this week I've had this message pop up. I know it's because of the netflix's new policy so they can get more money but the issue I'm having is: I'm pretty sure netlfix got it wrong as to who is the \"household\". He determined it's my one of my friends when really it's not. They signed out but the issue is still present. How do I determine which device is the Household since Netflix got it wrong?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1kobpde/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1knvl9k",
        "author": "Spiritual_Wing_8860",
        "title": "What should I watch after I finished weak hero and bloodhounds?",
        "content": "I finished watching bloodhounds and weak hero, so it would be awesome if anyone could suggest me good fighting k dramas or Asian dramas on Netflix (Japanese as an example, so doesn’t have to be only Korean). Please and thank you!",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1knvl9k/what_should_i_watch_after_i_finished_weak_hero/"
    },
    {
        "id": "1knqg0b",
        "author": "tinkkonreddit",
        "title": "What’s a good tv show you’d recommend ?",
        "content": "Hey guys pls help 😭!!! I’m looking for new shows to watch ( I have pretty much all platforms) I just want any a good binge show and I actually like a wide range of shows. Ex. Greys Anatomy, Sweet magnolias, VPD, The 100 !!, Dynasty, Forever was also super good !, Blood and Water, Criminal mind, and I could go on but you get what I mean lol. Any suggestions somewhere up in there ? \n\nOh I also like documentaries ! ( American Murders, Natalia Grace, Good American Family )",
        "upvotes": 8,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1knqg0b/whats_a_good_tv_show_youd_recommend/"
    },
    {
        "id": "1knicni",
        "author": "Feeling_Fox_5426",
        "title": "New show recommendations please!!!",
        "content": "Looking for a new show to binge.... for reference, I'll list below my favorite series I've watched so far (on and off Netflix):\n\n* Breaking Bad\n* Ozark\n* Severance\n* The Witcher\n* Peaky Blinders\n* The Sinner\n* Mindhunter (R.I.P)\n* Queen's Gambit\n\nHopefully based on these you can get an idea of my interests. Drop me your favorites below and tell me why you love them!!!\n\n",
        "upvotes": 26,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1knicni/new_show_recommendations_please/"
    },
    {
        "id": "1ko6opv",
        "author": "Denny_Crane_007",
        "title": "Why Can't We Have Playlists ?",
        "content": "I know technically you could have a bunch of \"Profiles\" ... but it would be really great to have music app -type Playlists.\n\nI'd like my favourite episodes from say a 10-season series, at hand, and easy to play with a press of my middle remote button.\n\nThey could be presented as a normal \"Row\" under Continue Watching or whatever.\n\nJust sayin'  .... 🤟",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ko6opv/why_cant_we_have_playlists/"
    },
    {
        "id": "1ko6v14",
        "author": "PhilomenasPokerFace",
        "title": "Netflix search… werewolves",
        "content": "I was in a discussion about vampires and’s struggling to find a vampire production I liked I wanted to recommend a werewolf series I loved on Netflix.\n\nI went to search it out, and got frustrated (again) with the Netflix interface and search results. The interface always can’t figure out whether it wants to a) get you to watch something from their current lineup b) get you to watch something from their catalogue c) brainwash you with their latest or d) purposely misunderstand you for unknown reasons.\n\nFor example, I can’t remember either the name of the series I’m looking for, nor the names of any of the actors. I have never found a function for reviewing the list of shows I’ve watched on Netflix. I’m easily able to enter the genre.\n\nMy results are many pages of basically unrelated top ten lists. Among possibly 200 results, maybe 20 for into my genre selection. All of those are perhaps the ones with the highest watch counts, I wouldn’t know. The rest of the results are so far off the mark that they would be laughable except that I was there with a purpose.\n\nSearch werewolf: results: Judy Garland biopic, two weeks notice and a bevy of completely irrelevant titles, plus out of 200 results perhaps 30 are unique results. The rest appear multiple times in each of the rows of ten.\n\nSo, thanks for listening. Now, does anyone remember the name of the werewolf series from about ten years ago about an extended family of wealthy werewolves  that included V several main male characters but also one younger blonde female, played by a young martial artist who did all her own stunts?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ko6v14/netflix_search_werewolves/"
    },
    {
        "id": "1ko3kmv",
        "author": "Meowwoe",
        "title": "#LDR ‘Can’t Stop’ thinking about how disappointing S4 is",
        "content": "I’m genuinely baffled.\n\nThe first episode just shows a 5-minute concert. No plot, no character, no message, just a CGI band playing a song. That’s it…\n\nAfter all those years waiting for S4 with curiosity, impatience and especially high expectations; I am very disappointed about almost every episode.\n\nThere were a few moments though that were mildly entertaining or amusing but overall the show has been on a downward trajectory since the last season.\n\nIt’s lazy, lacking any kind of story, and designed just to be flashy.\n\nThis season is not worth the long wait.\n\nToo bad.\n\nWhat was your favourite season?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ko3kmv/ldr_cant_stop_thinking_about_how_disappointing_s4/"
    },
    {
        "id": "1kmypq5",
        "author": "abelldeez",
        "title": "The Liver King documentary is an advertisement. He's duped you all again",
        "content": "This is a brilliant AD for ancestral supplements. Here's how they did it.\n\n1. Paint liver king as a broken, troubled, but \"just trying to get a good message out\" guy who takes all the blame and is the only bad person in this story. Heck, he was a major fraudster it makes sense he would lie, right?\n\n2. Portray the nine ancestral tenets and liver as positively as possible... People saying it changed their life, his kids are healed with no other details given, Brian started the company when he figured out liver was good.  All this can be true as whole foods and better lifestyle choices are good.  No one on the marketing team or ancestral supplements knew about the steroids, he told them he didn't use so they had no idea remember? \n\n3. Separate the brilliant but evil marketing plan that made ALL his supplement companies exorbitant amounts of money from the scam that grew his companies immensely. \n\n4. A mutant physique going viral by taking $12,000 worth of GH per month, eating raw testicles for shock value and denying steroid use to generate more chatter.  He did this to grow his company.  Sure, spreading the word of better living is good, but the main goal is to grow the company.  And they did just that.  Now just make LK the sole evil person and make everyone feel for LK.  \n\n3. Did anyone else notice the beautiful shelf of ancestral supplements the camera panned to right at the end? How convenient, I mean we know liver king lied but he wanted to help and it saved both kids.  Organs and carnivore diets are the key to great health.  Don't want to eat raw organs, let us show you this lovely display of products from ancestral supplements, they are good people who were not in on the scam just profited immensely what a coincidence. Don't buy from ancestral he owns multiple supplement companies. They only told you about one, think that was a mistake? \n\n4. HE LITERALLY TELLS EVERYONE HE'S A FRAUDSTER RIGHT TO YOUR FACE. HE LIED TO EVERYONE.  YOU THINK HE STOPPED BEING FRAUDULENT? C'MON PEOPLE! THE GUY WAS PRINTING MONEY AND DOING FRAUDULENT RECIEPTS.  LITERALLY DOING IMMORAL ASS SHIT TO MAKE MORE MONEY AS HES DOING WITH THIS DOCUMENTARY.\n\nSeriously if anyone thinks this is anything but an advertisement I feel bad for you.  He's duping you AGAIN\n",
        "upvotes": 282,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1kmypq5/the_liver_king_documentary_is_an_advertisement/"
    },
    {
        "id": "1ko4rga",
        "author": "AdvertisingLoose5885",
        "title": "Can someone please explain what this is and how I can fix it?",
        "content": "This started yesterday when I wanted to watch Dr stone and when I went onto netflix it just kept scrolling down the different accounts but when I went on this morning it was fine but it suddenly started yesterday and I don't know how to get it to stop.",
        "upvotes": 0,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/n2a15v2h461f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ko4rga/can_someone_please_explain_what_this_is_and_how_i/"
    },
    {
        "id": "1knngut",
        "author": "kittycaatttt",
        "title": "New Show \"Bet\" based on Kakegurui",
        "content": "Thoughts??? I'm watching this and it's really hard to watch... What do y'all think. It's really cringe from my perspective and the actors are all kinda weird.  ",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1knngut/new_show_bet_based_on_kakegurui/"
    },
    {
        "id": "1ko02wg",
        "author": "mewshew",
        "title": "Netflix is broken",
        "content": "I tried to reactivate my account. Suddenly my email doesn't connect to an account. My phone number doesn't connect to an account. I use a password manager. The passwords are right. What do I do to get my account back?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ko02wg/netflix_is_broken/"
    }
]