[
    {
        "id": "1k6ywov",
        "author": "Mickey17AMA",
        "title": "Hi /r/movies - I'm Stuart Penn, VFX Supervisor for Mickey 17 (as well as Moon Knight, Loki, Avengers: Endgame, Paddington 2, Alien: Covenant, Venom 2, and recent Doctor Who episode 'Lux'). My team created the baby creepers, mother, and the ice cavern environments for Mickey 17. Ask Me Anything!",
        "content": "Hi r/movies \\- I'm Stuart Penn, VFX Supervisor for Mickey 17 (as well as Moon Knight, Loki, Avengers: Endgame, Paddington 2, Aline: Covenant, and recent Doctor Who episode 'Lux'). My team created the baby creepers and ice cavern environments for Mickey 17. Ask Me Anything!\n\nHere are all of my credits:\n\n[https://www.imdb.com/name/nm1176327/](https://www.imdb.com/name/nm1176327/)\n\nI'll be back tomorrow (Friday 4/25) at 10:00 AM ET to answer your questions. Please feel free to ask away in the meantime.\n\nMore information:\n\nMickey 17 was written, produced, and directed by Bong Joon Ho, (Parasite, Snowpiercer, Okja, Memories of Murder, The Host)\n\nThe film stars Robert Pattinson in the title role, alongside Naomi Ackie, Steven Yeun, Toni Collette, and Mark Ruffalo. Set in the year 2054, the plot follows a man who joins a space colony as an \"Expendable\", a disposable worker who gets cloned every time he dies.\n\nTrailer:\n\n[https://www.youtube.com/watch?v=osYpGSz\\_0i4](https://www.youtube.com/watch?v=osYpGSz_0i4)\n\nFramestore VFX Supervisor Stuart Penn and his team created the mother and baby creepers, as well as the ice cavern environments, working closely with Director Bong Joon Ho.",
        "upvotes": 1232,
        "comments": 142,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fna7sd36otwe1.png?auto=webp&amp;s=f9075c344bc679024be1b322226a962a7b14b0fc"
        },
        "permalink": "/r/movies/comments/1k6ywov/hi_rmovies_im_stuart_penn_vfx_supervisor_for/"
    },
    {
        "id": "1k79rk2",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (The Accountant 2 / The Legend of Ochi / Until Dawn) plus Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[The Accountant 2](https://old.reddit.com/r/movies/comments/1k79o5r/official_discussion_the_accountant_2_spoilers/?)\n\n[The Legend of Ochi](https://old.reddit.com/r/movies/comments/1k79o78/official_discussion_the_legend_of_ochi_spoilers/?)\n\n[Until Dawn](https://old.reddit.com/r/movies/comments/1k79o90/official_discussion_until_dawn_spoilers/?)\n\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Love &amp; Basketball](https://old.reddit.com/r/movies/comments/1k79oaq/official_throwback_discussion_love_basketball/?)\n\n[The Virgin Suicides](https://old.reddit.com/r/movies/comments/1k79och/official_throwback_discussion_the_virgin_suicides/?)\n\n[U-571](https://old.reddit.com/r/movies/comments/1k79oe1/official_throwback_discussion_u571_spoilers/?)\n\n# Still in Theaters\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n[The Wedding Banquet](https://www.reddit.com/r/movies/comments/1k1tsqm/official_discussion_the_wedding_banquet_spoilers/?)\n\n[Warfare](https://www.reddit.com/r/movies/comments/1jwev1e/official_discussion_warfare_spoilers/)\n\n[The Amateur](https://www.reddit.com/r/movies/comments/1jwev63/official_discussion_the_amateur_spoilers/)\n\n[Drop](https://www.reddit.com/r/movies/comments/1jwevax/official_discussion_drop_spoilers/)\n\n[Freaky Tales](https://www.reddit.com/r/movies/comments/1jwevev/official_discussion_freaky_tales_spoilers/)\n\n[A Minecraft Movie](https://www.reddit.com/r/movies/comments/1jr0qff/official_discussion_a_minecraft_movie_spoilers/?)\n\n\n\n\n# On Streaming\n\n# Check back tomorrow for a Havoc discussion plus some streaming catch up titles like G20 and 2073!",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1k79rk2/official_discussion_megathread_the_accountant_2/"
    },
    {
        "id": "1k7eggx",
        "author": "Dizzy_Hotwheelz",
        "title": "New Poster for 'BALLERINA' featuring Lance Reddick in theaters June 6th.",
        "content": "",
        "upvotes": 2240,
        "comments": 138,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/16zobtlagxwe1.jpeg?auto=webp&amp;s=a6706ed521989b11c7e4713ec5d467dca8ff8d15"
        },
        "permalink": "/r/movies/comments/1k7eggx/new_poster_for_ballerina_featuring_lance_reddick/"
    },
    {
        "id": "1k79mi4",
        "author": "cmaia1503",
        "title": "Sydney Sweeney to Star in ‘Split Fiction’ Film Adaptation From Director Jon M. Chu, ‘Deadpool and Wolverine’ Writers",
        "content": "",
        "upvotes": 4352,
        "comments": 665,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UCowCxwwlo8BlkYRLeBSNc4pSwRA2_DO427Jw1A4uYA.jpg?auto=webp&amp;s=aee76f2395b5d5d33f66ff10cad25dedc3c027a2"
        },
        "permalink": "/r/movies/comments/1k79mi4/sydney_sweeney_to_star_in_split_fiction_film/"
    },
    {
        "id": "1k7kl56",
        "author": "LundgrensFrontKick",
        "title": "I rewatched all of Tom Cruise’s films from Endless Love (1981) to Mission: Impossible - Dead Reckoning (2023) and ranked the 295 running moments in his filmography.",
        "content": "Earlier this year, in anticipation of the release of [*Mission: Impossible - The Final Reckoning*](https://youtu.be/fsQgc9pCyDU), I decided to rank all of Tom Cruise’s running scenes in the *M:I* franchise. I’d worked on several *M:*I data pieces for various companies and figured it would be easy to rank the 100ish running moments. When the list was completed - it felt incomplete, so I decided to rank all of the running scenes in his filmography. Starting with 1981’s *Endless Love*, and finishing with 2023's *Mission: Impossible - Dead Reckoning*. Cruise had gone to extreme lengths for his films, so I decided to honor his hard work by putting together this absurd list.\n\n**Quick note** \\- His X handle always makes me laugh\n\nhttps://preview.redd.it/nipy05v8czwe1.png?width=762&amp;format=png&amp;auto=webp&amp;s=98ad8d85fd8050287ab4770953933c0844f559f1\n\nHere’s what you need to know about the list:\n\n* I found and ranked 295 moments \n* I counted running, sprinting and jogging. The amount of time doesn’t matter either. In *Top Gun* there’s a one-second shot of [him running to hit a volleyball](https://youtu.be/okyLAKclleo). It was included. \n* A short blurb was included for list items 295 - 26\n* Timestamps have been included for the top 25. Some of the timestamps may be a little off for you. It depends on where/how you watch the movies. For me, it was a mixture of DVDs, Blu-rays, Vudu and streaming channels. \n* I researched the top 10 scenes and wrote more about them (and included YouTube links)\n* This list is obviously subjective, but after going through Cruise’s filmography for the fourth time since 2018, I am very happy with the top 10\n* There is zero chance that our lists will match up, so don’t be surprised if the 295 moments don’t line up with your list. \n* For some of the scenes, I split them up into moments. I just went with the flow of the scene and if he stops for a moment or the scene cuts to someone else - I split up the running moment into parts. \n* If you’re interested in learning more about the top 10 and this list, I recorded a podcast episode about the  data collection and ranking process. It’s fun. You should listen to it. The podcast is called [*Movies, Films and Flix*](https://www.spreaker.com/episode/bonus-episode-the-tom-cruise-running-special--65723787) \\- you can find it wherever you listen to podcasts. I also have a show called *Deep Blue Sea - The Podcast* that you should listen to as well.\n\n\n\n**Here’s the list!**\n\n295. Losin’ It - Quick moment featuring Cruise starting to run.\n\n294. Losin’ It - He runs to get into a car.\n\n293. Losin’ It - While being chased by some people he runs to the convertible (again).\n\n292. Top Gun - He runs to hit a volleyball.\n\n291. Mission: Impossible II - Cruise runs up some stairs. \n\n290. Top Gun - Quick run before going up some steps. \n\n289. Days of Thunder - Jogs through a parking garage to catch Nicole Kidman. \n\n288. The Firm - Stair running. \n\n287. Legend - Hell prison crouched jogging. \n\n286. The Mummy - Cruise runs to his horse. \n\n285. Mission: Impossible - Dead Reckoning - A little bit of running to a safe car.\n\n284. The Firm - Super fast house running. \n\n283. Mission: Impossible - Jogs to a ladder. \n\n282. Taps - Runs to get to the front of other students (does it with ease).\n\n281. Taps - Jogs to Timothy Hutton.\n\n280. Knight and Day - Duck and run. \n\n279. All the Right Moves - He can’t catch the running back. \n\n278. Mission: Impossible III - Quick run through Vatican catacombs. \n\n277. Jack Reacher: Never Go Back - Mardi Gras running (I combined 5 quick running moments - one/two seconds each).\n\n276. Mission: Impossible - Rogue Nation - Runs away from Ilsa when she’s shooting at him in the opera. \n\n275. Mission: Impossible III - Runs towards a car and steals it. \n\n274. Legend - Forest running. \n\n273. Mission: Impossible - Fallout - Runs through gunfire to get to Alec Baldwin. \n\n272. Risky Business - Front door running. \n\n271. Jerry Maguire - Panicked running to get back to the office after meeting with Jay Mohr. \n\n270. Cocktail - He jumps out of a car and runs to get on a bus. \n\n269. The Outsiders - Animated moment involving him running around the corner of a house. \n\n268. Oblivion - Runs and hides for cover behind a pillar. \n\n267. All the Right Moves - Mud running on a football field. \n\n266. Knight and Day - Sprints through a jungle. \n\n265. Legend - Hell prison running. \n\n264. Legend - More hell prison running.\n\n263. Mission: Impossible - Ghost Protocol - Kremlin running. \n\n262. Legend - More hell prison running and crouching.\n\n261. Mission: Impossible 2 - Sneaky running through a tunnel.\n\n260. Rain Man - He runs across a street. It’s fine.\n\n259. Jack Reacher: Never Go Back - Rain Jogging.\n\n258. Mission: Impossible - Dead Reckoning - Flashback running.\n\n257. Rain Man - He runs to help Raymond who is standing in the middle of a street.\n\n256. Edge of Tomorrow - “We’ve been through worse.” Cage and Rita make a final fun at the aliens.\n\n255. Legend - Snow running. \n\n254. Edge of Tomorrow - Running with a limp. \n\n253. Mission: Impossible III - Cruise helps Keri Russell.\n\n252. Mission: Impossible III - More help running Russell. Cruise loves a spin move. \n\n251. Mission: Impossible III - MORE help running Russell. \n\n250. Legend - More snow running. \n\n249. Mission: Impossible - Fallout - He runs for cover whilst inside a tunnel. \n\n248. The Mummy - More running away from the Mummy.\n\n247. The Mummy - Even more running from the Mummy.\n\n246. Mission: Impossible - Ghost Protocol - Prison running.\n\n245. The Mummy - He runs away from the mummy and some rats. \n\n244. Mission: Impossible III - Shrub running followed by hospital running. \n\n243. The Mummy - Runs away from zombies. \n\n242. The Mummy - More running away from zombies. \n\n241. Mission: Impossible - Dead Reckoning - Train running. \n\n240. Edge of Tomorrow - He manages to outrun an exploding helicopter. \n\n239. Knight and Day - Rescue running. \n\n238. Mission: Impossible III - Runs into a room and shoots a goon. \n\n237. All the Right Moves - Runs onto a football field. \n\n236. Taps - He leads a group of students to the front. \n\n235. Legend - Running away from little demons. \n\n234. Taps - Runs with a gun. \n\n233. Jack Reacher: Never Go Back - New Orleans running. \n\n232. The Firm - He runs into his office to answer a phone call.\n\n231. Cocktail - Beach running! \n\n230. War of the Worlds - Runs behind a car door.\n\n229. War of the Worlds - Crowd running. \n\n228. Minority Report - Runs down a platform (3 seconds) and puts on a shirt.\n\n227. Oblivion - Med Kit running. \n\n226. War of the Worlds - Sprints out of the way of a crashing alien ship. \n\n225. The Mummy - Gallops away from Russell Crowe.\n\n224. Mission: Impossible - Ghost Protocol - Sewer running. \n\n223. Mission: Impossible - Dead Reckoning - Quick train run followed by parachuting. \n\n222. The Mummy - He runs to grab a weapon.\n\n221. The Color of Money - Cruises runs across a street to chat with Paul Newman. \n\n220. Minority Report - Runs around the precog platform. \n\n219. Mission: Impossible - Dead Reckoning - Runs to a fight in Venice. \n\n218. Risky Business - Jumps off his car and runs to the front door of a house. \n\n217. Born on the Fourth of July - Intense snow running during wrestling practice. \n\n216. Rain Man - He notices that Raymond is gone so he runs out of the phone booth. \n\n215. Days of Thunder - Runs to Nicole Kidman’s car. \n\n214. Jack Reacher: Never Go Back - He runs across a street and goes up some steps. \n\n213. War of the Worlds - Stair running followed by a bit of street running. He then runs into his backyard. \n\n212. Mission: Impossible - Dead Reckoning - Runs inside a shelter during a sandstorm. There’s a few more running moments during the gunfight.\n\n211. All the Right Moves - He runs outside to smooch Leah Thompson. \n\n210. Edge of Tomorrow - He runs up to a bridge to see the aliens attacking. \n\n209. Edge of Tomorrow - Training Cruise. \n\n208. Legend - Runs through a closing hell gate.\n\n207. Legend - Cruise runs to pick up a sword to battle Darkness.\n\n206. All The Right Moves - He goes for the man and not the ball.\n\n205. Far and Away - Snow running. \n\n204. Mission: Impossible III - “Get down!” Cruise runs from gunfire coming from an helicopter. \n\n203. Mission: Impossible - Dead Reckoning - Tight Venice alley running. \n\n202. War of the Worlds - Running through the woods while carrying Dakota Fanning. \n\n201. Mission: Impossible - Dead Reckoning - Crouched running to a car. \n\n200. War of the Worlds - Cruise gets his family on a ferry. Then, they run through the ferry. \n\n199. Mission: Impossible III - More “Get down, stay down” shenanigans. He does jump over a car - which is fun.\n\n198. The Firm - Runs around his back yard.\n\n197. Eyes Wide Shut - Run across a street and towards a cab. \n\n196. Jerry Maguire - Runs through the rain to get to make some copies of his manifesto. \n\n195. Mission: Impossible - Ghost Protocol - Runs into a building. \n\n194. Mission: Impossible - Ghost Protocol - Sand running. \n\n193. Far and Away - Runs with a mule and a gun. \n\n192. Mission: Impossible III - Bridge running capped off with a fun slide. \n\n191. American Made - Are we running? - Tom runs to grab his cash. \n\n190. Far and Away - Irish fog running.\n\n189. War of the Worlds - Cruise runs and grabs Fanning.\n\n188. Jack Reacher: Never Go Back - He makes a move through a couple closing doors and runs after a food truck. \n\n187. Oblivion - Sand running to help Julia. He also runs back to his ship. \n\n186. Oblivion - He lands his plane and runs to Julia. \n\n185. Rain Man - He runs through his house after the fire alarm goes off.\n\n184. Cocktail - Running in white pants. Brave move.\n\n183. Mission: Impossible - Dead Reckoning - More Venice running.\n\n182. Cocktail - Cruise jets past a pair of bouncers. \n\n181. Interview With the Vampire - Creepy Cruise Running. \n\n180. Risky Business - He runs in his backyard with some lawn gear.\n\n179. Top Gun: Maverick - Beach running while playing football.\n\n178. The Mummy - He runs up stairs to get away from the mummy. Good form. \n\n177. Legend - Runs and jumps into a lake so he can get a ring. He doesn’t play. \n\n176. Far and Away - Jumps off a train and runs through a field. \n\n175. Jack Reacher - Quarry running. \n\n174. Jack Reacher - More quarry running. \n\n173. Endless Love - Plays Soccer, takes off shirt and sits down.\n\n172. The Firm - Runs with books. I like prop running.\n\n171. Mission: Impossible - Disguised as a firefighter jogging. \n\n170. Cocktail - Mice crane shot of him running through the snow. He has props too. \n\n169. Mission: Impossible - Rogue Nation - He runs away from the hideout, talks to Ilsa and runs down a hallway. \n\n168. War of the Worlds - Basement running. \n\n167. Mission: Impossible III - Puddle running followed by a run up to an abandoned factory.\n\n166. War of the Worlds - “Stay together” Cruise chases after his kid. \n\n165. Jack Reacher - He runs up some steps and kicks a door in while holding a gun - Impressive. \n\n164. Mission: Impossible - Fallout - He runs across an elevator to get to a ladder.\n\n163. Mission: Impossible 2 - He shoots two guys and runs to steal one of their motorcycles.\n\n162. Jerry Maguire - Jerry runs to the field through a dark hallway - He’s booking it. \n\n161. War of the Worlds - Field running followed by a run into a basement. \n\n160. Minority Report - Jumps off a bed and grabs a guy. \n\n159. Collateral - Runs away from a crashed taxi.\n\n158. Oblivion - Gets blown backwards after running to save a person. \n\n157. Risky Business - He leaves a cab, runs along the street and to an apartment. \n\n156. Edge of Tomorrow - Runs away from an alien to grab a gun. \n\n155. Far and Away - Irish hill running. \n\n154. The Last Samurai - He runs before a battle. Solid crouch running/jogging. \n\n153. Far and Away - Irish hill running. \n\n152. Mission: Impossible III - He runs from the MI crew and gets darted in a hospital parking lot. \n\n151. Mission: Impossible - Dead Reckoning - Cruise pulls a slick move on some Italian guys. \n\n150. Mission: Impossible III - Bridge running followed by a loooooonnnnggg jump. \n\n149. Mission: Impossible - Ghost Protocol - “Open the door!” - More prison running. \n\n148. War of the Worlds - They get out of the water and run on the shore and through some woods. Legit wet running. \n\n147. Knight and Day - Ducks and runs when Cameron Diaz starts shooting. \n\n146. Born on the Fourth of July - Rounds up a team before a battle. Things go bad. \n\n145. War of the Worlds - Rachel! Runs to protect his daughter. \n\n144. Legend - Swamp running to save a quest comrade. \n\n143. Mission: Impossible - Rogue Nation - He and Renner chase down Benji.\n\n142. Knight and Day - Roof running. \n\n141. Mission: Impossible III - Runs and puts a walkie talkie near a radio. \n\n140. Mission: Impossible - Ghost Protocol - Suit running to catch villains. \n\n139. American Made - Cruise chases after a car and it explodes. \n\n138. Vanilla Sky - Runs down some stairs - Wobbly running. \n\n137. Edge of Tomorrow - He runs and bumps a guy out of the way of a crashing helicopter. It lands on Cruise. \n\n136. Vanilla Sky - Runs wobbly threw a lobby - Does a nice spin.\n\n135. Minority Report - Creeps around a hallway while running while chasing eyeballs. \n\n134. Jack Reacher: Never Go Back - He runs on top of a roof and charges into a goon. \n\n133. Edge of Tomorrow - Cruise kicks some alien butt on the beach. \n\n132. Edge of Tomorrow - Cruise runs and knocks a car out of the way. \n\n131. Jack Reacher: Never Go Back - He runs towards a guy and pushes him off a roof (Tom goes with him - the goon dies - Tom lives). \n\n130. Mission: Impossible - Fallout - He sees a helicopter about to take off and runs towards it and grabs onto a rope.\n\n129. Mission: Impossible - Ghost Protocol - Runs out of the Kremlin, collects his breath and leaves. \n\n128. Mission: Impossible - Dead Reckoning - Airport running. \n\n127. Mission: Impossible III - Shanghai side street running.\n\n126. Mission: Impossible - Fallout - He runs to Luther to make sure he is okay.\n\n125. Legend - He lands a sweet jump, runs to grab a weapon and battles a hell guard. There are several instances of running during this moment.\n\n124. All the Right Moves - He has more left in the tank than most of the other football players\n\n123. Minority Report - Runs away from operatives.\n\n122. Mission: Impossible III - “I’m in the approach position.” Nice long shot of Cruise running. \n\n121. Mission: Impossible - Dead Reckoning - Airport running - ladder climbing - Running on top of the airport. Nice overhead shot.\n\n120. Knight and Day - Roof running followed by a nice jump, slide, and another jump and finally a fall into a river. \n\n119. Far and Away - He hoofs it out of his apartment. \n\n118. Born on the Fourth of July - Cruise and a small group run into a village. Big scene. \n\n117. Edge of Tomorrow - Manages to get past the truck and he runs into Emily Blunt - and then runs out of the drop ship. \n\n116. All the Right Moves - Pass interference in the rain\n\n115. Edge of Tomorrow - “We’ve been through worse.” Cage and Rita make their final run at the aliens.\n\n114. Mission: Impossible - He runs around a corner and does some nice acting (and stopping) when a car explodes - He then runs down a flight of stairs.\n\n113. Mission: Impossible - Fallout - Hunts gets chased by goons and runs into a cathedral.\n\n112. Mission: Impossible - Dead Reckoning - Jumps off a club balcony and runs through the club.\n\n111. Born on the Fourth of July - Rain running. It’s nice and awkward.\n\n110. War of the Worlds - Street crack running.\n\n109. Edge of Tomorrow - How about a little PT? Fun running scene. \n\n108. The Mummy - Cruise runs and jumps around the top of the building. Good running and crawling. \n\n107. The Last Samurai - Runs around during a nighttime battle and saves a life.\n\n106. Mission: Impossible - Ghost Protocol - Runs to catch a train. Renner has good running form btw.\n\n105. Knight and Day - Runs, jumps, runs, jumps, hangs. - Good stuff. \n\n104. Risky Business - I like the wide shot of him running into his school - You can see the running skill.\n\n103. Edge of Tomorrow- Following a sweet roll he runs alongside a truck and is very pleased with what he pulled off.\n\n102. Mission: Impossible - Fallout - He runs/walks/limps to fight Walker.\n\n101. Mission: Impossible 2 - He runs and does a nice roll so he can sneak into a vent. \n\n100. War of the Worlds - He can’t outrun a giant alien machine.\n\n99. Jack Reacher: Never Go Back - He and Colby run away from a dude. Colby got jacked for this movie. \n\n98. Knight and Day - Runs on the beach while explosions go off behind him.\n\n97. Mission: Impossible II - He runs up to a goon and kicks him.\n\n96. Oblivion - He runs and jumps over a gap (doesn’t make it).\n\n95. The Last Samurai - He uses his explosiveness to save people during an ambush.\n\n94. Jack Reacher: Never Go Back - He runs, climbs up a car, jumps onto a balcony and keeps running. Good work Tom. \n\n93. The Outsiders - He runs outside a house and does a flip off of a car- Athletic kid. \n\n92. Top Gun: Maverick - Treadmill running. \n\n91. Mission: Impossible III - Street sprinting to grab the Rabbit’s Foot. \n\n90. Oblivion - Running on a circular treadmill.\n\n89. Top Gun: Maverick - Cruise runs away from a helicopter that is shooting at him. \n\n88. Mission: Impossible - Fallout - Hunt starts limping and then breaks out into a run and then he jumps over some shrubs. \n\n87. War of the Worlds - Leather jacket running. \n\n86. The Last Samurai - CHARGE! Dead man running.\n\n85. Mission: Impossible - He does some solid slick cobbled road running. \n\n84. Mission: Impossible - He climbs a fence and sprints down an alley - the cops have zero chance of catching him. Nice crane shot - the scene ends with him running into a phone booth. \n\n83. Mission: Impossible - Ghost Protocol - Sand running. \n\n82. Mission: Impossible 2 - Rips off a mask whilst running. \n\n81. Edge of Tomorrow - Beach running followed by him getting hit by a truck - Love it.\n\n80. Mission: Impossible - Ghost Protocol - Runs after villains to get the MacGuffin. \n\n79. Mission: Impossible III - Running moment heavily featured in the trailer in which an explosion knocks him into a car.\n\n78. Oblivion - He runs and jumps and shoots - It’s fun.\n\n77. The Mummy - He runs through a library while glass shatters around him.\n\n76. The Mummy - They run through London avoiding sand. \n\n75. Mission: Impossible - He runs up some stairs and along a bridge to find Voight - He also runs towards Sara after a few beats. I included them together.\n\n74. Vanilla Sky - Labored and odd running. Crane shot - Trippy running - REM - Slick streets.\n\n73. Minority Report - Running through the streets while pre-crime ads play - Good expository run.\n\n72. All the Right Moves - You are not god! Lots of running and acting. Good stuff. \n\n71. Cocktail - He uses his breakaway speed to sneak past a doorman and into an elevator.\n\n70. Oblivion - He runs away from a fireball - Good jump. \n\n69. The Last Samurai - He tries to teach some kids how to play baseball - “You gotta get the ball!”\n\n68. Mission: Impossible 2 - He runs, picks up Dougray and slams him.\n\n67. Far and Away - While running he slips on something and almost wipes out.\n\n66. Far and Away - He runs and tackles a guy who stole Nicole Kidman’s spoons. \n\n65. Collateral - Staircase running followed by lobby running.\n\n64. Mission: Impossible - Ghost Protocol - Running/limping after a car.\n\n63. Mission: Impossible III - I love a good running charge moment.\n\n62. Mission: Impossible - Rogue Nation - Ethan and Ilsa run out of the opera (he grabs a rope). Then they run across the building (he takes off her shoes) and they use a rope to get out of the area.\n\n61. Top Gun: Maverick - Cruise runs to an airplane hanger and says “Let’s start running.”\n\n60. Mission: Impossible - Ghost Protocol - Runs away from the Kremlin explosion. \n\n59. Jack Reacher: Never Go Back - He and Colby run through an open park and she is outpacing him.\n\n58. Minority Report - Great run and spin.\n\n57. Jack Reacher - He grabs a rock, runs towards a guy and knocks him out. SPEED. \n\n56. Mission: Impossible - Dead Reckoning - As a train falls off a cliff, Cruise runs up it (Think *Furious 7*).\n\n55. Mission: Impossible 2 - Runs in slow motion towards a helicopter and misses it. He then does a flip whilst running to shoot a goon.\n\n54. Jack Reacher: Never Go Back - He and a couple people run away from thugs. I like the way it’s shot. Good parallel running between the groups.\n\n53. Mission: Impossible 2 - Beach fight running. - several instances during the same scene. \n\n52. Mission: Impossible III - Skyscraper running.\n\n51. Edge of Tomorrow - He can’t outrun a fiery death on a beach. \n\n50. Oblivion - He sprints to take the battery out of a drone.\n\n49. Mission: Impossible - Rogue Nation - Hunt and Ilsa run around. \n\n48. The Color of Money -- He kicks a guy in the balls, makes himself big and runs out of a bar. It’s fun.\n\n47. Oblivion - He runs up a sand dune and then he runs down the dune to meet his clone. Impressive sand running. \n\n46. Top Gun: Maverick - He runs a long distance through the woods in the freezing cold.I like the overhead shot. Good work.\n\n45. Mission: Impossible - Rogue Nation - Hunt runs with a limp and stops to catch his breath. It’s nice. He does more limp running which is nice - He then explodes through some glass.\n\n44. Taps - Running with a group of people and he looks like the best runner. Excellent posture. \n\n43. Mission: Impossible - Dead Reckoning - Venice running featuring Cruise jumping over a boat. Then, he’s given the wrong directions by the Entity.\n\n42. Mission: Impossible - Rogue Nation - Hunt and Ilsa run and jump over a car. They are like a pair of raptors.\n\n41. Mission: Impossible - Fallout - “I am terribly sorry.” He interrupts a funeral whilst being chased.\n\n40. The Mummy - While running away from the mummy he hops a stone fence and leaves his lady friend behind.\n\n39. Mission: Impossible - Dead Reckoning - He runs through kitchen grease and jumps into another train car.\n\n38. Born on the Fourth of July - Slow motion beach running. It’s tense.\n\n37. Mission: Impossible - Rogue Nation - He runs to jump kick on a henchmen and then lands on Ilsa.\n\n36. Mission: Impossible 2 - Runs in slow motion (through some doves) and lands a sweet kick. - Fun Woo stuff.\n\n35. Mission: Impossible - Dead Reckoning - Venice running to get to Ilsa.\n\n34. War of the Worlds - Funny moment in which he’s enjoying the “Storm” but then lightning hits and he runs into his house.\n\n33. Mission: Impossible III - Cruise literally runs up a wall.\n\n32. Risky Business - He runs to catch his egg - It’s intense.\n\n31. Oblivion - He runs up to his clone and punches him in the face - Good acceleration on sand.\n\n30. Mission: Impossible III - He runs and jumps off a Shanghai building.\n\n29. War of the Worlds - Dead cow jumping. \n\n28. All the Right Moves - Snags an interception and runs through two players to score a touchdown.\n\n27. Mission: Impossible - Rogue Nation - He runs and jumps onto the wing of a plane.\n\n26. The Firm - Chases after Abbey - This is the first time we ever get to see Tom’s super running form. \n\n  \n\n\n**Top 25!**\n\n\n\n25. *Collateral* \\- Subway running followed by a beautiful jump - Dude is pissed. - 01:46:10\n\n24. *The Mummy* \\- “Slip in, slip out. Just like we always do.” Then it cuts to them being shot at whilst running away. - 00:10:15\n\n23. *Mission: Impossible - Fallout* \\- Keep going straight? - He runs into an office building and smashes a window. 01:34:53\n\n22. *Mission: Impossible - Fallout* \\- Why is he running in a circle? Great overhead shot of cruise sprinting up stairs, losing the goons, and running around the upper floors of the cathedral. - 01:32:59\n\n21. *Mission: Impossible - Fallout* \\- Roof running and two amazing jumps. - 01:33:48\n\n20. *Mission: Impossible - Fallout* \\- During the bathroom fight Hunt runs at a guy and slams him through a wall. Great stuff. I love how he really doesn’t want to do it. - 00:32:38\n\n19. *Minority Repor*t - Runs up to the house and has to stop a potential murder. - 00:15:28:00\n\n18. *Mission: Impossible - Ghost Protocol* \\- Runs away from the Burj Khalifa - Looks awesome. Brad Bird shoots it from every angle. I love how the camera looks up at him.\n\n17. *Mission: Impossible - Fallout* \\- “Ethan he’s getting away from you, you’re going to have to go faster! - Cruise absolutely books it during a roof run that ends with the jump that broke his foot. Epic. - 01:34:20\n\n16. *Jerry Maguire* \\- Airport running. - 02:06:05\n\n15. *Mission: Impossible II* \\- He runs in slow motion so he can jump out of a building - Wonderful - 01:25:58 - He also runs while holding two guns (and shooting them at the same time). Awesome hair work\n\n14. *Risky Business* \\- He takes a drunk guy out of a train and runs back into it. - 01:20:45 \n\n13. *Days of Thunder* \\- He races Robert Duvall - It’s a good time. 01:42:54\n\n12. *War of the Worlds* \\- Cruise runs away from the aliens. Amazing scene. - The aliens are silly for thinking they can blow Cruise up. Dude has ash all over his face. - 00:26:29\n\n11. *Collateral* \\- Runs out of a hospital and across an overpass. When he starts running I don’t think he'll ever look faster on screen. - 00:52:25\n\n  \n\n\n**10.** ***Edge of Tomorrow*** \\- “Arrest this man.” - In an all-timer Cruise moment, he tries to escape arrest and It ends badly - 00:07:58 - [YouTube Clip](https://youtu.be/EO4Mt9DDV-Q) \n\nMoments before Brendan Gleeson’s character yells “Arrest this man,” Tom Cruise delivers an all-timer Cruise moment in which this dialogue is delivered:\n\n“I just inspired millions of people to join your army. And when the body bags come home and they’re looking for someone to blame, how hard do you think it would be for me to convince people to blame you? I’d imagine the general would prefer to avoid that.”\n\nCruise enters Gleeson’s office with total confidence and he quickly becomes a slimy rat whose escape attempt ends quickly. It’s perfect and it makes his heroic transformation more interesting. Director Doug Liman did a great job weaponizing Cruise’s charm in this scene, and It’s fun watching a guy who can’t escape an office building becoming a world-saving soldier.\n\n\n\n**9.** ***The Firm*** \\- The final chase scene. He runs, jumps, goes up steps and this is when we get to see his true breakaway speed AND he’s holding a briefcase. 02:12:23 - [YouTube Clip](https://www.youtube.com/watch?v=D0vCzkK_AJ0&amp;pp=ygUUVGhlIGZpcm0gY2hhc2Ugc2NlbmU%3D) \n\n*The Firm* is Cruise’s first film to fully showcase his soon-to-be-famous running form (elbows and knees). We get a glimpse of it at the 68-minute mark when he’s chasing down Jeannie Tripplehorn. But, it’s not until the climactic chase that we see his breakaway speed for several minutes as he’s running away from Tobin “Jigsaw” Bell. \n\n\n\n**8.** ***Far and Away*** \\- In a neat transition,  Cruise starts running so fast that the next shot is of an explosion. Talk about explosive running.  01:40:13 - [YouTube Clip](https://youtu.be/NajSnF9AspA) \n\nI love how Ron Howard cuts from a sprinting Tom Cruise to an explosion. It’s silly and it always puts a smile on my face. I also love that the movie ends with the Land Run of 1893. \n\n\n\n**7.** ***Mission: Impossible - Rogue Nation*** \\- Cruise wipes out while trying to jump over a car. It is very funny and the MI score helps make it better - 01:12:58 - [YouTube Clip](https://youtu.be/WK8X6m_wEbg) \n\n“This is *Mission: Impossible*, I can’t just cross a street and get in a car.” - McQuarrie talking about a conversation he had with Cruise on the *Rogue Nation* commentary. \n\nWhen putting together the top 10 I always knew that this three-second moment would be included. It’s a silly moment punctuated by cheeky musical accompaniment and it proves that Cruise doesn’t take himself seriously. It’s made even better by the knowledge that Cruise came up with this bit on the day and he surprised the crew with his ill-fated car jump. Also, the ensuing dialogue (What are you talking about?) is delightful. At this point in his career, Cruise was on a hot streak and it’s fun knowing that he was still totally down to make himself look like a dork.  \n\n\n\n**6.** ***Mission: Impossible - Fallout*** \\- Iconic run across the building punctuated by a beautiful tracking shot - Dude looks amazing and he almost catches Cavill - 01:36:25 - [YouTube Clip](https://youtu.be/Sjn3ELLcy2U)\n\n“I loved doing this, but it hurt.” - Tom Cruise - *Fallout* Blu-ray commentary. \n\nWatching Cruise run across The Blackfriars Railway bridge is an all-timer Cruise moment for multiple reasons. \n\n* It looks great and is a perfect trailer moment\n* “I’m jumping out of a window.” - Great line - I love the reaction he gets from the people in the office. They \n* Tom was still recovering from the ankle break he suffered during a jump gone awry\n* Director Christopher McQuarrie said - “He was going for it.”\n* The score rules\n* It’s a bit gratuitous but the running makes sense in regards to the story.\n\n\n\n**5**. ***Mission: Impossible*** \\- Cruise runs from an exploding restaurant and does his first “I look awesome while running in an action film” work. - 31:59 - Lots of fish die….. [YouTube Clip](https://www.youtube.com/watch?v=s8HHeT4Eo6A&amp;pp=ygUiTWlzc2lvbiBpbXBvc3NpYmxlIGZpc2ggcmVzdGF1cmFudNIHCQl-CQGHKiGM7w%3D%3D)\n\nThat one was particularly very crazy - Talking about the scene on The Graham Norton Show\n\nTom Cruise was already a big star in 1996, but this moment made him a gigantic “action movie” star. He had been in *Top Gun* (sitting in a plane), *Legend* (lots of rolling and crouch running), Days of Thunder (*more sitting*), Far and Away (*boxing*), and *The Outsiders* (fisticuffs), but *Mission: Impossible* saw him entering a new phase of his career. This moment was everywhere in 1996 and it’s one of the most iconic images of the *Mission: Impossible* franchise. It gets added points because the stunt looks legitimately dangerous and features some solid arm work from Tom. \n\n\n\n**4.** ***Risky Business*** \\- A cigarette-smoking Cruise (wearing sunglasses at night) runs up to some teenagers while the song “Mannish Boy” plays on the soundtrack This is the moment when Cruise became Tom Cruise - 01:07:26 - [YouTube Clip](https://youtu.be/adZvM19Qnb0) (starts at 53 seconds)\n\nWearing a suit coat, black shirt, black sunglasses and puffing on a cigarette, Cruise is strutting down the street and runs up to a group of classmates. The moment lasts only seven seconds,  but it’s a turning point for Cruise. Also, the song selection is perfect. \n\n\n\n**3.** ***Vanilla Sky*** \\- Cruise runs through an empty Times Square - 00:03:37 - [YouTube Clip](https://youtu.be/-kNdNC-2wPU)\n\nThe groundwork for the Times Square running in *Vanilla Sky* was set up in the 1996 film *Jerry Maguire*. In the Cameron Crowe-directed movie, Cruise dramatically runs through an airport -  and it looks great. Years later, while filming *Vanilla Sky*, Crowe and Cruise pulled some strings with the city of New York and were able to close down Times Square for three hours on a Sunday morning in November. The idea was that Cruise’s character hates being alone, and he dreams that he’s alone in one of the busiest places in the world. It’s total vanity, but I love that Cruise has a running scene in an empty Times Square. \n\n\n\n**2.** ***Collateral*** \\- He throws a chair through a glass window, then WIPES out on the chair and just keeps running. It’s his most aggressive running ever. - 01:44:50 -[ YouTube Clip (starts at 2:37)](https://youtu.be/_pTzb4rl5Y8)\n\n*Collatera*l not only features the best sitting performance of Tom Cruise’s career, it also features his most aggressive running. Tom’s character Vincent is a straight-up killer and it’s fun watching Cruise as he fully commits to being a coyote who chases down his prey with lightning-fast footwork. There’s a moment towards the end when Vincent is chasing down Max and Annie (Jada Pinkett Smith - running in heels), and he takes a chair to smash a window so he can run through it. However, Cruise mistimed/misjudged the chair’s trajectory and he WIPED out on the chair and fell to the ground. The neat thing is that he springs up immediately and keeps running. It’s a perfect showcase for Cruise’s tenacity and toughness and I love that the unplanned moment made its way into the film - and so does Mann who felt like it added to the realism of *Collateral*. It’s a seconds-long moment, but I love that nothing can stop Cruise from running. \n\n\n\n**1.** ***Mission: Impossible III*** \\- Cruise runs across some rooftops and then he SPRINTS through a Shanghai fishing village - 01:44:10 - [YouTube Clip](https://www.youtube.com/watch?v=UOqV-jDl0h8&amp;pp=ygUhbWlzc2lvbiBpbXBvc3NpYmxlIDMgc2hhbmdoYWkgcnVu0gcJCX4JAYcqIYzv)\n\nIn 2006, Cruise had been running in movies for 20+ years and had some memorable sprints in *War of the Worlds, The Firm, Minority Report, Collatera*l, and *Far and Away*. However, his sprinting in *M:I 3* (which took 6-7 takes to get perfect) made people sit up and realize they were witnessing cinematic running history. It’s the fastest Cruise has ever looked, and the spidercam rig that was built for the scene works perfectly as it tracks alongside Cruise as he damn near goes plaid on the Shanghai sidewalks. During the Blu-ray commentary, director J.J. Abrams says “I loved watching you run” to Cruise, and I totally agree. It’s apex Tom Cruise running.\n\n  \n**Make sure to check out my other** [**Reddit data posts**](https://www.reddit.com/user/LundgrensFrontKick/) **if you like this one! Also, if you're bored, I've covered many films on The Movies, Films and Flix podcast (it's available wherever you listen to podcasts). Also, make sure to listen to Deep Blue Sea - The Podcast**\n\n",
        "upvotes": 426,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/097vi5epbB0A5mjWzfud4lvNrGq68gtbjKEnxXgb-ts.jpg?auto=webp&amp;s=6035910a2a609feab7d2c478692a493b21752e3b"
        },
        "permalink": "/r/movies/comments/1k7kl56/i_rewatched_all_of_tom_cruises_films_from_endless/"
    },
    {
        "id": "1k7m904",
        "author": "KillerCroc1234567",
        "title": "Tom Hanks &amp; Apple’s ‘Greyhound’ Sequel To Begin Filming Early 2026 &amp; Will Take In D-Day &amp; The Pacific Theater",
        "content": "",
        "upvotes": 297,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nx333VHFKEPzlNz7GFZQ4dZJxTpH0oV63BbvvoPzx9o.jpeg?auto=webp&amp;s=6d957fd51ed7db23ced7dcd11e84d9ab6b3b1c3f"
        },
        "permalink": "/r/movies/comments/1k7m904/tom_hanks_apples_greyhound_sequel_to_begin/"
    },
    {
        "id": "1k7ix5u",
        "author": "MarvelsGrantMan136",
        "title": "Sam Raimi’s Survival Horror ‘SEND HELP’, Starring Dylan O’Brien &amp; Rachel McAdams, Has Wrapped Filming",
        "content": "",
        "upvotes": 328,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_EGYaiKE35ME1TPtwUBEBPjjMYWWapFWxPyXxXJPZlQ.png?auto=webp&amp;s=d91dbee1fdf2f267fb4bb235d49b8e6746518394"
        },
        "permalink": "/r/movies/comments/1k7ix5u/sam_raimis_survival_horror_send_help_starring/"
    },
    {
        "id": "1k71xfp",
        "author": "orthos",
        "title": "One of my favorite movie scenes ever - Amadeus (1984) - Salieri realizes he will never be on Mozart's level of genius.",
        "content": "",
        "upvotes": 3116,
        "comments": 310,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_o44XPMi0SEMntLV14bHhe-ZughQZaPKN-vtKek2G4c.jpeg?auto=webp&amp;s=cbb88d87a7fc8c464349f198a04bef6338348835"
        },
        "permalink": "/r/movies/comments/1k71xfp/one_of_my_favorite_movie_scenes_ever_amadeus_1984/"
    },
    {
        "id": "1k7cquy",
        "author": "Bluntfeedback",
        "title": "Movies that aged like fine wine",
        "content": "What older movie (20+ years) do you think has aged like fine wine and is even more impressive when watched today?\n\nNetwork (1976) seemed over-the-top and satirical when it was released, but watching it now feels eerily prophetic about our modern media landscape and reality TV culture. What other older films initially missed the mark but became more relevant with time?",
        "upvotes": 603,
        "comments": 829,
        "media": null,
        "permalink": "/r/movies/comments/1k7cquy/movies_that_aged_like_fine_wine/"
    },
    {
        "id": "1k6ttdz",
        "author": "BunyipPouch",
        "title": "First Image from Netflix's Mystery-Comedy 'The Thursday Murder Club' - Starring Helen Mirren, Pierce Brosnan, Ben Kingsley, Richard E. Grant, Naomi Ackie, and Jonathan Pryce - Four retirees spend their time solving cold case murders for fun, until they find themselves stuck in a real whodunit.",
        "content": "",
        "upvotes": 9065,
        "comments": 474,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zyathbiinswe1.jpeg?auto=webp&amp;s=b66582a4c04c65c89cf6646b67a292620241a381"
        },
        "permalink": "/r/movies/comments/1k6ttdz/first_image_from_netflixs_mysterycomedy_the/"
    },
    {
        "id": "1k6riqi",
        "author": "CheechandChong-AMA",
        "title": "Hey man, we're Cheech and Chong, we’re doing one of those Ask Us Anything things. You can ask about our lives, careers, or new movie (Cheech and Chong's Last Movie) and we’ll do our best to remember things. Bring a bud and a snack or two, just no math questions please.",
        "content": "Hey man, we're Cheech and Chong, we’re doing one of those Ask Us Anything things. You can ask about our lives, careers, or new movie (Cheech and Chong's Last Movie) and we’ll do our best to remember things. Bring a bud and a snack or two, just no math questions please. \n\nWe'll be back at 4 PM ET today to answer your quesitons.\n\nMore info about our new movie:\n\nOfficial Trailer:\n\n[https://www.youtube.com/watch?v=yFZaR4ubS20](https://www.youtube.com/watch?v=yFZaR4ubS20)\n\nCHEECH &amp; CHONG’S LAST MOVIE – Exclusively in Theaters Friday 4/25 🥦\n\nIn the 1970s, Cheech &amp; Chong redefined stand-up comedy, blending drugs, sex, rock’n’roll, and improvisation into a genre-shaping act. Their multicultural, irreverent humor turned them into icons, counterculture rock stars, and Hollywood legends. How did Cheech and Chong ignite imaginations and stay relevant over 50 years? Join them for one last ride to find out... and bring a bud!\n\nDirected by: David Bushell\n\nProduced by: David Bushell and Robbi Chong\n\nStarrirg: Cheech Marin and Tommy Chong",
        "upvotes": 5478,
        "comments": 705,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/49f8k6yg5swe1.png?auto=webp&amp;s=6f02add6c1451bd7f77e76129c4ae7557293a6e5"
        },
        "permalink": "/r/movies/comments/1k6riqi/hey_man_were_cheech_and_chong_were_doing_one_of/"
    },
    {
        "id": "1k7pqm2",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Kevin Smith - Thursday 5/29 at 3:00 PM ET - Director of 'Clerks', 'Dogma', 'Mallrats', 'Chasing Amy', 'Jay and Silent Bob Strike Back', 'Tusk', 'Cop Out', 'Red State', and much more.",
        "content": "",
        "upvotes": 20,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w09y0ag7g0xe1.png?auto=webp&amp;s=0b67c5aa30124193ae4550126cd7b223b6e53f13"
        },
        "permalink": "/r/movies/comments/1k7pqm2/amaqa_announcement_kevin_smith_thursday_529_at/"
    },
    {
        "id": "1k7egcf",
        "author": "hcknbnz",
        "title": "What film is the 'wrong entry point' for either an actor or director?",
        "content": "What film represents the wrong entry point for an actor or director when viewed against the rest of their body of work? This isn't necessarily about their worst or least successful film, but rather about a movie that serves as the wrong starting place to their career. Their first film is off-limits, choosing that would be too easy and feel like a cop-out. The film should stand out in some distinct way from the rest of their work, which makes the question even more interesting and more difficult when applied to someone with a long and varied career.\n\nSome examples might include Arnold Schwarzenegger in Junior, Francis Ford Coppola's Jack, Kevin Smith's Red State, or Judi Dench in The Chronicles of Riddick.",
        "upvotes": 122,
        "comments": 297,
        "media": null,
        "permalink": "/r/movies/comments/1k7egcf/what_film_is_the_wrong_entry_point_for_either_an/"
    },
    {
        "id": "1k72l9p",
        "author": "Past-Outside8050",
        "title": "What's the greatest fake sports moment or athlete cameo in a movie or TV show?",
        "content": "What's the greatest fake sports moment or athlete cameo in a movie or TV show? I know there  are a lot to choose from. I think it’s even better when the athletes go along with the joke. \n\nMy answer is Mark Wahlberg’s character in the Other Guys. If you don’t know he plays a cop and accidentally shot Derek Jeter on the night of game 7 of the World Series. \n\n",
        "upvotes": 693,
        "comments": 714,
        "media": null,
        "permalink": "/r/movies/comments/1k72l9p/whats_the_greatest_fake_sports_moment_or_athlete/"
    },
    {
        "id": "1k7dur9",
        "author": "The_Spaghetti_yeti",
        "title": "Trainspotting 2 is a Top-Tier Film",
        "content": "Just as the title says. I watch this movie around once a year, and it's easily in my top 5. \n\nIt's fantastic movie about aging, friendship and loneliness. It's heartbreaking, funny, thought provoking, and well directed (crisp and creative visuals) + acted. I really like the original as well, but there's just something about this film. \n\nAnyone else think Trainspotting 2 is top notch? ",
        "upvotes": 105,
        "comments": 61,
        "media": null,
        "permalink": "/r/movies/comments/1k7dur9/trainspotting_2_is_a_toptier_film/"
    },
    {
        "id": "1k7l7vw",
        "author": "1fishmob",
        "title": "Weird question, but is there an example of a movie where the end credits are black text on a white background instead of the usual white on black?",
        "content": "A very, very oddly specific question, but I only realized how common that form of end credits are after watching a series that had the opposite, like the title of this post suggests; black text on a white background. So I was wondering if there were any examples of this reversal in actual movies or not?",
        "upvotes": 21,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1k7l7vw/weird_question_but_is_there_an_example_of_a_movie/"
    },
    {
        "id": "1k7g0sl",
        "author": "FilmWaffle-FilmForum",
        "title": "What are some of the most aesthetically pleasing animated movies?",
        "content": "Coraline will always be my first choice for this question. The set design, cinematography and vibrant colours are fantastic. The garden scene in the other world will forever be one of my favourite animated scenes of all time. \n\nWhat other animated movies can you think of that scream “aesthetically pleasing”?",
        "upvotes": 51,
        "comments": 161,
        "media": null,
        "permalink": "/r/movies/comments/1k7g0sl/what_are_some_of_the_most_aesthetically_pleasing/"
    },
    {
        "id": "1k7bluo",
        "author": "KillerCroc1234567",
        "title": "Oscars: Film Academy Revokes, Then Reinstates Screenings Access for Widows and Widowers After Backlash",
        "content": "",
        "upvotes": 119,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/N4vafNdyir7Og6IrtAgwBUJCZlZa1_aldCXKrMBzLRw.jpeg?auto=webp&amp;s=4bd66a402f858df568a12dedfd70c75470b79b64"
        },
        "permalink": "/r/movies/comments/1k7bluo/oscars_film_academy_revokes_then_reinstates/"
    },
    {
        "id": "1k70ec4",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Guy Ritchie’s ‘The Fountain of Youth’",
        "content": "",
        "upvotes": 564,
        "comments": 134,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/skhofj92ztwe1.jpeg?auto=webp&amp;s=180f570b397b4dbffdfeb63d16dd28db5d5b5eb8"
        },
        "permalink": "/r/movies/comments/1k70ec4/official_poster_for_guy_ritchies_the_fountain_of/"
    },
    {
        "id": "1k70824",
        "author": "Ticus6866",
        "title": "Whiplash ending hit like a truck, and I can’t stop thinking about how neither of them were really victims.",
        "content": "Just rewatched Whiplash and that ending hit different this time. Everyone talks about how epic the final scene is and it is but TBH it kind of cemented how much Andrew completely lost the plot by then.\n\nThe whole movie builds up this toxic cycle between him and Fletcher, and yeah, it looks like Fletcher is the manipulative villain while Andrew is just this ambitious underdog. But by the end, it’s not that simple. Andrew needs Fletcher’s validation. He’s been so brainwashed that he’ll go to any length for that one moment of acknowledgment.\n\nAnd Fletcher.. well he’s a wreck too. He loses his job, his respect, everything but still clings to this idea that greatness only comes from suffering. In that final scene, he basically traps Andrew, tries to humiliate him and Andrew still gives him what he wants. It’s messed up. They’re not enemies, they’re enablers.\n\nThere’s no real “winner” here. They both pushed each other past the edge. And while it ends with that incredible solo, it’s not triumphant. It’s tragic. Andrew isn’t free..he’s all in, and there’s no coming back. He’s chasing this impossible standard that’ll probably destroy him.",
        "upvotes": 523,
        "comments": 143,
        "media": null,
        "permalink": "/r/movies/comments/1k70824/whiplash_ending_hit_like_a_truck_and_i_cant_stop/"
    },
    {
        "id": "1k79o90",
        "author": "LiteraryBoner",
        "title": "Official Discussion - Until Dawn [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/oS6HYtAvNujW)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/oS6HYtAvNujW)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ItnAgr4mX7QR) to see the rankings of 2025 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done \n\n---\n\n**Summary**  \n*Until Dawn* is a horror film directed by David F. Sandberg, based on the 2015 video game of the same name. The story follows Clover and her friends as they venture into a remote valley to investigate the mysterious disappearance of Clover's sister, Melanie. They find themselves trapped in a time loop, reliving the same night where they are hunted by a masked killer. Each iteration introduces new and more terrifying threats, and the group realizes they have a limited number of chances to survive until dawn. The film explores various horror subgenres, including slasher, supernatural, and body horror.\n\n**Director**  \nDavid F. Sandberg\n\n**Writers**  \n- Blair Butler  \n- Gary Dauberman\n\n**Cast**  \n- Ella Rubin as Clover  \n- Michael Cimino  \n- Odessa A’zion  \n- Ji-young Yoo  \n- Maia Mitchell  \n- Belmont Cameli  \n- Peter Stormare as Dr. Alan J. Hill\n\n**Rotten Tomatoes**: [63%](https://www.rottentomatoes.com/m/until_dawn_2025)  \n**Metacritic**: [56](https://www.metacritic.com/movie/until-dawn/)\n\n**VOD**  \nTheaters\n\n**[Trailer](https://www.youtube.com/watch?v=2b3vBaINZ7w)**\n\n---",
        "upvotes": 101,
        "comments": 81,
        "media": null,
        "permalink": "/r/movies/comments/1k79o90/official_discussion_until_dawn_spoilers/"
    },
    {
        "id": "1k7h4kq",
        "author": "Freddy-Philmore",
        "title": "If you’re into ’80s/’90s little known serial killer B-movie thrillers, I fell down a Tubi rabbit hole... here’s 10 that I liked. If any suggestions please share.",
        "content": "I love watching this stuff late at night. Not like the A list ones like Manhunter, Silence of the Lambs...  but the direct to vid kind. Not horror but more thriller territory.\n\nThese movies have a bunch of things in common... besides being on Tubi...\n\n* They’ve all been remastered and look great... not those cheap, oversaturated digital transfers you sometimes get with obscure titles.\n* 2) They're all real decently-made B-indie thrillers not like super cheepos.\n* 3) They involve serial killers.\n* 4) Most have surprisingly solid casts and a few have well regarded directors.\n* 5) They're all a little bit weird.\n\n**Fear City**  \nThis one was a real surprise. Directed by Abel Ferrara, it stars Billy Dee Williams, a young Tom Berenger, and an about-to-be-famous Melanie Griffith. The plot centers around a serial killer targeting strippers and their bosses in NYC. Billy Dee plays a hard-as-nails cop with some raw, standout scenes... he’s seriously great in this. Everyone is, actually except the killer, oddly. You see him early (not a reveal), and he's almost laughably bad, like a weirdly silent rock trying to act. Still, it works in its own unhinged way.\n\n**The Killer Hour 1982 (the** clairvoyant)  \nA serial killer is handcuffing victims in bizarre ways. A psychic develops a strong connection to the case. Meanwhile, a TV talk show host (a young Perry King) sees it as a chance to boost his career, and a detective caught between them (also trying to be a comedian doing impressions) is trying to solve the case while navigating friendships and romance. lol\n\n**Stranger by Night 1994**  \nSteven Bauer is terrific as a detective who’s blacking out and starting to believe he might actually be the killer he’s hunting. Classic B-movie setup: clunky side characters and obvious plot points, and feels very direct to video but Bauer's performance really grounds it and makes it work better than you'd expect.\n\n**Blind Date 1984**  \nThis one is really *strange*. A photographer, still obsessed with his ex, thinks her new boyfriend might be a serial killer. While spying on them, the boyfriend chases him, and he runs into a tree and goes blind. From there, the movie totally shifts gears into a sort of tech-drama as he learns to navigate the world again with the help of a computer system that lets him \"see\" in stick figures. This is most of the movie oddly. Eventually, we return to the serial killer plot very late in the film. It’s unevenly paced, but it kept me watching.\n\n**The Rain Killer 1990**  \nSet in a gloomy, rainy L.A., a serial killer is murdering women, and the lead detective has a personal connection to the case. This one sits firmly in B-movie territory but has a decent lead and a noir-ish vibe that gives it some style.\n\n**Traces in Red 1992**  \nMore serial killings, more cops, more partners, and lots of tangled personal relationships. Jim Belushi stars, and your enjoyment will probably depend on your tolerance for Belushi doing Belushi things. It's B-movie cheese fun if you're in the right mood.\n\n**Killer's Delight 1976**  \nMid-70s grindhouse vibes. A serial killer is stalking young women across California. Misogynistic. A determined cop is on the case. It’s pretty by-the-numbers, but as a time capsule of '70s California, it’s got style and charm.\n\n**The Stranger 1987**  \nBonnie Bedelia (the wife from Die Hard) plays a woman with amnesia after a traumatic accident. Someone is trying to kill her, and she doesn’t know why. Her doctor tries to piece together her returning memories before it’s too late. A nice mix of psychological thriller and slasher.\n\n**The Banker 1989**  \nThe title is misleading... he's not really a banker. He’s a psycho killing prostitutes for a South American god or something with a crossbow. Glossy late-‘80s vibes, sleazy charm, and an awkward killer setup make this one stand out a bit. Supporting role for Grease/Taxi star Jeff Conaway. He's seen better days. But Robert Forster (Jackie Brown) raises the bar here.\n\nAnd finally the one that got me into the rabbit hole...\n\n**NIGHT GAME (1989)**  \nRoy Scheider is great as usual as a Texas cop tracking (not a shark this time) a serial killer targeting young women in a coastal town, all while the Astros chase a playoff spot. The film is misogynistic... even by late '80s standards, with graphic kills, macho cops, and Scheider’s character engaged to a woman 25 years his junior, which feels icky. Still, it’s well-acted and nicely shot. While light on action, it delivers a solid investigation and plenty of scene-chewing, character-driven dialogue as it dips into slasher territory. A flawed but entertaining watch.",
        "upvotes": 20,
        "comments": 20,
        "media": null,
        "permalink": "/r/movies/comments/1k7h4kq/if_youre_into_80s90s_little_known_serial_killer/"
    },
    {
        "id": "1k7d6qt",
        "author": "tme77",
        "title": "Just for fun. What movie do you always watch if it happens to come on",
        "content": "Point Blank just came on while I was flipping through channels, and I haven't watched it since it came out, but I have come across it 2x in the last year and watched both times.  Not my favorite by any means, but still find it a good watch/stands the test of time.  So it got me thinking what movies my fellow redditors also rewatch (not necessarily seeking it out) when it comes on.\n\nNot asking for favorites necessarily, just for fun, and maybe I'll find a movie or two to check out from your responses! \n\nEdited: typos and RIP Patrick Swayze ",
        "upvotes": 49,
        "comments": 214,
        "media": null,
        "permalink": "/r/movies/comments/1k7d6qt/just_for_fun_what_movie_do_you_always_watch_if_it/"
    },
    {
        "id": "1k75qcp",
        "author": "verissimoallan",
        "title": "'Friday the 13th Part VII’ Star Lar Park Lincoln Has Passed Away",
        "content": "",
        "upvotes": 136,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1k75qcp/friday_the_13th_part_vii_star_lar_park_lincoln/"
    },
    {
        "id": "1k6yvw7",
        "author": "ChiefLeef22",
        "title": "'Havoc' - Review Thread",
        "content": "Director: Gareth Evans\n\nCast: Tom Hardy,  Jessie Mei Li, Timothy Olyphant, Forest Whitaker, Justin Cornwell\n\nLogline: *After a drug deal gone wrong, a bruised detective must fight his way through the criminal underworld to rescue a politician's estranged son, unravelling a deep web of corruption and conspiracy that ensnares his entire city.*\n\n**Rotten Tomatoes:** [67/100](https://www.rottentomatoes.com/m/havoc_2025)\n\n**Metacritic:** [59/100](https://www.metacritic.com/movie/havoc/)\n\nSome Reviews:\n\n[The Hollywood Reporter - David Rooney](https://www.hollywoodreporter.com/movies/movie-reviews/havoc-review-tom-hardy-gareth-evans-netflix-1236198216/)\n\n&gt;With Hardy in fine form at the wheel, *Havoc* knows what its audience wants. It also looks great, with regular Evans DP Matt Flannery’s dynamic cameras zipping in and out of the bloody fray and textured visuals slashed with throbbing colors. The setting is a city so grim and seedy it seems to exist only at night. The fact that the environments were mostly constructed at a studio in Cardiff suggests there’s lots of ace craftspeople hiding out in Wales.\n\n[SlashFilm - Chris Evangelista](https://www.slashfilm.com/1842207/havoc-movie-review-tom-hardy-gareth-evans/)\n\n&gt;To be clear: I love a good, violent action movie as much as the next dude, but you have to give me something more than just one extreme shootout followed by another. Perhaps if the hyperviolence was a little more stylized it would play better. Instead, it's just ugly stuff repeated in numbing fashion. By the time \"Havoc\" ended, I felt as exhausted as Hardy's beaten and bruised character. I suppose Evans and company deserve some credit for making an action movie that really leans into the brutality, but there's only so much of that you can put up with before it starts to grow tedious.\n\n[Variety - Peter Debruge](https://variety.com/2025/film/reviews/havoc-review-tom-hardy-gareth-evans-1236375320/)\n\n&gt;There’s a reason big-studio producers looked to Sundance darlings like Colin Trevorrow, Rian Johnson and Jon Watts to handle their tentpoles: not because those guys are great at action, but because they keep the interpersonal dynamics interesting. That’s precisely where Evans wreaks the most havoc, ignoring (or simply not understanding) what connects us to such characters in the first place — and therefore ensuring that his unwieldy Netflix vehicle is dead on arrival.\n\n[NextBestPicture - Giovanni Lago](https://nextbestpicture.com/havoc/) \\- 6/10\n\n&gt;After years of waiting, it feels like “Havoc” was never going to reach the pre-conceived levels of hype that it was supposed to live up to. It’s clear that whenever certain moments were filmed years later than the original period of principal photography (mainly due to Hardy’s more than apparent changes in beard thickness), there’s doubt it made any real difference in the final cut that Evans envisioned. Still, when “Havoc” hits, it only reminds us how awesome it feels when Evans gets to do his own thing. Even a flawed Gareth Evans film satisfies more than most action flicks today.\n\n[Empire - Beth Webb](https://www.empireonline.com/movies/reviews/havoc/) \\- 4/5\n\n&gt;There’s also something refreshingly egoless to it; Hardy may have top billing but takes not only many sucker punches to the face but an entire roof to the head. Around him Evans utilities his full cast, throwing greener actors like Quelin Sepulveda, who plays Charlie’s partner Mia, into the eye of the storm, armed with a meat cleaver and a mission to survive. The result is a throbbing, bone-crunching diorama of violence with the occasional horrifying, glorious flourish (you’ll never want to see a fishing harpoon again).\n\n[Slant Magazine - Jake Cole](https://www.slantmagazine.com/film/havoc-review-tom-hardy-gareth-evans/)\n\n&gt;Instead of elaborate exchanges of close-quarters strikes and counters, the characters here tend to get the upper hand based on who has the quickest reflexes in tackling an assailant or getting a block up at the last possible second. Despite the advanced choreography that Evans and Flannery capture with a generally superior sense of visual fluidity than they displayed in the *Raid* movies, there’s an overwhelming sense of chaos here that feels realistic.\n\n[Nick Schager - The Daily Beast](https://www.thedailybeast.com/obsessed/tom-hardys-havoc-review-the-action-extravaganza-of-the-year/)\n\n&gt;*Havoc* is such relentless, hardhearted business that the squeamish need not enlist. Nonetheless, those with a hankering for escalating insanity will be well satiated by this saga, whose narrative convolutions are untangled in a second half that puts a premium on combat. Disappointingly, Evans (who wrote the script) shortchanges Olyphant in a role that’s barely one-dimensional and receives no stand-out moments—to a large extent because he shares only scant screen time with Hardy. The director makes up for it, however, with a barrage of broken bones and mutilated corpses—and set pieces drenched in slow motion and decorated with flying glass, splinter, and bodily debris—that tips the material into sensory-overload territory.\n\n[Collider - Tania Hussain](https://collider.com/havoc-movie-review-netflix-tom-hardy/)\n\n&gt;*Havoc* might deliver on its promise of blood, guts, and glory, but it’s these committed performances that keep it from completely collapsing under its self-induced chaos. While the vision by Evans swings hard as a stylishly savage brawler, it rarely lands with meaning, which also feels like an injustice to the filmmaker’s incredible past work. Despite a top-tier cast and bone-rattling action to keep you engaged, the Netflix flick buckles under a cluttered story with chaotic execution. It’s watchable, even entertaining in bursts — but beneath all the bruises and broken bones, there’s not much else to hold onto.\n\n[IndieWire - David Ehrlich](https://www.indiewire.com/criticism/movies/havoc-review-netflix-tom-hardy-1235117850/?utm_campaign=trueanthem&amp;utm_medium=social&amp;utm_source=twitter) \\- B-\n\n&gt;Rote as Evans’ plot might be, and wasteful as its treatment of certain characters *definitely* is (pour one out for Jessie Mei Li, whose screen time as Walker’s new partner greatly outweighs her purpose to the story), he has a well-developed ear for ice-cold gangster speak, and he isn’t afraid to make people pay a steep price for their penance. It’s enough to forgive him — and/or the movie gods — for making us wait so long to see him do it again. ",
        "upvotes": 303,
        "comments": 165,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7hWAQleIbcA6y75_a03X6blRKmGvmi0ViOAiY80WWqU.jpg?auto=webp&amp;s=8cd1f6d1c9117179cc576e9fc628451fcf1cf688"
        },
        "permalink": "/r/movies/comments/1k6yvw7/havoc_review_thread/"
    },
    {
        "id": "1k6uxsf",
        "author": "cmaia1503",
        "title": "Chloe Zhao’s ‘Hamnet,’ Starring Paul Mescal and Jessie Buckley, Sets November 27th Release Date",
        "content": "",
        "upvotes": 428,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZbukI1OVl6GWpIQhB5rVLqRgPzuaSeRXe9ZFXg_ygoQ.jpg?auto=webp&amp;s=bd43d18b911f6255f6c3367ba22c94ac0561a973"
        },
        "permalink": "/r/movies/comments/1k6uxsf/chloe_zhaos_hamnet_starring_paul_mescal_and/"
    },
    {
        "id": "1k7k709",
        "author": "Sad_Interest_7308",
        "title": "Bryan Fuller's Dust Bunny movie release",
        "content": "Okay, so Bryan Fuller revealed that on a podcast not too long ago that he had completed a film titled Dust Bunny starring Mads Mikkelsen and Sigourney Weaver. He said that the film is scheduled to be released in 2025.\n\nI was hoping we would get a set date for the film during Cinemacon but haven't heard anything regarding that. If anyone knows anything about a potential release date during the year, please let me know in the comments. ",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1k7k709/bryan_fullers_dust_bunny_movie_release/"
    },
    {
        "id": "1k79o5r",
        "author": "LiteraryBoner",
        "title": "Official Discussion - The Accountant 2 [SPOILERS]",
        "content": "#Poll\n\n**If you've seen the film, please rate it [at this poll](https://strawpoll.ai/poll/vote/cyPFmDgtrtMx)**\n\n**If you haven't seen the film but would like to see the result of the poll [click here](https://strawpoll.ai/poll/results/cyPFmDgtrtMx)**\n\n#Rankings\n\n[Click here](https://strawpoll.ai/list/ItnAgr4mX7QR) to see the rankings of 2025 films\n\n[Click here](https://youpoll.me/list/4/) to see the rankings for every poll done \n\n---\n\n**Summary**  \n*The Accountant 2* picks up nine years after the original, with Christian Wolff (Ben Affleck) drawn back into a deadly investigation when his former boss, Treasury Director Ray King (J.K. Simmons), is murdered. The cryptic message \"find the accountant\" leads Agent Marybeth Medina (Cynthia Addai-Robinson) to seek Christian's help. Teaming up with his estranged brother Brax (Jon Bernthal), Christian uses his exceptional skills to unravel a conspiracy involving human trafficking and corruption. As they delve deeper, they attract the attention of ruthless killers intent on stopping them. The film combines intense action with moments of dark humor, exploring themes of neurodiversity and familial bonds.\n\n**Director**  \nGavin O'Connor\n\n**Writer**  \nBill Dubuque\n\n**Cast**  \n- Ben Affleck as Christian Wolff  \n- Jon Bernthal as Brax  \n- Cynthia Addai-Robinson as Marybeth Medina  \n- Daniella Pineda as Anaïs  \n- Allison Robertson as Justine  \n- J.K. Simmons as Ray King  \n- Robert Morgan as Burke  \n- Grant Harvey as Cobb  \n- Andrew Howard as Batu \n\n**Rotten Tomatoes**: [75%](https://www.rottentomatoes.com/m/the_accountant_2)  \n**Metacritic**: [60](https://www.metacritic.com/movie/the-accountant-2/)  \n\n**VOD**  \nTheaters\n\n**[Trailer](https://www.youtube.com/watch?v=)**\n\n---",
        "upvotes": 52,
        "comments": 88,
        "media": null,
        "permalink": "/r/movies/comments/1k79o5r/official_discussion_the_accountant_2_spoilers/"
    },
    {
        "id": "1k71dlk",
        "author": "dcterr",
        "title": "The Gods Must Be Crazy",
        "content": "How many of you watched this one? If not, I highly recommend it! I think it captures quite well what's wrong with \"civilized men\", in particular, to how we relate to more \"primitive societies\", and I think it has a very strong moral message, or perhaps a few! In addition, I think the story is quite entertaining and inspiring. Watch where you drop your Coke bottle!",
        "upvotes": 161,
        "comments": 72,
        "media": null,
        "permalink": "/r/movies/comments/1k71dlk/the_gods_must_be_crazy/"
    },
    {
        "id": "1k6vy1y",
        "author": "KillerCroc1234567",
        "title": "‘Ballerina’: Exclusive Character Posters from the John Wick Universe Movie",
        "content": "",
        "upvotes": 305,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AeHF_yE-qyrivaC3tvd5_qe35iTU-e7bX0lqOM1viJo.jpg?auto=webp&amp;s=3a903238f8fdf1f90b4d9a31d81941877266eccf"
        },
        "permalink": "/r/movies/comments/1k6vy1y/ballerina_exclusive_character_posters_from_the/"
    },
    {
        "id": "1k7gn9n",
        "author": "Scamwau1",
        "title": "Brendon Gleeson's performance in The Smurfs movie is hilariously bad and yet somehow, perfect.",
        "content": "I just happened to flick over to see that there is a  Smurfs 2 movie. And then I was surprised to see it had Brendon Gleeson and had to marvel at why such a good actor would do this movie. The movie was soo different from the other stuff he normally does, I wonder why he choose to do the project. His performance was so over the top, a stark contrast from his measured and subtle acting in most of his other roles. He must have been given a great pay day. ",
        "upvotes": 10,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1k7gn9n/brendon_gleesons_performance_in_the_smurfs_movie/"
    },
    {
        "id": "1k6wpmp",
        "author": "cmaia1503",
        "title": "‘Hunger Games: Sunrise On The Reaping’ Movie At Lionsgate Taps Mckenna Grace In Maysilee Donner Role",
        "content": "",
        "upvotes": 198,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Uf3vqLNngnQoPq4ibYpA5UxTPxukloNv6BlFFQysl6c.jpg?auto=webp&amp;s=b580421a26821546c3d35b254a2abc554b8b0e5d"
        },
        "permalink": "/r/movies/comments/1k6wpmp/hunger_games_sunrise_on_the_reaping_movie_at/"
    }
]