[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 53,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 17,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1r0r8wn",
        "author": "twomilliontwo",
        "title": "Lincoln Lawyer",
        "content": "Netflix, you cannot make enough episodes of this show. This is my favorite show on streaming currently. Whether you have read the books or not, the show does not disappoint the viewer. We’ve got a little 90s vibe with a pacing and a current vibe with the casting. And I just can’t say enough about my favorite Netflix show. \n\nGive us more seasons! Maybe longer seasons how about a longer season and you could take the episodes down a couple of minutes, but give us 20 episodes!\n\nThank you in advance. \n\n ",
        "upvotes": 84,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1r0r8wn/lincoln_lawyer/"
    },
    {
        "id": "1r0o11y",
        "author": "Little_SmallBlackDog",
        "title": "Catherine O'Hara fan?",
        "content": "Check out 'Best in Show'. It's a funny mockumentary about Dog Show people that is oddly accurate. \n\nIt's dry satire so it may not be everyone's cup of tea. ",
        "upvotes": 88,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1r0o11y/catherine_ohara_fan/"
    },
    {
        "id": "1r0u0oo",
        "author": "messengers1",
        "title": "Kelly Hu Joins Eric Bana-Led Netflix Series ‘Untamed’",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r0u0oo/kelly_hu_joins_eric_banaled_netflix_series_untamed/"
    },
    {
        "id": "1r0gvuq",
        "author": "Hot-Signature2387",
        "title": "Emily in Paris",
        "content": "\nTbh, the show started really well. I loved the characters and the storyline during the first few seasons. Then it completely lost the plot. The characters lost their personalities and became very poorly written.\n\nNow the entire show just revolves around  dumb ahh characters making the worst decisions imaginable. None of them can keep it in their pants. They bang, regret it, get back together, break up again, then immediately start dating someone new. Rinse and repeat.\n\nAnd don’t even get me started on the way they run this marketing firm. It's crazyy. All they do is make reckless decisions, ignore basic logic and somehow every campaign is a massive success anyway. No planning, no strategy, no consequences. Just Emily \"girlbossing\" her way through it. I know it’s all fictional, but come on 😭 a little bit of logic would be nice. ",
        "upvotes": 31,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1r0gvuq/emily_in_paris/"
    },
    {
        "id": "1r06beg",
        "author": "Almjdh",
        "title": "Take-Two hails Netflix as Red Dead Redemption nears 10 million installs on mobile.",
        "content": "According to Sensor Tower via The Game Business, Red Dead Redemption has been downloaded over 10 million times on mobile since launch. Almost all of that number is from the Netflix-supported version.",
        "upvotes": 53,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1r06beg/taketwo_hails_netflix_as_red_dead_redemption/"
    },
    {
        "id": "1r0n6j4",
        "author": "Elyx_117",
        "title": "Mercy For None is a great watch",
        "content": "Finished it in two sittings over the weekend and am now rewatching again. The Korean original adds to the loooooooong list of revenge action thrillers coming out of the country on both big screen and small. This one again ticks all the right boxes - a very strong cast with solid acting across the board, excellent fight scenes, and a predictable but well told underworld tragedy. \n\nThe genre is an acquired taste - caution: all adult male cast, blood-splattering violence, zero humor - but if you're a fan, this one is very much worth your time. Only seven episodes anyway. I hope there's a prequel tho.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r0n6j4/mercy_for_none_is_a_great_watch/"
    },
    {
        "id": "1r0ggwx",
        "author": "TheDylorean",
        "title": "Samuel, a brief review",
        "content": "One could say \"it's easy to make a show with a 'sketch' animation approach\". Another could say \"It's been done\". Perhaps both views can be correct, but it is safe to say the medium has found its intended audience in 'Samuel', a light hearted, and uniquely rich journey through the eyes of a young boy who uses sketch animation to bring life to the various stories which compromise his diary. \n\nSamuel demonstrates a micro series type of storytelling, making short entries in a diary each a distinct episode, while tying them together through the common themes of growing up, falling in love, and socializing as a preteen. \n\nThe messages of each story are often as relatable as they are personal, rich with flaws of life as a child growing up at the turn of the century. The additional wrinkle of 'Samuel' taking place in the early 00's makes it as much a fresh experience for younger audiences, as it is a look back for older ones. \n\n'Samuel' may perform well as its own one season micro series, or it may continue to grow as the titular character does. In either case, such a vibrant, heartfelt experience told in such a succinct way is a welcome addition to the world of 'coming of age' media. It is a beautiful story that will leave one not only looking back, but looking forward.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r0ggwx/samuel_a_brief_review/"
    },
    {
        "id": "1r0p3zf",
        "author": "FoldMajestic3324",
        "title": "Subtitles: Is it worth submitting error reports to Netflix?",
        "content": "I'm watching \"The Closer\" and finding that the English subtitles are riddled with errors, way worse than any other show I've seen. It's mainly typos, where it looks like a bad copy-paste from the previous screen, with extra characters attached to the end of words, though occasionally they get words wrong.\n\nI started to hit the flag button to report errors every time I found one, but I found that I'm submitting multiple reports per episode.\n\nDoes anybody here know if someone at Netflix actually reads these reports and makes corrections to subtitles? If so, it's worth my time to keep doing it. But if they're just being ignored or going into the void and won't result in a better viewing experience for others, I'll just ignore all the errors and not bother reporting them.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r0p3zf/subtitles_is_it_worth_submitting_error_reports_to/"
    },
    {
        "id": "1r09ea1",
        "author": "Krunkledunker",
        "title": "Sandokan! Sandokan!",
        "content": "This might be a hot take, but Sandokan was awesome. I can see it receiving a lot of hate from viewers who anticipate something other than what it is, but taken with a grain of salt it’s pure fun.\n\nIt’s vibe seems to draw from Bollywood and American 80’s action, telenovela-like drama, and at parts seems to show some sense of self awareness. There is some good acting and actors that carry the story, as well as some not very good acting and actors that actually (whether intentionally or not) keep it light and silly, but I didn’t actually see that as a turnoff.\n\nIf I expected Black Sails I’d probably hate it, but my wife and I found ourselves bingeing it and laughing with it (and sometimes at it which was just as enjoyable). The story wasn’t deep but kept us watching all the same, would definitely watch a second season.\n\nDid anyone else get into it?",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1r09ea1/sandokan_sandokan/"
    },
    {
        "id": "1r0m2ol",
        "author": "lilcee504-",
        "title": "Vikings",
        "content": "Can anyone tell me why the show Vikings is missing huge chunks of the show out of the episodes on Netflix? It will jump from one scene to the next without any context making it look like it was not only poorly written but poorly filmed. I watched this show from start to finish when it was made and decided to go back and re-watch it, but it's all effed up. Huge pieces are missing. Going from one episode to the next. It makes no sense and is a travesty considering the importance of this show. What the hell are they doing? ",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1r0m2ol/vikings/"
    },
    {
        "id": "1r0fvtg",
        "author": "KangarooOwn1910",
        "title": "Question about Run Away",
        "content": "I just finished Run Away 2026 and I have a question that really bugs me.\n\nWhy did Paige take a DNA test? I see no reason why a person who knows her family and doesn't have any suspicion about her roots would randomly take a DNA test. What did I miss?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1r0fvtg/question_about_run_away/"
    },
    {
        "id": "1r0s7m7",
        "author": "Past_Armadillo_6378",
        "title": "Pitching to Netflix",
        "content": "hello!\n\nSo I wrote a book of about 200 pages,  and then started to write a script.  After months working with a great mentor TV screenwriter and producer,  we finally agree it's in great shape to start pitching.  I of course am trying to find a manager,  I have a few friends that lived the script, in the industry trying to help me and put me on contact with great productions company and else, but I would like for it to be a Netflix original as it will be relatable worldwide. \n\nI know they don't accept pitch from someone like me,  but what should I focus on. \n\nI emailed a few showrunner that I lived their job,  as well as few producers.  but do you have other advices ? \n\nthank you!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r0s7m7/pitching_to_netflix/"
    },
    {
        "id": "1qzv1ag",
        "author": "No_Pop7296",
        "title": "[DISCUSSION] Unfamiliar— German Spy show. It’s really good, hooks you from the start 👍👍",
        "content": "I was looking for something similar to Slow Horses after finishing that and came across this. Considering I’m also watching S2 of Dark it seems I’m destined to watch German content…\n\nIch sollte Deutsch lernen…. ",
        "upvotes": 21,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1qzv1ag/discussion_unfamiliar_german_spy_show_its_really/"
    },
    {
        "id": "1r02ell",
        "author": "Plenty-Swing-9061",
        "title": "The Return of an Icon: What’s New About The Adventures of Cliff Booth",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r02ell/the_return_of_an_icon_whats_new_about_the/"
    },
    {
        "id": "1r00jzs",
        "author": "meravigl",
        "title": "Ho amato Love Through a Prism",
        "content": "I loved the anime Prism of Love.\n\nIt reminds me of my great love for painting and how much I never want to stop doing it.\n\nIt made me cry, laugh, and think.\n\nHave you seen it?\n\nWhat do you think?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r00jzs/ho_amato_love_through_a_prism/"
    },
    {
        "id": "1qze36m",
        "author": "Lucariusssss96",
        "title": "What do you think of Sense 8? Is it good?",
        "content": "Hello!! I’m looking for some series to watch on Netflix. I wanna start watching Sense 8 but I just wanna know your opinions about the show. Is it worth watching? Thank you so much!! :) ",
        "upvotes": 40,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1qze36m/what_do_you_think_of_sense_8_is_it_good/"
    },
    {
        "id": "1r08ign",
        "author": "OMG_Abaddon",
        "title": "How to know where password breach came from?",
        "content": "Yesterday, I got an email with 2FA code to log in a new device, even though I never logged in anywhere, so I immediately went to the website manually and changed my password. When I checked the login history, there were no new entries, so it looks like nothing was logged.\n\nThat's absurd, I want to know it, it's not the same if some chinese hobo tried to steal my account than if the login location is near me (e.g. someone's trying to pull a prank like changing my avatar/name or add weird stuff to my watchlist).\n\nFortunately, 2FA is in place, but I want to know where that last login location is. Can someone please help figure it out?\n\nThanks in advance.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1r08ign/how_to_know_where_password_breach_came_from/"
    },
    {
        "id": "1r0897h",
        "author": "Pleasant-Branch1453",
        "title": "Why are most anime not in netflix anymore??",
        "content": "Like most of anime are gone in netflix, like i was just watching frieren. then tommrow, they just disappeared on netflix. I have frieren downloaded on my phone and im able to watch it as it is. but i just cant seem to find it on netflix, and other big hit anime like bleach. is this a region problem? pls help",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1r0897h/why_are_most_anime_not_in_netflix_anymore/"
    },
    {
        "id": "1qzwpx7",
        "author": "NewMistake2586",
        "title": "Helpp, borders turn black and white",
        "content": "The borders flicker black and white when I put it on full screen, I don't know why it's like this. The chrome browser netflix is fine, but the downloaded app flickers.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qzwpx7/helpp_borders_turn_black_and_white/"
    },
    {
        "id": "1r022l4",
        "author": "littleblackmango",
        "title": "Suggest some movies or series",
        "content": "Please don't suggest me series like breaking bad , Dexter , better call Saul \n\nI like series like vampire diaries, stranger things , dark , harry potter etc , I think you guys get it what's my type ",
        "upvotes": 1,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1r022l4/suggest_some_movies_or_series/"
    },
    {
        "id": "1r05zao",
        "author": "DeputyDawe",
        "title": "The Good Doctor",
        "content": "I’m currently making my way through the Good Doctor and really enjoying it but I notice that only 5 out of the 7 seasons are available and am wondering does anyone know if Netflix has any plans for the remaining seasons?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1r05zao/the_good_doctor/"
    },
    {
        "id": "1r00ssz",
        "author": "ComradeBirdbrain",
        "title": "Netflix Premium not streaming in 4K?",
        "content": "As title. It seems Netflix Premium isn’t streaming in 4K but HD (sometimes with HDR). I have 500Mbps down directly through the Apple TV 4K, I got one 4K title to play 4K for the last 5-mins but otherwise it’s HD everywhere.\n\nIs there anyway to overcome this as it feels wrong to pay for a service and get less-than the stated streaming quality.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1r00ssz/netflix_premium_not_streaming_in_4k/"
    },
    {
        "id": "1qyt3on",
        "author": "the_al_coco",
        "title": "Secret Mall Apartment on Netflix... genius art project or peak privilege?",
        "content": "I just finished Secret Mall Apartment and I honestly don't know where I stand on it. The story is a total 2000s fever dream. It’s about eight artists building a hidden 750sq-ft flat inside a Rhode Island mall and living there for years. The lo-fi footage they captured back in 2003 is incredible, but the doc raises some massive questions that I haven't stopped thinking about.\n\nOn one hand, you have Michael Townsend and his crew, who frame this as a \"living art\" protest against corporate gentrification. You can’t help but be impressed by the pure audacity it took to smuggle cinder blocks and furniture past security for four years. For the \"art is life\" crowd, it’s an inspiring story about reclaiming space from billionaires.\n\nOn the other hand, the film itself acknowledges a huge elephant in the room: white privilege. The artists admit they likely only got away with this because of how they looked, and some of the \"magical\" reenactments (like using a diverse cast of actors for a mostly white project) feel like they're trying to rebrand a very specific, privileged experience into something more universal. It also touches on the heavy personal cost, showing how Townsend’s singular obsession with the project eventually led to the end of his marriage.\n\nI’m curious to see what everyone else thinks!!\n\nIs this a brilliant act of resistance that proves art can happen anywhere?\n\nOr is it just a case study in how \"mischief\" is only called \"art\" when the people doing it have a certain level of privilege?",
        "upvotes": 345,
        "comments": 108,
        "media": null,
        "permalink": "/r/netflix/comments/1qyt3on/secret_mall_apartment_on_netflix_genius_art/"
    },
    {
        "id": "1r00dds",
        "author": "Beginning-Bag7603",
        "title": "The Residence: My 3 main unanswered questions",
        "content": "\\- Mrs. Cox heard a thump and went to check. A thump from what? \n\n\\- Why did Kylie Minogue find blood in the Lincoln bedroom before A.B was killed? \n\n\\- Why was Hollinger seen coming down the stairs from A.B.'s office if it was Lilly in there arguing with him? This is about the scene the young mechanic hid and saw him follow.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1r00dds/the_residence_my_3_main_unanswered_questions/"
    },
    {
        "id": "1r04abr",
        "author": "a36akshay",
        "title": "Doubt About Stranger Things",
        "content": "I always wondered  about it while watching especially from third season. Do they got overboard after season 2? If you look at the first season, it was a small scale show that revolve around a small town. But then it took a 360 turn. So I'm curious, do they always intended this way or it got out of hand after season 1? Spill the tea",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1r04abr/doubt_about_stranger_things/"
    },
    {
        "id": "1qzc59x",
        "author": "fishfearme420",
        "title": "Suggest apocalypse movies or shows",
        "content": "Doesn’t have to be full end of world but like nuclear war etc\n\nThere was a Netflix movie I loved, can’t remember the name, about a surprise nuclear attack on the US, came out recently\n\nAnymore stuff like this? Thank you",
        "upvotes": 12,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1qzc59x/suggest_apocalypse_movies_or_shows/"
    },
    {
        "id": "1qz63an",
        "author": "DuxxieDings",
        "title": "anyone else like adult cartoons, arcane, wolf king and blue eye samurai?",
        "content": "any other fans of adult animation arcane, wolf king and blue eye samurai?\n\ni dont see alot of people talking about blue eye samurai or wolf king, i have met a few arcane fans but not many. \n\njust wondering if theres other adults who enjoy animation for adults? ",
        "upvotes": 19,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1qz63an/anyone_else_like_adult_cartoons_arcane_wolf_king/"
    },
    {
        "id": "1qziang",
        "author": "Fluid-Expression-271",
        "title": "Shows like Finding Her Edge?",
        "content": "I'm looking for a show/movie with the same kind of romance plot, \"forced proximity\" as in pair dancing with the Braydiana chemistry\n\nI LOVED their chemistry and the whole \"be around each other every waking second for work\" idea is so interesting but I just can't find anything similar.\nI've already watched Spinning Out so I'm not sure what to do now😭 I'm also very unhappy with the whole Adriana love triangle ending so I need to find something else to make up for that\n\nAny recs?",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qziang/shows_like_finding_her_edge/"
    }
]