[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 503,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 20,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jw6j2p",
        "author": "Longjumping_Land_977",
        "title": "All the creepy Google searches found on Long Island killer suspect Rex Heuermann’s computer",
        "content": "",
        "upvotes": 183,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1jw6j2p/all_the_creepy_google_searches_found_on_long/"
    },
    {
        "id": "1jwiod1",
        "author": "a-dollar-in-my-jeans",
        "title": "Here’s What I’ve Watched So Far. What Should I Watch Next?",
        "content": "I just wrapped up Queen of the South and now I’m in that random phase where I don’t know what else to watch. But this time, I’m really stumped. Here are the shows that I can remember off the top of my head that I’ve watched (and finished) so far in alphabetical order:\n\n1. Bojack Horseman\n2. Brooklyn 99\n3. Designated Survivor\n4. Disjointed\n5. Godless\n6. Good Girls\n7. Grey’s Anatomy\n8. Maid\n9. Manifest\n10. Midnight Gospel\n11. Money Heist\n12. New Amsterdam\n13. Orange is the New Black\n14. Paradise PD\n15. Queen of the South\n16. Rookie Blue\n17. Space Force\n18. Superstore\n19. The Blacklist\n20. The Night Agent\n21. The Resident\n22. The Residence\n23. Wanted\n24. Wentworth\n25. Zero Day\n\nI’ve watched a few movies here and there but I’m more of a tv show guy because with shows I don’t have to worry about watching something else after two hours or so - tv shows are like an extra long movie.\n\nIf anyone has watched any of these shows and is a fan of other shows, please let me know!! I’m absolutely dying for something new to watch!!!",
        "upvotes": 9,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jwiod1/heres_what_ive_watched_so_far_what_should_i_watch/"
    },
    {
        "id": "1jwk4u9",
        "author": "Free-Combination5627",
        "title": "*Cheating Exposed* Million Dollar Secret",
        "content": "Cara and Sam made a deal off camera to split the money from the beginning. If you rewatch the show with that in mind everything makes sense.\n\nThey tell each other when they are the millionaire off camera. They have to fool the producers and the audience too “the ultimate lie” to pull it off, so they sell it as best they can.\n\nWhen Sam is the millionaire, despite obvious clues pointing to her, Cara keeps coming up with reasons to go for someone else.\n\nSam gets away with her Justin Timberlake agenda by using it with Cara, how does she not realize when she hears her do it a second time at the table? Cause she’s on her side, she only has to worry about Jaymie catching on.\n\nSam’s go to “fake lying face” when she’s the millionaire was a wide open mouth, she uses it when the person they voted for has no money in the box at the elimination dinner. \n\nWhen Cara is the millionaire she tells sam off camera. They masterfully break up the guys alliance and start voting them out.\n\nSam tells Cara off camera the clue about the millionaire was 2 sisters. Later, on camera she asks and Cara knows to lie.\n\nCara has the guts to sabotage her laser challenge with Sydney because she has the assurance that sam will not vote for her no matter what and that sam can probably sway corey. Only reason she takes that “risk”. If corey moves to vote Cara out, sam would just deadlock it. Both Cara and sam view Sydney as their biggest threat and corey easy manipulated.\n\nWhen Sydney opens her box, fake big open mouth from sam.\n\nAt the end when Cara wins, Sam is kind of weirdly excited and not that upset. After seeing Cara cry due to winning and corey cry due to losing, Sam figures she needs to cry to to sell it and no tears actually come out cause they are fake crocodile tears.\n\nWatch the show again there are more tells not listed here but it’s plain as day. Cheaters Cara and Sam need to be exposed! \n\n\n",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jwk4u9/cheating_exposed_million_dollar_secret/"
    },
    {
        "id": "1jvui64",
        "author": "ConceptAble4425",
        "title": "Really disturbed after watching Kidfluencing and the entire Piper story",
        "content": "Okay so first of all, whatever Piper and these other kids went through is really horrible and vile and disgusting. No child should ever go through that and be exposed to such sexual content at such an young age. Specially all the SA allegations.\n\nWhat Tiffany is doing is wrong and how is she getting away with all this?? Why didn’t these parents file a criminal complaint against her if she SA’d your child? \n\nThese parents who filed the lawsuit settled as soon as they got the money. Throughout the series them and the kids keep on saying they are worried for Piper and they wanna save her but, they stopped the fight when a settlement came. Shouldn’t they have continued the case till Tiffany was held accountable by the court? Like why would you wanna make money of this too? \n\nFor anyone’s child who had being SA’d, the better thing would be to see the person who did this face justice rather than take money and forget it. I’m baffled by it. \n\nWhy can’t the law enforcement look into this and investigate all these claims and get the people responsible for this accountable? ",
        "upvotes": 152,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1jvui64/really_disturbed_after_watching_kidfluencing_and/"
    },
    {
        "id": "1jw06em",
        "author": "intelerks",
        "title": "Brad Pitt’s Plan B might return with season 2 of hit Netflix drama ‘Adolescence’",
        "content": "After shaking viewers to their core, Adolescence may be coming back for a second round. Brad Pitt’s production company, Plan B, is reportedly in early talks with director Philip Barantini and the creative team to explore where the story could go next.\n\n",
        "upvotes": 53,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1jw06em/brad_pitts_plan_b_might_return_with_season_2_of/"
    },
    {
        "id": "1jwjfva",
        "author": "Subhash94",
        "title": "Black Mirror Season 7 Review : A Masterclass in Tech Dystopia and Self-Reflection",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jwjfva/black_mirror_season_7_review_a_masterclass_in/"
    },
    {
        "id": "1jwh1ng",
        "author": "Chilis1",
        "title": "Why do Netflix (and other streamers) block you from watching via airplay?",
        "content": "I usually watch via laptop connected to a TV, if I airplay netflix it comes up as a black screen even though I can hear it. But with HDMI there's no issue. I can't see any logic at all in this and it's incredibly frustrating.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jwh1ng/why_do_netflix_and_other_streamers_block_you_from/"
    },
    {
        "id": "1jvvl5i",
        "author": "Sweaty-Toe-6211",
        "title": "Netflix’s Hit Sci-Fi Series '3 Body Problem' to Film Seasons 2 &amp; 3 Back-To-Back",
        "content": "",
        "upvotes": 69,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1jvvl5i/netflixs_hit_scifi_series_3_body_problem_to_film/"
    },
    {
        "id": "1jvzcqq",
        "author": "Somethingman_121224",
        "title": "'Devil May Cry' Renewed for Second Season at Netflix",
        "content": "",
        "upvotes": 33,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jvzcqq/devil_may_cry_renewed_for_second_season_at_netflix/"
    },
    {
        "id": "1jw9tdf",
        "author": "takeanapwme",
        "title": "Black mirror ep. 1",
        "content": "Is it just me, or did anyone else find the ads hilarious? They made me laugh so much because the way she talks is so realistic lol I don’t know how she was able to film those scenes without laughing",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jw9tdf/black_mirror_ep_1/"
    },
    {
        "id": "1jw85uk",
        "author": "Plane-Cloud-5837",
        "title": "Interesting from Rashida Jones on Black Mirror episode one: \"So I bet it’ll be debated whether or not she actually had the agency to make that decision and how much of it was her\"",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jw85uk/interesting_from_rashida_jones_on_black_mirror/"
    },
    {
        "id": "1jw18ub",
        "author": "GrueneWiese",
        "title": "Netflix only advertises one thing to me: the game Cozy Grove ... and it's slowly driving me crazy",
        "content": "I have a very strange problem. For several months now, Netflix has been advertising the game “Cozy Grove” as the big teaser on the mainpage. It's not really a problem, but it's the only one I see. Netflix doesn't suggest any series, movies or anything else that might interest me via the big banner, but only Cozy Grove. And it's gradually starting to annoy me.\n\nI've already logged in and out, deleted cookies and website data on my computer ... but it remains.\n\n",
        "upvotes": 18,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jw18ub/netflix_only_advertises_one_thing_to_me_the_game/"
    },
    {
        "id": "1jvve0w",
        "author": "Pogrebnik",
        "title": "‘Black Mirror’ Season 7 Reviews Are Out, Critics Call It the Best in Years",
        "content": "",
        "upvotes": 33,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jvve0w/black_mirror_season_7_reviews_are_out_critics/"
    },
    {
        "id": "1jwhykr",
        "author": "krunamey",
        "title": "I really like John Mulaney’s new show but…",
        "content": "It desperately needs like 20-30 extra minutes. So many good ideas get ended prematurely because it feels so rushed. I thought these bubbles skits were really funny. \n\nNot like it’s a money problem for Netflix, I can’t imagine why they’d handicap such a good idea. Plus the musics been really good! \n\nLastly there wasn’t a lot of energy with Richard Kind’s Gene Simmons impression and John. I feel like it was mostly on John not being able to do a good “yes? And…” what do you guys think? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jwhykr/i_really_like_john_mulaneys_new_show_but/"
    },
    {
        "id": "1jwglar",
        "author": "LaughWaha",
        "title": "Unpopular Opinion: I Didn't Like \"Don't Look Up\"",
        "content": "I’ve seen mostly positive takes about this movie here, so I was curious—did anyone else ***not*** enjoy it? Personally, I didn’t like it much. It gave me post-Infinity War Avengers vibes—trying to juggle being super funny and deeply serious all at once. Maybe I’m just a bit burnt out on that kind of tone.\n\nI was also surprised by how many A-list actors were in it. At first, that was actually what drew me in, but in the end, it didn’t really work for me. It felt like the star power overshadowed the story. Leonardo DiCaprio’s role in particular threw me off—it didn’t feel like a natural fit compared to his past performances. The “hot scientist” angle also felt a bit forced. Not to say he wasn’t handsome in his prime, but the way it was played up didn’t really land for me. Maybe it wouldn’t have bothered me as much if he weren’t such a big name—it kind of made the whole thing feel like it was trying too hard to flatter him.\n\nPlease be nice, I am just sharing my thoughts about the movie.\n\nEdit: And the satire? It just felt way too on-the-nose. Instead of being sharp or subtle, it came across as preachy and heavy-handed. I get what the movie was trying to say, but it felt like it didn’t trust the audience to connect the dots. That really took me out of it—and honestly, I ended up really disliking it because of that.",
        "upvotes": 2,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1jwglar/unpopular_opinion_i_didnt_like_dont_look_up/"
    },
    {
        "id": "1jw41kf",
        "author": "indiewire",
        "title": "Emma Corrin, Jack Lowden, and Olivia Colman to Star in Netflix’s ‘Pride and Prejudice’",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jw41kf/emma_corrin_jack_lowden_and_olivia_colman_to_star/"
    },
    {
        "id": "1jvgcsa",
        "author": "Ester_LoverGirl",
        "title": "Who watched the Kidfluencing documentary ??",
        "content": "This doc was so good but so horrible too.\n\nHow is that girl still doing videos, as if nothing happened ?????????\n\nWe need to protect children at all cost.\n\n\nThis was so sad to watch.",
        "upvotes": 183,
        "comments": 161,
        "media": null,
        "permalink": "/r/netflix/comments/1jvgcsa/who_watched_the_kidfluencing_documentary/"
    },
    {
        "id": "1jw3i9z",
        "author": "bshaw21",
        "title": "How does Netflix Household work on Mobile devices?",
        "content": "How can you log into netflix on any network that isn’t your “household” network?\n\nFor example, on my phone either on a different network OR on my mobile data I get the household pop up. Is it even possible to watch netflix on a mobile device outside of your house anymore?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jw3i9z/how_does_netflix_household_work_on_mobile_devices/"
    },
    {
        "id": "1jwfhbi",
        "author": "Such_Poppycock",
        "title": "Million Dollar Secret- Lydia / Connie",
        "content": "Lydia from Million Dollar Secret IS Connie from Young Sheldon. A retired Texas woman who gambles?! C’mon, that’s her! They also have similar features. The Connie character might as well have been based on Lydia 😆 What do you think? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jwfhbi/million_dollar_secret_lydia_connie/"
    },
    {
        "id": "1jw9cma",
        "author": "WhyAmIHereExactlyHM",
        "title": "Can't access 'more episodes' on xbox netflix?",
        "content": "When I click on 'more episodes', I get an error message. For context, I can watch an episode of something as long as it's the one on 'play episode' or 'resume episode'. Everything else on my console also works fine. I've already turned my console off and on again, signed out and back in, turned my console off at the wall and left it for about an half an hour, and uninstalled and reinstalled netflix. Any ideas are helpful.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jw9cma/cant_access_more_episodes_on_xbox_netflix/"
    },
    {
        "id": "1jw8fqt",
        "author": "OctaviaCordoba206",
        "title": "Best Atmos/Vision content? (April 2025)",
        "content": "Looking to see what content there is available on the top tier service, so I can test out my Dolby Atmos and Vision setup.\n\nI see the tag on several of the films and shows but never know if it's actually making full use of Vision and/or Atmos? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jw8fqt/best_atmosvision_content_april_2025/"
    },
    {
        "id": "1jw2iji",
        "author": "Somethingman_121224",
        "title": "Emma Corrin, Jack Lowden, Olivia Colman to Star in Netflix's 'Pride and Prejudice'",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jw2iji/emma_corrin_jack_lowden_olivia_colman_to_star_in/"
    },
    {
        "id": "1jv9157",
        "author": "Interesting_Fan_3096",
        "title": "Million Dollar Secret Winner",
        "content": "This is one of the best reality game shows in Netflix. I was hooked from the beginning.\n\nThere were plenty of times I wanted to scream at the contestants, “why don’t you tell them this…” to convince them you’re not the millionaire, but they end up getting emotional, defensive and raising voices. I learnt that getting defensive like your “life” is on the line can be a truth / honestly signal instead of a signal for deceit. It happened every time in the game (eg Chris, Jaimi) \n\nFor example, Jaimi was twice a suspect. One for voting Lydia and telling the truth. (Sam and Sydnee lied so they wouldn’t be targets) No one believed Jaimi. To me, if I was the millionaire (or not), I would lie about voting Lydia because it instantly puts a target on my back because that was the clue. Jaimi admitted to voting Lydia. So it was obvious she was telling the truth! If you were worried of being caught, you would lie.\n\nStill, no one believed Jaimi. When they found out from the clue that she wasn’t the millionaire, Jaimi could have used that as proof to the group for the next time they suspect her.\n\nAgain, when she was the suspected millionaire, everyone thought it’s her because she told Sam to having two sisters (clue) and everyone refused to believe that another person would conceal it or lie about it. They would always target truth tellers (eg Jaimi or Corey in this case) When Jaimi was in the chopping block, again, she just screamed and cried to defend herself which we already know does not change people’s minds.She could have used the last time she was suspected as proof that she was telling the truth (eg Last time you didnt believe me, and you found out I was telling the truth. This is a game of deception, someone is lying. Anyone who has been honest has been an easy target and has been pinned as the millionaire)\n\n Next, I feel terribly bad for Corey in a way. I don’t think he would ever be able to trust anyone after this show. Lol but in a way, he was naive and his intuition was off throughout the show. He always suspected easy targets instead of thinking deeper (if I was the millionaire, how would I act?) this was missing from him throughout so in a way he was easily manipulated by Cara.\n\nFinally, I feel conflicted about Cara winning because she wasn’t that exciting to watch. But by the end of episode 6, I had a feeling she would win or at least play big in the finale. Why? Because she flew under the radar, everyone trusted her, and she actively kept information about herself hidden. She chose not to share. Her intuition was correct almost all of the time too (Sam was asking info about her sisters because she knew she had the clue, Corey and Sam would vote Sydnee out, Sydnee had immunity, Corey took her box etc) She played the game so very well because of her intuition but I so wanted the winners to either be Sydnee or Sam. They just actively played the game and revealed just enough, but because they were threats that put them in everyone’s radars to be voted off either way! \n\nSam was correct most of time but her emotions got in the way in which she trusted Cara. She kept saying she didn’t have it in her to think Cara would even ever be the millionaire because she wouldn’t let herself go there - that Cara is capable of deceit. This was Sam’s downfall and toxic trait lol Had she kept people at bay and not let her emotions cloud her I believe she would have won. Corey was the same but Corey was off throughout lol \n\nI wonder how they are and what they think about how they were all duped as Sydnee would put it.\n\n\n",
        "upvotes": 145,
        "comments": 414,
        "media": null,
        "permalink": "/r/netflix/comments/1jv9157/million_dollar_secret_winner/"
    },
    {
        "id": "1jvvdni",
        "author": "Alan_Stamm",
        "title": "'Black Mirror' Season 7 Review: Tech Drama Has Maudlin Lows and Grisly Highs [Variety]",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jvvdni/black_mirror_season_7_review_tech_drama_has/"
    },
    {
        "id": "1jwdq4d",
        "author": "Affectionate_Yam4221",
        "title": "10 Shows To Watch if You Love ‘Adolescence’",
        "content": "When I watched the show, I first thought of Defending Jacob.\n\nWhat about you guys?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jwdq4d/10_shows_to_watch_if_you_love_adolescence/"
    },
    {
        "id": "1jw8leh",
        "author": "ZoeDeMeul",
        "title": "issue with sound",
        "content": "Hello,\n\nI recently bought a set of speakers (2.0) that i would like to connect to my smart tv via optical cable.   \nEverything works but there is a significant difference in sound quality between netflix and spotify or youtube. I cannot select a 5.1 audio option in the settings, but i suspect i might still not be getting 2.0 audio. Is this possible? Can i somehow change the audio settings?\n\nThank you very much",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jw8leh/issue_with_sound/"
    },
    {
        "id": "1jv4s11",
        "author": "Alan_Stamm",
        "title": "'Bad Influence: The Dark Side of Kidfluencing' review – nothing about this shocking tale feels OK",
        "content": "",
        "upvotes": 165,
        "comments": 165,
        "media": null,
        "permalink": "/r/netflix/comments/1jv4s11/bad_influence_the_dark_side_of_kidfluencing/"
    },
    {
        "id": "1jvss3k",
        "author": "Atlast_2091",
        "title": "Resident Playbook | Official Clip | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jvss3k/resident_playbook_official_clip_netflix/"
    },
    {
        "id": "1jvq1hu",
        "author": "nomnomsquirrel",
        "title": "Collider:  ’The Old Guard 2’ Director Teases Explosive Action and a Time Jump for the Sequel",
        "content": "I have been following what little news there has been about the sequel since it was (mostly) filmed in summer 2022, but I admit, the only clues I've seen about a time jump is different hairstyles. Still excited! The Old Guard is one of my fave Netflix originals.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jvq1hu/collider_the_old_guard_2_director_teases/"
    },
    {
        "id": "1jw70q1",
        "author": "Aggressive-Willow-54",
        "title": "Adolescence",
        "content": "Does anyone know if Adolescence will be a continuing series with a different story line each time? I would love to see what they come up with. Haunting!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jw70q1/adolescence/"
    }
]