[
    {
        "id": "1j0tp5q",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1j0tp5q/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1j0tp69",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1j0tp69/la_piola_friends_meetup/"
    },
    {
        "id": "1jdy61c",
        "author": "Odd_Afternoon6508",
        "title": "I had the best time in Turin!",
        "content": "Last week I stayed in Turin for 5 days and it was so much fun and it was one of the best trips of my life! I’ve travelled a lot in Europe but this was the best one. \n\nThe people are very friendly, lots of people asked me where I am from, cause I don’t look local, had a lot of chitchat, people helped me with directions, the food was amazing. I also met a girl from Politechnic of Torino, who was teaching a class in english I believe, and I think I fell in love, I still think about her sometimes haha. It was a surreal experience :)",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jdy61c/i_had_the_best_time_in_turin/"
    },
    {
        "id": "1je0r9h",
        "author": "__simson_",
        "title": "Dai non siamo messi così male",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/22oia4hn9goe1.jpeg?auto=webp&amp;s=96268f0f0f23ece3a9b116fe27a49ed6f88b5591"
        },
        "permalink": "/r/torino/comments/1je0r9h/dai_non_siamo_messi_così_male/"
    },
    {
        "id": "1jdqkf6",
        "author": "Mission_Cancel1042",
        "title": "Corsia riservata su Corso Sommeiller: per me un'ottima idea. Per voi?",
        "content": "Premessa: cerco commenti ragionati, quindi prima di sparare scemenze siete pregati di leggere e riflettere. L'idea è quella di dare uno spunto di riflessione e di capire anche punti di vista differenti dal mio, quindi argomentate, come proverò a fare io qua sotto, e cercate di mantenere una discussione civile.\n\n\n\nIn questi giorni si è discusso parecchio della nuova corsia riservata su Corso Sommeiller, che secondo molti avrebbe dovuto paralizzare il traffico di mezza città. In questo casino si è inserita La Stampa con articoli del tutto avversi all'opera, **come aveva fatto col progetto Rete '82**, contribuendo al suo abbandono e lasciando il trasporto pubblico torinese è nelle condizioni in cui è...\n\nIo ho cercato di raccogliere qualche informazione in più ed ho scoperto che l'ultimo tratto del cavalcavia era riservato ai mezzi pubblici fin dal 2014 (fonte: street view). Ovviamente prima che mettessero la telecamera non la rispettava nessuno, adesso invece sono partite le proteste. A questo punto la corsia riservata è stata estesa a tutto il corso, e sembra il finimondo a giudicare dagli articoli di giornale e dai commenti sui vari social.  \nDunque ho ragionato: la capacità \"generale\" di una strada è determinata dal punto in cui la capacità \"localizzata\" è minore, quindi rispetto a prima dove c'erano due corsie su tutto il cavalcavia ed una sola in uscita non cambia nulla. Si è però eliminato l'imbuto, che costringeva a rallentare chi era già sulla corsia giusta, fluidificando il traffico. Se ne evince che la capacità non solo non è diminuita, ma probabilmente addirittura aumentata di poco.\n\nAlla luce di ciò, mi pare di intuire che le lamentele non siano tanto riferite alla corsia riservata in sé, ma al fatto di doverla rispettare, dato che la telecamera controllerà, oppure all'affidarsi a ciò che dicono gli altri senza riflettere. Trovo a favore di questa tesi le testimonianze di conoscenti che tra ieri e oggi sono passati all'ora di punta: mi hanno detto di una situazione di traffico, ma non così disperata da bloccare San Salvario, come prevedeva qualcuno.\n\nTra le contro-argomentazioni più diffuse si trova chi dice che il tram passa poco di frequente, per cui la corsia riservata sarebbe inutile. A questi vorrei dire che il 16, all'ora di punta, dovrebbe passare ogni 9 minuti. Passaggi che adesso saranno più regolari, avendo eliminato uno dei punti in cui si perdeva più tempo. Inoltre non ci si può lamentare di come i trasporti pubblici facciano pena se poi ci si oppone a qualsiasi tentativo di migliorarli. Inoltre bisogna ricordare che la corsia riservata è utilizzabile anche dai mezzi di soccorso (e dai taxi?).\n\nDetto ciò, pensavo a quali potrebbero delle possibili soluzioni per aumentare la capacità del cavalcavia, e ho individuato due interventi che a mio parere, da esterno al settore, potrebbero aver senso:\n\n* Aggiungere una corsia per la svolta a destra in Via Sacchi alla fine del cavalcavia, allargandolo nella zona vuota al confine col dopolavoro ferroviario. Potrebbe richiede espropri e di sicuro bisognerebbe mettere mano a parte dell'incrocio.\n* Spostare la sede tranviaria su Corso Sommeiller al centro della carreggiata almeno fino all'incrocio con Corso Re Umberto, dove c'è più spazio per far passare il tram sul lato della carreggiata. Ciò sposterebbe l'interferenza tra tram e auto che fanno dritte ad un incrocio con più spazio per far fluire il traffico che prosegue dritto col tram. Potrebbe anche essere un'occasione per mettere mano ad uno dei tratti di strada più brutti della città ([idea fatta la volo, coi parcheggi e marciapiedi ristretto per la corsia per girare in corrispondenza degli incroci e fermate del tram in corrispondenza delle alberate](https://streetmix.net/-/2902550)). Ancora meglio se si spostassero i binari al centro fino a Piazza Sabotino, dove ci sarebbe tutto lo spazio per architettare una soluzione adatta.\n\nQuesto è quanto, sono curioso di sentire i vostri punti di vista e eventuali idee per risolvere la questione, possibilmente senza rimuovere la corsia riservata!  \nScusate per il Wall of text, notte!",
        "upvotes": 12,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1yZlewq1qVR-f2HCrYslmHqgAT98qjRfdbIXQBKFfBA.jpg?auto=webp&amp;s=3b2655b089b8aeba11de59db8e34f1859e5b8b2c"
        },
        "permalink": "/r/torino/comments/1jdqkf6/corsia_riservata_su_corso_sommeiller_per_me/"
    },
    {
        "id": "1je07pj",
        "author": "Meac0",
        "title": "Consigli negozi vestiti uomo per ufficio e/o casual.",
        "content": "Ciao a tutti! Sto cercando un negozio (o più di uno) a Torino dove poter trovare vestiti da uomo belli e di buona qualità, senza dover vendere un rene per un pezzo di plastica con un logo sopra. Qualcuno ha consigli su posti dove si possa fare shopping senza rimorsi economici? Grazie in anticipo!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1je07pj/consigli_negozi_vestiti_uomo_per_ufficio_eo_casual/"
    },
    {
        "id": "1je0uz7",
        "author": "CiboToday",
        "title": "In Piemonte i fratelli 20enni che inventano salumi in un’antica azienda agricola",
        "content": "Federico e Gabriele Noè sono la quarta generazione di **Cascina Savoiarda**. Un’azienda partita col bisnonno a inizio Novecento **a Pralormo**, dove allevano suini a partire da cereali autoprodotti, recuperano ricette di antichi salumi e ne creano di nuove  \n(LINK NEI COMMENTI)\n\nhttps://preview.redd.it/rnkw4ffo0fpe1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=8a7ba39df525d6bc344d682fbf0458728b7c44fd\n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1je0uz7/in_piemonte_i_fratelli_20enni_che_inventano/"
    },
    {
        "id": "1jdzuzj",
        "author": "ConsistentLook8198",
        "title": "Parchi per allenarsi",
        "content": "Ciao! Ci sono parchi attrezzati a Torino possibilmente raggiungibili con la metro o in 15 minuti in bici da porta Susa? \nMi accontento di poco, un paio di sbarre e dei blocchi per fare step e squat bulgari\n",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1jdzuzj/parchi_per_allenarsi/"
    },
    {
        "id": "1jdoq1t",
        "author": "RevolutionaryLog3631",
        "title": "Perchè la Benzina costa molto meno subito dopo l'aeroporto di Caselle?",
        "content": "Intendo ai 2 distributori vicini al McDonald di San Maurizio Q8 e Economy.\n\n  \nOggi 1,64 la SP mentre altrove minimo 1.75!",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1jdoq1t/perchè_la_benzina_costa_molto_meno_subito_dopo/"
    },
    {
        "id": "1jdl0ce",
        "author": "Outrageous_Corgi6611",
        "title": "Vivere al piano terra a Torino",
        "content": "Ciao a tutti, in questo periodo sono alla ricerca di un appartamento in affitto a Torino, e dei tre che ho visitato finora uno in particolare mi è piaciuto molto: spazioso, ben arredato, in un'ottima posizione per me e a un prezzo bene o male abbordabile.\n\nUnico contro: è al piano terra, con porta **non blindata** che dà direttamente sulla strada (fortunatamente una laterale non troppo trafficata). Nell'appartamento ci sono anche altre finestre, che però danno su una corte interna quindi non mi preoccupano.\n\nSecondo voi, com'è in termini di sicurezza vivere al piano terra in una città come Torino? Vedete criticità (sia in termini di sicurezza che altro) o mi sto facendo pare inutili? La zona sarebbe tra Cit Turin e Quadrilatero, quindi (penso) abbastanza sicura in generale.\n\nGrazie in anticipo per le vostre risposte!",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1jdl0ce/vivere_al_piano_terra_a_torino/"
    },
    {
        "id": "1jdowor",
        "author": "dkroods",
        "title": "Come controllare quando ci saranno scioperi!🚇🚍",
        "content": "Ciao tutti!  \nQuando usate [**Take It Easy TO**](https://play.google.com/store/apps/details?id=com.takeiteasy.torino.app&amp;pcampaignid=web_share), fate attenzione al **cerchio blu pulsante** nell’app! Se lo vedete, significa che è previsto uno sciopero che potrebbe influenzare i trasporti.\n\n[Take It Easy TO](https://preview.redd.it/kywgk6yembpe1.png?width=438&amp;format=png&amp;auto=webp&amp;s=e6226f522e0552e3cd0f2491acd2c10d37c7329e)\n\nControllate i dettagli e organizzatevi in anticipo per evitare disagi! 🚇🚍\n\n**Il team di Take It Easy TO** 🚀",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nnQwOdFPDhG66upzOUX8tpygSBrrCbAym8Jn9SOS4gI.jpg?auto=webp&amp;s=44e52737a24a4ce0d5f7adb7f20f5ea1e5f986e6"
        },
        "permalink": "/r/torino/comments/1jdowor/come_controllare_quando_ci_saranno_scioperi/"
    },
    {
        "id": "1jdfdke",
        "author": "Due-Nothing5875",
        "title": "Cerco giocatori di Magic Modern a Torino",
        "content": "Ciao a tutti/e, sono relativamente nuovo nel mondo di Magic,  ho finito da poco di costruirmi il mio primo mazzo per modern e  sto cercando players che vogliano giocare for fun, o che conoscano posti dove si gioca questo formato, per farmi un po' le ossa prima di provare a fare qualche torneino.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jdfdke/cerco_giocatori_di_magic_modern_a_torino/"
    },
    {
        "id": "1jdos9r",
        "author": "Ok-Path6614",
        "title": "Qualcuno abita a Barriera di Milano e sa com'è?",
        "content": "Penso di affittare un appartamento lì perché costa meno, in via Arrigo Boito. È un posto sicuro o è pericoloso?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jdos9r/qualcuno_abita_a_barriera_di_milano_e_sa_comè/"
    },
    {
        "id": "1jdo16t",
        "author": "strawberryfairy97",
        "title": "Gelato veg alla vaniglia??",
        "content": "Cerco disperatamente una gelateria a Torino che faccia  gelato vegano gusto vaniglia che non sia la gelateria Messina (l'ho provato e non sa di niente sinc)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jdo16t/gelato_veg_alla_vaniglia/"
    },
    {
        "id": "1jdos5x",
        "author": "dkroods",
        "title": "Come controllare se ci stanno scioperi!🚇🚍",
        "content": "Ciao tutti!  \n  \nQuando usate **Take It Easy TO**, fate attenzione al **cerchio blu pulsante** nell’app! Se lo vedete, significa che è previsto uno sciopero che potrebbe influenzare i trasporti.\n\n[Take It Easy TO](https://preview.redd.it/0dm4vncglbpe1.png?width=438&amp;format=png&amp;auto=webp&amp;s=b5681da11847c3ddcd782f7a3701f1ca6171c2ab)\n\nControllate i dettagli e organizzatevi in anticipo per evitare disagi! 🚇🚍✈\n\n**Il team di Take It Easy TO** 🚀",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jdos5x/come_controllare_se_ci_stanno_scioperi/"
    },
    {
        "id": "1jcoe24",
        "author": "rafasofizadeh",
        "title": "Biblioteca Dietrich Bonhoeffer, Torino",
        "content": "",
        "upvotes": 121,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uq263bef82pe1.png?auto=webp&amp;s=fc8adc4b0be15a2ad7fe3fc4dd405a8b54da7906"
        },
        "permalink": "/r/torino/comments/1jcoe24/biblioteca_dietrich_bonhoeffer_torino/"
    },
    {
        "id": "1jdachf",
        "author": "Enea2",
        "title": "Come si trova lavoro per studenti a torino?",
        "content": "Se fossi uno studente che cerca un lavoro part time - weekend, dove dovrei cercare? L'esperienza mi dice che i siti come indeed e infojobs sono piuttosto inutili e forse è meglio accordarsi tra privati, ma dove li trovo?",
        "upvotes": 2,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1jdachf/come_si_trova_lavoro_per_studenti_a_torino/"
    },
    {
        "id": "1jdcp6l",
        "author": "Plenty_Echo_8937",
        "title": "Where to get the criminal background record?",
        "content": "Hello, I need my criminal background record for a job but I have no idea how this works here. I hold a permesso di soggiorno. Can this be requested online? Thank you!",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1jdcp6l/where_to_get_the_criminal_background_record/"
    },
    {
        "id": "1jda7yt",
        "author": "Ana_1113",
        "title": "Thrift stores in Torino",
        "content": "Heey what are the best thrift stores in Torino for cute clothes for girls &lt;3",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jda7yt/thrift_stores_in_torino/"
    },
    {
        "id": "1jdch7k",
        "author": "No-Bit-2036",
        "title": "Ripropongo la domanda ai torinesi",
        "content": "",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1jdch7k/ripropongo_la_domanda_ai_torinesi/"
    },
    {
        "id": "1jcmk5d",
        "author": "NomeUtenteNome",
        "title": "Gruppo di lettura",
        "content": "Ciao a tutti, volevo sapere se esistesse un gruppo (o più) di lettura qua a Torino \n\nMi sono trasferito da poco, ma vedendo la quantità di librerie e libri in giro per la città mi farebbe strano non ci fosse \n",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1jcmk5d/gruppo_di_lettura/"
    },
    {
        "id": "1jcvij2",
        "author": "RedCassa",
        "title": "Dove provare le Bose QuietComfort Ultra a Torino?",
        "content": "Ciao a tutti!\nSto valutando l’acquisto delle Bose QuietComfort Ultra e prima di comprarle mi piacerebbe provarle di persona, per farmi un’idea del comfort e della qualità audio.\nSapete consigliarmi qualche negozio a Torino (possibilmente zona centro o facilmente raggiungibile) dove sia possibile provarle?\nHo già dato un’occhiata online sui vari Mediaworld e altri negozi di elettronica di consumo, ma non è nemmeno chiaro se hanno disponibilità.\nGrazie in anticipo a chi risponderà!",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1jcvij2/dove_provare_le_bose_quietcomfort_ultra_a_torino/"
    },
    {
        "id": "1jcqsjz",
        "author": "CristianPiovano",
        "title": "Musica nei pub a Torino per San Patrizio",
        "content": "Ciao a tutti! Sapete di qualche evento interessante nei pub domani (lunedì 17) per San Patrizio? Tipo musica dal vivo, magari jam session a cui ci si può aggiungere? Ad esempio ricordo un S. Patrizio in cui la pub suonavano i 2 Fat Men.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jcqsjz/musica_nei_pub_a_torino_per_san_patrizio/"
    },
    {
        "id": "1jch2ou",
        "author": "gwhiz97",
        "title": "Best pizza in Turin",
        "content": "We have one day in Turin today after skiing in Aosta before flying back home - want to get a great pizza today there, where’s the best place to go?\n\nNothing too flashy, proper down to earth place would be great!\n\nAny other Turin tips please shout!",
        "upvotes": 5,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1jch2ou/best_pizza_in_turin/"
    },
    {
        "id": "1jcj75k",
        "author": "Capable_Armadillo727",
        "title": "Vivere attorno a Torino nel verde?",
        "content": "Ciao, mi sono trasferita qualche anno fa dalla campagna Umbra a Torino per motivi famigliari, ma ora che il figlio ha finito le scuole, vorrei rispostarmi verso il verde.   \nCerco consigli su paesi con facile accesso a Torino, ma nel contempo che sono paesi abbastanza vivaci. Andrei a viverci da sola con i pelosi, quindi cerco con, oltre i servizi di prima necessità, anche un minimo di attività (corsi di yoga, teatro etc) per non essere del tutto isolata.   \nAvete qualche consiglio da darmi per iniziare la ricerca? Grazie",
        "upvotes": 3,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1jcj75k/vivere_attorno_a_torino_nel_verde/"
    },
    {
        "id": "1jc2u19",
        "author": "mandrake_55",
        "title": "Consigli Bracierie a Torino?",
        "content": "Mi consigliate delle bracierie a TO e zone limitrofe con un buon rapporto qualità prezzo?\nNon cerco un locale fighetto, ma della buona carne a prezzi onesti",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1jc2u19/consigli_bracierie_a_torino/"
    },
    {
        "id": "1jbwijt",
        "author": "_L_-",
        "title": "Corsi di Teatro a Torino :)",
        "content": "Ciao, conoscete dei corsi di teatro a Torino che consigliereste come hobby? \n\nMagari qualche corso che faccia una prima lezione gratuita",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jbwijt/corsi_di_teatro_a_torino/"
    },
    {
        "id": "1jbtcad",
        "author": "Anxious-Sloth7919",
        "title": "Bbq",
        "content": "Ciao, dove posso trovare posti barbecue gratuiti nei parchi vicino al centro città?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1jbtcad/bbq/"
    },
    {
        "id": "1jbx6cf",
        "author": "Repulsive-Yak-126",
        "title": "Sushi buffet",
        "content": "Cia tutti,  do u know a good sushi buffets here in Torino. And their rules, because in some of them u can only order 7 dishes and etc.\nThank you in advance!",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1jbx6cf/sushi_buffet/"
    },
    {
        "id": "1jbrr6r",
        "author": "Eilex-",
        "title": "Sfm",
        "content": "Buongiorno a tutti, tutta questa settimana sarò a Torino, precisamente a Carmagnola, vorrei raggiungere la città tramite i treni sfm4/7, sul sito Trenitalia c’è scritto che nelle ore di punta ci sono dei treni di rafforzamento, ma consultando l’orario non ho trovato nulla, potreste aiutarmi? Grazie e buona giornata ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1jbrr6r/sfm/"
    },
    {
        "id": "1jbue6l",
        "author": "New-Frosting-3636",
        "title": "Comprare casa a Torino",
        "content": "Ciao a tutti, guardando su i vari siti di annunci immobiliari noto un certo mismatch tra i prezzi degli affitti e quelli per l'acquisto (in parole povere: rata del mutuo a 10/15 anni inferiore o simile all'affitto per un un appartamento equivalente). Qualcuno ha qualche insight a riguardo?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1jbue6l/comprare_casa_a_torino/"
    },
    {
        "id": "1jbrgd0",
        "author": "Intelligent-Deal-759",
        "title": "Partita di calcetto domenica 18-19",
        "content": "Ciao ragazzi vorreste giocare a calcetto 18-19 zona aurora? \nMancano 2, per favore famo sconto 50%",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1jbrgd0/partita_di_calcetto_domenica_1819/"
    }
]