[
    {
        "id": "1if0swi",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1if0swi/la_piola_friends_meetup/"
    },
    {
        "id": "1if0swb",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1if0swb/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1ipjovs",
        "author": "DirectInteraction825",
        "title": "Mi hanno fregato…",
        "content": "Ciao a tutti, \n\nRiporto di seguito uno scam che ho subìto e che probabilmente se me lo rifacessero mi fregherebbero di nuovo. \n\n2 settimane fa ho trovato una casa che mi piaceva su un sito online abbastanza comune per cercare case. Si trattava in particolare di un bilocale da 60m2 che si affacciava su Corso Francia a 550€ + utenze. Viste le spese generali di Torino, mi sembrava abbastanza in linea e contatto il numero di telefono la mattina successiva, riuscendo a strappargli un appuntamento la sera stessa dopo aver insistito. \n\nDopo la visita la casa mi piace talmente tanto che nonostante un po’ di rumore dovuto al fatto che si affacciasse su Corso Francia, decido di ricontattare il numero, dal momento che è pure un privato e che non avrei dovuto pagare l’intermediazione. \n\nCi parlo al telefono per circa mezz’ora e gli spiego che ho un contratto a tempo indeterminato e che sarei disposto ad affittare la casa alle stesse condizioni esposte poco prima durante la visita. Il ragazzo, sulla 30ina, lo stesso che mi ha presentato la casa, mi spiega molto gentilmente che fa parte di uno studio di Torino (esistente, perché ho controllato subito su internet) di amministratori condominiali che gestiscono gli affitti per i proprietari. Mi dice dunque di inviargli i documenti che la mattina seguente avrebbe proposto la casa al proprietario e mi avrebbe fatto sapere. \n\nIl giorno dopo arriva la conferma: il proprietario mi accetta! Mi viene girato un contratto di 8 pagine (classico contratto), con indirizzi e nomi DEL PROPRIETARIO (non del ragazzo con cui parlavo), e mi dice che per bloccare la casa avrei dovuto versare la cauzione entro 24h. Pago la cauzione di 1650€ e pochi giorni dopo mi invia la ricevuta dell’agenzia delle entrate, e mi chiede di pagare, quando avrei voluto ma prima del 10 febbraio, la prima mensilità. \n\nPagata la mensilità il tizio sparisce, e risulta irreperibile. La consegna delle chiavi sarebbe dovuta avvenire domani. Il telefono risulta spento e i messaggi su whatsapp non vengono consegnati. Premetto che non so chi sia il proprietario indicato sul contratto ma proverò comunque ad andare all’indirizzo di Torino che ha indicato sul contratto, e di non sapere neanche come questo abbia avuto le chiavi della casa. Ho fatto ricerche e tutte le referenze che mi aveva dato (e.g. studio di amministratori condominiali) esistono veramente, ma probabilmente ha aperto un conto corrente con carta di identità falsa e il proprietario non esiste. Mi rimane solo l’indirizzo della casa, che io conosco e che ho visitato. \n\nAndrò a fare denuncia nei prossimi giorni senza troppe speranze. Il bello è che ho pure rifiutato altre 5/6 fregature da quando sono arrivato a Torino (1 mese fa), ed é la prima volta che cerco casa in italia. Negli ultimi 2 anni ho cercato e trovato case senza problemi in germania, brasile, olanda e cina, senza mai cadere in una singola fregatura. \n\nQualche allarme che “a posteriori” mi avrebbe potuto far capire che era una fregatura: \n1) Sarei dovuto andare a controllare fisicamente in questo studio, oppure chiamare. Vedendolo esistere non mi sono fatto domande. \n2) Quando mi è arrivata la (falsa) registrazione all’agenzia delle entrate il codice fiscale non corrispondeva a quello indicato sul sito che mi aveva detto lui. \n3) L’accettazione da parte del proprietario é avvenuta alle 10 di mattina (troppo presto?) e tutto il processo in 2 giorni si era praticamente chiuso.\n\nNon insultatemi che sono già abbastanza distrutto psicologicamente. Sono uno stupido? Probabilmente si, ma questa fregatura è stata fatta davvero bene. ",
        "upvotes": 67,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1ipjovs/mi_hanno_fregato/"
    },
    {
        "id": "1ipqzk3",
        "author": "Babele_20",
        "title": "Parrucchiere",
        "content": "Ciao, sto cercando un parrucchiere per un taglio scalato, quasi mullet fatto per bene, ma comunque a prezzi da studente. Qualche consiglio su dove andare?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ipqzk3/parrucchiere/"
    },
    {
        "id": "1ip6yec",
        "author": "sunurban_trn",
        "title": "Scusate il livello basso: avete un cavo USB-SATA da prestare?",
        "content": "Ciao a tutti, il titolo dice tutto. Devo usarlo UNA sola volta e comprarlo sarebbe uno spreco. \n\nGrazie!",
        "upvotes": 8,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1ip6yec/scusate_il_livello_basso_avete_un_cavo_usbsata_da/"
    },
    {
        "id": "1ipc5rz",
        "author": "tortex06",
        "title": "How can i find other musicians?",
        "content": "Hello everyone! I am an international student in Turin, and I also play guitar (not so well tbh). I would really like to find other musicians with whom I can jam/play covers with. Preferably english speaking, of course \n\nDo you have any ideas?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ipc5rz/how_can_i_find_other_musicians/"
    },
    {
        "id": "1ipb673",
        "author": "carodiario24",
        "title": "Acquisto prima casa, consigli",
        "content": "Ciao! F31, lavoro a tempo determinato con risparmi. \nA quale agenzie/piattaforme vi siete affidati per acquistare la vostra prima casa?\nQuali sono zone tranquille dove poter vivere? \nA quanto ammontano le spese del notaio? \nCome si capisce che l'immobile non è in cattivo stato e che non ci sono \"tranelli\" legali o danni strutturali? \nDa che budget si parte per pensare di poter acquistare?\n\nGrazie infinite in anticipo \n\n\n\n",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1ipb673/acquisto_prima_casa_consigli/"
    },
    {
        "id": "1ip7u4s",
        "author": "Coccorocco1",
        "title": "Cerco chi stampa 3d",
        "content": "Ciao a tutti, sto cercando qualcuno a cui commissionare una stampa 3d di ottima qualità ad un buon prezzo. Possibilmente stampa a resina. Vorrei poi dipingerla io. Grazie a tutti",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ip7u4s/cerco_chi_stampa_3d/"
    },
    {
        "id": "1ip6e1j",
        "author": "_L_-",
        "title": "Cercasi Barbiere zona Mauriziano",
        "content": "Andavo da un barbiere distante e che voleva prenotazioni, ora vorrei cambiare. \n\n\nCerco barbiere zona Mauriziano:\n- prezzo onesto (15-20)\n- sa fare anche tagli medio/lunghi\n- non ha bisogno di prenotazione \n- punti bonus se non chiude alle 18 dato che lavoro \n\n\nVa bene anche non proprio in zona ma raggiungibile velocemente coi mezzi. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ip6e1j/cercasi_barbiere_zona_mauriziano/"
    },
    {
        "id": "1iod1kt",
        "author": "No_Astronomer4604",
        "title": "Ma che problemi avete alla guida?",
        "content": "Stamattina ero seduto in macchina perché arrivato un po’ prima e stavo aspettando. Un tizio ha iniziato a suonare il clacson, tirato giù il finestrino e gridato ‘MA VAFFANCULO!!!’\n\nL’altro giorno mi si è spenta la macchina al semaforo e per fortuna avevo le porte chiuse, perché quello dietro è sceso e ha cercato di aprire per fare non so che.. si è limitato a tirare un pugno sulla porta.\n\nHo vissuto e guidato in molte altre città e la gente con i neuroni così fumati non l’ho mai incontrata!!",
        "upvotes": 120,
        "comments": 66,
        "media": null,
        "permalink": "/r/torino/comments/1iod1kt/ma_che_problemi_avete_alla_guida/"
    },
    {
        "id": "1iop0or",
        "author": "WestSuspicious115",
        "title": "Acquisto di frutta bio a Torino",
        "content": "Ciao a tutti,\n\nsono appena arrivato a Torino e mi chiedevo dove posso trovare frutta (soprattutto bacche) coltivata senza pesticidi. Qualcuno conosce dei posti come i mercati contadini?\n\nApprezzerei molto i vostri consigli, grazie mille.",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1iop0or/acquisto_di_frutta_bio_a_torino/"
    },
    {
        "id": "1iokdld",
        "author": "Any_Salary8922",
        "title": "Spazi di lavoro remoto in centro",
        "content": "Sono in full smart e a volte mi annoio a stare tutto il giorno a casa.\nPotete consigliarmi qualche bar/coworking/libreria in centro/quadrilatero dove lavorare?",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1iokdld/spazi_di_lavoro_remoto_in_centro/"
    },
    {
        "id": "1iofgov",
        "author": "carodiario24",
        "title": "Gente con la quale allenarsi",
        "content": "Ciao!\nF31\nC'è qualcuno che potrebbe essere interessato a fare sport all aperto dopo il lavoro?\nCaratteristiche ideali:\n- alla mano, semplice \n- approccio mentale sano ed equilibrato \n- passione per il fitness\n\nSe ti interessa, scrivi! ",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1iofgov/gente_con_la_quale_allenarsi/"
    },
    {
        "id": "1iop6pw",
        "author": "Ramanujando",
        "title": "Parcheggiare vicino Inalpi Arena",
        "content": "Ciao Torinesi e non, domenica devo venire in auto a Torino per la final eight di Basket all' Inalpi Arena.\n\nMi conviene prenotare un (costosissimo) parcheggio, oppure in zona si riesce a parcheggiare?\n\nAiuto!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1iop6pw/parcheggiare_vicino_inalpi_arena/"
    },
    {
        "id": "1iohdur",
        "author": "Scared-Anybody-273",
        "title": "Local Taste Of Torino",
        "content": "Hello Italian friends. My first ever visit in Torino will be tomorrow for the weekend. I have been lucky to get tickets  for Juve-Inter and to make this weekend top notch i simply need to add some amazing dishes and drinks during the stay.\n\nI really like local flavours. I always go for the small authentic places whether in Denmark, Morocco or Asia - anywhere. So i listed some thing down already. Is it a go or no go? Anything better? \n\nI appreciate your time and effort! And look forward to discover this magnificent city\n\nLa Taverna Del Bergé - piole\nDa Cianci Piola Caffè - piole\nAntica Bruschetteria Pautasso - Local dishes\nSarchiapone pizzeria Torino - Napolitan Pizza\n\n\nAlso please feel free to mention places even if only for a specific dish. That is what i look for in the essence. Master of their craft\n\nWish you an awesome day!\n\nCiaoo\n",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1iohdur/local_taste_of_torino/"
    },
    {
        "id": "1iooedh",
        "author": "ForeverAloneJack",
        "title": "Visione di serie TV e anime in compagnia",
        "content": "Un saluto a tutti, sono un grande consumatore di serie TV e anime in lingua originale ma sfortunatamente non conosco nessun altro con questa mia passione. Per caso conoscete qualche circolo o locale dove la gente si possa riunire per guardare gli episodi e magari discuterne? Qualcosa di simile ai club del libro americani per intenderci, purtroppo faccio molta fatica a conoscere persone che condividano i miei interessi \"nerd\" (sono anche un videogiocatore) e sono abbastanza stufo di ritrovarmi in compagnia senza però avere argomenti di discussione dato che non mi interesso di sport, politica, gossip, motori, etc.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1iooedh/visione_di_serie_tv_e_anime_in_compagnia/"
    },
    {
        "id": "1iogjlk",
        "author": "ivlia-x",
        "title": "Smarrita tessera GTT",
        "content": "Non credo che qualcuno me la restituisca ma ci provo lo stesso 🙃 \n \nOggi mattina (tra le 7:30 e le 8:00) ho perso la mia tessera GTT. Sono scesa dal tram 10 alla fermata Questura a poi sono andata a piedi fino a Palazzo Nuovo. Ho appena rifatto tutto il percorso nella speranza di trovarla ma apparentemente qualcuno l’aveva già presa\n\nSe qualcuno l’abbia trovata, fatemi sapere per favore. Non so dove cercare, se esiste qualche gruppo su Facebook o qualcosa del genere eh sono triste e disperata\n\nIl primo nome sulla tessera è Julia ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1iogjlk/smarrita_tessera_gtt/"
    },
    {
        "id": "1iok08d",
        "author": "electrolitebuzz",
        "title": "opzioni skipass a Monginevro",
        "content": "Ciao, non riesco a mettermi in contatto con gli impianti di Monginevro. Volevo sapere se oltre allo skipass normale giornaliero che costa sui 55€ ci sono altre opzioni acquistabili in cassa che non si vedono online. Andrò con un amico che è molto principiante e di solito altri impianti offrono biglietti a ore oppure a risalita proprio per chi sta imparando o vuole provare. Ma online non trovo nessun'altra opzione. Grazie!",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1iok08d/opzioni_skipass_a_monginevro/"
    },
    {
        "id": "1iog62n",
        "author": "CorvoPazzo02",
        "title": "Festa",
        "content": "Salve a tutti per caso sapete bei locali da affittare per feste ?(es. Compleanni, lauree ecc)   ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1iog62n/festa/"
    },
    {
        "id": "1ioig6n",
        "author": "Fidel_Castrato_",
        "title": "Negozi di bandiere",
        "content": "Ciao a tutti.\nÈ già da un po' di tempo che sarei interessato ad acquistare delle bandiere (possibilmente storiche) per poter arredare la mia camera.\nQualcuno mi saprebbe per caso consigliare un'attività a Torino in cui poterle comprare?\nGrazie in anticipo.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ioig6n/negozi_di_bandiere/"
    },
    {
        "id": "1io05nv",
        "author": "ihaveonebraincell",
        "title": "Bar tranquilli con una buona selezione di tè?",
        "content": "Sono abbastanza nuova a Torino e sto disperatamente cercando un posto tranquillo (senza musica possibilmente) dove posso bere del tè buono e magari leggere un libro.\n\nTutti i posti in cui sono andata fino ad ora o avevano la musica invadente oppure tanta gente che faceva casino.. Quindi vorrei trovare un posto in cui la \"norma\" è la tranquillità e la pace dei sensi hahaha\n\nGrazie a chiunque mi possa aiutare ❤️",
        "upvotes": 20,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1io05nv/bar_tranquilli_con_una_buona_selezione_di_tè/"
    },
    {
        "id": "1ior3mm",
        "author": "strangeaslove",
        "title": "Aiutate un'amica",
        "content": "Ciao r/torino, il mio contatto mi ha dato buca all'ultimo, qualcuno che riesce a darmi una mano per stasera? Se possibile in val susa sarebbe ancora meglio ma arrivo a Torino \n\nAiutare un'amica 🙏🌿🍃",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ior3mm/aiutate_unamica/"
    },
    {
        "id": "1inyr63",
        "author": "NamelessNiner",
        "title": "Gruppo Telegram per receptionist d'hotel di San Salvario",
        "content": "Ciao a tutti! Lavoro in un hotel di San Salvario e da un po' ho pensato che sarebbe utile ed interessante creare un gruppo telegram dei receptionist dei diversi hotel del quartiere, per scambiarsi informazioni e avvertimenti su avvenimenti vari e tipi loschi. &gt;!Sì, è anche per gossip o per far sapere se l'uomo birillo è in giro. !&lt;\n\nSe volete essere aggiunti, chiaramente in forma totalmente anonima, mandatemi nei messaggi una foto con un biglietto con il vostro nome utente scritto a mano insieme a parti del desk, chiavi, biglietti da visita o comunque qualcosa che dimostri che siete receptionist.\n\n**Non vi chiederò in quale hotel specifico lavorate, non mi riguarda.**",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1inyr63/gruppo_telegram_per_receptionist_dhotel_di_san/"
    },
    {
        "id": "1inub4h",
        "author": "iammigu",
        "title": "sport buddies?",
        "content": "Ciao, senza dover andar per forza nei locali a bere, come conoscete gente nuova magari facendo sport tipo running, funzionale o simili?",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1inub4h/sport_buddies/"
    },
    {
        "id": "1io108c",
        "author": "FerroFede",
        "title": "Info su Mostra di Giger",
        "content": "Buonasera a tutti, avrei bisogno di un’informazione: sapete per caso quant’è la durata della visita alla mostra di “Beyond Alien H.R. Giger”??\n\nGrazie mille in anticipo ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1io108c/info_su_mostra_di_giger/"
    },
    {
        "id": "1inri3z",
        "author": "angel_flower_0",
        "title": "Gruppo gamer Piemonte",
        "content": "Siete italiani e vivete nello sperduto Piemonte, nel frattempo cercate di accendere un computer o una console con bastoni e pietre e per poter comunicare con altre entità usate i piccioni viaggiatori. Non vi siete stancati di sperare che il piccione non muoia durante il tragitto? Si? BENE!\n\nQuesto è il gruppo perfetto per voi!\n\nIn questo gruppo potrete conoscere direttamente le persone della vostra stessa regione e magari chi lo sa uno di loro sarà il vostro prossimo migliore amico!\n\nChe aspettate? Entrate a divertirvi con noi!\n\nhttps://t.me/Piemontegamersita\n\n(NB: il gruppo è dedicato anche per chi ama gli anime, i cosplay e le convention/cosplay)",
        "upvotes": 3,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gUUYIXrc1G2yzach-DixuOyz50gY5dNq8YTs6TGSL4U.jpg?auto=webp&amp;s=b33d2ae0efab1bb91675740238270b50981cbe03"
        },
        "permalink": "/r/torino/comments/1inri3z/gruppo_gamer_piemonte/"
    },
    {
        "id": "1in8h3o",
        "author": "initial_chris",
        "title": "Dashcam per il pedone",
        "content": "Sono sempre più convinto che a Torino bisognerebbe girare con una dashcam attaccata al collo. Ogni giorno ne vedo di tutti i tipi che BadDriversOfItaly spostati.\n\nStasera non ho mai rischiato così tanto di finire sotto a una macchina. Impegno l'attraversamento mentre in lontananza si avvicina una Mercedes. Quando sono a metà, mi accorgo che la macchina continua ad accelerare e per fortuna ho avuto la lucidità di correre via.\nIl tizio che guidava mi ha visto quando praticamente era a 15 metri da me, ha provato a inchiodare superando di gran lunga le strisce per poi ripartire a razzo, come se gli avessi fatto un torto.\n\nMi viene in mente anche un altro episodio dove un furgone pretende di passare con il rosso e mi suona a me perché stavo attraversando sulle strisce con il semaforo verde.",
        "upvotes": 50,
        "comments": 36,
        "media": null,
        "permalink": "/r/torino/comments/1in8h3o/dashcam_per_il_pedone/"
    },
    {
        "id": "1imz23j",
        "author": "CryingAlwaysCrying",
        "title": "UCI Cinemas: sempre cosi?",
        "content": "Ciao a tutti,\n\nqualcuno sa se UCI Cinemas a Torino offre sempre una qualità così scarsa? Sono andato a vedere *The Brutalist* e l’intero film era completamente fuori fuoco, come se il proiettore fosse mal tarato o difettoso.   \n  \nÈ stata un’esperienza davvero deludente e mi sono sentito completamente mancato di rispetto.   \n  \nAnche a voi è capitato qualcosa del genere? ",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1imz23j/uci_cinemas_sempre_cosi/"
    },
    {
        "id": "1in57qo",
        "author": "tonybob94",
        "title": "Corsi di primo soccorso gratuiti",
        "content": "Ciao a tutti!\n\nSapete se per caso ci sono delle occasioni in cui vengono organizzati corsi di primo soccorso gratuiti in città?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1in57qo/corsi_di_primo_soccorso_gratuiti/"
    },
    {
        "id": "1in4lxt",
        "author": "TheTrampIt",
        "title": "Bloccato nel passaggio a livello",
        "content": "https://www.torinoggi.it/2025/02/11/leggi-notizia/argomenti/nichelino-1/articolo/auto-resta-bloccata-tra-le-sbarre-del-passaggio-a-livello-e-brutto-incidente-in-via-scarrone-traffi.html\n\nLa mia domanda è: ma quant’è la multa?",
        "upvotes": 2,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1TaA9FYoj1OpEygfdOyTFmUpME7UdPfrqbKvLWVxHks.jpg?auto=webp&amp;s=b163a44bbab22b06d1d720832a29f501eede3bec"
        },
        "permalink": "/r/torino/comments/1in4lxt/bloccato_nel_passaggio_a_livello/"
    },
    {
        "id": "1in3fnt",
        "author": "Babele_20",
        "title": "Posti queer a Torino",
        "content": "Ciao a tutti, io sto cercando degli ambienti queer in cui conoscere personcine carine. Non ho trovato né gruppi universitari né associazioni, qualcuno sa se ce ne sono e magari anche dove c’è un bell’ambiente?",
        "upvotes": 1,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1in3fnt/posti_queer_a_torino/"
    },
    {
        "id": "1imab6p",
        "author": "Wonderful_East_5741",
        "title": "unpopular opinion, la gtt fa schifo perchè ci sono TROPPE macchine",
        "content": "okay non è solamente quello il problema ma sicuramente la grande maggioranza d'esso è rappresentata dalla moltitudine di macchine presenti nelle strade torinesi. \n\nbasti pensare ad i tram che non riescon a passare per macchine posteggiate sui binari oppure bus che rimangono bloccati nel traffico. \n\ntorino deve iniziare, a mio avviso, a prendere decisioni forti per quanto riguarda le macchine. è una città super vivibile a piedi.",
        "upvotes": 99,
        "comments": 76,
        "media": null,
        "permalink": "/r/torino/comments/1imab6p/unpopular_opinion_la_gtt_fa_schifo_perchè_ci_sono/"
    }
]