[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 14,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 65,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lj3xi4",
        "author": "Logos1789",
        "title": "PSA About “Leaving Soon” Labels",
        "content": "Depending on the platform you’re watching Netflix on, the “Leaving Soon” labels may not appear on the thumbnail of the show or movie. \n\nInstead, you’ll only see the note about the movie leaving Netflix on X date after selecting the thumbnail to view more info.\n\nI happened to be browsing Netflix on my phone when I noticed that a movie on my list had the “Leaving Soon” label. Upon using my gaming console to pull up the movie, I noticed that the label wasn’t displayed.\n\nIn case this is a one-off mistake, the movie is The Net.",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lj3xi4/psa_about_leaving_soon_labels/"
    },
    {
        "id": "1li6s5y",
        "author": "ispankoldpeople",
        "title": "What is your fave hidden gem on Netflix?",
        "content": "\nLooking for recommendations of what you believe to be the most underrated shows that you have watched on  Netflix/Prime apps. My only hard no is anything dubbed, it’s just way too distracting for my tiny little mind.",
        "upvotes": 392,
        "comments": 485,
        "media": null,
        "permalink": "/r/netflix/comments/1li6s5y/what_is_your_fave_hidden_gem_on_netflix/"
    },
    {
        "id": "1liqhyd",
        "author": "SometimesWitches",
        "title": "The Waterfront",
        "content": "Got through it in a couple days.  It is intriguing enough.   If you compare everything to your favorite family goes bad shows then it ranks somewhere in the middle.    It’s not going to blow anyone away but it has good actors and it is worth it just for Maria Bello who plays the matriarch.   She has come a long way from Coyote Ugly but I have enjoyed her in the last few projects i have seen her in.   The story has a few good twists and I do hope it has a second season.   ",
        "upvotes": 20,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1liqhyd/the_waterfront/"
    },
    {
        "id": "1liphjc",
        "author": "Significant-Skill156",
        "title": "Where's \"coming soon\" gone?",
        "content": "Sorry if this has already been answered but since Netflix changed the OS a few weeks ago, where has \"coming soon\" &amp; \"worth the wait\" gone? I don't understand why they've got rid of it?",
        "upvotes": 16,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1liphjc/wheres_coming_soon_gone/"
    },
    {
        "id": "1lj45mh",
        "author": "behelidt",
        "title": "Sex and the City gone on German Netflix",
        "content": "I had started watching Sex and The City (the original 1998 series) on Netflix about a week ago and yesterday noon it got removed and now it’s nowhere to be found. I know it’s been up since April, but it surely couldn’t have been up for barely three months. I know it got removed by noon, because I was watching up until that point in the morning and suddenly the stream stopped and I roundly play anymore. \nHas anyone experienced the same thing? \n\nI can’t find any information that in would only be up until June and Netflix also didn’t mention anything. Usually it says something like “last chance to watch”",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lj45mh/sex_and_the_city_gone_on_german_netflix/"
    },
    {
        "id": "1lj3h1m",
        "author": "woovrsqt",
        "title": "does anybody know what’s going on/is anyone having similar issues?",
        "content": "The first photo is me trying to sign in on the website and the second is me trying to sign into the app. I know I used the correct password so idk what’s going on. The email address I used is an old one my mother had so sending a code to it would be pointless unless I can dig up some old phone that just so happens to be signed into it. I tried signing in on my tv and it just says I’m using the wrong password, but I’ve used this password any other time signing into the same devices and it’s worked just fine. Any suggestions?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lj3h1m/does_anybody_know_whats_going_onis_anyone_having/"
    },
    {
        "id": "1lj54nu",
        "author": "BoredBam_220",
        "title": "Double Charged.. Venting",
        "content": "My credit card has been compromised twice. \n\nOn April I was charged twice for Netflix Los Gatos SGP and Netflix Singapore SGP. I failed to notice this because I was busy being a phishing victim by Crunchy Roll something. \n\nCome now June 24, as i was going through statements i already noticed Los Gatos because the Ph has new tax so my acct (Singapore) adjusted the price for Netflix. Therefore the second charge (Los Gatos) should be invalidated. \n\nThis is the second time within two months that I changed cards. The Customer Service Rep gaslighting me that maybe i gave out my card numbers (like i was dumb enough for that) i can even cross examine scammers just with their calls. \n\nI just wanted to vent this out. Im so tired. Now i have to cut off my bank because I feel so unsecure with them. I’ll pay the entire amount due and cut them off. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lj54nu/double_charged_venting/"
    },
    {
        "id": "1lj4u2m",
        "author": "S4v1r1enCh0r4k",
        "title": "New Details Emerge About Tarantino-Verse Movie Directed by David Fincher, Netflix Involved?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lj4u2m/new_details_emerge_about_tarantinoverse_movie/"
    },
    {
        "id": "1lixkfb",
        "author": "Rich-Ambassador9683",
        "title": "Recommendation",
        "content": "I am lost on what to watch on netflix .\nThese new shows aren't as much fun \nI liked blacklist, suits,  breaking bad, you, and many more old ones \nI would like a recommendation of something  not new but not too old either .\nBut it should have comedy as well not just thriller \nSomething nice ",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lixkfb/recommendation/"
    },
    {
        "id": "1lix4py",
        "author": "17pounder",
        "title": "Is there any way to watch ATLA (2005) in Polish in Ireland?",
        "content": "Pretty much the title. I’ve changed the language settings to allow for Polish, and I know a dub exists, but I can’t seem to access it. This problem doesn’t occur for most other shows. Does Netflix just not have the rights to the Polish dub?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lix4py/is_there_any_way_to_watch_atla_2005_in_polish_in/"
    },
    {
        "id": "1li2xbf",
        "author": "BarracudaJazzlike730",
        "title": "Forget the critics, Tires is extremely funny",
        "content": "Tires is a great show. Absolutely hilarious. I have no idea why the critics (look at metacritic) gave the show terrible reviews. It's like a mix of the office meets East Bound and Down. Am I alone in thinking this show is awesome? ",
        "upvotes": 230,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1li2xbf/forget_the_critics_tires_is_extremely_funny/"
    },
    {
        "id": "1lifkfh",
        "author": "30HummingbirdLane",
        "title": "Favorite Monologue",
        "content": "What’s your favorite movie/TV monologue scene? \n\nPapa Pope from Scandal probably has some of the most memorable monologues for me. \n\nAdd your favorites. \n\n\n",
        "upvotes": 22,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xdgg82vw9o8f1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lifkfh/favorite_monologue/"
    },
    {
        "id": "1liav4r",
        "author": "kuromisparkles",
        "title": "Suggest me your favorite documentary film!",
        "content": "I’ve been in a documentary mood lately and would love to hear your favorites. I recently watched AM: Laci Peterson documentary.\n\nWhat’s a documentary you really loved or that stuck with you long after watching? Could be about food, true crime, history, art, anything, really. I’m open to all kinds! Thanks.",
        "upvotes": 45,
        "comments": 129,
        "media": null,
        "permalink": "/r/netflix/comments/1liav4r/suggest_me_your_favorite_documentary_film/"
    },
    {
        "id": "1lirn78",
        "author": "Intrepid_Pineapple98",
        "title": "Has anyone watched Merli Sapere Aude?",
        "content": "Just finished the whole show and I cant find a single tiktok edit with more than 1k like Im mad. Season one was soo good, I admit season 2 was worse but like the show is fine why is it so unpopular?\nShare your opinion about the show if you watched it and if not go watch it. (Btw its gay)",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lirn78/has_anyone_watched_merli_sapere_aude/"
    },
    {
        "id": "1lid639",
        "author": "MindFlourish2919",
        "title": "Should I watch Black Mirror?",
        "content": "I like anthology series because of the many stories it can bring. This show looks appealing because it focuses on technology and the flaws that humans have. Should I give it a shot?",
        "upvotes": 19,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1lid639/should_i_watch_black_mirror/"
    },
    {
        "id": "1li5zd2",
        "author": "Tell-Uh-Tubbie",
        "title": "Sirens could be better",
        "content": "My review........it was....OK.  Julianne Moore was great...as expected.  I feel like she's super hot these days....very deserved!.  Milly Alcock...also great! Both held their part of the bargain...great actresses!   The storyline was ...meh if I'm gonna be honest.   The success of this series was really based on the cast...not the story line.  I felt that the real interest was in Meghann Fahy and Felix Solis' characters. Their chemistry was amazing and I wanted to see more! Her and his backstory, ,  how this cult started, who was the first wife, \"hey hey\"? Josh Segarra's character? Like wtf is that about? There is soooo much more to unpack here that is bigger than this storyline! PLEASE MAKE A PREQUEL  or a spinoff with Meghann Fahy and Felix Solis!.  So many questions unanswered!",
        "upvotes": 57,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1li5zd2/sirens_could_be_better/"
    },
    {
        "id": "1lixfc8",
        "author": "TheWasusMiller",
        "title": "WWE Raw",
        "content": "Why is it I'm paying full price for Netflix to not have commercials or ads and WWE Raw has one every five to seven minutes it seems like at this point?",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lixfc8/wwe_raw/"
    },
    {
        "id": "1lih3e2",
        "author": "Gluefactory22",
        "title": "New This Week/Next Week tab",
        "content": "Trying to embrace the new interface…\n\nIn the past I would use the “New Next Week” section to save things to my list to watch when things popped up.  \n\nIs there a place on the new interface where all the upcoming stuff is in available to browse?  I can’t seem to find it. ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lih3e2/new_this_weeknext_week_tab/"
    },
    {
        "id": "1lik13t",
        "author": "Safi42112",
        "title": "The waterfront season 2…",
        "content": "Whilst initially the tone of the show was hard to get into by the third episode I absolutely loved the soapiness and drama of the show. \n\nIt’s doing really well in terms of appearances on the top 10 daily and it’s the number one show in many countries currently on Netflix.\n\nDo you think it will get picked up for a second season.✌️",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lik13t/the_waterfront_season_2/"
    },
    {
        "id": "1lijn8y",
        "author": "JustReading321-",
        "title": "Straw Ending",
        "content": "Omg I just finished watching it and I’m sat here frustrated because this movie had so much potential. I really wish they tied up the ends better because it was all so confusing… like where was her daughter’s body after she carried her out of the hospital since the events take place the very next day? What did the FBI agent mean when he said “make it happen”? Also, if her boss knew her daughter was dead why was he so rude? What about her co-worker who she seemed so close to? Why would her mother leave Janiyah alone when she knew Aria was dead? Was the scene with the racist cop reality or is it all just delusion???\n\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lijn8y/straw_ending/"
    },
    {
        "id": "1li3fww",
        "author": "LectureJaded1233",
        "title": "Is “The Waterfront” worth watching?",
        "content": "Thinking about starting “The Waterfront\" but haven't heard much about it. For those who've seen it, is it worth watching? Any quick thoughts or recommendations are appreciated!\nThanks!",
        "upvotes": 34,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1li3fww/is_the_waterfront_worth_watching/"
    },
    {
        "id": "1lijkxt",
        "author": "Klutzy-Violinist-522",
        "title": "Playback Speed Option?",
        "content": "A while ago, I believe Netflix had playback speed options up to 1.5x on PC. However, I am no longer able to find it.\n\nIs it still available and if so, where can I find it?\n\nhttps://preview.redd.it/hh8ixhse3p8f1.png?width=1921&amp;format=png&amp;auto=webp&amp;s=f41c55c0a5b3239bea357ee66efaec168e50699d\n\n",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lijkxt/playback_speed_option/"
    },
    {
        "id": "1lhqury",
        "author": "Afraid_Orange6762",
        "title": "3 body problem is one of the best sci-fi shows I’ve watched in a while",
        "content": "The show is beautiful. The cinematography, how the plot advances and how the characteristics of each person is introduced to the viewers in a very subtle but definitive way. I love the show and I hope to god that they don’t discontinue. I’ve never posted a review in my life but knowing Netflix and how they’ve cancelled a lot of the shows I was eagerly  waiting for, I just wanted to post my opinion on this subreddit so that even if there was a 0.01% chance that this post could make the show gain some traction I had to do it.",
        "upvotes": 158,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1lhqury/3_body_problem_is_one_of_the_best_scifi_shows_ive/"
    },
    {
        "id": "1lioju7",
        "author": "knowingmeknowingyoua",
        "title": "Does America’s Sweethearts move beyond learning choreography for Thunderstruck?",
        "content": "Trying to decide if I need to remain committed to watching because so far I'm only vicariously experiencing PTSD for Victoria based on how she's treated and how she feels. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lioju7/does_americas_sweethearts_move_beyond_learning/"
    },
    {
        "id": "1lino64",
        "author": "indiewire",
        "title": "Netflix Canceled the Release of a Gore Vidal Biopic Eight Years Ago, but for the Filmmakers, the Story Isn’t Over — An Oral History",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lino64/netflix_canceled_the_release_of_a_gore_vidal/"
    },
    {
        "id": "1limkjo",
        "author": "GoldDerby",
        "title": "'Adolescence' Emmy odds: How many nominations will the show get?",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1limkjo/adolescence_emmy_odds_how_many_nominations_will/"
    },
    {
        "id": "1li4e6c",
        "author": "Fragrant_Peanut_9661",
        "title": "3 Body Problem",
        "content": "To whoever posted earlier about this show, THANK YOU! Based on that post, I decided to give it a rewatch. (I've already watched it once, when it first came out.) And now I remember why I loved it so much. ",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1li4e6c/3_body_problem/"
    },
    {
        "id": "1libpae",
        "author": "Own_Cause523",
        "title": "La Révolution",
        "content": "I ran out of shit to watch that interested me.  Scrolling through I see this show.  I like period shows, I like supernatural / horror theme shows - great mix, let’s give it a go.  \n\nStarted watching with English dub, and had to switch back to native French with subs.  Every dub I watch I can’t stand that the voices are flat and don’t match the atmosphere.  \n\nThe show has a great premise and was decently made, great dark atmosphere with historical context!  How come we can’t get a decent English show like this?  The production was waaay more watchable than say the Prime Wheel of Time show.  \n\nToo bad they cancelled it and we don’t get the climax we all knew was going to happen…. 🫤",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1libpae/la_révolution/"
    },
    {
        "id": "1lis2no",
        "author": "Abhoy47",
        "title": "Account don't exist.",
        "content": "So what happened is I had an account 2 years old when i tried to login it shows me it doesn't exist but I had the account.\nI used my dads account he used like a year ago and it says the email doesn't exist. Can I get my old accounts back.\n\nEdit: did those accounts get deleted? And if those accounts got deleted why they didn't send any email that my account will be deleted",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lis2no/account_dont_exist/"
    },
    {
        "id": "1liidvy",
        "author": "MrShadowKing2020",
        "title": "Define a “unique view”",
        "content": "So one of the main metrics Netflix looks at for success is “unique views” of a film or movie? Does that mean separate accounts watching a film or movie for the first time? Does this mean they don’t care about a film or show getting rewatched?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1liidvy/define_a_unique_view/"
    }
]