[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 508,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 19,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jzolud",
        "author": "Legitimate_Ad3625",
        "title": "'Black Mirror' gaslights viewers by releasing subtly different versions of 'Bête Noire'",
        "content": "",
        "upvotes": 464,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1jzolud/black_mirror_gaslights_viewers_by_releasing/"
    },
    {
        "id": "1k04m8t",
        "author": "DramaticDeaa",
        "title": "Pulse",
        "content": "Man I don’t really know how to talk about this as I doubt others will agree. I just binged the new show Pulse. And I really liked the show but I absolutely HATED Danny. Her character development was dog water. The second to last episode where she pushed the father in the lobby and she’s talking to her sister afterward and they come to the conclusion that ‘he’s [Phillips] the reason I’m going to be fired’ instead of her physically putting her hands on someone where there was witnesses. Her starting the relationship the entire time knowing others would think she slept with her boss to win. She just stayed on that and literally didn’t do anything about it. Waited a year to go to hr to discuss their relationship with them. Then got mad/upset/freaking out at Phillips for getting the attending position when that’s literally what he was trying for the entire time??? I don’t know I just really didn’t like her the entire time I watched this show 😭 \n\nI LOVED Camilla’s and Sophie’s arc though. And I’m also really happy to find something with Justina Machado again.\n\nI hope someone else understands. ",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k04m8t/pulse/"
    },
    {
        "id": "1jzyc8p",
        "author": "Anteater_Able",
        "title": "Netflix Stock Pops After Report Streaming Giant Aims To Double Revenue by 2030",
        "content": "",
        "upvotes": 11,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jzyc8p/netflix_stock_pops_after_report_streaming_giant/"
    },
    {
        "id": "1jzvae2",
        "author": "aresef",
        "title": "Richard Kind plays to the largest audience of his life in 'Everybody's Live'",
        "content": "",
        "upvotes": 15,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jzvae2/richard_kind_plays_to_the_largest_audience_of_his/"
    },
    {
        "id": "1jzjpi6",
        "author": "gobsmacked247",
        "title": "I just finished North of North and I am jonesing for more!!!",
        "content": "I can’t believe how much I enjoyed this series!  The trailer got me hooked and I was not disappointed.  Every ep was awkward, and fun, and beautiful, and warm, and I could not get enough of the people and the town (village?)\n\nSeriously Netflix, don’t muck this one up!",
        "upvotes": 53,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1jzjpi6/i_just_finished_north_of_north_and_i_am_jonesing/"
    },
    {
        "id": "1jzsyza",
        "author": "Alan_Stamm",
        "title": "Explosive Brett Favre Documentary Is Cautionary Tale of Fame [Drops May 20]",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jzsyza/explosive_brett_favre_documentary_is_cautionary/"
    },
    {
        "id": "1k08h0v",
        "author": "CHEFrinsi",
        "title": "Sound mixing ?",
        "content": "Who mixes the sound specifically for Netflix cause this thing goes from the lowest voices to the loudest sound effects… it’s terrible for night watching ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k08h0v/sound_mixing/"
    },
    {
        "id": "1k088ec",
        "author": "Edgelessdiam0nd",
        "title": "Current member not sharing Netflix...",
        "content": "Common why is it when I get on my PS5 that Sony is asking me to add another member to the account?\n\nFor real though the only person that takes this account abroad is me when I travel for work. My mother in law in the same house has her own Netflix our brother in law has his own. My kid and my girlfriend who live in the same house uses our Netflix. Seriously Netflix if I find a extra member charge because of my kid not being able to read and hits x I'm gonna cancel you.... Like my kid hasn't learned to read yet he's young and I have this on his tablet. There shouldn't be a press x to add member option rolling through the PlayStation!!!!!!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k088ec/current_member_not_sharing_netflix/"
    },
    {
        "id": "1k07wnj",
        "author": "Frienchfriesxz",
        "title": "THRILLER RECOMMENDATION",
        "content": "Hi I'm looking for a GOOD movie/series in netflix. Can you recomment me pls. I'm just so bored. \n\nI like Thriller. heist. \n\nI dont like slow burn drama. \n\nBtw I recommend you watch: \n\nG20 - in Pr\\*me movie ahahahha this is the last movie I watched. \n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k07wnj/thriller_recommendation/"
    },
    {
        "id": "1jzodu0",
        "author": "TechnicalCounty690",
        "title": "show recommendations",
        "content": "I need a new show that will have me binge watching for daaays. I really like Bridgerton, Lucifer, Sex Education, Never have I ever, Atypical. Anyone have good recs?",
        "upvotes": 7,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1jzodu0/show_recommendations/"
    },
    {
        "id": "1jyxr1y",
        "author": "Separate_Aide3850",
        "title": "Piper Rockelle’s mom Tiffany Smith slams Netflix Documentary",
        "content": "",
        "upvotes": 387,
        "comments": 145,
        "media": null,
        "permalink": "/r/netflix/comments/1jyxr1y/piper_rockelles_mom_tiffany_smith_slams_netflix/"
    },
    {
        "id": "1jzx9ff",
        "author": "indiewire",
        "title": "Netflix Sets 1975 Screening Series at Egyptian Theatre in Los Angeles",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jzx9ff/netflix_sets_1975_screening_series_at_egyptian/"
    },
    {
        "id": "1k01yss",
        "author": "L_IV3S2025_V2",
        "title": "Has anyone else noticed that the seasons of fomula 1: drive to survive are back to front?",
        "content": "They have put it in the order of s7 - s1 instead of s1 - s7. So if u haven't watched from season 1 then u have got to select select season 1. I don't know if Netflix has done this on purpose or if it's a glitch",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k01yss/has_anyone_else_noticed_that_the_seasons_of/"
    },
    {
        "id": "1jzmngx",
        "author": "KKglobtrotter",
        "title": "I love North of North!!! Best heartfelt comedy I've watched in a long time!",
        "content": "I was intrigued by the trailer and I'm fan of Jay Ryan too, so I gave it a shot and I'm so glad I did. The pilot is funny but a little awkward as it introduces you to the characters and the setting really quickly but then episode per episode you fall in love with it. With the characters, the landscape, the amazing fashion sense of Inuit women, the stories that are unfolding, even the music ...omg I was shazaming everything! Acting is top notch. So natural, something you don't see very often in comedies . I couldn't recommend it more!!!! Eagerly waiting for more seasons!",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jzmngx/i_love_north_of_north_best_heartfelt_comedy_ive/"
    },
    {
        "id": "1jzzinx",
        "author": "unknownguy112",
        "title": "Tier list based on all the series I watched on Netflix (that I can remember)",
        "content": "https://preview.redd.it/3mrc3xogm1ve1.png?width=1140&amp;format=png&amp;auto=webp&amp;s=877e2c577bdd938da84cdeb11205cdb0c64266dc\n\nI was bored so I made a quick tier list on all the shows I watched over the years on Netflix. Might be a bad list idk. If you have any recommendations based on this let me know!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jzzinx/tier_list_based_on_all_the_series_i_watched_on/"
    },
    {
        "id": "1jys3tp",
        "author": "YogurtclosetProud545",
        "title": "Bad influence- Netflix",
        "content": "Just watched Bad Influence on Netflix and I’m sorry, but why is the documentary only pointing fingers at Piper and her mom, Tiffany? Don’t get me wrong—Tiffany was absolutely manipulative and toxic. But let’s be real… every single parent on that show knew exactly what was going on. They knew their kids were filming with her. They saw the content. They heard the complaints. But the views and money were looking too good, so they played along. Now suddenly everyone’s shocked and acting like they were completely blindsided? I get that the kids were young and didn’t deserve the trauma, but let’s not pretend the parents weren’t part of the problem too. They weren’t just bystanders—they were participants.\n",
        "upvotes": 542,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1jys3tp/bad_influence_netflix/"
    },
    {
        "id": "1jz92d0",
        "author": "Fullwake",
        "title": "Is there anyway to make Netflix stop recommending me Cozy Grove? I have no interest in your games Netflix!",
        "content": "I don't go to Netflix for games, I am never going to play this game, and yet somehow it is the banner recommendation every single time I open Netflix, regardless of what has recently come out - even when its something that I might actually want to watch. I have disliked the game (thought I've never played it) and I've never liked a single game, yet somehow that dumb game is the permanent banner on Netflix for me. It's getting to be quite annoying. At this point it could be the best game in the world and I would still refuse to ever play it out of sheer spite. ",
        "upvotes": 34,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jz92d0/is_there_anyway_to_make_netflix_stop_recommending/"
    },
    {
        "id": "1jzrikp",
        "author": "Pogrebnik",
        "title": "'Squid Game' London Live Experience Tickets Go on Sale on April 25, 2025",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jzrikp/squid_game_london_live_experience_tickets_go_on/"
    },
    {
        "id": "1jzgptr",
        "author": "Quigsquib",
        "title": "Why do they put the main character and the love interest that they end up with in the thubnail!!",
        "content": "Why do they put the main character and the love interest that they end up with in the thubnail!!\n\nI've seen this in at least 3 shows so far! I don't want the entire love arc of the 16 season show spoiled in the first 5 episodes! 😭",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jzgptr/why_do_they_put_the_main_character_and_the_love/"
    },
    {
        "id": "1k03z3x",
        "author": "CartoonistOk2254",
        "title": "Is ‘the gentlemen’ show realistic at all?",
        "content": "I’m sure a lot of it is exaggerated but what parts are most realistic. This was such a good show and I want to know if it’s realistic at all. Guy Ritchie did great",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k03z3x/is_the_gentlemen_show_realistic_at_all/"
    },
    {
        "id": "1jzpu4n",
        "author": "Curious-Umpire-9821",
        "title": "How to fix Netflix glitching?",
        "content": "I was wondering how to fix this? When I watch Netflix on my laptop it continuously glitches like this every couple of seconds, it makes Netflix watching quite annoying. I've already tried turning off the drop shadow on subtitles and changing my cursor size to no avail. Hopefully someone knows a fix! Cheers",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zj29q82ilzue1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1jzpu4n/how_to_fix_netflix_glitching/"
    },
    {
        "id": "1jzpbfx",
        "author": "hualiu0116",
        "title": "Mob psycho 100 no English subs",
        "content": "I have been anticipating mob psycho 100 as soon as I saw it was coming soon Netflix and when I wanted to watch it , I was so disappointed to see there were no English subs and I really wanted to watch it but unfortunately I can’t now does anyone have the same concern?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jzpbfx/mob_psycho_100_no_english_subs/"
    },
    {
        "id": "1jzd6xs",
        "author": "JaniGriot",
        "title": "The gardener!",
        "content": "I am a lover of pretty much all Netflix series because Netflix is an avid supporter of audio description!\nHowever…\n\nI’m starting to be irritated because many of the best shows, are missing the English A.D. option!\n\nIs anybody else having this problem?\n\nAs a blind man, there aren’t very many places for me to go other than the prime Networks for streaming services to get audio described content. Before I went blind, I used to watch a huge amount of anime, but none of those services offer audio description so I no longer get to watch any of that content!\n\nNow, my mother has shared yet another show with me on Netflix called the gardener and though I would love to watch it, Netflix has not released this option for me!\n\nAgain! Lol Am I the only one having this problem, or are there other ways that people have gotten around this issue?",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jzd6xs/the_gardener/"
    },
    {
        "id": "1jzhkuz",
        "author": "IveyTheHockeyWitch",
        "title": "Just watched \"For Love\" and highly recommend it",
        "content": "I just watched the documentary \"For Love.\" It was a very powerful documentary, and perhaps because I have direct connections to its subject, it felt particularly impactful and well worth the watch. It is a gut punch to hear all the stories that are shared. It is not a light or even fun watch, and I personally had to pause and take a break after one specific group's story. It's an important conversation and can't be recommended enough. ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jzhkuz/just_watched_for_love_and_highly_recommend_it/"
    },
    {
        "id": "1k01s9s",
        "author": "StasisApparel",
        "title": "Is there a way to make a petition to get Netflix to release Black Mirror Season 7 on Blu-ray (idgaf if it's Region A, B or C)",
        "content": "I really want to own this season on physical media, so damned good!\n\nI don't care Derry Girls and Ozark have no official releases, I just want Season 7 Black Mirror on BD. I will even buy a region free player for this.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k01s9s/is_there_a_way_to_make_a_petition_to_get_netflix/"
    },
    {
        "id": "1jzw2v0",
        "author": "Pinky_devil1",
        "title": "Does this song fit your interpretation of Jamie and Adolescence ?",
        "content": "I came across this video edit on TikTok and felt like the song Broken by Anson Seabra perfectly captured Jamie and the atmosphere of the series.\nI've decided to share the edit here because I thought others who watched the show might connect with it too. The lyrics/melody really resonated with his isolation, his anger, the sense of misunderstanding..\nLet me know what you think \n",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/j4w668l6y0ve1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1jzw2v0/does_this_song_fit_your_interpretation_of_jamie/"
    },
    {
        "id": "1jzspku",
        "author": "Available_Can7525",
        "title": "Major insight about how Adan really felt about Dani on Love on the Spectrum has been revealed",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jzspku/major_insight_about_how_adan_really_felt_about/"
    },
    {
        "id": "1jzbwbn",
        "author": "OddChard3399",
        "title": "The residence - unanswered questions! *SPOILERS*",
        "content": "Hi all, I've just finished The Residence and wondered if you could help me with some unanswered questions:\n\n- What happened outside? Why did so many people run out? What crashed?\n- Why did AB say 'I am going to be dead by the end of the night?' When Lily had asked to reconcile?\n- What was Harry talking to the Australian industrialist about?",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jzbwbn/the_residence_unanswered_questions_spoilers/"
    },
    {
        "id": "1jzn4qz",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix’s Live-Action Avatar Will Show a More Feminine Side of Toph, Says Miya Cech",
        "content": "",
        "upvotes": 1,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1jzn4qz/netflixs_liveaction_avatar_will_show_a_more/"
    },
    {
        "id": "1jz3n9o",
        "author": "SonOfAlfeus",
        "title": "Thronglets, the videogame based on an episode of Black Mirror by Netflix.",
        "content": "I took some screenshots of the game and you can see how much time and effort went into making this game, the artwork is absolutely beautiful and the storyline was quite remarkable.",
        "upvotes": 18,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jz3n9o/thronglets_the_videogame_based_on_an_episode_of/"
    }
]