[
    {
        "id": "1q14tna",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Nia DaCosta - Wednesday 1/7 at 11:15 AM ET - Director of '28 Years Later: The Bone Temple', 'Hedda', 'Candyman', 'The Marvels', and 'Little Woods'",
        "content": "",
        "upvotes": 111,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z0kswk1bqqag1.png?auto=webp&amp;s=f8bc6c2efa90e3187134db8451999740a1ef7edb"
        },
        "permalink": "/r/movies/comments/1q14tna/amaqa_announcement_nia_dacosta_wednesday_17_at/"
    },
    {
        "id": "1q1nh76",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (We Bury the Dead)",
        "content": "**New In Theaters**:\n\n* [We Bury the Dead](https://old.reddit.com/r/movies/comments/1q1ngoh/official_discussion_we_bury_the_dead_spoilers/?)\n\n**Awards Run Catch-Up**\n\n* [Sentimental Value](https://www.reddit.com/r/movies/comments/1pkhnsl/official_discussion_sentimental_value_spoilers/)\n* [It Was Just an Accident](https://www.reddit.com/r/movies/comments/1pkhnwc/official_discussion_it_was_just_an_accident/)\n* **No Other Choice coming next week**\n\n**25th Anniversary Throwback Discussion Threads**:\n\n**No throwback releases this week. See ya next week as we continue into 2001!**\n\n**Still In Theaters**:\n\n* [Avatar: Fire and Ash](https://old.reddit.com/r/movies/comments/1pqbh9u/official_discussion_avatar_fire_and_ash_spoilers/?)\n* [The Housemaid](https://old.reddit.com/r/movies/comments/1pqbhad/official_discussion_the_housemaid_spoilers/?)\n* [The SpongeBob Movie: Search for Squarepants](https://old.reddit.com/r/movies/comments/1pqbhbe/official_discussion_the_spongebob_movie_search/?)\n* [Ella McCay](https://www.reddit.com/r/movies/comments/1pkhnoq/official_discussion_ella_mccay_spoilers/)\n* [Five Nights at Freddy's 2](https://old.reddit.com/r/movies/comments/1pekchd/official_discussion_five_nights_at_freddys_2/?)\n* [Hamnet](https://old.reddit.com/r/movies/comments/1pekcj2/official_discussion_hamnet_spoilers/)\n* [Zootopia 2](https://www.reddit.com/r/movies/comments/1p7rbyf/official_discussion_zootopia_2_spoilers/?)\n* [Eternity](https://www.reddit.com/r/movies/comments/1p7rc0x/official_discussion_eternity_spoilers/?)\n* [Wicked: For Good](https://old.reddit.com/r/movies/comments/1p2njr5/official_discussion_wicked_for_good_spoilers/?)\n\n**New On Streaming:**\n\n* [Wake Up, Dead Man](https://old.reddit.com/r/movies/comments/1plb82b/official_discussion_wake_up_dead_man_a_knives_out/?)\n* [Jay Kelly](https://old.reddit.com/r/movies/comments/1pg2zf7/official_discussion_jay_kelly_spoilers/?)\n* [Train Dreams](https://www.reddit.com/r/movies/comments/1p4qwxk/official_discussion_train_dreams/)\n* [PBS's The American Revolution](https://www.reddit.com/r/movies/comments/1p4qsya/official_discussion_pbs_the_american_revolution/)\n* [Nouvelle Vague](https://old.reddit.com/r/movies/comments/1oyaqq6/official_discussion_nouvelle_vague_spoilers/?)\n* [Playdate](https://old.reddit.com/r/movies/comments/1oyaqsm/official_discussion_playdate_spoilers/?)\n* [Frankenstein (2025)](https://old.reddit.com/r/movies/comments/1orfrtf/official_discussion_frankenstein_2025_spoilers/)\n* [Hedda](https://old.reddit.com/r/movies/comments/1orfruj/official_discussion_hedda_spoilers/?)\n* [Ballad of a Small Player](https://www.reddit.com/r/movies/comments/1okihwe/official_discussion_ballad_of_a_small_player/?)\n* [A House of Dynamite](https://old.reddit.com/r/movies/comments/1ofgyx9/official_discussion_a_house_of_dynamite_spoilers/?)\n* [The Hand that Rocks the Cradle (2025)](https://old.reddit.com/r/movies/comments/1ofgz2p/official_discussion_the_hand_that_rocks_the/?)",
        "upvotes": 33,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1q1nh76/official_discussion_megathread_we_bury_the_dead/"
    },
    {
        "id": "1q3phd6",
        "author": "Amaruq93",
        "title": "Tim Curry behind the scenes of \"Ferngully: The Last Rainforest\" (1992), recording Toxic Love",
        "content": "",
        "upvotes": 2689,
        "comments": 81,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2bz1puavzbbg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1q3phd6/tim_curry_behind_the_scenes_of_ferngully_the_last/"
    },
    {
        "id": "1q3fa43",
        "author": "SanderSo47",
        "title": "Box Office: ‘Avatar: Fire and Ash’ Flies Past $1B",
        "content": "",
        "upvotes": 8866,
        "comments": 1907,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/r_1EwzcoRckle-V2YlOlbsCElW122Q4yqpIdhWxv7lo.jpeg?auto=webp&amp;s=c9c7fb6dd5ebde4684380b9ba56828beff06d3fd"
        },
        "permalink": "/r/movies/comments/1q3fa43/box_office_avatar_fire_and_ash_flies_past_1b/"
    },
    {
        "id": "1q3h7ms",
        "author": "Imnotsomebodyelse",
        "title": "I accidentally activated the audio narration while watching The Naked Gun. Didn't notice something was wrong",
        "content": "Watching the naked gun on prime. Somewhere after the halfway mark i accidentally turned on narration feature. \n\nI'll be honest people, i genuinely thought it was part of the damn film. It fit freaking perfectly. Had that noir narration feel just enhanced to the level of it being a bit taken long enough to be funny. Didn't realise until a good 20 minutes later",
        "upvotes": 3777,
        "comments": 367,
        "media": null,
        "permalink": "/r/movies/comments/1q3h7ms/i_accidentally_activated_the_audio_narration/"
    },
    {
        "id": "1q38lyw",
        "author": "MarvelsGrantMan136",
        "title": "‘One Battle After Another’ Named Best Picture by National Society of Film Critics",
        "content": "",
        "upvotes": 6524,
        "comments": 1249,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6ufIJnfMaPO4UXVVL4kZLJ-OzIfdIjfh7NELqmQ8XfY.jpeg?auto=webp&amp;s=44f3e1bd67b91effa948219778f9d80831a30866"
        },
        "permalink": "/r/movies/comments/1q38lyw/one_battle_after_another_named_best_picture_by/"
    },
    {
        "id": "1q3n3uy",
        "author": "XInsects",
        "title": "Lawrence of Arabia (1962) blew my mind",
        "content": "I went into Lawrence of Arabia expecting a stuffy, tedious, dated film where I'd probably give up after 20 minutes. Instead it felt incredibly fresh, relevant, and endlessly exciting, and I ended up glued to the screen for the full 3 1/2 hrs or so. I haven't stopped thinking about it since. The story, the fascinating intracacies and emerging contradictions of the character, and how incredible the filmmaking was. I love how Lawrence's attitudes and ideas were shaped by the responses he gets to various events, his innocent, pure idealism slowly crumbling into this cynism and bitterness.    \n\nIt was just incredible. Like Barry Lyndon, every shot is just beautifully framed and interesting. Then the huge scenes of people, with hundreds of camel mounted arabs galloping across the desert, or hundreds of unmounted horses escaping a traincart. I just have no idea how they were able to create some of these shots, and in such remote places of the world.   \n\nIt was absolutely mind-blowing to me now, so I can't imagine how audiences would have received it back in 1962, when they probably hadn't even seen colour footage of desert before? It must have been far more impactful than any spectacle films we have today (e.g Avatar etc). And so much more mature and complex. I'm sad we'll never see anything like it again.   \n\nIf you haven't seen it, I highly recommend it, and on the biggest screen possible. \n\n",
        "upvotes": 400,
        "comments": 109,
        "media": null,
        "permalink": "/r/movies/comments/1q3n3uy/lawrence_of_arabia_1962_blew_my_mind/"
    },
    {
        "id": "1q3pa27",
        "author": "laudrupszn11",
        "title": "Movies like Snatch and Lock, Stock and two smoking barrells",
        "content": "Same as title. \n\nMovies like Snatch (2000), Lock, Stock and two smoking barbells (1998) and The gentlemen (2019). \n\nThey're 3 of my fav movies and I'm in love with this genre. With interconnected storyline and humour etc. I watched RocknRolla but found it bad so left in between. Maybe I'll give it another shot.\n\nPlease suggest!",
        "upvotes": 176,
        "comments": 284,
        "media": null,
        "permalink": "/r/movies/comments/1q3pa27/movies_like_snatch_and_lock_stock_and_two_smoking/"
    },
    {
        "id": "1q3rntc",
        "author": "Boss452",
        "title": "James Cameron talks about the simple pitch he made for Titanic and Leonardo Dicaprio's reluctance to join the film.",
        "content": "",
        "upvotes": 88,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g3g6rdt7gcbg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1q3rntc/james_cameron_talks_about_the_simple_pitch_he/"
    },
    {
        "id": "1q3dioz",
        "author": "TheWor1dsFinest",
        "title": "What scene makes you go “Nope!” every time you watch it?",
        "content": "As a lifelong arachnaphobe I’ve never once watched Return of the King and not thought “Nope! Couldn’t do it” once it gets to the Shelob scene. Middle Earth is lucky it was Frodo and not me having to deal with that giant spider. God damn demon it is. Sauron would’ve won. There would no more Shire, Pippin. Samwise Gamgee is the bravest character in fiction for facing that thing.",
        "upvotes": 527,
        "comments": 799,
        "media": null,
        "permalink": "/r/movies/comments/1q3dioz/what_scene_makes_you_go_nope_every_time_you_watch/"
    },
    {
        "id": "1q3eequ",
        "author": "RonSwanSong87",
        "title": "*The Sandlot* is a masterful piece of cinema",
        "content": "I vaguely remember it from my childhood (I'm 38 and grew up playing baseball fairly seriously, but was only 6 or 7 when it was released...), but damn if I knew at the time it was a cinematic and story telling masterpiece...in fact, i did not.\n\nThe narration / voice over, the nostalgia, the innocence and pure fun portrayed in the essence of the game of baseball (and childhood), the soundtrack (hello Ray Charles, my goat), the humor, the dialogue, the cast, and the warm fuzzies of how it ends with the narration zoom out.\n\nMy younger kids (9 and 11) discovered it a few weeks back and it has been a real treat to have it on repeat.  That is all...",
        "upvotes": 410,
        "comments": 83,
        "media": null,
        "permalink": "/r/movies/comments/1q3eequ/the_sandlot_is_a_masterful_piece_of_cinema/"
    },
    {
        "id": "1q3lpsp",
        "author": "starwarsisawsome933",
        "title": "Do you think we will ever find or have a series that either is on the same grandeur or tops the Lord of the rings trilogy?",
        "content": "I just finished re-watching return of the King and I'm having that feeling of emptiness inside me, not because the movie is bad (my goodness, it's in its own category of epicness, nothing compares to it currently) but just the feeling of will we ever get an epic like that? \n\nWhen I think of epics that could even come close to it the only thing I can really think of is the conclusion of the MCU, and even then there's a part of me that feels like endgame was just kind of thrown together and shoved in front of the fans instead of this really overarching Grand conclusion story lines (honestly personal opinion, I think they should have turned Infinity War into three separate movies, kept Infinity War the same, changed a bit of endgame to create different branching paths, and then find a good way to conclude it all in a third movie) \n\nDo you think we'll ever have something of that grandeur that the LOTRs saga is?",
        "upvotes": 121,
        "comments": 277,
        "media": null,
        "permalink": "/r/movies/comments/1q3lpsp/do_you_think_we_will_ever_find_or_have_a_series/"
    },
    {
        "id": "1q2vjoy",
        "author": "BunyipPouch",
        "title": "Cinemark Announces 'Bring Your Own Bucket' Weekend Event for National Popcorn Day on January 18th and 19th - For $5, the theater will let patrons fill up any container they bring full of popcorn, up to 400 ounces.",
        "content": "",
        "upvotes": 4070,
        "comments": 237,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mjJ4cMNwimklBrEdIoj8RSrawiDjItVN35KIxRE_Kww.jpeg?auto=webp&amp;s=972bfaa25d174011943ef296d619d3deef99b922"
        },
        "permalink": "/r/movies/comments/1q2vjoy/cinemark_announces_bring_your_own_bucket_weekend/"
    },
    {
        "id": "1q32cxg",
        "author": "LiteraryBoner",
        "title": "Harrison Ford tells the President to go fuck himself (in not so many words) in A Clear and Present Danger (1994, dir. Phillip Noyce)",
        "content": "",
        "upvotes": 1504,
        "comments": 127,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wn6g9ewjh6bg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1q32cxg/harrison_ford_tells_the_president_to_go_fuck/"
    },
    {
        "id": "1q3m06d",
        "author": "Giff95",
        "title": "\"The Apartment\" (1960) gets better with age.",
        "content": "I finally watched Billy Wilder's \"The Apartment,\" and I honestly wasn’t prepared for how heavy and emotionally complex it would get beneath its clean, witty exterior. Going in, I expected a light romantic comedy. What I got instead was a surprisingly honest exploration of loneliness, moral compromise, and even suicide, all wrapped inside one of the most deceptively simple premises I’ve ever seen.\n\nAt first, the setup feels almost sitcom-like. Jack Lemmon lends his apartment to higher-ups at his insurance company so they can carry on affairs, hoping it’ll help him climb the corporate ladder. It’s clever, funny, and absurd. But as the film unfolds, the simplicity of that idea spirals into something nuanced. His apartment stops being a joke and becomes representative of his isolation, a space he technically owns but never truly gets to live in.\n\nJack Lemmon's performance is absolutely perfect. He plays Baxter as the ultimate everyman, he is awkward, well-meaning, quietly desperate to belong. Lemmon’s performance makes Baxter’s loneliness feel painfully real without ever becoming too melodramatic. You can see how Baxter’s small moral compromises slowly eat away at his sense of self, even as he keeps smiling and cracking jokes.\n\nWhat really surprised me is how directly the film confronts despair and suicide, especially for a mainstream Hollywood movie from 1960. Shirley MacLaine’s Fran is treated with genuine compassion, and the film never trivializes her pain. Instead, it frames loneliness as something systemic created by power imbalances, emotional neglect, and a culture that rewards selfishness.\n\nThe film features an exchange of dialogue that is among my favorites in film now:\n\n*The mirror... it's broken.*  \n*Yes, I know. I like it that way. Makes me look the way I feel.*\n\nBy the time the movie ended, it stood out for feeling far more layered than its premise suggests. It has its humorous moments, but it’s also deeply human and sad. For a film over 60 years old, it feels shockingly relevant and I imagine it speaks more so now to people than it did when it was introduced as a \"comedy.\"",
        "upvotes": 73,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1q3m06d/the_apartment_1960_gets_better_with_age/"
    },
    {
        "id": "1q32tyl",
        "author": "RivetCounter",
        "title": "Movies that don’t fit the ‘feel’ of the franchise? Aka “it’s a decent movie, just not a good X movie”.",
        "content": "For example, people have said that Cars 2 can be seen as a decent movie but the spy story didn’t really fit into the Cars racing universe. \n\nI know that Final Fantasy: The Spirits Within has been basically disowned as a final fantasy movie in name only by FF fans, and it should have been called something else.",
        "upvotes": 968,
        "comments": 1072,
        "media": null,
        "permalink": "/r/movies/comments/1q32tyl/movies_that_dont_fit_the_feel_of_the_franchise/"
    },
    {
        "id": "1q3dj1j",
        "author": "gamersecret2",
        "title": "What movie feels uncomfortably accurate about the world right now, even though it was not meant to predict the future?",
        "content": "Some movies age quietly. Others age like warnings. You watch them years later and realize they were not exaggerating. They were paying attention.\n\nFor me it is Network.\n\nWhen I first watched it years ago, it felt exaggerated. Loud. Angry. Almost theatrical. It felt like satire pushed too far, made to shock people back then. I enjoyed it, but I did not take it seriously. \n\nWatching it again now feels completely different. What hits me is not the famous speeches. It is the system behind them. \n\nAttention matters more than truth. Anger gets rewarded. Calm voices get ignored. People slowly turn into content through small compromises, not evil plans. \n\nEveryone is just doing their job too well. That mindset feels normal now, and that is the scary part. That is why it feels so accurate today.\n\nWhat movie feels way more real now than it did when you first watched it?\n\nThank you.",
        "upvotes": 239,
        "comments": 435,
        "media": null,
        "permalink": "/r/movies/comments/1q3dj1j/what_movie_feels_uncomfortably_accurate_about_the/"
    },
    {
        "id": "1q3ne2k",
        "author": "browniebiscuitchildr",
        "title": "What’s a movie character who, if they weren’t the protagonist, would be seen as a total bum?",
        "content": "\nI’m thinking of characters who only come across as charming, relatable, or sympathetic because the movie is told from their point of view. If the story followed anyone else, they’d probably be viewed as irresponsible, selfish, or just plain annoying. What are some good examples where the protagonist framing does a lot of the heavy lifting?",
        "upvotes": 46,
        "comments": 163,
        "media": null,
        "permalink": "/r/movies/comments/1q3ne2k/whats_a_movie_character_who_if_they_werent_the/"
    },
    {
        "id": "1q31x0k",
        "author": "digit68",
        "title": "The ending of The Tomorrow War is a masterclass in tactical stupidity",
        "content": "I can get past the time travel paradoxes, but the final 20 minutes of this movie are infuriating. They find the source. They find the hibernating aliens. They literally have the \"Queen\" right in front of them.\n\nAny rational human being would:\n\n1. Plant every C4 charge they brought directly onto the Queen’s head.\n2. Inject the poison into her ***first*** while she’s unconscious.\n\nInstead, they decide to \"clear the room\" by taking out the males first? Why? If the Queen dies, the future extinction event is cancelled. Even if the males wake up, they can’t reproduce. They chose the only path that led to a chaotic shootout.\n\nAlso, back on the oil rig - the \"we don't have enough poison\" line is legendary. She’s a biological creature. She has eyes and a brain. You have high-caliber rifles and explosives. Just... end it? The plot armor on that alien was thicker than its scales.",
        "upvotes": 871,
        "comments": 188,
        "media": null,
        "permalink": "/r/movies/comments/1q31x0k/the_ending_of_the_tomorrow_war_is_a_masterclass/"
    },
    {
        "id": "1q2tl2r",
        "author": "Chief_Cthulhu",
        "title": "Shin Kamen Rider (2023) | Hideaki Anno - Kamen Rider goes berserk",
        "content": "",
        "upvotes": 2107,
        "comments": 240,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7iq8e0ynp4bg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1q2tl2r/shin_kamen_rider_2023_hideaki_anno_kamen_rider/"
    },
    {
        "id": "1q3pdrx",
        "author": "Alternative-Cake-833",
        "title": "Movie franchises that ran their course?",
        "content": "For me, it's the Michael Bay Transformers movies. Even though Dark of the Moon wasn't a very good film, you could tell that it ended perfectly. Megatron is killed and the Transformers are hopeful for the future as Sam's character arc is wrapped up. You think that they could end it on Dark of the Moon, with a perfect ending. And that's coming from someone that wasn't even big on Bayformers in general besides for the first one.\n\nBut no, they did two more Michael Bay Transformers movies (Age of Extinction and The Last Knight), while recasting LaBeouf with Mark Wahlberg and undoing the ending of the third film. By that time, it had approached into the ridiculous and overdone territory with a Transformer that could age old. I mean, really. That baffled me a lot. It was clear that by the time Last Knight came out, the whole franchise had run its course and realistically, there was no coming back from it. The Transformers movies has since improved overtime but holy smokes, that franchise was just going downhill bigtime for a while with no signs of improvement until Bay stepped down from the director's chair.",
        "upvotes": 22,
        "comments": 139,
        "media": null,
        "permalink": "/r/movies/comments/1q3pdrx/movie_franchises_that_ran_their_course/"
    },
    {
        "id": "1q3lq9y",
        "author": "April0neal",
        "title": "Favourite Ethan Hawke Movie",
        "content": "I recently completed “The Lowdown” series on Hulu / Disney starring Ethan Hawke and I absolutely loved it.\n\nSo I’ve been sort of on an Ethan Hawke marathon of his movies.\n\nI never realized that he has been making movies since 1986 (40 years). \n\nOver the past 2 weeks, I have watched these movies of his:\n\n1. Before the Devil Knows You’re Dead\n\n2. The Purge\n\n3. First Reformed (ah-mazing !!! )\n\nWhat is everyone’s fave Ethan Hawke movie? \n\nThank you in advance for your thoughts and input. ",
        "upvotes": 37,
        "comments": 147,
        "media": null,
        "permalink": "/r/movies/comments/1q3lq9y/favourite_ethan_hawke_movie/"
    },
    {
        "id": "1q3n3iy",
        "author": "Wonder-Lad-2Mad",
        "title": "Seeing Unforgiven (1992) should be mandatory after going through the \"Man With No Name\" trilogy. It's the perfect send off for Clint Eastwood's character.",
        "content": "Last month I got an urge to see some classic western. I had seen The Good, The Bad &amp; The Ugly before when I was doing a greatest movies of all time watch. So I decided to go and check out the other two entries of the Man With No Name trilogy, a Fistful of Dollars &amp; For a Few Dollars more. And finish the whole thing with Unfrogiven.\n\n\n\nI fucking loved a Fistful of Dollars. It's straight up a Yojimbo rip off. But I fucking love Eastwood's performance as the Man With No Name. Nobody has worked a cigar as good as he does in those movies.\n\n\n\nA Few Dollars more, I liked a little less, it's still great movie but it drags a little bit with the pacing and the story becomes a bit too conveluted there in the middle. Still, amazing ending.\n\n\nAnd I also rewatched Good, Bad &amp; Ugly. Which I still think it's a masterpiece. One I thing I noticed watching this Sergio Leone trilogy is how he uses the same acting troupe for different roles in the movies, it's pretty neat. That big bearded guy plays a goon in all three movies.\n\n\nWatching this trilogy is kinda nuts cause it's like, everything I've ever known about westerns has come from these movies. It'd like watching every westeren ever made all at once. Which is a testiment to how great they are cause it means everybody else stole from them.\n\n\n\nAnyway, after all this I finally sat down and watched Unforgiven. The difference between the movies is instantly felt in the presentation. The Man With No Name trilogy are crime action movies, Unfrogiven is a slowburn drama. It takes all the way to the end of the movie for a big action scene. And it's so well worth it.\n\n\n\nI like to head canon that Will Munny is Eastwood's Man With No Name. Finally settling after years of gunslining. He ends up &gt;!exorcising his demons, quitting drinking and swearing off violance!&lt; and when he &gt;!snaps and goes back to his old ways, it's not with the flair of a badass gunslinging hero. He looks like a terrifying stone cold murderer!&lt; the same way everybody else felt around the Man With No Name when he was gunning down people with his quickdraw skills as the audiences cheered.",
        "upvotes": 18,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1q3n3iy/seeing_unforgiven_1992_should_be_mandatory_after/"
    },
    {
        "id": "1q32l24",
        "author": "theZstands4Diamonds",
        "title": "Flagship movie for each State",
        "content": "My daughter will be graduating college in the next year or so and she is trying to decide where she wants to live. Obviously, job market, cost of living and various real world factors will ultimately make her decision but… I thought it would be fun to spend the next few months watching all 50 states flagship movies to see which might look the best on film. A few examples I gave were “Ferris Buehler” for Chicago, “Uncut Gems” for New York and “Brokeback Mountain” for Wyoming. I’m curious what others think. I have no idea about some of the flyover states but that’s half the fun.",
        "upvotes": 348,
        "comments": 1111,
        "media": null,
        "permalink": "/r/movies/comments/1q32l24/flagship_movie_for_each_state/"
    },
    {
        "id": "1q3nyt8",
        "author": "kostac600",
        "title": "Wag the Dog (1997)",
        "content": "I really don’t know if this movie holds up, but it really does seem the 90s in many ways are being repeated at the executive level of politics\n\nA sophomoric as current USA leadership is, it would not surprise if recent military actions were inspired by this flick given all the deflections and distractions that are in play\n\nthe film centers on a spin doctor and a Hollywood producer who fabricate a war in Albania to distract voters from a presidential sex scandal",
        "upvotes": 14,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1q3nyt8/wag_the_dog_1997/"
    },
    {
        "id": "1q3u7ii",
        "author": "AdSpecialist6598",
        "title": "I know that as long time movie watchers many of us want originality but for me it is more important that a film is well made and is enjoyable to watch.",
        "content": "I get it in a world of endless remakes and rehashes we want something different but for me it is more important to me that a film is well made and that I find it worth my time and enjoyable. For example, She's out my league is a very run of mill rom-com. The only thing that it does different is the hot girl falls in love with the nerdy nice guy, and he spends the whole movie trying to wrap his head around it. Another example is the Roundup series of films which is pretty much the Korean Lethal Weapon but instead of shootouts and things blowing up it is Ma Dong Seok who is pretty much Sammo Hung if he was an MMA fighter built like a brick house knocking out fools in the name of justice. None of these films are groundbreaking but are well rounded, well-made and the actors gave it their best while respecting the viewer. That all I can ask for.",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1q3u7ii/i_know_that_as_long_time_movie_watchers_many_of/"
    },
    {
        "id": "1q3ikn5",
        "author": "westdan2",
        "title": "The devil is in the details",
        "content": "I just watched Fight Club with my wife who has never seen it. We were talking about it after the fact and I said I love it because the more you watch it, the more details you find that pop up. What is your favorite movie that gets better with multiple viewings due to little details that get revealed once you know the plot.",
        "upvotes": 33,
        "comments": 48,
        "media": null,
        "permalink": "/r/movies/comments/1q3ikn5/the_devil_is_in_the_details/"
    },
    {
        "id": "1q39p7m",
        "author": "MajorIvan88",
        "title": "How Die Hard with a Vengance Was Filmed on Location in New York - CinemaStix",
        "content": "",
        "upvotes": 101,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dChFjfXrVbJdk5FFi0sRQQ7vYZNGyfP3zbVwnj0Emgg.jpeg?auto=webp&amp;s=6b58d92a5dffcf207df4a1e64122c6a154696ee7"
        },
        "permalink": "/r/movies/comments/1q39p7m/how_die_hard_with_a_vengance_was_filmed_on/"
    },
    {
        "id": "1q2v7d2",
        "author": "browniebiscuitchildr",
        "title": "When’s the last time a fart joke was delivered well in a film?",
        "content": "For me, it’s *Finding Nemo*. First off, the character—or, in this case, the seagull—doesn’t actually fart. It’s just framed to look that way. There’s also the element of surprise. You don’t expect the whole underwater setup to lead to that tiny *plip* above the ocean, followed by the classic “nice 😒” from the disgusted seagull before flying off.\n\nIt was the one moment where I actually thought, “Wow, that was clever!”",
        "upvotes": 582,
        "comments": 378,
        "media": null,
        "permalink": "/r/movies/comments/1q2v7d2/whens_the_last_time_a_fart_joke_was_delivered/"
    },
    {
        "id": "1q35ecz",
        "author": "iiRaz0r",
        "title": "I want to be more media literate.",
        "content": "2 months ago I watched No Country for Old Men.\n\nI loved it…..\n\nUntil it ended. This was before I knew it had thematic significance. I was frustrated. I needed answers.\n\nSometimes I challenge myself and give myself 30 minutes to go back through a film and see what I missed or what kind of bigger message/piece I am missing, but I rarely ever get my answers.\n\nThat’s when I go to the internet and see actual smart people spell it out for me.\n\nI want to be one of those smart people. That can analyze movies and just get it yk?\n\nYou can say “it’s a matter of personal interpretation” but for some movies it feels like that’s hardly the case. The artists of these films clearly have a message they want to share. Mulholland drive for example. For me there’s a very set interpretation for the films plot and theme, the individual symbols however can be more subjective I guess. ",
        "upvotes": 167,
        "comments": 154,
        "media": null,
        "permalink": "/r/movies/comments/1q35ecz/i_want_to_be_more_media_literate/"
    }
]