[
    {
        "id": "1kvqnp4",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 22,
        "comments": 2141,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kvqnp4/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1kyuc6l",
        "author": "ElReyDePays",
        "title": "No Real Madrid captains armband anymore",
        "content": "Since a while we don’t wear the double captain armband anymore. For a long time when Sergio Ramos wore the captains armband, he wore a special Real Madrid armband on top of the standard issued one of UEFA. They need to bring this back man. What do you guys think about this. Hopefully Carva brings back this tradition",
        "upvotes": 363,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kyuc6l/no_real_madrid_captains_armband_anymore/"
    },
    {
        "id": "1kywfrd",
        "author": "94Temimi",
        "title": "Diego López returns to Real Madrid as Castilla's goalkeeping coach",
        "content": "",
        "upvotes": 218,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kd-Iw_tlYW4JehI88u0kiLHTjWv57J5w_jpwPpEe3J0.jpg?auto=webp&amp;s=97fed22a7e44b063f0e37857e4366fe6554ffb72"
        },
        "permalink": "/r/realmadrid/comments/1kywfrd/diego_lópez_returns_to_real_madrid_as_castillas/"
    },
    {
        "id": "1kyillt",
        "author": "ranger_ronaldo",
        "title": "Now that the season’s wrapped up, here are my top 4 players, who do you guys think was the best this season?",
        "content": "",
        "upvotes": 1108,
        "comments": 183,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yoyaui7anr3f1.png?auto=webp&amp;s=275689e8282d7fb9a55b64b96ef705600e5fcc61"
        },
        "permalink": "/r/realmadrid/comments/1kyillt/now_that_the_seasons_wrapped_up_here_are_my_top_4/"
    },
    {
        "id": "1kyntmd",
        "author": "Ruben12ES",
        "title": "Real Madrid femenino - Athenea: \"Why is there anti-madridism? Because Real Madrid has been winning for many years, and that's why our rivals envy us\".",
        "content": "",
        "upvotes": 358,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/046z4zw4ps3f1.jpeg?auto=webp&amp;s=3851fa5a60bc7cf2c705fb8919cb169ca01adc45"
        },
        "permalink": "/r/realmadrid/comments/1kyntmd/real_madrid_femenino_athenea_why_is_there/"
    },
    {
        "id": "1kyy46g",
        "author": "Total_Escape_9778",
        "title": "Just a reminder that today is the last day for voting for the la liga player of the season....",
        "content": "Everyone vote for mbappe if you haven't already, please don't split votes since mbappe has got the majority as of now so there is no point in voting for our other players.",
        "upvotes": 37,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BnWcFt46YSLJcR0lT19f6EU8_STW7UR99QY41_GPr-8.jpg?auto=webp&amp;s=ffd8e775f826bc2d943e1ca9a01fbec1d5946b05"
        },
        "permalink": "/r/realmadrid/comments/1kyy46g/just_a_reminder_that_today_is_the_last_day_for/"
    },
    {
        "id": "1kyanzv",
        "author": "TimothyX7",
        "title": "Real Madrid closes the deals for Alvaro Carreras and Trent Alexander Arnold. When all the paperwork is signed, their signings will be announced shortly.",
        "content": "",
        "upvotes": 696,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hKt6VhsTDzVAV-fsPoCHgCdCD24aK7f_kzThDM7_KkY.jpg?auto=webp&amp;s=41d051cf1c32b80ecf3f284f36744fbdd72ee107"
        },
        "permalink": "/r/realmadrid/comments/1kyanzv/real_madrid_closes_the_deals_for_alvaro_carreras/"
    },
    {
        "id": "1kyc088",
        "author": "Main_Rhubarb_3592",
        "title": "WILL MISS U THREPEAT GOATQUEZ 🥲🥲",
        "content": "",
        "upvotes": 422,
        "comments": 26,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5u0e2tyncq3f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kyc088/will_miss_u_threpeat_goatquez/"
    },
    {
        "id": "1kyblj0",
        "author": "ranger_ronaldo",
        "title": "Ronaldo and Real Madrid devided my heart",
        "content": "I have a genuine question there are rumors that Ronaldo might join Al Hilal before the CWC and our opening game is against Al Hilal, whom you support I know the club is always bigger than any player and I’ve been a Real Madrid fan for years but if we end up beating Al Hilal it would genuinely break my heart to see Ronaldo lose, call me a fake fan or whatever but \"love has no amount\" I love both Ronaldo and Real Madrid and watching him lose against us would be one of the hardest moments of my life\n\nplease make it easy for me and don't be too harsh I honestly posted what I feels may he it looks childish  but this is what I feels\n\nAgain don't be harsh in comments 😭🙏",
        "upvotes": 369,
        "comments": 35,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kyblj0/ronaldo_and_real_madrid_devided_my_heart/"
    },
    {
        "id": "1kyls54",
        "author": "chwyrmy",
        "title": "Which player do you think will have the most explosive improvement under Xabi Alonso?",
        "content": "I think it’ll be Camavinga, I feel like these past 2 seasons he’s regressed quite a bit, he takes longer to make passes because he tries to make useless dribbles, and his defensive positioning has gotten worse this season. I think he’s one of the players that has one of the highest ceilings in his position out of everyone on the roster. ",
        "upvotes": 107,
        "comments": 77,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kyls54/which_player_do_you_think_will_have_the_most/"
    },
    {
        "id": "1kyz5xk",
        "author": "ManuMora98",
        "title": "[Fem - Andrea Pelaez and Arancha Rodríguez] Melanie Leupolz is retiring due to knee injuries. She's leaving Real Madrid this summer.",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RoVocQBWaDx9mGsKNmTVI3wmudNgsJ8c2KLzztKFtxM.jpg?auto=webp&amp;s=3854558bf334c8a5227c4312112e100747d3eb22"
        },
        "permalink": "/r/realmadrid/comments/1kyz5xk/fem_andrea_pelaez_and_arancha_rodríguez_melanie/"
    },
    {
        "id": "1kyt5s8",
        "author": "BathBroad8556",
        "title": "Club World Cup US GAME philly",
        "content": "Hey everyone, I’m a huge Real Madrid fan and I’ve got tickets to their game in Philadelphia for the Club World Cup. I’d love to get autographs or even just catch a glimpse of the players up close. Does anyone have experience with this — what’s the best way to meet the team or get autographs?\n\nSpecifically:\n\t•\tDo they stay at a known hotel before matches in the U.S.?\n\t•\tIs there a chance to meet them during warmups or after the game?\n\t•\tAre there public training sessions or arrival times I can try to catch?\n\t•\tAny tips on where to be or when to show up?\n\nAny advice or stories from past games would be amazing. Hala Madrid! ⚪️👑\n\nMore so interested in the best tips or tricks to get autographs! ",
        "upvotes": 22,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kyt5s8/club_world_cup_us_game_philly/"
    },
    {
        "id": "1kydxah",
        "author": "RM-PM-Surveys",
        "title": "[Post Match Survey Results] Real Madrid 2-0 Real Sociedad",
        "content": "",
        "upvotes": 160,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kydxah/post_match_survey_results_real_madrid_20_real/"
    },
    {
        "id": "1ky9asp",
        "author": "SDTRRDTS",
        "title": "Xabi Alonso era must take at least 5 years.",
        "content": "The man radiates with ideas and his love for a system approach to everything he does. I don’t expect titles to be honest, but it doesn’t mean I don’t have positive feelings about Xabi. Perez should let him cook, I’m very certain he will build the strongest team we’ve seen in years. We should hold in mind that Barcelona under Flick’s management will continue(mostly probably) to grow and they will became stronger too. Xabi is our weapon. There will be mistakes of course and maybe painful mistakes too. But the upcoming era has loads of potential.\nI’m very glad I don’t see any of scepticism in the sub, mostly we’re all on the same frequency about Xabi and team.\nHala Madrid.",
        "upvotes": 208,
        "comments": 95,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ky9asp/xabi_alonso_era_must_take_at_least_5_years/"
    },
    {
        "id": "1ky8zbg",
        "author": "94Temimi",
        "title": "[Ramón Álvarez] The signing of Carreras is now pending a medical examination.",
        "content": "",
        "upvotes": 215,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pv_lppF4dJK0GUTrXG2ycN3pLzk4bmS3x51E3Z0T1eY.jpg?auto=webp&amp;s=2f0c2653a4d1d53317cfca066e91801060183274"
        },
        "permalink": "/r/realmadrid/comments/1ky8zbg/ramón_álvarez_the_signing_of_carreras_is_now/"
    },
    {
        "id": "1ky5w05",
        "author": "Ruben12ES",
        "title": "Real Madrid Femenino - Olga Carmona: \"Real is the club of my life and has given me everything over the last five years. I've felt at home there, and I still consider it that way. I think everyone knows I'm a Real Madrid fan, and that won't change no matter where I play\"",
        "content": "",
        "upvotes": 196,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lr9hdrrypo3f1.jpeg?auto=webp&amp;s=e389894c73488755b23b9907318a2efd22c8a64c"
        },
        "permalink": "/r/realmadrid/comments/1ky5w05/real_madrid_femenino_olga_carmona_real_is_the/"
    },
    {
        "id": "1kxoo8m",
        "author": "ranger_ronaldo",
        "title": "THE GREATEST PERFORMANCE BY A GOALKEEPER IN A CHAMPIONS LEAGUE FINAL BY FAR",
        "content": "",
        "upvotes": 2317,
        "comments": 68,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kxoo8m/the_greatest_performance_by_a_goalkeeper_in_a/"
    },
    {
        "id": "1ky8qmm",
        "author": "Pebbledthoughts",
        "title": "Arda Güler - All 17 Goals &amp; Assists (2024/25) in 2900 minutes played",
        "content": "",
        "upvotes": 91,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Z7mKJU_WLpiviFnUM1NiJQCLUgVgRlCJy0hn0b1OjVA.jpg?auto=webp&amp;s=e336064ea9310cafed74980858863e359a6ccc3c"
        },
        "permalink": "/r/realmadrid/comments/1ky8qmm/arda_güler_all_17_goals_assists_202425_in_2900/"
    },
    {
        "id": "1kyhu3n",
        "author": "ManuMora98",
        "title": "[Fem - Official] Caroline Moller leaves the club after 4 seasons.",
        "content": "",
        "upvotes": 24,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kyhu3n/fem_official_caroline_moller_leaves_the_club/"
    },
    {
        "id": "1kxspjh",
        "author": "Dued_Plays",
        "title": "The Spanish Dominance comes to an end.",
        "content": "Might as well kick off again with the ucl next year 😉.",
        "upvotes": 813,
        "comments": 61,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kxspjh/the_spanish_dominance_comes_to_an_end/"
    },
    {
        "id": "1kxysss",
        "author": "besourosuco3",
        "title": "Vini e Ancelloti se reencontraram hoje no Maracanã no jogo do flamengo pela libertadores da América.",
        "content": "",
        "upvotes": 347,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qw1rs3w9mm3f1.jpeg?auto=webp&amp;s=d1fb133469a5d3b3cce9d279a547b9ac28ac0e0f"
        },
        "permalink": "/r/realmadrid/comments/1kxysss/vini_e_ancelloti_se_reencontraram_hoje_no/"
    },
    {
        "id": "1ky85ca",
        "author": "Sl_PROXY",
        "title": "Real Madrid Castilla: 2024/25 Season Review",
        "content": "",
        "upvotes": 47,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/c2Abu4f3MQtqzbmJS4Sw6npHMAVh07Grc0EfH4xwCfU.jpg?auto=webp&amp;s=1448d3253095dffe691bf8158d24cdb0b920a64e"
        },
        "permalink": "/r/realmadrid/comments/1ky85ca/real_madrid_castilla_202425_season_review/"
    },
    {
        "id": "1kyblrw",
        "author": "Total_Escape_9778",
        "title": "How are so many midfielders (+more potential midfielders) gonna be managed in our squad?",
        "content": "The current real madrid team already has some of the best midfielders in the world like jude bellingham and federico valverde. We have so many more great midfielders like aurélien tchouaméni, eduardo camavinga, dani ceballos and a potential rising star in the form of arda guler. Moreover there are talks abt buying nico paz back from como (who had an incredible breakthrough season winning the best u-23 player award) plus angelo stiller who absolutely balled this season and was recommended by toni kroos himself.\n\nNow I know that lots of our discussion will depend upon xabi alonso's tactics and future signings but still I think over team we would need to be selling some of these players and some might wanna leave on their own when they don't get enough playing time (cz its impossible to give everyone the adequate playing time when we have such a start-studded squad)\n\nI think there's no doubt that bellingham, valverde and tchouameni are here to stay. Camavinga has been a bit injured due to which his form this season was poor compared to his prvs standards. Ceballos had a great few seasons but he has always been inconsistent throughout his madrid career and sadly since coming back from his injury he hasn't been the same for us like he was during his purple patch. Arda guler had limited opportunites to prove himself but he did have a great game vs barcelona.\n\nThat said we definitely need a tempo-setter and the best possible option for that wuld be angelo stiller. Arda culd be our creative midfielder under a proper coach and he has the potential as we all culd see. Imo we wuld need to get rid of ceballos sooner or later and let nico paz still develop for now (or if the board wants use him instead of arda guler cz he has actually proven himself that too while playing for a midtable team. He has 6 goals and 8 assists this season for Como). \n\nIn the next few transfer windows we wuld need to totally revamp this squad especially our defense and in that we wuld need to get rid of all the wealkings. For now if we can get carreras and stiller along with taa and huijsen it wuld be an incredible transfer window.",
        "upvotes": 28,
        "comments": 54,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kyblrw/how_are_so_many_midfielders_more_potential/"
    },
    {
        "id": "1kyz90i",
        "author": "aiksawthirta",
        "title": "How will Xabi Alonso deal with Barca?",
        "content": "We lost all matches against Barca and I think there’s gonna be a focus on making sure the next season isn’t the same. Madrid will need to win against them. But Yamal imo has turned into a player that cannot be handled by a single defender.  He has a lot of positional freedom and he’s just too dangerous with the ball. 1v1 is also very likely to go his way. And Pedri is the best at what he does - controlling the tempo and directing plays. You also have Balde, who before his injury was having an incredible season. He’s a strong carrier and likes to run deep. I’m very curious to see how Xabi Alonso decides to deal with Barca’s threat. He likes to have roles rather than positions. \n\nFor people who’ve seen Leverkusen games, how has Xabi dealt with very threatening individual players? Has he altered or changed his tactics for specific players? I know that he’s known to exploit his opponents’ weaknesses e.g. using players like Grimaldo, Frimpong, Boniface. But curious if he’s dealt with opponent threats in a similar fashion.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1kyz90i/how_will_xabi_alonso_deal_with_barca/"
    },
    {
        "id": "1kxo802",
        "author": "redondo-inOldTraford",
        "title": "Why Stiller would be a incredibly good addition to our squad?",
        "content": "o, there has been a bit of debate in the sub about the necessity of Stiller.\n\nWithout entering into the need for a midfielder or not (and I believe we definitely need one to go into the season calm and assured that injuries cannot derail our season), this is a good image of the qualities Angelo Stiller displays.\n\nHere are all the European under-24 midfielders, and you can check his numbers in winning duels % and successful progressive passes.\n\nAs you can see, he is elite in both categories at the same time. You can see in the photo Pedri, Camavinga, Marc Casado, and also, if you are interested, see the big lie that Gavi is.\n\nAnother player I like is Adrian Bernabe, but Stiller is much better.\n\nHere, we cannot see the comparison with Tchouameni because he is over 24, but I think this is a good display of why this player caught the eye of Alonso and Real Madrid.\n\nThe guy is elite at bringing the ball forward, and that will help us to quickly bypass the high press of Arsenal and Barça, bringing the ball to Vini and Mbappé in an advantageous position.\n\nThis guy, together with Trent, is exactly the piece we need to break those teams' high pressure that was so difficult to handle this year.",
        "upvotes": 378,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/151wwdt4dk3f1.png?auto=webp&amp;s=96e1de705ece74bb5fab28cf2d2993ceed4d18fa"
        },
        "permalink": "/r/realmadrid/comments/1kxo802/why_stiller_would_be_a_incredibly_good_addition/"
    },
    {
        "id": "1kxdvws",
        "author": "94Temimi",
        "title": "Official: Kylian Mbappé is Real Madrid Player of the Season",
        "content": "",
        "upvotes": 1358,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4Zi0mI0v73EJmHIlWbfMqlHxLRsIoY-o32oej3ZXmgY.jpg?auto=webp&amp;s=0891e8870e335090d2fd54d1b59c5784bb406ee8"
        },
        "permalink": "/r/realmadrid/comments/1kxdvws/official_kylian_mbappé_is_real_madrid_player_of/"
    },
    {
        "id": "1kxb2dq",
        "author": "Efficient-Growth-390",
        "title": "Fede Valverde's goal catalogue this season is insane.",
        "content": "",
        "upvotes": 2046,
        "comments": 60,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fhe1ar6v6h3f1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kxb2dq/fede_valverdes_goal_catalogue_this_season_is/"
    },
    {
        "id": "1kxg3cv",
        "author": "94Temimi",
        "title": "[Nicolò Schira] Agreement in principle between Real Madrid and Angelo Stiller for a contract until 2030. Real Madrid are now working to reach a deal with Stuttgart. Talks in progress.",
        "content": "",
        "upvotes": 446,
        "comments": 105,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dJmNRn_lnQ2QRghXDMtph0II67TH0Cyz8UAKKAlbo7g.jpg?auto=webp&amp;s=cd6434e882795fc130d7ae5b7848f5350387bd79"
        },
        "permalink": "/r/realmadrid/comments/1kxg3cv/nicolò_schira_agreement_in_principle_between_real/"
    },
    {
        "id": "1kxers6",
        "author": "muaazmuaaz123",
        "title": "All of Kylian's Goals this season",
        "content": "",
        "upvotes": 520,
        "comments": 24,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/amc34p09ei3f1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1kxers6/all_of_kylians_goals_this_season/"
    },
    {
        "id": "1kxngwd",
        "author": "Thunder_trade",
        "title": "Stats comparison between kroos , lukitha and stillar .",
        "content": "\n- Toni Kroos: (Real Madrid, 23/24)\n- Luka Modric: (Real Madrid, 24/25)\n- Angelo Stiller (Stuttgart, 24/25).\n\n—Stillar is the best option for us rn I think , he have done great in bundesliga and also kroos have  recommended him to Real Madrid . He can play those passes which we lack in the midfield .",
        "upvotes": 157,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ariacij88k3f1.jpeg?auto=webp&amp;s=730e17805add9d25f1b93c6151481d53b71ba35e"
        },
        "permalink": "/r/realmadrid/comments/1kxngwd/stats_comparison_between_kroos_lukitha_and_stillar/"
    },
    {
        "id": "1kxbvdd",
        "author": "94Temimi",
        "title": "On this day, Real Madrid won the 3rd, 11th and 14th Champions League titles",
        "content": "",
        "upvotes": 848,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7ftv2xujgh3f1.png?auto=webp&amp;s=d4227e3f45c23c977393540fe54e8023427df26b"
        },
        "permalink": "/r/realmadrid/comments/1kxbvdd/on_this_day_real_madrid_won_the_3rd_11th_and_14th/"
    }
]