[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 51,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l3nfpt",
        "author": "SketchyFella_",
        "title": "I HATE the new layout...",
        "content": "I have been saying for YEARS that Netflix has the best layout of any streaming service and have been annoyed that other streaming services have an inferior layout. Now, Netflix seems to be copying other services rather than the other way around. Why? Does anyone here actually like seeing fewer options on the screen? When you go to your list, rather than seeing multiple rows of all the things you like to watch, not you have to scroll endlessly to make it through what used to be a single screen's worth of content info. I hate this.\n\nSeriously though, does anyone know why? Are there metrics that make this make sense?",
        "upvotes": 83,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1l3nfpt/i_hate_the_new_layout/"
    },
    {
        "id": "1l306ge",
        "author": "Sweaty-Toe-6211",
        "title": "‘Adolescence’ Beats ‘Stranger Things 4’ to Become Netflix’s No. 2 Most-Watched English-Language Series Ever",
        "content": "",
        "upvotes": 146,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1l306ge/adolescence_beats_stranger_things_4_to_become/"
    },
    {
        "id": "1l35moc",
        "author": "RIP_Golden_Boy",
        "title": "New interface introduced on Roku yesterday - hands down the WORST of all other streaming services I have",
        "content": "As described in the title, I opened Netflix on Roku yesterday to an announcement of the new UI and how wonderful it would be, etc., etc.\n\nDamn, is it ever bad. Of course, the \"worst\" label is 100% subjective and just one person's opinion. But, for me, it is objectively less usable than before. Its cramped design actually gives me a slight sense of clostrophobia to the point where I actively dislike being in the app. I find it very unwelcoming. \n\nWhen I open Netflix, most of the time I'm not going to in to watch anything in particular. I like browsing and hunting for something that, based on the title and/or image, I think might interest me. I've heard a lot of people complain about the quality on Netflix but there are still quite a few gems that I would often stumble on. The Residence and The Gentlemen are perfect examples of this - shows that I liked that I came across while scrolling through the app and hadn't previously heard of. \n\nThe new interface makes this process much more difficult. It's much easier to visually scan a screen with a lot of items and scroll when necessary. When you see something you might like you can choose to explore further and then look at the details.   \n\nNow, you are hit in the face with details of a single show taking up a large part of the screen that, odds are, you don't care anything about with a handful of other shows around the edges. \n\nGiven my typical use of Netflix, it will now take me much longer to find something than it did before. And given how being in the app makes me feel like I'm in a box, I can see my usage dropping significantly. Cancelation is likely right around the corner. \n\nFirst world problem, I know, but I only have so much money to go around. It doesn't make sense to spend it on something that will likely now sit idle most of the time. \n\nOk, rant over. On with my day. \n\nEDIT: I really am curious to hear from people who do like the new UI and what specifically they find better about it. While it's always fun to vent, I would like to hear others' perspectives just in case I'm missing something. ",
        "upvotes": 49,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1l35moc/new_interface_introduced_on_roku_yesterday_hands/"
    },
    {
        "id": "1l3tjj6",
        "author": "NoobAtFaith",
        "title": "Is there a way to force a higher bitrate/resolution on the Windows 11 Netflix app?",
        "content": "I have already set my playback settings to \"high\" (highest quality available), but certain movies are only streaming at 960x540 resolution. All other devices on the same wi-fi network are able to play all movies at full 1080p resolution. Is there a setting or keyboard shortcut that will let you manually select a bitrate/resolution?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l3tjj6/is_there_a_way_to_force_a_higher/"
    },
    {
        "id": "1l3ophs",
        "author": "BeingCynical",
        "title": "Shows like Secrets We Keep",
        "content": "And no, not the Harlan Coben ones, watching Missing You and its gone from bad to worse the last couple years. \n\nLanguage- any , as long as there’s english audio or worse case, english subtitles. \n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l3ophs/shows_like_secrets_we_keep/"
    },
    {
        "id": "1l3onuk",
        "author": "TerrytheMerry",
        "title": "Anyone else having random things pop up in their continue watching? No unauthorized access in device history.",
        "content": "The Bee Movie of all things just appeared at the front of my continue watching. I have not watched it in years, the only other person on my account has not even seen the movie before and would not watch it. Looking back through I also found Us between two recent watches. Again I watched it at some point but I have not seen it recently and the other person hates horror movies. I checked my device history and it’s only my stuff, no outside devices. Anyone else experiencing this?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l3onuk/anyone_else_having_random_things_pop_up_in_their/"
    },
    {
        "id": "1l3gewg",
        "author": "JanDaNinja14",
        "title": "Lost in Starlight english soundtrack",
        "content": "I watched, and fell in love with the movie Lost in starlight. (Watched it in english dub) And imedietly after finishing the movie, I checked for the soundtrack on YT and Spotify. I can't seem to find an english version of the songs tho??? All the music was dubbed in english on Netflix, but in the soundtrack it's in Korean.\n\n  \nDoes anyone know where I can find the songs in english? Im specifically looking for Bovoyage, it's the song I loved the most in the movie. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l3gewg/lost_in_starlight_english_soundtrack/"
    },
    {
        "id": "1l38eg0",
        "author": "Educational_Still_51",
        "title": "Covid-19 show cancelations",
        "content": "Shows like “The Society”, “I Am Not Okay With This” , “GLOW” and more were cancelled a while (years) back due to the COVID pandemic and have yet to be renewed.  I feel like Netflix should consider renewing these shows again as they were originally renewed but the decision was reverted due to the pandemic.  Would love to know the community’s thoughts about this and if Netflix should revive these shows that were originally renewed for at least 1 more season.  One major flaw about this i can think of is casting back the same casts for these shows because they might have projects currently so filming would be difficult to plan and also different looking casts (with them looking older than what their characters are suppose to be, though Stranger Things managed to make that work).  ",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l38eg0/covid19_show_cancelations/"
    },
    {
        "id": "1l39n2x",
        "author": "HehroMaraFara",
        "title": "Power Moves with Shaquille O’Neal",
        "content": "A mile wide and centimeter deep. \n\nDon’t watch it, I’ll summarize it:\n\nOne big commercial for a busted shoe brand with less than 1% market share in the ONLY market they are in. \n\nWatch it if you want to hear about the up and coming lifetime G Leaguers, or at best 5 years on the bench guys. If I were SGA, I’d sue them for pretending they even had a chance at signing him. \n\nIf you subtract the bad rap tracks, useless placating of Shaqs ego and nobody’s bragging in themselves. It’s 15 minute episodes. ",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l39n2x/power_moves_with_shaquille_oneal/"
    },
    {
        "id": "1l340xw",
        "author": "Aromatic_Location",
        "title": "New UI",
        "content": "Is the New and Upcoming category still in the new UI somewhere? Every week I go through what will be released in the next week, and add it to my list if it's interesting. But I couldn't find it last night when I tried using the new UI for the first time. Their recommendations and categories that they show are broken. For example they really want me to watch Korean dramas. I've never shown any interest in any foreign language show, so I don't know why it would be a suggested category. That's why I just use my watchlist. But I can't find anything with the new UI. I need the new and upcoming so I can bookmark shows I want to see.",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l340xw/new_ui/"
    },
    {
        "id": "1l2tlqw",
        "author": "Northeast4life",
        "title": "Animal Kingdom.. how is this the first time I’m seeing or hearing about this show.",
        "content": "Maybe it’s the lack of decent shows on Netflix recently but after 4 episodes I’m hooked. And how is this the first time I’ve heard of this show. It’s amazing!",
        "upvotes": 56,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1l2tlqw/animal_kingdom_how_is_this_the_first_time_im/"
    },
    {
        "id": "1l36nuk",
        "author": "theipaper",
        "title": "Ginny and Georgia season 3 release date, cast and episode guide",
        "content": "",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l36nuk/ginny_and_georgia_season_3_release_date_cast_and/"
    },
    {
        "id": "1l3gfl6",
        "author": "DarthDavid1996",
        "title": "What is love from bet series",
        "content": "Any one who the title and artists who sing this version on what is love? Ep 7 the hunt\n\nBeen trying to find it and haven't had any look?\n\nWould really appreciate any help!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l3gfl6/what_is_love_from_bet_series/"
    },
    {
        "id": "1l3g62x",
        "author": "SimilarSwim8090",
        "title": "What are your thoughts on the new Frankenstein movie by Guillermo del Toro",
        "content": "Seems like an interesting twist on it. and it seems to have a decent cast. idk though it looks like it would be good to see in theaters, not complaining though. I cant really tell what it’s about based off the trailer yet though. Anyways, thoughts? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l3g62x/what_are_your_thoughts_on_the_new_frankenstein/"
    },
    {
        "id": "1l3furw",
        "author": "truescotsman",
        "title": "Has anyone tried Games on TV?",
        "content": "Thinking of playing games with my wife using my Chromecast dongle and our phones.  We've played jackbox games before but it felt tedious to setup.\n\nHas anyone tried any of the games on TV?  Any recommendations?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l3furw/has_anyone_tried_games_on_tv/"
    },
    {
        "id": "1l3f98h",
        "author": "megamacior",
        "title": "'Flickering' during watching",
        "content": "**Hi all!**  \nThis issue is driving me crazy. For the past couple of weeks, I've been experiencing screen skipping or flickering when watching Netflix — both in the app and in Chrome. Everything works fine when I use Firefox.  \nI'm using an AMD Ryzen 7 7840HS with Radeon 780M Graphics.\n\nHelp! :)",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l3f98h/flickering_during_watching/"
    },
    {
        "id": "1l2pwts",
        "author": "paharibilli",
        "title": "Four seasons",
        "content": "ok so i started watching this out of boredom and but im so pleasantly surprised. 19F here and im pretty sure im not exactly the targeted audience but i feel like if i had to compare it with white lotus (dont come at me for this u cant deny the parallels) this ones better? also the point where i really started liking the show was nicks daughter lilas play. Netflix really needs to up its game waise most of the shows dont hit the same anymore \n",
        "upvotes": 47,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1l2pwts/four_seasons/"
    },
    {
        "id": "1l3ib24",
        "author": "SoStarVa",
        "title": "Dept Q glaring questions",
        "content": "I have not found these discussed anywhere and I can’t get them out of my head. Do here goes\n\n1. Merritt is implied to have been kidnapped by Lyle from the ferry (they frustratingly never clear this up explicitly) because she trusts him as being Sam. But in one of the scenes in the last/penultimate episodes she is surprised to see him. I think it’s the scene where Lyle is revealed to be Merritt’s “Sam”. Is this is a loophole or did I miss something?\n\n2. And this one is just a curious choice by the writers - why did Lyle need to kill Sam? He was not about to find out or anything of Lyle having stolen his identity? I don’t understand the character’s motivations here. Anybody care to explain?",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1l3ib24/dept_q_glaring_questions/"
    },
    {
        "id": "1l3c4nc",
        "author": "Creative-Ad-1363",
        "title": "Netflix on Roku",
        "content": "I'm watching a series and let's say I get to episode 3. I want to go back to watch episode 1, so I go to 'episodes &amp; more', and select episode 1, Netflix kicks me out of the platform. This will happen up to 3 times until Netflix understands that I really want to re-watch episode 1. \n\nWTAF. \n\nWhy is this app so mid when it comes to performance. Basic functions such as re-watching episodes causes errors. Yet they'll increase subscription prices, while there's no additional value in what we're paying for.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l3c4nc/netflix_on_roku/"
    },
    {
        "id": "1l26ugd",
        "author": "iLikeDinosaursRoar",
        "title": "Dept Q",
        "content": "Going to need everyone reading this to please watch this show ASAP. Even if you don't like it, just let it run so Netflix thinks it was watched! Really be a shame not to get a 2nd season. \n\nJust need a few dozen million...thanks.\n\nNot to mention it was a fun crime drama with some enjoyable characters, it's Sherlock Holmes vs House. \"But they are the same!\" Yes yes, but imagine the detective an enjoyable grouch like House but it has all the detective and crime qualities of Sherlock. \n\nGive it a watch or the very least let it run in the background! ",
        "upvotes": 404,
        "comments": 149,
        "media": null,
        "permalink": "/r/netflix/comments/1l26ugd/dept_q/"
    },
    {
        "id": "1l3b0ir",
        "author": "ApplicationNo2375",
        "title": "My 3-year netflix billing glitch-Unpaid subscription-Am i alone?",
        "content": "I experienced a bizarre billing error with Netflix between 2019 and 2021. For 3 years, despite my payment details being active in the app, Netflix never charged me a single rupee, allowing me to stream on both my laptop and phone without interruption. I can only assume it was a persistent glitch, as I never paid for the service during that entire period. It wasn't until my phone crashed and I got a new device that I started paying for Netflix. Interestingly, I was never retroactively billed for those 3 'free' years. Has anyone else encountered such a significant service glitch?",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1l3b0ir/my_3year_netflix_billing_glitchunpaid/"
    },
    {
        "id": "1l3au2w",
        "author": "jgroove_LA",
        "title": "Director Hwang Teases a \"half happy, half sad\" ending for Squid Game",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l3au2w/director_hwang_teases_a_half_happy_half_sad/"
    },
    {
        "id": "1l3lslg",
        "author": "mangoluvr04",
        "title": "netflix is so dumb for canceling grand army",
        "content": "\nI understand COVID happened but they should’ve just paused production like everyone else and come back when they can. This show is really good, and it’s not enough to just pretend Joey gets justice—I actually need to see it. And that girl who had to get married? I feel like she’s going to fall for her new husband, and that love triangle would’ve been so intense. Ugh, I’m with you!",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l3lslg/netflix_is_so_dumb_for_canceling_grand_army/"
    },
    {
        "id": "1l2hdqx",
        "author": "ProbablyHere4Help",
        "title": "Netflix’s interface is AWFUL and permanent. Best part: you can’t leave feedback anywhere!",
        "content": "I could be wrong but wouldn't less title visibility induce quicker scroll fatigue? I have no desire to hunt for new titles and the once PERFECT interface now resembles all the others. Might as well spread my time and money elsewhere now that there's no difference in how annoyed I get navigating these streaming apps. \n\nYeah, most people are naturally resistant to change but this is probably their worst decision yet. I've been actively trying to avoid this ugly layout by keeping my testing feature off but I guess it's here to stay.\n\nI hope Netflix considers revising toward something that feels more like Netflix but my expectations are in Hell.",
        "upvotes": 59,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1l2hdqx/netflixs_interface_is_awful_and_permanent_best/"
    },
    {
        "id": "1l2gb8o",
        "author": "chrisarrant",
        "title": "Queen's Gambit creator mixes Scandi Noir with UK crime shows like Prime Suspect for Netflix's Dept. Q (with a side of Matthew Goode)",
        "content": "",
        "upvotes": 59,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1l2gb8o/queens_gambit_creator_mixes_scandi_noir_with_uk/"
    },
    {
        "id": "1l36rj4",
        "author": "Adityabutterchicken",
        "title": "Looking for a meaningful, touching movie or series.",
        "content": "A series or show where someone reminiscents about past life or visits past town etc, or about self discovery or finding happiness after struggle. \nNeed not be romantic. Any language welcomed. ",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1l36rj4/looking_for_a_meaningful_touching_movie_or_series/"
    },
    {
        "id": "1l3k65y",
        "author": "MotherTry1411",
        "title": "In defense of Stranger Things – y’all are missing the point",
        "content": "I’ve seen too many people trashing Stranger Things lately, and honestly, it’s frustrating how much they miss the point. Yes, the story went beyond the original mystery, but Season 4 added deep, smart lore that tied everything together — without it, the Upside Down would just feel like some random spooky thing. People say Mike lost his charisma, but that’s called growing up. They’ve seen death, trauma, and government chases — this isn’t a cartoon. You want eternal energy? Go watch Luffy. As for the relationships, okay, some feel a bit forced, but the story isn’t about romance — it’s about monsters destroying a town. And the long episodes? That’s part of the magic. Every second in Season 4 matters. The “too many characters” complaint is ridiculous too — it’s the freaking apocalypse, not a cozy drama, and most new characters are actually amazing (Eddie? Robin?). People say it repeats the same formula, but so do most great shows — One Punch Man blows up a city every episode and no one cries about that. Don’t like it? Don’t watch. Complaints about tone (“too funny for horror”) ignore what makes the show unique: a perfect blend of creepy, emotional, and nostalgic. And the ‘80s vibes? It’s not nostalgia bait — that’s literally when the show takes place. It all fits. At the end of the day, this show is smart, emotional, and clearly made with love. If you’re too busy trying to sound like a film critic with 4 Godfather posters in your room, maybe Stranger Things just isn’t for you. The rest of us are still blasting “Running Up That Hill” and crying over Max.\n",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1l3k65y/in_defense_of_stranger_things_yall_are_missing/"
    },
    {
        "id": "1l2z9p3",
        "author": "ThrowALifeline89",
        "title": "For anyone looking to fill the gap that the cancellation of 'Heartstopper' left: check out 'Smiley*",
        "content": "A lot of people loved *'Heartstopper'* and are understandably broken up about the show not getting renewed. **But** there is one shimmer of hope: *'Smiley'* is a netflix show from a few years ago that did not make a big splash **(sadly**) that has a lot of the same appeal however. If there is one thing that people liked to criticise about *'Heartstopper'* it is that it's a bit \"too clean and whimsical\" (not my opinion just something that I saw online a few times). Now *'Smiley'* is definetely more raunchy and adult oriented.\n\n  \n\\[Yes, I know there is movie supposedly coming out next year to wrap up things with Charlie &amp; Nick - but that is likely more than a full year away\\]. Anyhoo, I hope this post can get people to give *'Smiley'* a well deserved watch and bring some happiness to the world. Bye!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l2z9p3/for_anyone_looking_to_fill_the_gap_that_the/"
    },
    {
        "id": "1l3asxo",
        "author": "shitshow2235",
        "title": "is it possible to change thumbnails for netflix films and shows?",
        "content": "There are lots of movies on netflix that I like. However, the thumbnails sometimes change to something boring that I don't like. As in, just a character's face. Lots of times, the films thumbnail won't have much to look at other than a random persons face which sucks out any incentive to watch it. Is there a way to turn this off?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l3asxo/is_it_possible_to_change_thumbnails_for_netflix/"
    },
    {
        "id": "1l2uy1r",
        "author": "Southern-Brother5693",
        "title": "The \"Coming This Week\", \"Wait For It\" Features are missing",
        "content": "Just received the new Netflix UI design today on my Sony Bravia TV.\n\nI liked it as a whole. The layout looks more fluid and more streamlined. The suggestions feel more on point as well. I wish there were a way to immediately scroll up to the top of the page, though using the back button.\n\nMy biggest issue is that the \"Coming This Week\", \"Coming Next Week\" and \"Wait For It\" bars are all gone now. There is no longer any easy way to keep track of what is coming in the future and set reminders.\n\nI hope Netflix rectifies this in the future. But on a positive note, let me say again I like the new UI design.",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l2uy1r/the_coming_this_week_wait_for_it_features_are/"
    }
]