[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 563,
        "comments": 4307,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1ndtq67",
        "author": "ProteinPapi777",
        "title": "What is a film series you watched where you just couldn’t stop yourself from clicking “next episode”",
        "content": "I really want to find film series where every time I finished an episode I just couldn’t stop myself from going for the next episode even tho I should have been sleeping or something that’s how much I was excited what was gona happen. I honestly only felt that for 3-4 film series’:\n\nMoney heist\n\n\nBreaking bad\n\n\nBetter call Saul\n\n\nSquid game\n\n\n\n(I know, I am basic)\n\nSo what is a film series where you did/felt the same way?",
        "upvotes": 133,
        "comments": 390,
        "media": null,
        "permalink": "/r/netflix/comments/1ndtq67/what_is_a_film_series_you_watched_where_you_just/"
    },
    {
        "id": "1ndyzg8",
        "author": "Pretend_Mark_5143",
        "title": "I loved Wednesday Season 1 but this second season is so annoying to me.",
        "content": "The first season had all the charm anyone could want in a show like this. It was quirky with a darker tone and I greatly enjoyed all the slight nods to the original Addams Family. It seemed like such a strong show. Every episode was good until the season final which I felt was a little over the top and lame. I thought it would pick back up for season two but my gosh was I wrong. The episodes are uncreative and unnecessarily long and to my dissatisfaction all the characters were butchered to an extreme. It hurt so bad to witness Eugene and Pugsley spend all there time causing issues with Slurp. Also, don’t expect Wednesday to show any signs of improvement she seemed to have sorta gained at the end of the first season. Not only is that work erased but it actually feels like it’s declining steadily. It’s like she’s supposed to be a badass but her character seems to have a bad case of main character syndrome. Bringing Tyler back to continue being a whiny jerk was not pleasant either and it was made worse for leaving Zavier out. Don’t even get me started on the writing. It’s some of the cringiest stuff I’ve heard in a while. This is a lot of negative stuff but I can say some good things about the show too. Season 2 was mildly entertaining. Oh, wait. That’s all I’ve got. Feel free to disagree with my opinion but for me this season was a joke.",
        "upvotes": 12,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1ndyzg8/i_loved_wednesday_season_1_but_this_second_season/"
    },
    {
        "id": "1ndkken",
        "author": "RoboticStaticShock",
        "title": "What will scare me shitless?",
        "content": "I need horror suggestions that will fuck me up and scare me. I am not an easily scared person when it comes to movies but I wamna watch something deeply creepy.  I love psychological thrillers.  I also have prime if that helps.  Thank you!!!",
        "upvotes": 52,
        "comments": 156,
        "media": null,
        "permalink": "/r/netflix/comments/1ndkken/what_will_scare_me_shitless/"
    },
    {
        "id": "1nddsmr",
        "author": "punchtheface",
        "title": "Kaos - What a disappointment!",
        "content": "Not in the show of course, but disappointed I am to hear it was cancelled and we may never reach a conclusion. I loved every minute of it. It was such an authentic and original take on a story as old as we can remember.\n\nThe cast was amazing, every character was so rich and engaging I could not honestly pick a favourite… apart from Dionysus of course.\n\nI was wondering what the majority of people felt about it though, it appears to not have drawn in the audience numbers to keep going.",
        "upvotes": 105,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1nddsmr/kaos_what_a_disappointment/"
    },
    {
        "id": "1ndwnia",
        "author": "Corrupt_Echo",
        "title": "What’s a good show or movie series for a 13YO Boy",
        "content": "LF something decent - have seen raising Dion, and a few others and now looking for a new show to binge or just watch even if it’s in a different series",
        "upvotes": 7,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1ndwnia/whats_a_good_show_or_movie_series_for_a_13yo_boy/"
    },
    {
        "id": "1ne0qi7",
        "author": "Repulsive-Dog3371",
        "title": "Aka Charlie Sheen",
        "content": "I loved this two part docuseries! Of course most of his fallouts have occurred in the public eye. But at the end of the series, he lets out a wild secret and I loved that for him! I hope he stays with his sobriety. \n\nI also didn’t realize that there is another brother in the clan, while Emilio and their dad Martin are not a part of this, the other brother is. ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ne0qi7/aka_charlie_sheen/"
    },
    {
        "id": "1ne1ms8",
        "author": "Parking_Honeydew2523",
        "title": "pausing subscription",
        "content": "i applied a gift card to my netflix account when i signed up, and it auto applied 2 months worth so my subscription lasts until oct 22. is it possible for me to pause sep 22 and resume oct 22 so the subscription runs aug 22-sep 22 and oct 22-nov 22? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ne1ms8/pausing_subscription/"
    },
    {
        "id": "1ndu6se",
        "author": "Deanno0",
        "title": "Need a good series to watch that is actually entertaining!",
        "content": "Please list something that is actually entertaining to watch and somewhat addicting . So hard to find something decent to watch that actually catches my attention !! Just list your favorites from best to worst don’t need to go into detail . Thanks netflixers!",
        "upvotes": 5,
        "comments": 123,
        "media": null,
        "permalink": "/r/netflix/comments/1ndu6se/need_a_good_series_to_watch_that_is_actually/"
    },
    {
        "id": "1ndr9ky",
        "author": "Wonderful_Cost4856",
        "title": "Autumn Vibes Only — Best Netflix Series &amp; Movies to Cozy Up With?",
        "content": "Hey everyone!\n\nWith autumn almost here, I’m on the hunt for the **perfect Netflix series or movies** that give off those cozy, warm, and slightly nostalgic vibes. Think falling leaves, rainy afternoons, blankets, and hot coffee.",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1ndr9ky/autumn_vibes_only_best_netflix_series_movies_to/"
    },
    {
        "id": "1ndzf84",
        "author": "insightwithdrseth",
        "title": "Why Smart, Successful Women Fall for Love Scams: A Psychologist Breaks I...",
        "content": "Have you seen Love Con Revenge? Don't judge these women.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ndzf84/why_smart_successful_women_fall_for_love_scams_a/"
    },
    {
        "id": "1ndfz91",
        "author": "hestooopinionated",
        "title": "Love Con Revenge Is A Joke",
        "content": "I thought this documentary series was a joke and I was surprised to Cecilie again, but I guess she would be an expert in this subject since she willingly gave away all her money too. ",
        "upvotes": 8,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9t6v8f4hmcof1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ndfz91/love_con_revenge_is_a_joke/"
    },
    {
        "id": "1ndm513",
        "author": "SlightlyBoringCat",
        "title": "yo i watched never have i ever",
        "content": "real good and fun to watch. teenage stuff and all shown good. Would recommend to people who're looking for something not too serious and will make them feel good.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ndm513/yo_i_watched_never_have_i_ever/"
    },
    {
        "id": "1ndku4i",
        "author": "Serious_Share_2381",
        "title": "Just watched Two Graves",
        "content": "I absolutely loved it! Very satisfying mini-series. Seems like nowadays it's hard to find something that would keep my attention but they succeeded.\nMy strong recommendation if you like a good European thriller.\nBtw is there anything similar that I could watch on Netflix?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ndku4i/just_watched_two_graves/"
    },
    {
        "id": "1nczjt7",
        "author": "CitygirlCountryworld",
        "title": "Need a Recommendation to watch as a couple that husband likes",
        "content": "Hey all, \nWhat do you recommend my husband and I watch next. (It doesn’t even have to be Netflix). My husband liked: \n- Justified \n- Yellowstone/1923 (1889 was too dreary) \n- Reacher \n- Prison Break \n- Outlander \n- Ozark\n- American Primeval \n- Narcos\n- Queen of the South \n- Landman \n- Tulsa King\n- We couldn’t get into Breaking Bad but could try again. (Life interfered and then we got out of it) \nPlease give any suggestions you might have for us! :) \n\n ",
        "upvotes": 37,
        "comments": 279,
        "media": null,
        "permalink": "/r/netflix/comments/1nczjt7/need_a_recommendation_to_watch_as_a_couple_that/"
    },
    {
        "id": "1ncxa7b",
        "author": "harshdavra",
        "title": "Just watched Sweet Bobby: My Catfish Nightmare and I’m mind blown",
        "content": "I just finished watching Sweet Bobby and I’m shocked. How is it even possible for someone to catfish like this for years without being caught?\n\nThere are things that just don’t add up. Bobby supposedly lived only about an hour away from Kirat yet she never managed to meet him in person or even properly google him? In today’s world that feels almost impossible.\n\nAnd then the layers of fake accounts, the endless lies, the way he kept the story alive for so long… it’s wild. Was there someone else involved helping him cover tracks? Or was Bobby just that good at manipulation?\n\nAlso makes me wonder how many red flags got ignored or brushed off. Did he have access to some kind of insider info about her life? How did he always know what to say to keep her hooked?\n\nHonestly it almost feels bigger than a one-person catfish. Either he was way too clever or there’s more to the story that’s never been revealed.\n\nAnyone else feel like some pieces are missing here?",
        "upvotes": 38,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1ncxa7b/just_watched_sweet_bobby_my_catfish_nightmare_and/"
    },
    {
        "id": "1nddxn0",
        "author": "Official_vegito",
        "title": "Exciting titles upcoming on Netflix",
        "content": "Hi, is anyone aware of the upcoming exciting shows on Netflix? I am specifically looking for crime thriller based shows which may be coming up on Netflix exclusively ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nddxn0/exciting_titles_upcoming_on_netflix/"
    },
    {
        "id": "1ncn0hz",
        "author": "ZestycloseFig4025",
        "title": "Ever wish your doctor explained things like Shaun does?",
        "content": "I been watching The Good Doctor and it really got me thinking about how rare it is to have a doctor who actually takes the time to explain things clearly. Shaun walks patients through their options breaks down complicated medicalinfo and never talks down to them its the kind of care a lot of people just don’t experience in real life. Most appointments I had feel rushed Lab results get thrown at me with no explanation or I get a quick everything looks fine with zero context. It leaves a lot of questions hanging and makes it hard to know what to do next or what even matters.Thats part of what led me to try out EurekaHealth. It’s an AI tool that’s built specifically for health questions not just general chatbot stuff. I use it to make sense of test results, get second opinions based on visit notes, and ask follow up questions I didn’t get to bring up during appointments.  \nWatching The Good Doctor just kind of reinforced how helpful it is to have something that brings that kind of clarity and support into real life even if its through tech.",
        "upvotes": 85,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1ncn0hz/ever_wish_your_doctor_explained_things_like_shaun/"
    },
    {
        "id": "1ndh6th",
        "author": "Top-Three-USA",
        "title": "From Spice Girl to style icon, Victoria Beckham shares her journey in a new Netflix docuseries premiering October",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ndh6th/from_spice_girl_to_style_icon_victoria_beckham/"
    },
    {
        "id": "1ncag2d",
        "author": "powcatnipdoll",
        "title": "The new layout of Netflix is so lame",
        "content": "One of the most iconic things about Netflix was their distinct layout compared to other streaming platforms and now it looks boring, it doesn’t feel iconic anymore, plus the amount of disappointing not good shows, Hulu and Disney hotstar might just be better idk",
        "upvotes": 522,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1ncag2d/the_new_layout_of_netflix_is_so_lame/"
    },
    {
        "id": "1ndsaks",
        "author": "SomethingLikeRigby",
        "title": "Wednesday S2: am I the only one?! Am I being too harsh?",
        "content": "I really enjoyed S1 of Wednesday. It had some flaws, but overall a fun concept and use of the Addams IP. \n\nThis season though… 6 episodes so far, and it feels like a completely unfocused mess, and I’m considering just checking out. Where the first season had subplots BUT were NECESSARY red herrings &amp; dead ends as part of Wednesday’s investigation, S2 subplots feel all over the place, as though the writers were just winging it because they weren’t sure what they wanted to do. \n\nThere are also WAY too many returning characters we DIDN’T need. And guest spots that don’t feel like the intended nice surprise they’re meant to be IF they were supported by good writing. They feel shoehorned. Especially Weems. I liked her character in S1, but they made their choice killing her off, and should have stuck with that. She now being Wednesday’s spirit guide is a reach too far. \n\nI also find it perplexing that when Bianca’s power would have been needed at a moment where it could have been life or death for the Nightshades facing Tyler, she doesn’t even attempt to use it. Huh?!?!!?! What about Ajax? When shit hit the fan, he doesn’t attempt to stone Tyler?!\n\nI also take issue with some of the way the Addams are represented here, compared to past media. Yes, the Addams are meant to be creepy &amp; kooky, and part of the gag of The Addams is how off putting &amp; backwards they’re supposed to seem to regular people. But they were NEVER portrayed as bad people, doing bad things, at least to society. The subplot involving Pugsley’s “pet”, and the lack of any genuine remorse from Pugsley &amp; Gomez for the amount of people it’s killed is distasteful. I also dislike that Fester is a lifelong career criminal that escapes any true negative consequences, and even the family don’t take issue with it either. The show handles these sorts of things in a “Yeah? So what?” fashion, and it really rubs me the wrong way. \n\nI am at odds as to whether I bother continuing with the remaining episodes, because if Tyler somehow gets a “redemption &amp; all is forgiven” arc, that will be the straw that breaks the camels back for me. \n\nCredit where credit is due though: Wednesday &amp; Enid having a “Freaky Friday” was great. It really seemed that both actresses had loads of fun playing each other’s respective characters for that episode, and both did a remarkably good job: they totally sold that they had swapped bodies because they had the personalities nailed. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ndsaks/wednesday_s2_am_i_the_only_one_am_i_being_too/"
    },
    {
        "id": "1nd9q1t",
        "author": "-hwaberry",
        "title": "Netflix automatically looping movies?",
        "content": "Recently has anyone else found that netflix is automatically repeating what they just watched? I had Kpop Demon Hunters on the other day while doing something, and then it just played it again, and bc I just had it on in the background I was like okay sure I'll watch it again, and then it looped it a third time, so it seems my netflix will just continually repeat movies now, is it a glitch or a new feature??? I've never had it automatically repeat before so I'm just curious 😂",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nd9q1t/netflix_automatically_looping_movies/"
    },
    {
        "id": "1ndds2r",
        "author": "youryoungversion",
        "title": "Cobra Kai 🐍",
        "content": "I just finished watching the entire 6 seasons in just 2 days. Man, what an amazing series. Loved everyone’s role.\n\nIt does make you feel badass from the get go! #CobraKaiNeverDies 👊🏻",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ndds2r/cobra_kai/"
    },
    {
        "id": "1nd4iyt",
        "author": "steffi8",
        "title": "Downloaded content survives an upgrade to iPadOS26?",
        "content": "I'm traveling at the moment and have content downloaded on my iPad but I don't want to upgrade iPadOS to iPadOS26  if there's any chance that the content may no longer work afterwards. Does Netflix have any history of invalidating (intentionally or otherwise) downloaded content due to iPadOS upgrades?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nd4iyt/downloaded_content_survives_an_upgrade_to_ipados26/"
    },
    {
        "id": "1ndpg41",
        "author": "Usual_Maintenance885",
        "title": "Ya'll see it right?",
        "content": "He's a fictional character but he looks like he would fit right in with that family. Greasy hair included. Beal City reminds me Mare of Easttown a small shitty town were people need to leave asap.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ndpg41/yall_see_it_right/"
    },
    {
        "id": "1nd6rxf",
        "author": "zephyr822",
        "title": "Suggestions about \"You\"",
        "content": "Hi everyone. I have been recently thinking about watching \"You\" but I am not sure if it is worth it. The kind of person I am, I always try to avoid shows that are being talked about and created hype for but \"You\" feels like something that resonates with me and I feel it could be a good watch. What are you opinions/suggestions about it? Is it suspenseful?",
        "upvotes": 2,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1nd6rxf/suggestions_about_you/"
    },
    {
        "id": "1nd6hvm",
        "author": "DraterTheTaurus",
        "title": "Any shows like Riverdale?",
        "content": "I really like mystery shows where you’re trying to figure out who the criminal is. But I also really like the drama aspect of shows. Something i didn’t love about riverdale was the over sexualized teenagers but beyond that i really enjoyed the show and the mysteries and the dynamics of all the characters and just the characters themselves. I need more shows similar to that. Please!!",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1nd6hvm/any_shows_like_riverdale/"
    },
    {
        "id": "1nbwkfu",
        "author": "Elegant-Spare6527",
        "title": "Nothing worth watching",
        "content": "Netflix used to be the bomb. For months, and it's getting worse, there is very literally nothing worth watching. Anything new is likely some 3rd rate movie with subtitles and actors you've never heard of. Or passing off as new, movies from years ago. Used to look forward to checking each day for something good (and there was always something new). Now. Just sucks! What happened?! ",
        "upvotes": 605,
        "comments": 181,
        "media": null,
        "permalink": "/r/netflix/comments/1nbwkfu/nothing_worth_watching/"
    },
    {
        "id": "1ncrvfx",
        "author": "Ami_geas0111",
        "title": "Dept Q",
        "content": "So in Netflix’s Dept.Q, Merritt’s kidnapping was hinted to be tied to corruption and pressure from powerful people. Same with Sam Haig’s case getting closed as suicide while other evidence suggested otherwise. But by the end it feels like that whole corruption angle related to the kidnapping is just dropped. Did I miss something, or is this just a loose end the show never explained?\n\n",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ncrvfx/dept_q/"
    },
    {
        "id": "1ndc4cl",
        "author": "NiceChokra",
        "title": "Many of you don't know but Dr. Jack Abbott is elder brother of Colonel Carrillo.",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ndc4cl/many_of_you_dont_know_but_dr_jack_abbott_is_elder/"
    },
    {
        "id": "1ncx3v1",
        "author": "LouisTully9000",
        "title": "Chaos, Brothers, and Black Rabbit Stew on Netflix",
        "content": "Netflix, ever the overeager valedictorian of the Streaming High School Class of 2025, continues its tradition of slamming down original series the way an overcaffeinated sous-chef slams espresso shots before brunch service. Every month, the platform releases a new parade of shows, documentaries, and limited-run experiments that suggest some poor junior executive has a spreadsheet labeled “CONTENT = GOD.” And you know what? It works. The business is good. The business, in fact, is booming.\n\nThe streamer has always had a soft spot for Jason Bateman, who, after perfecting the art of deadpan futility on ***Arrested Development***, decided to go full Walter White Lite with ***Ozark****,* a show so darkly violent it made money laundering look almost quaint. Bateman didn’t just star in it; he co-created, directed, and sprinkled his Bateman-brand sardonic seasoning all over it. That partnership was too profitable to end with ***Ozark***, so naturally, Netflix backed the truck up for another project. One that feels like ***Ozark*****’s** younger, cooler, slightly better-dressed sibling.\n\nEnter ***Black Rabbit***, an eight-episode limited series created by Zach Baylin, who previously wrote ***King Richard***, ***Creed III***, and ***The Order***. This time, Bateman teams up with Jude Law for a story about estranged brothers, set against the backdrop of a Manhattan hotspot so exclusive that you, yes you, will never get a reservation no matter how many points you’ve hoarded on Resy...",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ncx3v1/chaos_brothers_and_black_rabbit_stew_on_netflix/"
    }
]