[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1mm3jx9",
        "author": "Quentin_T84",
        "title": "Luna dello Storione",
        "content": "Scatto amatoriale della🌛 dello Storione. Volvera (TO) 10/08/2025",
        "upvotes": 11,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wqdzr31yw2if1.jpeg?auto=webp&amp;s=39bac8f8804390b42d68673fd93fa3f6a5a4b801"
        },
        "permalink": "/r/torino/comments/1mm3jx9/luna_dello_storione/"
    },
    {
        "id": "1mmc1tm",
        "author": "borisbanana77",
        "title": "Torino's Questora vs. UniTo students",
        "content": "It seems like recently the Questora in Torino changed the needed documents to apply or renew students' Permesso di Soggiorno.\n\nUp until now, they required a simple approval (self-declaration) from UniTo that the student is enlisted for the following semester or year.\n\nThey now \\*allegedly\\* require that document to be officially sign, which costs 32 euros (!!!) and getting it as a signed copy takes quite a few steps.\n\n  \nDid you recently go through the process of \\*newing\\* a Permesso di Soggiorno and a student from University of Torino?  \nI suspect it might be related to the country of origin of students. If you will, please share what passport you hold.\n\n",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1mmc1tm/torinos_questora_vs_unito_students/"
    },
    {
        "id": "1mmcrcj",
        "author": "farouchska",
        "title": "how easy to meet people in torino?",
        "content": "Hi! I am 23yo, I am german and thinking about moving to Torino for 6 months (I work remote but with an Italian contract so I gotta live in Italy). I was wondering how easy it is to meet other young people In Torino. I have lived in cities like Brussels where the overall vibe is vibrant and there is always something to do, people to meet, etc, and I really love this vibe. Therefore I was wondering how living in Torino would be regarding this aspect. Is there a big european/international scene? Thank you in advance for any answers! :)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mmcrcj/how_easy_to_meet_people_in_torino/"
    },
    {
        "id": "1mm4yvd",
        "author": "Hot-Garage-4536",
        "title": "Giornata estetista",
        "content": "Buongiorno a tutti,\nvorrei un consiglio per un regalo. \nVorrei fare a una mia amica una giornata di massaggi, cura del viso, unghie, piega ecc… in cui la trattino bene e si possa riposare. C’è un posso che offra questi servizi a Torino e che li gestisca bene? Magari facendomi pagare un pacchetto e non tanti servizi separatamente?\nGrazie per l’aiuto, spero esista qualcosa di questo tipo :,,)",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mm4yvd/giornata_estetista/"
    },
    {
        "id": "1mm18pt",
        "author": "Murky-Ad3318",
        "title": "Furto (ennesimo) Cellulare",
        "content": "Ciao a tutti e la prima volta che scrivo, ma leggo sempre tutti, volevo raccontare un episodio accaduto oggi, tra corso 11 Febbraio e via Pisano, ho assistito al furto di un cellulare. Il ladro è scappato a piedi verso Porta Palazzo; alcune persone hanno provato a inseguirlo in auto e un tizio con la moto, ma si è dileguato.\n\nIo e la mia fidanzata siamo rimasti fermi, io bloccato dal pensiero: e se lo inseguo e poi mi ritrova sotto casa? Vivendo nello stesso quartiere, la paura non è irrazionale.\n\nDa un lato rabbia e frustrazione per non aver fatto nulla, dall’altro ammirazione per chi ci ha provato.\nVoi cosa avreste fatto? Vale la pena rischiare o è meglio pensare prima alla propria sicurezza?\n\n(Premetto che da casa ne ho sentiti altri, la classica ragazza che urlava aiuto al cellulare, ma oggi è stato diverso, da oggi il telefono resta sempre in tasca davvero)",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1mm18pt/furto_ennesimo_cellulare/"
    },
    {
        "id": "1mm2t0k",
        "author": "Flat-Message6872",
        "title": "Vendita di repliche",
        "content": "Salve, sto pensando di comprami qualche vestito replica/falso ma il problema che non saprei dove cercare, forse in alcuni mercatini ma non si trova nulla oltre roba da anziani, conoscete qualche posto/zona che vende roba falsa",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mm2t0k/vendita_di_repliche/"
    },
    {
        "id": "1mlxcg3",
        "author": "Pisellino_Sbarazzino",
        "title": "Consigli per toccata e fuga di 2 giorni a Torino",
        "content": "Buongiorno a tutti, io e la mia ragazza abbiamo deciso di fare una toccata e fuga a Torino di un paio di giorni.   \nArriveremo in treno il 30/08 in tarda mattinata e andremo via attorno alle 15 il 01/09.\n\nIl piano in linea di massima è:\n\n* 30/08 pomeriggio: mole e museo del cinema\n* 31/08 mattina: museo egizio; pomeriggio: musei reali di palazzo reale (o viceversa)\n* 01/09 mattina: consigli?\n\nVolevo inoltre chiedervi dei consigli su dove andare a mangiare spendendo poco o relativamente poco: sia piccoli ristorantini/trattorie tipiche che fast food ignoranti del posto.\n\nSono aperto a consigli.\n\nGrazie :)",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1mlxcg3/consigli_per_toccata_e_fuga_di_2_giorni_a_torino/"
    },
    {
        "id": "1mlx4kx",
        "author": "Ok-Wrongdoer857",
        "title": "Mi servirebbe trovare un tassista con tariffario fisso.",
        "content": "Di recente un ragazzo mi ha mostrato un tabellario di un tassista “su Telegram” ma poi ci siamo distratti in altri discorsi e ho dimenticato di prendere il numero del tassista. Se qualcuno conosce soluzioni simili potrebbe girarmi il contatto?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mlx4kx/mi_servirebbe_trovare_un_tassista_con_tariffario/"
    },
    {
        "id": "1mm9eo5",
        "author": "ironspider89ITA",
        "title": "Conoscere donne a Torino",
        "content": "Mi piacciono le donne mulattine, piccole e profumate. Quelle donne che appena le guardi ne rimani imbambolato, che con un solo sguardo ti stendono di quanto sono belle ed ammalianti.\nLe donne sono tutte stupende, amatele e fatele sentire bene mi raccomando. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mm9eo5/conoscere_donne_a_torino/"
    },
    {
        "id": "1mlvwoo",
        "author": "glorious-ahole",
        "title": "Need recommendations to go somewhere during vacation",
        "content": "Hey everyone I've been in turin for 3 months now and now that there are holidays, I was thinking of going somewhere(not necessarily in italy) but im not sure where...also since it's going to be very hot this week, I'm looking for somewhere which is cold so probably in mountains. Also if you have any suggestions for turin, I would love it too. As of now I've been to Superga, Egyptian museum, mole, maddalena, Lavazza museum, capuccini, sacra di San Michele, susa.\n\nGrazie mille",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1mlvwoo/need_recommendations_to_go_somewhere_during/"
    },
    {
        "id": "1ml7l7g",
        "author": "BrutalSock",
        "title": "Cerco una porta come questa",
        "content": "Ciao a tutti. Stiamo ristrutturando casa e vorremmo tanto ripristinare una porta che purtroppo è stata cambiata anni fa. Le altre porte dell’alloggio sono queste. Se qualcuno può aiutarci ve ne saremo eternamente grati ☺️ ",
        "upvotes": 36,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fdr0lbvi5vhf1.jpeg?auto=webp&amp;s=b07367b2e937d73417f639d2e997921d385bd70e"
        },
        "permalink": "/r/torino/comments/1ml7l7g/cerco_una_porta_come_questa/"
    },
    {
        "id": "1ml9uvb",
        "author": "MouldyMarmot",
        "title": "how to get from milano-bergamo(bgy) airport to torino?",
        "content": "Ciao a tutti, I will be starting to live in Torino this September. I will be ariving with 2 luggages and a backpack.  I heard that there are some trains and busses, but i really dont know what to do. Currently i am researching and trying to gather information. I thought that opening a post and hearing from the locals could be helpful. What would you recommend for me? Here are my questions:  \n\\- Can I buy tickets online? If yes, which sites should i check?\n\n\\-What is the usual price range?\n\n\\-Are there any restrictions about luggages or bags?\n\n\\-How long does it takes?\n\n\\-Which train/bus stop should i choose in Torino (I will be living in Aurora)\n\nGrazie mille.",
        "upvotes": 2,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1ml9uvb/how_to_get_from_milanobergamobgy_airport_to_torino/"
    },
    {
        "id": "1ml0vnv",
        "author": "Possible_Disk_3864",
        "title": "Aula studio decente",
        "content": "Una mia amica vuole andare a studiare fuori domani tutto il giorno. Qualche tempo fa eravamo andati in centro ai Murazzi (abbastanza comodo, spazioso, c'è anche il bar con pasti precotti). Purtroppo so che è chiuso fino a metà agosto, ci sono alternative valide? Grazie",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ml0vnv/aula_studio_decente/"
    },
    {
        "id": "1ml8wt6",
        "author": "Top-Text-7727",
        "title": "Corso Novara, civico intorno al civico 50. Pareri?",
        "content": "Ho visto un annuncio per una casa in corso Novara. Io sono già a corso Brescia e mi trovo bene nonostante tutto, tuttavia non conosco ancora bene la città. Non è molto lontano da dove abito ma mi sembra di capire che sia un po' alla frontiera tra zona normale e zona disagiata. Giusto? ",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1ml8wt6/corso_novara_civico_intorno_al_civico_50_pareri/"
    },
    {
        "id": "1ml5x61",
        "author": "Safe-Arugula-3725",
        "title": "Musica Live",
        "content": "Ciao, a tutti.\nQualcuno (fruitore o artista) sa consigliarmi locali di musica dal vivo dove andare a suonare da emergente.\nIntendo posti del calibro del Vecchio Legno o locali simili.\nGrazie mille.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ml5x61/musica_live/"
    },
    {
        "id": "1mlin3c",
        "author": "HelloMotoIt",
        "title": "Orbassano...declino",
        "content": "",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1mlin3c/orbassanodeclino/"
    },
    {
        "id": "1mkrixt",
        "author": "sw1nky",
        "title": "Pet rescue/shelter volunteering",
        "content": "Anyone know of some animal shelters where I can volunteer, specifically driving, like picking up fosters to bring to foster families etc? Grazie 🙏",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mkrixt/pet_rescueshelter_volunteering/"
    },
    {
        "id": "1mkykam",
        "author": "G14NP13R0",
        "title": "EDISU",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mkykam/edisu/"
    },
    {
        "id": "1mkujxn",
        "author": "GlezIsBauk",
        "title": "Pallavolo?",
        "content": "M18\n\nSono nuovo qua a torino e sarò qua fino al 25, qualcuno sa dove posso giocare? (Implicito: qualcuno ha voglia di giocare con me?)",
        "upvotes": 1,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1mkujxn/pallavolo/"
    },
    {
        "id": "1mjzplc",
        "author": "carmelolg",
        "title": "Qualcuno a Torino che scatta ancora in analogico? Consigli per risparmiare?",
        "content": "Ciao a tutti!\n\nVolevo chiedere se c’è qualche appassionato di fotografia analogica qui su Torino che scatta ancora con le vecchie pellicole.  \nNegli ultimi tempi mi sto chiedendo se abbia ancora senso continuare, almeno dal punto di vista economico (la passione ovviamente resta!).\n\nI prezzi delle pellicole e dello sviluppo sono aumentati tantissimo: una pellicola 35mm da 36 pose (tipo Kodak ColorPlus) costa tra i 10 e i 15 euro e lo sviluppo, senza stampe, parte da almeno 10 euro. In pratica, per ogni rullino, si arriva facilmente a spendere 20 euro o più.  \nPer chi, come me, vorrebbe scattare con una certa regolarità, diventa una bella spesa.\n\n**La mia attrezzatura attuale è:**\n\n* Pellicole: Kodak ColorPlus 35mm\n* Fotocamere: Minox 35GL e Praktica BC1\n\nC’è qualcuno qui che continua a utilizzare le analogiche a Torino?  \nAvete qualche consiglio per risparmiare, magari laboratori economici in città, posti dove prendere le pellicole a prezzi migliori, oppure dritte su come sviluppare a casa?  \nMi piacerebbe confrontarmi con altri appassionati della zona e magari scoprire qualche trucco per continuare a scattare senza spendere una fortuna!\n\n",
        "upvotes": 9,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1mjzplc/qualcuno_a_torino_che_scatta_ancora_in_analogico/"
    },
    {
        "id": "1mk7lbu",
        "author": "DamDesigns11",
        "title": "Aiuto.",
        "content": "\nVorrei dei consigli sul lavoro e sull'alloggio nella zona di Torino. Andrò all'Università di Torino per studiare e ho bisogno di trovare un alloggio per due persone, preferibilmente il più vicino possibile all’università. Inoltre, vorrei dei consigli su come o dove posso trovare un lavoro part-time dopo le lezioni, per guadagnare qualche soldo extra. Non parlo ancora italiano, ma mi iscriverò a dei corsi non appena arriverò a Torino, quindi al momento sarebbero preferibili delle opzioni di lavoro in inglese (o in russo).\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mk7lbu/aiuto/"
    },
    {
        "id": "1mk6hqh",
        "author": "akkyuz",
        "title": "Tecnico gas",
        "content": "Ciao,\nDato che vorrei sostituire il mio attuale piano cottura a gas con uno a induzione (che già possiedo), avrei bisogno di un tecnico che mi venga a chiudere il tubo del gas collegato al piano. È un'operazione che potrei anche fare da solo ma visto che si tratta di gas preferirei farlo fare a un tecnico specializzato. Avete consigli?\n\nGrazie!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mk6hqh/tecnico_gas/"
    },
    {
        "id": "1mk0nq8",
        "author": "Flashy-Ostrich-8673",
        "title": "travel tips to torino!",
        "content": "hi there - me and some girlfriends are travelling to Torino in late summer. we are looking at options of where to stay and have narrowed it down to the Campidoglio district or more central near Porta Susa. Does anyone have any ideas on what would be safer for young women? i've read up about the city and know it is generally safe, but we want to be cautious as travelling as women",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mk0nq8/travel_tips_to_torino/"
    },
    {
        "id": "1mk6lyk",
        "author": "Tony_zer0five",
        "title": "Bakugan",
        "content": "Sapete se c'è un posto dove vendere carte bakugan a Torino o in provincia, Ho a qualcuno interessa comprare o scambiare carte bakugan?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mk6lyk/bakugan/"
    },
    {
        "id": "1mjtd8t",
        "author": "Nurgus",
        "title": "Parking confusion",
        "content": "We just arrived in Torino, parked in a blue line space and went to a parking machine to pay. A chap rushed over to tell us that we did not need to pay, it's free all day every day at the moment.\n\nEveryone else we ask tells us we have to pay.\n\nDo we have to pay? We'll be here a few days.",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1mjtd8t/parking_confusion/"
    },
    {
        "id": "1mk1s67",
        "author": "ErTeo21",
        "title": "Campus sanpaolo",
        "content": "Ciao, qualcuno è / è stato al campus sanpaolo? Come vi siete trovati? \nChiedo perché vorrei alloggiare li e frequentare lezioni al politecnico, è fattibile ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mk1s67/campus_sanpaolo/"
    },
    {
        "id": "1mj7upw",
        "author": "Wide-Scientist-659",
        "title": "mi trasferisco a Torino per l’università: consigli?",
        "content": "Ciao a tutti! Tra un paio di settimane mi trasferirò a Torino per iniziare l'università e volevo chiedervi qualche consiglio. È la prima volta che vivo in città, quindi mi piacerebbe sapere cosa fare e cosa evitare, zone carine dove uscire, consigli pratici per chi arriva da fuori città o altri suggerimenti utili per ambientarmi. Grazie mille in anticipo!",
        "upvotes": 9,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1mj7upw/mi_trasferisco_a_torino_per_luniversità_consigli/"
    },
    {
        "id": "1mix31m",
        "author": "telespalla-iba",
        "title": "Cosa sono queste strutture in corso Principe Oddone?",
        "content": "",
        "upvotes": 42,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8m69oztldchf1.jpeg?auto=webp&amp;s=5033d5a6bb4a72f79aa7ace4687af97922a2f037"
        },
        "permalink": "/r/torino/comments/1mix31m/cosa_sono_queste_strutture_in_corso_principe/"
    },
    {
        "id": "1mjfzgg",
        "author": "No_Crab4025",
        "title": "TORNEI PADEL A TORINO",
        "content": "Buonasera a tutti, sono un ragazzo specializzato nell'organizzazione di eventi e tornei padel, lavoro già presso un circolo di padel ma pensavo di mettermi in proprio come organizzatore di tornei padel nei circoli di torino e provincia. Volevo chiedervi se secondo voi servirebbe una figura come me nei circoli di torino, oppure i circoli organizzano già abbastanza eventi? grazie",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1mjfzgg/tornei_padel_a_torino/"
    },
    {
        "id": "1miejrw",
        "author": "guigbd",
        "title": "Expat students in Turin",
        "content": "🌆Are you a new student in Turin and don't know where to start to get around the city? \n\nWe are an international group of young people who organize events over the weekend, appointments for an aperitif and why not, some practical workshops to increase their skills and be more attractive on the market. \n\nCurrently this is our second year and everything is in development, so if you like feel free to leave me your email or a contact below to be added\n\nSee you soon 🔜 ",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1miejrw/expat_students_in_turin/"
    }
]