[
    {
        "id": "1k49ucs",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 14,
        "comments": 1721,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k49ucs/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1k75e19",
        "author": "EffectiveTie3144",
        "title": "Happy Birthday to Real Madrid club legend Raphaël Xavier Varane 🇨🇵",
        "content": "",
        "upvotes": 585,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k75e19/happy_birthday_to_real_madrid_club_legend_raphaël/"
    },
    {
        "id": "1k7euab",
        "author": "Ripamon",
        "title": "Is he getting too big? He will probably be as big as prime Bale in a few months.",
        "content": "",
        "upvotes": 91,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kn0kic53lxwe1.jpeg?auto=webp&amp;s=46fd216dc46795868323bde252b4c9c3719dfb65"
        },
        "permalink": "/r/realmadrid/comments/1k7euab/is_he_getting_too_big_he_will_probably_be_as_big/"
    },
    {
        "id": "1k7b48k",
        "author": "Alex6683",
        "title": "It keeps revealing something heart breaking 💔",
        "content": "",
        "upvotes": 154,
        "comments": 9,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k7b48k/it_keeps_revealing_something_heart_breaking/"
    },
    {
        "id": "1k71sp3",
        "author": "Cristianoronaldostan",
        "title": "Valverde’s masterpiece for last minute win",
        "content": "Crowd went crazy especially after a goal was denied and the game was scoreless until the last minute. ",
        "upvotes": 337,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/r8zxqn0t8uwe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k71sp3/valverdes_masterpiece_for_last_minute_win/"
    },
    {
        "id": "1k6o2t4",
        "author": "[deleted]",
        "title": "Before you blame Carlo for this year, please watch this",
        "content": "",
        "upvotes": 2302,
        "comments": 95,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dfevm1u75rwe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k6o2t4/before_you_blame_carlo_for_this_year_please_watch/"
    },
    {
        "id": "1k71x3e",
        "author": "Ready_Ad_1353",
        "title": "Yaya Toure tells Obi Mikel how difficult it was to stop Cristiano Ronaldo : “Piqué, you know what? Me I jump on him”",
        "content": "",
        "upvotes": 308,
        "comments": 56,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pu8jhmwt9uwe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k71x3e/yaya_toure_tells_obi_mikel_how_difficult_it_was/"
    },
    {
        "id": "1k6xshv",
        "author": "Cristianoronaldostan",
        "title": "Vini Jr. is the most entertaining RM player currently",
        "content": "Was lucky to catch the game against Athletic and of all throughout the game vini amazed the fans with his skills. I wonder how entertaining Ronaldo would be back in the day with his play and goal celebration",
        "upvotes": 381,
        "comments": 95,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lia8jikcgtwe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k6xshv/vini_jr_is_the_most_entertaining_rm_player/"
    },
    {
        "id": "1k72rbp",
        "author": "Ready_Ad_1353",
        "title": "During the match between Getafe and Real Madrid, the referee briefly stopped the game because Getafe fans were chanting \"Ceballos, die\". The reason: in 2016, in the game between Betis and Getafe that relegated Getafe, Ceballos said: \"I hope you root in the Second Division and disappear\"",
        "content": "",
        "upvotes": 132,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/umnFsIegp-pwoHg-xxnpZnFr59rCf1ZnbK8-Wwm2OuI.jpg?auto=webp&amp;s=c9d6a831044fc80d1eb18ba183da9746b496c46a"
        },
        "permalink": "/r/realmadrid/comments/1k72rbp/during_the_match_between_getafe_and_real_madrid/"
    },
    {
        "id": "1k6q189",
        "author": "Charybd1ss",
        "title": "[The Athletic] Vinicius Jr’s entourage strongly deny that a new contract is close and insist that the ball is in Madrid’s court. The forward wants a package of around €30m per year that is in the region of the highest ever at the club, which was given to Cristiano Ronaldo.",
        "content": "",
        "upvotes": 506,
        "comments": 381,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1qREV07urm8JP3sxWHweEtyCF2N--GvUj__HbSlVr-k.jpeg?auto=webp&amp;s=b92cc4f5cbd89467272b85af5274f8c75fe650c5"
        },
        "permalink": "/r/realmadrid/comments/1k6q189/the_athletic_vinicius_jrs_entourage_strongly_deny/"
    },
    {
        "id": "1k6ze9o",
        "author": "I_will_try_my_best",
        "title": "Why did Ramos convert to CB?",
        "content": "Ramos as a RB was incredible to watch - his finesse, speed, skill, and obviously his defending was world class. Looking back his move to CB seemed like an obvious progression since he had such a commanding and calculated presence, but was there a specific reason/need for him to make the change? For both Spain and Real? \n\nHe's my favorite player of all time but I've never heard a specific explanation for this one. Thanks! ",
        "upvotes": 88,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k6ze9o/why_did_ramos_convert_to_cb/"
    },
    {
        "id": "1k6ods6",
        "author": "Sl_PROXY",
        "title": "[Parte médico] Eduardo Camavinga has been diagnosed with a complete tear of his left adductor tendon.",
        "content": "",
        "upvotes": 397,
        "comments": 85,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4Zi0mI0v73EJmHIlWbfMqlHxLRsIoY-o32oej3ZXmgY.jpg?auto=webp&amp;s=0891e8870e335090d2fd54d1b59c5784bb406ee8"
        },
        "permalink": "/r/realmadrid/comments/1k6ods6/parte_médico_eduardo_camavinga_has_been_diagnosed/"
    },
    {
        "id": "1k6lx09",
        "author": "Limp_Appointment7092",
        "title": "Your vacancy has not yet been filled, king",
        "content": "",
        "upvotes": 571,
        "comments": 24,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/17y2b45udqwe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k6lx09/your_vacancy_has_not_yet_been_filled_king/"
    },
    {
        "id": "1k6zd15",
        "author": "z1nc0r3",
        "title": "Can We Still Win LaLiga? A Statistical Look at Our Best-Case Scenarios",
        "content": "Hola Madridistas,  \nI’ve been doing some math and thinking about how we could still win LaLiga this season. Honestly, there's not much we can do directly except **win every remaining match** — and even then, the title still depends on *Barcelona dropping points*.\n\nSo yesterday was Matchday 33, where both Real Madrid &amp; Barcelona won. So the current point table is like this, and the point gap is **4**\n\n* Barcelona - 76\n* Real Madrid - 72\n\nSo in the league, there are 5 matchdays left this season, with one El Clásico. There are many possibilities, but I'll go through the most likely (or our best-case scenario) ones.\n\n**1. We win all 5, including El Clásico | Barça wins 4 (losing El Clásico)**\n\n* Barcelona - 76 + 12 = 88 pts\n* Real Madrid - 72 + 15 = 87 pts\n* 🔴 We will lose the title by just one point.\n\n**2. We win all 5 | Barça wins 3 (incl. losing El Clásico)**\n\n* Barcelona needs to lose both El Clásico and one more match.\n* Barcelona - 76 + 9 = 85 pts\n* Real Madrid - 72 + 15 = 87 pts\n* 🟢 We will win the title by two points\n\n**3. We win all 5 | Barça gets 3W + 1D + 1L (losing El Clásico)**\n\n* Barcelona - 76 + 10 = 86 pts\n* Real Madrid - 72 + 15 = 87 pts\n* 🟢 We will win the title by just one point\n\n**4. We win 4/5 | Barça wins 4/5 | El Clásico draw**\n\n* Barcelona - 76 + 13 = 89 pts\n* Real Madrid - 72 + 13 = 85 pts\n* 🔴 We will lose the title by 4 points\n\n# TL;DR\n\nThere will be lots more cases, but in my opinion, these are the best chances we've got. So here are some insights in my POV (just my thoughts)\n\n* With the current situation, the only thing we can do is win all the next 5 matches (including El Clásico somehow) and pray to some other team to defeat Barca.\n* If we lose the El Clásico, the title is gone 99% because I can't see any Barcelona defeats in the next matchdays with their current pace.\n* Even if we somehow managed to win or draw El Clásico, the title still relies on Barça dropping points.\n\nYeah, that's it. Our chances are pretty low but not zero. If we keep managing to win the CdR final, it will boost the title race, I think. So either we win both CDR and LaLiga or...\n\nPlease mention if any details above are wrong or mistaken by me.\n\n**¡Hala Madrid!** 🤍",
        "upvotes": 57,
        "comments": 54,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k6zd15/can_we_still_win_laliga_a_statistical_look_at_our/"
    },
    {
        "id": "1k6drvy",
        "author": "busyblckboy",
        "title": "Football heritage!!!",
        "content": "Be patient, honestly I'm glad they didn't put pressure on arda and endrick",
        "upvotes": 1612,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j175942h6owe1.jpeg?auto=webp&amp;s=bb5d68a05b503ee2a5ca7fa7914da4c97d8b1030"
        },
        "permalink": "/r/realmadrid/comments/1k6drvy/football_heritage/"
    },
    {
        "id": "1k6bly1",
        "author": "Pebbledthoughts",
        "title": "Arda Guler....What the hell!!!! What is this Level?",
        "content": "",
        "upvotes": 1584,
        "comments": 144,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0yt0yel7pnwe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k6bly1/arda_gulerwhat_the_hell_what_is_this_level/"
    },
    {
        "id": "1k68nfl",
        "author": "TheGhost5322",
        "title": "Arda makes it 1-0!!!",
        "content": "",
        "upvotes": 2217,
        "comments": 82,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/07m5bq8h3nwe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k68nfl/arda_makes_it_10/"
    },
    {
        "id": "1k6j462",
        "author": "Emintro7",
        "title": "Arda Güler every touch vs Getafe",
        "content": "",
        "upvotes": 418,
        "comments": 44,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/917s00ddhpwe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k6j462/arda_güler_every_touch_vs_getafe/"
    },
    {
        "id": "1k6iozk",
        "author": "PrimusHimself",
        "title": "Jude should get the shoulder injury before it becomes a big problem.",
        "content": "This is a video of him vs the match against Getafe.",
        "upvotes": 423,
        "comments": 54,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/mhs48axzdpwe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k6iozk/jude_should_get_the_shoulder_injury_before_it/"
    },
    {
        "id": "1k6mtvw",
        "author": "HaalandMbappeVini",
        "title": "Are we broke? What is going on with all the money we were going to make back from events?",
        "content": "I have heard about events being canceled and instead being re-assigned to Wanda, because of noise complaints, the Bernabeu is very centric so it makes sense. So how did no one see this coming?? If this is how we we are going to pay back our renovation costs then we are COOKED. \n\nDoes any one have any information about this? ",
        "upvotes": 106,
        "comments": 65,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k6mtvw/are_we_broke_what_is_going_on_with_all_the_money/"
    },
    {
        "id": "1k786np",
        "author": "Revolutionary-End765",
        "title": "Swap RM player for another player from another team",
        "content": "I know this is not real. Think of it as day dreaming. \n\nIf you had the opportunity to trade one of our players for a player from another team, who would you choose? Assuming all other issues are resolved. \n\nI will swap Vini for Haaland.  I think Vini is a world-class talent and a Madrisita. His biggest issue is that he easily gets distracted by issues during the game when he shouldn't (not talking about racism, of course). Defenders and fans can easily get under his skin and mentally isolate him. Unfortunately, we haven't seen him improve on this aspect and I believe that was critical in some games and made us suffer. \n\nAt the same time, we need a no.9 like Haaland who is fast, sharp, and clinical in front of the net. \n\n\n\nWhat are your names? ",
        "upvotes": 2,
        "comments": 73,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k786np/swap_rm_player_for_another_player_from_another/"
    },
    {
        "id": "1k6uv0a",
        "author": "Domesticated_Cum",
        "title": "Lets play fantasy Real Madrid managers!  Give me your 4780 IQ lineups and tactics and discuss others! I'll start",
        "content": "This is a fun fluff post for the armchair manager-wannabes in this subreddit. Give me your UCL winning tactical genius approach your would use.\n\nOnly rule is: Only use current squad.\n\nOther people can chip in and discuss your ideas and vote for the funniest, best, and overall most interesting ideas.\n\nTHIS IS NOT A SERIOUS POST. WE ARE JUST FANS. NONE OF US ARE QUALIFIED TO TOUCH THE GRASS. PLEASE DONT BE SERIOUS.\n\n  \n\\-----------\n\nMy Real Madrid GEGENPRESS football. 90 min press with super high defense line that relies on offside traps and physicality to harass forwards.\n\nLineup is 3-4-3 -&gt; 3-3-1-2-1 in possession : [https://imgur.com/a/njaWOAO](https://imgur.com/a/njaWOAO)\n\nAscensio and Rudiger as Wide Center Backs with Tchouameni in the middle organizing the whole line and playing the ball to midfielders in the build up.\n\nValverde and Camavinga as wide midfielders, defensively they support the backline and press the opposition wingers/wingbacks. Offensively they present passing options in wider spaces and cover some of the central spaces forward as more players move into the box. They can also play more centered and form the midfield trio with Guler while Rodrygo and Vinicius play more wider roles.\n\nGuler and Bellingham are my main engines in the midfield. Guler is the creative outlet and Bellingham is the work horse. Guler will hold the ball more often and link with the wide midfielders for options forming a midfield trio (Cama, Fede, Guler) while looking to unlock the defense with killer balls to the final thirds. Jude will move forward with and without the ball and form a trio with Rodrygo and Vinicius. He will be a Muller-esk Ramdeuter.\n\nVinicius and Rodrygo are the central forwards. Flexible in positioning and expected to play close together with Jude. Synergy is needed for one-two passes that unlocks any deep defense. But they are also expected to dribble and shoot as much as possible. Expected to press hard when out of possession.\n\nMbappe will have to turn into a Poacher. His job is to lock defenders with him and finish any half chances we get. The team pressing high and crowding the edge of the area will allow lots of balls inside the box. Kylian is expected to pick them up. Expected to press hard when out of possession.\n\n  \nPlaystyle will be a high intensity passing with players generally being close to eachother. Beating defense with dribbling and one-two link ups. NO FUCKING CROSSES.\n\n  \nHow many goals do you think we will concede?\n\nHow many injuries per season?",
        "upvotes": 19,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L5z6B4AIpXiL0LJtj9kqNfN2gxlWrrFF66QW_U8LItg.jpg?auto=webp&amp;s=459d65d36cc03163644d404b8c0955963f51ca24"
        },
        "permalink": "/r/realmadrid/comments/1k6uv0a/lets_play_fantasy_real_madrid_managers_give_me/"
    },
    {
        "id": "1k6c3jn",
        "author": "Modo97",
        "title": "I'm not afraid anymore to say that Courtois is the greatest RM keeper that I've ever seen 🐐❤️",
        "content": "And yes, I've watched Casillas in his prime years between 2007 and 2012. I've watched Keylor Navas and even Diego Lopez that I actually loved. I think we've always been lucky when it comes to goalkeepers. Even Lunin was brilliant for us last season.\n\nBut honestly I've never felt safe with any other GK like I feel these years with Courtois. Except for his first season, I think Courtois has been the most consistent keeper for us. Casillas, with all respect, used to have some obvious flaws, like dealing with aerial balls and crosses (he was very poor with his feet as well). Navas was a bit inconsistent comparing to Casillas (in his prime) and Courtois, but I have massive respect for him too.\n\nCourtois is just perfect in every possible way.. his 2021/22 season might be the best that I've ever seen for a GK, especially in Champions League. His performance against Liverpool in the final is unmatched, in my opinion. \n\nHe will never play over 700 games for us like Casillas, and he might not end up being the RM keeper with most titles. But in my opinion, he's the best that I've ever seen.. and in my Top 3 GKs of all times (with Buffon + Neuer). I hope he still has 3 or 4 more years in him, because replacing him will be hard.",
        "upvotes": 342,
        "comments": 92,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k6c3jn/im_not_afraid_anymore_to_say_that_courtois_is_the/"
    },
    {
        "id": "1k6p351",
        "author": "Friendly-School5406",
        "title": "Title Race(Laliga or Copa) Which cup do you think Madrid will have a chance to win? Will they be cup less this season or?",
        "content": "Madrid was performing really well until the end. From my hopes of it could be Madrid Treble season, to loosing all hope to a point where I feel we would go wont win the copa finals, and would be difficult to secure the league win unless barca loses a game and we beat them in the el classico. What do you guys feel Madrid has a chance to win either one of the cups?",
        "upvotes": 32,
        "comments": 50,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k6p351/title_racelaliga_or_copa_which_cup_do_you_think/"
    },
    {
        "id": "1k6dc70",
        "author": "Messmers",
        "title": "Let's address the elephant in the room: Vini and Mbappe play much better when one of the two isn't on the pitch.",
        "content": "Mbappe's best games this season have been games where Vini wasn't playing\n\nVini's best games have been the best when Mbappe wasn't playing.\n\nOf course there's been games where they shined while they were both on the pitch like Mbappe's hattrick vs City and Vini's vs Dortmund but even in those games the synergy between them wasn't as good as with their teammates when the other isn't playing.\n\nThey have so much more to work with when they get the ball constantly rather than on and off, their synergy isn't that great either, it's already an issue now and might only get worse, a new coach isn't going to fix this.\n\nWhat's the solution?",
        "upvotes": 263,
        "comments": 111,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k6dc70/lets_address_the_elephant_in_the_room_vini_and/"
    },
    {
        "id": "1k64swx",
        "author": "PriorSnow6874",
        "title": "Which Player’s Transfer From Madrid Broke Your Heart the Most? I’ll Start - Ronaldo🐐",
        "content": "After everything Ronaldo did for Real Madrid 4 UCL titles, countless goals his exit felt unreal.\n“I Don’t Want To Wake Up”",
        "upvotes": 578,
        "comments": 74,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vdk2vv2wbmwe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k64swx/which_players_transfer_from_madrid_broke_your/"
    },
    {
        "id": "1k709pc",
        "author": "J_Dungeon",
        "title": "When is the Real Madrid v Celta Vigo Game? Saturday or Sunday?",
        "content": "ESPN shows Sunday at 2pm - [https://www.espn.com/soccer/team/fixtures/\\_/id/86/esp.real\\_madrid](https://www.espn.com/soccer/team/fixtures/_/id/86/esp.real_madrid)\n\nReal Madrid's site shows Saturday at 9pm - [https://www.realmadrid.com/en-US/football/first-team/home](https://www.realmadrid.com/en-US/football/first-team/home)\n\nI bought my ticket on viagogo, which is showing Saturday at 9pm - [https://www.viagogo.com/Sports-Tickets/Soccer/Real-Madrid-CF-Tickets/E-153769098?quantity=2](https://www.viagogo.com/Sports-Tickets/Soccer/Real-Madrid-CF-Tickets/E-153769098?quantity=2)\n\nI swear the game was originally scheduled for Sunday, then Saturday, and now Sunday again on ESPN. Scheduling travel around this game has been challenging.",
        "upvotes": 5,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TtUOshKce8hkbqhSdFTX9w68QETzyKAHWYC-pYRltBc.jpg?auto=webp&amp;s=f51f20a923dd80cc5cb7b9f6ad759ddc6e35c622"
        },
        "permalink": "/r/realmadrid/comments/1k709pc/when_is_the_real_madrid_v_celta_vigo_game/"
    },
    {
        "id": "1k657h2",
        "author": "Mastermind_737",
        "title": "Vinicius stays: Real Madrid will announce the Brazilian's renewal at the end of the season. Manu Carreño reports that the number 7 will extend his relationship with Real Madrid for \"two or three more years.\"",
        "content": "https://cadenaser.com/nacional/2025/04/22/el-real-madrid-anunciara-la-renovacion-de-vinicius-a-final-de-temporada-cadena-ser/\n\nSaudi Arabia was making a strong bid, with a substantial financial offer of up to €1 billion spread over five years, but as Carreño also reported last March, Vinicius wasn't convinced by such a long-term contract. For their part, the Saudi investors weren't keen on making a huge outlay to keep the Brazilian for a couple of seasons, and this disagreement ultimately broke down negotiations.\n\nNow, the latest information suggests that, following the player's desire to stay in Spain, Real Madrid will announce a contract extension (\"for two or three years\"), beyond the current one, which expired in 2027.\n",
        "upvotes": 262,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/066Vc3wF8uXuLSj1zWE5wtbL6VE7ZdLs8U9hVpJglQ8.jpg?auto=webp&amp;s=e31d28e79e86ba77e13d9aad0222ba826fbb6051"
        },
        "permalink": "/r/realmadrid/comments/1k657h2/vinicius_stays_real_madrid_will_announce_the/"
    },
    {
        "id": "1k5wg71",
        "author": "Ready_Ad_1353",
        "title": "Hansi Flick: “It’s not nice to see what happened to Ancelotti… Real Madrid have one of the best coaches in the world, he deserves respect. Carlo won everything at every club, he’s a gentleman. I have the highest respect for him... I can say Ancelotti is an unbelievable coach.\"",
        "content": "",
        "upvotes": 724,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IlzG9Zu_E-DL6r045Mpepz10uSABuG6cY4kU0KZ2MJw.jpg?auto=webp&amp;s=ef44ee5429a47325785a921de0b7c831f483bcd3"
        },
        "permalink": "/r/realmadrid/comments/1k5wg71/hansi_flick_its_not_nice_to_see_what_happened_to/"
    },
    {
        "id": "1k6i65m",
        "author": "Zealousideal-Ad-2685",
        "title": "We're So Close To A Gala 11 That Will Cook Europe",
        "content": "What I really really want to see next season is a 4-4-2 diamond with xabi as the manager. if we pull this off, oh boy... we're going to cook\n\ntrent as a RB can work really well with valverde as the RM in front, they can constantly switch with each other throughout the game.\n\ni really hope the board goes for hujisen and doesn't want to save money for the stadium or whatever, cuz having rudiger hujisen and asencio as our 3 CBs would be great. \n\ncamavinga as the LB is just better than mendy and garcia if he gets consistency, and we're not gonna buy anyone else this summer. \n\ni wasn't confident in tchouameni, but he's done a 180 in the second half of the season and he can be a great destroyer CDM when he's paired up wth guler doing the build up play from deep.\n\nbellingham as a free roaming 10, and crashing into the box for aerial presence. the vinicius and mbappe sync hopefully gets figured out by xabi. this might sound crazy but i think putting vini more on the right than he usually goes should be experimented more. \n\n* courtois\n* trent rudiger huijsen camavinga\n* valverde tchouameni guler\n* bellingham\n* vinicius mbappe ",
        "upvotes": 25,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k6i65m/were_so_close_to_a_gala_11_that_will_cook_europe/"
    },
    {
        "id": "1k6ejd3",
        "author": "InformationFresh9605",
        "title": "Important signing for next year.",
        "content": "Without a doubt we need 3 important signings. Obviously Xabi to step in as our new manager. Carlo is one of greatest managers of all time but everything eventually comes to an end. Dean Huijsen is an incredible young player who would do amazing in our system. He’s been practically begging to join us. We would actually be mental not sign him for only £50m. And obviously Trent. I think these signings would def benefit us and we would be back to the same level as last year or even better.",
        "upvotes": 38,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k6ejd3/important_signing_for_next_year/"
    }
]