[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 631,
        "comments": 4843,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nhxelr",
        "author": "SnooRevelations7068",
        "title": "Netflix cancelled after 10 years. Are you feeling Netflix has gone downhill too?",
        "content": "Hit me yesterday, we haven’t checked out Netflix in awhile. Popped in, layouts completely different and nonsensical, and there really wasn’t anything good or new. Cancelled Netflix after 10 years, but the lack of content and cancelling of interesting shows after a season was ruining Netflix for us anyways. Wife and I both agreed, we don’t give af about the last season of Stranger Things anyways. Anyone else feeling the same way?",
        "upvotes": 230,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/1nhxelr/netflix_cancelled_after_10_years_are_you_feeling/"
    },
    {
        "id": "1nhznag",
        "author": "theseawoof",
        "title": "Have series ever been renewed years after being cancelled?",
        "content": "Has Netflix been known to bring shows back after having been cancelled by them for years? Seems like shows get cancelled by Netflix quite a bit, but I've never really thought much about if they've been revived or not. \n\nBeen hung up on Skylines (2019) and Archive 81 (2022) for example. Extraordinary shows with great writing, casts and acting. Among shows that found their voices instantly, and continue lingering since they just began intriguing stories with no resolution. I'm over here trying to brainstorm how things would play out 🫠 so many great character journeys that need to continue- a disservice to the art",
        "upvotes": 7,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1nhznag/have_series_ever_been_renewed_years_after_being/"
    },
    {
        "id": "1nh8v1b",
        "author": "indiewire",
        "title": "Owen Cooper Wins Emmy for 2025 Best Supporting Actor",
        "content": "",
        "upvotes": 301,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1nh8v1b/owen_cooper_wins_emmy_for_2025_best_supporting/"
    },
    {
        "id": "1ni30hi",
        "author": "HeyItzArrow",
        "title": "Not working?",
        "content": "Netflix won’t load once I click on a movie or show on my PC. It brings up the black loading screen with the red circle that goes around but never actually loads. \n\nAnyone else having this issue right now?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ni30hi/not_working/"
    },
    {
        "id": "1ni2hav",
        "author": "Atlast_2091",
        "title": "The Great Flood | Official Teaser | Netflix [ENG SUB]",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ni2hav/the_great_flood_official_teaser_netflix_eng_sub/"
    },
    {
        "id": "1ni4gci",
        "author": "RiseDelicious3556",
        "title": "I'm Confused, I Thought The New Season Of 'Call The Midwife' Would Be Season 15",
        "content": "Netflix has been posting a new season of 'Call The Midwife for awhile now.  Turns out it's Season 14, which I already watched on YOUTUBE a while ago, for free. It's pathetic that I can watch this show for free long before my subscription makes it available to me. Now I have to wait till 2026 for season 15 unless I can get it on youtube.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ni4gci/im_confused_i_thought_the_new_season_of_call_the/"
    },
    {
        "id": "1nhksce",
        "author": "MysteriousDelay6266",
        "title": "The Beast in Me | Official Teaser | Netflix | November 13",
        "content": "# THE BEAST IN ME\n\nClaire Danes, Matthew Rhys, and the team that brought you Homeland. \n\n* **The Beast in Me coming November 13th.**",
        "upvotes": 22,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1nhksce/the_beast_in_me_official_teaser_netflix_november/"
    },
    {
        "id": "1ni4cib",
        "author": "OkPea8377",
        "title": "A Wrong Paris (2025) - review",
        "content": "The Wrong Paris - it has everything, but something seems to be missing.\n\n\nThe brand new romantic comedy from the most famous digital streamer debuted recently and has already achieved great success. Starring former Nickelodeon teen star Miranda Cosgrove, in her second original work on Netflix (her first original work on the streamer was “A Mãe da Noiva”, another big recent success on the platform) and Pierson Fodé (The Perfect Date).\n\nSummary\nDawn (Miranda Cosgrove), a metallurgical artist, lives in the interior of the US state of Texas with her grandmother Bird and her sisters, dreaming of following in her mother's footsteps and becoming a real artist. Dawn, responsible, dedicated herself to working at a local café for a long time due to her private financial funds to study art in Paris. She actually manages to pass university, however, without the full scholarship, her savings are insufficient.\n\nOne of her sisters, a fan of reality shows, suggests that she sign up for the current production, the “Honeypot” or “Honey Pot”, a competition between women with 20 thousand dollars guaranteed to those selected for the great contest in search of the keys to the heart of a rich single man, which conveniently would take place in the City of Lights — or that's what the participants thought.\n\nSelected and gaining the affection of one of the show's producers, Dawn finds herself ready to reach the Eiffel Tower house. However, she is surprised by the production's prank, and the primary cause of the film's name, which lands her in Paris, Texas, less than 100 km from her home. Remaining in the dispute only for contractual reasons, she soon arouses the interest of the millionaire of the moment, Trey McAllen III (Pierson Fodé), a handsome cowboy, initially determined to be eliminated immediately. Throughout the dispute, between tests and intrigues typical of reality shows in confinement and some extra game moments, she will allow herself to live this passion.\n\nComments and opinion\nHome to many successful relationship reality shows, Netflix ironizes its own productions. From the beginning, Honeypot is presented as a self-criticism, properly a parody of the reality television genre. The entire structure and characters involved in the dispute are stereotypes of the most common human types to expose themselves in front of the cameras: the rich and spoiled influencer, the old school biker, the nerd, the free lover, the forgotten celebrity, the alternative girl, etc.\n\nThe film was directed by Janeen Damian, who has experience in the romantic comedy genre. He has already directed two other Netflix productions in the same style: Christmas Eve and Irish Wish. In The Wrong Paris, she inserts all the common and pleasant elements of romantic comedies, being quite predictable, which is no demerit. After all, when watching films or series of this type, we want an escape valve from the chaotic everyday life, where we have little or no control over what is going on around us. The constant presence of Dawn's family is an especially pleasant difference, constituting the viewer's voice within the film.\n\nEspecially her grandmother Bird, an emotional component of the plot, frequently advises her granddaughter and encourages her. Sometimes he interferes in the story that the most anxious audience would like to do for themselves. Miranda brings beauty and humanity to the film; It is perfectly possible to be indignant with her regarding the “villainess”'s far from discreet advances on the handsome millionaire. She conveys the character's insecurities well and definitely makes us fall in love with her too — an essential element for any self-respecting romantic comedy. Pierson fulfilled what his character needed: he delivers someone who is attentive, concerned, handsome and very passionate about the protagonist. There could be a slight touch more chemistry between the two characters (annoying me? Maybe).\n\nFeaturing beautiful landscapes and an interesting cast, the film also stands out for the quality of its production, ideal for the romantic comedy genre. Despite this, the story could have been better worked on. At 1h45 long, the extremely light plot (a good sign) goes by too quickly. There could be better development of the \"villain\" and the protagonist's confidant, through dialogues between them and the main character. In my opinion, there could have been more frank dialogues between the protagonist couple, giving a more solid basis for the passion between them. Some moments between Paris, Texas, and Paris, France, appear to occur with an expressed passion, without much emotional basis. Maybe 15 more minutes of film wouldn't hurt the production.\n\nWith an insightful critique in the background of the futility of influencers and the world of reality shows, limited to the formulas of the genre, it could have promised more than just a light and pleasant romantic comedy for a late afternoon when you just want to turn off your brain and disconnect from the busy routine, with cute moments starring passionate characters. I would have easily given that away. I think it was designed to be a single film, but there could be a sequel expanding this wonderful universe, especially Dawn's relationship with her family, especially her sisters.\n\nFINAL RATING: 4.5 STARS",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ni4cib/a_wrong_paris_2025_review/"
    },
    {
        "id": "1ngxqjc",
        "author": "CultOfCurtis1",
        "title": "Love Con Revenge is honestly the most amateur, misleading, defamatory, insulting to our intelligence \"documentary\" I've ever watched.",
        "content": "I honestly don't know where to start with this. The primary host is presented as some expert — even speaking about psychology she clearly has no understanding of — when in reality she's just someone who fell for a scam. The private investigator? She doesn't seem to understand the law at all, calls up people and says *\"I'm investigating this person\"* with zero clue if the recipient of the call is friends with the target (which could expose her), and tails cars by following them in U-turns, parking lots, etc while wondering \"Do you think he spotted us?\"\n\nSeveral guys on the show are clearly unpredictable criminals. Which also makes it nuts that they're taking these women to confront them face to face when they should be calling the police. They tracked a guy who was a fugitive from justice, and instead of calling the cops, they went to yell at him (tipping their hand and potentially giving the target time to flee). Even worse? It's the misleading crap and leaving information out. \n\nThroughout the series, the show presents claims that are in no way verified. It's like they took *every* \"case\" that came their way, and when stuff started to look sus, they kept going and just left out info. For instance, [another Redditor](https://www.reddit.com/r/netflix/s/tymYcHrKzg) looked up the clinic from the Dr. Wilkerson episode and discovered that the victim was *heavily* involved in the practice — with many of the complaints over the years specifically mentioning her behavior. \n\nAnd while we're on that episode, the \"victim\" dropped her civil suit? And she's facing charges for filing a false police report? And even though there's a claim that the guy opened fake accounts in the daughter's name (a clear crime that would result in arrest), there's been no charges filed? And Netflix didn't feel like showing us evidence of those alleged fraudulent accounts? Even worse, the \"after story\" text at the end of the episode was up for mere seconds. I'm not into conspiracies, but it's almost like they *didn't want us* to read the additional info that cast doubt onto the entire story. \n\nLeading up to the Dr Wilkerson episode, I was already a little irked by the show. Even when it was established that there was no evidence of crimes, the hosts would say things like \"At least he's been exposed.\" Been exposed about what? That an ex partner is saying negative stuff about them? Stuff you completely didn't prove, not even enough to support a civil lawsuit (which isn't a high evidentiary standard)?\n\nBut yeah, the episode with the doctor is going to be it for me. By marrying his \"victim,\" he ensured that any debt would be his responsibility too. Great con artist, right? The episode clearly left out all information that showed the \"victim\" might be lying. And while earlier episodes *clearly* showcased real con artists, the way in which they were handled was dangerous, amateur, and is very likely to result in defamation lawsuits against Netflix. \n\nThis show idea was great, but the execution is absolutely pathetic. Did these two ladies just go out filming stuff on their own and then show up to Netflix like, *\"You should show this\"*? The \"private investigator\" is essentially using Google and hiring others to find info for her, and Cecilie Fjellhøy's only place in the show should be in a \"this is what happened to me\" role rather than speaking as if she's a subject matter expert (she's clearly not). Even worse, they're pushing unverified claims that will ruin people even if they end up not being true. \n\nAnd by the way, repeatedly badmouthing the police *is not* a smart way to ensure the police keep discussing cases with you in future seasons. This is worse than amateur hour. It's amateurs manufacturing anger for ratings — because they know a large portion of folks won't care about pesky little things like a lack of facts while treating real scam incidents and jilted ex scenarios as if they're equivalent. \n\nNetflix, do better. ",
        "upvotes": 300,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1ngxqjc/love_con_revenge_is_honestly_the_most_amateur/"
    },
    {
        "id": "1ni2fvi",
        "author": "AccomplishedPut5175",
        "title": "Kontrabida Academy!!",
        "content": "Just watched this movie, and saved everyone over an hour of watching!\nI try to find something good in everything, but I really can't for this one.\nI wonder if Netflix has come to the point where only quantity matters and not quality?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ni2fvi/kontrabida_academy/"
    },
    {
        "id": "1ni1ymy",
        "author": "Ordinary_Mechanic_72",
        "title": "Hotel room tv to-go",
        "content": "Today 3 different customer support suggested me to either change my household or take the hotel room tv home so it's registered to my household...\n\nI stay around 260 nights a year at hotels and is the first time ever I got into this problem of not being able of logging into the hotel tv. And the answer given just makes me want to crush some heads. Previously I would get a \"traveling\" option,  not any more\n\nAnd, changing household means my family won't be able to watch it back home.... ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ni1ymy/hotel_room_tv_togo/"
    },
    {
        "id": "1nhgyt8",
        "author": "rs1909",
        "title": "Adolescence!!",
        "content": "So so happy with all the Adolescence wins at the Emmys. What a sweep in every category it was nominated in. We need so much more content like this. Made with so much love and empathy. So real!! And technical marvel no less!! Congratulations to everyone at Adolescence ",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nhgyt8/adolescence/"
    },
    {
        "id": "1nhsgx3",
        "author": "Majestic-Day-5024",
        "title": "crawford post win",
        "content": "to me, crawford still hasn't had as much attention to his win against canelo, I don't really know what I was expecting but to me; it was a punch perfect performance against world class opposition, &amp; yet I've hardly seen much said about him.\n\nhas anyone else thought this? in my eyes he's one of the best boxers i've ever seen fight \n\nis he just not as well known as some of the other names? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nhsgx3/crawford_post_win/"
    },
    {
        "id": "1ngvjx4",
        "author": "McKenna1981",
        "title": "Cancellations",
        "content": "When is netflix going to realise they're a streaming platform.  \n\nThis means new shows will not attract viewers the instant they drop, because they're already busy binging other shows.\n\nSo they need to stop cancelling new shows within weeks of their first season appearing.\n\nGetting very annoyed with netflix lately.  Rant over.",
        "upvotes": 263,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1ngvjx4/cancellations/"
    },
    {
        "id": "1nhyy1g",
        "author": "Pretty_Track_7505",
        "title": "I’m so mad about La Palma rn",
        "content": "How can anyone rate this higher than two stars or like 4 out of 10 at best? \n\nIt had good premise, sure, it was promising BUT it disappointed so badly I can’t even begin to describe.\n\nSPOILERS AHEAD \n\n&gt;!Guy’s getting arrested, for apparently no reason, then his stupid sister hits a cop and suddenly she’s getting arrested and they forget about her brother lmao!&lt;\n\n&gt;!Doing all that just so they can have a reason to release a guy from prison who’s gonna kill her brother later… it’s so stupid, his death was so unnecessary to the plot I can’t.!&lt;\n\n&gt;!Stupid daughter wants to go back in the queue to TALK to her girlfriend, EVEN THO she’s getting in the other plane right behind her.!&lt;\n\n&gt;!But none of that matters because not one plane takes off anyways, and they get hit by tsunami, nearly drown, but conveniently daughter survives by falling asleep? Or whatever the fuck that was.\nTHEY SHOULD’VE DIED NOT THE BROTHER!&lt;\n\n&gt;!Also the stewardess doing CPR on her girlfriend for 5 minutes, cause fuck other travelers am I right?!&lt;\n\nI probably missed something, but anyways sorry for the rant I was mad because the series didn’t deliver WHICH THEY COULD, EASILY.\n\nedit: spoiler tags",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nhyy1g/im_so_mad_about_la_palma_rn/"
    },
    {
        "id": "1nha26l",
        "author": "Ok_Independent5571",
        "title": "A light hearted not so long show to binge?",
        "content": "Ive seen a LOT of shows ok? But currently I'm not in the mood at all to watch a breaking bad type. \nOr better call saul. But it doesn't have to be that light hearted, as long as it has good writing, and not traumatizing like baby reindeer or Orange is the new black then I'll take it.\n\nShows I've seen: \nThe good place (I want something like this, even tho it was 4 seasons, it was so well written and i loved the lightness of it.) \n\nArcane (loved the animation, and the writing, season 2 sorta flopped but its ok) \n\nBojack horseman (😭😭😭i fucking love this show) \n\nAvatar the last Airbender (i would sell a kidney to experience it for the first time again) \n\nQueens gambit (10/10) \n\nMaid (😭👍🏻) \n\nThe last kingdom (AMAZING) \n\nCrazy ex girlfriend (it was insane that i randomly found this show and it became my FAV SHOW ever.) \n\nBlack mirror (i loved the way the episodes made me think. One of my favs, perfect level of disturbing)\n\nDark (🥀🤧✨️) \n\nbridgerton (its good... but a bit cringe, not the most amazing writing, QUEEN CHARLOTTE however was amaziinggg) \n\nWednesday (kinda felt like it wasted my time) \n\nBlue eye samurai (loved it) \n\nDerry girls (😍) \n\nBaby reindeer (it was rlh good..., it was so triggering😰) \n\nHeartstopper (THIS SHIT IS ADORABLE UGH idc if its not the most amazing wtiting, the characters chemistry is adorable)\n\nBEEF (it was good....) \n\nOrange is the new black (its a good show but i 100% regret watching it. It was way too dark for me. I still get flashbacks to it like it was traumatizing)\n\nMO (haha funny) \n\n\nSex education (fun, later seasons a bit ass) \nThe end of the fucking world (loved it) \n\nOne day (😐) \n\nYou (i have no idea how to feel about this show. I wouldn't recommend it to ppl but i wouldn't call it a waste of time) \n\nDead to me (i liked it.., cliche but still..) \n\nSquid games (darn)\n\n\n\n\n",
        "upvotes": 26,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1nha26l/a_light_hearted_not_so_long_show_to_binge/"
    },
    {
        "id": "1nhuelp",
        "author": "unrealootin",
        "title": "Crunchyroll has voice search... what's up?",
        "content": "Chrunchyroll, a significantly smaller company than Netflix has a capable voice search on their TV app. We all know that TV manufacturers are incompetent when it comes to designing remotes. If they were not, air mouse would be a standard by now and my remote wouldn't look like it came out when I was born. And Android TV OS will probably never make sense. But then app makers figured it out. If we can not make the ui or a remote be usable, lets add a voice search. And Netflix said, naaaah... We love when they tire out their little thumbs. Get a grip Netflix. Add voice search... And sorry everyone for the rant ✌️",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nhuelp/crunchyroll_has_voice_search_whats_up/"
    },
    {
        "id": "1nhtnlx",
        "author": "missylyssy3210",
        "title": "Gaten Matarazzo reflects on final season of stranger things",
        "content": "\nhttps://youtu.be/NUtr6nrH7WI?si=d6noohFPuDxdF9eh\n\nDuring an interview from a lego star wars press junket gaten reflected on what thw show has taught him, when asked how fans would react to the final season he said they would be happy and it’s the perfect ending ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nhtnlx/gaten_matarazzo_reflects_on_final_season_of/"
    },
    {
        "id": "1nhst6s",
        "author": "Luciferisnotalright",
        "title": "Shows like htsdo(f) and queenpins?",
        "content": "I really like the concept of like online illegal businesses in movies, like how to sell drugs online(fast) and queenpins\n\nSome unrelated but also shows that I liked(that may give u a bit of a better idea) \nThe end of the f*** world\nThe 7 Lives of Lea\nRussian Doll\nPoker face\n\n\nVibe wise teotfw and htsdof are my favorites ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nhst6s/shows_like_htsdof_and_queenpins/"
    },
    {
        "id": "1nh8alw",
        "author": "Relevant_Beyond_5058",
        "title": "Kidfluencing and Piper Rockelle promoted again",
        "content": "Ok I know this has been discussed, but I just watched this documentary and have the same reaction as everyone else.  I had never heard of her but I've witnessed grooming.  But everything online is from April.  So I did a search just in the past month and lo and behold!  Here's teen vogue making her whole life just cool superstardom, and oh by the way concerns about child exploitation are just haters hurting her feelings.  Oh and look praising turning 18 so you can look sexualized on camera and it not illegal!  After that whole documentary, pop culture is continuing to tell little girls to look up to this. It's not just the government turning a blind eye on Piper's situation, this type of media is trying to spread it to other girls.\n\n[https://www.teenvogue.com/story/piper-rockelle-profile](https://www.teenvogue.com/story/piper-rockelle-profile)",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nh8alw/kidfluencing_and_piper_rockelle_promoted_again/"
    },
    {
        "id": "1ni09j6",
        "author": "Wonder_8484",
        "title": "Samsung - This device can't stream Netflix with advert",
        "content": "I have a Samsung Smart TV, which can play Amazon prime and some other streaming service. However, for Netflix it says \"This device can't stream Netflix with adverts\".\n\nI am annoyed, Netflix can't stream to my Samsung TV. Netflix told me to contact Samsung, as if they will listen to me. They want me to pay double the subscription to get the ad-free version.   \n  \nNetflix is a $500billion company, why don't they pay Samsung to upgrade the firmware or allow a pass thru for certain devices, which don't support no-advert streaming. \n\nIf other providers can support advert based streaming, why can't Netflix?\n\nI cancelled my Netflix subscription. \n\n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ni09j6/samsung_this_device_cant_stream_netflix_with/"
    },
    {
        "id": "1nhmh6d",
        "author": "SimilarSprinkles9588",
        "title": "Fractured",
        "content": "has anyone watched the movie fractured on netflix, did you guys figure out the plot? personally i did figure it out but the last half of the movie had me confused . The hospital basement scene and everything",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nhmh6d/fractured/"
    },
    {
        "id": "1nhgvoq",
        "author": "eeedeat",
        "title": "5 petty reasons I didn't like Dept Q",
        "content": "The real reasons are the under seasoned characters, heavy reliance on worm out detective tropes  and the contrived plot. Here, however, are 5 things that are less substantial but still annoyed me.\n1 - Out of places Americanisms\n\"I could give a shit,\" getting \"mad\" at someone, sending a muffin basket. From middle aged Scots? Grated on me hard.\n2 - Here's your new Detective Inspector. He's an asylum seeker from Syria and I've just got him a job through blackmail. Surprise!\n3- The young Lyle Jennings: terrible AI or terrible acting with a Snapchat filter? \n4 - Was there any point in the 2 young detectives? I was convinced his shit haircut was going to form the basis of a plotline at some point but no, just a shit haircut.\n5 - The dialogue in cars. Holy smokes, was like chitty chitty bang bang level of special effects.\n",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1nhgvoq/5_petty_reasons_i_didnt_like_dept_q/"
    },
    {
        "id": "1nhklwo",
        "author": "RamboA123B",
        "title": "Sport events on netflix",
        "content": "If netflix is getting into the live sorting events side, they need to make it easier to rewatch the events. For example, the Crawford Vs Canelo fight. \n\nIf your watching on your phone you can skip along to the fight you want to watch. For smart TVs you need to hold the forward button and skip 3 and a half hours of scnces before getting to where you want. \n\nAccessibility on TVs probably needs updating. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nhklwo/sport_events_on_netflix/"
    },
    {
        "id": "1nhz19n",
        "author": "eyer2003",
        "title": "Netflix downloads abroad = total scam",
        "content": "I honestly feel scammed. I literally subscribed to Netflix just so I could download some movies and shows in German before my trip from Switzerland, planning to watch them offline on the plane. Now I’m in Tenerife and suddenly every single download is only available in English or Spanish. The German audio I already downloaded is gone.\n\nAnd yes, I can watch in English – I speak the language. But that’s not the point. If I’ve been following a show in German the whole time, switching to English with different voices completely ruins the experience. That’s exactly why I downloaded it in German in the first place.\n\nWhat’s the point of an offline download feature if it still checks your location and removes the language you picked? The files are already on my device! This makes zero sense and completely kills the purpose of downloading in the first place.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nhz19n/netflix_downloads_abroad_total_scam/"
    },
    {
        "id": "1nhp89y",
        "author": "Fun_Molasses5215",
        "title": "All the drama-filled Netflix reality TV shows you still have to look forward to this year",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nhp89y/all_the_dramafilled_netflix_reality_tv_shows_you/"
    },
    {
        "id": "1nhvten",
        "author": "AlienvsET",
        "title": "Netflix, your behavior has been completely unacceptable.",
        "content": "I was in Turkey and had gift cards activated until January 2026, but my balance was reduced to zero. Then I used my Turkish credit card, which was accepted just a week ago. I paid for one month, yet you cut off my account without giving me any refund. And when I click on \"talk to an agent\" as suggested by the bot, it only says that the chat is unavailable.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nhvten/netflix_your_behavior_has_been_completely/"
    },
    {
        "id": "1nh3gw5",
        "author": "Creative_Contract_17",
        "title": "Unknown person’s card on our Netflix account twice in two months.",
        "content": "Good day all. I’m looking for some advice. \n\nBack in June we lost access to our Netflix account and we found out that someone had hijiacked our account. \n\nWe changed the email to our account and password and apparently the next month someone gained access to our account again and added a credit card that was not ours. That card was charged for service in July and August. This month we had a notice to update our card because it was being declined. When we checked before updating it we found that the card was not ours. We were never notified that any changes had happened to our account either time. \n\nWe called Netflix who offered that we could again change our email and password as a fix again but offered no insight into how this happened again nor how they can guarantee that it will not happen again or if our own information was secure. \n\nThe first email was mine, the second was my husbands and has never been compromised nor have we ever shared our Netflix account info with anyone or used it anywhere but our home. We have no issues with any other service that we use. \n\nWe are looking to get answers for our privacy concerns as the customer service representative was unable to provide any other info or a pathway to figure out what happened. Twice in 2 months is concerning. \n\nUntil our concerns are addressed we have canceled our account. \n\nCan anyone provide somewhere for us to get some answers or file a formal complaint regarding the lack of security at Netflix? \n\nThank you in advance.  ",
        "upvotes": 9,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nh3gw5/unknown_persons_card_on_our_netflix_account_twice/"
    },
    {
        "id": "1ngbunt",
        "author": "Lonely_College2451",
        "title": "Breaking Bad, yay or nay? Bingeable or no?",
        "content": "I'm about to start Breaking Bad for no reason other than that I've heard it's good. \n\nI avoided it I think because my dad raves about it and y'know, when you're a teen and your dad starts raving about something, you're like ew I don't wanna watch that! Well now that I'm older, and I also have a better relationship with my dad, I've learned that I'm allowed to watch/listen to/read the same things he does and like it and it doesn't have to mean anything. \n\nI'm biting the bullet. I saw a reel the other day on Instagram with some dude from the show, played by Giancarlo Esposito, walking out of a room with HALF HIS FACE GONE??? And I was like DAMN! Apparently he knocks his role out of the park and I do love the guy. \n\nSo, am I in trouble? Is it really a great show? Will I find myself sucked in? Be honest lol I wanna know how bad I'm about to fixate on this shit. I wanna know how dynamic and bingeable it is. ",
        "upvotes": 303,
        "comments": 575,
        "media": null,
        "permalink": "/r/netflix/comments/1ngbunt/breaking_bad_yay_or_nay_bingeable_or_no/"
    },
    {
        "id": "1nh5zwb",
        "author": "Safe-Inevitable2218",
        "title": "What is your Netflix series recommendation?",
        "content": "What’s your must-watch show or movie on Netflix?  \nShare your top recommendations and see what everyone else is loving.  \nWhether you’re looking for your next binge or want to suggest a hidden gem, this is the place to find (and share) the best of Netflix!",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nh5zwb/what_is_your_netflix_series_recommendation/"
    }
]