[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 99,
        "comments": 302,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1ml07rs",
        "author": "Anxious_Cricket_1835",
        "title": "Been watching Mr. Robot and now I’m paranoid as hell about my personal info",
        "content": "I just finished watching season 1 of Mr Robot and it's great, no one warned me it's a horror series in disguise lol. I know it’s a TV show but damn watching Mr. Robot has me questioning everything. The way they gather people’s data, hack accounts, clone phones it’s way too realistic.  \n  \nNow I’m just sitting here thinking about how much of my info is floating around considering I've had the same phone number and email for years, signed up for hundreds of sites probably and no clue where half that data ended up. You hear of data breaches as well and it feels like anyone with enough motivation could piece together my whole life.  \n  \nLowkey freaking out about it lol.",
        "upvotes": 150,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1ml07rs/been_watching_mr_robot_and_now_im_paranoid_as/"
    },
    {
        "id": "1mkz2o0",
        "author": "wildhawk642",
        "title": "Half Season Releases Are Awful",
        "content": "I really can’t stand these half season releases - I’d so much rather it either be week by week or the full season at a time.  With these half season releases I’m just going to wait until the full season is out and avoid discussions of the first half as best I can, which I think defeats their goal of trying to make series be in the spotlight longer. Either way, between this and their show cancellation decisions, it seems like Netflix figures out the worst thing they could do and then do that thing. ",
        "upvotes": 115,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1mkz2o0/half_season_releases_are_awful/"
    },
    {
        "id": "1ml46er",
        "author": "Lower_Ad_1317",
        "title": "The last update",
        "content": "Is the worst update I have ever seen you do. You have removed functionality in favour of nothing that is of any use. \n\nIt is clumsy and cumbersome and looks like it was designed by someone wanting to quickly put something out with zero idea of how to actually design something that works. \n\nWhy did you Netflix  change to this joke of a system. \n\nYou have made the front end completely annoying to use. And of all the mistakes you have made over the years, this is the one most likely to make me stop my subscription.\n\nWell done. ",
        "upvotes": 33,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1ml46er/the_last_update/"
    },
    {
        "id": "1mky48e",
        "author": "graemeisverytired",
        "title": "The K-pop in KPop Demon Hunters was added at the end to give it spectacle but became the \"spine\" of the Netflix hit",
        "content": "Despite being something that was a relatively late addition to the core idea, it was the K-pop angle that helped bring Maggie’s directing and writing partner, Chris Appelhans, onto the project. “I also grew up as a musician, and I love music as much as I love film, and I always wanted to find a project that had a justification for using music as the spine in not a Disney musical way. As soon as Maggie told me about this, I’m like, ‘This is the one.’”\n\nMore: [https://www.thepopverse.com/movies-kpop-demon-hunters-netflix-music-added-last-k-pop-interview](https://www.thepopverse.com/movies-kpop-demon-hunters-netflix-music-added-last-k-pop-interview)",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mky48e/the_kpop_in_kpop_demon_hunters_was_added_at_the/"
    },
    {
        "id": "1mldf9x",
        "author": "Bulky-Weakness-5445",
        "title": "Game recs",
        "content": "hey guys, looking for game recs on console-like games that are well known on other consoles and would have to be paid for otherwise. looked into sonic mania plus and dead cells, what others? wanted to get hades but got deleted :(cthanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mldf9x/game_recs/"
    },
    {
        "id": "1mkyq0z",
        "author": "AltruisticAide9776",
        "title": "Has anyone started Wednesday season 2 and is finding it boring?",
        "content": "I found season 1 a bit of a drag too , it just doesn't compel you. At least if they had kept Xavier there would be something i d be curious about but as it the episode gelt a bit longer than it needed to be.",
        "upvotes": 6,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1mkyq0z/has_anyone_started_wednesday_season_2_and_is/"
    },
    {
        "id": "1mkuaz7",
        "author": "aaaaaaarrrrrcccccc",
        "title": "Suggest some series",
        "content": "Suggest something that is similar to stranger things or Wednesday I also liked the vampire diaries, outer banks, chilling adventures of sabrina and the umbrella academy.\nI like something mysterious, Sci-fi \nSomething like that idk",
        "upvotes": 6,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1mkuaz7/suggest_some_series/"
    },
    {
        "id": "1ml4qp5",
        "author": "hoopheid",
        "title": "Netflix said to be in talks for MLB Home Run Derby, possibly additional content too",
        "content": "The Red Sox documentary series and the other baseball stuff like The Turnaround, The Comeback etc have been awesome. Live games and big events like this would be another cool addition, if it happens.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ml4qp5/netflix_said_to_be_in_talks_for_mlb_home_run/"
    },
    {
        "id": "1mla390",
        "author": "Kdubhutch",
        "title": "When will Josh Johnson get a comedy special?",
        "content": "I’ve been watching him for about a year now on YouTube and the Daily Show. I think he needs a Netflix Special. When he called a public bus “the people’s limousine” I almost spat out my coffee laughing so hard. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mla390/when_will_josh_johnson_get_a_comedy_special/"
    },
    {
        "id": "1ml961a",
        "author": "OkPainter6232",
        "title": "If Trainwreck gets another season what topics would you like to see get covered?",
        "content": "For me personally I'd LOVE to see them tackle \"Crazy Eddie\" as everything about that story is just nuts and i'm amazed nobody's done a feature length documentary on it yet.\n\nAlso that one time in the 80s where they had people release hundreds of balloons at once which proved to be a disaster and led to some people getting killed.\n\nJoe Millionaire also comes to mind.\n\nAlso Stephen Glass, nuff said.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ml961a/if_trainwreck_gets_another_season_what_topics/"
    },
    {
        "id": "1mkng3z",
        "author": "MoneyLibrarian9032",
        "title": "Michael Bay Exits Netflix’s Will Smith Action Film ‘Fast and Loose’",
        "content": "",
        "upvotes": 19,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mkng3z/michael_bay_exits_netflixs_will_smith_action_film/"
    },
    {
        "id": "1ml4i87",
        "author": "damianradecki",
        "title": "Slow app download?",
        "content": "App is downloading 2-3mb/s max. My internet connection is fine, other apps like Youtube or Prime have normal speed. What could cause this problem? I had this problem for ages on 2 different phones, but now it got a bit more annoying. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ml4i87/slow_app_download/"
    },
    {
        "id": "1ml36ff",
        "author": "ysleez",
        "title": "True Detective S1 or Mindhunter?",
        "content": "Both have a similar kind of pace, maybe True Detective has a bit more action.\n\nFor me, I gotta give it to True Detective solely based on Matthew McConaughey's performance. And emotions felt a lot more intense and intriguing, like when the tape was played on TV, you could feel the disgust. I feel Rust's character has been crafted perfectly, gotta love his firmness and his straight up honesty, anywhere portrayed like more of a crazy person with flaws who makes mistakes but I love how Rust has come to the point of acceptance and is so self aware.\n\nAnd for Mindhunter I'd have loved the next season. I loved the show and I'm very positive on the open ending. Infact I love the imperfect endings of both shows, it doesn't always have to be all smiles or sorrow.\n\nI think you should love Unbelievable too if you loved both the shows.",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ml36ff/true_detective_s1_or_mindhunter/"
    },
    {
        "id": "1ml2bgb",
        "author": "Sea_Cookie2373",
        "title": "Locked in/In Secret",
        "content": "This is the same movie Netflix, just modernized. Love the lack of originality here. I caught it halfway through Locked in.\n\nAnyone else notice this too?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ml2bgb/locked_inin_secret/"
    },
    {
        "id": "1mk7ukr",
        "author": "Dry_Resist8265",
        "title": "Need something new to watch … mystery, drama, rich people problems, good vibe shows?",
        "content": "I’m in a full-on show drought. \n\nJust need something with good story, nice visuals. Mystery or thriller is great, but not full horror. Thanks in advance! ",
        "upvotes": 62,
        "comments": 164,
        "media": null,
        "permalink": "/r/netflix/comments/1mk7ukr/need_something_new_to_watch_mystery_drama_rich/"
    },
    {
        "id": "1mlbc4z",
        "author": "tinksabellx",
        "title": "That 70s Show - UK",
        "content": "Anyone want it back?\n\nI get why it may not be available due to one of the cast, but it was such a good series! I love watching it and wish I could watch it freely on Netflix.\n\nAnyone else wish it would come back?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mlbc4z/that_70s_show_uk/"
    },
    {
        "id": "1mjzix1",
        "author": "LeonNeuton",
        "title": "\"The Internet tantrums have begun.\" -Thanks to Netflix's New split release model.",
        "content": "\nOne common point of contention among both critics and viewers of the new season of Wednesday is Netflix's decision to split the release into two parts. As the first four episodes set up a satisfying new mystery, many feel the mid-season cutoff is abrupt and disrupts the show's momentum, leaving viewers with an \"unsatisfying appetizer\" rather than a complete meal. \n\n\"Fans will have to wait until Wednesday, Sept. 3, for Wednesday Season 2, Part 2 – which will conclude with episodes five through eight.\"\n\nWith so many taking it to the Internet streets; Is the uproar warranted? Or are we just spoiled brats moonlighting as binge divas?",
        "upvotes": 160,
        "comments": 288,
        "media": null,
        "permalink": "/r/netflix/comments/1mjzix1/the_internet_tantrums_have_begun_thanks_to/"
    },
    {
        "id": "1ml49g8",
        "author": "AdamHannibal-1033",
        "title": "Fan tribute to Rebel Moon on Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/gvoorxwthuhf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ml49g8/fan_tribute_to_rebel_moon_on_netflix/"
    },
    {
        "id": "1mky4g2",
        "author": "darkdragonfaerie",
        "title": "My Oxford year allusions",
        "content": "I just watched this film and noticed there were a ton of literary references I didn’t recognize and many I did. I wish I had taken notes.\n\nDoes anyone have the full lists of authors/poets/poems mentioned in this film? Can’t seem to find a comprehensive list on Google yet. Thank you! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mky4g2/my_oxford_year_allusions/"
    },
    {
        "id": "1mkvqac",
        "author": "VecroLP",
        "title": "Is there any way to override the brightness?",
        "content": "I like to watch Netflix on my balcony but every time I sit there during the day Netflix curbstomps my phones brightness to the bare minimum, making it impossible to watch darker shows like Wednesday and stranger things. I know my phone can be brighter because I can see my phones brightness dropping when starting the show, the netflix ui is so much brighter.\n\nThe brightness slider on the left is already set to max, aswell as my phones brightness slider. Is there anything I can do to make use of my phones full brightness while watching Netflix without it just being a black screen with subtitles?\n\nEdit: on android",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mkvqac/is_there_any_way_to_override_the_brightness/"
    },
    {
        "id": "1mjrwod",
        "author": "vladtud",
        "title": "Netflix beauty filter",
        "content": "I really dislike how most Netflix shows have a beauty filter on their female characters. It’s very obvious and distracting while watching. Not that it makes it ok for older characters but what wrinkles does Jenna Ortega even have to hide. Ridiculous! ",
        "upvotes": 207,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1mjrwod/netflix_beauty_filter/"
    },
    {
        "id": "1mkrfyd",
        "author": "According_Purchase75",
        "title": "Recommendations for some good watches",
        "content": "Hey guys! Apologies for any mistakes. It's my first post here. I am looking for some recommendations it doesn't have to be sitcoms but anything light and family friendly. I have watched and love BB99, Modern Family, The Office, The Good Place, Friends while couldn't bare to continue through Big Bang Theory, Schitt's Creek or HIMYM. I can watch anything as long as I feel captivated but since I'm planning to watch the series on my home TV set I'd prefer if the show doesn't contain in any explicit nudity.\n\nThanks!",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mkrfyd/recommendations_for_some_good_watches/"
    },
    {
        "id": "1mkjpcu",
        "author": "Southern-Brother5693",
        "title": "Continue Watching - Glitches",
        "content": "Is anyone facing this issue? My Continue Watching list from time to time suddenly includes all the previous titles I have watched. They disappear when I refresh the App but appear again suddenly.\n\nJust weird.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mkjpcu/continue_watching_glitches/"
    },
    {
        "id": "1mk94dn",
        "author": "Similar-Car-3492",
        "title": "error -1000",
        "content": "my and my mother phone app won't open, it says there is a problem with (-1000) at the end, i can't find anything about it online, anyone here knows what does that mean?\ni forgot to add it does work on the tv \nwe are watching movie on it right now\nit returned to normal but i still have no idea what that -1000 means",
        "upvotes": 12,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1mk94dn/error_1000/"
    },
    {
        "id": "1mkf0fx",
        "author": "Key-Influence-8312",
        "title": "Netflix and Aspect Ratios",
        "content": "I'm planning on setting up a wide screen to watch Gladiator 2 and other wide screen movies. So I was wondering at what aspect ratio does Netflix stream wide screen movies. Any one have any idea? Gladiator 2 for example has a 2.39:1 aspect ratio. \n\n  \nThanks",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mkf0fx/netflix_and_aspect_ratios/"
    },
    {
        "id": "1mkjlrr",
        "author": "Junior_Ostrich_5951",
        "title": "What should I do?",
        "content": "I have the basic Netflix plan and the truth is that I use it at home less at night since I work and well sometimes in my free time I watch one or another series and does it tell me that I should improve the plan to be included in the home plan? How do I solve it, the truth is that it doesn't seem fair to me, I don't even see it with Wi-Fi, I use my mobile data",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mkjlrr/what_should_i_do/"
    },
    {
        "id": "1mkd79w",
        "author": "tinksabellx",
        "title": "Web of Make Believe: Death, Lies &amp; the Internet",
        "content": "Late to the party on this one, but just started watching Web of Make Believe and just finished episode 4: Sextortion.\n\nI’m sure you’re all like me and Google the names of the perpetrators to see where they’re at now….? No? Just me? Nahh I know you’re lying if you say you’ve never done it….\n\nAnyway…\n\nThis episode is based on around 23 girls (literal teenagers) who got a random friend request from a guy and started talking. It then became sexual on his part, and the girls did send some photos of themselves in various states of undress. \nHe then tried to extort them, saying he’ll release the images on the internet first everyone to see.\n\nFinally, after years of harassment, he was named - Ryan Vallee - arrested and charged. He pled guilty and got 8 years.\n\nHe was released in January 2022. So, natural I googled.\n\nOh and low and behold, he’s recently been arrested (this year, April 2025) for having:\n- 175 images\n- 11 video files\nOf child SA on his devices! \n\nNo court date as of yet. But, what a straight up piece of 💩!\n\n———\n\nArticles:\n\nhttps://indepthnh.org/2025/05/05/child-porn-convict-featured-in-netflix-sextortion-documentary/\n\nhttps://www.justice.gov/usao-nh/pr/harrisville-man-plead-guilty-possessing-child-sexual-abuse-material-while-federal",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mkd79w/web_of_make_believe_death_lies_the_internet/"
    },
    {
        "id": "1mjn139",
        "author": "pvpixelarts",
        "title": "Untamed is just so so",
        "content": "Just my personal opinion on Untamed series. \n\nIt was so much hyped up IMO. No depth in the story line and I could not keep myself engaged in the series at all. What you all think? ",
        "upvotes": 79,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1mjn139/untamed_is_just_so_so/"
    },
    {
        "id": "1mkh7dk",
        "author": "Chris_Nexton",
        "title": "Your Avatar",
        "content": "Do you have any flexibility in your choice of avatar for Netflix? I’m presented with cartoonish characters and characters from shows I don’t watch, so can I put my photo there if I want? I see no way to do that, but thought I’d ask nonetheless.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mkh7dk/your_avatar/"
    },
    {
        "id": "1mk4rmd",
        "author": "EnvironmentalOne8630",
        "title": "Looking for tv series recommendations",
        "content": "I tend to like more realistic shows but an open to all genres for the most part just no anime or cheesy cliche written stories. My favorites include\n\nLost\nThe leftovers\nThe stand\nMr robot\nAmerican primeval \nThe man in the high castle\nMindhunter\nOzark\nBloodline\nThe crowded room (very insane)\nMobland \nThe last of us (season one only)\nWalking dead\n\nThat’s all I can come up with at the top of my head and I do like most of Tyler Sheridan shows except for lioness and landman was “ok” would have been better without the obnoxious ex wife and daughter. The ones listed above are generally the shows I tend to enjoy. \n",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mk4rmd/looking_for_tv_series_recommendations/"
    }
]