[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p63sl8",
        "author": "AstralKatOfficial",
        "title": "How do I get netflix to realize I dont give two shits about wrestling?",
        "content": "So for some stupid reason, Netflix has been pushing wrestling HARD on my account for the past few months, not only have I never engaged with anything that'd suggest I want to watch wrestling content, but I've even gone into the info tabs and put \"Not for me\" on all the available ones and *still* whenever some new wrestling thing comes out, it shoves the ENTIRE CATEGORY right back onto my home page... I literally only use Netflix for its originals or shows like The Good Place, please tell me how to get this shit off my home screen for good",
        "upvotes": 87,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1p63sl8/how_do_i_get_netflix_to_realize_i_dont_give_two/"
    },
    {
        "id": "1p5y3fm",
        "author": "KnopeLeslieKnope",
        "title": "Shows Recommendation",
        "content": "Hey guys! So my Netflix subscription renews March 2026 and that's when I'll be canceling. Are there any shows you would recommend me to watch? It's my least streamed service lately and I wanna get the last bang for my buck! I prefer shows that have all of their seasons completed. I also don't mind if a show has been canceled. Give me your recs, please!",
        "upvotes": 18,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1p5y3fm/shows_recommendation/"
    },
    {
        "id": "1p634my",
        "author": "Jason2648",
        "title": "need some good gory horror movies",
        "content": "stuff like hostel,saw,terrifier,etc\n\nim rebuilding my list on netflix and need some good horror movies and i like really gory and disturbing ones, i watched that frankenstein movie but i honestly like slasher type horror movies more",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p634my/need_some_good_gory_horror_movies/"
    },
    {
        "id": "1p5zgpf",
        "author": "Jazzlike_Ad_8236",
        "title": "Black Rabbit “One Month Earlier”",
        "content": "So I just watched the first scene of Black Rabbit then turned it off. Idk if I’m alone in this, but i absolutely cannot stand when a show opens with the climax, then cuts halfway thru to a previous point in time. To me it feels like such a cheap and lazy way to create intrigue. I cannot think of a single instance where there’s a narrative purpose for it. Anyone else feel that way?\n\n(Sidenote: ik I can’t judge the show, but the dialogue in that one scene was so bad I was worried I wouldn’t like the show. Legit the first line is “well that is definitely the most amount of money I’ve ever had in this safe” that is the most expository line I’ve ever heard)",
        "upvotes": 9,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1p5zgpf/black_rabbit_one_month_earlier/"
    },
    {
        "id": "1p5seiv",
        "author": "afk_exe",
        "title": "Netflix wants you to stream its video podcasts in between binge-watching its shows.",
        "content": "",
        "upvotes": 19,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p5seiv/netflix_wants_you_to_stream_its_video_podcasts_in/"
    },
    {
        "id": "1p61ayb",
        "author": "ZoopZap",
        "title": "What is the most absurd/weird anime I can watch on netflix rn?",
        "content": "Title pretty much sums it up. I want to find an anime with the most layers of batshit insanity, simply because I like shows like that. A lot of my friends are into anime as well, so I want something I can bond with them with while also enjoying my type of shows",
        "upvotes": 4,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1p61ayb/what_is_the_most_absurdweird_anime_i_can_watch_on/"
    },
    {
        "id": "1p5in2i",
        "author": "hard2resist",
        "title": "Thriller Series Like \"YOU\"  Need Recommendations for Non-Stop Suspense &amp; Dark Psychological Twists",
        "content": "I'm looking for recommendations for series or movies on Netflix or Prime Video that match the psychological thriller and suspense vibe of YOU.\n\nWhat I'm looking for:\n\n\t\\* Crime thrillers with strong suspense elements\n\n\t\\* Action-packed series that keep you on edge\n\n\t\\* Shows with psychological depth and dark themes\n\n\t\\* Fast-paced storytelling that hooks you from episode one\n\nI loved YOU for its unpredictable plot twists and the way it kept me guessing. Now I need something that delivers that same intensity and gripping atmosphere.\n\nWhat are your top picks for thriller series that deliver non-stop suspense and action? Bonus points if it's something that's criminally underrated.",
        "upvotes": 25,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1p5in2i/thriller_series_like_you_need_recommendations_for/"
    },
    {
        "id": "1p66890",
        "author": "basedgod1995",
        "title": "Soap opera effect in Last Samurai Standing",
        "content": "On episode 4. The motion seems off though. I have all settings that cause soap opera effect set to off but this episode seems oddly uncanny in motion. Not sure what happened lol\n\nAnyone else notice this?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p66890/soap_opera_effect_in_last_samurai_standing/"
    },
    {
        "id": "1p64jzx",
        "author": "SonjasInternNumber3",
        "title": "My games category tab is gone",
        "content": "I never paid any attention to the games section until about 2 days ago when Pictionary was getting pushed to me. Now my kid loves is and we thought it would be fun to play this week and on thanksgiving day with the family. Now it’s just gone! No games tab, cant even search it because nothing shows up. I’m so confused what happened, anyone else have the issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p64jzx/my_games_category_tab_is_gone/"
    },
    {
        "id": "1p67fmt",
        "author": "psychofanPLAYS",
        "title": "Will Netflix ever give up ??",
        "content": "Hey there Reddit!\n\nI wanted to ask whether you guys think it’s okay for a company to try to charge your CC for months on end. I use an Apple Cash card for any online purchases and subscriptions, so they don’t drain my accounts when I don’t use them unnecessarily. Or when they all will inevitably get a data breach, I’m sorta ok.. I got a Netflix subscription for the last time on 8/22/25-9/22/25 &lt;- paid period. \nToday we have 11/25/25 - they have tried again on last Thursday 11/20/25. When I go on their website, after looking around and struggling to get through the annoying banners that force you only to restart your sub - because there is no clear way to get to your account. You’re there just to “restart” obv. There is no way to delete my cc info with Netflix either with their app or on the website. I find this incredibly scummy.\n\nHere is the pic proof:\n\nimgur.com/a/AjTMgSR\n\nHere is a AI extracted data if u don’t wanna click the link:\n\n```python\n\n# AI-extracted Netflix charges from Apple Wallet\n\n| #  | Date      | Amount | Status    | Notes                                      |\n|----|-----------|--------|-----------|--------------------------------------------|\n| 1  | 8/22/25   | $19.43 | Approved  | Card Number Used (successful charge)       |\n| 2  | 9/22/25   | $19.43 | Declined  | Insufficient Funds                         |\n| 3  | 9/22/25   | $19.43 | Declined  | Insufficient Funds (second attempt)        |\n| 4  | 9/24/25   | $19.43 | Declined  | Incorrect Card Information                 |\n| 5  | 9/26/25   | $19.43 | Declined  | Incorrect Card Information                 |\n| 6  | 9/27/25   | $19.43 | Declined  | (Reason not shown)                         |\n| 7  | 9/29/25   | $19.43 | Declined  | Incorrect Card Information                 |\n| 8  | 10/2/25   | $19.43 | Declined  | Incorrect Card Information                 |\n| 9  | 10/4/25   | $19.43 | Declined  | Incorrect Card Information (attempt #1)    |\n| 10 | 10/4/25   | $19.43 | Declined  | Incorrect Card Information (attempt #2)    |\n| 11 | 10/6/25   | $19.43 | Declined  | Incorrect Card Information                 |\n| 12 | 10/8/25   | $19.43 | Declined  | Incorrect Card Information                 |\n| 13 | 10/10/25  | $19.43 | Declined  | Incorrect Card Information                 |\n| 14 | 10/11/25  | $19.43 | Declined  | Incorrect Card Information                 |\n| 15 | 10/12/25  | $19.43 | Declined  | (Reason not shown)                         |\n| 16 | 10/17/25  | $19.43 | Declined  | (Reason not shown)                         |\n| 17 | 10/19/25  | $19.43 | Declined  | (Reason not shown)                         |\n| 18 | 10/30/25  | $19.43 | Declined  | (Reason not shown)                         |\n| 19 | 11/8/25   | $19.43 | Declined  | (Reason not shown)                         |\n| 20 | Thursday  | $19.43 | Declined  | Most recent attempt (shown as 'Thursday')  |\n\n```\n\n\n",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1p67fmt/will_netflix_ever_give_up/"
    },
    {
        "id": "1p61ksa",
        "author": "swimming_onions",
        "title": "Pixelated",
        "content": "Multiple shows are super pixelated and all others are totally fine... what's going on? Already updated app. This is happening on my Xbox one. Someone please help",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p61ksa/pixelated/"
    },
    {
        "id": "1p65om7",
        "author": "AssociateLittle1487",
        "title": "Will you watch Squid Game America?",
        "content": "It was recently confirmed filming begins in February 2026.  \nI'm a little skeptical of its quality since Squid Game Season 3 turned out to be quite bad. However, because it's directed by David Fincher, I'm also a bit hopeful that it might not be so bad after all. I only hope the series is kept to like one or two seasons without repeating the games more than once since it'll probably get boring after the first Games.",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1p65om7/will_you_watch_squid_game_america/"
    },
    {
        "id": "1p4l0s5",
        "author": "hard2resist",
        "title": "What Netflix show kept you up all night binge-watching recently?",
        "content": "I just finished The Beast in Me in one sitting and realized I haven't had that \"just one more episode\" feeling in a while. Now I'm looking for my next obsession.\n\nWhat's the last Netflix show that had you completely hooked? The kind where you tell yourself you'll watch one episode and suddenly it's 3 AM.\n\nLooking for something that grabs you from episode one and doesn't let go.",
        "upvotes": 1264,
        "comments": 939,
        "media": null,
        "permalink": "/r/netflix/comments/1p4l0s5/what_netflix_show_kept_you_up_all_night/"
    },
    {
        "id": "1p5lgij",
        "author": "redd84x",
        "title": "Brooklyn 99 vs The Office US - Which one stays?",
        "content": "These are my two comfort-rewatch shows on Netflix. I’ve gone through both more times than I can count, and they somehow never get old.\n\nBut if only one could stay on Netflix…\nWhich one would you keep, and why?\n\nIf I had to choose, I’d probably keep Brooklyn 99 (big Andy Samberg fan here, sorry Steve).",
        "upvotes": 6,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1p5lgij/brooklyn_99_vs_the_office_us_which_one_stays/"
    },
    {
        "id": "1p66v3f",
        "author": "UthrWrldFilms",
        "title": "Let me know if you would watch this on Netflix",
        "content": "I just finished this, really talented artists.  Would love to know the public opinion!  Don't be too harsh.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p66v3f/let_me_know_if_you_would_watch_this_on_netflix/"
    },
    {
        "id": "1p5ptzl",
        "author": "Beginning_Bridge_272",
        "title": "squid game season 1 was the best",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p5ptzl/squid_game_season_1_was_the_best/"
    },
    {
        "id": "1p5bv0e",
        "author": "Curious-Monitor497",
        "title": "Need recommendations for thrillers",
        "content": "Please recommend really good thriller shows/movies. Mainly short series, as I don't want to watch multiple seasons to get a conclusion. \n\nI recently watched the following:\nMindhunter (liked this, but 2 seasons of detectives working on sexual crimes was too disturbing)\nThe sinner (liked this)\nBodkin (liked this)\nUntamed (it was okay, not a fan)\nInside man (okay, not a fan)",
        "upvotes": 9,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1p5bv0e/need_recommendations_for_thrillers/"
    },
    {
        "id": "1p5rpbb",
        "author": "Environmental-Flan11",
        "title": "I can’t use the Netflix app on my tv",
        "content": "I have a problem and it is that the Netflix application does not detect my smart TV and I have already tried all the recommendations that Netflix gave and nothing worked, what can I do? (And before they ask, it's not the TV control, it's from the app)",
        "upvotes": 1,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1p5rpbb/i_cant_use_the_netflix_app_on_my_tv/"
    },
    {
        "id": "1p4wmz4",
        "author": "peacharooroo",
        "title": "What’s up with all the blue and brown in The Beast In Me",
        "content": "I’m curious what the purpose is behind the color scheme in The Beast In Me. All the characters wear shades of blue and brown through each episode, and all their eyes are bright blue. Beyond that, the houses, apartments and business offices all have blue and brown walls and accent pieces, even the outdoor Safari birthday party has decor and guests in those colors. There are also smaller accents of purples and greens. There’s enough to let me know it was more than intentional, it’s meant to be noticed. But why? ",
        "upvotes": 73,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1p4wmz4/whats_up_with_all_the_blue_and_brown_in_the_beast/"
    },
    {
        "id": "1p5q0hs",
        "author": "TextThis8793",
        "title": "Missing: Dead or alive",
        "content": "Is this show fake? Vicki seems so insincere putting on a fake sad face when victims are mourning. S2E4 the fact that the officers, family, and accused misgender Shandon every time is so disrespectful! Southern states…",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1p5q0hs/missing_dead_or_alive/"
    },
    {
        "id": "1p5posn",
        "author": "techniscalepainting",
        "title": "netflix at two different locations?",
        "content": "I have a home and an apartment which i am often staying at for extended periods\n\nnetflix is registered to use my home wifi as the \"household\" however in the apartment i have a desktop pc which i use while im there, including watching netflix\n\nI have seen that to allow you to keep using netflix on a mobile device on other wifis you have to log into it once a month on the home wifi, however that obviously isnt possible with the desktop\n\n  \nis there a way that i can watch netflix at both the home address, and on the apartment desktop pc, without having to go through the steps of allowing temporary access every 2 weeks? \n\n",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1p5posn/netflix_at_two_different_locations/"
    },
    {
        "id": "1p61l0t",
        "author": "Kurtz62",
        "title": "Kevin Hart’s new special",
        "content": "I am just getting done watching Kevin Hart’s New Netflix special “Acting My Age” that dropped today and only complaint I have is that it wasn’t long enough.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p61l0t/kevin_harts_new_special/"
    },
    {
        "id": "1p5opf5",
        "author": "ChallengeAdept8759",
        "title": "Meet the game designer who lied his way through ‘Squid Game: The Challenge’",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p5opf5/meet_the_game_designer_who_lied_his_way_through/"
    },
    {
        "id": "1p5c034",
        "author": "Lazii_Xy",
        "title": "HOW DO I TURN OFF THE BETA SEARCH",
        "content": "This is gonna send me into some weird frenzy. I literally cannot escape the Beta AI search after accidentally somehow turning it on and it's driving me nuts. Someone please tell me how to get rid of it cause there's NO option up to opt out on my screen.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p5c034/how_do_i_turn_off_the_beta_search/"
    },
    {
        "id": "1p586fm",
        "author": "MiddlePath2",
        "title": "Should I watch the series 'Supernatural'?",
        "content": "What are 3 episodes I can watch that will pull me into the show without revealing too much lore? \n\nLike filler episodes.\n\n(I want to see if its even going to pull me in before I start from episode 1 and get too invested into something I dont like) \n\nPreferably scary episodes.",
        "upvotes": 5,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1p586fm/should_i_watch_the_series_supernatural/"
    },
    {
        "id": "1p5gwr8",
        "author": "chowchowchow4321",
        "title": "This Is Going To Hurt terminologies?",
        "content": "I work for a US health system and just started watching this.  I am very confused by their roles - like they call Lockhart “Mr” Lockhart, “consultant”, but he is clearly as surgeon as he is seen in scrubs performing surgery.  In US they would call him Dr. Lockhart and refer to him as Supervising Attending.  The “supervising” title may vary by health system, but he would officially be know as Attending Surgeon.\n\nAlso is Tracy a nurse or a midwife? Or are those interchangeable over the pond?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1p5gwr8/this_is_going_to_hurt_terminologies/"
    },
    {
        "id": "1p57g32",
        "author": "Techiesarethebomb",
        "title": "Netflix Games Doesn't Work for New Samsung TVs?",
        "content": "So I have a 2023 Samsung QLED TV and I tried to access the netflix games selection (tetris, boggle, pictionary, lego party) and I noticed when I clicked on it I got the \"play on select TVs only\" response...but when I go to the FAQ my TV clearly looks like one of the eligible smart TVs to use it. It's fully updated and I am just confused why my TV can't access it. Has anyone else had this problem?",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1p57g32/netflix_games_doesnt_work_for_new_samsung_tvs/"
    },
    {
        "id": "1p562in",
        "author": "wilcojunkie",
        "title": "Netflix Fire TV app issue - content immediately starts",
        "content": "I feel like this is a bit of a Boomer app tech question but, here goes. I use the Netflix app for my smart TV. I haven't used it in a while but, when I go to click a movie or show instead of a landing page appearing where you can see the info, add it to your watchlist etc, the content immediately starts. So I can't figure out if this is a settings issue or what. No clue. Anyone have any idea on what to do or have encountered this issue before? ",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p562in/netflix_fire_tv_app_issue_content_immediately/"
    }
]