[
    {
        "id": "1o36ttf",
        "author": "SmashingMachineAMA",
        "title": "Hey reddit, I'm Benny Safdie. I've co-written/co-directed Uncut Gems, Good Time, and Heaven Knows What. My newest film, The Smashing Machine (starring Dwayne Johnson &amp; Emily Blunt), is out in theaters now. You might've seen me in The Curse, Oppenheimer, and Happy Gilmore 2. Ask me anything!",
        "content": "Hey reddit, I'm Benny Safdie, here to answer your questions. \n\nYou might know me as the co-writer/co-director of Uncut Gems, Good Time, Heaven Knows What, Lenny Cooke, and Daddy Longlegs. Or maybe from The Curse, Oppenheimer, Licorice Pizza, Happy Gilmore 2.\n\nMy new film stars Dwayne Johnson &amp; Emily Blunt and is out in theaters everywhere now.\n\n**The Smashing Machine:**\n\nMMA fighter Mark Kerr reaches the peak of his career but faces personal hardships along the way.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=aRpnP3LZ99g](https://www.youtube.com/watch?v=aRpnP3LZ99g)\n\nAsk me anything! Back at 5 PM ET today to answer your questions.",
        "upvotes": 2376,
        "comments": 979,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0ecr77irgbuf1.jpeg?auto=webp&amp;s=d63eba10421b15377a27d15bab4cc9204536d55a"
        },
        "permalink": "/r/movies/comments/1o36ttf/hey_reddit_im_benny_safdie_ive/"
    },
    {
        "id": "1o2yxrf",
        "author": "HarrisDickinsonAMA",
        "title": "Hey /r/movies. I'm Harris Dickinson. You might've seen me in Triangle of Sadness, The Iron Claw, Babygirl, The King's Man, Beach Rats, Blitz, Scrapper, Where the Crawdads Sing, See How They Run, Matthias &amp; Maxime, Maleficent: Mistress of Evil, The Souvenir Part II. Ask me anything :)",
        "content": "Hey r/movies. I'm Harris Dickinson. You might've seen me in Triangle of Sadness, The Iron Claw, Babygirl, The King's Man, Beach Rats, Blitz, Scrapper, Where the Crawdads Sing, See How They Run, Matthias &amp; Maxime, Maleficent: Mistress of Evil, The Souvenir Part II.\n\nAsk me anything :)\n\nMy new film (and directorial debut), URCHIN, stars Frank Dillane &amp; Megan Northam. It premiered in the Un Certain Regard section of Cannes and is out in select theaters starting 10/10.\n\nSynopsis:\n\nA young addict living on the streets of London is given a shot at redemption, but his road to recovery soon curdles into a strange odyssey from which he may never escape.\n\nTrailer:\n\n[https://www.youtube.com/watch?v=xUnNNwA4MiA](https://www.youtube.com/watch?v=xUnNNwA4MiA)\n\nAsk me anything! I'll be back at 3 PM ET today to answer your questions.",
        "upvotes": 1084,
        "comments": 334,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4lslc16px9uf1.jpeg?auto=webp&amp;s=50756b55c0e72acb7ea3c5c5ded2cf3b06ea64e5"
        },
        "permalink": "/r/movies/comments/1o2yxrf/hey_rmovies_im_harris_dickinson_you_mightve_seen/"
    },
    {
        "id": "1o43o4e",
        "author": "BunyipPouch",
        "title": "Actress Diane Keaton has died at the age of 79",
        "content": "",
        "upvotes": 32255,
        "comments": 1750,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OLsNWXKy6GAcVZ_kqBAN21-bwBpB_ou8kpLLF2wVGzs.jpeg?auto=webp&amp;s=fd0ff9710f9a8fbc85cf644376c0b617e93c0572"
        },
        "permalink": "/r/movies/comments/1o43o4e/actress_diane_keaton_has_died_at_the_age_of_79/"
    },
    {
        "id": "1o4nmtt",
        "author": "crushedmoose",
        "title": "Love and Death (1975) - What if there is no God? Directed by Woody Allen , Starting Diane Keaton",
        "content": "",
        "upvotes": 462,
        "comments": 99,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/65vy9v70aouf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1o4nmtt/love_and_death_1975_what_if_there_is_no_god/"
    },
    {
        "id": "1o4f5b5",
        "author": "LollipopChainsawZz",
        "title": "Warner Bros. Is Said to Rebuff Paramount Takeover Approach",
        "content": "",
        "upvotes": 1360,
        "comments": 135,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cqnp31r2Cd3mFrOhZz08ppJmn-53p51ZpUFTFEWoFzE.jpeg?auto=webp&amp;s=17d78c7207393edb28adc6aa1c7e46e66b2fc540"
        },
        "permalink": "/r/movies/comments/1o4f5b5/warner_bros_is_said_to_rebuff_paramount_takeover/"
    },
    {
        "id": "1o4s7ym",
        "author": "MarvelsGrantMan136",
        "title": "Jason Blum Says James Wan Will Be Hugely Involved in the ‘SAW’ Franchise’s Future",
        "content": "",
        "upvotes": 81,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lFCubDT2FIA5RSNYsayq2YPpFipdcDZPww4xE-ohxAc.jpeg?auto=webp&amp;s=3d7743e59a2bfbaac659652c14a11db6a5b26737"
        },
        "permalink": "/r/movies/comments/1o4s7ym/jason_blum_says_james_wan_will_be_hugely_involved/"
    },
    {
        "id": "1o4q0wk",
        "author": "bourj",
        "title": "The Manhattan Project is an exceedingly well-made 80s teen thriller.",
        "content": "I don't like to praise random films that I like, but as I'm rewatching The Manhattan Project, I'm struck every time by how *good* it is. Far beyond what is expected. \n\nChristopher Collett is incredible. His protagonist is smart, way beyond smart in some ways (and oblivious in othes), but also charming, athletic, has good relationships with adults in his life, and he's also a bit of a smarmy asshole. He's like Zack Morris, if he had the brain of Screech but the inability to think past the immediate like Zack often does. He's almost a prototype for the Mark Zuckerberg character in The Social Network.\n\nThe film doesn't rely on stereotypes. Cynthia Nixon's performance is so elegantly subtle. Her mature perception of the situation, her subtle delivery of dialogue,her ability to evoke emotion with a word or a gesture--it all works so well. And John Lithgow is such a smart and likable guy, it's hard to not feel bad for him as the situation gets worse and worse. And John Mahoney is the perfect no-nonsense military man who also is honest and direct about the role people play in the military-industrial complex.\n\nThe main character is a kid who constructed a nuclear bomb not to harm anyone, but just to see if he could. He's a mad scientist in the purest sense of the label. And the schemes he creates to get the materials, to escape once caught, and to deal with the aftermath are both extremely clever and highly realistic. \n\nOh, and the group of nerds are hilarious. And did I mention Robert Sean Leonard had a small role in it?\n\nMy last plug for watching this film: Roger Ebert gave it four (4) stars.\n",
        "upvotes": 87,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1o4q0wk/the_manhattan_project_is_an_exceedingly_wellmade/"
    },
    {
        "id": "1o4qdw0",
        "author": "DamnDogInapropes",
        "title": "Dead Man (1996) - Startling beauty combined with actions of devastating cruelty - Directed by Jim Jarmusch and starring Johnny Depp, Robert Mitchum, Crispin Glover, Gary Farmer, and on and on. Music by Neil Young.",
        "content": "",
        "upvotes": 54,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1o4qdw0/dead_man_1996_startling_beauty_combined_with/"
    },
    {
        "id": "1o3x0js",
        "author": "Neo2199",
        "title": "Idiocracy (2006): President Dwayne Elizondo Mountain Dew Herbert Camacho's 2505 State of the Union Address",
        "content": "",
        "upvotes": 4213,
        "comments": 288,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Etp8aWhZqWmZtMu05MOkPz3ycJA-7j-QvoYusMa07w8.jpeg?auto=webp&amp;s=d1844d331e76a02b857e610f445a33f9baca7c8a"
        },
        "permalink": "/r/movies/comments/1o3x0js/idiocracy_2006_president_dwayne_elizondo_mountain/"
    },
    {
        "id": "1o4fke6",
        "author": "Business_Coffee_9421",
        "title": "2025's film that's been most overlooked?",
        "content": "I'm talking more specifically about which movie that had some bigger names and was actually good but had very little buzz and wasn't very popular at all?\n\nFor my personal pick I have to go with The Assessment. Alicia Vikander and Elizabeth Olsen star and the movie barely made a peep and lasted in theaters for about a week.",
        "upvotes": 304,
        "comments": 279,
        "media": null,
        "permalink": "/r/movies/comments/1o4fke6/2025s_film_thats_been_most_overlooked/"
    },
    {
        "id": "1o4r8en",
        "author": "BunyipPouch",
        "title": "Poster for the 4K Restoration &amp; Theatrical Re-Release of Leos Carax's 'The Lovers on the Bridge' - Starring Juliette Binoche and Denis Lavant",
        "content": "",
        "upvotes": 34,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/csq1m1f63puf1.jpeg?auto=webp&amp;s=363c092615eab4b27907f5cd9deeb92188d573af"
        },
        "permalink": "/r/movies/comments/1o4r8en/poster_for_the_4k_restoration_theatrical/"
    },
    {
        "id": "1o455t2",
        "author": "NobodieInteresting",
        "title": "Movies where the Director's cut or Extended cut is wayy worse than the original theatrical cut?",
        "content": "Donnie Darko's director's cut is something I could do without. The original cut was soooo good - everything was *just right* but in the DC they overexplain everything and kill the pacing of the movie somehow.\n\nOn another note, the Justice League 2017 sucked so bad it should have never been made, but ZSJL's stretched 4h+ runtime was just *okay*. Like, it's wayyy better than JL, but still not great. The story was so drawn out, and the slo-mo in every scene was just so uninteresting/uninspired (sesame seed falling from the trucker's burger, Lois putting down her coffee cup). As one reviewer put it, \"You could cut an hour without affecting the plot even a little.\" Also, why format a film for IMAX full knowing it would be released on the HBO streaming service. (Disclaimer: not hating on ZS, it's just my opinion)",
        "upvotes": 893,
        "comments": 1074,
        "media": null,
        "permalink": "/r/movies/comments/1o455t2/movies_where_the_directors_cut_or_extended_cut_is/"
    },
    {
        "id": "1o4axjb",
        "author": "EnvironmentalKey5350",
        "title": "What's your favorite movie that no one else seems to have seen?",
        "content": "One of my favorite movies is Return To Me. And every time I mention it so someone they have never even heard of it. It's a romantic comedy with David Duchovny and Minnie Driver. It makes me laugh and cry every time I watch it. Does anyone else have a movie they love, that no one else seems to know or remember? ",
        "upvotes": 401,
        "comments": 1429,
        "media": null,
        "permalink": "/r/movies/comments/1o4axjb/whats_your_favorite_movie_that_no_one_else_seems/"
    },
    {
        "id": "1o458ef",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Mortal Kombat II'",
        "content": "",
        "upvotes": 792,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3p3majmggjuf1.jpeg?auto=webp&amp;s=27ba0465c9ed735ff0a93005507aa539146daecb"
        },
        "permalink": "/r/movies/comments/1o458ef/new_poster_for_mortal_kombat_ii/"
    },
    {
        "id": "1o4rcci",
        "author": "CometKICK01",
        "title": "I just realized I grew up watching the worst of The Neverending Story movies",
        "content": "I think i watched all 3 in reverse now that I think about it. As a toddler I watched the 3rd movie over and over. then, as I got older, I saw the second movie. Then as a teen I saw the 1st one.\n\nI went completely ass-backwards with these movies growing up. I have fond memories of the 3rd movies but something tells me I try to go watch it now and I probably won't be able to finish it.\n\nThen again, I watched several Neil Breen movies just for a good laugh.\n\nOh yeah, Jack Black is a bad guy in the 3rd movie",
        "upvotes": 17,
        "comments": 70,
        "media": null,
        "permalink": "/r/movies/comments/1o4rcci/i_just_realized_i_grew_up_watching_the_worst_of/"
    },
    {
        "id": "1o4t6fc",
        "author": "AlexRecacha",
        "title": "From \"Guy and Madeline\" to \"LA LA LAND\", here is a recap of all Damien Chazelle back and forth scenes.",
        "content": "",
        "upvotes": 17,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/740okgtigpuf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1o4t6fc/from_guy_and_madeline_to_la_la_land_here_is_a/"
    },
    {
        "id": "1o4fr1t",
        "author": "AceAttorneyFan12",
        "title": "Why was it so brutal (Casino 1995)",
        "content": "So I just watched it for the first time, enjoyed it a lot. The ending where they beat the shit out of the brothers was so horrible. Usually I’m fine  with bloody scenes but something about it was terrible. I felt like I was gonna vomit during it. Basically the most I’ve ever been disturbed by a movie. But it was great film.",
        "upvotes": 131,
        "comments": 201,
        "media": null,
        "permalink": "/r/movies/comments/1o4fr1t/why_was_it_so_brutal_casino_1995/"
    },
    {
        "id": "1o47g2e",
        "author": "NoCulture3505",
        "title": "New Line Eyeing ‘Mortal Kombat III’ With Jeremy Slater Returning As Screenwriter",
        "content": "",
        "upvotes": 340,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jZjPGHAuJHILlujN6wxP27bKOx5dkAfchdu0Y_5F-go.jpeg?auto=webp&amp;s=1d2a73467202ecab5af6e39cbea6b0193edba212"
        },
        "permalink": "/r/movies/comments/1o47g2e/new_line_eyeing_mortal_kombat_iii_with_jeremy/"
    },
    {
        "id": "1o3wyiu",
        "author": "Alternative-Cake-833",
        "title": "What's the most inappropriate use of a song in a movie trailer?",
        "content": "Years ago when Imagine Dragons was at its peak of their popularity, everybody was using their songs in commercials and trailers (e.g. Friction for Mission: Impossible - Fallout and Warriors for Wonder Woman). But for some reason, someone thought that using Believer in the trailer Murder on the Orient Express (2017) was a good idea for a period piece mystery film, set in the 1930s.\n\nAnd that song did not work in the trailer at all. It was way too modern for a film set in the '30s and it was a weird song choice as well too for that trailer. That was definitely a weird moment during that period, before we even had slowed down songs in movie trailers.\n\nI give a special shout-out to Suicide Squad (2016) using Queen's Bohemian Rhapsody too and that was because the trailer was such a huge hit, WB hired the company that edited the trailer, to re-edit the movie as well. And it certainly didn't help the movie's quality at all lol.",
        "upvotes": 982,
        "comments": 433,
        "media": null,
        "permalink": "/r/movies/comments/1o3wyiu/whats_the_most_inappropriate_use_of_a_song_in_a/"
    },
    {
        "id": "1o46d3p",
        "author": "EuphoricButterflyy",
        "title": "The Car (1977)- Hurting the Car’s feelings scene. Directed by Elliot Silverstein",
        "content": "",
        "upvotes": 232,
        "comments": 65,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qh14bfxtojuf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1o46d3p/the_car_1977_hurting_the_cars_feelings_scene/"
    },
    {
        "id": "1o4r8sa",
        "author": "BunyipPouch",
        "title": "'Lovers on the Bridge' - Official Trailer - 4K Restoration",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XueEUZmZ9ETQ6KOy6Q8uN_jjIMCeFzPJGcawhOGdZcA.jpeg?auto=webp&amp;s=f291f10de8d6ed8a233ce3510ae95016bafc1703"
        },
        "permalink": "/r/movies/comments/1o4r8sa/lovers_on_the_bridge_official_trailer_4k/"
    },
    {
        "id": "1o3mzem",
        "author": "NewSunSeverian",
        "title": "Shutter Island is so sad on a rewatch.",
        "content": "When you know what everyone’s governing motivation is, and you see how they’re all really struggling to help this one guy, it hits even harder. \n\nIt’s one of the greatest films ever to rewatch when you know what the entire situation is, not just because it’s interesting as a twisty Twilight Zone story, but because it’s so empathetic. There’s a real heart to this movie. \n\nBen Kingsley especially as that character was brilliant casting because he often plays villains and has a generally menacing countenance, but he’s ultimately revealed to be the kindest human imaginable.  ",
        "upvotes": 3774,
        "comments": 298,
        "media": null,
        "permalink": "/r/movies/comments/1o3mzem/shutter_island_is_so_sad_on_a_rewatch/"
    },
    {
        "id": "1o4mtmd",
        "author": "AporiaParadox",
        "title": "Concerns about society and the future seen in older movies but not in the modern day",
        "content": "Movies, like any work of fiction, often tackle concerns that people at the time had about society. Some of these concerns are still as relevant as they ever were, like war, ecological devastation, poverty, racism, sexism, etc. But other more specific concerns and fears of the past are no longer relevant because they're either no longer an issue or no longer perceived to be that big of a problem compared to others.\n\nOne notable example is how a lot of sci-fi movies of the past set in the future like Logan's Run or Soylent Green dealt with worlds ruined by overpopulation, which was a real concern people had at the time. Today, we have over 8 billion people on Earth, yet overpopulation is no longer seen as a concern. In the past the fear was that overpopulation would mean not enough food, but thanks to advancements in agriculture we actually produce more than enough food to feed everyone, we just really suck at distributing it properly. Many countries actually have the opposite problem of low birth rates, making concerns about overpopulation even more of an alien concept to modern audiences. Growing populations actually do have a serious impact on the environment in the real world, but that is sadly not something society or the media care about as much.\n\nChanging socio-political circumstances also make concerns go away. Lots of 80s and early 90s American movies like Rising Sun, Blade Runner, Alien, or even Back to the Future II predicted that Japan would take over the world with their mighty economy because back then the Japanese economy was doing very well compared to the America. But then the Japanese economy crashed and the idea of Japan ever taking over the world is no longer taken seriously, replaced instead by fears of China taking over. And of course, all of the movies made during the Cold War about the dangers of the Soviet Union and communism taking over were topical for the time but now no longer a concern.\n\nAnd then there's Birth of a Nation and other racist movies of the time, which showed how racist white people were terrified about the idea of black people having any power in society, as such the KKK preventing black people from voting is seen as a happy ending. Obviously racism is very much still around, but it's nowhere near this bad.\n\nSo what other concerns and fears about society and the future seen in older films are no longer seen as a problem or not as big of a problem?",
        "upvotes": 13,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1o4mtmd/concerns_about_society_and_the_future_seen_in/"
    },
    {
        "id": "1o4qen6",
        "author": "gatormenade",
        "title": "Predestination movie",
        "content": "Has anyone seen Predestination with Ethan Hawk? Specifically, has anybody gone through the circle of how she would have given birth to herself? If so, I need to ask you a question lol. Every so often I think about this movie and it drives me absolutely freaking insane. Tonight I was thinking about when she said \"And I stopped shooting blanks.\" Do you think that is when she gave birth to herself?",
        "upvotes": 8,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1o4qen6/predestination_movie/"
    },
    {
        "id": "1o4rhto",
        "author": "Izarator",
        "title": "Movies that could be called a new movie after a re-release/Director's Cut.",
        "content": "I was wondering what movies could be called a new movie after their initial release because of a Director's Cut or something like that. I don't want movies where they added some extended scenes or polishing or minor added scenes but are really heavy altered. Something like Zack Snyders Justice League or Once Upon a Deadpool.",
        "upvotes": 6,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1o4rhto/movies_that_could_be_called_a_new_movie_after_a/"
    },
    {
        "id": "1o43daz",
        "author": "tinythanoscopter",
        "title": "Just rewatched 'Sneakers' and it got me thinking about forgotten movies",
        "content": "Sneakers has an incredible cast: Robert Redford, Sidney Poiter, Ben Kingsley, River Phoenix, Dan Ackroyd, Mary McDonnell, David Strathairn. It also has a really smart script (not including the zoom-and-enhance trope), and a great score by James Horner. I never hear anyone ever talking about it, and I'm pretty sure it didn't make much of an impression when it released.\n\nSo, what other movies has an impressive cast, alongside great writing and direction, that nobody talks about anymore?\n\n(Also RIP Robert Redford. Charisma personified)",
        "upvotes": 242,
        "comments": 147,
        "media": null,
        "permalink": "/r/movies/comments/1o43daz/just_rewatched_sneakers_and_it_got_me_thinking/"
    },
    {
        "id": "1o3p7nf",
        "author": "Boss452",
        "title": "The Lego Batman Movie (2017) - Batman's typical night after saving the day",
        "content": "",
        "upvotes": 1841,
        "comments": 79,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0s2haf9difuf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1o3p7nf/the_lego_batman_movie_2017_batmans_typical_night/"
    },
    {
        "id": "1o3yxr0",
        "author": "BunyipPouch",
        "title": "First Poster for Documentary 'Are We Good?' - Comic and podcast pioneer Marc Maron reflects on loss and growth after the death of his partner, Lynn Shelton.",
        "content": "",
        "upvotes": 298,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rtladcc17iuf1.jpeg?auto=webp&amp;s=9d2fd2b7f9184b21fe8e5dac9dca4833b8cf5382"
        },
        "permalink": "/r/movies/comments/1o3yxr0/first_poster_for_documentary_are_we_good_comic/"
    },
    {
        "id": "1o49wsa",
        "author": "seveer37",
        "title": "Billy Crystal was the lead, Jack Palance won the Oscar, but Daniel Stern was the MVP of City Slickers!",
        "content": "I mean Crystal is always funny don’t get me wrong, and yes I know this was Jake Gyllenhaal’s breakout film. But Stern gives arguably the funniest but also moving performance of them all. He has some of the funniest parts and lines. Pretending not to sleep to not talk to his wife, can’t comprehend how a VCR works, “If hate were people, I’d be China!” And asked what’s the worst day of his life after his wedding day, “Everyday since has been a tie.” But he goes through probably the most trauma and growth out of them all. Mitch is afraid of death and Ed is worried about having kids, but Phil’s entire life has now been destroyed, which wasn’t doing so good anyway. His miserable marriage has finally ended, he’s lost his job, and knows his ex is gonna take him for everything he’s got. Including his kids. So he’s the one who steps up and defends the group from the drunk cowboys. A final breaking point then has an emotional breakdown. Knowing it’s probably not gonna get better. And from the not as good sequel it doesn’t. But he continues on anyway. It hit me since I myself am going through a similar situation. A rough divorce, custody battle, loss of a job. It’s like everything happens at once. So maybe I’m just identifying with him lately. ",
        "upvotes": 72,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1o49wsa/billy_crystal_was_the_lead_jack_palance_won_the/"
    },
    {
        "id": "1o4bryf",
        "author": "aphaits",
        "title": "Which movies best represents each of the biblical seven sins?",
        "content": "Here's my list so far from modern movies:\n\n1. **Gluttony**: The Menu\n2. **Greed**: The Wolf of Wall Street\n3. **Lust**: Eyes Wide Shut\n4. **Wrath**: John Wick\n5. **Sloth**: The Big Lebowski\n6. **Envy**: Black Swan\n7. **Pride**: Whiplash\n\nI feel like my picks are a bit shallow and doesn't have too much depth within each of the sins as the base topic of the movie. There is also some movie that represent other things quite well but does not fit in the seven sins category such as Insomnia representing Guilt.\n\nWhat movie would you guys pick as the best representation for each sin?\n\nPS: Decided to not include Se7en in any of the list because its just too on the nose.\n\nEdit: Decided to do a thread best picks to compare with my original list:\n\n1. **Gluttony**:\n   * The Menu\n   * The Whale\n   * La Grande Bouffe\n   * Salo or the 120 days of Sodom\n   * Leaving Las Vegas\n   * Fear and Loathing in Las Vegas\n2. **Greed**:\n   * The Wolf of Wall Street\n   * Wall Street\n   * The Big Short\n   * Margin Call\n3. **Lust**:\n   * Eyes Wide Shut\n   * Immoral Tales\n   * Nymphomania\n   * In The Realm of The Senses\n4. **Wrath**:\n   * John Wick\n   * Oldboy\n   * Kill Bill\n   * I Saw the Devil\n5. **Sloth**:\n   * The Big Lebowski\n   * Schindler's List\n   * Trainspotting\n   * Office Space\n   * Clerks\n   * Garden State\n6. **Envy**:\n   * Black Swan\n   * Amadeus\n   * American Psycho\n   * The Substance\n   * The Cable Guy\n   * One Hour Photo\n   * The Talented Mr Ripley\n   * The Prestige\n7. **Pride**:\n   * Whiplash\n   * There Will Be Blood\n   * To Die For\n   * Oppenheimer\n   * Ex Machina\n   * Training Day",
        "upvotes": 55,
        "comments": 186,
        "media": null,
        "permalink": "/r/movies/comments/1o4bryf/which_movies_best_represents_each_of_the_biblical/"
    }
]