[
    {
        "id": "1r407vx",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Castilla - Athletic Club B | Primera Federación, Matchday 24",
        "content": "#FT: CASTILLA 2:1 ATHLETIC B\n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n0:1 Ibon Sánchez 5'\n\n1:1 Pol Fortuny 22'\n\n2:1 César Palacios 90'+2 \n\n&amp;#x200B;\n\n**match updates:** \n\n1' - Kickoff, vamos!\n\n⚽ 5' - \n\n⚽ 22' - GOLLLLL DEL CASTILLA - cross from the elfr side by Diego Aguado, gets cleared to Dani Yáñez whose header is saved by the keeper, but Pol Fortuny is there to convert the rebound! \n\nHT \n\n🔄 46' - 2nd half underway, Cestero comes on for Cristian\n\n🔄 57' - Palacios for Bruno \n\n🔄 66' - Leiva on for Pol Fortuny\n\n🔄 78' - Roberto Martín and Dani Mesonero on for Dani Yáñez and Loren Zúñiga - interesting choice to take the only striker and a winger off and sub on two central midfielders when you need a goal at home... \n\n85' - Leiva's shot from the edge of the box hits the post - best chance for Castilla all second half\n\n⚽ 90'+2 - GOLLLLL DEL CASTILLA - good play around the box by Manuel Ángel and Leiva, the ball arrives at the left wing and Aguado puts in the cross, Palacios makes the run and arrives at the first post to tap it into the net for the late winner! \n\n90'+4 - the goal gets reviewed first with an obligatory offside check, then Athletic ask for a challenge, but both times, the referee lets it stand - it's not possible to determine, he might be behind the ball or not\n\nFT - \n\n&amp;#x200B;\n\n**Kickoff:** 21:15 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid\n\n**Referee**: \n\n**Competition:** Primera Federación, Grupo 1, Matchday 24\n\n**Viewing options:** \n[LaLiga+](https://www.laligaplus.laliga.com/) (subscription - 14.99€/month) (only available in Spain)\n\n&amp;#x200B;\n\n**Castilla XI** (4-3-3): Fran González - Diego Aguado, Víctor Valdepeñas ‘Valde’, Joan Martínez, David Jiménez - Cristian David (46' Jorge Cestero), Manuel Ángel - Bruno Iglesias (57' César Palacios), Pol Fortuny (66' Álvaro Leiva), Dani Yáñez (78' Roberto Martín) - Loren Zúñiga (78' Dani Mesonero) \n\nBench: Guille Súnico (GK), Mario Rivas, Manu Serrano, Jesús Fortea, Lamini Fati, Liberto Navascués, Adrián Arnuncio ‘Arnu’. \n\nUnavailable: Thiago Pitarch (suspended), Hugo de Llanos (injury), Rachad Fettal (injury). \n\nCoach: Julián López de Lerma\n\n&amp;#x200B;\n\n**Castilla last five matches:** LDLDD\n\n**1ª RFEF stats:** 8th | 34pt | 10-4-9 | 29:31\n",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r407vx/match_thread_real_madrid_castilla_athletic_club_b/"
    },
    {
        "id": "1r01avh",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 10,
        "comments": 2448,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r01avh/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1r46w5n",
        "author": "13AA",
        "title": "Luka for the winner 🔥",
        "content": "I’ll never forgive perez for forcing Modric out  just because he wants Tchouaméni, Camavinga , and Jude Bellingham  play 90 minutes. Even though he was fine to be benched and reduced his salary😒 I don’t care about serie a but I hope modric wins it for Milan he is the best player in the team \n\n…………………………………………………..",
        "upvotes": 354,
        "comments": 28,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7kblvlb81djg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1r46w5n/luka_for_the_winner/"
    },
    {
        "id": "1r3oavt",
        "author": "7dek",
        "title": "Alvaro Arbeloa: \"Barcelona's 4-0 loss? Ask Barcelona and Hansi flick\"🤣",
        "content": "",
        "upvotes": 1330,
        "comments": 85,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1vg00znjd9jg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1r3oavt/alvaro_arbeloa_barcelonas_40_loss_ask_barcelona/"
    },
    {
        "id": "1r4351h",
        "author": "Modo97",
        "title": "Modric has the greatest longevity in history — no one even comes close to him.",
        "content": "Yes, Ronaldo and Messi are still scoring goals and contributing. Ibrahimovic was scoring until the age of 41. Totti, Benzema, and Lewandowski are (or were recently) still performing at a high level… and there are others as well.\n\nBut none of them provide even 25% of the physical effort that Luka Modric delivers, especially considering he’s playing in Serie A, not in Saudi Arabia or the United States.\n\nAnyone who watches AC Milan’s matches would never believe this man is 40 years old. He runs for 90 minutes without slowing down, fulfills his defensive duties perfectly, and contributes offensively as well. Allegri rarely substitutes him, he plays almost every match. And even during international breaks he never truly rests, and always there for his national team.\n\nSome defenders and goalkeepers have managed to shine at an older age, but I honestly can’t remember a midfielder — arguably the most physically demanding position — performing at this level at this age.\n\nMany people say that Luka Modric only began to shine at a late age, but that simply isn’t true. He didn’t take any shortcuts. He didn’t come through the academy of Real Madrid or Barcelona — he had to take the long road.\n\nHe was named the best player in the Bosnian league, the Croatian league, stood out at Tottenham Hotspur, was the best in his position for years at Real Madrid, and has been Croatia’s main star for nearly 20 years.\n\nOne of the greatest players in football history, and in my opinion, the player with the greatest longevity — without any real competition.",
        "upvotes": 155,
        "comments": 43,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r4351h/modric_has_the_greatest_longevity_in_history_no/"
    },
    {
        "id": "1r3okm9",
        "author": "7dek",
        "title": "Vini making fun of Mbappé's defending 😭",
        "content": "",
        "upvotes": 707,
        "comments": 64,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0pkoe2qtf9jg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1r3okm9/vini_making_fun_of_mbappés_defending/"
    },
    {
        "id": "1r3zfkq",
        "author": "julipacheco10",
        "title": "We really need someone who plays like him",
        "content": "",
        "upvotes": 192,
        "comments": 32,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8fdmpr78ibjg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1r3zfkq/we_really_need_someone_who_plays_like_him/"
    },
    {
        "id": "1r3q88s",
        "author": "Mastermind_737",
        "title": "Vini's reaction to being told about the Barca loss \"Cuatro cero\" 4-0 by YouTuber Ibai Llanos at a Nike event 😂",
        "content": "",
        "upvotes": 400,
        "comments": 59,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/muh8j1qhs9jg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1r3q88s/vinis_reaction_to_being_told_about_the_barca_loss/"
    },
    {
        "id": "1r42sv2",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [2]-1 Athletic Club B - César Palacios 90'+2",
        "content": "",
        "upvotes": 29,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o997101l5cjg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1r42sv2/real_madrid_castilla_21_athletic_club_b_césar/"
    },
    {
        "id": "1r41bb4",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [1]-1 Athletic Club B - Pol Fortuny 22'",
        "content": "",
        "upvotes": 9,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dgm2c7f8vbjg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1r41bb4/real_madrid_castilla_11_athletic_club_b_pol/"
    },
    {
        "id": "1r31qnk",
        "author": "Modo97",
        "title": "Nico Schlotterbeck has liked an IG post linking him to Real Madrid.",
        "content": "",
        "upvotes": 1133,
        "comments": 139,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/m2cj2na604jg1.jpeg?auto=webp&amp;s=4226b05098980e849d7a313cd92c836375e992eb"
        },
        "permalink": "/r/realmadrid/comments/1r31qnk/nico_schlotterbeck_has_liked_an_ig_post_linking/"
    },
    {
        "id": "1r41pmh",
        "author": "ManuMora98",
        "title": "[Basket] Back to winning ways away in Euroleague, 73-77 against Partizan to get to the 4th spot, just 1 win behind 2nd and 3rd",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qxb741g1ybjg1.jpeg?auto=webp&amp;s=e11d1bf904b19cbc6b41baa3505bd43a0fea4b70"
        },
        "permalink": "/r/realmadrid/comments/1r41pmh/basket_back_to_winning_ways_away_in_euroleague/"
    },
    {
        "id": "1r36jh4",
        "author": "cyrusmancub",
        "title": "Real Madrid fears that Jude Bellingham’s hamstring injury is worse than initially diagnosed. Instead of a 4-week absence, BBCSport reports he will be out 6-8 weeks, until April. The club is concerned.",
        "content": "",
        "upvotes": 324,
        "comments": 70,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r36jh4/real_madrid_fears_that_jude_bellinghams_hamstring/"
    },
    {
        "id": "1r3b9ls",
        "author": "Deep_Agent316",
        "title": "Did Hansi Flick Actually Insult Madrid?",
        "content": "Saw the discussion around Hansi Flick's comments. Someone said Barca had an easy Route in the Copa, to which he replies \"Ask Real Madrid.\"\n\nOn the surface, using Real Names seems like an insult, right?\n\nBut to me, he is giving credit to Albacete. We both played Albacete, we lost, they won, but not without a fight. So he says to \"Ask Real Madrid\" if Albacete was an \"easy route.\"\n\nI don't really take any offense to this.",
        "upvotes": 153,
        "comments": 40,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r3b9ls/did_hansi_flick_actually_insult_madrid/"
    },
    {
        "id": "1r2xad4",
        "author": "7dek",
        "title": "Mbappé 🇫🇷and Vini 🇧🇷-All G/A together",
        "content": "",
        "upvotes": 376,
        "comments": 35,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bikyyzow63jg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1r2xad4/mbappé_and_vini_all_ga_together/"
    },
    {
        "id": "1r3dnyt",
        "author": "No-Obligation1336",
        "title": "Winter Transfer policy lunacy.",
        "content": "Just ONE example I'll use here and it's Ademola Lookman...\n\nAn absolute baller, proven big game player, who has now taken a direct rival in ATM to another level on that left flank. Who they picked up in this last window. Understand that I'm not saying that RMCF should've bought him but I say this to highlight the refusal of this club to go into the winter market especially to strengthen the current team, which is so weak in key area's of the pitch, from injuries or just a lack of the right player profile. \n\nThey are excellent players out there that the club refused to take advantage of &amp; at least try to attain. I.e, Marc Guehi for example, given the team's current woes at CB. I'm not going to list off players for every position in which the club lacks here but just highlight that City have gotten stronger &amp; so has ATM by taking needed action to make their teams better in area's where they needed to but this club RMCF refuses to do the same, we always here about how much revenue the club generates yearly and yet somehow it seems their only policy at the moment is free contracts to players at the end of theirs. Yet splashed out over 50+ mil on an unproven kid in Mastantuno?  Make it make sense.\n\nLook at Lookman's performance today &amp; to be frank he's fit them hand in glove. He will also terrorize us when we meet, another threat to deal with &amp; how does the club respond? Does anyone know of anyone the club is actually interested in besides random links from websites/journalist looking for traffic?\n\nClubs around us continue to strengthen &amp; RMCF looks like they're just twiddling their thumbs.\n\nMaybe I'm out of the know, feel free to enlighten me here but watching that guy make ATM stronger &amp; which performances he's had from the get go annoys the hell out of me because RMCF still look a shambles, heck ATM at this point plays better football than us &amp; never before could I even fathom such a sentence.  \n\n",
        "upvotes": 41,
        "comments": 39,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r3dnyt/winter_transfer_policy_lunacy/"
    },
    {
        "id": "1r2xcl7",
        "author": "NeverPanic",
        "title": "Endrick's Red Card downgraded to 2nd Yellow. Will only miss 1 game against Nice",
        "content": "",
        "upvotes": 225,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/B_fAsld6rpzTamb-gWbqg6gdbwhxVWo7T_Tl8CTBpSg.jpeg?auto=webp&amp;s=1707b6e4b5707936e63a6926ae6c85f6339d3d64"
        },
        "permalink": "/r/realmadrid/comments/1r2xcl7/endricks_red_card_downgraded_to_2nd_yellow_will/"
    },
    {
        "id": "1r2z2cx",
        "author": "Delzhedir",
        "title": "Real Madrid's deal with UEFA is looking very good.",
        "content": "According to Joaquín Maroto (Diario As), Anas Laghari negotiated over the last week a very good deal for us during the mediation phase of the lawsuit where we were suing UEFA for 4,500M €. \n\nApparently, the main focus of the deal has to do with financial clarity (UEFA was keeping way too much money and nobody knew where it went), a proper and functioning Financial Fair Play, salary limits for players (similar tu NBA) and a new business model leaving the past TV rights model behind and creating a Freemium model (free football for all, some premium content).\n\nThese were always the main points behind the Super League for Florentino. I've seen so much disrespect to him and so much talk about how catastrophic and ridiculous of a defeat this was in this sub. If the information is true, I guess all those people will change their minds, because it sounds really good to me.\n\nWe will see more in the coming days after they formalize the agreement and the lawsuit is withdrawn. In any case, in my opinion, if someone deserves the credit and trust not to throw him to the wolves before we know the details, that's Florentino Pérez.",
        "upvotes": 154,
        "comments": 24,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r2z2cx/real_madrids_deal_with_uefa_is_looking_very_good/"
    },
    {
        "id": "1r2y0qr",
        "author": "Resident-Stretch9723",
        "title": "2014 UCL | Ronaldo masterclass against Galatasaray S.K.",
        "content": "",
        "upvotes": 166,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ugne09dz93jg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1r2y0qr/2014_ucl_ronaldo_masterclass_against_galatasaray/"
    },
    {
        "id": "1r3oly2",
        "author": "Still-Ad-2133",
        "title": "A chance  of finishing high  this season",
        "content": "Really observing how Barca is playing and considering Trent, militao coming back in april is there any chance that we can lock in and win la liga just a genuine curiosity . I think we can atleast finish on a high idk I do believe ucl is too far away from us this season . And considering the injuries i would still say it would be an achievement ",
        "upvotes": 2,
        "comments": 33,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r3oly2/a_chance_of_finishing_high_this_season/"
    },
    {
        "id": "1r31929",
        "author": "Mastermind_737",
        "title": "The fine print of the peace deal between Real Madrid, UEFA and EFC (Real Financial Fairplay, Salary Caps, broader global access with matches available at low cost or even free).",
        "content": "After PSG finally conquered their champions league title in recent times. There is a shift from the big oil clubs to try and maintain their reign at the top, but also grow their league with other leagues taking lots of talent. This means limits will be put in place to prevent an over saturation of big money owners and ensuring a more fair competition. The current tv rights system is also very negative and generates a huge loss for the overall system with the advantage in the small individuals who benefit from the current system. An international free stream system would allow more fans to watch the games and which is exactly what advertisers want and they'll be willing to spend big. Instead of paying ridiculous fees, you'll watch free but you'll be the product(fine by me, just keep the 15 min halftime ad break and we're good). Overall, lots of drama, but this is the result we would gladly accept if the AS article information is true. ",
        "upvotes": 75,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/99-P0bYqpmGR-YM7zvMlLHT_XzRpAO2HUVsu84POSME.jpeg?auto=webp&amp;s=84c6ae4a8123b89423173e9f2909c3da5280eb7a"
        },
        "permalink": "/r/realmadrid/comments/1r31929/the_fine_print_of_the_peace_deal_between_real/"
    },
    {
        "id": "1r2q4zv",
        "author": "[deleted]",
        "title": "Visited Singapore last month and snagged this beauty from there...happy to finally complete the trifecta of 2015-16 kits",
        "content": "",
        "upvotes": 233,
        "comments": 21,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r2q4zv/visited_singapore_last_month_and_snagged_this/"
    },
    {
        "id": "1r2vgyp",
        "author": "MoveTheProduct",
        "title": "High Profile Transfer Battle Looms Between Liverpool and Real Madrid for Kees Smit",
        "content": "[Real Madrid](https://www.transferwatcher.com/real-madrid) are prepared to pay a massive fee to sign [Kees Smit](https://www.transferwatcher.com/kees-smit) this summer. The Spanish giants are stepping up their pursuit of the [AZ Alkmaar](https://www.transferwatcher.com/az-alkmaar) midfielder, who is also a top target for Liverpool.\n\nThe 20 year old has emerged as one of the most exciting young players in Europe. His rise has been swift, and now two of the continent’s biggest clubs are circling.\n\nLiverpool manager Arne Slot is known to be a long time admirer. But the race is no longer straightforward.",
        "upvotes": 97,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Xd0BsHgIGCobS99ClVIboUXuWZd6O74MR9kW6UEP1o4.jpeg?auto=webp&amp;s=840e0bd7f145b6b654d874c1e3223eec267e0a32"
        },
        "permalink": "/r/realmadrid/comments/1r2vgyp/high_profile_transfer_battle_looms_between/"
    },
    {
        "id": "1r2xqxq",
        "author": "supplementarytables",
        "title": "200 matches for Athenea!",
        "content": "",
        "upvotes": 49,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r2xqxq/200_matches_for_athenea/"
    },
    {
        "id": "1r2rknj",
        "author": "kenstarfighter1",
        "title": "Since Vini's outbreak went unpunished, I've been noticing a trend",
        "content": "https://preview.redd.it/ozlgsiiaz1jg1.jpg?width=1179&amp;format=pjpg&amp;auto=webp&amp;s=b2f648b122d5e0d02a90c326f6eea4893240c152\n\nhttps://preview.redd.it/0ta1kjiaz1jg1.jpg?width=1155&amp;format=pjpg&amp;auto=webp&amp;s=e7e7a0b3975bd7bff69cbed54f07c908bc5ba84f\n\nhttps://preview.redd.it/s9joqkiaz1jg1.jpg?width=299&amp;format=pjpg&amp;auto=webp&amp;s=c255d9380b5adaf9f4f623703c5ab2a67fca129f\n\n  \nThese are just some examples of players in our squad, even substitutes, who have since the Vini outburst in El Clasico, came out and publicly protested the managers because of playing time, role on the field or being substituted. \n\nHas the board opened a pandoras box by not standing with Xabi when he needed their support to assert his authority as a manager?\n\n",
        "upvotes": 47,
        "comments": 56,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r2rknj/since_vinis_outbreak_went_unpunished_ive_been/"
    },
    {
        "id": "1r2mg57",
        "author": "Ripamon",
        "title": "Are Gonzalo &amp; Mbappe compatible? The data makes it clear that GG performs much better when he doesn't share the pitch with the Frenchman",
        "content": "",
        "upvotes": 86,
        "comments": 89,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r2mg57/are_gonzalo_mbappe_compatible_the_data_makes_it/"
    },
    {
        "id": "1r1ylbb",
        "author": "o6ohunter",
        "title": "Karim Benzema | The Art of the #9",
        "content": "",
        "upvotes": 840,
        "comments": 108,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hoxtwk9njvig1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1r1ylbb/karim_benzema_the_art_of_the_9/"
    },
    {
        "id": "1r1ub59",
        "author": "Bijay12356",
        "title": "Happy Birthday Andriy Lunin 🎉🥳.Once again thanks for this unbelievable performance 👏.He faced 33 shots and only conceded One.",
        "content": "",
        "upvotes": 1356,
        "comments": 37,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/q3fo1p22juig1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1r1ub59/happy_birthday_andriy_lunin_once_again_thanks_for/"
    },
    {
        "id": "1r3ppkc",
        "author": "Lucky-Bag1127",
        "title": "We are being too harsh on our team",
        "content": "We have been sub-par this season. Bad, even.\n\nBut we must remember the following:\n\nRudiger: 7 La Liga games\n\nTrent: 9 La Liga games (400 minutes)\n\nMilitao: 13 La Liga games\n\nCarvajal: 7 La Liga games (300 minutes)\n\nMendy: 1 La Liga game\n\nYet we have one of the strongest defences in La Liga. This isn’t an indictment on our players, it an indictment of our physio and health team. \n\nWhy are our players suffering from injuries so often? Any team with this many injuries would barely compete in La Liga, yet we only trail by 1 point. We need to give our players some grace.\n\nHala Madrid!",
        "upvotes": 0,
        "comments": 27,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r3ppkc/we_are_being_too_harsh_on_our_team/"
    },
    {
        "id": "1r2b3jq",
        "author": "ManuMora98",
        "title": "[Fem] Paris FC 2 - 3 Real Madrid | Korasec 10', Mendy 89'; Weir 38',Athenea 45', Caicedo 83' | We take the lead in the CL Playoff, beating Paris FC for the first time, before the 2nd leg at home next Wednesday",
        "content": "",
        "upvotes": 147,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4w68v7b9uxig1.jpeg?auto=webp&amp;s=4d2e6d07bba14858ad2fc6fa2de4c998f9241788"
        },
        "permalink": "/r/realmadrid/comments/1r2b3jq/fem_paris_fc_2_3_real_madrid_korasec_10_mendy_89/"
    }
]