[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1lkxv89",
        "author": "eleask",
        "title": "Favore retribuito (movimento di un pacco) - Torino Centro",
        "content": "EDIT: ce l'ho fatta! Un cortesissimo torinese si e' fatto avanti ed e' adesso in missione! Grazie, Torino!!!\n\n\n\n\n\n\\-----------------------------------------------------------------------------------------------------\n\nHey gente di Torino (centro). Stasera (stanotte) arrivero' in aereo a Torino, e domattina vorrei partire per le montagne presto (col treno delle 5:30).\n\nHo ordinato del gas da campeggio, ma per via di un po' di sfiga, non e' arrivato in tempo in hotel, quindi, ho una piccola missione per chiunque sia disposto.\n\nChi ha voglia di andare al decathlon di torino centro, recuperare una bomboletta di gas e trasferirla cento metri piu' in la' all'hotel nizza, questo pomeriggio?\n\nIn cambio, vi pago qualsiasi cosa vogliate in Decathlon per un valore di diciamo 10 euro :) Anche na carta regalo se riesco!\n\nFatemi sapere, e grazie in anticipo a chiunque voglia provarci! Grazie!",
        "upvotes": 25,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lkxv89/favore_retribuito_movimento_di_un_pacco_torino/"
    },
    {
        "id": "1ll1f1t",
        "author": "lospavaldo",
        "title": "cerco amicizie a torino",
        "content": "io e un mio amico siamo grandi appassionati di viaggi in bici, roba ovviamente amatoriale e per il momento i viaggi piu lunghi sono stati di circa 60 km. Cerchiamo giusto qualcuno con la nostra stessa passione per stare in compagnia\n\nIo e il amico abbiamo 18 e 19 anni",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ll1f1t/cerco_amicizie_a_torino/"
    },
    {
        "id": "1llc2xa",
        "author": "sturmfrey",
        "title": "Lezioni di musica a prezzi accessibili??",
        "content": "Ciao. Sono davvero interessato a imparare il violino e/o il pianoforte. Ma da studente, alcuni dei prezzi di queste lezioni sono folli! \nIntendevo solo un po' troppo per me \n\nQuindi mi stavo chiedendo se voi ragazzi conoscete qualche lezione di violino/piano a un prezzo accessibile/economico? anche qualche raccomandazione su dove posso impararli? \nHo visto alcuni volantini in giro per Comala su lezioni di musica gratis qualche mese fa, ma ho perso le foto, quindi se qualcuno ne sa di più, per favore condividetele. \n\nGrazie mille. Voglio davvero provare una cosa nuova quest'anno haha \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1llc2xa/lezioni_di_musica_a_prezzi_accessibili/"
    },
    {
        "id": "1llagxq",
        "author": "Yigit_im",
        "title": "Is there a website to find job as a student?",
        "content": "Please I need to earn some moneeey",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1llagxq/is_there_a_website_to_find_job_as_a_student/"
    },
    {
        "id": "1llafbk",
        "author": "Yigit_im",
        "title": "Compirò 18 anni tra un mese. Sarò libero per i prossimi due mesi a causa delle vacanze estive e vorrei lavorare e guadagnare qualcosa.",
        "content": "Non so l'italiano, quindi non posso fare il barista o simili. Dove posso trovare lavoro come prossimo diciottenne?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1llafbk/compirò_18_anni_tra_un_mese_sarò_libero_per_i/"
    },
    {
        "id": "1ll7t0a",
        "author": "Curious-Albatross896",
        "title": "Miglior Barbiere di Torino?",
        "content": "Mi consigliate il miglior barbiere qua a Torino per tagli da maranza? Top barbieri bravi che ci sanno fare e che conoscono gli ultimi tagli. Sono in zona lingotto, ma mi faccio anche 2 ore di tram per il barbiere giusto XD. \n\n",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1ll7t0a/miglior_barbiere_di_torino/"
    },
    {
        "id": "1ll7g0p",
        "author": "Particular-Bed9438",
        "title": "Conoscenze",
        "content": "Ciao! Sono una studentessa fuorisede di 22 anni.\n\nAmmetto che faccio un po’ fatica a fare nuove amicizie (e ancora più fatica a mantenerle o coltivarle). Sono abbastanza introversa e selettiva, e tendo ad aprirmi solo in contesti in cui mi sento davvero a mio agio.\n\nA complicare un po’ le cose c’è anche la mia espressività… o meglio: la mia *\"resting bitch face\"*. Spesso le persone mi dicono che sembro altezzosa, giudicante, o addirittura cattiva – quando in realtà è solo la mia faccia da default.\n\nDetto ciò, ultimamente sento davvero il bisogno di compagnia: mi piacerebbe visitare musei, esplorare la città, uscire a mangiare, o anche andare a ballare in discoteca – non per bere, ma solo per il puro piacere di ballare.\n\nIl problema è che... non ho nessuno con cui farlo.\n\nAh, e per il ragazzo che propone sempre di scrivergli per entrare nel gruppo che hanno creato: **non riesco a scriverti!**\n\nSe qualcuno si è trovato o si trova nella mia stessa situazione e ha voglia di condividere qualche uscita, mi farebbe super piacere!\n\n",
        "upvotes": 1,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1ll7g0p/conoscenze/"
    },
    {
        "id": "1lk5ab9",
        "author": "Murky_Giraffe8700",
        "title": "Fino a quando Torino continuerà a fingere che questo livello di “decoro” sia accettabile?",
        "content": "Sinceramente, non capisco come siamo arrivati a questo punto...  \n  \nA meno che non vivi in centro o nelle vicinanze, Torino sta diventando semplicemente invivibile.   \n  \nBasta allontanarsi un po' verso la periferia ed è come essere in un altro mondo: Borgo Vittoria, Barriera di Milano, San Salvario, ecc.; sembrano luoghi completamente diversi, dove il degrado è impossibile da ignorare.  \n\nSto cercando casa in questi giorni, e fa impressione vedere come si stiano creando delle vere e proprie *no-go zones*. Devi già restringere la ricerca per budget e trasporti, ora pure per sicurezza. Parti della città che una volta erano vivibili oggi ti fanno pensare: 'lì meglio non andarci di sera'.\n\nL'altro giorno sono andato in Barriera a trovare degli amici e lo dico chiaramente: non sembrava nemmeno l'Italia. Sporcizia ovunque, abbandono, una sensazione di pericolo costante. Come si fa a vivere lì senza sentirsi in pericolo?   \n  \nla cosa peggiore è che non parlo solo per me. Ogni volta che la mia ragazza torna a casa la sera, c’è sempre qualcuno che la molesta, la ferma, le dice qualcosa. Non è un caso isolato, succede regolarmente. Non è normale dover vivere con questa costante sensazione di minaccia solo per rientrare a casa propria.  \n  \nSono sempre stato a favore dell'apertura, dell'integrazione e dei diritti. Ma non si tratta più di questo.  \n  \nSi tratta di una città che si sta lasciando andare completamente e nessuno sembra voler dire niente. O peggio, c'è chi fa finta che tutto vada bene. Lo sappiamo tutti dove stanno a spacciare: San Salvario, sotto la farmacia all’angolo fino a corso Regina, certe vie della Barriera… ma la polizia? Niente. Ogni tanto mandano l’esercito per fare scena, poi spariscono e tornano tutti come prima. È diventata una farsa  \n  \n**Mi chiedo:** chi governa questa città e si rende conto del disastro in cui è finita? C'è ancora qualcuno che crede nel concetto di decoro urbano? O dobbiamo rassegnarci al fatto che Torino diventerà sempre più sporca, insicura e degradata?   \n  \nNon sto parlando del passato, so bene che Torino non è mai stata perfetta. Ma adesso ci sono zone che sembrano letteralmente da terzo mondo: gente che si buca o fuma crack in pieno giorno, parchi abbandonati, sporcizia ovunque, gruppi che ti guardano con ostilità. È diventato normale sentirsi fuori posto nella propria città.  \n  \nE sì, lo so già: questo post verrà sommerso di downvotes da parte di quelli che amano raccontarsi che “va tutto bene”, che è colpa della percezione o che sto facendo allarmismo. Ma questa è la realtà, quella che viviamo ogni giorno fuori dai salotti radical chic. Non voglio vivere in un’anarchia urbana dove tutto è tollerato “per principio”, mentre la città si disintegra.",
        "upvotes": 153,
        "comments": 188,
        "media": null,
        "permalink": "/r/torino/comments/1lk5ab9/fino_a_quando_torino_continuerà_a_fingere_che/"
    },
    {
        "id": "1lkumob",
        "author": "whos_there1234",
        "title": "cerco amici a torino",
        "content": "Amicizie a Torino Sono un ragazzo di 23 anni, sono appena arrivato a Torino e vorrei allargare la mia cerchia di amici. Mi piace andare in bici, andare al cinema, giocare ai videogiochi e uscire con gli amici per un drink. Se ci sono gruppi, fatemelo sapere ✌🏻",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1lkumob/cerco_amici_a_torino/"
    },
    {
        "id": "1lkhvnj",
        "author": "Rude-Green3601",
        "title": "BLACK OUT IN S RITA",
        "content": "anche voi senza corrente?",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1lkhvnj/black_out_in_s_rita/"
    },
    {
        "id": "1ljzlrw",
        "author": "Lollodoro",
        "title": "GTT vaffanculo",
        "content": "Per qualche ragione l'app GTT ha smesso di funzionare. Avevo dei biglietti che ora non potrò usare. Ho dovuto prendere il giornaliero alle macchinette che ha un prezzo assurdo di 4,50. GTT vaffanculo ancora una volta",
        "upvotes": 53,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1ljzlrw/gtt_vaffanculo/"
    },
    {
        "id": "1ljpxqa",
        "author": "_crisz",
        "title": "La gestione della GTT per il deflusso dall'evento di San Giovanni è stato indecoroso",
        "content": "Mi ha fatto molto ridere il sindaco che sale sul palco e vuole esportare Torino nel mondo, ci fa fare i sondaggi e tutto quanto e poi non è in grado di prevedere che 50.000 persone in centro storico dove non si può parcheggiare devono in qualche modo tornare a casa. L'evento è finito a mezzanotte e un quarto, e ovviamente nessuno ha pensato a rinforzare le linee adiacenti alla zona, così che una mandria sconfinata di persone ha dovuto correre per prendere le ultime corse di molte linee, e pensare che i mezzi erano talmente tanto pieni che quelli che erano dentro si lamentavano che li schiacciavano e quelli rimasti fuori che giustamente avevano anche loro diritto a tornare a casa, considerando anche che domani si lavora. E non tutti possono permettersi un taxi, che non siamo figli di milionari. Poi la metro la si poteva prendere solo da porta nuova, con ultima partenza all'una che sia mai che c'è qualcuno più lento e non riesce a correre abbastanza, in quel caso saranno fatti suoi. Ecco, visto che a nessuno importerà mai di questo servizio scadente che paghiamo a caro prezzo, sarebbe bello poter comunicare questa cosa nel sondaggio del nostro amato sindaco, se qualcuno riesce a recuperarli il QR code. Grazie ",
        "upvotes": 164,
        "comments": 50,
        "media": null,
        "permalink": "/r/torino/comments/1ljpxqa/la_gestione_della_gtt_per_il_deflusso_dallevento/"
    },
    {
        "id": "1lkjleo",
        "author": "lemiche_",
        "title": "Consigli per un nuovo arrivato?",
        "content": "Da settembre inizierò la magistrale in economia a Torino. Non la conosco molto, in generale cosa mi consiglieresti? posti dove uscire? so che le panche è molto famosa come zona universitaria ma è abbastanza lontana dal quartiere dove starò (filadelfia) beccare gente e stringere è facile? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lkjleo/consigli_per_un_nuovo_arrivato/"
    },
    {
        "id": "1lk3mil",
        "author": "Moonlightxx9",
        "title": "Amicizie a Torino",
        "content": "Sono una ragazza di 23 anni che vive qui da 4, vorrei ampliare le mie amicizie e ho visto che tutti i metodi per le persone introverse come me non funzionano (ho app per conoscenze ma inutile dire che tutto trovo meno che amicizie). Mi piacciono anime, manga, il cinema, disegnare, quindi mi chiedevo se ci fossero gruppi con cui condividere passioni/organizzare uscite ✌🏻",
        "upvotes": 15,
        "comments": 38,
        "media": null,
        "permalink": "/r/torino/comments/1lk3mil/amicizie_a_torino/"
    },
    {
        "id": "1lketpc",
        "author": "Specific_Echidna_124",
        "title": "Qualche “Bravo ragazzo “ per canali meet up Torino?",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8fxl9tg0i49f1.jpeg?auto=webp&amp;s=05f9ea817b3ee80f173baf5b855bdf54f40aa276"
        },
        "permalink": "/r/torino/comments/1lketpc/qualche_bravo_ragazzo_per_canali_meet_up_torino/"
    },
    {
        "id": "1lk4kqf",
        "author": "Intelligent-Bell-120",
        "title": "Rave techno a Torino centro – sabato 28 giugno",
        "content": "Conosco un rave techno che si terrà sabato 28 giugno nel centro di Torino. Location molto particolare e atmosfera intensa, perfetta per chi ama il sound hard techno/industrial.\n\nSe siete in città quel weekend e cercate una serata diversa, intensa e underground, scrivetemi in DM per tutti i dettagli sull’evento.\n\nSolo per veri techno lover 🖤",
        "upvotes": 3,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1lk4kqf/rave_techno_a_torino_centro_sabato_28_giugno/"
    },
    {
        "id": "1ljxxws",
        "author": "Antevasin94",
        "title": "Ciclofficina zona San Donato",
        "content": "Ciao, popolo di biciclettari di Torino. È giunto il momento che anche io cambi sponda e mi arrenda all’uso delle due ruote (se non altro perchè la GTT negli ultimi tempi è diventata un po’ … inaffidabile, mettiamola così).\nSono andata da decathlon e mi hanno proposto una bici a 270€ che anche no (devo solo andarci in città la sera quando vado a fare aperitivo e so già che sarò troppo sbronza per poter andare in macchina)… mi sapreste consigliare qualche ciclofficina in zona san Donato in cui comprarne una di seconda mano a un prezzo sensato?\n\nPs: non consigliatemi il balon, il 99,999999% delle bici è rubata e vorrei evitare  ",
        "upvotes": 9,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1ljxxws/ciclofficina_zona_san_donato/"
    },
    {
        "id": "1lkaztf",
        "author": "drogooooo",
        "title": "locale merenda per compleanno?",
        "content": "per il compleanno di una mia amica volevamo fare qualcosa di tranquillo e non super costoso a Torino e provincia come merenda. Non le piace il tè e quindi una tea house anche esteticamente carina è bocciata. Dove potrei andare? ho visto La deeva che però mi sembra un po' overrated, tuttavia cerco un luogo del genere (esteticamente carino e dove fare merenda)",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lkaztf/locale_merenda_per_compleanno/"
    },
    {
        "id": "1ljzi6b",
        "author": "Manuel7201",
        "title": "Posti per appartarsi",
        "content": "Ciao a tutti, specifico che non sono di Torino. Qualcuno saprebbe consigliarmi dei posti in cui potersi appartare con la propria ragazza (anche in macchina)?\nIdealmente sarebbe meglio non troppo fuori città.\nGrazie\n\n(Se è contro le regole del SUB chiedo scusa ai MOD)",
        "upvotes": 5,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1ljzi6b/posti_per_appartarsi/"
    },
    {
        "id": "1ljevfv",
        "author": "JerryScotti97",
        "title": "Sono un noto buttafuori nei locali di Torino, accetto qualsiasi domanda.",
        "content": "Ciao ragazzi, volevo aprire un discorso sui vari locali nella città di Torino, sono curioso di sapere cosa ne pensate.\n\nSono nel mondo dei locali notturni da un paio di anni, ma mi ritengo un buttafuori 2.0...Ho visto vari miei colleghi lavorare in modo \"hold school\". \n\n  \nPremetto che la mansione da buttafuori è cambiato con il passare degli anni ( e in meglio).\n\n  \nSkill importante? \n\n  \nSono un atleta professionista di sport da combattimento. ( non specifico lo sport perché altrimenti non sarei più in anonimo.)",
        "upvotes": 68,
        "comments": 152,
        "media": null,
        "permalink": "/r/torino/comments/1ljevfv/sono_un_noto_buttafuori_nei_locali_di_torino/"
    },
    {
        "id": "1lk13u8",
        "author": "ThrowRaStock-Dance-4",
        "title": "GTT bus tickets",
        "content": "This is my first week in Italy and Turin and I am still figuring things out. So I purchased the €2 GTT bus ticket from tabacchi. Now it says 100 minutes. What does that mean. Does it mean that the ticket is valid for only 100 minutes after I scan it in the bus or does it mean 100 minutes of travel time. And if it's latter, how do they calculate the travel time since you don't have to scan the ticket when you're leaving the bus. \n\nAlso, I have seen other types of gtt buses like there are some with 4 digit numbers and they also have cycle stands in the back. Does that €2 ticket work in the bus?\n\nIf there's any website where there's all the information I'd be very grateful.\n\nThanks in advance ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1lk13u8/gtt_bus_tickets/"
    },
    {
        "id": "1ljjtob",
        "author": "scemo_chi_legge123",
        "title": "ho trovato un abbonamento della GTT a terra, si tratta di un signore anziano (per privacy non mostro foto), cosa dovrei fare?",
        "content": "",
        "upvotes": 5,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1ljjtob/ho_trovato_un_abbonamento_della_gtt_a_terra_si/"
    },
    {
        "id": "1lj8ovy",
        "author": "mortified_penguin_00",
        "title": "Situazione invivibile in via Po",
        "content": "I senzatetto/richiedenti di elemosina e/o qualsiasi altra cosa stanno diventando particolarmente molesti\n\nQual è la vostra tattica per evitare rotture di cazzo?",
        "upvotes": 19,
        "comments": 52,
        "media": null,
        "permalink": "/r/torino/comments/1lj8ovy/situazione_invivibile_in_via_po/"
    },
    {
        "id": "1ljo39i",
        "author": "initial_chris",
        "title": "Ancora black-out",
        "content": "Zona Vanchiglia / Regina Margherita da quasi un oretta buona sono senza corrente. Come è la situazione negli altri quartieri?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ljo39i/ancora_blackout/"
    },
    {
        "id": "1ljj578",
        "author": "Outrageous_Pea4161",
        "title": "Tattoo Torino",
        "content": "Domani me ne vado dopo quattro anni vissuti qui, in un raptus emozionale vorrei fare un tatuaggio senza vendermi un rene. Qualche posto economico e senza appuntamenti ( a parte taxi tatoo)? ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ljj578/tattoo_torino/"
    },
    {
        "id": "1lj9b52",
        "author": "amicidilazzaro",
        "title": "Bagni, docce, barba, capelli e vestiario per i senzadimora a Torino",
        "content": "Bagni, docce, barba, capelli e vestiario per i senzadimora a Torino [https://www.amicidilazzaro.it/it/solidarieta/servizio-bagni-doccia-barba-e-capelli-a-torino-servizi-per-chi-e-in-difficolta/](https://www.amicidilazzaro.it/it/solidarieta/servizio-bagni-doccia-barba-e-capelli-a-torino-servizi-per-chi-e-in-difficolta/)",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1lj9b52/bagni_docce_barba_capelli_e_vestiario_per_i/"
    },
    {
        "id": "1ljoub4",
        "author": "ShadowStrikeSP",
        "title": "Locale per cena di compleanno",
        "content": "Ciao a tutti, volevo chiedere un consiglio. Io non sono di Torino e venivo a Torino giovedì per andare a cena con la mia ragazza per il suo compleanno. Ho visto, girando su Internet, vari posti dove poter prenotare però sono molto indeciso. Mi consigliate qualche ristorantino carino dove andare per cena?  Possibilmente zona a Porta Susa o almeno il più vicino possibile, perché ci muoviamo solo con i mezzi.\nGrazie mille a tutti ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ljoub4/locale_per_cena_di_compleanno/"
    },
    {
        "id": "1ljk6xm",
        "author": "Inside-Discipline359",
        "title": "Fuochi San Giovanni",
        "content": "Qualcuno sa se senza aver preso i biglietti si riescono a vedere i fuochi da un bel posto???",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ljk6xm/fuochi_san_giovanni/"
    },
    {
        "id": "1lixygh",
        "author": "Sea-Salt-3093",
        "title": "I media stanno esagerando la situazione Barriera oppure è davvero invivibile?",
        "content": "Condividereste con me qualche esperienza personale? Intendo dire, viverci o fare una passeggiata là è come vivere o camminare in un qualsiasi quartiere popolare o quartiere intorno alla stazione, o è peggio?  \n\nAnche nella mia città ci sono risse in stazione, ho assistito a scene particolari in zona stazione (es. Un mio amico davanti ai miei occhi è stato   accerchiato da persone che volevano vendergli della droga in maniera forzata mentre uno cercava di rubargli il portafoglio, oppure di notte c’è gente strana che basta non guardare negli occhi (la mia impressione è che sia così perché vogliono venderti droga e cercano di capire dallo sguardo chi sia interessato e comunicarlo in modo non verbale) , quando vado in bici ricevo catcalling “bella di mamma!” “Come ti chiami?” “Dove vai?”, e ci sono delle persone che dormono a terra e una volta una persona non reagiva più e si pensava fosse morta. Risse ma non spesso, qua non ci sono problemi di “bande”.\n\nQuello che volevo dire è che nonostante questi problemi, nessuno mi ha per esempio derubata dal nulla senza che me ne accorgessi, non ho mai visto un coltello per strada e se mi faccio i cazzi miei , tranne quando vado in bici per qualche motivo, nessuno mi rompe i coglioni. \n\nInvece là, tenendo comunque conto che è evidente ci sia del degrado, la situazione è davvero così pericolosa? Si rischia molto vivendo la? \n\nChiedo perché dai media sembra sia raro che qualche ragazza possa camminare la da sola o che qualcuno non abbia la costante paura che volino coltelli , ma vorrei capire se la situazione è più “ok c’è degrado e non è il massimo” o proprio di pericolo \n ",
        "upvotes": 24,
        "comments": 44,
        "media": null,
        "permalink": "/r/torino/comments/1lixygh/i_media_stanno_esagerando_la_situazione_barriera/"
    },
    {
        "id": "1lj84zc",
        "author": "chiaracau",
        "title": "Abbonamento GTT disoccupati",
        "content": "Ho fatto un abbonamento per disoccupati a fine marzo, periodo in cui ero disoccupata e risultavo iscritta a CPI.\nAdesso però non lo sono più (anche se in una condizione un po' precaria). L'abbonamento ha validità di un anno, in teoria, e continua a funzionare.\nQualcuno sa se dovrei passare dalla GTT a disattivarlo o se posso continuare a usarlo fino a scadenza?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1lj84zc/abbonamento_gtt_disoccupati/"
    }
]