[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1ohiawi",
        "author": "Marengard",
        "title": "Gay bar?",
        "content": "Premetto che non abito a Torino, ma in un paesino vicino ad Asti. \nVorrei sapere se c’è qualche bar frequentato principalmente da ragazzi gay, perché mi piacerebbe conoscere qualcuno, non solo per andarci a letto ma anche per qualcosa di un po’ più serio. \nNon essendo molto un tipo da discoteca non saprei dove altro incontrare qualcuno se non in qualche bar.\n\nNon essendo dichiarato con tutti non posso cercarne ad Asti, ma anche se fosse non saprei come trovarli haha.\n\nGrazie in anticipo per i suggerimenti!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ohiawi/gay_bar/"
    },
    {
        "id": "1ogtako",
        "author": "freddyravioli",
        "title": "Grazie Torino! Sei stata una favola. Thank you Torino, you were a dream!",
        "content": "I just spent the most wonderful solo weekend in Torino! The beautiful sun shining I’m sure helped, however I truly found it to be one of the most charming and underrated Italian cities I’ve visited.\n\nThe people were friendly and warm. \n\nThe food is to die for - from the traditional home cooking to the Michelin fine dining. The shopping is excellent. The chocolate delicious, the architecture gorgeous and the wine selection vast and moderately priced. \n\nI didn’t get to see and do everything I wanted to - particularly on the museum front as the weather was too nice to be indoors, but here were a few things I did do which I would recommend.\n\n1. Grab a drink at Banco. Whether wine or a great martini, it’s intimate and vibey and the staff are friendly. \n2. The Hilton Turin Centre is in a great location and comfortable. \n3. Splurge on a truly unforgettable dinner at one star Michelin restaurant Unforgettable. Unique concept and great staff. \n4. Take a nice long walk by the river Po \n5. Eat an incredible piemontese lunch at caffè dell’orologio. The wine selection was chef’s kiss and I honestly nearly ate two pasta dishes.\n\nWander, walk, get lost and look up.\n\nGrazie Torino, I’ll be back!! \n\n",
        "upvotes": 74,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ogtako/grazie_torino_sei_stata_una_favola_thank_you/"
    },
    {
        "id": "1ohf4l8",
        "author": "Lostingoogle",
        "title": "Qualcuno a Torino ha attivato la fibra Digi?",
        "content": "Sto valutando varie offerte di internet a casa e ho visto che Digi offre fibra FTTH a prezzi davvero bassi (10 €/mese).  \nSembra quasi troppo bello per essere vero, quindi mi chiedevo com’è la qualità della connessione: stabile? ping decente? assistenza affidabile?  \nSe qualcuno la usa già a casa, mi piacerebbe sapere come si trova.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ohf4l8/qualcuno_a_torino_ha_attivato_la_fibra_digi/"
    },
    {
        "id": "1ohexb4",
        "author": "mainapizza",
        "title": "Posti in montagna per workshop",
        "content": "Ciao a tutti, ci provo. \n\nSto cercando dei posti che si trovino in montagna per organizzare workshop, in particolare mi interessa che:\n\nAbbiano proiettore e casse\nFacciano pensione completa (colazione, pranzo e cena)\nIn contesti immersivi, ad esempio Ceresole Reale o simili \nAvete qualche idea, anche se non sapete per certo? \n\nGrazie mille ❤️",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ohexb4/posti_in_montagna_per_workshop/"
    },
    {
        "id": "1ohbenj",
        "author": "GenauTurin",
        "title": "Techno parties in Turin with GENAU - November-December",
        "content": "https://reddit.com/link/1ohbenj/video/3mm3lo4kymxf1/player\n\n  \n  \nWinter is coming and we're ready to heat you with a new series of **GENAU parties** for November and December! Celebrate pure clubbing and join our techno community in some of the finest venues in Turin such us [@notoriusclubtorino](https://www.instagram.com/notoriusclubtorino/), [@gianca.murazzi](https://www.instagram.com/gianca.murazzi/) and [@bunkertorino](https://www.instagram.com/bunkertorino/): we will host a selection of the best techno djs and producers around to make you dance all night, supported by our residents!  \n  \n🎟 10€ Early Bird Tickets for all our events are already out on our LINKTREE (limited availability)  \n  \n08.011.25 (Saturday)  \nw/ **Ø \\[PHASE\\]** [@phase\\_modwerks](https://www.instagram.com/phase_modwerks/) (Modwerks - Mote Evolver / UK), Bassik, Polizei  \n📍Notorius Club  \n  \n21.11.25 (Friday)  \nw/ **FELICIE** [@felicie.music](https://www.instagram.com/felicie.music/) (Fastgroove - Clergy / FR), Black Crow, Gandalf  \n📍Gianca Club Murazzi  \n  \n06.12.25 (Saturday)  \nw/ **ESTELLA BOERSMA** [@estellaboersma](https://www.instagram.com/estellaboersma/) (eb\\_rex - Lobster Theremin / NL), Gandalf, Polizei  \n📍Notorius Club  \n  \n12.12.25 (Friday)  \nw/ **REKA ZALAN** [@rekanorazalan](https://www.instagram.com/rekanorazalan/) (Hardwax / DE), Delle Orfane, Saffio  \n📍Gianca Club Murazzi  \n  \n19.12.25 (Friday)  \nw/ **SETAOC MASS**  [@setaoc\\_mass](https://www.instagram.com/setaoc_mass/) (SK\\_eleven / UK), Gandalf, Max Sensation  \n📍Bunker\n\n**10€ Early Bird Tickets** on sale for all parties (limited availability) &gt; [https://xceed.me/world/events/all/all-events/channel--genau-secret](https://xceed.me/world/events/all/all-events/channel--genau-secret)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ohbenj/techno_parties_in_turin_with_genau/"
    },
    {
        "id": "1ohatps",
        "author": "Impressive_Lynx_7938",
        "title": "Ristorante Torino",
        "content": "Qualcuno mi sa consigliare un ristorante/osteria o comunque un posto dove andare a mangiare bene a Torino senza spendere troppo? \nVa bene sia cucina piemontese che alla you can eat interessanti (no sushi).\nGrazie ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ohatps/ristorante_torino/"
    },
    {
        "id": "1ohezn4",
        "author": "mxschutz",
        "title": "Consigli sul parcheggio per raggiungere a piedi piazza Bodoni (di sera)? Ovviamente sono disposto a camminare un po'",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ohezn4/consigli_sul_parcheggio_per_raggiungere_a_piedi/"
    },
    {
        "id": "1ogsn7r",
        "author": "BoudoirdiVeronica",
        "title": "Just looking for real, simple connection in Torino",
        "content": "Hey! I recently moved to Turin and I’m looking for real, simple connection not romance, just friendly, easy-going people to hang out with.\nThe kind of people you can go at vintage market, to the bar or exhibition.\nI’ve been to a few expat meetups they were fun, but I’d love something smaller and more spontaneous.\nWould be great to have a few people to text and meet regularly, not only during events.\n\nI sew lingerie and corsets, love art, cozy spots, vintage, museums, dancing or just walking around and talking about life.\nI have a small dog, speak English (but it’s not my first language), and I’m learning Italian and happy to practice together if you are too.\nOh, and Halloween is coming — if anyone’s looking for company to go out, I’m in!\nIf this sounds like something you’d enjoy too, feel free to message me.\nOr if you know where to find chill people in Turin , I’m all ears.",
        "upvotes": 25,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1ogsn7r/just_looking_for_real_simple_connection_in_torino/"
    },
    {
        "id": "1ohcemx",
        "author": "irmakinon",
        "title": "RC auto prezzo",
        "content": "Ciao, è normale pagare 1500 euro per l’RC Auto? Grazie. (ho 22 anni)",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1ohcemx/rc_auto_prezzo/"
    },
    {
        "id": "1ogtqzx",
        "author": "Abject-Analysis-4179",
        "title": "Qualcuno per nuove conoscenze a Torino?",
        "content": "Ciao! Sono una ragazza di 23 anni e mi piacerebbe ampliare un po’ il giro di conoscenze qui a Torino.  \nNon sono tipo da discoteca, quindi mi chiedevo se ci fossero posti più tranquilli dove socializzare.  \nAdoro invece i circoli culturali, i locali con musica dal vivo (soprattutto rock) e le chiacchierate senza troppa confusione.  \nCerco persone con cui uscire ogni tanto, scoprire eventi o semplicemente bere un caffè.  \nSe ti va, lascia un commento qui sotto. :)",
        "upvotes": 16,
        "comments": 33,
        "media": null,
        "permalink": "/r/torino/comments/1ogtqzx/qualcuno_per_nuove_conoscenze_a_torino/"
    },
    {
        "id": "1oh9o71",
        "author": "isthisyasmin",
        "title": "Restricted driving times in Torino",
        "content": "Hello, I'm fairly new to the city. I have a car to commute to work north of the city about 2-3 times per week, but luckily I don't need to go near the ZTL areas in centro. I just learned there's winter driving restrictions, but I can't seem to find the official rules. Some sites say alternate days are restricted depending on your license plate, and another says only the first Sunday of the month. I haven't found anything about where the boundaries are, though. Can anyone provide insight or point me in the right direction?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oh9o71/restricted_driving_times_in_torino/"
    },
    {
        "id": "1ogz5s3",
        "author": "Tony_zer0five",
        "title": "Cerco amici con la passione dei fumetti, lego e videogiochi",
        "content": "Ciao sono un ragazzo di 20 che abita in provincia di torino.\nCerco qualcuno con cui fare amicizia che abbia la passione per i fumetti o lego o videogiochi \nVorrei conoscere qualcuno che si aggira nella mia età va bene sia maschi che femmine.\nMi piacciono i lego e li colleziono.\nLego fumetti Marvel, DC, image, Mirage, spawn, Tmnt, Punisher, Deadpool, spiderman e tantissimi ho una grande collezione.\nMi piacciono i videogiochi come Minecraft, GTA, the forest, Cod\nMi piacciono anche i giochi di carte ma non sono molto esperto a giocare.\nMi piacciono anche gli skateboard e sto cercando di imparare ad andarci \nFaccio arti marziali ora faccio brasilian jiu jitsu e in passato ho fatto altri sport \nMi piace andare ai mercatini delle pulci e del vintag\nSono molto socievole \nSe ti interessa contattami qui ho in privato.\nSpero di trovare qualcuno come me. ciao",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ogz5s3/cerco_amici_con_la_passione_dei_fumetti_lego_e/"
    },
    {
        "id": "1oh97m4",
        "author": "Several_Attorney9726",
        "title": "Cerco ragazza per introduzione al mondo dello Shibari",
        "content": "\nCiao! Sono un ragazzo di 18 anni, curioso, rispettoso e neofita, desideroso di scoprire il mondo dello Shibari in modo sicuro e consapevole. Cerco una ragazza gentile e con esperienza che sia disponibile a guidarmi in questa pratica. Non ho disponibilità economiche, ma sono aperto a discutere in privato di un accordo che possa essere interessante per entrambi.\n\nPropongo un aperitivo o una chiamata conoscitiva nel pomeriggio per conoscersi meglio in un ambiente rilassato. Massima discrezione e rispetto reciproco garantiti.\n\nSe ti va di condividere questa esperienza, scrivimi! 😊",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1oh97m4/cerco_ragazza_per_introduzione_al_mondo_dello/"
    },
    {
        "id": "1ogs6hg",
        "author": "RadioHot9251",
        "title": "Cannavacciuolo Bistrot",
        "content": "Ciao a tutti,\n\nQualcuno e' stato al Cannavacciuolo Bistrot a Torino? vale la pena?\n\nVengo a trovare i miei genitori (80enni) e pensavo di portarli per fargli provare l'esperienza, ma non so se in effetti ha senso, considerando la qualita' dei locali di Torino in generale, e il fatto che i miei sono di solito piu' interessati al cibo.\n\nfatemi sapere, grazie",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ogs6hg/cannavacciuolo_bistrot/"
    },
    {
        "id": "1ogre68",
        "author": "No-Site-4490",
        "title": "Ristorante romantico per anniversario",
        "content": "Ciao a tutti!\n\nPrima di fare questo post ho cercato nel sub ma non mi pare sia stato fatto un post con i dettagli che cerco.\n\nA dicembre sarò a Torino per la prima volta e cerco un ristorante con questo mix: atmosfera romantica + budget alto ma non esagerato + cucina locale tipica + raggiungibile con i mezzi pubblici.\n\nAvete delle idee? Grazie mille in anticipo a tutti",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ogre68/ristorante_romantico_per_anniversario/"
    },
    {
        "id": "1ogje6p",
        "author": "Desperate_Airline397",
        "title": "AAA Cercasi Palestra",
        "content": "Buongiorno, cerco palestra su torino (zona Vanchiglia/centro)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ogje6p/aaa_cercasi_palestra/"
    },
    {
        "id": "1ofvcd2",
        "author": "Swimming_Ad_6748",
        "title": "Vicini irrispettosi e rumorosi. Caso isolato oppure no?",
        "content": "Ciao a tutti,\n\navrei una domanda per gli abitanti di Torino, essendo le mie esperienze terribili. Ho cambiato qualche casa in questi anni a Torino, sempre zona cenisia/san paolo/cit turin.\n\nOgni volta che mi son ritrovata ad avere al piano di sopra o di sotto persone sudamericane é sempre stato un bagno di sangue.\n\nUrlano la notte, mettono musica a livelli impossibli, hanno sempre gente in casa la notte, spostano mobili preoccupandosi zero di non farli scivolare sul pavimeno generando quel rumore odioso.\n\nSono solo io tanto sfortunata oppure é capitato o sta capitando anche a voi? \n\nPlease non tacciatemi di post razzista o che, non ci azzecca proprio nulla. É solo una statistica basata su un cluster. Non so se derivi da usi/costumi, modi di essere, sano menefreghismo o semplicemente casi isolati. \n\nSe mi dite che son casi isolati son solo che contenta, per rimuovere dalla mia testa un'etichetta che ho appiccicato inevitabilmente loro a causa delle mie sofferenze.\n\nDa li deriva la curiosità.\n\nEDIT: l'ho omesso per non fare il post troppo lungo, ma sono disperata. Mi svegliano la notte, ho contattato l'amministratore di condominio che li ha avvertiti, li ho avvertiti pure io, ma niente. Soffro sempre molto quando esiste gente che non ha rispetto per gli altri, specie se la vivo in prima persona...\n\nGrazie!",
        "upvotes": 38,
        "comments": 46,
        "media": null,
        "permalink": "/r/torino/comments/1ofvcd2/vicini_irrispettosi_e_rumorosi_caso_isolato/"
    },
    {
        "id": "1ogjmdp",
        "author": "nati_1983",
        "title": "Vol à Turin",
        "content": "Bonjour tout le monde, hier dans l’après midi je me suis fait volé, ils ont volé plusieurs affaires personnelles les valises avec les affaires de mes enfants et des choses très personnelles et aussi mon iPhone 16 que j’arrive à localiser à via Amedeo 30 à Turin, malheureusement ma voiture à été endommagé et je suis rentrée chez moi en Suisse…est-ce que quelqu’un pourrait m’aider a retrouvé mon téléphone et le restant des affaires si possible 🥹",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1ogjmdp/vol_à_turin/"
    },
    {
        "id": "1ofvkze",
        "author": "minidonnie",
        "title": "Cerco fotografo a Torino",
        "content": "📸🎥 Cerco su Torino un* fotograf* da affiancare come assistente.\nHo già un po' di esperienza nella fotografia di moda ed editoriale e vorrei espandermi anche negli altri ambiti, possiedo anche attrezzatura per fare un po' di tutto.\nHo esperienza basilare nella manipolazione delle luci e dell'attrezzatura.\nAllego sotto alcuni miei scatti, se interessati commentare o mandare un messaggio in dm 😄",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1ofvkze/cerco_fotografo_a_torino/"
    },
    {
        "id": "1og6z25",
        "author": "AccidentFit3238",
        "title": "Unito master in material science",
        "content": "Hey everyone is there anyone studying in Unito's masters in material science course if yes let me know I'm a freshman and literally so confused right now 😭",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1og6z25/unito_master_in_material_science/"
    },
    {
        "id": "1ofxoam",
        "author": "taikiji",
        "title": "Vi interessa avere un comune laico? Firmate questa proposta su TorinoFacile: Petizione per la rimozione del crocifisso dalla sala del consiglio comunale",
        "content": "Ciao a tutti,  \nsegnalo questa proposta su TorinoFacile che secondo me merita un po’ di attenzione.\n\nÈ una di quelle cose che, se passa inosservata, finisce nel nulla — ma se raccoglie firme, il Comune deve prenderla in considerazione.  \nFirmare richiede giusto un minuto (serve SPID o CIE) (bisogna essere residenti a Torino).\n\nSe vi interessa l’argomento o pensate possa migliorare un po’ la città, dategli un’occhiata e magari lasciate la firma.  \nE se vi va, condividetela con altri torinesi: più voci ci sono, più qualcosa si muove. \n\nServono sole 200 firme.",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1ofxoam/vi_interessa_avere_un_comune_laico_firmate_questa/"
    },
    {
        "id": "1ofwmrr",
        "author": "Aggravating-Aspect55",
        "title": "Domanda zona scalo eventi",
        "content": "La settimana prossima devo accompagnare mia moglie a fare un concorso in zona scalo eventi. Sapete consigliarmi qualche posto lì vicino dove posso mettermi con il PC a lavorare mentre lei fa il concorso?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ofwmrr/domanda_zona_scalo_eventi/"
    },
    {
        "id": "1oez4yp",
        "author": "Travelwanderlust5",
        "title": "Le nuove destinazioni aeree da Torino!",
        "content": "Che ne pensate? ",
        "upvotes": 225,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jihszn7ek2xf1.jpeg?auto=webp&amp;s=2ba7108dcf722fd94b8c0de9472f6529d3e73ce9"
        },
        "permalink": "/r/torino/comments/1oez4yp/le_nuove_destinazioni_aeree_da_torino/"
    },
    {
        "id": "1ofscds",
        "author": "dann0606",
        "title": "Gruppi o siti per affitti brevi",
        "content": "Salve a tutti. Sto cercando un alloggio a torino per il mese di novembre. Ci sono gruppi telegram o siti che mi consigliate per la ricerca? Grazie 🙏🏻",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ofscds/gruppi_o_siti_per_affitti_brevi/"
    },
    {
        "id": "1oeqf2x",
        "author": "MicheleCaracas",
        "title": "Mamma mia la metro si ferma ormai tutte le mattine ma che schifo",
        "content": "Niente volevo solo sfogarmi, Gtt merda totale",
        "upvotes": 160,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1oeqf2x/mamma_mia_la_metro_si_ferma_ormai_tutte_le/"
    },
    {
        "id": "1ofxtge",
        "author": "serfun22",
        "title": "Chiedo a ragazze e donne di mentalità aperta",
        "content": "Mettiamo che ci sia un 50enne di reddito e cultura elevata.\nChe sia molto gentile e rispettoso della liberta individuale.\n\nMettiamo che abbia avuto per qualche anno una relazione libera con una ragazza di 25 anni molto carina e sia stata una di quelle relazioni in cui lei era felice di visitare luoghi, mangiare in posti, comprare e fare cose che non si sarebbe potuta permettere, ma che  fosse contenta di stare, senza vincoli per lei, in una relazione con una persona di cultura e esperienza che la consigliava e l'aiutava a trovare la sua strada.\n\nLui era contento di passare delle mezze giornate, a volte qualche giorno, in compagnia di una persona giovane e piena di vita e progetti e che a lui piacesse non solo questo ma anche sinceramente aiutarla a raggiungere i suoi obbiettivi, insegnarle un po' di inglese, trovarle un lavoro in USA e tanto che si sono visti poi ancora dopo qualche volta in USA.\nAncora si sentono.\n\nParticolare importante. \nLei ha continuato a vedere e cercare ragazzi che andassero bene per i suoi progetti ed ora infatti è in USA con un compagno e un figlio.\nLui è sposato con figli ormai maggiorenni ed ha una moglie/amica con la quale ha un ottimo rapporto ma non più intimo da anni.\n\nOra la domanda alle ragazze e alle giovani donne.\n\nMa come vedete una relazione di questo tipo?\n\nDavvero la condannate? Davvero non ci vedete un rapporto, come in fondo sono tutti, in cui entrambe le persone offrono e ricevono qualcosa in modo libero e vantaggioso per entrambi?\nUn rapporto certo che non ha un progetto a lunga termine ma che porta piacere vero ed un miglioramento della qualità della vita per entrambe le persone.\n\nSe possibile vorrei evitare i commenti di perbenisti e moralisti di varia natura, ma se argomentatiti sono pronto a discuterne.\n\nHa solo avuto fortuna o, in Italia, è  possibile che si ripeta? \n\nSe si avete suggerimenti su come lui possa venire in contatto con un'altra persona cosi? \nSul web è  pieno di offerte ma sono tutti rapporti vuoti da una mezz'ora e via. Non è quello che questo 50 enne cerca.\n\nChiedo per un amico 😉\n\n\n\n\n\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ofxtge/chiedo_a_ragazze_e_donne_di_mentalità_aperta/"
    },
    {
        "id": "1oeyajx",
        "author": "eddz_",
        "title": "Posso dipendere da gtt di notte?",
        "content": "Quindi sto uscendo con gli amici (venerdì) come un bar che è a 40 minuti da me. Probabilmente tornerò verso le 23 posso fare affidamento sul fatto che non ritardi come un'ora? ",
        "upvotes": 12,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1oeyajx/posso_dipendere_da_gtt_di_notte/"
    },
    {
        "id": "1of34v9",
        "author": "Aromatic-Gift4353",
        "title": "Parrucchieri cinesi a Torino?",
        "content": "Non chiedo una zona precisa perché abito e lavoro in due zone differenti di Torino e quindi mi va bene un po' di tutto, sono anche disposta a spostarmi un po'.\n\nSono una ragazza quindi non barbieri!\n\nChiedo specificatamente cinesi perché al momento non riesco a permettermi i prezzi degli italiani, ma se conoscete parrucchieri italiani che mi fanno pagare sui €16 una messa in piega sono ben accetti. \n\nGrazie!",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1of34v9/parrucchieri_cinesi_a_torino/"
    }
]