[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 6,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1o16mzv",
        "author": "Euphoric-Spare-2871",
        "title": "Pensate che negli ultimissimi anni (dal Covid a oggi) Torino stia cambiando in meglio o in peggio?",
        "content": "",
        "upvotes": 14,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1o16mzv/pensate_che_negli_ultimissimi_anni_dal_covid_a/"
    },
    {
        "id": "1o1beah",
        "author": "Hyzev_",
        "title": "Ristoranti buoni ma economici",
        "content": "Ciao ragazzi, potete indicarmi dei ristoranti buoni ma economici dove andare a cena? Pensavo a qualcosa tipo 40€ a testa, meglio se piemontese ",
        "upvotes": 2,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1o1beah/ristoranti_buoni_ma_economici/"
    },
    {
        "id": "1o1gnpy",
        "author": "Aggressive-Panda8084",
        "title": "affitti brevi a Torino",
        "content": "Ciao! A Novembre mi trasferirò a Torino per due mesi per un tirocinio. A Torino è difficile trovare stanze in affitto per affitti brevi di due mesi? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o1gnpy/affitti_brevi_a_torino/"
    },
    {
        "id": "1o1egl9",
        "author": "verautopya",
        "title": "Cerco sarto/a e cosplay maker di Torino preferibilmente, per completare due cosplay per il Lucca Comics!",
        "content": "Salve! \nCerco un/una sarto/a e cosplay maker, di Torino preferibilmente, per aiutarmi a \"completare\" (ovviamente pagando) due cosplay per il Lucca Comics.\n\nSo come si presenta la richiesta (la solita richiesta disperata, non \"promettente o allettante\"), ma non chiedo un costume intero o lavori arzigolati/complicatissimi... \nPurtroppo ho avuto conferma tardi per il Lucca Comics, altrimenti lo avrei fatto avrei fatto preparato tutto con molto anticipo.\nI cosplay sono Esquie e Monoco di Expedition 33. \n\nChiunque possa essere interessato,\nnon esiti a scrivermi o contattarmi per maggiori info! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o1egl9/cerco_sartoa_e_cosplay_maker_di_torino/"
    },
    {
        "id": "1o0jxrg",
        "author": "matteo0MTF",
        "title": "Sapete cosa succede?",
        "content": "Sono passati adesso in emergenza (andavano di fretta con carro che ha il cannone ad acqua) verso il centro sembra, altra manifestazione pro pal o altro?",
        "upvotes": 66,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1o0jxrg/sapete_cosa_succede/"
    },
    {
        "id": "1o19009",
        "author": "Melodic-Dirt-5512",
        "title": "Agenzie Immobiliari 1 sola mensilità.",
        "content": "Ciao a tutti.\nSto cercando casa e tutte le agenzie in cui mi sono imbattuto (dato che di privati a Torino ce ne sono pochi) chiedono 2 o addirittura 3 mensilità. \n\nConoscete agenzie che prendono solo 1 mensilità?\n\nGrazie ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o19009/agenzie_immobiliari_1_sola_mensilità/"
    },
    {
        "id": "1o18of6",
        "author": "FreeAd8663",
        "title": "Concerto Pino Scotto - venerdì 10 ottobre 2025 - presso \"Il Peocio\" di Trofarello (TO) - opening act Only One Black band",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o18of6/concerto_pino_scotto_venerdì_10_ottobre_2025/"
    },
    {
        "id": "1o0qntq",
        "author": "JohnnyCannuccia",
        "title": "Quanto spendete di condominio? [How much do you spend for condominium administration]",
        "content": "[English below]\n\nCiao a tutti! Sto cercando di capire se le spese ordinarie del mio condominio (onorario amministrazione + manutenzioni ordinarie, pulizie, ecc.) siano o meno sovradimensionate rispetto alla media. Vi chiederei pertanto, se vi va, di condividere all’incirca quanto spendete ogni anno di condominio senza contare spese straordinarie, acqua e riscaldamento (nel mio caso è autonomo) specificando, se possibile, quanto grande è il vostro condominio. Grazie in anticipo a chi vorrà rispondere!\n\nHi all! I’m currently trying to understand if the ordinary expenses of my building administration (administrator fees, ordinary checks, cleaning, etc.) are too much with respect to the average. Therefore, I’d like to ask you to share, if you want, how much do you pay per year without including extraordinary expenses, water, and heating (as in my case it’s autonomous) specifying, if possible, how big is more or less your building. Thanks in advance to who’s gonna answer!",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o0qntq/quanto_spendete_di_condominio_how_much_do_you/"
    },
    {
        "id": "1o0oit1",
        "author": "Revolutionary_Move79",
        "title": "Consigli per un corso di fotografia (livello base/medio) a Torino",
        "content": "Ciao a tutti!  \nVorrei iniziare un corso di fotografia a Torino, livello base o medio, per migliorare nella pratica e imparare a usare meglio la fotocamera (scatto in manuale e in RAW, ma vorrei fare un po’ di ordine e tecnica).Mi piacerebbe un corso in presenza, magari serale o nel weekend, con un gruppo piccolo per poter esercitarsi davvero sul campo.  \nQualcuno ha esperienze dirette o può consigliarmi scuole, associazioni o corsi validi in zona Torino/Cuneo?\n\nGrazie mille in anticipo 🙏",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o0oit1/consigli_per_un_corso_di_fotografia_livello/"
    },
    {
        "id": "1o0qi35",
        "author": "musictomurderto",
        "title": "Trip to Torino!",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o0qi35/trip_to_torino/"
    },
    {
        "id": "1o0aeeh",
        "author": "eza137",
        "title": "Tips about Torino for a one-day trip: is it worth a visit?",
        "content": "Ciao tutti! I'm visiting my brother in Cuneo. I'm more of a city person - I live in Berlin and grew up in São Paulo - and my brother likes mountains and nature. I've visited a few big Italian cities before, but not Turin, so I'm thinking of checking it out tomorrow while he's at work, and I'm on vacation.\n\nI'm thinking of visiting two museums, the Risorgimento Museum and the National Cinema Museum, and eating some regional food. I'm also thinking about renting a car and spending the weekend with my brother in the mountains. Another idea would be a visit to the university, if that is possible for visitors. Just to have an idea of its environment.\n\nDoes anyone have recommendations for good local restaurants or cafés? Do you have any tips about renting a car and returning it on Sunday? I see that the city is culturally very rich ([WikiVoyage](https://en.wikivoyage.org/wiki/Turin)), so I am overwhelmed by the many possibilities.\n\nP.S. I can understand Italian because I lived here for a while, but I write much faster in English.",
        "upvotes": 7,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bdZcSWM0ksSPXGggj2ejANUqiqv8rz-nTxIioCRm9uI.jpeg?auto=webp&amp;s=b35d5ad7efe0abb45f85d7b8b1f398c31c1c65fc"
        },
        "permalink": "/r/torino/comments/1o0aeeh/tips_about_torino_for_a_oneday_trip_is_it_worth_a/"
    },
    {
        "id": "1o0aytu",
        "author": "Nibby067",
        "title": "Posto letto per studenti a torino",
        "content": "Ho iniziato quest'anno al dipartimento di informata, oltre al fatto che quest'anno hanno dato 14 posti letto (a me rode perchè ero 77esimo) su 550+ persone che hanno fatto richiesta, mi son ritrovato a cercare casa all'ultimo, poichè ero convinto avrei avuto il collegio, teoricamente dovrei ricevere, a metà ottobre, il 20% della borsa di studio (1661 euro) ma a sto punto, meglio essere pessimisti e sto facendo tutti i calcoli (con la mia famiglia) tenendo conto di non riceverla, nonostante il mio isee molto basso però ripeto, a sto punto meglio essere pessimisti; voi avete qualche consiglio? possibilmente no agenzie perchè money are tight, se non dovessi riuscire a trovare casa sarei costretto ad andare a bari e il solo pensiero di rimanere altri 3 anni nella mia città natale, sperduta nelle campagne del sud, mi fa solamente stare male ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o0aytu/posto_letto_per_studenti_a_torino/"
    },
    {
        "id": "1o0fe47",
        "author": "lospavaldo",
        "title": "Sei appassionato di anime e manga",
        "content": "Sei  appassionato di anime e manga che vive a torino o in provincia ma passi le giornate a guardare anime da solo, chiuso in casa, senza amici con cui condividere la propria passione mentre tantissime altre persone hanno una vita sociale attiva.\n\nPer quanto tempo vuoi ancora rimanere così? \n\nBasta essere considerato dalle persone uno sfigato!\n\nEd è proprio per questo che è nata la Toman Italiana: la community anime e manga più grande d’Italia, con oltre 500 membri attivi su WhatsApp.\nAttraverso i nostri eventi e raduni, ti diamo la possibilità di socializzare davvero, creare amicizie durature e vivere esperienze uniche con chi condivide la tua stessa passione.\n\n👉 Entra nel gruppo WhatsApp e inizia oggi stesso a cambiare la tua situazione.\n\n\nhttps://chat.whatsapp.com/Bi3jTiiDIZOCJrA6ymFWdZ?mode=ems_copy_t",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o0fe47/sei_appassionato_di_anime_e_manga/"
    },
    {
        "id": "1nzexbz",
        "author": "Bruno_Barbiere",
        "title": "In queste settimane sono fuori da Torino per lavoro, vi chiedo quindi: com'è stato DAVVERO questo weekend di cortei e scioperi per Gaza? Violento con ingenti danni come i tg lo descrivono o tranquillo con casi isolati di violenza?",
        "content": "",
        "upvotes": 113,
        "comments": 157,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cjkvi8m2tgtf1.jpeg?auto=webp&amp;s=c021f77367d574e323c547369cf64a40432d46a2"
        },
        "permalink": "/r/torino/comments/1nzexbz/in_queste_settimane_sono_fuori_da_torino_per/"
    },
    {
        "id": "1nzldk5",
        "author": "Agitated-Standard627",
        "title": "Ho creato una mappa interattiva per visualizzare quanto siano ben collegate le diverse zone di Torino",
        "content": "# TLDR;🚉 Ho creato una mappa interattiva per visualizzare quanto siano ben collegate le diverse zone di Torino (e di altre città italiane) tramite treni e tram — tutto è iniziato da un post su Reddit!\n\nCiao a tutti! 👋  \nVolevo condividere un progetto su cui ho lavorato: si chiama **The Proximity Project**, ed è una mappa web interattiva che mostra quanto facilmente si possono raggiungere diverse aree dalla stazione di treno o tram più vicina.\n\n🔗 **Provalo qui** → [https://proximity.duckiesfarm.com/italy/turin](https://proximity.duckiesfarm.com/italy/turin)\n\nhttps://i.redd.it/9p7tgl7w9itf1.gif\n\n# 🗺️ Cosa fa?\n\nVisualizza le **isochrone** — aree colorate che mostrano quanto sei distante (in minuti) dalla fermata di **treno** o **tram** più vicina.  \nQuesto significa che puoi vedere immediatamente quali zone sono ben collegate da un trasporto pubblico **affidabile e su rotaia**, che tende a essere più puntuale rispetto agli autobus, specialmente in città come Roma.\n\nQuesto può essere molto utile per:\n\n* **Turisti** che cercano alloggi a breve termine ben collegati, anche fuori dal centro storico\n* **Expat o lavoratori da remoto** che vogliono trovare un posto dove vivere senza bisogno di un'auto\n* **Residenti** che vogliono comprendere meglio la rete di trasporto pubblico della loro città\n\n# 💡 Come è iniziato\n\nTempo fa, ho visto un [post su Reddit di un utente](https://www.reddit.com/r/roma/comments/1ib2ue7/mappa_di_roma_dentro_il_raccordo_indicando_in/) che aveva creato manualmente una mappa simile, solo per divertimento.  \nMi ha ispirato [a creare un piccolo prototipo](https://www.reddit.com/r/rome/comments/1j3gwkc/metroproximity_project/) mentre ero in viaggio per lavoro. Ho condiviso la versione iniziale quí su Reddit, ho ricevuto feedback positivi e ho pensato — perché non farne qualcosa di più completo?\n\nEd eccoci qui 😊\n\n# 🌟 Cosa fá\n\n* 🚉 Visualizza tutte le isocrone globalmente o seleziona una stazione specifica\n* ⏱️ Clicca su qualsiasi isocrona per vedere quanto è distante quel punto dalla stazione o dalla fermata\n* 🧭 Ricerca integrata degli indirizzi\n* 📍 Rilevamento automaticamente la tua posizione\n\n# 💬 Aiuto!\n\nSto ancora lavorando attivamente al progetto, e qualsiasi feedback (bug, idee, suggerimenti) è più che benvenuto! cosa vi piace, cosa no vi piace, cosa aggiungere, cosa togliere, sono quí per capire come procedere.\n\nAh, per i piú nerd, tutto il codice sorgente è open e [disponibile qui](https://github.com/nicolgit/proximity)\n\nGrazie per aver letto, fatemi sapere cosa ne pensate!",
        "upvotes": 42,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1nzldk5/ho_creato_una_mappa_interattiva_per_visualizzare/"
    },
    {
        "id": "1nzw7n2",
        "author": "the_owl_doctor",
        "title": "È un buon stipendio per Torino?",
        "content": "Ho ricevuto un'offerta da un'azienda italiana ma non conosco bene il costo della vita né gli stipendi medi in Italia. Sono un data engineer con 5 anni di esperienza.\n\n\nIl dettaglio dell'offerta è:\n\nRetribuzione annua lorda (14 mensilità): 24.000 euro\nBuoni Pasto: 5,29 euro per giorno lavorativo\nIndennità giornaliera: 30 euro per giorno lavorativo\nRimborso spese mensile: 800 euro al mese\n\nQuindi, il totale netto mensile ammonterebbe a circa 3007 euro.\n\n È uno stipendio adeguato?\n\nGrazie ",
        "upvotes": 9,
        "comments": 52,
        "media": null,
        "permalink": "/r/torino/comments/1nzw7n2/è_un_buon_stipendio_per_torino/"
    },
    {
        "id": "1nzu2x9",
        "author": "One-Spot9425",
        "title": "vetro auto spaccato",
        "content": "\nCiao a tutti,  \nper l’ennesima volta mi ritrovo con il vetro dell’auto spaccato. Ormai è diventata una triste abitudine. Questi maledetti, con una certa “gentilezza”, si preoccupano di rompere solo il vetro piccolo, giusto quel tanto che basta per aprire la macchina e rovistare dentro.\nIn auto non tengo nulla in vista, solo un paio di occhiali nel cassetto portaoggetti, che peraltro non hanno nemmeno toccato. il fatto è avvenuto nella zona  Piazza Statuto cinema cityplez e San Donato. Un’area che, almeno in apparenza, sembrerebbe tranquilla… ma la realtà pian piano vedo peggiorare, anche se al momento nn si avvicina a certi quartieri.\nSi vedono spesso persone  che si drogano per strada, ovunque capiti, e lo spacciatore di turno che consegna come fosse un rider di Glovo sul monopattino o bici,  È davvero uno schifo. E peggiora di giorno in giorno.\nOra, al di là dello sfogo, mi chiedo: ha senso fare denuncia? Non ho l’assicurazione contro atti vandalici né quella per i cristalli. Però forse una denuncia potrebbe servire a far controllare un po’ di più la zona, o magari nel caso improbabile in cui trovassero il colpevole ottenere un risarcimento. Anche se, diciamocelo, sarà quasi sicuramente nullatenente, quindi non ci sarebbe nulla da recuperare.\n\nQualcuno di voi ci è già passato?  \nAvete fatto denuncia? Vi ha portato a qualcosa?  \nFatemi sapere",
        "upvotes": 9,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1nzu2x9/vetro_auto_spaccato/"
    },
    {
        "id": "1nzhok6",
        "author": "barbogia",
        "title": "Se vi piace twilight e la roba gratis entrate in questo post",
        "content": "Buon pomeriggio a tutti, creo questo post per cercare qualcuno che voglia due biglietti (VE LI REGALO) per la ri-proiezione di Twilight alle 18:30 di domani, 07/10/2025 al cinema The Space Torino in zona Dora.   \nMagari ci fare un regalo alla vostra ragazza mentre vi fate una pennichella al The Space.  \nNe approfitto per lamentarmi di come un'azienda come The Space, possa inserire il messaggio \"Funzione non ancora implementata\" sul tasto \"Richiedi rimborso\" del vostro sito di m\\*\\*\\*a incompleto.",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nzhok6/se_vi_piace_twilight_e_la_roba_gratis_entrate_in/"
    },
    {
        "id": "1nzcb7e",
        "author": "2b__b2",
        "title": "Arriving late at Porta Susa (~11:30 PM) – is it safe to take a taxi to?",
        "content": "I’ll be arriving in **Turin around 11:30 PM** at **Porta Susa station** (coming from Milan). I’m planning to head to my reservation, and I was thinking of booking a taxi using **Wetaxi** instead of using public transport that late or public transport be safer? The place I am gonna stay is very near to porta susa around 1.1 km distance\n\nI just wanted to ask —\n\n* Is it generally **safe around Porta Susa at that time of night**?\n* Would you recommend any other option or area to be cautious about?\n\nIt’s my **first time in Italy**, so I’m just trying to be a bit careful on my first night. Thanks a lot for any tips or reassurance!",
        "upvotes": 17,
        "comments": 36,
        "media": null,
        "permalink": "/r/torino/comments/1nzcb7e/arriving_late_at_porta_susa_1130_pm_is_it_safe_to/"
    },
    {
        "id": "1nzeolm",
        "author": "Merciful_Fake",
        "title": "Avete mai provato il \"Treno verde delle Alpi\"?",
        "content": "Vorrei fare un regalo a una coppia di amici di Torino, entrambi amanti delle gite in montagna e dei viaggi in generale. Ieri sera ho scoperto l'esistenza del Treno Verde delle Alpi (tratta Domodossola-Berna), e pensavo a una gift card del valore di 65 euro a persona, valida per un giorno.  \nQualcuno di voi ha esperienza di quel tipo di viaggio? Merita?  \nGrazie in anticipo.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nzeolm/avete_mai_provato_il_treno_verde_delle_alpi/"
    },
    {
        "id": "1nzhwfe",
        "author": "Otherwise-Chip4531",
        "title": "date invernali a torino e dintorni?",
        "content": "consigliate qualche idea per delle uscite carine ma casual da fare in inverno la sera che non siano andare al cinema o andare a bere un drink :)",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nzhwfe/date_invernali_a_torino_e_dintorni/"
    },
    {
        "id": "1nze9vu",
        "author": "Smorgastorta96",
        "title": "Lezioni private patente A",
        "content": "A quanto pare c'è una crisi millenaria di autoscuole e motorizzazioni, quindi ci vuole un botto di tempo per fare guide ed esami. Mi hanno detto che la guida la posso prenotare minimo il mese prossimo, quindi vorrei sapere se ci fosse qualcuno che potrebbe dare 1-2 lezioni giusto per poter andare in concessionaria e saperne uscire in moto.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nze9vu/lezioni_private_patente_a/"
    },
    {
        "id": "1nyurme",
        "author": "Over_Examination2861",
        "title": "In giro per Vanchiglia",
        "content": "🚶📷",
        "upvotes": 28,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nyurme/in_giro_per_vanchiglia/"
    },
    {
        "id": "1nz6grp",
        "author": "Initial_Car6604",
        "title": "Economics in English at UniTo",
        "content": "Anyone here doing Economics in English at UniTo?  is it indeed offered entirely in English?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1nz6grp/economics_in_english_at_unito/"
    },
    {
        "id": "1nzcr9c",
        "author": "Individual-Egg3290",
        "title": "Digital nomad here, any good recommendations for co-work/co-live",
        "content": "Greetings all, \n\nI am a digital nomad, looking to work and travel. I have been to Torino once for 5 days and loved it. I am currently looking to go on a journey around Europe and stopping by there again, this time looking for 3-5 weeks. Are there any places that offer accommodation for such a stay, preferably with other nomads or short-term expats. The idea of all this is to meet as many new people as possible, so hotel and airbnb recommendations don't cut it for me. Any suggestions are welcomed!",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1nzcr9c/digital_nomad_here_any_good_recommendations_for/"
    },
    {
        "id": "1nzcez8",
        "author": "PlatanoThorn69",
        "title": "Sagre ottobre Torino e dintorni",
        "content": "Ciao ragazzi, come da titolo, sapete dirmi se ci sono sagre a cui vale la pena andare in questo mese? Guidatorino suggerisce bene?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1nzcez8/sagre_ottobre_torino_e_dintorni/"
    },
    {
        "id": "1ny45d5",
        "author": "bert87",
        "title": "Sometimes you Have to Look up",
        "content": "",
        "upvotes": 297,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1lvv2qwrj5tf1.jpeg?auto=webp&amp;s=8d87edd74577256dca7897b8c9a2f24cf52253d0"
        },
        "permalink": "/r/torino/comments/1ny45d5/sometimes_you_have_to_look_up/"
    },
    {
        "id": "1nz0m0x",
        "author": "mirageoflower",
        "title": "Pilates e yoga a Torino",
        "content": "Ci provo: qualcuno saprebbe consigliarmi palestre o altri posti dove si tengono corsi di pilates e/o yoga fatti bene? Preferibilmente in città o in posti facilmente raggiungibili con i mezzi, siccome sono una studentessa fuorisede senza macchina. Grazie!\n\n... Ah, e possibilmente che non chiedano un rene in cambio :')",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nz0m0x/pilates_e_yoga_a_torino/"
    }
]