[
    {
        "id": "1pn4mth",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 10,
        "comments": 574,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pn4mth/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1pmq8et",
        "author": "scoreboard-app",
        "title": "Post Match Thread: Deportivo Alaves vs Real Madrid, La Liga",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1pmq8et)",
        "upvotes": 174,
        "comments": 445,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pmq8et/post_match_thread_deportivo_alaves_vs_real_madrid/"
    },
    {
        "id": "1po1fio",
        "author": "No-Independent2522",
        "title": "Paris St-Germain have been ordered by a French court to pay former striker Kylian Mbappé €60 million (£52.5m) in unpaid salary and bonuses.",
        "content": "",
        "upvotes": 364,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3epg4unnsmAjE7yox4EzEq2Xd2OQGvMocFfiaOyfm_g.jpeg?auto=webp&amp;s=74d2ed8fb57898e1199a63a9e69b831a519e67d2"
        },
        "permalink": "/r/realmadrid/comments/1po1fio/paris_stgermain_have_been_ordered_by_a_french/"
    },
    {
        "id": "1pnzq4d",
        "author": "reelond",
        "title": "Flash: as known as Fede Valverde",
        "content": "Funny photo from Real Madrid newsletter 😂\n\nBut seriously, he can run very fast, that is very useful in defence as he can arrive first to all long balls. But also useful in the band in attack. Plus, he can make very good passes and crosses. Still, I think he is wasted in defence and he can do more in attack. But sometimes he is left a bit alone for that in the right side.",
        "upvotes": 135,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qpilgiebyj7g1.jpeg?auto=webp&amp;s=512cf2bb23ac71d7e7ded661331058ed2e8205cd"
        },
        "permalink": "/r/realmadrid/comments/1pnzq4d/flash_as_known_as_fede_valverde/"
    },
    {
        "id": "1pny1fc",
        "author": "TheFeatherDiaries",
        "title": "[The Touchline X] Florentino Pérez on the NEGREIRA case involving Barcelona: \"Who will believe that millions of euros were paid for technical reports that apparently were supposed to be useless because they weren't even provided to the coaches?\"Who, apparently, didn't even know of their existence?''",
        "content": "",
        "upvotes": 170,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pny1fc/the_touchline_x_florentino_pérez_on_the_negreira/"
    },
    {
        "id": "1po5455",
        "author": "No-Independent2522",
        "title": "Spanish Football Referees' Association publishes official statement rejecting Florentino Pérez's numerous accusations due to \"the serious harm that this type of statement causes to the reputation of the refereeing community and Spanish football as a whole\"",
        "content": "",
        "upvotes": 53,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1po5455/spanish_football_referees_association_publishes/"
    },
    {
        "id": "1pnz7b8",
        "author": "Ineedhelpistaken",
        "title": "Mbappé is leader in la liga stats in terms of shots",
        "content": "",
        "upvotes": 116,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/e7sae5trsj7g1.jpeg?auto=webp&amp;s=998a589010ec428bb83e0bffc9c3d184c13961d1"
        },
        "permalink": "/r/realmadrid/comments/1pnz7b8/mbappé_is_leader_in_la_liga_stats_in_terms_of/"
    },
    {
        "id": "1pnwdyn",
        "author": "Heras22",
        "title": "Incase you missed it. Here is Laporta's lies and contradictions at his testimony yesterday.",
        "content": "Testimony was an hour long. I gather some of the important  bits and translated them. \n\n\nRelationship with Negreira\n\nClaim: Laporta said FC Barcelona never dealt with José María Enríquez Negreira, only with his son (Javier Enríquez), who supposedly produced the reports.\n\nContradiction:\n\nFormer president Sandro Rosell testified that Negreira senior personally carried out the reports.\n\nEmails exist between Laporta and Negreira senior, contradicting the claim that they never spoke or dealt with each other.\n\n\nAdditional inconsistency:\n\nLaporta said he didn’t even know Negreira senior was Vice President of the Referees’ Committee, which is widely considered implausible.\n\nWho Supposedly Wrote the Reports\n\nClaim: Laporta said Negreira’s son was responsible for preparing the refereeing reports.\n\nContradictions:\n\nAt the time, Negreira’s son was part of Fenerbahçe’s coaching staff, raising serious doubts about:\n\nHow he had the time\n\nHow he could perform detailed Barça-specific referee analysis\n\n\nRosell’s testimony directly contradicts this, stating the father, not the son, did the work.\n\n\nExistence and Destruction of Reports\n\nClaim: Laporta said reports were routinely destroyed every five years.\n\nContradictions:\n\nLaporta later appeared at a press conference with red boxes full of reports and CDs, allegedly containing hundreds of reports.\n\nHe even displayed two specific reports from 2012, contradicting the claim of systematic destruction.\n\nHundreds of reports later “appeared” in storage, despite allegedly being destroyed years earlier.\n\n\nKnowledge of Payments\n\nClaim: Laporta said he never knew about the payments or their amounts, because presidents don’t approve all expenses.\n\nContradictions:\n\nHe later stated that any payment over €3,000 requires board approval, contradicting his earlier claim of ignorance.\n\nHe personally justified a dramatic increase in payments, meaning he must have known about both:\n\nThe existence of the payments\n\nTheir amounts\n\nEscalation of Payments\n\nClaim: Laporta justified quadrupling the payments by saying there were “more matches and more competitions.”\n\nContradiction:\n\nThis explanation requires detailed knowledge of the payments, directly contradicting his claim that he didn’t know about them.\n\nThe increase (from tens of thousands to hundreds of thousands of euros annually) is considered grossly disproportionate to any increase in matches.\n\n\nCoaches and the Alleged Reports\n\nClaim: Laporta stated that all coaches received and used the refereeing reports.\n\nContradictions (sworn testimony):\n\nLuis Enrique:\n\n&gt; “In six years as a coach, nobody showed me a single refereeing report, neither to me nor my staff.”\n\n\n\nErnesto Valverde:\n\n&gt; “I was never offered nor shown any refereeing reports.”\n\n\n\nThese are the primary intended recipients of such reports, making Laporta’s claim untenable.\n\nSuspicious Invoices\n\nInvoice 1 – “Aloe Vera Gifts”\n\nFC Barcelona paid €60,000 to a Negreira-linked company for an invoice labeled “aloe vera gift packs”.\n\nNo credible explanation was provided as to how this relates to refereeing analysis.\n\n\nInvoice 2 – 2010 World Cup Referee Report\n\nBarça paid for a report analyzing referees at the 2010 World Cup before the tournament even took place.\n\nThis suggests billing for services that could not yet have been performed.\n\n\nOverall Pattern Highlighted by the Testimony\n\nRepeated use of:\n\n“I don’t remember”\n\n“I didn’t know”\n\n“That wasn’t my responsibility”\n\n\nContradictions between:\n\nLaporta’s statements\n\nDocumentary evidence (emails, invoices)\n\nTestimony from other presidents\n\nTestimony from coaches\n\n\nA central defense (“the payments were for reports”) that is directly undermined by every coach who should have received them\n\n\nBottom Line\n\nLaporta simultaneously claims:\n\nHe didn’t know about the payments\n\nHe justified increasing them\n\nThe reports were vital\n\nThe reports were never seen by the coaches\n\n\nThese positions cannot logically coexist.",
        "upvotes": 163,
        "comments": 32,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pnwdyn/incase_you_missed_it_here_is_laportas_lies_and/"
    },
    {
        "id": "1po3kfa",
        "author": "No-Independent2522",
        "title": "[NYT] Real Madrid, world’s richest football club, the wealthiest, most consistently profitable football club in the world, with record revenues of over €1bn. Spanish giants right now on the brink of a transformative change to their ownership model, these questions and more are answered in detail.",
        "content": "",
        "upvotes": 27,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DlCIWdtiHuGu8ufNMlwDn0uaCT9oYohdjkqLV868gD0.jpeg?auto=webp&amp;s=ad9a011b509c87c16ccc25c389a9ef76c8d30f86"
        },
        "permalink": "/r/realmadrid/comments/1po3kfa/nyt_real_madrid_worlds_richest_football_club_the/"
    },
    {
        "id": "1pnojnf",
        "author": "asensia-kopfschmerz",
        "title": "They’ve left Xabi all alone: Bayer Leverkusen CEO Fernando Carro questions Real Madrid's treatment of their coach.",
        "content": "",
        "upvotes": 299,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NHjQJkz7dBOFwBEfgchM1DaL6iKAbPlHfqMJ79auBEo.jpeg?auto=webp&amp;s=fad6841977342fc069d2c1ed99498c9dda4c03dc"
        },
        "permalink": "/r/realmadrid/comments/1pnojnf/theyve_left_xabi_all_alone_bayer_leverkusen_ceo/"
    },
    {
        "id": "1pn2qjr",
        "author": "Nyghl",
        "title": "How did Guler see this? Also what a team play by the Brazilians.",
        "content": "",
        "upvotes": 2679,
        "comments": 169,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lu41lhic0c7g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pn2qjr/how_did_guler_see_this_also_what_a_team_play_by/"
    },
    {
        "id": "1pnuhim",
        "author": "Hisense_Sports1",
        "title": "FIFA reveals Best XI forwards shortlist: Messi, Ronaldo, Mbappé, Haaland, Salah, Kane, Vinícius, Yamal… thoughts?",
        "content": "FIFA has officially released the forwards shortlist for the Best XI, featuring Messi, Ronaldo, Mbappé, Haaland, Salah, Kane, Vinícius Jr., Yamal and Dembélé.\n\nFrom a Real Madrid perspective, Vinícius Jr. and Mbappé all stand out after another decisive season on the biggest stages. Their impact in high-pressure matches, direct goal contributions, and importance to Madrid’s attack raise an interesting question:  \nWho are your picks — and what criteria matter most to you: trophies, stats, or big-game influence?",
        "upvotes": 29,
        "comments": 38,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pnuhim/fifa_reveals_best_xi_forwards_shortlist_messi/"
    },
    {
        "id": "1pn77jk",
        "author": "QuietFondant7523",
        "title": "Mbappe will pass Benzema. But will he become a Real Madrid legend?",
        "content": "",
        "upvotes": 623,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ixi5527mcd7g1.png?auto=webp&amp;s=9fc71c4f1d0391cb8de10a00795c7d7f732dfaaf"
        },
        "permalink": "/r/realmadrid/comments/1pn77jk/mbappe_will_pass_benzema_but_will_he_become_a/"
    },
    {
        "id": "1pnclf1",
        "author": "No-Independent2522",
        "title": "Perez: Yesterday against Alavés, the match was refereed by a referee who threatened to take action against our club on the eve of CDR final. And it seems that the interventions suffered by Vinícius and Rodrygo were not penalties. This is the latest episode in a long series of incidents this season",
        "content": "",
        "upvotes": 226,
        "comments": 36,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pnclf1/perez_yesterday_against_alavés_the_match_was/"
    },
    {
        "id": "1pn14cm",
        "author": "Ready_Ad_1353",
        "title": "John Cena recent post on Instagram",
        "content": "",
        "upvotes": 1248,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xp5qgl66hb7g1.jpeg?auto=webp&amp;s=d666e9ae06725c43aca4e6c0844a38ba38734686"
        },
        "permalink": "/r/realmadrid/comments/1pn14cm/john_cena_recent_post_on_instagram/"
    },
    {
        "id": "1pmzdcn",
        "author": "Scary-Procedure-6018",
        "title": "After all the disrespect he recieved, he still celebrates by kissing the badge.",
        "content": "Imo, our fanbase is definently spoiled if not the most spoiled fanbase itw, we can't face an obstacle without throwing fingers at random people and saying they're at fault.\n\nRodrygo scored 2 goals in 2 games so far and did the same celebration like he always does, kisses the badge and calls it a day. Anyone who doubted him in the first place is a clown, cuz there is no way that you watched this guy play games (not on insta reels) and still end up saying he's a \"waste\". Theirry henry went out on sky sports and said rodrygo is not normal. Jude bellingham himself went out and publicly called rodrygo the most talented player in the squad. \n\nYou can't blame a guy for not scoring in 32 games when he only started in 4 of them. Laliga today is just Barca, Real and 18 other teams that play nothing but low block football. You can't expect rodrygo to get subbed in and score a hattrick everytime. Vini hasn't scored in 12 games so far no one's making that much noise about it.\n\nHe came on against almaty in the 60-70th min and provided 2 assists. Went in to his 2nd ucl start this season against city and he immediately scored, is that a coincidence? I don't think so. The league is a very different story compared to the ucl, especially when its laliga.",
        "upvotes": 1005,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n9anzu0iya7g1.jpeg?auto=webp&amp;s=08e712439f3a7690caad2d02510e56fc15d7911c"
        },
        "permalink": "/r/realmadrid/comments/1pmzdcn/after_all_the_disrespect_he_recieved_he_still/"
    },
    {
        "id": "1po6ttx",
        "author": "mlndz__",
        "title": "Found a new Podcast for Madridistas: El Madridazo",
        "content": "Figured I would share a Podcast I found on Spotify (it’s in spanish). Dude is pretty funny and his analysis so far has been spot on. He posts a new episode about 3x/week. I started listening last month and am now addicted. If anyone has any other podcasts they recommend please let me know!Looking to find new ones 💪\n\nI was looking through the thread and found some old recommendations but those look to have stopped producing.\n\nPodcast: El Madridazo on Spotify\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1po6ttx/found_a_new_podcast_for_madridistas_el_madridazo/"
    },
    {
        "id": "1pngidl",
        "author": "Content-Drag-1499",
        "title": "It is everyone’s fault",
        "content": "I’ve been watching Real Madrid since 2000, and this era is starting to remind me of the Galácticos era.\n\nWe had unreal individual talent back then, but as a collective, it never truly clicked. I’m starting to feel the same pattern now: too much talent, not enough cohesion, and unclear leadership from the top.\n\nUpper Management\n\nThis situation starts with upper management. Their lack of clear and public support for Xabi is a major issue. We’ve seen this story before  it’s exactly why Zidane walked away during his second stint. When a coach feels like every match is a final, it creates fear, not progress.\n\nXabi is constantly under pressure, with the feeling that one bad result could cost him his job. Realistically, how many coaches can work intelligently and build something long-term under that threat? Upper management needs to be decisive: either fully back Xabi or just fire him and bring back Carlo lol.\n\nFlorentino also needs to be firm with Vini. Either sign the contract or accept reduced minutes. No one, regardless of talent, should be bigger than the club. If others are performing better or fitting the system, they deserve playing time.\n\nSquad planning has also been poor. Madrid should have signed more players. We are clearly short in defense  at least one or two more center-backs were needed —and we desperately need another midfielder who can consistently progress the ball and control tempo. Right now, we’re relying too much on individual brilliance instead of structure same as the Carlo era.\n\nPlayers\n\nSeveral players have been underperforming since last season, and not enough has changed. Jude needs to accept that replicating his 23/24 season is unrealistic. That season was exceptional, and asking him to carry the team again isn’t fair to him or the squad.\n\nVini hasn’t been at his best, and honestly, I think his contract situation is affecting him. He’s an emotional player, and when his head isn’t right, it shows. I believe once his future is settled, we’ll see a much better version of him again.\n\nThat said, Vini’s moment at El Clásico hurt the team’s morale. Leadership isn’t just about talent — it’s about composure. When emotions take over, the entire team feels it. Believe me I love Vini and I have every kit that he wore since he joined Real except this season. It breaks my heart to see him like this.\n\nDefensively, many of the goals we’ve conceded come from the same issue, half the team presses while the other half stands and watches. That’s not just a player problem  that’s a system and communication problem.\n\nXabi Alonso\n\nDespite everything, I’m still on Xabi’s side. He showed real promise earlier this season, and he’s been dealt with injuries, ego management, and a squad that wasn’t fully built for his ideas or players that want to believe in his system. \n\nI used to complain a lot about Carlo because we lacked a clear tactical identity. The “Carlo system” relied too heavily on individual moments, and that approach isn’t sustainable long-term. Xabi, at least, is trying to implement a structure  but structure takes time.\n\nThat said, Xabi isn’t blameless. He should have handled Vini better in El Clásico instead of ignoring the situation. Managing stars is part of the job at Madrid.\n\nI also criticize the constant lineup changes. While injuries explain some of it, stability matters. Players need chemistry, especially in midfield and defense.\n\nFinally, Xabi needs to recognize that Jude and Arda cannot play together if Jude is our number 10. The balance just isn’t there, and it hurts both players rather than helping either of them.",
        "upvotes": 48,
        "comments": 62,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pngidl/it_is_everyones_fault/"
    },
    {
        "id": "1pncm4u",
        "author": "AlekhineAl",
        "title": "Happy to have Bellingham at 10 but disappointed to see Arda completely absent from any involvement whatsoever in the final third. He has created 8 BIG Chances this season, the THIRD most in La Liga 2025-26 and the MOST in Real Madrid. Surely there has to be a way?",
        "content": "The problem amplifies when defenders are not able to find him from the back or when they hoof it long to no one. Add to that the structural issues of the team going forward creates an abundance of pointless recycling from deep. No penetration is becoming an Achilles heel of the team and moments of spark are almost always against the run of  play. The frustrating thing is that even playing DLP in the Club World Cup, he was so much more involved in the attack\n\nIs there no principle or system which can utilise Arda’s creativity and long shots in the final third?",
        "upvotes": 77,
        "comments": 70,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pncm4u/happy_to_have_bellingham_at_10_but_disappointed/"
    },
    {
        "id": "1pn12u1",
        "author": "Ready_Ad_1353",
        "title": "[Popfoot] Kylian Mbappe becomes the player with the 4th most goals in a single calendar year in the 21st Century",
        "content": "",
        "upvotes": 398,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rmfi91nogb7g1.jpeg?auto=webp&amp;s=50ddafa0e3ec3985efb3c8b101f8f2ceb02b73d7"
        },
        "permalink": "/r/realmadrid/comments/1pn12u1/popfoot_kylian_mbappe_becomes_the_player_with_the/"
    },
    {
        "id": "1pmprda",
        "author": "No-Independent2522",
        "title": "Rodrygo score, Vini assists",
        "content": "",
        "upvotes": 1850,
        "comments": 157,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7wv29zj5o87g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pmprda/rodrygo_score_vini_assists/"
    },
    {
        "id": "1pmo1ol",
        "author": "No-Independent2522",
        "title": "Mbappe opens the score 1-0 Alaves",
        "content": "",
        "upvotes": 1791,
        "comments": 133,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t6c58fyeb87g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pmo1ol/mbappe_opens_the_score_10_alaves/"
    },
    {
        "id": "1pn1wht",
        "author": "chunchunmaru1129",
        "title": "Fans who can't stay with Real Madrid in their worst period are all glory hunters and false fans",
        "content": "I have been a Real Madrid fan for the longest time.I was there when Pep's Barcalona used to dominate us and humiliate us every time with scorelines of 5-0 etc...\n\nI was there during the chaotic Galactico era. \n\nI was there during the Pep vs Mourinho era. \n\nI was there during Ancelotii and Zidane dominating days. \n\nI have seen Real Madrid during their worse period as a team and I have seen them during their best period. \n\nI will always support Real Madrid even if tomorrow they become financially in debt like Barcalona.\n\nAlways and Forever Real Madrid. \n\nPeople who can't stay with the Club during their bad patch aren't real fans they are just glory hunters. ",
        "upvotes": 155,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pn1wht/fans_who_cant_stay_with_real_madrid_in_their/"
    },
    {
        "id": "1pmok93",
        "author": "No-Independent2522",
        "title": "Asencio get confused and kicks the wrong ball",
        "content": "",
        "upvotes": 1032,
        "comments": 47,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/s404up7bf87g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pmok93/asencio_get_confused_and_kicks_the_wrong_ball/"
    },
    {
        "id": "1pmrnjd",
        "author": "No-Independent2522",
        "title": "Thibaut Courtois: \"Saving a ball with my face? You have to give your life for this badge\"",
        "content": "",
        "upvotes": 594,
        "comments": 31,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8g4ugrek297g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pmrnjd/thibaut_courtois_saving_a_ball_with_my_face_you/"
    },
    {
        "id": "1pnjbyd",
        "author": "jasminequila",
        "title": "supercopa in jeddah 2026",
        "content": "Any previous supercopa attendees here? Or someone who booked for the 2026 matches? I wanna know more about how early I need to be to book for the matches and which legit website I should buy them from/ I’d like to ask some questions about the process as someone coming from outside Saudi since they’re usually held there🙏",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pnjbyd/supercopa_in_jeddah_2026/"
    },
    {
        "id": "1pmqoib",
        "author": "utopiaofavalon",
        "title": "It's that time of the year again.",
        "content": "",
        "upvotes": 488,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sndmv8q1v87g1.jpeg?auto=webp&amp;s=c223c659d9393bff9327be37eb44975130c07085"
        },
        "permalink": "/r/realmadrid/comments/1pmqoib/its_that_time_of_the_year_again/"
    },
    {
        "id": "1pmqc2b",
        "author": "No-Independent2522",
        "title": "Vini penalty incident",
        "content": "",
        "upvotes": 506,
        "comments": 138,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bdbc0d4es87g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pmqc2b/vini_penalty_incident/"
    },
    {
        "id": "1pmv4ad",
        "author": "Hisense_Sports1",
        "title": "Rodrygo with back-to-back goals — are you satisfied with his recent performances?",
        "content": "Rodrygo finally has goals again.\n\nHe scored against **Man City in the UCL**, ending a **32-game goal drought**, and followed it up tonight with another goal — **76th minute away at Alavés**, giving Madrid a 2–1 lead.\n\nThis was also his **first La Liga goal in 329 days** (last one: January 19, 2025 vs Las Palmas), after **27 straight league games without scoring**.  \n**Are you satisfied with Rodrygo’s recent performances?**",
        "upvotes": 121,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pmv4ad/rodrygo_with_backtoback_goals_are_you_satisfied/"
    },
    {
        "id": "1pmedxk",
        "author": "CoolIsopod3095",
        "title": "What a player he could have been for the club 💔",
        "content": "",
        "upvotes": 813,
        "comments": 71,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tf4ggslab67g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pmedxk/what_a_player_he_could_have_been_for_the_club/"
    }
]