[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 485,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1h9e4ln",
        "author": "IAmPookieHearMeRoar",
        "title": "Netflix Sued Over Jake Paul-Mike Tyson Boxing Match Glitches",
        "content": "",
        "upvotes": 44,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h9e4ln/netflix_sued_over_jake_paulmike_tyson_boxing/"
    },
    {
        "id": "1h9fol2",
        "author": "PixelVapor",
        "title": "EXCLUSIVE: Richard Gadd may be personally sued as Fiona Harvey Netflix libel case looms",
        "content": "",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h9fol2/exclusive_richard_gadd_may_be_personally_sued_as/"
    },
    {
        "id": "1h9k8gu",
        "author": "sandynikola",
        "title": "stuck on net flix",
        "content": "Anyone else having this problem? I am scrolling on shows and go to coming soon. I added first show, No Good Deed, to add to my reminder. Netflix will not let me move around after that. Have to exit Netflix and go back in. Every time I hit No Good Deed, I get stuck again.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h9k8gu/stuck_on_net_flix/"
    },
    {
        "id": "1h9gj8x",
        "author": "n01_b4_flash",
        "title": "Help with finding particular UFO documentary",
        "content": "Hello,\n\nAt one point in time, there was a low budget, independent documentary that had to do with so called \"alien crash and retrieval.\" It was available on NetFlix when it used to be a DVD rental service. This was about supposed ET craft with the \"Men in Black\" taking over and intimidating the witnesses at the crash site.\n\nI remember seeing it one day but I don't remember the name and would like to see it again but have no idea what title search for lol\nAnyone can help??",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h9gj8x/help_with_finding_particular_ufo_documentary/"
    },
    {
        "id": "1h8yb9l",
        "author": "yuppieByDay",
        "title": "The auto play after finishing a series is a disease ",
        "content": "So was just finishing The Playlist on Netflix there was a solid 4 minutes left and was setting up the final scene of the show. No credits and still much part of the show. \n\nSuddenly a take over title card for prison break came up while still playing the audio and shortly after went to a trailer for it. And then the first episode of the show \n\nWtf? I excited and picked up where it left off and then it did play til the actual end. But why would they do this? Just so you’re on Netflix more? Super annoying. ",
        "upvotes": 52,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h8yb9l/the_auto_play_after_finishing_a_series_is_a/"
    },
    {
        "id": "1h98021",
        "author": "kschaffs",
        "title": "The Madness: it’s ridiculous and hard to quit ",
        "content": " I’ve only been through the first three episodes and nothing makes sense in reality about the what Muncie does but I gotta know what stupid shit he does next. MF just got backstage,unstopped, on some broadway play staging area in 2024. Straight Ninja. \n\n",
        "upvotes": 13,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1h98021/the_madness_its_ridiculous_and_hard_to_quit/"
    },
    {
        "id": "1h9bhcs",
        "author": "Jazzlike_Assignment2",
        "title": "The Madness",
        "content": "I saw the trailer today and decided to watch it because I mess with the limited series. I love the actors, but the plot is so out of the place. I don’t understand the rollercoaster I was on, but I felt like there was too much going on. What did yall think? Also I hated what happened to quinones (i understand why by assumption but still felt like there wasn’t enough context). ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h9bhcs/the_madness/"
    },
    {
        "id": "1h9iqp6",
        "author": "Kebabkrabbe",
        "title": "Netflix bugging around",
        "content": "Tried to get my grandma netflix on her TV but its always lagging, halting and even throwing her out. We tried to un- and reinstall it but nothing changed. Tried to refresh her netflix household but nothing. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h9iqp6/netflix_bugging_around/"
    },
    {
        "id": "1h8s6b9",
        "author": "Whobitmyname",
        "title": "Jason Bateman on Playing a Villain in Netflix Film ‘Carry-On’: “I’m Not Some Hardened Criminal-Looking Kind of Guy”",
        "content": "",
        "upvotes": 70,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1h8s6b9/jason_bateman_on_playing_a_villain_in_netflix/"
    },
    {
        "id": "1h9dazo",
        "author": "Newtothis_leavemebe",
        "title": "Subservience ",
        "content": "That one scene with Megan Fox. You know the one. Wow. \n\nanyway this movie was better than I thought it would be. megan played a really good AI robot. What did yall think?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h9dazo/subservience/"
    },
    {
        "id": "1h92q7i",
        "author": "gamersunite1991",
        "title": "American Primeval Cast and Director Discuss the Western Series’ Cultural Influences",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h92q7i/american_primeval_cast_and_director_discuss_the/"
    },
    {
        "id": "1h9fg9s",
        "author": "daddyvow",
        "title": "Where is the trivia verse?? ",
        "content": "Where did trivia go?\n\nI’m trying to find trivia verse and it doesn’t show up??? I’m\nTrying the open it up and it’s not shaking up at all. Where is the trivia??? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h9fg9s/where_is_the_trivia_verse/"
    },
    {
        "id": "1h9f87m",
        "author": "xXShalkurXx",
        "title": "Has anyone had this happen??",
        "content": "Hi! Family account owner here. My family and I share a account and recently it deleted itself randomly out of nowhere? Looking into the information layout to us more, we recently payed the fee for our account so we did NOT delete it ourselves, we contacted support but does anyone else know or have had this problem before???",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h9f87m/has_anyone_had_this_happen/"
    },
    {
        "id": "1h9b1pv",
        "author": "BonelessAir41",
        "title": "shared account with ads",
        "content": "So I have been using my account on my parents netflix in my apartment(s) since I moved out 3-4y) ago. It just now kicked me off due to not being in the same household. Set up a shared account added onto the plan, but now I have ads even though the main subscription is ad free?? Unless I am missing a setting or something that is fucked since I saw nowhere where it said ads would be on. Would have just made a fresh account.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h9b1pv/shared_account_with_ads/"
    },
    {
        "id": "1h9krwp",
        "author": "shaalalalan",
        "title": "What should I do?",
        "content": "Need help",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1h9krwp/what_should_i_do/"
    },
    {
        "id": "1h94sh9",
        "author": "generic_username-92",
        "title": "Woman of the hour ",
        "content": "i know this is a shot in the dark, but does anyone know when woman of the hour will premiere in netflix Egypt? I could have sworn i saw it but then suddenly it disappeared. \n\nIs there a website where I can find out when movies or series are coming to netflix? \n\nThank you! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h94sh9/woman_of_the_hour/"
    },
    {
        "id": "1h9lnd1",
        "author": "tooconfusedasheck",
        "title": "I Have the Next Big Reality Show Idea for Netflix/Prime—How Do I Cash In Without Getting Screwed?",
        "content": "So I actually have a genuine question. I have a fantastic reality TV show concept but for Netflix/Prime.\n\nI want to propose this to Netflix/Prime and get this started but not sure if they’ll pay me for the idea, for every episode/season, what will I be credited as, and if I need a capital for this?\n\nFor example, Netflix/Prime has two types of content, Original and Licensed.\n\nI’m presuming for Netflix/Prime to purchase the license to my show, I should have already had have the capital, created the show and then present it to Netflix/Prime.\n\nWith Originals, however, Netflix/Prime takes care of everything, correct?\n\nIf so, I’m not sure how I get integrated in all this! Like I don’t want to miss out on the 💰 with every successful episode/season.\n\nPlease educate me completely. I know I have several missing pieces and that’s exactly why I’m here seeking your help.\n\nHelp me get started please!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h9lnd1/i_have_the_next_big_reality_show_idea_for/"
    },
    {
        "id": "1h9ceuk",
        "author": "laurendharma",
        "title": "Name of Series Help - Maybe 2020-2024 - About a Female Middle Eastern Assassin. Her Reference Name was \" A Jinn\" or ' A Book of Jinns\"...",
        "content": "Hello, Netflix or Hulu Series Help Question. \n\nHello can anyone help me with the name of a Hulu/Netflix/Prime Series Name. \n\nThere was a Series i watched last year.\nA female middle eastern woman trying desperately to save her child,but also known to be a top \"Assassin\" in her country. The woman was refered to as a \"8th\" Jinn or a ???¿ Jinn had a favorite \"book of Jinns\". \n\n She was given The reference from a book she loved a child. Or a book her father or grandfather read to her. ( they visit this person on a cemetery). \n\nThere was a British or French MI6 or Intelligence woman attempting to gain her trust.   Was acting as a friend but really wanted to turn her over to the government,bcshe was a \"known Assassin\". \n\nThey traveled from European country to country in hiding. And fighting....but caring about each other. And sharing life experiences. About their kids, and lovers and families. \n\nThere was a secret message written on the inside of a car that could only been seen by breathing hot 🔥 breath onthe windows.\n\nShe was known to be killed in the end but most likely secretly got away.\n\nI loved this series and wanted to share with friends and family. Or see if there was a 2nde.\n\nI meant / mean no disrespect with this post. I am just looking for thr name of the series.\nI thought it was based around a \"Book of Jinns\" or the female being referred to as a \"Jinn\". Google was no help.\n\nThank you. \n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h9ceuk/name_of_series_help_maybe_20202024_about_a_female/"
    },
    {
        "id": "1h95xmf",
        "author": "ChallengeOk984",
        "title": "Searching a old movie",
        "content": "Around 2015 there was a Movie on Netflix that was about a boy that lived with his father. \n\nI don't know much about it anymore but I do know that there was a scene about a big girl was being bullied for eating a lot and she cried and ran away with the screen shaking with every step she took\n\nThere was also a scene where the boy had a test but he cheated by having a fly or a bug with a camera in it so he could see the answers of other students.\n\nIt could be that it was an Asian film but I don't know for sure, highly positive about it though.\n",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h95xmf/searching_a_old_movie/"
    },
    {
        "id": "1h9it7a",
        "author": "Kind_Celebration_229",
        "title": "How is Netflix allowed to do this?",
        "content": "In my experience I can't watch newer or \"triple A\" titles on netflix in HD. I am watching on OperaGX (which allows you to stream up to 1080p).\n\nI have:\n\n1. cHecKed mY iNtErnEt ConNecTioN  (it's around 200mbps EVERY time I check...)\n2. My streaming plan is 4K, set to stream with the best quality.\n3. searched for a solution multiple times throughout this year and found nothing I haven't done already.\n\nIf I am paying extra for better performance then why am I not getting it? Isn't this eligible for lawsuit?\n\nAlso, if anyone knows ANY solution to this please reply, thank you.\n\nEDIT: I am trying to watch movies in 1080p for those of you confused.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h9it7a/how_is_netflix_allowed_to_do_this/"
    },
    {
        "id": "1h92yh6",
        "author": "ashe_root",
        "title": "searching a show! ",
        "content": "I watched it on Netflix in maybe 2020 or 2021. It started with a teenage boy and teenage girl who were the only survivors of some zombie-like szene??? Then they were taken to some secret place where other people who also survived were. Then they kinda fell in love but were both killed suddenly. (then the main character changed a few times) at first they had enough food at this place, but they slowly ran out if it so they had to eat less and all the people who lived there were tested for radioactivity (?) and if they were too radioactive they were either unal*ved or hurt a lot. Does anyone know what this series/film was called??",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h92yh6/searching_a_show/"
    },
    {
        "id": "1h8hvro",
        "author": "here0is0me",
        "title": "Anyone know anything about this Pantone mug set?",
        "content": "Found this mug set thrift shopping today. Snagged it because Pantone mugs are great but tried to do some research on it and found shockingly little. Other than maybe Netflix gives them as gifts to certain stars or directors of exclusives? Any additional info would be appreciated! ",
        "upvotes": 104,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1h8hvro/anyone_know_anything_about_this_pantone_mug_set/"
    },
    {
        "id": "1h908or",
        "author": "Deadly_Butter",
        "title": "Anyone else?",
        "content": "Every time i click on something to watch it will only let me watch the trailer of it, i tried restarted the app and my tv but it's not helping? Is this happening to anyone else or is there a way i can fix this?",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h908or/anyone_else/"
    },
    {
        "id": "1h8vvi5",
        "author": "Rykka",
        "title": "Can’t login to Netflix - technical difficulties",
        "content": "I randomly got logged out of my Netflix earlier today. I tried logging in and it continuously said my password is incorrect - it’s not as it’s the same I’ve always used. I tried resetting and it just says “something has gone wrong” \n\nSometimes when I try login it also says they’re experiencing technical difficulties.\n\nAnyone else having this issue?",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h8vvi5/cant_login_to_netflix_technical_difficulties/"
    },
    {
        "id": "1h8wpbv",
        "author": "Talker365",
        "title": "Additional user payment error ",
        "content": "I have an additional user on my account. My main account is functioning fine and payment is working. I am able to watch it. My additional user is getting a message to pick a plan and update payment information? The payment is tied to my main account. Is there a reason this is happening? ",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h8wpbv/additional_user_payment_error/"
    },
    {
        "id": "1h8lqan",
        "author": "Blitzo-with-silent-O",
        "title": "Jentry Chau vs The Underworld is a fantastic show and everyone should check it out.  It needs as many eyes on it as possible.",
        "content": "I'm loving this show.  Fantastic animation style and the story is great as well. Feels like even though it is a animated show it still has adult stakes and something even adults can enjoy as well as kids.  If anyone is looking for something to watch please give this show a watch.  It definitely a show that needs to be renewed.",
        "upvotes": 37,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1h8lqan/jentry_chau_vs_the_underworld_is_a_fantastic_show/"
    },
    {
        "id": "1h9hqff",
        "author": "Mayank_soni18",
        "title": "Blur adult scene or skip",
        "content": "Is there any way i can blur or remove adult scene from a series or movie ? Cause want to watch so many series with family but due to those adult scenes i cant!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h9hqff/blur_adult_scene_or_skip/"
    },
    {
        "id": "1h8qhso",
        "author": "AdventurousMatch73",
        "title": "Extraordinary Attorney Woo was a Blast!!!! ",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h8qhso/extraordinary_attorney_woo_was_a_blast/"
    },
    {
        "id": "1h8ukcb",
        "author": "jdowney1982",
        "title": "That Christmas",
        "content": "Can anyone tell me if this movie mentions Santa not being real or people not believing? I’m trying to keep the magic alive for my kids and there are so few movies that don’t have a theme of people not believing in Santa or magic (Elf, The Santa Clause) so I’d like to find some more to add the the rotation!",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1h8ukcb/that_christmas/"
    },
    {
        "id": "1h8zm8m",
        "author": "SeanJShap",
        "title": "Netflix subtitles glitch? ",
        "content": "For some ungodly reason the subtitles have no spaces between random words, for example: \" we haveto get to thetrain station\" rather than \" we have to get to the train station\" . \nAnd this happens on every single show/movie I try to watch. Does netflix generate subtitles via some AI? If so why is there no quality control?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h8zm8m/netflix_subtitles_glitch/"
    }
]