[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 12,
        "comments": 81,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 63,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lfb5mu",
        "author": "intelerks",
        "title": "Millie Bobby Brown’s Netflix film hit by food poisoning outbreak during overseas filming",
        "content": "",
        "upvotes": 89,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1lfb5mu/millie_bobby_browns_netflix_film_hit_by_food/"
    },
    {
        "id": "1lepskj",
        "author": "S4v1r1enCh0r4k",
        "title": "'Mindhunter' Season 3 Isn’t Dead Yet – Star Reveals Surprising Update Fans Didn’t See Coming\"",
        "content": "",
        "upvotes": 602,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1lepskj/mindhunter_season_3_isnt_dead_yet_star_reveals/"
    },
    {
        "id": "1leu633",
        "author": "NoSweat_PrinceAndrew",
        "title": "Is there a way to remove the 'Add account' on the Netflix home screen? Our 8 year old has worked out he can just create a new account with adult content",
        "content": "Seems like a bit of a design flaw on Netflix part. Our 8 year old has worked out that if he loads Netflix on the TV when it gets to the screen to select a profile he can just create a new profile and just leave the children content box unlocked, enabling all the adult content to him\n\nI've looked everywhere on the app to see if the 'add profile' option can be removed but haven't been able to work it out\n\nAny suggestions??",
        "upvotes": 82,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1leu633/is_there_a_way_to_remove_the_add_account_on_the/"
    },
    {
        "id": "1lf057q",
        "author": "Conscious_Tonight_85",
        "title": "Looking for a new series",
        "content": "Looking for a series to watch, i feel like ive seen everything on netflix and prime that is good, but am trying to find more hidden gems\nSomething that has the vibe of any of these\nBreaking bad\nMayor of Kingstown\nBetter Call Saul\nOzark\nAnimal Kingdom\nSirens\nDead to Me\nYou\nsuccession\nSneaky Pete\nLandman\nMobland\n… Anything that would compare to those,\nThanks!\n(I have crave, apple tv, prime, paramount and netflix)",
        "upvotes": 25,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1lf057q/looking_for_a_new_series/"
    },
    {
        "id": "1lff3wv",
        "author": "Mooseport88",
        "title": "Now You See Me 2 Hidden Netflix Edit",
        "content": "I was watching Now You See Me 2 today on Netflix, a film I've seen several times over the years, and noticed something very odd.  It's quite obvious a Netflix editor decided to chop up a kinda jarring, and obvious, quick scene-addition edit into the movie at almost precisely 26 minutes in.  Note the two images I took above.  One was from Netflix and the other was from my owned copy on FandangoAtHome.  Not sure if this has been caught before, but wanted to share.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lff3wv/now_you_see_me_2_hidden_netflix_edit/"
    },
    {
        "id": "1lete3i",
        "author": "ThrowALifeline89",
        "title": "How is anyone supposed to hear all the dialogue that's being said with the audio being the way it is?",
        "content": "Hey everyone! Audio in movies not being great is at this point a well documented thing I believe. Yet it almost seems to be getting worse. I just watched *Extraction* on Netflix because someone recommended it to me. I mostly enjoyed the movie but the audio was so bad. Like there was an emotional scene between two characters but I couldn't understand a single word that one of them was saying. But then the explosions and gun shots are way louder. Sure, to a degree this can be used as a stylistic choice to make the violence more intimdating and such. However it can not be in the interest of the filmmakers that I, as a viewer, end up moving the volume up and down constantly depending if there are people talking or if there is fighting going on. Constantly.\n\nWhen are TV &amp; movie producers going to adress this problem? People have made videos about this on YouTube for years yet nothing is being done about it; what's up with that?",
        "upvotes": 17,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1lete3i/how_is_anyone_supposed_to_hear_all_the_dialogue/"
    },
    {
        "id": "1lfa6wn",
        "author": "falorraine",
        "title": "Language Filter",
        "content": "Why don’t they have one?  So irritating when I decide on some and it’s not in a language that I understand. Unless, I’ve completely missed how to filter my results.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lfa6wn/language_filter/"
    },
    {
        "id": "1lezeg1",
        "author": "Zaorth",
        "title": "Fubar(S2) is so bad",
        "content": "I really enjoyed the first Season and had the same expectations for the 2nd Season.\n\nBut after watching the first episode on season 2. It’s just heartbreaking for me to continue. \n\n- Terrible acting from the entire cast\n- Felt more like they had memorised the scripts instead of actually having a conversational flow\n- All the scenes were pretty much predictable\n\nThis is a series I would only continue if there was nothing left on the internet for me to consume.\n",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lezeg1/fubars2_is_so_bad/"
    },
    {
        "id": "1leylve",
        "author": "ninarinaa",
        "title": "i need show recs like now pleaseeee",
        "content": "watching shows is literally the best part of my day but i haven’t been able to find a good one in ages. \n\ni’ve enjoyed shows like game of thrones, desperate housewives, shameless, greys, money heist, derry girls, friends, breaking bad, gossip girl, the originals, the walking dead, dead to me, oitnb.\n\ni did NOT enjoy the last kingdom, lost, superstore, supernatural and succession. just found them boring. \n\ni thought i was into 2000s shows but i found the OC, gilmore girls and one tree hill extremely boring. i need shows that have loads of seasons and episodes. please im literally soooooo bored. ",
        "upvotes": 3,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1leylve/i_need_show_recs_like_now_pleaseeee/"
    },
    {
        "id": "1lf6loe",
        "author": "yeetmysock69",
        "title": "Netflix Account gone?",
        "content": "Hello,\nI tried logging into my Netflix account just now and I was logged out from every device.\nWhen I try to log back in, it tells me that there is no account with this email.\n\nIt acts as if my account has never existed, even though I've been subscribed for years.\n\nI can't find anything about this online and I don't want to chat with the AI Netflix support.\n\nCould anyone help me with this issue?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lf6loe/netflix_account_gone/"
    },
    {
        "id": "1lf51m3",
        "author": "Indoril-Nerevar337",
        "title": "Netflix Challenges Theme Parks with New Immersive Experience Centers in Philadelphia, Dallas, and Vegas",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lf51m3/netflix_challenges_theme_parks_with_new_immersive/"
    },
    {
        "id": "1lf0znm",
        "author": "satsrikom",
        "title": "Suit Vs Lincoln lawyer",
        "content": "I like both the series. Though few elements matches, but Harvey specter and Mickey heller have their own swag. Mickey’s Lincoln is so dashing and his screen presence also very good.\nHarvey having Mike (inside court)and Mickey having Cisco(outside court). \n\nEagerly waiting for the next season! ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lf0znm/suit_vs_lincoln_lawyer/"
    },
    {
        "id": "1leofd9",
        "author": "berrey7",
        "title": "Trainwreck: I have been looking forward to each Tuesday release.",
        "content": "I actually really like it, and I think they have done a really good job with it.  \n\nIt's been awhile since My wife and I have had something to look forward to each week as a series.",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1leofd9/trainwreck_i_have_been_looking_forward_to_each/"
    },
    {
        "id": "1lep5xz",
        "author": "Cartman",
        "title": "Netflix House to open in Philadelphia in late 2025",
        "content": "",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lep5xz/netflix_house_to_open_in_philadelphia_in_late_2025/"
    },
    {
        "id": "1lf354z",
        "author": "ferdia6",
        "title": "Constant freezing after adverts",
        "content": "Right I know this has been posted before but the posts are all old and I'm doing one last attempt to fix this before cancelling. \nOn my Panasonic TV netflix freezes after an advert. Every single time. You need to back out and restart. \nMy TV doesn't allow me to uninstall and reinstall the app, literally every other streaming app on there works without fail. \n\nIs there any point in me even attempting to fix this, I know this post is a fairly desperate one but here I am. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lf354z/constant_freezing_after_adverts/"
    },
    {
        "id": "1lf2a01",
        "author": "AnnArchist",
        "title": "When I select English subtitles it shows Russian(I think) subtitles",
        "content": "If I select English CC it won't play English. Some shows have English CC and English and one will work. It's really annoying when I'm trying to read and keep the volume low.\n\nAnyone ran into this? US location \n\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lf2a01/when_i_select_english_subtitles_it_shows_russiani/"
    },
    {
        "id": "1lew6ya",
        "author": "LoonyToony1",
        "title": "Any ideas for mobile and pc tools to add subtitles to a show or a movie that don't have the language you know?",
        "content": "I am trying to watch one piece and solo leveling but they don't have subtitles and it's really annoying and I am trying to learn Japanese when watching but they only got Japanese sub any ideas?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lew6ya/any_ideas_for_mobile_and_pc_tools_to_add/"
    },
    {
        "id": "1le525o",
        "author": "Ionazano",
        "title": "Is there anything new in \"Titan: the Oceangate Submersible Disaster\"?",
        "content": "So a new addition on Netflix that I noticed is \"Titan: the Oceangate Submersible Disaster\". It's currently in the top 10 most watched. On the one hand as someone with an engineering background I'm very interested in engineering cautionary tales. On the other hand I've already read about everything that happened leading up to the Titan submersible disaster in great detail.\n\nSo my main queston in deciding whether it's worth watching for me is the following: does this documentary contain any new information or perspective?",
        "upvotes": 99,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1le525o/is_there_anything_new_in_titan_the_oceangate/"
    },
    {
        "id": "1lf5zkt",
        "author": "TheTrueBlake",
        "title": "Netflix, why did you randomly remove Dexter?!",
        "content": "I've been binge watching Dexter for the past week or two, I'm in season 7. I was watching it earlier today, went to game for a few hours, opened Netflix back up on my TV and literally watched it disappear. Double checked netflix on my computer and it's still gone. It wasn't scheduled for removal so.. I've never seen or heard of this happening before, is this normal for Netflix? ",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1lf5zkt/netflix_why_did_you_randomly_remove_dexter/"
    },
    {
        "id": "1lewte2",
        "author": "-i-am-nowhere-",
        "title": "Autoplay controls under Playback Settings no longer working on Chromecast with latest app update. Any workaround?",
        "content": "Logged into Netflix via Chromecast and noticed the app had been overhauled with a brand new layout.  Additionally, everything autoplays instantly.  I had previously [disabled this under Playback Settings](https://i.imgur.com/TZaAvzp.png) and those settings appear to be unchanged, but no longer effective.  I went to the settings on desktop because I haven't been able to find them through Chromecast.  Is there another way to access these settings?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lewte2/autoplay_controls_under_playback_settings_no/"
    },
    {
        "id": "1lenp24",
        "author": "PurchaseWonderful536",
        "title": "Cocaine Air Documentary",
        "content": "First of all, this is by far the BEST work Netflix has done with a documentary in my opinion. First of all EVERYONE spoke, when I saw the ex French president on I couldn’t believe it. The mix of comedy with the facts and different perspectives is just perfect. \n\nOnly one question, why were money never mentioned? There was no mention of any sort of money being in the hands of any pilots, and I don’t mean from the flight they got caught on but the previous flights. If they were involved, they did other flights too, where is the money tho? ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lenp24/cocaine_air_documentary/"
    },
    {
        "id": "1lehdfn",
        "author": "bearsbeetspie",
        "title": "Justin Willman's New Netflix Special",
        "content": "TL;DR - Two things: \nFirst, the special - thoughts?\nSecond, upcoming tour - who's going?\n\n\n\nHow did everyone feel about the recently released special? \n\nI always wonder if I'm the only one who gets this feeling like I'm both happy AND want to cry after watching his performances Lol \nI know nothing he's doing is a \"miracle\", but he's just so uplifting even when he's cheeky or the jokes get going. At the end of his shows, it's like we all went on this journey, and I didn't realize how much I needed that lately. \n\n\nAnyways - as we were watching, I thought to myself \"huh, it seems that when comedians do a comedy special on Netflix, they're going on tour and they might come to Toronto\"... \nAnd sure enough, Justin is! \n\nWe got tickets to his show in Toronto, and I'm super stoked for it. \nAnyone else going? \nAnyone here seen him live before? What was your experience?",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lehdfn/justin_willmans_new_netflix_special/"
    },
    {
        "id": "1letoru",
        "author": "stuntman_matt",
        "title": "Subtitles",
        "content": "I’m watching a film on Netflix, it’s in English (Equalizer 3) but there are no “in film” subtitles for the foreign speaking bad guys. If I want to know what they are saying, I need to turn the subtitles on manually, which means that everyone in the film has subtitles now, not just the people speaking a foreign language. Does anybody know why or how to fix this please?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1letoru/subtitles/"
    },
    {
        "id": "1lebpwh",
        "author": "Successful_Blood3995",
        "title": "Your device isn't part of your household BS?",
        "content": "I am the account holder.  There is no one outside of my house using my account.  It's me and my two sons.  I am pretty much the only one who uses Netflix.  My kids are gamers.  All 4 pcs (2 kids, one me, one living room) are hardwired through the wall ethernet jack.  \n\nToday, I clicked on Netflix (Chrome browser) and it said that both my living room and bedroom pcs are not part of my household!  What? Lol.  I can sign in temporarily for 2 weeks and then I must create my own account lmao or use wifi.  How tf do I use wifi when I'm directly connected through the wall jack?  Netflix is crazy.  Anyone know how to deal with this?  \n\nIf this doesn't resolve I'm cancelling my subscription.  ",
        "upvotes": 9,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1lebpwh/your_device_isnt_part_of_your_household_bs/"
    },
    {
        "id": "1ldssxz",
        "author": "Swordfish353535",
        "title": "Having a lazy day at home, any good Netflix docu-series things of recent years to watch?",
        "content": "Haven't watched one in a while but have seen a lot of the old ones so wondering if there's any good ones released in the last 2 years or so?\n\nI'm seeing this Osama Bin Laden one although seeing mixed reviews. Ideally something that'll keep me gripped.",
        "upvotes": 132,
        "comments": 129,
        "media": null,
        "permalink": "/r/netflix/comments/1ldssxz/having_a_lazy_day_at_home_any_good_netflix/"
    },
    {
        "id": "1ldrjv1",
        "author": "Sea_Cookie2373",
        "title": "Too long ago",
        "content": "Does anyone else ever just start a whole show over because they forgot what happened, because it was so long since they made the last episode? Sometimes it's been what feels like a year...",
        "upvotes": 117,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1ldrjv1/too_long_ago/"
    },
    {
        "id": "1lenv60",
        "author": "DanAbnormal94",
        "title": "Sirens Paint Color Identification",
        "content": "Hi. I just wanted to see what the green color is in kitchen It is around the doors and on the island. If there is a Benjamin Moore match that would be great. My partner will be thrilled.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lenv60/sirens_paint_color_identification/"
    },
    {
        "id": "1leafxn",
        "author": "BerryDolly171819",
        "title": "I wanna watch more movies",
        "content": "The Kingsman movies are my favorite. I also loved the following:\nHunger Games,\nThe Match (Korean),\n7 Women and a Murder,\nThe Six Triple Eight\n\nI don’t really like movies that are pure romance. \n\nCan you please recommend something?",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1leafxn/i_wanna_watch_more_movies/"
    },
    {
        "id": "1lemtoc",
        "author": "smcneal",
        "title": "Charly Barby and Kelly Villares Are the Comeback Queens of the Dallas Cowboys Cheerleaders",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lemtoc/charly_barby_and_kelly_villares_are_the_comeback/"
    },
    {
        "id": "1lev4az",
        "author": "gaywidgeon_528",
        "title": "Ai ads coming for netflix??",
        "content": "I was searching netflix standard with ads because I read that apparently there is one and I wanted something cheaper. Turns out that isn't available in my country but I found something else. There's gonna be ai generated advertisement on Netflix starting in 2026. Um what? Why? Literally no one asked for this.  AND WHY IS AI PART OF EVERYTHING NOWADAYS \n\n(Sorry if this has already been discussed in this sub) ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lev4az/ai_ads_coming_for_netflix/"
    }
]