[
    {
        "id": "1o5m1il",
        "author": "shiruken",
        "title": "Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel 2025: Awarded to Joel Mokyr \"for having identified the prerequisites for sustained growth through technological progress\" and Philippe Aghion and Peter Howitt \"for the theory of sustained growth through creative destruction.\"",
        "content": "The Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel 2025 was awarded to [Joel Mokyr](https://en.wikipedia.org/wiki/Joel_Mokyr) \"for having identified the prerequisites for sustained growth through technological progress\" and the other half jointly to [Philippe Aghion](https://en.wikipedia.org/wiki/Philippe_Aghion) and [Peter Howitt](https://en.wikipedia.org/wiki/Peter_Howitt_(economist)) \"for the theory of sustained growth through creative destruction.\"\n\n* [Official Press Release](https://www.nobelprize.org/prizes/economic-sciences/2025/press-release/)\n* [Popular Information](https://www.nobelprize.org/prizes/economic-sciences/2025/popular-information/)\n* [Scientific Explanation of the Award](https://www.nobelprize.org/prizes/economic-sciences/2025/advanced-information/)\n* [Video of the Prize Announcement](https://www.youtube.com/watch?v=EajZObplJ8U)\n\n&gt;Technology advances rapidly and affects us all, with new products and production methods replacing old ones in a never-ending cycle. This is the basis for sustained economic growth, which results in a better standard of living, health and quality of life for people around the globe.\n\n&gt;However, this was not always the case. Quite the opposite – stagnation was the norm throughout most of human history. Despite important discoveries now and again, which sometimes led to improved living conditions and higher incomes, growth always eventually levelled off.\n\n&gt;Joel Mokyr used historical sources as one means to uncover the causes of sustained growth becoming the new normal. He demonstrated that if innovations are to succeed one another in a self-generating process, we not only need to know that something works, but we also need to have scientific explanations for why. The latter was often lacking prior to the industrial revolution, which made it difficult to build upon new discoveries and inventions. He also emphasised the importance of society being open to new ideas and allowing change.\n\n&gt;Philippe Aghion and Peter Howitt also studied the mechanisms behind sustained growth. In an article from 1992, they constructed a mathematical model for what is called creative destruction: when a new and better product enters the market, the companies selling the older products lose out. The innovation represents something new and is thus creative. However, it is also destructive, as the company whose technology becomes passé is outcompeted.\n\n&gt;In different ways, the laureates show how creative destruction creates conflicts that must be managed in a constructive manner. Otherwise, innovation will be blocked by established companies and interest groups that risk being put at a disadvantage.\n\n&gt;“The laureates’ work shows that economic growth cannot be taken for granted. We must uphold the mechanisms that underly creative destruction, so that we do not fall back into stagnation,” says John Hassler, Chair of the Committee for the prize in economic sciences.",
        "upvotes": 55,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/u1rZmVqAUe-D7vZViTXxNOCeU1-Ant85FA7vZCTrodY.jpeg?auto=webp&amp;s=3ad4e54a989a62ef671becb3b6d77cbcc4a6dbda"
        },
        "permalink": "/r/science/comments/1o5m1il/sveriges_riksbank_prize_in_economic_sciences_in/"
    },
    {
        "id": "1o1cp2z",
        "author": "shiruken",
        "title": "The Nobel Prize in Chemistry 2025: Awarded to Susumu Kitagawa, Richard Robson, and Omar M. Yaghi \"for the development of metal-organic frameworks\"",
        "content": "The Nobel Prize in Chemistry 2025 was awarded to [Susumu Kitagawa](https://en.wikipedia.org/wiki/Susumu_Kitagawa), [Richard Robson](https://en.wikipedia.org/wiki/Richard_Robson_(chemist)), and [Omar M. Yaghi](https://en.wikipedia.org/wiki/Omar_M._Yaghi) \"for the development of metal-organic frameworks.\"\n\n* [Official Press Release](https://www.nobelprize.org/prizes/chemistry/2025/press-release/)\n* [Popular Information](https://www.nobelprize.org/prizes/chemistry/2025/popular-information/)\n* [Scientific Explanation of the Award](https://www.nobelprize.org/prizes/chemistry/2025/advanced-information/)\n* [Video of the Prize Announcement](https://www.youtube.com/watch?v=0d02ONEXWkc)\n\n&gt;Susumu Kitagawa, Richard Robson and Omar Yaghi are awarded the Nobel Prize in Chemistry 2025. They have developed a new form of molecular architecture. In their constructions, metal ions function as cornerstones that are linked by long organic (carbon-based) molecules. Together, the metal ions and molecules are organised to form crystals that contain large cavities. These porous materials are called metal–organic frameworks (MOF). By varying the building blocks used in the MOFs, chemists can design them to capture and store specific substances. MOFs can also drive chemical reactions or conduct electricity.\n\n&gt;“Metal–organic frameworks have enormous potential, bringing previously unforeseen opportunities for custom-made materials with new functions,” says Heiner Linke, Chair of the Nobel Committee for Chemistry.\n\n&gt;It all started in 1989, when Richard Robson tested utilising the inherent properties of atoms in a new way. He combined positively charged copper ions with a four-armed molecule; this had a chemical group that was attracted to copper ions at the end of each arm.\n\n&gt;When they were combined, they bonded to form a well-ordered, spacious crystal. It was like a diamond filled with innumerable cavities.\n\n&gt;Robson immediately recognised the potential of his molecular construction, but it was unstable and collapsed easily. However, Susumu Kitagawa and Omar Yaghi provided this building method with a firm foundation; between 1992 and 2003 they made, separately, a series of revolutionary discoveries. Kitagawa showed that gases can flow in and out of the constructions and predicted that MOFs could be made flexible. Yaghi created a very stable MOF and showed that it can be modified using rational design, giving it new and desirable properties.\n\n&gt;Following the laureates’ groundbreaking discoveries, chemists have built tens of thousands of different MOFs. Some of these may contribute to solving some of humankind’s greatest challenges, with applications that include separating PFAS from water, breaking down traces of pharmaceuticals in the environment, capturing carbon dioxide or harvesting water from desert air.",
        "upvotes": 333,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/po4f2DI5HsQ0ovq843rCJc4BklL2J1jHNqA9QpeP1Ug.jpeg?auto=webp&amp;s=6adf5958359418903698e14687385344af0faafe"
        },
        "permalink": "/r/science/comments/1o1cp2z/the_nobel_prize_in_chemistry_2025_awarded_to/"
    },
    {
        "id": "1o5mqea",
        "author": "smurfyjenkins",
        "title": "The Democratic Party represents public opinion more closely than the Republican Party. The study assesses the relationship between public opinion and policy across the 50 states over the period 1997-2020, finding the relationship substantially weakens under Republican control of state government.",
        "content": "",
        "upvotes": 12572,
        "comments": 573,
        "media": null,
        "permalink": "/r/science/comments/1o5mqea/the_democratic_party_represents_public_opinion/"
    },
    {
        "id": "1o64w59",
        "author": "Hrmbee",
        "title": "Hairballs may reveal why cats eat grass: spiky projections on plant matter may act like “drain snakes,” helping felines dislodge wads of fur | Plant eating behavior in domestic cats: support for the hair evacuation hypothesis",
        "content": "",
        "upvotes": 537,
        "comments": 24,
        "media": null,
        "permalink": "/r/science/comments/1o64w59/hairballs_may_reveal_why_cats_eat_grass_spiky/"
    },
    {
        "id": "1o61j9j",
        "author": "lcounts",
        "title": "Women are systematically portrayed as younger than men online, and AI amplifies the bias, according to a sweeping new study by UC Berkeley Haas, Stanford, and Oxford researchers published in the journal Nature.",
        "content": "",
        "upvotes": 518,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rR1r_e5I4LgmSbsDDHYXcev1JTq1lMOtcCMNQXP0Fec.jpeg?auto=webp&amp;s=a2e66e977ee1a3d445f6d09e007b5a77f90b563a"
        },
        "permalink": "/r/science/comments/1o61j9j/women_are_systematically_portrayed_as_younger/"
    },
    {
        "id": "1o5psm0",
        "author": "chrisdh79",
        "title": "Psychology study finds spill-over effects of nature visits on daily happiness | This pattern held true for people with and without common mental health disorders, including depression and anxiety.",
        "content": "",
        "upvotes": 1719,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3gpbkUKEmAW8G1adLCHdUstgHWIUayZRbMz5oJWMscw.jpeg?auto=webp&amp;s=085b14d840e67a9374be77db88c092f11d4923ba"
        },
        "permalink": "/r/science/comments/1o5psm0/psychology_study_finds_spillover_effects_of/"
    },
    {
        "id": "1o5rtbz",
        "author": "Wagamaga",
        "title": "Using 11 years of magnetic field measurements  scientists have discovered that the weak region in Earth’s magnetic field over the South Atlantic – known as the South Atlantic Anomaly – has expanded by an area nearly half the size of continental Europe since 2014.",
        "content": "",
        "upvotes": 1246,
        "comments": 42,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4jpkmOAHJP_VB9gZbFOcNtMTQ9GwMgU-VqEAeW-jjRY.jpeg?auto=webp&amp;s=b3acc66226e6bba1d74af14684bcbeaf3431a9a1"
        },
        "permalink": "/r/science/comments/1o5rtbz/using_11_years_of_magnetic_field_measurements/"
    },
    {
        "id": "1o5gk0m",
        "author": "mvea",
        "title": "Scientists have uncovered just how naked mole-rat repair their DNA – and it has the potential to be harnessed for humans to do the same. Their enzyme has 4 key changes that facilitate the important work that extends their lifespan and keeps them healthy and disease-free for a remarkably long time.",
        "content": "",
        "upvotes": 4593,
        "comments": 123,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Oww8vl9qfrNZuJJFVjA4b9YZv_XMnhMjmKRKBAGkjVQ.jpeg?auto=webp&amp;s=5809955c3cc0ae2e302e947cd22dbc4799f35ce9"
        },
        "permalink": "/r/science/comments/1o5gk0m/scientists_have_uncovered_just_how_naked_molerat/"
    },
    {
        "id": "1o66dvk",
        "author": "calliope_kekule",
        "title": "A US Medicare study found the recombinant shingles vaccine cut infection risk by over 50% in older adults, including those with weak immunity. Two doses worked best.",
        "content": "",
        "upvotes": 142,
        "comments": 3,
        "media": null,
        "permalink": "/r/science/comments/1o66dvk/a_us_medicare_study_found_the_recombinant/"
    },
    {
        "id": "1o5j1vo",
        "author": "mvea",
        "title": "Men and women tend to approach sex with different emotional needs and relationship strategies in mind. When men feel supported by their partner and are actively engaged in relationship-based stress management, they may be more motivated to pursue sex as a way to express emotional closeness.",
        "content": "",
        "upvotes": 1504,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gPs-tzObRQHTZl6xld3BHaQ7Bl6mWlGLeEa96XdNZh8.jpeg?auto=webp&amp;s=c27510df4b28c03e211786f7880d5fe7514136e2"
        },
        "permalink": "/r/science/comments/1o5j1vo/men_and_women_tend_to_approach_sex_with_different/"
    },
    {
        "id": "1o5vmbw",
        "author": "-Mystica-",
        "title": "Lab-grown embryo-like models have produced human blood cells, offering hope for regenerative medicine. Creating blood stem cells in vitro could someday allow bone marrow transplant patients to be treated with their own cells.",
        "content": "",
        "upvotes": 337,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wmsN2VBuSq_sIIoSUPmS_mfRthrbBz_WGUtO-baV9vI.jpeg?auto=webp&amp;s=9974d2d2a686fca55d7077841541003ed8ce6401"
        },
        "permalink": "/r/science/comments/1o5vmbw/labgrown_embryolike_models_have_produced_human/"
    },
    {
        "id": "1o69yrn",
        "author": "Wagamaga",
        "title": "People who stop smoking in middle age can reduce their cognitive decline so dramatically that within 10 years their chances of developing dementia are the same as someone who has never smoked, research has found.",
        "content": "",
        "upvotes": 45,
        "comments": 6,
        "media": null,
        "permalink": "/r/science/comments/1o69yrn/people_who_stop_smoking_in_middle_age_can_reduce/"
    },
    {
        "id": "1o5mzvb",
        "author": "scientificamerican",
        "title": "Researchers analyzed about 150 trees to map the communities of microbes living in 16 species, in a recent study in Nature. They estimate that a single mature tree hosts about one trillion bacteria in its trunk “microbiome,” with distinct communities living in different layers.",
        "content": "",
        "upvotes": 479,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/D3uAasejHkQt_sElm34aHzndfPAVM_x6SPOXnAAzdxY.jpeg?auto=webp&amp;s=6087c484206d1aac1d3804ba82d1390a4f33cec7"
        },
        "permalink": "/r/science/comments/1o5mzvb/researchers_analyzed_about_150_trees_to_map_the/"
    },
    {
        "id": "1o664id",
        "author": "Super_Letterhead381",
        "title": "Convergent evolution of diverse jaw joints in mammaliamorphs",
        "content": "",
        "upvotes": 27,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lhPK72Gat0vQGw5SJXobC_32cgIRnMq4FGRGHSPF9cU.png?auto=webp&amp;s=b6ac58266961fb6b4b8012279cc5dac467fac844"
        },
        "permalink": "/r/science/comments/1o664id/convergent_evolution_of_diverse_jaw_joints_in/"
    },
    {
        "id": "1o524xb",
        "author": "sciencealert",
        "title": "Study of 15,000 blood samples shows a rise in antibiotic-resistant superbugs in newborn babies",
        "content": "",
        "upvotes": 7849,
        "comments": 202,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/iRFgacv5fAanWZnTNb_9dbtVcWmGRH0w3lhQAl2z4v4.jpeg?auto=webp&amp;s=ff164333ad535697c5a70a58f6ac7613f971d6f1"
        },
        "permalink": "/r/science/comments/1o524xb/study_of_15000_blood_samples_shows_a_rise_in/"
    },
    {
        "id": "1o54rtw",
        "author": "mvea",
        "title": "High youth death rates are an ‘emerging crisis’, global health study warns. Alcohol, suicide and injuries driving rises among teenagers and young adults despite overall rates falling. In North America this was “tied up with the rise of anxiety and depression in young people, particularly women”.",
        "content": "",
        "upvotes": 3644,
        "comments": 165,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dWHYFihlmm6HuqakDOH5YDx4K6wQTceHt3lPqrjgvUk.jpeg?auto=webp&amp;s=4095514e536550da319f55e1a9a18e0cd5c80420"
        },
        "permalink": "/r/science/comments/1o54rtw/high_youth_death_rates_are_an_emerging_crisis/"
    },
    {
        "id": "1o5m6g1",
        "author": "IEEESpectrum",
        "title": "Researchers have made artificial neurons that can, for the first time, process information from living cells without an intermediary device amplifying or modulating the signals",
        "content": "",
        "upvotes": 195,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sxkwYTxFspDuExxzJprUh4DUylRxVw3xeilB02q6rlo.jpeg?auto=webp&amp;s=0c4ed3e12f6a696d9a91eec807c2431198449b78"
        },
        "permalink": "/r/science/comments/1o5m6g1/researchers_have_made_artificial_neurons_that_can/"
    },
    {
        "id": "1o5g7b1",
        "author": "universityofturku",
        "title": "Levels of PFAS, or forever chemicals, in mothers’ blood during pregnancy are associated with many aspects of their children’s brain structure and function. It remains unclear, however, whether these associations are harmful, beneficial, or neutral for brain development.",
        "content": "",
        "upvotes": 419,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CW7xQcmMR9Gb3eWdXb9eV6cgdEGClGdbp7-tK-Ggj3Y.jpeg?auto=webp&amp;s=4f0c645f56a519080beaf1e4add2aa98fda94bd1"
        },
        "permalink": "/r/science/comments/1o5g7b1/levels_of_pfas_or_forever_chemicals_in_mothers/"
    },
    {
        "id": "1o65vcs",
        "author": "Super_Letterhead381",
        "title": "Fossil of Long and Narrow-Snouted Ichthyosaur Uncovered in England",
        "content": "",
        "upvotes": 15,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PX0D7PquzaYcLNi8GW5AWwN3L1xEPJWG3SpGgEP1XX4.jpeg?auto=webp&amp;s=0b55cc4fc5278ba57b62d1d9dd4e6f1f3b1cd0ea"
        },
        "permalink": "/r/science/comments/1o65vcs/fossil_of_long_and_narrowsnouted_ichthyosaur/"
    },
    {
        "id": "1o5amen",
        "author": "calliope_kekule",
        "title": "A major global study from The Lancet shows infectious diseases keep falling, but chronic conditions like diabetes, heart disease, and anxiety are rising worldwide.",
        "content": "",
        "upvotes": 1126,
        "comments": 30,
        "media": null,
        "permalink": "/r/science/comments/1o5amen/a_major_global_study_from_the_lancet_shows/"
    },
    {
        "id": "1o5p4cc",
        "author": "cnn",
        "title": "The April 2024 total solar eclipse caused some birds to believe that a new day had arrived, prompting them to burst into song, a new study found",
        "content": "",
        "upvotes": 122,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hDVXdkpW-5z8h7UIKguzqgPUvVzctWq4HQyo5W3kYTc.jpeg?auto=webp&amp;s=8fff7ba02e79fd99a12d6110eb1b22fe9c1490f4"
        },
        "permalink": "/r/science/comments/1o5p4cc/the_april_2024_total_solar_eclipse_caused_some/"
    },
    {
        "id": "1o6851s",
        "author": "BrnoRegion",
        "title": "The upcoming Czech space telescope, QUVIK, will act as a \"first responder\" to capture the initial UV flash from stars being shredded by black holes.",
        "content": "",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/science/comments/1o6851s/the_upcoming_czech_space_telescope_quvik_will_act/"
    },
    {
        "id": "1o5wnen",
        "author": "Dr_Neurol",
        "title": "A review identified new mnemonic practices enabled by social media - hashtag commemoration, memetic memory, and digital memory activism - which demonstrates how platform features both democratize and manipulate historical narratives.",
        "content": "",
        "upvotes": 38,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x2LkJZIv4hvZuvnC4-TTeESTwbnAE_97zHLVYJNwEAg.jpeg?auto=webp&amp;s=270d464967f4fe7ca4ce4257e3916cf3316da252"
        },
        "permalink": "/r/science/comments/1o5wnen/a_review_identified_new_mnemonic_practices/"
    },
    {
        "id": "1o5jxin",
        "author": "universityofga",
        "title": "Youth screen use can cause family conflict, exacerbate mental health problems",
        "content": "",
        "upvotes": 124,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JbqMie2T9Zpc5FxXSuke-_QUhO48MFAf1DXQcDtSX7g.jpeg?auto=webp&amp;s=f5b030dfd1961059a449e37c4173c39e3f5f8fea"
        },
        "permalink": "/r/science/comments/1o5jxin/youth_screen_use_can_cause_family_conflict/"
    },
    {
        "id": "1o57exu",
        "author": "-Mystica-",
        "title": "Carbon offsets fail to cut global heating due to ‘intractable’ systemic problems, study says. Analysis of 25 years of evidence shows most schemes are poor quality and fail to lower emissions.",
        "content": "",
        "upvotes": 975,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HNsDQT7a8HQDZg3mWVv_oqH0I1zUN33x7anAutZvk5Y.jpeg?auto=webp&amp;s=38d7d2b33b8566ec27386b02ae2919c5b787c014"
        },
        "permalink": "/r/science/comments/1o57exu/carbon_offsets_fail_to_cut_global_heating_due_to/"
    },
    {
        "id": "1o5ezcu",
        "author": "eliot3451",
        "title": "New gene therapy restores brain function in SYNGAP1 disorder",
        "content": "",
        "upvotes": 220,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KDTjFpyQfcpTVS2q8RCBiBNQvenUhY91KRm3_ZaRGNE.jpeg?auto=webp&amp;s=15ca43a1f69cf7f949ff52819157288496afb1d9"
        },
        "permalink": "/r/science/comments/1o5ezcu/new_gene_therapy_restores_brain_function_in/"
    },
    {
        "id": "1o4v8nw",
        "author": "nohup_me",
        "title": "Up to one third of women globally cohabit with heavy-drinking partners, increasing the likelihood of violence, neglect, and child health problems. The impact is magnified in regions with low/middle income and high gender inequality",
        "content": "",
        "upvotes": 2610,
        "comments": 176,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Zjb5OIeeFrh9CoCbuDmSoePeeQBPmYPuvOJkmOD3lqU.jpeg?auto=webp&amp;s=c322f33293804a8439adb1830c34d84320e3377a"
        },
        "permalink": "/r/science/comments/1o4v8nw/up_to_one_third_of_women_globally_cohabit_with/"
    },
    {
        "id": "1o4nn3i",
        "author": "mvea",
        "title": "Most people rarely use AI, and dark personality traits predict who uses it more. Study finds AI browsing makes up less than 1% of online activity. Students who used AI more often were slightly more likely to score high on personality traits associated with narcissism and psychopathy.",
        "content": "",
        "upvotes": 6537,
        "comments": 542,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8RASgeLduOGiuCURidM54sKypLJo8RC4rf4mWtme1RM.jpeg?auto=webp&amp;s=6807b4821951443c7813e99e3c92926279685dd0"
        },
        "permalink": "/r/science/comments/1o4nn3i/most_people_rarely_use_ai_and_dark_personality/"
    },
    {
        "id": "1o57ugh",
        "author": "-Mystica-",
        "title": "Air pollution increases the likelihood of people becoming frail in middle and old age, according to an international review of studies. The risk of frailty increased with outdoor particle pollution. For the UK, this could mean about 10-20% of frailty cases are attributable to air pollution.",
        "content": "",
        "upvotes": 333,
        "comments": 5,
        "media": null,
        "permalink": "/r/science/comments/1o57ugh/air_pollution_increases_the_likelihood_of_people/"
    },
    {
        "id": "1o59o7z",
        "author": "calliope_kekule",
        "title": "A new study found that mountain glaciers will soon warm in step with the air around them, losing their brief cooling buffer and melting faster after midcentury.",
        "content": "",
        "upvotes": 220,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4DhEUEFbgzW2N__VaEtoic0f5qAfZ-LeHe58cxUyOtI.png?auto=webp&amp;s=2c2c8f9a740701c1c7902b8f5d88e945074c1ad8"
        },
        "permalink": "/r/science/comments/1o59o7z/a_new_study_found_that_mountain_glaciers_will/"
    }
]