[
    {
        "id": "1o3wm0j",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Jane Levy - Monday 10/13 at 5:00 PM ET - Actress in 'Don't Breathe', 'Evil Dead', 'A Little Prayer', ' Zoey's Extraordinary Playlist', 'Suburgatory', 'I Don't Feel at Home in This World Anymore', 'Monster Trucks', 'Castle Rock', and lots more.",
        "content": "",
        "upvotes": 106,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/eymk97wmphuf1.png?auto=webp&amp;s=d9fbdf64f9d507305cea73d0d4ce5c8eaf3f3631"
        },
        "permalink": "/r/movies/comments/1o3wm0j/amaqa_announcement_jane_levy_monday_1013_at_500/"
    },
    {
        "id": "1o36ttf",
        "author": "SmashingMachineAMA",
        "title": "Hey reddit, I'm Benny Safdie. I've co-written/co-directed Uncut Gems, Good Time, and Heaven Knows What. My newest film, The Smashing Machine (starring Dwayne Johnson &amp; Emily Blunt), is out in theaters now. You might've seen me in The Curse, Oppenheimer, and Happy Gilmore 2. Ask me anything!",
        "content": "Hey reddit, I'm Benny Safdie, here to answer your questions. \n\nYou might know me as the co-writer/co-director of Uncut Gems, Good Time, Heaven Knows What, Lenny Cooke, and Daddy Longlegs. Or maybe from The Curse, Oppenheimer, Licorice Pizza, Happy Gilmore 2.\n\nMy new film stars Dwayne Johnson &amp; Emily Blunt and is out in theaters everywhere now.\n\n**The Smashing Machine:**\n\nMMA fighter Mark Kerr reaches the peak of his career but faces personal hardships along the way.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=aRpnP3LZ99g](https://www.youtube.com/watch?v=aRpnP3LZ99g)\n\nAsk me anything! Back at 5 PM ET today to answer your questions.",
        "upvotes": 2410,
        "comments": 980,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0ecr77irgbuf1.jpeg?auto=webp&amp;s=d63eba10421b15377a27d15bab4cc9204536d55a"
        },
        "permalink": "/r/movies/comments/1o36ttf/hey_reddit_im_benny_safdie_ive/"
    },
    {
        "id": "1o4vwte",
        "author": "Old_Specialist7892",
        "title": "David Fincher testing the RED camera on DiCaprio. Shot with only the light of a matchstick",
        "content": "",
        "upvotes": 17560,
        "comments": 632,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/au0cgzxmzpuf1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1o4vwte/david_fincher_testing_the_red_camera_on_dicaprio/"
    },
    {
        "id": "1o5a8v2",
        "author": "timinator4434",
        "title": "What is the best satire movie that most people don't realize is a satire?",
        "content": "The one that immediately comes to mind for me personally is Starship Troopers. It works really well as just a straight up action movie that it can be quite easy to just shut your brain off and enjoy the shoot 'em up (of which there is plenty). I speak from experience as my dad is like this.\n\nI would love to hear what other movies people list!\n\nEdit: spelling.",
        "upvotes": 730,
        "comments": 706,
        "media": null,
        "permalink": "/r/movies/comments/1o5a8v2/what_is_the_best_satire_movie_that_most_people/"
    },
    {
        "id": "1o59vh9",
        "author": "DemiFiendRSA",
        "title": "‘Demon Slayer: Kimetsu no Yaiba Infinity Castle’ surpasses ‘Crouching Tiger, Hidden Dragon’ to become the highest grossing non-English international film of all-time in the U.S.",
        "content": "",
        "upvotes": 425,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1o59vh9/demon_slayer_kimetsu_no_yaiba_infinity_castle/"
    },
    {
        "id": "1o59r40",
        "author": "CosmosisJones42",
        "title": "What’s the worst movie leak of all time?",
        "content": "There’s been some wild movie leaks that totally changed how people saw a film before it even dropped. i still remember in high school when that unfinished wolverine movie leaked online and everyone was watching it with half the cgi missing lol. the hateful eight script leak made tarantino so pissed he almost bailed on it. the sony hack was on another level too with private emails casting talks and full projects getting dumped online. and then no way home got spoiled months early cause people cant keep a secret to save their life\n\nyou could even go back to when revenge of the sith leaked before release or when the first 10 minutes of rise of skywalker got out and fans tore it to shreds. expendables 3 leaked before theaters and they blamed that for killing the box office. and the matrix resurrections trailer leaking early just made everyone clown on it before it even had a chance\n\nits crazy how a single leak can just kill the hype and mess up everything. what do you think was the worst one the leak that really changed a movie or wrecked the excitement completely?",
        "upvotes": 322,
        "comments": 373,
        "media": null,
        "permalink": "/r/movies/comments/1o59r40/whats_the_worst_movie_leak_of_all_time/"
    },
    {
        "id": "1o4v4zd",
        "author": "ChiefLeef22",
        "title": "Steven Spielberg's 'Bridge of Spies' Turns 10: How an unlikely collaboration between Spielberg and The Coen Brothers explores the humanity in both sides of the Cold War",
        "content": "",
        "upvotes": 1109,
        "comments": 62,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/oOYkTD1e0vNapwrRLMtrdwFL49gL3mXL8kRnQlbHtm4.jpeg?auto=webp&amp;s=93af1cb84b0f54fdf815fa8ffb9f54a6fe80c804"
        },
        "permalink": "/r/movies/comments/1o4v4zd/steven_spielbergs_bridge_of_spies_turns_10_how_an/"
    },
    {
        "id": "1o58uti",
        "author": "oasis48",
        "title": "Scariest character in a non horror movie.",
        "content": "I vote Brad Pitt as Jesse James in The Assassination of Jesse James by the Coward Robert Ford. He was absolutely terrifying in that movie. He should have won an Oscar for that role. I can’t think of another character that was so intimidating and menacing and the way Pitt pulled it off while being reserved and charismatic as well was amazing. ",
        "upvotes": 156,
        "comments": 220,
        "media": null,
        "permalink": "/r/movies/comments/1o58uti/scariest_character_in_a_non_horror_movie/"
    },
    {
        "id": "1o55raq",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Taimak - Wednesday 10/15 at 5:00 PM ET - Lead actor of the 1985 cult-classic martial arts musical 'The Last Dragon'.",
        "content": "",
        "upvotes": 123,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/r5lo41od0suf1.png?auto=webp&amp;s=cd67596a1c4e72c03a193f38da416568e1dc9a13"
        },
        "permalink": "/r/movies/comments/1o55raq/amaqa_announcement_taimak_wednesday_1015_at_500/"
    },
    {
        "id": "1o4s7ym",
        "author": "MarvelsGrantMan136",
        "title": "Jason Blum Says James Wan Will Be Hugely Involved in the ‘SAW’ Franchise’s Future",
        "content": "",
        "upvotes": 492,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lFCubDT2FIA5RSNYsayq2YPpFipdcDZPww4xE-ohxAc.jpeg?auto=webp&amp;s=3d7743e59a2bfbaac659652c14a11db6a5b26737"
        },
        "permalink": "/r/movies/comments/1o4s7ym/jason_blum_says_james_wan_will_be_hugely_involved/"
    },
    {
        "id": "1o52n6e",
        "author": "girafa",
        "title": "Short Cuts, 1993. Directed by Robert Altman. The infamous convo between Julianne Moore and Matthew Modine",
        "content": "",
        "upvotes": 140,
        "comments": 31,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wzhtyjtnaruf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1o52n6e/short_cuts_1993_directed_by_robert_altman_the/"
    },
    {
        "id": "1o52zeg",
        "author": "Unlikely_Seaweed1032",
        "title": "What are some older movies with social commentary of its time, but feels dated now",
        "content": "There are movies released today that try to showcase an important relevant issue of today, such as One Battle After Another, Get Out, The Hate U Give, She Said, Parasite, The Big Short, How to Blow Up A Pipeline, Fruitvale Station and recently A House Of Dynamite, etc\n\nBut what are some older movies that try to showcase an important issue of its time but is now looked at differently or no longer an issue today.",
        "upvotes": 93,
        "comments": 210,
        "media": null,
        "permalink": "/r/movies/comments/1o52zeg/what_are_some_older_movies_with_social_commentary/"
    },
    {
        "id": "1o43o4e",
        "author": "BunyipPouch",
        "title": "Actress Diane Keaton has died at the age of 79",
        "content": "",
        "upvotes": 33392,
        "comments": 1774,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OLsNWXKy6GAcVZ_kqBAN21-bwBpB_ou8kpLLF2wVGzs.jpeg?auto=webp&amp;s=fd0ff9710f9a8fbc85cf644376c0b617e93c0572"
        },
        "permalink": "/r/movies/comments/1o43o4e/actress_diane_keaton_has_died_at_the_age_of_79/"
    },
    {
        "id": "1o4f5b5",
        "author": "LollipopChainsawZz",
        "title": "Warner Bros. Is Said to Rebuff Paramount Takeover Approach",
        "content": "",
        "upvotes": 1831,
        "comments": 177,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cqnp31r2Cd3mFrOhZz08ppJmn-53p51ZpUFTFEWoFzE.jpeg?auto=webp&amp;s=17d78c7207393edb28adc6aa1c7e46e66b2fc540"
        },
        "permalink": "/r/movies/comments/1o4f5b5/warner_bros_is_said_to_rebuff_paramount_takeover/"
    },
    {
        "id": "1o4q0wk",
        "author": "bourj",
        "title": "The Manhattan Project is an exceedingly well-made 80s teen thriller.",
        "content": "I don't like to praise random films that I like, but as I'm rewatching The Manhattan Project, I'm struck every time by how *good* it is. Far beyond what is expected. \n\nChristopher Collett is incredible. His protagonist is smart, way beyond smart in some ways (and oblivious in othes), but also charming, athletic, has good relationships with adults in his life, and he's also a bit of a smarmy asshole. He's like Zack Morris, if he had the brain of Screech but the inability to think past the immediate like Zack often does. He's almost a prototype for the Mark Zuckerberg character in The Social Network.\n\nThe film doesn't rely on stereotypes. Cynthia Nixon's performance is so elegantly subtle. Her mature perception of the situation, her subtle delivery of dialogue,her ability to evoke emotion with a word or a gesture--it all works so well. And John Lithgow is such a smart and likable guy, it's hard to not feel bad for him as the situation gets worse and worse. And John Mahoney is the perfect no-nonsense military man who also is honest and direct about the role people play in the military-industrial complex.\n\nThe main character is a kid who constructed a nuclear bomb not to harm anyone, but just to see if he could. He's a mad scientist in the purest sense of the label. And the schemes he creates to get the materials, to escape once caught, and to deal with the aftermath are both extremely clever and highly realistic. \n\nOh, and the group of nerds are hilarious. And did I mention Robert Sean Leonard had a small role in it?\n\nMy last plug for watching this film: Roger Ebert gave it four (4) stars.\n",
        "upvotes": 269,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1o4q0wk/the_manhattan_project_is_an_exceedingly_wellmade/"
    },
    {
        "id": "1o4qdw0",
        "author": "DamnDogInapropes",
        "title": "Dead Man (1996) - Startling beauty combined with actions of devastating cruelty - Directed by Jim Jarmusch and starring Johnny Depp, Robert Mitchum, Crispin Glover, Gary Farmer, and on and on. Music by Neil Young.",
        "content": "",
        "upvotes": 219,
        "comments": 50,
        "media": null,
        "permalink": "/r/movies/comments/1o4qdw0/dead_man_1996_startling_beauty_combined_with/"
    },
    {
        "id": "1o5bl11",
        "author": "Dry-Use6643",
        "title": "Is there any other movie similair to Big Trouble in Little China",
        "content": "I’m actuallly begging that random ass campy action movie is peak fiction may not be the best movie but I need more films like it if anything like it exists I need to know about it then I’ll inject it into my veins whatever the fuck that genre is called in that action comedy extravaganza I need to know now ",
        "upvotes": 15,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1o5bl11/is_there_any_other_movie_similair_to_big_trouble/"
    },
    {
        "id": "1o5asw6",
        "author": "Vulture2k",
        "title": "The most alien creatures in movies?",
        "content": "So I want to talk a bit about creature design in movies, TV shows and even games. I get that it is and was often a budget and technical thing, but I am kinda sad that movies and TV shows are hardly ever very creative, when it comes to creature design.\n\nLike most are actually very humanoid, have two arms, two legs, eyes, ears etc. They often even move in very \"normal\" ways, some are different but still like creatures that we know, spiders, horses, dogs. You could do so much already if you just changed up how creatures move, have It very smooth or very abrupt.. \n\nI read once that that also has psychological reasons, that if a thing that looks relatable to us humans is easier to be afraid of, or even easier, if we are already afraid of spiders, we come already pre-afraid of spider like aliens, which sounds kinda cheap to me. But I'd say if you managed to make something so alien we don't understand it and then terrify/or fascinate (doesn't need to be horror) us with its actions, it would be even better. \n\nThere are very few exceptions like the creature from nope! comes to mind first that was at least so alien, that it made me come up with this topic in the first place, even though it also has similarities with some deep sea creatures and it's behaviors. Or the things from arrival that still basically are octopus-adjacent.. \n\n**So what are the most alien designs out there? Why aren't there more of them, at least now in the age of cgi? Does the human mind have trouble coming up with something truly original?**\n\nAlso for games it's weird, since you have to create the creature from the start anyway, so why not go wild? But I guess it's easier to animate and rig if it's animal like. Respect to mass effect for trying at least a little bit.",
        "upvotes": 16,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1o5asw6/the_most_alien_creatures_in_movies/"
    },
    {
        "id": "1o52k28",
        "author": "MrRicardo93",
        "title": "Interstellar",
        "content": "Hear me out…\n\nI have never been much of a film person but every now and then I get the urge to relax and watch one. So this evening I decided it’s time to watch Interstellar.\n\nI’ve been in love with the soundtrack for years and have even started learning it on the piano, so I thought it’s best to watch it.\n\nIt’s also worth mentioning that I’m not a sci-fi person either, however I can bridge that gap if something really catches my eye.\n\nWhat a masterpiece! Absolutely mind blowing all round!!!.\n\nI’m interested in hearing some suggestions for other films that are of an equal level of brilliance (not necessarily sci-fi), as I said I’m not much of a movie guy but suggestions to some real bangers would not go unheard.\n\nThanks in advance! Hope you all enjoyed it 1st time as much as I did ☺️💯",
        "upvotes": 39,
        "comments": 152,
        "media": null,
        "permalink": "/r/movies/comments/1o52k28/interstellar/"
    },
    {
        "id": "1o4wj85",
        "author": "BunyipPouch",
        "title": "Steven Spielberg Surprises London Film Festival Audience at ‘Hamnet’ Premiere and Praises Director Chloé Zhao",
        "content": "",
        "upvotes": 81,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/M00zBOfn9e_XiY2qlcC2rOsXXpi85o9MIFKOUy9FBaM.jpeg?auto=webp&amp;s=a9ce2e3f3905946e0951e837274cadd3216091ce"
        },
        "permalink": "/r/movies/comments/1o4wj85/steven_spielberg_surprises_london_film_festival/"
    },
    {
        "id": "1o59fk6",
        "author": "Svyeda",
        "title": "Tell me your comfort movies",
        "content": "I’m going through a lot right now and can really use some new comfort movies…my top comfort movies are How To Lose A Guy In 10 Days, Fargo, The Family Stone, Office Space, The Weekend Of, Heavyweights, Practical Magic….the list goes on and on. Your movies don’t have to align with mine though. Tell me whatever comforts you. ",
        "upvotes": 12,
        "comments": 67,
        "media": null,
        "permalink": "/r/movies/comments/1o59fk6/tell_me_your_comfort_movies/"
    },
    {
        "id": "1o5ae5j",
        "author": "dcterr",
        "title": "Peggy Sue Got Married",
        "content": "Who here has watched this movie? I've seen it about 10 times, but I never get tired of it! I think it's a great movie, but not at all your typical time travel movie! Instead, I'd say it's more about how she wished she could go back and change things in her life that she thought had gone wrong, but finally decided to settle with how they turned out. Pretty powerful movie! Great cinematography and acting as well.",
        "upvotes": 11,
        "comments": 14,
        "media": null,
        "permalink": "/r/movies/comments/1o5ae5j/peggy_sue_got_married/"
    },
    {
        "id": "1o4rcci",
        "author": "CometKICK01",
        "title": "I just realized I grew up watching the worst of The Neverending Story movies",
        "content": "I think i watched all 3 in reverse now that I think about it. As a toddler I watched the 3rd movie over and over. then, as I got older, I saw the second movie. Then as a teen I saw the 1st one.\n\nI went completely ass-backwards with these movies growing up. I have fond memories of the 3rd movies but something tells me I try to go watch it now and I probably won't be able to finish it.\n\nThen again, I watched several Neil Breen movies just for a good laugh.\n\nOh yeah, Jack Black is a bad guy in the 3rd movie",
        "upvotes": 133,
        "comments": 188,
        "media": null,
        "permalink": "/r/movies/comments/1o4rcci/i_just_realized_i_grew_up_watching_the_worst_of/"
    },
    {
        "id": "1o532ig",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Jane Levy - Monday 10/13 at 5:00 PM ET - Actress in 'Don't Breathe', 'Evil Dead', 'A Little Prayer', ' Zoey's Extraordinary Playlist', 'Suburgatory', 'I Don't Feel at Home in This World Anymore', 'Monster Trucks', 'Castle Rock', and lots more.",
        "content": "",
        "upvotes": 24,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qft490m5eruf1.png?auto=webp&amp;s=abd322650f69ca665c441655cebf9e7a00f2d1c3"
        },
        "permalink": "/r/movies/comments/1o532ig/amaqa_announcement_jane_levy_monday_1013_at_500/"
    },
    {
        "id": "1o5dhgv",
        "author": "darth_vader39",
        "title": "Stanley Tucci to Lead Cast of International Heist Movie ‘Masterplan’ From ‘Reacher’ Director Thomas Vincent for Prime Video in Italy and France",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6CMzsCkgGiSvFZPmz1r-fWPOw2gdw0KyjgSu9pZvQs0.jpeg?auto=webp&amp;s=235955d05cce580bffd509435a64c19fab300000"
        },
        "permalink": "/r/movies/comments/1o5dhgv/stanley_tucci_to_lead_cast_of_international_heist/"
    },
    {
        "id": "1o4r8en",
        "author": "BunyipPouch",
        "title": "Poster for the 4K Restoration &amp; Theatrical Re-Release of Leos Carax's 'The Lovers on the Bridge' - Starring Juliette Binoche and Denis Lavant",
        "content": "",
        "upvotes": 83,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/csq1m1f63puf1.jpeg?auto=webp&amp;s=363c092615eab4b27907f5cd9deeb92188d573af"
        },
        "permalink": "/r/movies/comments/1o4r8en/poster_for_the_4k_restoration_theatrical/"
    },
    {
        "id": "1o4vrvj",
        "author": "SanderSo47",
        "title": "Dr. Strangelove (1964, dir. Stanley Kubrick) – Final Scene.",
        "content": "",
        "upvotes": 47,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5zkwgg0cypuf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1o4vrvj/dr_strangelove_1964_dir_stanley_kubrick_final/"
    },
    {
        "id": "1o4fke6",
        "author": "Business_Coffee_9421",
        "title": "2025's film that's been most overlooked?",
        "content": "I'm talking more specifically about which movie that had some bigger names and was actually good but had very little buzz and wasn't very popular at all?\n\nFor my personal pick I have to go with The Assessment. Alicia Vikander and Elizabeth Olsen star and the movie barely made a peep and lasted in theaters for about a week.",
        "upvotes": 438,
        "comments": 375,
        "media": null,
        "permalink": "/r/movies/comments/1o4fke6/2025s_film_thats_been_most_overlooked/"
    },
    {
        "id": "1o4rhto",
        "author": "Izarator",
        "title": "Movies that could be called a new movie after a re-release/Director's Cut.",
        "content": "I was wondering what movies could be called a new movie after their initial release because of a Director's Cut or something like that. I don't want movies where they added some extended scenes or polishing or minor added scenes but are really heavy altered. Something like Zack Snyders Justice League or Once Upon a Deadpool.",
        "upvotes": 54,
        "comments": 75,
        "media": null,
        "permalink": "/r/movies/comments/1o4rhto/movies_that_could_be_called_a_new_movie_after_a/"
    },
    {
        "id": "1o4wmmv",
        "author": "JeanQuiRit",
        "title": "What are some of your favorite underrepresented eras in history ?",
        "content": "I know it might be more on the popular side but still I really wish that the second french empire to third french republic period was more depicted on film (1850s to 1940). I guess the latter is more found in adaptations of Jules Verne’s stories and Tintin and some steampunk but not much beyond that.  The french colonial empire as a whole isn’t as popular in movie world as its British rival i guess so that might be a reason.\n\nSo anyway whats yours? And please include some of your favorite movies or tv shows set in those eras",
        "upvotes": 29,
        "comments": 61,
        "media": null,
        "permalink": "/r/movies/comments/1o4wmmv/what_are_some_of_your_favorite_underrepresented/"
    }
]