[
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 22,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lzz8vz",
        "author": "Pinchus121",
        "title": "I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix and host of the Naked Lunch podcast. I travel the world eating incredible food and talking to even more incredible people. Let’s dish! AMA.",
        "content": "Hi Reddit! I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix, and host of the Naked Lunch podcast with my good friend David Wild. I’ve spent the last several years traveling the globe with a fork in hand, trying to prove that the best way to connect with people is through good food and a lot of laughs. Season 8 of Somebody Feed Phil is now streaming on Netflix and we’re serving up new episodes of Naked Lunch every week wherever you get your podcasts, including chats with legends like Jane Fonda, John Stamos, Allison Janney, and so many more!  \n  \nGot questions about the best food cities, behind-the-scenes stories from the road (or the sitcom world), or where I stand on pineapple on pizza? I’m all yours!  \n  \nLet’s eat and chat.  \n  \nPhil  \nu/Pinchus121\n\nhttps://preview.redd.it/4k4qn42nrwcf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=19b27cd4f54858b592249a41b78424ec7203a1e5\n\n\n\n&gt;Thanks everyone for joining in! Be sure to check out Season 8 of Somebody Feed Phil now on Netflix and listen to new episodes of my podcast \"Naked Lunch\" every week!",
        "upvotes": 82,
        "comments": 115,
        "media": null,
        "permalink": "/r/netflix/comments/1lzz8vz/im_phil_rosenthal_host_of_somebody_feed_phil_on/"
    },
    {
        "id": "1m1bshr",
        "author": "Longjumping_Land_977",
        "title": "Netflix releases series about baffling case of woman who disappeared on a cruise ship",
        "content": "",
        "upvotes": 982,
        "comments": 321,
        "media": null,
        "permalink": "/r/netflix/comments/1m1bshr/netflix_releases_series_about_baffling_case_of/"
    },
    {
        "id": "1m1wjfo",
        "author": "Dreamdays_0909",
        "title": "Building the Band - strange",
        "content": "I’m almost positive that the conversations the contestants are having with AJ when he tells them the amount of likes they have are completely fake lol. His responses are unnatural and scripted, and none of the cast ever say “hi AJ!”. The conversations don’t flow and the editing is peculiar lol. I think AJ is staring straight into a teleprompter and the screen they appear on is CGI. 🤦🏼‍♀️🤦🏼‍♀️",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m1wjfo/building_the_band_strange/"
    },
    {
        "id": "1m16z88",
        "author": "PlatinumOg69",
        "title": "Netflix feels so empty now",
        "content": "I dont know what happened but I haven't had Netflix in like 3 months and first thing I notice is it feels like their isint as much to watch anymore. I go through the horror movie category and it seems really short. Did they get rid of everything? basically all that's left is just Netflix originals which I do enjoy but I've watched probably all of their horror movies and their recent originals aren't that great. ",
        "upvotes": 265,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1m16z88/netflix_feels_so_empty_now/"
    },
    {
        "id": "1m1d8fe",
        "author": "dailystar_news",
        "title": "Netflix stand by decision to axe The Residence a show they 'loved and championed'",
        "content": "",
        "upvotes": 64,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1m1d8fe/netflix_stand_by_decision_to_axe_the_residence_a/"
    },
    {
        "id": "1m1dezx",
        "author": "Task_Force-191",
        "title": "Stranger Things 5 | Official Teaser | Netflix",
        "content": "",
        "upvotes": 61,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m1dezx/stranger_things_5_official_teaser_netflix/"
    },
    {
        "id": "1m1yfwq",
        "author": "Usual-Dragonfly-2857",
        "title": "Kpop demon hunters was inconsistent with their demon analogy",
        "content": "IMO the movie was charming, very catchy songs. It was a great original story and i like it so much better than the slop pixar/disney have been pumping out. But I noticed the whole demon analogy fell short. The messaging related to the demons and what they meant was confusing. \n\nRumi's identity as a half demon who is \"better\" than the full demons because she kills demons felt morally confusing. Its implied that atleast some of the demons, like the lead of the boy band, are misguided people who sold their souls to the demon king or had their souls taken non-consensually. There was a lot of footage of the demons tricking people into basically becoming depressed and insecure enough to be \"content/hypnotized\" into transforming into demons. And some demons, like the tiger and bird were just neutral without any ill intent. Which made it hard to hate the demons as an antagonistic force. Yet, the demon slayer girl group wanted to kill the demons to save the people (when some of the missing ppl are implied to be demons.) \n\nthe swap from TAKE DOWN (hateful song) to GOLDEN (positive song) felt confusing, because regardless of the swap, the girls still killed *all* the demons. The other two members also wanted to kill Rumi at one point but decided against it because they knew her, their strong distrust and hate for all demons besides her was never questioned even after they almost became demons. \n\nThen there was the bit about Rumi (the half demon girl) wanting to save Jinu (the demon boy band lead). Because she finds him attractive shes able to humanize his \"demonality.\" Jinu is only redeemable  because he kills himself to save the Rumi (implying hes valueless as a demon and beyond redemption alive.)\n\nOverall the esthetics and vibe was great but I was sucked out of the movie when I spent 5 seconds too long thinking, \"whats the message and point regarding the demons?\" In the end it feels as though the message is, \"Your inner demons are insecurities and depression, and idk bro kys if you cant get that in control 😭 tf is redemption—\"",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m1yfwq/kpop_demon_hunters_was_inconsistent_with_their/"
    },
    {
        "id": "1m1msqe",
        "author": "which_objective",
        "title": "Should Trainwreck be a series with different episodes?",
        "content": "It's all over my home page but seems like it could (or should) just be a series, rather than individual 1-hour movies. Why do you think they made it this way?",
        "upvotes": 15,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m1msqe/should_trainwreck_be_a_series_with_different/"
    },
    {
        "id": "1m1uxww",
        "author": "stevenjobsless",
        "title": "if anybody is watching building the band on netflix. WHO does allison sound like? Her speaking voice sounds EXACTLY like someone",
        "content": "i cant tell if its an actress or internet celebrity im leaning towards actress &amp; its bothering me so bad she has the same deadpan voice and tone of somebody and I cant put my finger on it. i cant continue i need to know. helpppppp",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m1uxww/if_anybody_is_watching_building_the_band_on/"
    },
    {
        "id": "1m1bh6p",
        "author": "AccurateAd7960",
        "title": "Building the band - E1-E7 - THOUGHTS",
        "content": "So what are we thinking so far? \nMy thoughts below because I wish I knew someone who watched this 😂\n\nI personally am loving this show, so much talent and appreciated that they did all the showcases in one episode, I really thought they’d annoyingly split it. The pace has been good, and I know they need the cheeky cliffhanger. \n\nSZN 4 - \nI absolutely believe that SZN 4 are the clear winners unless they royally screw up. \nI really wish they’d chosen another name though! They all have such star quality, particularly Donzell and Aaliyah - incredibly powerful voices. Cameron’s is so unique and I feel when Katie gains her confidence she shines.  - plus they seem like nice people. \nThey all scream “I would have such a good time chilling at a party with them all” \nAbsolute fan here of what they are bringing to the table; the energy, the difference in voices, the oomph they give. \n\nSweet Seductions - \nI’m on the anti-Allison train and I know she’s being made the villain, but she just seems like such an awfully narcissistic person that I don’t think they could have edited it that much. it goes to show that chemistry on stage and actually having true friendship in the band really shows in the performance, “Sweet seductions” were not conducive - and I don’t see longevity in the band just based on their toxic relationship growing due to Allison being a drill instructor and treating them like props.i wish the other 2 had ended up with the other girls that Allison ditched. Allison will be the demise of them all. \n\nI think Soulidified and 3quency will also go far. \n3quency really surprised me tonight! But wow, they really did work so well together and seemed like such a unit. It was real sweet having the other girls try on the makeup too. \nAgain, seeing people be friendly to each other and supportive of each other is just going to make me like the band more haha but yeah they aced it. \n\nSoulidified is not my cup of tea BUT I can see how they would appeal to others, working hard as well together, seems like they have the business side of it all down pat and there voices do really work with each other. But some are definitely better than others, it doesn’t seem to matter as much though because they are blending so well. They really were great tonight and had fabulous energy with each other. Song choice suited them for sure. Even if they don’t win I think they’ll get signed elsewhere. \n\nMidnight till morning - I’m not going to lie I got my hopes up that they might try something a bit different with country dusky voices but they seem to just be wanting to fit the cookie cutter. I know it’s for the drama, but Connor is annoying me and the immaturity/insecurity shines whenever he makes a snarky comment about another band. Being Australian I was having hopes for them, but maybe the “laid back” Aussie way is preventing them from pushing themselves further 😘 I’d be so frustrated too if you’d made it that far and your 20 something yr old band mate just wanted to get laid. \nAlso very sad moment when Mason spoke to the late Liam Payne about seeing him way back, and about it being full circle. RIP Liam. \n\nAnd finally ! Gosh this is long - \nSiren society - I think they might leave, which is unfortunate as I actually think they did well tonight and really tried to push themselves with so much choreography. They seem really sweet to each other and supportive. I would have preferred them over sweet seduction any day. \nChoosing a song of one of the judges I don’t think did them well either, way too risky at that stage - and as Nicole said - she has her own way of interpreting her own song, to then emulate that - well it doesn’t work. \n\nAnyway everyone, I am SO KEEN to hear your thoughts on everyone! Who are your favorites? Who do you think is being carried? Who’s going out? \n\n",
        "upvotes": 55,
        "comments": 137,
        "media": null,
        "permalink": "/r/netflix/comments/1m1bh6p/building_the_band_e1e7_thoughts/"
    },
    {
        "id": "1m103ae",
        "author": "Infamous-Associate99",
        "title": "Most recent show you couldn’t stop watching",
        "content": "I need something good to watch and I feel like I’ve seen it all. I like psychological thrillers and thrillers in general. If anyone has ever seen wayward pines, I would like to watch something like that",
        "upvotes": 260,
        "comments": 455,
        "media": null,
        "permalink": "/r/netflix/comments/1m103ae/most_recent_show_you_couldnt_stop_watching/"
    },
    {
        "id": "1m1xptg",
        "author": "Deirdge",
        "title": "Is Sirens a one-off or positioned for a S2?",
        "content": "Obviously we all need a contemporary Downton Abbey in the Hamptons-type junk-watch, but there was no real ending here. And the ending made little sense unless there’s a season deux. More smokin’ Swayze ahead? ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m1xptg/is_sirens_a_oneoff_or_positioned_for_a_s2/"
    },
    {
        "id": "1m1un0c",
        "author": "Aggressive_Roll5874",
        "title": "To those of you in Italy can you tell me if there’s a show on Netflix I’m looking for?",
        "content": "Ciao I’m hoping someone can please tell me if there’s a new show called RIV4LI on Netflix in Italy. I’ve been trying to see if it has been released in Italy or if it’s still filming but I am getting differing responses when I look it up. \n\nThe reason I want to watch it is because I watched DI4RI and it was great for Italian listening practice but the show was also really good 😊 \n\nGrazie ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m1un0c/to_those_of_you_in_italy_can_you_tell_me_if/"
    },
    {
        "id": "1m1only",
        "author": "maddenmaster838",
        "title": "Trainwreck documentary series",
        "content": "Why did we go from having a single trainwreck mini series 3 years ago to now it becoming a weekly release? I’m definitely not complaining I’ve been loving the trainwreck an each weeks. But why is that? Does anyone know? Does everyone else also enjoy the train wrecks as much as I have?",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m1only/trainwreck_documentary_series/"
    },
    {
        "id": "1m151io",
        "author": "AKMac86",
        "title": "Trainwreck: Balloon Boy",
        "content": "Just finished the documentary. I remember when that whole saga was on the news. I think the guy was a nut and just wanted a way to make easy money. His wife was willing to go along with whatever he did. I have a lot of questions that were left unanswered by this documentary. Was he actually planning to go in the flying muffin UFO thing? If not, then why build it so large? If so, then how would he have controlled it? To me this seemed like he wanted to build something big enough that it would seem credible for a small person to fit inside when he called the police.  \n\nAnother thought… when the kid said ‘I thought we were doing this for a show,’ I think it spilled the beans that he was always planning to ‘accidentally’ let the balloon go so he could call the FAA. (Who would ever think to call the FAA?! That clearly seemed planned). So I’m wondering if  it’s possible his kid going missing was not the original plan but just became part of it. Either way, I think jail time was suitable. Thoughts?",
        "upvotes": 66,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1m151io/trainwreck_balloon_boy/"
    },
    {
        "id": "1m19wc6",
        "author": "Commercial-Kitchen78",
        "title": "Cozy shows",
        "content": " I’m waiting for cancer biopsy results and need a show I can distract myself with. Bonus if it will also be enjoyed by my kids 18g and 13b. It needs to be sexual assault free. I grew up without TV and wasn't allowed to watch over Pg 13. So my tastes are pretty cozy and mundane— we did watch milloaire house and loved it! \n\n\n\n",
        "upvotes": 20,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1m19wc6/cozy_shows/"
    },
    {
        "id": "1m1skbc",
        "author": "sirotan88",
        "title": "Chef &amp; My Fridge is such a wholesome cooking show",
        "content": "Don’t see much mentions of this show but if you have seen Culinary Class Wars you’d probably enjoy it!\n\nIt’s a casual, low competition, sometimes silly and hilarious cooking show. It’s all 15 minute cooking battles between 2 chefs; no grand prize or final winner, mostly just friendly low stakes competition.\n\nI’m obsessed with the show and selfishly want more people to watch it so they can renew it and keep it going! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m1skbc/chef_my_fridge_is_such_a_wholesome_cooking_show/"
    },
    {
        "id": "1m1tcps",
        "author": "istodaywednesday",
        "title": "BRICK (2025) You almost had me until...",
        "content": "All would have been well with me....even the resurrection of christ 3 times (aka Yuri) but when they go outside and get inside the car... I thought they would do it just for like a change of scenery or reminiscing.. But how you start the car bro... You just been climbing up and down floors and breaking codes and just happened to have the keys in your hand even though you technically just got out of bed. I was with them the whole way until that point.  I even Googled if it's normal for people in Germany to leave their keys in the car and the answer is no.\n\n4/10 bc they drove out into sunset\n\n6/10 if they realized they didnt have keys and just did the nasty in the back of the car and ended up having an alien rainbow baby from the contaminated air",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m1tcps/brick_2025_you_almost_had_me_until/"
    },
    {
        "id": "1m1bo5i",
        "author": "prashbash",
        "title": "Building the Band : E4-6",
        "content": "I know all reality TV is scripted kinda but in this show it just seems sooo blaringly obvious that they just want to manufacture some drama for the sake of it!!\nHow is it possible to have a freakin romance thing in the 24hrs that they have been together? \nAnd then go out during the 3 days they have to prepare for a competition?😂😂😂\nIt's so cringey omg whatta cringefest going on! If they want filler episodes just make them sing more songs ughh. \nAnd for some random reason, everyone gives Alison so much importance - which I think it's part of the script again!! Even Nicole compliments her specifically - when Elise is out there killing it. \nAlso didn't the pseudo Harry guy get only 5 likes and barely passed the first audition. How did he end up getting into the bands round when there were so many other eligible people!!\nIt's not even adding to the anticipation by any means - I just end up fast-forwarding the drama shit.\nI was hoping this would go like The Voice but for bands but it just gets more n more bleh.\n#whatdoyathink",
        "upvotes": 9,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m1bo5i/building_the_band_e46/"
    },
    {
        "id": "1m1lftw",
        "author": "Less_Manufacturer218",
        "title": "Netflix the Four Seasons",
        "content": "Lowkey a really good show. The chemistry and comedy is great. When Claude thinks he hooked up with Terry I almost died LOL. Great show, hope there is another season. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m1lftw/netflix_the_four_seasons/"
    },
    {
        "id": "1m1pl6c",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game 3 continues Netflix reign for 3rd week",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m1pl6c/squid_game_3_continues_netflix_reign_for_3rd_week/"
    },
    {
        "id": "1m1p1zg",
        "author": "Fearsome_Fred",
        "title": "Biggest disparity between a highly rated series (RT or IMDB) versus your opinion?",
        "content": "The Dark has some of the highest ratings on RT but I’d give it a 5 at best. Granted many time travel shows can be hard to keep straight but this one is at the top of the list. That plus many shots of people just staring and thinking is laborious. Hard to believe this gets a 9.5 while Stranger Things gets a 9.2. They are miles apart.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m1p1zg/biggest_disparity_between_a_highly_rated_series/"
    },
    {
        "id": "1m1ckqg",
        "author": "Standard_Mushroom273",
        "title": "Does anyone else every wonder about the Jailbirds?",
        "content": "I went looking for updates on the people who were featured in Netflix Jailbirds (the OG), like Megan \"Monster\" Hawkins. I could only find info from six years ago. I hope our girls are okay and doing better.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m1ckqg/does_anyone_else_every_wonder_about_the_jailbirds/"
    },
    {
        "id": "1m10ur1",
        "author": "tkjedi",
        "title": "Best Detective Shows",
        "content": "What are your favorite detective shows on Netflix ? I just got done watching Dept. Q and loved it.  I do enjoy British crime dramas as well as other ones. What do you recommend?",
        "upvotes": 29,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1m10ur1/best_detective_shows/"
    },
    {
        "id": "1m19ncf",
        "author": "strvwbery",
        "title": "Any recommendations for spy/secret agent shows with romance?",
        "content": "I don't come across a lot of spy shows and I have been wanting to watch and read some media regarding this genre + I am a sucker for romance. Please drop your recommendations! ",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1m19ncf/any_recommendations_for_spysecret_agent_shows/"
    },
    {
        "id": "1m1k83m",
        "author": "armored_pillow",
        "title": "Archive of Streaming Library Pre-2012",
        "content": "Does anyone know where to find an archive of Netflix’s streaming library prior to launching their original programming? Im looking for I remember there being so many interesting movies and shows in the early days. I’m thinking 2008-2010.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m1k83m/archive_of_streaming_library_pre2012/"
    },
    {
        "id": "1m1vx6u",
        "author": "Informal_Jaguar3861",
        "title": "Stranger Things released in three parts?",
        "content": "Isn't it funny that Netflix basically invented the concept of releasing all episodes of a season at once, and they are the ones now introducing dividing the seasons into parts? At first, it was just two. Now, with *Stranger Things*, it's three. If they keep this trend, they will loop all the way back to releasing all the episodes separately.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m1vx6u/stranger_things_released_in_three_parts/"
    },
    {
        "id": "1m1jc66",
        "author": "xy-lcl",
        "title": "Adolescence Knife",
        "content": "Round the end of ep 2 the officer’s son said he has his case for him. Was the son not carrying something that seemed wrapped up? He couldnt show the father what it was but could it have been the knife?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m1jc66/adolescence_knife/"
    },
    {
        "id": "1m1bt30",
        "author": "aim-mami",
        "title": "HELP",
        "content": "Netflix keeps asking me to add another member when I’m literally not even sharing it 😩 Why does Netflix always assume I want to add someone? I’m not even using extra devices 😭 It’s always asking me to add a member, like chill Netflix, it’s just me 😤",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m1bt30/help/"
    },
    {
        "id": "1m1suo9",
        "author": "Ok_Bedroom1639",
        "title": "I started watching Weak Hero yesterday. Why did Netflix start me on season 2?",
        "content": "I was confused when I started watching it. It took me 6 episodes to realize that Netflix started me on season 2 instead of season 1. Does anyone know why this is?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m1suo9/i_started_watching_weak_hero_yesterday_why_did/"
    },
    {
        "id": "1m1ucb0",
        "author": "supaypawawa",
        "title": "I wish The Sandman had been animated",
        "content": "Even though I'm enjoying the live-action version I can't help but notice that a lot of it is very silly with actual people. The actors are great but my suspension of disbelief has been tested, a lot. Especially in these last episodes that deal with the realms of the Endless and their troubles. Having it be animated would not only have solved it but allowed the show to be even sillier and closer to the graphic novels without having to cut and adapt so much. I am aware of the allegations against the author and so pissed off at him, this of course also unfortunately leads to The Sandman never being adapted again.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m1ucb0/i_wish_the_sandman_had_been_animated/"
    }
]