[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 6,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 52,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l47nn4",
        "author": "Sea-Guest-1299",
        "title": "Jibaro — The Most Perfect Episode in Love, Death &amp; Robots (IMO)",
        "content": "I haven’t gotten around to watching Season 4 yet, but having seen everything up to Season 3, I genuinely believe Jibaro is the most perfect episode in the entire Love, Death &amp; Robots anthology.\n\nYes, I know that’s a bold claim considering the heavy competition — Bad Travelling, Beyond the Aquila Rift, Zima Blue, and The Witness are all incredible in their own right. Everyone has their personal favorites depending on what they value most: hard sci-fi, suspense, animation style, or raw emotion.\n\nBut Jibaro hits different. For me, it’s one of the best modern folklore interpretations ever put on screen. It tells a deeply compelling, emotionally charged story — without a single word of dialogue — and still manages to feel more complete and immersive than most dialogue-heavy shorts. The animation is chaotic in the best way, the sound design is absolutely haunting, and the symbolism runs deep.\n\nIt’s beautiful, brutal, tragic, and strangely mesmerizing — a true S+ tier episode in my book. A masterclass in visual storytelling.\n\nCurious to know — where does Jibaro rank in your list?",
        "upvotes": 86,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1l47nn4/jibaro_the_most_perfect_episode_in_love_death/"
    },
    {
        "id": "1l4i6xe",
        "author": "Merry_Little_Liberal",
        "title": "Tires Season 2 is FANTASTIC",
        "content": "I watched season 1, and enjoyed it, it was a 6/10 for me. \n\nI just binged the entire season 2, and I really enjoyed it. HUGE step up from season 1. \n\nThe character developments from Season 1 is fantasic. Kyla, Cal, Shane, Will, Dave,  new characters that will be main characters... really good development. \n\nBringing back side characters that were in Season 1 to reprise the role in season 2 was FANTASTIC. No Spoilers!!!  At least 3 primary side characters are back for season 2 with new side stories, like getting a \"Pontiac Bandit\" episode, I hope they continue it. \n\nReally good story development, already excited for Season 3. \n\n\nEpisodes had the same vibe as The Office jump from Season 1 to Season 2. \n\nIt is still very much \"guy humor\"... pussy jokes, and ragging on each other, sure.  But if you even remotely enjoyed Season 1, do not miss Season 2! \n\nI'm going 8.5/10! ",
        "upvotes": 14,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l4i6xe/tires_season_2_is_fantastic/"
    },
    {
        "id": "1l4lphg",
        "author": "stphrtgl43",
        "title": "Congrats to Owen Cooper (Adolescence) on his first of hopefully many awards!",
        "content": "Owen won the Gotham Award for Outstanding Supporting Performance in a Limited Series for his role as Jamie Miller in Adolescence. I’m so happy for him cause he did such an amazing job and deserves to win many more where that came from. Still can’t believe that was his first real acting job. I’ve never seen a performance like that from such a young actor especially his performance in episode 3. An hour long one on one conversation shot in one take with no cuts and the range of emotions he has to portray from one moment to the next is a big ask for the most seasoned of actors. I genuinely felt terrible for him at the end even though he was a murderer. That’s not easy to pull off. Stephen Graham called him a generational talent and I totally agree with him. Can’t wait to see where his career goes from here.",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l4lphg/congrats_to_owen_cooper_adolescence_on_his_first/"
    },
    {
        "id": "1l3ujxm",
        "author": "Curious_Natural_1111",
        "title": "Dept Q should be renewed for season 2",
        "content": "They need to wrap up who was the Leith park shooter!!!\nJust finished watching it I need to see Morck working on more cases \n\nStarted off slow but was engrossing in afterwards episodes with barely any fillers.\nThe chemistry between actors were great, loved Akram and Martin.\n",
        "upvotes": 167,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1l3ujxm/dept_q_should_be_renewed_for_season_2/"
    },
    {
        "id": "1l4hwe8",
        "author": "Ollies_Mama22",
        "title": "Ginny &amp; Georgia",
        "content": "Anyone else think Georgia is a fucking narcissist? Like I know she has good intentions. And I know her childhood trauma and all the terrible shit she went through throughout her life affects the way she goes about certain things. But omfg she is such a narcissist. She throws out such blatant narcissistic comments. It’s everyone’s fault but her own. If she’s confronted for her poor behavior, she starts crying “oh I’m a bad mom” blah blah blah. She does it to make her kids feel bad for her so they stop bringing shit up. It’s ridiculous.",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l4hwe8/ginny_georgia/"
    },
    {
        "id": "1l43rp4",
        "author": "AndreiRED0",
        "title": "I’m looking for some good Netflix recommendations",
        "content": "I’m looking for some good Netflix recommendations and thought I’d ask around before diving into another random binge. I usually love shows like Breaking Bad, Better Call Saul, and You.But I’m also in the mood to try something completely different like a hidden gem I wouldn’t normally go for. Maybe something lighter, more artistic, or just totally off my usual radar.So if you’ve seen anything lately that really stuck with you whether it’s similar to those gritty dramas or something fresh and unexpected i’d love to hear it! ",
        "upvotes": 17,
        "comments": 117,
        "media": null,
        "permalink": "/r/netflix/comments/1l43rp4/im_looking_for_some_good_netflix_recommendations/"
    },
    {
        "id": "1l4gl99",
        "author": "unorthodox_Nerd",
        "title": "Dolby Atmos issue",
        "content": "Is anyone else having issues playing back Dolby Atmos content lately? Content that has the badge for Dolby Atmos has been playing in 5.1 or Dolby digital on both my fire tv cube 3rd gen and Apple TV 4K. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l4gl99/dolby_atmos_issue/"
    },
    {
        "id": "1l4ml6v",
        "author": "uwuadi",
        "title": "Question regarding 4K",
        "content": "I saw someone say that 4K on Netflix isn’t actually 4K and it’s not worth paying for 4K. But the quality definitely looks better when a title is in 4K compared to when it’s not. I understand that it might not be true 4K but it’s still better than lower quality options no? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l4ml6v/question_regarding_4k/"
    },
    {
        "id": "1l3nfpt",
        "author": "SketchyFella_",
        "title": "I HATE the new layout...",
        "content": "I have been saying for YEARS that Netflix has the best layout of any streaming service and have been annoyed that other streaming services have an inferior layout. Now, Netflix seems to be copying other services rather than the other way around. Why? Does anyone here actually like seeing fewer options on the screen? When you go to your list, rather than seeing multiple rows of all the things you like to watch, not you have to scroll endlessly to make it through what used to be a single screen's worth of content info. I hate this.\n\nSeriously though, does anyone know why? Are there metrics that make this make sense?",
        "upvotes": 209,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1l3nfpt/i_hate_the_new_layout/"
    },
    {
        "id": "1l3z95u",
        "author": "bubbley_bear",
        "title": "Netflix says I’m nit a part of my own household?",
        "content": "This is why I hate the new same household rule. I’m in my home, on the same phone I made my account on and use all the time to watch Netflix on. I go to open it today and it says I’m not in my household and need to get a temporary access code to use my own account?? I haven’t shared the info with anybody and I’m not signed in on any other devices. It’s letting me use it now but is there anything I can do to make sure this doesn’t happen again?",
        "upvotes": 25,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1l3z95u/netflix_says_im_nit_a_part_of_my_own_household/"
    },
    {
        "id": "1l4l1t3",
        "author": "Reasonable_Dingo7453",
        "title": "Sirens reviews? Sharp performance, click pacing and dry wit",
        "content": "Sirens pulls you in with sharp performances, slick pacing, and just the right mix of drama and dry wit. The plot doesn’t break new ground, but the characters more than make up for it. Binge-worthy in a day or two—expect tears, chuckles, and a solid weekend watch.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l4l1t3/sirens_reviews_sharp_performance_click_pacing_and/"
    },
    {
        "id": "1l4a5ha",
        "author": "Idlicious",
        "title": "Best movies, series and shows to watch.",
        "content": "Looking for recommendations on what to watch on Netflix right now. I'm open to any genre, but I especially enjoy horror, psychological thrillers, mysteries, and anything with a dark or mind-bending twist. Bonus points if it's something underrated or less mainstream—I'm always down for hidden gems.  Would love to hear your favorite Netflix picks—movies, shows, limited series—anything that kept you hooked or messed with your head in a good way. Thanks in advance!",
        "upvotes": 4,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1l4a5ha/best_movies_series_and_shows_to_watch/"
    },
    {
        "id": "1l4ivk4",
        "author": "NathLWX",
        "title": "The Fragrant Flower Blooms With Dignity | Official Trailer | Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l4ivk4/the_fragrant_flower_blooms_with_dignity_official/"
    },
    {
        "id": "1l4cb97",
        "author": "RubyFennex",
        "title": "animated show recommendations?",
        "content": "looking for some recommendations for animated shows I could watch! I've been watching a lot of live-action lately, so I'd like to switch it up.\n\nI prefer plot-driven shows over episodic ones, unless it's a new concept (e.g. midnight gospel). characters with flaws or complicated backstories are also important to me. \n\nanime is fine as well :&gt;\n\nI've already seennn:\n- digital circus (favorite thing ever--)\n- final space\n- anything sonic related\n- aggretsuko\n- arcane\n- she-ra\n- beastars\n- death note\n- inside job\n- bna\n- midnight gospel\n\naaand probably a few more I'm forgetting? \neither or, thanks in advance!! ",
        "upvotes": 2,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1l4cb97/animated_show_recommendations/"
    },
    {
        "id": "1l3vqux",
        "author": "Legitimate_Ad3625",
        "title": "Squid Game creator says he lost 2 more teeth making the final season: 'I haven't put them back in yet'",
        "content": "",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l3vqux/squid_game_creator_says_he_lost_2_more_teeth/"
    },
    {
        "id": "1l4dvc9",
        "author": "B3gayandmerry",
        "title": "4 Seasons Show Thoughts for All Women",
        "content": "Women. Listen to me. We all deserve so much more than what the writers portrayed in the show. Anne did not deserve to live the rest of her life connected to her ex-husband's 32 year old girlfriend because before he died he got her pregnant. \n\nTina Fey's character did not deserve her husband being completely incapable of taking care of himself. \n\nNick's daughter did not deserve the half ass \"I love you\" from her dad who somehow had no idea why what he did was so wrong. \n\nMy god. I thought we were done with patriarchal influenced shows. \n\n1 star rating from me. The one star is for the gay couple cuz they were the only ones carrying anything good from that show. ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1l4dvc9/4_seasons_show_thoughts_for_all_women/"
    },
    {
        "id": "1l4dq72",
        "author": "Felix212365",
        "title": "i cant access family account",
        "content": "i know the e-mail and the password but the app says that the password is incorrect any solution? (i tried logging in again and again and still no works)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l4dq72/i_cant_access_family_account/"
    },
    {
        "id": "1l4ixho",
        "author": "Unusual-Word-7607",
        "title": "Comments",
        "content": "I wish Netflix had a comment section like YouTube does. I mainly watch on my phone not my tv. I don’t really care how that would work on a tv. But it would be cool. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l4ixho/comments/"
    },
    {
        "id": "1l4k4fb",
        "author": "Outrageous_Buddy1938",
        "title": "Dark patterns to retain customers",
        "content": "I canceled my membership after my daughter’s vacation ended and got a confirmation. But surprisingly, it was reinstated without consent, and the debit date changed from June to July. This feels like a dark pattern to retain customers. Seems, every online service provider is involved into such dark patterns to retain customers.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l4k4fb/dark_patterns_to_retain_customers/"
    },
    {
        "id": "1l4awpf",
        "author": "elrineswag",
        "title": "Anyone have workaround for no casting?",
        "content": "I cant cast to my firestick from my phone with netflix. Has anyone found a workaround yet forit? Really sucks dude. \n\nJust adding more characters lol. Xxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l4awpf/anyone_have_workaround_for_no_casting/"
    },
    {
        "id": "1l47mv1",
        "author": "ixelsel",
        "title": "Screen keeps tearing",
        "content": "I'm watching a show and the screen keeps tearing every few seconds for a single frame, I've tried alot of things but i can't get it fixed. Can somebody please help?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l47mv1/screen_keeps_tearing/"
    },
    {
        "id": "1l3ywvc",
        "author": "willi7lol",
        "title": "Error Code UI 3012",
        "content": "I am currently encountering this issue where if my laptop is connected to my Home Internet Provider, it won't allow me to watch the shows, I am able to access Netflix, but can't play the shows. I tried using different browsers like Chrome and Edge, as well as using the Netflix Desktop App, none of them works. However if I use the Hotspot connection from my data provider, I am able to play the shows, but here is the tricky part, using my phone, when connected to my home Internet provider, it works as well, it just doesn't work when  im trying to watch on my laptop.\n\nHave anyone encountered this issue before ?? It was working fine earlier all of a sudden it just stopped working on my laptop. Does anyone know any solutions? I've tried everything like clearing caches, restarting my router and Internet etc.\n\nEdit: the Internet works just fine, I am able to access Twitter, YouTube etc. I am just unable to play shows on Netflix in Chrome, Edge or the desktop app.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l3ywvc/error_code_ui_3012/"
    },
    {
        "id": "1l3vnox",
        "author": "OkStyle965",
        "title": "What to watch after Medusa?",
        "content": "I’ve finished watching Medusa and loved it. While waiting for season two, any idea or recommendations of the similar series to watch next? Weekend is coming:) thanks!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l3vnox/what_to_watch_after_medusa/"
    },
    {
        "id": "1l4304a",
        "author": "Sea-Blueberry9232",
        "title": "Stupid question: but where do you get to live the real life Outer Banks experience?",
        "content": "So plenty of people from the actual Outer Banks said that the Show is nothing like the actual Outer Banks they live in. So my question is: is there someplace in the world we dont know about, where it is like in the OBX (season 1-2)? Of course WITHOUT all the police chases and the treasure hunt for the Royal Merchant and the dramatized unrealistic stuff. I mean more if there is a coastal or beach town , fisher town or something similar, with a bunch of good looking Teenagers and Young Adults, that all apart from knowing how to drive a car they all know how to drive boats and they all surf and dive and are having their bonfire parties. Does something like that exist? Like a town with strong outer banks vibes? \n\nI know the gossip girl experience actually does exist, its called le rosey, a swiss boarding school. Prerequisite is that ur parents have to be loaded. Pretty much any expensive swiss boarding school.\n\nI know the emily in paris experience actually also does exist. Prerequisite is that 1. You speak french 2. You get a fashion job in paris that does get you invited to all these fashion shows and u live in the 6th and 7th Arrondissement and wear designer and earn good money. Or you can be an influencer or a nepo Baby like all the daughters from François Henri pinault. But the emily in paris experience does def exist in real life. \n\nBut I cant really Wrap my head around, if the Outer Banks experience is purely fictional or there is a town like that sonewhere in the world with such an environment. \n\nEdit: maybe somewhere in Australia? Or a little beach town in the south of france? Nizza? Monaco? LA? Malibu? Hawaii? Denmark?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1l4304a/stupid_question_but_where_do_you_get_to_live_the/"
    },
    {
        "id": "1l41s7b",
        "author": "RecordingUnlikely530",
        "title": "Dept. Q is giving me Oldboy vibes!",
        "content": "Dept. Q is giving me serious Oldboy vibes. Anyone else catch the parallels? The grim atmosphere, twisted motives, even using captivity as penance. Not as cringed as Oldboy though.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l41s7b/dept_q_is_giving_me_oldboy_vibes/"
    },
    {
        "id": "1l41p81",
        "author": "Effective_Ad8019",
        "title": "Account sharing fees in UK.",
        "content": "This may already been discussed in other posts but I can’t find them. I’m sorry. \n\n If you share Netflix account does Netflix automatically deduct more money out of your card. Or is they a warning first. I’m only asking cos a family member is travelling for a couple months so won’t be in the household. And we don’t wanna pay extra.  ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l41p81/account_sharing_fees_in_uk/"
    },
    {
        "id": "1l3zruu",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix has 3 originals in Top 10 Streaming for the week of April 28-May 4",
        "content": "",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l3zruu/netflix_has_3_originals_in_top_10_streaming_for/"
    },
    {
        "id": "1l4c7ov",
        "author": "Maleficent_Corgi5799",
        "title": "Big Mouth has somehow fallen off even harder",
        "content": "Big Mouth released when I was (I believe) in late elementary school. I began watching it in middle school and really enjoyed the first 2-3 seasons, it was very relatable and gave me confidence. I tried to watch more in high school and it honestly made me a little uncomfortable as the characters hadn't aged with me, and I began to realize how strange and grotesque the humor really was. Now that I'm in college, I tried to watch this newest season, and I feel like a straight up PDF file just for watching it 😭 it makes me feel very weird and not only that, the show has zero charm that it had before. It's extremely rushed and they're running out of ideas. This is my honest review, the first 2 or 3 seasons are very decent, especially for kids of similar age-- but it's turned into a dumpster fire rrom there.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1l4c7ov/big_mouth_has_somehow_fallen_off_even_harder/"
    },
    {
        "id": "1l3y5hs",
        "author": "Sad_Confusion_4225",
        "title": "Volume on Netflix",
        "content": "I have an issue with not being able to hear the conversations on Netflix shows/ movies. I have had to revert to using subtitles. \n\nWhile on regular channels, I am able to hear everything well, it’s only on Netflix that the volume is very low no matter how high I turn it up. \n\nIs there a way that I can increase the volume on Netflix? Thank you in advance for any advice! ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l3y5hs/volume_on_netflix/"
    },
    {
        "id": "1l306ge",
        "author": "Sweaty-Toe-6211",
        "title": "‘Adolescence’ Beats ‘Stranger Things 4’ to Become Netflix’s No. 2 Most-Watched English-Language Series Ever",
        "content": "",
        "upvotes": 169,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1l306ge/adolescence_beats_stranger_things_4_to_become/"
    }
]