[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1m79jzv",
        "author": "SignatureLast3380",
        "title": "\"Degrado\" in Barriera di Milano",
        "content": "Mahalo,\n\nsono un ragazzo di Palermo e recentemente sono salito in trasferta a Torino a trovare un amico fuorisede che abita in Barriera di Milano, in via Cherubini. Premetto che, prima di partire, il mio amico mi aveva terrorizzato psicologicamente sulla pericolosità di questo quartiere al punto che mi stavo quasi per equipaggiare di fucile da cecchino Remington e un paio di bombe a mano come se stessi andando sul fronte a Gaza. Non fidandomi della singola esperienza di una sola persona, ho provato a informarmi un po' di più su questa zona e ho avuto i sudori freddi leggendo le descrizioni che i torinesi ne offrivano. Beh volete sapere una cosa? Appena ci ho messo piede la prima esclamazione che mi è venuta in mente è stata \"MA VERAMENTE FATE?\". Da come ne parlavano sembrava dovessi trovarmi in uno dei barrios più pericolosi di Caracas, dove per un sì e per un no avrei potuto dire addio giugulare. Invece mi è sembrato un normalissimo quartiere di periferia, specialmente nelle vie adiacenti al condominio del mio amico, sì mi è capitato di adocchiare qualche brutto ceffo e qualche palazzo più fatiscente nella zona di Corso Vercelli, ma semplicemente avevo capito che non mi trovavo nella zona più ricca della città, certo non è bellissimo, non è Beverly Hills e non c'è molto da vedere o visitare (anche se ho visto che c'è un bel museo di arte contemporanea), ma non mi è sembrato nulla di così scandaloso e per nulla corrispondente a ciò che ho letto in giro. Da palermitano vi posso assicurare che Barriera di Milano figurerebbe come uno dei migliori quartieri della mia città (e lo dico a malincuore, con profondo rammarico). Forse non ho \"visitato\" le zone giuste? Forse non sono uscito abbastanza tardi? Forse il mio amico ha subito il lavaggio del cervello da parte di media e torinesi?\n\nCredo che ad alcuni servirebbe uscire per vedere e rendersi conto di quali siano i quartieri veramente pericolosi e malfamati in Italia.\n\n  \nPS unica cosa: le tende verdi sul retro delle case quelle si potreste toglierle che effettivamente sono un po' bruttine\n\nFatemi sapere",
        "upvotes": 54,
        "comments": 48,
        "media": null,
        "permalink": "/r/torino/comments/1m79jzv/degrado_in_barriera_di_milano/"
    },
    {
        "id": "1m7xp0i",
        "author": "panzerPandaBoom",
        "title": "Specialistica medicina torino",
        "content": "Ciao a tutti,\nMia sorella sarebbe interessata a frequentare la specialistica di endocrinologia a Torino.\n\nCome è l'ambiente della specialistica di medicina a Torino, se possibile di quel reparto nello specifico?\n\nGrazie",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1m7xp0i/specialistica_medicina_torino/"
    },
    {
        "id": "1m7rz3j",
        "author": "EduardisEduard",
        "title": "Musicisti, vi invoco!",
        "content": "Ciao a tutti, ultimamente mi passa sempre per la testa imparare a suonare un istrumento musicale. \nHo visto varie scelte, dal semplice ukulele, alla chitarra,  al violino e al sassofono. \nDiciamo che, quello che mi ispira di piu e l'ultimo,  perche più semplice da padroneggiare. Ma anche il violino mi incanta per la sua eleganza.\nVoi cosa ne pensate? \nCome avete cominciato?\nCome suonate a casa?\nCi sono posti a Torino dove socializzare con altri musicisti?\nVorrei sentire le vostre esperienze, e perché no, anche consigli. :')\n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1m7rz3j/musicisti_vi_invoco/"
    },
    {
        "id": "1m7i9k3",
        "author": "WhereIsMyMind9519",
        "title": "Guidare a torino",
        "content": "Ma guidare a torino é complicato con sti viali e controviali, segnali che non si vedono ecc.. ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1m7i9k3/guidare_a_torino/"
    },
    {
        "id": "1m6j0sp",
        "author": "Murky_Giraffe8700",
        "title": "Ma cosa sta succedendo in zona Barriera?",
        "content": "Negli ultimi giorni passo spesso in zona Barriera, in macchina, in bici o a piedi… e ogni volta sembra peggiorare.\n\nGente che dorme ovunque per strada, parchi giochi pieni di persone che bevono e fumano tutto il giorno, gruppi che stazionano agli angoli delle vie come se fossero delle gang, e almeno un angolo che è chiaramente una piazza di spaccio a cielo aperto (sulla farmacia vicino l'angolo con Corso Regina)\n\nL’altro giorno ero in macchina e improvvisamente, a pochi metri, due tizi hanno iniziato a urlare e a picchiarsi. Si sono tirati sassi e bastoni in mezzo alla strada, come se fosse una scena da paese del terzo mondo. Nessuno ha detto o fatto nulla. Tutto normale. Come se fosse routine.\n\nLa cosa assurda è che tutto questo avviene **con una normalità sconcertante**. Nessuno interviene. Mi sto perdendo qualcosa?",
        "upvotes": 63,
        "comments": 45,
        "media": null,
        "permalink": "/r/torino/comments/1m6j0sp/ma_cosa_sta_succedendo_in_zona_barriera/"
    },
    {
        "id": "1m75e2e",
        "author": "nonsensehero",
        "title": "Parcheggio zona Mauriziano",
        "content": "Ciao! Venerdì dovrò accompagnare un parente a una visita per le 8:30., E' tanto che non passo in zona: com'è il parcheggio? Parkito è full 😞 e non vedo parcheggio su strada 😐",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1m75e2e/parcheggio_zona_mauriziano/"
    },
    {
        "id": "1m6xv81",
        "author": "Repulsive-Yak-126",
        "title": "Leaving italy",
        "content": "Leaving italy\n\nHello everyone, I'm an exchange student with a expired visa 17 July), working ricevutta and I'm leaving italy on a plane from MCP today, I wanted to know if there would be any problems on passport control and if I will be able to leave the country, thank you in advance!",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1m6xv81/leaving_italy/"
    },
    {
        "id": "1m6pnxg",
        "author": "melethbser",
        "title": "[OC] Piazza Castello (Novembre 2019)",
        "content": "",
        "upvotes": 17,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/v76vanwpmhef1.jpeg?auto=webp&amp;s=4a435262a9060841550cb744cbb5e98602ebafae"
        },
        "permalink": "/r/torino/comments/1m6pnxg/oc_piazza_castello_novembre_2019/"
    },
    {
        "id": "1m6d0kf",
        "author": "grovio8888",
        "title": "Falegname?",
        "content": "Ciao!\n\nCome da titolo, per caso avete avuto esperienza con dei falegnami con cui vi siete trovati bene, o comunque in generale sapete che lavorano bene?\n\nAvrei bisogno di alcuni lavori (delle scaffalature e battiscopa)\n\nGrazie mille!",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1m6d0kf/falegname/"
    },
    {
        "id": "1m6b5sz",
        "author": "Infamous-Maize9129",
        "title": "Consigli scelta laurea magistrale",
        "content": "Ciao a tutti. Mi sono appena laureato in economia aziendale (L-18) ad Unito. Adesso proseguirei con la magistrale LM-77 di cui ho già sostenuto e passato il test d'ingresso. Tra poco dovrò immatricolarmi e scegliere il percorso di studi tra business management e marketing management. Premettendo che alla triennale i miei corsi preferiti sono stati quelli sulla direzione d'impresa e sulle strategie aziendali, su quale percorso mi dovrei buttare? E soprattutto quale porta a più sbocchi lavorativi o sarà più utile in futuro (anche lavorativamente parlando). Magari se qualcuno ha già fatto questo corso e ha voglia di darmi alcuni hint sono bene accetti.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1m6b5sz/consigli_scelta_laurea_magistrale/"
    },
    {
        "id": "1m6fdm6",
        "author": "pensareadaltro",
        "title": "Parco Peccei",
        "content": "Qualcuno l'ha visitato? Ho visto che c'è stata un'inaugurazione in pompa magna poco meno di un mese fa. Quali sono le vostre impressioni?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1m6fdm6/parco_peccei/"
    },
    {
        "id": "1m6a9qe",
        "author": "mappatore_piemontese",
        "title": "Borsa di studio EDISU",
        "content": "Sono interessato a iscrivermi all'università statale di Torino e volevo usufruire della borsa di studio o del servizio abitativo EDISU. Ma sto avendo fatica a reperire informazioni, visto che ancora non trovo da nessuna parte il bando 2025/26 ma solo quello dell'anno scorso. C'è qualcuno che ne benefica e mi spiega come funziona? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1m6a9qe/borsa_di_studio_edisu/"
    },
    {
        "id": "1m66w5g",
        "author": "Gebruikersname",
        "title": "Where to buy a tuxedo",
        "content": "Hi,\n\nI would like to buy a tuxedo in Turin. My budget is approximately €600. Does anyone have a recommendation for a store, in this price range? On maps I have seen some nice stores, but they seem to be well above my budget.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1m66w5g/where_to_buy_a_tuxedo/"
    },
    {
        "id": "1m5wkl6",
        "author": "spilled_almondmilk",
        "title": "Località di mare raggiungibili in treno",
        "content": "Ciao! Mi trovo a passare per il sesto anno di fila l'estate a Torino e vorrei poter andare al mare in Liguria almeno per un giorno o due, ma purtroppo sono senza automobile.\n\nMi chiedevo: esistono posti non eccessivamente pieni di gente che si possano raggiungere in treno (o autobus, se ce ne sono) da Torino?\n\nSono disposta a viaggiare scomoda, a orari improbabili, a metterci delle ore, a farmi pure qualche chilometro a piedi ma mi basta trovare dei posti carini, dove si possa stare tranquilli lontano dalla calca e dal turismo sfrenato.\n\nAvete suggerimenti? Vi ringrazio in anticipo 🙏🏼",
        "upvotes": 4,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1m5wkl6/località_di_mare_raggiungibili_in_treno/"
    },
    {
        "id": "1m5wffi",
        "author": "Andrews002",
        "title": "Cornetteria/forni zona piazza castello o Mole",
        "content": "Salve,\nCerco dei posti dove trovare buoni cornetti e in generale prodotti da forno dolci in zona Piazza castello o Mole antonelliana, due zone per me facilmente raggiungibili con i mezzi. Grazie mille in anticipo.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1m5wffi/cornetteriaforni_zona_piazza_castello_o_mole/"
    },
    {
        "id": "1m5bpsa",
        "author": "Infamous-Habit4769",
        "title": "L'ubriacone del 64 e il disagio sociale",
        "content": "Ieri sera ho assistito a un siparietto molto trash sul 64, direzione Collegno.\n\nCredo sia ormai un volto noto sul 64 notturno, un tizio sulla sessantina perennemente ubriaco e molesto che parla da solo inveendo contro qualcuno che vede solo lui, tirando porconi e mugugnando qualcosa tipo ''mandarini di merda''.\n\nFatto sta che ieri sera stava bofonchiando da solo come suo solito quando ha detto qualcosa riguardo non meglio specificata ''gente di colore'': apriti cielo.\n\nUn tizio ha iniziato a fargli brutto urlandogli che aveva rotto i coglioni e che non doveva permettersi di dire cose razziste a gente che stava tranquilla.\n\nIn tutto questo, per qualche ragione, altri passeggeri hanno iniziato a prendere le difese del tizio ubriaco nonostante il fastidio recato, perché non si sa cosa ha passato per ridursi così, e che comunque l'altro tizio non aveva nessun diritto di dire alla gente di star zitta e chiudere la bocca.\n\nDopo varie minacce vuote, insulti, e bofonchiate incomprensibili, l'eroe che nessuno ha chiesto è sceso, seguito dopo qualche fermata dal nostro alcolizzato.\n\nOgni sera sul 64 è così con quest'uomo.\n\nQuello che mi lascia perplesso è che tanta gente che ha comunque i propri problemi vorrebbe solo star tranquilla soprattutto a fine giornata, e prendersela con uno che dice a un tizio molesto di star zitto mi pare assurdo. Nel senso, essere in una situazione di fragilità ti da il diritto di essere una spina nel culo a gente che è obbligata suo malgrado ad averti attorno?",
        "upvotes": 50,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1m5bpsa/lubriacone_del_64_e_il_disagio_sociale/"
    },
    {
        "id": "1m5nvmk",
        "author": "cat-gin",
        "title": "Dove giocare a d&amp;d il pomeriggio?",
        "content": "Auto esplicativo, la sera ho troppi impegni per andare alla Gilda del grifone o posti seri simili. \n\nMagari uno con principianti così da poter imparare insieme!",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1m5nvmk/dove_giocare_a_dd_il_pomeriggio/"
    },
    {
        "id": "1m5qmpw",
        "author": "_lostinthisworld_",
        "title": "Help with bugs",
        "content": "Hi!\nDoes anyone else have a problem with silverfish or other bugs in their apartment and how can it be solved? I didn't have this issue during the winter, but it started appearing around May.\nI really dont know what to do, if anyone can help, I would be happy. ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1m5qmpw/help_with_bugs/"
    },
    {
        "id": "1m5qyam",
        "author": "Disastrous_Rule_5180",
        "title": "Torino recommendations",
        "content": "Hi! Me and my girlfriend got here yesterday and will stay until Sunday. What’s something we can’t miss? We enjoy good food, music, culture and good wine. What’s some good restaurant tips? Preferably with Piemonte cuisine. We’ll probably also travel to Alba or Asti for a day trip if you have any recommendations there as well. Grazie!",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1m5qyam/torino_recommendations/"
    },
    {
        "id": "1m5pica",
        "author": "Smalljules89",
        "title": "Ballare salsa sulla Fiume Po?",
        "content": "Ciao. Siamo a Torino per altri giorni e abbiamo visto che l'area vicino a fiume Po è attualmente bello per incontrarsi e ballare salsa la (area avanti a discoteca the beach?) \nNon abbiamo bisogno di tanto. Solo qualcuno chi può suonare la musica e possiamo ballare insieme. Dove sono i ragazzi chi vogliono ballare?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1m5pica/ballare_salsa_sulla_fiume_po/"
    },
    {
        "id": "1m4w8k7",
        "author": "amicidilazzaro",
        "title": "Mense a Torino - Servizi per chi e' in difficolta' (con alcune segnalazioni per l'estate 2025)",
        "content": "In luglio Casa s.Luisa chiusa  \nS. Antonio ad agosto (fino al 25), in compenso c'e' la  \nMensa Estiva Via Ghedini 6, 10154 Torino Aperta d'estate. Dal lunedi al venerdì, più sacchetto per i festivi, dalle ore 11.45 alle 12.45.\n\nNel link invece trovate le mense aperte abitualmente durante l'anno (link aggiornato abbastanza regolarmente)  [https://www.amicidilazzaro.it/it/solidarieta/mense-a-torino-servizi-per-chi-e-in-difficolta/](https://www.amicidilazzaro.it/it/solidarieta/mense-a-torino-servizi-per-chi-e-in-difficolta/)",
        "upvotes": 27,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1m4w8k7/mense_a_torino_servizi_per_chi_e_in_difficolta/"
    },
    {
        "id": "1m5ex3j",
        "author": "dkroods",
        "title": "📣 Aggiornamento Importante - Take It Easy Torino",
        "content": "Ciao a tutte e tutti! 👋  \nVogliamo innanzitutto **scusarci con chi ha riscontrato problemi** con le versioni precedenti dell'app. Sappiamo che alcuni di voi hanno avuto difficoltà e vi ringraziamo per la pazienza.\n\nOggi abbiamo rilasciato un **nuovo aggiornamento** che include:\n- Tante **ottimizzazioni generali**\n- **Supporto ad Android 15**\n- **Correzione di vari bug** segnalati\n\nSperiamo che con questa versione **l'app funzioni correttamente per tutti**! 🎉\n\nDetto ciò, se notate ancora qualcosa che **non funziona bene sul vostro smartphone in particolare**, o volete darci una mano a trovare e risolvere errori, non esitate a:  \n📬 **Contattarci direttamente dall'app**  \n💬 **Scrivere qui nei commenti** il problema\n\nFaremo del nostro meglio per sistemare tutto il prima possibile.  \nGrazie ancora per il supporto e la fiducia ❤️\n\nIl team di *[Take It Easy Torino](https://davomelkumyan40.github.io/TakeItEasy.github.io/)* 🚍✨",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1m5ex3j/aggiornamento_importante_take_it_easy_torino/"
    },
    {
        "id": "1m5k7ac",
        "author": "StrangeAd6311",
        "title": "Solo io ho notato che stanno dando una marea di multe ultimamente?",
        "content": "Ciao a tutti,\nsono un normalissimo sopravvissuto alle strisce blu e stanco di prendere multe su multe ho deciso di creare un bot su Telegram che ti avvisa se viene segnalata la Municipale nella zona in cui hai parcheggiato.\n\nFunziona così:\n\t1.\tParcheggi e dici al bot dove sei.\n\n\t2.\tQualcun altro che vede la Municipale in giro fa una segnalazione.\n\n\t3.\tSe sei nelle vicinanze, ricevi subito una notifica tipo “Occhio, stanno facendo le multe in Via X alle 10:43”.\n\nÈ gratuito, semplice e si basa sulla collaborazione tra utenti.\nPiù persone lo usano, più diventa efficace.\nNon ho sponsor, non è un’azienda: è nato perché mi sono preso decine di multe ingiuste (non sono stato ore e ore parcheggiato senza pagare, qualche volta parliamo anche di minuti)\n\n🔗 Il bot si chiama @ParkingBud_bot e sto testando su Torino.\n\nSe vi va di provarlo o darmi feedback, sono tutto orecchie 🙏\nE se lo trovate utile, passate parola… magari evitiamo qualche multa tutti insieme.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1m5k7ac/solo_io_ho_notato_che_stanno_dando_una_marea_di/"
    },
    {
        "id": "1m4qujm",
        "author": "Meiyo_ayoo",
        "title": "Sta sfuggendo di mano",
        "content": "BUONSALVE ABITANTI DI TORINO! \nTorino capitale delle belle cose, molto belle, tra cui l’indecenza delle persone!\nDunque miei fedeli destrieri oggi torno, dopo mesi di inattività, a raccontare una parte di questa città magnifica, al fine di chiedere aiuto a risolvere queste cose indecenti.\nQuindi, io sono M16, e no, non sono un fucile d’assalto ma un semplice ragazzo delle superiori -a volte preferirei esserlo- e oggi vi racconterò un avvenimento di qualche ora fa, vissuto sulla mia pelle.\nDunque, io non mi reputo una persona matura, anzi credo di poterlo essere di più, però oggi ho compiuto un atto degno di lode… non per tutti a quanto pare.\nStavo aspettando il pullman sotto casa mia e vedendolo arrivare mi accingo a fare il consueto gesto con la manina per farlo fermare, alchè vedo un povero uomo correre verso il pullman, in fondo, all’orizzonte, con l’intento di prendere il mezzo pubblico.\nIo, da bravo cittadino che sono, mi metto a metà tra porta e marciapiede per evitare che l’autista chiuda le porte e per far salire questo povero corridore (appunto: l’autista aveva aperto solo una porta, quella centrale). \nAd un certo punto (5 secondi dopo che si era fermato il pullman e che non ero salito) l’autista ha provato a chiudere la porta, che avevo prontamente fermato con il mio braccio, e iniziato ad urlarmi contro.\nIo e il mio prodo entriamo in pullman e quella strega maligna inizia ad urlarmi “NON DEVI FARE QUESTE COSE, SIAMO TUTTI DI FRETTA QUI, SI POSSONO ROMPERE LE PORTE!” alchè io rispondo a tono con un “Stia calma, ho solo fatto un buon gesto. Un po’ di umanità c**zo” e finisce lì la storia.\nQuindi miei fedeli lettori, cosa ne pensate? \nSono stato io il problema perché il pullman era in ritardo di 6 minuti o l’autista indegna di essere un’umano pensante?\nLa cosa che fa riflettere molto sulla maturità delle persone oggi è che la guerriera infuriata era una donna sulla cinquantina… battuta da un sedicenne.\nBENE, a voi i restanti pareri, \nBuona giornata miei prodi!\n\nps: quando sono sceso dal pullman e dovevo attraversare mi sono fermato in mezzo alla strada, l’ho guardata e ho sorriso come un imbecille.\n\nps2: il tipo mi ha ringraziato e ho scoperto che era un turista… che brutta idea si sarà fatto… menomale che non ha capito cosa diceva quella lì perché non sa l’italiano!",
        "upvotes": 9,
        "comments": 42,
        "media": null,
        "permalink": "/r/torino/comments/1m4qujm/sta_sfuggendo_di_mano/"
    },
    {
        "id": "1m4qaol",
        "author": "Parking-Job-3175",
        "title": "Chi vuole venire al museo egizio? O altre attività",
        "content": "Ciao! Sarò a Torino per un paio di giorni principalmente per lavoro. Nel tempo che avrò libero, mi piacerebbe andare a visitare il museo egizio ed eventualmente passeggiare per la città. Se qualcuno è interessato, possiamo chiacchierare per messaggio privato. Io ho 29 anni e parlo italiano, inglese, francese e spagnolo. Lavoro nella sostenibilità / riciclaggio, mi piace lo sport e faccio parte della comunità LGTBI. 🤗",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1m4qaol/chi_vuole_venire_al_museo_egizio_o_altre_attività/"
    },
    {
        "id": "1m4lduy",
        "author": "Fv_invest",
        "title": "Quale attività, servizio o business secondo voi manca a Torino (o in Italia in generale)?",
        "content": "Ciao a tutti!\nSto cercando di farmi un’idea su cosa manca nella nostra città (e più in generale in Italia) a livello di servizi, attività o business.\nMi piacerebbe sapere da voi:\n\nC’è qualcosa che avete visto all’estero e che qui non esiste (o esiste poco)?\n\nUn problema che vivete ogni giorno e che secondo voi si potrebbe risolvere con un servizio intelligente?\n\nUn tipo di locale, spazio, app, o esperienza che vi piacerebbe esistesse?\n\n\nNon cerco idee da copiare, ma voglio capire meglio i bisogni non soddisfatti delle persone. Ogni spunto è benvenuto. Anche le cose più piccole o strane!\n\nGrazie in anticipo!",
        "upvotes": 9,
        "comments": 64,
        "media": null,
        "permalink": "/r/torino/comments/1m4lduy/quale_attività_servizio_o_business_secondo_voi/"
    },
    {
        "id": "1m4kbua",
        "author": "O_O__________",
        "title": "Strutture Anziana con figlio disabile",
        "content": "Salve Redditors, \nHo una zia molto anziana di Torino che al momento vive da sola e gestisce un figlio con disabilità (mentale e fisica). Da un po' di tempo stava cercando una struttura che potesse accomodare lei e suo figlio, una struttura che lei dia la tranquillità che sua figlia viva bene nel momento in cui verrà a mancare.\n\nNon ho la possibilità io di mollare tutto e gestire la situazione e probabilmente creerei solamente problemi con i vari parenti parassiti che stanno cercando di marciarci sopra.\nHo pensavo dunque di salire  3-4 giorni per fare una cernita delle varie strutture, così da lasciarle une lista e sperare che tutto vada per il meglio.\n\nVorrei chiedervi se qualcuno ha qualche struttura affidabile da consigliarmi",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1m4kbua/strutture_anziana_con_figlio_disabile/"
    },
    {
        "id": "1m4vsha",
        "author": "gamma50g",
        "title": "TrenItalia from Torino to Venice at 805 am. How early do I need to get to Torino station?",
        "content": "I have a train from Torino to Venice Trenitalia frecciarossa 9715. The departure time is 805 am from Porta Nueva Station.\n\nHow much time earlier should I arrive? We are 3 people with one suitcase each.\n\nThanks!",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1m4vsha/trenitalia_from_torino_to_venice_at_805_am_how/"
    },
    {
        "id": "1m3z6z1",
        "author": "iLoveLoFi",
        "title": "4 Nights in Torino",
        "content": ".. were definitely not enough. I had around 30.000 Steps a day and i gotta say :\nIm so impressed. All the porticoes, the little side streets, there is so much to explore! I thought after being to Bergamo and Verona for two nights each that this City might be a little more stressful but i actually managed to relax more here. Coming from Berlin, i really felt at home. I think those two cities are actually pretty similar. Some areas are a little bit sketchy i suppose but i didn’t feel in danger anywhere, even BdM was not as bad as expected. I have been to a few larger european cities like Paris, Munich, Cologne, London etc. and even Milan and Rome but if i would have to choose i would definitely prefer staying in Turin. I can’t exactly explain why i felt so comfortable here, some people told me before that it can be boring and that its a non-touristic city but maybe that’s precisely why it felt so good. I didn’t hear any loud americans or drunk russians. (sorry for the stereotypes but i mean it’s true).\nA city like Bergamo was amazing to see, a lot of history and a lot of pretty architecture, but i wouldn’t exactly wanna live there i think. Turin is different, while it also has the history and architecture, it just feels more lively. I really enjoyed going to places like Master Sandwich or Imbarchino. Talking to locals, students etc. everybody was really nice and seemed to appreciate my effort to speak in broken italian. A tobacco store owner told me how much the city is changing and that he is a bit afraid of the direction it might take but i think as long as it stays true to the core values that it seems to have, it will be just fine, i definitely enjoyed it a lot and would love to come back. Just wanted to say that i think you guys can be proud of your city, its really nice!\n\n\nedit: oh also, molecola is amazing! i hate normal coke which is why i usually only drink Fritz Kola, which i couldn’t find anywhere, but molecola was a nice replacement. \n",
        "upvotes": 89,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1m3z6z1/4_nights_in_torino/"
    },
    {
        "id": "1m4ljdu",
        "author": "seba-dev",
        "title": "Conoscete associazioni non profit?",
        "content": "Da poco sto cercando di mettere in piedi una piattaforma per connettere volontari e associazioni non profit e mi chiedevo se ce ne fossero che cercano attivamente volontari.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1m4ljdu/conoscete_associazioni_non_profit/"
    }
]