[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1ozjejp",
        "author": "NicoLibero",
        "title": "Networking cinema e fotografia",
        "content": "Sono torinese di nascita ma vivo fuori da quando ho 8 anni. Lavoro nel mondo del cinema e della fotografia, e a Barcellona abbiamo diversi gruppi whatsapp/account instagram da cui si fa networking e si può trovare gente per montare crew e trovare lavoro. Qualcuno saprebbe se esiste qualcosa di simile su Torino ?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ozjejp/networking_cinema_e_fotografia/"
    },
    {
        "id": "1ozb8uo",
        "author": "Virtual_Aide_7330",
        "title": "Com'è via Sondrio?",
        "content": "Ciao ragazzi, sono una ragazza che studia a Palazzo Nuovo, ho trovato una stanza in via  Sondrio? Cosa ne pensate? Com'è a livello di sicurezza e comodità? ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ozb8uo/comè_via_sondrio/"
    },
    {
        "id": "1ozkda8",
        "author": "TorinoMeetUpQuality",
        "title": "Ciao a tutti e grazie per avermi accolto tra voi da Torino eccomi qui… se avete piacere di due parole in più @whitemarketo tg 🥰",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ozkda8/ciao_a_tutti_e_grazie_per_avermi_accolto_tra_voi/"
    },
    {
        "id": "1ozewvn",
        "author": "maciofitness-8596",
        "title": "Voi pensate sia una notizia vera? \"Energia e gas a Torino: arriva l'utility manager, professionista delle bollette. \"",
        "content": "Stipendi da 25mila a 80mila euro l'anno: energia e gas sono il nuovo Eldorado per i torinesi.   \nTra i lavori dell'immediato futuro c’è quello dell’utility manager, un vero e proprio esperto delle bollette di luce, gas e telefono, che analizza i consumi, monitora le tariffe e consiglia le soluzioni più adatte al cliente.  \n",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ozewvn/voi_pensate_sia_una_notizia_vera_energia_e_gas_a/"
    },
    {
        "id": "1oze2u8",
        "author": "LividCricket7631",
        "title": "Pasta all'amatriciana",
        "content": "Hello, I know it's a Roman thing, but I can imagine that some restaurants make it here.\n\nWould anyone here have a couple of addresses to suggest? 🙏😊",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1oze2u8/pasta_allamatriciana/"
    },
    {
        "id": "1ozekrq",
        "author": "rinorii1",
        "title": "Universita di Torino",
        "content": "Buongiorno, vorrei sapere se è possibile visitare l'Università di Torino durante il fine settimana (sabato o domenica) di giorno. Vorrei visitare la struttura (in particolare il corso di laurea in Lettere). In pratica, vorrei solo visitare le aule e i dintorni.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ozekrq/universita_di_torino/"
    },
    {
        "id": "1ozan2h",
        "author": "BrightMud165",
        "title": "Mi consigliate qualche corso da fare la sera?",
        "content": "E' un periodo che non me la passo bene e sento la necessità di fare qualcos'altro nella vita oltre alla normale routine. Vado già da uno psicologo (se avete qualcuno da consigliare ben venga, ma non è l'oggetto del post). Vorrei fare qualcosa di costruttivo la sera e stavo pensando ad un corso. Ad esempio, anni fa mi è stato abbastanza utile un corso di fotografia. Pensavo ad un corso di cucina (che costa una fucilata) o ad un corso cai (però in questo periodo non trovo nulla). Avete suggerimenti, consigli?",
        "upvotes": 2,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1ozan2h/mi_consigliate_qualche_corso_da_fare_la_sera/"
    },
    {
        "id": "1oyueir",
        "author": "kussent",
        "title": "CERCHIAMO BATTERISTA per una band Metalcore/Sperimentale con Lore a Torino",
        "content": "Sto formando una band seria con influenze metalcore ma sperimentali, con suoni che vanno dall’alt metal/rock, deathcore, deep house, elettronica, fino a sonorità atmosferiche oscure o acustiche, ecc. Con storytelling e un lore profondo.\n\nTutti i brani saranno originali e in inglese; gran parte dei testi è già scritta, manca la composizione musicale.\n\nSiamo un cantante (melodico e scream), un chitarrista a 7 corde, un bassista e stiamo contattando un tastierista, quindi cerchiamo un batterista (età 17–26) motivato e appassionato, disposto a partecipare a un progetto creativo, performativo e sperimentale.\n\nSe sei interessato, scrivimi qui e ne parliamo in privato.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oyueir/cerchiamo_batterista_per_una_band/"
    },
    {
        "id": "1oytllr",
        "author": "silviuzX2",
        "title": "Dove trovare dr.pepper",
        "content": "Come da titolo, domanda un pò strana ma qualcuno sa dove si possa trovare la dr.pepper qui a Torino, che non abbia un costo per lattina ridicolo (non più di 2 euro, di meno è meglio), quindi non ODS store, magari tipo qualche minimarket che la ha, anche in periferia ? Chiedo perchè sono stato da poco a Budapest (lì è venduta ufficialmente ovunque) e me ne sono innamorato",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1oytllr/dove_trovare_drpepper/"
    },
    {
        "id": "1oyvp9x",
        "author": "Lucre_3",
        "title": "Concerto Inalpi Arena",
        "content": "Ciao a tutti dovrei comprare 2 biglietti per un concerto all’Inalpi Arena (Pala Alpitour), volevo capire com’è la visibilità nel I anello visibilità laterale limitata (settori 115 e 108) e nel II anello visibilità laterale (settori 215,301 e 208), qualcuno è stato in questi settori? Il palco almeno si vede o è totalmente ostruito?\nSono disponibili anche dei posti in fondo nella platea (praticamente il prato ma con i posti a sedere), ma visto il prezzo non so se ne vale la pena perché secondo me il palco si vede ancora meno…\nGrazie!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1oyvp9x/concerto_inalpi_arena/"
    },
    {
        "id": "1oyosv5",
        "author": "Iky_eb06",
        "title": "Cerco delle \"quiet spot\" in città",
        "content": "Ciao, sono di Torino e ho sempre voluto trovare un posto isolato e silenzioso per passare del tempo da solo. Ho provato ad andare in qualche parchetto ma c'è quasi sempre un po' i gente (magari sono anche gli orari in cui vado). Vorrei trovare una \"quiet spot\" (se avete capito cosa intendo) così da poter passare del tempo da solo e magari ammirare anche la città/il luogo in cui mi trovo.",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1oyosv5/cerco_delle_quiet_spot_in_città/"
    },
    {
        "id": "1oytt9i",
        "author": "valuglam1",
        "title": "Luoghi da visitare",
        "content": "Ciao gente! Mia suocera è arrivata dall'Argentina e voleva sapere quali posti nelle vicinanze si possono fare senza un budget così elevato? Capisco che adesso i giorni non siano buoni, ma nel caso tu abbia delle idee",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1oytt9i/luoghi_da_visitare/"
    },
    {
        "id": "1oygywb",
        "author": "fratifresh",
        "title": "Negozi che comprano carte Pokemon a Torino",
        "content": "Ciao ragazzi, ho un po’ di carte Pokémon che ho riordinato e alcune sono piuttosto rare (alcune online vengono vendute tra i 50 e i 100 € a carta). \nQualcuno conosce negozi onesti a Torino che le comprerebbero a un prezzo giusto?\nE se c’è qualche esperto di carte disposto a guardarle / aiutarmi nella valutazione / contrattazione, sarei super grato. Grazie!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1oygywb/negozi_che_comprano_carte_pokemon_a_torino/"
    },
    {
        "id": "1oykqaa",
        "author": "Glad-Lecture-1700",
        "title": "Inquinamento dell'aria",
        "content": "Solo io percepisco un certo allarmismo in questo e altri articoli di note testate giornalistiche?Considerando che controllo spesso la qualità dell'aria qui [http://www.cittametropolitana.torino.it/cms/ambiente/qualita-aria/dati-qualita-aria/ipqa](http://www.cittametropolitana.torino.it/cms/ambiente/qualita-aria/dati-qualita-aria/ipqa), oggi ad esempio è \"ottima\" e in generale non la vedo spesso scarsa",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1oykqaa/inquinamento_dellaria/"
    },
    {
        "id": "1oxtx1m",
        "author": "Floofs-In-Space",
        "title": "flying to the US from Torino: arrive at airport four hours in advance?",
        "content": "Hi, I'm flying to the US next week. I just received an email from the airline with this:\n\n*Due to US security measures, you will need to arrive at the airport 4 hours in advance and be at the boarding gate in plenty of time to clear security.*\n\nThat seems excessive. Thoughts?",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1oxtx1m/flying_to_the_us_from_torino_arrive_at_airport/"
    },
    {
        "id": "1oxzeax",
        "author": "Green_Fact_7901",
        "title": "evento SPEEDGAME a Torino, TRIVIA NIGHT",
        "content": "https://preview.redd.it/xmc7oowgug1g1.png?width=1587&amp;format=png&amp;auto=webp&amp;s=0ef003a9725b609038a1a8ebf75ca48667d26ca3\n\n# Ciao ragazzi, siamo un gruppo universitario e vorremmo mettere in contatto persone della stessa città, attraverso eventi un po' diversi dal solito. Che tu sia solo/a o con amico/a iscriviti dal nostro sito [speedgame.it](http://speedgame.it) e inizia a divertirti :)",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oxzeax/evento_speedgame_a_torino_trivia_night/"
    },
    {
        "id": "1oxn44z",
        "author": "Watcherofthescreen",
        "title": "Marengo Tours?",
        "content": "Hello,\n\nI'm planning on visiting Torino next year and would like to visit the Marengo battlefield and museum near Alessandria.\n\nWould you happen to know anyone who might he willing to give me a tour or show me around? Of course, I'd be willing to pay.\n\nEdit: I couldn't find anything official. ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1oxn44z/marengo_tours/"
    },
    {
        "id": "1owszmt",
        "author": "Travelwanderlust5",
        "title": "Torino negli anni sessanta!",
        "content": "",
        "upvotes": 272,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hqwhrjvp971g1.jpeg?auto=webp&amp;s=23672d0507799018a0de8a75495fb50ac356c879"
        },
        "permalink": "/r/torino/comments/1owszmt/torino_negli_anni_sessanta/"
    },
    {
        "id": "1oxtkz4",
        "author": "Olengu-29",
        "title": "Formaggi e altri prodotti al tartufo",
        "content": "Hola,\nA natale volevo fare dei regali e alcuni parenti fuori regione mi hanno chiesto formaggi e altri prodotti al tartufo, volevo sapere quali sono i migliori posti per questo genere di prodotti grazie a Torino o prima cintura, grazie!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1oxtkz4/formaggi_e_altri_prodotti_al_tartufo/"
    },
    {
        "id": "1oxojts",
        "author": "OddMess3542",
        "title": "Pokémon Torino",
        "content": "mi piacerebbe un sacco iniziare a giocare con le carte pokemon ma non ho mai giocato! c’è qualche posto a Torino dove si può andare e ti insegnano? ",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1oxojts/pokémon_torino/"
    },
    {
        "id": "1ox48sg",
        "author": "Few_Willingness_5198",
        "title": "rotoloni! maxi rotoloni! hai rotto il cappero",
        "content": "che fastidio sto tizio che gira col furgone con l'audio sparato un tantinello calabrese, sono le 19:17 e ancora lo devo sentire che spara al massimo i suoi megararissimi prodotti introvabili proprio. c'è lo anche con voi che gli comprate quella robaccia che vende e chissà se vende anche altro già che c'è.\n\ndevi esplodere ",
        "upvotes": 31,
        "comments": 25,
        "media": null,
        "permalink": "/r/torino/comments/1ox48sg/rotoloni_maxi_rotoloni_hai_rotto_il_cappero/"
    },
    {
        "id": "1oxzfi7",
        "author": "Effective_Fact6250",
        "title": "ciaoo, sono un emergente di Torino.",
        "content": "potete ascoltare le ultime 2 tracce da spoty e dirmi cosa ne pensate? graziee🙏🔥",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FXYMjSZcX9UmWVx8DQtmWxIyzeAWn7lNOZ3t3KbefqQ.jpeg?auto=webp&amp;s=6236fe2f13973298b4f16eb07d0ec49d767083a5"
        },
        "permalink": "/r/torino/comments/1oxzfi7/ciaoo_sono_un_emergente_di_torino/"
    },
    {
        "id": "1oxpp2t",
        "author": "Begghi16",
        "title": "RINNOVO PATENTE",
        "content": "Ciao torinesi, devo rinnovare la patente. Mi consigliate il posto dove pagare meno nella zona Torino ovest-Grugliasco-Collegno?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1oxpp2t/rinnovo_patente/"
    },
    {
        "id": "1owsfql",
        "author": "Skizoid666",
        "title": "Che cosa ne pensate?",
        "content": "",
        "upvotes": 77,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mi2oxhpb371g1.jpeg?auto=webp&amp;s=4f44e17c1efaa53b5695af1d923569cb6348e920"
        },
        "permalink": "/r/torino/comments/1owsfql/che_cosa_ne_pensate/"
    },
    {
        "id": "1owtfxj",
        "author": "Bruno_Barbiere",
        "title": "Come sta andando questo NO Meloni Day a Torino?",
        "content": "",
        "upvotes": 50,
        "comments": 109,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y3jtj9ahe71g1.png?auto=webp&amp;s=2791f6bd962b4b743b015d0e9e6e4169c7ce9995"
        },
        "permalink": "/r/torino/comments/1owtfxj/come_sta_andando_questo_no_meloni_day_a_torino/"
    },
    {
        "id": "1oxt179",
        "author": "Overall_Task_2783",
        "title": "Porta palazzo regno del falso",
        "content": "Vi è mai capito di andare a porta palazzo e vedere persone che vendano falso o non solo a porta palazzo anche da altre parti, se sì dove",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1oxt179/porta_palazzo_regno_del_falso/"
    },
    {
        "id": "1ox6zbk",
        "author": "just_a_cricket1",
        "title": "Tricologi a Torino che prescrivono minoxidil orale (Loniten)?",
        "content": "Ciao a tutti, sono M25 e sto iniziando a perdere i capelli, tuttavia essendo all'inizio, posso ancora fare qualcoa. Sto cercando soprattutto nella zona Torino un tricologo che sia disposto a prescrivere il minoxidil orale (Loniten) per l’alopecia androgenetica ovviamente valutando caso per caso.\n\nIl mio attuale tricologo praticamente non lo prescrive mai, è super rigido e spinge solo sul topico (che mi avrebbe detto iniziare), ma per me non non credo sia fattibile: ho un sacco di gatti in casa e ho paura che possano entrare in contatto con il prodotto (è veramente velenoso per loro), e in più viaggio spesso e sto fuori dall’Italia per periodi lunghi, quindi applicarlo ogni giorno sarebbe un delirio.\n\nHo letto su vari blog che alcune farmacie offrono decenti preparazioni galeniche, tipo la Farmacia Parati di Milano, che lo vendono da 2.5 mg e simili, quindi so che la cosa è abbastanza diffusa. Però io vorrei comunque rivolgermi a un tricologo che prescriva in base alla condizione del paziente, non andare alla cieca.\n\nSe qualcuno ha esperienze, nomi affidabili a Torino o consigli su come muovermi, grazie davvero. Chiedo un po’ di comprensione :(",
        "upvotes": 5,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1ox6zbk/tricologi_a_torino_che_prescrivono_minoxidil/"
    },
    {
        "id": "1owq8wp",
        "author": "haltandcatchfirepod",
        "title": "My Love Letter to Torino",
        "content": "I had the opportunity to live in Torino for a short time from 2005-2006. I have the most wonderful memories. I had a chance to go back for the first time this summer, and I made it a point to capture as many of the things I love as I could in a few days. [https://youtu.be/QZ\\_7stVwjtk](https://youtu.be/QZ_7stVwjtk)",
        "upvotes": 7,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3fmwtisie61g1.png?auto=webp&amp;s=d079d8b3da5cbb88585cc8c28b9e70443a36b382"
        },
        "permalink": "/r/torino/comments/1owq8wp/my_love_letter_to_torino/"
    }
]