[
    {
        "id": "1odka33",
        "author": "soccer-stats",
        "title": "Post Match Thread: Real Madrid vs Juventus",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1odka33)",
        "upvotes": 167,
        "comments": 421,
        "media": null,
        "permalink": "/r/realmadrid/comments/1odka33/post_match_thread_real_madrid_vs_juventus/"
    },
    {
        "id": "1oc23pv",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 12,
        "comments": 1587,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oc23pv/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1odkkfm",
        "author": "Ready_Ad_1353",
        "title": "Man of the Match - ARDA GÜLER",
        "content": "",
        "upvotes": 946,
        "comments": 102,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a4y0g7uaaqwf1.jpeg?auto=webp&amp;s=e02aded601d9ea3013490a421b3f948095dffcbb"
        },
        "permalink": "/r/realmadrid/comments/1odkkfm/man_of_the_match_arda_güler/"
    },
    {
        "id": "1odn6dd",
        "author": "SaniaXazel",
        "title": "Arda Güler’s reaction after being told he’s Man of the Match! 😂❤️",
        "content": "",
        "upvotes": 624,
        "comments": 23,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ydxyahbysqwf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1odn6dd/arda_gülers_reaction_after_being_told_hes_man_of/"
    },
    {
        "id": "1odjay5",
        "author": "ReductoHere",
        "title": "Bellingham and Vini link up to score for Madrid",
        "content": "",
        "upvotes": 673,
        "comments": 46,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/cteibwop1qwf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1odjay5/bellingham_and_vini_link_up_to_score_for_madrid/"
    },
    {
        "id": "1odkgz4",
        "author": "No-Independent2522",
        "title": "Thank You Tibo Courtois",
        "content": "",
        "upvotes": 361,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/paj7h8zm9qwf1.jpeg?auto=webp&amp;s=900680045c2a42f766ee93780c6cae4c90f11730"
        },
        "permalink": "/r/realmadrid/comments/1odkgz4/thank_you_tibo_courtois/"
    },
    {
        "id": "1odkim7",
        "author": "Ready_Ad_1353",
        "title": "Courtois's Incredible Save 👏",
        "content": "",
        "upvotes": 161,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/iwvyqrox9qwf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1odkim7/courtoiss_incredible_save/"
    },
    {
        "id": "1od3hgx",
        "author": "No-Independent2522",
        "title": "Santiago Bernabéu Stadium to honor Lucas Vázquez with a tifo (vs Juventus) that reminds of the player when he was a child in the stands.  The tifo is inspired by a photo of Lucas as a child watching a team match.",
        "content": "",
        "upvotes": 1349,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9ttl7q1nsmwf1.jpeg?auto=webp&amp;s=1c5f7632f7c22b4061b4da2d02946fc8874fcc77"
        },
        "permalink": "/r/realmadrid/comments/1od3hgx/santiago_bernabéu_stadium_to_honor_lucas_vázquez/"
    },
    {
        "id": "1odnmpt",
        "author": "No-Independent2522",
        "title": "Lucas Vasquez on Insta 🤍",
        "content": "",
        "upvotes": 102,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/x116g1g8xqwf1.jpeg?auto=webp&amp;s=3cc234fa59dfa40c69b28adc0fea120e3df33fda"
        },
        "permalink": "/r/realmadrid/comments/1odnmpt/lucas_vasquez_on_insta/"
    },
    {
        "id": "1odhfgy",
        "author": "PhysicalOil6003",
        "title": "Gaffer switched sides just before the match?",
        "content": "",
        "upvotes": 206,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wi0rfd85ppwf1.jpeg?auto=webp&amp;s=4ad774ec86474a43b09fe67a5df3244260937d89"
        },
        "permalink": "/r/realmadrid/comments/1odhfgy/gaffer_switched_sides_just_before_the_match/"
    },
    {
        "id": "1odhkyy",
        "author": "No-Independent2522",
        "title": "Tonights tifo to celebrate Cafucas",
        "content": "",
        "upvotes": 185,
        "comments": 12,
        "media": null,
        "permalink": "/r/realmadrid/comments/1odhkyy/tonights_tifo_to_celebrate_cafucas/"
    },
    {
        "id": "1odkl0v",
        "author": "TheFeatherDiaries",
        "title": "Shades of Andres Iniesta",
        "content": "",
        "upvotes": 104,
        "comments": 23,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/c6881bb9aqwf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1odkl0v/shades_of_andres_iniesta/"
    },
    {
        "id": "1odo3r2",
        "author": "PaulAntao",
        "title": "The block by Asencio that helped Save the Game",
        "content": "",
        "upvotes": 66,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/73q5f57z0rwf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1odo3r2/the_block_by_asencio_that_helped_save_the_game/"
    },
    {
        "id": "1odkfgo",
        "author": "Lionel_Kratos_Messi",
        "title": "Arda Güler vs Juventus",
        "content": "Arda Güler vs Juventus (In 74 minutes) \n69/71 Accurate Passes (97% accuracy)\n7 Chances Created \n5 Defensive contributions \n1/1 Dribbling (100% accuracy) \n10 Passes into Final Third \n8.6 FotMob Rating (Highest rating of the match same with Jude)\n6/6 Long Passes (100% accuracy)\n1/1 Aerial Duel won (100% accuracy) \n5/10 Ground Duels Won (50% accuracy)\n96 Touches",
        "upvotes": 103,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wjed8nwc9qwf1.jpeg?auto=webp&amp;s=c0d8b1f2e5cfd4d2eb9344f861a0cff2f6296a84"
        },
        "permalink": "/r/realmadrid/comments/1odkfgo/arda_güler_vs_juventus/"
    },
    {
        "id": "1odflt0",
        "author": "scoreboard-app",
        "title": "Match Thread: Real Madrid vs Juventus Turin Live Score | UEFA Champions League 25/26 | Oct 22, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1odflt0)",
        "upvotes": 161,
        "comments": 3388,
        "media": null,
        "permalink": "/r/realmadrid/comments/1odflt0/match_thread_real_madrid_vs_juventus_turin_live/"
    },
    {
        "id": "1odk2so",
        "author": "Waves_Rondo",
        "title": "On this day 11 years ago - Ronaldo finished off this lovely team goal at Anfield. It was voted Ucl goal of the season",
        "content": "",
        "upvotes": 77,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/d5bt7sxy6qwf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1odk2so/on_this_day_11_years_ago_ronaldo_finished_off/"
    },
    {
        "id": "1odkssd",
        "author": "cyrusmancub",
        "title": "Raul Asencio was substituted because of cramps, and initial tests by Madrid medical staff indicate that he does not have an injury.",
        "content": "",
        "upvotes": 72,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1odkssd/raul_asencio_was_substituted_because_of_cramps/"
    },
    {
        "id": "1odnm1f",
        "author": "No-Independent2522",
        "title": "300 games for Giraffe",
        "content": "",
        "upvotes": 48,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8ihuhh83xqwf1.jpeg?auto=webp&amp;s=b14397fad642cb00bc171b244ea4f3c4f31c3201"
        },
        "permalink": "/r/realmadrid/comments/1odnm1f/300_games_for_giraffe/"
    },
    {
        "id": "1odf0qx",
        "author": "basilkurian247",
        "title": "📋✅ Our Starting 𝗫𝗜 🆚 Juventus",
        "content": "",
        "upvotes": 110,
        "comments": 111,
        "media": null,
        "permalink": "/r/realmadrid/comments/1odf0qx/our_starting_𝗫𝗜_juventus/"
    },
    {
        "id": "1odn5wq",
        "author": "DANKWINGS",
        "title": "Was at the Bernabeu for Madrid Vs Juve... Beautiful Scenes!",
        "content": "",
        "upvotes": 40,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3vovoecitqwf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1odn5wq/was_at_the_bernabeu_for_madrid_vs_juve_beautiful/"
    },
    {
        "id": "1odnlqa",
        "author": "jerdsupreme_",
        "title": "Jude Bellingham vs Juventus [H]",
        "content": "Match winner.   \nJude Bellingham against an Italian team in the UCL is inevitable.  \n***¡Hala Madrid!***",
        "upvotes": 32,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2dh5mg8owqwf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1odnlqa/jude_bellingham_vs_juventus_h/"
    },
    {
        "id": "1od2vwy",
        "author": "vil727",
        "title": "Kylian Mbappé has scored in EVERY game SINCE SEPTEMBER.",
        "content": "",
        "upvotes": 396,
        "comments": 36,
        "media": null,
        "permalink": "/r/realmadrid/comments/1od2vwy/kylian_mbappé_has_scored_in_every_game_since/"
    },
    {
        "id": "1odcwgg",
        "author": "RM-PostMatchSurveys",
        "title": "[Post-Match Survey Results] Real Madrid 1-0 Getafe",
        "content": "",
        "upvotes": 77,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vzfkhbhlvowf1.png?auto=webp&amp;s=fc6d077dfb752b3db463bb69da72f7d03a5933dc"
        },
        "permalink": "/r/realmadrid/comments/1odcwgg/postmatch_survey_results_real_madrid_10_getafe/"
    },
    {
        "id": "1odn4az",
        "author": "saedaguirre9951",
        "title": "Counter right before the final whistle",
        "content": "",
        "upvotes": 21,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/i0n4or49tqwf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1odn4az/counter_right_before_the_final_whistle/"
    },
    {
        "id": "1od6k6h",
        "author": "No-Independent2522",
        "title": "[TheAthletic] Real Madrid’s mentality worries put extra pressure on Xabi Alonso",
        "content": "After Real Madrid’s 5-2 defeat by Atletico Madrid back in September, stern words were shared among the first-team group.\n\nSources who witnessed this, speaking anonymously to protect their position like others consulted for this article, say there was a frank exchange between players, with particular criticism aimed at junior members of the squad over their attitude and application in the build-up.\n\nIt was the first major test of this new squad, and they badly failed it.\n\nSince then, Madrid have managed to get things back on track. They are two points clear of Barcelona in La Liga. They have registered two wins from two in the Champions League so far. But, in truth, they haven’t been significantly tested.\n\nFor that reason there is concern that, as Xabi Alonso’s side enters a difficult run that includes games against Juventus, Barcelona and Liverpool over the next two weeks, issues over leadership and the team’s mentality may surface again, with another mis-step likely to add significant pressure on the manager.\n\nOne club source likened the situation around Alonso right now to a player in danger of receiving a yellow card, with the match only just having started.\n\nTo understand why Madrid have these concerns, we need to look back a little.\n\nBetween 2014 and 2024, Madrid celebrated six Champions League titles, an unprecedented number that leaves their total number of European Cup wins at 15. The closest team to them, Milan, have won it seven times.\n\nMadrid’s squad did not stay the same over that decade, far from it. Key players came and went, managers were hired and fired. But there was still a strong sense of continuity: Toni Kroos and Lucas Vazquez won five of those six titles. Luka Modric, Dani Carvajal and Nacho were there for each one.\n\nCarvajal, 33, is the only of that group still at Madrid today. He is the club’s current longest-serving player, and therefore its captain (as is policy at the Santiago Bernabeu). Thibaut Courtois is the same age but he has not been at Madrid as long — Federico Valverde, 27, is vice-captain.\n\nAfter that Champions League title in 2024, three influential senior players left. Kroos retired. Nacho joined Al Qadsiah in Saudi Arabia. Joselu — who was only at Madrid a year but was still a big voice in the dressing room — left for Al Gharafa in Qatar.\n\nLast summer, two more departed: Modric is now at Milan and Vazquez is with Bayer Leverkusen in Germany.\n\nThe presence of senior players was always an important factor for Carlo Ancelotti during his second spell at the club from 2021 to 2025, a period in which they won the Champions League twice, as well as two La Liga titles and the Spanish Cup.\n\nAt Madrid, there is an unwritten rule that players over the age of 30 are only offered one-season contract extensions, with these proposals often only coming close to the end of the campaign.\n\nWhenever the club asked Ancelotti for his opinion on these renewals, the Italian was always in favour of keeping the veterans. It was a footballing issue first and foremost, but also an environmental one.\n\nTowards the end of the 2023-2024 season, a source involved in the day-to-day running of Real Madrid considered it “essential” that at least one of Modric (who ended up renewing) and Kroos (who decided to retire) stayed. This year, the situation was described in the same way when there were doubts about the continuity of Modric again and it looked like Vazquez might depart.\n\n“If they both leave this is going to be very difficult,” the source said. “It’s not a technical issue, but rather one of atmosphere. If Carvajal is left alone, he’ll explode within a month.”\n\nNeither Modric nor Vazquez were renewed, despite concerns developing over the dressing room atmosphere last term, and that apparent worry over Carvajal.\n\nOver 2024-25, Madrid went from having (according to staff sources at the time) “the best dressing room” in the previous season to one with more ego and friction. The fact the campaign ended without a trophy did not help.\n\nIt got to the point that one first-team player told The Athletic in May: “Let’s see if Xabi dares to enter this madhouse.”\n\nHe did indeed. Alonso’s arrival was seen by Madrid not only as a way to improve the team’s play and results, but also to improve the day-to-day functioning of the dressing room.\n\nSources familiar with the situation say that Alonso found “a dressing room with many bad habits”. The Basque coach has been working on creating a new culture, asking for key elements such as punctuality, and high intensity in training sessions.\n\n“They’ve gone from having a coach who was hardly involved in training sessions (Ancelotti) to one who seems like just another player,” a person close to a first-team player said.\n\nMadrid’s squad still has its senior figures, but there is definitely a sense that they do not possess as many leaders as they once did.\n\nThis summer, along with new manager Alonso came five reinforcements. Academy striker Gonzalo Garcia was promoted to the first team, Dean Huijsen joined from Bournemouth, Trent Alexander-Arnold from Liverpool, Franco Mastantuono from River Plate and Alvaro Carreras from Benfica. The average age of these signings was under 22.\n\nHuijsen, although he started positively, has made several much-commented mistakes in recent weeks. Sources say he has been specifically asked to improve his concentration in order to develop his great potential.\n\nMeanwhile, even though Alexander-Arnold was, at 27, the most experienced of those summer arrivals, he is described around the club as someone who will need more time to adapt, as he still seems shy.\n\nThis term, Kylian Mbappe is one of the players who has stepped up, although he is described more as a leader in matches than on a day-to-day basis, where he does not reach the level of Cristiano Ronaldo’s well-documented ego and hunger.\n\nDespite the noise that has surrounded Valverde in recent weeks, the Uruguayan is noted as a leader through the daily example of his work ethic, while Aurelien Tchouameni, signed in 2022, is also seen as heading in the right direction.\n\nHowever, there are others who need to fill the void left by the departed veterans, such as Jude Bellingham.\n\nAlonso and his staff feel that now is the best time to pull together, to reap the rewards of all their hard work and changes. They point out that they have only made one mistake, against Atletico, but that it caused such a stir that it brought back memories of the heavy defeat by Paris Saint-Germain in the Club World Cup semi-final in July (which Madrid lost 4-0).\n\nAnother mis-step in the big games ahead would call into question the credibility of the project, complicate the run-up to Christmas, and leave Madrid with real pressure to win the Spanish Super Cup in January, where they face Atletico in the semi-finals with Athletic Club and Barcelona to contest the other.\n\nFirst up it’s Juve in the Champions League, followed by the small matter of El Clasico on Sunday.",
        "upvotes": 152,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9kaf07rtvxszAspyx6itip10NDK823Mf6iyHxrziPeE.jpeg?auto=webp&amp;s=b989f23ef2208130aae79a7c810735e2734148b9"
        },
        "permalink": "/r/realmadrid/comments/1od6k6h/theathletic_real_madrids_mentality_worries_put/"
    },
    {
        "id": "1odmnwz",
        "author": "AvazbekAkramov",
        "title": "Real Madrid player ratings vs Juventus today",
        "content": "",
        "upvotes": 15,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p8s1a55ppqwf1.jpeg?auto=webp&amp;s=934929ffb7f15d6cfe2f310ca49119e0d14b4445"
        },
        "permalink": "/r/realmadrid/comments/1odmnwz/real_madrid_player_ratings_vs_juventus_today/"
    },
    {
        "id": "1odjzox",
        "author": "almost_alpha",
        "title": "Carreras never looks tired 🙂",
        "content": "Carreras never looks tired 🙂\n\nJust noticed the game, carreras always looks fresh lol. \nIs it just me ?\n\nAnyone else felt the same ?\n\nAnd Bellingham is always tired haha\nWho other players do your think always look tired or fresh ?\n\nBtw I'm not complaining that the players who look fresh are lazy or anything.\n\n",
        "upvotes": 21,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1odjzox/carreras_never_looks_tired/"
    },
    {
        "id": "1od8psb",
        "author": "FrrancondonaEra",
        "title": "Chema Andrés 1.90 tall age 20, right footed CDM/CM DLP.",
        "content": "intelligent, solid decision making, good passing range, decent first touche, good game  reading and vision, tough psychically, skilled, positioning, can also play DLP. ",
        "upvotes": 75,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/yld9uef61owf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1od8psb/chema_andrés_190_tall_age_20_right_footed_cdmcm/"
    },
    {
        "id": "1od3sis",
        "author": "Plane_Outside5646",
        "title": "Xabi please....Find our strongest 11 ASAP.",
        "content": "Rotations are good. We should do it in league matches. But just find out best 11 ASAP. We have a lot of games coming up.\nIf trent and huijson are fit, I believe this is our best 11. \nAnd just the win elclassico, psg game and atletico game are understandable but we need to trash barca this time after what they did to us last year.",
        "upvotes": 127,
        "comments": 103,
        "media": null,
        "permalink": "/r/realmadrid/comments/1od3sis/xabi_pleasefind_our_strongest_11_asap/"
    },
    {
        "id": "1odk9j9",
        "author": "RM-PostMatchSurveys",
        "title": "[Post-Match Survey] Real Madrid 1-0 Juventus",
        "content": "",
        "upvotes": 14,
        "comments": 8,
        "media": null,
        "permalink": "/r/realmadrid/comments/1odk9j9/postmatch_survey_real_madrid_10_juventus/"
    }
]