[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 497,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iep9ta",
        "author": "johnppd",
        "title": "‘The Sandman’ Canceled at Netflix, Will End With Season 2",
        "content": "",
        "upvotes": 373,
        "comments": 101,
        "media": null,
        "permalink": "/r/netflix/comments/1iep9ta/the_sandman_canceled_at_netflix_will_end_with/"
    },
    {
        "id": "1iefc2y",
        "author": "Robemilak",
        "title": "'Squid Game' Reigns Supreme with Another Week with 4+ Billion Minutes Streamed",
        "content": "",
        "upvotes": 198,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1iefc2y/squid_game_reigns_supreme_with_another_week_with/"
    },
    {
        "id": "1ieubgn",
        "author": "Forsaken_Yoghurt_136",
        "title": "I’m tired. WHERE IS ALL OF US ARE DEAD?",
        "content": "3 grueling YEARS waiting for an update!!! WHERE/ WHO TF DID HAM-RA JUMP TO?!?! IS CHEONG-SAN ALIVE?? IS THERE GOING TO BE ANOTHER OUTBREk?!?! I NEED ANSWERS NETFLIX!!!!!",
        "upvotes": 21,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ieubgn/im_tired_where_is_all_of_us_are_dead/"
    },
    {
        "id": "1ieel7a",
        "author": "Legitimate_Ad3625",
        "title": "\"Anime Is Not Prepared\": 'Devil May Cry' Is Ready to Become Netflix's Next Castlevania",
        "content": "",
        "upvotes": 149,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1ieel7a/anime_is_not_prepared_devil_may_cry_is_ready_to/"
    },
    {
        "id": "1ie72ob",
        "author": "DawgBloo",
        "title": "First look at ‘DEATH BY LIGHTNING’, starring Michael Shannon as President James Garfield and Matthew Macfadyen as the man who would kill him.",
        "content": "Also starring Nick Offerman as Chester Arthur and Betty Gilpin as Lucretia Garfield. \n\nCreated by Mike Makowsky and Executive Produced by David Benioff, D.B. Weiss, and Bernie Caulfield.",
        "upvotes": 203,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ie72ob/first_look_at_death_by_lightning_starring_michael/"
    },
    {
        "id": "1iesvdw",
        "author": "Basis-Resident",
        "title": "Mo S2 Landed Beautifully",
        "content": "Mo’s second season was absolutely beautiful. What did everyone think? They had to do a whole lot with just one season and I think they fit a lot in perfectly but I just want more! I so wish we had more time with these characters and stories. I would have loved more time with Mo’s brother Sameer delving deeper into his autism diagnosis and I also would have loved more depth on Mo’s sister and her relationship with her mother. The trip to Palestine episode was heartbreaking and I could have done a whole season there as well. I really just love this cast and love the writing. Does anyone know how viewership is faring? Does anyone think there’s any chance the show could be extended for a third season? Curious as to what rationale went into renewing for a second and final season from Netflix (unless this decision came from Mo)! ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iesvdw/mo_s2_landed_beautifully/"
    },
    {
        "id": "1ieuui1",
        "author": "molecular_gerbil",
        "title": "Spaceman (Adam Sandler)",
        "content": "What are your thoughts on Spaceman starring Adam Sandler. I found myself getting deep into the movie. I think Adam did a great job portraying Jakub and the story itself was great. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ieuui1/spaceman_adam_sandler/"
    },
    {
        "id": "1ie3d9h",
        "author": "darkestdepeths",
        "title": "Stranger Things 5 creators liken final season to '8 blockbuster movies,' tease franchise future",
        "content": "",
        "upvotes": 103,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1ie3d9h/stranger_things_5_creators_liken_final_season_to/"
    },
    {
        "id": "1ieqirg",
        "author": "Juris_B",
        "title": "There got to be someone from Netflix lurking here - for the love of sake, please stop matching subtitle onscreen time to foreign language audio time! Some words in english needs more time to read, than to hear it in native language",
        "content": "It seems like Netflix has decided to only show the phrase of subtitles as long as the original other language takes time to pronounce it. While the advantage is that its clear who is saying the subtitled bit, it often is impossible to read as fast as it goes in native language. And I have to pause and try to catch every bit. Its like a reaction game of phone or something :D",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ieqirg/there_got_to_be_someone_from_netflix_lurking_here/"
    },
    {
        "id": "1ieqcoy",
        "author": "RRexzi",
        "title": "Scariest movie you watched?",
        "content": "Hi! Last time i started watching a lot of scary movies. I watched: \"Ritual\" \"Apostole\" \"Creep 2\" \"Incantation\" and few others. I really recommend Ritual it was suspenseful and scary. I want to watch more movies but i dont know what to watch.  So can u comment some scary movies? I will appreciate it. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ieqcoy/scariest_movie_you_watched/"
    },
    {
        "id": "1ieu79e",
        "author": "pupsandqueers",
        "title": "Dumbest/Funniest Movies on Netflix in the US",
        "content": "Trying to have a movie night with a friend and we wanna watch something dumb, but the kind of dumb you can make fun of. We’ve had plans to watch Hot Frosty, but it’s well after Christmas now (still not opposed to it, though). Are there any others in that same vein that aren’t Christmas movies?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ieu79e/dumbestfunniest_movies_on_netflix_in_the_us/"
    },
    {
        "id": "1ieu4tz",
        "author": "SoundFunny",
        "title": "Video Playback issues",
        "content": "Anyone else recently having issues with video playback on netflix. All of a sudden it will just freeze on a frame and no amount of restarting my tv fixes it. And then all of a sudden it works again. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ieu4tz/video_playback_issues/"
    },
    {
        "id": "1iet7gi",
        "author": "YeatSupremacy",
        "title": "Who would win in a fight?",
        "content": "This just popped up in my head and I wonder if someone else posted this question in this subreddit but who do you think loses between John B from outer banks or Steve from stranger things? I don’t know but there is this thing where they legitimately lose every single fight they have and they always need to be saved 😭 like Steve lost against Billy and needed to be saved by max and then John B in the recent season couldn’t even protect Sarah while she was pregnant and she had to save him lol",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iet7gi/who_would_win_in_a_fight/"
    },
    {
        "id": "1ie6oif",
        "author": "messengers1",
        "title": "Netflix 2025 Series Slate: New Seasons Of ‘Stranger Things,’ ‘Wednesday,’ ‘Squid Game,’ ‘Black Mirror’",
        "content": "",
        "upvotes": 34,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1ie6oif/netflix_2025_series_slate_new_seasons_of_stranger/"
    },
    {
        "id": "1iedgkh",
        "author": "reenzy",
        "title": "What’s your thoughts on Mo season 2?? (without spoiling)",
        "content": "I love it, I binge watched 5 episodes today lol. I found the plot lines/plot twists more wild than the ones in S1 which was a big part of why I got hooked. \n\nI really enjoy watching the show overall since it gets pretty deep, is hella funny, and v relatable since I’m Palestinian American. ",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iedgkh/whats_your_thoughts_on_mo_season_2_without/"
    },
    {
        "id": "1iefe93",
        "author": "S4v1r1enCh0r4k",
        "title": "Stefano Sollima’s Netflix Series The Monster of Florence just got a new teaser",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iefe93/stefano_sollimas_netflix_series_the_monster_of/"
    },
    {
        "id": "1ieqfh6",
        "author": "DeniseDoos",
        "title": "Terrace house",
        "content": "Does anyone know what happened to Terrace house?  \nThe Japanese series was closed down in 2020 because of the corona pandemic and I haven't heard from it since  \nWill it ever return on Netflix?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ieqfh6/terrace_house/"
    },
    {
        "id": "1iepupr",
        "author": "ImpactOtherwise6723",
        "title": "Yellowstone",
        "content": "I’m in the UK and Yellowstone seasons 1-4 released yesterday. How likely is it that season 5 will be available to watch on Netflix sometime in the future? I’m not for paying another subscription to watch the last season. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iepupr/yellowstone/"
    },
    {
        "id": "1ieov6z",
        "author": "aeryghal",
        "title": "The Recruit - Season 2",
        "content": "I don't want to get into details in order to avoid spoilers, but I absolutely loved it.  I was wary after what a disappointment S2 of Night Agent was, but S2 of The Recruit delivered.  It got a bit ridiculous at the end, but it was fun. Definitely worth a watch if you enjoyed S1.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ieov6z/the_recruit_season_2/"
    },
    {
        "id": "1ieedwo",
        "author": "LauraEats",
        "title": "Jazwares partners with Netflix's Stranger Things to launch all-new toy line",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ieedwo/jazwares_partners_with_netflixs_stranger_things/"
    },
    {
        "id": "1idl7ff",
        "author": "S4v1r1enCh0r4k",
        "title": "Leslye Headland known for 'The Russian Doll' and 'The Acolyte' reveals she is no longer directing Netflix's adaptation of 'The Seven Husbands of Evelyn Hugo'",
        "content": "",
        "upvotes": 329,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1idl7ff/leslye_headland_known_for_the_russian_doll_and/"
    },
    {
        "id": "1iema4q",
        "author": "infinit187K",
        "title": "Netflix not loading certain shows on Roku and Mobile but not online",
        "content": "I have been having problems wioth netflix for about a week now where there are a few shows that are not showing up on my roku or mobile app (eg. 6 underground, How I met your mother, a bunch of other seemingly random shows/media) but are loading on the website when I use my computer. It is all connected to the same wifi with no other connections and I redownloaded netflix a couple times to no avail. Anyone ever have this problem before?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iema4q/netflix_not_loading_certain_shows_on_roku_and/"
    },
    {
        "id": "1idywo9",
        "author": "DisastrousOpening477",
        "title": "Night Agent S02 has countless useless characters, horrendous writing and terrible acting",
        "content": "Honestly Rose just take the cake. Not only is the character useless but it jeopardize the whole plot, and the actress is so unbelievably bad it looks like some high school project when she's on screen. ",
        "upvotes": 43,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1idywo9/night_agent_s02_has_countless_useless_characters/"
    },
    {
        "id": "1ielkku",
        "author": "Cool-Doughnut2723",
        "title": "Holly Hobbie season 4 &amp; 5?",
        "content": "I'm having a really hard time finding seasons 4 and 5 of the Holly Hobbie series. I've looked on Netflix, of course, but it's not showing up there. I've also tried searching online retailers like Amazon Prime Video and iTunes, but no luck. Does anyone know if these seasons were ever actually produced and released? If so, where can I find them? I'm a huge fan of the show and I'm really disappointed that I can't seem to locate these missing seasons. Any help or information anyone could provide would be greatly appreciated! I'm starting to wonder if they were perhaps released in a different region or if there's some other reason they're so difficult to find. Perhaps they're only available on DVD? If anyone has any leads, please let me know! I'm desperate to finish the series!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ielkku/holly_hobbie_season_4_5/"
    },
    {
        "id": "1ielar6",
        "author": "mystikallyspiralling",
        "title": "Downloaded a show to watch while traveling...",
        "content": "Netflix detected I left the country, deleted the downloads, and also removed the show from my view. Like doesn't come up to search or anything. Had I opened the app with no signal it would have worked. I didn't know I needed to hide where I was...",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ielar6/downloaded_a_show_to_watch_while_traveling/"
    },
    {
        "id": "1iekt3y",
        "author": "davey-jones420",
        "title": "ISO non-English show from 2018-2019. Love triangle with a girl named Faraday?",
        "content": "More context: It is a period familial drama starring actors that seemed Middle Eastern or Indian. In the first episode Faraday receives a letter from a man, believing it to be from the man she is interested in. It is actually from the other man, he may be a foreigner? Or white? The man she is interested in may be a family friend or cousin or something, and her family is urging her to get married. One of the men might have a mustache. It was on Netflix around 2018-2019.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iekt3y/iso_nonenglish_show_from_20182019_love_triangle/"
    },
    {
        "id": "1iekjhz",
        "author": "Illustrious_Judge409",
        "title": "Netflix Extra Member Error - \"That email address is already in use. Please try another email address ormanage your extra member.\"",
        "content": "Perhaps some of you can help me. I've subsribed to have an extra member so my Dad's account can come onto my ad-free account. He cancelled his Netflix and it ended yesterday (30/01). \n\nNow when I try to send him the invite I get the below error message: -\n\n *\"That email address is already in use. Please try another email address ormanage your extra member.\"*\n\nIs there a reason I can't add him? He doesn't have paid sub. It's insane to me that a company as rich as Netflix is offering a paid piece of functionality that doesn't work.\n\nThanks in advance for any advice that can be provided.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iekjhz/netflix_extra_member_error_that_email_address_is/"
    },
    {
        "id": "1idtp22",
        "author": "nerdist",
        "title": "One Piece Season 2 Seemingly Confirmed for 2026",
        "content": "",
        "upvotes": 47,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1idtp22/one_piece_season_2_seemingly_confirmed_for_2026/"
    },
    {
        "id": "1iefdsg",
        "author": "Robemilak",
        "title": "Shane Gillis’ Netflix Series ‘Tires’ Casts Vince Vaughn and More Season 2 Guest Stars",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iefdsg/shane_gillis_netflix_series_tires_casts_vince/"
    },
    {
        "id": "1ie9lvg",
        "author": "30Thirty30",
        "title": "Can I add an extra member to my account for my mate and his housemate?",
        "content": "I've been sharing my netflix with my mate who lives in a different house and it's reached the point where netflix has caught on. I'm on the netflix with ads plan, but if i upgrade and add an extra member, will he be able to access it and have his housmate access it also? Financially we can afford to split the cost of standard but my mate can't afford the extra cost of adding an extra member unless we can split the cost of the plan 3ways and he splits the extra member cost with his housemate",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ie9lvg/can_i_add_an_extra_member_to_my_account_for_my/"
    }
]