[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 164,
        "comments": 572,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1n43e24",
        "author": "Interesting_Slide554",
        "title": "Unknown number The high school catfish",
        "content": "Brooooo when Kendra says “ i know a lot of us made mistakes and broke the law but didnt get caught”, BYE, this is not a mistake this is a deliberate decision that she made over and over. This wasnt a OOPSIE moment. And no Kendra, we have not all broke the law but got away with it, and certainly not to this level. Please, the rationalization of it all. People try to logically rationalize their actions as if it makes them understandable. Girl, Hitler had his reasons too, and was very convincing in his rationale, he still was a monster. That woman gives me chills. I have strong reasons to believe her daughter will cut her off way later in life, when she is going to become more aware. At the moment, she’s too young to fully process it and have perspective. She’s in a bubble. She clearly doesnt seem to fully understand.",
        "upvotes": 36,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1n43e24/unknown_number_the_high_school_catfish/"
    },
    {
        "id": "1n3oyim",
        "author": "AnotherDarnDay",
        "title": "Unknown Number High-school Catfish",
        "content": "What the hell did I just watch? And what the hell was this person thinking?\n\nI'm in shock that someone would do such a thing to their own child. And that she doesn't seem to have any focus on what she actually did. \n\nThe daughter didn't seem to grasp what her mother did when they told her but the father acted on it right away. \n\nWas she totally jealous of her own daughter? ",
        "upvotes": 386,
        "comments": 533,
        "media": null,
        "permalink": "/r/netflix/comments/1n3oyim/unknown_number_highschool_catfish/"
    },
    {
        "id": "1n3og0r",
        "author": "Ok-You-5930",
        "title": "Unknown Number: What mental illness does Catfish Mom, Kendra Licari have? I have questions..",
        "content": "SPOILER ALERT: first, I’m really curious as to what mental illness Kendra Licari has. I have several family members with severe mental illness but I can’t figure this out… \n\nIt was so disturbing to learn what she did to her innocent daughter and her friends. But she was also obsessed with the boyfriend! And then we learn that she lied about having a job! And then we hear her skirt accountability blaming it on her trauma, and then we see how manipulative she is at every level. Like… I have questions. Weigh in on any:\n\n1. WTF did we just watch?\n2. What mentally illness do you think she has? And what makes you think that?\n3. Why was she fired?? We need a follow up on this. Sounds like Casey Anthony at Universal Studios..\n4. We’re all in agreement that she was obsessed with Owen right? \n5. HOW DID THIS PSYCHOPATH GET FREE IN 18 MONTHS?",
        "upvotes": 223,
        "comments": 442,
        "media": null,
        "permalink": "/r/netflix/comments/1n3og0r/unknown_number_what_mental_illness_does_catfish/"
    },
    {
        "id": "1n38enm",
        "author": "ADMlN-",
        "title": "What \"Unknown Number: The Highschool Catfish\" totally downplayed...",
        "content": "**Why did Kendra go after Owen's** ***new*** **girlfriend, a full year after he and Lauryn broke up?**\n\nThat isolated single detail proves this had absolutely nothing to do with protecting her daughter and everything to do with her own predatory obsession with Owen. Owen's mom tried to point it out, but they barely gave her a voice.\n\nIt feels like the real story was \"Predatory Mom Coach\" but decided \"Highschool Catfish Story\" was way more marketable. It's like they are deliberately downplaying the darkest part of this story and perpetuating Kendra's misdirection/manipulation.",
        "upvotes": 995,
        "comments": 1087,
        "media": null,
        "permalink": "/r/netflix/comments/1n38enm/what_unknown_number_the_highschool_catfish/"
    },
    {
        "id": "1n3z8co",
        "author": "Personal_Strength_44",
        "title": "Thursday murder club!!",
        "content": "Sooo good sooo wholesome!! Loved the characters and cant wait to see other richard’s book turn into movies! What do you think ? Especially people who have read the book as well??",
        "upvotes": 17,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1n3z8co/thursday_murder_club/"
    },
    {
        "id": "1n3qylt",
        "author": "jcals17",
        "title": "Unknown Number: The High School Catfish",
        "content": "This story was insane, that was the last thing I expected. Rant incoming…\n\n\nIt really bothers me that her daughter Lauryn still had a relationship with her &amp; even a close one. \n\nShe didn’t just cyber bully her, she said disgusting things. She literally told her to OFF HERSELF. She broke up her daughter’s first relationship, she listened to her daughter cry, beg for it to stop, &amp; still did it. That’s sick, that’s not “that wasn’t me” “i dont know what i was doing”. She harassed her for almost TWO YEARS. You being assaulted does not excuse you to harass your daughter, it doesn’t even correlate. &amp; then to do it for almost 2 years. \n\nNot to mention her obsession with Owen, that’s disgusting &amp; predatory. She could have just called her daughter ugly, annoying blah blah but she said vulgar things about him. THATS WEIRD. I know this whole thing is weird but it’s even weirder that she was obsessed with him. \n\nI personally would never talk to my mother again. &amp; my mom is by best friend. You told me to off myself everyday multiple times a day. Then said “well I knew she wouldn’t do it”, I could never trust her again. \n\nLet me know your thoughts.",
        "upvotes": 63,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1n3qylt/unknown_number_the_high_school_catfish/"
    },
    {
        "id": "1n3w464",
        "author": "Cultural-Chart3023",
        "title": "Rewatching unknown number to see what I missed",
        "content": "1:23 from the very start the first red flag \"I just told her to ignore them\" what? The first time I watched it I did say wtf but let it go. Now I'm watching it again and already realise  that alone is weird af everyone else is taking it so seriously and worried about her and mums all \"oh well\".. \n\nThe signs were definitely there! ",
        "upvotes": 22,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1n3w464/rewatching_unknown_number_to_see_what_i_missed/"
    },
    {
        "id": "1n42bwu",
        "author": "ciscnzhnrq",
        "title": "Katrina - Come Hell or High Water",
        "content": "This documentary produced by Spike Lee was very informative and really well done. What a complete tragedy to the people and community. Everyone needs to watch this. ",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1n42bwu/katrina_come_hell_or_high_water/"
    },
    {
        "id": "1n46g5m",
        "author": "ohmyhellions",
        "title": "Unknown number unpopular opinions",
        "content": "Reading the comments here, most people agree Kendra is a psychopath and pedophile, which: yes absolutely. And yes I think she needs to be locked away for a much longer time (and studied).  But there are some other takes I had that I don’t see reflected. What do you think, and what unpopular opinions do you have? Please share:\n\n1. Yes, obviously Kendra was fixated on Owen, even when he was still a little prepubescent boy (sick). And she was jealous of Lauryn for being with him. That’s all the comments I’ve read. But I believe it went much deeper than that. She was also deeply jealous that her daughter was growing into a pretty teenager who had her whole life ahead of her and hadn’t fucked up her marriage, finances and life like Kendra had. Owen was the target of her fixation but It wasn’t only about Owen. There’s a lot more going on. \n\n2. I’m sorry but Owen’s parents/mother are not the heroes people are making them out to be. Why in the free world would they not take the kid’s phone away? He was being harassed into a place of suicidal ideation. They are terrible parents for letting him just deal with it. \n\n3. Lauryn’s dad was an incompetent father. I believe Kendra is a master manipulator but what the hell must he have been doing to not see signs that something was terribly wrong? I think he was having affairs/a double life or at the very least was willfully burying his head in the sand. What do you mean you trusted your wife to handle your daughter’s severe sexual harassment and abuse? You didn’t think you should help? You didn’t think the situation warranted all hands on deck? Where the hell were you? And all he could say about Lauryn now is that she’s “growing” and will be a “beautiful woman.”  Something is also off with him. \n\n4. Lauryn never had close friends and was always quiet and withdrawn, per all her peers. Owen said she was trying to isolate him from his friends so it was just “the two of us”. As far as we saw, Kendra was her primary parent, with barely any paternal involvement. Kendra’s sociopathic ways are normal to Lauryn because it’s all she knows. I hope she gets a lifetime of therapy. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n46g5m/unknown_number_unpopular_opinions/"
    },
    {
        "id": "1n3ajz4",
        "author": "unfiltered_12345",
        "title": "Need a thriller series to binge watch on Netflix",
        "content": "In desperate need of new series to watch, can't seem to stick to anything \nSo need a series that is dark, mysterious and very thrilling to watch.\nA series I cam binge watch in a day or over a few weeks.",
        "upvotes": 363,
        "comments": 563,
        "media": null,
        "permalink": "/r/netflix/comments/1n3ajz4/need_a_thriller_series_to_binge_watch_on_netflix/"
    },
    {
        "id": "1n3vn8g",
        "author": "689Dementia",
        "title": "The person guilty in Unknown Player: The High School Catfish had plenty of time in prison to craft their pathetic narrative",
        "content": "had all the time in the world to think, to manipulate their version of events, and presenting the story as a victim. So Gross.. Real people were traumatized. And now that person is using that pathetic narrative to gain empathy and attention??? wow",
        "upvotes": 11,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1n3vn8g/the_person_guilty_in_unknown_player_the_high/"
    },
    {
        "id": "1n40ro4",
        "author": "BigEstablishment5671",
        "title": "Is there any way to get a screenshot of a scene?",
        "content": "I'm an artist. Sometimes when I'm watching shows or movies, I find a scene where there is an interesting pose or lighting scenario that I'd like to draw or use as reference.\n\nI've noticed that whenever you screenshot while watching a show, the screenshot is just blacked out. I assume this is for some copyright reason to prevent people from stealing the content.\n\nIs there a way I can screenshot or save a specific frame?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n40ro4/is_there_any_way_to_get_a_screenshot_of_a_scene/"
    },
    {
        "id": "1n3yc7f",
        "author": "FuckMeDaddyFrank",
        "title": "The Household shit is so infuriating",
        "content": "Was just trying to watch Netflix AT HOME on my account. My mother and I both use this account, we live together but we both travel a lot. Now I'm unable to watch on my own account at home because it's not part of this household?\nIt's also not giving me the option to change this setting anywhere.\n\nLogged in now to my account through the code and it's not giving me the option to adjust my household even?\n\n\nUpdate: I contacted support and they told me to use the temporary code and that after 14 days all devices will be seen as trusted?\n\nI did mention that it's separate locations but me and my mother are still the ones using this account. I don't use a Smart TV at home tho so that's why I can't set this place as my temporary location.",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1n3yc7f/the_household_shit_is_so_infuriating/"
    },
    {
        "id": "1n41wvk",
        "author": "UniversalInquirer",
        "title": "Any docs (anywhere not just Netflix) like American Conspiracy: The Octopus Murders?",
        "content": "Basic post but I saw this a few months ago, and boy did I love it. Always been a sucker for gov't or just big conspiracy style docs and films, but of course, they're usually laughable in how utterly bonkers they are. This felt like, regardless of how much you agree or not, there was really something going on here. \n\nAny other docs out there exploring big, believable gov't/institutional/generally big conspiracies in a grounded, worthwhile, and believable way? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n41wvk/any_docs_anywhere_not_just_netflix_like_american/"
    },
    {
        "id": "1n46k2t",
        "author": "Money-Income8532",
        "title": "Will it go or stay?",
        "content": "Does anyone happen to know if the original Avatar The Last Airbender is being removed from UK Netflix? I'm pretty sure it was removed from Dutch and American Netflix but I don't know if it's leaving the UK version too. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n46k2t/will_it_go_or_stay/"
    },
    {
        "id": "1n46hsj",
        "author": "tgoodchild",
        "title": "Poor picture quality (wired gigabit with Roku)",
        "content": "I have gigabit fiber and a wired connection between my Roku and my switch, and a 1080p TV, and the standard 1080p plan.\n\nThe last couple of times I watched a movie on Netflix the picture quality was terrible. Last night I watched Jurassic Park and several scenes looked like there was sand on the screen. This was not film grain.  These were stationary light colored dots in a general banding pattern, especially in the darker areas of the picture.  It was different from the compression artifacts you see in dark scenes where you see banding between two shades of dark gray, often in a night sky.  These were brightly colored points, like white sand.\n\nIt happened the other day too but I don't remember what movie I was watching. At the time I thought it was a fluke. \n\n For comparison, I binged The White Lotus on HBO Max the night before for several hours and never once saw anything like this.   ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n46hsj/poor_picture_quality_wired_gigabit_with_roku/"
    },
    {
        "id": "1n4642r",
        "author": "Kaustabh2000",
        "title": "Help Needed",
        "content": "https://preview.redd.it/7hif4jd9p6mf1.png?width=1727&amp;format=png&amp;auto=webp&amp;s=9d550b9bfc58147b20adbd2793779628e57713d0\n\nMy Netflix windows 11 app is not able to display anything. the functionalities are hidden behind this veil which appears whenever i try to open the app. i have tried resetting it, restarting the computer, updating my graphic drivers to no help. kindly somebody help me with this issue",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n4642r/help_needed/"
    },
    {
        "id": "1n45upv",
        "author": "regrender_my_chorf",
        "title": "Netflix auto-playing when I open the app??",
        "content": "I haven’t used the app in a while and was going to watch something and the second I opened the app, an ad starts playing and then the opening song of some anime starts? I hadn’t even selected a show. I closed it out a couple times and reopened it but it keeps happening?? \n\nCan you not just browse in silence anymore?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n45upv/netflix_autoplaying_when_i_open_the_app/"
    },
    {
        "id": "1n44iq2",
        "author": "CallMehAl_x",
        "title": "What happened to the PC games on netflix that were on beta? (not on website anymore for me)",
        "content": "I was playing games on pc but now i cant seem to find the pc games area anymore? (for reference i was playing cozy grove: camp spirit) They were on beta but im wondering why i cant find them anymore. I tried checking the games menu but it only showed me mobile games now. Does anyone know why?? I wanna play cozy grove so bad 😭💔 thank you any help is appreciated",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n44iq2/what_happened_to_the_pc_games_on_netflix_that/"
    },
    {
        "id": "1n426d8",
        "author": "Special_Country228",
        "title": "My Life With The Walter Boys SEASON 2 SOUNDTRACK",
        "content": "Hi All, I made a playlist with every song from the 2nd season, following the order of the episodes.[https://open.spotify.com/playlist/5bS3Df0J5zKofhHkVUK2yF?si=08b11f588e8c44c5](https://open.spotify.com/playlist/5bS3Df0J5zKofhHkVUK2yF?si=08b11f588e8c44c5)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n426d8/my_life_with_the_walter_boys_season_2_soundtrack/"
    },
    {
        "id": "1n3mm53",
        "author": "L0v3_1s_War",
        "title": "“Golden” by HUNTR/X: EJAE, Audrey Nuna &amp; REI AMI is nominated for Song of the Summer at the 2025 MTV VMAs",
        "content": "",
        "upvotes": 13,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n3mm53/golden_by_huntrx_ejae_audrey_nuna_rei_ami_is/"
    },
    {
        "id": "1n3505s",
        "author": "Mysterious-Hold-2",
        "title": "Thumbs down to the new Netflix layout",
        "content": "I have let it sit for moment, given it a fair go, but I really don't like the new layout. It makes it harder to scroll through shows period.\n\nDo you need a TV the size of the Titanic wooden plank that saved Rose just to make it usable?",
        "upvotes": 93,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1n3505s/thumbs_down_to_the_new_netflix_layout/"
    },
    {
        "id": "1n3a20t",
        "author": "exhaustedlittlething",
        "title": "Totally enjoyed The Thursday Murder Club movie. Any similar recommendations?",
        "content": "I just watched The Thursday Murder Club and loved it! Now I’m in the mood for more cozy-but-smart mystery stories. Do you have any suggestions for movies or series with a similar vibe (lighthearted mystery, witty characters, not too dark)? Doesn’t have to be on Netflix… open to any platform. Thank you! ",
        "upvotes": 45,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1n3a20t/totally_enjoyed_the_thursday_murder_club_movie/"
    },
    {
        "id": "1n3sznu",
        "author": "Math-Therapy",
        "title": "Old Guard 1 and 2",
        "content": "This storyline is really unusual and very fresh concept. Like I’m truly sold to the story as much as I was sold to Harry Potter.\n\nThe story writer and director have done a pretty good job. It’s a complex concept which they are trying to sell. It’s also a very American concept. I think creators should try and promote harder. \n\nI started with part 2 and then came back to watch part 1. It’s kinda funny because my first Harry Potter movies was also Chambers of secrets and then the Sorcerer’s stone. \n\nBut I genuinely hope there’s a part 3. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n3sznu/old_guard_1_and_2/"
    },
    {
        "id": "1n3ut2s",
        "author": "RiderOfRohan_SQ",
        "title": "Living in two places and having one Netflix account?",
        "content": "I move states about twice a week (once to my work place for 3 days and then back), but not that regularly in holiday season and when I‘m jammed with work. So wherever I live I would love to have a Netflix account (even if just on mobile). But because of the forbidden account sharing and Netflix thinking I am some user from another household, my log in on my phone and other devices got blocked since I couldn’t log in in my home wifi in the required time period. \nAny advice what I could do?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1n3ut2s/living_in_two_places_and_having_one_netflix/"
    },
    {
        "id": "1n3uell",
        "author": "stfujavii",
        "title": "Other types of dramas?",
        "content": "You watched three Korean dramas back to back, and now Netflix keeps recommending Korean dramas nonstop. I prefer period pieces and have probably seen everything Netflix offers in that genre. Any recommendations?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1n3uell/other_types_of_dramas/"
    },
    {
        "id": "1n3u9oh",
        "author": "oak212",
        "title": "bonus family netflix",
        "content": "I am in the middle of season 4 and am enjoying Bonus Family very much.  So much happens in each episode that it is mind boggling.  Someone is always arguing with someone else, almost everyone is very opinionated and most are selfish. Clear communication with both of each child’s parents is often problematic.  It is a chaotic lifestyle.\n\nI am curious if others find the married therapist couple helpful or not.  It seems like the writers are mocking them and their therapeutic techniques.  With such a large family, I see the therapists seeing years of therapy costing their clients thousands of Kronor.  When Patrik had the serious incident in school and was distraught, he broke protocol and arrived at the therapists’ home without an appointment.  She was annoyed and couldn’t make an appointment sooner than his next scheduled appointment, which I found cold and insensitive.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n3u9oh/bonus_family_netflix/"
    },
    {
        "id": "1n3rsns",
        "author": "ishtar_888",
        "title": "No Spoilers Please - Echos 2022 Netflix twisty thriller where Michelle Monagan plays twins",
        "content": "Finally watching 2022 Netflix twisty thriller where Michelle Monagan plays twins Leni &amp; Gina and you never know who's who. 🤪 Soooo good. I don't think I'm biased because she's one of my favorite actors lol\n\nNot gonna do spoiler and give any of the plots away and ask please that no one else do. \n\nAlso has Matt Bomer as Jack, Daniel Sunjata as Charlie, Jonathan Tucker as Dylan James and Karen Robinson as Sheriff Louise Floss.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1n3rsns/no_spoilers_please_echos_2022_netflix_twisty/"
    },
    {
        "id": "1n3d3ti",
        "author": "Euphoric_Breakfast79",
        "title": "Netflix Announces Alice in Borderland Season 3 for September 25 Premiere",
        "content": "",
        "upvotes": 23,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1n3d3ti/netflix_announces_alice_in_borderland_season_3/"
    },
    {
        "id": "1n3d4l8",
        "author": "mekha-0608-matcha",
        "title": "Please recommend me some Netflix series with love in there",
        "content": "I ned some drama in my life\nSo i watched emily in paris, spinning out, ginny&amp;georgia, xo kitty, bridgerton, never have i ever, my life with the walter boys, nobody wants this and I don’t remember what else",
        "upvotes": 18,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1n3d4l8/please_recommend_me_some_netflix_series_with_love/"
    }
]