[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 497,
        "comments": 261,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iryv1b",
        "author": "Turtleballoon123",
        "title": "Started Baby Reindeer. It's brtutal and depressing yet compelling.",
        "content": "I don't know what to make of the show. It's brilliant, yet also brutal and depressing. Episode 4 is heart-wrenching. I've seen discussions from survivors who say the show can be triggering or who had to switch it off. I really feel for the series creator who based this off a story. It's so fucked up.",
        "upvotes": 25,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iryv1b/started_baby_reindeer_its_brtutal_and_depressing/"
    },
    {
        "id": "1irzxha",
        "author": "yercoolmarple",
        "title": "The character Rose in The Night Agent is insufferable at this point.",
        "content": "I just have to get this off my chest, even at the risk of getting massively downvoted, this character is so poorly written. She changes her mind ten times in a single episode and is excessively annoying. The story itself is dull and weak overall with no character developments, but I could live with that if it weren’t for ***this*** one character being forcefully inserted into every situation. It made sense in Season 1 since the story revolved around her, but in Season 2? Even FBI agents are unaware of Night Action, yet somehow, this civilian is deeply involved in everything??seriously? If the writers were so intent on keeping her relevant, why not just hire her as a tech? Instead, they throw a civilian into the field like it’s nothing. To top it all off, the actor really cannot act. It was really difficult to finish season 2. I am not even getting to the other issues like poor writting, countlessly irritating character arcs.. S1 was not the greatest but it felt like this had some promise going forward and boy, oh boy, was I wrong.",
        "upvotes": 20,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1irzxha/the_character_rose_in_the_night_agent_is/"
    },
    {
        "id": "1iruqoh",
        "author": "BlissfulEmilia",
        "title": "What's your all-time favorite Netflix original series?",
        "content": "I’ve been on the hunt for new Netflix originals to binge, and I wanted to know: what’s your all-time favorite Netflix original series? Whether it’s a drama, comedy, or documentary, I’m looking for recommendations that are must-watches. Bonus points if it’s something that really flew under the radar but ended up being amazing.",
        "upvotes": 34,
        "comments": 144,
        "media": null,
        "permalink": "/r/netflix/comments/1iruqoh/whats_your_alltime_favorite_netflix_original/"
    },
    {
        "id": "1irh528",
        "author": "mmprobablymakingitup",
        "title": "What’s a show you randomly started watching on Netflix and ended up loving?",
        "content": "I started Blacklist on a whim, not expecting much, but it completely pulled me in. Whether it was the story, characters, or just the overall vibe, I ended up binge-watching the whole thing.\n\n",
        "upvotes": 212,
        "comments": 604,
        "media": null,
        "permalink": "/r/netflix/comments/1irh528/whats_a_show_you_randomly_started_watching_on/"
    },
    {
        "id": "1irgsx6",
        "author": "Worldpeacee007",
        "title": "Official Discussion - American Murder: Gabby Petito",
        "content": "Crazy to think we are now in the era of tik Tok murder docs. Seeing victims document much of their lives in 4k adds a whole other heartbreaking element to these kinds of series and stories. I am only one episode in, but I thought this would be an interesting place to discuss the series.\n\nEdit: I have finished the series and I can say I went through pretty much every emotion while watching this-mostly anger and sadness. Gabby was such a beautiful soul. Feels like we all know someone like her.\n\n It's truly a shame so many people find themselves stuck in relationships with manipulative abusers. It was like Gabby couldn't wrap her mind around leaving him. Even in her final text message, she tells her mom that they aren't breaking up. It's almost like some people feel like if they break up with their partner, they consider *themselves* a failure. Just a really sad and devastating story. Watching the vlog outtakes of them made me so uncomfortable. It makes you think about how the internet is truly a facade.",
        "upvotes": 139,
        "comments": 420,
        "media": null,
        "permalink": "/r/netflix/comments/1irgsx6/official_discussion_american_murder_gabby_petito/"
    },
    {
        "id": "1irmoed",
        "author": "quietdepths",
        "title": "American Murder : Gabby Petito Netflix",
        "content": "I just finished watching the Netflix series about this and omg how sad and shocking. These documentaries really put me off relationships these days and make me so skeptical about how people truly are and just what we see online. \n\nIt’s very true that sometimes the people that seem the happiest online are often the saddest sometimes and with the most skeletons. I personally know many couples who would constantly post how in love they are and suddenly the very next day decide to divorce. And others who never post about one another but live a very happy and quiet life.\n\nAnyway this whole case was so sad and she seemed like such a bright and bubbly girl. One thing though, I need the caveat before I say it is that I’m not blaming her parents but just I know if it were me in that situation and I had said those things to my parents about him they absolutely would expect me to come back to them and would not be happy about me continuing. I know everyone has different parenting styles but me coming from an Asian family - they wouldn’t be ok with some of the things the parents already knew.\n\nThat guy seemed really creepy but it’s the kind of creepy that isn’t obvious which makes it more scary and I do wonder just how involved their parents were. None of this matters anymore I guess, sadly she’s dead and I just hope everyone (men and women) are all careful of the kind of people they get involved with. It’s a scary world out there and relationships don’t seem to be what they were. Not saying everyone is a killer, just that…. I think it’s really hard these days ",
        "upvotes": 43,
        "comments": 78,
        "media": null,
        "permalink": "/r/netflix/comments/1irmoed/american_murder_gabby_petito_netflix/"
    },
    {
        "id": "1irnhth",
        "author": "TheTabOfficial",
        "title": "What's a Netflix show that you're glad you stuck with?",
        "content": "Sometimes you've really got to trust the process to understand why everyone is raving about a show, because the first episode or two might not hook you straight away. Which show or shows surprised you?",
        "upvotes": 22,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1irnhth/whats_a_netflix_show_that_youre_glad_you_stuck/"
    },
    {
        "id": "1irmst1",
        "author": "AnActualWizardIRL",
        "title": "Can I turn off the game nonsense?",
        "content": "This is becoming a useability issue. The first page is all ads for daft mobile games I 100% have no interest in. There must be a way to say \"No thanks Netflix, just show me the shows?\". How would I achieve this? I just dont have the patience for this nonsense and its getting harder to work out what new content is available. ",
        "upvotes": 24,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1irmst1/can_i_turn_off_the_game_nonsense/"
    },
    {
        "id": "1is0q3j",
        "author": "bluntprincess99",
        "title": "TW (Spoilers) How angry are you after seeing the American Murder: Gabby Petito ?",
        "content": "True crime documentaries usually anger us, but this angered me like no other. \n\nSpoilers\n\n\n\n\n\n\nThe man lied in his suicide letter. \nThe parents helped him cover up a murder. \n\nI mean how can people be this cruel and sociopathic. ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1is0q3j/tw_spoilers_how_angry_are_you_after_seeing_the/"
    },
    {
        "id": "1ir8y1m",
        "author": "Poorteenwannabe",
        "title": "Tried starting Outlander, can someone recommend a similar show but without all the damn sexual assault?",
        "content": "I am 1.2 episodes in and I hate this show already. It’s got nice camera work and acting but that’s it, so far the plot has refused to grab my attention and the male characters are all so rapey. I hate it. Which is a shame because I love period pieces and thought perhaps I could stomach the more mature themes but just an hour or so in and I can tell it’ll be one of those shows that romanticizes women’s pain. I googled some reviews before deciding not to continue watching, and apparently it’s like this the whole show so it’s an absolute no from me. \n\nI’m down for any better recommendations if you can spare some please and thank you💗\n\n\nEdit: Thank you to all of you with your amazing recommendations!! And thank you for understanding my struggle to continue with watching Outlander without dismissing my experience. 💗\n\nBut just as remind for a few trickling comments: \n\nIt’s not that I cannot stomach such scenes, it’s the way in which this show goes about those scenes that is of my dissatisfaction. \n\nI understand a writers need to include “realism” into a story. However SA isn’t like a lighthearted comedy that you can throw in for fun, it’s something that writers should add in with purpose. So far I don’t get the feeling that this writer does that often. SA is something that startles the viewer and immediately grabs their attention. Adding it in for realism’s sake, in my own personal opinion, is a waste and distasteful. \n\nEven though I could be wrong, and if I stick it out maybe the rest of the show might make up for how often it illustrates that kind of pain to it’s audience, I’m just over scenes like that in general. I get it, you get it, we all get it. We all know it happens. From a woman’s perspective it’s exhausting to see SA as a commonplace troupe in shows all the time, period pieces or not. I’d at the very least love it if they were significant to the plot, as well as less graphic. \n\nI understand that I may come off as sensitive, but I’d rather that than be desensitized to seeing this kind of stuff on the big screen time after time again. It just gets to a point. ",
        "upvotes": 120,
        "comments": 94,
        "media": null,
        "permalink": "/r/netflix/comments/1ir8y1m/tried_starting_outlander_can_someone_recommend_a/"
    },
    {
        "id": "1iqseno",
        "author": "dailystar_news",
        "title": "Netflix star found dead at home age 24, as police investigate circumstances",
        "content": "",
        "upvotes": 1007,
        "comments": 96,
        "media": null,
        "permalink": "/r/netflix/comments/1iqseno/netflix_star_found_dead_at_home_age_24_as_police/"
    },
    {
        "id": "1irumj5",
        "author": "BreadfruitNo9500",
        "title": "Brooklyn 99",
        "content": "Logged into Netflix and it said that last day to watch Brooklyn 99 is on the 25 of this month. But a few days later it said that a new season is coming out the twenty sixth. Is it still getting removed or is it safe?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1irumj5/brooklyn_99/"
    },
    {
        "id": "1irsiwa",
        "author": "welkin25",
        "title": "Why does Netflix show different language and subtitle options for different family members?",
        "content": "I'm trying to watch this anime (Cells at Work) and I don't get English subtitles, but when I switch to my husband's account (still on my own phone), not only does he have English subtitles, his language and subtitle selection is entirely different from mine for the exact same show, why is this?",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1irsiwa/why_does_netflix_show_different_language_and/"
    },
    {
        "id": "1is0sv6",
        "author": "WhileAccomplished722",
        "title": "does anyone else feel like the prologue of arcane was the only realy good part",
        "content": "ive watched all of season one and it feels like the the prologue was incredibly strong with great story and characters and \"ending\" but after that its all over the place and really boring. it still has its moments after that but it turns into just a 5/10 show not bad but not good. (not rly spoilers but i wanted to be safe)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is0sv6/does_anyone_else_feel_like_the_prologue_of_arcane/"
    },
    {
        "id": "1iru8pd",
        "author": "DUCKlloovvaa1497",
        "title": "Need good apocalypse comedy",
        "content": "I’ve recently finished watching both day-break and the umbrella academy and I love the apocalypse themed stuff of people trying to survive in it while the show being entertaining and not too morbid. Does anybody have any good recommendations I could find on Netflix relating to a comedic show about the supernatural/apocalypse through what I’ve described with the example shows I’ve given?",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iru8pd/need_good_apocalypse_comedy/"
    },
    {
        "id": "1irbcqs",
        "author": "Coorb",
        "title": "THE OA season 3 PLEASE",
        "content": "THE PRODUCERS WANT TO FINISH, MILLIONS OF FANS WANT IT TO. I know y’all at Netflix have things to do a business to run. But this show would KILL right now… oh my lord I’m so mad it wasn’t concluded. PLEASE listen to the producer and give it a shot. Geez it was SO good and would do so well now. \n\n",
        "upvotes": 37,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1irbcqs/the_oa_season_3_please/"
    },
    {
        "id": "1irz7q4",
        "author": "DarkSilentSky",
        "title": "Profile Transfer Issues",
        "content": "My profile is on my in-laws account. They don’t live near me and we’re not in contact anymore. I periodically have access to their Netflix to watch, but I’d like to transfer my profile to my own new account. I started the transfer but I got kicked out cause I’m not on the home network. 🙄 Is there really no way for me to get my profile unless I am at their home? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1irz7q4/profile_transfer_issues/"
    },
    {
        "id": "1irmw59",
        "author": "KathleenKellyNY152",
        "title": "Service / Plan Question - Insight for Increased Pricing March 2025",
        "content": "SO. Netflix is raising their Standard streaming plan from $15.49 to $17.99 next month. I logged in to see my options, because hey, I'm an early retiree and every dollar counts. ($2.50/month = $30/year, $60/year pre-tax! And since I plan to be alive awhile, that could be $1200 over the next 20 years. (Plan photo attached.)\n\n*I digress.* \n\nThere are actually **two** Standard plans, one with ads, one without. (Both 1080, both HD, both stream to 3+ devices at once.) When I called to discuss plans with Netflix, I got a lengthy response that the Standard plan without ads (at $7.99 month, which is more than *half the cost* of the Upgraded Standard) \"has limited availability of movies and shows\", although still full HD. When I asked where the list might be of limited movies and shows so I could decide...Netflix told me they just don't have one. So how do I find out I ask..?  Agent told me to switch to the new plan and then I need to look for a \"lock\" symbol on various movies and shows, those won't be available. Really? In 2025, with all the technology we have, including AI, this is how to compare plans?\n\nAny insight?",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1irmw59/service_plan_question_insight_for_increased/"
    },
    {
        "id": "1irmoec",
        "author": "reapercrewsamcro",
        "title": "Video quality randomly dropping down to pixelated, and just recently the screen freezes or skips like a scratched dvd.",
        "content": "has anyone else had this happen to them, I have a pretty stable internet connection of 500 down and 100 up, it’s also wired into the tv through Ethernet. it’s unpredictable when the issues happen but they do it’s very frustrating. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1irmoec/video_quality_randomly_dropping_down_to_pixelated/"
    },
    {
        "id": "1irg4d8",
        "author": "Connor977",
        "title": "Is there any way to restore a deleted Netflix account?",
        "content": "So earlier my stepmum discovered that our shared family Netflix account had been hacked. Someone had changed the email address and she wasn't able to sign in. She had to delete the shared account. We've had the account for years and now all the movies and show I've watched have been erased. I'm kinda sad but I completely understand why she did it and don't blame her one bit. Is there any way to get the account back with all the stuff restored? Any tips are greatly appreciated.",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1irg4d8/is_there_any_way_to_restore_a_deleted_netflix/"
    },
    {
        "id": "1irkc0q",
        "author": "gordopotato",
        "title": "Logging on from different states",
        "content": "I’m in the US and my wife will be working out of state for a couple of months. Is there anything I need to do so we can both use the account without risking getting blocked?\n\nIf it matters, we’re on the premium plan.",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1irkc0q/logging_on_from_different_states/"
    },
    {
        "id": "1irf86m",
        "author": "SomePerson47",
        "title": "Was watching episode 3 of Watchers and I started laughing at the scene where John Graff gets beat with a pile",
        "content": "I just thought I had to share this, but I can't take this scene seriously. Why? They used the falling metal pipe sound effect in the scene where John gets attacked by someone with a metal pipe. \n\nThat's all. Just thought I'd share. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1irf86m/was_watching_episode_3_of_watchers_and_i_started/"
    },
    {
        "id": "1iret1g",
        "author": "an1maver1ck",
        "title": "A+ to the filmmakers of Cassandra.",
        "content": "A+ to the filmmakers of Cassandra. Set in the 70s, The Shining was in 1980. Love this little nod to a horror classic.\n1. From The Shining \n2 &amp; 3. Cassandra ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iret1g/a_to_the_filmmakers_of_cassandra/"
    },
    {
        "id": "1irm5xu",
        "author": "Empty-Relief2242",
        "title": "Netflix white subtitles",
        "content": "Okay so, I’m new to Netflix and have recently started watching some anime, but I’ve noticed that the subtitles are always white. They often blend into the background, making them difficult to read. This is especially frustrating since I’m watching with the original Japanese audio.\n\nIs there any way to change the subtitle color on Netflix? I know my phone’s caption settings use a black border, and that appears on some shows, but not the ones I want to watch.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1irm5xu/netflix_white_subtitles/"
    },
    {
        "id": "1iraxwk",
        "author": "FlightBeneficial2833",
        "title": "Fake laughter on one of the Nate Bargatze special",
        "content": "The special \"Your friend Nate Bargatze\" is really funny, and I don't believe there is anything added to the production of that, BUT for the \"Greatest Average American\" special on Netflix, it's actually frighteningly comical how much canned laughter they added to the top of that.\n\nThe beginning starts out with so much canned laughter added in post production that it's just on repeat like a laughter machine gun over every three words he says. Mind you, you'll see no reaction shots from the audience, just some movements of silhouettes. With non stop incessant canned laughter.\n\nThe special is funny, and you start to see reaction shots from the audience a bit into the special, and you see it's during the pandemic with social distancing and masks, but I think they took some laughter sounds from the middle and PILED it onto the top haha.- am I wrong? LMK",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iraxwk/fake_laughter_on_one_of_the_nate_bargatze_special/"
    },
    {
        "id": "1irvmye",
        "author": "Top-Speech-7993",
        "title": "Am I the only one who thinks Night Agent sounds like it’s dubbed?",
        "content": "The voices from the actors sound like the dubbed, no? Something with the way a lot of the actors sound is throwing me off. Good example of this is Farr. The vibes I’m getting is like from the English dubbed version of Money Heist. Anyone else feel that too?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1irvmye/am_i_the_only_one_who_thinks_night_agent_sounds/"
    },
    {
        "id": "1iru73n",
        "author": "rachiepants2017",
        "title": "Netflix's new Vegas restaurant looks epic! Food inspired by Squid Games, Stranger Things, and more.",
        "content": "",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iru73n/netflixs_new_vegas_restaurant_looks_epic_food/"
    },
    {
        "id": "1irbior",
        "author": "Brilliant_One9258",
        "title": "Best Kdrama to Watch on Netflix Today",
        "content": "In your opinion, what is the best kdrama to stream on Netflix today? I'm currently watching Marry You and When the Stars Gossip and they're both okay. I like WTSG better though. The story is quite interesting than what I normally watch. It's refreshing to see Lee Min Ho playing a character that is very different from his usual rich or powerful guy roles. He is kinda an underdog here. Shows a little bit of his range as a actor. ",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1irbior/best_kdrama_to_watch_on_netflix_today/"
    },
    {
        "id": "1irgepf",
        "author": "Sandroox",
        "title": "The åre murders",
        "content": "Does anyone know why the åre murders is gone from netflix? I was almost finished watching but now its gone… yesterday it was still watchable and now I try to watch but if I click on it I can set a \"remind me\" and only watch the trailer :(",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1irgepf/the_åre_murders/"
    },
    {
        "id": "1iqupoq",
        "author": "Vector_Heat",
        "title": "How Oil Propaganda Sneaks Into TV Shows",
        "content": "",
        "upvotes": 26,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iqupoq/how_oil_propaganda_sneaks_into_tv_shows/"
    }
]