[
    {
        "id": "1qd13z7",
        "author": "scoreboard-app",
        "title": "Post-Match Thread: Albacete Balompie vs Real Madrid | Copa del Rey 25/26 | Jan 14, 2026",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1qd13z7)",
        "upvotes": 147,
        "comments": 587,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qd13z7/postmatch_thread_albacete_balompie_vs_real_madrid/"
    },
    {
        "id": "1qarzcp",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 17,
        "comments": 5414,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qarzcp/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1qdmml2",
        "author": "New_Orange_9901",
        "title": "He’s the problem and we all need to agree !",
        "content": "He need 30 million to renew his contract.\nBro thinks he’s Cristiano Ronaldo \nHe came out angry because of a switch, and he ruined a whole season and got Xabi Alonso fired.\nAll Spain hated him, except Real Madrid fans, but today the whole world hates him.\nThe worst football mentality we have ever experienced in the history of football.",
        "upvotes": 517,
        "comments": 146,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wglvicz28jdg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qdmml2/hes_the_problem_and_we_all_need_to_agree/"
    },
    {
        "id": "1qdhfgk",
        "author": "tfisthh",
        "title": "Real Madrid’s Standard Has Hit Rock Bottom.",
        "content": "remember Cristiano Ronaldo getting booed.\nremember him being whistled even after scoring hat-tricks and winning Ballon d'Ors.\nand what did he do? \nhe stood in the middle of the stadium and listened to the boos like a man. no drama. no tantrums. no victim role.\ntoday, players with 1 goal in 20 games are openly clashing with a proven manager and acting bigger than the club \nthat tells you everything.\nReal Madrid's standards have hit rock bottom.",
        "upvotes": 561,
        "comments": 63,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/61fk7xa24idg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qdhfgk/real_madrids_standard_has_hit_rock_bottom/"
    },
    {
        "id": "1qdgjhe",
        "author": "ace-s",
        "title": "Not even one Real Madrid player(including captains Carvajal, Fede and Vini) took the responsibility and spoke in the locker room after the match to lift morale. All the players were silent. Arbeloa had to come in and console them, saying they have to regroup and that he is the most to blame.",
        "content": "",
        "upvotes": 553,
        "comments": 87,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdgjhe/not_even_one_real_madrid_playerincluding_captains/"
    },
    {
        "id": "1qdkiuw",
        "author": "GreatAngel10",
        "title": "Historic booing at the Santiago Bernabéu on Saturday",
        "content": " I’ve been following Real Madrid for almost 20 years, and these divas who think they’re superstars should thank Florentino Pérez every single morning for banning the Ultras Sur.\nI’ve seen Casillas get booed for poor performances. I saw Mourinho bench him, and he left like any other player. I saw Kaká a legend at Milan sit on the bench quietly, without drama or public complaints.\n\nI watched Cristiano Ronaldo, Özil, Sergio Ramos, Xabi Alonso, Di María, Benzema give everything for this club. I saw Benzema benched for Higuaín. I saw Marcelo lose his place. I saw Gareth Bale lose his place. And you know what? None of them gave interviews attacking the coach. None of them acted bigger than the club.\n\n\nI’m not talking only about Vinícius Jr, no no, I’m talking about all those players who step into the pitch just to show off, constantly demanding privileges and questioning the coach publicly.\nI’m not here to defend Xabi Alonso, Ancelotti, or anyone else. I’m here for the club. For REAL MADRID.\n\nThis is not Ibiza Beach FC. This is Real Madrid. Even when we lost, rivals respected us because of who we were. I remember when the Bernabéu erupted just by seeing the players walk onto the pitch because they transmitted hunger, intensity, and pride.\nNow we’re forced to watch players with egos bigger than Cristiano Ronaldo’s, but with the level of Lucas Vázquez with all due respect to him. These players don’t feel what we feel.\n\nAfter a bad match, they board planes, return to their mansions, sleep with supermodels, and wake up worried only about which Lamborghini, BMW, or Ferrari to drive to training. They want to win without running, without fighting, because they believe they’re untouchable.\nThey don’t respect the fans.\n\nAnd here’s a message for those who started “supporting” Real Madrid in 2018, 2019, or especially in 2022: this club did not start with Valverde, Vinícius, Courtois, Hazard, or anyone else.\nStop blindly defending players at all costs. Cristiano Ronaldo left this club for much less, after giving us years of joy and historic performances and even he didn’t get special treatment on the way out.\n\nDo you honestly believe anyone in this current squad has done even 30% of what CR7, Marcelo, Ramos, or Benzema did? Of course not.\nSo stop defending laziness. At Real Madrid, effort is non-negotiable. Some players deserve to be booed loudly until they understand the weight of this shirt and some need to be booed to the point of asking to be substituted.\nThis is REAL MADRID.\n\nI have much more to say, but that’s for another time.\nThank you to everyone who read this far.",
        "upvotes": 303,
        "comments": 63,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdkiuw/historic_booing_at_the_santiago_bernabéu_on/"
    },
    {
        "id": "1qd909h",
        "author": "OwnWitness2836",
        "title": "Xabi : I’m doing very well, I’m calm.",
        "content": "",
        "upvotes": 1205,
        "comments": 58,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jcsqbosgqfdg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qd909h/xabi_im_doing_very_well_im_calm/"
    },
    {
        "id": "1qd0qvp",
        "author": "dark4403",
        "title": "and we lose the match....",
        "content": "",
        "upvotes": 3225,
        "comments": 508,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/50acr01qzddg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qd0qvp/and_we_lose_the_match/"
    },
    {
        "id": "1qdiyrw",
        "author": "Hus-9",
        "title": "Been following Real Madrid for 30 years, and this meltdown is wild",
        "content": "Been following this team for 30 years and honestly I have never seen a meltdown like this. Its kind of amazing to watch. Feels like a mix of gold-diggers and fans who only started following Real Madrid because of a certain player. They have no idea what a real rough patch feels like.\n\nLet me tell you something, what we are seeing now is nothing compared to what real fans have gone through.\n\nThink early 2000s. Galacticos everywhere. Figo, Zidane, Ronaldo, Beckham. Everyone expected trophies every season. And yet we had some brutal heartbreaks. Losing the 2002 Champions League semi-final on penalties to Bayern. 2003 La Liga slipping at the worst possible moment. 2005 losing the Champions League quarter-final to Juventus after dominating the league. Fans endured it. We survived it.\n\nMid to late 2000s. The round of 16 curse in the Champions League became a nightmare. Year after year we got knocked out early by Lyon, Roma, Bayern, Liverpool. Champions League expectations were sky-high, but the team kept hitting the wall. La Liga wasnt easy either. We dominated most of the season only to have Barcelona snatch it at the end multiple times. Fans went through heartbreaks, outrage, and frustration. We learned patience the hard way.\n\nEven the first few years after the Galacticos era were rough. Coaching changes every season, big-money signings failing to deliver, rival clubs laughing at us. Every setback felt personal. And still, the true Madridistas stuck with the team.\n\nThen 2013-14. Finally, after years of suffering through that round of 16 curse, we lifted La Decima. Pure relief, pure joy. Everything before that heartbreak suddenly made sense. That’s what it feels like to survive the tough times.\n\nNow, I see a lot of people calling for Perez to resign. Really? Look at where Real Madrid was before him and where he took the club. Do not forget what he has achieved. The man built one of the greatest clubs in the world over and over. La Decima, La Undecima, multiple Champions Leagues, dominating Europe for decades. Criticize all you want, but calling for him to leave in a rough patch shows how little some people know or remember what this club went through before he arrived.\n\nAnd another thing. Stop comparing Real Madrid to Manchester United. Like really? Are you joking? Look at the last decade. United have struggled in PL and Champions League. Real Madrid have won 5 Champions Leagues in 9 years under Zidane and beyond. Winning La Liga, dominate in Europe. Revenue? Brand? Squad depth? History? Real Madrid is in a different league. You cannot compare the two, and anyone saying otherwise clearly does not understand football.\n\nSo yes, the situation is messy. Fans are upset. But relax, this chaos is nothing new. The real test of being a Madridista isnt celebrating wins, its surviving the tough times. And we have done it before, we will do it again, and we will laugh at these meltdowns.",
        "upvotes": 173,
        "comments": 120,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdiyrw/been_following_real_madrid_for_30_years_and_this/"
    },
    {
        "id": "1qdke6g",
        "author": "FinancialWolverine94",
        "title": "Brahim enjoying the AFCON while RM having a hard time",
        "content": "Brahim Diaz really escaped what is happening to RM during these days, I cant imagine the presure and the frustration inside the team, they got knocked out of la copa del rey and lost another final against FCB.\n\nBrahim is living a career highlight with his national team, he scored during five games in a row, yesterday Morocco got the the AFCON final after beating Nigeria in a very difficult game, they will play the final against Senegal, two african giants ! his joy after the final whistle tells it all, he was in tears as well !\n",
        "upvotes": 131,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ke1e6dxjsidg1.png?auto=webp&amp;s=d48e4fec4048628ae29edceccb746e7f0efc4753"
        },
        "permalink": "/r/realmadrid/comments/1qdke6g/brahim_enjoying_the_afcon_while_rm_having_a_hard/"
    },
    {
        "id": "1qderm9",
        "author": "anonymous_1729",
        "title": "Vini Jr please leave my club!!",
        "content": "Enough is enough. How long will we give this guy a free pass just because he won us two Champions Leagues. He is still not bigger than Isco and Bale in my eyes, but his ego is like Prime CR7. First he goes on to create tension in the dressing rooms just because he got subbed out and eventually gets Xabi sacked. Didn’t even show courtesy to drop a farewell message. And the only moments when we needed him to step up this season, he failed miserably. I used to support this guy with all my heart during his Zidane era but now he’s been getting on my nerves. I genuinely believe we will be a much better team without him in the squad. And all the other players who are behind him will get a necessary reality check that no player is bigger than this club. I want Bernabeu to boo the crap out of him in the next home match. \n\nAs for other players in the squad, I genuinely don’t wanna see Fran Garcia, Raul Asencio and Mastantuono starting any time soon.\n\nI have my biases for Alaba, Mendy and  Rudiger but even their time has come\n\nWe need a very significant makeover in the summer if we want to compete for anything ever again.\n\n",
        "upvotes": 316,
        "comments": 117,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qderm9/vini_jr_please_leave_my_club/"
    },
    {
        "id": "1qddtoq",
        "author": "OkRecommendation7341",
        "title": "We know how you're feeling right now💔",
        "content": "",
        "upvotes": 346,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1ldvnj0r0hdg1.jpeg?auto=webp&amp;s=5bc1b13a073491c6a3d9ae24d37073dc85db361c"
        },
        "permalink": "/r/realmadrid/comments/1qddtoq/we_know_how_youre_feeling_right_now/"
    },
    {
        "id": "1qdd5k3",
        "author": "TheFeatherDiaries",
        "title": "Arda Güler's deliveries yesterday",
        "content": "",
        "upvotes": 389,
        "comments": 86,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/k6qmt4d7tgdg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qdd5k3/arda_gülers_deliveries_yesterday/"
    },
    {
        "id": "1qd1wny",
        "author": "Due_Requirement_1170",
        "title": "Oh how I so badly miss this",
        "content": "",
        "upvotes": 1823,
        "comments": 158,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1xm3n9wq7edg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qd1wny/oh_how_i_so_badly_miss_this/"
    },
    {
        "id": "1qdchqe",
        "author": "arthur_kane",
        "title": "Real Madrid helping financially struggling club battling relegation in Segunda Divisón",
        "content": "",
        "upvotes": 246,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ftvtnr8kmgdg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qdchqe/real_madrid_helping_financially_struggling_club/"
    },
    {
        "id": "1qd2ge1",
        "author": "ace-s",
        "title": "Alvaro Arbeloa acting like Vini scored a hatrick tonight during post game press conferance was unbelievable",
        "content": "Alvaro Arbeloa: \"THIS is the Vini I want. took all responsibility and tried to put the team on his back. Tonight's Vini was a CAPTAIN Vini.\"\n\n  \nMeanwhile, these were his stats tonight:\n\n90 Minutes.\n\nO Goals/Assists.\n\n1/3 Shots on Goal.\n\n23 Possessions Lost.\n\n2 Offsides.\n\n25m\n\nAgainst a team that's 17th in the second division\n\n  \nIs Alvaro real???? Didnt he say Mou is his inspiration? Mou would have ripped Vini to shreds",
        "upvotes": 928,
        "comments": 127,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qd2ge1/alvaro_arbeloa_acting_like_vini_scored_a_hatrick/"
    },
    {
        "id": "1qdiet0",
        "author": "Finn_Madridista",
        "title": "From Gegenpressing to Depressing 🫩 (OC)",
        "content": "",
        "upvotes": 68,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p0vrkqz4didg1.jpeg?auto=webp&amp;s=5644268b2368e0f481cb6c3757d459f9906bada2"
        },
        "permalink": "/r/realmadrid/comments/1qdiet0/from_gegenpressing_to_depressing_oc/"
    },
    {
        "id": "1qd2b0o",
        "author": "Dizzy-Psychology-262",
        "title": "The only happy Madridista detected today",
        "content": "",
        "upvotes": 764,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ozro59ulaedg1.jpeg?auto=webp&amp;s=0fa06065924910b2477ca96a851c392a81b08c29"
        },
        "permalink": "/r/realmadrid/comments/1qd2b0o/the_only_happy_madridista_detected_today/"
    },
    {
        "id": "1qdam0e",
        "author": "Lonely-Paint-7876",
        "title": "What a player he could have been at Madrid if Pérez had listened to Xabi.",
        "content": "",
        "upvotes": 245,
        "comments": 50,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/izp5fjbj4gdg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qdam0e/what_a_player_he_could_have_been_at_madrid_if/"
    },
    {
        "id": "1qdknsp",
        "author": "Alert-Raccoon-5075",
        "title": "A fan has died from a heart attack when he found out real madrid lost the game el classico.",
        "content": "Like in the picture thats hes brother talking to the reporter saying how much hes brother loved real madrid and he was a top fan of real madrid and when he found out real lost he got reaally really depressed and later on he died of a stroke/heart attack the man was a genuiene fan of realmadrid and the man is from kurdistan and hes kurdish and a source: https://www.facebook.com/share/v/1BcoJKfPbK/?mibextid=wwXIfr",
        "upvotes": 44,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdknsp/a_fan_has_died_from_a_heart_attack_when_he_found/"
    },
    {
        "id": "1qcu1bh",
        "author": "ryujinitzylover",
        "title": "Xabi today in Madrid",
        "content": "",
        "upvotes": 1562,
        "comments": 147,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qcu1bh/xabi_today_in_madrid/"
    },
    {
        "id": "1qd3c4z",
        "author": "New_Orange_9901",
        "title": "Bernabeu you know what to do.",
        "content": "Real Madrid had also just won the Champions League, but the Bernabéu, fed up with their attitude, gave them a historic booing. Cristiano Ronaldo, who saved that elimination round, remained a champion, listening to the criticism. Such greatness.\nFans need to run it back vs Levente this Saturday so that they know this is ain’t right.",
        "upvotes": 501,
        "comments": 40,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7bv44q1zhedg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qd3c4z/bernabeu_you_know_what_to_do/"
    },
    {
        "id": "1qdc208",
        "author": "Emergency-Hornet-594",
        "title": "🚨 Alvaro Arbeloa: \"Do I regret leaving star ?“Tonight's team was a FANTASTIC team that can beat ANY TEAM IN THE WORLD, not just Albacete.\" ⚠️‼️ . . . (What in the world is he on about? Truly delusion. Man o man",
        "content": "🚨 Alvaro Arbeloa: \"Do I regret leaving star players in Madrid? No, no, if I could do it again, I would do it 1000 TIMES!”\n\n“Tonight's team was a FANTASTIC team that can beat ANY TEAM IN THE WORLD, not just Albacete.\" ⚠️‼️\n.\n.\n.\n \n\n(What in the world is he on about? Truly delusion. Man o man i think preze kidnapped his family or smt.)\n.\n.\n \n.\n \n ",
        "upvotes": 133,
        "comments": 94,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdc208/alvaro_arbeloa_do_i_regret_leaving_star_tonights/"
    },
    {
        "id": "1qd2owd",
        "author": "asensia-kopfschmerz",
        "title": "Carvajal: \"Today we have hit rock bottom. Starting tomorrow, each of us individually and collectively must engage in self-criticism. We still have time to turn the season around; we have two fantastic competitions and we're going to fight for them.\"",
        "content": "",
        "upvotes": 447,
        "comments": 75,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qd2owd/carvajal_today_we_have_hit_rock_bottom_starting/"
    },
    {
        "id": "1qdfk8r",
        "author": "Willing-Neck-7417",
        "title": "ITS ALL PEREZ FAULT FOR PUTTING PLAYERS OVER THE TEAM",
        "content": "PEREZ HAD TO SUPPORT ALONSO AND SIGN THE PLAYERS HE WANTED TO SIGN. VINI DESTROYED  HIS TEAMATES. HE DONT PRESS. HE DONT PASS. HE PLAY ONLY FOR HIMSELF. \n\nALSO DONT FORGET THAT ALONSO ASKED PEREZ TO SIGN MODRIC FOR ANOTHER ONE YEAR SO HE CAN HELP THE YOUNG PLAYERS TO UNDERSTAND THE CLUB BUT HE LET HIM GO TO MILAN. HALA MADRID NO MATTER WHAT GONNA HAPPEN THIS YEAR. ONCE MADRIDISTA FOREVER MADRIDISTA",
        "upvotes": 54,
        "comments": 27,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdfk8r/its_all_perez_fault_for_putting_players_over_the/"
    },
    {
        "id": "1qdnv1k",
        "author": "Ineedhelpistaken",
        "title": "If people still don’t boo at the Bernabéu this Saturday after everything, I don’t know what it’ll take",
        "content": "Look, I’m not just talking for drama, there’s legitimate reasons why the atmosphere should be tense this weekend.\n\nWe just got knocked out of the Copa del Rey by Albacete, a second-division side, in one of the most humiliating results in recent history. That was Arbeloa’s debut as coach and it wasn’t even close to respectable.\n\nXabi Alonso is gone after only seven months,a manager who was supposed to be the next big thing, and we’re already in managerial chaos.\n\nMeanwhile the fans inside the club are already openly questioning Florentino. On Reddit threads today people are demanding Perez step down, calling his decisions ego-driven and disconnected from what this team actually needs.\n\nAnd don’t forget the wider fallout:  \n• The squad looks completely lost on the pitch, no identity, no consistency, even longtime supporters are calling this a meltdown unlike anything they’ve seen.  \n• There’s tension over plans to potentially open up ownership structures and bring in outside investment, something a lot of socios aren’t happy about.  \n• Florentino’s constant attacks on refereeing and the whole Negreira saga have drawn public pushback from the Spanish referees’ association.\n\nSo yeah, if the Bernabéu doesn’t let them hear it with whistles and boos this Saturday, I’ll be genuinely surprised.\n\nLet’s see if these people inside the club actually feel the pressure they’ve created.",
        "upvotes": 18,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdnv1k/if_people_still_dont_boo_at_the_bernabéu_this/"
    },
    {
        "id": "1qd8leg",
        "author": "drakos500",
        "title": "The individuality era is Over. Time to move on.",
        "content": "I do not understand why so many fans refuse to actually support the club instead of players or top executives.  \n\nThis club is rotten to the core. And don't be mistaken  Real madrid is heading (again) down the manchester united path or even worse. this administration is completely outdated and old ad senile. This is 2026, the concept of playing superstars and relying on  the to shine is not feasible. Why ? because :\n\n1) Real madrid does not have a stacked deck like in 2016. way to many overrated and moody at best players. the only decent 'superstar' is Mbappe. And even then he is not good enough to build an ENTIRE system on him alone. \n\n2) buying ready superstars, is too expensive. our Club just ran out of all it's elite veterans that made it seem easy. especially in midfield with modric and kroos.\n\n3) Football has become more intense and more team oriented. people seem to forget that although there were a lot of egos in 2016+ but they were so good at their roles that they synchronized into an unstoppable team. this is definitely not the case for these current players.\n\nAlonso was just disappointed by how immature and very unprofessional these players are. and the rest of the fans will soon know it.",
        "upvotes": 174,
        "comments": 52,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qd8leg/the_individuality_era_is_over_time_to_move_on/"
    },
    {
        "id": "1qd6umz",
        "author": "stoicismmoral",
        "title": "Hear me out: if you wanted to get Arbeloa as a short term coach, we should have hired this guy instead.",
        "content": "I mean with how much he loves the club even though he is not benefitted or supported by the club, he still manages to show what the club needs. If we wanted to experiment and ruin Arbeloa’s career why not bring someone who knows how to atleast bring the team to some conscience?\n\nArbeloa is going to be hated with the bigger disaster on the horizon and no one is going to take the repercussions. The board will sack him and get new one. Why not just get Khabib for a month and just get back to at least having players who behaves. ",
        "upvotes": 210,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yoa8ra9z8fdg1.jpeg?auto=webp&amp;s=01d4992e0980368fa8e8e059fe05366411333137"
        },
        "permalink": "/r/realmadrid/comments/1qd6umz/hear_me_out_if_you_wanted_to_get_arbeloa_as_a/"
    },
    {
        "id": "1qd0zp3",
        "author": "Lucky_Reading_3757",
        "title": "Another shaky match for Vinicius Junior today as Real Madrid lose to a Segunda Division side in a relegation battle.",
        "content": "He is valued at 11x Albacete’s entire squad on Transfermarkt",
        "upvotes": 356,
        "comments": 155,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mcfd4tg31edg1.jpeg?auto=webp&amp;s=735e26152facfa05e54c351ba71454f39560bff3"
        },
        "permalink": "/r/realmadrid/comments/1qd0zp3/another_shaky_match_for_vinicius_junior_today_as/"
    },
    {
        "id": "1qdd1r2",
        "author": "MOUZANNAR40",
        "title": "Mbappe is the problem they said",
        "content": "Vini fanboys really tried to push an agenda against mbappe that he was the reason xabi left/sacked and the reason about the downfall of our team etc.. while as u see vini clocking bad performances in and out game after game with and without mbappe on the team and still arguing and creating conflicts with EVERYONE team or opponents. Vini is the only player that didn’t lost a farewell message to xabi. He was the most player that wanted xabi out because xabi was the first brave coach that caught up with his bullshit and started subbing him which vini didn’t like. Vinicius plays 1 good game and he dips again for 10 games. Mbappe was saving our asses game after another (almost) im not saying mbappe doesn’t have some flaws but what i know is he was more help than a problem for us more than vini jr. ",
        "upvotes": 52,
        "comments": 47,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qdd1r2/mbappe_is_the_problem_they_said/"
    }
]