[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 710,
        "comments": 5198,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nzotzy",
        "author": "camwtss",
        "title": "does ANYONE like the ed gein series?",
        "content": "im bummed because i was really looking forward to watching this, but i have seen nothing but negative comments about it. did anyone enjoy it? or is it a waste of 8 hours.",
        "upvotes": 164,
        "comments": 385,
        "media": null,
        "permalink": "/r/netflix/comments/1nzotzy/does_anyone_like_the_ed_gein_series/"
    },
    {
        "id": "1o03p0o",
        "author": "DestroWOD",
        "title": "Im so tired of this current layout !",
        "content": "Since a few months its so hard to browse Netflix 😥. I used to be able to see my list easily and it was pretty quick browsing it all now i feel like i have to scroll forever 😡\n\nAny way to revert to old look? Like dark/light modes on twitter or something... ",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o03p0o/im_so_tired_of_this_current_layout/"
    },
    {
        "id": "1nzv2dk",
        "author": "Adventurous_Ant5428",
        "title": "Why didn’t Alice in Borderland ever gain popularity like Squid Game?",
        "content": "Kind of similar premise involving survival games, so why didn’t Alice in Borderland seem to gain as much traction? It has a more complex storyline and the games are arguably more interesting. ",
        "upvotes": 37,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1nzv2dk/why_didnt_alice_in_borderland_ever_gain/"
    },
    {
        "id": "1o01zsp",
        "author": "Aggressive_Cost_4667",
        "title": "Monster trilogy",
        "content": "When Dahmer first came out I remember thinking wow this is probably one of the best limited series I’ve watched (coming from someone who never knew who he was) and was not shocked when it won so many awards. Then by the end of the series with them teasing John Wayne gacy I was thrilled to see that this trilogy wasn’t over and that another serial killer who this time I knew would be the next story they focus on. When the news was confirmed that the next season would be about the Menendez brothers who this time I knew a lot about I was kind of disappointed not because of them personally but because I think the Segway from Dahmer to JWG especially since they were active during the same time would have made an awesome season 2.  Why didn’t Netflix decide to go ahead with JWG is beyond me. Now with season 3 being Ed gein, who mind you barely has any video or audio recording to base the series off with most of it being inaccurate and dramatised, has Netflix missed the potential to make a record breaking trilogy series beyond Dahmer? Especially considering already the ratings for Ed gein aren’t merely as high as the Menendez brothers yet alone Dahmer. \n\nNow again, with the teasers for season 4 being Lizzie Borden? I mean seriously, Ed Geins evidence to base season 3 off was dry to nothing and now they want to focus on someone way before Ed geins time? I don’t think the ratings will be going up anytime soon if they don’t plan to start focusing on newer stories with some evidential backup. \n\n(Also when I say seasons I knew they’re separate shows it’s just to help the timeline ) \n",
        "upvotes": 14,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o01zsp/monster_trilogy/"
    },
    {
        "id": "1o07jui",
        "author": "obscure_monster",
        "title": "Any recommendations for Anime?",
        "content": "Anyone have recommendations for anime on Netflix? I really need something NEW to watch. New to me at least. I’ve watched a looot on Netflix and I’m now going through the anime on Netflix. ",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o07jui/any_recommendations_for_anime/"
    },
    {
        "id": "1o034ck",
        "author": "MattNola",
        "title": "Next Monsters",
        "content": "Would Netflix touch John Wayne Gacy as the next Monster? I know it’s even more gruesome and harrowing than the previous 3 (which says a lot) but with it being mostly Children I’d think they’d stay away from that? The whole clown thing seems right up their alley though.\n\nEdit: for those interested, Soft White Underbelly did an interview with a man who had a run in with Gacy when he was 16. I was terrified listening/watching it. Definitely worth a listen.",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1o034ck/next_monsters/"
    },
    {
        "id": "1o065sk",
        "author": "Low-Concert5170",
        "title": "Live action Cardcaptor Sakura Please?",
        "content": "So Sabrina and Wednesday were simply iconic. Would love to see a live version of Sakura the Cardcaptor please. \n\nI was such a huge fan of the original anime series and would love to see a live adaptation someday.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o065sk/live_action_cardcaptor_sakura_please/"
    },
    {
        "id": "1o042rk",
        "author": "Imaginary-Ad5624",
        "title": "A title I was watching earlier in the day is suddenly no longer available.",
        "content": "A title I was watching earlier in the day is suddenly no longer available. It was scheduled to leave Netflix at the end of the month. It's not the end of the month. What happened?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o042rk/a_title_i_was_watching_earlier_in_the_day_is/"
    },
    {
        "id": "1nyv5v2",
        "author": "DMFD_x_Gamer",
        "title": "Just found a relic in a packed away box.",
        "content": "Still has a CD in it. Not sure what the movie is though. The envelope is sealed. I dont even have a DVD player anymore so im in no real hurry to see what's inside. Still a cool find. ",
        "upvotes": 1296,
        "comments": 124,
        "media": null,
        "permalink": "/r/netflix/comments/1nyv5v2/just_found_a_relic_in_a_packed_away_box/"
    },
    {
        "id": "1o0958k",
        "author": "Batrah",
        "title": "Does True Haunting have bunch of jump scares?",
        "content": "Considering the director made Conjuring and all.. I'm interested in the supernatural stories they have to tell, but if it's going to be bunch of silly jump scares i think i wanna skip it",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o0958k/does_true_haunting_have_bunch_of_jump_scares/"
    },
    {
        "id": "1o08xna",
        "author": "ConsciouslyKind93",
        "title": "Lazarus Project - the most promising sci-fi premise ruined by stupid plot",
        "content": "Just watched the series because I was craving for a good sci-fi story.\n\nBut with each episode, I see almost every character make the most stupid decisions and choices ever, and the series gets dumbed down to the level of any other relationship drama. \n\nPerfect example of having a great sci-fi premise with great potential, ruined by the writers' small minds and limited imagination.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o08xna/lazarus_project_the_most_promising_scifi_premise/"
    },
    {
        "id": "1o085v8",
        "author": "Strong-Ingenuity-680",
        "title": "ed gein conversation regarding media is good. but fails to recognise its own place in that",
        "content": "idk man. everyone online seems to be hating this movie but i actually think it’s both really good and really bad at the same time. like, i get why people are grossed out or mad about it - i was literally gagging at parts, it’s one of the most disgusting movies i’ve ever sat through - but i also think that’s kind of the point.\n\nit’s weirdly nuanced in the way it shows how media shapes us. like the comics and nazi photos sending him over the edge, adeline’s obsession with horror photography, the way psycho literally captivated the masses and started a whole new wave of fascination. it’s showing how we’ve always wanted more. more horror, more depravity, more blood, more “realism.” and we got exactly what we asked for.\n\nand yeah i could barely stomach it. i’m literally struggling to eat after watching it because it’s so repulsive. but it’s also kind of brilliant in how it shows where all this came from. like, after ww2, we saw the actual horror humans are capable of - concentration camp photos, mass graves, the stuff that made us realize hell isn’t some mythical place, it’s what people can do. and instead of turning away, we became fascinated. and as humans do,,,, we fetished it   that’s where horror really started to mutate. from psycho to texas chainsaw massacre to scream, horror slowly turned into soft porn with a knife. and now ed gein being portrayed as next captain america with his six pack and buff arms….. fucking a corpse…. \n\nand the thing is, horror has always mirrored culture. vietnam war, sexual liberation, the rise of porn —- all of that bled into and made the “sex horror” genre. and this movie captures that. but what bugs me is that it doesn’t seem to realise it’s also part of that same cycle. that ed gein saw this horrors in the media - and copied it. it’s talking about how media inspires horror, but it’s also gonna inspire some creepy fuck to copy it. like this narrative that is portrayed as “the truth” will inevitably inspire minimum one person to make a nipple chair. the same way school shooters copy each other. that’s just reality.\n\nso yeah, i think the movie gets it but also doesn’t. it’s an amazing critique of how media feeds on violence and trauma, and how violence feeds on the media in one big bisous cycle of sick fucks. but it’s also feeding the same beast. \n\nthe brutality and gruesomeness is definitely reflection of where we are now - gaza, ukraine, congo etc.  horror is everywhere. right at our fingertips tips. every day i see another hospital getting bombed in a gaza on my literal tik tok fyp and i just go about my day. it’s everywhere. and we are so desensitised. and because of that, there’ll always be another movie, another killer, another atrocity.\n\nit’s messed up. i hated watching it. but i also think it says something really real about us.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o085v8/ed_gein_conversation_regarding_media_is_good_but/"
    },
    {
        "id": "1o085qg",
        "author": "Select_Indication739",
        "title": "They really messed up this season of monster focusing on ed gein!!!",
        "content": "Now iam gonna be pretty vocal about what I thought when the series was announced...I was FREAKING EXCITED to see a story about this man who inspired many movies and what was he really like . Hollywood has been taking this man's story and making movies but we really didn't know the real story behind who ed gein really was. Fast forward few months letter, we got updates about hitchcock, Perkins , etc who are going to have a character in the show which was pretty interesting to me at least. BUT OH MAN , THEY BUTCHERED so lemme talk about it one by one\n1) This show didn't need freak8ng 8 episodes because it felt dragged out for no reasons . While making a series on real events you outh to lay out the episodes in such a way that the episodes contain those events without dragging... instead here they had to add extra some made up shit just to make the series longer wth??\n2) This brings me to this point, by the end of this series you get this idea about the show basically telling us that ed gein wasn't this antagonist character they portrayed with false narratives and that he was just a sick man who deserved to be told his own story because hollywood never did . But this series did exactly the same by adding stuff which was not even confirmed and repeating the same mistake\n3) Ed gein was a ill man because of his circumstances initially in his childhood But WE DONT GET TO SEE ANY OF IT... NOT EVEN 1 EPISODE OF HIS FAMILY DYNAMIC WHICH MADE HIM THE WAY HE WAS...he's entire family is dead by episode 1 and we are pretty much clueless about his circumstances and what made him the way he was\n4) VICTIMS - HOW THEY HELL DID THEY COME UP WITH THE CONCLUSION ABOUT SOME OF THE STORIES OF THE VICTIM BECAUSE IAM PRETTY SURE ED GEIN WASN'T INVOLVED WITH BERNICE. its not only disrespectful to the victim's family but also to those people whos live was completely destroyed \n5) Him killing evelyn hartley,\n And the two men in his farm should have been used as a perspective of the police and letting us the viewers decide IF he did kill them or not because that's what really happened. We don't know for sure but this show decided to tell this in such a way as if THIS HAPPENED??\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o085qg/they_really_messed_up_this_season_of_monster/"
    },
    {
        "id": "1o01eh3",
        "author": "leaveitbetter20",
        "title": "INSIDE, who's watching",
        "content": "So I started watching INSIDE on Netflix and wasn’t sure what to expect, but now I’m low key addicted 😅 I’m on episode 5 already! Who else is watching this?? 🍿👀🍿",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o01eh3/inside_whos_watching/"
    },
    {
        "id": "1nzp5lx",
        "author": "GoldDerby",
        "title": "‘Monster: The Ed Gein Story’ star Charlie Hunnam reflects on ‘Sons of Anarchy’ awards snubs: ‘Nice to receive them, bad form to covet them’",
        "content": "",
        "upvotes": 11,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nzp5lx/monster_the_ed_gein_story_star_charlie_hunnam/"
    },
    {
        "id": "1nz263e",
        "author": "no_tengas_miedo",
        "title": "Ed Gein is pretty bad",
        "content": "At first I thought it was going to be good. Especially the first 2 chapters, I liked them a lot, but throughout the series my desire to watch it disappears. It all consists of telling stories about psychosis actors, the Texas massacre, film producers who were inspired by him, and above all, romances they have had and experiences that are not real or are still theories.\nI thought I was going to see how Ed Gein acted, the things he did, what he did with corpses, everything. But instead I find that shit. \nI had a lot of hype for this season, I thought it would be good and above all that it would be the creepiest of all. But it feels pretty bad. It's morbid of me to want to see more of what the crimes were like and how he really acted, but damn, that's better than wanting to see stories that never happened about his life.",
        "upvotes": 406,
        "comments": 331,
        "media": null,
        "permalink": "/r/netflix/comments/1nz263e/ed_gein_is_pretty_bad/"
    },
    {
        "id": "1o072kb",
        "author": "daily_apprehensive",
        "title": "Monster Season Suggestions?",
        "content": "If you could pick the subject of the next Monster season, who would it be? And what makes it unique or fascinating enough for the eight episodes?\n\nI’d love to see one on Jerry Sandusky, examine the Monster facet from that angle. Plus there are so many stories/perspectives that could be told alongside it for commentary: Aaron Fisher and his mom (self-identified victim and mother), the red-haired assistant whistleblower, Paterno, Dottie Sandusky.\n\nI have to admit I haven’t enjoyed the most recent seasons of Monster but Dahmer remains some of the best television I’ve ever seen. And all three have been great with their social commentary. I just wish Ryan Murphy was more interested in facts and less interested in shocking sex scenes. \n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o072kb/monster_season_suggestions/"
    },
    {
        "id": "1nzzgp7",
        "author": "gumOnShoe",
        "title": "Running out",
        "content": "I've been a customer since DVDs. Was super excited to cut the cord. Was all about streaming, didn't once opt for the cheaper plan, but it's finally happened. I've reached the end of my list and Netflix is no longer keeping up with my viewing habits. \n\nI'm wondering if stranger things will be my last month subscribing. I used to be able to count on having a show that was fine that i didn't care much about, but was interesting enough to put on with the wife. Neither one of us are very stratified or interested in what's left. There used to be something to at least consider each month, but since they started splitting seasons it's more like something every three months. \n\nWe quit HBO/max when they stopped delivering new content just before the discovery merger, though it became clear paying for months of zero content was their plan. Disney is just as bad. We're just paying for a library. As soon as the youngest is old enough to not break disks I'll probably dig out the player and cancel that too. Cancelled prime due to the ads.\n\nApple was doing the best, but the drip is slow, so we're waiting for content.  I'm not against reading a book or checking out from the library. I have always loved movies and tv, but what I love is story and novel content. \n\nI know a bunch of you are agrieved over cut and cancelled shows. I hear that, but I didn't much care as long as something was around to watch. I think we might move to streaming 3 months out of the year or something. \n\nBasic cable was somehow better, and I'm throwing up in my mouth saying that.\n\nBut maybe I'm just not being surfaced good content that exists? What we've liked (here or elsewhere): bsg, last air bender (not the live action), fullmetal alchemist, outlander, stranger things, lupin, sandman, wednesday, good place, severence, big door prize, lucifer, game of thrones, firefly, trek (Voyager, strange be worlds), bridgerton (i tolerate it), witcher, wheel of time, rings of power, umbrella academy, lockwood &amp; co, ted lasso, unstable, murder bot, pluto, mrs maisel, shadow and bone, upload, disenchanted, warehouse 13, eureka, cobra kai, lost in space, Westworld, merlin, dragon prince, community, andor, murder bot, arrested development, Queens Gambit\n\nProbably more too... But Netflix thinks I just like horror or trash romance. I actually kinda hate horror, it's only when the writing is very good that I get past that. I watched squid games (for the wife) and wouldn't choose to put myself through that again \n\nI've bounced off: black mirror, the boys, foundation, supernatural, most of the new star wars stuff, most of the new trek stuff, halo, most sitcom/reality stuff\n\nThen there stuff that I'd watch, but only if there's nothing else: altered carbon, top chef, mandalorian, and other stuff where the vision or writing isn't quite good, but I'll deal because it feels like they were trying.",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nzzgp7/running_out/"
    },
    {
        "id": "1o01983",
        "author": "Original2021",
        "title": "The missed opportunity in the Angela series",
        "content": "The series started off great but the ending fell so flat. And then there’s Angela’s friend who is also her lawyer. I thought the whole time the lawyer friend was in on it, but it turns out that’s not true. That was disappointing because the series spends a lot of time setting up for something else to happen and then in the last episode nothing. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o01983/the_missed_opportunity_in_the_angela_series/"
    },
    {
        "id": "1nytmw9",
        "author": "Last-Upstairs1387",
        "title": "What is a Netflix show you think deserved way more attention",
        "content": "I just finished watching The OA and honestly I cannot stop thinking about it. I had heard about it years ago but never got around to watching it until now. And wow. It was so different from anything I have seen before. Strange, emotional, and full of mystery. The way the story was told kept pulling me in. I kept wondering what would happen next.\n\nAfter I finished I looked it up and saw it had a lot of praise but was cancelled after only two seasons. That made me kind of sad because I really feel like it could have gone somewhere even bigger if it had more time. Netflix has so many shows that end up disappearing under the radar, even when they are really good.\n\nSo I wanted to throw this out to the community. What is a Netflix show you think deserved way more attention? Not the big ones everyone talks about, but those hidden gems that maybe only a small group of people know about.\n\nFor me The OA will stick with me for a long time. I keep thinking about its ending and the questions it leaves open. I wish more people had seen it so we could talk about it.\n\nI would love to hear your picks. Is there a show you watched on Netflix that surprised you and deserved more love? Something you wish had gotten more seasons or more people watching? I feel like this could turn into a great list of hidden gems we all need to check out.\n\n",
        "upvotes": 678,
        "comments": 928,
        "media": null,
        "permalink": "/r/netflix/comments/1nytmw9/what_is_a_netflix_show_you_think_deserved_way/"
    },
    {
        "id": "1nzsjrb",
        "author": "Timewilltell755",
        "title": "Did anyone start watching The Way Home?",
        "content": "Season 1 and 2 is on Netflix.  Originally on Hallmark.  So good.  Already half way through season 2.  There are 3 seasons.  Hopefully the 3rd one will be added.  ",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nzsjrb/did_anyone_start_watching_the_way_home/"
    },
    {
        "id": "1o030e0",
        "author": "Apprehensive-Site-25",
        "title": "Portrayal of Adeline Watkins in Monssters: Ed Gein show",
        "content": "Is anyone else appalled at the portrayal of Adeline Watkins in this new series?? Show spoiler: she’s straight up suggests to Ed that he dig up a body to be his girlfriend and then proceeds to help him grave rob. There’s no evidence anywhere that Adeline was suggesting things like this or involved in his crimes. If I was the family of Adeline I would be so incredibly upset at this portrayal. Just ranting/wondering what you all think!",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o030e0/portrayal_of_adeline_watkins_in_monssters_ed_gein/"
    },
    {
        "id": "1nzuffu",
        "author": "Aesrone",
        "title": "Why can’t this multi-hundred-billion dollar company properly keep track of where I’m at in a show?",
        "content": "If I watch half an episode of a show, I go back later and it either starts at the beginning or thinks I’m on the next one. If I pause Netflix on my TV for 10 mins and come back, it loses where I’m at and exits the app, doesn’t happen with any other service. If I watch half an episode on my iPad, then try and finish it on my tv, it loses my progress AND puts me back one or two episodes. \n\nAm I alone or does everyone deal with this? \n\n",
        "upvotes": 3,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1nzuffu/why_cant_this_multihundredbillion_dollar_company/"
    },
    {
        "id": "1o01tne",
        "author": "heirofadam",
        "title": "the residence",
        "content": "not gonna lie. it wasn’t until about halfway through this series when i realized they were saying “state dinner” rather than “steak dinner”. anyone else???",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o01tne/the_residence/"
    },
    {
        "id": "1o00sun",
        "author": "Eclipse8301",
        "title": "WWE Raw on Netflix question",
        "content": "So I used to have the version of Netflix that had ads. I recently moved to the ad free version, and I just realized tonight that I still get ads on the live programming. What I don’t understand is before with my ad free version I could start the show a half hour late and it would auto skip. The commercials had already were done until I caught up live. (the next day on demand I would be forced to watch them.)\n\nMy question is now I’m forced to watch ads even starting late. Is this something brand new?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o00sun/wwe_raw_on_netflix_question/"
    },
    {
        "id": "1nzlmyr",
        "author": "Onedeadchild",
        "title": "Not Part Of The Netflix Household",
        "content": "I don't have a photo of what I'm talking about but anyone who is struggling with figuring how to get around Netflix trying to get around not being on the same wifi just turn your device on airplain mode then open Netflix and sign in once in the show selection then just turn airplane mode off, it's the quiest and easiest solution. If anyone has any better ways please let me know I'm a broke college kid trying to mooch off my mom still.",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nzlmyr/not_part_of_the_netflix_household/"
    },
    {
        "id": "1nzjp0v",
        "author": "Sweaty-Toe-6211",
        "title": "Ginny &amp; Georgia S4 Is Now In Production! It'll Run Through To Late February.",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nzjp0v/ginny_georgia_s4_is_now_in_production_itll_run/"
    },
    {
        "id": "1nzsw76",
        "author": "mmmadness",
        "title": "'A House of Dynamite' Review: Kathryn Bigelow's American Nuclear Thriller Explodes in a Vacuum",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nzsw76/a_house_of_dynamite_review_kathryn_bigelows/"
    }
]