[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 485,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hrc6ol",
        "author": "S4v1r1enCh0r4k",
        "title": " Netflix Accidentally Leaks 'Squid Game' Final Season Release Date -June 27 ",
        "content": "",
        "upvotes": 197,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1hrc6ol/netflix_accidentally_leaks_squid_game_final/"
    },
    {
        "id": "1hr9xg9",
        "author": "MarlowInvests",
        "title": "La Palma - Ending really p***ed me off.",
        "content": "I've just finished watching the limited series of \"La Palma\", which I was really enjoying. Right up until the last 15mins of the last episode. So much so it's pi**ed me off.\n\nHow can someone survive a frigging tsunami after being hit with it whilst taking off in a plane? They must of been underwater for at least 15mins (that's being generous) whilst the rest of the island gets wiped out.\n\nThey should of ended it where she and her new girl friend died. \n\nHow does everyone else feel about the ending?",
        "upvotes": 27,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hr9xg9/la_palma_ending_really_ped_me_off/"
    },
    {
        "id": "1hqq5d8",
        "author": "Sudden_Pop_2279",
        "title": "‘Squid Game’ Season 2 Opens With 68 Million Views, Netflix’s Biggest TV Debut Ever",
        "content": "",
        "upvotes": 987,
        "comments": 138,
        "media": null,
        "permalink": "/r/netflix/comments/1hqq5d8/squid_game_season_2_opens_with_68_million_views/"
    },
    {
        "id": "1hr0xa7",
        "author": "No_Spinach_9309",
        "title": "loved squid game season 2. thought it was good",
        "content": "# so i kinda loved season 2. (also season 1) i think its crazy how much hate i saw on this sub about the season. just showed me not to go on reddid after watching shows, its so negativ. \n\nand some comments i see about the season are just weird. like the crirics for it. im like what do you mean? this didnt made sense? it wasnt unrealistic either. it totally did. or that the characters werent likeable or the acting wasnt that great. and even with more specific negativ reviews im like? the comments just dont make sense to me. also i didnt found it boring at all. i have the feeling people just want to watch extrem games and people dying. they dont care about the story. the only thing i hated was the ending lol. so sad",
        "upvotes": 65,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1hr0xa7/loved_squid_game_season_2_thought_it_was_good/"
    },
    {
        "id": "1hr3h5o",
        "author": "Kaleidoscope_Pure",
        "title": "Is House of Cards worth watching?",
        "content": "Always thought this is probably a good show, however things with Kevin Spacey went down really fast, and i think the show might end up kinda bad after he left.\nEven with all that, is it worth watching? ",
        "upvotes": 39,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1hr3h5o/is_house_of_cards_worth_watching/"
    },
    {
        "id": "1hr4d9o",
        "author": "S4v1r1enCh0r4k",
        "title": "Upcoming Netflix show American Primeval releases new trailer ",
        "content": "",
        "upvotes": 26,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hr4d9o/upcoming_netflix_show_american_primeval_releases/"
    },
    {
        "id": "1hqysej",
        "author": "badboy_1432",
        "title": "\"From the green tracksuit to...? The suspense is killing me! #SquidGameSeason3",
        "content": "",
        "upvotes": 76,
        "comments": 19,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/z422muj7dcae1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1hqysej/from_the_green_tracksuit_to_the_suspense_is/"
    },
    {
        "id": "1hrf5gk",
        "author": "mkebrewersfan",
        "title": "Thanks Netflix for making me feel old",
        "content": "\n\nWell,it happened. I just turned 30. Skimming through Netflix and there is a category that says “retro”….now when I think of Retro….i think of Herbie,Sanford and son,convoy,Star Wars,Dirty Dancing. \n\nSo,I start scrolling through them….\n\nBut,what did I see? All the shows I watched growing up…THAT’S RIGHT. Reba,Zoey 101,Fairly odd parents and when it really hit me……….Drake and Josh. \n\nTime flies so fast in this life. Thanks for reminding me of that Netflix. Always in a hurry. We don’t look at the present. I couldn’t wait to finish highschool,couldn’t wait to finish college,get married,have a career. To which I have done all of that. Even bought my dream vehicle. \n\nThanks for reading. Im off to watch Drake and Josh while I stroll down nostalgia avenue. \n\n",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hrf5gk/thanks_netflix_for_making_me_feel_old/"
    },
    {
        "id": "1hrc05v",
        "author": "H4RDCANDYS",
        "title": "Missing you ",
        "content": "Another mediocre Harlan coben show. I had high hopes for this one but it missed the mark for me. What are y'all opinions on \"missing you.\"  I can't get into Harlan coben shows. The only decent ones are shelter, and stay close in my opinion. ",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hrc05v/missing_you/"
    },
    {
        "id": "1hqzrxn",
        "author": "RhiAndroid1990",
        "title": "I’m so annoyed at the lack of old episodes uploaded for WWE Raw &amp; Smackdown",
        "content": "Me &amp; husband were watching all the old 2000 episodes on WWE Network, and now it’s moved to Netflix. Was excited. Saving 1 subscription and been a long Netflix subscriber but we wake up this morning and there are NINE episodes for 2000 &amp; 2001 and then it jumps to 2022. I’m pretty upset to be fair. ",
        "upvotes": 25,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1hqzrxn/im_so_annoyed_at_the_lack_of_old_episodes/"
    },
    {
        "id": "1hri1o1",
        "author": "NiceBat9877",
        "title": "Netfilx Character Elimination",
        "content": "Can someone make a Character Elimination x Netflix fanfic whenever is here on Reddit or Ao3 or Wattpad \nIt Will 41 Characters from anything on Netflix (like anime tv series cartoons and movie) inculding Netflix originals \nMake suggetions :)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hri1o1/netfilx_character_elimination/"
    },
    {
        "id": "1hr0yz6",
        "author": "techfinpro",
        "title": "‘Santa Clarita Diet’ Creator Victor Fresco Learned his Show was Canceled when Netflix took apart its Sets",
        "content": "",
        "upvotes": 9,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hr0yz6/santa_clarita_diet_creator_victor_fresco_learned/"
    },
    {
        "id": "1hrgdkg",
        "author": "Art_Poem71105",
        "title": "Deleted Account ",
        "content": "Question, can I use the same email after a year of deleting my netflix account?\n\nAsking as my friend is having a hard time trying to get on their account after deleting their account a month ago.\nThe message that they are getting is \"that this account already exist\" when they use the same email that they always had use for their netflix account.\n\nNeed to know as I deleted mine about four months ago and would want to know if I can use the same email if I were to created a new one with that same email after a year of deletion.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hrgdkg/deleted_account/"
    },
    {
        "id": "1hrfxc4",
        "author": "I_like_cookies_a_lot",
        "title": "Does anyone know how to access a list of movies with the ‘most liked’ tag?",
        "content": "I’ve almost always enjoyed the shows and movies with the ‘most liked’ tag on them, but can’t seem to search directly for the tag or easily find a list online.\n\nDoes anyone know a good way to find a list of them?\n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hrfxc4/does_anyone_know_how_to_access_a_list_of_movies/"
    },
    {
        "id": "1hre2s1",
        "author": "seal973",
        "title": "Suggestions for Shows to Binge during holidays/NYE break",
        "content": "Hi guys \n\nI have been scrolling around Netflix, unsure what to watch for days. I am looking for something that will get me so hooked I will stay up till 5 am watching it. Also going through a break up so I need a good healthy distraction, gotta be extra good for the escapism!! Any reccs is good but nothing toooo heavy ",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hre2s1/suggestions_for_shows_to_binge_during_holidaysnye/"
    },
    {
        "id": "1hr0pmm",
        "author": "TinyZookeepergame292",
        "title": "Harlan Coben's Missing You. Kat is a detective but cannot detect anything???",
        "content": "So we have just started the series and are flabbergasted with how incompetent Kat is at doing detective work. Her friend who is a private investigator and a kid who is looking for his missing mother do more detective work than her. \n\nIn the most problematic scene for me, Stacey finds out that the missing ex fiance was arrested 11 years ago. How can Stacey find this information but not Kat who is an actual police officer? This is beyond irritating. ",
        "upvotes": 7,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hr0pmm/harlan_cobens_missing_you_kat_is_a_detective_but/"
    },
    {
        "id": "1hrcvvv",
        "author": "Jamez_Neckbeard",
        "title": "Thinking of signing up for the standard withbads package. Just how many adverts do you get?",
        "content": "I stopped my subscription maybe 18 months ago but am thinking of signing back up. How many adverts do you get with the advert package. I'm obviously used to terrestrial tv adverts and don't mind those . ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hrcvvv/thinking_of_signing_up_for_the_standard_withbads/"
    },
    {
        "id": "1hrbs14",
        "author": "diamondeyes7",
        "title": "Looking for romance or romance/fantasy TV series!",
        "content": "I just read the first 2 books of the ACOTAR (A Court of Thorns and Roses) and now I'm craving some romance lol.\n\nI don't typically watch romance but I'm not looking for some of Netflix's recommended romances like Grey's Anatomy, Nobody Wants This, etc.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hrbs14/looking_for_romance_or_romancefantasy_tv_series/"
    },
    {
        "id": "1hr18wu",
        "author": "Stunning_Ad6376",
        "title": "Profile issue on fire tablet ",
        "content": "Hi\nI'm having an issue watching Netflix on an Amazon fire tablet, it suddenly after working for years, loads 12 and under profiles and closes when selecting a 15 or 18 profile.\n\nI've tried everything suggested for errors I've found on the net: clearing cache, checking for system and app updates, restarting the device, deleting and reinstalling the app.\n\nAnyone had a solution for this problem?\n\nThank you",
        "upvotes": 5,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1hr18wu/profile_issue_on_fire_tablet/"
    },
    {
        "id": "1hqx0s4",
        "author": "Vojuln3",
        "title": "Don't Die: The Man Who Wants to Live Forever - Discussion Thread\n",
        "content": "How far would you go to live forever - or even just slow down the aging process? This startling documentary by Chris Smith (Fyre, 100 Foot Wave) is told through intimate access to Bryan Johnson, a man who has dedicated his life to defy aging. Don't Die: The Man Who Wants to Live Forever dives into the controversial wellness practices one man is using to maintain youth and vitality, and the effect this journey has on himself and those around him.\n\nReleased today on Netflix\n\nTrailer: [https://www.youtube.com/watch?v=kf9e1o7rUeo](https://www.youtube.com/watch?v=kf9e1o7rUeo)",
        "upvotes": 12,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hqx0s4/dont_die_the_man_who_wants_to_live_forever/"
    },
    {
        "id": "1hra6n7",
        "author": "xxXtopazXxx",
        "title": "updating payment method",
        "content": "Let’s say you have an unsuccessful payment one month because you didn’t have enough funds and Netflix emails you to change payment method, does the hyperlink they send you not make you sign in? Just shows card info? (Only add a cvv)",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hra6n7/updating_payment_method/"
    },
    {
        "id": "1hr8ufa",
        "author": "gnshgtr",
        "title": "15 Must-Watch Magical Movies for Fans of Wonka in 2025",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hr8ufa/15_mustwatch_magical_movies_for_fans_of_wonka_in/"
    },
    {
        "id": "1hrcl03",
        "author": "bird_kicker",
        "title": "I need help finding a show",
        "content": "Ok so, I remember watching a show a few months ago and I do not remember the name. I'm like 85% sure it's from Netflix but I have no memory of the name, neither do the people I watched it with.\n\nHere's what I remember;\nIt stars a girl she's a vlogger and she's like some sort of hacker, she's knows how to dig up information about almost anything. Later she's on the phone with her dad and he gets kidnapped and she goes on trying to find him.\n\nShe meets this guy with a criminal record working in a ski shop I think who is being blamed for the murder(or disappearance) of a different girl. The join teams and start uncovering information that leads them to learn about a clut.\n\nThus cult revolves around a guy that a bunch of people support and they do smth with ashes like mark people, I think.\n\nI think the dad had like a video storage thing a.d they start watching these cult videos and see the guys mom when she was younger, and how she was in the cult.\n\nThey later found out that this lady was also the girls mom (after birth had fucked I'm pretty sure, idk weird plot) and they want to get it over with.\n\nThere's a subplot with an officer and her kid where he goes on a field trip into a cave and wanders into cult territory.\n\nThus may be wrong but I needed to finish this series it was so good.\n\nAny help would be great!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hrcl03/i_need_help_finding_a_show/"
    },
    {
        "id": "1hr2c1d",
        "author": "GatoMorato",
        "title": "During a trip inside the EU, can you watch the own catalog from each country?",
        "content": "I'm from the EU and I wonder if I can watch for example the Italian top series the days I jump there, and the same with France and Spain ones. I really like watching that \"exclusive\" catalogue while traveling!\n\nIve Just read in the Netflix website that inside the UE the content remains several days 😒 but perhaps there is a way to watch it like when I go to the UK.\n\nPS: the same may work with Amazon Prime Video..?\n\nThanks in advance! ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hr2c1d/during_a_trip_inside_the_eu_can_you_watch_the_own/"
    },
    {
        "id": "1hreeai",
        "author": "Striker919",
        "title": "Low Netflix quality after using my account on a smart tv",
        "content": "Hi everyone, I have a problem that I really can’t solve. I used the Netflix app with premium profile on my LG Oled TV, maximum quality. Since I connected my account on an older TV, it seems that now on all devices Netflix starts with low quality, increases after a while but no longer reaches the same as before. I have already tried to uninstall the app, the quality is already set to high between “high, medium, low and auto” in the web settings, and my network is fast. What can I do?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hreeai/low_netflix_quality_after_using_my_account_on_a/"
    },
    {
        "id": "1hqt38y",
        "author": "citrusgrimm",
        "title": "Does it bother anyone else when you select a show and you get a review instead of the description of the show? ",
        "content": "It's definitely a pet peeve of mine. I just wanna know what this show/movie is about, you want me to go in blind? I know I can just look up the movie/show but I shouldn't have to. Am I wrong about this opinion? \n\n",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hqt38y/does_it_bother_anyone_else_when_you_select_a_show/"
    },
    {
        "id": "1hrd1xf",
        "author": "sensations52",
        "title": "How many of you guys subscribed back to Netflix because of squid games 2?",
        "content": "I'm still able to use a friend's account so i was able to watch it. Like the fake fan i am, i didn't watch it in 1 day. MAybe it took me 3-4 days. I was willing to buy the membership if netflix kicked me out. \n\n  \nOh, also, can this be watched on the ad tier? thanks!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hrd1xf/how_many_of_you_guys_subscribed_back_to_netflix/"
    },
    {
        "id": "1hr4kxa",
        "author": "Lovepeacepositive",
        "title": " Torch 2024 roasting special",
        "content": "I guess originally streamed on Dec 27th but recorded the 17th of December. It seems kind of short (42 min) and it drives me insane when Netflix decides to censor so they cut stuff like they did for Brady’s (Luckily I did watch that one live!!). Also, most likely the reason it wasn’t done live. Who was there in person and can tell us all the good stuff they cut out?!?! Damn censorship, there is no way they only had 42 min of material… seems like they cut at least 18 min, so what did we miss?   ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hr4kxa/torch_2024_roasting_special/"
    },
    {
        "id": "1hr41ia",
        "author": "Princess_CeNedra",
        "title": "My smart TV doesn't open my Netflix account anymore - just shows black screen",
        "content": "I don't know if it's problem of Netflix or the Tv, because Netflix is working on my phone. However, when I try to enter netflix on my TV, there is only a black screen.\nHow can I solve this?\n(TV brand is Hisense)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hr41ia/my_smart_tv_doesnt_open_my_netflix_account/"
    },
    {
        "id": "1hrc8v9",
        "author": "JOMO_Kenyatta",
        "title": "So we’re just stuck with most of vintage raw gone?",
        "content": "I was basically bouncing between wcw and raw up to the attitude era and I just purchased Netflix again to continue. I saw they had the raw vault set up, really should have peeked at the episode listings first. But I assumed Netflix of all companies would have their shit together. Is the rest of this going to be brought to Netflix or eventually or are we fucked?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hrc8v9/so_were_just_stuck_with_most_of_vintage_raw_gone/"
    }
]