[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 109,
        "comments": 334,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mofhb7",
        "author": "indiewire",
        "title": "IndieWire names Guillermo del Toro's \"Frankenstein\" as one of 53 of their most anticipated fall movies.",
        "content": "",
        "upvotes": 53,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1mofhb7/indiewire_names_guillermo_del_toros_frankenstein/"
    },
    {
        "id": "1moq875",
        "author": "OCapalot14",
        "title": "Best Netflix Shows of all time",
        "content": "Stranger Things\n\nDark\n\nBlack Mirror\n\nBoJack Horseman\n\nOzark\n\nArcane\n\nCobra Kai\n\nHaunting of Hill House\n\nYou\n\nOrange is the New Black \n\nSex Education \n\nOuter Banks\n\nWednesday \n\nMindhunter \n\nSquid Game\n\nBridgerton\n\nLupin\n\nWeak Hero\n\nNever Have I Ever \n\nAlice in Borderland \n\nBeef\n\nThe Crown\n\nNarcos \n\nMoney Heist\n\nUmbrella Academy \n\nLocke and Key\n\nOne Piece (Live action)\n\nBlue Eye Samurai \n\nNot in any particular order btw\n\n\n",
        "upvotes": 9,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1moq875/best_netflix_shows_of_all_time/"
    },
    {
        "id": "1morcm5",
        "author": "Mental_Low_7944",
        "title": "Do you ever feel like time is moving quickly now? That could be because of how long your favorite shows have been taking to come out with new seasons.",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1morcm5/do_you_ever_feel_like_time_is_moving_quickly_now/"
    },
    {
        "id": "1mnu8dy",
        "author": "L0v3_1s_War",
        "title": "HUNTR/X’S ‘GOLDEN’ from ‘KPOP Demon Hunters’ Hits No. 1 on Billboard Hot 100",
        "content": "",
        "upvotes": 144,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1mnu8dy/huntrxs_golden_from_kpop_demon_hunters_hits_no_1/"
    },
    {
        "id": "1morjid",
        "author": "Longjumping_Wolf_781",
        "title": "My Oxford Year Movie vs. Book",
        "content": "Did anyone else read the book and LOVE it but then HATE the movie? I mean practically everything was changed. First and foremost - having a degree in literature doesn’t qualify her to be a financial analyst? I guess technically she could have done internships or whatever BUT STILL I felt like a big part of the beginning of the book was that it’s her first time studying literature at a higher level and that was how the contrast was created between her studies at Oxford vs. her career in DC. I feel like everything that was good was taken out. Every scene was either changed or replaced entirely by a new scene. A lot of the characters were portrayed different in the movie from how they were written. I never expect an adaptation to be spot on but if they really wanted to change everything then why even call it an adaptation at that point? Just write a different story!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1morjid/my_oxford_year_movie_vs_book/"
    },
    {
        "id": "1moqa4f",
        "author": "PositiveAd537",
        "title": "Macbook screen flickering",
        "content": "Just got a new macbookOS which was used before first time watching netflix on it and my screen flickers only on Netflix I readjusted the mouse many times it works but it doesnt solve the problem fully it just happens every once in awhile so I have to keep changing the mouse size how can I solve it fully? And what may be causing the problem?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1moqa4f/macbook_screen_flickering/"
    },
    {
        "id": "1moen2v",
        "author": "Large_Basket_5440",
        "title": "One Hundred Years of Solitude - second part?",
        "content": "I have really enjoyed the first part of the series but when I looked online, I couldn’t find any information around when (or if) will be the second part aired. Did I miss any news or there were no news around the series? \n\nI had really low expactations about the series as a huge book fan before watching - but now I am desperate for the next part. \n",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1moen2v/one_hundred_years_of_solitude_second_part/"
    },
    {
        "id": "1mofw7o",
        "author": "Realistic-Relief3865",
        "title": "Just finished the watcher",
        "content": "I honestly don’t know how I feel about it. A part of me wants to hate it because it just felt so messy and unsatisfying by the last episode.  I saw a lot of people being annoyed that the watcher wasn’t revealed but i felt like it was pretty obvious that it was the neighbours, especially when you consider them being in the tunnel, their group about conserving the houses, everyone getting letters once they have a bad interaction with them, and the fact that the man is a librarian and they mentioned theres a typewriter. One thing that annoyed me badly was the tunnels, they were so desperate to find out but yet didn’t go and explore the tunnels better themselves, the answer literally could have been revealed by then. Another thing that annoyed me was the fact that when the two ladies invited Nora over, she hears the thuds, left looking terrified, just to never bring that up again. I really wanted to like it and I felt like it could’ve been great if they actually properly worked on the storyline. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mofw7o/just_finished_the_watcher/"
    },
    {
        "id": "1moo3h8",
        "author": "graemeisverytired",
        "title": "Filming The Thursday Murder Club on Netflix felt more like a college reunion than working, according to Helen Mirren and Pierce Brosnan",
        "content": "“But you know the great thing about Thursday Murder Club,” explained Helen Mirren. “Was that we all kind of knew each other. I mean, I’d worked with Ben – Sir Ben, Sir Ben – in the theater when we were in, like, in our early 20s. So we knew each other really, really well.”\n\nMore: https://www.thepopverse.com/movies-the-thursday-murder-club-cast-helen-mirren-pierce-brosnan-college-reunion-vibes-jimmy-fallon-the-tonight-show",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1moo3h8/filming_the_thursday_murder_club_on_netflix_felt/"
    },
    {
        "id": "1moejzy",
        "author": "guesthost1999",
        "title": "Anyway to see if you watched a movie?",
        "content": "I got half way through a movie before everything came back to my head and realized I watched it already.\n\nWould be great if there was a way to show if/when a show was watched previously.",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1moejzy/anyway_to_see_if_you_watched_a_movie/"
    },
    {
        "id": "1momrc3",
        "author": "Tobermory-",
        "title": "Low quality on Netflix app",
        "content": "For some reason this past month or so the Netflix app on my phone has been playing at no more than 720p for 99% of the time. Ive checked in the app settings and I’ve got it on streaming in highest quality and highest data usage, my WiFi is around 800mbps, and it’s streams in perfect 1080p on every other device I watch on through the same account. I’m on an iPhone 11 so I don’t know if that’s the issue but otherwise I’m stumped, does anyone have an answer?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1momrc3/low_quality_on_netflix_app/"
    },
    {
        "id": "1momgpo",
        "author": "RestlessRhys",
        "title": "Is it worth watching Wednesday season 2?",
        "content": "I liked season 1 but I'm two episodes into season 2 and i have no interest so far, does season 2 have anything worth continuing for? Or should i skip it and watch something else instead?\n\n(Obviously no spoilers as I might return to it in future)",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1momgpo/is_it_worth_watching_wednesday_season_2/"
    },
    {
        "id": "1moj85z",
        "author": "omerhaim",
        "title": "Installing Netflix on iOS 15",
        "content": "Hey\nI had to erase my son iPad that had Netflix installed on it, now I can’t install Netflix the minimum iOS version is higher. 16 or 17 \nAnything I can do to get it installed?\nTried safari, it directs to the App Store ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1moj85z/installing_netflix_on_ios_15/"
    },
    {
        "id": "1mo9fkx",
        "author": "YisusButAtWhatCost",
        "title": "So i finally start Dexter..",
        "content": "After seeing most of the show through Youtube Shorts for at least a year, i finally open netflix and start seeing it, even if i saw most major spoilers, i still find myself entertained watching it, can’t comprehend how didn’t notice this show back years… still, is worth it",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1mo9fkx/so_i_finally_start_dexter/"
    },
    {
        "id": "1mohxvc",
        "author": "Available_Clothes_18",
        "title": "Glitchy when \"Use graphics acceleration when available\" turned on",
        "content": "Hi, I use Google Chrome on my laptop, and when the \"Use graphics acceleration when available\" settings is turned on, Netflix glitches when in fullscreen. The screen is kind of \"jumpy\"  it makes it unwatchable.\n\nThe problem is, if I turn off the setting in Chrome, then it's Youtube that glitches in fullscreen, and some websites like Canva stop working properly.\n\nIm tired of having to turn it on/off all the time. Is there a definite way to make Netflix work properly on Google Chrome while still having the setting turned  on?  And without having to use another browser.\n\nBy the way this setting is in Chrome Settings &gt; System &gt; Use graphics acceleration when available\n\nthanks",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mohxvc/glitchy_when_use_graphics_acceleration_when/"
    },
    {
        "id": "1mo9akg",
        "author": "Beautiful_Belt4306",
        "title": "Odd sound issues",
        "content": "Netflix makes sound when you click on an account, the boot up sound if you will. But, once you click on a show, nothing. I've tried closing the app via the \"Get Help\" button, also changed off the HDR selection in hopes of that changing it. I'm using the RCA Smart TV app, no third-party speakers. Every other app plays sounds perfectly. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mo9akg/odd_sound_issues/"
    },
    {
        "id": "1mnp3fl",
        "author": "sirius_2025",
        "title": "Wednesday first episode puppy review",
        "content": "Netflix owes my 5 month old puppy an apology for being so scary! It should come with a puppy rating 😅 He was on edge every time he heard a bird for the rest of the episode ",
        "upvotes": 31,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/y9i08tbufgif1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mnp3fl/wednesday_first_episode_puppy_review/"
    },
    {
        "id": "1moc090",
        "author": "Disastrous_Bedroom60",
        "title": "Finding a series",
        "content": "Hi everyone (delete if not allowed ) I remember watching a series on netflix maybe as far back as 2015. It was a series about food and why certain food became famous in certain places. For example the first 2 episodes consisted of NY and how the water became integral to the rise in falafels (i think) and the next episode was how a girl rescued the original sourdough mix during the san Francisco fire. It also gave a brief history on how the cities originated. I've tried everything, even going back through my viewing history with no luck. I'm beggining to think I've imagined this ! Any help would be appreciated",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1moc090/finding_a_series/"
    },
    {
        "id": "1mob6ki",
        "author": "Capable_Transition97",
        "title": "Help me find a show",
        "content": "All I remember about it is the character dynamics so the main character is a blonde boy who uses a sword he also has a master that turns into a monster in like the later half of the first season the main heroine is a girl with brown hair who uses magic and also start to date one of the main villains that turned good he also killed the girls master  so now it’s this low triangle between the mc main heroine and bad guy it had a second season that ended on a cliffhanger with them entering a new realm also pretty sure the bad guy uses a ice sword or some sorta ice power ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mob6ki/help_me_find_a_show/"
    },
    {
        "id": "1mo3m6o",
        "author": "ShinyRockAid",
        "title": "Restaurant War Thailand",
        "content": "I’m really loving this show A LOT. I hope it will be popular like the Culinary Class Wars. Anyway, asking it because I haven’t seen any blogs or lists on the internet, so I’d like to know the locations of the contestants’ food stalls/restaurants I would really love to visit them as soon as I get back in Thailand. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mo3m6o/restaurant_war_thailand/"
    },
    {
        "id": "1montwv",
        "author": "DepartmentAdept5045",
        "title": "Shady business practice.",
        "content": "Can we talk about how Netflix is being shady af, and releasing one season of a show over a few months, so that people have to pay for multiple months of a subscription? It’s really starting to irritate me. They just did it with Wednesday, and they’re about to do it in a few months with stranger things. They stretch out EIGHT EPISODE SHOWS, over 3 months so that people who would usually watch the show and then cancel their subscription HAVE to sub for more months to get the full season. I wouldn’t even be mad if they released it like one episode a week because that’s how live tv has worked forever, but no, this way 8 episodes would only be 2 months worth of subscriptions and they wouldn’t be milking another month out of you. I’ve literally ALWAYS had my subscription, and don’t cancel it, so I don’t even care about the money aspect, I’m just irritated I have to wait ridiculous amounts of time to finish one season of a show. Because they wanna squeeze people for all they possibly can. Sorry I’m just annoyed and hate cliff hangers. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1montwv/shady_business_practice/"
    },
    {
        "id": "1monts6",
        "author": "Money_Dealer1918",
        "title": "Why is a show like Wednesday so popular?",
        "content": "Apparently, Season 2 broke Season 1’s record with 54 million views in just the first five days. I just don’t understand how far better shows get nowhere near that level of recognition, while Wednesday, with its mediocre writing and cringeworthy dialogue, becomes such a massive hit.",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1monts6/why_is_a_show_like_wednesday_so_popular/"
    },
    {
        "id": "1mo5o62",
        "author": "riosunset",
        "title": "New on Netflix",
        "content": "Just finished Department Q which I loved and binged in 2 days. Any recommendations for anything similar / new? \nI seem to be stuck in limbo of everything I like beibgbin mid season break / end of season\nThe rookie. 911. Greys anatomy. Criminal minds. \nFinished station 19 recently and sad it’s over. ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1mo5o62/new_on_netflix/"
    },
    {
        "id": "1mo1yc6",
        "author": "p1ssc0nsum3r",
        "title": "help finding a good show",
        "content": "hello everyone:)\ni have been looking for shows to watch, ive been watching a lot of movies recently. i have a hard time finding shows i truly enjoy, because truthfully i am kind of picky😭 the shows i can think of that i really really enjoyed were Lost, the 100(except the last season of these shows got sorta weird and i didnt finish either), money heist, the end of the f'ing world, and shameless. netflix does have bangers, you sometimes just have to dig if you kind of have a certain preference. the movies i enjoy are like The electric state, Choose or die, Antiviral (with caleb landry jones), Bug (with ashley judd), Its whats inside, The florida project, The butterfly effect, and i also enjoyed Spree and We need to talk about Kevin. i know some of those arent on netflix, but just to give everyone an idea. a lot of psychological shows/movies. i often have a  difficult time finding a show on netflix that will make me want to binge like i did the 100❤️. if anyone else also likes these kinds of shows/movies help a sister out and lmk what u have been watching because im soo bored and need something",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mo1yc6/help_finding_a_good_show/"
    },
    {
        "id": "1mo8r2e",
        "author": "Mattyman2004mom",
        "title": "Good netflix movies",
        "content": "I cant seem to find good movies on netflix, i find a lot of good movies but they are only on apps like hbo max and others. The movies can also be on disney+ anybody know?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mo8r2e/good_netflix_movies/"
    },
    {
        "id": "1mnoet8",
        "author": "Timely-Hovercraft-76",
        "title": "I’m thinking of watching rebel ridge tonight. Has anyone watched it and is jt good?",
        "content": "Thinking of watching Rebel Ridge tonight. The trailer caught my attention. I’m not expecting AAA quality, just hoping it’s at least fun. Is it worth it? ",
        "upvotes": 10,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1mnoet8/im_thinking_of_watching_rebel_ridge_tonight_has/"
    },
    {
        "id": "1mo00t0",
        "author": "Murdoc427",
        "title": "14 day sign out so annoying",
        "content": "I get netflix through my phone plan, but because im in the navy on deployment I have to constantly ask to be temporary family member because its based off home wifi. So annoying",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mo00t0/14_day_sign_out_so_annoying/"
    },
    {
        "id": "1mok44i",
        "author": "Porncritic12",
        "title": "how are Netflix and Sandler benefiting from their deal at this point?",
        "content": "happy Gilmore 2 got a bunch of views on Netflix, and everyone said that this was proof that it was a good deal for both of them, but doesn't that prove the opposite?\n\nSandler could've released the film in theaters and made way more money than the $2 million at most that Netflix pays him per film, he would also have more creative control.\n\nNetflix could just let him release the films in theaters and then buy the streaming rights to them for far less, without having to spend nearly as much money, they could license the film for $10 million instead of spending 80 million making it, and if it flops, they don't take any of the risk, they just don't buy the rights to the film.\n\nhow Is this a good deal for either side when both of them could make more money releasing the movies the regular way?",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1mok44i/how_are_netflix_and_sandler_benefiting_from_their/"
    },
    {
        "id": "1mnwtla",
        "author": "UnicornVoodooDoll",
        "title": "The Residence: the blink and the note SOLVED",
        "content": "MAJOR SPOILERS for the end of The Residence!\n\nI think I figured out the issue with Lilly's blink and the note! I looked a bit to see if anyone else has already explained this but didn't see anyone so if I'm just super unobservant I apologize.\n\nThe problem we all have is that Cupp claimed that knowing about the note in the jacket pocket identified the killer, because only the killer could have known it was there prior to the discovery/investigation. Lilly claimed to have seen Bruce put the note in Wynter's jacket, which Cupp would find later.\n\nThe problem is that anyone could have told her the note was found in his jacket, and in her version of events she \"knew\" it was there because she \"saw\" Bruce put it there. Lilly could absolutely know the location of the note in her version of events, making the fact that she had the location of it not a gotcha at all.\n\nSo what was Cupp getting at when she said that detail identified her as the killer?\n\nIn order to understand this, we have to do what Cupp taught us to do earlier in the season - establish context.\n\nThe Lilly reveal and the investigative hearing are intercut with one another. What is happening in the hearing is giving us context for Cupp's frame of mind during the reveal.\n\nThe biggest thing she emphasized to the committee was all about context and possibility. She had to entertain the idea that Elsyie and Bruce and Doumbe were ALL innocent. That there was a fourth person.  She needed to consider this option, and she did.\n\nBefore Lilly's \"blink\" Cupp jumped up on the table and announced that the existence of the door meant that anyone in the room could have done the crime. THIS was her flashing her wings.\n\nShe then made a point of saying \"If I'm wrong (about none of the most likely guilty three being involved), one [points to Bruce] of [points to Elsyie] you [points to Doumbe] definitely did it.\" This is her establishing that she was operating under the assumption that the three of them were NOT involved. She was entertaining the possibility that the three were already ruled out.\n\nIf she was wrong about ruling them out and flashing her wings and no one blinked, it was safe to put the three back in the running as the killer. But if she was right and the flash revealed someone else...\n\nSo if Bruce, Elsyie, and Doumbe were not involved at all, HOW did the note get in the jacket?\n\nLilly admitted to being in possession of the note right up to Wynter's death. The note needed to go from her possession into Wynter's jacket. Either Wynter put it there himself or the murderer put it there, but no other person was in possession of the note between Lilly tearing it out and it being placed in Wynter's jacket.\n\nKnowing, not WHERE the note was, but the sheer fact that the note DID return to Wynter, was what gave her away, because only the killer could have known (not WHERE it was, but) HOW he got the note back after Lilly tore it out.\n\nIn Lilly's story, the note goes from her to Wynter via Bruce, making Bruce the last known possessor of the note. Without Bruce - and again, this was the CONTEXT Cupp was operating under at the time - there is no one in possession of the note between Lilly tearing it out when he was alive, and it being discovered in his jacket when he was dead. Lilly's own admissions give us no reason to believe otherwise.\n\nSo if the three - and Bruce in particular - weren't there for the murder, the only way the note gets from Lilly to Wynter is if she gave it to him at the time of the crime. If she had given him the note earlier and not been connected to that period of time, she would have had no reason whatsoever not to share that fact, as it distanced her from the crime. But she herself admits having it up until his death. This is how, if Bruce, Elsyie and Doumbe were not there, Lilly's the only possible suspect.\n\nAnd here's a huge piece of the puzzle: WHY did Lilly tear a page out of Wynter's journal? What possible scenario could allow this detail to happen? Why would Wynter's journal be in her presence, much less the target of her anger?\n\nI think it's because of Wynter's records. I believe that Wynter showed her the journal when he threatened to expose her, and Lilly, realizing that the journal was his record of her crimes, tried to take it from him, but he wrestled it away from her and she only tore out a scrap.\n\nIf Lilly had just said nothing about the note, she could have gotten away with it. If she'd not given such a specific detail, she could claim that, for example, she left it at his desk, or lost it, or even not tell anyone she tore it out in the first place.\n\nTelling Cupp she had the note up until his death was one detail too many, and in the CONTEXT of the other three NOT being in the room, identified her as the only possible killer.\n\nSo when Lilly was the only one to \"blink\" at the flash of Cupp's wings, in conjunction with the fact that she alone had the note she herself tore out of Wynter's journal, along with her overwhelming motive, she made any other culprit impossible.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mnwtla/the_residence_the_blink_and_the_note_solved/"
    },
    {
        "id": "1mnreli",
        "author": "Pristine-Bar7453",
        "title": "Season 2 Wednesday opinions? No Xavier why?",
        "content": "So I started watching the new Season after watching the first one bc yes I never watched it before. It gives me an immediate comparison and after watching Ep 1 of the new season so far I’m not getting into it at all. Honestly the fact that Xavier is not in it is a huge loss for the show, I googled why he’s not in it and it’s just ridiculous. Nothing has been said officially! I read he has been seeing working the door at some bar …not sure if it’s true. But whatever happened to him getting cancelled so easy. It’s just weird. To me he was a huge part of the series and the storyline between him and Wednesdays in my opinion was the most interesting one! I’ll obviously continue watching just to see if it gets better but I’m actually upset he’s not in it. He was to me the most interesting character, artistically, of all besides Wednesday of course! What do y’all think? ",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1mnreli/season_2_wednesday_opinions_no_xavier_why/"
    }
]