[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 492,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i40qdy",
        "author": "No_Order3035",
        "title": "Squid game in India! ",
        "content": "",
        "upvotes": 88,
        "comments": 7,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/cvmk5oarvode1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1i40qdy/squid_game_in_india/"
    },
    {
        "id": "1i3bxpg",
        "author": "Robemilak",
        "title": "Interstellar got an epic billboard to promote its release on Netflix",
        "content": "",
        "upvotes": 1309,
        "comments": 70,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/l8a16rg6mide1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1i3bxpg/interstellar_got_an_epic_billboard_to_promote_its/"
    },
    {
        "id": "1i3dd6d",
        "author": "EthanWilliams_TG",
        "title": "Adam McKay Reveals 'Don't Look Up' Was 'Hated' by Critics but Watched by 400 Million to 500 Million on Netflix",
        "content": "",
        "upvotes": 646,
        "comments": 155,
        "media": null,
        "permalink": "/r/netflix/comments/1i3dd6d/adam_mckay_reveals_dont_look_up_was_hated_by/"
    },
    {
        "id": "1i3bpgb",
        "author": "Whobitmyname",
        "title": "Adam McKay Says ‘Don’t Look Up’ Was ‘Hated’ by ‘Critics and Cultural Gatekeepers’ but Seen by an Estimated ‘400 Million to Half a Billion’ People on Netflix",
        "content": "",
        "upvotes": 679,
        "comments": 104,
        "media": null,
        "permalink": "/r/netflix/comments/1i3bpgb/adam_mckay_says_dont_look_up_was_hated_by_critics/"
    },
    {
        "id": "1i3kyrz",
        "author": "Rocknrollsk",
        "title": "American Primeval: as a Frenchman I’m offended.",
        "content": "No, I’m just kidding.  \n\nBut seriously, I’ve seen a lot of talk about how the Native Americans and Mormons are portrayed, but nobody’s talking about that crazy shit with the French.  What the fuck.",
        "upvotes": 136,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1i3kyrz/american_primeval_as_a_frenchman_im_offended/"
    },
    {
        "id": "1i3qi0w",
        "author": "FradiTomi",
        "title": "Netflix’s Biggest Shows Will End This Year – What’s Next After 2025?",
        "content": "Stranger Things, Squid Game, You, Cobra Kai all ends this year with their final season and also we get Wednesday Season 2 this year, but let’s be real—it’ll probably be at least 2028 before we see Season 3 (if there is one). So apart from Bridgerton whats left for next 2-3 years after 2025 for Netflix? Yes there are couple of good series which I did not mention in this post, but these ones have their biggest viewership.",
        "upvotes": 61,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1i3qi0w/netflixs_biggest_shows_will_end_this_year_whats/"
    },
    {
        "id": "1i3yt51",
        "author": "lost_taco_cat818",
        "title": "Something Spooky w/the Netflix Roku app",
        "content": "I opened my Netflix app on a smart TV with Roku and the picture looks really weird. It’s very pixelated and there are random spots of black. It’s happening on every movie/show on the app. Is this happening for anyone else? ",
        "upvotes": 6,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vi6c98z2bode1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1i3yt51/something_spooky_wthe_netflix_roku_app/"
    },
    {
        "id": "1i3s6ot",
        "author": "DiskoKittyy",
        "title": "Netflix to Release Greta Gerwig's Narnia Film in Theaters Before Streaming",
        "content": "",
        "upvotes": 15,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3s6ot/netflix_to_release_greta_gerwigs_narnia_film_in/"
    },
    {
        "id": "1i2s8o0",
        "author": "CautionCurb",
        "title": "Black bars showing on side even though tv is correct size.",
        "content": "Tried finding something in the settings to adjust aspect ratio but couldn't find anything. Does anyone know how to get rid of the black bars on the side? I'm literally using a tv that would fit the exact size of the show.",
        "upvotes": 1222,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/1i2s8o0/black_bars_showing_on_side_even_though_tv_is/"
    },
    {
        "id": "1i3hohf",
        "author": "Robemilak",
        "title": "A DIFFERENT WORLD IS COMING TO NETFLIX. Get ready to head back to Hillman on February 7.",
        "content": "",
        "upvotes": 19,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3hohf/a_different_world_is_coming_to_netflix_get_ready/"
    },
    {
        "id": "1i3azrl",
        "author": "th3_pund1t",
        "title": "Netflix donating $10M towards LA wildfire relief",
        "content": "",
        "upvotes": 61,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3azrl/netflix_donating_10m_towards_la_wildfire_relief/"
    },
    {
        "id": "1i3znm3",
        "author": "Electrical_Pay_6916",
        "title": "“Maestro in blue” similar series",
        "content": "Hello Netflix!\nRecently I watched “Maestro in Blue” series on Netflix ,it was the best show I’ve ever seen ,totally like it and I start to watch “dark” series ,but I feel I lost , I need the love ,the romance in the show to feel it , while “dark” is rigid somehow ,so I need your suggestions to any series similar to Maestro in blue ,,,thank u !",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3znm3/maestro_in_blue_similar_series/"
    },
    {
        "id": "1i3yqmx",
        "author": "rebuil86",
        "title": "Create a dialogue audio boosted version so i can stop relying on subtitles",
        "content": "Netflix application on smart TVs. Even when selecting stereo, and removing 5.1 makign sure its as good as it can be, simply can not be watched. Its imppossible, My wife has watched me screaming at how stupid teh wrold has become becasue the days of pluggin in a red and white cable and being ab le to watch a movie, are gone. its a giant scam now. Forcing you to spend thousands to buy a dobly digital receiver with a center channel with special modes, jsut to watch the movie your paying for.  \nNow, im not a fool, i understand what im talking about. My TV only ahs optical output, ive tried a soundbar, hiopeless vocals, so i upgraded to all icould afford, a bookshelf monitor system., edifier r1280db. Im really angry becuase thay hasnt helped. It recieves PCM only, so i have the TV set to that, and even if i choose stereo in netflix, its unusable, at maximum volume, there is absolutely no way one could make out peopls voices, subtitles are required.   \nThis si so incredibly stupid for a time nearly 30 years after the year 2000. Humans are suypposed to get more inteligent, but this stupid nonsense, is destroying the entertainment industry. Yes, its THAT bad,. Ive searched the web, and found no asnwers, onyl countless individuals wiht teh same heartache.  \nSo here I am, telling netflix on a reddit cahnnel, they should remix the entirer catalogue and reupload it, remastered, wiht a vocal boost audio option.  \nI dont think anyone wiht enough brain capacity or intellect would read this though,. the onyl solution is if im somehow going to find myself working for Netflix and fix it myself.\n\nThis is nto a user or hardware issue. The moxies have been uploaded with 5.1 or stereo withi the vocals (center channel) too low. Simple as that.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i3yqmx/create_a_dialogue_audio_boosted_version_so_i_can/"
    },
    {
        "id": "1i41pdh",
        "author": "Robemilak",
        "title": "Netflix Co-CEO Ted Sarandos says David Lynch was working on a new limited series that “would have been his last project” but Covid and his declining health got in the way.",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i41pdh/netflix_coceo_ted_sarandos_says_david_lynch_was/"
    },
    {
        "id": "1i3xzq5",
        "author": "Vivid-Relationship96",
        "title": "Netflix Delaay?",
        "content": "What’s going on with my Netflix account? Series that have already been released aren’t available on my Netflix app yet, and every time I click on them, it just says ‘Remind Me.’ Also, there’s a Filipino series that was released last night, but I can’t find it on my app. Is there some kind of delay on my account, or is it just me?\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i3xzq5/netflix_delaay/"
    },
    {
        "id": "1i41d4x",
        "author": "EndangeredPedals",
        "title": "My opinion of Netflix app features",
        "content": "I think the way I wrote the previously deleted post was misinterpreted as something that should be directed to them but really I just want to share my opinion about how Netflix provides it's subscription service.  Specifically, I really dislike the way that movies start playing even when I'm just considering whether to watch the trailer or to see what cast members are acting in it.  I've come back from the kitchen with snacks to see that a movie I wanted to watch was already running for a few minutes.  It's mildly annoying to try to unsee something while rewinding to the beginning to restart.  I've tried to turn it off in my settings, but they only offer changes for previews or show episodes.  I think the worst part is that if I decided I don't want to watch something, it probably still affects what the algorithm offers in the future.  Why?  Just why?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i41d4x/my_opinion_of_netflix_app_features/"
    },
    {
        "id": "1i3c8nb",
        "author": "S4v1r1enCh0r4k",
        "title": " Greta Gerwig managed to break Netflix's usual no-theaters rule. Her Narnia adaptation will receive a special theatrical release with an extended exclusivity window, coming on Thanksgiving Day 2026 ",
        "content": "",
        "upvotes": 25,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i3c8nb/greta_gerwig_managed_to_break_netflixs_usual/"
    },
    {
        "id": "1i3x5yp",
        "author": "adisneygrl",
        "title": "Netflix preview club",
        "content": "So I was asked to join I did, and the email said they’ll send a PIN… I never received one.\n\nI can’t even reset a PIN, I been on hold with Netflix for 15 mins now but blah. Anyone else dealt with this?\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3x5yp/netflix_preview_club/"
    },
    {
        "id": "1i2mvd3",
        "author": "Legitimate_Ad3625",
        "title": "Squid Game Season 2's Thanos Star Breaks His Silence On Casting Backlash In First Major Interview",
        "content": "",
        "upvotes": 894,
        "comments": 140,
        "media": null,
        "permalink": "/r/netflix/comments/1i2mvd3/squid_game_season_2s_thanos_star_breaks_his/"
    },
    {
        "id": "1i3oz2h",
        "author": "SignOne2137",
        "title": "Love Never Lies SA",
        "content": "Just finished Love Never Lies: South Africa + The Reunion, and can easily say that this is the most mature version of the show I’ve seen. It feels as though the way the cast was able to have respectul raport despite whatever they may feel about each other is really great. The couples feel genuine, their issues relatable, and the focus isn’t just on drama for the sake of it. Instead, the show dives into real conversations about love, trust, and growth (inasmuch as a \"reality tv show\" can be) vs for eg. the USA versions which feel like they emphasise pure chaos over emotional maturity and healing in any way.\n\nSide note though, I can't believe that Nancy stayed either Bohlale :( Damn",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3oz2h/love_never_lies_sa/"
    },
    {
        "id": "1i3o3hb",
        "author": "LobstahLovahRI",
        "title": "Temptation Island USA-where is it???",
        "content": "I had made a post in the subject of Temptation Island USA last year. Netflix had allegedly picked it up for the next season. I, along with other fans am wondering why the show was taped but no release date is happening. I am curious to know why we never heard about the show again. Supposedly they filmed it last May of 2024. I also had heard it might start in March, but we've yet to see a release date or preview. Thoughts? Info?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i3o3hb/temptation_island_usawhere_is_it/"
    },
    {
        "id": "1i3ru29",
        "author": "Parcivall2205",
        "title": "All the bright places: Infopage",
        "content": "In the end credits of the movie \"All the bright places\", there is an link posted on screen which is supposed [to contain help for people struggling with mental health](https://web.archive.org/web/20240328103435/https://www.allthebrightplacesfilm.info/#gallery). Nowadays, the link firstly doesnt work correctly anymore with HTTPS, and secondly just redirects to the Netflix homepage. Can anybody tell me what reasons for some change like this could be? Its not like netflix looses profits by having that content on some page. Or does anybody know where someone could turn to suggest putting up that page again?  \n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3ru29/all_the_bright_places_infopage/"
    },
    {
        "id": "1i411pg",
        "author": "ShaivRoy",
        "title": "WEREWOLF FINALLY UNSHACKLED!!!???!?!?! Wwe Smackdown Review (18/1/25)",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i411pg/werewolf_finally_unshackled_wwe_smackdown_review/"
    },
    {
        "id": "1i3ovci",
        "author": "HarIeylol",
        "title": "Stranger things",
        "content": "Just finished stranger things and I can’t find anything on Netflix that’s anywhere near as good as it. Any suggestions? Doesn’t have to be in the same genre just something worth bingeing.",
        "upvotes": 0,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1i3ovci/stranger_things/"
    },
    {
        "id": "1i3cxrz",
        "author": "Robemilak",
        "title": "Greta Lee and Wagner Moura Will Star in Netflix's ‘11817,’ a Sci-Fi Thriller from Louis Leterrier",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3cxrz/greta_lee_and_wagner_moura_will_star_in_netflixs/"
    },
    {
        "id": "1i2sabw",
        "author": "misana123",
        "title": "'You' Season 5: April 24 Release Date Set on Netflix for Final Episodes",
        "content": "",
        "upvotes": 125,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1i2sabw/you_season_5_april_24_release_date_set_on_netflix/"
    },
    {
        "id": "1i37a90",
        "author": "IRLthereisnoalgebra",
        "title": "Help me make a Harlan Coben mini-series drinking game",
        "content": "After watching (what feels like) literally every worthwhile show on every streaming network I have, I decided to give a few Harlan Coben joints a try. So far, I've seen \"Fool Me Once\", \"The Five\", \"Missing You\", and \"Safe.\"\n\nBased on what I've seen so far, these are the Harlan Coben drinking game rules I've compiled.\n\nDrink every time:\n\n* A character with a mid-level salary somehow lives in a house out of Architectural Digest\n* A character is sold to the audience as \"menacing\" almost entirely via the use of a dark hoodie\n* The main character, who we're supposed to root for, does something that they should definitely be arrested for (but they totally aren't)\n* The main character calls in a friend with convenient mystery-solving skills (hacking, phone tracking, military database access)\n* An actor from AB Fab or Coronation Street pops up\n* An actor whose previous experience is only in soap opera makes that fact very obvious\n* A teenage character uses slang that was clearly written by a middle-aged script writer\n\nFinish your drink when:\n\n* You finally realize that a side plot you thought was key to the main mystery is going nowhere\n* You accept that the burning question you were hoping would get answered will forever be a plot hole\n* You find yourself wondering what kind of blackmail HC has on Richard Armitage",
        "upvotes": 14,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i37a90/help_me_make_a_harlan_coben_miniseries_drinking/"
    },
    {
        "id": "1i2negv",
        "author": "peoplemagazine",
        "title": "'Ms. Rachel' to Launch Worldwide on Netflix, with More Episodes Later This Year",
        "content": "",
        "upvotes": 223,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1i2negv/ms_rachel_to_launch_worldwide_on_netflix_with/"
    },
    {
        "id": "1i411ta",
        "author": "tvuniverse",
        "title": "\"The Perfect Couple\" has a HUGE problem depicting consent (SPOILERS in photos and captions)",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i411ta/the_perfect_couple_has_a_huge_problem_depicting/"
    },
    {
        "id": "1i3aoe1",
        "author": "Horror_Effective12",
        "title": "'Public Disorder' S1 Review - A controversial but dark horse that takes you by surprise",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i3aoe1/public_disorder_s1_review_a_controversial_but/"
    }
]