[
    {
        "id": "1qt3t6k",
        "author": "JaredBushOfficial",
        "title": "Hi /r/movies! I'm Jared Bush, director of ZOOTROPOLIS 2 &amp; ENCANTO and Chief Creative Officer of Walt Disney Animation Studios. Ask me anything!",
        "content": "Hi r/movies! I'm Jared Bush, director of ZOOTROPOLIS 2 &amp; ENCANTO, I wrote the screenplay for MOANA and I was a writer on ZOOTROPOLIS, MOANA 2 and the upcoming live-action adaptation of MOANA. Since 2024, I've also served as Chief Creative Officer of Walt Disney Animation Studios. Ask me anything! I'll be back on Monday at 5pm GMT/12pm ET/9am PT to answer any of your questions, see you there!",
        "upvotes": 505,
        "comments": 510,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i8pckvb1twgg1.jpeg?auto=webp&amp;s=ca86a453424f26b0a5ef16d77b4100aa940bceee"
        },
        "permalink": "/r/movies/comments/1qt3t6k/hi_rmovies_im_jared_bush_director_of_zootropolis/"
    },
    {
        "id": "1qu02rd",
        "author": "SanderSo47",
        "title": "January 30-February 1 Box Office Recap – 'Send Help' over-performs and tops the box office with $20M. Markiplier's 'Iron Lung' also over-performs, hitting second place with $17.8M. 'Melania' flops with just $7M, against a $40M budget and a $35M marketing campaign.",
        "content": "https://preview.redd.it/lk486fgxz3hg1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=f4cc7b57feebdba9eaddf1db2dbb19fca001d003\n\nIt was quite a busy weekend to cap off the January box office, with two titles vastly outperforming projections.\n\nWith strong reviews and seizing on a very weak horror landscape, Sam Raimi's ***Send Help*** took the top spot. But in second place, Markiplier's directorial debut ***Iron Lung*** also outperformed projections with a strong debut. But there were two losers this weekend; ***Shelter*** marked one of Jason Statham's worst debuts as leading man, while the documentary ***Melania*** also flopped despite a bizarrely extensive marketing campaign.\n\nThe Top 10 earned a combined $74.3 million this weekend. That's down a very marginal 0.3% from last year, when ***Dog Man*** over-performed, while ***Companion*** struggled to break out.\n\nDebuting at #1, 20th Century Studios' ***Send Help*** earned a pretty good $20 million in 3,475 theaters. That's Sam Raimi's highest horror debut unadjusted, finally dethroning ***Drag Me to Hell*** ($25 million). \n\nGiven how 20th Century Studios has been struggling in theaters outside ***Avatar***, this is a very much needed win for the studio. And all credit goes to a great marketing campaign; a woman and her dick boss are stranded in an island, and crazy shit happens. An easily accessible premise, and with the lack of momentum for horror titles this year (***The Bone Temple*** was expected to be a major horror attraction, but it has been playing worse than expected), the film greatly benefitted from Sam Raimi's return to his horror roots. Great reviews (93% on RT) also helped. \n\nAccording to 20th Century Studios, 53% of the audience was male, and 78% was 25 and over. They gave it a solid \"B+\" on CinemaScore, a pretty good grade for a horror. Given the lack of horror competition till ***Scream 7*** (***The Strangers*** is absolutely zero competition), it seems like the film could have a healthy run through February. Raimi's ***Drag Me to Hell*** closed with $42.1 million back in 2009; similar legs would put ***Send Help*** at $55 million or so, but it can go higher.\n\nHaving to settle for second place, but still outperforming projections, was Markiplier's directorial debut ***Iron Lung***, which earned a great $17.8 million in 3,015 theaters. That's an incredible debut considering the film was independently financed and it was only slated to debut in 100 theaters.\n\nYouTubers moving to filmmaking rarely works out; Chris Stuckmann's ***Shelby Oaks*** faded out quickly last October. But an advantage that ***Iron Lung*** had was how massively popular Markiplier is; he currently has 38.2 million subscribers, and his videos are still very popular. Compared to other YouTubers from that era, Markiplier has managed to maintain relevancy when others lose steam.\n\nBut still, $17.8 million is quite a lot for a film like this, especially when it was an adaptation of an indie game and lacked any major names or distributor. Sometimes films can surprise you by the level of a fanbase; as previously said, this was supposed to play in 100 theaters, but it kept adding more screens due to insane demand in pre-sales. This is on Markiplier's credit only, cause he's pretty much the face of the film. The fact that it can get this high is a testament to his brand power.\n\nAccording to Markiplier, 61% of the audience was male, and 62% was 25 and under. Definitely an incredible debut. And don't expect great legs on this film; films with specific fanbases often crash hard after opening weekend, and it'd be surprising if ***Iron Lung*** was any different. It's already seen on its opening weekend; Friday represented over half of the audience. But given that this cost a low $3 million budget, this is already a big success story.\n\nIn third place, Amazon MGM's documentary ***Melania*** earned $7 million in 1,778 theaters. This marked the biggest ever debut for a documentary since ***Chimpanzee*** ($10.6 million) back in 2012.\n\nSo why is this is a poor start? The bar may not be high for a documentary, as those aren't as popular as other films. But ***Melania*** has a higher bar to clear because it cost higher than usual for a documentary; it cost $40 million to produce, along with $35 million more in marketing. Basically Amazon MGM has a $75 million investment, and it only made 10% out of it in its opening weekend. We can spin it all we want, but that's definitely a flop. I mean, Amazon MGM's ***Mercy*** opened higher and with a mid-range budget and it was widely proclaimed as a flop. Why should this be any different?\n\n***Melania*** flopped for one reason and one reason only: there's absolutely nothing interesting about this \"documentary\". Putting aside how these are tough times for politics, was there a big audience for a pro-Trump propaganda following Melania Trump on the 20 days before Trump's second presidential inauguration? $7 million may be something, but it's still not a lot of people, especially considering the investment.\n\nAnd because it wasn't enough, the film was directed by none other than Brett fucking Ratner. His career stalled back in 2017 when he was accused by multiple women of sexual assault and harassment. This is his first project in years,  just as new images emerged showing him hanging out with Jeffrey Epstein and Jean-Luc Brunel. And you could tell it was directed by Ratner because it sucked, it's sitting at an abysmal 10% on RT.\n\nAccording to Amazon MGM, 72% of the audience was female, and 72% was 55 and over. They gave it a great \"A\" on CinemaScore, but this is not a surprising score. If you willingly walked into this, you knew what you were getting. Given how often titles like these perform, this will probably drop over the next few weeks. It'd be a surprise if it made it past $20 million domestically. Whatever purpose it was, it's clear Ratner is planning his Hollywood comeback. And it's working, because he was recently confirmed to direct ***Rush Hour 4***, because Trump himself played a big role in that. Man, these are depressing times.\n\n***Zootopia 2*** continues showing some damn fantastic legs. It actually increased 9% this weekend, for a $5.8 million take. That took its domestic total to $408.9 million, and it looks like it will try to challenge ***A Minecraft Movie*** ($424 million) for the 2025 domestic crown.\n\nDebuting in fifth place, there's Black Bear's action thriller ***Shelter***, which flopped with just $5.5 million in 2,726 theaters. That's Jason Statham's worst debut as lead star since ***Operation Fortune: Ruse de guerre*** ($3.1 million), and his fourth worst of all his wide debuts.\n\nNow, a number like this has less to do with Statham, and more with its distributor, Black Bear. These are tough times to launch a big studio in Hollywood, and Black Bear did not have much luck last November with its first title, ***Christy***. They were just a production company, before deciding to fully embrace distribution, and now ***Shelter*** shows they are not in a strong position to launch titles. If this was helmed under Lionsgate or Amazon MGM like Statham's past films, the film could've opened with at least $10 million. The fact that it made $5 million despite the terrible marketing and launch really shows that Statham is a draw.\n\nAccording to Black Bear, the film skewed heavily male, as it's typical with Statham, and 44% was 45 and over. Clearly a dad movie. They gave it an okay \"B+\" on CinemaScore, and the film could hold well over the empty competition. Although it's unlikely that it can keep these screenings for long.\n\nSeems like ***Avatar: Fire and Ash*** is losing steam, even though it had its best drop yet. It eased just 14%, adding $5.5 million this weekend. Yes, it's officially losing to ***Zootopia 2*** in daillies, and even in per-theater average despite the amount of PLF screens. The film has earned $386.1 million domestically, and it seems like it will hit $400 million after all.\n\nAmazon MGM's ***Mercy*** was hit hard by the winter storm last week, despite reaching #1. Well, the excuses are over, as the film fell all the way to seventh place. It dropped a rough 56%, earning just $4.7 million this weekend. Through 10 days, the film has earned a meager $19.4 million, and it will close with just a tad above $25 million.\n\nIn eighth place, Lionsgate's ***The Housemaid*** eased just 11%, earning $3.5 million. The film's domestic total stands at $120.6 million.\n\nA24's ***Marty Supreme*** is still fighting to reach the $100 million milestone. It eased 18%, for a $2.9 million weekend. That takes its domestic total to $90.8 million.\n\nRounding out the Top 10 was ***28 Years: The Bone Temple***. It lost 1,464 theaters this weekend, and it's showing to be fizzling out. It collapsed a further 53%, earning just $1.6 million on its third weekend. The film has earned an abysmal $23.6 million, and it has zero shot in hitting $30 million domestically.\n\nJust outside the Top 10, Focus Features' ***Hamnet*** eased 19%, earning $1.5 million. The film has amassed $20.2 million so far.\n\nUnsurprisingly, ***Return to Silent Hill*** collapsed on its second weekend. A steep 70% drop, which amounts to a very poor $980,833. That takes its domestic total to just $4.2 million after 10 days, and it won't make it much further than $5 million.\n\nAhead of its wide debut, A24's ***The Moment***, a mockumentary starring Charli XCX, got off to a strong debut in 4 theaters. It earned $427,940, which translates to a very strong $106,985 per-theater average. An impressive debut, although with mixed reviews (62% on RT), the film will probably fail to connect with non-fans once it goes wide.\n\n#**OVERSEAS**\n\n***Avatar: Fire and Ash*** debuted with $19.3 million overseas, taking its worldwide total to $1.413 billion. In the process, it passed ***Avengers: Age of Ultron*** to become the 18th highest grossing film of all time. Does it still have enough steam to hit $1.5 billion? It will be a bit complicated, but it's not impossible.\n\n***Zootopia 2*** added $17.3 million overseas, for a $1.698 billion worldwide run. The best markets are China ($631.2M), Japan ($90M), France ($74.6M), Korea ($56.2M), Germany ($48.5M), UK ($43.5M), Mexico ($40.2M), Australia ($27.9M), Brazil ($24.6M), and Taiwan $23.3M). It's about to crack the $1.7 billion milestone.\n\n***Send Help*** debuted with $8.1 million overseas, for a $28.1 million worldwide debut. Its best debuts were Mexico ($1M), Australia ($800K), Germany ($500K), Japan ($400K), Italy ($400K), South Korea ($400K), Spain ($400K), Netherlands ($300K), and Brazil ($200K). It's a modest debut, but it seems the domestic market will heavily carry the film.\n\n***Shelter*** debuted with $7.5 million overseas, for a $13 million worldwide debut. Its best markets were China ($2M), the UK ($1.3M), Saudi Arabia ($928K), and UAE ($707K). While it has some more markets left, it's very unlikely it can recoup its steep $50 million budget.\n\n***Mercy*** is fizzling out, as it dropped 56% overseas, earning just $5.6 million for a very disappointing $41 million worldwide total. The best markets are China ($5.7M), Mexico ($1.6M), the UK ($1.5M), Australia ($1.2M), Japan ($1.1M), Germany ($943K), Spain ($753K), Netherlands ($570K), and France ($560K). South Korea is its last major market, but don't expect it to save this.\n\n***Iron Lung*** debuted with $3.9 million overseas, for a $21.7 million worldwide debut. The best debuts were in the UK ($1.2M), Australia ($1.2M), and Germany ($300K). A very impressive debut, considering it didn't have a lot of screenings in these markets.\n\nBelieve it or not, Amazon also decided to release ***Melania*** in many countries. As of this moment, there's no box office data for this.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Wicked: For Good* | Nov/21 | Universal | $147,004,640 | $342,915,090 | $526,587,764 | $150M\n*Five Nights at Freddy's 2* | Dec/5 | Universal | $64,007,430 | $127,730,290 | $238,701,161 | $36M\n\n- For the money, and nothing more. Universal's ***Wicked: For Good*** has closed with $526 million worldwide. A definite success, given that it surpassed its $150 million budget. But it marked a rough 31% drop from ***Wicked***, which was one of 2024's biggest box office successes. In this case, ***For Good*** was left out of the year's Top 10. While it opened with a dazzling $147 million, suggesting it would have a very strong run, the film would prove to have terrible legs, losing steam at a quick pace thanks to very lukewarm word of mouth. Sure, the second half of the musical is weaker, but the film still failed to try and fix those aspects. Perhaps the final touch was the fact that while the original was nominated for many awards and won 2 Oscars, ***For Good*** was completely rejected by the Oscars in every single category. Did Universal make a good decision in splitting the musical? Financially, yes. But they might want to reconsider that planned cinematic universe they were planning to develop.\n\n- Universal/Blumhouse's ***Five Nights at Freddy's 2*** has closed with $238 million worldwide. After the very rough year that Blumhouse had, they finished it with their biggest hit since the prior ***Freddy's*** film. But despite releasing it during holiday season, the film still had poor legs, failing to hit the 2x mutliplier. Perhaps that can be attributed to its incredibly low quality, as the film somehow had worse reception than the original. Blumhouse will easily make a third film, but if it continues the same trajectory with the quality, their biggest IP could lose steam.\n\n#**THIS WEEKEND**\n\nIt's Super Bowl weekend, and studios always avoid releasing big stuff in here. Barring some disaster, it'd be a surprise if ***Send Help*** lost the top spot.\n\nThe only wide release is ***The Strangers – Chapter 3***, the final film in this reviled franchise. The plot is... and the actors are. Yeah, definitely. There's not much to say here because... there's simply no good will left in here. Nothing on its favor. It's only a matter of seeing how low it will go.\n\n#**STREAMING DATA**\n\nHow did Netflix do last week?\n\nFigures for the week of January 19 to January 25:\n\nNo. | Movie | Year | Studio | Weeks in Top 10 | Views | Runtime | Hours Viewed\n----------|----------|:--------:|:--------:|:--------:|:--------:|:--------:|:--------:\n1 | *The Rip* | 2026 | Netflix | 2 | 40,400,000 | 1:53 | 78,300,000\n2 | *Kidnapped: Elizabeth Smart* | 2026 | Netflix | 1 | 15,900,000 | 1:31 | 24,100,000\n3 | *No Time to Die* | 2021 | MGM | 1 | 9,600,000 | 2:44 | 26,200,000\n4 | *People We Meet on Vacation* | 2026 | Netflix | 3 | 9,300,000 | 1:58 | 18,300,000\n5 | *KPop Demon Hunters* | 2025 | Netflix | 32 | 7,000,000 | 1:40 | 11,700,000\n6 | *The Magnificent Seven* | 2016 | Sony | 1 | 6,500,000 | 2:13 | 14,500,000\n7 | *SPECTRE* | 2015 | MGM | 1 | 4,300,000 | 2:28 | 10,600,000\n8 | *Max* | 2015 | Warner Bros. | 1 | 4,300,000 | 1:51 | 7,900,000\n9 | *Tere Ishk Mein* | 2025 | AA Films | 1 | 3,800,000 | 2:45 | 10,500,000\n10 | *Suitcase Killer: The Melanie McGuire Story* | 2026 | Netflix | 2 | 3,700,000 | 1:27 | 5,300,000\n\n***The Rip*** stayed at #1 with 40.4 million views, a very marginal drop from its impressive opening weekend. That takes its 10-day total to 82 million views. It needs another 56 million views to crack Netflix's Top 10 of all time, and it must achieve it in 3 months. Let's see where it stands next week.\n\nThe documentary ***Kidnapped: Elizabeth Smart*** cracked the second spot with 15.9 million views.\n\nIn fourth place, rom-com ***People We Meet on Vacation*** added 9.3 million views, taking its 17-day total to 49.8 million views. \n\nAs you notice, Netflix added all the 25 Eon-produced James Bond films globally on January 21. Clearly, audiences were interested in rewatching Daniel Craig's era, as ***No Time to Die*** and ***SPECTRE*** were the third and seventh most watched films during the week.\n\n#**ANNOUNCEMENT**\n\nWeekend Actuals will return to the usual schedule, on Monday afternoons, next week.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1qu02rd/january_30february_1_box_office_recap_send_help/"
    },
    {
        "id": "1qttsv1",
        "author": "MarvelsGrantMan136",
        "title": "‘Zootopia 2’ Has Grossed $630M In China, The Highest Tally There By A Hollywood Film, Disney Says",
        "content": "",
        "upvotes": 3256,
        "comments": 174,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Qwz9HGCI481L9g0K8PnUMoVBmnsl3QDvKPyyN-DGPHU.jpeg?auto=webp&amp;s=6c9e7e31fc5318f22fbc477bb45a6e9b79edb08e"
        },
        "permalink": "/r/movies/comments/1qttsv1/zootopia_2_has_grossed_630m_in_china_the_highest/"
    },
    {
        "id": "1qtvtzv",
        "author": "MarvelsGrantMan136",
        "title": "New Posters for 'The Drama' Starring Zendaya &amp; Robert Pattinson",
        "content": "",
        "upvotes": 598,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jqjr2n6b83hg1.jpeg?auto=webp&amp;s=51ba8e68619e8a6bcdc736fe53018f52904c7a46"
        },
        "permalink": "/r/movies/comments/1qtvtzv/new_posters_for_the_drama_starring_zendaya_robert/"
    },
    {
        "id": "1qtz028",
        "author": "MarvelsGrantMan136",
        "title": "New Poster 'Good Luck, Have Fun, Don't Die'",
        "content": "",
        "upvotes": 405,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/us153u3pt3hg1.jpeg?auto=webp&amp;s=7c9a8c4ab734b586e1134e5e6d8e30705fcf9e02"
        },
        "permalink": "/r/movies/comments/1qtz028/new_poster_good_luck_have_fun_dont_die/"
    },
    {
        "id": "1qtw7fo",
        "author": "DemiFiendRSA",
        "title": "New official poster for ‘Scream 7’",
        "content": "",
        "upvotes": 502,
        "comments": 226,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/b7xplysya3hg1.jpeg?auto=webp&amp;s=8bc966ce16980983e2d8c66baa0c446cbb8f9f77"
        },
        "permalink": "/r/movies/comments/1qtw7fo/new_official_poster_for_scream_7/"
    },
    {
        "id": "1qtc9m8",
        "author": "MarvelsGrantMan136",
        "title": "Steven Spielberg Achieves EGOT Status After Landing First Grammy Win",
        "content": "",
        "upvotes": 9388,
        "comments": 407,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hW4x-O6KYOTxkApye50SopOLBrcKgnify3-_MfojUmA.jpeg?auto=webp&amp;s=da0f414a69b3617753fdeb36ac869c63b7c51f7c"
        },
        "permalink": "/r/movies/comments/1qtc9m8/steven_spielberg_achieves_egot_status_after/"
    },
    {
        "id": "1qtsebw",
        "author": "vought-CEO",
        "title": "The Prestige (2006) | \"Man's reach exceeds his imagination\" | Dir. Christopher Nolan",
        "content": "",
        "upvotes": 529,
        "comments": 138,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rn2forv4f2hg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qtsebw/the_prestige_2006_mans_reach_exceeds_his/"
    },
    {
        "id": "1qtgnjx",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Devil Wears Prada 2'",
        "content": "",
        "upvotes": 3400,
        "comments": 397,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qb89c1k8dzgg1.jpeg?auto=webp&amp;s=18640aab45b7a1c4e399b73fe99228a302750334"
        },
        "permalink": "/r/movies/comments/1qtgnjx/new_poster_for_the_devil_wears_prada_2/"
    },
    {
        "id": "1qtgma9",
        "author": "DemiFiendRSA",
        "title": "The Devil Wears Prada 2 | Official Trailer",
        "content": "",
        "upvotes": 2258,
        "comments": 463,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BJ-mAqrVWf269d6HWWYHSXU01RxfViOhcgem0Gb_Las.jpeg?auto=webp&amp;s=b8b8c154c3b8a89a122f152e78409f6348d33f4a"
        },
        "permalink": "/r/movies/comments/1qtgma9/the_devil_wears_prada_2_official_trailer/"
    },
    {
        "id": "1qtx20v",
        "author": "Maleficent-Term-126",
        "title": "An Exorcism Movie Set in The White House, Co-Produced By Blumhouse &amp; James Wan's Atomic Monster",
        "content": "",
        "upvotes": 158,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YP-E7eQfPUP6ZPSFnpFgydWeSOA2-Afds4_QPf2fepU.jpeg?auto=webp&amp;s=9ef55c93d25642232ea99b5247e75b58d25af966"
        },
        "permalink": "/r/movies/comments/1qtx20v/an_exorcism_movie_set_in_the_white_house/"
    },
    {
        "id": "1qt1urf",
        "author": "ICumCoffee",
        "title": "Official 20th Anniversary Poster for 'V for Vendetta', Returning to Theatres on 5th of November",
        "content": "",
        "upvotes": 11379,
        "comments": 423,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kjm3b9g1mwgg1.jpeg?auto=webp&amp;s=923480aee7fe4f2509f82d08df2ea7d03a848a35"
        },
        "permalink": "/r/movies/comments/1qt1urf/official_20th_anniversary_poster_for_v_for/"
    },
    {
        "id": "1qtax0o",
        "author": "MarvelsGrantMan136",
        "title": "Ludwig Göransson Wins Grammy Award for ‘Sinners’ Score",
        "content": "",
        "upvotes": 2625,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1qtax0o/ludwig_göransson_wins_grammy_award_for_sinners/"
    },
    {
        "id": "1qti375",
        "author": "OverPotato2322",
        "title": "Disney Board Is Close to Picking Parks Chief D’Amaro as Next CEO",
        "content": "",
        "upvotes": 882,
        "comments": 159,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hAY5DGNkUySFQ8nqKg4HR6oPl05hAYMxIWJWJSERMVE.jpeg?auto=webp&amp;s=61ed3095dd5067977fd89a9d15a911061d2d6f06"
        },
        "permalink": "/r/movies/comments/1qti375/disney_board_is_close_to_picking_parks_chief/"
    },
    {
        "id": "1qtwwba",
        "author": "Contcos",
        "title": "First image of Woody Harrelson and Kristen Stewart in Full Phil, directed by Quentin Dupieux",
        "content": "",
        "upvotes": 86,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/85wz9jkvf3hg1.jpeg?auto=webp&amp;s=1c5c4f64504aaece905b8abafbc606f803a3d799"
        },
        "permalink": "/r/movies/comments/1qtwwba/first_image_of_woody_harrelson_and_kristen/"
    },
    {
        "id": "1qt1hsc",
        "author": "Somanynamestochossef",
        "title": "What movie did you turn off after 20 minutes and why?",
        "content": "I’ve realized that life is way too short to sit through a movie just for the sake of finishing it. If a film hasn't given me a reason to care about the characters or the stakes within the first 20 minutes, I’m out.\n\nFor me, it was Rebel Moon. It felt like a long ass screensaver with zero soul. I don't care how big the budget is or how much slow motion you use if the writing isn't there, I’m not gonna care and I am not wasting my evening.\n\nWhat’s that one movie that made you realize you were wasting your time and what was the reason that made you turn it off?",
        "upvotes": 5689,
        "comments": 8141,
        "media": null,
        "permalink": "/r/movies/comments/1qt1hsc/what_movie_did_you_turn_off_after_20_minutes_and/"
    },
    {
        "id": "1qty3bv",
        "author": "inchlongnipples",
        "title": "The Deer Hunter (1978), Christopher Walken's performance was something else.",
        "content": "I'm not a big cinephile. I think the only thing that I really knew Walken from was Joe Dirt. I can't say how many times I've quoted \"do it again and I'll stab you in the face with a soldering iron.\"  \n\n  \nBut I watched The Deer Hunter after some strong encouragement from an older supervisor. God damn. De Niro was excellent, but holy shit Walken was just spectacular. I mean I know I'm stating the obvious; the man won an Oscar for it. But Christ, the way he portrayed that broken despair, it put a pit in my stomach.  \n\nHaving missed out on so many great films made in the previous millennium has given me a very poor understanding of the depths of some of the previous generations' actors. I will continue to take recommendations from this supervisor.",
        "upvotes": 60,
        "comments": 43,
        "media": null,
        "permalink": "/r/movies/comments/1qty3bv/the_deer_hunter_1978_christopher_walkens/"
    },
    {
        "id": "1qtes8p",
        "author": "Top_Report_4895",
        "title": "Catherine O'Hara Was the Grande Dame of Off-Center Comedy",
        "content": "",
        "upvotes": 942,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8WmYdrPPkhAnHIK21frqAO3EUmC3S3dQ_817tV2hmH0.jpeg?auto=webp&amp;s=364c6c1a1df3634ae3dbc796a7a6a918906ed453"
        },
        "permalink": "/r/movies/comments/1qtes8p/catherine_ohara_was_the_grande_dame_of_offcenter/"
    },
    {
        "id": "1qteuok",
        "author": "No_Cabinet_4532",
        "title": "Meryl Streep Confirmed to Play Joni Mitchell in Cameron Crowe Biopic",
        "content": "",
        "upvotes": 655,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rc8G3uRO2OEE2vQsYgJqp2O4ZZY_Q-0eISW2PaZLg28.jpeg?auto=webp&amp;s=2db05422f2e0ec15992785662d234a2f181a5d58"
        },
        "permalink": "/r/movies/comments/1qteuok/meryl_streep_confirmed_to_play_joni_mitchell_in/"
    },
    {
        "id": "1qtf3rx",
        "author": "inebriatedferret",
        "title": "Most devastatingly hopeless films you've seen?",
        "content": "What gut-punching films are essential viewing for any depression binge...? Does not need to be genre-specific... Just want to know what films have left you emotionally devastated at the end? Requiem for a Dream, Midsommar, Alpha Dog, The Lodge, Eternal Sunshine of the Spotless Mind, 500 Days of Summer, Martyrs",
        "upvotes": 492,
        "comments": 1320,
        "media": null,
        "permalink": "/r/movies/comments/1qtf3rx/most_devastatingly_hopeless_films_youve_seen/"
    },
    {
        "id": "1qtg9of",
        "author": "DuckLordOfTheSith",
        "title": "What is your favorite example of a change from a film’s source material that you believe made the movie better?",
        "content": "Films need to change things all the time from what they’re adapting. The mediums are different, and things that work in print or in video games just don’t work in cinematic features. What is your favorite example of a change that you believe made the film better? (I’ll also accept cinematic television since tv shows are adapting things a lot these days).",
        "upvotes": 377,
        "comments": 727,
        "media": null,
        "permalink": "/r/movies/comments/1qtg9of/what_is_your_favorite_example_of_a_change_from_a/"
    },
    {
        "id": "1qtoggi",
        "author": "SeriousCharge486",
        "title": "Any recommendations for movies similar to Event Horizon and Pandorum?",
        "content": "Im in love with the horror space genre like the game Dead Space and need more scary space movies that will keep me up at night.\nI've seen Sunshine and it was pretty good but there wasn't enough scare factor to it in my opinion. Are there any more movies out there similiar to the ones that I mentioned?",
        "upvotes": 86,
        "comments": 90,
        "media": null,
        "permalink": "/r/movies/comments/1qtoggi/any_recommendations_for_movies_similar_to_event/"
    },
    {
        "id": "1qtahj8",
        "author": "gamersecret2",
        "title": "What movie showed romance in the most real, not cheesy way?",
        "content": "A lot of movie romance feels like fantasy.\n\nI mean the real kind. Awkward timing. Mixed signals. Quiet moments. Two people trying not performing.\n\nFor me it is Before Sunrise.   \n  \nIt feels like two real people talking and feeling things in real time. No big tricks. No perfect lines. Just connection that could disappear the next day.\n\nWhat movie romance felt real to you?",
        "upvotes": 563,
        "comments": 368,
        "media": null,
        "permalink": "/r/movies/comments/1qtahj8/what_movie_showed_romance_in_the_most_real_not/"
    },
    {
        "id": "1qt4ynr",
        "author": "jrclone",
        "title": "Do you ever think there will ever be another Jurassic Park moment in theaters?",
        "content": "For those who were alive and watched Jurassic Park when it first released in the theaters, you'll know what I'm talking about. The first time seeing the brachiosaurus was utterly mind blowing. Since then we've had great moments in movies, and Avatar really pushed 3d further than it had ever gone, but nothing has been as earth shattering as seeing what seemed to be a real life walking dinosaur. ",
        "upvotes": 978,
        "comments": 745,
        "media": null,
        "permalink": "/r/movies/comments/1qt4ynr/do_you_ever_think_there_will_ever_be_another/"
    },
    {
        "id": "1qtxaf9",
        "author": "Chief_Cthulhu",
        "title": "Gamera 3: Revenge of Iris (1999) - Shusuke Kaneko | The destruction of Shibuya (part two)",
        "content": "",
        "upvotes": 16,
        "comments": 7,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/4jdlojhgi3hg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qtxaf9/gamera_3_revenge_of_iris_1999_shusuke_kaneko_the/"
    },
    {
        "id": "1qts4ss",
        "author": "BloodChaosZero",
        "title": "I watched every Carmilla adaptation so you don't have to.",
        "content": "Hello everyone! Lately I've been interested in vampire tales, and I've stumbled across the novel Carmilla. Since I liked it, I decided to also watch the most faithful movie/series adaptation... and there Hell started.\n\nI couldn't find on the web a comprehensive list of which movies are the most faithful and why. So, inspired by the amazing video of Cinemassacre about Dracula, I decided to watch them all, assign them points based on faithfulness to the source material, and make the list myself.\n\nSo, without further ado, let's start!\n\n**Vampyr (1932)**\n\nThis silent movie from 1932 is the first movie that loosely (very loosely) tries to adapt the novel. The similarities are actually pretty few: there's a young girl haunted by a vampire, the vampire gives her nightmares and sucks her blood, and the vampire dies by getting impaled by a stake in the heart.\n\nThe pacing of the movie is a bit too slow but interesting nonetheless. Do I recommend it if you want to see a faithful adaptation? No, but I recommend it if you want to see a good movie from the silent era.\n\nFaithfulness = 7/40.\n\n**Terror in the Crypt (1963)**\n\nAn Italian black and white movie from the 60s, it's actually a pretty faithful adaptation except for a few differences: there's a strange focus on black magic (was there a satanic panic in the 60s?), the characters of Carmilla and Laura are partially swapped (in this movie Laura bites Carmilla!), and there's yet another unnecessary male co-protagonist.\n\nSometimes the acting is a bit over the top, and it gets a bit ridiculous, but it's both a good movie and a faithful enough adaptation.\n\nFaithfulness = 21/40.\n\n**Vampire Lovers (1970)**\n\nThe best adaptation of Carmilla all around: it contains almost all the important things present in the novel, the production quality is a lot higher than the previous movies, and the pace is perfect.\n\nDoes it have issues? Of course it does: starting the movie by spoilering that Carmilla is a vampire ruins the story a little bit; the actress that interprets Carmilla is a bit too old for the role, and it tries to make an unnecessary love story between 'Laura' and the woodman. But still, it's the best adaptation of Carmilla we have. if you want the best adaptation possible, stop here.\n\nFaithfulness = 25/40\n\n**The Blood-Spattered Bride (1972)**\n\nIf Vampire Lovers was the best, this is the worst. In this movie a newlywed couple goes to live in the ancestral home of the husband, where they find out that apparently the whole family is haunted by the ghost/vampire of an ancestor called Carmilla and that the husband is a pervert who doesn't understand the concept of \"consent.\"\n\nThe main problem of this movie is that it's not a movie; it's two different movies: a ghost story about how an ancestor is trying to possess the female protagonist to kill her husband before he goes too far with the sexual harassment, and a movie that tries to adapt Carmilla.\n\nThe result is a movie that has a terrible pace and a large number of nonsense scenes, like the scene on the beach. Also, we have the only case ever of a vampire killed with a shotgun. Not recommended.\n\nFaithfulness = 12/40\n\n**Carmilla (1980)**\n\nA polish black and white tv movie that tries to adapt the whole story of Carmilla in slightly more than an hour of runtime... and holy hell if it succeeds! This movie is absolutely the most faithful one; almost everything from the novel is present here: the characters (except the general and Bertha), the setting, the themes, and even the phrases!\n\nIs it a perfect adaptation? Not at all: as I've already said, some characters have been cut due to time constraints, and for the same reason the pace of the movie is way too fast, and there are also some scenes that are completely ridiculous, like Carmilla's escape.\n\nIf you're looking for the most faithful adaptation of the novel, stop here.\n\nFaithfulness = 26/40\n\n**Nightmare Classics: Carmilla (1989)**\n\nAn episode of the popular tv show 'Nightmare Classics' that tries to adapt the whole novel in... fifty minutes. Before starting to watch it, I was already expecting it to be terrible because how can you put all the events of the novel in a fifty-minute episode?\n\nWell...\n\nThis episode absolutely succeeds in its objective: it's a faithful adaptation of the novel, it's a good TV episode, and there are some amazing shots, like the scene of the bats.\n\nIt's not a perfect adaptation at all for obvious reasons, but all the changes that were made are incredibly smart and manage to put on the screen an entertaining tale with a good level of faithfulness. My favorite adaptation of Carmilla all around.\n\nFaithfulness = 21/40\n\n**The Curse of Styria (2014)**\n\nThis is a strange one: as far as adaptations go, it's not too bad on a faithfulness score, and it's an entertaining movie, but holy hell if strange choices weren't made when making this movie!\n\nThe main issue of this movie is that it tries to discuss way too many topics: self-harm, psychological issues, terrible parents, solitude, lesbianism, communism, asylums, controlling assholes, superstitions, ancient cults and many others I'm forgetting.\n\nAlso, there are some nonsense scenes. For example during the scene of the funeral Laura finds out that apparently the whole village hates her for... no reason, but they hate her.\n\nDo I recommend it? Kinda; it can be interesting to see if you have nothing better to do. It's not a bad movie, but it's not even a good movie.\n\nFaithfulness = 15/40\n\n**Carmilla (2019)**\n\nThe last movie on our list, I remember reading on a blog online that this was supposed to be the most faithful adaptation. Well, whoever wrote that blog has probably never read the novel in their whole life!\n\nThis movie has one big problem: it tries to say that Carmilla and Laura's love is pure and beautiful, that everyone else is crazy for thinking that Carmilla is a vampire, and that killing a young innocent girl like Carmilla, who is guilty only of being a lesbian, is the apex of madness.\n\nAnd I would absolutely agree, but there's a little problem: in this movie Carmilla IS a vampire, and she's definitely going to bite Laura sooner or later. So their love IS toxic, Carmilla IS a vampire, Laura IS being manipulated, and killing Carmilla IS the right choice! This movie manages to convey the exact opposite message of what it wanted to convey.\n\nIf Carmilla wasn't a vampire, it would've been a beautiful tale about how lgbt love was demonized. But since Carmilla is a vampire, the message that the movie delivers is that the bad guys are right.\n\nAlso, Carmilla is the weakest vampire in history: in one scene she gets whipped by a servant, and she can't do anything to stop him. Yikes. Not recommended at all.\n\nFaithfulness = 15/40\n\n**BONUS: Carmilla web series (2014)**\n\nProbably the most famous adaptation of Carmilla. It's more a pseudo-sequel than an adaptation since in this series Carmilla never died, and she's living in a college in Styria. Absolutely recommended if you want to watch something inspired by Carmilla but different.\n\nFaithfulness = 19/40\n\n**CONCLUSION**\n\nThanks to everyone that has read this far; I hope that you've enjoyed this excursus about Carmilla's adaptations.",
        "upvotes": 31,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1qts4ss/i_watched_every_carmilla_adaptation_so_you_dont/"
    },
    {
        "id": "1qt4mnq",
        "author": "ChiefLeef22",
        "title": "Oscar-Nominated ‘It Was Just An Accident’ Co-Writer Mehdi Mahmoudian Arrested in Iran After Denouncing Ali Khamenei's Actions",
        "content": "",
        "upvotes": 733,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uo79fmmueI9h3jWotYFyfbFTpHC54hQwyHtOK0zgJZI.jpeg?auto=webp&amp;s=a576c388dd3ec62847a64aff8034a66208c9f425"
        },
        "permalink": "/r/movies/comments/1qt4mnq/oscarnominated_it_was_just_an_accident_cowriter/"
    },
    {
        "id": "1qtvfyo",
        "author": "fuzzy_dice_99",
        "title": "Groundhog Day",
        "content": "As today is February 2nd, is anyone else rewatching this movie today? It’s one of my favorites, not just for the comedy, but the philosophical aspects of it. \n\nThe message is pretty clear: true happiness and peace doesn’t come from external forces but from your inner self. You have to make the change, and not expect it to come from your environment. \n\nI know the production didn’t go so smoothly based on Murray and Ramis having disagreements that ultimately hurt their friendship until Ramis’s passing. But somehow they made it a better film. I believe the original script involved Murray finding the person who cursed him but it works better that we never find the reason. Because that’s not the point of the story and doesn’t really matter. \n\nHis initial reactions to finding that he’s immortal is relatable. We’d all probably give into our vices in some way if we knew it didn’t matter. But then realize it doesn’t lead to anything fulfilling and we end up back to where we started. \n\nIf you’ve seen it, watch it again. If you’ve never seen it, do yourself a favor and rent it. ",
        "upvotes": 17,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1qtvfyo/groundhog_day/"
    },
    {
        "id": "1qsy04b",
        "author": "MarvelsGrantMan136",
        "title": "Austin Film Critics Association Takes Stand Against Alamo Drafthouse Mobile Ordering; Critics group adds voice to chorus of complaints about movie theater chain’s new phone policy",
        "content": "",
        "upvotes": 1433,
        "comments": 174,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8slcDB7FCvofpofNMZwuVNGVOPX_4yTx_8xlY_SgTT8.jpeg?auto=webp&amp;s=04a859394118ab747ee07afcc096c587bbaf0708"
        },
        "permalink": "/r/movies/comments/1qsy04b/austin_film_critics_association_takes_stand/"
    },
    {
        "id": "1qtmtm2",
        "author": "Significant-Cry4539",
        "title": "Happiness (1998) by Todd Solondz… We have to talk about that character. WHAT THE ACTUAL FUCK!?",
        "content": "I mean is this guy crazy or what? I really enjoyed it as a deep dive into American suburbia hell but it was one of the weirdest experiences of my life. I laughed at times where i felt i should be not laughing… it was funny but in a depressing and sad way. Truly one of the ballsiest scripts of all time. PSH is one of the best actors of all time and he is great in this but Dylan Baker just outshines everyone including PSH in this. What a performance, i mean, it is genuinely one of the most undervalued performances of all time. This was my first Todd Solondz movie and it took me by surprise. What do you guys think about it? If you have seen it.",
        "upvotes": 57,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1qtmtm2/happiness_1998_by_todd_solondz_we_have_to_talk/"
    }
]