[
    {
        "id": "1ibu1y5",
        "author": "rotogimp",
        "title": "Hey Reddit, we're Joakim and Sven, director and producer of 'Suicide Tuesday'. It's out soon. Ask us anything! Back for answers Tuesday 1/28 at 10 AM ET.",
        "content": "Check out our [Trailer!](https://youtu.be/nPQiEFkzpgE)\n\nTove is teetering on the edge of self-destruction. Burdened by the weight of her past, her life seems to be spiraling out of control with no way out. That is, until she crosses paths with Jesse.\n\nJesse is everything Tove isn't — calm, grounded, and full of hope. Their unexpected meeting becomes the catalyst for change, igniting a spark of possibility in Tove's dark world. As the two grow closer, Tove is forced to confront the very demons she's been running from. Can Jesse's unwavering support and love be enough to pull her back from the brink? Or will Tove’s inner turmoil ultimately push her further into the abyss?\n\nIn a story about second chances, healing, and the power of connection, Tove must decide if she’s ready to rewrite her story before it’s too late.\n\nProof: [https://i.imgur.com/HVtwBfJ.png](https://i.imgur.com/HVtwBfJ.png)\n\nJoakim is the films Writer and Director and Sven is the DoP and Producer. It's our first feature and its totally independently funded.\n\nWe're an open book and look forward to your questions!",
        "upvotes": 7,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7GVFjzFKpuD9yoVwtqKtTlSb_X8kiWCM_cMr1nOpa-g.png?auto=webp&amp;s=0e4e068c9d478907356017aba586eb4f84e9d578"
        },
        "permalink": "/r/movies/comments/1ibu1y5/hey_reddit_were_joakim_and_sven_director_and/"
    },
    {
        "id": "1ibm00p",
        "author": "SanderSo47",
        "title": "January 24-26 Box Office Recap: In a very quiet weekend, 'Flight Risk' tops the box office, but poor reviews and word of mouth will prevent it from holding well. 'Presence' has an okay start in 1,750 theaters, while 'Brave the Dark' flops outside the Top 10.",
        "content": "https://preview.redd.it/hjr42iwe3mfe1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=0bea2ede539c39f9000b3f9661915c8e54fee033\n\nIn one of the quietest weekends (it's January after all), ***Flight Risk*** seized the opportunity to top the box office. The weekend's other new release was Neon's ***Presence***, which had a soft start in less than 2,000 theaters. But the real loser was Angel Studios' ***Brave the Dark***, which flopped with one of the worst debuts in 2,000 theaters.\n\nThe Top 10 earned a combined $54.2 million this weekend. That's up 30.1% from last year, when ***Mean Girls*** repeated on the top spot for a third week.\n\nDebuting in 3,161 theaters, Lionsgate's ***Flight Risk*** earned $11.5 million this weekend. That's star Mark Wahlberg's biggest debut since ***Uncharted*** ($44 million), and his biggest for a non-IP since ***Instant Family*** ($18 million). Although for director Mel Gibson, this is his lowest debut as director since ***Man Without a Face*** ($4 million) back in 1993.\n\nThis is an okay, not great start. The production kept the budget low at $25 million and it clearly shows, given the film is mostly set in a plane with only three characters. And perhaps that's why the film didn't make a huge landing here; it simply lacks an interesting hook. The plot gave streaming vibes and the film's tone (the tagline is \"Y'all need a pilot?\") suggested it this was going to be a non-event. It's simply a film that people saw a few times already.\n\nThere's also a problem regarding star power. Wahlberg is clearly well known, but his name has taken a dive in the past years. Most of his films in the past years have flopped, with ***Uncharted*** becoming the rare box office hit (and that's because of the IP). Michelle Dockery (who also starred in another plane thriller, ***Non-Stop***, back in 2014) and Topher Grace aren't big names that draw people to theaters either. And Lionsgate decided to avoid showcasing Gibson's involvement from marketing, choosing to use \"from the director of ***Braveheart***, ***Apocalypto*** and ***Hacksaw Ridge***\" as its selling point. While Gibson is often considered a great filmmaker, this was a miss: it's sitting at an awful 25% on RT.\n\nAccording to Lionsgate, 54% of the audience was male and 55% was 25 and over. Critics hated the film and audiences agreed; they gave it an awful \"C\" on CinemaScore, which is simply terrible for an action thriller. With other thriller/action films like ***Companion*** and ***Love Hurts*** coming up, this film is heading for a freefall. For now, a $25 million domestic total is likely, which will make it Gibson's least attended film as director.\n\n***Mufasa*** dipped 29%, adding $8.5 million this weekend. That takes its domestic total to $220.9 million, and it should get close to $250 million by the end of its run.\n\nSony's ***One of Them Days*** eased just 32%, adding $8 million this weekend. That's a very great hold for a comedy, indicating word of mouth is strong with this one. Through ten days, the film has earned $25.1 million domestically, and it should finish with over $40 million.\n\nIn fourth place, ***Sonic the Hedgehog 3*** eased 38%, adding $5.3 million. That takes its domestic total to $225.9 million.\n\n***Moana 2*** eased just 30%, adding $4.1 million this weekend. The film has amassed $449.9 million so far.\n\nIn sixth place, Neon's ***Presence*** debuted with $3.3 million in 1,750 theaters. That's Steven Soderbergh's worst debut in wide release, below ***Unsane*** ($3.7 million). But this result is not surprising. At least it was above Neon's recent horror ***Cuckoo*** ($3 million).\n\nSoderbergh has pivoted from theatrical releases, with ***Magic Mike's Last Dance*** making his first theatrical film since 2018. In those years, he has gone on to release films for Netflix and Max instead. Neon chose to save costs and avoid releasing it too wide, feeling that Soderbergh's brand could carry it. But it looks like in a sea of horror/thrillers like ***Nosferatu***, ***Wolf Man*** and ***Companion***, this one simply got lost in the shuffle.\n\nAccording to Neon, 56% of the audience was male and 73% was 25 and over. They gave it a \"C+\" on CinemaScore, which isn't surprising, considering the marketing sells a different film. It's unlikely ***Presence*** can leg it out to $10 million lifetime.\n\nAfter its weak debut, Blumhouse's ***Wolf Man*** dropped to seventh place, earning $3.2 million. That's a very awful 70% drop from last weekend, far worse than ***The Invisible Woman*** (46.3%) and it's also slightly worse than 2010's ***The Wolfman*** (68.6%). Well, considering the film's tepid response and poor word of mouth, that's not really surprising. Through ten days, the film has earned just $17.6 million, and it will close with just $22 million at most.\n\nSearchlight's ***A Complete Unknown***, coming off its 8 Oscar nominations, had the best drop in the Top 10. It eased a light 18%, adding $3 million this weekend. With that, the film's domestic total now stands at $62.9 million.\n\nIn ninth place, ***Den of Thieves: Pantera*** fell a further 55% this weekend, adding $2.9 million. The film has earned $31.8 million, and will now officially close below $40 million domestically.\n\nRounding up the Top 10 was A24's ***The Brutalist***, coming off its 10 Oscar nominations. It finally hit wide release in 1,118 theaters, and the film earned $2.8 million this weekend. That's a fine start, especially considering its 215-minute runtime limited the amount of screenings. With this, the film's domestic lifetime stands at $9.3 million, and it's gonna continue legging out.\n\nAfter 10 weekends, ***Wicked*** has finally left the Top 10. But it still eased 34%, adding $2.3 million this weekend and taking its domestic total to $468.7 million.\n\nIt's not until the 12th spot where we find Angel Studios' ***Brave the Dark***, which flopped with $2.2 million in 2,230 theaters. That's one of the worst debuts for any film at over 2,000 theaters, and marks another loss for Angel Studios, which has been failling to find a success after ***Sound of Freedom***.\n\n***Nosferatu*** fell 52%, adding $1.9 million this weekend. The film's domestic total stands at $93.1 million, and it looks like it might take some time in reaching $100 million.\n\n***September 5*** expanded to 395 theaters this weekend, earning just $745,064. The film has earned only $1.6 million, and with the lack of awards prospects, it's going to disappear quickly.\n\nAfter a very confusing platform release, Amazon MGM finally expanded ***Nickel Boys*** into 540 theaters, just as it received 2 Oscar noms. But the film earned just $348,060, which is very low. That took its domestic total to $1.5 million, and it needs some strong word of mouth to leg out.\n\nIFC Films released Neil Burger's new action thriller ***Inheritance*** in 627 theaters, and it flopped with an abysmal $124,817. That's the 13th worst debut for a film playing in over 600 theaters, and it also translates to a putrid $199 per-theater average. It will fade quickly.\n\n#**OVERSEAS**\n\n***Mufasa*** once again led the foreign box office. It added $15.4 million, taking its worldwide total to $627 million. The best markets are France ($38.1M), UK ($34.7M), Mexico ($28.3M), Germany ($27.8M) and Italy ($23.1M).\n\n***Sonic the Hedgehog 3*** added $10.6 million this weekend, taking its worldwide total to $446.3 million. The best markets are the UK ($28.9M), Mexico ($21.1M), France ($18.4M), Australia ($17.1M) and Brazil ($12.3M).\n\nAhead of its American debut in February, ***Paddington in Peru*** added $6.3 million this weekend, taking its overseas total to $83 million.\n\n***Moana 2*** added $5.8 million, taking its worldwide total to $1.026 billion. The best markets are France ($61.8M), UK ($51.2M), Germany ($44M), Australia ($31.8M) and Japan ($31.6M).\n\n***Nosferatu*** added $4.2 million, and its worldwide total is now $166.5 million. The best markets are the UK ($14.7M), Mexico ($7.8M), Germany ($5.3M), Spain ($5.1M) and Italy ($5.1M).\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Red One* | Nov/15 | Amazon MGM | $32,106,112 | $97,000,759 | $185,895,441 | $250M\n*Better Man* | Dec/25 | Paramount | $1,063,901 | $1,983,648 | $13,504,215 | $110M\n\n- The hierarchy of power in the Christmas Cinematic Universe didn't change at all. For ***Red One***, it closed with just $185 million, far below it's $250 million budget. Even if it was supposed to be on streaming, it's still underwhelming that the film couldn't hit $200 million worldwide or $100 million domestically. Is The Rock a draw? Certainly. Does that warrant a high budget? Look up here and ***Black Adam***. \n\n- Well, this shit is bananas. B-A-N-A-N-A-S. Paramount simply gave up with ***Better Man*** after just 2 weeks in wide release; it will continue playing in who knows how many theaters, but they decided to stop reporting box office numbers. And so the film couldn't hit $2 million domestically. There are a few foreign markets left, but it has zero chance of making a comeback. Very disappointing.\n\n#**THIS WEEKEND**\n\nDreamWorks is returning to the big screen with ***Dog Man***, which is based on Dav Pilkey's children's graphic novel series, and is also a spin-off and story within a story of *Captain Underpants: The First Epic Movie*. As the first family animated film (get out of the way, ***Mufasa***) since ***Moana 2***, this has so much on its favor and should easily top the box office.\n\nAnother release is WB's ***Companion***, which follows a a weekend getaway among friends at a remote cabin, which unravels into chaos after a revelation that one of the guests is a companion robot. The marketing has been very resistant in showing more of the plot, choosing instead to emphasize its connection to ***Barbarian*** (Zach Cregger is a producer here). With some great reviews so far (94% on RT), perhaps it could surprise.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 26,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/coRemgZSnGhwlQqCrVu0gm5XK2LrLyStsIT3uzzP7Us.png?auto=webp&amp;s=1b9c6754c3dc7776d07b03f09dc215f6123eddb9"
        },
        "permalink": "/r/movies/comments/1ibm00p/january_2426_box_office_recap_in_a_very_quiet/"
    },
    {
        "id": "1ibqtyq",
        "author": "impeccabletim",
        "title": "New poster for Ryan Coogler's 'Sinners' starring Michael B. Jordan",
        "content": "",
        "upvotes": 794,
        "comments": 191,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0sgumvwf7nfe1.jpeg?auto=webp&amp;s=f20eb782f16d13536c470182268eb92f7dde2370"
        },
        "permalink": "/r/movies/comments/1ibqtyq/new_poster_for_ryan_cooglers_sinners_starring/"
    },
    {
        "id": "1iboczg",
        "author": "KillerCroc1234567",
        "title": "Dr. Suess Movie ‘Oh, the Place You’ll Go!’ Sets March 2028 Release From Warner Bros.",
        "content": "",
        "upvotes": 612,
        "comments": 103,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qosOiPclwdauWLS8bpjckxRpyfwm6DMA8vSdA_7ffVc.jpg?auto=webp&amp;s=426ed726bdad1910bd92bb51ace4558dae8171ef"
        },
        "permalink": "/r/movies/comments/1iboczg/dr_suess_movie_oh_the_place_youll_go_sets_march/"
    },
    {
        "id": "1ib57qo",
        "author": "MarvelsGrantMan136",
        "title": "Christopher Nolan Set to Shoot Part of ‘The Odyssey’ on Sicilian ‘Goat Island,’ Where Ulysses Landed",
        "content": "",
        "upvotes": 8002,
        "comments": 524,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6yIGKJ-AKj044oP_xPv1DesUgQi2jWleo1PYT-zfH3w.jpg?auto=webp&amp;s=b1a51e9444e73fcd01faf92fe39bed169f3693ec"
        },
        "permalink": "/r/movies/comments/1ib57qo/christopher_nolan_set_to_shoot_part_of_the/"
    },
    {
        "id": "1ibues5",
        "author": "boib",
        "title": "Barbara Billingsly discusses JIVE talking in AIRPLANE",
        "content": "",
        "upvotes": 162,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SdJK0OZpMyzKQJRecawFcywGLeKMqveOHbgjvEqDUnI.jpg?auto=webp&amp;s=116786a39471aec8884cbf37c55431a459f78087"
        },
        "permalink": "/r/movies/comments/1ibues5/barbara_billingsly_discusses_jive_talking_in/"
    },
    {
        "id": "1ibd27b",
        "author": "NoCulture3505",
        "title": "'Parasite' Re-Releasing in IMAX on February 7th (5th Anniversary)",
        "content": "",
        "upvotes": 1325,
        "comments": 85,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/G7z_I9QKuFehrgoJL2sONJbRKRND8zE37jn38U-9IAc.jpg?auto=webp&amp;s=3fffdef09f949184430ce4639b68502239adf77e"
        },
        "permalink": "/r/movies/comments/1ibd27b/parasite_rereleasing_in_imax_on_february_7th_5th/"
    },
    {
        "id": "1ibmd79",
        "author": "Ok_Treacle_1278",
        "title": "Movies where the main character is secretly a badass",
        "content": "Does any of you know of any movies where the main character is secretly a badass. Like everyone underestimates the main character and then he just starts beating the shit out of people and becomes a huge threat to them.\n\nI have watched «Drive» with ryan gosling. Netflix’s «Rebel ridge». Just to give you some ideas.\n",
        "upvotes": 417,
        "comments": 852,
        "media": null,
        "permalink": "/r/movies/comments/1ibmd79/movies_where_the_main_character_is_secretly_a/"
    },
    {
        "id": "1ibmgxf",
        "author": "otictac35",
        "title": "What's a movie sequel that is objectively worse than the original, but you prefer more?",
        "content": "My daughter acknowledges that Home Alone is a better movie than Home Alone 2, but prefers to watch the sequel over the original. Likewise, I have a friend who prefers Major League 2 to the original (completely inexplicable to me). Obviously some sequels are as good of movies as the originals like Godfather 2, Toy Story 2 and 3, or Empire Strikes Back, but some sequels are obviously inferior to their originals, but you just like it better. My choice for this is Karate Kid 2. I love the Japanese setting and the higher stakes of the final fight, not to mention how unbelievably cool the ice breaking scene is. What's your choice for a movie who's sequel is definitely not as well made, acted, shot, but you still like it better?",
        "upvotes": 364,
        "comments": 1164,
        "media": null,
        "permalink": "/r/movies/comments/1ibmgxf/whats_a_movie_sequel_that_is_objectively_worse/"
    },
    {
        "id": "1ibw46c",
        "author": "Tehgumchum",
        "title": "Pointless movie facts!",
        "content": "Anybody up for some pointless movie facts? I will start\n\n- Marty McFly never makes it back to his original timeline in any of the Back to the Future movies and finishes his life in an alternate timeline\n\n- Sigourney Weaver has played basketball in outer space in 2 different movies involving aliens and neither of them were Spacejam or its sequel\n\n- If you remove all of Millie Bobby Browns scenes from Kong vs Godzilla, it will have no impact on the movie/plot at all\n\nEdit: have another one to add\n\n- When Captain America travels to the past by himself to live his life, he completely ignores the fact Bucky is being tortured somewhere, or he cold prevent JFKs assassination",
        "upvotes": 52,
        "comments": 59,
        "media": null,
        "permalink": "/r/movies/comments/1ibw46c/pointless_movie_facts/"
    },
    {
        "id": "1ibhwse",
        "author": "NoCulture3505",
        "title": "Rebecca Hall Joins Adam Wingard’s ‘Onslaught’",
        "content": "",
        "upvotes": 288,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QGcELyPKc64FyNB4tWnZoK4v9FFez7CV1B2YW81b2sI.jpg?auto=webp&amp;s=ae711df58183f9525fb4f03f83f0ec16695182b7"
        },
        "permalink": "/r/movies/comments/1ibhwse/rebecca_hall_joins_adam_wingards_onslaught/"
    },
    {
        "id": "1ibbw6v",
        "author": "deckchair1982",
        "title": "Actors You Really Admire But Wish They Had Gone in a Different Direction",
        "content": "Harrison Ford was one of my favorite actors growing up yet I can't help feeling that was some lost opportunity in his career.\n\nHe made two amazing dramas with Peter Weir back to back (Witness, The Mosquito Coast) yet they never worked together again. A Weir-Ford collaboration akin to Scorsese-De Niro would have been something. I don't know the behind the scenes of it all and maybe Weir and Ford tried to make other projects but they fell through.\n\nFord was also heavily recruited for the Michael Douglas role in Steven Soderbergh's Traffic. I just don't get turning down Soderbergh, you know? And Soderbergh likes to collaborate with his actors he has worked with before. A Soderbergh-Ford pairing over multiple movies would have been something to see.\n\nI just think Ford lessened his dramatic ambitions and retreated to mediocre thrillers and callbacks to earlier roles that sometimes worked (Blade Runner 2049) and sometimes didn't (Indiana Jones and the Dial of Destiny.)",
        "upvotes": 517,
        "comments": 627,
        "media": null,
        "permalink": "/r/movies/comments/1ibbw6v/actors_you_really_admire_but_wish_they_had_gone/"
    },
    {
        "id": "1ibwml2",
        "author": "PrithvinathReddy",
        "title": "Ralph Ineson is another weapon in Robert Eggers cinematic arsenal.",
        "content": "Willem Dafoe often gets spotlight for his collaborations with Eggers (Thomas Wake - The Lighthouse, Heimir the fool - Northman, Prof. Albin Eberhart Von Franz - Nosferatu) and Eggers recently revealed that he has also offered Dafoe roles in his next two movies but another frequent collaborator of Eggers that has quietly delivered powerhouse performances in the director's films is \"Ralph Ineson\". \n\nKnown for his deep and imposing voice, Ineson got his break into the mainstream by appearing as Death Eater Aymcus Carrow in the later Harry Potter films and as House Greyjoy advisor, Dagmer Cleftjaw, in the 2nd season of Game of Thrones. A prolific character actor, he's even set to appear as the leading villain in a Marvel films as Glacactus in the new “Fantastic 4” movie. \n\nHere's a look at his roles in Eggers movies : \"William - The Witch\", \"Captain Volodymryr - Northman\", \"Dr. Wilhelm Sievers - Nosferatu\". ",
        "upvotes": 25,
        "comments": 31,
        "media": null,
        "permalink": "/r/movies/comments/1ibwml2/ralph_ineson_is_another_weapon_in_robert_eggers/"
    },
    {
        "id": "1ib6wfr",
        "author": "Most-Injury-9879",
        "title": "What is a movie that you wish you hadn't watched",
        "content": "Mine is Into The Wild (2007).\n\nI was about the same age as the main character, Chris McCandless, when I watched the movie for the first time. Although there weren’t many similarities between his life and mine, it had a profound impact on my thought process moving forward in life.\n\nI started looking at college, career, and friendships as options, and I didn’t really give them the importance they deserved. I did it all, but not wholeheartedly—not with purpose, the way other people did.\n\nJust like Chris, I started finding ways to be alone in any situation. No matter what the situation was, it was only being alone that brought me peace—whether it was being alone in my room, getting on a random bus and traveling without any purpose, writing a journal while sitting in the garden, or going to the roof to look at the stars. It was almost as if, whenever I was around people, I felt lonelier.\n\nJust like Chris realized in the end that “happiness is real only when shared,” I’ve realized in the last two years that friendships, love, and family are extremely important for a good life.\n\nYou cannot live an isolated life if you want to be successful—unless you’re a genius who is so good at what he does and so busy working that nothing else really bothers him. People skills are really important if you want to advance in your career. You need to be a good communicator to have a healthy relationship. You need to have connections with the right people when things get tough. Life has taught me these lessons the hard way.\n\nMy reluctance (unknowingly) to get along with people has resulted in many friendships ending or going stale. My fear of losing people and the belief that someone would take away my personal space kept me away from relationships. My preconceived notions of having zero expectations from others and thinking people are inherently bad stopped me from developing meaningful connections.\n\nI really wish I hadn’t watched that movie at that age. I was just starting to open up to people. I was at a stage in my life where I was still figuring out how life works, and I couldn’t get that movie out of my head for years.\n\nI’m doing well now. I hang out with people. I spend time with my family whenever I can. I’m still learning to make new friends and develop connections, but I’ll get better.\n\nWhat is a movie you wish you hadn’t watched, and why?\n\n\n\n\n",
        "upvotes": 854,
        "comments": 1332,
        "media": null,
        "permalink": "/r/movies/comments/1ib6wfr/what_is_a_movie_that_you_wish_you_hadnt_watched/"
    },
    {
        "id": "1ibnlua",
        "author": "Bruton2000",
        "title": "What's the one subgenre do you just not like and why?",
        "content": "Whilst I like anyone prefer some genres to others, I am usually willing to watch all types of movies and give them a chance. However there is one type I roll my eyes at and I wanted to ask which is that subgenre for you? \n\n\nFor me it is the \"Musician Biopic\". Tbh I don't think most musician's lives are interesting enough for a biopic and usually it just feels like an excuse to recreate a bunch of their performances. They also tend to only show the best parts of their lives and leave out a lot of the negative stuff. If I'm interested enough I'd rather watch a documentary on them. Its much more interesting.",
        "upvotes": 87,
        "comments": 254,
        "media": null,
        "permalink": "/r/movies/comments/1ibnlua/whats_the_one_subgenre_do_you_just_not_like_and/"
    },
    {
        "id": "1ibe25v",
        "author": "NoCulture3505",
        "title": "First Poster for \"The Wedding Banquet\"",
        "content": "",
        "upvotes": 227,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rctnqekqikfe1.jpeg?auto=webp&amp;s=8cdea205dddfc5a9ac6ff18b2b449190b0a0a46c"
        },
        "permalink": "/r/movies/comments/1ibe25v/first_poster_for_the_wedding_banquet/"
    },
    {
        "id": "1iawzi5",
        "author": "KnewMedalPhan",
        "title": "What Movie Sex Scenes Are Etched Into Your Mind Permanently?",
        "content": "For me, it will always be Mulholland Drive, RIP to David Lynch. I will NEVER forget being like 12 and just flipping through channels with my mom. Stumbled upon that film RIGHT before the first lesbian scene. I was absolutely mesmerized but was also trying to fumble for the remote to turn the movie off. My mom (who ALWAYS jokingly gave me a hard time about that kind of thing, this also happened with movies like Bound and Love &amp; Other Drugs) quipped, as I frantically shut the TV off that I had to have been enjoying it... she wasn't wrong. I'm still so captivated by that whole scene and having the movie's full context later. It's so beautiful.\n\n\n\nEdit: Didn't expect this much engagement! I love seeing everyone's answers. Seems like someone needs to make a compilation of a lot of the top answers...",
        "upvotes": 3203,
        "comments": 3660,
        "media": null,
        "permalink": "/r/movies/comments/1iawzi5/what_movie_sex_scenes_are_etched_into_your_mind/"
    },
    {
        "id": "1iarpio",
        "author": "Ovid738",
        "title": "Rewatched Forrest Gump. Totally forgot how dark it is.",
        "content": "Great movie, but I hadn’t seen it since I was a kid myself. On rewatch it’s crazy just how many things fly under the radar when you’re young. From Jenny’s abuse, to all the characters suffering so badly that if you put yourself in your shoes for a moment, you wonder how they haven’t gone crazy.\n\nBiggest shock factor for me was the scene at the start where Mrs Gump is essentially coerced into sex with the principal to get her son into school. As a child I had no idea - for some reason I thought the principal was just having an asthma attack in the house, which explained the weird noises he made. \n\nAnyway, any other films you rewatched and were surprised at as an older person? ",
        "upvotes": 6926,
        "comments": 1146,
        "media": null,
        "permalink": "/r/movies/comments/1iarpio/rewatched_forrest_gump_totally_forgot_how_dark_it/"
    },
    {
        "id": "1iameli",
        "author": "Pyro-Bird",
        "title": "Steven Spielberg Says He Fought to Stop E.T. Sequel From Being Made",
        "content": "",
        "upvotes": 13502,
        "comments": 669,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JN4QcwpqybYvCZ-Xc2CrjgKiGQydv24CGgdslFoH4iY.jpg?auto=webp&amp;s=1263c53a6fc9ab3b517d85c1bc855cad2cbaba54"
        },
        "permalink": "/r/movies/comments/1iameli/steven_spielberg_says_he_fought_to_stop_et_sequel/"
    },
    {
        "id": "1ibp2zb",
        "author": "Gnarly-Gnu",
        "title": "Any love for \"The Devil All The Time?\"",
        "content": "I think it's kind of a genius bit of filmmaking what with the two different eras. Some great actors, too. Holland, Skarsgard, Melling, Pattinson, Sebastian Stan, and just the fact that it's such an absurd story.\n\nFunny thing is though, that's how the Appalachian area really was with the religion lunacy.",
        "upvotes": 41,
        "comments": 31,
        "media": null,
        "permalink": "/r/movies/comments/1ibp2zb/any_love_for_the_devil_all_the_time/"
    },
    {
        "id": "1ib8i2h",
        "author": "West_Conclusion_1239",
        "title": "Lost Highway is David Lynch's most terrifying and evil film.",
        "content": "In honor of David Lynch's death, i revisited Lost Highway, and my God, this is arguably his most terrifying and most evil film.\n\nIt's probably my favorite film of his, and the insane thing is that i don't get it in the least but it made feel something, even if it's negative emotions, despair, paranoia, etc..\n\nI wonder what he wanted to say with this one, that paranoia can degenerate to senseless violence, and that it can literally cause you a psychic meltdown so intense that you morph into another person??\n\nLoool, i know i'm grasping for some meaning.\n\nAnd the Mystery Man??\n\nI still can't tell you what he represents, the meaning of his dialogues, or if he's actually the antagonist, he seems just a neutral ominous presence you would see in your dreams.\n\nPeople go for Mulholland Drive or Blue Velvet, but overall i love this film because i think it's David Lynch's most true depiction of a nightmare.\n\n",
        "upvotes": 307,
        "comments": 135,
        "media": null,
        "permalink": "/r/movies/comments/1ib8i2h/lost_highway_is_david_lynchs_most_terrifying_and/"
    },
    {
        "id": "1ib88kv",
        "author": "Sisiwakanamaru",
        "title": "Bowen Yang, Lily Gladstone, Kelly Marie Tran Dramedy 'The Wedding Banquet' to Open London's LGBTQIA+ Film Fest",
        "content": "",
        "upvotes": 279,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L5EBt7xNoqCwgoBehju3hT7dvhIJjMDoPAWHHUZRT0w.jpg?auto=webp&amp;s=03ec40323131b5de6a4de86ae55d598f08551c86"
        },
        "permalink": "/r/movies/comments/1ib88kv/bowen_yang_lily_gladstone_kelly_marie_tran/"
    },
    {
        "id": "1ib7r5t",
        "author": "mrjohnnymac18",
        "title": "‘Uncomfortable truths’: controversial film challenges authorship of famous Vietnam photo | Sundance 2025",
        "content": "",
        "upvotes": 253,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ld2NcfjrrM863AJwC5SFkOyR6HBNWRoA-fM3UYk92AE.jpg?auto=webp&amp;s=83b08727964a3c86647a959a5a116553d8e0a301"
        },
        "permalink": "/r/movies/comments/1ib7r5t/uncomfortable_truths_controversial_film/"
    },
    {
        "id": "1ibwxqg",
        "author": "Asleep-Antelope-6434",
        "title": "If you love denis villenueve sci fi films you will enjoy Oblivion (2013)",
        "content": "Its not a 10/10 oscar winning champion but oblivion is a pretty solid film with good visuals and good style. Theres a lot of wide shots that allow you take some incredible landscapes. The soundtrack is composed by m83 and is probably one of my favourite scores of all time. Its in no way perfect but a solid 7/10 and maybe 8/10 for me. The mystery aspect is pretty good and the action sequences are well made. I highly encourage any sci fi fans to check this out.",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1ibwxqg/if_you_love_denis_villenueve_sci_fi_films_you/"
    },
    {
        "id": "1ibhlt5",
        "author": "Davis_Crawfish",
        "title": "James Cagney isn't my cup of tea but \"Angels with Dirty Faces\" (1938) is so good that I never miss it when it's on.",
        "content": "I enjoyed the theme of sacrifice and redemption and this was not a gangster movie that glamorizes mob life or focuses too much about being a criminal and killing. It's actually more about the protagonist, Rocky Sullivan (James Cagney), who's a notorious gangster just out of prison. His childhood best friend is Fr Jerry Connolly (Pat O'Brien) who's now a Priest and yearns to reform the juvenile delinquents in the neighborhood, played by (the very annoying) Dead End Kids. \n\nRocky comes into play because he starts associating himself with the boys in the neighborhood while still behaving like a big shot. When Rocky kills a few fellow gangsters who turned on him and he's caught and sentenced to die, Father Jerry asks Rocky for the ultimate sacrifice. \n\nThis was a genuinely good movie. Cagney is brilliant in this, tough and full of bravado but also a nice guy underneath the tough exterior. O'Brien noble and a voice of reaon. I also liked Ann Sheridan as a spunky romantic interest for Rocky.",
        "upvotes": 56,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1ibhlt5/james_cagney_isnt_my_cup_of_tea_but_angels_with/"
    },
    {
        "id": "1ibi88u",
        "author": "systemstheorist",
        "title": "Movies that could be described as a \"series of music videos\" but with an overarching plot",
        "content": "Hi all I am seeking films I love like:\n\n* Tommy \n\n* The Wall\n\n* Across The Universe\n\nNot looking for Broadway or similar musicals but rather films that serve as explorations of albums or draw on other bodies of work. Don't really want just a series of music video but something that tells a story with an overarching plot.\n\nAny thoughts on other films like these?",
        "upvotes": 35,
        "comments": 203,
        "media": null,
        "permalink": "/r/movies/comments/1ibi88u/movies_that_could_be_described_as_a_series_of/"
    },
    {
        "id": "1iat7ma",
        "author": "Throwaway921845",
        "title": "Hollywood Work Was Already Drying Up. Then the Fires Hit.",
        "content": "",
        "upvotes": 1648,
        "comments": 241,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dPyXciC4RAnd6J91aLDfab3scDdB2_f0yKKiKmbmQSQ.jpg?auto=webp&amp;s=8f02da8c5ed8214d281194062d19e19ba7ccd2e5"
        },
        "permalink": "/r/movies/comments/1iat7ma/hollywood_work_was_already_drying_up_then_the/"
    },
    {
        "id": "1ibrgrz",
        "author": "LKomaromi",
        "title": "Overused movie lines/dialogues",
        "content": "Movie dialogues that are considered predictable and unoriginal. Banal exchanges between characters that have been around for a long time and you still hear them in modern movies/series.I am thinking:\n\nInvestigator: What happened that night?\n\nSuspect: It's all in my statement.\n\nInvestigator: I know. I've read your statement. But I want to hear it from you. (Turns off recording device)",
        "upvotes": 9,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1ibrgrz/overused_movie_linesdialogues/"
    },
    {
        "id": "1ib7apt",
        "author": "Mysterious_Coach1591",
        "title": "What is your favorite villainous song from an animated movie?",
        "content": "From any animated movie. \n\nI think mine is Frollos Hellfire. I think because he's so real and there are people like him amongst us which is terrifying. Real evil shit.\n\nI hadn't seen Hunchback of Notre Dame in a really long time but remembered the song and decided to watch. Scary especially these days. ",
        "upvotes": 113,
        "comments": 197,
        "media": null,
        "permalink": "/r/movies/comments/1ib7apt/what_is_your_favorite_villainous_song_from_an/"
    },
    {
        "id": "1ibb9oy",
        "author": "BlaisePetal",
        "title": "Bad films you love: share lists",
        "content": "Please share your favorite bad films and tell us why. By bad film, I would define it as poorly received by critics and filmgoers and/or box office bombs. Basically, the opposite of greatest films ever made. But you enjoyed it and relish rewatching it.\n\nHere are mine:\n\n\n1. DOA: Dead or Alive (2006)\n\nOn its release it was dragged by 'serious' cinema people as schlock, the gamer fans disparaged Devon Aoki as not looking like Kasumi at all and yet the wire work and fight choreography was a lot of fun to watch, personally. Holly Valance brought charisma to her role as Christie, and Jaime Pressly was charming in an all-american way. The pre-covid aughts era involved a lot of mindless fun, and it is sorely missed today.\n\n2. Blood: The Last Vampire (2009)\n\nCriticised for not having the finesse of the anime, but still a serviceable action flick if rather silly.\n\n3. American Satan (2017)\n\nAndy Black and his rock troupe get supernatural assistance and the film needs refinement. But the costumes are stylish and the amateurish production adds to its appeal.\n\n4. Confessions of a Shopaholic (2009)\n\nSaccharine in all the right ways - mocked by critics on release for being a fluffy chick flick, but delves into materialist obsession. Isla is suitably comedic.\n\n5. The Wrong Missy (2020)\n\nDavid Spade plays a likeable dork who needs to shake an annoying weird girl and it's indeed formulaic, but it's appropriate as a romcom.\n\n6. Saltburn (2023)\n\nMany said it had nothing to say about class in the very end, but the dancepop song at the end uplifts like cinematic molly.\n\n7. Bangkok Dangerous (2008)\n\nNic cage tears it up in Thailand. Seedy, atmospheric and probably a deep cut in his filmography. All you really need is a guy and a gun.",
        "upvotes": 36,
        "comments": 355,
        "media": null,
        "permalink": "/r/movies/comments/1ibb9oy/bad_films_you_love_share_lists/"
    },
    {
        "id": "1ibr2g1",
        "author": "RevolutionaryLoss856",
        "title": "War of the Worlds (2005) question",
        "content": "Some time after seeing the Spielberg film I read the H.G. Wells book and noticed that one sequence that's very similar is when their respective protagonists are trapped in a house with an unstable man who they eventually have to silence to keep them from attracting the aliens. The difference is in the book the protagonist merely strikes the man with the handle of an ax and knocks him out (he notes that this was a deliberate choice so as not to kill him outright) but the Martians hear the noise and take the man to his presumed death while the narrator hides. In the film however it appears Cruise outright killed the man offscreen (we don't see it but it's strongly implied).\n\nThis seems like a deliberate change on the filmmakers' part since it's a very different choice from the one the book's narrator made- in the book he was apparently trying to save both their lives but unintentionally caused the man's death, while Cruise was willing to sacrifice the man's life to save himself and his daughter. Do you think Cruise's character could have been more merciful and only knocked the man out, or were the circumstances different enough that it was more justifiable to kill him?",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1ibr2g1/war_of_the_worlds_2005_question/"
    },
    {
        "id": "1ibxkeo",
        "author": "Choice-Silver-3471",
        "title": "Should Bad Boys “Ride or Die” be the last movie with Will and Martin for the entire franchise?",
        "content": "[Will Smith and Martin Lawrence](https://preview.redd.it/q8yoc3it9pfe1.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=fc06856861e5b239625692d8296cfcd7e6a45b1c)\n\n  \nWill Smith is 56 years old and Martin Lawrence is 59 years old.\n\nOr should there be 5th and 6th movie between them?\n\nWill Smith and Martin Lawrence Aren’t Quite Ready to Pass Off the ‘Bad Boys’ Franchise Torch to the Next Generation Immediately After 'Ride or Die''s Release: **“We might have one more in us before we hand it off, but we’ve got a lot of young seeds in there. The Back Ain’t Went Out Quite Yet.”** \n\nThey would've done five Bad Boys movies already if Martin Lawrence was 100% and never had any health issues... BB 3 in 2010... BB 4 in 2016... Bad BB 5 in 2022.\n\nPeople getting to know Martin through his recent interviews probably don't know that he was naturally the funnier of the two.\n\nThe reality is though that there should have never been a sequel. The original from 1995 captured the vibe of the 1990s, and that's just not possible to replicate when that time is gone. If anything, they should have done a sequel right away in 96 or 97. With the right script it might have worked.\n\nDo you think Will and Martin can pull another Bad Boys movie at their respective ages?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1ibxkeo/should_bad_boys_ride_or_die_be_the_last_movie/"
    }
]