[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 498,
        "comments": 272,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jdaoaw",
        "author": "Afraid_Shape_1924",
        "title": "With Love, Meghan proves that no matter what you do people will find reasons to hate.",
        "content": "I would like to preface this by saying I’m no fan of Meghan (Sussex is it?). I did find her escapades during her stint with the royal family and after trying. \nBut the vitriol directed towards her in this show is excessive, inaccurate and unfair. \nThe show itself is charming. For those who say it’s “un-relatable” she never claimed to try to be. She’s doing her, and surprise, surprise she’s rich. Shocker. I don’t know how people are so offended by her choice of cookware, the fact that she has a large garden, time on her hands to harvest berries, and elaborate utensils when that’s literally her life. If you can’t relate have you considered that you’re not the target audience? I think it would be worlds more offensive if she tried showing people how to bargain hunt or use coupons to seem relatable when clearly that’s not her life. \n\nMeghan comes off as warm and genuine and you can tell the people in her life who she invites on genuinely care about her. The show is used to discuss their friendships and their lives and I don’t think it’s scripted to hype her up. The conversation goes both ways and it’s a show about connecting with people. \n\nShe clearly knows her food. It might not be to everyone’s taste but you can tell she derives genuine enjoyment out of food and preparing it. \nFolks mad that her recipes are not groundbreaking, guess what? None are. Even Pinterest regurgitates recipes that have been around for eons. She is just sharing what she likes. \n\nI think in the first episode she mentions that the kitchen she’s in is not hers, but there’s another main kitchen she cooks from for the majority of the show and that’s in her house, no? \n\nAnyway as much as I’ve never really liked the lady, the amount of vitriol she’s receiving for this show is unwarranted and unnecessary. ",
        "upvotes": 182,
        "comments": 206,
        "media": null,
        "permalink": "/r/netflix/comments/1jdaoaw/with_love_meghan_proves_that_no_matter_what_you/"
    },
    {
        "id": "1jdca5v",
        "author": "Robemilak",
        "title": "Joe Russo Says They Used AI for Voice Modulation in ‘The Electric State’: “[It’s] something any 10-year-old could do after watching a TikTok video.\" Thoughts?",
        "content": "",
        "upvotes": 43,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1jdca5v/joe_russo_says_they_used_ai_for_voice_modulation/"
    },
    {
        "id": "1jda2cd",
        "author": "Sweaty-Toe-6211",
        "title": "Jenna Ortega says ‘WEDNESDAY’ Season 2 is filled with more horror references &amp; unique visuals: “There's a whole episode based off of slashers, and we make a lot of horror references”",
        "content": "",
        "upvotes": 27,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jda2cd/jenna_ortega_says_wednesday_season_2_is_filled/"
    },
    {
        "id": "1jdcsgr",
        "author": "KnowNow101",
        "title": "Adolescence",
        "content": "I am completely blown away by the new addition to Netflix, Adolescence, the acting, the camera work, directing, the writing, everything was 10/10.  Its not very often i get emotional over a TV show but this is one of the best series I've seen. Now if only Netflix would fix their new horrible interface then i'd be happy.\n\n# ",
        "upvotes": 12,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jdcsgr/adolescence/"
    },
    {
        "id": "1jdfaq6",
        "author": "OverSyncopatedBeats",
        "title": "For Owen Cooper’s second ever role after he smashed it in Adolescence, he’s going to be in Emerald Fennell’s Wuthering Heights!",
        "content": "Playing a young Jacob Elordi. Big things coming for him and he really deserves it ",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdfaq6/for_owen_coopers_second_ever_role_after_he/"
    },
    {
        "id": "1jdfeaf",
        "author": "Gil_Pogozelich",
        "title": "Big fan of The Blacklist – looking for similar shows",
        "content": "Hey everyone  \nI'm a huge fan of *The Blacklist*   \nloved the mix of crime, mystery, and drama and that constant feeling of who’s playing who? It kept me hooked for all seasons\n\nNow that I’ve finished it, I’m on the hunt for something in a similar vibe. Any recommendations for shows with strong characters, twists, secret agendas or that FBI/criminal mastermind tension?\n\n  \n",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jdfeaf/big_fan_of_the_blacklist_looking_for_similar_shows/"
    },
    {
        "id": "1jd4edy",
        "author": "Few_Position7650",
        "title": "Adolescence",
        "content": "I can understand why people might feel the way they feel about the ending of the show buttttt episode three might be the best hour of television I have ever in my 38 years of watching tv seen. The tension and the acting and camera work were top tier tv. The little boy is definitely going to be on all of our screens for years to come. ",
        "upvotes": 24,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1jd4edy/adolescence/"
    },
    {
        "id": "1jd1ndt",
        "author": "ZackaryAsAlways",
        "title": "Movies like Electric State is the reason Netflix Originals have a bad reputation",
        "content": "Electric State imo incapsulates everything wrong with MOST Netflix Originals. By this I mean a bland by the numbers project with a couple cool things here and there ",
        "upvotes": 33,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1jd1ndt/movies_like_electric_state_is_the_reason_netflix/"
    },
    {
        "id": "1jcoxfo",
        "author": "Internal-Bed-3150",
        "title": "Adapting The Magician's Nephew first will make problems for Netflix",
        "content": "",
        "upvotes": 139,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1jcoxfo/adapting_the_magicians_nephew_first_will_make/"
    },
    {
        "id": "1jchy01",
        "author": "NellyNoo2000",
        "title": "Adolescence - one shot q&amp;a",
        "content": "Loved this thread on Netflix UK &amp; Ireland Twitter page about how they filmed the show.\n\nI was fascinated by the one shot episodes &amp; this q&amp;a answered most of my questions. Hopefully it answers yours too",
        "upvotes": 418,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1jchy01/adolescence_one_shot_qa/"
    },
    {
        "id": "1jdcv49",
        "author": "unsuresea",
        "title": "netflix sharing",
        "content": "just looking to see if anyone else is experiencing this\n\ni moved out of the household that my primary address on my netflix is back in october 2024, and have been using the same account (with the old primary address) on my pc and tv the entire time. i haven't been prompted to change the address, make a new account, or anything like that. was there an update to the sharing rules that i missed? am i just super lucky? just trying to see if its just me, or if this is common!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jdcv49/netflix_sharing/"
    },
    {
        "id": "1jcrapq",
        "author": "Positive_Night_5172",
        "title": "Too many shows being canceled after 1 season. I think they should be required to accept them for at least 2 seasons and the 2nd seasons should have an alternate finale that wraps the show up in case there's not going to be a 3rd season. Otherwise it's just a waste of viewers time and money.",
        "content": "I've gotten to the point that I won't even watch the 1st season of a show until it's been renewed for a 2nd season. I'm tired of wasting my time becoming interested in a new show only to be disappointed when it's canceled show quickly. They aren't even giving these shows a chance. They should come with a warning at the beginning letting viewers know it's a 1 season show so you can decide if yiu even want to bother or not. \nIf Netflix wasn't free with my T-Mobile service I would have canceled it. I'm getting pretty tired of Prime doing the same, or maybe worse, taking years to come out with new seasons. And even then they only have 6, or if you're lucky, 8 episodes. I really miss when shows had a new season every year, right around then same time as the last, and where 12 to 20 episodes depending on whether it was cable or network tv. ",
        "upvotes": 70,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1jcrapq/too_many_shows_being_canceled_after_1_season_i/"
    },
    {
        "id": "1jdh87u",
        "author": "yahooentertainment",
        "title": "The Terrifying Truth Behind Netflix’s ‘Adolescence’",
        "content": "**From The Wrap:**\n\nThe four-part Netflix series [“Adolescence”](https://thewrap.com/tag/adolescence/) is already making waves after its debut on Friday, with many wondering if the tale of a teen who has been accused of killing a female classmate is based on a true story.\n\nThe young boy, played by Owen Cooper, is quickly revealed to be guilty of the crime in the first episode, and the series begins a larger, steeper dive into incel culture and gender violence that has been promoted by influencers such as Andrew and Tristan Tate.\n\n“In the U.K., there’s a real problem with knife crime, certainly in the younger generation. There have been a series of of young boys who were killing young girls with knives, and it was really upsetting,” director Philip Barantini [told TheWrap](https://www.thewrap.com/adolescence-netflix-cast-creators-behind-the-scenes/) this month. “That was the seed that we wanted to explore, and send a bit of a message and maybe spark a bit of a conversation.”",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdh87u/the_terrifying_truth_behind_netflixs_adolescence/"
    },
    {
        "id": "1jdh1y0",
        "author": "Reasonable_Push_986",
        "title": "I have never experienced this!",
        "content": "Hi everyone, I have a problem. Maybe this is a ‘childish’ problem but I have never experienced it. \nI tried searching for ‘Temptation Island’ on Netflix and I was hit with ‘Looking for Temptation Island? We don’t have it yet but you can try these:’\n\nOkay first of all, I only want Temptation Island.\nSecond of all, why the fuck am I paying my hard-earned moneys for a platform that will geo-whatever some shows!!\nThird of all, Is it because I am in Kenya, Africa?😭\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jdh1y0/i_have_never_experienced_this/"
    },
    {
        "id": "1jdgdm2",
        "author": "Cooltwou",
        "title": "I have a question about WWE Programming",
        "content": "Do they actually have Raw and Smackdown for the year 2020 and to 2025 in the USA because I don’t have a way to check for myself because I can’t access the Netflix account I used to be able to access before and the last time I asked this only certain years had full seasons just trying to see if anything has changed ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jdgdm2/i_have_a_question_about_wwe_programming/"
    },
    {
        "id": "1jdf5ww",
        "author": "asaf27064",
        "title": "Adolescence - About Lisa",
        "content": "\nDid Lisa know her brother was guilty?\n\nIn the final episode of Adolescence, when Jamie calls from prison and says he’s going to plead guilty, Lisa and her mom stay in the car after arriving home. Lisa asks, “Will he be okay?” and then starts crying.\n\nMy question is—does she know what happened?\nDoes she think he murdered her?\nIs she crying because she’s coming to terms with the fact that he is guilty, or does she still hope that he didn't actually do it?\nDid she always know he was guilty but hoped there was a way to save him?\n\nWhat do you think? Does Lisa know that he killed her?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jdf5ww/adolescence_about_lisa/"
    },
    {
        "id": "1jd7kv0",
        "author": "Darthsullen",
        "title": "Why is my Netflix streaming quality so bad pixelated",
        "content": "Just recently got Netflix 7.99 plan and the streaming quality is horrible like I’m watching at 240p\nI don’t use WiFi but my phone service is great and I don’t have this problem with Disney plus or Hulu ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jd7kv0/why_is_my_netflix_streaming_quality_so_bad/"
    },
    {
        "id": "1jdbrgp",
        "author": "Icy_Dream_3028",
        "title": "(spoilers) On the Line has the worst ending to a movie I've ever seen in my life",
        "content": "&gt;!This film had all the makings of an entertaining yet forgettable thriller film. If you haven't seen it, the premise and synopsis is that an overnight shock jock DJ named Elvis enjoys playing cruel practical jokes on other staff members, and there is a new member of the staff named Dylan who is the board operator.!&lt;\n\n&gt;!A deranged listener calls in and tells Elvis that he has his family held hostage and might kill them because he blames Elvis for his girlfriend's suicide due to them sleeping together while she was working on Elvis's show. This listener proceeds to gain entry into the radio station, killing many staff members and wiring up the building to blow up.!&lt;\n\n&gt;!Elvis and Dylan traverse the building trying to find the listener and corner him in the broadcast room. The Listener produces a detonator and says that if his finger depresses the button on the detonator, and the bombs wired to the building and wired to Elvis's family will blow up, killing everybody. The show convinces The Listener to remove the bomb vests from Elvis's family and the listener forces Dylan to put on one of the bomb vests. The Listener then depresses the detonator button and drops it, and nothing happens.!&lt;\n\n&gt;!It turns out that the entire scenario was an elaborate practical joke aimed at Dylan, the new board operator. All of the staff members who had been \" killed\" come back into the broadcast room and everyone including Elvis and the listener and are all laughing and congratulating themselves on pulling off such a feat.!&lt;\n\n&gt;!Dylan, upset and traumatized, leaves but accidentally falls down the stairs, dying in the process. The next morning, Elvis gets into the vehicle of his boss, lamenting his decision and guilt-ridden, states that he will never work in radio again. The driver of the car turns around, revealing himself to be Dylan, whose real name is Max. Max is a stunt performer who specializes in these kinds of scenarios and the entire time, everybody was actually pranking Elvis instead.!&lt;\n\n&gt;!It was such a complete rug pull of an ending that left a terrible taste in my mouth. There was nothing funny about this scenario, it was just cruelty for cruelty's sake. There was one part where the listener told Elvis that if he didn't jump off of the top of the building and kill himself, he would murder his whole family. How could they be so sure that he wouldn't actually jump? It left me with tonal whiplash that I guess was intentional? The one good thing I can say was that the acting was pretty good, especially Mel's. Other than that, a completely terrible movie and a waste of everyone's time.!&lt;",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jdbrgp/spoilers_on_the_line_has_the_worst_ending_to_a/"
    },
    {
        "id": "1jd9e14",
        "author": "Kfchoneychickensammi",
        "title": "The Electric State Movie",
        "content": "So what I've seen was a few articles online with paragraphs how the electric state is so bad and a waste of netflix budget, if you google the movie you got imbd and rotten tomato having a drastic difference in rating for it, with imbd having it at 6.1/10 rating with nearly 20000 ratings, and rotten tomatoes having it at 14 percent out of 100 with only 90 ratings, if you go to Netflix it's ranked as number one in movies for Netflix right now, can people make up their minds? ",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1jd9e14/the_electric_state_movie/"
    },
    {
        "id": "1jcyjoq",
        "author": "indiewire",
        "title": "‘Adolescence’ Review: Netflix’s Real-Time Crime Drama Impressively Subverts Expectations",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jcyjoq/adolescence_review_netflixs_realtime_crime_drama/"
    },
    {
        "id": "1jd09r6",
        "author": "Poshdelux",
        "title": "Adolescents Series season 2 potential.",
        "content": "I finished the Adolecance series and couldn't help but feel unsatisfied. It was left inadequate, has so much potential for a full body of work. I was even thinking of an episode where the camera follows the day in question on CCTV. \n\nAnyone else left feeling this way? If so, what would be your idea for an episode? What would you like to explore in this series entire topic?",
        "upvotes": 4,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1jd09r6/adolescents_series_season_2_potential/"
    },
    {
        "id": "1jdbbip",
        "author": "Xyr0_",
        "title": "\"The Girls I've Been\" movie - is it still happening?",
        "content": "It's been 5 years since we last heard about this. I've read the books and i'm obviously a huge fan of this series, i was excited when i heard that a movie adaptation was coming. Is there still hope for this movie? Did Millie bail out on the project or something? I wouldn't mind Nora's character being recasted...i personally think Margaret Qualley fits the character better than Millie, but that's a conversation for another day.   \nWhat do you guys think?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jdbbip/the_girls_ive_been_movie_is_it_still_happening/"
    },
    {
        "id": "1jcz0n5",
        "author": "jake72469",
        "title": "Question: Brooklyn Nine-Nine. Only 4 seasons? More...",
        "content": "They recently added seasons 5 and 6 of Brooklyn Nine-Nine but at the same time they removed seasons 1 and 2 so that Netflix is only showing 4 seasons at a time.  I expect something similar will occur when they release seasons 7 and 8.  I've never seen Netflix do this before.  Is this a new thing or is this something we should expect with other shows?",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jcz0n5/question_brooklyn_ninenine_only_4_seasons_more/"
    },
    {
        "id": "1jd27dt",
        "author": "stellacampus",
        "title": "The (Parent) Trap",
        "content": "I was amazed to see Hayley Mills in The Trap, 64 years after starring in The Parent Trap.  It was one of those \"I didn't realize she was still of this Earth moments.\"",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jd27dt/the_parent_trap/"
    },
    {
        "id": "1jd7akz",
        "author": "I_am_aware_of_you",
        "title": "Frustrated with half shows",
        "content": "I truly wonder why if a show has 4 seasons they only provide 2 out of the 4. \n\nOr even worse if they have 11 they do have season 6-7-8.\n\nLike I want an option where I can see I want more of this show like tomorrow because I bingwatched the other seasons and now I’m bored….",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jd7akz/frustrated_with_half_shows/"
    },
    {
        "id": "1jciagd",
        "author": "bbportali",
        "title": "Looks like Adolescence has very good ratings and might be worth a watch as a mini series",
        "content": "",
        "upvotes": 35,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jciagd/looks_like_adolescence_has_very_good_ratings_and/"
    },
    {
        "id": "1jd4swb",
        "author": "21_Aug_Guy",
        "title": "Only Kids content accessible",
        "content": "Only child content is accessible in my account even though no viewing restrictions have been set. Could anyone please help? I'm trying to watch 'The Office' but only kids shows are accessible. Im just filling out content here so the minimum characters are reached.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jd4swb/only_kids_content_accessible/"
    },
    {
        "id": "1jcvnov",
        "author": "Grimmer6",
        "title": "All Of Us Are Dead ending",
        "content": "What do you guys theorise of the ending? I personally think that it was Cheong-san among the surviving hambie. Nam-ra jumped of the roof and they all came near the edge to see the other surviving hambies and all of their reactions had been changed which is normal. Everyone was shocked but Su-hyeok smiled a bit with the shock. It was like \"damn mf, you made it\". And On-jo was in total shock like she didn't expect that. The reaction on her face doesn't justify seeing other hambies made her shocked. It was a shock of something dear to you which you never expected to come being infront of you. I personally belive it's Cheong-san among the survivors who made them surprised. What do you guys think?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jcvnov/all_of_us_are_dead_ending/"
    },
    {
        "id": "1jd2qns",
        "author": "Life247",
        "title": "Can't download episodes in a series?",
        "content": "I can't download the Powerpuff Girls episodes to my phone. Is that because I have the Standard with Ads plan or is it the same regardless of the plan you have? Is it just because it is leaving on April 2nd in the United States? Help!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jd2qns/cant_download_episodes_in_a_series/"
    },
    {
        "id": "1jd1xuo",
        "author": "LJGremlin",
        "title": "Titles unavailable on ad-supported plans",
        "content": "I’m sure this has been mentioned here a few hundred times but the decision to have some titles unavailable for ad-supported plans is complete garbage.\n\nThere should be a law requiring that streaming services open up their write catalog regardless of if users choose to pay for the ad-supported service or the no ads service.  \n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jd1xuo/titles_unavailable_on_adsupported_plans/"
    }
]