[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 6,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1nlczq5",
        "author": "krasnyj",
        "title": "Ma cosa mi dici mai",
        "content": "(a me sembra vada pure più veloce ora che c'è il cantiere che prima, poi boh)",
        "upvotes": 55,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1c4jjsfja6qf1.png?auto=webp&amp;s=8f32982da22619766ab7c898b5bf5793d64890d3"
        },
        "permalink": "/r/torino/comments/1nlczq5/ma_cosa_mi_dici_mai/"
    },
    {
        "id": "1nlecoh",
        "author": "Tullio_Ostello",
        "title": "Poche persone riconosceranno questo circolo culturale",
        "content": "",
        "upvotes": 48,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ghkvekmzj6qf1.jpeg?auto=webp&amp;s=7158e33a9022b40d5ea1d9e6309a69652a7b58a6"
        },
        "permalink": "/r/torino/comments/1nlecoh/poche_persone_riconosceranno_questo_circolo/"
    },
    {
        "id": "1nlfa08",
        "author": "mariopast",
        "title": "Suggerimenti per come sopravvivere a Torino dopo essere stati truffati",
        "content": "Tristemente oggi la mia ragazza è atterrata a Torino, dove sta per iniziare un semestre Erasmus, solo per scoprire che il monolocale che aveva affittato non esisteva, e che il video e il contratto erano completamente false.\n\nQual è secondo voi il modo migliore per trovare una stanza in affitto in questo pessimo periodo per cercare? Avete qualche consiglio su quale agenzia affidarsi?\n\nGrazie in anticipo!",
        "upvotes": 11,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1nlfa08/suggerimenti_per_come_sopravvivere_a_torino_dopo/"
    },
    {
        "id": "1nll0bh",
        "author": "revengefabri",
        "title": "Dove andare a vivere in affitto?",
        "content": "Ciao a tutti, ho vinto un concorso pubblico con sede a Torino (in corso belgio). Sto quindi valutando adesso tutta una serie di immobili per andare in fitto, dove mi consigliate e sconsigliate di cercare? Sono senza auto. Grazie mille.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nll0bh/dove_andare_a_vivere_in_affitto/"
    },
    {
        "id": "1nl4u5z",
        "author": "ImpressedGuy95",
        "title": "Ristoranti e Piole",
        "content": "Sono a Torino da poco e a breve verranno a trovarmi dei parenti. Potete consigliarmi dei posti con cucina tipica in cui portarli a pranzo e cena? ",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1nl4u5z/ristoranti_e_piole/"
    },
    {
        "id": "1nlcysf",
        "author": "Alvarorrdt",
        "title": "Bouldering Torino",
        "content": "**Hi everyone!**\n\nI just arrived in Torino two days ago and I'm living in the Vanchiglia area. I'm really into bouldering and was wondering if anyone could recommend a good bouldering gym nearby.\n\nIdeally, I’m looking for a place that has a younger crowd (I’m 22M) so I can hopefully meet some people around my age. Also, a gym that offers monthly subscriptions without breaking the bank would be great — I’m on a student budget.\n\nThanks in advance for any tips or recommendations!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nlcysf/bouldering_torino/"
    },
    {
        "id": "1nlc6xs",
        "author": "Pucemi",
        "title": "Salone dell’auto di Torino",
        "content": "Ciao avevo visto tempo fa che recentemente fanno il museo dell aluto su instagram (se volete vi giro il link per chi non abbia capito)\ne avevo visto una sfilata di auto esotiche e ho scoperto che la fanno sabato e l’orario pero non ho capito dove. Per caso qualcuno sa rispondere  ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nlc6xs/salone_dellauto_di_torino/"
    },
    {
        "id": "1nky1d3",
        "author": "FriendlyCrow97",
        "title": "Aiuto – davvero internet qui fa così schifo?",
        "content": "Ciao Torinesi! Sono un argentino appena sbarcato in questa bellissima città e c’è una cosa che non mi fa dormire: l’internet.\n\nSono arrivato un mese fa, affitto un bilocale in Crocetta e lavoro da remoto. L’affitto include le spese e pure INTERNET. Peccato che qui abbiamo un modem 5G che va talmente male che per le call di lavoro devo usare l’hotspot del telefono… una tragedia.\n\nIl proprietario dice che il palazzo è vecchissimo e che ha già provato a mettere la fibra, ma prima bisognerebbe fare un investimento gigante che nessun vicino vuole pagare.\n\nQuindi mi chiedo: è normale così a Torino o il padrone non vuole spendere per un internet decente?\n\nMi pare assurdo pensare che in una città grande non arrivi la fibra… e lo dico io che vengo dal “terzo mondo” eh! 😅",
        "upvotes": 13,
        "comments": 33,
        "media": null,
        "permalink": "/r/torino/comments/1nky1d3/aiuto_davvero_internet_qui_fa_così_schifo/"
    },
    {
        "id": "1nkz6q5",
        "author": "Murky_Giraffe8700",
        "title": "Quale sarà per te il nuovo quartiere in cui acquistare un immobile?",
        "content": "Ciao a tutti,\n\nsto valutando l’acquisto di un immobile alle fine di questo anno ma, **quale pensate sarà il prossimo quartiere in cui conviene comprare a Torino?**\n\nparlo sia in ottica investimento che come qualità della vita (servizi, collegamenti, atmosfera del quartiere)\n\nHo vissuto a Borgo Vittoria, ma è davvero isolato per quasi tutto e da tutto ed è quasi impossibile viverci senza auto (il GTT fa schifo) senza nemmeno menzionare Baldissera \n\nVoi dove puntereste oggi? Ho visto Campidoglio, Santa Rita, Lingotto",
        "upvotes": 8,
        "comments": 37,
        "media": null,
        "permalink": "/r/torino/comments/1nkz6q5/quale_sarà_per_te_il_nuovo_quartiere_in_cui/"
    },
    {
        "id": "1nlazsk",
        "author": "Friendly-Army-7729",
        "title": "nuove conoscenze a TO💕",
        "content": "ciao, mi chiamo Alessio e sono gay. Studio a Torino ma sono della Toscana. Vorrei conoscere più gente qua a Torino e nei dintorni, se vi va scrivetemi senza problemi :)).",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nlazsk/nuove_conoscenze_a_to/"
    },
    {
        "id": "1nl1j2u",
        "author": "NomeUtente86",
        "title": "Preparazione esame di Maturità come privatista",
        "content": "",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1nl1j2u/preparazione_esame_di_maturità_come_privatista/"
    },
    {
        "id": "1nl0da6",
        "author": "BrightMud165",
        "title": "Birrificio Metzger",
        "content": "E' giusto una curiosità.\n\nOggi sono capitato per caso su questo [link](https://www.cibotoday.it/citta/torino/metzger-birra-riapertura-via-catania.html) dove parlano della riapertura dello storico birrificio e di una nuova birreria (che si chiamerà TONO). Proprio quest'estate sono capitato per la prima volta nel birrificio Metzger in via Catania e mi è sembrata una realtà più che avviata.\n\nPerché l'articolo parla di storica riapertura quando è già presente un birrificio/birreria?\n\nForse mi sono perso qualcosa",
        "upvotes": 2,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/w-dBDdepFuZv479FbbwOdMYnyMpifeNP4xfz_Dj9LeY.jpeg?auto=webp&amp;s=832b13d9d304a305c05ebc7f7a68a8bdb021ed1c"
        },
        "permalink": "/r/torino/comments/1nl0da6/birrificio_metzger/"
    },
    {
        "id": "1nkyqwn",
        "author": "TheGoodC4t",
        "title": "Conoscenze e attività",
        "content": "Ciao a tutti.  \nHo 22 anni, studio Ingegneria Informatica al Politecnico di Torino ,vivo a Lingotto e sto cercando di ricominciare da zero dopo un periodo pesante: esami, ansia, solitudine.  \n\nVorrei conoscere persone vere, qualcuno con cui fare attività insieme. \n\nMi piacciono tante cose:  \n- Auto e moto: non riesco a stancarmene.\n- Musica: Rock/Pop/classica mentre guido, mangio, studio e dormo. Sempre.\n- Gatti:  Ne ho uno e non posso vivere senza \n- Simulatori di guida: Ho un setup base, mi piacerebbe condividere questa passione  \n- Giochi da tavola: di qualsiasi  tipo\n- Tennis e pallavolo :Giocavo a scuola, mi piacerebbe riprendere in modo leggero  \n \n\nSono molto estroverso ma non cerco discoteche o serate rumorose essendo astemio. Cerco luoghi tranquilli, gruppi piccoli, attività reali.  \n\nQualcuno sa dove posso trovare gente così a Torino?\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nkyqwn/conoscenze_e_attività/"
    },
    {
        "id": "1nl29sq",
        "author": "Floofs-In-Space",
        "title": "Banks with ATMs with high max withdrawal amounts",
        "content": "Hi, I read that most banks limit daily withdrawals to 250 - 500 euro. I'm using my Fidelity debit card and looking for take out 500 (or more), if possible.\n\nAny recommendations on banks that allow that?\n\nEDIT: I went to Unicredit. They let me take out 750 euro. They gave me a 1,500 euro option too, but I didn't try it. Thanks, all!",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1nl29sq/banks_with_atms_with_high_max_withdrawal_amounts/"
    },
    {
        "id": "1nkzu0i",
        "author": "Ill-War4026",
        "title": "Festa di Laurea a OTTOBRE 🎓",
        "content": "Ciao a tutti!  \nSto cercando un locale dove poter festeggiare la mia laurea con circa **40 persone**. Il mio budget è sui **20€** a persona, ma se riesco a spendere meno sarebbe ancora meglio!  \nAvete suggerimenti su locali che offrano un buon rapporto qualità-prezzo, magari con un menù fisso o una soluzione economica ma carina per un gruppo del genere?\n\nGrazie mille in anticipo per i consigli! 😊",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nkzu0i/festa_di_laurea_a_ottobre/"
    },
    {
        "id": "1nkzmxg",
        "author": "OldPen9536",
        "title": "Acquisto Casa",
        "content": "Mi piacerebbe comprare casa.\n\nBudget 35k\n\nDistante un 30 minuti da Torino, vanno bene zone di montagna anche.\n\nLa cosa importante è che ci sia internet.\n\nHo visto diverse cose anche da ristrutturare… voi che zona mi consigliereste??",
        "upvotes": 0,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1nkzmxg/acquisto_casa/"
    },
    {
        "id": "1nk1dri",
        "author": "Euphoric-Spare-2871",
        "title": "Vivere a Torino senza macchina: si può davvero?",
        "content": "Sto considerando di vendere l’auto, ma non so se sia fattibile. Mezzi pubblici, bici, monopattini, car sharing... secondo voi, si può vivere bene a Torino senza macchina? Anche girando di notte? In quali quartieri è più facile?",
        "upvotes": 119,
        "comments": 110,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mef5hbh3gvpf1.jpeg?auto=webp&amp;s=d6c122533d134518d3336fe934cede08bc9809cc"
        },
        "permalink": "/r/torino/comments/1nk1dri/vivere_a_torino_senza_macchina_si_può_davvero/"
    },
    {
        "id": "1nkxkhy",
        "author": "mreducazione",
        "title": "Posteggio scooter Aeroporto Caselle",
        "content": "Qualcuno sa un modo conveniente o gratuito per posteggiare scooter/moto all’aeroporto?\nLoro vogliono 5€ al giorno al coperto, i posteggi privati esterni che ho visto più o meno uguale. \nEsiste un’area vicino all’aeroporto dove sostare gratuitamente? ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1nkxkhy/posteggio_scooter_aeroporto_caselle/"
    },
    {
        "id": "1nkpqig",
        "author": "katemc333",
        "title": "Agrotourism? And itinerary help. :)",
        "content": "Salve! We are Americans visiting for the first time, and I'm hoping you locals can give some insight.  \n  \nI like the idea of staying at an agrotourism place in Turin or Alba, but I also like to walk where I want to go into the city/town. The agrotourism places seem far away... is the public transit into town reliable and frequent? Or will I be stranded without a car?  \n  \nThis is our plan but we haven't booked any hotels or bed and breakfasts. \n\nThank you! \n\nNov 1 Land at MXP  \nNov 2 Milan  \nNov 3 Milan  \nNov 4 Train to Turin  \nNov 4 Turin  \nNov 5 Turin (If we can find a wine tour maybe?)  \nNov 6 Train to Alba  \nNov 7 Alba (Private Truffle Hunt + possible wine tastings)  \nNov 8 Alba (Truffle Festival)  \nNov 9 Train back to Milan  \nNov 10 Depart MXP at 11:35",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1nkpqig/agrotourism_and_itinerary_help/"
    },
    {
        "id": "1nk5fmh",
        "author": "TheShynola",
        "title": "Torino, dove preferiresti mangiare? Ho costruito qualcosa per voi.",
        "content": "Ciao,\n\nHo mappato la scena gastronomica di Torino nella mia app che si chiama Vota. L’idea è semplice: vedi due locali affiancati, scegli quello che preferisci, e la classifica si aggiorna all’istante. Più persone votano, più la lista diventa intelligente.\n\nPotresti confrontare, ad esempio, **Del Cambio** con **Tre Galli**. Esperienze totalmente diverse, ma col tempo anche posti molto differenti trovano naturalmente il loro livello nella classifica.\n\nNiente recensioni false. Niente influencer. Niente pubblicità. Niente testi generati dall’AI. Invece ottieni consigli da persone reali, locali. Niente rumore di Tripadvisor o Google. Solo semplice e diretto.\n\nL’app è gratuita, non richiede registrazione e non raccoglie dati personali. Ecco la versione iPhone:  \n[https://apps.apple.com/app/vota-restaurant-ratings/id6744969212](https://apps.apple.com/app/vota-restaurant-ratings/id6744969212)\n\nP.S. Non sono di Torino (vivo a Göteborg). Non raccolgo dati, non vendo nulla e non c’è contenuto generato dall’AI nell’app. I due posti di questo post, invece, li ho scelti con l’aiuto dell’AI. Voglio solo vedere come voi torinesi classifichereste la vostra scena gastronomica. Ho pubblicato anche in altre città, giusto per info 🙂",
        "upvotes": 11,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pUXl-zieNx-erUPEDAjjo74F7CO-oxA0hGpGug22OhQ.png?auto=webp&amp;s=f23f99578ac32984e73430d3b4cc487c95ccf17c"
        },
        "permalink": "/r/torino/comments/1nk5fmh/torino_dove_preferiresti_mangiare_ho_costruito/"
    },
    {
        "id": "1nk2ryx",
        "author": "Bruno_Barbiere",
        "title": "Vivreste in questa casa (acquistandola) pur di godere di questa bella vista sulla Mole Antonelliana?",
        "content": "",
        "upvotes": 16,
        "comments": 36,
        "media": null,
        "permalink": "/r/torino/comments/1nk2ryx/vivreste_in_questa_casa_acquistandola_pur_di/"
    },
    {
        "id": "1nkipq1",
        "author": "fjdofhke",
        "title": "Torino to Dolomite weekend trip",
        "content": "Is it possible to do a weekend trip to the Dolomites with only public transit from Torino? I wanted to go now before it starts getting too cold, to do some hikes. But I’m not sure it’s possible to go in one weekend without a car, and if it is I’m not sure where in the Dolomites would be best as there seem to be so many amazing places. \n\nIt’s been my dream to see the Dolomites, any advice would be appreciated, thank you! ",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1nkipq1/torino_to_dolomite_weekend_trip/"
    },
    {
        "id": "1nk7fv9",
        "author": "Icy-Buddy8558",
        "title": "Che fine ha fatto Madame Mabel?",
        "content": "Sono passato con alcuni miei amici e l'ho trovato chiuso, eppure su maps indica che è attivo e ci sono anche delle recensioni recenti di 4/5 mesi fa\n\nVoi ne sapete qualcosa? E in alternativa riuscite a consigliare dei locali a tema esoterico a Torino?",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1nk7fv9/che_fine_ha_fatto_madame_mabel/"
    },
    {
        "id": "1nk7cae",
        "author": "Last_Access2094",
        "title": "Anyone up for a Photo walk in Torino?",
        "content": "Ciao Everyone, Got back from home and I realised I have let my creative side take a hit, so brought back my camera with me this time. Anyone up for a photos clicking dump? I usually love when I am able to infuse natural light into architecture. ",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1nk7cae/anyone_up_for_a_photo_walk_in_torino/"
    },
    {
        "id": "1nkh4ku",
        "author": "Similar_Profit_7298",
        "title": "Palestre di Lotta Olimpica o Greco Romana?",
        "content": "Salve, sto cercando delle palestre di Lotta a Torino, per ora ho visto che ci sono solamente il CUS, la Greca Team e Sportforma in tutta la città che offrono dei corsi, conoscete altri posti? Cosa ne pensate dei 3 che ho citato, qualche feedback?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nkh4ku/palestre_di_lotta_olimpica_o_greco_romana/"
    },
    {
        "id": "1nki60w",
        "author": "InstanceOk2385",
        "title": "Miglior gestore router wi-fi portatile (saponetta)",
        "content": "Salve a tutti sono da qualche giorno a torino ed essendomi trasferito in un appartamento privo di collegamento cablato(né fibra né ADSL), necessito di un router di tipo portatile con conseguente tariffa dati.\nFacendo lo speed test da cellulare (iPhone 12 pro con 5G) i risultati sono veramente scandalosi con circa 10 Mbps in dowload. È possibile trovare qualche gestore che offra di meglio, al di là del fatto che questo sia uno speed test svolto da un cellulare e non con un router vero e proprio.\nP.s. Mi trovo abbastanza in centro città e la\ntacche di segnale erano al massimo\nGrazie mille!",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1nki60w/miglior_gestore_router_wifi_portatile_saponetta/"
    },
    {
        "id": "1nkhf1s",
        "author": "Unlucky_Winner_1187",
        "title": "Where to find second hand bikes",
        "content": "Where can i find a second hand bike shop with fair prices??",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1nkhf1s/where_to_find_second_hand_bikes/"
    },
    {
        "id": "1nkgoro",
        "author": "ImpactFlat1514",
        "title": "Amicizie",
        "content": "Ciao, sto cercando nuove amicizie tra i 20 e i 27 anni sia donne che uomini. Mi piace passare il tempo in modo tranquillo: mi piace andare ai musei, giocare ai giochi da tavolo, fare passeggiate, scoprire posti nuovi in città e anche uscire per un aperitivo o una serata in discoteca. Mi piacerebbe conoscere persone con interessi simili, con cui chiacchierare, ridere e condividere un po’ di tempo insieme. Se ti va, scrivimi.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nkgoro/amicizie/"
    },
    {
        "id": "1nkggwo",
        "author": "ChillDudeTwenty2",
        "title": "Truffa soldi per benzina - Zona S. Rita",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1nkggwo/truffa_soldi_per_benzina_zona_s_rita/"
    },
    {
        "id": "1nket81",
        "author": "lospavaldo",
        "title": "gruppo per far amicizia",
        "content": "Sei appassionato di anime e manga, ma sei timido, introverso, hai ansia sociale e magari non esci di casa da giorni?\nVorresti socializzare, farti nuovi amici con la tua stessa passione, ma ti ritrovi sempre nei soliti gruppi online tossici, dove è impossibile creare legami veri.\n\nGli eventi dal vivo? Costano una fortuna (15–30€ solo per entrare), sono pieni di stand con prezzi gonfiati, gente ambigua e un affollamento assurdo.\nImmagino che anche tu ti sia rotto il cazzo di questa situazione, giusto?\n\nEcco la soluzione: La Toman Italiana.\nSiamo la community di anime e manga più grande d’Italia, con oltre 400 persone attive. Ai nostri eventi c’è un ambiente sano, sicuro e davvero pensato per stringere nuove amicizie.\n\n👉 Se vuoi davvero cambiare la tua vita, ricominciare a socializzare e vivere nuove esperienze con persone come te, entra subito nel nostro gruppo WhatsApp tramite questo link.\n\n\n https://chat.whatsapp.com/Bi3jTiiDIZOCJrA6ymFWdZ?mode=ems_copy_t",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nket81/gruppo_per_far_amicizia/"
    }
]