[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 487,
        "comments": 261,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iublcq",
        "author": "Demons_Butterfly",
        "title": "I can't believe David Fincher is making Squid Game remake for Netflix rather than Mindhunter S3",
        "content": "are we missing something? who wants an American squid game? and David Fincher of all people shouldn't be wasted on it. Just own up and renew Mindhunter, It's a classic. There's lot of material left too. I cannot think of 3 netflix originals better than it. \n\nI am sorry i am ranting here but why do you think Fincher wants to make squid game? ",
        "upvotes": 272,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1iublcq/i_cant_believe_david_fincher_is_making_squid_game/"
    },
    {
        "id": "1iuk9mq",
        "author": "Baby_0il04",
        "title": "Gabby petito body cam footage is making me so mad rn",
        "content": "I’m only one episode in but the way these cops are talking have me so mad rn. They’re claiming he’s a victim of abuse, when the call was about him hitting her, and the marks he has are scratches, which are defensive marks meaning she was defending herself from him. You don’t attack someone by scratching/clawing at them. Brian is laughing and stubbing over his words as he tries to defend himself. While she’s crying and blaming herself. It’s so obvious who’s the victim in this situation. (Maybe that’s hindsight talking but ugh it gets my blood boiling) \n\nSorry just had to rant here, cuz I have no one to talking to about it ",
        "upvotes": 58,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1iuk9mq/gabby_petito_body_cam_footage_is_making_me_so_mad/"
    },
    {
        "id": "1itynt2",
        "author": "S4v1r1enCh0r4k",
        "title": "IMAX CEO Richard Gelfond says he thinks that Netflix plans to make 8 Narnia movies",
        "content": "",
        "upvotes": 102,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1itynt2/imax_ceo_richard_gelfond_says_he_thinks_that/"
    },
    {
        "id": "1iu01pi",
        "author": "EthanWilliams_TG",
        "title": "Netflix Commits $1 Billion to Mexico’s Film Industry in Major 4-Year Investment",
        "content": "",
        "upvotes": 72,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1iu01pi/netflix_commits_1_billion_to_mexicos_film/"
    },
    {
        "id": "1iu5itn",
        "author": "yahoonews",
        "title": "‘Extraction’ TV Series Starring Omar Sy Ordered at Netflix From Glen Mazzara, Russo Brothers",
        "content": "",
        "upvotes": 36,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iu5itn/extraction_tv_series_starring_omar_sy_ordered_at/"
    },
    {
        "id": "1itwilc",
        "author": "ellie_gina",
        "title": "Um, the girl who thinks she's Madeleine McCann has been ARRESTED for 'stalking Kate and Gerry'",
        "content": "",
        "upvotes": 109,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1itwilc/um_the_girl_who_thinks_shes_madeleine_mccann_has/"
    },
    {
        "id": "1it96ui",
        "author": "TheMirrorUS",
        "title": "Brian Laundrie’s parents shunned by Florida community over Gabby Petito’s murder following Netflix docuseries",
        "content": "",
        "upvotes": 3500,
        "comments": 684,
        "media": null,
        "permalink": "/r/netflix/comments/1it96ui/brian_laundries_parents_shunned_by_florida/"
    },
    {
        "id": "1iumabz",
        "author": "ceoetan",
        "title": "Unpopular Opinion: Brian Laundrie’s parents were smart and acted accordingly, or they’d be in prison right now.",
        "content": "\nIt’s become clear to me that Brian’s parents were extremely smart about this tenuous situation, and they did everything they could to protect themselves. And lo and behold, they still have their freedom to this day:\n\n- Retained “plausible deniability” by not further prodding Brian for answers as to what happened to Gabby when he called them the night of the murder. \n\n- Sensed Brian’s urgency and panic on the phone, so they retained their lawyer when Brian said he needed one, even at the cost of $25,000. \n\n- Followed the lawyer’s advice not to speak to anyone regarding Gabby or Brian. Do not speak to anyone, law enforcement, neighbors, friends, Gabby’s family. Most likely would incriminate themselves if they did speak. \n\n- Sheltered Brian from prying eyes when he got home and didn’t prod him for further answers. They left Gabby’s van in the driveway for anyone to see because they didn’t know she was dead until the body was found.\n\n- Forced law enforcement to go through proper legal procedures at every junction, including if they wanted to speak to Brian directly. \n\n- Never let emotion cloud their judgement, so they wouldn’t be prone to mistakes. \n\n- Followed proper law enforcement procedure and reported Brian missing when he didn’t return home for 3-4 days. Possibly regretted the decision to let him leave, but he may have also left without their knowledge or they thought some time alone to clear his head would do him good. \n\n- Picked up the abandoned Mustang and brought it home when it was discovered. \n\n- Waited to go into the park until the reserve was open to the public after the flooding. \n\n- Cooperated with law enforcement during the search for Brian on the ground. \n\n- Located Brian’s remains based on their knowledge of the park and previous visits with Brian. \n\nOf course this unemotional response may have left them seeming callous or heartless in the eyes of the public / neighbors / family, but I think the media did their fair share to portray them like that as well. \n\nI don’t think they expected Brian to kill himself or I believe they would’ve proactively sought treatment for his depression / suicidal thoughts. \n\nMost likely they also became victims of Brian’s false narrative about what really happened to Gabby. Brian couldn’t even admit it to himself with the suicide note. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iumabz/unpopular_opinion_brian_laundries_parents_were/"
    },
    {
        "id": "1iul7wh",
        "author": "Robemilak",
        "title": "‘Nobody Wants This’ Season 2 Casts Leighton Meester, Miles Fowler (EXCLUSIVE)",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iul7wh/nobody_wants_this_season_2_casts_leighton_meester/"
    },
    {
        "id": "1itgt0k",
        "author": "ellissabain",
        "title": "In full: The chilling ‘burn after reading’ letter Brian Laundrie’s mum wrote to him",
        "content": "",
        "upvotes": 521,
        "comments": 115,
        "media": null,
        "permalink": "/r/netflix/comments/1itgt0k/in_full_the_chilling_burn_after_reading_letter/"
    },
    {
        "id": "1iukke1",
        "author": "JohnnytheGreatX",
        "title": "Was my Account Hacked?",
        "content": "At around 7:30 PM tonight I was successfully using Netflix.  A few hours later I tried to use the app on my TV to watch a show, and I was logged out.  I tried to log in, and my password was not recognized.  I tried change my password and Netflix did not recognize either my phone number or email address.  I was able to look up my account by first and last name and credit card number, but Netflix sent a verification number to an email address I did not recognize.  WTF happened?  How do I fix this?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iukke1/was_my_account_hacked/"
    },
    {
        "id": "1iuiy3f",
        "author": "Gokiburi-Sensei",
        "title": "How do I make the PC app quality looks passable. I'm trying to use the app on my PC and the image looks like shit.",
        "content": "I've had this similar problem with Hulu where where the image is fuzzy and terrible to look at as if they don't give a shit about about the PC app. I have 300mps download, connected with Ethernet, no other apps open, set to high quality, and no settings I touch make this picture worth paying a subscription for. Was wondering if anyone had any solutions.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iuiy3f/how_do_i_make_the_pc_app_quality_looks_passable/"
    },
    {
        "id": "1itnk0p",
        "author": "Debbie2801",
        "title": "Gabby Petito",
        "content": "I’m watching this atm and I have thoughts!\nObviously Brian’s parents were cautioned by their attorney not to speak to anyone. Not the police, not FBI, not Gabby’s family and certainly not the media. \n\nI feel this legal advice cost them a lot!\n\nFirstly - I believe it cost them their son - to a degree. If they had of spoken to police or FBI I believe he would have been taken in for questioning and possibly arrested or at least monitored very closely. Therefore not escaping so he could end his own life rather than face the consequences of his actions. \n\nSecondly - they lost their daughter. She has not communicated with them since Brian passed away. They never- according to her and her husband- confided in them. \n\nThirdly - their reputations in the community. People are angry at them. Blaming them for not assisting parents desperately trying to find their daughter. \n\nAnd finally financially - they had to pay Gabby’s parents a significant sum - not disclosed - from the settlement of the civil lawsuit. \n\nSo I guess I’m wondering - was it in fact sound legal advice?\nWhat are your thoughts? ",
        "upvotes": 114,
        "comments": 130,
        "media": null,
        "permalink": "/r/netflix/comments/1itnk0p/gabby_petito/"
    },
    {
        "id": "1iugr30",
        "author": "Dogpatch1966",
        "title": "Netflix: Alone Day 4 Mikey",
        "content": "I know this show is old but I just found it. Mikey just got lost and for some reason, it pissed me off so badly! These people are supposed to be survival experts and are making the dumbest mistakes in the very beginning of the show! I don’t know if anyone else feels this way or if he continues to act this way but I guess I will find out.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iugr30/netflix_alone_day_4_mikey/"
    },
    {
        "id": "1iu41v1",
        "author": "MysteriousDelay6266",
        "title": "Wolf King | Official Trailer | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iu41v1/wolf_king_official_trailer_netflix/"
    },
    {
        "id": "1iu69lk",
        "author": "Beginning_While_7913",
        "title": "The Search For Instagram’s Worst Con Artist thoughts?",
        "content": "Just finished it and I feel like it had potential but I don’t know that we necessarily learned a whole lot from the family members which was disappointing because I thought it was going to be more focused on what happened that made her that way and her thought processes. i found it interesting when they theorized what her motives were. i also had thought there was deaths involved from people stopping treatments for these holistic methods so I was disappointed they didn’t touch on that. ",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1iu69lk/the_search_for_instagrams_worst_con_artist/"
    },
    {
        "id": "1iue1ob",
        "author": "MysteriousDelay6266",
        "title": "When Life Gives You Tangerines | Official Trailer | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iue1ob/when_life_gives_you_tangerines_official_trailer/"
    },
    {
        "id": "1itx0ki",
        "author": "SquareFroggo",
        "title": "What's the last sitcom you watched on Netflix?",
        "content": "\nThe last sitcom that I watched on Netflix was Friends. I watched it from season 1 to season 10 and I thought that it was an overall funny and interesting show to watch. My favorite character was Ross Geller. ",
        "upvotes": 10,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1itx0ki/whats_the_last_sitcom_you_watched_on_netflix/"
    },
    {
        "id": "1iucvdu",
        "author": "halleinwonderland186",
        "title": "Departure season 3 not on Netflix?",
        "content": "Hi, I'm new to this sub so not sure if anyone has asked this before... I've just finished seasons 1 and 2 of Departure, not realising there's a 3rd season. When I looked online I couldn't find anywhere to watch it in the uk (not even Amazon Prime, despite some articles saying it's available on there). Does anyone know if they're bringing season 3 to Netflix?\nTIA",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iucvdu/departure_season_3_not_on_netflix/"
    },
    {
        "id": "1iub2ys",
        "author": "V4porZ",
        "title": "Fate/Apocrypha Audio issue",
        "content": "So ive been trying to watch this lovely anime for a while now, as someone from sweden i for some reason only have Japanese Original and german audio, subtitles i have swedish and japanease. Is there any way to get english audio because i know it exists.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iub2ys/fateapocrypha_audio_issue/"
    },
    {
        "id": "1iuabeu",
        "author": "Automatic-d1ck",
        "title": "What happened to my screen?",
        "content": "hi! My netflix looks like that. The colors seem slightly off from the video (pretty obvious on the face, the earing, the hand or the emoji). Anyone know how to fix this?\n\nhttps://preview.redd.it/2vjkfpje5dke1.jpg?width=4624&amp;format=pjpg&amp;auto=webp&amp;s=96850c756ee6c1955c3985b891196c71ab2cf5d3\n\nhttps://preview.redd.it/nmpnz09j5dke1.jpg?width=4624&amp;format=pjpg&amp;auto=webp&amp;s=41fd4b9993c6e76947c8bcee7c0dfd905ea673cd\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iuabeu/what_happened_to_my_screen/"
    },
    {
        "id": "1iu0r7x",
        "author": "MysteriousDelay6266",
        "title": "The Life List | Official Trailer | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iu0r7x/the_life_list_official_trailer_netflix/"
    },
    {
        "id": "1itubw9",
        "author": "Adept-Sweet7825",
        "title": "'Zero Day' review: Robert De Niro's first TV series is unable to handle this political moment",
        "content": "",
        "upvotes": 11,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1itubw9/zero_day_review_robert_de_niros_first_tv_series/"
    },
    {
        "id": "1iu8r8y",
        "author": "Acceptable_Laugh_955",
        "title": "I want a movies or series that I won't get bored in the middle of watching it? please some suggestions",
        "content": "Here guys a few movie and series I liked  and I want some similar to it: \n[  ] Outer banks\n[  ]My fault London\n[  ]The Mortal Instruments: City of Bones\n[  ]Fate: The Winx Saga ~2021\n[  ] Shadowhunters\n[  ] The tearsmith ~2024\n[  ] Maxton hall ~2024\n[  ] Culpa mia ~2023\n[  ] Riverdale ~2017  /7 seasons",
        "upvotes": 1,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1iu8r8y/i_want_a_movies_or_series_that_i_wont_get_bored/"
    },
    {
        "id": "1iugav1",
        "author": "honeydex",
        "title": "gabby petito documentary",
        "content": "i remember watching a documentary about gabby petito a few years back, i believe it was on prime. just saw there’s a new one on netflix, does anyone know if there’s anything new, new evidence, new perspectives from the other one, is it worth the watch ? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1iugav1/gabby_petito_documentary/"
    },
    {
        "id": "1itmwcs",
        "author": "Fartmaster69420Yolo",
        "title": "Why would a Netflix original be \"leaving soon\"?",
        "content": "I am just curious. \n\nIs it Netflix checking the numbers and it's not being watched? been on for a long time? They are selling the rights of the movie to another platform? ",
        "upvotes": 31,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1itmwcs/why_would_a_netflix_original_be_leaving_soon/"
    },
    {
        "id": "1iu4a4e",
        "author": "Friendly_Honey7772",
        "title": "THE WEREWORLD is finally getting an anime series guys!!! I have such high hopes for this. Damn I loved the trailer... the animation looks SICKK!! Hope Netflix doesn't mess this up. I have waited too many years for this book to get a decent adaptation!!!",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iu4a4e/the_wereworld_is_finally_getting_an_anime_series/"
    },
    {
        "id": "1iuchbt",
        "author": "Sea_Manufacturer_766",
        "title": "Gabby Petito doc and Toast of London theme tune",
        "content": "Did anyone else find it an odd choice for the documentary to end with shots of Gabby loving life whilst the Toast of London theme tune played over the top? I know it has a nice happy go lucky feel to it, but it is the theme tune to a fairly absurdist comedy show",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iuchbt/gabby_petito_doc_and_toast_of_london_theme_tune/"
    },
    {
        "id": "1iswm3v",
        "author": "lovethats",
        "title": "Gabby Petito Doc",
        "content": "Watching Brian’s parents “search” for Brian made my blood boil. A quote from the FBI said “they did not emote.” Of course they didn’t. They knew where to pretend to look the entire time. \n\nYou’re telling me he was within a mile of the car the entire time and his parents show up to look one day and they find his remains the same day. \n\nThen Brian says in his suicide note that Gabby “begged for an ending to her pain” and he thought it was “merciful.” \n\nI have never felt a level of anger at a family in my life. I hope the entire Laundrie family pays for what they did.\n\nThis is so sickening. ",
        "upvotes": 847,
        "comments": 378,
        "media": null,
        "permalink": "/r/netflix/comments/1iswm3v/gabby_petito_doc/"
    },
    {
        "id": "1itt1q2",
        "author": "No_Nectarine_4528",
        "title": "Gabby Petito doco",
        "content": "The woman that picks Brian up and drops him off at the camp site pissed me off. “The bible fell straight into his lap” AND?? Was so unnecessary and irrelevant. It wasn’t Satan that killed Gabby, it was her dog of a boyfriend. ",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1itt1q2/gabby_petito_doco/"
    }
]