[
    {
        "id": "1k9vefp",
        "author": "netflix",
        "title": "Your Ultimate Guide to Netflix Tudum 2025: The Live Event",
        "content": "The biggest shows. The most exciting movies. And the best fans in the world.\n\n[\\#TUDUM](https://x.com/hashtag/TUDUM?src=hashtag_click) 2025 — a global fan celebration featuring the biggest stars — **streams live on Netflix May 31 at 8 pm ET | 5 pm PT.**\n\nhttps://preview.redd.it/awnxyl4yskxe1.jpg?width=2175&amp;format=pjpg&amp;auto=webp&amp;s=74b93c24bde7d41b4b370da3600e8d82ba0bf96a\n\n# Head to [TUDUM.COM](http://TUDUM.COM) for a complete guide to this year's event on Netflix, including how to buy tickets and real-time updates about the news and exclusive reveals you won’t want to miss.",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1k9vefp/your_ultimate_guide_to_netflix_tudum_2025_the/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 32,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1knwtjs",
        "author": "theipaper",
        "title": "TV show Adolescence sparks rise in hate on world's biggest incel site",
        "content": "",
        "upvotes": 532,
        "comments": 252,
        "media": null,
        "permalink": "/r/netflix/comments/1knwtjs/tv_show_adolescence_sparks_rise_in_hate_on_worlds/"
    },
    {
        "id": "1ko1ym1",
        "author": "Emma086",
        "title": "Underrated Netflix Gem You Need to Watch!",
        "content": "Just found The OA and it’s criminally underrated. Mind-bending plot, emotional depth, and major Black Mirror vibes.\n\nIf you’re bored scrolling,,,watch this. You won’t regret it.\n\nWhat hidden Netflix gem do you recommend?",
        "upvotes": 27,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1ko1ym1/underrated_netflix_gem_you_need_to_watch/"
    },
    {
        "id": "1ko2kag",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix is promoting Squid Game, the caption reads: \"A legend in the making. Player 456. June 27.\"",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/i3yzdr8lo51f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ko2kag/netflix_is_promoting_squid_game_the_caption_reads/"
    },
    {
        "id": "1ko1bwu",
        "author": "DayOfTheDeb",
        "title": "American Manhunt: Osama Bin Laden, How does Zero Dark Thirty hold up against the documentary",
        "content": "I just finished the new American Manhunt series for Osama Bin Laden. It was very interesting to hear the perspective of the CIA including the analysts and see the tense atmosphere inside the White House. \n\nI watched Zero Dark Thirty when it originally came out and I am now rewatching it. What do you feel like was left out of the movie or changed or just felt different in the movie versus the documentary? ",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ko1bwu/american_manhunt_osama_bin_laden_how_does_zero/"
    },
    {
        "id": "1ko1l6g",
        "author": "Internal-Bed-3150",
        "title": "David Fincher and Netflix in a \"feud\" over title of Squid Game spinoff",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ko1l6g/david_fincher_and_netflix_in_a_feud_over_title_of/"
    },
    {
        "id": "1kng9wq",
        "author": "Brutal-Juice",
        "title": "Netflix will show generative AI ads midway through streams in 2026",
        "content": "",
        "upvotes": 106,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1kng9wq/netflix_will_show_generative_ai_ads_midway/"
    },
    {
        "id": "1knm6el",
        "author": "Sufficient_Ebb_5694",
        "title": "Whats your favorite Netflix original?",
        "content": "I'm looking for a captivating show that will keep me interested so im curious of your favorites. So far I think Stranger Things or Altered Carbon S1 are my favorites",
        "upvotes": 50,
        "comments": 144,
        "media": null,
        "permalink": "/r/netflix/comments/1knm6el/whats_your_favorite_netflix_original/"
    },
    {
        "id": "1ko31gf",
        "author": "Savings_Entrance380",
        "title": "Denzel Washington and Robert Pattinson thriller coming to Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ko31gf/denzel_washington_and_robert_pattinson_thriller/"
    },
    {
        "id": "1knlkfo",
        "author": "Illustrious_Cry9722",
        "title": "American Manhunt - Osama Bin Laden",
        "content": "I just finished watching the new series and what an emotional roller coaster ride. I usually don’t get too caught up on documentaries but this one had me on edge. Partly bc 9/11 is deeply personal for me and even to this day, my eyes tear up when I see images of the planes hitting the towers. And they always trigger my memories of how the city smelled (I lived in Brooklyn) the days following 9/11. Anyway, I’m no history bluff and I’m sure people will debate on the accuracy of the events that unfolded but from my standpoint, I thought the documentary was well-made and yes, I wish it was a little longer.",
        "upvotes": 27,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1knlkfo/american_manhunt_osama_bin_laden/"
    },
    {
        "id": "1ko49d4",
        "author": "scorpionZftw",
        "title": "Need some recommendations",
        "content": "Hey everyone, i have been looking for a show to watch for some time but have no clue what to start. Here are my favorite shows:\n\nMindhunter, Arcane(loved it so much), DMC, Dota Dragons blood, Brooklyn 99, Rick and Morty, Better Call Saul, Bodyguard, Lucifer, Lupin, The Witcher, Ragnarok, Blue eye samurai and Outer Banks.\n\nI couldn’t complete these: Dark (got bored), Stranger Things (loved the first 2 seasons only) and Money Heist.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ko49d4/need_some_recommendations/"
    },
    {
        "id": "1ko3kmv",
        "author": "Meowwoe",
        "title": "#LDR ‘Can’t Stop’ thinking about how disappointing S4 is",
        "content": "I’m genuinely baffled.\n\nThe first episode just shows a 5-minute concert. No plot, no character, no message, just a CGI band playing a song. That’s it…\n\nAfter all those years waiting for S4 with curiosity, impatience and especially high expectations; I am very disappointed about almost every episode.\n\nThere were a few moments though that were mildly entertaining or amusing but overall the show has been on a downward trajectory since the last season.\n\nIt’s lazy, lacking any kind of story, and designed just to be flashy.\n\nThis season is not worth the long wait.\n\nToo bad.\n\nWhat was your favourite season?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ko3kmv/ldr_cant_stop_thinking_about_how_disappointing_s4/"
    },
    {
        "id": "1knicni",
        "author": "Feeling_Fox_5426",
        "title": "New show recommendations please!!!",
        "content": "Looking for a new show to binge.... for reference, I'll list below my favorite series I've watched so far (on and off Netflix):\n\n* Breaking Bad\n* Ozark\n* Severance\n* The Witcher\n* Peaky Blinders\n* The Sinner\n* Mindhunter (R.I.P)\n* Queen's Gambit\n\nHopefully based on these you can get an idea of my interests. Drop me your favorites below and tell me why you love them!!!\n\n",
        "upvotes": 23,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1knicni/new_show_recommendations_please/"
    },
    {
        "id": "1ko02wg",
        "author": "mewshew",
        "title": "Netflix is broken",
        "content": "I tried to reactivate my account. Suddenly my email doesn't connect to an account. My phone number doesn't connect to an account. I use a password manager. The passwords are right. What do I do to get my account back?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ko02wg/netflix_is_broken/"
    },
    {
        "id": "1knqg0b",
        "author": "tinkkonreddit",
        "title": "What’s a good tv show you’d recommend ?",
        "content": "Hey guys pls help 😭!!! I’m looking for new shows to watch ( I have pretty much all platforms) I just want any a good binge show and I actually like a wide range of shows. Ex. Greys Anatomy, Sweet magnolias, VPD, The 100 !!, Dynasty, Forever was also super good !, Blood and Water, Criminal mind, and I could go on but you get what I mean lol. Any suggestions somewhere up in there ? \n\nOh I also like documentaries ! ( American Murders, Natalia Grace, Good American Family )",
        "upvotes": 6,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1knqg0b/whats_a_good_tv_show_youd_recommend/"
    },
    {
        "id": "1knzagp",
        "author": "NoahColl29",
        "title": "Why do half of the shows on my Continue Watching list keep disappearing?",
        "content": "Over the last few weeks, I've noticed that literally half of my Continue Watching list on Netflix keeps disappearing - the shows on it cannot be found anywhere on Netflix. I'm not just having this problem on one device - my iPhone, Sony Bravia TV and other iPhones all have the exact same problem. It's not just on one profile - ALL FIVE profiles lose access to these shows completely. Previously, I've found they reappear the next day spontaneously and then several days later, disappear again. However this time, it's been 3 days and none of these shows have reappeared onto my Netflix account. Help of any form would be thoroughly appreciated!!!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1knzagp/why_do_half_of_the_shows_on_my_continue_watching/"
    },
    {
        "id": "1knvl9k",
        "author": "Spiritual_Wing_8860",
        "title": "What should I watch after I finished weak hero and bloodhounds?",
        "content": "I finished watching bloodhounds and weak hero, so it would be awesome if anyone could suggest me good fighting k dramas or Asian dramas on Netflix (Japanese as an example, so doesn’t have to be only Korean). Please and thank you!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1knvl9k/what_should_i_watch_after_i_finished_weak_hero/"
    },
    {
        "id": "1ko4rga",
        "author": "AdvertisingLoose5885",
        "title": "Can someone please explain what this is and how I can fix it?",
        "content": "This started yesterday when I wanted to watch Dr stone and when I went onto netflix it just kept scrolling down the different accounts but when I went on this morning it was fine but it suddenly started yesterday and I don't know how to get it to stop.",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/n2a15v2h461f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1ko4rga/can_someone_please_explain_what_this_is_and_how_i/"
    },
    {
        "id": "1kmypq5",
        "author": "abelldeez",
        "title": "The Liver King documentary is an advertisement. He's duped you all again",
        "content": "This is a brilliant AD for ancestral supplements. Here's how they did it.\n\n1. Paint liver king as a broken, troubled, but \"just trying to get a good message out\" guy who takes all the blame and is the only bad person in this story. Heck, he was a major fraudster it makes sense he would lie, right?\n\n2. Portray the nine ancestral tenets and liver as positively as possible... People saying it changed their life, his kids are healed with no other details given, Brian started the company when he figured out liver was good.  All this can be true as whole foods and better lifestyle choices are good.  No one on the marketing team or ancestral supplements knew about the steroids, he told them he didn't use so they had no idea remember? \n\n3. Separate the brilliant but evil marketing plan that made ALL his supplement companies exorbitant amounts of money from the scam that grew his companies immensely. \n\n4. A mutant physique going viral by taking $12,000 worth of GH per month, eating raw testicles for shock value and denying steroid use to generate more chatter.  He did this to grow his company.  Sure, spreading the word of better living is good, but the main goal is to grow the company.  And they did just that.  Now just make LK the sole evil person and make everyone feel for LK.  \n\n3. Did anyone else notice the beautiful shelf of ancestral supplements the camera panned to right at the end? How convenient, I mean we know liver king lied but he wanted to help and it saved both kids.  Organs and carnivore diets are the key to great health.  Don't want to eat raw organs, let us show you this lovely display of products from ancestral supplements, they are good people who were not in on the scam just profited immensely what a coincidence. Don't buy from ancestral he owns multiple supplement companies. They only told you about one, think that was a mistake? \n\n4. HE LITERALLY TELLS EVERYONE HE'S A FRAUDSTER RIGHT TO YOUR FACE. HE LIED TO EVERYONE.  YOU THINK HE STOPPED BEING FRAUDULENT? C'MON PEOPLE! THE GUY WAS PRINTING MONEY AND DOING FRAUDULENT RECIEPTS.  LITERALLY DOING IMMORAL ASS SHIT TO MAKE MORE MONEY AS HES DOING WITH THIS DOCUMENTARY.\n\nSeriously if anyone thinks this is anything but an advertisement I feel bad for you.  He's duping you AGAIN\n",
        "upvotes": 275,
        "comments": 81,
        "media": null,
        "permalink": "/r/netflix/comments/1kmypq5/the_liver_king_documentary_is_an_advertisement/"
    },
    {
        "id": "1ko0u2j",
        "author": "anxious_queen_69",
        "title": "The royals (Indian version)",
        "content": "Almost finished The Royals on netflix, the story line was mid, not bad actually. But i cant help but think it would be so much better with if the female lead was someone other than Bhumi. She didnt seem suitable for the role itself and also with Ishan and there was no chemistry. I mean i dont want to sound too judgemental but thats just what I think.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ko0u2j/the_royals_indian_version/"
    },
    {
        "id": "1knngut",
        "author": "kittycaatttt",
        "title": "New Show \"Bet\" based on Kakegurui",
        "content": "Thoughts??? I'm watching this and it's really hard to watch... What do y'all think. It's really cringe from my perspective and the actors are all kinda weird.  ",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1knngut/new_show_bet_based_on_kakegurui/"
    },
    {
        "id": "1knttyg",
        "author": "Revolutionary-Ad4469",
        "title": "Is it just me, or does the show Wolf King seem a bit similar to Avatar: The Last Airbender?",
        "content": "There’s this new show called Wolf King about a young commoner who comes of age and finds out he’s the last of a long line of werewolves and the heir to the throne. It kind of reminds me of how Aang discovers he’s the last airbender. The villains in Wolf King are lions, while in Avatar it’s the Fire Nation. The wolf also goes on a journey, just like Aang does.\n\nI’ll admit, the first season of Wolf King felt a bit rushed to me, but overall I think it’s a good show. What do you guys think?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1knttyg/is_it_just_me_or_does_the_show_wolf_king_seem_a/"
    },
    {
        "id": "1kmz2vq",
        "author": "lIlI1lII1Il1Il",
        "title": "Netflix’s ad tier is growing really fast — and that means more ads",
        "content": "",
        "upvotes": 84,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1kmz2vq/netflixs_ad_tier_is_growing_really_fast_and_that/"
    },
    {
        "id": "1kmwjq8",
        "author": "y1314_",
        "title": "The Deadly American Family",
        "content": "I am just finishing up the documentary, and the only thing I can think of is Molly’s obsession with having custody over kids that she DID not bring into this world. It’s very weird imo! I understand raising the kids but to feel so entitled to them is… crazy! \nIt’s like Molly was using the kids to help herself look like the victim. And Molly knew these kids didn’t have anyone else to go to so she seized her moment and forced herself onto the kids in becoming their mother. \nJust my opinion! \n",
        "upvotes": 112,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1kmwjq8/the_deadly_american_family/"
    },
    {
        "id": "1kn3srs",
        "author": "EthanWilliams_TG",
        "title": "'Rebel Moon 3' Seems Unlikely, Says Writer Kurt Johnstad, It Will Happen\"With some luck and an act of God\"",
        "content": "",
        "upvotes": 20,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1kn3srs/rebel_moon_3_seems_unlikely_says_writer_kurt/"
    },
    {
        "id": "1kntgyo",
        "author": "Disastrous-Put7062",
        "title": "Just a thing I noticed",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/s3xy4hvq031f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1kntgyo/just_a_thing_i_noticed/"
    },
    {
        "id": "1ko0z2k",
        "author": "jenkem___",
        "title": "Is the movie “MA” that just came out on Netflix about Chinese businessman Jack Ma?",
        "content": "It seems like it could be, but then why is Octavia Spencer featured so prominently in the title card thingy? Did she have some kind of relationship with Jack Ma? Some posters for the movie say “Get home safe”, maybe she was like a mother figure to him or something? I dunno, I’m confused, any help is appreciated! ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1ko0z2k/is_the_movie_ma_that_just_came_out_on_netflix/"
    },
    {
        "id": "1knlkz4",
        "author": "fabdab501",
        "title": "Low quality on Netflix when using a playback speed extension",
        "content": "For some reason I get low quality on Netflix when using a playback speed extension. The extension is called \"Global Speed\". Anyone know a fix to the problem?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1knlkz4/low_quality_on_netflix_when_using_a_playback/"
    },
    {
        "id": "1knutql",
        "author": "Decent_Patience_4384",
        "title": "Adolesence (2025)- A Netflix Mini Series Review",
        "content": "https://literatureandreview.blogspot.com/2025/05/adolescence-2025-nerflix-mini-series.html?m=1 The story centres on 13 year old boy Jamie Miller who is the suspect of a murder in his school.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1knutql/adolesence_2025_a_netflix_mini_series_review/"
    },
    {
        "id": "1knl31t",
        "author": "Apprehensive-Bank636",
        "title": "How do I support good tv?",
        "content": "Just watched new season of LDR and some episodes are pure genius.\n\nIn films my support usually is pay for the ticket, rate it good(on LB), recommend people.\n\nBut in tv it’s difficult, because I don’t know how they make money. So how to support the shows on Netflix that I like.\n\nBecause it’s all on same platform, it all feels equal.\n\nScavengers Reign for example belongs in some next league, also Blue Eye Samurai.\n\nI just want to support it so that they can get some positive feedback and keep making good shit and don’t get discouraged.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1knl31t/how_do_i_support_good_tv/"
    },
    {
        "id": "1kmfc6h",
        "author": "Then-Scholar1748",
        "title": "Netflix’s A Deadly American Marriage: Jack and Sarah Corbett’s full victim impact statements",
        "content": "",
        "upvotes": 337,
        "comments": 240,
        "media": null,
        "permalink": "/r/netflix/comments/1kmfc6h/netflixs_a_deadly_american_marriage_jack_and/"
    }
]