[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1kc1pnd",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 25,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1kc1pnd/la_piola_friends_meetup/"
    },
    {
        "id": "1kz478f",
        "author": "_pigreco_",
        "title": "torinocronaca",
        "content": "https://torinocronaca.it/sondaggi/cronaca/513938/chi-haucciso-chiara-poggi-alberto-stasi-e-colpevole-o-innocente-e-andrea-sempio.html\npenso che lo schifo che mi provoca torino cronaca sia difficile da scrivere a parole, se domani chiudesse bottega offro la colazione a tutta torino \n",
        "upvotes": 105,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4lbfmnv48x3f1.jpeg?auto=webp&amp;s=eb5d922a1ccfc8c43047776d61db8cb7e6416988"
        },
        "permalink": "/r/torino/comments/1kz478f/torinocronaca/"
    },
    {
        "id": "1kzqp08",
        "author": "nonneui42",
        "title": "Help su cosa fare questa sera",
        "content": "Sono a torino da poche settimane vorrei tirarmi fuori di casa stasera avete proposte interessanti io penso che sto pomeriggio verso sera mi farò un giro al Valentino ma oltre a questo non ho molte idee ",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1kzqp08/help_su_cosa_fare_questa_sera/"
    },
    {
        "id": "1kzpnn9",
        "author": "Logeybearbro",
        "title": "Champions League final",
        "content": "Ciao a tutti, stiamo visitando Torino per il festival “Jazz is Dead”, oggi è la finale di Champions League, ci sono buoni consigli per i luoghi per guardare la partita? Sono solo pub irlandesi?\n\nVorrei guardare il calcio da qualche parte come un locale, anche con del buon vino!\n\nGrazie in anticipo!!! 🙏",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kzpnn9/champions_league_final/"
    },
    {
        "id": "1kyeok7",
        "author": "Spiritual_Cake_9127",
        "title": "Average Torino Experience",
        "content": "",
        "upvotes": 314,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/s71yuqiqup3f1.jpeg?auto=webp&amp;s=1cc068d1c84e73130691a6ae93ae08ad3368e7ba"
        },
        "permalink": "/r/torino/comments/1kyeok7/average_torino_experience/"
    },
    {
        "id": "1kzf4wc",
        "author": "JeramiDeng",
        "title": "Table tennis?",
        "content": "Is there any place where People play table tennis casually in torino? Like you just come in and there is good chance u can find som1 to play against",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kzf4wc/table_tennis/"
    },
    {
        "id": "1kz45gr",
        "author": "jackedpic",
        "title": "Where to test for STD in Torino",
        "content": "I tried calling the CEMUSS but it says phone number out of service… any recommendations ? Thanks ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kz45gr/where_to_test_for_std_in_torino/"
    },
    {
        "id": "1kye7i4",
        "author": "linda9043",
        "title": "Amicizie femmine",
        "content": "Ciaoo a tutti. Sono sud americana, mi sono trasferita da qualche mese a Torino per amore, e insomma sto faccendo un po' fatica ad integrarmi. Mi piacerebbe poter fare amicizia con qualche ragazza socievole, che le piaccia uscire, ballare  ogni tanto 😅ma con chi poi si riesca a parlare anche tranquillamente e in profondità. Ho 30 anni, e da parte mia posso definirmi un amicizia sincera e leale, non sono invidiosa ❤️‍🩹 sono in continua crescita personale ed apprezzo molto che le persone si focalizzino più in se stesse che negli altri. \n",
        "upvotes": 11,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1kye7i4/amicizie_femmine/"
    },
    {
        "id": "1ky5yy2",
        "author": "willsmith-slap",
        "title": "Multa gtt",
        "content": "Ciao a tutti, ho un mega dilemma\n\nHo preso recentemente due multe GTT, e in entrambi casi avevo il biglietto (nel primo caso avevo l'abbonamento mensile, semplicemente non con me; nel secondo avevo fatto il biglietto con l'app ma l'obliteratrice non me l'ha validato) e in entrambi i casi mi sono rifiutato di pagare sul posto con l'idea di fare ricorso o non pagare mai più.\nIl ricorso è stato respinto con risposta mail di una riga.\nAdesso iniziano ad arrivare le lettere a casa con la multa lievitata.\nNon so voi, ma io ricordo, quando facevo il liceo, che se si era in possesso di abbonamento valido, e si passava entro x giorni in centrale a verificarlo, la multa veniva annullata. Adesso, per l'abbonamento dimenticato, la multa era circa di 20€ (biglietto nuovo + tasse amministrative???). Questa cosa per me non ha nessun senso.\nNel secondo caso invece non so proprio che dire. Avevo il biglietto e l'avevo pure \"\"timbrato\"\". Vabbè.\n\nCosa devo fare? Proseguo questa inutile lotta contro la GTT o sborso centinaia di euro? Qualcuno ha provato ad andare da un giudice di pace o cose simili?\n\nPS. No joke, dopo la seconda multa mi sono comprato una bici e non ho mai più messo piede su un pullman. Ho letteralmente avuto l'abbonamento tutta la mia vita e sono tra i pochi sfigati che ha sempre fatto il biglietto. Eppure è a noi che rompono l'anima. Ok. Ottima tattica.",
        "upvotes": 25,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1ky5yy2/multa_gtt/"
    },
    {
        "id": "1kyhhn2",
        "author": "Right-Lack-8722",
        "title": "Liutaio decente a Torino?",
        "content": "Salve a tutti, mi potete consigliare un liutaio decente a Torino, per chitarre acustiche o elettriche, sono andato da qualcuno e non mi ha convinto il loro lavoro, grazie?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kyhhn2/liutaio_decente_a_torino/"
    },
    {
        "id": "1kye13h",
        "author": "EquivalentMorning692",
        "title": "We 2 giugno a Torino",
        "content": "Ciao a tutti, \n\nCome da titolo, farò il we del 2 giugno a Torino, ho già prenotato le attrazioni principali (palazzo Reale, Museo egizio, dell'auto, mole) e ho un itinerario di massima (piazza Carlo Alberto, Vittorio Veneto, via Roma) ma vorrei chiedervi se è sufficiente o se aggiungereste qualcosa? Vi chiedo anche suggerimenti su dove mangiare (colazione pranzo cena) in zona centro o comunque raggiungibile con i mezzi. Grazie a tutti",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1kye13h/we_2_giugno_a_torino/"
    },
    {
        "id": "1kyhcxz",
        "author": "Pharrus",
        "title": "Stampi in silicone per resina",
        "content": "Salve a tutti, ho comprato online della resina epossidica, tuttavia vorrei sapere se da qualche parte è possibile comprare gli stampi in silicone senza doverli ordinare da Amazon o siti vari ed eventuali che li fanno costare poco ma ci perdono due settimane a farli arrivare.\n\nQualcuno sa qualche negozio dove poterli acquistare (possibilmente in centro)?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1kyhcxz/stampi_in_silicone_per_resina/"
    },
    {
        "id": "1ky2gug",
        "author": "Dependent-Ice-6239",
        "title": "Kappa Futur Festival 2025 Solo 🇧🇷",
        "content": "Going on my first solo trip to Barcelona this year and couldn't pass up the opportunity to visit Italy for this beautiful festival.\n\nI am originally from Brazil but currently live in Miami. Looking to meet people, anyone else going?",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ky2gug/kappa_futur_festival_2025_solo/"
    },
    {
        "id": "1ky9nw1",
        "author": "Snoo-95604",
        "title": "Squadre pallanuoto minori?",
        "content": "Ciao a tutti!\nSto cercando qualche squadretta di amatori di pallanuoto che si alleni \"tanto per\", magari che faccia una partita ogni tanto senza però partecipare a nessuno campionato \"serio\". \nVoi ne conoscete? Tutte quelle a cui penso io sono semi-professionali ma mi risultano troppo impegnative attualmente. Che mi dite? \nGrazie!!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ky9nw1/squadre_pallanuoto_minori/"
    },
    {
        "id": "1kyefp6",
        "author": "tomtomben69",
        "title": "Valdocco / Aurora è sicuro ?",
        "content": "Salve signore/signori,\n\nCi trasferiamo con la mia ragazza a Torino a breve. \nAbbiamo visto un appartamento in Via Urbino, verso corso Principe Oddone. \n\nCom’è il quartiere in questa zona ? Parcheggio, sicurezza? \n\nGrazie in anticipo, ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1kyefp6/valdocco_aurora_è_sicuro/"
    },
    {
        "id": "1ky65g8",
        "author": "Individual-Relief416",
        "title": "Cerco Noleggio motorino",
        "content": "Cerco noleggio motorino per due persone. Ho visto che Cooltra ha prezzi dai € 300 in su per un mese. Ci sono alternative? Grazie ! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ky65g8/cerco_noleggio_motorino/"
    },
    {
        "id": "1ky53en",
        "author": "Zerotel",
        "title": "Trasferimento a Torino",
        "content": "Ciao a tutti, dovrei trasferirmi a Torino entro settembre e avrei bisogno di un bilocale. Budget 700 circa. Cerco zone ben collegate, con servizi vicini e che siano tranquille, sia di giorno che di notte. Potete darmi qualche consiglio? Vi ringrazio in anticipo",
        "upvotes": 0,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1ky53en/trasferimento_a_torino/"
    },
    {
        "id": "1kxqw0u",
        "author": "Jimthafo",
        "title": "Mercato di Corso Brunelleschi, quali sono i banchi migliori?",
        "content": "Mi sono trasferito da poco in Corso Brunelleschi vicino al Mercatò e a me piace andare nei mercatini rionali. Per chi ci va, quali sono i banchi che vi sentite di consigliare? Non importa il prezzo ma la qualità e possibilmente piccoli produttori di cibo locale. Grazie",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1kxqw0u/mercato_di_corso_brunelleschi_quali_sono_i_banchi/"
    },
    {
        "id": "1kxe1sw",
        "author": "nomosquitosplease",
        "title": "Per chi gioca a padel, specialmente ragazze/donne, qual è il club migliore secondo voi?",
        "content": "Ciao, ho 37 anni e vorrei iniziare a giocare a padel con regolarità. Giocavo a tennis e ho fatto un paio di partite di padel con amici di un gruppo internazionale, ma vorrei iniziare a prendere lezioni. Vorrei fare lezioni con un gruppo di 2-3 altre ragazze e mi piacerebbe trovare un club dove poi gli/le insegnanti seguano bene la parte del creare le accoppiate giuste per livelli, magari rimescolando i gruppi, formando coppie di doppio per fare dei tornei, ecc.. Insomma che non si limitino ad andare avanti con il corso con il gruppo iniziale.\n\nNon sono una persona competitiva, ma ho sempre fatto sport di squadra da piccola e vorrei ritrovare quell'atmosfera da team, le giornate di tornei e drink a fine giornata, sia per l'aspetto sociale che per avere più incentivi a fare attività fisica al di là delle singole lezioni.\n\nHo giocato per ora una volta al Riverside e una al Gpadel Cenisia e seguo la pagina Instagram del Motovelodromo. Ho parlato con tutti e tre e mi sembra di capire che come prezzi siano simili, tutti e tre mi hanno messa in lista in attesa che altre ragazze di livello simile vogliano iniziare. Le persone con cui ho parlato mi consigliano soprattutto Gpadel Cenisia, ma dalla pagina Instagram mi sembra che anche al Motovelodromo ci siano persone molto carine e organizzino molti eventi, e credo che non sia molto nominato nella mia cerchia semplicemente perché per molti è un po' fuori mano (per me invece sarebbe più o meno equidistante rispetto agli altri).\n\nMi piacerebbe sapere da chi frequenta questi club quale secondo voi è il più attivo a livello di torneini e formare lo spirito di squadra, al di fuori delle singole lezioni. Se c'è qualche ragazza/donna che legge, magari sa anche di qualche gruppo in partenza che cerca una terza/quarta persona.\n\nGrazie!",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1kxe1sw/per_chi_gioca_a_padel_specialmente_ragazzedonne/"
    },
    {
        "id": "1kxr2wi",
        "author": "Vast-Honey7832",
        "title": "Pachinko",
        "content": "Per la comunità asiatica di Torino, qualcuno sa dove si possa giocare?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kxr2wi/pachinko/"
    },
    {
        "id": "1kxew5g",
        "author": "AverageSkudis",
        "title": "Gtt to move app not working",
        "content": "I downloaded the To move app and bought a daily ticket everything worked fine until I validated it and scanned the QR code in a bus. It showed a checkmark on the scanner, but my app just froze and now it doesn’t even open and just keeps loading. This happened to me and my girlfriend everything exactly the same on two different phones. ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1kxew5g/gtt_to_move_app_not_working/"
    },
    {
        "id": "1kxbuy3",
        "author": "Necessary-League2287",
        "title": "Nuovo gruppo per meeting e uscite di Torino",
        "content": "Ciao! Attualmente stiamo gestendo giá da un pó di mesi un gruppo nato per fare conoscenza a Torino e dintorni, siamo non molti ma giusti sparsi tra ragazzi/ragazze.\n\nSiccome vedo nel sub, un sacco di ragazzi o ragazze che arrivano a Torino per motivi lavorativi e vogliono fare nuovo conoscenze, chi ha il piacere sarebbe il benvenuto a unirsi tranquillamente ☺️regole del gruppo:\n\n-Siamo tra un range di etá dai 19 fino ai 30 anni. \n-Partecipare alle uscite e non fare ghosting sul gruppo ( come noto a volte diversi gruppi che nascono e si unisce un macello di gente a caso per poi non capirsi piú nulla). -Che sia lí per fare REALMENTE conoscenze e amici e non sià un pretesto per stare in presenza di ragazze e provarci.\n\nChiunque si voglia unire mi scriva pure in DM. Grazie a tutti e a presto!\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kxbuy3/nuovo_gruppo_per_meeting_e_uscite_di_torino/"
    },
    {
        "id": "1kxf84r",
        "author": "Texas-Gold",
        "title": "Valentino Chiuso - Dove posso andare a passaggiare?",
        "content": "Salve a tutti e tutte !\n\nDopo aver passato un periodo all'estero oggi ho scoperto che il Valentino é chiuso per lavori.  \n  \nIl parco era il mio piccolo angolo di pace; se succhiudevo gli occhi mi ricordava del luogo che chiamavo Casa.   \n  \nEra il mio rifugio nel verde, il posto dove andavo a respirare un po’ di natura e silenzio, e sembra che resterà chiuso fino al 2027. \n\nQuindi vi chiedo: dove posso andare a passeggiare nel verde, possibilmente non troppo lontano non vorrei dover prendere i mezzi? \n\nAccetto consigli.\n\nUn grazie enorme a chi ha voglia di condividere il proprio angolo verde del cuore.\n\nGrazie in anticipo a tutti! 🙏",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1kxf84r/valentino_chiuso_dove_posso_andare_a_passaggiare/"
    },
    {
        "id": "1kx0cv7",
        "author": "Electrical-Theory-28",
        "title": "Qual è il quartiere migliore per vivere a Torino?",
        "content": "Secondo voi, qual e il quartiere migliore per vivere a Torino?\n\n  \nSto pensando di trasferirmi a Torino e sono curioso di sapere quale sia il quartiere migliore per affittare un appartamento con tutte le infrastrutture necessarie.\n\nGrazie a tutti!",
        "upvotes": 9,
        "comments": 42,
        "media": null,
        "permalink": "/r/torino/comments/1kx0cv7/qual_è_il_quartiere_migliore_per_vivere_a_torino/"
    },
    {
        "id": "1kwjcmk",
        "author": "Ok_Yellow4742",
        "title": "[BICICLETTA RUBATA]",
        "content": "**\\[BICICLETTA RUBATA\\] Surly Cross Check arancione brillante – Rubata vicino al Parco del Valentino**\n\nCiao a tutti,  \nscrivo nella speranza che qualcuno in questa community possa aver visto o sentito qualcosa.\n\nNella notte del **\\[inserire data del furto\\]**, mi è stata **rubata la bicicletta mentre dormivo nel Parco del Valentino**. È una bici molto riconoscibile: una **Surly Cross Check arancione brillante**, con le seguenti caratteristiche:\n\n* Pneumatici gravel\n* Nastro manubrio nero\n* Freni da touring (cantilever) e freni al manubrio standard\n* **Portapacchi posteriore Topeak**\n* Porta borraccia e supporto per lucchetto nel triangolo centrale del telaio\n\nEra caricata con tutta la mia attrezzatura, dato che ero quasi alla fine di un viaggio in bici di un mese attraverso l’Italia, pronto a tornare in Francia.\n\nHo sporto denuncia alla polizia, ma mi hanno detto che le possibilità di ritrovarla sono poche.  \nSe **qualcuno vede una bici con questa descrizione**, soprattutto in vendita online, vi prego di scrivermi o rispondere a questo post.\n\nGrazie mille! 🙏",
        "upvotes": 72,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/okix6kiqra3f1.jpeg?auto=webp&amp;s=427f925fa4bb93741ddba5b071ed0149a9f33712"
        },
        "permalink": "/r/torino/comments/1kwjcmk/bicicletta_rubata/"
    },
    {
        "id": "1kwlxqj",
        "author": "NomeUtente86",
        "title": "Un posto dove mangiare grigliata fatta bene?",
        "content": "Ciao a tutti, Domenica 9 per il mio compleanno ho pensato di farmi una camminata in montagna e una cena tra amici.\nVolevo andare a farmi una scorpacciate di carne...\nMa il posto dove andavo io è chiuso, mi sapete indicare un agriturismo o ristorante dove possa andare a mangiare una grigliata fatta bene magari con la formula all you can eat? Torino e zone limitrofe... Grazie mille",
        "upvotes": 11,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1kwlxqj/un_posto_dove_mangiare_grigliata_fatta_bene/"
    },
    {
        "id": "1kwlagx",
        "author": "AdRoutine9042",
        "title": "Migliorare parcheggio in città",
        "content": "Hai mai perso tempo cercando parcheggio?  \nO hai un box auto che rimane spesso inutilizzato?\n\n🧭 L’idea è semplice: una piattaforma che connette **chi cerca parcheggio** con **chi ha uno spazio privato da affittare**, anche solo per poche ore.\n\n📋 Ti va di darci una mano? Bastano 2 minuti:\n\n* **Sei un guidatore?** 👉 [https://docs.google.com/forms/d/e/1FAIpQLScV5ICl13fSmFR2Gy23okPvmBvpHNK5A2ee\\_Qde73G-D-uaRA/viewform?usp=dialog](https://docs.google.com/forms/d/e/1FAIpQLScV5ICl13fSmFR2Gy23okPvmBvpHNK5A2ee_Qde73G-D-uaRA/viewform?usp=dialog)\n* **Hai un box auto?** 👉 [https://docs.google.com/forms/d/e/1FAIpQLScvCSw6phbyROfHM8EnZ63-hAdTY2QvnfvIntzJs61gF6V6zQ/viewform?usp=dialog](https://docs.google.com/forms/d/e/1FAIpQLScvCSw6phbyROfHM8EnZ63-hAdTY2QvnfvIntzJs61gF6V6zQ/viewform?usp=dialog)\n\nOgni risposta ci aiuta a costruire un servizio utile, reale ed efficiente. Grazie!",
        "upvotes": 6,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lGibteFegwDZvIQTWPYV_xxQV3eeymaEN_CGwfVEeJw.jpg?auto=webp&amp;s=0f94b355213b6e98f74e525bf5df7147cb594c95"
        },
        "permalink": "/r/torino/comments/1kwlagx/migliorare_parcheggio_in_città/"
    },
    {
        "id": "1kwin6n",
        "author": "Leading-Complex-7828",
        "title": "dove comprare jeans baggy con texture particolari",
        "content": "il titolo è già autoesplicativo, sto cercando un posto a torino (o anche pagine instagram, siti affidabili) da cui comprare jeans baggy con texture particolari (non voglio jeans totalmente blu o neri).\nquindi toppe, cuciture o trame particolari che li rendano diversi dal solito.\novviamente essendo un poveraccio preferirei non costassero per forza 70 euro a paio ma qualcosa di più economico.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kwin6n/dove_comprare_jeans_baggy_con_texture_particolari/"
    },
    {
        "id": "1kw2x3k",
        "author": "[deleted]",
        "title": "Parco Sempione: un gioiello verde lasciato al degrado",
        "content": "È assurdo che uno degli unici parchi della Zona Nord sia ridotto a un parcheggio e a un rifugio per drogati. Ogni volta che passo di lì vedo macchine ovunque, siringhe a terra, persone fuori controllo. \n\nhttps://preview.redd.it/xilq9dnse63f1.png?width=672&amp;format=png&amp;auto=webp&amp;s=4f5c9c46379d035d80a42d965916d530d2dca7da\n\nAbbiamo uno spazio verde che potrebbe essere un fiore all'occhiello della città e invece sembra una terra di nessuno.   \n  \nÈ possibile che non si possa fare nulla? Il degrado è totale",
        "upvotes": 25,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1kw2x3k/parco_sempione_un_gioiello_verde_lasciato_al/"
    },
    {
        "id": "1kw7irq",
        "author": "Puzzleheaded_Mix7649",
        "title": "Club tecno e musica elettronica aperti d'estate",
        "content": "Salve, volevo chiedere se qualcuno potesse consigliarmi qualche locale o serata tecno (o musica elettronica in generale) estiva, dopo il 20 Luglio. Da quel che so, locali come Azimut e Audiodrome dovrebbero chiudere per la pausa estiva a partire già da metà Luglio.",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1kw7irq/club_tecno_e_musica_elettronica_aperti_destate/"
    },
    {
        "id": "1kwhhzv",
        "author": "Intelligent-Bell-120",
        "title": "conoscete un Video Maker Per eventi?",
        "content": "Stiamo cercando un videomaker per un evento techno il 7 giugno, preferibilmente con esperienza. Se sei interessato o conosci qualcuno, facci sapere",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kwhhzv/conoscete_un_video_maker_per_eventi/"
    }
]