[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 498,
        "comments": 272,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 15,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jcoxfo",
        "author": "Internal-Bed-3150",
        "title": "Adapting The Magician's Nephew first will make problems for Netflix",
        "content": "",
        "upvotes": 120,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1jcoxfo/adapting_the_magicians_nephew_first_will_make/"
    },
    {
        "id": "1jchy01",
        "author": "NellyNoo2000",
        "title": "Adolescence - one shot q&amp;a",
        "content": "Loved this thread on Netflix UK &amp; Ireland Twitter page about how they filmed the show.\n\nI was fascinated by the one shot episodes &amp; this q&amp;a answered most of my questions. Hopefully it answers yours too",
        "upvotes": 353,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1jchy01/adolescence_one_shot_qa/"
    },
    {
        "id": "1jcrapq",
        "author": "Positive_Night_5172",
        "title": "Too many shows being canceled after 1 season. I think they should be required to accept them for at least 2 seasons and the 2nd seasons should have an alternate finale that wraps the show up in case there's not going to be a 3rd season. Otherwise it's just a waste of viewers time and money.",
        "content": "I've gotten to the point that I won't even watch the 1st season of a show until it's been renewed for a 2nd season. I'm tired of wasting my time becoming interested in a new show only to be disappointed when it's canceled show quickly. They aren't even giving these shows a chance. They should come with a warning at the beginning letting viewers know it's a 1 season show so you can decide if yiu even want to bother or not. \nIf Netflix wasn't free with my T-Mobile service I would have canceled it. I'm getting pretty tired of Prime doing the same, or maybe worse, taking years to come out with new seasons. And even then they only have 6, or if you're lucky, 8 episodes. I really miss when shows had a new season every year, right around then same time as the last, and where 12 to 20 episodes depending on whether it was cable or network tv. ",
        "upvotes": 59,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1jcrapq/too_many_shows_being_canceled_after_1_season_i/"
    },
    {
        "id": "1jd4edy",
        "author": "Few_Position7650",
        "title": "Adolescence",
        "content": "I can understand why people might feel they way they feel about the ending of the show buttttt episode three might be the best hour of television I have ever in my 38 years of watching tv seen. The tension and the acting and camera work were top tier tv. The little boy is definitely going to be on all of our screens for years to come. ",
        "upvotes": 8,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jd4edy/adolescence/"
    },
    {
        "id": "1jd7akz",
        "author": "I_am_aware_of_you",
        "title": "Frustrated with half shows",
        "content": "I truly wonder why if a show has 4 seasons they only provide 2 out of the 4. \n\nOr even worse if they have 11 they do have season 6-7-8.\n\nLike I want an option where I can see I want more of this show like tomorrow because I bingwatched the other seasons and now I’m bored….",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jd7akz/frustrated_with_half_shows/"
    },
    {
        "id": "1jd1ndt",
        "author": "ZackaryAsAlways",
        "title": "Movies like Electric State is the reason Netflix Originals have a bad reputation",
        "content": "Electric State imo incapsulates everything wrong with MOST Netflix Originals. By this I mean a bland by the numbers project with a couple cool things here and there ",
        "upvotes": 8,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1jd1ndt/movies_like_electric_state_is_the_reason_netflix/"
    },
    {
        "id": "1jcz0n5",
        "author": "jake72469",
        "title": "Question: Brooklyn Nine-Nine. Only 4 seasons? More...",
        "content": "They recently added seasons 5 and 6 of Brooklyn Nine-Nine but at the same time they removed seasons 1 and 2 so that Netflix is only showing 4 seasons at a time.  I expect something similar will occur when they release seasons 7 and 8.  I've never seen Netflix do this before.  Is this a new thing or is this something we should expect with other shows?",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jcz0n5/question_brooklyn_ninenine_only_4_seasons_more/"
    },
    {
        "id": "1jd27dt",
        "author": "stellacampus",
        "title": "The (Parent) Trap",
        "content": "I was amazed to see Hayley Mills in The Trap, 64 years after starring in The Parent Trap.  It was one of those \"I didn't realize she was still of this Earth moments.\"",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jd27dt/the_parent_trap/"
    },
    {
        "id": "1jd09r6",
        "author": "Poshdelux",
        "title": "Adolescents Series season 2 potential.",
        "content": "I finished the Adolecance series and couldn't help but feel unsatisfied. It was left inadequate, has so much potential for a full body of work. I was even thinking of an episode where the camera follows the day in question on CCTV. \n\nAnyone else left feeling this way? If so, what would be your idea for an episode? What would you like to explore in this series entire topic?",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1jd09r6/adolescents_series_season_2_potential/"
    },
    {
        "id": "1jd7kv0",
        "author": "Darthsullen",
        "title": "Why is my Netflix streaming quality so bad pixelated",
        "content": "Just recently got Netflix 7.99 plan and the streaming quality is horrible like I’m watching at 240p\nI don’t use WiFi but my phone service is great and I don’t have this problem with Disney plus or Hulu ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jd7kv0/why_is_my_netflix_streaming_quality_so_bad/"
    },
    {
        "id": "1jcyjoq",
        "author": "indiewire",
        "title": "‘Adolescence’ Review: Netflix’s Real-Time Crime Drama Impressively Subverts Expectations",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jcyjoq/adolescence_review_netflixs_realtime_crime_drama/"
    },
    {
        "id": "1jciagd",
        "author": "bbportali",
        "title": "Looks like Adolescence has very good ratings and might be worth a watch as a mini series",
        "content": "",
        "upvotes": 32,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jciagd/looks_like_adolescence_has_very_good_ratings_and/"
    },
    {
        "id": "1jd4swb",
        "author": "21_Aug_Guy",
        "title": "Only Kids content accessible",
        "content": "Only child content is accessible in my account even though no viewing restrictions have been set. Could anyone please help? I'm trying to watch 'The Office' but only kids shows are accessible. Im just filling out content here so the minimum characters are reached.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jd4swb/only_kids_content_accessible/"
    },
    {
        "id": "1jd2qns",
        "author": "Life247",
        "title": "Can't download episodes in a series?",
        "content": "I can't download the Powerpuff Girls episodes to my phone. Is that because I have the Standard with Ads plan or is it the same regardless of the plan you have? Is it just because it is leaving on April 2nd in the United States? Help!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jd2qns/cant_download_episodes_in_a_series/"
    },
    {
        "id": "1jd1xuo",
        "author": "LJGremlin",
        "title": "Titles unavailable on ad-supported plans",
        "content": "I’m sure this has been mentioned here a few hundred times but the decision to have some titles unavailable for ad-supported plans is complete garbage.\n\nThere should be a law requiring that streaming services open up their write catalog regardless of if users choose to pay for the ad-supported service or the no ads service.  \n\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jd1xuo/titles_unavailable_on_adsupported_plans/"
    },
    {
        "id": "1jd1vae",
        "author": "xphoebepearson",
        "title": "netflix temporary access",
        "content": "hi i have probably a stupid question… does netflix add extra charges for allowing temporary access to another device. i spend a lot of time at my partners house and we use my home netflix account. trouble is i do not pay for my netflix subscription but my dad does and i dont want an extra charge added just so i can watch at my partners house. sorry if this has been asked before im really new to reddit 🫶🏻",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jd1vae/netflix_temporary_access/"
    },
    {
        "id": "1jcvnov",
        "author": "Grimmer6",
        "title": "All Of Us Are Dead ending",
        "content": "What do you guys theorise of the ending? I personally think that it was Cheong-san among the surviving hambie. Nam-ra jumped of the roof and they all came near the edge to see the other surviving hambies and all of their reactions had been changed which is normal. Everyone was shocked but Su-hyeok smiled a bit with the shock. It was like \"damn mf, you made it\". And On-jo was in total shock like she didn't expect that. The reaction on her face doesn't justify seeing other hambies made her shocked. It was a shock of something dear to you which you never expected to come being infront of you. I personally belive it's Cheong-san among the survivors who made them surprised. What do you guys think?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jcvnov/all_of_us_are_dead_ending/"
    },
    {
        "id": "1jcbf3z",
        "author": "Objective-Effort-614",
        "title": "Black Mirror",
        "content": "Looks like a new season is coming out soon. What’s your favorite episodes? Some of them are great and some are not so good. \n\nThinking about rewatching some episodes. Suggestions welcome. ",
        "upvotes": 57,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1jcbf3z/black_mirror/"
    },
    {
        "id": "1jd6pdt",
        "author": "yourmomwoo",
        "title": "Finally decided to cancel my subscription",
        "content": "Ive had a continuous Netflix subscription since probably 2009 or 2010, pretty close to whenever they started doing streaming. Ive found the selection to be decreasing over the years, but i get that as new services started, networks wanted to get their hit shows back, and server space costs money. Even when I struggled to find anything worth watching, there was usually at least a couple things I wanted to watch. \n\nOther services I was more willing to cancel and restart as throughout the years, but Netflix just felt like a staple.\n\nOnce they eliminated the standard plan, and moved me to the ad supported, I really started to get annoyed. All of the sudden, a decent chunk of content was unavailable without upgrading to the $18/mo plan. Ads start sometimes mid-sentence, even in TV shows that were originally aired with commercials and sketch comedy shows, which have perfect, logical places to insert commercials. And the price just keeps rising while the amount and quality(imo) of the content declines. Personally, I don't play the games on Netflix, and I don't need to see another Tyson/Paul ballet. Maybe some people find value in that, but not me.\n\nThen, this weekend, I saw that The new Venom movie and Kraven had just been added... two movies that were pretty universally panned, but as a former comic book kid, I always watch even the bad superhero movies when they hit streaming. But of course, both of these are locked for the ad supported plans. So I canceled. It was the last straw. \n\nTo me, Hulu with Disney+ has become the go-to, keep all the time even if I'm barely using it. They've managed to keep subscription prices at a point where it just seems more convenient to keep it going than to stop/start it.\n\nNetflix will now be the service I subscribe to only for singular months when they have enough exclusives for me to waste a week catching up. \n\nRant over.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jd6pdt/finally_decided_to_cancel_my_subscription/"
    },
    {
        "id": "1jcsylg",
        "author": "Chris_S_B",
        "title": "Adolescence Episode 4.",
        "content": "I finished watching Adolescence last night and thought it was brilliant. There's something I'd like other people's opinion on in episode 4. When the family are driving back from the DIY shop and Jamie rings to wish his dad a happy birthday, why do you think he chose that day to tell them he was changing his plea to guilty? My opinion is that he didn't want his family to have fun without him and gave him an element of control over them. ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jcsylg/adolescence_episode_4/"
    },
    {
        "id": "1jcv03e",
        "author": "Dagomesh",
        "title": "Can't watch Netflix on 2 different Profils.",
        "content": "Recently I have the problem that I cannot watch Netflix on 2 different devices ( Webbrowser / PS5 ) on two seperate Profils at the same time.\n\nI currently have 2 Profils, my Profil and one for our son. He is watching on his PS5 which is in the same Wifi Network via Wifi Repeater, so we are all connected to the same Router. \nAs he is watching on his own Profil, I get the Message \"E123 Too many people are using one account\" on my Profil and vice versa.\n\nSo I already disconnected all devices and waited for about 10 - 15 minutes. I have the basic hd service which would allow me to use 4 devices in total. The live Chat didn't really help because they just suggested the same method of disconnecting everything which they also did on their end.\n\nHas anyone encountered the same problem ? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jcv03e/cant_watch_netflix_on_2_different_profils/"
    },
    {
        "id": "1jd45ed",
        "author": "DanielW0830",
        "title": "Been a Netflix subscriber since the  90s.   CD mail service and streaming.   Now, I'm out.",
        "content": "Too many price increases.   (over $300 a year to watch in 4k)  \nMovies I can't watch unless I watch subtitles.  (Squid games was good though and Train to Busan)  \n  \nApple TV is $9.99 a month.   Has excellent quality movies and shows.  \nApple TV does not have the library that netflix has, but quality over quantity seems like a good compromise.\n\nHistory:\n\n* **1997:**Netflix began as a DVD-by-mail service, charging $4 per rental plus shipping. \n* **1999:**A monthly subscription plan was introduced for $15.95, allowing unlimited DVD rentals. \n* **2007:**Netflix started streaming movies online, initially free with DVD plans. \n* **2010:**Netflix split DVD and streaming services, with the streaming-only plan costing $7.99 per month. \n* **2011:**Netflix announced it would separate its existing subscription plans into two separate plans: one covering the streaming and the other DVD rental services. \n* **2019:**Netflix raised prices for all streaming-video plans in the U.S., including the Basic plan, which increased from $7.99 to $8.99 per month. \n* **2025:**Netflix currently offers three subscription plans: Standard with ads ($7.99/month), Standard ($17.99/month), and Premium ($24.99/month). \n\n",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jd45ed/been_a_netflix_subscriber_since_the_90s_cd_mail/"
    },
    {
        "id": "1jcwqu6",
        "author": "jinjer2",
        "title": "Chronology for Adolescence",
        "content": "Help me out with the timeline of the main characters. Parents recount a story about a school dance when A-ha was popular. This was when, mid to late 80s? So if say 13 years old in 1986 then turn 50 in 2023, correct? So … they met in 1986 but first kid born 2005 and second in 2010?\n\nI guess it fits but something seems off. What did I miss? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jcwqu6/chronology_for_adolescence/"
    },
    {
        "id": "1jcralq",
        "author": "MaestroZackyZ",
        "title": "Playback Speed not changing?",
        "content": "When I change the playback speed, nothing actually happens. I can't find any other posts of people having the same issue which is crazy to me. I am trying to watch on my computer (iMac) on Google Chrome. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jcralq/playback_speed_not_changing/"
    },
    {
        "id": "1jcyuvh",
        "author": "ZackaryAsAlways",
        "title": "The Electric State - Film Review",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jcyuvh/the_electric_state_film_review/"
    },
    {
        "id": "1jcele2",
        "author": "CortaCircuit",
        "title": "\"Sorry, something went wrong. Please try again later.\" Unable to sign up... this happens every time I try and reset my password or I try and add a payment method...",
        "content": "I have contacted Customer Service. They say it should go away within a couple days. Well it has been about two weeks since I last tried and it is still happening...\n\nAnyone had this error, how do you get around it?\n\nI had originally signed up fine. I was charged on my credit card, then two days later Netflix cancels my membership and refunds my payment. Now I can't do anything.  \n",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jcele2/sorry_something_went_wrong_please_try_again_later/"
    },
    {
        "id": "1jc7b8c",
        "author": "FearlessDirection129",
        "title": "Hot Take: Shows like The Ultimatum/ Temptation Island are a recipe to Disaster for people in the show",
        "content": "Although fun to watch drama as a viewer, i don't understand how couples are brave enough to sign up for such shows when they are 99% sure they will break up after.\n\nSomethimes I think couples shown were never together and made up for the show for drama that is supposed to happen.\n\nAlso Netflix controls the view angle of the show so they can sabotage a career of any person and no one would trust them ever with thier actions shown on the show. Although they all still become instant celebs after premiere.\n\nWhat do you guys think?",
        "upvotes": 18,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1jc7b8c/hot_take_shows_like_the_ultimatum_temptation/"
    },
    {
        "id": "1jc9ick",
        "author": "Worn-Out__Wishes",
        "title": "Please suggest disturbing / horror movies/shows/ documentaries!",
        "content": "What i have watched- \n\nDahmer \nAdolescence \nBlack mirror\nThe haunting of bly and hill house\nGacy tapes\nHouse of usher \nGabriel Fernandez doc\n\nBack on Netflix after a few years and would love some new recommendations. Thank you 🙏🏼 \n",
        "upvotes": 11,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1jc9ick/please_suggest_disturbing_horror_moviesshows/"
    },
    {
        "id": "1jbq59u",
        "author": "Liquid_Lunch_1991",
        "title": "Adolescence",
        "content": "It takes a lot for a show/movie to upset and unsettle me and I wanna say with total honesty this show completely and utterly fucked my shit up. I admire the audacity of the filmmaking and writing and omg the acting is incredible, but seriously….this is the first time I’ve ever watched something I wished I could unwatch\n",
        "upvotes": 240,
        "comments": 134,
        "media": null,
        "permalink": "/r/netflix/comments/1jbq59u/adolescence/"
    },
    {
        "id": "1jclfpe",
        "author": "Unlucky-Better",
        "title": "Every time I try to play a movie it's stuck on loading. Even if I download the movie it won't play and only get stuck on a black screen. My family members don't have this problem on their phones.",
        "content": "How do I fix this? I have tried everything I have seen. Restarting my device, changing networks, clearing cache, uninstalling and reinstalling Netflix and other stuff. I just wanna watch some movies bruh 😭😭🙏🙏",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jclfpe/every_time_i_try_to_play_a_movie_its_stuck_on/"
    }
]