[
    {
        "id": "1iqune1",
        "author": "BunyipPouch",
        "title": "Join us Monday 2/17 at 3 PM ET for a live AMA/Q&amp;A with the cast &amp; crew of 'One Night In Tokyo' - Lead actors Tokiko Kitagawa &amp; Reza Emamiyeh, Director Joshua Woodcock, Composer/Producer Topher Horn",
        "content": "",
        "upvotes": 5,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5lgrsnbzrije1.jpeg?auto=webp&amp;s=504d4b88993d6dd13c15aaa9485d9fc129370f8a"
        },
        "permalink": "/r/movies/comments/1iqune1/join_us_monday_217_at_3_pm_et_for_a_live_amaqa/"
    },
    {
        "id": "1iqedve",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement: Simon West, director of 'Con Air', 'Lara Croft Tomb Raider', 'The Expendables 2', Rick Astley's Never Gonna Give You Up music video, and more - Wednesday 2/19 at 3:00 PM ET",
        "content": "",
        "upvotes": 135,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xr475tnvydje1.png?auto=webp&amp;s=0ff1a61fe005ea1590cb8c17f277312f2fff1566"
        },
        "permalink": "/r/movies/comments/1iqedve/amaqa_announcement_simon_west_director_of_con_air/"
    },
    {
        "id": "1iqtmaw",
        "author": "Fan387",
        "title": "South Korean actress Kim Sae-ron found dead at home, police official says",
        "content": "",
        "upvotes": 14422,
        "comments": 571,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/PDbU2nod-Q4Z537Lbj5Ao96SE0yAvYkdD8ytmXv7dhE.jpg?auto=webp&amp;s=e2c58552d543c2f7f9ff249b246063a8d192e1c0"
        },
        "permalink": "/r/movies/comments/1iqtmaw/south_korean_actress_kim_saeron_found_dead_at/"
    },
    {
        "id": "1iqyxy1",
        "author": "mobpiecedunchaindan",
        "title": "New poster for \"The Day The Earth Blew Up: A Looney Tunes Movie\"",
        "content": "",
        "upvotes": 980,
        "comments": 86,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xwc6lmfxojje1.jpeg?auto=webp&amp;s=930bf8938439175aebfc31560215765aff230ec6"
        },
        "permalink": "/r/movies/comments/1iqyxy1/new_poster_for_the_day_the_earth_blew_up_a_looney/"
    },
    {
        "id": "1ir0vj1",
        "author": "MarvelsGrantMan136",
        "title": "BAFTA Film Awards: ‘Conclave’ Wins Best Film; Adrien Brody &amp; Mikey Madison Win Lead Acting Awards (Full Winners List)",
        "content": "",
        "upvotes": 452,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/KMXjmt6ASVLN0UN5Ie799AutnxXaZDc99labvesART0.jpg?auto=webp&amp;s=fd8c78232e2d2ccc1d04c7d538047be06c284be0"
        },
        "permalink": "/r/movies/comments/1ir0vj1/bafta_film_awards_conclave_wins_best_film_adrien/"
    },
    {
        "id": "1ir1kp6",
        "author": "alii66E",
        "title": "Watched Tranformers One and as someone who loved Transformers since I was a child and have gotten progressively more and more disappointed in the franchise as I've grown older, I gotta say this movie was amazing",
        "content": "I'll try to keep at least the first section of the review spoiler free. I will give a little bit of background first.\n\nI was 11 years old when I watched Revenge of the Fallen with my friends. The explosions, the action, the music, the cars, THAT Megan Fox scene. I loved that movie and after it I became a big Transformers fan, watching whatever movies and clips I could find online at that age. It even spilled into my other hobbies like gaming and music; I started listening to Linkin Park (still do) and played whatever games had transformers in them. I remember playing Fall of Cybertron a lot on my Xbox 360. Got as many Transformer toys and figures I could get. Just saying I was a fan would be an understatement.\n\nAs I got a couple of years older I started watching the other movies as they released. Dark of the Moon, Age of Extinction, The Last Knight, Bumblebee, Rise of the Beasts and none of them after DotM just..... clicked. I blamed it on a couple of things, but mostly age. I thought I had just outgrown the Franchise, maybe a movie filled with explosions and guns and robots are just too childish.\n\nSo Transformers is a series I mostly look back to with happy thought. I still think about the old days where I was at my friends house being blown away by Revenge of the Fallen, I still think about all those hours I sat behind the screen playing Fall of Cybertron, I still listen to Linkin Park imagining Optimus Prime jsut got done giving a speech. But thats mostly in the past. Transformers is not what it used to be for me and I didn't think I would ever enjoy a new piece of Tranformers content ever again, and I still thought that when I ehard about the release of Tranformers One.\n\n''just another Transformers movie, it'll never live up to the old ones.'' That was literally my thought when I first found out about the movie by seeing a promotional poster in the cinemas I was at for another movie. I put off reading anything about it, I put off searching anything about it up. I just was not interested. Until, I saw a short clip of the movie when scrolling on TikTok. It was funny and I remember thinking ''oh so this Transformers One is THAT kind of movie, funny.''\n\nFastforward to today I was bored and I wanted to watch a movie when I suddenly remember that clip, that 10 second clip that entertained me so much and I thought why not. And boy do I have to say I LOVED this movie.\n\nThe plot is interesting enough to make you pay attention. You can guess which direction its going pretty easily but I didnt go in expecting much so I didnt mind. But everything else is truly amazing.\n\nThe characters, the jokes, the writing, the animation, I loved all of it. If you are looking for a movie that will just simply entertain you, without you even being a Transformers fan, give it a chance. If you will like it as much as even halve of the amount I love it, you will not regret it.\n\nSpoilers ahead as I get a bit more in depth of why I love this movie so much.\n\nGrowing up Ive always seen Optimus and Megatron fight and hate eachother, but seeing them 'young' as friends really intrigued me. It was something I have never thought of as possible or even imaginable but the writers pulled off this amazing friendship of soon to be enemies. On screen they share an amazing chemistry and display of friendship, and after every second of enjoyment of them I got this dread, this glooming sense of them one day becoming enemies. I knew we would find out how they would turn into enemies in this movie and I was NOT looking forward to seeing this beautiful friendship ruined, but I mean that in a good way. The introduction of Bumblebee was also amazing. He has always been this 'young wild and free' Autobot in the movies and in this one its no different. He stole every scene he was in and yet again in this movie, became my favourite transformer.\n\nI was just as excited to see Starscream on scene. I thought there were no surprises left and I practically jumped out of my couch when they mentioned his name. The writers keep delivering on these amazing moments that just satisfy you as a Transformers fan.\n\nTalking about delivering, there are AMAZING golden moments of hilariousness in this movie. I have laughed out loud multiple times and basically enjoyed this movie from start to finish.\n\nThis movie just gives you so many amazing moment. D16's (Megatron) descent into evil (I would even say rightfully so, after having seen this movie), Orion Pax becoming Optimus Prime, Bumblee being hilarious as ever, Optimus fighting in a 1v3, moments of friendship and betrayal; you cant help but feel sad for both Optimus Prime and Megatron. And ofcourse this legendary, incredibly nostalgic Optimus Prime monologue at the end. I swear I literally expected to hear a linkin park song when he was delivering it and I maybe would have bursted out into tears if I did.\n\nAs amazing as this all is, the most important thing for me is realizing, knowing that I am NOT too old to enjoy Transformers. I am 26 now and I just got done laughing, crying, watching a Transformers movie full of excitement, something I havent been able to do for almost 15 years.\n\nI am grateful for Transformers One for this reason alone. It has singehandedly changed my opinion on the Transformers franchise of the past 10 years. It may not be the best movie ever, but it has broken into my top list of movies I have ever watched for that reason alone. It has immediately made me love it and I will die holding on to this movie with my heart.\n\nPlease give it watch if you havent yet.",
        "upvotes": 380,
        "comments": 72,
        "media": null,
        "permalink": "/r/movies/comments/1ir1kp6/watched_tranformers_one_and_as_someone_who_loved/"
    },
    {
        "id": "1ir422g",
        "author": "WerdNerd88",
        "title": "Trailer for Spermageddon. A very real animated movie from Norway.",
        "content": "",
        "upvotes": 172,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/iXxZCE7cRNFCFex-tT-ZqMQgr3LcLhsEYP0ruXBlDII.jpg?auto=webp&amp;s=23849fdb7473eb9f08c4791c40c719d0c7814b6b"
        },
        "permalink": "/r/movies/comments/1ir422g/trailer_for_spermageddon_a_very_real_animated/"
    },
    {
        "id": "1ir5ooz",
        "author": "LoneyGamer2023",
        "title": "One thing I miss from older movies- the slower pacing of scenes!",
        "content": "I was watching some older movies such as Close Encounters, Star wars, and Alien and realized something was different. Something which I don't think many modern audiences would like, but I liked it so to speak. I just couldn't figure out what it was.\n\nI then watched half of an awful Antman multiverse Marvel movie before giving up and realized what it was. It wasn't the lack of CGI, actors actually being big names, or stunts being real back then. It was the slower pacing of scenes!\n\nFor example, I think in 2001 SO there was like a 10 minute scene of a ship docking. I actually got bored of that as a kid and fast forward if my dad wasn't looking lol. In Alien they spent like 5 minutes looking for a cat and then later she spent what felt like 10 minutes looking for the cat again. And they made it work too as they made it interesting. I can see how modern audiences might not like that but to me that is so much better than what they do to pad out movies in the modern area, which is usually lots of table talk-and I'd say there is actually more talking than what they did in the older movies too.\n\nIt might bad take. I just do miss movies that might stick to the plot being one night to a week over it being like the telling of the whole war. Then again you do have to be careful with what you ask for because the Modern Starwars movies have drawn out scenes like the Casino Planet. IDk then again I probably would take the Casino Planet jobber sidequest over adding more table talk in",
        "upvotes": 119,
        "comments": 47,
        "media": null,
        "permalink": "/r/movies/comments/1ir5ooz/one_thing_i_miss_from_older_movies_the_slower/"
    },
    {
        "id": "1iqsuw9",
        "author": "Jonny_the_Rocket",
        "title": "Which movies have had the most drastic shifts in tone that you've ever seen?",
        "content": "I was streaming Miracle Mile (1988) the other day, going in totally blind except for its high RT score. When the film started, I thought I was going to get a lighthearted romcom starring Anthony Edwards and Mare Winningham. Then, seemingly out of nowhere, the main character gets a call saying nuclear war is coming in less than 70 minutes, and I'm sitting there thinking someone was playing a prank. I was not ready for the movie to shift into an apocalyptic thriller. The shift in tone was so unexpected that I just sat there watching for the next hour or so, completely baffled.",
        "upvotes": 636,
        "comments": 726,
        "media": null,
        "permalink": "/r/movies/comments/1iqsuw9/which_movies_have_had_the_most_drastic_shifts_in/"
    },
    {
        "id": "1ir4n1m",
        "author": "_kevx_91",
        "title": "What is an example of anachronisms or \"time errors\" in film that many people may not have noticed?",
        "content": "An example of that would be films including dinosaurs and prehistoric human beings living side by side, but they were, in reality, millions of years apart.\n\nA good example of a movie anachronism would be Gladiator and the dog. One of the canine companions of a soldier was a German Shepherd. However, this breed only goes back to the 1800s.",
        "upvotes": 80,
        "comments": 128,
        "media": null,
        "permalink": "/r/movies/comments/1ir4n1m/what_is_an_example_of_anachronisms_or_time_errors/"
    },
    {
        "id": "1iqs8yl",
        "author": "Psykpatient",
        "title": "Atlantis: The Lost Empire - Leviathan attack",
        "content": "",
        "upvotes": 397,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/d9l2h0pj9EwmL4ZXdEJcZxlhdAYYRPwT-DGTbHPyy5o.jpg?auto=webp&amp;s=190d06cfec36144fd659b12b4e713fa716278289"
        },
        "permalink": "/r/movies/comments/1iqs8yl/atlantis_the_lost_empire_leviathan_attack/"
    },
    {
        "id": "1iqxng0",
        "author": "WerdNerd88",
        "title": "Does anybody remember Star Kid (1997)? Starring the kid from Jurassic Park",
        "content": "https://youtu.be/d0jXzUWNlA8?si=f4z6ksCPbaxwjO3l\n\n\nThe kid from Jurassic Park finds an alien power suit that crash landed in a junkyard. He uses it to scare his bully, save the girl he likes from an accident he caused, eats a burger and fries, and fights an alien that is the enemy to the suit's creators.",
        "upvotes": 167,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BkiQWnEsia4uReMqBK9HqYb4--NOmRJU8NQWOmeNqjw.jpg?auto=webp&amp;s=5379a7313638b9a3b043d46b20d94477467b0669"
        },
        "permalink": "/r/movies/comments/1iqxng0/does_anybody_remember_star_kid_1997_starring_the/"
    },
    {
        "id": "1iqlut6",
        "author": "Puzzled-Tap8042",
        "title": "Full Metal Jacket star Kevyn Major Howard dead at 69",
        "content": "",
        "upvotes": 1373,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5N9xe5toTNzC2St4voaNDmNW3hSW_x6aD8nYVFT_GYg.jpg?auto=webp&amp;s=53e3d31a70fed97ff0e3cacb762ada80a14f114f"
        },
        "permalink": "/r/movies/comments/1iqlut6/full_metal_jacket_star_kevyn_major_howard_dead_at/"
    },
    {
        "id": "1iqk7ee",
        "author": "KaineDamo",
        "title": "What unconfirmed fan theory or non-canon interpretation of a movie actually adds to the movie?",
        "content": "People have went back and forth in discussion around whether or not it was intended in Starship Troopers (1997) for the attack on Buenos Aires to have been a false flag attack perpetrated by the United Citizen Federation either intentionally or accidentally and blamed on the Arachnids. There is some minor circumstantial evidence that points to this interpretation. The officers of the Federation ship that crashed into an asteroid being young, cocky and inexperienced, Carmen nearly crashing the ship leaving dry dock, making course changes without telling anybody - what if Carmen caused this asteroid to redirect and hit Earth?\n\nKlendathu is 20k lightyears away. We see how far away it is on a map in the film, showing the bug homeworld on the other side of the galaxy. Do the bugs really have the capability to launch a direct strike on Earth?\n\nA news report says the bugs are responsible, but the movie is rife with propaganda. The movie in itself is like an in-universe propaganda recruitment piece. We can't trust what the report says. And we don't see the bugs launch an attack on Earth.\n\nBut it's also somewhat of a stretch because we don't see the asteroid Carmen hit change its trajectory towards Earth either. There is no documented evidence that a \"false flag\" attack is what Paul Verhoeven intended to convey.\n\nBut there's just enough superficial evidence to support the \"false flag\" theory if a person so chooses to interpret it that way. And the interpretation reinforces the theme of militaristic propaganda.\n\nI'm curious to read what other unconfirmed fan theories or non-canon interpretations there are of a movie that adds to the movie.",
        "upvotes": 1285,
        "comments": 1270,
        "media": null,
        "permalink": "/r/movies/comments/1iqk7ee/what_unconfirmed_fan_theory_or_noncanon/"
    },
    {
        "id": "1ir275p",
        "author": "Queen_of_London",
        "title": "BAFTAS 2025 - Glad to see Warwick Davies getting acknowledged with a BAFTA Fellowship",
        "content": "...Which has given him and his achievements more time on screen. The Beeb gave a lot of time to his award. He seems like a lovely person who's contributed massively to movies and the world in general.\n\nAnd his acting is underrated. For example, he played two roles in Harry Potter, not one, and although he was good as Flitwick, that was probably easy; he was actually creepily evil as Griphook through his acting alone. \n\nOtherwise, the biggest shock of the evening was seeing Take That introduced as British music royalty. Dune 2 getting best film (I think?) They're sweeping through the awards so quickly I'll have to look them up!\n\n",
        "upvotes": 52,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1ir275p/baftas_2025_glad_to_see_warwick_davies_getting/"
    },
    {
        "id": "1iq5ktj",
        "author": "Odd_Advance_6438",
        "title": "300 has the most unnecessarily insane bullshit, even in the background, and that’s what makes it so enjoyable",
        "content": "I was rewatching one of the fight scenes, and I couldn’t help but notice that the Persians have a random cloaked man with Wolverine claws leaping on people, and it’s never addressed. He’s barely in the background and easy to miss. Similarly, there’s a bunch of dudes with white leathery skin and feathers near the rhino, that disappear before it can even be questioned\n\nI love all the random shit in this movie, it just throws so much craziness at you tjat you kind of have to accept the fact that the Persians have an Army of Elephants, crab clawed men, “wizards”, and random beast men that growl instead of yell\n\nI think it adds to the idea that it’s the Spartans telling the story and exaggerating all the details to eachother to make it more crazy.",
        "upvotes": 9446,
        "comments": 760,
        "media": null,
        "permalink": "/r/movies/comments/1iq5ktj/300_has_the_most_unnecessarily_insane_bullshit/"
    },
    {
        "id": "1iqzthd",
        "author": "AdSpecialist6598",
        "title": "What is your favorite ok this movie is stupid, but I'll roll with it type movie?",
        "content": "Mine this Michelle Yeoh movie called Holly Weapon where in order to defeat an evil Japanese wizard who empowers himself by having sex with virgin women until they die, she gains the power to combine with 5 other women to form into a human Voltron after taking an exploding virginity test. No, I not making any of this up. That movie is nuts and I love it!",
        "upvotes": 57,
        "comments": 220,
        "media": null,
        "permalink": "/r/movies/comments/1iqzthd/what_is_your_favorite_ok_this_movie_is_stupid_but/"
    },
    {
        "id": "1iqce6u",
        "author": "MarvelsGrantMan136",
        "title": "‘Self Reliance’ Actor Biff Wiff Dies",
        "content": "",
        "upvotes": 2677,
        "comments": 94,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Fi-1BjAHzUUOqkpjy7XipSDWH2GQhsOx0EDgeNL-JOw.jpg?auto=webp&amp;s=705815234a67e8ce23b3fc3a83edd8fc716b37d7"
        },
        "permalink": "/r/movies/comments/1iqce6u/self_reliance_actor_biff_wiff_dies/"
    },
    {
        "id": "1iqt68g",
        "author": "lordatlas",
        "title": "The Penguin Lessons | Official Trailer (2025)",
        "content": "",
        "upvotes": 83,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RvHRWjrtDusXMG2rnqEkH5ezYtxYBnUmTAO0FIE9pj0.jpg?auto=webp&amp;s=a453c6002627fe5568d9fb8b68361f982da6dc27"
        },
        "permalink": "/r/movies/comments/1iqt68g/the_penguin_lessons_official_trailer_2025/"
    },
    {
        "id": "1iqwqyb",
        "author": "Starksista",
        "title": "Woman of the Hour",
        "content": "I just watched this movie yesterday, and wondered why it didn’t get more buzz? I loved it. Thought it was a very tense thriller and it’s a true story. For those of us who grew up in the era watching The Dating Game, it was just so unreal. Cheryl was just so lucky to get away from him. And omg that poor girl who finally got him arrested was so brave. They say he could have killed as many as 130 women and girls but was only charged for 12 killings. Of course no DNA then but still the police were so dismissive of the women who reported him. So aggravating! \nAnyway wondered what anyone else who watched it thought. Anna Kendrick did a great job directing and starring. ",
        "upvotes": 41,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1iqwqyb/woman_of_the_hour/"
    },
    {
        "id": "1iq7z64",
        "author": "MarvelsGrantMan136",
        "title": "Alamo Drafthouse Staffers in Colorado and New York Strike Over Unjust Layoffs, Sony’s Corporate Betrayal",
        "content": "",
        "upvotes": 2493,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-ojXlfVQjTdMTNaOC-wshRIAGwchEMCMf-2AOxrANeg.jpg?auto=webp&amp;s=25048041ccbe806a6a115394a3388662134f6e39"
        },
        "permalink": "/r/movies/comments/1iq7z64/alamo_drafthouse_staffers_in_colorado_and_new/"
    },
    {
        "id": "1iqtk26",
        "author": "QBin2017",
        "title": "What is a random good storyline or backstory in a bad movie?",
        "content": "I remember watching a baaad movie called Dracula 2000.  Gerard Butler with a thick Scottish accent playing and old Transylvanian 🤣\n\nThere was this backstory though that blew my mind.  Dracula was revealed to actually be Judas Iscariot who was punished by God for betraying Jesus.  He was hung at dawn as his 30 pieces of silver he got for betraying Jesus fell to the ground.  When he awoke  he was told he was cursed to walk the Earth as a leech and never see another sunrise. \n\nThis explained why Silver hurt him and dawn could kill him.  \n\nI thought for years about how good that was and what a great movie that could have made from a good Director. ",
        "upvotes": 53,
        "comments": 38,
        "media": null,
        "permalink": "/r/movies/comments/1iqtk26/what_is_a_random_good_storyline_or_backstory_in_a/"
    },
    {
        "id": "1iqvppe",
        "author": "Laurie_Barrynox",
        "title": "Alice Sweet Alice | Official Trailer | 4K",
        "content": "",
        "upvotes": 35,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tsRPt9LtbOprHQ38sZhQD3j8LXSo5NVdRFQ2HFThOAM.jpg?auto=webp&amp;s=9d1e4f679eb8adecd3766ee91473dc0056214169"
        },
        "permalink": "/r/movies/comments/1iqvppe/alice_sweet_alice_official_trailer_4k/"
    },
    {
        "id": "1iq9wvo",
        "author": "dbroo55",
        "title": "Name a hit song that has been hijacked by a movie",
        "content": "For example, I can't think of Sister Sledge's \"We Are Family\" without thinking about Gene Hackman dancing out of the nightclub in drag at the end of \"The Birdcage\". I smile every time I hear it. The song came out 17 years before the movie, but now they're inseparable. So what song was a hit before a movie came out that is now linked forever in your mind with the film?",
        "upvotes": 1381,
        "comments": 2001,
        "media": null,
        "permalink": "/r/movies/comments/1iq9wvo/name_a_hit_song_that_has_been_hijacked_by_a_movie/"
    },
    {
        "id": "1iq4vyv",
        "author": "JonasKahnwald11",
        "title": "New images from 'The Luckiest Man in America' - Starring Paul Walter Hauser, Walton Goggins, Johnny Knoxville, Haley Bennett, David Strathairn and Maisie Williams",
        "content": "",
        "upvotes": 2697,
        "comments": 210,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sq9fms62wbje1.jpeg?auto=webp&amp;s=0827c9de00b994b61bdba7991497a22464851434"
        },
        "permalink": "/r/movies/comments/1iq4vyv/new_images_from_the_luckiest_man_in_america/"
    },
    {
        "id": "1iq9ee9",
        "author": "indiewire",
        "title": "'Hundreds of Beavers' Sets 35MM Screenings",
        "content": "",
        "upvotes": 1199,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rNgZZ3hfX0Du3Dq8GrneINauYbmSpNdMx8fbneqQSRg.jpg?auto=webp&amp;s=af3f3f2f768124ece04530629aac53c72d9e70ae"
        },
        "permalink": "/r/movies/comments/1iq9ee9/hundreds_of_beavers_sets_35mm_screenings/"
    },
    {
        "id": "1iqati1",
        "author": "Glad_Poetry_8429",
        "title": "First image from Anders Thomas Jensen’s ‘The Last Viking’ starring Mads Mikkelsen, Nikolaj Lie Kaas",
        "content": "",
        "upvotes": 809,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k01tylwq6dje1.jpeg?auto=webp&amp;s=5f25f998a3629e4a17952d38d212d9fd53c9e0b3"
        },
        "permalink": "/r/movies/comments/1iqati1/first_image_from_anders_thomas_jensens_the_last/"
    },
    {
        "id": "1ir3vxe",
        "author": "indiewire",
        "title": "Which BAFTA Winners Will Repeat at the Oscars?",
        "content": "",
        "upvotes": 8,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3Gp9y8TYavdTXkLh4tkKUK2PYLZs9nrkZeQVdTR5DAo.jpg?auto=webp&amp;s=5295fcbf6d1d761bc63f6621b83c1ac03f8b4273"
        },
        "permalink": "/r/movies/comments/1ir3vxe/which_bafta_winners_will_repeat_at_the_oscars/"
    },
    {
        "id": "1iqrx8u",
        "author": "1000andonenites",
        "title": "We Watched \"In the Mood for Love\" (2000) for Valentine",
        "content": "We're about 25 years too late, I know but we hadn't seen it before and we were also trying to rinse the terrible taste of Babygirl from our mouths.\n\nI'm not going to say anything that hasn't been said about this simply gorgeous movie, and its gorgeous stars, and the gorgeous dresses worn by Maggie Cheung which help tell the story, and the flowers and the apartments... just to say, wow. It really holds up after 25 years.\n\nI love how they bonded together over writing stories. And how I wish I could understand- it was clear that the subtitles are conveying barely 70% of the meaning, if that.    \n\nThe music was also so beautiful and I will be playing it regularly. \n\nI guess it's not fair to compare a movie like this to the toxic schlock of hateful gender and racial ideology that is Babygirl, but it just so happens we saw them a couple of weeks apart and so comparisons were inevitable. The restraint, the sorrow, the heartache, the gentleness and dignity of the story told in In the Mood for Love is so at odds with the toxicity, cringiness, and just bad storytelling and barf factor of Babygirl.   \n\nAnyway, if you haven't seen it, or did at the time but mostly forgot about it, then go watch it if you're craving a bit of romantic movie. You won't be sorry!\n\n",
        "upvotes": 33,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1iqrx8u/we_watched_in_the_mood_for_love_2000_for_valentine/"
    },
    {
        "id": "1ir3o7k",
        "author": "Successful_Boot_8041",
        "title": "Movie about divorced British parents? Work together to save pensions?",
        "content": "I think this might be a hallmark movie. It is two older British people 40-50. They are divorced but team up to hack into a company to get their pensions back? Their teenage son helps them he is in college and they have a zoom call with him where they can see the roommate pooping in the background. They drive a red car down stairs and worry about the insurance. Does anyone know what the name of this movie is? ",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1ir3o7k/movie_about_divorced_british_parents_work/"
    },
    {
        "id": "1iq6qti",
        "author": "JannTosh50",
        "title": "The Breakfast Club at 40: the teen movie blueprint for better or worse",
        "content": "",
        "upvotes": 1041,
        "comments": 133,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dxkpsoCgZv7Dfjt7nPdmAzTfaMOxkVCs4kWipppK3TQ.jpg?auto=webp&amp;s=08ed9f30cb1fd87dd9efe5a33a4f8f473af2c4a3"
        },
        "permalink": "/r/movies/comments/1iq6qti/the_breakfast_club_at_40_the_teen_movie_blueprint/"
    },
    {
        "id": "1ir7vcb",
        "author": "ziggychaplin",
        "title": "Movies/Shows where you can cut the sexual tension with a knife",
        "content": "I just watched In The Mood For Love. Wondering what other movies where the leads have sexual tension/yearning for each other. Builds up over time or instant chemistry or hot/steamy scene. \n\nAlso looking for examples from TV shows as well. TV show example I have already seen would be Fleabag with the priest of course. ",
        "upvotes": 3,
        "comments": 28,
        "media": null,
        "permalink": "/r/movies/comments/1ir7vcb/moviesshows_where_you_can_cut_the_sexual_tension/"
    }
]