[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1kc1pnd",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 25,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1kc1pnd/la_piola_friends_meetup/"
    },
    {
        "id": "1kjkycy",
        "author": "Filipo_it",
        "title": "Dove frequentano i 30enne?",
        "content": "Sul serio, quale posto si può andare senza essere un posto pieno di ragazzini? Più specificamente serate lgbt.",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1kjkycy/dove_frequentano_i_30enne/"
    },
    {
        "id": "1kjvp3o",
        "author": "Agreeable_Produce_86",
        "title": "Keto",
        "content": "Is anyone on Keto? How it's for you going out and socializing?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kjvp3o/keto/"
    },
    {
        "id": "1kjueve",
        "author": "Gulllinburst",
        "title": "Palestre arrampicata con ingresso singolo senza tessere varie",
        "content": "Ciao a tutti, purtroppo anche questa domenica il meteo continua a far schifo e vorrei chiedervi se sapete dirmi se a Torino e provincia ovest c'è qualche palestra di arrampicata dove è possibile entrare pagando un ingresso singolo senza essere in possesso di abbonamenti vari, tessere cai, fasi o altro. Grazie! ",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1kjueve/palestre_arrampicata_con_ingresso_singolo_senza/"
    },
    {
        "id": "1kjsblp",
        "author": "mango_fiero",
        "title": "Parrucchieri Torino",
        "content": "Migliori parrucchieri di Torino per un wolfcut? Uomo, capelli lunghi, non 30€ per favore 😭 (gli unici che trovo)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kjsblp/parrucchieri_torino/"
    },
    {
        "id": "1kjjmtc",
        "author": "InternationalPlant77",
        "title": "Piero gilardi",
        "content": "Tomorrow we arrive in Torino and want to so desperately see some sculptural painting  artwork by Piero Gilardi  Where can that be done? Any collections. The dream is so big but the internet search seems low-'#! Can somebody help oh please ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kjjmtc/piero_gilardi/"
    },
    {
        "id": "1kj76a4",
        "author": "DPPenjoyer18",
        "title": "Ramen a Torino?",
        "content": "Salve a tutti. Sono a Torino da poco e vorrei provare un buon ramen. Consigli su qualche locale dove andare?",
        "upvotes": 10,
        "comments": 31,
        "media": null,
        "permalink": "/r/torino/comments/1kj76a4/ramen_a_torino/"
    },
    {
        "id": "1kj4mg2",
        "author": "WestSuspicious115",
        "title": "Rimborso di denaro da una truffa",
        "content": "Ciao,\nsono uno studente internazionale a Torino.\nQuando cercavo un appartamento, ho pagato 250€ a *Trova Affitto* per un contratto di 6 mesi, in cui l’agenzia doveva trovarmi una sistemazione senza ulteriori costi.  \n\nHo finito per trovare un appartamento tramite un amico, non grazie a loro. Durante i 6 mesi, il servizio è stato pessimo e l’agente quasi inesistente.\nVoglio un rimborso, anche se non era previsto nel contratto.  \n\nSono andato a parlarne, ma l’agenzia non esiste più in città. Mi è stato detto che posso solo contattarli (senza risposta) o fare un reclamo alla polizia.  \n\nLunedì denuncerò il fatto, ma vorrei sapere se c’è qualcos’altro che dovrei fare. Grazie per le vostre risposte!  ",
        "upvotes": 14,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1kj4mg2/rimborso_di_denaro_da_una_truffa/"
    },
    {
        "id": "1kims92",
        "author": "attibearth",
        "title": "Torino, la città più bella d'Italia",
        "content": "Una città così sottovalutata. Spero che rimanga così",
        "upvotes": 211,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RhpYjpqaslrzFX0HvcBkvblLjGrWsxGB9N02VLsatEE.jpeg?auto=webp&amp;s=400603aa9aa1a4f4fac6db1d184e022b7a813370"
        },
        "permalink": "/r/torino/comments/1kims92/torino_la_città_più_bella_ditalia/"
    },
    {
        "id": "1kjhx6r",
        "author": "Earl_gabri",
        "title": "Dove riparare pc",
        "content": "Ciao a tutti, ho bisogno di far vedere/riparare il mio computer portatile.\nUn consiglio per un negozio nelle vicinanze in zona lingotto? \nGrazie in anticipo ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kjhx6r/dove_riparare_pc/"
    },
    {
        "id": "1kjh1zy",
        "author": "Sophibom",
        "title": "Eco di marc didou , torin9 Qualcuno è andato in vacanza?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gkj3e3ms000f1.jpeg?auto=webp&amp;s=96d0af68ef163028baa5a1e9fd0e4dd77e80c1a2"
        },
        "permalink": "/r/torino/comments/1kjh1zy/eco_di_marc_didou_torin9_qualcuno_è_andato_in/"
    },
    {
        "id": "1kimj5y",
        "author": "Least_Way_4494",
        "title": "Torino Through My Eyes",
        "content": "been in the city for about 7 month and these are some of my favorite shots during this time, beautiful city nonetheless",
        "upvotes": 93,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EcYa8x4uYIKNsnw5NvP2u8YjMKiiZBzN_WDXjE3qWDs.jpeg?auto=webp&amp;s=d4deed8f0dd0b5cf7f615e3b976abd53ec49bae6"
        },
        "permalink": "/r/torino/comments/1kimj5y/torino_through_my_eyes/"
    },
    {
        "id": "1kigco4",
        "author": "Apoworld",
        "title": "GTT infame",
        "content": "Mia moglie era sul 9 e ha avuto problemi nell’utilizzo dell’app GTT (vedi screenshot).\n\nPremessa (non che sia una scusa): è incinta all’8º mese e stava andando ad una visita.\n\nSono saliti gli infami e nonostante lei abbia fatto vedere la chat nella quale mi diceva del problema l’hanno multata comunque, nonostante la gravidanza e senza neanche darle la possibilità di riprovare a comprare il biglietto sull’app (era sicuramente lì il problema perchè il pagamento per la successiva multa di 37€ è andato all’istante).\n\nIo sono sconcertato dall’infamia di questa categoria…",
        "upvotes": 130,
        "comments": 115,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rd5f57ittqze1.jpeg?auto=webp&amp;s=cd59733e96fce90db0a04533d7563215d54e923a"
        },
        "permalink": "/r/torino/comments/1kigco4/gtt_infame/"
    },
    {
        "id": "1kj8tsb",
        "author": "NomeUtente86",
        "title": "Qualcuno trasmetterà le Partite Mondiale per Club a Torino?",
        "content": "Buongiorno, a giugno ci sarà il mondiale per club e ci saranno delle partite trasmesse live alle 3 di notte.\nSiamo un gruppo di circa 10 persone e ci piacerebbe vederle insieme.... \nMi chiedo se ci fosse qualche locale in Torino o prima cintura che le trasmetterà in modo da stare in sieme e vedere queste partite con gli amici....",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1kj8tsb/qualcuno_trasmetterà_le_partite_mondiale_per_club/"
    },
    {
        "id": "1kj7je1",
        "author": "Repulsive_Break_3569",
        "title": "Ricerca universitaria uso mezzi di trasporto alternativi all'auto privata",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/O_1jbVGi0umhiyjNDoQVlcUTFpticb2eR-5IIeRS-IA.png?auto=webp&amp;s=dd369426acbad0354559a2505642212fb243d6ca"
        },
        "permalink": "/r/torino/comments/1kj7je1/ricerca_universitaria_uso_mezzi_di_trasporto/"
    },
    {
        "id": "1kj6uh1",
        "author": "BroqueviNEGAR",
        "title": "Am I cooked? (Part 2)",
        "content": "I am officially done with my TOLC E English exam and omg what were those logic questions istg they were so terrible, every option had a same meaning or some didn't even make sense.\nNonetheless, I performed really poor in it and scored 20.25/36 and I was applying for University of Turin for the Economics finance and data science bachelor's Degree.\nThe question that arises is should I retake the TOLC E EXAM or should I wait 90 days and wait for the university with the response regarding the admission letter. Since I'm an international student I need to book TOLC e exam a month before since they're online slots full up really quickly. Would really appreciate if someone can help me out in this one.\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1kj6uh1/am_i_cooked_part_2/"
    },
    {
        "id": "1kiue9x",
        "author": "hopkinsdamechanic",
        "title": "🏀Cerchiamo una giocatrice per il torneo di basket del 16 maggio!",
        "content": "\nItalian:\n⛹‍♀🏀 Per il torneo di basket del 16 maggio, una delle squadre è alla ricerca di una giocatrice.\nSe c'è qualche studentessa interessata a partecipare, mi faccia sapere per favore!\n\nEnglish:\n⛹‍♀🏀 For the basketball tournament on May 16th, one of the teams is looking for a female player.\nIf any female students are interested in joining, please let me know! ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kiue9x/cerchiamo_una_giocatrice_per_il_torneo_di_basket/"
    },
    {
        "id": "1kiw9c4",
        "author": "Giuntoliuporc",
        "title": "Locali notturni (😏)Torino",
        "content": "Ciao conoscete dei locali notturni validi per coppie a Torino? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kiw9c4/locali_notturni_torino/"
    },
    {
        "id": "1kiquaj",
        "author": "Zealousideal_Match26",
        "title": "Concerti di artisti internazionali spariti?",
        "content": "Ho notato che negli ultimi anni i concerti di artisti internazionali a Torino sono praticamente spariti, ormai solo più Bologna o Milano. Come mai? Colpa anche del cambio di gestione del PalaOlimpico da PalaAlpitour a Inalpi Arena? \n\nPensavo che dopo l’Eurovision Torino sarebbe stata considerata di più in ambito musicale… Un vero peccato anche perché a livello di qualità audio il PalaOlimpico è ottimo! ",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1kiquaj/concerti_di_artisti_internazionali_spariti/"
    },
    {
        "id": "1kindgu",
        "author": "alessia01_",
        "title": "Nuove amicizie",
        "content": "Ciao! Sono una ragazza di 23 anni e sto cercando nuove amicizie, sia ragazze che ragazzi tra i 20 e i 28 anni. Ho già un mio gruppetto, ma mi piacerebbe allargare un po’ le conoscenze e conoscere persone nuove con cui uscire, fare aperitivi, chiacchierare e magari organizzare qualcosa di carino insieme.\n\nSono una persona solare e tranquilla, quindi se anche tu sei in cerca di nuove conoscenze, scrivimi pure! :)\n\n",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1kindgu/nuove_amicizie/"
    },
    {
        "id": "1kiizvj",
        "author": "ziocrodo",
        "title": "Cercasi Baskettari e Allenatore per nuova squadra di basket UISP",
        "content": "🏀🏀🏀\nNon importa se hai smesso da anni o giochi ancora ogni tanto con gli amici: se il suono della retina che fruscia ti dà ancora i brividi… allora sei nel posto giusto.\n\nStiamo cercando nuovi giocatori + 1/2 allenatori per una squadra amatoriale: ci alleneremo, giocheremo nel campionato UISP 2025/2026 e soprattutto ci divertiremo. Livello medio, età 25-40, clima easy ma con voglia di fare sul serio.\n\nInfo pratiche: •\tZona: Pozzo Strada e limitrofe (speriamo di trovare palestre in zona) •\tAllenamenti: si pensa martedì e giovedì 21/23\n\nCerchiamo gente con un minimo di esperienza, ma soprattutto con voglia di rimettersi in gioco. Se sei un ex playmaker col vizio del passaggio no-look, o un lungo che vive di rimbalzi e ginocchia consumate… vieni a fare un giro.\n\nDato lo sbattone, sarò il capitano\n\nSi cercano anche allenatori che siano disponibili a mettersi a disposizione per passione ed a titolo gratuito, in caso non si trovino, la squadra verrà allenata da me.\n\nNO primedonne NO attaccabrighe\n\nLa squadra nasce con la voglia di giocare e provare a togliersi qualche sfizio.\n\nFatta da e per tutte quelle riserve che in FIP non hanno mai avuto troppo spazio.\n\nPanchinari di Torino, se anche voi siete tornati a casa dopo una trasferta a 50km senza nemmeno entrare in campo, qui avrete la vostra rivalsa.\n\nL’idea è di non avere troppe persone, io direi che al massimo 14/15 persone vadano bene.\n\nL’idea di spesa per ciascun giocatore sarà penso non più di 150/200 euro a testa compreso di divise (no borsoni), ma questo dato senza ancora una palestra a disposizione prendetelo con le pinze.\n\nPerfavore NO HATE.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kiizvj/cercasi_baskettari_e_allenatore_per_nuova_squadra/"
    },
    {
        "id": "1khxz5i",
        "author": "PastinaInBrodo",
        "title": "Perché quando piove usano i pullman vecchi?",
        "content": "Qualcun'altro ha notato che spesso nei giorni di pioggia ci sono in giro più pullman vecchi? Quello blu e grigi come quello nell'immagine per intenderci, un motivo logistico o per lavarli a basso prezzo?",
        "upvotes": 78,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/h9vua4fxtlze1.jpeg?auto=webp&amp;s=6b1d584b4664b1df7be7059d91fcb3c731ae8b29"
        },
        "permalink": "/r/torino/comments/1khxz5i/perché_quando_piove_usano_i_pullman_vecchi/"
    },
    {
        "id": "1kicsas",
        "author": "InternationalPlant77",
        "title": "Arte povera artists resources in Turin",
        "content": "Hi, I am an Australian artist and coming to Turin on Sunday / Monday / Tuesday to view and research Arte povera artist style.\n\nI particularly enjoy Boetti and Gillardi.\n\nCan anybody recommend places, sites, museums or galleries that are good to check out whilst in Turin.\n\nThanks ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1kicsas/arte_povera_artists_resources_in_turin/"
    },
    {
        "id": "1kid3fi",
        "author": "IlKayMosca",
        "title": "Miglior pizzerie in centro/zone centrali",
        "content": "Ciao a tutti, nelle prossime settimane te verranno i miei genitori a Torino e vorrei portarli a mangiare un'ottima pizza. Sapete dirmi, secondo voi, le migliori pizzerie intorno al centro? Purtroppo vivo qui da pochi mesi e sono riuscito a provarne poche",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1kid3fi/miglior_pizzerie_in_centrozone_centrali/"
    },
    {
        "id": "1ki3e6o",
        "author": "mougly97",
        "title": "AA meetings Torino",
        "content": "I'm a 28-years old Finnish woman and I'll be visiting Turin for 10 days this month. I've been sober for 4 months and the longest period I've been without an AA meeting is three days. \n\nI used to live in Turin so I understand Italian perfectly but I speak it very poorly because it has been 10 years since I moved back to Finland.\n\nI checked and there are atleast six different AA groups in Turin, but I was wondering if anyone could give me some advice on where to go or how to handle the language barrier? Feel free to dm me if you're an AA member and willing to talk about this.\n\nThe people at my home group advised me to do my speech in English or even Finnish just as long as I go and attend a meeting but I'm feeling anxious about it.",
        "upvotes": 16,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1ki3e6o/aa_meetings_torino/"
    },
    {
        "id": "1kiekx8",
        "author": "albegrim",
        "title": "Cosigli su locali dove vedere le Partite a torino",
        "content": "Ciao a tutti,non so se questo è  il posto giusto in cui chiedere ma ci provo. In vista della finale di Champions vorrei trovare un pub a torino in cui poter vedere la partita, che locali mi consigliate ? Vorrei trovare un posto in cui potermela godere come tifoso quindi tv non troppo lontane dai tavoli e troppo piccole al punto da non distinguere i giocatori.\nGrazie in anticipo!",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1kiekx8/cosigli_su_locali_dove_vedere_le_partite_a_torino/"
    },
    {
        "id": "1kijdwi",
        "author": "Fearless_Bar_4792",
        "title": "62 pullman",
        "content": "cerco una donna incontrata oggi (9 maggio) sul 62 verso le 14.20 direzione piazza sofia, aveva capelli neri e mi sembra anche un figlio, se mi stai leggendo se ti va scrivimi",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1kijdwi/62_pullman/"
    },
    {
        "id": "1ki29z4",
        "author": "lastflowers_",
        "title": "Corsi gratuiti - nuove amizie",
        "content": "Ciao a tutti, sono una ragazza che abita poco fuori città. Mi piacerebbe sapere se a Torino ci sono dei corsi, di vario genere, gratuiti o a poco prezzo. \nCorsi, ad esempio, di fotografia, pittura, ricamo e quant’altro. \n\nSarebbe una buona occasione per fare nuove amicizie e imparare qualcosa di nuovo!",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ki29z4/corsi_gratuiti_nuove_amizie/"
    },
    {
        "id": "1khwrmm",
        "author": "Expensive-Paint-9490",
        "title": "Liutai per chitarra elettrica a TO",
        "content": "Devo fare un paio di lavori sulla mia chitarra: sostituire i tasti e cambiare l'elettronica. Conoscete dei bravi liutai a Torino? Non mi consigliate Umberto Mari perché mi feci fare un cambio tasti e fu davvero pessimo.",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1khwrmm/liutai_per_chitarra_elettrica_a_to/"
    },
    {
        "id": "1khuz9r",
        "author": "Rand_0m_",
        "title": "Campi da calcio",
        "content": "come da titolo,  qualcuno sa darmi gli indirizzi di campi da calcio (gratuiti) a Torino? va bene ovunque ci sia una fermata della metro nelle vicinanze. terra o sintetico basta ci sia una porta per allenarsi.\ngrazie in anticipo 😄",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1khuz9r/campi_da_calcio/"
    },
    {
        "id": "1khmtca",
        "author": "CryingAlwaysCrying",
        "title": "Interruzioni di corrente? Succede anche a voi?",
        "content": "Negli ultimi giorni, la corrente salta di notte (verso l’1–3), senza alcun carico acceso: niente condizionatore, niente stufette, solo il frigo.\n\nPensavo fosse un problema mio, ma anche altri in zona (e in quartieri diversi: San Salvario, Aurora, Cit Turin) hanno avuto lo stesso a mie amici.\n\nSuccede anche a voi? Qualcuno sa cosa sta succedendo?",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1khmtca/interruzioni_di_corrente_succede_anche_a_voi/"
    }
]