[
    {
        "id": "1lj9ld3",
        "author": "USATodayAMA",
        "title": "Hey /r/movies! I’m Brian Truitt, USA TODAY’s movie critic. To celebrate 50 years of ‘Jaws,’ I ranked the top 50 best summer blockbusters. Let's chat about your favorite films &amp; AMA!",
        "content": "Hey r/movies! \n\nSummer blockbusters have been a cinematic tradition ever since Steven Spielberg’s Jaws took a bite out of the box office in 1975. To mark the 50th anniversary of that game-changing moment, I put together a list for USA TODAY of the 50 best blockbusters released since then — from superhero spectacles to sci-fi epics and everything in between. \n\nI’m Brian Truitt, movie critic at USA TODAY. I’m a native Northern Virginian, girl dad of one daughter, dog father to three adorable Boston Terriers, and a lifelong pop-culture fiend who’s spent the last 15 years writing for the Nation’s Newspaper. I review movies, rank pretty much everything from Marvel movies to football films, and sometimes get to talk with the likes of Stephen King and George Clooney. \n\nOne of my best movie memories from when I was a kid was in 1983, when I was 7. My mom picked me up from school for opening night of “Return of the Jedi.” There was a line around the mall, and we had to wait for two hours, but Jabba the Hutt, Ewoks and Admiral Ackbar were so worth it. \n\nMy list, ranked worst to best:\n\n[https://www.usatoday.com/story/entertainment/movies/2025/06/20/best-summer-blockbuster-movies-ranked/84056437007/](https://www.usatoday.com/story/entertainment/movies/2025/06/20/best-summer-blockbuster-movies-ranked/84056437007/)\n\nGet some popcorn and let’s dive into the world of summer movies — ask me anything! Back at 3 PM ET today to answer your questions.\n\n",
        "upvotes": 0,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o7oedy59av8f1.jpeg?auto=webp&amp;s=bfd8a9986671fdf183101afb191bc6e298906480"
        },
        "permalink": "/r/movies/comments/1lj9ld3/hey_rmovies_im_brian_truitt_usa_todays_movie/"
    },
    {
        "id": "1lj7pq7",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Cillian Murphy in ‘Steve’ - Follows a day in the life of headteacher Steve at a last-chance reform school who struggles to keep his students in line while also grappling with his spiralling mental health",
        "content": "",
        "upvotes": 2627,
        "comments": 202,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/izv8cwmxsu8f1.jpeg?auto=webp&amp;s=d6e2b46632f2e8a9aeac48c5d9b50f1f2106dcda"
        },
        "permalink": "/r/movies/comments/1lj7pq7/first_image_of_cillian_murphy_in_steve_follows_a/"
    },
    {
        "id": "1lj8jgx",
        "author": "MarvelsGrantMan136",
        "title": "First Images from Duncan Jones’ ‘Rogue Trooper’ - Follows a lone survivor super soldier on a mission for vengeance — accompanied, naturally, by a sentient gun, backpack, and helmet imbued with his dead squadmates personalities.",
        "content": "",
        "upvotes": 1873,
        "comments": 283,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/kflxcrx61v8f1.jpeg?auto=webp&amp;s=cccfe60332e58168c83e89b8ce3fc3612c8646cb"
        },
        "permalink": "/r/movies/comments/1lj8jgx/first_images_from_duncan_jones_rogue_trooper/"
    },
    {
        "id": "1lj8ms2",
        "author": "BunyipPouch",
        "title": "UK Actors Union Says Thousands Of Performers Have Been Digitally Scanned On Set Without Their Informed Consent, Urging Progress on Artificial Intelligence Negotiations",
        "content": "",
        "upvotes": 681,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-BUiQTfubT7CYSYep0vId2fONU8anFIxeo8bWJO0gBQ.jpeg?auto=webp&amp;s=3c5709fcc9e59a958512c156e50c9c5bdc8c2536"
        },
        "permalink": "/r/movies/comments/1lj8ms2/uk_actors_union_says_thousands_of_performers_have/"
    },
    {
        "id": "1ljav0r",
        "author": "MarvelsGrantMan136",
        "title": "First Images of Channing Tatum, Kirsten Dunst, Peter Dinklage, Juno Temple and LaKeith Stanfeld in 'Roofman' - True story of Jeffrey Manchester (Tatum), a charming armed robber who makes an elaborate escape from prison and takes refuge in a Toys \"R\" Us",
        "content": "",
        "upvotes": 422,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8qdf6n0viv8f1.jpeg?auto=webp&amp;s=794f88ecd86a359fa2707ce3ad7fda4ad981e4a7"
        },
        "permalink": "/r/movies/comments/1ljav0r/first_images_of_channing_tatum_kirsten_dunst/"
    },
    {
        "id": "1lixai5",
        "author": "NoCulture3505",
        "title": "Secret Netflix Movie That Landed Lofty California Tax Credit Is Likely Brad Pitt’s ‘Adventures Of Cliff Booth’",
        "content": "",
        "upvotes": 2786,
        "comments": 240,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rXdJhzKL9iXC6v8-PEQxgVpJsAL3bH4wHHrGAZ62jNw.jpeg?auto=webp&amp;s=5ba275c8a042dff5eb750f607b55f158e1bdbc42"
        },
        "permalink": "/r/movies/comments/1lixai5/secret_netflix_movie_that_landed_lofty_california/"
    },
    {
        "id": "1liye8t",
        "author": "owenja104",
        "title": "Can somebody explain in detail why older movies (60s, 70s, 80s) look “better”.",
        "content": "I’m watching Lawrence of Arabia on blu ray right now and I’m blown away with how fantastic it looks. I notice the same things when watching most older movies, such as 2001 which I have on 4k and various other titles like north by northwest. \n\nI know some of the reasons why, here is what I know. \n\nFilms that were actually shot and enhanced on film have a more natural and close to real life look. Movies now, even when shot on film, are enhanced digitally and tend to look more artificial as a result. When I say “better” I mean it looks more life like, more clear (if that makes sense), the colors pop way more, etc. Digital movies lose that because of color filters and digital enhancements. \n\nIs that the only reason? Do lenses used play a part? Something with technicolor? I’m just blown away every time I pop in a 4k or blu ray even of old ass movies and they just look incredible.  ",
        "upvotes": 1266,
        "comments": 416,
        "media": null,
        "permalink": "/r/movies/comments/1liye8t/can_somebody_explain_in_detail_why_older_movies/"
    },
    {
        "id": "1lj4fnu",
        "author": "PippyHooligan",
        "title": "A movie you love, but the protagonist is your least favourite thing about it.",
        "content": "...not that they're written to be unlikeable, rather that they're not as interesting or exciting to you as the rest of the movie.  \n  \neg. I was talking about Robocop with my wife last night (as I often do, she puts up with a lot) and realised that although the film is one of my all time favourites, Robocop the character is probably the thing I like the least about the picture, Weller is fine as the resurrected man, but the supporting characters, the villains and the world building are all so much more enjoyable than a do-good monosyllabic shiny robot man.\n\nI know that sometimes protagonists are there to act as a vessel for the audience- carrying the story along, but not being particularly interesting themselves.\n\nWhat are some examples of films you absolutely love, but the protagonist would be at the bottom of the list of reasons you love them-? ",
        "upvotes": 215,
        "comments": 379,
        "media": null,
        "permalink": "/r/movies/comments/1lj4fnu/a_movie_you_love_but_the_protagonist_is_your/"
    },
    {
        "id": "1lirpxq",
        "author": "Abi_Jurassic",
        "title": "New Poster for Jurassic World Rebirth",
        "content": "",
        "upvotes": 1471,
        "comments": 522,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cav1rkurmq8f1.jpeg?auto=webp&amp;s=84f5cfdffbe4aecda60de806592199de66bd3cab"
        },
        "permalink": "/r/movies/comments/1lirpxq/new_poster_for_jurassic_world_rebirth/"
    },
    {
        "id": "1likyf9",
        "author": "RobotiSC",
        "title": "Weapons | Official Trailer 2",
        "content": "",
        "upvotes": 2856,
        "comments": 555,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VL6Ky9IZxXOoQ5PMXQdqGmUQ6cekhxVNK-qv6KX9PxY.jpeg?auto=webp&amp;s=2f33f034498b8c05fdf183c5aa0be8cd94786125"
        },
        "permalink": "/r/movies/comments/1likyf9/weapons_official_trailer_2/"
    },
    {
        "id": "1liqdfq",
        "author": "Available-Subject-33",
        "title": "What is the most cinematic food of all time?",
        "content": "Some things just ooze a cinematic aura. Making out in the rain. Men in suits. Planes flying against a sunset. Moody, soft light cut by Venetian shades. A woman taking slow puffs on a cigarette. A really great jacket.\n\nSo what food feels the most cinematic?\n\nYesterday, there was a post on this subreddit about why male movie characters never wear shorts, and one of the comments said that it just didn't feel like movie character energy. I feel like this is the chicken nugget of movie food.\n\nPersonally, my pick is eggs. A close-up of someone cracking eggs into a skillet seems very common in films.",
        "upvotes": 1306,
        "comments": 680,
        "media": null,
        "permalink": "/r/movies/comments/1liqdfq/what_is_the_most_cinematic_food_of_all_time/"
    },
    {
        "id": "1lj8vkb",
        "author": "WhatTheJessJedi",
        "title": "What Film made you want to Travel to that Country?",
        "content": "Have you ever watched a movie and was distracted how beautiful the location was?  For me it was Troy with Brad Pitt and Eric Bana. The gorgeous water and ancient ruins. So I went to Greece. (Though I'm aware they had a hurricane and had to move their sets to Mexico half way through shooting.) I love the old world ancient stuff. Momma Mia too. ",
        "upvotes": 69,
        "comments": 171,
        "media": null,
        "permalink": "/r/movies/comments/1lj8vkb/what_film_made_you_want_to_travel_to_that_country/"
    },
    {
        "id": "1ljdr71",
        "author": "Odd_Advance_6438",
        "title": "After seeing him in John Wick 4, I think Scott Adkins has more potential to grow as an actor than people give him credit for",
        "content": "For a while, Scott Adkins has kind of been stuck playing the protagonist in a generic action movie, or a generic villain henchman. Maybe it’s just the fact that he was unrecognizable in JW4, but I was really impressed by him in it. Killa was a super fun antagonist with a good amount of personality (loved the way he kept having to use his inhaler) and it was hilarious and surprising to see him actually throw hands",
        "upvotes": 28,
        "comments": 26,
        "media": null,
        "permalink": "/r/movies/comments/1ljdr71/after_seeing_him_in_john_wick_4_i_think_scott/"
    },
    {
        "id": "1limxfl",
        "author": "MarvelsGrantMan136",
        "title": "Callina Liang Joins Legendary’s ‘Street Fighter’ Movie As Chun-Li",
        "content": "",
        "upvotes": 1421,
        "comments": 174,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BNZ-q2VGt_2X_Om7YezvYwh-RPV3FYHiYQEyujpA8q0.jpeg?auto=webp&amp;s=ca3696a483e9abc202dfd62b020d3cb8abb74eeb"
        },
        "permalink": "/r/movies/comments/1limxfl/callina_liang_joins_legendarys_street_fighter/"
    },
    {
        "id": "1limekb",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Ice Road: Vengeance' Starring Liam Neeson",
        "content": "",
        "upvotes": 1327,
        "comments": 406,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/711nenvomp8f1.jpeg?auto=webp&amp;s=23173560ee0c93bc48870cd3ef5c66136ecf92a3"
        },
        "permalink": "/r/movies/comments/1limekb/official_poster_for_ice_road_vengeance_starring/"
    },
    {
        "id": "1liyht2",
        "author": "iLLogick",
        "title": "What movie does the best job of making you *feel* the heat of the sun?",
        "content": "Inspired by the heatwave currently hitting the North East United States and Southern Ontario. Let’s talk about movies that are hot. Not in the NSFW way; in the heat stroke, dehydrating, burn your skin and cook your feet on asphalt kind of way. \n\nHoles (2003)\nSunshine (2007)\nDo the Right Thing (1989)\n\nThese come to mind right away but let’s get a discussion going. ☀️",
        "upvotes": 251,
        "comments": 385,
        "media": null,
        "permalink": "/r/movies/comments/1liyht2/what_movie_does_the_best_job_of_making_you_feel/"
    },
    {
        "id": "1liw9nv",
        "author": "MarvelsGrantMan136",
        "title": "‘WHEN EVIL LURKS’ Sequel In Development From Demián Rugna",
        "content": "",
        "upvotes": 307,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jbPsJZT6ZtAgVl1teXmLObtabFOiJ4ETcLC598EdG4U.jpeg?auto=webp&amp;s=4bdb5c23d827485f1522933ef788f3b73c5b7dcc"
        },
        "permalink": "/r/movies/comments/1liw9nv/when_evil_lurks_sequel_in_development_from_demián/"
    },
    {
        "id": "1lik367",
        "author": "MarvelsGrantMan136",
        "title": "Get Ready for More Commercials in Movie Theaters - Industry leader AMC Theatres is reversing course and joining its rivals on July 1 in adding regular ads to its pre-movie lineup in a worrisome trend for studios.",
        "content": "",
        "upvotes": 1265,
        "comments": 487,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UA1tVqGyTTPmOJ8yYDCGF3Ba24mcBvGGOTxoHKTSTsQ.jpeg?auto=webp&amp;s=f9c2c84b4fe2cab997a20b9b2f58633bb132f03a"
        },
        "permalink": "/r/movies/comments/1lik367/get_ready_for_more_commercials_in_movie_theaters/"
    },
    {
        "id": "1lj00pb",
        "author": "TheArchitect_7",
        "title": "Roger Rabbit / Chinatown: What famous movie scenes are actually a little-known reference/homage to another film?",
        "content": "I’ve watched Who Framed Roger Rabbit a thousand times and I know it’s a homage to noir films, but when I was younger I didn’t really know any of the classics.\n\nI’m watching Chinatown for the first time and I was astonished to see that the opening scene was identical to the Pattycake scene from Roger Rabbit. \n\nIn the same vein as finding old samples in new songs, what are some fun homages or references that only avid movie watchers would know?",
        "upvotes": 162,
        "comments": 113,
        "media": null,
        "permalink": "/r/movies/comments/1lj00pb/roger_rabbit_chinatown_what_famous_movie_scenes/"
    },
    {
        "id": "1lijuxa",
        "author": "duuuuuuuudeimhigh",
        "title": "My brother is 17 years old and is in the phase of \"looking for himself\". What are some movies we can watch that can have a positive impact on him?",
        "content": "What are some movies that had a positive impact on you in this age, or even when you were older? Any advices are appreciated. For example, a very impactful movie for me was Forest Gump. Another one was Flight, with Denzel, Shawshank Redemption and the Matrix trilogy. He would be interested in basically everything. Thank you.",
        "upvotes": 1241,
        "comments": 2657,
        "media": null,
        "permalink": "/r/movies/comments/1lijuxa/my_brother_is_17_years_old_and_is_in_the_phase_of/"
    },
    {
        "id": "1lityw4",
        "author": "Logical-Safe2033",
        "title": "Films where the protagonist hides the fact that they are secretly a certain gender/race/monster/in some way unacceptable to society",
        "content": "Not too sure how to word this, but one of my all time favourite tropes is where a main character has to conceal the fact that who they really are is seen as unacceptable/evil/frightening in their world. It's even juicier if they have a close relationship with someone who would be horrified if they found out the truth about them.\nExamples are things like:\n\n- Female character disguised as a man in historic setting \n\n- Black character disguised as white in 1960s USA (or other racist society)\n\n- Exorcist who is secretly a demon \n\n- Cop who doesn't realise that the criminal/vigilante they're chasing is actually their relative/lover \n\n- Werewolf/alien whose close friend/lover/relative is a werewolf/alien hunter\n\n- A character who has to hide supernatural abilities that make them incredibly dangerous and threatening to society, whether they intend to be or not.\n\n\nGenre doesn't matter at all, it can be absolutely anything as long as there's that tension of hiding the secret is there, and ideally the secret gets discovered at some point. Obviously the superhero genre is rife with secret identity stuff, but it's great if the secret is specifically scorned/undesirable. \n\nI'd welcome any recommendations for films (or shows or even books) with this trope :)",
        "upvotes": 370,
        "comments": 451,
        "media": null,
        "permalink": "/r/movies/comments/1lityw4/films_where_the_protagonist_hides_the_fact_that/"
    },
    {
        "id": "1liekrb",
        "author": "BunyipPouch",
        "title": "Sean Penn-Backed Political Thriller ‘Words Of War’ Secures International Distribution - Tells the real-life story of Anna Politkovskaya, who exposed the atrocities of Second Chechen War and the intimidation and violence of Russian leaders, until she was assassinated in her apartment in 2006.",
        "content": "",
        "upvotes": 2228,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WlvpM59qlY9K_J0bPTubgJ2fcp4J41vhbZ3iw7a7_yY.jpeg?auto=webp&amp;s=03575527ea64b90975c02e6e9f9fcb3349da6fbd"
        },
        "permalink": "/r/movies/comments/1liekrb/sean_pennbacked_political_thriller_words_of_war/"
    },
    {
        "id": "1ljf7lk",
        "author": "SparklePony3",
        "title": "Witchboard - Official Trailer",
        "content": "",
        "upvotes": 10,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bMi1g-4fMsDk9AQefBJ-WQPi4QaO1Y6KF3mlnJeBZe4.jpeg?auto=webp&amp;s=ba3d2819513c6f4cac1e0c101b4869cccfd35478"
        },
        "permalink": "/r/movies/comments/1ljf7lk/witchboard_official_trailer/"
    },
    {
        "id": "1lj79ix",
        "author": "PM_Peartree",
        "title": "The Tilly Sisters: What are your thoughts on Jennifer and Meg Tilly, two actresses whose shining phase came in different decades?",
        "content": "I always find it interesting how Jennifer Tilly's career blew up right after her kid sister, Meg Tilly, dropped out of the business. \n\nMeg Tilly was huge in the 80s and early 90s: Agnes of God, The Big Chill, Valmont, Psycho II, Sleep with Me, the super underrated Body Snatchers. Then, she quit or temporarily retired, and Jennifer Tilly got massive with Bound, Bullets Over Broadway, the Chucky movies and Liar Liar. \n\nIt's hard to compare the two since Meg wasn't in a lot of movies but Meg definitely was the better dramatic actress. Jennifer is better at comedy. Both women got one Best Supporting Actress nom and I still think they should have won. \n\nI always wish they had made one movie together, though. Meg has made sporadic returns, she even wrote a script for a Hilary Swank movie.",
        "upvotes": 33,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1lj79ix/the_tilly_sisters_what_are_your_thoughts_on/"
    },
    {
        "id": "1lihxtp",
        "author": "NoCulture3505",
        "title": "Poster for 'My Mother's Wedding'",
        "content": "",
        "upvotes": 985,
        "comments": 269,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zhsa32p8so8f1.jpeg?auto=webp&amp;s=f2dcf55c29fe26f6e3e1211c8312f8f7361492f9"
        },
        "permalink": "/r/movies/comments/1lihxtp/poster_for_my_mothers_wedding/"
    },
    {
        "id": "1ljaab2",
        "author": "debby0703",
        "title": "The World's Fastest Indian",
        "content": "Been procastinating watching this movie which was in my watchlist for years. Watched it on a whim a couple of weeks back and I have already watched it twice...!\n\nI LOVE the movie, it's got such a feel good vibe and kind of feels like it takes you on a journey. You meet the people Burt meets, you live his experiences and when he achieves what he want to, we do too. \n\nI love the side characters too - from Ms. Tina Washington, to the little Tom to his well wishers in Bonneville, the movie shows the best of humanity. I have no idea what makes the movie so good, but man I do regret not watching this sooner. Suggestions welcome for more heartwarming, fun movies and up to see if anyone else loves this movie as much as I do",
        "upvotes": 13,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1ljaab2/the_worlds_fastest_indian/"
    },
    {
        "id": "1lj12j4",
        "author": "revengeoftheriffs",
        "title": "saving private ryan",
        "content": "SPR might be the most gut wrenching, depressing, yet beautiful movie I have EVER watched. I think it accurately shows the emotions of soldiers reacting to losing someone, but also their families. I think it also accurately depicts some soldiers being dumbasses rather than like all serious all the time. It really shows that these are just young men, not just some strict men. This movie is so jaw dropping and somber. The gore did make me feel nauseous but it was not that bad! Did make me cry multiple and I mean multiple times. Still 10/10!",
        "upvotes": 63,
        "comments": 50,
        "media": null,
        "permalink": "/r/movies/comments/1lj12j4/saving_private_ryan/"
    },
    {
        "id": "1ljek2y",
        "author": "space_delorean",
        "title": "Question about a certain stunt/death scene in Lethal Weapon (1987)? Spoilers.",
        "content": "I have always wanted to know how they did the plastic in the outdoor pool stunt, where Riggs shoots a bad guy who ends up drowning in the pool. You see the man fall back into the pool, land on the plastic and starts slowly sinking to the bottom while struggling to free himself. How did they perform such a stunt safely?",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1ljek2y/question_about_a_certain_stuntdeath_scene_in/"
    },
    {
        "id": "1litmsa",
        "author": "SanderSo47",
        "title": "June 20-22 Box Office Recap – 'How to Train Your Dragon' stays #1, but drops a rough 57% on its second weekend. '28 Years Later' debuts with a pretty good $30M domestically and $60M worldwide. However, 'Elio' flops with a terrible $20M domestically and $34M worldwide, the worst debut for Pixar.",
        "content": "https://preview.redd.it/q8ew8lqszq8f1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=fcd1ac805e410d7cad93ff5c9d24d372f3f22acc\n\nIt was a mixed bag at the box office this weekend.\n\nUnsurprisingly, the ***How to Train Your Dragon*** live-action stayed at the top of the box office, although it still had a rough drop. ***28 Years Later*** achieved a very solid #2 start, although it remains to be seen if it will have legs.\n\nHowever, the weekend is also defined by some very bad news. That's the case with Pixar's ***Elio***, which flopped this weekend and posted the studio's worst debut in all its 30 years of history.\n\nThe Top 10 earned a combined $120.6 million this weekend. That's down 18.6% from last year, when ***Inside Out 2*** repeated at #1.\n\nStaying at the top spot, Universal/DreamWorks' ***How to Train Your Dragon*** added $36.5 million this weekend. That's a very bad 57% drop, which is steeper than any of the animated films and quite poor for a family film. Despite its strong weekdays, it looks like the film might have had a ceiling regardless of its strong word of mouth.\n\nThrough 10 days, the film has earned $160 million, just slightly short of outgrossing ***The Hidden World***'s $160.7 million total. In the next few days, it will pass the second film ($177 million). Although this drop suggests that it might not be as leggy as its weekdays suggested.\n\nIn second place, Sony's ***28 Years Later*** debuted with a pretty good $30 million in 3,444 theaters. That's easily the best debut in the franchise, tripling both ***Days*** ($10 million) and ***Weeks*** ($9.8 million). It's also the biggest debut for director Danny Boyle.\n\nAll in all, this is a pretty great debut. After all, the original franchise had a ceiling at the box office, but it has built an audience across home media, streaming and cable reruns. While there were projections that could go as high as $40 million, it's not really a bad start. This proves the franchise's popularity; if it wasn't, the film wouldn't have hit $30 million on its opening weekend.\n\nCredit must go to Sony's incredible job in marketing the film. That teaser, accompanied with the 1903 poem \"Boots\" by Rudyard Kipling, was fantastic and even became the seccond biggest horror film trailer of all time back then (***Final Destination: Bloodlines*** would later claim this title). Obviously, it wasn't gonna open as high as the ***It*** films, but that clearly showed interest. Cinephiles were also excited to see the return of Danny Boyle and Alex Garland as director and writer, respectively. And without many horror options right now, this was a perfect date. And they also delivered a fantastic film; it's currently sitting at a 89% on RT.\n\nDespite its great debut, it has to be noted that the film was quite front-loaded. Thursday previews ($5.8 million) accounted for 19.3% of its weekend gross, which is very high, even for horror (for reference, ***Final Destination: Bloodlines***' previews were just 10.6% of its weekend gross). It was followed by a steep 37% drop on Friday-to-Saturday, when horrors drop 25% at most. This suggests that the film might be more fan-driven than expected.\n\nAccording to Sony, 61% of the audience was male. Horror usually leans young, but that's not the case here; only 25% of the audience was 25 and under. They gave it a solid \"B\" on CinemaScore, which is not bad for a horror film. There's some online chatter about the film's ending, which drew some polarized reactions. With ***M3GAN 2.0*** and ***I Know What You Did Last Summer*** on the way, perhaps the film won't hold very well. But it should still have enough gas to hit $75 million domestically. And now it's all up to ***The Bone Temple*** to keep this winning streak in January.\n\nDebuting in third place, Disney/Pixar's ***Elio*** flopped with a very terrible $20.8 million in 3,750 theaters. This is the absolute worst debut in Pixar's history, far below both ***Elemental*** and the original ***Toy Story*** (both at $29 million). And this is all unadjusted, which makes it even worse!\n\nThe road to ***Elio*** was always going to be tricky. In the past few years, there have been a lot of sci-fi animated films that failed to find success at the box office: ***Lightyear***, ***Strange World*** and ***Transformers One***. It doesn't help when it's a non-IP film, as those films have been struggling to gain traction in the post-COVID climate (***Sinners*** is a big exception, not the rule). And with a $150 million, it's safe to deem this as a flop.\n\nWhat didn't help ***Elio*** was its delays. This film was supposed to come out in March 2024, but it was delayed to this current date. And in the full year, the film's concept was retooled, which is why you see a big difference from the original teaser to the most recent trailers. But by delaying the film, perhaps the audience lost interest in the film. If they were gonna spend money at theaters, they probably would go for a more familiar IP. In this case, releasing it the week after ***How to Train Your Dragon*** was a death sentence. And the marketing just wasn't really efficient; it couldn't overcome the \"been there, done that\" feeling from other films. Even with some good reviews (83% on RT), it simply failed to grab audiences.\n\nAccording to Disney, 59% of the audience was male. In an interesting stat, 39% of the audience was 12 and under, a skew far younger than usual for Pixar (last year, ***Inside Out*** had 20% at 12 and under).\n\nOkay, so it's a bad debut. But not everything is hopeless. Audiences gave ***Elio*** a strong \"A\" on CinemaScore, which could bode well for legs. ***Elemental*** opened with a poor $29 million, but strong word of mouth allowed it to reach $154 million domestically. It remains to be seen if ***Elio*** can have strong legs; the only animated competition is ***Smurfs*** in mid July. But even if it had ***Elemental***'s legs, that would still be just $108 million domestically. Barring a miracle, ***Elio*** is pretty much guaranteed to become Pixar's lowest grossing film at the domestic box office (***Onward*** technically made $60 million, but it had to close early due to COVID shutdowns, so it doesn't really count). What will Pixar do now?\n\nAfter its rough drops for the past weeks, ***Lilo &amp; Stitch*** appears to be stabilizing. It dipped 38%, adding $9.7 million. That takes its domestic total to $386.7 million, and it's on course to finish with around $415 million domestically.\n\nIn fifth place, ***Mission: Impossible – The Final Reckoning*** dipped 39% and grossed $6.4 million. With $178.2 million domestically, it has surpassed the domestic lifetime of ***Dead Reckoning*** ($172 million). It will finish with over $190 million, but the $200 million dream is dead.\n\nIn sixth place, A24's ***Materialists*** added $5.8 million this weekend. That's a 49% drop, which is quite solid, considering its weak \"B–\" on CinemaScore suggested it could face some problems. Through 10 days, the film has amassed $23.2 million, and it should close with almost $35 million domestically.\n\n***Karate Kid: Legends*** is on its way out of theaters. It dropped 55%, earning just $2.3 million. The film has earned a disappointing $49.3 million so far.\n\n***Ballerina*** is also nearing the end of its run in theaters. It dropped 54% this weekend, earning $4.5 million. The film has made $51 million, and it's set to become the least attended film in the series.\n\nIn ninth place, ***Final Destination: Bloodlines*** dropped 53%, adding $1.8 million. The film has earned $134.8 million so far.\n\nRounding out the Top 10 was the Indian film ***Kuberaa***, which managed to earn $1.7 million in 500 theaters.\n\nIt doesn't look like Neon's ***The Life of Chuck*** will last much more longer in theaters, not only after its weak debut but also its weak second weekend drop. The film dropped a poor 57%, earning just $1 million. Through 10 days in wide release, the film has made just $4.6 million domestically. If you want to check this film out, you better do it as soon as possible, cause it's about to disappear.\n\n#**OVERSEAS**\n\n***How to Train Your Dragon*** led the overseas box office with $53.6 million, for a $357.7 million worldwide total. The film's best markets are Mexico ($24.5M), China ($23.2M), UK ($16.8M), Brazil ($12.6M) and Korea ($9.6M). Easily set for over $600 million worldwide.\n\n***28 Years Later*** also had a good start outside America. It earned $30 million overseas for a $60 million worldwide debut. It had pretty good debuts in the UK ($6.4M) and Mexico ($2.7M), followed by more modest starts in Australia ($1.7M), Korea ($1.5M), Germany ($1.3M), France ($1.3M) and Spain ($1.2M). Let's see how it holds in the coming weeks.\n\n***Lilo &amp; Stitch*** added $19.7 million overseas, for a $910 million worldwide total. Its best markets are Mexico ($64.2M), UK ($46.3M), France ($37.1M), Brazil ($34.5M) and Germany ($29M).\n\nYou thought the domestic numbers for ***Elio*** were depressing? Wait till you see the worldwide numbers. It debuted with an abysmal $14 million overseas, for a poor $34.8 million worldwide debut. It had very weak debuts in South Korea ($1.8M), Mexico ($1.4M), France ($1.3M), UK ($1.2M) and Italy ($800K). In most of these markets, it lost to ***28 Years Later*** and posted the worst Pixar debut as well. There's still a few markets left, but this is still a very horrible way to kick off its run. The film needs over $350 million just to recoup its investment, which means it must do over 10 times this weekend's performance to get there. Unless a miracle happens, it's a flop.\n\n***Mission: Impossible – The Final Reckoning*** added $12.8 million overseas, taking its worldwide total to $540.7 million. The best markets are China ($60.6M), UK ($32.9M), Japan ($30.2M), Korea ($22.5M) and France ($21.8M). \n\nWith $49.7 million overseas, ***Ballerina*** has now crossed $100 million. But that's still nowhere close to being considered a remotely passable number.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nNone.\n\n#**THIS WEEKEND**\n\nWe've got two wide releases, but one is clearly going for the #1 finish.\n\nAnd that's Warner Bros./Apple's ***F1***, which stars Brad Pitt as a F1 driver who comes out of retirement to mentor a new prodigy. Formula One is incredibly popular in Europe, and its popularity has also picked up some steam in America thanks to the Netflix documentary series ***Drive to Survive***. Apple hasn't had much luck with their theatrical releases so far, and currently, ***F1*** is their only theatrical project lined up (***Highest 2 Lowest*** technically is going into theaters but it's a 2-week limited release, so it hardly counts). The project cost $200 million (not the $300 million figure everyone talked about months ago) and both Apple and WB have pulled a very extensive marketing campaign. Surely the foreign markets will be strong, but America also needs to show up. Will this be Apple's first hit at the box office?\n\nThe other release is Universal/Blumhouse's ***M3GAN 2.0***, the sequel to the 2023 phenomenon. Instead of taking the similar route that horror sequels have pulled (the exact same premise), the sequel chose to go bonkers instead. Instead of doing another \"AI doll who kills people\", the film is going the full \"AI doll vs. AI doll\" angle and accepting how stupid and ridiculous this situation is. But is that an advantage or will it be its biggest weakness?\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 179,
        "comments": 104,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5SYTk-PS006ghyA39in3S_PEFGRvPjRD0nyBsaeUqaQ.png?auto=webp&amp;s=1c22b28181bf5b903feb86422dbe4c953eb7f9e7"
        },
        "permalink": "/r/movies/comments/1litmsa/june_2022_box_office_recap_how_to_train_your/"
    },
    {
        "id": "1lj91jl",
        "author": "Saltan_Pepper1",
        "title": "Edge of tommorow",
        "content": "Guys, I just watched this yesterday and it was so good!!\n\nAre there any similar movies or preferably tv shows like it?\n \nReally liked the regression mixed with the fighting aliens, was a really good blend. I have watched similar movies but this one is definitely my favourite of the lot.\n\nAll recommendations are appreciated!!",
        "upvotes": 13,
        "comments": 58,
        "media": null,
        "permalink": "/r/movies/comments/1lj91jl/edge_of_tommorow/"
    },
    {
        "id": "1ljfir7",
        "author": "Darkscifious",
        "title": "What are you hoping for out of the live action legend of Zelda movie?",
        "content": "I’m fairly passionate about this series, so here are my thoughts for those that are interested 🗡️ \n\nThe Legend of Zelda might be our next Lord of the Rings blockbuster. I hope they are taking this seriously.\n\nNintendo is about to gamble with their best shot at movie glory. With their impressive game catalogue, no series is better suited for a blockbuster trilogy than The Legend of Zelda. Movie fans love adventures in new Worlds.\n\nThere is only one road to getting this right, and that is the Ocarina of Time. Of all Zelda games, this has the best story, and that is not even debatable. The game is currently sitting on top of almost every best of all time gaming lists ever made. \n\nThe roadmap for success is written and proven, the filmmakers and writers must build upon it. The story has to be about Link coming of age and saving Hyrule. If this movie doesn’t open in the most aesthetically pleasing forest village ever shown on the big screen, then it is an immediate fail.\n\nThe key to the success of this movie is that Link must go it alone. There cannot be supporting characters journeying with him. No Fellowship. He can seek out support in the villages and realms he adventures too, but no character can be his sidekick or companion, save one, Navi. Navi is key to this shows success. She must do the bulk of the speaking, and if I had my way, Link would never utter a single word.\n\nThe movies must have these main components; Link meeting and then saving Princess Zelda, Hyrule Castle, the quest for the master sword, the Ocarina and all of its wonderful music, The Great Deku Tree, Forest Temple, Gordon City, Zora’s Domain, Gerudo Valley, Temple of Time, Shadow/spirit realm leading into Ganon’s Castle, and of course, Epona.\n\nThe story must start with young Link who is set upon an adventure by the Great Deku tree, which eventually turns into adult link saving Hyrule. Navi should not be in every frame with Link, but called upon when needed. No supporting character should be around any longer than needed. I can’t stress this enough, this must be a movie about Link. Link always has to be moving, exploring all of Hyrule while learning his craft and gaining the tools necessary to defeat Ganon.\n\nThis show needs to be very expensive, the world and its music has to be the star of the show. Nintendo has created one of the greatest fantasy realms with Hyrule, and that can’t be underscored enough. Every single musical score must be built around OoT’s Soundtrack.\n\nThis movie has to be filled with horror at every turn (albeit, PG-13 horror), the monster designs in OoT are excellent. Link is the butcher of evil, the John Wick of Hyrule, he must be constantly under attack and defeating enemies, while simultaneously being Indiana Jones and solving the puzzles to do so, with one goal in mind, saving Zelda.\n\nI cannot stress this next point enough, this movie cannot carry the stresses of our real world. Not one thought should go towards how to make this movie accessible for all people. Absolutely non of humanity’s current sociocultural wars can be reflected in these movies. The filmmakers have to use the game as its only reference point. It has to look and feel like OoT in every way possible, including the vast amount of weirdness. The LotR trilogy was successful for that reason. It was made with the story as its guide, nothing else.\n\nIf Nintendo’s goals are anything less than a LotR sized trilogy, and if the filmmakers have anything less than the love of Peter Jackson, then they will have forsaken all of us fans, and will damn these movies to the realm of the Super Mario Bros movie hell.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1ljfir7/what_are_you_hoping_for_out_of_the_live_action/"
    }
]