[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 14,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oe1sq9",
        "author": "dommimommyy",
        "title": "The Perfect Neighbor",
        "content": "After a quick search I see this documentary has been talked about quite a bit here, but the one thing I haven’t seen mentioned is the fact the documentary is almost entirely filmed on police body cam.\n\nI personally found this fascinating as someone who enjoys seeing live clips, police interviews, especially when tied into a documentary.  (For me it adds an extra layer of “realness” to the documentary.)\n\nI wonder if we will see more true crime documentaries filmed this way with the advancements of technology and body cam footage etc. I think the documentary was beautiful put together and even with majority of the documentary being on body cam footage, it still told a very clear story.\n\nCurious to know anyone’s thoughts on this? Did you think the body cam footage made things “too real”? Invasion of privacy? Would you like to see more true crime documentaries that include police body cam footage etc?\n\nTIA! 💋",
        "upvotes": 368,
        "comments": 349,
        "media": null,
        "permalink": "/r/netflix/comments/1oe1sq9/the_perfect_neighbor/"
    },
    {
        "id": "1oej5kn",
        "author": "Ember_Grove20",
        "title": "Which Netflix series or movie do you think deserves a sequel?",
        "content": "Ever finish something on Netflix and feel like it ended too soon? Some stories just have so much more to give. Which series or movie do you think deserves a proper sequel?",
        "upvotes": 29,
        "comments": 149,
        "media": null,
        "permalink": "/r/netflix/comments/1oej5kn/which_netflix_series_or_movie_do_you_think/"
    },
    {
        "id": "1oebdgs",
        "author": "Fifi343434",
        "title": "The Perfect Neighbor - Can someone help me understand why she didn't move?",
        "content": "In the doc, it says Susan was going to move but then didn't.  I know she was widow and not to be judgemental but the homes seemed like section 8 perhaps?  Not big, only a few doors and no property.  But is there a reason Susan didn't just move rather than let this continue on for 3 years? Why not move, invest in a white noise machine, go to therapy rather than let this eat at you?",
        "upvotes": 58,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1oebdgs/the_perfect_neighbor_can_someone_help_me/"
    },
    {
        "id": "1oen44j",
        "author": "gailthesnail2",
        "title": "The Perfect Neighbor - Lorincz’s lone supporter in court, her sister, charged with felony child neglect",
        "content": "I’m assuming this was the boy seen in the documentary. I was wondering how anyone could show up after the shooting to help this woman. They’re both narcissistic and antisocial with no regard for others, particularly children. ",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oen44j/the_perfect_neighbor_lorinczs_lone_supporter_in/"
    },
    {
        "id": "1oergog",
        "author": "livingamoment",
        "title": "What Queen Charlotte Taught Me About Happiness",
        "content": "The other night, I started watching Queen Charlotte: A Bridgerton Story on Netflix.\n\nI wasn’t expecting much-- just another royal drama filled with silks, chandeliers, and scandal.\n\nBut one scene caught me off guard.\n\nLady Danbury sends out an invitation for the first ball of the season. Another Lady-- I forget her name -- becomes visibly agitated that the honour had been “snatched” from her.\n\nIt was such a simple moment, yet it reminded me something.\n\nHere were people surrounded by unimaginable wealth and luxury -- yet burning with the same insecurities and jealousies that haunt us all.\n\nThe King and Queen, for all their power, suffer in their own ways.\n\nThe Lords and Ladies suffer for attention, for prestige, for a sense of being seen.\n\nAnd suddenly, it reminded me-- this isn’t just their story. It’s ours.\n\nWe chase new jobs, new relationships, new milestones, believing each next thing will finally make us happy. But it never really does. It’s the same script, just in modern clothes.\n\nThat night, I remembered something Sadhguru once said: If you have tried every possible way to fulfill yourself, and you have realized that nothing really works, it means you have come to the point: ‘And now, Yoga.’\n\nIt took me years to understand this. Growing up, I was brainwashed to be in constant pursuit of happiness. But Yoga showed me something different. It turned my gaze inward and revealed that what I was chasing was never missing-- it was just within.\n\n\n\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oergog/what_queen_charlotte_taught_me_about_happiness/"
    },
    {
        "id": "1oelz5y",
        "author": "honeywormss",
        "title": "The Perfect Neighbor what happened with the tow truck?",
        "content": "Was she trying to break her car out of the impound lot? I didn't quite catch what was going on. Did she sneak into the lot and was trying to break down the gate to get out? ",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oelz5y/the_perfect_neighbor_what_happened_with_the_tow/"
    },
    {
        "id": "1oej3br",
        "author": "Soft_Significance718",
        "title": "Nobody [EVERYBODY] Wants This",
        "content": "How did I not know that it was coming back today?! I had no warning! No time to prepare myself and clear my schedule for an evening to watch it in one night!\n\nI really love this show. Unfortunately, I watched the first season with my best friend of 20 years, who passed away unexpectedly last December at 35 years old, so this season is going to hurt. But it will also make me happy to remember our time watching it together and laughing together.\n\nAnyways, welcome back, Joanne and Noah!",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oej3br/nobody_everybody_wants_this/"
    },
    {
        "id": "1oej32s",
        "author": "JPTOT",
        "title": "The Perfect Neighbor needs its own subreddit!",
        "content": "So much to discuss, so many questions, and there's a million threads about it in various subreddits. We need one single place to discuss this insanely captivating (and heartbreaking) documentary!",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oej32s/the_perfect_neighbor_needs_its_own_subreddit/"
    },
    {
        "id": "1oerjvn",
        "author": "fireflame999",
        "title": "How to change to old format?",
        "content": "I use the Fire stick to access Netflix. \n\nIs there any way to switch it back to the old formatting? I hate the new one they have now. It’s so irritating and is drives me mad every time I try to find a show to watch.\n\nIf anyone could tell me step by step how to change it back, I’d be ever grateful!\n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oerjvn/how_to_change_to_old_format/"
    },
    {
        "id": "1oegk5j",
        "author": "StockCaterpillar7303",
        "title": "What to watch with my kid like stranger things",
        "content": "He’s 8. Stranger things was perfect because it’s not just constant sex scenes like almost everything else I try to put on. But we finished stranger things. \n\nWhat else could we watch together, we kinda like spooky vibes. ",
        "upvotes": 9,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1oegk5j/what_to_watch_with_my_kid_like_stranger_things/"
    },
    {
        "id": "1oerr7y",
        "author": "DaftVapour",
        "title": "Mobile App refused service",
        "content": "Hi, I usually watch Netflix on my sky puck but occasionally use my phone, usually in bed when I’m having trouble sleeping.\n Last night was one of those nights. I hadn’t used the mobile app for a few weeks so wasn’t that surprised when it prompted me to log in, but when I submitted my details it told me my phone wasn’t on my list of approved household devices and only gave me the option to use it temporarily for 14 days. My account wasn’t being used on any other devices at the time.\n Does anyone know how I can continue to use my phone after the 14 days is up? I thought I could use as many devices as I want, provided I only use one at a time. My phone is only the second device being used at it is and apparently they don’t even want me using that.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oerr7y/mobile_app_refused_service/"
    },
    {
        "id": "1oergf1",
        "author": "petalpower678",
        "title": "Bro can they just get a gun",
        "content": "Black rabbit is pissing me off so much. It’s good of course the acting is incredible but the amount of times they’ve had a gun pulled on them you’d think they’d finally get one! Sorry had to get this off my chest",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oergf1/bro_can_they_just_get_a_gun/"
    },
    {
        "id": "1oemqib",
        "author": "bonitaycoqueta",
        "title": "“The Monster of Florence”",
        "content": "I'm halfway through and thoroughly enjoying it. The cinematography, acting, and directing are all great. Additionally, it's a great opportunity to practice my Italian 🤓 I highly recommend it.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oemqib/the_monster_of_florence/"
    },
    {
        "id": "1oejjd8",
        "author": "Kryds",
        "title": "Please explain this.",
        "content": "Why did Inside job get canceled after two great seasons, when the Big mouth embarrassment has eight seasons and a spin-off?\n\nIt just doesn't make sense.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oejjd8/please_explain_this/"
    },
    {
        "id": "1oejcr1",
        "author": "wh1tef3rrari",
        "title": "Netflix barely works on my ipad",
        "content": "Whenever I log onto netflix on my ipad, i’m logged out. No matter what, I’m always logged out. Irritating but whatever, I just log back in but it doesn’t work. I will do it three, four five times yet every time it acts as if it’s logging me in then immediately takes me to the login home page again. Sometimes i’ll swipe out the app and come back and i’m logged in, but it never lasts. Also, if I manage to get in i can only watch one episode of a show. When the episode ends it won’t automatically go to the next episode, it’ll say some error code and when I click on it, it says that error code as well. Then I try something else and the error code is there too. I swipe netflix out, and I’m logged out yet this time it won’t log me in regardless no matter what, I have to wait a couple hours or for me usually the next day. Is this common? Thanks. This has never happened in my ipad ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oejcr1/netflix_barely_works_on_my_ipad/"
    },
    {
        "id": "1oedrs1",
        "author": "futureman45",
        "title": "Fauda. Not sure why I’m watching this show. Time to cut bait.",
        "content": "First this is a terrible series but even worse is the translation to English compared to closed captioning.  For example. The mossad agent says, “I promise you we will get him back”. However closed captioning says, “By hook or by crook”\n\nwtf. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oedrs1/fauda_not_sure_why_im_watching_this_show_time_to/"
    },
    {
        "id": "1odbsqb",
        "author": "Warm-Barracuda3302",
        "title": "‘I’ve been in tears’: Ajike Owens’ cousin opens up after ‘reliving’ her death in Netflix doc",
        "content": "",
        "upvotes": 752,
        "comments": 138,
        "media": null,
        "permalink": "/r/netflix/comments/1odbsqb/ive_been_in_tears_ajike_owens_cousin_opens_up/"
    },
    {
        "id": "1oeg8vl",
        "author": "Spirited_Method9859",
        "title": "Teen Recommendations",
        "content": "I am bored and figured there may be something good on Netflix. Any recommendations for teens? And no horror please and preferably not too many sexual scenes. Perfectly fine with kissing and whatever but just, you know, at a moderate level.",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1oeg8vl/teen_recommendations/"
    },
    {
        "id": "1oeojbg",
        "author": "Diligent-Purchase-26",
        "title": "The Diplomat",
        "content": "I just finished Season 3 of “The Diplomat”. I was a huge fan of Seasons 1&amp;2 so was really looking forward to seeing it!! Here’s my two cents…a total flop 👎🏻.\n\nThe best part of the whole season was the 5 minutes dedicated to addressing her terrible hair. That made me laugh. \n\nI loved Hal’s character in S1&amp;2, his quirkiness and the way he was annoying was almost charming but this season it was just ridiculous. Alison Janney was perfection as usual. The rest of it? Mediocre at best.\n\nDid you watch it? What did you think? Are you excited for Season 4 that has already begun filming? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oeojbg/the_diplomat/"
    },
    {
        "id": "1oeekfz",
        "author": "GoldDerby",
        "title": "Guillermo del Toro’s ‘Frankenstein’ rises double-digits in Best Picture Oscar odds, now in Top 10:",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oeekfz/guillermo_del_toros_frankenstein_rises/"
    },
    {
        "id": "1oeiu5b",
        "author": "dumbIecunt",
        "title": "Looking for series/documentary recommendations that work your brain!",
        "content": "My Octopus Teacher and The Social Dilemma are two examples of things I'm interested in that are already on my list. I'm in the middle of watching Mindhunter and its one of the best things I've personally watched. Also The OA is my top series of all time.\n\nI also very much enjoy true crime when done respectfully: I watched The Perfect Neighbour but it wasn't my thing, watched Dont F With Cats and some other stuff but I don't want JUST true crime recommendations - I'm just looking for any intriguing thing to watch that are hopefully somewhat based in reality.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oeiu5b/looking_for_seriesdocumentary_recommendations/"
    },
    {
        "id": "1odqs4u",
        "author": "michelob81",
        "title": "I am a killer",
        "content": "Just watched this delightful little show. It's basically Netflix interviewers going into prisons and letting scumbag murderers run their mouths. I think we're supposed to question if these evil cretins are somehow the victims in their horrific acts. I've an idea for the next season. Don't go anywhere near the prisons and let these people rot.",
        "upvotes": 55,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1odqs4u/i_am_a_killer/"
    },
    {
        "id": "1oei14l",
        "author": "schi__zoid",
        "title": "The Monster of Florence",
        "content": "Whoever he was, he should have been called the BASTARD of Florence. \n\nI hadn't heard about the real case before watching the show, but just the endless speculations, the twisted theories and the inability to actually say who was behind it all were very disorienting.\n\nI also feel so sad for Natalino :( the image of a small boy wandering alone in the night after such horror was SO haunting..\n\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oei14l/the_monster_of_florence/"
    },
    {
        "id": "1odk4j9",
        "author": "Lateralus46N2",
        "title": "The Perfect Neighbor Unseen Bodycam Not Shown in Doc",
        "content": "Like many of you, I'd fallen down the Susan Lorincz rabbit hole since watching the documentary. I had thought I'd seen most key pieces by now and had moved on to other things when this video popped up in my suggestions. It begins with Bodycam footage not included in the movie or the trial. It shows the neighborhood and police discussions in the immediate aftermath, as well as other footage from that night woven throughout that I haven't seen elsewhere. I thought some of you may find it interesting.  https://youtu.be/lYXD9SMCa-w?si=k3Zi0efuzmhFAxjh\n\nFor those just starting down the rabbit hole: \n\nRecent interview from prison \n\nhttps://youtu.be/V5-DIGPi_dU?si=DPZbUg5M2dhTuD7w\nHere are the full interrogation videos post shooting \n\nInterview 1 \nhttps://youtu.be/puQmH_d8yVw?si=YxWmWv-fCoGlTBax\n\nInterview 2\n\nhttps://youtu.be/lZ74O5qxI0w?si=3IurVUXKQjU0f2vr\n\nFor those who haven't seen the trial, I will post those links as well. There was some pretty important evidence that I wish had been included in trial. She is actually am even bigger monster than what we saw in the movie. Note: Trial videos are about half as long as advertised as there is a lot of dead space to fast forward through such as when the court breaks for recesses \n\nDay 1\nhttps://www.youtube.com/live/ygm__xISYAM?si=xT2Di6bgMw_Gxe4L\n\nDay 2 (State Rests)\nhttps://www.youtube.com/live/kJKQqjVfvnE?si=_nApwK5qtP2nafJt\n\nDay 3\nhttps://www.youtube.com/live/SN8lCIq7ivM?si=EbRML6cWwHN1xTdk\n\nDay 4 (closing arguments)\nhttps://www.youtube.com/live/EA_K8tmog4o?si=5jDc92HXULnin0W4\n\nSentencing \nhttps://youtu.be/9dHWMI2HEyw?si=GoiRNU2VUwymxzs1\n\n",
        "upvotes": 122,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1odk4j9/the_perfect_neighbor_unseen_bodycam_not_shown_in/"
    },
    {
        "id": "1oee3ft",
        "author": "Consistent_Papaya871",
        "title": "Sharing accounts abroad",
        "content": "So I am payer for the family plan and live in South East Asia and my other siblings in in Japan and Korea, if we wanted to share the account do I just log into their profiles once a month and watch something for a few seconds to keep them registered in my household?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oee3ft/sharing_accounts_abroad/"
    },
    {
        "id": "1oedunu",
        "author": "Icy-Accountant8810",
        "title": "I need movie recomendations",
        "content": "I need a movie in the croatian netlfix thats good humor action allaround good charachters i like dwayne kevin heart ryan reynolds it doesnt have to be them it could be anyone just a movie thats good",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oedunu/i_need_movie_recomendations/"
    },
    {
        "id": "1oe6whm",
        "author": "Turbulent_Arrival_55",
        "title": "Need some films/series recommendations",
        "content": "So thing is I enjoy films that contain modern vibes, involves psychology aspects (like Alice in Borderland for example) that also contains a cool side character (kinda like Chishiya for example in AIB). I just enjoy films that involve \"thinking\", involve planning strategic and stuff like that (for example: Money Heist). A bit of fighting aspects are also additional points too (kinda like Bloodhounds or Weak Hero)\n\n\nI'm looking for people with the same interests and give me some recommendations with films that sorta have the same background since I don't know much films with the same vibes lol.\n\nThank you so much!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oe6whm/need_some_filmsseries_recommendations/"
    },
    {
        "id": "1oebnhh",
        "author": "ToonAdventure",
        "title": "ramyeon 🤝 golden… COOKIE! | KPop Demon Hunters is now playing on Netflix!",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oebnhh/ramyeon_golden_cookie_kpop_demon_hunters_is_now/"
    }
]