[
    {
        "id": "1jucgre",
        "author": "WarfareA24",
        "title": "Hey /r/movies! We're Ray Mendoza and Alex Garland, co-directors of A24's upcoming WARFARE. Alex has also directed EX MACHINA, ANNIHILATION, MEN, and CIVIL WAR. WARFARE stars Joseph Quinn, Will Poulter, Charles Melton, Kit Connor, Cosmo Jarvis, Michael Gandolfini and more. Ask us anything!",
        "content": "",
        "upvotes": 144,
        "comments": 235,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7ljbfe7qulte1.png?auto=webp&amp;s=43431f53455ea22b13d63191f8dafb02bd992516"
        },
        "permalink": "/r/movies/comments/1jucgre/hey_rmovies_were_ray_mendoza_and_alex_garland/"
    },
    {
        "id": "1jtuf9y",
        "author": "UniversalLanguageAMA",
        "title": "Hi /r/movies - I'm Matthew Rankin, director of UNIVERSAL LANGUAGE, along with my two co-writers and producer (Ila, Perouz, and Sylvain). Our film won the Audience Award at Cannes, and was shortlisted for the International Oscar nomination (representing Canada). Ask us anything!",
        "content": "",
        "upvotes": 66,
        "comments": 66,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1ltluqqnvgte1.png?auto=webp&amp;s=4a8074db80d9d78950503d906a27b945b8b7fc5e"
        },
        "permalink": "/r/movies/comments/1jtuf9y/hi_rmovies_im_matthew_rankin_director_of/"
    },
    {
        "id": "1jun0g8",
        "author": "MarvelsGrantMan136",
        "title": "‘Dune 3’: Legendary Circling Robert Pattinson For New Role In Upcoming Installment",
        "content": "",
        "upvotes": 5909,
        "comments": 497,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pqt49XFIURhiWVErbbjR3n2cxWa-ugcPE8MATlkwAnM.jpg?auto=webp&amp;s=7dcb190f45a3c8df56dea65c27adc3c7abb88068"
        },
        "permalink": "/r/movies/comments/1jun0g8/dune_3_legendary_circling_robert_pattinson_for/"
    },
    {
        "id": "1jue18p",
        "author": "harlotstoast",
        "title": "China Mulling Ban on Hollywood Film Releases in Response to Trump Tariffs (Report)",
        "content": "",
        "upvotes": 15491,
        "comments": 1101,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AFnHGmr4CJ_4QBDCOKGua6QJ0IJ2OSAWgzW-hlGjEok.jpg?auto=webp&amp;s=b29907b080d14c2b2f8379fde57c68b7f6158400"
        },
        "permalink": "/r/movies/comments/1jue18p/china_mulling_ban_on_hollywood_film_releases_in/"
    },
    {
        "id": "1jutx3h",
        "author": "BunchLegitimate8675",
        "title": "Original Stock Photo Used in ‘The Shining’ Ending Discovered",
        "content": "",
        "upvotes": 1218,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5tHE-ogitdkwTGBT7loXSU0HhSZEL4ikRh1wZ9pJ1Rg.jpg?auto=webp&amp;s=943a90b7ece01e240d8d65917d8b45c8b8cf8677"
        },
        "permalink": "/r/movies/comments/1jutx3h/original_stock_photo_used_in_the_shining_ending/"
    },
    {
        "id": "1juh4zk",
        "author": "MarvelsGrantMan136",
        "title": "Predator: Killer of Killers | First-Look | Hulu",
        "content": "",
        "upvotes": 3505,
        "comments": 558,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1t9Jyo0LBziZ3aHtlsTAFGL-qDR-6W8Hbd1CBOUt5lc.jpg?auto=webp&amp;s=a1bf49ed255c4ff42aee922ebf528f6cbb69fe17"
        },
        "permalink": "/r/movies/comments/1juh4zk/predator_killer_of_killers_firstlook_hulu/"
    },
    {
        "id": "1juswsc",
        "author": "Flyboy_1978",
        "title": "The T-Rex in Jurassic Park is the Greatest Special Effect Ever - And I'm not Talking About the CGI One",
        "content": "So, *Jurassic Park* is a very important movie to me. I'm in my early thirties, and I've grown up watching this movie, as well as it's first two sequels (I'm admittedly not a fan of the *World* sequels). I've seen it more than any other movie by far, and it never ceases to amaze me. When I was a kid in the 90's, entering the Jurassic Park section at Universal Studios in Florida was a magical experience as they perfectly re-captured the feeling of entering the park from the movie. The music still gives me goosebumps every time I hear it. My favorite dinosaur? It's got to be the T-Rex. And I truly believe it's the greatest special effect that was ever in a movie, or ever will be. And I'm not talking about the CGI one - despite being a ground breaking achievement, it doesn't hold a candle to the life sized animatronic Stan Winston Studios created for the movie.\n\nUnfortunately, over the years, I feel like the life sized animatronic T-Rex has been overshadowed by the CGI one. Sure, it a huge step in a totally new form of digital effects. And sure, 30 years later and it still manages to hold up due to Spielberg's restraint and cleaver usage of the medium. But having an actual 30 foot tall [T-Rex sized robot that looks and moves as realistic](https://www.youtube.com/watch?v=fFTsYGgdR9k&amp;t=59s) as it did is just jaw dropping. I'm currently watching the Industrial Light &amp; Magic docuseries on Disney+ and they, along with everyone else in other similar videos discussing the cultural impact of the film, always highlight the CGI effects and don't seem to spend as much time discussing how incredible the practical effects were. \n\nDuring quarantine, I was lucky enough to interview Stan Winston's son Matthew Winston regarding his father's legacy. He told me how he was present on set for multiple movies his father worked on, and got to be up close and personal with Aliens, Predators, Terminators, Pumpkinheads and everything in between, but nothing was as incredible and surrealistic as seeing the T-Rex in all it's glory. I could only imagine how mystifying that would have been.\n\nThey went even bigger with *The Lost World* by having two T-Rexes. Say what you will about that movie, but they absolutely devoured every scene they were in (sharing a bite with each other is one of the coolest deaths in the series). While the third movie continued the practical dinos, the modern trilogy either seemed to lean fully into CGI (which is already dated) or used practical effects that were somehow less effective than ones used decades prior. \n\nHow do you feel about the dinosaurs in Jurassic Park? Have they left a huge impression on you? Do you think any special effect has come close? I personally think Gollum in LOTR would be the most noteworthy, and I also think the practical effects, costumes, set design, etc in that trilogy is phenomenal as well. ",
        "upvotes": 490,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TIGjLOY57eXHgcfbE5VoWUXTO-acEcnygFzhKOakn2o.jpg?auto=webp&amp;s=2c7dc79559ceb211893c179711657e3861197007"
        },
        "permalink": "/r/movies/comments/1juswsc/the_trex_in_jurassic_park_is_the_greatest_special/"
    },
    {
        "id": "1juj03i",
        "author": "JonasKahnwald11",
        "title": "First image of Sydney Sweeney, Paul Walter Hauser and Halsey from 'Americana'",
        "content": "",
        "upvotes": 1730,
        "comments": 253,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g0o73hyl9nte1.jpeg?auto=webp&amp;s=3cda55d11037f63718d5a5750946807dd3f1e4ef"
        },
        "permalink": "/r/movies/comments/1juj03i/first_image_of_sydney_sweeney_paul_walter_hauser/"
    },
    {
        "id": "1juh685",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Dan Trachtenberg's 'Predator: Killer of Killers'",
        "content": "",
        "upvotes": 1427,
        "comments": 82,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n0o1v1bfwmte1.jpeg?auto=webp&amp;s=87d176955687574cf578815512608e9095d3c5a0"
        },
        "permalink": "/r/movies/comments/1juh685/official_poster_for_dan_trachtenbergs_predator/"
    },
    {
        "id": "1jui7yk",
        "author": "lawrencedun2002",
        "title": "New image at Jenna Ortega in Trey Edward Schults’ ‘Hurry Up Tomorrow.’ In theaters May 16.",
        "content": "",
        "upvotes": 457,
        "comments": 122,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rnt5cbl64nte1.jpeg?auto=webp&amp;s=af44f707fd0f220977976c3a0da76e432b23a820"
        },
        "permalink": "/r/movies/comments/1jui7yk/new_image_at_jenna_ortega_in_trey_edward_schults/"
    },
    {
        "id": "1juh4mn",
        "author": "ChiefLeef22",
        "title": "Hershey Chocolate Movie Set With ‘Mean Girls’ Director, Finn Wittrock and Alexandra Daddario to Star (EXCLUSIVE)",
        "content": "",
        "upvotes": 476,
        "comments": 202,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qI4EZZHVdlN5mcp_w7B-WdB0XZo9lDGADLIGLQ7bfr0.jpg?auto=webp&amp;s=44dc659469ce0a9b67c172c5ddd86bf2eab470c2"
        },
        "permalink": "/r/movies/comments/1juh4mn/hershey_chocolate_movie_set_with_mean_girls/"
    },
    {
        "id": "1juso9u",
        "author": "RevolutionSlow5947",
        "title": "Secretary 2002",
        "content": "I just watched it for the first time and… oh my god. I had to watch it twice because I loved it so much. It wasn’t necessary what they were doing but how they acted it out and I was just stunned at the amount of detail in it. Like when at the beginning the secretary leaving had the note in her mouth, I just felt like it was so well planned out. I forgot her first name but the female lead, something gyllenhaal, was such a good actor and I feel like she represented her character’s mental health struggles so well. Also this movie made me realise how bad my grammar and spelling is because it would take me awhile to realise how she spelt something wrong lol",
        "upvotes": 84,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1juso9u/secretary_2002/"
    },
    {
        "id": "1jud5cw",
        "author": "MarvelsGrantMan136",
        "title": "Tom Cruise’s ‘Mission: Impossible – The Final Reckoning’ Confirmed For Cannes Film Festival Launch",
        "content": "",
        "upvotes": 651,
        "comments": 88,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/R_oh0VmC-gksgP3dWFHq5Hmo3QaivhSLX2vwVZSCsys.jpg?auto=webp&amp;s=c183249a0fd2dc5813f5a7129802e2ae7e284be3"
        },
        "permalink": "/r/movies/comments/1jud5cw/tom_cruises_mission_impossible_the_final/"
    },
    {
        "id": "1jubiw3",
        "author": "MarvelsGrantMan136",
        "title": "Werner Herzog To Receive Venice Film Festival’s Golden Lion For Lifetime Achievement",
        "content": "",
        "upvotes": 760,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xTF0lJjm_B43HXNFFE61-UT5oj8WngLUJaUaKVZ2I28.jpg?auto=webp&amp;s=51b532b1f3c61272d2934a05858c94eea5c78310"
        },
        "permalink": "/r/movies/comments/1jubiw3/werner_herzog_to_receive_venice_film_festivals/"
    },
    {
        "id": "1jubh9c",
        "author": "MaxProwes",
        "title": "I rewatched Eraser (1996) and it might be one of Arnold's last great movies. Action is mostly great, James Caan is a fun villain and movies don't get much better than Arnold shooting with 2 railguns while throwing one-liners. Check it out if you missed it!",
        "content": "",
        "upvotes": 712,
        "comments": 197,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Z43aYPFim5E9X3mJO5ryYpgLwpZukJ7Kqx_Qbf72rmw.jpg?auto=webp&amp;s=551aae7c1b7d8a0c7442b6016079ca97eac7b693"
        },
        "permalink": "/r/movies/comments/1jubh9c/i_rewatched_eraser_1996_and_it_might_be_one_of/"
    },
    {
        "id": "1juhagr",
        "author": "ChiefLeef22",
        "title": "'The Amateur' - Review Thread",
        "content": "*Charlie Heller is a brilliant CIA decoder whose world comes crashing down when his wife dies in a London terrorist attack. When his supervisors refuse to take action, his intelligence becomes the ultimate weapon as he embarks on a dangerous trek across the globe to track down those responsible.*\n\nCast: Rami Malek, Rachel Brosnahan, Laurence Fishburne, Jon Bernthal\n\nRotten Tomatoes: [66%](https://www.rottentomatoes.com/m/the_amateur_2025)\n\nMetacritic: [55/100](https://www.metacritic.com/movie/the-amateur/)\n\nSome Reviews:\n\n[DEADLINE - Pete Hammond](https://deadline.com/2025/04/the-amateur-review-rami-malek-gripping-global-spy-thriller-bourne-for-computer-nerds-1236362892/)\n\n&gt;Production values are top notch, with a shout out to the special effects team for a spectaular set piece involving a pool collapse in Berlin that serves as the highlight of the action sequences. The screenplay by Ken Nolan and Gary Spinelli tries its best to avoid the cliches of the overworked spy genre and manages to help create a worthy character for Malek to run with, maybe not as fast as Jason Bourne, but no less memorable.\n\n[Variety - Owen Gleiberman](https://variety.com/2025/film/reviews/the-amateur-review-rami-malek-1236362272/)\n\n&gt;This is the third thriller that Rami Malek has made since becoming a star in “Bohemian Rhapsody,” and it nudges his tense, twitchy moodiness even closer to the center of his brand. He’s the right actor to play a digital geek turned mindhunter; those eyes of his glare like lasers. Mostly, though, Malek plays out his methodical mission of vengeance as if it were something almost theoretical. The conceit of “The Amateur” — that Charlie must do all this himself — remains, at heart, a conceit. That’s why the movie is okay but never, you know, killer.\n\n[Guardian](https://www.rottentomatoes.com/critics/source/205) \\- [Peter Bradshaw](https://www.rottentomatoes.com/critics/peter-bradshaw) \\- 2/5\n\n&gt;There is a fundamental problem concerning how ruthless Charles is supposed to be in killing his wife’s murderers in cold blood and the final confrontation with the homicidal mastermind involves a very muddled exchange of views.\n\n[The Hollywood Reporter](https://www.rottentomatoes.com/critics/source/213) \\- [David Rooney](https://www.rottentomatoes.com/critics/david-rooney)\n\n&gt;It at least looks and feels like a real movie. That might sound like not much of a distinction. But in this age of assembly-line streaming originals that play like bland knockoffs of a dozen multiplex hits you’ve seen before, it’s not nothing, either.\n\n[IndieWire](https://www.rottentomatoes.com/critics/source/226) \\- [David Ehrlich](https://www.rottentomatoes.com/critics/david-ehrlich) \\- C+\n\n&gt;An aggressively competent spy thriller that has less use for logic than its lead actor does for his smile... the film makes a compelling enough case to sustain itself across the entire television season’s worth of plot that it packs into two hours.\n\n[awakeinthedark - Brent Leuthold](https://awakeinthedark.com/2025/04/the-amateur/) \\- 2.5/5\n\n&gt;*The Amateur* isn’t a bad movie from a technical perspective. Despite some misjudged shaky cam, it’s well-shot and edited in a way that makes its 2-hour runtime move along briskly. It’s just not a film that distinguishes itself enough from other revenge or spy films we’ve seen already. Its release comes just a few weeks after *Black Bag*, already one of the year’s best, which also follows spies chasing spies but does so with much more panache and thematic heft.",
        "upvotes": 274,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6zdM8wVWHiNUck6cMCLLlLKE_bYAhAlzjajnRksrlDw.jpg?auto=webp&amp;s=880c270bd5f96b626165b92087cc57ba193b0921"
        },
        "permalink": "/r/movies/comments/1juhagr/the_amateur_review_thread/"
    },
    {
        "id": "1jum83l",
        "author": "jingowatt",
        "title": "The Last Showgirl was exactly what I was hoping it would be.",
        "content": "I won’t include spoilers because I hope this motivates someone to see it for the first time. The breathy, luminous, despairing aesthetic hits like a tuning fork or a high piano note slightly out of tune. Pamela’s performance is deeply vulnerable—she’s lost in reverie, outrunning darkness by a hair. She’s flawed, likeable, and magnetic. The music is breathtaking, the cinematography makes you feel high, and Dave Bautista and Jamie Lee Curtis are utterly compelling. Loved it.",
        "upvotes": 121,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1jum83l/the_last_showgirl_was_exactly_what_i_was_hoping/"
    },
    {
        "id": "1juiq3p",
        "author": "Sugar_Plum_Mouse",
        "title": "Drop Dead Gorgeous. I understand the cult following now.",
        "content": "I’m not sure why it’s taking me so long to watch this movie, especially considering my age. I get what people see and why it is a cult classic. I mean, there’s so much there to unpack. What a movie! It makes me wonder what other little gems from the late 90s early 2000s I missed along the way! I like things that are off-balance and this movie was off-balance. Great cast!!! ",
        "upvotes": 161,
        "comments": 58,
        "media": null,
        "permalink": "/r/movies/comments/1juiq3p/drop_dead_gorgeous_i_understand_the_cult/"
    },
    {
        "id": "1jun5xn",
        "author": "TheDoctorInHisTardis",
        "title": "Happy Rex Manning Day as we enter the 30th Anniversary of “Empire Records”",
        "content": "It's April 8th once again, and you know what that means: it's Rex Manning Day. \"Empire Records\" released 30 years ago this year. We learned how to say no more mon amour, how to chase down shoplifters, and magic brownies are the fastest way into a Gwar music video.\n\nHas there ever been a more quintessentially '90s movie?",
        "upvotes": 93,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1jun5xn/happy_rex_manning_day_as_we_enter_the_30th/"
    },
    {
        "id": "1juirmg",
        "author": "CinephileCrystal",
        "title": "Kelly LeBrock: The Woman in Red whose career never reached the promising start she got",
        "content": "I like Kelly LeBrock. She had a unique look and when you saw The Woman in Red, you couldn't take your eyes away from her. She emulated Marilyn Monroe but made it her own. Sure, it stretched credibility that she'd ever be interested in grumpy, aging Gene Wilder but that movie was always a male fantasy. \n\nThat's what LeBrock was, a male fantasy. I thought she was a good actress but men were mesmerized by her body and iconic lips. She then did Weird Science, playing a virtual woman, created by two geeks, and that film became a instant cult classic. In the 80s, she was the perfect woman. \n\nSo what happened? Two words: Steven Seagal. She married the famed martial arts movie star, after working together in Hard to Kill, and the troubled marriage lasted 9 years. \n\nShe barely acted but while her film career went up in flames, she did turn to a good cause, helping the Terminally ill by being a spokesperson for Club Carson, a foundation helping children with cancer. \n\nA good woman, her film career didn't rise to the potential she had, but she has used her fame for a worthy cause and this is what matters the most. \n\nAnd she's still stunning.",
        "upvotes": 137,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1juirmg/kelly_lebrock_the_woman_in_red_whose_career_never/"
    },
    {
        "id": "1juoovm",
        "author": "Sad-Platform8923",
        "title": "I'm looking for vampire-themed movies with interesting plots :)",
        "content": "I've recently been working on a project about goth films for[ enjoyment](https://www.youtube.com/watch?v=XMHTjJ0F7m8) / academic research, and a lot of my friends recommended The Lost Boys - I get that it's a cult film, but I'm not a huge fan of the plot - the grandad is amazing in that though!! Are there any vampire-themed films that you love the plot of - I get people are gonna say Blade and stuff, but that's cool....I discovered He Never Died, and thought that was quite interesting, for example - I'm also looking forward to trying Sinners :) but any recommendations would be welcome. Thank you very much!! :)",
        "upvotes": 50,
        "comments": 258,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6IwDbYzo4jrsdRDgCr-HzDJIuWglwXQAcpPpyAe_sKo.jpg?auto=webp&amp;s=ad4b43ed200671dfc8576ad57e9055351dafc710"
        },
        "permalink": "/r/movies/comments/1juoovm/im_looking_for_vampirethemed_movies_with/"
    },
    {
        "id": "1juw2vi",
        "author": "Immediate_Wolf3802",
        "title": "Withnail and I (1987)",
        "content": "I saw Withnail and I just the other night and have since watched it on repeat as its so British, so funny, charming, poetic and yet a Tragic tale of friendship\n\nit didn't realise immediately that it's set in the 60s\n\n2 struggling actors who spend what little they've got on booze and occasionally drugs in their squalid home get the opportunity to spend the weekend with Withnail's uncle Monty out in the country\n\nAnd it just gets funnier and occasionally awkward\n\nRichard E Grant is fantastic in his film debut and totally committed to the role (he genuinely looks terribly ill) in almost every scene\n\nWithnail is a coward while \"I\" really struggles with anxiety and outside the acting circle they'r both pretty much hopeless in life\n\nBut it's a tragic tale as Withnail isn't the one to get his big break as a leading man in some big production it's \"I\" instead\n\nSo Withnail is left reciting poetry to zoo animals in the pouring rain while his friend starts his big adventure in the acting world ...I liked the movie so much but the unexpected ending almost had me filling up with sorrow\n\nChin Chin\n\nWhat are your thoughts on this cult classic as reviews are often split right down the middle  ?\n\nThe Americans may struggle to see what all the fuss is about..but all brits should luvit\n\nSpecial thanks to the quiet Beatle George Harrison who chipped in with a large part of the budget to get this film made\n\n8.5/10",
        "upvotes": 16,
        "comments": 21,
        "media": null,
        "permalink": "/r/movies/comments/1juw2vi/withnail_and_i_1987/"
    },
    {
        "id": "1jumokk",
        "author": "LushCharm91",
        "title": "‘Shogun’ Villain Takehiro Hira Joins ‘Past Lives’ Star Teo Yoo in Unique Action Thriller ‘Karoshi’",
        "content": "",
        "upvotes": 63,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XpJnVOnXKdBAJraDkQ72jDSrseq1CYrEjgHBW_ARPmw.jpg?auto=webp&amp;s=a7399bbfa9162bab22352f47d453f9878ab9c3d2"
        },
        "permalink": "/r/movies/comments/1jumokk/shogun_villain_takehiro_hira_joins_past_lives/"
    },
    {
        "id": "1jug8gf",
        "author": "CinephileCrystal",
        "title": "Does anyone miss Siskel &amp; Ebert, and if yes, who could you see replace them in today's world?",
        "content": "I think Mark Kermode could be the Ebert in a possible duo. He's opininated, he knows how to express his views in a thoughtful and passionate manner, he's got a sense of humor and I could see him debate his co-host on movies they don't share the same opinion on. \n\nThe other one, I would like to see a woman take over, Karina Longworth would be one, but I also think Grace Randolph would be a interesting choice. Kermode, the more art-house loving critic, whereas Randolph, the critic who prefers modern, mainstream movie. And you just know they'd hate each other so there would be loads of tension whenever they'd disagree. \n\nWhat do you think?",
        "upvotes": 117,
        "comments": 173,
        "media": null,
        "permalink": "/r/movies/comments/1jug8gf/does_anyone_miss_siskel_ebert_and_if_yes_who/"
    },
    {
        "id": "1jusx0g",
        "author": "PecansNPies",
        "title": "What’s your favorite title card?",
        "content": "One of my favorite title cards ever is Finding Nemo. It’s such an emotional entry and really makes me feel like I’m going on a journey. \n\nI recently saw Companion, which also had a fun title card. Loved the music to go along with it, felt like I was in for a good time. \n\nHonorable mention to LoTR, loved the separation between title and subtitle ",
        "upvotes": 22,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1jusx0g/whats_your_favorite_title_card/"
    },
    {
        "id": "1jut42q",
        "author": "Bennett1984",
        "title": "Jaws, Dog Day Afternoon, One Flew Over the Cuckoo's Nest &amp; More: Ten Unmissable Classics from 1975",
        "content": "",
        "upvotes": 19,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L3Cd988-YkE9G3oyXT0KwPFS6YBcVVSQFDBuxcKoaTs.jpg?auto=webp&amp;s=c7953270b9edcd1f118cd70f0a3f8669b92220bd"
        },
        "permalink": "/r/movies/comments/1jut42q/jaws_dog_day_afternoon_one_flew_over_the_cuckoos/"
    },
    {
        "id": "1ju10bf",
        "author": "Amaruq93",
        "title": "Disney plans to vacate storied Fox Studio lot in Century City (where classic movies like \"Miracle on 34th Street\" and \"The Sound of Music\" were shot) by year's end",
        "content": "",
        "upvotes": 1505,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zZgi6BKLt9hUpJfFqbK-bY-K5YcpR1U18Du1NyloKZY.jpg?auto=webp&amp;s=e6e664334f3cc97a79f6e70c885094254ffd77d9"
        },
        "permalink": "/r/movies/comments/1ju10bf/disney_plans_to_vacate_storied_fox_studio_lot_in/"
    },
    {
        "id": "1juzrzr",
        "author": "These_Feed_2616",
        "title": "Joaquin Phoenix",
        "content": "Joaquin Phoenix is my favorite actor next to Robert De Niro. This is kind of an appreciation post, I just think the guy is insanely talented and I think he nails every single role. He brings such a raw, intense vibe to his roles and he never phones it in, even in a bad movie, he always gives 10/10 even if the movie isn’t 10/10. I’m an aspiring actor and he’s one of my heroes! Gladiator, Walk The Line, Joker, The Master, 8mm, the guy is absolutely brilliant, and I can’t wait to see his new film Eddington this year!",
        "upvotes": 5,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1juzrzr/joaquin_phoenix/"
    },
    {
        "id": "1judb9c",
        "author": "PyroDigital",
        "title": "The Substance | Visual Effects Breakdown by CGEV",
        "content": "",
        "upvotes": 127,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tk8mRkJfCdt5YoNrB2P1lXYYNwcIlfiYrcNjnb6Geko.jpg?auto=webp&amp;s=528e7501078172b6b2ef5fcd1641cad46a6fdb5d"
        },
        "permalink": "/r/movies/comments/1judb9c/the_substance_visual_effects_breakdown_by_cgev/"
    },
    {
        "id": "1jujbui",
        "author": "NoCulture3505",
        "title": "‘Angry Birds 3’ Lands at Paramount, Sets January 29, 2027 Release",
        "content": "",
        "upvotes": 46,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CvYUSJyffG4hkAiPT0DqcdJEz8oTmTvjO9mkDjWfFrA.jpg?auto=webp&amp;s=f9a9697ca090626f8374b93ea849bf7756fadfde"
        },
        "permalink": "/r/movies/comments/1jujbui/angry_birds_3_lands_at_paramount_sets_january_29/"
    },
    {
        "id": "1jtyamn",
        "author": "SanderSo47",
        "title": "April 4-6 Box Office Recap: 'A Minecraft Movie' massively over-performs, debuting with a colossal $162.7 million domestically. Worldwide, it earned $313.4 million, the second biggest debut for a video game movie.",
        "content": "https://preview.redd.it/3kitircrohte1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=92e79a33892ca9682412307a2d502234da9c8839\n\nAfter some very weak months, the box office finally picked up steam with April.\n\nAnd that's practically all because of ***A Minecraft Movie***, which overcame months of negative buzz to deliver a record opening weekend for a video game adaptation, as well as the biggest debut of the year.\n\nThe Top 10 earned a combined $190.8 million this weekend. That's up a massive 135.3% from last year, when ***Godzilla x Kong: The New Empire*** stayed on top, while ***Monkey Man*** and ***The First Omen*** underwhelmed.\n\nDebuting atop, WB's ***A Minecraft Movie*** surpassed all expectations, earning a colossal $162.7 million in 4,263 theaters. That's even bigger than WB's ***Barbie*** ($162 million), and it's only behind ***Harry Potter and the Deathly Hallows – Part 2*** ($169 million) for the studio's biggest debut. The opening is also higher than the previous video game record, ***The Super Mario Bros. Movie*** ($146 million), although ***Mario*** debuted on a Wednesday and burned off demand.\n\nSimply put, it's a fantastic film. Especially after months of negative buzz surrounding the film's trailers. And a much needed win for WB after a slate of disappointing performers like ***Joker***, ***War of the Rohirrim***, ***Companion*** and ***The Alto Knights***.\n\nBack in September 2024, when the teaser trailer debuted, the film earned poor reception, with many criticizing the VFX. To win over audiences for the other trailers, studio marketing suits added more VFX and quelled rabid fans by conveying that their Minecraft will stay true to the game. But that's perhaps the key; people will talk badly about a product, but that buzz translates into awareness, which builds into curiosity.\n\nOf course, not all negative buzz translates into curiosity (***Snow White*** waving in the distance). But the advantage for this film is simply ***Minecraft***. Despite the belief that the game lost relevance years ago, the stats say otherwise; ***Minecraft*** is the best-selling video game of all time, with over 300 million copies sold and nearly 170 million monthly active players as of 2024. Clearly, there's already an audience awaiting for a film, and they happily paid tickets for this. Even lukewarm reviews (48% on RT) didn't dissuade fans from checking it out.\n\nAccording to Warner Bros., 67% of the audience was male, and 78% was under 25 years old. They gave it a middling \"B+\" on CinemaScore, which is very mediocre for a family film. While word of mouth among children is very positive, adults are less thrilled with the film. We'll see in subsequent weeks how much it drops, but for now, a $450 million domestic total is in the cards for ***A Minecraft Movie***.\n\nLast week's champ ***A Working Man*** added $7.3 million this weekend. That's a 53% drop, which is slightly worse than ***Beekeeper***'s 48% drop. Of course, that film had incredibly weak competition, but it's a sign that the film might not be able to leg out as hoped. Through 10 days, the film has amassed $27.8 million, and it should finish with around $40 million domestically.\n\nIn third place, ***The Chosen: Last Supper — Part 2*** earned $6.9 million this weekend. That's down 42% from ***Part 1***'s performance last week. Let's see how ***Part 3*** fares this weekend.\n\nWith the arrival of a big blockbuster, ***Snow White*** had another terrible drop this weekend. It fell a rough 59%, earning just $5.9 million this weekend. The film's legs appear to be running out. Through 17 days, the film has earned a terrible $77.3 million and it's gonna finish with less than $90 million domestically. That's absolutely pathetic.\n\nBlumhouse's ***The Woman in the Yard*** added $4.5 million this weekend. That's a 52% drop, which isn't that bad considering the film's poor word of mouth. Through 10 days, the film has earned $16.6 million, and it should pass $20 million by next week.\n\n***Death of a Unicorn*** earned $2.6 million this weekend. That's a 53% drop, which is quite rough for a comedy. Through 10 days, the film has earned just $10.7 million and it will struggle to get to $15 million by the end of its run.\n\nWith the arrival of ***Part 2***, ***The Chosen: Last Supper — Part 1*** collapsed a horrible 84% this weekend, earning just $1.8 million. That took its domestic lifetime to $17.9 million after 10 days.\n\nThere was another wide release this weekend, Neon's ***Hell of a Summer***. Debuting in 1,255 theaters, it earned an okay $1.7 million. With weak word of mouth and horror/thriller competition on the way, it's gonna disappear quickly from theaters.\n\nIn ninth place, Bleecker Street's ***The Friend*** expanded to 1,237 theaters and earned $1.6 million this weekend.\n\nRounding up the Top 10 was ***Captain America: Brave New World***, which fell 54% and added $1.3 million this weekend. The film's domestic total stands at $199 million and it will crack the $200 million milestone sometime this week.\n\n#**OVERSEAS**\n\n***A Minecraft Movie*** also took over the rest of the world. The film earned a huge $150.7 million overseas, for a $313.4 million worldwide debut. That's the second biggest debut for a video game movie, behind ***Mario***. The best debuts were in the UK ($19.9M), China ($14.5M), Mexico ($11.2M), Germany ($10.6M) and Australia ($8.3M). It still has other markets left, including Japan. We'll see if the film can be strong enough to hit the $1 billion mark.\n\n***Snow White*** is running out of steam and it's already its third week. It added just $9 million overseas, which takes its worldwide total to a terrible $168.6 million.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nNone.\n\n#**THIS WEEKEND**\n\nWe're getting FOUR wide releases, and none stand a chance in dethroning ***Minecraft***.\n\nThe first is 20th Century Studios' ***The Amateur***, which stars Rami Malek as a CIA cryptographer who seeks revenge against his wife's killers. With ***A Working Man*** slowing down, this could be a main attraction for old-school action fans.\n\nAnother release is Universal/Blumhouse's ***Drop***, which stars Meghann Fahy as a widow who is contacted by a stranger to kill her date, or her family will be murdered. The film already premiered at SXSW and it has received strong reviews (89% on RT). Can it be the hit that Blumhouse wants and needs?\n\nAnother is A24's ***Warfare***, which follows in real-time a platoon of Navy SEALs on a mission through insurgent territory in 2006. It's directed by both Ray Mendoza and Alex Garland (although the latter states his role is more secondary), and it has earned great reviews so far (93% on RT). It's unreasonable to expect numbers similar to ***Civil War***, but perhaps it could be a surprise breakout for A24.\n\nAnd finally, there's Angel Studios' ***The King of Kings***, an animated film about the life of Jesus Christ. Angel Studios has delivered a big marketing for the film, and pre-sales are reportedly strong here. Maybe it could surprise.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 1544,
        "comments": 403,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5mTBTZDs6-8HKmrPrla9lii4glGONeCEvGb0ENcW-Do.png?auto=webp&amp;s=fad1a89127a2c7a9ab4a568867558bddea4870c9"
        },
        "permalink": "/r/movies/comments/1jtyamn/april_46_box_office_recap_a_minecraft_movie/"
    },
    {
        "id": "1jv06ee",
        "author": "Cautious_Breath6629",
        "title": "I need your help finding a Horror Movie",
        "content": "I watched it as a Kid, this Movie was released in the 80s or 90s. I watched it in the late 90s, on VHS or maybe even on TV.\nI do not remember a lot, which could make it harder to find. \nI remember that there were 3-4 Kids in this Movie in a haunted House.\nIn one Scene one of the Kids opened a Closed or something, and another Kid jumped out of it as a \"Zombie/Undead\" Version of them and bite the other Kid. But the Kid was not really dead, it was maybe just a halucination? Not really sure.\nAt the End of the Movie, i remember the House blowing up, but not with Fire, but with spooky stuff like lightning and some things like that.\n\nUnfortunately, this is all i remember. I've been searching for this Movie for over 20 Years now and i can't find it.\nI really hope someone can help me find this Movie! ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1jv06ee/i_need_your_help_finding_a_horror_movie/"
    }
]