[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1m2w570",
        "author": "Ok-Discipline-1977",
        "title": "Help with Virtual Reality Headset",
        "content": "Ciao,\n\nSono a Torino, ma sto seguendo a distanza un progetto per la mia università negli Stati Uniti. Avrei bisogno di accedere a un visore Oculus Quest (Meta Quest) per testare il mio codice  \n\n\n[Virtual Reality headsets \\(Meta Quest 3 and 3s\\)](https://preview.redd.it/gxq1wqpm6ldf1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=1d55b565ba4fcc1f3073a9ac719a8e4c6c74d620)\n\nNon ho portato in valigia quelli della mia università, ma solo quelli di un dipartimento universitario, di uno spazio creativo o di una biblioteca che mi permettessero di usare un visore per 30 minuti o un'ora.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1m2w570/help_with_virtual_reality_headset/"
    },
    {
        "id": "1m2xc7f",
        "author": "araic8991",
        "title": "Looking for a calm space in Torino",
        "content": "I’ll be moving to Torino as a woman, 26y.\nI struggle with sensory issues experienced cities in southern Europe to be quite overwhelming with the traffic, the noise and the dirtiness. I am now looking for 1. places to live and 2. places to spend my spare time.\n\nRegarding 1.: What areas would you recommend me living in? I don’t have a big income, so shouldn’t be super expensive but in a safe area. Am happy to live in a flat/house share. Bonus would be living in a green area, happy to live outside the city Center, but am flexible.\nI don’t have a car so I’d love to be able to cycle (preferably with good bike lanes) to Porta nuova in 40min or less.\n\nRegarding 2: Looking for places to hang out in the city or things to do on the weekend.\nI love nature, hiking, swimming in lakes and am looking for underrated or quiet parks and cafes in Turin away from roads and day-hikes off the beaten path.\n\nI’m really looking forward to hearing your suggestions, it feels like an impossible task to find these things through my own research!\n",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1m2xc7f/looking_for_a_calm_space_in_torino/"
    },
    {
        "id": "1m2kl08",
        "author": "sylvieatica",
        "title": "Linee tram",
        "content": "Ciao a tutti, sto cercando casa a Torino (sia affitto che vendita) e dato che i prezzi delle case vicine alla linea metro (corso Francia) sono un po' più alti del mio budget stavo valutando la zona intorno a corso agnelli e corso unione sovietica, dove ho visto che passano le linee dei tram che portano in centro. Il mio dubbio è: le linee tram sono effettivamente comode? Capitano spesso ritardi? Ogni quanto passano le corse? Rispetto alla metro hanno effettivamente meno vantaggi?",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1m2kl08/linee_tram/"
    },
    {
        "id": "1m2oqjs",
        "author": "Zestyclose-Tank9125",
        "title": "EDISU",
        "content": "Ciao a tutti!\nL’anno prossimo studierò all’UniTo e ho intenzione di richiedere la borsa di studio EDISU Piemonte, principalmente per l’alloggio in una delle residenze studentesche.\n\nHo una domanda: visto che non vengo dall'Italia, mia madre verrà con me i primi giorni per aiutarmi ad ambientarmi. Mi chiedevo se nelle residenze studentesche ci sono stanze per gli ospiti disponibili per situazioni del genere e se sì, come richiederne una.\n\nSo che è ancora presto, ma visto che vivo all'estero ho bisogno di pianificare tutto con largo anticipo.\nGrazie in anticipo per qualsiasi aiuto o consiglio!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1m2oqjs/edisu/"
    },
    {
        "id": "1m28n32",
        "author": "Small-Basis-502",
        "title": "Trovare casa a Torino (da non studente) - come evitare gli scam?",
        "content": "Ciao a tutti!\n\nSono un designer e vorrei trasferirmi a Torino in un monolocale/bilocale. \n\nSto cercando su idealista, [casa.it](http://casa.it) e immobiliare, ma sembra che gli annunci decenti provengono da poche agenzie, che quando provi a contattarle o non rispondono oppure ti dicono dei fantomatici 250 euro per la lista. \n\nA una di queste io gli ho chiesto \"ma se non fossi interessato al servizio e volessi solo visitare la casa di questo annuncio?\" mi ha risposto che non ci sarebbe stato alcun problema, di venire in sede e controllare la disponibilità. Ma mi dovrei fidare anche senza pagare il servizio che è un palese scam? Anche perchè, al volo ho utilizzato la ricerca per immagine e alcuni annunci utilizzano stesse immagini ma con vie, descrizioni e prezzi diversi, il che mi insospettisce.\n\nE se in conclusione questi sono scam, come si fa a trovare veramente una casa? Mi hanno consigliato i gruppi facebook e telegram, ma sono quasi tutti stanze per studenti.\n\nGrazie in anticipo a tutti! ",
        "upvotes": 6,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1m28n32/trovare_casa_a_torino_da_non_studente_come/"
    },
    {
        "id": "1m2aofj",
        "author": "Strange-Inflation689",
        "title": "hi i am planning to start my masters degree in torino this fall and was wondering what's it's like to live in torino as an international queer person. is there a big lgbt+ community? what's the public treatment to same sex relationships",
        "content": "",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1m2aofj/hi_i_am_planning_to_start_my_masters_degree_in/"
    },
    {
        "id": "1m2glzs",
        "author": "dubastian25",
        "title": "White Moon club",
        "content": "How is the white moon club in Torino? Is it worth it? I have to say we are tourists and we ‘d like to get into the partying vibe of the city. If it’s not a good option, what would u recommend? Thank you!",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1m2glzs/white_moon_club/"
    },
    {
        "id": "1m26m40",
        "author": "Ibrahimt51",
        "title": "Turin to Marseille",
        "content": "Hey ya'll, what's the fastest and cheapest way to get from Torino to Marseille in France? I looked at flixbus and they take a lot of time, same thing for train, any alternative ways? ",
        "upvotes": 3,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1m26m40/turin_to_marseille/"
    },
    {
        "id": "1m21izh",
        "author": "Parmesean_Lover",
        "title": "Torino to Paris",
        "content": "Hi dear Piemontes!\n\nAny advice for travelling to Paris in September/October by plane or trains?\n\nAnd how good is TGV Oui Torino to Paris experience?\n\nMany thanks!",
        "upvotes": 6,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1m21izh/torino_to_paris/"
    },
    {
        "id": "1m28r8w",
        "author": "snor09",
        "title": "Officina moto affidabile",
        "content": "Ciao a tutti concittadini bikers e non. Come da titolo cerco un'officina moto affidabile in città. \nVorrei fare delle modifiche alla moto (manopole, easyblock, scarico etc.) e vorrei trovare un posto serio per la mia due ruote che non mi dia tempi biblici per prenotare e mi faccia trovare sorprese sulla moto.",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1m28r8w/officina_moto_affidabile/"
    },
    {
        "id": "1m2bvz8",
        "author": "Vegetable-Goat6310",
        "title": "is PoliTo worth it?",
        "content": "Sto pianificando di fare domanda al Politecnico di Torino per una laurea triennale (in Informatica o Ingegneria Aerospaziale) come studente indiano. Ho preparato alcune domande rapide a cui mi piacerebbe ricevere risposta da studenti attuali o passati:  \n  \nUn buon punteggio SAT può aiutare con l’ammissione, oppure considerano principalmente i voti del diploma?  \n  \nCome funziona la borsa di studio EDISU e quali documenti sono solitamente richiesti?  \n  \nL’EDISU è disponibile per studenti internazionali del primo anno provenienti dall’India?  \n  \nQuanto è importante l’ISEE Parificato per la borsa e quanto è difficile ottenerlo dall’India?  \n  \nÈ possibile conciliare un lavoro part-time con le lezioni al Polito?  \n  \nCom’è in generale la vita da studente al Polito e a Torino?  \n  \nLe persone all’università e in città parlano inglese?  \n  \nConsiglieresti il Polito a uno studente indiano laborioso che punta a una carriera nella tecnologia o nell’aerospaziale?  \n  \nCi sono errori comuni che gli studenti internazionali commettono durante la domanda o l’adattamento che dovrei evitare?  \n  \nApprezzo molto il vostro aiuto — anche intuizioni personali o approssimative sarebbero davvero utili!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1m2bvz8/is_polito_worth_it/"
    },
    {
        "id": "1m2bpgb",
        "author": "Vegetable-Goat6310",
        "title": "Is PoliTo worth it",
        "content": "I’m planning to apply to Polito for a Bachelor's (either Computer Science or Aerospace) as an Indian student. I’ve put together a few quick questions I'd love to get answers for from current or past students:  \n  \nCan a good SAT score help with admission, or do they mostly consider board exam marks?  \n  \nHow does the EDISU scholarship work, and what documents are usually required?  \n  \nIs EDISU available for first-year international students from India?  \n  \nHow important is the ISEE Parificato for the scholarship, and how hard is it to get it done from India?  \n  \nIs it possible to balance part-time work with classes at Polito?  \n  \nWhat’s the general student life like at Polito and in Turin?  \n  \nDo people at the university and around the city speak English?  \n  \nWould you recommend Polito to a hardworking Indian student aiming for a career in tech or aerospace?  \n  \nAre there any common mistakes international students make when applying or settling in that I should avoid?  \n  \nReally appreciate your help — even rough or personal insights would go a long way!",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1m2bpgb/is_polito_worth_it/"
    },
    {
        "id": "1m2az4k",
        "author": "Tefra_K",
        "title": "Elettricista per circuito piastra a induzione / lavastoviglie",
        "content": "Salve, pochi giorni fa mentre cucinavo sia la piastra a induzione sia la lavastoviglie hanno smesso di funzionare all'improvviso. Non importa cosa faccia, non danno segni di vita. Ho già provato a spegnere e riaccendere dopo pochi minuti il contatore, ma niente.\n\nConoscete degli elettricisti di fiducia che possano venire a darci un'occhiata? Sia la lavastoviglie che la piastra si sono guastate allo stesso tempo e sono connesse per il medesimo cavo, che però entra direttamente nel muro da dietro al forno, quindi sono abbastanza sicuro che non siano loro il problema ma che, magari, si sia fuso qualcosa.\n\nSiamo attorno a Parco Dora.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1m2az4k/elettricista_per_circuito_piastra_a_induzione/"
    },
    {
        "id": "1m230p6",
        "author": "yaarock",
        "title": "Driving test in english",
        "content": "Hello all, i am a student in Torino and i want to get my licanse here but since my italian is not that good (A2 lv) I would like to ask if anyone knows is it possible to take the exam in English and if you know any English speaking driving school? If it is not possible to do it in English does anyone knows where i can see the sample questions to test my Italian level over the questions. Thanks ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1m230p6/driving_test_in_english/"
    },
    {
        "id": "1m1sqn9",
        "author": "sha77asHe",
        "title": "School or teacher to learn Italian?",
        "content": "Hi, I'm an international student and fluent in English. Does anyone know of a cheap school or teacher who offers Italian classes? I really want to learn, but I can’t afford much. I’ve already tried the free school near Madama Cristina, but it wasn’t great—too many people. Thanks for your help in advance.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1m1sqn9/school_or_teacher_to_learn_italian/"
    },
    {
        "id": "1m1o3qg",
        "author": "Due_Mud_5505",
        "title": "Negozio di retro console e retro gaming",
        "content": "C’è un negozio a Torino dove è possibile acquistare una ps vita, psp e altre console con qualche anno in più?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1m1o3qg/negozio_di_retro_console_e_retro_gaming/"
    },
    {
        "id": "1m1i86c",
        "author": "Ibrahimt51",
        "title": "Accommodation in Turin for international student",
        "content": "Hello there, I'm an international student from Algeria, I should arrive in Torino on Ocotober 1st (kinda late but that's when my visa starts unfortunately), I'm finding it quite difficult to find an affordable accommodation (a single room for myself), is there a safe way to get accommodation remotely and doing all payments and all without risk of getting scammed? \n\nI am 23 years old male, will be studying at the Politecnico and my budget is 350 euros all inclusive. Many thanks! ",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1m1i86c/accommodation_in_turin_for_international_student/"
    },
    {
        "id": "1m1m8r8",
        "author": "Substantial-Land946",
        "title": "Carte yugioh",
        "content": "Qualcuno sa se c’è qualche posto a Torino dove si vendono carte yugioh singolarmente, non deck?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1m1m8r8/carte_yugioh/"
    },
    {
        "id": "1m1kisv",
        "author": "LCL0LCL",
        "title": "Concerto degli Swans da Torino",
        "content": "Quest'anno ho iniziato ad ascoltare la band Swans e avranno una data del tour a Milano il 4 Novembre.\n\nSiccome non ho mai guidato tratte così lunghe ho pensato di chiedere qui per vedere se ci fosse qualcuno che intendesse andare e dividere la spesa di rifornimento/casello/posteggio.\n\nMi piacerebbe molto andare a questo live perché da quel che ho letto è l'ultimo tour con il sound che la band suona dagli ultimi 14 anni, perciò è proprio la mia ultima chance di vederli dal vivo!\n\nSpero ci sia qualcun'altro che li ascolti qui e abbia il desiderio di andare, nel caso scrivetemi pure in privato!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pjkpz3x65adf1.jpeg?auto=webp&amp;s=fc41651f17f39f460d02a9488001a52d32e9a030"
        },
        "permalink": "/r/torino/comments/1m1kisv/concerto_degli_swans_da_torino/"
    },
    {
        "id": "1m12n6j",
        "author": "MrWaffles916",
        "title": "Am I making a mistake choosing sapienza over polito?",
        "content": "So I got accepted into both sapienza and Polito for Computer Engineering masters. I choose sapienza for the universitaly application but i have been considering emailing the university to change it if they can to polito. Because I thought maybe polito is better. Will I be doing something wrong?",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1m12n6j/am_i_making_a_mistake_choosing_sapienza_over/"
    },
    {
        "id": "1m1gmt5",
        "author": "lionsonlyplayonehalf",
        "title": "Autoscuola a Torino - quanto tempo ci mette?",
        "content": "Ciao tutti.\n\nSono un straniero con una patente dall'estero con cui non posso fare conversione. Allora devo prendere la patente B.\n\n  \nVorrei prendere la patente entro aprile prossimo se riesco. Avevo letto online che si puo' fare in sei mesi. Guido gia' qua (colla mia patente internazionale ancora valido - ho preso residenza in Italia solo recentamente), pero' con un cambio automatico. Devo fare un po' di prattica col cambio manuale perche' non ho guidato manuale per qualche anno e mai in una citta' come Torino. Poi per la teoria devo mettermi un po' da studiare il vocabulario della guida/strada, perche' parlo abbastanza bene l'italiano pero' facendo quiz online ci sono delle parole che non conosco. \n\nOggi sono andato da due diverse autoscuola, Ad ACI - Autoscuola Club mi hanno detto che si puo' fare entro aprile. Ad Autoscuola Jolanda mi hanno detto che tutti mettano almeno un'anno a Torino.\n\nCosa sono le vostre esperienze recente alle autoscuola di Torino? Quanto tempo ci avete messo? Qualche consiglio?\n\nGrazie mille.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1m1gmt5/autoscuola_a_torino_quanto_tempo_ci_mette/"
    },
    {
        "id": "1m1dzdd",
        "author": "anniekbee",
        "title": "Hotel recommendations",
        "content": "Going to the Juventis Parma game at the end of August and using transportation through around Turin (bus from somewhere in city center). Hotel recs? So far I have narrowed it down to Turin plaza hotel and NH Piazza Carlina. Are those good locations? Ok price? Any other recs? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1m1dzdd/hotel_recommendations/"
    },
    {
        "id": "1m0db1t",
        "author": "JoJoFC27",
        "title": "Porta Palazzo: divieto di transito per chi cammina a testa in giù",
        "content": "",
        "upvotes": 148,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bnkij5pec0df1.jpeg?auto=webp&amp;s=95813166ce6a7c810166ea2b2b7842b6ddc82ec3"
        },
        "permalink": "/r/torino/comments/1m0db1t/porta_palazzo_divieto_di_transito_per_chi_cammina/"
    },
    {
        "id": "1m0h42b",
        "author": "zhenming91",
        "title": "FPV dive National Museum of Cinema",
        "content": "",
        "upvotes": 53,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1tprfn97d1df1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/torino/comments/1m0h42b/fpv_dive_national_museum_of_cinema/"
    },
    {
        "id": "1m16rxt",
        "author": "zanetticomodino",
        "title": "Cercasi negozio abiti tradizionali indiani",
        "content": "Ciao tutti! Qualcuno di voi sa per caso se a Torino o in provincia ci sono negozi che vendono Lehenga o Sari (abiti tradizionali femminili del subcontinente indiano)?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1m16rxt/cercasi_negozio_abiti_tradizionali_indiani/"
    },
    {
        "id": "1m0s515",
        "author": "idareuidareu",
        "title": "One month in Torino - July, August or September",
        "content": "Hey everyone, my wife and I are considering spending a month in Torino. Wondering which month would be best?  Anything we should be aware of when choosing?\nMany thanks in advance",
        "upvotes": 3,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1m0s515/one_month_in_torino_july_august_or_september/"
    },
    {
        "id": "1m0cdym",
        "author": "Throw4away477",
        "title": "Come viene percepito il Politecnico di Torino all’estero?",
        "content": "Ciao a tutti!  \nUn mio amico, studente internazionale, sta valutando se iscriversi al Politecnico di Torino oppure optare per un’università in Svizzera. Una delle sue preoccupazioni riguarda la reputazione del PoliTo all’estero: ha sentito dire che al di fuori dell’Italia, non sarebbe molto riconosciuto o apprezzato, soprattutto nel mondo del lavoro. \n\nVoi che ne pensate?  \nAvete esperienze dirette o conoscete persone che si sono laureate al PoliTo e poi hanno cercato lavoro all’estero? Il titolo di studio è ben considerato, oppure ci sono limiti in termini di riconoscimento o reputazione internazionale?  \nHo provato anche a chiedere ad un mio amico che vive a Torino ma non mi ha ancora risposto.\n\nGrazie mille in anticipo a chi risponderà!",
        "upvotes": 14,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1m0cdym/come_viene_percepito_il_politecnico_di_torino/"
    },
    {
        "id": "1m0odkd",
        "author": "marviw2891",
        "title": "Sigari Torino/dintorni",
        "content": "Salve,\n\nCome da titolo cerco una tabaccaia fornita soprattutto nel low cost di qualità: villa zamorano, flor de oliva, joya de nicaragua, quorum, plasencia.. per fumate decenti e poco impegnative in giornata.\n\nGrazie ",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1m0odkd/sigari_torinodintorni/"
    },
    {
        "id": "1m0tndk",
        "author": "duckinlove",
        "title": "Conoscete un posto dove riparano giochi per GameBoy color?",
        "content": "Il mio compagno in qualche modo ha versato della birra su una cartuccia di gioco, ha provato a pulire i circuiti cn alcool isopropilico ma è rimasta ancora della corrosione, e preferirebbe portarla a vedere da qualcuno un po piu esperto",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1m0tndk/conoscete_un_posto_dove_riparano_giochi_per/"
    },
    {
        "id": "1m0d62n",
        "author": "ohhisofia",
        "title": "Revolut Direct Debits...",
        "content": "Has anyone had trouble (or success!) in using a Revolut account for direct debit with local companies? I have an Italian Revolut, with \"IT\" at the start of the IBAN, but I'm having issues with both Fastweb and Eni (plenitude) trying to pull the money via direct debit. On the flip side, my revolut account isn't even registering that they are trying to create the direct debit.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1m0d62n/revolut_direct_debits/"
    }
]