[
    {
        "id": "1k1hbwm",
        "author": "reddituser0912333",
        "title": "Quick Reminder (from mods)",
        "content": "Hello, everyone –\n\nIn the wake of the UCL exit, there have been many different posts on the sub on a range of topics: disappointment rants, encouraging words as we look forward, players who should come and go, etc.\n\nThe mods have been removing a lot of posts (e.g., quick thoughts or rants that belong in the open thread, poor quality memes, news from low tier sources, and trolls). We will continue to encourage the normal rules of the sub, but I just wanted to make an announcement to state that everyone should continue to use the new voting system we’ve implemented on if content ‘fits’ the sub. Also feel free to use the report button for posts that you think might not fit and we will review it.\n\nReach out if you have questions or concerns. Thank you for your time 😊 ",
        "upvotes": 44,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1hbwm/quick_reminder_from_mods/"
    },
    {
        "id": "1jyv6sq",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 47,
        "comments": 4100,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jyv6sq/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1k1v3j3",
        "author": "basedzone",
        "title": "Lucas Vasquez Might Not be that Great, but he's a Real Madrid Legend",
        "content": "While I understand the frustration of losing and having a bad defence can get on the nerves of many fans. Please don't forget what the players have done these past seasons. This is just a bad patch. And Lucas deserves some respect at least. ",
        "upvotes": 685,
        "comments": 63,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1v3j3/lucas_vasquez_might_not_be_that_great_but_hes_a/"
    },
    {
        "id": "1k1d2zt",
        "author": "brimwithno",
        "title": "You expect me to not be pissed when a 40 years old runs more than our entire team! Look at the time!!",
        "content": "",
        "upvotes": 2683,
        "comments": 226,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2dmtjs4dfeve1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k1d2zt/you_expect_me_to_not_be_pissed_when_a_40_years/"
    },
    {
        "id": "1k1lkx7",
        "author": "orange_pepsi8",
        "title": "This season for real (for Real)",
        "content": "",
        "upvotes": 353,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/s4nkda6j6gve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k1lkx7/this_season_for_real_for_real/"
    },
    {
        "id": "1k1bgym",
        "author": "BdBoss_777",
        "title": "Jude Bellingham on Instagram.",
        "content": "",
        "upvotes": 1301,
        "comments": 109,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1bgym/jude_bellingham_on_instagram/"
    },
    {
        "id": "1k17w56",
        "author": "KabiX2",
        "title": "\"I know I gave you only a few minutes this season, but...\"",
        "content": "",
        "upvotes": 2359,
        "comments": 91,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8dq2f9xjwcve1.jpeg?auto=webp&amp;s=dfa3ef75250fa33e9bff400cc0ebfe6a105159be"
        },
        "permalink": "/r/realmadrid/comments/1k17w56/i_know_i_gave_you_only_a_few_minutes_this_season/"
    },
    {
        "id": "1k1auih",
        "author": "Longjumping-Elk-7840",
        "title": "Carlo Ancelotti to leave Real Madrid after Champions League defeat to Arsenal",
        "content": "",
        "upvotes": 597,
        "comments": 171,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GBzLdVvjAa-yE17_YGhb53hEa-aJzQ2uC4Gd0C__6Vw.jpg?auto=webp&amp;s=0531c295a3dabe6d4057eebac3141f84dcb7f2e2"
        },
        "permalink": "/r/realmadrid/comments/1k1auih/carlo_ancelotti_to_leave_real_madrid_after/"
    },
    {
        "id": "1k1fid2",
        "author": "Public_Swordfish_569",
        "title": "Lazy attitude by some players.",
        "content": "",
        "upvotes": 302,
        "comments": 69,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/azwdn8bwxeve1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k1fid2/lazy_attitude_by_some_players/"
    },
    {
        "id": "1k1zzm1",
        "author": "muaazmuaaz123",
        "title": "Real Madrid all time xi Day 1 : ST",
        "content": "Making the real Madrid all time xi, day 1, starting from strikers, the most upvoted striker will be selected in all time xi, u can also pick players apart from this list\n\nI didn't included cr7 as he played mainly as A LW in madrid",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1zzm1/real_madrid_all_time_xi_day_1_st/"
    },
    {
        "id": "1k1icrx",
        "author": "Miserable-Subject-87",
        "title": "It’s easy to blame Ancelotti, but what about Florentino?",
        "content": "This season, we got hit with a huge reality check, it really showed how important Toni Kroos was to this team. We started off completely unbalanced, with no ideas and the whole squad felt disconnected. Then Ceballos started getting more minutes and gave us a bit of hope. Suddenly there was more creativity and better flow, but even that wasn’t enough, since he’s an injury prone player.\n\nThen our defense collapsed. Carvajal got injured, and we were left with just Vázquez? and he’s not even a RB. Nacho left and we didn’t bring in a replacement. Relying on a 32 year old ACL injured Alaba, and keeping Vallejo the tourist, who stayed just because Florentino felt bad for him, and that’s about it.\n\nMilitão got injured, and out of all that negativity came one positive: Raúl Asencio. But even then, it took Carlo a few games to see it, choosing Tchouaméni over him at first. Few players have been playing out of position and worn out, and who’s to blame for that? \n\nSo how did we fail to bring in what we needed, especially a RB or CB? Particularly in January after the Clásico disaster. We all know Carlo asked for signings, but also why not give the academy players a chance as well?\n\nYes, there are many questions and this season has been a disaster. Injuries, Ancelotti’s poor decisions, lack of tactics, no real rotation, over-reliance on individual brilliance up front and overall weak management have only made things worse. But seriously what are Florentino and the board even thinking?\n\n\nHonestly, it feels like Florentino has been more focused on helping Barça this season than fixing our own problems. It’s clear he and the board are just as much to blame.\n\nThis is Real Madrid, and we’ve been suffering since day one this season and it’s been embarrassing, yet here we are, chasing free agents like a mid-table team and we’ve worn out our players by playing them out of position. And the timing couldn’t be worse because Barça have been unstoppable this season.\n\nI guess it’s karma for all the laughs and mockery aimed at them and Xavi. But one thing’s for sure, we’re not going to suffer for years like a corrupt, broke club like Barça. I’m confident we’ll rise and dominate again. That’s one of the many things I’m proud of with this club, we lose players, but we rise quickly. We don’t suffer for seasons like others do, and I’m sure we’ll bounce back next year.\n\nSo many question marks this season, but that’s football. Sometimes this is what it takes to start over again. I know that we Madridistas are the most demanding fans in the world, but we have a reason to be and I know many of us feel the same way.\n\nI just hope Florentino and the board have learned from all of this during his final years as president, and I hope our next manager can bring us that joy again. I’m grateful for everything Don Carlo Ancelotti has done for this team, but it’s time for a new era.\n\nI just needed to get that off my chest.\n\nHALA MADRID!\n",
        "upvotes": 159,
        "comments": 83,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1icrx/its_easy_to_blame_ancelotti_but_what_about/"
    },
    {
        "id": "1k1b66k",
        "author": "BdBoss_777",
        "title": "🚨 Carlo Ancelotti will NOT finish the season at Real Madrid. He will lead the team in the Copa del Rey final next week, then he'll immediately leave, and will NOT finish La Liga.",
        "content": "BREAKING: Carlo Ancelotti will NOT finish the season at Real Madrid.\n\nHe will lead the team in the Copa del Rey final next week, then he'll immediately leave, and will NOT finish La Liga. @SkySports",
        "upvotes": 393,
        "comments": 130,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0IxylENp3RSBECWOiKK7J0NsPejkVh5CipNiRVieEUY.jpg?auto=webp&amp;s=5867603ac1411f09e4ae0ab1d3f5d014589cd2b0"
        },
        "permalink": "/r/realmadrid/comments/1k1b66k/carlo_ancelotti_will_not_finish_the_season_at/"
    },
    {
        "id": "1k1pi1d",
        "author": "TestProfessional6716",
        "title": "What times the team was eliminated and you weren't mad ?",
        "content": "As we are the kings of competition and our fan base has been spoiled with the success, it seems like we throw a tantrum whenever we are eliminated. Can't really complain as I threw mine yesterday after the bad results and the constant bottling and the bad performances. \n\nStill, has any of you face an elimination in UCL and just accept that it's football and sometimes you lose and sometimes you win ? \n\nI've been watching since 2011 and I will give mine :\n\n* 2011 elimination against Barça : first season with Mou, we were showing signs of improvements and Barça was just too good back then\n* 2012 : Bayern Munich elimination hurt.. the team did wonderful in the two legs, but Bayern was so good and we were not good in the penalties ( only Xabi Alonso scored his and despite Casillas saving 2, Kaka and Ramos missed theirs, CR7 scored a penalty in the game, but missed in the shootout, and it's prime Neuer )\n* 2013 : BVB was a serious competition for Bayern with their golden generation Lewa, Gotze, Reus, Gundogan, Schemlzer, Pisczek, Hummals, Subotic ran by Klopp. They trashed us in the first leg and I ain't even mad.. no formation overthinking or anything.. locker room was split back then.. and the fight the team showed in the final minutes in the Bernabeu, making BVB park the bus and shit themselves made love the team x10 mores.. we could have done better in the Bernabeu by not missing easy chances, but BVB were very good and even missed chances to kill the game. Won't forget Diego Lopez super save against Gundogan.\n* 2015 : Juventus elimination hurt, but I feel we were kinda unlucky and the game could have gone either way in both legs. Marcelo hit the crossbar right before Juventus counter for the 2-1 in italy..  second leg was not that bad, not that good either, but didn't feel like the formation was wrong or anything, we had our best players aligned up, we played like we usually do\n* 2023 : Don't scream your hearts out now lol that 4-0 against City hurt, but that same team eliminated City in the very next season. There is the whole Rudiger/Militao debate and I do think Rudiger should have started, but I think the real missed one in that game was Mendy instead of offensive LB Camavinga, and Mendy was injured... Haaland wasn't even that dangerous in that match, but City exploited Cama and Kroos spaces on the left. also we look at ourselves and refuse to give credit to the other team, City were monsters in that season and won the treble. We played well in the first leg but De Bruyne stole a draw with a powerful shot from outside the box.\n\n",
        "upvotes": 37,
        "comments": 47,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1pi1d/what_times_the_team_was_eliminated_and_you_werent/"
    },
    {
        "id": "1k1eiw9",
        "author": "CapNegative77",
        "title": "Jurgen Klopp as new manager?",
        "content": "With all respect to Carlo and everything he’s done for the club, all good things must come to and end. A shame we got knocked out by Arsenal but it was not our season with poor performances throughout. It may be stupid but can we see Klopp as a new manager at the end of the season? He did say he’s open to negotiate with Madrid.",
        "upvotes": 143,
        "comments": 171,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1eiw9/jurgen_klopp_as_new_manager/"
    },
    {
        "id": "1k14qyc",
        "author": "Ready_Ad_1353",
        "title": "Courtois: \"We put in a lot of crosses but this year we don't have a Joselu, a born striker up there. Sometimes you have to be self-critical. I feel that we have to make more team plays and not all individual, if they double-mark Vini or Kylian, a 1 vs. 2 maybe succeds out once but, not five times\".",
        "content": "Courtois: In the end, when they give you a penalty, if you save it, you keep believing. At the beginning, we created some danger, the fans pushed us, but Arsenal is a team that defends well, they're organized, the wingers and the striker come back... At halftime, we felt that if we scored the first goal, the tie would be open. In the end, they found the first goal, we tied it quickly. You keep believing, but we weren't successful up front. I don't think Raya had to make a single great save. We lost against a superior Arsenal team and we have to accept that.\" Shortly afterward, in the mixed zone, he tried to clarify his thoughts: \"We can't always expect the four up front to dribble past three players and score a great goal. As a team, we have to attack and defend better . \"",
        "upvotes": 835,
        "comments": 153,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k14qyc/courtois_we_put_in_a_lot_of_crosses_but_this_year/"
    },
    {
        "id": "1k18vp7",
        "author": "fig966",
        "title": "Brace yourselves Arda Guler posts incoming",
        "content": "(Old post was deleted, wrong flair apparently 🤷‍♂️)",
        "upvotes": 318,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g09qy9xm9dve1.png?auto=webp&amp;s=3eb08f80e2dbf7a87664bede53e1a2bfa29b34f6"
        },
        "permalink": "/r/realmadrid/comments/1k18vp7/brace_yourselves_arda_guler_posts_incoming/"
    },
    {
        "id": "1k1hnxl",
        "author": "Ok_Argument_67",
        "title": "Real Madrid kept the most clean sheets last season out of any team in Europe's top 5 leagues (21), but have managed just (11) since then . Massive drop off defensively",
        "content": "| StatMuse\" https://www.statmuse.com/fc/ask?q=which+team+kept+the+most+clean+sheets+last+season+in+europe%27s+top+5+leagues+last+season\n\nMostly due to the fact that we have no off - possession ideas (at least ones that are effective) and we struggle to have more control in important game states\n\nDo you think vinicius and mbappe not putting much effort and allowing teams to play through us is the main factor ? ",
        "upvotes": 73,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uPmXCkbeTjp5HsvXOYRLxctmaz7N9idlCD6fSXGbBzE.jpg?auto=webp&amp;s=3b633570dbb015c24f58bd76ea1bc67bbe4af2fb"
        },
        "permalink": "/r/realmadrid/comments/1k1hnxl/real_madrid_kept_the_most_clean_sheets_last/"
    },
    {
        "id": "1k0zjql",
        "author": "Ready_Ad_1353",
        "title": "Ancelotti: \"Arsenal deserved to go through and I hope the best for them... No excuses, in both games they were better. It can happen in football. We are upset of course. We had a lot of epic moments in the past and tonight we have to manage the setback.\"",
        "content": "",
        "upvotes": 1304,
        "comments": 163,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/lsphygiweave1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0zjql/ancelotti_arsenal_deserved_to_go_through_and_i/"
    },
    {
        "id": "1k1fh4r",
        "author": "flstudiobeatmaker101",
        "title": "A true number 9 is not the problem.",
        "content": "An amazing example of this is current PSG. They are playing some of the best football in Europe right now, and have no trouble scoring any goals. Well, take a look at their attack. Dembele, a RW/LW. Barcola, Doué, and Kvaratskhelia, who are all LW's also! The difference is, they have good rotations and all work for each other. The only reason it looks like Madrid need a number 9, is because against Arsenal, all they did was cross balls into the box. PSG doesn't spam crosses to get goals, they know their strengths and find other ways to score. They rotate all over the pitch, and try and open up spaces for each other to get in 1v1 situations, and hopefully capitalize on them. How many times against Arsenal did we see Vinicius and Mbappe 1v1 with space to run into and finish? Zero. A new coach is really what is needed, one that can find the strengths of Mbappe, Vinicius, and Rodrygo. Most of Madrid's attacks are just Vinicius running down the wing and trying to cross the ball back, with someone rarely getting to it. Mbappe hardly gets involved in the attack, which forces him to drop deep to receive the ball, leaving the box empty. Another reason why PSG are so successful is because of their fullbacks getting forward, which is why I think Trent is an amazing transfer. A tall number 9 isn't needed whatsoever, a new coach with a better sense of managing the attack is what Real Madrid really need.",
        "upvotes": 59,
        "comments": 32,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1fh4r/a_true_number_9_is_not_the_problem/"
    },
    {
        "id": "1k1s4s7",
        "author": "10kletsbreak",
        "title": "Vini Jr will be playing false 9 against Getafe",
        "content": "Getafe: Sit, defend, tackle. Getafe's tactics are not austenitic, but very effective. 79 million team sitting at 11th place (at this time of writing). Getafe don't have much posesion of the ball, but they do press really high, watching some of their matches, they press really high up the pitch almost as high up as barca.\n\nVini can draw in defenders from giving space for Rodrigo and Mbappe. Mbappe has speed that isn't being utilized in the stricker position. Look at him at psg, or france, being able to run behind defenders is mbappes strenths. Formation is a 4 - 1 - 2 -1 - 2. Alaba, rudiger, rual, valverde.  Holding Mid: tchouaméni. Midfiled: Modric, Bellingham. False 9: Vini. Wingers: Mbappe, Rodrigo. Why this will work. Defense doesn't need to be perfect but the 4 are good enough against a weak attaking team. Tchouameni is the holding mid with bellegoal being the box to box mid field and modric being the 10. Vini will draw space, with Mbappe and Rodrigo holding the width. Rodrigo still out of position, but he can play as right wing. \n\nMbappe won't place against athletic club because of the 1 match suspension, so vini will place on his wing, but mbappe will play left wing against getafe. ",
        "upvotes": 11,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1s4s7/vini_jr_will_be_playing_false_9_against_getafe/"
    },
    {
        "id": "1k1z5tt",
        "author": "KjOnReddit1010",
        "title": "The Club World Cup alters plans for making the decision on the coach",
        "content": "(English Translation)\n\nWith the tough Champions League elimination against Arsenal over, the time has come for Real Madrid to analyze and make decisions. Not for next season, but rather for the end of this season. There's no time to waste. In any other year, they would wait until the end of the season, as they usually do, but this one is very different because the big objective they still have left isn't the league title or even the Copa del Rey final, no matter how tempting Barça might be as their opponent. None of that. The main challenge now is this first Club World Cup, which Florentino Pérez and José Ángel Sánchez have had on their agenda since the start of the season. For reasons of prestige, international exposure, and brand positioning in a key market like North America, winning the first edition of the brand-new FIFA tournament is considered a strategic objective. Therefore, they are considering what the best option might be to face this competition with the greatest possible guarantees.\n\n# Feeling of a completed cycle\n\nWe're talking about the coach, of course. Carlo Ancelotti has lost a lot of face this season, and his poor performance in the two legs of the knockout stage against Arsenal reinforces the notion among those in charge that the squad has long since let go of the Italian manager and his time is over. Normally, he'd play in the Copa del Rey final, and at the end of the season, unless there was a radical turnaround in the team's play and he won both titles, they would agree to terminate his contract as head coach and offer him a grateful exit, in keeping with his impeccable record. Furthermore, the Brazilian Football Federation has been waiting for him for over a year and would like to sign him in June.\n\n# A caretaker or Xabi Alonso ready for the Club World Cup\n\nThe problem lies in the fact that La Liga ends on May 25th, and Real Madrid's Club World Cup debut on June 18th against Saudi Arabia's Al Hilal. The club is exploring alternative options to Ancelotti taking charge if the team's erratic form continues or even worsens after the Copa del Rey final. It's about anticipating all possible scenarios. One option would be to appoint an interim manager, which could be Solari or Raúl. But the most suitable option would be for the new coach to take charge of the team weeks before the Club World Cup to work with the players, although many international players will be playing in the Nations League finals between June 4th and 8th or in World Cup qualifiers with their South American national teams. That new manager would be Xabi Alonso because he is the option that most convinces the president. The Tolosa native remains focused on his Bayer Leverkusen side, although he's waiting for a call from Real Madrid to activate the release clause that allows him to leave if Real Madrid or Liverpool (but not Bayern Munich) want him, in exchange for a fee as compensation for not seeing out the remaining season on his contract. It's another matter whether Xabi would welcome the option of taking charge in June of a team that's physically and mentally tired, ready to face a tournament as demanding as the month-long Club World Cup at the end of the season.\n\n\\---\n\nBased on this article we could have a new manager finalized within a month and officially signed before 1st June. I recently wrote a post on this sub related to this topic...\n\n[https://www.reddit.com/r/realmadrid/comments/1k15qcr/timing\\_of\\_ancelotti\\_departure\\_and\\_xabi\\_arrival/](https://www.reddit.com/r/realmadrid/comments/1k15qcr/timing_of_ancelotti_departure_and_xabi_arrival/)",
        "upvotes": 3,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tYODx51AmDRSKoSsn_NK9yVYb_Eagd5d82bzZ1P5ZY4.jpg?auto=webp&amp;s=6a967e2c159d79acbcefd1dd454a2e50e933baa8"
        },
        "permalink": "/r/realmadrid/comments/1k1z5tt/the_club_world_cup_alters_plans_for_making_the/"
    },
    {
        "id": "1k17m1o",
        "author": "Emergency-Hornet-594",
        "title": "Fabrizio Romano om Facebook: Mikel Arteta: “Carlo Ancelotti told me that he HOPES Arsenal win the Champions League!”.",
        "content": "All the best to Arsenal and Barca. ",
        "upvotes": 199,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/r1BHvoeoC_ZHm4AzOs0V29ozN7wVp52seaPby_usV2A.jpg?auto=webp&amp;s=5b47573d5e6c8781034fffdb3dbb8081a5063f03"
        },
        "permalink": "/r/realmadrid/comments/1k17m1o/fabrizio_romano_om_facebook_mikel_arteta_carlo/"
    },
    {
        "id": "1k1ebkc",
        "author": "blueXwho",
        "title": "Mbappé's job is to score goals and he is the top scorer",
        "content": "I keep reading the \"3 LW\" complaint over and over, saying Mbappé is the problem, that we didn't need him, and that we need a \"real\" striker. However, for what exactly do you want a \"real\" striker over Mbappé? So he can score goals, right? Guess what, Mbappé is the top scorer, fighting for the Pichichi, with more goals than anyone last season. He came to give us goals and he has delivered.\n\nDo we need an alternative, tall, expert header? Yes, of course, but Mbappé is still a great signing.\n\nPeople have told me \"but it's not about the goals\". Really? Football is not about scoring more goals than the opponent?\n\nMbappé is doing his job and he has scored great goals. He can do better, of course, I'm sure next season he'll be better adapted.\n\n\"But he doesn't press.\" No, he doesn't press as people would like, but that's the whole team. Ancelotti plays with a low block, so forwards cannot effectively press high. Pay attention to the games, see what's going on behind the forwards. When Vini, Mbappé, or Rodrygo press the defender, no one is pressing one on one behind them, which means the defender has two or three open passes (fullback, goalie, midfielder). Then, keep pressuring is just a waste of energy.\n\nWhen the whole team is pressing, usuallynwhen we're down, Mbappé runs for the keeper or the defender, but this team pressure doesn't happen often. So their job is to populate the center, to prevent passes through that hallway.\n\n\"But Kane...\" He has very similar stats and was knocked out in the same stage.\n\nAnyway, our problems have more to do with defense and the connection the midfield should establish than with having an elite player that has scored more goals than anyone in the team. ",
        "upvotes": 52,
        "comments": 93,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1ebkc/mbappés_job_is_to_score_goals_and_he_is_the_top/"
    },
    {
        "id": "1k0yj7b",
        "author": "TestProfessional6716",
        "title": "\"Our front line should be destroying Europe\" is a stupid take",
        "content": "Tough defeat today, but I see this a lot in the threads :\n\n\"We have 3 nuclear weapons in the front and we don't know how to use them, it's coach's fault\"\n\nStupid take. That would be the case if you're playing FIFA on PS5. What you have is 3 fast right footed midgets, with brute force players in the midfield without a single one with decent build up quality to link defense and offense, and in the back, you have literally no fullbacks !\n\nThe front 3 is attractive, but not balanced ! Perez ruined a very good squad by buying a player we didn't fucking need and NOT replace 4 key players :\n\n1. Joselu, a tall cunt that wins most of his aerial duals and is always a threat in crosses. He was a downgrade of Benzema but thank god we had him to mix up our offense last season and he was VERY important !\n2. Kroos, a midfielder who has guaranteed &gt;90% pass accuracy,\n3. Nacho, a player who plays all positions in the defense\n4. Carvajal, our ONLY RB since 2014\n\nWatch the board buy another Brazilian midget by the end of the season !\n\nXabi Alonso, Klopp, Guardiola, Mourinho, none of them, separated or combined in any fucking way, will achieve shit with this squad either ! Easy to call out 'Carlo has no tactics' but you don't win chess games on high level with 6 bishops instead of the other pieces ! You need 2 Bishops, 2 Knights and 2 towers !\n\nCould Ancelotti have managed this season better ? Yes. Is he fully to blame ? Absolutely not and don't forget to shit on the board before shitting on the coach. Man asked for Harry Kane but got a CAM Bellingham so he switched the entire formation to fit him for a false 9 and it worked thanks to Vini wonder season.. So Perez decided to do this every fucking time because the next Brazilian midget he will buy will play as a left back because the board is to lazy to splash cash on an ACTUAL LB.\n\nY'all realize we have been playing for most of the season with 2 defenders in the 4 backline ? Tchou moved to CB and LV as RB are not their positions, Ancelotti's fuck up is not playing Asencio earlier, but it's sad to watch Alaba being average, then Fran comes in and he is just worse, together with Mendy's performances in this season. I don't need to talk about LV.\n\n3 Lewandowskis in the front won't work ! 3 Harry Kanes won't work ! 3 Sakas won't ! 3 Viniciuses won't work ! You need an actual number 9, an actual RW and an actual LW, but instead we have 3 LWs and people are like 'Any coach will destroy Europe with MVR' because they do in career mode on their PS5.\n\nWe can't win the UCL every season. Congratulations to Arsenal. Hala Madrid !",
        "upvotes": 783,
        "comments": 303,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k0yj7b/our_front_line_should_be_destroying_europe_is_a/"
    },
    {
        "id": "1k0u4og",
        "author": "Constant_Aspect_6632",
        "title": "Dani Carvajal and Saka had words at the end of the half.",
        "content": "",
        "upvotes": 1384,
        "comments": 247,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7z2687ey79ve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0u4og/dani_carvajal_and_saka_had_words_at_the_end_of/"
    },
    {
        "id": "1k1btrn",
        "author": "ubebebebe",
        "title": "To my fellow Madridistas…",
        "content": "I know fans of other teams like to hate on us… calling us names etc etc\n\nBut can I just commend the REAL fans who are level-headed, mature, experienced, gracious, wise and kind.\n\nThank you for calling out those fans who say mean and disrespectful things (I’ve been called out a few times this past week… I was too emotional lol)… and for correcting some unacceptable fan behaviour. 👏🏼👏🏼 you are the real MVPs of this group.\n\nWe are such a big club (if not the biggest)… so it’s to be expected that we will have fans from all walks of life, from all ages, from all over the world, old and new. We can’t filter every fan… and we can’t control their every action or word. \n\nWe have been mocked and have been labelled all sorts of things, but what these haters (or fans of other clubs) don’t see are the number of mature fans in our group that are actually logical (not delusional), realistic, respectful, wise and kind. I have encountered more kind RM fans than mean ones on here… and in person too. \n\nMay this bring comfort to the whole fam. We are so much better than what the haters are trying to tell us. 🤍💜",
        "upvotes": 54,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1btrn/to_my_fellow_madridistas/"
    },
    {
        "id": "1k0qzjo",
        "author": "[deleted]",
        "title": "Scenes outside Santiago Bernabéu",
        "content": "",
        "upvotes": 1468,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nr12sr1yk8ve1.jpeg?auto=webp&amp;s=93da6c9de9e15173da1a30ebb82b95feb7d8220c"
        },
        "permalink": "/r/realmadrid/comments/1k0qzjo/scenes_outside_santiago_bernabéu/"
    },
    {
        "id": "1k17nvw",
        "author": "busyblckboy",
        "title": "Vini plays better with Endrick than mbappe",
        "content": "Vini's game might actually synergize more effectively with Endrick. Perhaps Endrick's movement and willingness to occupy different spaces unlocks a different dimension for Vini, allowing him more freedom or creating unique attacking angles we haven't fully explored with Mbappé. What are your initial thoughts on this? Are we seeing a more natural understanding develop between Vini and Endrick, or is the established quality of the Vini-Mbappé duo still the superior combination? Let's hear your tactical breakdowns, observations, and any predictions for how these partnerships might evolve.\n\nMy evidence is when edrick came on vini was finding him with his crosses spot on. Endrick was just physically bullied and didn't convert. \n\n\nFull disclosure I actually think mbappe was horrendous. I liked him at first but after this season I'm not impressed in the least. ",
        "upvotes": 102,
        "comments": 113,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k17nvw/vini_plays_better_with_endrick_than_mbappe/"
    },
    {
        "id": "1k0su89",
        "author": "Constant_Aspect_6632",
        "title": "Courtois 🧱 saves the penalty",
        "content": "",
        "upvotes": 973,
        "comments": 51,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2at2ip3gy8ve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k0su89/courtois_saves_the_penalty/"
    },
    {
        "id": "1k102aa",
        "author": "Danickcoolman",
        "title": "Football is played on the pitch, not on social media.",
        "content": "I’ve said it multiple times and I’m going to say it again: Carlo needs to leave. He needs to leave because a legendary manager cannot continue to tarnish his legacy by what was being displayed by his players and by himself. Today, 7 out of 42 crosses were successful, Vazquez was seemingly one of our best players and the attitude of some players that are supposed to be leaders was downright embarrassing. Just like the title says, you play on the pitch, not on social media. \n\nThis is a lesson for the Instagram warriors that are our players and the admin of the club’s account. For an entire week, we’ve heard them say “Remontada this, remontada that” or “we’re going to comeback” or even “remontada has been the most used word in the dressing room” when a remontada DOESN’T come out of thin air. 3-0 against Wolfsburg was thanks to a brilliant Cristiano Ronaldo, 3-1 against City in 2022 was thanks to a brilliant Rodrygo, Courtois and Benzema and etc. Do you guys see a pattern here? Every remontada has been thanks to players trying their hardest because they believe that they can do it and that they don’t need to talk on social media to play their football. But what about today? We had:\n\n- Rodrygo Silva de Goes who has been invisible, yet AGAIN. His last goal being against Atletico back in march. “Only idiots forget the R”. I know that he’s playing out of position, but Raphinha has been playing out of position since the beginning of the season and is at 50 G/A+. Great players should always perform even if they play out of position.\n\n- Kylian Mbappé Lottin who wants to play as a central midfielder instead of making runs in behind. “Adaptation period is over: I’m going to be the one deciding matches now”\n\n- Vinicius José Paixao de Oliveira Junior who, despite being the best out of the three tonight, has been seen hugging the touch line too much instead of exploiting the space centrally when Mbappe wasn’t there and playing with Alaba when he was overlapping in the first leg. “I’m going to do it 10x more, they are not ready.”\n\nWhat I hate the most in football are people who like to talk days before the actual game. We put out a disastrous performance in the first leg and you would think that the players and the coaching staff would learn from their mistakes and prepare at least **something** against Arsenal, am I right? I can understand that we’re playing against the best defence in the Premier League, but this doesn’t excuse the lack of solutions from Ancelotti. I mean, Courtois said in an interview that the players are doing what Ancelotti is telling them to do, they want to respect his wishes. Spamming crosses to nobody in the box or refusing to play out from the back isn’t how you’re going to win matches. Time and time again in today’s match, long balls were being spammed when we know that our front three has no aerial threat, so why are we doing that? And don’t get me started on David Alaba. He never should’ve started at LB.\n\nPutting the blame on the coach and the players is unfair, right? So, how about we talk about the so called “ruthless president” that is Perez and the idiots that run our board? It’s maddening how Perez thought that adding another left winger to a team that already has two was a great idea. Don’t get me wrong, Mbappé is a fantastic player, but he sure as hell **WASN’T** the player that Madrid needed. \n\nEveryone, Madridistas and neutrals, could see that Madrid needed a REAL number 9 to finally have the aerial threat that they had been lacking ever since Benzema left the club. Vini’s best season has been when he had a number 9 to rely on so what does Perez do after seeing that we need a number 9 and that Joselu has been a fantastic player when it comes to aerial threat despite being on loan? He buys another left winger because Galactico! The result is a disjointed attack with three guys that want to play on the left, leaving 34 years old Lucas Vazquez essentially playing as the RW and Valverde running from defence to attack just to cover the gaps left by Vazquez. But hey, the board is there to help, right? Of course not. We have bums that consider Eder Militao, 2 ACL injuries in two years by the way, the “signing” of next season. Bums who clearly see that we desperately need fullbacks but chose to renew Vazquez. Clueless idiots who will come out on an interview and say “we won two champions league, so everything will be okay” when we are getting outplayed by every big team either at home or away. When will this circus end? When will these human beings finally acknowledge that our squad depth is embarrassing and that spending 50 millions on Dean Huijsen who has been fantastic for Bournemouth and Spain isn’t something to be ashamed of? Is the club just a joke for them? I speak for every Madridista when I say that we love this club with passion and that we will continue supporting Real Madrid no matter what happens, but we are not idiots. We can see that the club is not going well and it is **INFURIATING** to see the people in power not doing a single thing to help this cause. Real Madrid is the greatest club in the world and a club with such a title should not be allowed to be so immature when it comes to transfers or squad depth. The board and Perez are supposed to be helping the manager with signings, so why aren’t they doing it?",
        "upvotes": 351,
        "comments": 88,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k102aa/football_is_played_on_the_pitch_not_on_social/"
    },
    {
        "id": "1k1c5la",
        "author": "UnderstandingBusy478",
        "title": "Why does real madrid have 3 of the top 5 left wingers in the world ?",
        "content": "Why on earth are vinicius, mbappe and rodrygo playing in the same team and AT ONCE ???\n\nVinicius is the team's attacking heartbeat for years now so no questions there. Rodrygo was a prodigy who was forced to get used to playing out of position due to his fellow prodigy vinicius, a tricky situation but it happens.\n\nMbappe. WHY the fuck did real madrid sign mbappe ??? and more importantly. Why the fuck did mbappe sign for madrid ?? Does neither mbappe nor mbappe's agent realize that he has nowhere to play in madrid ??\n\nEvery single time a coach has tried to play mbappe at ST they failed. Why did he and ancelotti and the everyone behind this signing think 27th time's the charm ? Or was the plan to rotate between him and vinicius ? the top 2 left wingers in the world fighting for 1 spot ? You already play a world class left winger out of position. now you have 2 playing out of position.\n\nThe fact that mbappe seems to actually be trying to play ST and isn't actively complaining makes me think he thought about this and thought he is gonna suddenly be a striker when he signs for madrid. But i think he is realizing day by day that won't happen. Or is very hard. Your natural position isn't something you can easily change at 26. Especially when you are the best in the world at it.\n\nImagine trying to play salah, the greatest right winger in PL history. as a striker or left winger even when he was 26 ? he'd be average at best. average as in mid to lower table level in the PL maximum.\n\nOr did ancellotti and everyone responsible for signings at madrid think they are playing fifa career mode ? i don't get it.\n\nThis reminds me of the coutinho signing for barcelona. They wanted a neymar replacement who could hug the touchline and provide width in the final third. They bought one of the best central playmakers in the premier league. absolute stupidity on both the player and the team's end. same thing here.",
        "upvotes": 24,
        "comments": 66,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k1c5la/why_does_real_madrid_have_3_of_the_top_5_left/"
    },
    {
        "id": "1k0qmg4",
        "author": "Bexewa",
        "title": "You all ready for tonight?",
        "content": "",
        "upvotes": 823,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/payas4zdi8ve1.jpeg?auto=webp&amp;s=0b59a87f84d003fdc893742420de48010c1900e3"
        },
        "permalink": "/r/realmadrid/comments/1k0qmg4/you_all_ready_for_tonight/"
    }
]