[
    {
        "id": "1lw9k8l",
        "author": "NishinosanTV",
        "title": "KPop Demon Hunters directors and music supervisor is doing an AMA on r/kpop today at 9 AM PT.",
        "content": "Hey r/netflix \n\nWe're being visited by some of the people behind KPop Demon Hunters today for an AMA on [r/kpop](https://www.reddit.com/r/kpop/). Notably the directors Maggie Kang and Chris Appelhans alongside the music supervisor Ian Eisendrath. The AMA starts at 9 AM PT.\n\nYou can send your questions in the thread attached to this post. Or, you can head on over directly to [r/kpop](https://www.reddit.com/r/kpop/) now, it'll be pinned at the top.\n\nNish\n\n[r/kpop](https://www.reddit.com/r/kpop/) modteam",
        "upvotes": 13,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lw9k8l/kpop_demon_hunters_directors_and_music_supervisor/"
    },
    {
        "id": "1lxi3wf",
        "author": "Whorelations",
        "title": "LIVE Tonight: Biggest Event in Women's Boxing History",
        "content": "You’ve probably seen this on your Netflix recommendations—but if not, tune into  ***Katie Taylor vs. Amanda Serrano 3***  live tonight at 8 PM EST, an all-women’s boxing event with international undercards and major titles on the line.\n\nThe event features fighters from the UK, Mexico, Brazil, Canada, the U.S., and Spain, showcasing a global roster of talent. One big name on the card is  *Chantelle Cameron*, who split two fights with Taylor—and never got a third, after Taylor declined the trilogy. That tension still lingers.\n\nIf you watched  ***Jake Paul vs. Mike Tyson***  in November 2024, you probably agree that the co-main stole the show. Tonight, that rematch is back—this time at *Madison Square Garden*. Hopefully Netflix’s servers hold up better this time; last time, glitches meant a lot of fans missed key moments.\n\nAs for the main event: Serrano lost the first fight, barely dropped the second by  *unanimous 95–94*, and left the ring with a nasty cut. She’ll be coming back for blood. Taylor, meanwhile, is looking to shut the door on the rivalry for good—**this bout is billed as the final chapter of their trilogy**.\n\nFrom top to bottom, this card is loaded. This is surely going to be a night to remember. ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1lxi3wf/live_tonight_biggest_event_in_womens_boxing/"
    },
    {
        "id": "1lyb0yq",
        "author": "Altruistic_Lad",
        "title": "Dear Netflix: Registering Is Now Worse Than Tedious",
        "content": "Netflix apparently has never heard that folks can have more than one residence. Does it learn that you visit the same places over and over. Oh no. You have to jump through all the registration and security hoops OVER AND OVER despite the fact that you've paid for unlimited use. Wake up, Netflix. You're not irreplaceable. ",
        "upvotes": 163,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1lyb0yq/dear_netflix_registering_is_now_worse_than_tedious/"
    },
    {
        "id": "1ly50vd",
        "author": "STARRIMS",
        "title": "LUPIN is my most favorite series ever.",
        "content": "I have tried so many series in Netflix, and I don't even last one episode; from Money Heist to House of Cards to Dark. Whereas I was so Intrigued to Lupin in 2023, I login Netflix just to Re-Watch LUPIN again and again.\n\nI even stared reading Arsene Lupin and love my time in it. Eagerly waiting for Lupin part 4.\n\n  \nI am just asking who explore Netflix a lot, is there anything alike LUPIN?",
        "upvotes": 43,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ly50vd/lupin_is_my_most_favorite_series_ever/"
    },
    {
        "id": "1ly3h6v",
        "author": "BackgroundEscape9250",
        "title": "Wtf should I watch",
        "content": "I have been trying to find a good series on Netflix (located in EU) but after the first episode I can’t focus because it’s so boring. \n\nWhat i like to watch: \n\n- Brooklyn 99\n- Ghosts  \n- Tires \n- The residence \n- Arrested development \n- A shop for killers \n- Sirens \n\nSomething like the above, please. Yesterday I ate my whole burrito just surfing Netflix trying to find something. My food gets cold. Pls help. ",
        "upvotes": 25,
        "comments": 106,
        "media": null,
        "permalink": "/r/netflix/comments/1ly3h6v/wtf_should_i_watch/"
    },
    {
        "id": "1lxmun8",
        "author": "Few_Substance_705",
        "title": "\"Too much\" is just \"Girls\" repackaged and its cringe and out of touch.",
        "content": "HOT TAKE!! I am yet to meet the Lena Dunham/ Girls Stans. \n\nFor the life of me I couldn't understand who resonated with \"Girls\" the entire premise was a selfish, spoiled jewish chick who made terrible decisions and then became the victim of her own sabotage. Fast forward to I was on a 9 hour flight last night and downloaded \"too much\" on Netflix, within the first few mins it felt familiar. And then when I saw Lena Dunham in the second episode It hit me. The main character is Lena Dunham in \"Girls\" and this entire show is \"Girls\" repackaged and set in London. EVEN her love interest looks and acts like exactly Adam!! \n\nThe worst part is in an interview Lena Dunham said this show was meant to resonate with Gen Z. How???!! I am a millennial who works in marketing and even I know Its so out of touch! ",
        "upvotes": 143,
        "comments": 358,
        "media": null,
        "permalink": "/r/netflix/comments/1lxmun8/too_much_is_just_girls_repackaged_and_its_cringe/"
    },
    {
        "id": "1lygv14",
        "author": "PrimaryMental7068",
        "title": "Where has everything gone",
        "content": "I was going to continue watching my movie and all the movies and shows not made by Netflix are gone for some reason \nPlease help I just Want to watch the matrix🙏",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lygv14/where_has_everything_gone/"
    },
    {
        "id": "1lxv5kx",
        "author": "S4v1r1enCh0r4k",
        "title": "Squid Game Creator Keeps Door Open for Season 4: \"Never Say Never\"",
        "content": "",
        "upvotes": 27,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1lxv5kx/squid_game_creator_keeps_door_open_for_season_4/"
    },
    {
        "id": "1lyglk0",
        "author": "ladybug188",
        "title": "Cant log in",
        "content": "I have my Netflix account opened on me and siblings mobile but when im trying to open on my pc it keep leading me to making new account/membership \nLike asking card details and saying start membership \nI just wanna log in into my existing account ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyglk0/cant_log_in/"
    },
    {
        "id": "1lyg5lv",
        "author": "Eastern-Rabbit-3696",
        "title": "Brick (2025)?",
        "content": "I swear to god this movie has been on Netflix's \"worth the wait\" list for what has been like 4 years now and they put out a trailer only a week or so ago.\n\nThey gave some sort of vibe that it was going to be a chamber piece w/ a couple stuck in an apartment with a brick wall but it just turns out to be some kind of Temu Cube mess. I wonder what happened?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyg5lv/brick_2025/"
    },
    {
        "id": "1ly62op",
        "author": "Second-Fickle",
        "title": "Too much on Netflix",
        "content": "What a beautiful series !!! \nLove every scene every episode \nFlashbacks of past lives , memories , emotions and the characters \nWhat are your fav scenes \n",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ly62op/too_much_on_netflix/"
    },
    {
        "id": "1ly6ka4",
        "author": "Makuta_Servaela",
        "title": "Suggestions for Drama Shows like House that are good for Listening",
        "content": "I need something to listen to while I work, that I don't have to watch directly. I've watched through House and The Resident so far, the former being perfect for what I needed (The Resident's romancy side-plots were a bit boring for me). The things that made House perfect was:\n\n- Serious overall show with some comedy/wittiness. (No Sitcoms or pure comedies or whatnot. I like a good plot).\n\n- Each hour episode has its own story. The season has an overall storyline, but each episode itself has its own story that is concluded by the end of the episode. (So, no Audiobooks or Podcasts)\n\n- The mystery element, where the protagonists are spending the episode trying to figure something out, and the something is satisfyingly figured out by the end of the episode.\n\n- Most importantly: The protagonists describe what's going on. In House, the characters would describe down to the detail each symptom they were seeing, the ways the diseases affected the patient, etc. \n\n- Also, I know there's one or two that are basically \"House, but it's about Psychiatry\". None of that. I am in the field of Psychology, I would be too offput by the inaccuracies.\n\nAny suggestions?\n\nI might try out one of those lawyer detective ones, like Law and Order or whatnot, but I don't know which ones of those would be a good fit. But open to other suggestions as well.\n\nThank you!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ly6ka4/suggestions_for_drama_shows_like_house_that_are/"
    },
    {
        "id": "1lye0xf",
        "author": "SoMuchEpic95",
        "title": "Ads while watching Netflix.",
        "content": "Sometimes I feel like I hit the jackpot and I don’t see any ads at all while I’m watching something. And then other times there’s a two or three minute ad sequence every 10 or 15 minutes during my show.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lye0xf/ads_while_watching_netflix/"
    },
    {
        "id": "1lydsbh",
        "author": "bailsjay19",
        "title": "Algorithm",
        "content": "Surely there is a way of making the algorithm realise that I have watched certain shows and to stop them coming up again and again, \nthe only section this should be in is watch again but so many shows will show up in every category of the algorithm even though I have completed the series years ago….\nI feel it’s hard to even concentrate on finding a new show to watch as all the subscription services seem to have made such a mess of there algorithms \nAgree or disagree? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lydsbh/algorithm/"
    },
    {
        "id": "1lyd6ts",
        "author": "Kjayden69420",
        "title": "Looking for more shows to watch, suggestions?",
        "content": "We have more than just Netflix, so far my fiance and I have watched Ginny &amp; Georgia, shameless, the last of us, and you. We have very different tastes but are looking for middle grounds, we want shows similar to these but we love the chaos of shameless. We will look into any recommendations, but she does not watch movies so just stick to shows. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lyd6ts/looking_for_more_shows_to_watch_suggestions/"
    },
    {
        "id": "1lyd5bx",
        "author": "JamesMason580",
        "title": "Netflix Household Issue",
        "content": "Bit of backstory, currently living in RV for work a few states away, traveling home when I can \\~once per month.\n\nMy wife and I have been watching Grey's Anatomy on Netflix together for along time now, however as of \\~one month ago, we cannot do this anymore, one of us gets a message saying the TV is not part of the Netflix household. If we change the household, it kicks the other person off and makes them do the same thing. I cannot even AirPlay to the TV or Cast anymore, Netflix blocks it in app or just won't play the episode.\n\nI may have dealt with this until the point where I called customer service on the Netflix app, and after going back and forth with the CSR for a bit, with them trying to tell me I could click the \"I'm away from home\" option (which there was not on the TV), then telling me there was absolutely nothing they can do, no one to escalate to, and that the only thing he could do was \"educate (me) on the way Netflix works now)\". I hung up at that point, and canceled my subscription.\n\nSorry Mr. No-Name CSR, I don't require your education, we'll find something else.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lyd5bx/netflix_household_issue/"
    },
    {
        "id": "1lycl7t",
        "author": "ResolutionPretty8249",
        "title": "Netflix glitching for only one show",
        "content": "Hey guys thought this was fun (not really). Wanted to watch The Girl in the Mirror but every time I click it it starts playing the first episode and I can't see the menu or synopsis or episodes. And it just starts over not even from the beginning. I can't fast-forward or rewind. Thought you guys would love to see it.",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hot6p2yzoicf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lycl7t/netflix_glitching_for_only_one_show/"
    },
    {
        "id": "1ly1xc6",
        "author": "Intelligent-Law-5066",
        "title": "Fubar Season 3? Donnie and Carter",
        "content": "I am not sure everyone feels about Season 2 but although there is the ridiculous aspects of it (bumping off satellite etc.) I still generally enjoyed the show and hope there is a Season 3. \n\nBut what I kinda of liked was Donnie and Carter 'adventure' I mean I wouldn't mind like a spinoff for them. Not sure how those 2 will return for Season 3 lol.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ly1xc6/fubar_season_3_donnie_and_carter/"
    },
    {
        "id": "1ly2uid",
        "author": "DependentWise9303",
        "title": "The real Project X",
        "content": "Spoiler alert! So many things to say here. \n\nFirst of all are these grown as* men so proud of themselves so many years later. Also this POOR girl whose birthday has now been forever connected with the death of two innocent women. \n\nWhen she said the line at some point my dad was called and told two girls died and hee facial expressions from knowing shes filmed to wanting to break down to trying to numb herself man I felt this in my core. \n\nMy cousin died on my birthday 10 years ago - she was sick her entire life and I still have nightmares about it. \n\nBut one thing that impressed me is how the Dutch no thanks to the useless major and cops cleaned up their own town the day after. This is something I see in Netherlands/ Sweden that I really feel we can learn from. \n\nResponsibility and community. \n\nAnyway overall i enjoyed the entire series one by one and the ones i didn’t know about even more than Astro world which I already knew about. \n\nPoop cruise ie prob still number one but its a good series albeit filled with what not to do. Unfortunately we know humans and history has a way if repeating itself. ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ly2uid/the_real_project_x/"
    },
    {
        "id": "1lxyv51",
        "author": "Horror_Low_6881",
        "title": "Want some suggestions being new on netflix",
        "content": "what are some shows and movies would you recommend I also like animes. I have not used netflix before so I was wondering what is worth watching I already know popular names like money heist, demon slayer, squid game etc.. Still curious recommend me your favs and some underrated and niche titles as well",
        "upvotes": 3,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1lxyv51/want_some_suggestions_being_new_on_netflix/"
    },
    {
        "id": "1ly86q2",
        "author": "crosstheroom",
        "title": "Does King of Tupelo get any better?",
        "content": "It was a struggle just to get thru the first episode.  Seemed like a lot of nothing happening and Elvis nonsense and didn't get any better by the end, but if it does get better let me know.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ly86q2/does_king_of_tupelo_get_any_better/"
    },
    {
        "id": "1lxjvp7",
        "author": "No_Restaurant9741",
        "title": "Just started watching Alice in borderland",
        "content": "Wanted to fill the empty hole I had since Squid Game ended so started watching Alice in borderland. Currently on episode 3 and I am going into the series completely blind.",
        "upvotes": 37,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1lxjvp7/just_started_watching_alice_in_borderland/"
    },
    {
        "id": "1ly5uy3",
        "author": "UnlitBlunt",
        "title": "Why does the brightness slider only effect subtitles and not the actual brightness of the picture?",
        "content": "On mobile (Google Pixel 9) when adjusting the brightness slider on the side of the screen only the subtitles and menu get brighter while the picture does not. Changing the brightness on my actual phone does nothing either. This has been going on for years across various devices, is there a fix for this? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ly5uy3/why_does_the_brightness_slider_only_effect/"
    },
    {
        "id": "1ly5uos",
        "author": "filipduki1222",
        "title": "Top Characters in Squid Game",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ly5uos/top_characters_in_squid_game/"
    },
    {
        "id": "1lxzm1p",
        "author": "Significant_Two_7727",
        "title": "Netflix recommendations",
        "content": "Iso documentary true crime recommendations on Netflix. I just recently went back to Netflix cause it had got boring after awhile but I see it has hooded some  good stuff to it now.. I just watched last night the documentary of Fred &amp; rose west &amp; I never heard of them before.. it was a good one &amp; I love true crime, so looking for more to watch that haven't seen yet. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lxzm1p/netflix_recommendations/"
    },
    {
        "id": "1ly33il",
        "author": "Mulletville",
        "title": "login quesion",
        "content": "I added my elderly in-laws to my plan some time ago but now they can't log-in on a new device because they don't have the email anymore that directed them how to sign in.  I can't figure out how to send a new email to them with their directions.  The only option I can see seems to require that I remove them as an extra member and then add them back in again.  Am I missing something?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ly33il/login_quesion/"
    },
    {
        "id": "1lyas6o",
        "author": "snowdn",
        "title": "Netflix Uses AI for Overdubbing Now",
        "content": "Thoughts on Netflix using AI speech to overdub their shows in other languages? Just heard about it on the Wired Uncanny Valley podcast and was curious what others think.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lyas6o/netflix_uses_ai_for_overdubbing_now/"
    },
    {
        "id": "1lya9xm",
        "author": "SometimesWitches",
        "title": "What not Netflix created show…",
        "content": "What not Netflix created show would you like to see picked up by Netflix just to watch the new crop of fans discover it for the first time.\n\nMine is The Americans ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lya9xm/what_not_netflix_created_show/"
    },
    {
        "id": "1lx24tv",
        "author": "jenkinsvr",
        "title": "I just want to say... Thank You Netflix",
        "content": "Wow, thank you so much Netflix. I just recently got into the show, Into the Night. I was hooked from the first episode, fully invested, and halfway through, I had that creeping realization: “Oh no… this feels canceled.” And of course, I was right!\n\n No official announcement, no goodbye, just radio silence. Honestly, it’s such a bold move to lure viewers in with such great storytelling only to pull the plug without warning. Truly inspiring.\n\nWho needs closure or a satisfying conclusion when you can just leave characters and audiences dangling in a void of unfinished arcs? The way you cancel shows based purely on streaming data instead of giving them time to grow? Absolutely visionary. \n\n\nNothing says “we value your time” like pulling the rug mid-binge. Really, Netflix, thank you for reminding me not to get emotionally attached to anything on your platform ever again. Great job keeping disappointment fresh and consistent!\n\n",
        "upvotes": 167,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1lx24tv/i_just_want_to_say_thank_you_netflix/"
    },
    {
        "id": "1lxz2ji",
        "author": "Maxterair",
        "title": "Do some series vanish momentarily?",
        "content": "I was watching Arcane, got an internet problème then i left and done something else. An hour later when the internet came back, i tried to resume where i left but i can't find Arcane on Netflix.\n\nSome other series as Breaking Bad are gone too. Does this probleme happen and is fixed fast? Same thing on my pc and phone.\n\nEdit : i have changed the profile within the same account and could watch again theze series. But still, why can i not with the first profil? (Same settings)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lxz2ji/do_some_series_vanish_momentarily/"
    },
    {
        "id": "1lxsfy7",
        "author": "AlyBlack96",
        "title": "Controversial opinion about You season 5",
        "content": "Just finished the (hopefully) final season of You and I couldn't help but check what other people thought about it. Unsurprisingly... everyone hated it. But I just can't help but wonder, what did y'all expect? You is perfect trash TV, it's corny and silly and ridiculous. It has been this way since season 2. The acting is exaggerated, the plot twists are wild, the themes are spelled out, nothing about it is subtle or refined... and that's okay!! It's fun! I love just sitting down and watching something that's manufactured to be purely entertaining. You is a show that pretends to be deep but in reality it's just fast food television, and I don't get why people are taking it so seriously and getting so upset about it, let alone expecting an amazing finale when the show has been kind of bad for the longest time. This ain't Game of Thrones guys. The finale was fitting for what the rest of the show was like, it was over the top and silly and I enjoyed it very much! :D",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lxsfy7/controversial_opinion_about_you_season_5/"
    },
    {
        "id": "1lxx1gy",
        "author": "madame_eda101",
        "title": "What goes in the space: Jin_",
        "content": "With K-Pop Demon Hunters, some people might say Jinu.\n\nWith Arcane, some people might say Jinx.\n\nOr maybe you said neither. What did you think of when you saw the space? Just wondering. There are no correct/incorrect answers. :)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lxx1gy/what_goes_in_the_space_jin/"
    }
]