[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 498,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 17,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jpqjpy",
        "author": "dailystar_news",
        "title": "Bodybuilder Netflix star dies 'on treadmill at gym' day after chilling selfie",
        "content": "",
        "upvotes": 116,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1jpqjpy/bodybuilder_netflix_star_dies_on_treadmill_at_gym/"
    },
    {
        "id": "1jpki86",
        "author": "Aman_S7",
        "title": "Con Mum",
        "content": "I know this is the millionth post on con mum but I just saw it last night and WTF? I do NOT feel bad for Graham, after a point I couldn’t. He left heather and his NEW BORN alone and says it was for the betterment of their family, I think it may have been at first but after that he lost the plot on why he was actually in Switzerland with Dionne. Iirc it’s not been revealed right how Dionne was able to make all the hotel staff, concierge and lawyers work with her? I felt so so infuriated for heather, that poor woman. ",
        "upvotes": 42,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1jpki86/con_mum/"
    },
    {
        "id": "1jpfm2h",
        "author": "anymoose",
        "title": "Did they change the algorithm?",
        "content": "I swear 50% of my \"recommendations\" lately are for things I've already watched and rated. Any way to stop that?\n\nI don't mind seeing the occasional \"watch it again\" feed but things I've already rated should not be in \"we think you'll love this!\" or in any category with the word \"new\" in the title....",
        "upvotes": 28,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1jpfm2h/did_they_change_the_algorithm/"
    },
    {
        "id": "1jpow8y",
        "author": "intelerks",
        "title": "'Once Upon a Time in Hollywood' sequel on Netflix: David Fincher helms film written by Quentin Tarantino starring Brad Pitt",
        "content": "David Fincher is set to direct a sequel to *Once Upon a Time in Hollywood*, with Quentin Tarantino penning the script for the follow-up to his Academy Award-winning film. The project, confirmed by *Variety*, does not yet have an official title but is being developed at Netflix, where Fincher holds a first-look deal. Brad Pitt will reprise his role as Cliff Booth, the stuntman with a dark past. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jpow8y/once_upon_a_time_in_hollywood_sequel_on_netflix/"
    },
    {
        "id": "1joz0iv",
        "author": "-Xoz-",
        "title": "Adolescence to be shown in UK schools for free as British PM Keir Starmer meets creators",
        "content": "",
        "upvotes": 163,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1joz0iv/adolescence_to_be_shown_in_uk_schools_for_free_as/"
    },
    {
        "id": "1jp921p",
        "author": "Dommichu",
        "title": "'Adolescence' co-creator says 'maybe we're all accountable' for youth violence",
        "content": "Fabulous interview with Stephen Graham on the development and filming of Adolescence!  Like… I was in complete awe in the scene shot at the school!  Post Covid, to see so many extras in a scene and how natural and flowing it all went with so much going on!  Turns out a lot of the extras went to that school!  What pros!  \n\nWorth a listen to learn about the show and Stephen himself.  ",
        "upvotes": 35,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1jp921p/adolescence_cocreator_says_maybe_were_all/"
    },
    {
        "id": "1joqfkr",
        "author": "Salt-Lake5807",
        "title": "I just finished the Adolescence",
        "content": "As a father of a boy and a daughter (both under 12yr) this serie really hit me hard. Especially third third and the fourth episode. Jamie being interviewed by the therapist was something I've never seen before. You can feel the rage and anger the boy is holding inside of himself. The acting was just perfect.\n\nThe final episode blew me away. When Jamie called and said that he's gonna plea guilty I just stopped breathing. The reactions of the parents and the sister were so real and heartfelt. \n\nI started to cry at the end of the final episode when Lisa (sister) came and said \"Jamie is ours\".  As the dad went to Jamie's room I was blubbering. I'm still weeping as I'm writing this.\n\nNever ever has a movie or a serie made me feel so much. Made me think about my own kids and the world they're living. ",
        "upvotes": 462,
        "comments": 265,
        "media": null,
        "permalink": "/r/netflix/comments/1joqfkr/i_just_finished_the_adolescence/"
    },
    {
        "id": "1jptc40",
        "author": "StatisticianJolly670",
        "title": "Do y'all agree Netflix needs to release a revised extended version of Cobra Kai Season 6 because they just rushed through everything and didn't give enough time to explain everything?",
        "content": "Sign the petition here [https://www.change.org/p/release-a-revised-extended-version-of-the-entire-season-of-cobra-kai-season-6?recruiter=1365616085&amp;recruited\\_by\\_id=5172da60-ecd7-11ef-8d5a-fb8b564fd844&amp;utm\\_source=share\\_petition&amp;utm\\_campaign=psf\\_combo\\_share\\_initial&amp;utm\\_term=psf&amp;utm\\_medium=copylink&amp;utm\\_content=cl\\_sharecopy\\_490424593\\_en-US%3A9](https://www.change.org/p/release-a-revised-extended-version-of-the-entire-season-of-cobra-kai-season-6?recruiter=1365616085&amp;recruited_by_id=5172da60-ecd7-11ef-8d5a-fb8b564fd844&amp;utm_source=share_petition&amp;utm_campaign=psf_combo_share_initial&amp;utm_term=psf&amp;utm_medium=copylink&amp;utm_content=cl_sharecopy_490424593_en-US%3A9)",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jptc40/do_yall_agree_netflix_needs_to_release_a_revised/"
    },
    {
        "id": "1jptag2",
        "author": "Harssdip",
        "title": "This what r/grok thinks about \"Class\"",
        "content": "First off, this show is a melodramatic mess that tries so hard to be edgy it forgets to be good. It’s like someone watched Gossip Girl, 13 Reasons Why, and a Bollywood soap opera, then threw them in a blender with a splash of sanctimonious social commentary. The result? A steaming pile of clichés dressed up as a prestige drama. Rich kids snorting coke off their iPhones while sneering at the poor scholarship kids—groundbreaking stuff, right? I’ve seen more originality in a fast-food menu.The plot follows three \"outsiders\" crashing the elite Hampton International School, where everyone’s either a drug-addicted trust fund brat or a saintly victim of the system. It’s so predictable you can set your watch to it: bullying, sex, murder, rinse, repeat. The writers clearly thought, “Let’s take Elite, swap Spain for India, and add caste issues—boom, instant depth!” Except it’s not deep—it’s a shallow puddle pretending to be an ocean. The class divide stuff is so heavy-handed it feels like a lecture from a sociology professor who’s mad you didn’t do the reading.And the characters? Oh boy. They’re less people and more walking stereotypes. You’ve got the brooding bad boy who’s secretly sensitive (yawn), the rich girl with daddy issues and a pill habit (double yawn), and the poor kid who’s just so noble it hurts. The dialogue is a cringe-fest—half the time they’re spouting lines that sound like they were ripped from a teen fanfic, and the other half they’re trying to be profound but landing somewhere between fortune cookie wisdom and a WhatsApp forward. “Money can’t buy happiness, but it can buy silence”? Spare me.The sex scenes—because of course there are sex scenes—are so gratuitous they feel like the show’s saying, “Look, we’re mature! We’re bold!” Nah, you’re just pandering. It’s softcore porn with a side of sanctimony, and it’s about as erotic as a tax audit. Meanwhile, the murder mystery that’s supposed to keep us hooked is so convoluted and poorly paced you’ll stop caring who did it three episodes in. Spoiler: it’s probably the script that killed any chance this show had.The production values are slick, I’ll give it that. The school looks like a billionaire’s wet dream, and the soundtrack’s got some bangers. But it’s all lipstick on a pig. Class wants to be a biting critique of privilege, caste, and inequality, but it’s too busy drowning in its own excess to say anything meaningful. It’s the TV equivalent of a rich kid slumming it for Instagram likes—fake deep and full of itself.So, if you’re an adult looking for something with actual substance, skip this overhyped trainwreck. Watch Elite if you want the same vibe done better, or hell, just rewatch Mean Girls—at least it knows it’s trashy and owns it. Class? It’s a detention-worthy disaster that deserves to be expelled from your queue.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jptag2/this_what_rgrok_thinks_about_class/"
    },
    {
        "id": "1jpsqj3",
        "author": "abhilash512",
        "title": "Big Return post WWE WrestleMania 41",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jpsqj3/big_return_post_wwe_wrestlemania_41/"
    },
    {
        "id": "1jpolyg",
        "author": "Somethingman_121224",
        "title": "Finn Wolfhard Says Filming 'Stranger Things' Season 5 Was \"Super Emotional\"",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jpolyg/finn_wolfhard_says_filming_stranger_things_season/"
    },
    {
        "id": "1jpoau6",
        "author": "indiewire",
        "title": "Finn Wolfhard Teases 'Stranger Things' Final Season",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jpoau6/finn_wolfhard_teases_stranger_things_final_season/"
    },
    {
        "id": "1jpktte",
        "author": "Slamboi83",
        "title": "something Gripping",
        "content": "Get based in UK as suddenly feel like I watched almost everything but obviously that will be impossible so if anyone has any good advice on something new to watch that I might have scrolled right past and thought looking at it won’t enjoyed as ready to have my mind changed. Looking for something gripping and that I can hopefully want to sit and watch it all as have week off and bored ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jpktte/something_gripping/"
    },
    {
        "id": "1jpgz02",
        "author": "V01D3Y3",
        "title": "Netflix on Xbox not working (description)",
        "content": "90% of the time when I try and click resume on any show it will take at least a minute to load, and when it does load it's extremely bad quality. When it doesn't take long to load it usually isn't bad quality but now it seems unavoidable and it's making the show I'm watching just unwatchable. Does anyone know any solutions",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jpgz02/netflix_on_xbox_not_working_description/"
    },
    {
        "id": "1joqis7",
        "author": "Loose_Clock609",
        "title": "Gone Girls: The Long Island Serial Killer' - Are the cops morons or just in on it?",
        "content": "Why was the docuseries made? We literally learned nothing new about the case or the victims. \n\nI don't believe the cops are this incompetent. It's impossible for any police department this large to be so stupid. With all the technology we have available, how are these cases still so unsolved or at least identify the victims. Either a cop did it or some rich guys with kinks pay them to look the other way\n \nIt's definitely more than one killer in the area. I wouldn't go from burlap sacks to dismemberment to just random dumpings... Rex isn't the only killer. \n\nI thought the documentary would answer big questions like, who are the other victims? Who is the baby? Who was the male? Nope...\n\nAnd if I hear the journalist says she's shocked again... \n\n ",
        "upvotes": 44,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1joqis7/gone_girls_the_long_island_serial_killer_are_the/"
    },
    {
        "id": "1jpfw8x",
        "author": "Due_Doughnut7352",
        "title": "Downloads almost always tell me that “this is the end of the download” despite being 100% downloaded.",
        "content": "Can’t find anyone that asked about this so i’m asking here. I’m on IOS (Iphone 14) and am trying to watch the Good Place. Now I downloaded all of season one but every time I would go to watch it, despite telling and showing the episode as fully downloaded, usually 5-10 minutes into the episode an error message would show up indicating that I only downloaded up to that point. Please help, it’s so gd annoying 😭 thanks in advance ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jpfw8x/downloads_almost_always_tell_me_that_this_is_the/"
    },
    {
        "id": "1jpb0ae",
        "author": "CrimsonRaven7",
        "title": "Show disapearing on home wifi but reapearing on data and on other wifi networks",
        "content": "My sisters netflix (doesnt have reddit) suddenly stopped allowing her to watch Grays anatomy on nextflix while connected to our home wifi (spectrum). Turning off Wi-Fi on her phone makes it show back up. It shows  on wifi other than our own and on data. Anyone know why?\n\nEdit:. My mothers works fine and shows Grays. My sisters phone and laptop do not show Grays. If she connects to any other wifi Grays comes back.  Seems like something is causing her account on this specific wifi to not show Grays. No other shows disapear that she can tell. Its really weird",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jpb0ae/show_disapearing_on_home_wifi_but_reapearing_on/"
    },
    {
        "id": "1jpomzo",
        "author": "Fritja",
        "title": "The Hard Sell of Meghan’s Soft Life",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jpomzo/the_hard_sell_of_meghans_soft_life/"
    },
    {
        "id": "1jpdev8",
        "author": "AIONisMINE",
        "title": "stupid question.... but just want to make sure. Cancelling netflix while having a giftcard balance",
        "content": "i have a significant netflix credit balance due to giftcard.\n\ni dont have any other payment method attached to my netflix account.\n\nwill there be any issues if i were to cancel my netflix subscription?\n\nmy netflix credit will still be there untouched until i decided to subscribe again, correct?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jpdev8/stupid_question_but_just_want_to_make_sure/"
    },
    {
        "id": "1jozl4t",
        "author": "McNasty420",
        "title": "This day in history- Will Arnett narrates Netflix Live",
        "content": "This was from April Fools many years ago, I can't remember when exactly.  It is Will Arnett narrating video of an office.  The funniest thing ever. \n\n[https://www.youtube.com/watch?v=ZbsRwH2jbac](https://www.youtube.com/watch?v=ZbsRwH2jbac)",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jozl4t/this_day_in_history_will_arnett_narrates_netflix/"
    },
    {
        "id": "1jpaal5",
        "author": "DaBoiYeet",
        "title": "How can I get more audio language options?",
        "content": "I have been using the app to watch animes, and frankly I prefer watching it dubbed in english. \n\nI moved to Netflix recently to watch them and something I've been kinda peaved at is the fact that most of them only have the original Japanese dub (Fair enough, makes sense), and then some other miscelaneous language that isn't english. One Piece, for example, only shows me the options for Japanese and Portuguese (My region, sure), but Oshi no Ko only has Japanese and German.\n\nIs there any way I can add the english dubs to shows? I tried changing my app's language to english, but even still the options haven't changed.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jpaal5/how_can_i_get_more_audio_language_options/"
    },
    {
        "id": "1jpl8sk",
        "author": "Available_Can7525",
        "title": "Are Alicia and Tim from Love Is Blind: Sweden still together?! We've found MAJOR evidence",
        "content": "[https://realitytvshrine.com/2025/04/02/are-alicia-and-tim-from-love-is-blind-sweden-still-together-weve-found-major-evidence/](https://realitytvshrine.com/2025/04/02/are-alicia-and-tim-from-love-is-blind-sweden-still-together-weve-found-major-evidence/)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jpl8sk/are_alicia_and_tim_from_love_is_blind_sweden/"
    },
    {
        "id": "1jp96py",
        "author": "Roxith",
        "title": "Netflix Removed Qin Empire Alliance Season 1?",
        "content": "I watched Qin Empire season 1 on Netflix and it was so good. I wanted to go back to it but now see that only season 2 is there. What happened? How can I get back to it? Or is it gone forever?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jp96py/netflix_removed_qin_empire_alliance_season_1/"
    },
    {
        "id": "1joq985",
        "author": "fuckbeck",
        "title": "Cancelled shows",
        "content": "I’m finally making the move and decided to cancel my Netflix membership. \nWhy keep giving them time when they waste our own time on bs like giving us a season or two then canceling them on cliffhangers.\nI understand this isn’t new to the industry but well reviewed shows did not get cancelled in the past television era in media.\nThe two big straws that broke me were my time commitments to Archive 81 and the more recent Kaos.\nLet me know your thoughts or similar sentiments on any other shows you’re angry and felt time was wasted by them ",
        "upvotes": 14,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1joq985/cancelled_shows/"
    },
    {
        "id": "1jp925g",
        "author": "No_Quantity_7225",
        "title": "Unlocked: Jail experiment  - Is experiment valid?",
        "content": "Currently only on the start of first episode. But I am already questioning the premise of the whole show. They run an \"experiment\" but I dont believe you can film a high quality show without prisoners knowing that they are being filmed and that they are gonna be on TV show. So they are bound to be more nice because all actions are recorded on cameras for Netflix itself. Doesnt it make data collected from experiment invalid? I really want to watch it to the end but I have mixed feelings knowing that these results do differ from those if experiment was ran without Netflix presence.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jp925g/unlocked_jail_experiment_is_experiment_valid/"
    },
    {
        "id": "1jp8mil",
        "author": "Express-Resident-191",
        "title": "Younger",
        "content": "I recently started to watch Younger and I love this show. I just got to season 4 and I feel fired up about Kelsey moving in with Josh. How could she?! Ugh!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jp8mil/younger/"
    },
    {
        "id": "1jonklp",
        "author": "Cena_Beana",
        "title": "can someone recommend me a show that hasn’t been canceled/is finished",
        "content": "I just finished Good Girls to find out that it left on a really interesting cliffhanger and it was canceled 💔\nI am so disappointed every time I watch a show and I look up if there’s gonna be a next season and news flash ITS ALWAYS CANCELLED, im open to any recommendations please helpppp ",
        "upvotes": 15,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1jonklp/can_someone_recommend_me_a_show_that_hasnt_been/"
    },
    {
        "id": "1jp4guf",
        "author": "magical_muderfucker",
        "title": "Netflix won't work with my data",
        "content": "Hi there\nSo, my living condition makes it so that I'm forced to use a phone as am internet source, via hotspot, to my house, including my tv\nAnd everything was fine untill a few weeks ago, when I tries to watch Netflix, and it doesn't work\nIt works untill I click on a show to watch, and then it gets stuck on a 0% loading wheel for a while untill it opens the Netflix troubleshooting page, where it check my internet, confirms everything is working great and tells me it's good to watch\nAnd then the cycle repeats \nI've changed phones and nothing, but every other streaming service works, and if I connect my tv to my GFs phone, Netflix works like a charm\nThe card provider wasn't any help, and I'm paying for this shit so I'd like It to work\nIs there anything I can do?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jp4guf/netflix_wont_work_with_my_data/"
    },
    {
        "id": "1jp7rsb",
        "author": "bludhavengabagool",
        "title": "Jack Schumacher from the upcoming show Ransom Canyon had to learn how to ride a horse for the show",
        "content": "It turns out that one of the actors from Ransom Canyon, Jack Schumacher, didn't know how to ride a horse when he was cast in the show. So he spoke about the training process which is pretty interesting ([full article here](https://www.thepopverse.com/tv-ransom-canyon-netflix-horse-training-jack-schumacher)) ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jp7rsb/jack_schumacher_from_the_upcoming_show_ransom/"
    },
    {
        "id": "1jpf59j",
        "author": "universalbacon1",
        "title": "Big bang theory removed",
        "content": "So i sit down to watch the big bang theory and it's just gone with no warning usually it says \"leaving soon\" under it but no it just vanished same thing happend with vampire diaries.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jpf59j/big_bang_theory_removed/"
    }
]