[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 489,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hyalkj",
        "author": "Sudden_Pop_2279",
        "title": "'Squid Game' Season 2 Becomes Netflix's 2nd Most Popular Non-English Show Ever With 126 Million Views",
        "content": "",
        "upvotes": 928,
        "comments": 115,
        "media": null,
        "permalink": "/r/netflix/comments/1hyalkj/squid_game_season_2_becomes_netflixs_2nd_most/"
    },
    {
        "id": "1hyo1pm",
        "author": "SnooCauliflowers4833",
        "title": "What makes Squid Game more popular compared to Alice in Borderland when most people seem to say the latter is a way better death game show?",
        "content": "\nI’ve read a lot of reviews on both series and people keep comparing those two. I know one is way more popular than the other but people seem to agree that AiB has way more deadly and better quality games overall?, which made me curious about what made the series less popular then. \n\nIs this just for a marketing? What made the difference?",
        "upvotes": 97,
        "comments": 117,
        "media": null,
        "permalink": "/r/netflix/comments/1hyo1pm/what_makes_squid_game_more_popular_compared_to/"
    },
    {
        "id": "1hydunw",
        "author": "UnRegularConfidence3",
        "title": "Who TF greenlit all these shitty Harlan Corban series???",
        "content": "Rant coming.. I have not made it through 1 episode on any of them.  The main character is always so infuriatingly stupid it makes my want to punch a hole in my TV.  This last one, a detective inspector blags her way into prison to question the cold blooded assassin that murdered her father. She proceeds to cry and beg him to tell her why sir, why'd you kill my daddy??, which unsurprisingly doesn't work. Then the nurse drugs him, tells her she only has a few minutes to get the truth out of him.  He reveals he was paid to take the fall for the murder, and she decides to argue with him. But you confessed! They found the weapon on you! I am guessing a DI doesn't know what paid to take the fall means?  Only after a few minutes does she finally ask \"who paid you?\" Of course too late, he has passed out. Then she crys more.  Christ on a cracker, are the books this stupid too? How does this guy have a career.  ",
        "upvotes": 227,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1hydunw/who_tf_greenlit_all_these_shitty_harlan_corban/"
    },
    {
        "id": "1hyum6b",
        "author": "limsus",
        "title": "Looking for the Best Murder Mystery Movies (No Web Series, Please!) ",
        "content": "Hey everyone! \n\nI'm looking for some great murder mystery movies to watch. I’m not interested in web series, just standalone films. Any recommendations for suspenseful, well-crafted mysteries would be greatly appreciated. Thanks in advance! ",
        "upvotes": 8,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hyum6b/looking_for_the_best_murder_mystery_movies_no_web/"
    },
    {
        "id": "1hyznwo",
        "author": "Horror_Effective12",
        "title": "American Primeval Review - Does the show fulfil its potential?",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hyznwo/american_primeval_review_does_the_show_fulfil_its/"
    },
    {
        "id": "1hyzll0",
        "author": "No_Tomorrow3907",
        "title": "4k option ",
        "content": "So I just got a 4K TV and when I opened Netflix it came with a popup about streaming with 4k or 1080p but my partner accidentally clicked on 1080p but now I can’t find this popup anywhere now, can someone help me figure out how to stream in 4K? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hyzll0/4k_option/"
    },
    {
        "id": "1hyk9jb",
        "author": "JOMO_Kenyatta",
        "title": "So the Netflix top 10 is the current most popular films on the site, right?",
        "content": "I’m watching rush hour and it says it’s too 10? Is this global or just us statistics and is this a current measurement? It’s weird but kinda like the idea that the entire world is re enjoying this movie. But I just wanted to get some details",
        "upvotes": 32,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1hyk9jb/so_the_netflix_top_10_is_the_current_most_popular/"
    },
    {
        "id": "1hyzal7",
        "author": "tavakym",
        "title": "Name of opening song from Legends of Fluffy special ",
        "content": "Hi folks, the opening song from Gabriel Iglesias’ Legends of Fluffy special, is that a real thing? \nSounded great and I was hoping to learn what it’s called.\n\nThank you",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hyzal7/name_of_opening_song_from_legends_of_fluffy/"
    },
    {
        "id": "1hyz146",
        "author": "Meander67",
        "title": "3%... Will there ever be an end to this?",
        "content": "It just keeps switching back and forth between who is wrong and who is right, and it all depends on who gets eliminated both in the shell and on the Island.\n\n\n\nI am now on season 3 episode 5 and it seems to never end.\n\n\n\nIs this still worth my time to watch or should I just stop?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hyz146/3_will_there_ever_be_an_end_to_this/"
    },
    {
        "id": "1hywwqv",
        "author": "RealCanadianDragon",
        "title": "Keep profile logged in on specific devices",
        "content": "Is there a way to keep a profile automatically logged in on Netflix or do I have to manually select it every time I open the app?\n\nFor instance, I'm only using my profile on my devices, but can I just keep it auto logged in on that profile, and the person using the other profile automatically has it logged in on their profile instead of us having to open the app and select our specific name/profile each time?\n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hywwqv/keep_profile_logged_in_on_specific_devices/"
    },
    {
        "id": "1hyl5jb",
        "author": "evaintheus",
        "title": "The Breakthrough",
        "content": "I binged this show based on a true story in one sitting today. What do you guys think? I loved it! Believable characters, great actors! \n\nFrom Netflix:\n\nBased on a true story, the crime drama series The Breakthrough follows the second-largest criminal investigation in Swedish history. In the early 2000s, the small city of Linköping was rocked by a double homicide in broad daylight. Two people — a child and a woman in her late 50s — were stabbed to death. But with no motive or suspect, the case eventually grew cold. Nearly two decades later, the police made headway after a genealogist entered the fray.  Starring Peter Eggers and Mattias Nordkvist, the series was directed by Lisa Siwe (The Bridge) and written by Oskar Söderlund (Snabba Cash). “Though this is a fictional drama series about a crime, it is, above all, a depiction of a human tragedy — where we place our focus on the victims and the investigation rather than the perpetrator,” Siwe told Netflix. “It’s a story about the compassion and care for one another that is needed to move on when terrible things happen.”",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hyl5jb/the_breakthrough/"
    },
    {
        "id": "1hyrtp2",
        "author": "mattxhewww",
        "title": "Please help me with some recommendations",
        "content": "The shows I've been really into are\n\n\\- salvation\n\n\\- suits\n\n\\- the night agent\n\n\\- designated survivor \n\nAny recommendations will be awesome thank you!!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hyrtp2/please_help_me_with_some_recommendations/"
    },
    {
        "id": "1hxziv7",
        "author": "tatarigoroshi",
        "title": "Netflix says I'm not part of the household when I'm inside my house",
        "content": "How do they decide what is and isn't part of the household?? No, I am not travelling. Don't give me a code to log in for a limited time period .... how can I fix this? \n\nWhen I google this issue I only find netflix's page saying if my device is not associated with the household, I need to create my own plan. But I live with my family in my parent's house who are paying for netflix. No one else has this problem, all TVs, laptops, ipads work for them. This is really frustrating. ",
        "upvotes": 160,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1hxziv7/netflix_says_im_not_part_of_the_household_when_im/"
    },
    {
        "id": "1hyh9ll",
        "author": "CaligulaQC",
        "title": "How many good seasons can I expect out of Parenthood?",
        "content": "Watching the 3rd episode now, I love it. It’s funny and I can relate. \nI just hope its doesn’t turned into a snooze fest after a season or something. \n\nNetflix gave me trust issues. ",
        "upvotes": 7,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1hyh9ll/how_many_good_seasons_can_i_expect_out_of/"
    },
    {
        "id": "1hykwh2",
        "author": "Ok_Slide_1973",
        "title": "War horror film recommendations?",
        "content": "I just want to see any horror war film on Netflix if there is any to watch and I want movies like hosts of war or nazi zombies so I you could tell me one I would appreciate it",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hykwh2/war_horror_film_recommendations/"
    },
    {
        "id": "1hylw8q",
        "author": "themanhimself999",
        "title": "Help with audio delay",
        "content": "I'm watching on a windows pc with a Bluetooth speaker. There is a noticeable delay that I cant fix. Is there a way to offset the video to cancel out the delay? Thanks",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hylw8q/help_with_audio_delay/"
    },
    {
        "id": "1hyumu1",
        "author": "limsus",
        "title": "WWE Raw Debut on Netflix Draws 4.9M Global Views with The Rock, John Cena Featured | News, Scores, Highlights, Stats, and Rumors | Bleacher Report",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hyumu1/wwe_raw_debut_on_netflix_draws_49m_global_views/"
    },
    {
        "id": "1hyrvav",
        "author": "Master_Object_7879",
        "title": "Service clientèle 🇨🇭 lamentable -&gt; résiliation immédiate ",
        "content": "Je prends la plume (ou plutôt le clavier) pour exprimer ma consternation face à l’expérience client désastreuse que j’ai vécue aujourd’hui avec votre service après-vente. En plus de perdre une heure de mon temps précieux, j’ai eu droit à une arrogance et un mépris qui en disent long sur la considération que Netflix accorde à ses abonnés fidèles.\n\nLors de cet appel, le premier interlocuteur, par son attitude condescendante et arrogante, s’est distingué par une totale absence de professionnalisme. Par contraste, une deuxième personne a tenté, avec beaucoup de douceur et d’attention, de trouver une solution. Malgré ses efforts, le problème n’a pas pu être résolu et une solution alternative, certes bien intentionnée, mais loin d’être optimale, m’a été proposée.\n\nC’est là qu’intervient Esther, une responsable supposée \"supérieure\", dont l’arrogance et l’indifférence ont surpassé toutes mes attentes (négatives). Lorsque j’ai abordé la question d’une reconnaissance pour mes plus de 5 ans de fidélité ininterrompue, j’ai reçu une réponse glaciale et méprisante : \"Chez Netflix, vous n’êtes pas récompensée pour vos années de fidélité.\"\n\nPire encore, à peine avais-je formulé ma décision de résilier mon abonnement qu’elle m’interrompait pour m’annoncer que l’annulation était déjà confirmée et que j’avais reçu un e-mail. Est-ce cela, le respect que vous réservez à vos clients de longue date ?\n\nSoyons clairs : ce genre de mépris est inacceptable. Vous traitez vos abonnés comme des vaches à lait, en vous souciant uniquement de leur argent, mais certainement pas de leur satisfaction ou de leur fidélité. Je ne suis pas seulement déçue, je suis outrée par le manque total de considération dont vous faites preuve.\n\nNetflix Suisse, vous devriez avoir honte. Votre arrogance et votre mépris montrent que vous n’êtes intéressés ni par vos clients, ni par leur fidélité. Vous êtes devenus un géant déconnecté, uniquement préoccupé par vos profits, et cela finira par vous coûter cher.\n\nCe message est adressé aux responsables de Netflix Suisse : continuez ainsi, et votre arrogance entraînera votre chute. Vous prenez vos abonnés pour des imbéciles, mais sachez que nous ne sommes pas aussi dociles que vous semblez le penser.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hyrvav/service_clientèle_lamentable_résiliation_immédiate/"
    },
    {
        "id": "1hyjuao",
        "author": "metallicandroses",
        "title": "Love Game",
        "content": "Yous see this yet? Its like a traditional Chinese type of style, mixed w/ a new perspective, seeing as the actress is *\"transported into ancient times..\"* and a voice from above (like a video game/narrating the game) gives her the mission to marry some hot prince that lives in or around the courtyard in—i think the classical homes are called Siheyuan (四合院) but correct me if im wrong. i just began watching it, suffice to say that the special effects are interesting, as well as the story.\n\nTheres nothing i can really spoil, alas i can just touch on the beginning where theres a demon of the feminine type—who seems to take on the form of other such types of demons.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hyjuao/love_game/"
    },
    {
        "id": "1hy8zom",
        "author": "SanrioAndMe",
        "title": "Am I the only one who actually really enjoys XO, Kitty?",
        "content": "I think the show has its own unique charm. Yes it's cringy at times but I feel like it makes it more enjoyable, at least for me anyhow. \n\nI've seen a lot people hating on it and it low-key kinda makes me feel sad because I love this show, and I've seen people go as far as saying it's one of the worst shows on Netflix. \n\nI enjoy XO Kitty the same way I enjoy The Summer I Turned Pretty (funny enough also by Jenny Han). \n\nOverall I think the show is cute and fun and I feel like people take it too seriously and I cannot wait for season 2 to come out on the 16th. \n\n\n",
        "upvotes": 7,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hy8zom/am_i_the_only_one_who_actually_really_enjoys_xo/"
    },
    {
        "id": "1hynkwo",
        "author": "urnialbologna",
        "title": "Best place to watch Netflix? PS5 or PC?",
        "content": "PS5 doesn't seem to support Dolby atmos, only 5.1 I had Dolby atmos set in the PS5 settings and that didn't help. I do get Atmos with discs as well as Disney plus.  \n  \nOn the other hand, I tried the Netflix app on windows store, and by setting the sound settings to Dolby atmos for home theater, I do get Dolby atmos. But for some reason, nothing shows up as 4K when looking at the info, even though I have 4k 60 in my Nvidia settings. So I have no idea what resolution Netflix is streaming at since on PS5 most shows I wanted to watch said 4K HDR.  \n  \nI really want 4k HDR and Dolby atmos, but apparently I can't have both on either system. Unless I'm doing something wrong. Any help or tips? Does the Netflix app play in 4K on windows even if it doesn't say?  \n  \nI do have the 4K Netflix subscription if that helps.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hynkwo/best_place_to_watch_netflix_ps5_or_pc/"
    },
    {
        "id": "1hxi1ti",
        "author": "Aaditya203",
        "title": "Squid Games: Unleashed Is Now Netflix's 5th Most Downloaded Game After 10M Installs\n",
        "content": "",
        "upvotes": 377,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1hxi1ti/squid_games_unleashed_is_now_netflixs_5th_most/"
    },
    {
        "id": "1hyagxb",
        "author": "Aggravating-Bee5876",
        "title": "The Perfect Couple Book vs Netflix Adaptation",
        "content": "Has anyone read TPC? How was it compared to the Netflix adaptation? The Netflix one wasn't too impressive for me. From the random supporting characters who made no absolute sense being there, random sideplots, even down to characters who had NO chemistry with each other. Just wanted to see what others think!",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hyagxb/the_perfect_couple_book_vs_netflix_adaptation/"
    },
    {
        "id": "1hxowvj",
        "author": "HehroMaraFara",
        "title": "American Primeval",
        "content": "Netflix makes and releases a lot of garbage and I freely shit all over it whenever possible. \n\nThat being said, this series is fucking metal. One, I had the most intense desire to redownload Red Dead 2 within the first 15 minutes and two, when they don’t pull punches on just how brutal even the Mormons were back then, I was all in. \n\nIve seen some people complain about it being too much, but these are probably the same people that want to burn books and pretend the real history of the United States never happened. \n\nThis series is awesome. ",
        "upvotes": 149,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1hxowvj/american_primeval/"
    },
    {
        "id": "1hysp7w",
        "author": "BLAZEISONFIRE006",
        "title": "I feel like people misunderstood THE WATCHER.",
        "content": "It's supposed to be interesting and funny in a suspenseful and outlandish-horror way. \n\nIt's not bad acting, it's satirical. Parodical. \n\nIt's like a distant cousin of the comedy genre, basically. Very dry. Bloody. With plot holes and bad ending. It's all done on purpose, isn't it?\n\nIt's like *American Psycho.*\n\nI didn't really understand American Psycho at first. I think I was too young to understand satire, honestly.\n\nThe Watcher is actually kind of cool. It's kind of like *The Woman in the House Across the Street from the Girl in the Window.* \n\n Maybe if *The Watcher* had a way-too-long title too, people would have liked it better; because the title would let you know that something is fishy here. \n\n*The Watcher*'s ending made me mad the first time, for sure. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hysp7w/i_feel_like_people_misunderstood_the_watcher/"
    },
    {
        "id": "1hyty01",
        "author": "Smexycan78",
        "title": "The options are terrible",
        "content": "Why are there only 3 options for subscription? You're telling me if I want to get the best resolution I can, I also have to have the option for 4 devices at once? Such a predatory business. Why can't I just get the 4k deal for 1 device at a time?\n\nWhy do they have to lock resolution behind the absurdly expensive tier just because they want to milk as much money out of people as possible?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1hyty01/the_options_are_terrible/"
    },
    {
        "id": "1hyjxyl",
        "author": "ClassicalCandy",
        "title": "Movie suggestions? ",
        "content": "Currently on Netflix and having some trouble finding a movie and need help!! Looking for a good thriller or drama that will keep us on the edge of our seats! ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hyjxyl/movie_suggestions/"
    },
    {
        "id": "1hxrrme",
        "author": "HandsomeStarLord",
        "title": "Bring this back on Netflix I would love this shows to be on Netflix uk again they were so funny and brought so light ",
        "content": "",
        "upvotes": 85,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1hxrrme/bring_this_back_on_netflix_i_would_love_this/"
    },
    {
        "id": "1hyji7x",
        "author": "bezimena_",
        "title": "Episodes airing once a week or all at once?",
        "content": "Which one do you like more? I personally like episodes airing once a week more, because it builds suspense and you can also make theories with your friends and discuss what will happen next. It also last longer - in my case for sure (if it airs all at once, i would watch it in one day). ",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1hyji7x/episodes_airing_once_a_week_or_all_at_once/"
    },
    {
        "id": "1hyjdtt",
        "author": "khaldrug0",
        "title": "Can log in on IPhone but not laptop",
        "content": "I'm getting incorrect password. I've tried 2 accounts both work on iphone but not laptop. I'm using netflix in GB which is correct. This has gone on for days",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hyjdtt/can_log_in_on_iphone_but_not_laptop/"
    }
]