[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 45,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qdki9x",
        "author": "baribanana",
        "title": "Why did Richard lure Anna to Lexy Jones house in His &amp; Hers",
        "content": "I am still confused about Richard's role. His wife is not the killer, nor is he. So why did he lure Anna to the house? Why take her phone? Lexy didn't know Anna was coming and was surprised to see her there. So what did Richards want?",
        "upvotes": 19,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qdki9x/why_did_richard_lure_anna_to_lexy_jones_house_in/"
    },
    {
        "id": "1qdld0q",
        "author": "Key-Contribution985",
        "title": "Need Netflix series recs for this weekend - horror would be perfect!",
        "content": "So it's freezing cold outside and apparently I want to make myself even colder?? 🥶\n\n\n\nLooking for some good series to binge this weekend. Horror would be absolutely perfect (because why not add psychological chills to the physical ones lol), but I'm open to anything that'll keep me glued to the couch.\n\n\n\nWhat are your recommendations? Hit me with your best/scariest/most binge-worthy series!",
        "upvotes": 10,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1qdld0q/need_netflix_series_recs_for_this_weekend_horror/"
    },
    {
        "id": "1qdf8eg",
        "author": "Few_Pipe_9933",
        "title": "Best Black Mirror episodes?",
        "content": "I was wondering what some of the best episodes are so I can just sort thru them instead of watching random episodes. Let me know what your favorites are",
        "upvotes": 21,
        "comments": 86,
        "media": null,
        "permalink": "/r/netflix/comments/1qdf8eg/best_black_mirror_episodes/"
    },
    {
        "id": "1qdksp0",
        "author": "OhMySullivan",
        "title": "Favorite documentaries about human brain/bodies?",
        "content": "I've seen quit a few different kinds and I honestly want to watch them all but I'm not sure how to keep track of them. Basically I just want to learn about how the human brain functions. I saw there was one called \"Sex Explained\" that looked a bit interesting. I watched one a while ago and I can't remember what it was called but I remember they were talking about the unreliability of eye witness accounts because the way our brain naturally does information consolidation and our own biases. \n\nI just the the human brain is interesting. How it affects our bodies and how our bodies affect it are really cool. I'd love recommendations, thanks!",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qdksp0/favorite_documentaries_about_human_brainbodies/"
    },
    {
        "id": "1qdjwk4",
        "author": "DuxxieDings",
        "title": "anyone else liked the adult animated shows arcane and wolf king?",
        "content": "i loved them! they just the shows that itched my mature show itch, were dark ended grey, scaled, no happy ending for some characters. overall no scared to make people jump or cry. they are how you do adult shows.\n\n Jinx's character did have some teenager focused jokes but she was my favorite!",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qdjwk4/anyone_else_liked_the_adult_animated_shows_arcane/"
    },
    {
        "id": "1qczq84",
        "author": "sfomonkey",
        "title": "Need light and uplifting show please. Long/many seasons would be great!",
        "content": "I'm struggling with my mental health RN, and concerned my depression will deepen. \n\nLooking for something light, uplifting, no cliffhangers, no bereavement/grieving please.   \n\nShows that ive seen that would fit the bill. Many  on the Inside, North of North, a Resident Alien were great.  The Good Place would be great, except I'm experiencing new grief and bereavement.\n\nNon Netflix shows that would work Mandalorian, Righteous Gemstones. Anime with good dub would be fine too. (Can't be bothered with subtitles ATM)\n\nA show that's uplifting, no violence would be so welcome. TIA ",
        "upvotes": 81,
        "comments": 199,
        "media": null,
        "permalink": "/r/netflix/comments/1qczq84/need_light_and_uplifting_show_please_longmany/"
    },
    {
        "id": "1qd8h57",
        "author": "purely_unbothered",
        "title": "Peak on Netflix?",
        "content": "What's the peak movie/series you've watched on Netflix? Till date it is breaking bad for me but want to explore more so drop your peak shows/movies/anime.",
        "upvotes": 20,
        "comments": 101,
        "media": null,
        "permalink": "/r/netflix/comments/1qd8h57/peak_on_netflix/"
    },
    {
        "id": "1qdkyya",
        "author": "chemicalromancefreak",
        "title": "disturbing films",
        "content": "if people are so disturbed by “the strange things about the johnsons” and is traumatized by it, has probably never seen the documentary, “Abducted in Plain Sight” n thats based on true story 😂👌🏿",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qdkyya/disturbing_films/"
    },
    {
        "id": "1qdnthw",
        "author": "Kaskelontti",
        "title": "GyeongSeong Creature",
        "content": "GyeongSeong Creature is another incredibly cool and exciting series from Korea. When you watch Korean series, all American series start to feel like soap operas with the same plot but lots of spectacular action to cover up the fact that they have nothing to offer. I've been seriously thinking about canceling my Netflix subscription and switching to KOCOWA+ instead, because it seems like I only watch Korean series these days.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qdnthw/gyeongseong_creature/"
    },
    {
        "id": "1qdmwfe",
        "author": "HawkEgg",
        "title": "The Brothers Sun [No Spoilers]",
        "content": "I'm a couple episodes in. So far so good, but really the sound track is solid. Adding to my spotify liked songs\n\n* I'm going to catch me a rat\n* Halfsharkaligatorhalfman",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qdmwfe/the_brothers_sun_no_spoilers/"
    },
    {
        "id": "1qdclf9",
        "author": "NaiveNeck984",
        "title": "HIS &amp; HERS",
        "content": "So... why exactly did Richard lead Anna to the lakehouse???? and Why exactly did Lexy try to kill Anna... if Lexy didn't kill any of the other girls? Was she literally just going to kill Anna and call it a day? The whole Mom twist ruined the entire thing. It opened a new fold without connecting all the other dots",
        "upvotes": 5,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qdclf9/his_hers/"
    },
    {
        "id": "1qd4avi",
        "author": "bludhavengabagool",
        "title": "Netflix is making a new show with Squid Game creator called The Dealer",
        "content": "\"[Netflix confirmed early this morning](https://www.hollywoodreporter.com/tv/tv-news/squid-game-hwang-dong-hyuk-netflix-the-deal-1236472053/) in South Korea that production is currently underway on The Dealer, the next original series produced by Squid Game creator Hwang Dong-hyuk. Hwang is producing the series, which has been described as a 'high-stakes casino crime drama,' but there is at least one element in the description that sets this new series apart from Hwang’s most well-known work.\n\nIn The Dealer, Geonhwa is a casino dealer who has to return to the shadowy world of illegal gambling after she falls victim to a scam and has to put her wedding plans on hold. However, to give her an edge at the tables, she 'is compelled to tap long-suppressed supernatural abilities,' which sounds like such a fun spin on the Squid Game formula of high-stakes tension and uneasy alliances with huge sums of money on the line.\" -full article [here](https://www.thepopverse.com/tv-squid-game-netflix-creator-next-project-the-dealer-supernatural-twist)",
        "upvotes": 14,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qd4avi/netflix_is_making_a_new_show_with_squid_game/"
    },
    {
        "id": "1qd4xnc",
        "author": "poppunkangel",
        "title": "His &amp; Hers. Where is the banana?",
        "content": "I’m only 7 minutes in and all I can think about so far is where the heck did this man’s banana go😭 He has it in his hand like 1/4 of the way eaten and then they’re pulling up to the crime scene (shot from behind as they’re pulling up shows his one hand driving but banana is nowhere to be seen any longer). \n\nHe gets out of the car and… NO BANANA? WHERE DID IT GO? Surely he didn’t eat it that fast. ",
        "upvotes": 15,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1qd4xnc/his_hers_where_is_the_banana/"
    },
    {
        "id": "1qcqwi7",
        "author": "Tricky-Anywhere5727",
        "title": "Why the hell can't we just see subtitles in all languages?",
        "content": "The \"select language\" section has no effect at all, that's no secret. Even after LITERALLY REMOVING GERMAN ENTIRELY from netflix, setting my phone to English and removing German from my phones keyboard, they still only give me German subtitles or none. I don't know what to do anymore, what even is the reason why they don't show us all the languages? Most movies don't have that many dubs and subs anyways, it can't be that hard to display ~20 languages. That's the least I expect from a multimillion dollar company that I am paying a rising fortune every year.\n\n\nGet your app in order, for fucks sake ",
        "upvotes": 50,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1qcqwi7/why_the_hell_cant_we_just_see_subtitles_in_all/"
    },
    {
        "id": "1qdhyk4",
        "author": "speremmu",
        "title": "Ducumentari avvincenti",
        "content": "Sto cercando documentari avvincenti, di quelli che ti fanno chiedere: e ora cosa succede? Preferirei non relativi a serial killer o omicidi ma altro. Consigli?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qdhyk4/ducumentari_avvincenti/"
    },
    {
        "id": "1qddfid",
        "author": "Paranoidgf88",
        "title": "Netflix looks so grainy ???",
        "content": "Before the comments say it’s my internet, every other service is showing perfect quality, but Netflix is so grainy / blurry. I’m watching on Samsung smart tv. Never had this issue before tonight, I’ve restarted the app &amp; the tv, what else can I do? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qddfid/netflix_looks_so_grainy/"
    },
    {
        "id": "1qdgi4o",
        "author": "Financial-Donkey194",
        "title": "„Take That“ – Boyband-Doku auf Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qdgi4o/take_that_boybanddoku_auf_netflix/"
    },
    {
        "id": "1qdghzm",
        "author": "Fun_Molasses5215",
        "title": "The Trust winner Julie Theis sent 'cease and desist' letter from Justin and Hailey Bieber over videos about their marriage",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qdghzm/the_trust_winner_julie_theis_sent_cease_and/"
    },
    {
        "id": "1qdbxfs",
        "author": "Few_Pipe_9933",
        "title": "Need a must watch movie",
        "content": "Looking to watch somthing before bed. Anybody have any must watch movies that have stuck with you? I prefer suspense kind of movies really love the work of Harlan coben. Not looking for a series ",
        "upvotes": 2,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qdbxfs/need_a_must_watch_movie/"
    },
    {
        "id": "1qde2pu",
        "author": "Kshiti_salman",
        "title": "Whenever I watch a web series (not anime) near sunlight, even at good brightness why i can't see it properly? Does sunlight affect the brightness ??",
        "content": "Just noticed, in anime it's bright colors so even at sunlight I can see the episode properly but in web series it just appears darker. I just wanted to know this",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qde2pu/whenever_i_watch_a_web_series_not_anime_near/"
    },
    {
        "id": "1qdds0t",
        "author": "Wild-Display-765",
        "title": "Is Southland coming to NF?",
        "content": "I thought I saw a very fast shot of Ben McKenzie in a cop uniform and it disappeared. I looked through New on NF but didn’t see it.  Is this just wishful thinking on my part? Thanks. ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qdds0t/is_southland_coming_to_nf/"
    },
    {
        "id": "1qcnko1",
        "author": "Ordinary_Mango9815",
        "title": "Why do I do this to myself??",
        "content": "I started Mindhunter again because it’s one of my favorite shows to have ever been released on Netflix. I’m frustrated that it will never have the proper ending it deserves 😩😭😭😭\n\nJust wanted to rant about this!! Unsure why I am torturing myself by watching this over again but it’s a great show, with great acting and provides such an amazing depiction of the early days of criminal profiling. ",
        "upvotes": 25,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1qcnko1/why_do_i_do_this_to_myself/"
    },
    {
        "id": "1qdk21s",
        "author": "CalebOnPoint",
        "title": "What kind of data does Netflix collect on users?",
        "content": "Hey guys, \n\nSo just curious, what kind of data does Netflix collect when you use their streaming platform? Is there some file with all the shows I like with my name on it? And does Netflix sell this to other third-party companies (to target ads to me)? How does that work exactly? Would be interesting for somebody in the company to explain too if possible. Also kinda creepy when Netflix asks me halfway through my programing if \"I'm still watching\", like wtf??\n\nAlso if I pay for the service does this go away? Like I feel like if somebody pays for a service, and that company sells their data that's kinda bullcrap IMO. I'd honestly pay a premium to make sure private stuff like that isn't used against me. Just makes me feel like *I'M* the product, you know?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qdk21s/what_kind_of_data_does_netflix_collect_on_users/"
    },
    {
        "id": "1qcvnum",
        "author": "geologic-moose",
        "title": "Bridgerton S4 Netflix Tudum live stream BROKEN?",
        "content": "The Netflix Tudum live stream for the premier of Bridgerton Season 4 isn’t working? I’ve seen no announcement or comment from Netflix besides “We’ll Be Right Back” on the live stream page. \n\nSeems unprofessional to leave dedicated fans waiting with no knowledge of what’s going on with the event… thankfully I switched to YouTube to see cast interviews.\n\nWill we still get to see Episode 1 of Season 4? What about the special performance? So frustrating… at least tell us something!!",
        "upvotes": 8,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1qcvnum/bridgerton_s4_netflix_tudum_live_stream_broken/"
    },
    {
        "id": "1qdamsa",
        "author": "daretoeatapeach",
        "title": "What are the most quotable Netflix shows/movies worth rewatching?",
        "content": "I like to rewatch shows with Spanish subtitles or audio to help me practice my Spanish. I used to rewatch Marvelous Mrs. Maisel, but now that Amazon Prime video has ads on their own original shows I'm looking to Netflix. With Mrs. Maisel I had dozens of lines I had translated onto post-it notes, but Bridgerton not so much. \n\nI know Arrested Development has language support (both audio and subtitles in various languages) so that's on my list. All Netflix originals have good language support but which ones can you watch over and over? Which ones have you quoted to your friends? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qdamsa/what_are_the_most_quotable_netflix_showsmovies/"
    },
    {
        "id": "1qdjcfn",
        "author": "beezy182",
        "title": "I noticed something weird about Netflix Korea's biggest reality shows (Physical 100 &amp; Culinary Class Wars), and now I can't unsee it",
        "content": "I've been watching a lot of Korean Netflix lately, and something started bugging me (and yes, I used some AI to concise the information to explain my concern). The more I dug into it, the more I realized there's a pattern here that's either the craziest coincidence ever or something deliberate.\n\n# The Pattern\n\nNetflix Korea's two biggest unscripted hits both had Season 2 in 2024-2025. In BOTH seasons, the winner followed the exact same arc:\n\n1. Eliminated from the competition\n2. Brought back through a NEW \"second chance\" mechanic that didn't exist in Season 1\n3. Won the entire season against opponents who had never been eliminated\n\nThis happened in Physical: 100 Season 2 and Culinary Class Wars Season 2. Two different shows. Two different production companies. Same exact pattern.\n\n# Physical: 100 Season 2 – Amotti\n\nPhysical: 100 is basically Squid Game meets CrossFit. 100 people, brutal physical challenges, last one standing wins ₩300 million (\\~$230K USD).\n\nWinner: Amotti (Kim Jae-hong)\n\nQuick background: 33-year-old former CrossFit athlete from Daegu. Ranked 6th in the 2019 CrossFit Open, 2nd at the Asia Championship. In January 2021, a car door crushed his ankle while he was riding his scooter. 10-hour surgery. Doctors said he might never walk again. He rebuilt himself as a fitness YouTuber (300K+ subscribers) and became a Lululemon ambassador.\n\nHere's where it gets interesting:\n\n* Amotti was nearly selected for Season 1 but didn't make the final cast. (This is on his Wikipedia page.) Production knew him. Knew his story. Said no.\n* Season 2: He gets in, competes, and gets eliminated in Quest 2 (Maze Race). Pretty early.\n* But wait: Season 2 introduced \"Quest 2.5: Pillar Challenge\"—a NEW mechanic that let eliminated contestants return. Olympic gold medalist Jung Ji-hyun picked Amotti for her \"Avengers\" team.\n* Result: Amotti wins the finale against Hong Beom-seok, who was never eliminated the entire season.\n\nSo: Rejected from S1 → Accepted to S2 → Eliminated early → Brought back via NEW mechanic → Wins everything.\n\nAlmost too perfect.\n\n# The Season 1 Controversy (Context)\n\nThe S1 finale had its own issues. Runner-up Jung Hae-min claimed the final rope-pulling match was filmed multiple times:\n\n\"There was a huge gap in performance... Woo Jin-yong raised his hand and stopped the match, claiming equipment issues.\"\n\nAccording to Jung:\n\n* First attempt: Jung winning big. Woo stopped it. Production lubricated machines and \"lowered the difficulty.\"\n* Second attempt: Jung won. Production stopped it for \"audio issues.\"\n* Third attempt: \\~5 staff members convinced exhausted Jung to continue. He lost.\n\nNetflix denied manipulation but never released the full unedited footage. Wikipedia still notes: \"While the production team stated there was no rematch, Jung Hae-min claimed the final game was filmed twice.\"\n\n# Culinary Class Wars Season 2 – Choi Kang-rok\n\n100 chefs compete: \"White Spoons\" (celebrity chefs) vs. \"Black Spoons\" (anonymous talents). Same prize: ₩300 million. This was the first Korean unscripted series to top Netflix's Global Top 10 (Non-English) for three consecutive weeks.\n\nWinner: Choi Kang-rok\n\nBackground: 47 years old. Originally wanted to be a drummer. Failed restaurants twice. Lived in a Japanese Buddhist temple while learning the language. Trained at Tsuji Culinary Institute. Won MasterChef Korea Season 2 in 2013.\n\nThe key facts:\n\n* Season 1: Competed as a White Spoon. Eliminated in Round 3.\n* Season 2: Production introduced \"Hidden White Spoon\"—a NEW mechanic allowing S1 eliminated chefs to return (but needing unanimous judge approval instead of just one).\n* Result: Choi wins the finale against \"Culinary Monster\" (Lee Ha-sung)—former head chef at NYC's 2-Michelin-star Atomix, ex-sous chef at The French Laundry—who was never eliminated all season.\n\n# The Quote That Got Me\n\nWhen asked about the Hidden White Spoon mechanic, producers said:\"They were invited because viewers really wanted to see them again.\"\n\nBut S2 was announced in October 2024, right after S1 ended. The mechanic was designed before filming. Casting decisions were made before filming.\n\nHow did they \"know\" viewers wanted Choi Kang-rok back before S2 even aired?\n\n# The Netflix Connection\n\nBoth shows are overseen by Yoo Ki-hwan, Netflix Korea's Director of Content.\n\n||Physical: 100 S2|Culinary Class Wars S2|\n|:-|:-|:-|\n|Winner|Amotti|Choi Kang-rok|\n|Eliminated|Quest 2|Season 1, Round 3|\n|Return mechanic|\"Pillar Challenge\" (NEW)|\"Hidden White Spoon\" (NEW)|\n|Final opponent|Hong Beom-seok (never eliminated)|Lee Ha-sung (never eliminated)|\n|Production|Galaxy Corporation|Studio Slam|\n|Netflix exec|Yoo Ki-hwan|Yoo Ki-hwan|\n\nTwo production companies. Same executive. Same pattern. Same outcome.\n\n# What I'm NOT Saying\n\nI'm not saying Amotti or Choi Kang-rok don't deserve their wins. Amotti overcame a career-ending injury. Choi already won MasterChef Korea. They're genuinely talented.\n\nWhat I AM questioning:\n\n* The deliberate creation of mechanics that enable specific narrative outcomes\n* The statistical improbability of identical patterns in two shows, same year\n* The lack of transparency about production decisions\n* Whether we're watching authentic competition or manufactured storytelling\n\n# The Business Logic\n\nRedemption arcs make sense from a content strategy perspective:\n\n* Emotional investment: People love comebacks\n* Rewatch value: Go back to see the original elimination\n* Social engagement: Unexpected wins generate debate\n* Watch time: Netflix's key metric\n\n# Final Thoughts\n\nMaybe this is all coincidence. Maybe Netflix Korea just got incredibly lucky that both second-chance mechanics produced perfect redemption stories.\n\nOr maybe there's a formula being replicated because it works.\n\nI don't have proof of rigging. I have a pattern, a suspicious, statistically improbable pattern happening under the same executive oversight.\n\nThe question: Is Netflix Korea creating conditions for organic competition, or engineering narratives and calling it reality? What do you think?\n\n",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1qdjcfn/i_noticed_something_weird_about_netflix_koreas/"
    },
    {
        "id": "1qdl1ln",
        "author": "Funny-Ad-9217",
        "title": "Stranger Things finale (possible spoilers warning)",
        "content": "So, I just had to get on here and rant for a minute. (Not to argue, not to fight, just to get it off my chest) First of all, I’d just like to say, yes, what happened at the end with El was absolutely sad. Yes, there might be a few plot holes left, the only big one I see is nothing happened with Kay, and there were no monsters in the upside down. Everything else? Eh. I just want you all to step back and think.\n\nEveryone is ragging on the finale, emotional outbursts everywhere. Coming up with theories of a ninth episode, refusing to believe it’s over. You think that means the finale was bad? We got attached to the story, to the characters, and to be this emotionally upset, in denial about the ending? My opinion (and I say mine because everyone can have their own without turning it into a war-zone) is that they made history. They literally got you so attached to something, it devastated you. It devastated me. I almost didn’t want to even watch the finale because I knew I’d be sad it was gone after. They literally did what the best writers in history have done. They made you live in the stranger things universe, for ten years. Kept you hooked, kept you crying and laughing and then you insult them? Because the ending wasn’t what you wanted? It was their ending, this world was theirs and we were lucky enough for it to temporarily draw us out of our boring mundane lives.\n\nYour mad? Your upset? Did you actually cry over someone that wasn’t real? Good. THEY DID THEIR JOB. If you were unfazed it wouldn’t have been worth anything. I’m not saying everything about it was perfect, and yeah Mike and eleven not having a happy ending was sad. But everyone else had a decent ending. Their characters MADE IT. I would like to believe El made it out, but honestly even if she didn’t? She made one final decision. She was brave. She put an end to it. And without her, none of the other characters would have had any progress. She changed them. She saved them. She made an impact on their lives. She went from a scared little girl, to becoming someone brave enough to risk herself for everything. With her choice.\n\nAnd another note, yeah one of the writers was actively going through a divorce. AND HE STILL STOOD AND WORKED ON THE ENDING FOR US. You don’t know what he’s going through, how he feels. He could be emotionally wrecked and everyone’s pointing their finger at him. He might not have the motivation to do anything right now, but he was still here, still writing, still creating and that takes a lot. That MEANS a lot. And I’m not sitting here saying I know everything, or the details of his divorce, but chill out. These two sat down and gave us ten years of their life with an amazing world, and amazing characters. Not everything goes how you want it to go. There’s no need to act two years old over it. Be grateful you experienced something that made you feel. Even if it was anger, sadness at the end.\n\nMike becoming a writer at the end, and making the story? The story of all of them? That part was absolutely beautiful from a writers point of view, from mine anyway. I’m not here to argue, to fight, I just wanted to state my opinion somewhere. If you wanna be rude about it, go self regulate. Have a nice day, and I hope more things come into your life and give you a whirlwind of emotions. It makes life less dull.",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qdl1ln/stranger_things_finale_possible_spoilers_warning/"
    },
    {
        "id": "1qcliu6",
        "author": "Sweaty_Parfait8251",
        "title": "Dead To Me",
        "content": "I started watching Dead To Me on Netflix this week, and it wasn’t until episode two that I found myself saying, Okay, now we have a story… IYKYK. Still wondering though, is it worth continuing, or should I find a better show to binge?",
        "upvotes": 17,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1qcliu6/dead_to_me/"
    }
]