[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 498,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 19,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jjjsmn",
        "author": "Somethingman_121224",
        "title": "'Adolescence' Becomes First-Ever Streaming Show to Top British T.V. Ratings",
        "content": "",
        "upvotes": 236,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1jjjsmn/adolescence_becomes_firstever_streaming_show_to/"
    },
    {
        "id": "1jjsevm",
        "author": "Junior_Apartment6388",
        "title": "Has everyone seen how they filmed the van scene in Adolescence! It looks so bizarre there’s literally a guy sitting on top of the van driving it",
        "content": "",
        "upvotes": 34,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jjsevm/has_everyone_seen_how_they_filmed_the_van_scene/"
    },
    {
        "id": "1jjjvnw",
        "author": "BackgroundAvocado224",
        "title": "Con Mum",
        "content": "Dare I say the only person I feel sorry for is Peng and the other couple. Why on earth would you spend £300K on a mum who hasn’t been in your life for 45 years abandoning your partner and child for her. \n\nDare I also say Dionne is actually a successful business woman - she sure knows how to run a scam. ",
        "upvotes": 35,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1jjjvnw/con_mum/"
    },
    {
        "id": "1jjwghy",
        "author": "mez1337",
        "title": "Dear Netflix, Belgium is not France Lite",
        "content": "Here I am, browsing Netflix with my partner, and I see multiple animé shows we could watch. She gets excited for Demon Slayer, I put it on and... It's Japanese dubbed. No problem, I'll just put on subtitl--There's only French subtitles. And Japanese subtitles.  \nUhh... Well that sucks. I'm pretty decent at holding conversations in french but I'm not so good at speed reading it. And my gf doesn't understand french at all.\n\nWell fine, I'll just put on Frieren. I watched it already, and was pretty hyped to see it on the homepage, and now I can watch it with her-- It's japanese dubs with french subs only.  \nFml alright I'll just try Konosuba--  \nYeah guess what. French subs only.\n\nI don't know if you realize this, Netflix, but 60% of Belgians have dutch/flemish as their native language. That's what we call a \\~**majority\\~**.  \n  \nSo why do I get the feeling Netflix is only catering to the francophones? Is it because we Belgians are almost always depicted as french-speakers in American movies and shows?  \nOr is Netflix not able to afford the rights to dutch subtitles? We would even settle for English subtitles ffs.",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jjwghy/dear_netflix_belgium_is_not_france_lite/"
    },
    {
        "id": "1jjyzvl",
        "author": "Complete_Ranger_4261",
        "title": "Con Mum",
        "content": "1.&gt;!spoilers!&lt; His mum abandons him age 2\n2. His dad abuses him throughout his childhood \n3. His mum comes back into his life 45 years later to emotionally and financially abuse him\n4. His wife abandons him and takes his only child half way across the world to NZ\n\nWhat the actual f??? I just hope he makes a shit load of money from the free advertising for his business now. Then he can pay the debts - fly out to see his son regularly so it becomes routine for father and son - find a woman who will support and love him even when things are hard. \n\nRespect to his friends who are his true family❤️ &gt;!spoilers!&lt;",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jjyzvl/con_mum/"
    },
    {
        "id": "1jjri2i",
        "author": "_zyx_716",
        "title": "Trying to see if the with ads plan is worth it?",
        "content": "I want to know how bad the ads can get. I've been looking here on Reddit and on Google but everything I see is very mixed with some people saying they barely get any and some people saying they get a lot of them. If the ads are atrocious then it isn't really worth getting but if they aren't too bad I'd like to replace my Amazon subscription.",
        "upvotes": 6,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1jjri2i/trying_to_see_if_the_with_ads_plan_is_worth_it/"
    },
    {
        "id": "1jjxfcr",
        "author": "TarugoKing",
        "title": "Frieren: Beyond Journey's End Anime",
        "content": "The anime started slow for me so I was watching the first few episodes on and off. Don't know what happened but somewhere along the way, I got hooked and finished all 28 episodes over the weekend. What a great series this is for me. You go through a somewhat emotional journey with flashbacks that ties up everything all together. Deep story, great character development, battle scenes were fantastic as well. This is a worth a watch!\n\nAdding that I usually watch anime in cc. However, I find the voice dubbing of Frieren (the character) so soothing. Monotone, lack emotions or detached in some way and slow to interpret human emotions. Matches her personality.\n\n\n\n\n\n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jjxfcr/frieren_beyond_journeys_end_anime/"
    },
    {
        "id": "1jjn4f3",
        "author": "scarletwitchmoon",
        "title": "The Residence. I enjoyed it for the most part.",
        "content": "I guessed the killer by episode 2. Don't worry; I won't spoil or even hint. I just wasn't shocked at all. I have thoughts of who it could have been instead or the kind of motive I'd have preferred, but I won't share that either.\n\nMy only criticism is that the episodes should have been shorter. There were scenes that were longwinded and convoluted due to the length. It could have been 10-12 quick episodes instead of 8 super long ones. A minor nitpick I had is that the piano music they played sometimes was too similar to Only Murders in the Building. The piano music made sense because the characters in OMITB lived in an apartment where they used the elevator. \n\nOn a positive note, I thought the performances were all phenomenal. I absolutely loved Cordelia Cupp as a detective. I do wish the show had been set up for future seasons. She was very compelling as a lead. \n\n**What other murder mystery shows/movies have you seen?** \n\n I've Watched:\n\n* Psych\n* Monk\n* CLUE\n* How To Get Away With Murder\n* Only Murders in the Building\n* Murder Mystery &amp; Murder Mystery 2\n* Knives Out\n* Murder on the Orient Express\n* Sherlock Holmes (the movies and the show) ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jjn4f3/the_residence_i_enjoyed_it_for_the_most_part/"
    },
    {
        "id": "1jjzvcd",
        "author": "Crazycookies89",
        "title": "Profile picture randomly changed to default",
        "content": "I was in America for a few days around a week ago and used Netflix while I was there. Since then my profile picture has been changed to a default one and all of the pictures in my history have been removed. It hasn't affected any other accounts on my login, only mine. Anybody know why this has happened?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jjzvcd/profile_picture_randomly_changed_to_default/"
    },
    {
        "id": "1jjvt2t",
        "author": "Smurfritow",
        "title": "Has anyone found any remotely good fix for the low bitrate?",
        "content": "I've read multiple post also complaining about the low bitrate, but the latest I found is 4 months old, thatswhy Im coping for a solution. \n\nIts so bad for me I can barely read what is written at the beginning of the movie (e.g. Created by...\" etc.). I have Full HD plan and a set up that is ridiculously overqualified for watching movies (High end PC as well as very good and stable Wifi), but still it feels like i permanently have to watch in 480p.\n\nI also changed my Profile setting to prefer \"High\" Graphics. Still nothing.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jjvt2t/has_anyone_found_any_remotely_good_fix_for_the/"
    },
    {
        "id": "1jjmiub",
        "author": "BackgroundShallot5",
        "title": "Does anybody else get the 14 day not in your house bs? While in their home.",
        "content": "While using (literally) the only device in my home that uses netflix i am getting asked to make a temporary 14 day pass. Anybody else getting this bs?\n\nFor full context netflix is seldom used and honestly if it wasn't for this I would likely continue to be subscribed to a service which is quite frankly not worth the cost. \n\nThe next time this happens I will be immediately cancelling the subscription but I was wondering if anybody else was suffering at the hands of this incompetence (uk based)",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jjmiub/does_anybody_else_get_the_14_day_not_in_your/"
    },
    {
        "id": "1jjcqqx",
        "author": "hd-report",
        "title": "Netflix adds HDR10+, promises the spec for all HDR titles by end of 2025",
        "content": "Netflix has added HDR10+ to streaming and promises the spec for all HDR titles by end of 2025. Source: Netflix Tech Blog [https://netflixtechblog.com/hdr10-now-streaming-on-netflix-c9ab1f4bd72b](https://netflixtechblog.com/hdr10-now-streaming-on-netflix-c9ab1f4bd72b)",
        "upvotes": 18,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jjcqqx/netflix_adds_hdr10_promises_the_spec_for_all_hdr/"
    },
    {
        "id": "1jju0on",
        "author": "Omnis_vir_lupis",
        "title": "Snapshot of Netflix Jobs (March 25, 2025)",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jju0on/snapshot_of_netflix_jobs_march_25_2025/"
    },
    {
        "id": "1jjncfn",
        "author": "x7007",
        "title": "Netflix Windows 11 Dolby Atmos on PC",
        "content": "Once before Netflix worked with DTSx Headphones and Atmos for headphones, for a long time it doesn't. when DTSx is enabled it shows 2.0 on ALT + SHIFT + D and says Spatial Sound logo.\n\nWhen using Atmos it shows 5.1 Atmos sound decoder and Dolby Atmos logo.\n\nWhy is that? shouldn't DTSx and Dolby be the same? am I missing something in windows 11 to play both of them or netflix changed something a long time ago?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jjncfn/netflix_windows_11_dolby_atmos_on_pc/"
    },
    {
        "id": "1jjlpn5",
        "author": "Damienisok",
        "title": "Good anime or animated shows to watch (preferably anime or something in a style similar to anime because it gives me a bright tingly feeling and I really need that rn)",
        "content": "Also I just wanna say that I watched adolescence and didn't think much of it after that but was absolutely shocked by how many people were discussing it here, anyways like the title says.\n\nPost I made in another community listing what anime I watch ↓\n\nI have watched a lot like hxh, erased, blue exorcist, devilman crybaby, forget what it's called but the one where their dead friend appears and they hang out with her, death note, promised Neverland, black butler, Ouran highschool host club, romantic killer + more, I'd prefer an anime with no romance because I've just gone through a breakup",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jjlpn5/good_anime_or_animated_shows_to_watch_preferably/"
    },
    {
        "id": "1jj0oj9",
        "author": "Kalliaschnikow",
        "title": "what's the big deal about adolescence? or do i just not get it",
        "content": "when i saw the trailer, it didn't quite convince me. i only started watching the series because there was so much written about it here. I mean yes of course the acting is good, the story is well designed and focuses on other characters than just the killer. But I just don't get the huge hype about it. what did I miss? (this is not meant to be a rant but a serious question)\n\nEdit: I think the social issues that are highlighted there are portrayed much better and in more detail in other series, so I'm surprised that even though the subject matter doesn't get as in-depth here, it still has a bigger impact on people than series/movies that have previously focused more heavily on issues like incels, misogyny, social media and its effects on young people etc ",
        "upvotes": 48,
        "comments": 195,
        "media": null,
        "permalink": "/r/netflix/comments/1jj0oj9/whats_the_big_deal_about_adolescence_or_do_i_just/"
    },
    {
        "id": "1jjo6k9",
        "author": "x7007",
        "title": "Netflix App Windows 11 keep freezing exactly after Next Episode",
        "content": "Hi, every time the next episode bar shows and finished and supposed to start the next episode, Netflix APP Freeze the whole COMPUTER!  and needed to RESTART the whole system!!!\n\nWith EDGE it Works PERFECT.\n\nI can't believe HOW AN MOVIE APP CAN CAUSE THAT. that's unthinkable. I uninstalled the shyyyti Netflix APP and I'll use EDGE ONLY, it's exactly the same . if that stop working I'll just cancel subscription, can't deal with that really, ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jjo6k9/netflix_app_windows_11_keep_freezing_exactly/"
    },
    {
        "id": "1jjtpgq",
        "author": "peachydolphin",
        "title": "Deceitful Love deleted sex scene",
        "content": "I watched Deceitful Love when it first came out because I was crushing on Giacomo Gianotti after binging Grey's Anatomy..\n\nI swear there's a sex scene between Elia and Gabriella that was deleted because tbh I was looking for it.. but I'm 99% sure it's gone. \n\nDoes netflix do that? Was it maybe reported for some reason? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jjtpgq/deceitful_love_deleted_sex_scene/"
    },
    {
        "id": "1jj7wt3",
        "author": "GoompyBoopy",
        "title": "Australians, how is Kaitlyn Dever’s Accent in Apple Cider Vinegar?",
        "content": "I would love to hear how authentic Aussies think of her accent? As an American, I think it sounds pretty authentic, but then again, when I was a kid I thought Duck Van Dyke sounded real in Mary Poppins…",
        "upvotes": 14,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jj7wt3/australians_how_is_kaitlyn_devers_accent_in_apple/"
    },
    {
        "id": "1jiu30i",
        "author": "sashakoltsov",
        "title": "Would you watch Adolescence with your teenage kid?",
        "content": "I’m a father of almost 15 and 10-year-old boys living in the UK. I watched the show in one go yesterday and can’t stop thinking about it. It’s hard to describe this mix of moments from the show, memories from my childhood, memories of my kids, and the ambient worry I have in my head now. My wife doesn’t watch intense shows, but I feel that we need to experience it together and speak about it. I was wondering if we could watch it with our older kid as well. I’ve discussed the premise with him, and he seems interested (hard not to). \n\nI feel that watching/reading things together could be a great conversation starter for some topics. Kids and I still read books together before bed, and we had some great chats while reading ’The Body’ and ‘Girl Who Loved Tom Gordon’; and we’re currently watching ‘Atypical’ together, which they really like and very keen to share their thoughts on.\n\nI’m sure his perspective on Adolescence will be completely different from mine (as mine will be different from my wife’s) and I’m both interested and scared. The show doesn’t give you any answers; it seems that everyone sees different things in it and relates to the characters in a different way. What will a teenage boy see in the story, what will their reaction be like, and what conclusions will he get to? How will he talk about it with his friends? Is it too intense?\n\nI know it very much depends on a kid and their sensitivity but what are your thoughts? Has anyone watched the show with their teenage kids?",
        "upvotes": 68,
        "comments": 69,
        "media": null,
        "permalink": "/r/netflix/comments/1jiu30i/would_you_watch_adolescence_with_your_teenage_kid/"
    },
    {
        "id": "1jj53ud",
        "author": "okbunz",
        "title": "The Residence Ending",
        "content": "Hey everyone, I just finished watching The Residence and something's been bugging me about the ending.\n\nAt the very end of the final episode, Cordelia Cupp makes a point of stopping by to visit Nan Cox (played by Jane Curtin) on her way to the airport. I couldn’t help but feel like this moment had some deeper significance, but I’m not sure I fully understood it.\n\nWas there something more to this visit that I missed? Was it meant to be symbolic of something? Would love to hear your take on it!\n\nEdit: [Hollywood Reporter interview](https://www.hollywoodreporter.com/tv/tv-features/the-residence-finale-killer-revealed-showrunner-interview-1236169599/) with writer and showrunner Paul William Davies.\n\nIn the interview, Davies explains:\n\n&gt;\"In the very end, we see Cordelia make a pit stop to the White House again to speak with Nan Cox (Jane Curtin), who tells Cordelia she knew it was Lilly and that she could’ve just asked her. Did she know all along?  \nI didn’t know I was going to end with that scene, but I loved the two of them together in the first scene they did. I thought it was so dynamic. I really could see how much Cupp respected Nan in a way, like her honesty and how perceptive she was. It was important for Cupp to go back to her and tell her of all people, because she recognized there was an insight and honesty to her that I think she understood and really embraced. The idea that Nan was like, 'Oh, I could see that all the way. That woman was nuts.' That to me was just fun, because it is kind of believable, and I think almost believable to Cupp that she had that insight. The two of them were so delightful together.\"\n\nHonestly, this feels like an unsatisfying answer for why it was chosen as the final note of the show.",
        "upvotes": 12,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jj53ud/the_residence_ending/"
    },
    {
        "id": "1jju6vq",
        "author": "bvtternvt",
        "title": "Con Mum – Partner’s terrible vocal fry made the show unwatchable for me",
        "content": "Just tried watching Con Mum because I love these kinds of stories, but I had to abandon it after five minutes. The victim’s partner has the worst vocal fry, and at the beginning she gets so much screen time, which makes it hard to skip over her talking. It felt like nails on a chalkboard to my ears",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1jju6vq/con_mum_partners_terrible_vocal_fry_made_the_show/"
    },
    {
        "id": "1jj0srv",
        "author": "MamaMia1325",
        "title": "What are your top 3 Netflix comfort watch shows?",
        "content": "I recently finished watching Younger, I loved it and it’s now my top comfort watch show.\n\nSanta Clarita Diet\n\nDexter \n\nSchitt’s Creek was my favorite when it was on Netflix.\n",
        "upvotes": 19,
        "comments": 56,
        "media": null,
        "permalink": "/r/netflix/comments/1jj0srv/what_are_your_top_3_netflix_comfort_watch_shows/"
    },
    {
        "id": "1jikozu",
        "author": "sidroy81",
        "title": "‘Did you say India?’: Stephen Graham shocked by Adolescence blowing up in India, says the show came to him in a flash",
        "content": "",
        "upvotes": 176,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1jikozu/did_you_say_india_stephen_graham_shocked_by/"
    },
    {
        "id": "1jijpqx",
        "author": "DifficultVirus5751",
        "title": "Adolescence Jamie Katie online bullying",
        "content": "I know there’s a lot of discussion on whether Katie was bullying Jamie, or was he calling him out on his behaviour and attitudes towards women. That’s a whole other convo and one I’ve had with a few people over the last few days but something that seems to have been overlooked a lot..\n\nIn the first episode when Jamie is being questioned by the cops, they show screenshots of the Instagram profile with the model and in the cop’s own words, Jamie had left “aggressive” comments on her photos. He’d also reposted her photos on to his own insta account, meaning his classmates would’ve seen it. \n\ntake away all the other factors (Katie having her n*des shared, Jamie’s blatant terrible  attitudes towards women, him trying to ‘get’ Katie at her weakest) wouldn’t just her seeing his aggressive comments be “justification” enough for leaving the emojis on his photos? \n\nWould it be a mature way to handle the situation? No. But she’s 13. And comments/ messaging on social media is their language. But I can’t help but think if a kid had made openly racist or homophobic comments on someone’s photos which was seen my a classmate, then said classmate posted some emojis reflecting this…. It wouldn’t be “bullying” it would be calling a spade a spade. ",
        "upvotes": 208,
        "comments": 109,
        "media": null,
        "permalink": "/r/netflix/comments/1jijpqx/adolescence_jamie_katie_online_bullying/"
    },
    {
        "id": "1jjdk22",
        "author": "PlantedinCA",
        "title": "I’m sucked into “Until You Burn.”",
        "content": "After watching Queen of Flow, Netflix shows me an ever rotating cast of telenovelas. Not all of them satisfy my cravings for popcorn television.  \n\nBut 4 episodes into Until You Burn, I am sucked in.  \n\nThe story here is a typical brother is seeking to avenge the death of his brother. It looks like he was murdered by someone a wealthy family or connected to them.  \n\nA few things of note in this telenovela compared to others I have scanned or skipped:\n- class theme are pretty typical, but this one is also layering in race on top of the class\n- since there is a race theme here, there are visible Black people and even supporting characters that get screen time and dialogue \n- I don’t speak Spanish so I am watching with English subtitles. I know some words here and there but so some translations look a little funny\n- this show is set in the beach, at sea - really pretty visuals \n- the sounds track is great and seems to be covering a good selection of Colombian music \n- this doesn’t seem to have any cartel angles which is such a common stereotype of Colombian shows, this seems to be a more basic poor guy gets revenge on rich people story - not unlike the show Revenge which I also really enjoyed. \n\nIf you like revenge dramas where the character is playing the long game to infiltrate, you’ll probably enjoy this one, based on the first few episodes. \n\nIt also seemed to be super popular in Colombia - getting like 35-40% prime time viewers so that bodes well for an engaging 60 episodes. And it just finished its run in February so it made it to Netflix quick. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jjdk22/im_sucked_into_until_you_burn/"
    },
    {
        "id": "1jj890g",
        "author": "DarkLink287",
        "title": "Add member",
        "content": "So I've changed my account membership to where is basic without ads and I purchased an extra member so my gf can watch at her place. I keep going to send the email invite and it says that email is already in use. Idk what to do. She previously had her own Netflix but not anymore. Idk what to do. We even had her make a new email address and I sent an invite to that. She hasn't received it. And now whenever I try to send it again Netflix just keeps saying 'please try again later '. I don't even know. Just....can someone help on any way? Thank you",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jj890g/add_member/"
    },
    {
        "id": "1jifv56",
        "author": "Significant-Fun-4235",
        "title": "What's a Netflix show you loved but it got cancelled?",
        "content": "https://preview.redd.it/et700prrejqe1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=0d9b7be79f5979d79f4cbaea8efafdc7c19defe0\n\nNow i know there are literally hundred of shows that are canceled, but Netflix has had a bad reputation when it comes to canceling shows that get love from fans. For me, it will always be Archieve 81! \n\nIt was creepy, mysterious, amazing, and literally had what it takes to become a Stranger Things-level show, if not bigger. ",
        "upvotes": 139,
        "comments": 720,
        "media": null,
        "permalink": "/r/netflix/comments/1jifv56/whats_a_netflix_show_you_loved_but_it_got/"
    },
    {
        "id": "1jjbgmf",
        "author": "IntelligentSide5485",
        "title": "World War Documentaries or series",
        "content": "I'm on a quest for compelling series or documentaries about World War I or II. Looking for insightful narratives, historical accuracy, and engaging storytelling. Any recommendations beyond the usual suspects? Share your favorites, whether they're well-known classics or hidden gems. Bonus points for those focusing on lesser-known perspectives or events! #WorldWar #Documentary #Series #History #Recommendations",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1jjbgmf/world_war_documentaries_or_series/"
    },
    {
        "id": "1jiaf2l",
        "author": "Glass-Relative-9849",
        "title": "I Think adolescence is genuinely one of the most eye opening pieces of media made recently.",
        "content": "From the desensitised nature of the children in the school only asking for videos of the murder to the cheering and filming in the school fight as well has his friend casually lending him a knife to \"scare\" Katie. The pupils not listening to teachers who are emotionally and physically absent towards all of the children plus the children's refusals to take part/ care about the lessons or authority at all. This is even shown after Jamies  dad confronts the teens who vandalised his car laughing at his genuine struggle and emotion. Jamies behaviour towards women such as the psychologist and his mum and his immediate switches in attitude towards any male figures. The obsessive lying such as about pickles, marshmallows and his small ways of putting the psychologist down like calling her old or being rude about her sandwich as well as his mum where he says shes good at nothing but cooking roast. the obsession with media shown through his isolation into his bedroom after receiving a gaming set up. its not explicitly said he was watch the red pill andrew tate type media however its inferred. the detective who cannot connect with his son in the slightest due to his isolation and even the detective (I believe) viewing him as less than (due to his former popularity and the son not being popular). the way real society has received this media as well many people denying Jamie did it after CCTV showed explicitly what happened or justifying it due to Katies \"bullying\" which was just calling Jamie out on his genuine misogynistic views towards katie and girls in general. Believing he's better than other men as he didn't SA katie even thought he \"had the chance\" and after his guilt was discovered he less regularly said \"i didn't do it\" but switches to \"i didn't do anything wrong\" showing his rationalisation of his actions due to his veiws on women. This show is amazing i've never seen anything so real and so accurate of our society ever. I could write an essay about this show and these are just SOME of the tiny details in the show that i missed at first but its crazly well written and has a scarily accurate depiction of the disheartening youth culture currently so well. \n",
        "upvotes": 284,
        "comments": 103,
        "media": null,
        "permalink": "/r/netflix/comments/1jiaf2l/i_think_adolescence_is_genuinely_one_of_the_most/"
    }
]