[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 694,
        "comments": 5129,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nulcv9",
        "author": "Travisauce",
        "title": "Need something new to binge.",
        "content": "What’s the most underrated show on Netflix right now?\n\n\nI feel like I’ve seen all the popular ones (Stranger Things, Dark, etc.), but I want something that doesn’t get talked about as much. Any hidden gems you’d recommend?",
        "upvotes": 132,
        "comments": 386,
        "media": null,
        "permalink": "/r/netflix/comments/1nulcv9/need_something_new_to_binge/"
    },
    {
        "id": "1nv1czx",
        "author": "EclipseTheStars",
        "title": "If Netflix *ISNT* Releasing Seasons All-At-Once, Why Not Do Weekly Episodes Instead??",
        "content": "Just found out that Stranger Things 5 will be airing 4 episodes in November, 3 in December, and 1 in January for \"viewer retention.\"\n\nWhy don't they just start on Thanksgiving with weekly episodes that go throw 3 core holidays? Thanksgiving, Christmas, and New Years?\n\nPeople talk about it on social media, share their opinions, sometimes it's on talk shows, Game Of Thrones did this best, I don't know why Netflix doesn't do this. WEDNESDAY was the same.\n\n\\---------------------------------------------\n\nTL;DR\n\nObviously, just give me the entire season all at once. The premise is that they \\*DONT\\* do that anymore. And honestly, splitting up the seasons of these shows a few episodes MONTHS apart is so much worse than week-by-week episodes for a few months sraight.\n\nAlso, people tend not to give a @#$% anymore after binge watching half the season and then having to wait another month for the rest. Am I only in this way of thinking?",
        "upvotes": 8,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1nv1czx/if_netflix_isnt_releasing_seasons_allatonce_why/"
    },
    {
        "id": "1nu9kbz",
        "author": "Tr0jan___",
        "title": "Ms. Rachel announced as the new global ambassador for PCRF (Palestine Children's Relief Fund)",
        "content": "",
        "upvotes": 190,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nu9kbz/ms_rachel_announced_as_the_new_global_ambassador/"
    },
    {
        "id": "1nv28cl",
        "author": "Enzian_Blue",
        "title": "European shows",
        "content": "Hi there. We loved shows like Dark, der Pass (Pagan Peak), das Boot.. the atmosphere is special, the actors are more ‘real’. Any recommendations that we might enjoy? \n\nThank you :)",
        "upvotes": 3,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1nv28cl/european_shows/"
    },
    {
        "id": "1nulvlm",
        "author": "FNAFLV22",
        "title": "Just heard of “Maniac” and saw the IMDb rating. To those who have seen both shows, which show did you like more?",
        "content": "",
        "upvotes": 32,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1nulvlm/just_heard_of_maniac_and_saw_the_imdb_rating_to/"
    },
    {
        "id": "1nuabrk",
        "author": "Sweaty-Toe-6211",
        "title": "'THE WITCHER' Season 4 reportedly cost over $25M per episode, making it $221M overall - The total budget for ‘THE WITCHER’ series has now reached an estimated $720M",
        "content": "",
        "upvotes": 128,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1nuabrk/the_witcher_season_4_reportedly_cost_over_25m_per/"
    },
    {
        "id": "1nuztc3",
        "author": "Anteater_Able",
        "title": "Charlie Hunnam on Becoming Ed Gein for Netflix's 'Monster'",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nuztc3/charlie_hunnam_on_becoming_ed_gein_for_netflixs/"
    },
    {
        "id": "1nu5lno",
        "author": "Original2021",
        "title": "Toni Collette totally carried the Wayward series",
        "content": "This has to be one of the oddest shows I’ve ever seen. The storyline had potential but the bad acting (aside from one of two performances) and unrealistic storyline was terrible. There was some mention about some of the kids jointing government agencies but they all lived in the town. Like huh??? The only saving grace was Toni Collette’s performance. She’s the only reason I watched until the end. I hope she gets an Emmy nomination for having to make something out of a Nonsensical script. ",
        "upvotes": 151,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1nu5lno/toni_collette_totally_carried_the_wayward_series/"
    },
    {
        "id": "1nuxals",
        "author": "Corrupt_Echo",
        "title": "Need a new show",
        "content": "I’m 13, have seen Locke and key and thought it was cool (not scary at all) and a good show of mine, not a big fan of stranger things\nI’m looking for a good horror/thriller",
        "upvotes": 3,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1nuxals/need_a_new_show/"
    },
    {
        "id": "1nuvf16",
        "author": "Worth_Vermicelli_319",
        "title": "In the mood for a sci-fi and romance series that has both psychological and romantic tension.",
        "content": "I’m in the mood for a sci-fi and romance series that has both psychological and romantic tension. I have watched Dark, 1899, Into the Night, Call Me by Your Name, and Normal People. Can you recommend me something that’s a combo between them and has a similar theme?",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nuvf16/in_the_mood_for_a_scifi_and_romance_series_that/"
    },
    {
        "id": "1nv1t7z",
        "author": "No_Caregiver_5382",
        "title": "Trying to run Netflix in 4K on PC",
        "content": "I'm being driven crazy with ts.\n\nI downloaded the codec on the mircosoft store\n\nI have a RTX 4090. and a MSI 321 URX QD OLED.\n\nI've unplugged every other mointor\n\nI've tried to use HDMI and the DP cable that comes with this, its a DP 1.4 and HDMI 2.0.\n\nI have the netflix plan that allows me to even use 4K, Hell, it for some reason doesnt even SHOW 4k, just \"HD\" i've tried squid game, devil may cry, and the witcher. all show the same thing. it'll show the dolby thing. but not the 4K HDR\n\nI tried Edge and the app itself. However in the debugging stats for nerds, it shows 1080p. I've done everything i can to try and make it work but it just won't. If anyone here has any ideas. please let me know what it could be. i'm at my wits end. Is there anything that i'm doing wrong that's making it not work? Do i need to reinstall windows? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nv1t7z/trying_to_run_netflix_in_4k_on_pc/"
    },
    {
        "id": "1nu8did",
        "author": "Sea-Opposite3920",
        "title": "Why does everybody hate Wayward",
        "content": "It completely gripped me for 7 hours. I mean sure its unrealistic and there were plot holes, but like it's fiction. The acting was great - I thought - and the emotional abuse which lead to character developments felt real. Not everyones cup of tea I suppose. ",
        "upvotes": 52,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1nu8did/why_does_everybody_hate_wayward/"
    },
    {
        "id": "1nv0uj6",
        "author": "alwayzhope",
        "title": "random shows (recommended Because You Watched...) kept playing on their own episode after episode while I'm watching another show, concurrently",
        "content": "something's wrong with netflix! anyone experiencing the same???\n\nobviously checked devices signed in and there is nothing suspicious. the only device showing last viewing activity coincides with my computer which I was watching netflix on. it's like my computer with 1 window, 1 netflix tab, has been playing 2 shows AT ONE GO for a couple of weeks now.\n\nso i want to know, anyone experiencing the same??? i am 100% sure it's netflix problem, yet i cannot report it on the viewing activity page...",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nv0uj6/random_shows_recommended_because_you_watched_kept/"
    },
    {
        "id": "1nuymuc",
        "author": "Xuayu",
        "title": "Need suggestions",
        "content": "Looking for shows similar to Workin’ Moms, Survival of the thickest, and Bonding. Generally looking for feel good shows I can have on in the background. Something funny, maybe raunchy? Or crude humour? Not sure what the genre is called.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nuymuc/need_suggestions/"
    },
    {
        "id": "1nusucl",
        "author": "EnderFreakYT",
        "title": "“Get a code to watch on this TV” cannot select options",
        "content": "So i recently was hit with the lovely get a code to watch screen and when i click the “im traveling” button, it takes me to a page to request a code… except it doesnt let me highlight the button and select it. Its happening on both xbox and on the TV remote itself.\n\nAny ideas?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nusucl/get_a_code_to_watch_on_this_tv_cannot_select/"
    },
    {
        "id": "1nuxi1z",
        "author": "blossombreeze34",
        "title": "I'm a bit confused about a scene in the 5th episode of Alice in Borderland Season 3. Can anyone help clarify?",
        "content": "I have a question about the 5th episode were ee see Ryuji watching a clip of his future where he and Usagi are meeting and chatting about an interview and his theory. After that, they’re walking together, laughing about her story. Then, he asks her out for dinner, and she replies with a smile, \"Let me think about it.\"\n\nSo, my doubt is, at that point in time, is Usagi single or still married to Arisu in that future and hinting a possible affair ? I'm really confused by all the future clips.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nuxi1z/im_a_bit_confused_about_a_scene_in_the_5th/"
    },
    {
        "id": "1nur96v",
        "author": "Signal-Style-6159",
        "title": "Nightmares of Nature - wowza",
        "content": "Has anyone seen it yet?  It's awesome.  \nIt is a different perspective on nature.\nI've never seen anything like it.\nI have been watching nature documentaries for over 55 years.  Thank you Netflix!  More please 🦉🐜🐊",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nur96v/nightmares_of_nature_wowza/"
    },
    {
        "id": "1nuh62m",
        "author": "Anteater_Able",
        "title": "Duffer Brothers on Netflix Exit, Stranger Things Future",
        "content": "",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nuh62m/duffer_brothers_on_netflix_exit_stranger_things/"
    },
    {
        "id": "1nutwjv",
        "author": "Eaglemama70",
        "title": "HOUSE OF GUINESS",
        "content": "I pretty much binged this series. It is so good! I am biased being 35% Irish. There is something about Irish music and men beating the shit out of each other!!!",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nutwjv/house_of_guiness/"
    },
    {
        "id": "1nv1rp2",
        "author": "Classic-Might-5574",
        "title": "I pay for the service... why adds? In the middle of the show!",
        "content": "I don't know when this happens, I don't use netflix much, I used to. I guess if I pay for a higher teir there won't be adds. But like wtf. I have to pay for the opportunity to watch adds now? And if I pay more I can skip the adds, I guess. No paid service should have adds in it! 😡",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nv1rp2/i_pay_for_the_service_why_adds_in_the_middle_of/"
    },
    {
        "id": "1nurrf3",
        "author": "ranch_avocados",
        "title": "Email subject line",
        "content": "So.... Netflix sends out the usual emails about this movie or that movie. I'm fine with it, if ts good to know.\n\nBut my question is....can you change these emails and make them stop putting your profile name in the subject line of the emails? \n\nThx",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nurrf3/email_subject_line/"
    },
    {
        "id": "1ntkjg0",
        "author": "jerkoff1610",
        "title": "An actual family member reveals six things Netflix’s House of Guinness gets wrong in the show",
        "content": "",
        "upvotes": 232,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1ntkjg0/an_actual_family_member_reveals_six_things/"
    },
    {
        "id": "1nunqo3",
        "author": "HistoryfictionDetect",
        "title": "Looking for Recs for Comfy TV Series NOT RATED MA",
        "content": "Hi! I recently got Netflix and am looking for TV series recommendations. I love mystery, supernatural, fantasy, etc but am struggling to find story-based shows that aren't rated MA. I love quirky shows like Pushing Daisies, Psych, and Chuck and am hoping to find something to watch that is fun and creative. Any suggestions?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nunqo3/looking_for_recs_for_comfy_tv_series_not_rated_ma/"
    },
    {
        "id": "1nul19l",
        "author": "swagy_swagerson",
        "title": "Watching Berzerk on Netflix and there there are these coloured dashes in the upper quarter of the frame.",
        "content": "Hopefully you can make the dashes out in the video. I know nothing is wrong with my tv because as you can see the dashes disappear as soon as I exit the video. \n\nAlso I'm in the UAE if that's relevant.",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/c95a9n3nhcsf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nul19l/watching_berzerk_on_netflix_and_there_there_are/"
    },
    {
        "id": "1nuq5sc",
        "author": "pennycollinz",
        "title": "Does Wayward speed up after the first episode?",
        "content": "Got through the first episode and nothing seemed to pick up and *stay* exciting. There are definitely questions to be answered, it's definitely weird but so far none of the characters seem exciting enough to want to know what happens to them. Is the show a slow burn or does it pick up after the first episode?\n\n\nEdit: spelling",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nuq5sc/does_wayward_speed_up_after_the_first_episode/"
    },
    {
        "id": "1nujhjm",
        "author": "Eclipse8301",
        "title": "How does account sharing work.",
        "content": "I'm so confused, i'm just trying to move my account (Email 1) to a family account (Email 2).\n\n-So I transferred my profile (it shows up now in Email 2 just fine.\n\n-I canceled my account (Email 1)\n\n-Now email 2 received a text message that says that my profile from Email 1 is pending and needs to be confirmed?\n\n-Ok? So family member sends me the link, it brings me to an account creating/activation screen?\n\nWhat is going on, don't i just use Email 2's account and password? Why do i need to create a new one? (heck why couldn't i just use my original account sign in info while i'm at it?)\n\nWhy is this so confusing.....",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nujhjm/how_does_account_sharing_work/"
    },
    {
        "id": "1nu8e71",
        "author": "LCarbonus",
        "title": "Alice in Borderland... Season 3?!",
        "content": "Is it just me or does Alice in Borderland closes per-fec-tly in season 2? Has anyone read the manga? Does it have more there? Because this feels like it's just them trying to milk the cow a bit more. ",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nu8e71/alice_in_borderland_season_3/"
    },
    {
        "id": "1nufmuv",
        "author": "Practical-Finger-613",
        "title": "can u guys help me",
        "content": "so I bought a netflix subscription and I did rhe payment and everything the money went through but netflix is showing \"ur payment is pending\" I don't know what to do \nI contacted costumer support and after 7 MINUTESS an agent finally got the call I told them about my situation and they hang up. please help",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nufmuv/can_u_guys_help_me/"
    }
]