[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 482,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hm18t3",
        "author": "AutoModerator",
        "title": "NFL Christmas Gameday Megathread",
        "content": "1:00pm ET - Kansas City Chiefs @ Pittsburg Steelers\n\n4:30pm ET - Baltimore Ravens @ Houston Texans",
        "upvotes": 26,
        "comments": 584,
        "media": null,
        "permalink": "/r/netflix/comments/1hm18t3/nfl_christmas_gameday_megathread/"
    },
    {
        "id": "1hm64x4",
        "author": "AnonymousUser8476249",
        "title": "Netflix needs a “Live” button / option",
        "content": "There needs to be a way to jump to the live action when viewing a live event such as an NFL game.  \nApple TV latest version, latest os, etc. \nWhen you switch away from the game and then come back, Netflix holds your spot.  Which is great when watching regular shows and movies, but sucks when watching a live event.\n\nI understand that this may be baked into the core architecture of Netflix, but they need to at least add a button to jump to the live action.  Currently the only way to do this is to fast forward until you reach the live spot.  \n\nHopefully someone from Netflix sees this and makes it happen.",
        "upvotes": 164,
        "comments": 106,
        "media": null,
        "permalink": "/r/netflix/comments/1hm64x4/netflix_needs_a_live_button_option/"
    },
    {
        "id": "1hmcjls",
        "author": "ohhhKid",
        "title": "Korean zombie movies are top tier",
        "content": "New show called Happiness out on Netflix, korean based, zombie theme show. I love zombie movies, but “all of us are dead” “kingdom” and “happiness” are awesome choices! Really hope to see more Korean zombie movies/shows in the future",
        "upvotes": 14,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hmcjls/korean_zombie_movies_are_top_tier/"
    },
    {
        "id": "1hm5mb8",
        "author": "Impossible_Good4644",
        "title": "Looking for some good netflix series recommendations.",
        "content": "\nI recently watched Ozark and it was the best series i have ever seen. I like thriller, romance and feel good series. I would love some recommendations. Thanks",
        "upvotes": 14,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1hm5mb8/looking_for_some_good_netflix_series/"
    },
    {
        "id": "1hma0e6",
        "author": "tokyographer",
        "title": "Any thoughts on the One Hundred Years of Solitude series?\n",
        "content": "Just been watching the series after reading the book several times. The series seems pretty accurate to the book, although Gabriel Garcia Marquez never wanted the book to be put into a movie. It seems that stretching the book into an 8 episode series gave a lot of opportunity to make it very faithful to the book.",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hma0e6/any_thoughts_on_the_one_hundred_years_of_solitude/"
    },
    {
        "id": "1hm8a8e",
        "author": "Dry-Detective-8933",
        "title": "Can’t stream live sports from phone to tv",
        "content": "I have a Chromecast I can normally stream Netflix shows from my iPhone to Chromecast just fine but when it comes to live sports it won’t stream anyone know why? Restrictions? If so it’s dumb!",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1hm8a8e/cant_stream_live_sports_from_phone_to_tv/"
    },
    {
        "id": "1hmbxt7",
        "author": "jwmoz",
        "title": "Black mirror white Christmas ",
        "content": "I would go as far to say that this episode is a masterpiece. Multiple concepts combined, multiple threads of the story that meet at the end, and a fantastic ending that leaves me smiling at the music, horror and execution. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hmbxt7/black_mirror_white_christmas/"
    },
    {
        "id": "1hmdkpg",
        "author": "cajunf0cker",
        "title": "Netflix doesn't allow downloading on PC",
        "content": "I  usually watch Netflix from home. I am travel so figured I would go download some things for the flight. Fun fact, if you have a pc, you can't download movies anymore. Like WTF... Why?!? Why take a service aways from people. It's ridiculous. I absolutely hate when I pay for something and they remove functionality from the app... Netflix can suck it",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hmdkpg/netflix_doesnt_allow_downloading_on_pc/"
    },
    {
        "id": "1hm3rh5",
        "author": "Extreme_Homework7936",
        "title": "Richard Curtis on Crafting Holiday Magic with \"That Christmas\"",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hm3rh5/richard_curtis_on_crafting_holiday_magic_with/"
    },
    {
        "id": "1hmcxrr",
        "author": "Anxious-Ad-9826",
        "title": "Netflix auto dimming on my phone?",
        "content": "I’m not sure if it’s a problem with my phone, or Netflix, but when I’m watching a show and there’s a bright scene, my screen automatically dims. However my screen brightness itself doesn’t move. I’ve noticed it the most when I’m watching anime, like demon slayer or mha. Any help?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hmcxrr/netflix_auto_dimming_on_my_phone/"
    },
    {
        "id": "1hmc04d",
        "author": "Feanixxxx",
        "title": "Would a VR headset make the Bird Box Monsters irrelevant?",
        "content": "I mean to the outside, your eyes can't be seen. And you can't see the world. \n\nYou can have the world be shown in a cartoonish style or with modern cameras see the world just like you would with your own eyes.\n\nSo just get a good amount of power banks onto you, use the VR headset and you are good to live again?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hmc04d/would_a_vr_headset_make_the_bird_box_monsters/"
    },
    {
        "id": "1hmbd96",
        "author": "Amos_FR",
        "title": "Prenium membership was paid but when I log in it asks me to finish signing up and choosing a plan",
        "content": "Got 20 bucks removed from my bank account December 24th for the prenium account membership I already had, and now when I connect to my account it says I have to pay. So I'm pretty confused. Did the membership stop? Why? Should I contact Netflix somehow to get my 20 bucks worth back or something?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmbd96/prenium_membership_was_paid_but_when_i_log_in_it/"
    },
    {
        "id": "1hllhly",
        "author": "techfinpro",
        "title": "The Sandman Star Jenna Coleman Confirms Return for Season 2, Teases 'Cinematic' Scale",
        "content": "",
        "upvotes": 128,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1hllhly/the_sandman_star_jenna_coleman_confirms_return/"
    },
    {
        "id": "1hm67r1",
        "author": "OkAdagio4389",
        "title": "Easier way to login and other issues?",
        "content": "Hi so first of all, is there an easier way to login that typing the email and password on the TV? It was so laggy even though I have the best internet around.\nSecondly, as I watch the KC game, different family members at different TVs around the house, one is far behind the other. Why is that? Can it be rectified?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hm67r1/easier_way_to_login_and_other_issues/"
    },
    {
        "id": "1hmaa8f",
        "author": "Mingming_143",
        "title": "Netflix games not letting me log in?",
        "content": "When I try to select a profile when logging in, it gives me an error and doesn’t let me play the game. I’ve had this problem with all other or Netflix’s games, and I cannot fix it. This happened with Monument Valley 3 and Storyteller, but I’m sure it does the same with other games. No matter what profile I select or how many times I restart my phone, it still won’t work. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hmaa8f/netflix_games_not_letting_me_log_in/"
    },
    {
        "id": "1hm9dcl",
        "author": "aWicca",
        "title": "Extra member from another country and activation?",
        "content": "I am trying to add another household (my parents that live in another country) as an extra member but I am being blocked by country restriction.\n\nI read a lot of posts and what I’ve gathered is that the account only needs to be activated in a OG country, but after that it can be used whenever.\n\nSo realistically can I send a request to my mom, log in to her email through my laptop, activate it, and then give her access?\n\nWould that work?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hm9dcl/extra_member_from_another_country_and_activation/"
    },
    {
        "id": "1hm6fhd",
        "author": "MellyMellTacoBell",
        "title": "4k subscription",
        "content": "Hi, I bought a 4k projector, and I saw that there was an improvement in streaming quality to switch it to 4k. Is this really significant?And is it worth it? Thank you in advance!!",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hm6fhd/4k_subscription/"
    },
    {
        "id": "1hm4ouy",
        "author": "CanIStopAdultingNow",
        "title": "Horribly placed commercials",
        "content": "I'm so annoyed. I decided to get Netflix with commercials and they placed a commercial in the middle of the song \"I'm Just Ken\" in the Barbie movie. \n\nHow hard is it to place commercials in programs so they don't ruin what you are watching? ",
        "upvotes": 3,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hm4ouy/horribly_placed_commercials/"
    },
    {
        "id": "1hma3fo",
        "author": "Astronaut-Tall",
        "title": "ASAP! HELP",
        "content": "I have been using my aunts account for Netflix for years bit now that they have the household bs I made an account for Christmas as my aunt gave me a gift card and i made the account at her house but it was saying the same thing then i came home but its still saying this any help would be appreciated greatly!",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hma3fo/asap_help/"
    },
    {
        "id": "1hm2bvo",
        "author": "Melonuski",
        "title": "Automatically translated subtitles as an option",
        "content": "I often watch with my wife and she speaks Portuguese, I speak German and we speak English with each other.\nBut very often there are movies that don't have subtitles, which is annoying and inconvenient. \nWhy was there no automatic translation into all languages for the subtitles? Even freeware software for subtitle editing can do this, but not the big streaming providers like Netflix, Disney or Prime and it would be so easy. \nIt doesn't have to be perfect, but sometimes a simple translation helps.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hm2bvo/automatically_translated_subtitles_as_an_option/"
    },
    {
        "id": "1hlovi8",
        "author": "jumpcakework",
        "title": "Best starter Christmas movie? ",
        "content": "I didn’t grow up Christian/celebrating Christmas and I’m now realizing as an adult that I’ve never seen a lot of the classics. I’m free tonight since all my friends are understandably spending time with their families and want to get in the spirit! ",
        "upvotes": 16,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1hlovi8/best_starter_christmas_movie/"
    },
    {
        "id": "1hl0d6u",
        "author": "parkix",
        "title": "How \"Carry On\" could have ended in 5 minutes",
        "content": "Receives random text: \"Put the earbud in, Ethan.\"\n\"Yeah, no. This is sketchy. I’ll report it to my boss, have the cops detain the woman who gave me the earbud, and we’ll investigate what’s going on instead of blindly following orders from a random text.\"\n\nMovie ends. Roll credits.\n\nQuite amazing how easily people are entertained.\n\n\n",
        "upvotes": 1200,
        "comments": 319,
        "media": null,
        "permalink": "/r/netflix/comments/1hl0d6u/how_carry_on_could_have_ended_in_5_minutes/"
    },
    {
        "id": "1hm5enn",
        "author": "kdex86",
        "title": "Why is some content locked to the ad-free tier?",
        "content": "I recently re-subscribed to Netflix today, subscribing to the base $6.99 tier, to watch the NFL games.  It’s been a very long time (at least 2 years) since I last subscribed to the service.\n\nI have been adding shows and movies to watch to my queue, and I was really disappointed that the movies No Hard Feelings and It Ends With Us require the $15.49 tier to watch.\n\nWTF, Netflix?  Max and Hulu don’t require more expensive tiers to watch various movies and shows.  I may be breaking up with you again in a month.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1hm5enn/why_is_some_content_locked_to_the_adfree_tier/"
    },
    {
        "id": "1hlim5l",
        "author": "Atlast_2091",
        "title": "Cobra Kai: Season 6 | Part 3 on February 13th, 2025 | Netflix",
        "content": "",
        "upvotes": 17,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hlim5l/cobra_kai_season_6_part_3_on_february_13th_2025/"
    },
    {
        "id": "1hlqjks",
        "author": "igiveuponaname29",
        "title": "Zombie movie search",
        "content": "I’m looking for a zombie movie I watched years ago (pre 2020) was around 2015-2017 ish time frame and the movie starts with a camera shot through a house with a little girl watching tv (at the end of the movie it goes back to that cabin and the girl is dead, that’s pretty much all I remember from the movie I try to think of more and I can’t tell what’s being mixed from other zombie movies. I know there was a “tv commercial” of a woman showering I’m pretty sure there was a cure in the form of an injectable. Again my memory is hazy I just remember liking the movie a lot and it having some like special ops running through it maybe. If it helps i use Canadian Netflix.",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hlqjks/zombie_movie_search/"
    },
    {
        "id": "1hltjta",
        "author": "CarelessSentence1709",
        "title": "So I’m watching Clickbait for the first time, S1E6, and I want to share my theories…",
        "content": "Please do not ruin anything for me, I know this is not a new show and therefore there is a definite resolution but where is the fun in that? This is how I enjoy things, I like to theorize and analyze, and see how close I get. \n\nRight now, after seeing this whole Simon and Sarah thing, I’m pretty positive Simon was behind the video, but I actually think it’s possible Nick took his own life or got beaten badly and due to the head trauma, he fell into that ravine. \n\nI also think he was threatened and pressured similar to how kids are cyber bullied and all…. And I think he was given an ultimatum, and did it himself but that doesn’t account for the whole van thing. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hltjta/so_im_watching_clickbait_for_the_first_time_s1e6/"
    },
    {
        "id": "1hm3mxh",
        "author": "Extreme_Homework7936",
        "title": "Christina Milian: \"I do believe everybody has someone who's out there\"",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hm3mxh/christina_milian_i_do_believe_everybody_has/"
    },
    {
        "id": "1hlx8hd",
        "author": "ShivaEditz",
        "title": "Should I continue watching You?",
        "content": "I just completed watching season of the series You. I really liked the season but I am not as excited to watch s2, I am feeling the story will get a bit repetitive. I have read reviews about people saying s1 was best and then it's downfall. Are the rest of the season good enough to be watched?",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1hlx8hd/should_i_continue_watching_you/"
    },
    {
        "id": "1hkobca",
        "author": "TheExpressUS",
        "title": "Squid Game creator 'sick' of Netflix hit and 'begs for no more calls' about the show",
        "content": "",
        "upvotes": 816,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1hkobca/squid_game_creator_sick_of_netflix_hit_and_begs/"
    },
    {
        "id": "1hl73jd",
        "author": "No_Walrus4306",
        "title": "Is “you” worth watching?",
        "content": "I have lots of free time during Christmas and I’m looking for a good show on Netflix. Someone recommended me “you” and he told me it’s as good as breaking bad but after watching a few episodes I feel like it’s a waste of time. Did you guys find it good?",
        "upvotes": 28,
        "comments": 89,
        "media": null,
        "permalink": "/r/netflix/comments/1hl73jd/is_you_worth_watching/"
    },
    {
        "id": "1hm6ixb",
        "author": "__calypso",
        "title": "Netflix ads clearly not PG",
        "content": "Watching football with my kid and the ads are clearly not PG. I checked and the show is marked as PG though. Getting ads about Dexter and some horror movies etc. Hopefully this gets addressed soon. This is a serious blunder. ",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1hm6ixb/netflix_ads_clearly_not_pg/"
    }
]