[
    {
        "id": "1j3dhli",
        "author": "ColdWalletAMA",
        "title": "Hey, r/movies! I'm Cutter Hodierne, director/producer of the heist-thriller COLD WALLET. I'm excited to be here to discuss the film and answer your questions. Ask me anything! - Logline: A team of Redditors lose everything after a cryptocurrency scam. This leads them to plot to their revenge.",
        "content": "",
        "upvotes": 19,
        "comments": 55,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c70sq1utzome1.png?auto=webp&amp;s=06b31990d5ac3de310a9777a6b6c4fe2feec92f0"
        },
        "permalink": "/r/movies/comments/1j3dhli/hey_rmovies_im_cutter_hodierne_directorproducer/"
    },
    {
        "id": "1j3oi8j",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Steven Soderbergh - Monday 3/10 at 10:00 AM ET on /r/movies - Director of Ocean's Eleven, Logan Lucky, Sex Lies Videotape, Black Bag, Contagion, Erin Brockovich, Traffic, Magic Mike, Out of Sight, The Informant!, and much more.",
        "content": "",
        "upvotes": 32,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oofrhpqn8rme1.png?auto=webp&amp;s=c44ccb1c5532e9ab56d9c204787ca1963b864b41"
        },
        "permalink": "/r/movies/comments/1j3oi8j/amaqa_announcement_steven_soderbergh_monday_310/"
    },
    {
        "id": "1j3uct4",
        "author": "Sabiancym",
        "title": "Dad gets up during every movie without pausing.",
        "content": "My dad always does something I've only ever heard of people occasionally doing. No matter what movie or TV show he's watching at home, he will get up in the middle of it and with zero urgency, go to the bathroom, grab food, look out the window, or do any number of random things, all without pausing.  He'll then sit back down having missed 5-20 minutes without saying a word and never asks questions after the movie. \n\nIt used to drive me nuts when I lived at home over a decade ago and recently I stayed over one night and watched him do the same thing.  My mom doesn't even bother asking if she should pause. \n\nQuality doesn't matter either. It could be the greatest movie he's ever seen, but he'll still miss 10 minutes of it doing whatever. I've seen him take out the garbage, cook popcorn on the stovetop, and even fold laundry in another room all while a movie he wanted to watch was playing. \n\nThis is insane right? I understand not being in to a movie and getting bored, but in my 30+ years I've never seen or heard of him sitting through an entire movie.  This is the same guy who can sit on the porch for an hour or two doing nothing. I don't understand. \n\nTo be clear, I'm not trying to change him or anything. I just truly don't understand and want to see if anyone else knows someone like this.  \n&amp;nbsp;  \n****EDIT**** People keep saying it's about spending time with others or not wanting to interrupt. It's just my mom and dad at home, and if they disagree on what to watch she'll go upstairs to watch something while he watches what he wants alone....but still gets up without pausing.",
        "upvotes": 1855,
        "comments": 867,
        "media": null,
        "permalink": "/r/movies/comments/1j3uct4/dad_gets_up_during_every_movie_without_pausing/"
    },
    {
        "id": "1j3f6yv",
        "author": "MarvelsGrantMan136",
        "title": "‘Shōgun’ Star Cosmo Jarvis Joins Christopher Nolan’s ‘The Odyssey’ With Filming Underway In Morocco",
        "content": "",
        "upvotes": 6912,
        "comments": 411,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cWoTFxLPOSFllCkmjFe3hdLM1sf7FJ77psP1uL6mIj0.jpg?auto=webp&amp;s=f50d13d7be55a935c8e179db6cd0e062048d0e33"
        },
        "permalink": "/r/movies/comments/1j3f6yv/shōgun_star_cosmo_jarvis_joins_christopher_nolans/"
    },
    {
        "id": "1j3njnv",
        "author": "MarvelsGrantMan136",
        "title": "David Arquette Returning As Deputy Dewey Riley In ‘Scream 7’",
        "content": "",
        "upvotes": 1572,
        "comments": 226,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7O-5NYgn7PjLa4JNBAvtVM3hJATAV8zDxV_apztmYHI.jpg?auto=webp&amp;s=dfad7c157bf89739f57395241eb1bc3e0e160bad"
        },
        "permalink": "/r/movies/comments/1j3njnv/david_arquette_returning_as_deputy_dewey_riley_in/"
    },
    {
        "id": "1j3v3tv",
        "author": "sndwchss",
        "title": "i love when movies have those stupid in-universe tv shows",
        "content": "Like the ones where its the same exact premise, over and over again\n\nlike the “where are my pants” in the lego movie “ow my balls” in idiocracy, and “i got the shit kicked out of me” in sorry to bother you.\n\ni love how they insist this is the most popular show in universe i need more examples of this 😭😭😭",
        "upvotes": 281,
        "comments": 109,
        "media": null,
        "permalink": "/r/movies/comments/1j3v3tv/i_love_when_movies_have_those_stupid_inuniverse/"
    },
    {
        "id": "1j3m9ir",
        "author": "indiewire",
        "title": "Sean Baker's 'Anora' Editing Oscars Win Is Rare, but Not Unprecedented",
        "content": "",
        "upvotes": 962,
        "comments": 144,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g8NwjERrSZY0uO9FWUiYZuA5vYVmhujVf29v_2bHmSE.jpg?auto=webp&amp;s=1fa36d1d2c32983aedb783800100a32d467335ba"
        },
        "permalink": "/r/movies/comments/1j3m9ir/sean_bakers_anora_editing_oscars_win_is_rare_but/"
    },
    {
        "id": "1j3goan",
        "author": "Stonewalled89",
        "title": "Sneakers: the cult ‘feelgood heist film’ with a hefty cast and a byzantine plot",
        "content": "",
        "upvotes": 1797,
        "comments": 258,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3ydbVYx_WRjwf6mBX_848Q4-48jYh0ofUG8l9SMUpFM.jpg?auto=webp&amp;s=cb10605249339983c77e548bc79ef0919480b28b"
        },
        "permalink": "/r/movies/comments/1j3goan/sneakers_the_cult_feelgood_heist_film_with_a/"
    },
    {
        "id": "1j32rrn",
        "author": "gaporter",
        "title": "Michelle Trachtenberg, Shannen Doherty, Tony Todd Among Those Omitted From Oscars In Memoriam Segment",
        "content": "",
        "upvotes": 9628,
        "comments": 740,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/65wwYCPiIxkD8EIWLU4chm3juxNsnXxrMVDHn07mqD4.jpg?auto=webp&amp;s=0193f46fd07411682f37d7b0f8dd7166555e1ce2"
        },
        "permalink": "/r/movies/comments/1j32rrn/michelle_trachtenberg_shannen_doherty_tony_todd/"
    },
    {
        "id": "1j3j623",
        "author": "KillerCroc1234567",
        "title": "Updated Oscar Viewership - 19.7M Viewers",
        "content": "",
        "upvotes": 458,
        "comments": 85,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rYijIoOUxXHe-mRRNiH_qOc-WXrUv-htTKcGVkJHODg.jpg?auto=webp&amp;s=f012c1841ae412055767f6da9214f850d015ee10"
        },
        "permalink": "/r/movies/comments/1j3j623/updated_oscar_viewership_197m_viewers/"
    },
    {
        "id": "1j3dh79",
        "author": "Orson2077",
        "title": "Buster Scruggs: \"Do you need a count?\"",
        "content": "In the first episode of Buster Scruggs, Buster and the Kid both ask *\"Do you need a count?\"* during their shootouts. I don't know what to make of it. Is it some kind of trick to give an advantage to the asker? \n\n \\- If the opponent answers \"yes\", I presume a third party would count and they'd shoot (a fair match).\n\n \\- If the opponent answers \"no\", the asker can shoot immediately while the opponent is preoccupied with the question.\n\nIf it is a trick, is it supposed to imply that Buster isn't as honourable as he lets on? (\"Buster Scruggs don't shoot nobody in the back.\")",
        "upvotes": 692,
        "comments": 111,
        "media": null,
        "permalink": "/r/movies/comments/1j3dh79/buster_scruggs_do_you_need_a_count/"
    },
    {
        "id": "1j3ys6m",
        "author": "KrzyHooy",
        "title": "Hollywood star Jesse Eisenberg officially granted Polish citizenship",
        "content": "",
        "upvotes": 21,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/i-0Yn10fiVcBPbwmpRX7v1cGoNDhR3IqP9ibaHISDzI.jpg?auto=webp&amp;s=d073a3aee9b3de27f804fc0439ba0f99823c3e5f"
        },
        "permalink": "/r/movies/comments/1j3ys6m/hollywood_star_jesse_eisenberg_officially_granted/"
    },
    {
        "id": "1j2zpvd",
        "author": "MarvelsGrantMan136",
        "title": "Oscars Hit 18.1 Million Viewers, Down 7% From Last Year",
        "content": "",
        "upvotes": 6982,
        "comments": 1216,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/urAcLJ0-GLUZN5Dyw7dpZewLO5zzbWbaGHkCcMnXeTg.jpg?auto=webp&amp;s=e29e47281433551349ed395ab5a2dd480a289b77"
        },
        "permalink": "/r/movies/comments/1j2zpvd/oscars_hit_181_million_viewers_down_7_from_last/"
    },
    {
        "id": "1j3g0jd",
        "author": "indiewire",
        "title": "'Jaws' to Celebrate 50th Anniversary with Academy Museum Exhibition",
        "content": "",
        "upvotes": 353,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/H955LyLsBfWEuMjh5EKUY-Fnm2H6mAY7JVGcyav4jyo.jpg?auto=webp&amp;s=613ae5cd586dec684167330073d5035a0263d581"
        },
        "permalink": "/r/movies/comments/1j3g0jd/jaws_to_celebrate_50th_anniversary_with_academy/"
    },
    {
        "id": "1j3ear3",
        "author": "Vanderlyley",
        "title": "Judge opens door to possible bidding war for Paramount as it scrambles to close $8B Skydance merger",
        "content": "",
        "upvotes": 310,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pvrIdDFEh1KIM9YvZhuIOrMocHCg_gtELjchh0IDuNU.jpg?auto=webp&amp;s=3f78b97e99c50b18413513966c1e4f31df1b3a82"
        },
        "permalink": "/r/movies/comments/1j3ear3/judge_opens_door_to_possible_bidding_war_for/"
    },
    {
        "id": "1j3bfqa",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Celine Song's 'Materialists' Starring Dakota Johnson, Chris Evans, and Pedro Pascal - Follows a young, ambitious New York City matchmaker who finds herself torn between the perfect match and her imperfect ex.",
        "content": "",
        "upvotes": 426,
        "comments": 99,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ucqeys40jome1.jpeg?auto=webp&amp;s=1b0314ac94cefb82c17073935729c64d68495da0"
        },
        "permalink": "/r/movies/comments/1j3bfqa/official_poster_for_celine_songs_materialists/"
    },
    {
        "id": "1j3k06o",
        "author": "Available-Cap7655",
        "title": "Is it ever revealed what Ingrid whispers to Gregorio? In Spy Kids 2001.",
        "content": "Rewatching my childhood. Spy Kids 2001 film. There is a part of the film where Gregorio Cortez decides to go on a mission and tells Ingrid she can’t go. Then, Ingrid whispers something to him and she is able to go with him.\nIs it ever revealed what she whispers to him? Is there a script or anything that reveals what she whispers?",
        "upvotes": 127,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1j3k06o/is_it_ever_revealed_what_ingrid_whispers_to/"
    },
    {
        "id": "1j3l3eb",
        "author": "parryfinkle",
        "title": "Which movies that aren't related that could potentially be unofficial sequels?",
        "content": "What's a trilogy or duology that isn't related but seems like it. I'll start. Serial Mom and Scream\n\nDeath Becomes Her and She Devil\n\nAddams Family and Edwards Scissorhands\n\nWitches of Eastwick and First Wives Club\n\nRomy and Michelle's High School Reunion and Legally Blonde \n\nWhat do you got? Can also be a trilogy! Extra points if it's a trilogy actually (;",
        "upvotes": 94,
        "comments": 370,
        "media": null,
        "permalink": "/r/movies/comments/1j3l3eb/which_movies_that_arent_related_that_could/"
    },
    {
        "id": "1j2r7x7",
        "author": "Stormy8888",
        "title": "'Ne Zha 2' Surpasses $2-Billion Mark, Becomes First Animated Film to Do So",
        "content": "",
        "upvotes": 8963,
        "comments": 1525,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IjAGJh05sPtqfnedgChrrOo6w46DP65mE09nq9gu9Ss.jpg?auto=webp&amp;s=6a13440317bd685cb54a7b487f1065008b31015c"
        },
        "permalink": "/r/movies/comments/1j2r7x7/ne_zha_2_surpasses_2billion_mark_becomes_first/"
    },
    {
        "id": "1j3w0yj",
        "author": "gnosis_haver",
        "title": "So many films attained cult or classic status via home video and TV syndication, are films being discovered on streaming services?",
        "content": "There’s lots of examples of films that were flops but attained classic or cult classic status from home video releases or tv broadcasts. \n\nIt’s A Wonderful Life didn’t become a classic until it became a staple on syndication. \n\nFight club, Donnie darko, and The Big Lebowski all gained huge followings off their home video releases. \n\nIs streaming producing anything similar? Are any under appreciated films that didn’t have blockbuster theatrical performances being “discovered”on streaming services? Is this happening on TikTok? ",
        "upvotes": 14,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1j3w0yj/so_many_films_attained_cult_or_classic_status_via/"
    },
    {
        "id": "1j3h13h",
        "author": "NoCulture3505",
        "title": "Jesse Armstrong Sets Steve Carell, Jason Schwartzman, Cory Michael Smith &amp; Ramy Youssef For His HBO Film",
        "content": "",
        "upvotes": 97,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3XPRzywdivZ4U7Zba7E2xvjTDUseUbaN9ZKRxTEKiGA.jpg?auto=webp&amp;s=064e33fe25a9c11128cfa65839d1b7fedd405027"
        },
        "permalink": "/r/movies/comments/1j3h13h/jesse_armstrong_sets_steve_carell_jason/"
    },
    {
        "id": "1j311xx",
        "author": "progamer2277",
        "title": "Why don't they make many movies about the Korean War in the US but they do about the Vietnam War?",
        "content": "Note, I'm not trying to politicize the post or raise propaganda, but I find it curious that the Vietnam War has more movies, and the Korean war no, Does anyone know why?, And it's funny because even in video games this topic is a bit forgotten, is there some political reason?, Even slightly more forgotten wars like the Spanish-American or Philippine-American wars have a few more productions,Are people not interested in the subject just like WW1, WW2 or Vietnam? What do you think?",
        "upvotes": 1349,
        "comments": 626,
        "media": null,
        "permalink": "/r/movies/comments/1j311xx/why_dont_they_make_many_movies_about_the_korean/"
    },
    {
        "id": "1j36uqa",
        "author": "Cinenamorado",
        "title": "How come Hillary Swank had such bad luck with movie roles between the two movies she won her Oscars?",
        "content": "I always felt her 2nd Oscar for Million Dollar Baby was her second chance but that blew itself up with some of the movies she got to make. She probably didn't have much to choose from. \n\nAside from Insomnia and maybe PS I Love You (which did well at the box-office), none of the movies she made did well, commercially and critically. I think she stood a slight chance of getting a nomination for Amelia but that didn't pull through. \n\nThe last I heard of her was in that Christian film she did with Alan Ritchson and there was that. \n\nI've always liked Hillary Swank. I was rooting for her when she got the Oscar for Boys Don't Cry, a major FU for 90210 after they fired her. \n\nIt's unfortunate Hollywood didn't know how to use her properly. I did like a film she did, which was virtually ignored, called Conviction. I wish that film had received more attention.",
        "upvotes": 426,
        "comments": 190,
        "media": null,
        "permalink": "/r/movies/comments/1j36uqa/how_come_hillary_swank_had_such_bad_luck_with/"
    },
    {
        "id": "1j2oiw7",
        "author": "Both_Sherbert3394",
        "title": "'School of Rock' aged shockingly well for an early 2000's comedy",
        "content": "I rewatched this not that long ago, and even though I know it's pretty standard to watch comedies from this era and see a lot of things that are like 'wow that didn't age well' (even if it's still an otherwise funny movie), but rewatching this, I was surprised at how the overall messaging and way it depicts these characters felt a lot more fair and interesting than a lot of other films from that era.\n\nParticularly, the scene where Jack Black takes the principal out to get drinks and we see a totally different side of her, as well as when we see the barrage of parents harassing her and suddenly we totally get a sense of how this kind of pressure could lead to someone becoming like this. I feel like the trope of 'the stuffy old mean teacher lady' has been a comedy thing for about as long as there have been movies set in schools, but this one just flips it on its head in a way that really stood out to me.\n\nIt also does a really good job at avoiding the overly cartoony cliche ending of \"oh, but look what they learned! it's totally fine!\" I mean, yes, it does that somewhat with the very ending over the credits, but the parents are still very rightfully furious that this random stranger has been with their kids, and the movie treats it more like how I expect people would react to it in real life. It's a tiny thing, but just giving these elements (such as the principal or the parents reactions) a little more believability and less cartoonish one dimensionality really adds to it.\n\nI'm also glad they never did a sequel, because there's absolutely no reason to, although now that I've said that I'm assuming we'll see a headline that it's been greenlit within the next two days.",
        "upvotes": 6872,
        "comments": 545,
        "media": null,
        "permalink": "/r/movies/comments/1j2oiw7/school_of_rock_aged_shockingly_well_for_an_early/"
    },
    {
        "id": "1j3yqlc",
        "author": "AnxiousFoot4541",
        "title": "Problem about series",
        "content": "I’ve always watched and rewatched tv series, I like ‘em. For about 3 years now I’m focused on films and I haven’t seen any series in this time. Now I realized that when I start a tv series it swallows me. I became addicted to it and want only to finish it as soon as possible (if I like the one). The problem is that I’d like to watch films and only sometimes an episode. I know that it seems strange but that’s it. Anyone in my situation?",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1j3yqlc/problem_about_series/"
    },
    {
        "id": "1j36h5d",
        "author": "No-Earth-8428",
        "title": "Tokyo Drift is still one of my favourite movies ever made",
        "content": "I don't care what anyone says, it's such a comfort movie! My Favourite fast and furious movie! \n\nThe main dude is so bad that he's perfect for the franchise. Han gets to shine. Tokyo is absurd. The villains are cool. The drifting is cool. The whole thing just works. Everyone seems to hate this entry but I've always loved it. I love the OST too. ",
        "upvotes": 335,
        "comments": 134,
        "media": null,
        "permalink": "/r/movies/comments/1j36h5d/tokyo_drift_is_still_one_of_my_favourite_movies/"
    },
    {
        "id": "1j2tqie",
        "author": "pantherfanalex",
        "title": "Elijah Wood explaining why, if he could remove ANY one movie from cinema history, it would be Tim Burton's \"Charlie and the Chocolate Factory\" (timestamp 45:00)",
        "content": "",
        "upvotes": 2690,
        "comments": 330,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x_zNtenqDVRpZd54XzHU1zQaFtjaR4jay_wRsfWN8m4.jpg?auto=webp&amp;s=5e7cdef867f48de0bbb3faac8be3e31ec1ad0e1d"
        },
        "permalink": "/r/movies/comments/1j2tqie/elijah_wood_explaining_why_if_he_could_remove_any/"
    },
    {
        "id": "1j3rhx6",
        "author": "Raydiatom",
        "title": "Movies Similar to 20th Century Women",
        "content": "Just recently watched 20th Century Women by Mike Mills.  And wow.  It was quite affecting and emotional.  Wonderful original score and soundtrack.  Amazing acting, especially from Annette Benning and Greta Gerwig.  I loved that it was about everything and nothing, showing a slice of life nostalgia trip encapsulating a portion of the late 1970s US.  It sets the tone and feel very well.  Any other movies that hit those same notes and \\*feel\\* like 20th Century Women?",
        "upvotes": 8,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1j3rhx6/movies_similar_to_20th_century_women/"
    },
    {
        "id": "1j3beo9",
        "author": "NoCulture3505",
        "title": "A24 Sets June 13th Release For Celine Song’s Matchmaker Movie ‘Materialists’",
        "content": "",
        "upvotes": 64,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/N2pu5lflXh3fPDdkb8F3jnK20h9Hef8AtS1mfDf0K0Y.jpg?auto=webp&amp;s=aa445263126ea596d67d63c557652e5a635e8a9f"
        },
        "permalink": "/r/movies/comments/1j3beo9/a24_sets_june_13th_release_for_celine_songs/"
    },
    {
        "id": "1j3yfjt",
        "author": "randomvegasposts",
        "title": "What's the fastest a character has said the name is a movie in the movie?",
        "content": "I just started in Bruges. The first word is \"Bruges\"\nI'm not counting that but a minute and a half later Colin Farrell says \"In bruges? Are you fucking kidding me?\"\n\nI just have to wonder what the fastest any character said the name of the movie organically (narrators and voice overs don't count) \n\nAnything faster than a minute 30?",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/movies/comments/1j3yfjt/whats_the_fastest_a_character_has_said_the_name/"
    },
    {
        "id": "1j2h08o",
        "author": "NikNola2020",
        "title": "Juno is totally different as an adult",
        "content": "I recently watched Juno for the first time since I was about 13 or 14. I was in junior high I believe when the movie first released, and seeing it as an adult really blew my mind. The creators somehow perfectly captured the awkward and intense feelings of not being a kid, but not quite an adult yet either. \n\nFirst note, Mark was a massive creep and weirdo. Kissing a teenage girl when you’re an adult is creepy and gross all on its own. Then you throw in that SHE WAS CARRYING THEIR ADOPTIVE CHILD. What the actual fuck! What a disgusting pathetic man. Watching the scene when he took Juno to the basement to show her the comic of a pregnant super hero was so disgusting. Their relationship in general was coming off very grooming, then he was seducing a pregnant 16 year old girl who was extremely vulnerable. In my young teenage mind, I thought Vanessa was such a wet blanket, suppressing his creative side and making him and Juno both feel like losers. In reality, she was a saint who should have kicked him to the curb way sooner. He deserved no grace. I cannot imagine my partner not only cheating on me, but cheating with a teenager. And not just a teenager, a pregnant teenager who is carrying my adoptive son. Vanessa was such a great person and didn’t deserve anything that pathetic excuse of a man put her through. \n\nSecond note, Juno(and company) is extremely immature and the creators did a great job of showcasing it. I love her quirkiness, but the way she did not understand why it was inappropriate to be popping up at Mark and Vanessa’s house was very telling. There are two sides to that coin, because she may have known it was inappropriate but was too young and naive to see the long term outcome of the situation. She definitely didn’t understand why a man of his age shouldn’t be chumming it up with her. In fact, she seemed to enjoy the fact that he was even giving her attention at all. It helped that he liked the same things, so in her mind it was confirming she was cool. It just shows exactly how immature she was, unable to look past your own bubble to see the rest of your life. \n\nOn another note, it was implied that she and Bleaker were way better friends than what we saw in the movie. It seemed that they were hanging out everyday, had all the same interests and hobbies. But, when Juno came up pregnant Bleaker fell off the map. He never seemed pressed when she would stop and say hey, but he did absolutely nothing to try and help her in the situation. He also didn’t understand why it hurt her so much he was taking someone else to a dance. At that point in the plot, we really got to see how the normally confident and abrasive Juno was becoming self conscious and confused by the weight of her feelings. Highlighting how juvenile everyone was, while dealing with such a serious situation was just top tier writing. The whole movie did such a great job of capturing exactly how it feels to be 16. Too old for childhood, but nowhere near an adult yet. Even though every single 16 year old in the world thinks they’re an adult. It takes growing up to realize exactly how childish you still are at that age. \n\nI do think it’s worth mentioning how great of parents her dad and Bren were. Bren was her step mom and they didn’t seem particularly close, but she didn’t hesitate when it came to Juno. Of the jump, she was getting her to a doctor, coming to her defense when needed, and making sure she had everything she needed. And her father, who was obviously uncomfortable with emotional bridges with his teenaged daughter, made sure she knew she was loved. The scene of her in hospital after giving birth brought tears to my eyes. \n\nAs a whole, the movie is great. I’m not sure what category you could out this movie in, but they somehow captured a vibe of nostalgia I didn’t know I was missing. And just to bring it in again, we should all beat Marks ass if we ever happened to see his character out in the real world. \n\n*Edit Note: \n\npeople are being gross about Elliot Page being in the movie. Elliot is an amazing actor and their gender at any point in their life has absolutely NOTHING to do with the character of Juno. I’m referring to Juno as she/her, not Elliot. You’re weird if you care about someone else’s gender enough to be a dick about it. No one cares what you think. Elliot is happy and that’s all that’s important. Keep your weird ass comments to yourself if you’ve got something nasty to say. You’re the weird one if you can’t just simply respect what a person wants for their own autonomy. We support LGBTQ+ on this post! ",
        "upvotes": 6182,
        "comments": 490,
        "media": null,
        "permalink": "/r/movies/comments/1j2h08o/juno_is_totally_different_as_an_adult/"
    },
    {
        "id": "1j3ftik",
        "author": "KillerCroc1234567",
        "title": "Werner Herzog’s Hiroo Onoda Animation ‘The Twilight World’ With Psyop &amp; Sun Creature Studio Sets Early-2026 Start Date",
        "content": "",
        "upvotes": 22,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YXuQUUv0-e3TBiN3EAdUqd8OwDxmEmDi7auhttPZ1uM.jpg?auto=webp&amp;s=8d428d1e63c6fa850be99368904ae9e204a65d33"
        },
        "permalink": "/r/movies/comments/1j3ftik/werner_herzogs_hiroo_onoda_animation_the_twilight/"
    }
]