[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1qr6x0s",
        "author": "Hashischfarmer",
        "title": "Trattorie cucina piemontese?",
        "content": "Ciao, vorrei portare la mia ragazza a mangiare in un trattoria/ristorante cibo tipico piemontese. Entrambi non abbiamo mai provato questo tipo di cucina, cerco un posto carino (non troppo elegante) che non sia troppo costoso ma neanche troppo rustico. Grazie 🙏",
        "upvotes": 10,
        "comments": 23,
        "media": null,
        "permalink": "/r/torino/comments/1qr6x0s/trattorie_cucina_piemontese/"
    },
    {
        "id": "1qrq1rz",
        "author": "ButterflyFar9683",
        "title": "Im going to apply to uniTo (open access program non eu). Does it matter that i still dont have a seat for cent s",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qrq1rz/im_going_to_apply_to_unito_open_access_program/"
    },
    {
        "id": "1qref99",
        "author": "Anna126_",
        "title": "Consigli Madonna di Campagna",
        "content": "Ciao a tutti!\n\nA febbraio mi trasferirò a Torino (più specificatamente a Madonna di Campagna) e desideravo chiedervi alcune informazioni generali.\n\nGrazie in anticipo a chi mi risponderà.\n\n1. Consigli in generale sulla zona per “sostentamento quotidiano”?\n\n~~Ovviamente i supermercati li posso trovare anche su Maps,~~ ma volevo chiedervi dei consigli in merito a rapporto qualità prezzo e generale pulizia dei posti (cosa su cui non riesco a soprassedere)\n\n2. Fattibile muoversi in bici verso il Poli da quella zona? Più che altro, come si è messi a livello di sicurezza stradale / piste ciclabili? (**possibile furto bici?**)\n\n3. Parchi di calisthenics carini?\n\n4. Sicurezza generale della zona? (Ragazza, vengo da un paesino minuscolo di poco più di mille abitanti, delle volte tendo ad avere la guardia un po’ bassa 😅)\n\nGrazie ancora a chi troverà il tempo di rispondermi 🫶🏻✨",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/torino/comments/1qref99/consigli_madonna_di_campagna/"
    },
    {
        "id": "1qrjy7u",
        "author": "_L_-",
        "title": "Qualcuno vuole venire a questa serata?",
        "content": "Mi è capitata a caso su instagram, non conosco il locale ma mi sembra interessante, qualcun altro vuole andare?  \nSono un 27enne chill a cui piace la musica elettronica francese\n\nVi lascio sotto la descrizione:\n\n‣ Daft Club – Serata Tributo ai Daft Punk  \n\\- Capodoglio, Murazzi  \n‣ Domenica 8 Febbraio  \n‣ Dalle 21.00 all’1.00\n\nDJ SET  \n‣ TENDENZARABA // [tendenzaraba](https://www.instagram.com/tendenzaraba/)  \n‣ AMRED // [\\_amred\\_](https://www.instagram.com/_amred_/)\n\nUn viaggio tra Daft Punk, Cassius, Justice, Stardust, Chemical Brothers, Modjo, Fatboy Slim e tutte quelle tracce che ancora oggi fanno muovere la testa one more time.\n\nINGRESSI  \n‣ FREE ENTRY IN LISTA  \n‣ 10€ con drink fuori lista\n\nCucina aperta fino alle 22.30",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qrjy7u/qualcuno_vuole_venire_a_questa_serata/"
    },
    {
        "id": "1qrjqld",
        "author": "TRDidi",
        "title": "Locali economici zona sud",
        "content": "Ciao a tutti! Conoscete nella zona sud di Torino dei locali dove poter fare un post-cena senza spendere un rene? Vale anche fuori Torino, prima cintura ma sempre sud. Ad esempio quei bei pub ignoranti con musica rock (dal vivo o meno) e tavoloni di legno esistono ancora? Osterie per niente eleganti? Enoteche affatto chic? Ho visto robe in centro che non fanno proprio per me, troppo eleganti e costose. Grazie per qualsiasi dritta! ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qrjqld/locali_economici_zona_sud/"
    },
    {
        "id": "1qrjq7o",
        "author": "freedomtodie",
        "title": "What are some of your favorite specialty food shops in Torino?",
        "content": "Unique/fun ones. Dolphin (va Bertola) and Kawaii (via Madama Cristina) are great, for example. Any others you can recommend? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qrjq7o/what_are_some_of_your_favorite_specialty_food/"
    },
    {
        "id": "1qrc5mb",
        "author": "frisk99",
        "title": "Sosta su marciapiede rialzato?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qrc5mb/sosta_su_marciapiede_rialzato/"
    },
    {
        "id": "1qr89rh",
        "author": "ciebe_",
        "title": "Cena di Laurea Torino",
        "content": "Sto cercando un posto dove poter fare cena di laurea a torino. Sarebbe carino un posto che non costi troppo, abbia opzioni per vegetariani e vegani e in cui si possa parlare (o con una bella atmosfera, stile trattoria). Grazie mille in anticipooo, saremmo massimo in 12, per cui non una tavolata pazza ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qr89rh/cena_di_laurea_torino/"
    },
    {
        "id": "1qr2g2w",
        "author": "kefra56",
        "title": "Palestra Torino",
        "content": "Ciao a tutti cerco palestra a Torino zona crocetta,cenisia, San Paolo, San Donato, cit turin che non sia affollata come una classica catena e che abbia magari la possibilità di essere seguiti individualmente o a piccoli gruppi \n\nBudget mensile 80-100 euro \n\nAvere qualche suggerimento?\n\nGrazie ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qr2g2w/palestra_torino/"
    },
    {
        "id": "1qqh758",
        "author": "East-Implement-4571",
        "title": "Associazioni/circoli a torino",
        "content": "Ciao a tutti! Ho 33 anni e sono ritornata a Torino da poco. Ci sono circoli o posti dove si può socializzare e magari fare attività sociali o ricreative?",
        "upvotes": 18,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1qqh758/associazionicircoli_a_torino/"
    },
    {
        "id": "1qq8vw8",
        "author": "Plus-Masterpiece936",
        "title": "CHE FINE FANNO LE BICI RUBATE",
        "content": "Che fine fanno le bici rubate - vengono rivendute o cosa?\n\nChe fine fanno le bici rubate\n\nHo l'impressione che le bici rubate in Italia, soprattutto al nord, siano molte di più di quelle che vengono acquistate. Avete notizie su dei giri organizzati? Che fine fanno questa infinità di bici?",
        "upvotes": 13,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1qq8vw8/che_fine_fanno_le_bici_rubate/"
    },
    {
        "id": "1qq6stf",
        "author": "AsenaPC888",
        "title": "Vegan sushi",
        "content": "Migliori sushi con opzioni vegane a Torino?? ",
        "upvotes": 7,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1qq6stf/vegan_sushi/"
    },
    {
        "id": "1qqaewt",
        "author": "PhilosopherFar9282",
        "title": "Paying taxes",
        "content": "Good Afternoon,\n\nI'm an international Phd student (from Europe) doing my degree (partially) in PoliTo. I'll stay here for a minimum of 1 year and a maximum of 2 years. My scholarship is provided by an institution from my home country. I wanted to check if I need to do anything concerning taxes. I took care of getting a fiscal code already, not sure if I should do anything else. \n\nAny help or advices would be greatly appreciated",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qqaewt/paying_taxes/"
    },
    {
        "id": "1qqa7se",
        "author": "Appropriate_Cup_4119",
        "title": "Sartoria a torino",
        "content": "Buongiorno, devo fare stringere tre paia di jeans a torino, qualcuno sa consigliarmi una sartoria affidabile, zona centro o san paolo e dintorni, sono disposto a spostarmi",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1qqa7se/sartoria_a_torino/"
    },
    {
        "id": "1qq6iny",
        "author": "Agitated-Slide5181",
        "title": "Riparazioni RAM",
        "content": "Ciao a tutti, conoscete qualche laboratorio a Torino che possa fare riparazioni di memorie RAM? \n\nSto chiamando a chiunque, ma pare che la mia domanda sia di un altro pianeta...",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1qq6iny/riparazioni_ram/"
    },
    {
        "id": "1qphnfs",
        "author": "Kooky-Psychology4945",
        "title": "TRUFFA chiavi, telefono e documenti lasciati chiusi in macchina",
        "content": "Ciao a tutti.\n\nIn sintesi: 2 giorni fa alle 2:00 di notte su corso Regina Margherita (zona Pellerina) un tizio mi ferma per strada chiedendomi di aiutarlo a tornare a casa dalla figlia piccola perché aveva portafogli, auto e chiavi rimaste chiuse nella sua auto.\n\nIl tizio era sulla 40ina, alto 1.75 circa, aveva un cappottino e mocassini, jeans skinny, e cappellino nero. Diceva di essere nato a Padova e di venire da Empoli, e che da qualche giorno era a Torino per lavorare nel settore dell'odontoiatria.\n\nPurtroppo dopo le numerose domande fatte da parte mia per verificare che tutto fosse coerente o meno (circa 15 minuti), per la mia eccessiva umanità e altrettanto ingenuità ci sono cascato, ma non ho dato i soldi a lui come continuamente richiedeva, bensì gli ho pagato il taxi (chiamato da me) che lo portava da Torino alla sua presunta \"casa\".  \nOVVIAMENTE il contatto dato (351415822\\*) è un numero che risulta sempre non disponibile; la combinazione suo nome (Andrea) e il suo anno di nascita (diceva di avere 44 anni) non era presente in nessun albo di odontoiatri (Firenze, Torino, Padova), quindi alla fine della fiera ci ho perso qualche decina di euro.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nAGGIORNAMENTO: ho contattato l'assistenza di Taxi Torino, che mi ha riferito in sintesi questo:\n\nIl tassista gli ha chiesto l'indirizzo; il tizio Andrea ha risposto \"in centro va bene comunque\"; il tassista non si fidava e gli ha chiesto il mio numero che lui si era scritto in un foglietto; Andrea rifiutava di darglielo; il tassista gli intima di scendere dall'auto; Andrea gli chiede di dividersi la somma pagata da me; il tassista gli intima nuovamente di scendere dall'auto, consigliandogli ringraziare di non avergli alzato le mani e di non averlo portato dai carabinieri; il tassista mi rimborsa.\n\nMORALE: \"Andrea\" è un truffatore, il tassista un santo, io uno 'stupidino'.",
        "upvotes": 99,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1qphnfs/truffa_chiavi_telefono_e_documenti_lasciati/"
    },
    {
        "id": "1qpovta",
        "author": "marius_90",
        "title": "Trail running e neve in collina 🙂‍↔️",
        "content": "",
        "upvotes": 42,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0xak4jeat5gg1.jpeg?auto=webp&amp;s=de8fc62039fbcb1f8919f709fa69dc874be9bbd1"
        },
        "permalink": "/r/torino/comments/1qpovta/trail_running_e_neve_in_collina/"
    },
    {
        "id": "1qq89wu",
        "author": "DPPenjoyer18",
        "title": "Ci riprovo: Borgo San Pietro, Moncalieri: opinioni sulla zona?",
        "content": "Salve a tutti, come è la zona di borgo San Pietro a Moncalieri? Ho visto un appartamento interessante (precisamente su corso Roma) ed è in zona relativamente distante da piazza Bengasi, ma non riesco a capire che genere di zona sia e quanto sia tranquilla. Grazie a tutti dell'aiuto",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1qq89wu/ci_riprovo_borgo_san_pietro_moncalieri_opinioni/"
    },
    {
        "id": "1qpjozl",
        "author": "Sunstealer85",
        "title": "Missing toy bunny on bus",
        "content": "Ciao a tutti, se qualcuno trova un coniglietto di peluche sull'autobus VE1, mi contatti. Mia figlia lo ha perso stasera, nella zona di Vandalino. Ce l'ha dalla nascita ed è devastata.",
        "upvotes": 22,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i63c2mjyv4gg1.jpeg?auto=webp&amp;s=a934aa596081959e50b96c3e8fa95960ebac3ddf"
        },
        "permalink": "/r/torino/comments/1qpjozl/missing_toy_bunny_on_bus/"
    },
    {
        "id": "1qpo4xe",
        "author": "RadicalDreamah",
        "title": "Portuguese on vacation",
        "content": "hello! I'm a Portuguese 35yo M cinema student visit Torino for a few days. currently drinking a very strong cocktail at café des arts. do you all recommend some cool bars to go after? and if someone wants to meet, I'll be here until Sunday.\n\nthanks in advance!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1qpo4xe/portuguese_on_vacation/"
    },
    {
        "id": "1qpp8k3",
        "author": "ksjeid72",
        "title": "Dermatologo veterinario",
        "content": "Chiedo scusa se questo forse non è il posto più adatto ma non so proprio dove altro chiedere...\n\nAvrei bisogno di portare uno dei miei gatti da un dermatologo veterinario per una problematica di cui non riusciamo a venire a capo.\n\nMi chiedevo se qualcuno avesse qualche nome da consigliarmi con cui si è trovato bene.\n\nGrazie!!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qpp8k3/dermatologo_veterinario/"
    },
    {
        "id": "1qpcmyc",
        "author": "TinyTanic",
        "title": "Pastel de nata",
        "content": "Ciao a tutte e tutti, sono recentemente stato in Portogallo e mi sono innamorato dei pastel de nata. Qualcuno sa dove poterli trovare (magari anche buoni) a Torino?\n\nEdit:\nAlla fine li ho provati da Ammó, in via Po 22. Sono buoni, non come quelli portoghesi ma meglio che nulla. Unica nota negativa, il prezzo... 3,50 € l'uno, decisamente cari!",
        "upvotes": 7,
        "comments": 17,
        "media": null,
        "permalink": "/r/torino/comments/1qpcmyc/pastel_de_nata/"
    },
    {
        "id": "1qq2f3t",
        "author": "nazarthinks",
        "title": "Attenzione alla maniglia pericolosamente affilata [Burger King, metro Dante]",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qq2f3t/attenzione_alla_maniglia_pericolosamente_affilata/"
    },
    {
        "id": "1qpdru7",
        "author": "mart1na71",
        "title": "permanente riccia Torino o Grugliasco",
        "content": "Ciao potreste consigliarmi un parrucchiere economico a torino (qualsiasi zona) o a grugliasco che faccia una buona permanente riccia o mossa ma sotto i 100€ se possibile (se conoscete qualche parrucchiere a nero vanno bene anche quelli)",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qpdru7/permanente_riccia_torino_o_grugliasco/"
    },
    {
        "id": "1qpjitu",
        "author": "asilorepublic95",
        "title": "Enjoy point torino",
        "content": "mi confermate che utilizzare le mcchine enjoy con questi nuovi enjoy point dove devi lasciarle è una cagata? non in tutta la mappa ci sono gli enjoy point per esempio incl centro manco uno...cioè si ulitizza solo per stare in zona praticamente? dove ci sono gli enjoy point ...?? che cagata.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1qpjitu/enjoy_point_torino/"
    },
    {
        "id": "1qpbxz7",
        "author": "AsvpXIII",
        "title": "VIP KAPPA FUTUR FESTIVAL",
        "content": "Ciao, c’è qualcuno che è stato di recente al Kappa con ingresso VIP?  \nNe vale davvero la pena?\n\nSono già stato con l’ingresso normale e mi ricordo soprattutto file infinite e gente (soprattutto inglesi) che pisciava un po’ ovunque...  \nL’esperienza VIP migliora davvero la situazione o è solo un sovrapprezzo con pochi vantaggi concreti?\n\nGrazie a chi vuole condividere la sua esperienza.",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1qpbxz7/vip_kappa_futur_festival/"
    },
    {
        "id": "1qp6e3i",
        "author": "Melodic_Signature193",
        "title": "Vivere a Vanchiglia",
        "content": "Ciao a tutti, vi scrivo per chiedervi un'opinione. Vorrei ritrasferirmi a Torino, dove ho già vissuto gli anni dell'università, per motivi di lavoro e di vita e sono alla ricerca di una casa per una sistemazione un po' a lungo termine.\n\nPremettendo che ho già visto dal vivo mooolti alloggi (e su questo potrei fare un post a parte...), mi è capitata l'occasione di un privato (che in realtà è un conoscente di famiglia e una persona perbene) dove ha vissuto e studiato. L'alloggio si trova al limite di Vanchiglia, in una zona compresa tra corso Regina e lungo Dora Siena, non lontano dal Campus Einaudi ed è perfettamente in linea con quello che sto cercando in termini di spazi (rispetto a tanti buchi che ho visto anche in zone meno centrali).\n\nIo purtroppo non conosco direttamente il quartiere di Vanchiglia, avendo frequentato il Politecnico e avendo vissuto (quando a livello economico si poteva) in zone più centrali, ma a detta di molte persone che ho già sentito e/o ci hanno vissuto (e addirittura cresciute) non è affatto male; da quel che ho capito anche le aree limitrofe (Borgo Rossini) sono in forte riqualificazione e nelle vicinanze dovrebbe sorgere una fermata della M2 (quando si farà). Sulla carta ho visto che è una zona ben servita di tutto, con due-tree linee di mezzi pubblici che attraversano la città e non è lontana dal centro. Quindi anche in termini di investimento per il futuro, mi sembrerebbe una buona mossa.\n\nNon conosco direttamente invece in termini di sicurezza, anche se, anche lì, ho opinioni di amici e conoscenti che sono passati a tutte le ore del giorno e della notte in corso Regina a cui non è mai successo nulla. Non sono comunque una persona che esce fino a tarda notte, la mia prerogativa è più che altro quella di tornare a casa dopo il lavoro anche alle 20:00 o alle 21:00.\n\nIn generale mi sembra comunque un quartiere molto interessante e appetibile della città, pertanto ascolto le vostre opinioni sulla zona e soprattutto sulla micro-zona.\n\nRingrazio sin d'ora che mi risponderà!\n\nEDIT: ho anche aggiunto uno screen \"ad ampio spettro\" della zona.\n\nhttps://preview.redd.it/w5moma8s42gg1.png?width=906&amp;format=png&amp;auto=webp&amp;s=1e4b3dd2354d3bfb6721946fd20a6058954c038a\n\n",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1qp6e3i/vivere_a_vanchiglia/"
    },
    {
        "id": "1qplo8m",
        "author": "SpeakerEven6320",
        "title": "Cerco stanza singola",
        "content": "Buonasera, sono uno studente di 25 anni e cerco una stanza singola da inizio/metà febbraio.\n\nValuto varie zone.\n\nGrazie mille! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1qplo8m/cerco_stanza_singola/"
    }
]