[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1op5qxs",
        "author": "EchoNarwhal812",
        "title": "Which actor completely carried a Netflix show",
        "content": "For me it has to be Rami Malek in Mr. Robot. Even though it originally aired elsewhere, watching it on Netflix now just hits different. The way he plays Elliot awkward, brilliant, paranoid, and somehow still relatable makes the whole show work. Without him, it wouldn’t be half as powerful.",
        "upvotes": 23,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1op5qxs/which_actor_completely_carried_a_netflix_show/"
    },
    {
        "id": "1oowdtv",
        "author": "chashows",
        "title": "'Nobody Wants This' Renewed for Season 3 at Netflix",
        "content": "",
        "upvotes": 71,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1oowdtv/nobody_wants_this_renewed_for_season_3_at_netflix/"
    },
    {
        "id": "1op3ez5",
        "author": "misterpopculture",
        "title": "Xolo Maridueña Joins Season 3 of Netflix’s One Piece",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1op3ez5/xolo_maridueña_joins_season_3_of_netflixs_one/"
    },
    {
        "id": "1oomxpo",
        "author": "graemeisverytired",
        "title": "Daniel Craig reads each new Knives Out script like his character - and doesn’t want to have the mystery spoiled for him in advance",
        "content": "“I read them, I suppose, like Benoit... I’m trying to sort of get in Benoit’s head. I don’t read it wanting to know who the murderer is; I want to know what the whole is,\" Craig began. He also added that he told writer-director Rian Johnson, \"I don't want to know!\" when asked by him if he wanted to know who the killer was beforehand. ",
        "upvotes": 49,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oomxpo/daniel_craig_reads_each_new_knives_out_script/"
    },
    {
        "id": "1op557c",
        "author": "scooterdoo123",
        "title": "Netflix account creation/ recovery nightmare",
        "content": "I’ve had an existing Netflix account in 2023, I stopped paying and now I am trying to make another account. I tried hitting forgot password and then I get an error saying I don’t have an account. When I try to sign up I get an error stating that I do already have an account. I contacted support and they basically said they don’t have a solution since my email shows that I never had any existing accounts and when they sent me a sign up link I also get the error that there is an existing account under that email. Has anyone dealt with this before? Image links are below of the error codes during sign up and login. Thank you for any information/help\n\nhttps://imgur.com/gallery/netflix-sign-up-loop-EMRrnTD",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1op557c/netflix_account_creation_recovery_nightmare/"
    },
    {
        "id": "1op51rb",
        "author": "Historical-Egg-9194",
        "title": "Why is man vs baby trailer not out yet.",
        "content": "The first episode is supposed to come out on December the 11th but I am not seeing any trailer for it does anyone know if the show is still happening and when will the trailer be released \n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1op51rb/why_is_man_vs_baby_trailer_not_out_yet/"
    },
    {
        "id": "1op13mb",
        "author": "fioredellapassione",
        "title": "Grand Army season 2 / movie",
        "content": "I loved this show and I was hoping that even if it got cancelled will get another season to follow up the events of the first season to shows us the future for the main characters.\nDo you guys believe is there still hope for another season or a movie? I doubt that the characters will still be in high school considering it's been 5 years but at least they can show us a time skip to their college/ work lives + their relationships \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1op13mb/grand_army_season_2_movie/"
    },
    {
        "id": "1oos0hu",
        "author": "LKS983",
        "title": "Farha",
        "content": "I watched this movie for the first time (as it appeared on the 'Leaving Soon' line on Netflix) and recommend it to anyone (like me) **who hadn't really thought** about how this 'war' started.....\n\nThis movie is leaving on the 30th November (where I live) - and is definitely worth a watch.\n\n\n\n",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oos0hu/farha/"
    },
    {
        "id": "1oorxul",
        "author": "Visible_Star_7783",
        "title": "Squid game The challenge S2 enjoying it way more than S1",
        "content": "The characters this time round are way more interesting my favourite player is actually one of the most hated #98 but I enjoy his heart on sleeve personality and the Boston accent hope he wins. The ones I really don’t like is the twins and the dad and daughter they have double the chance to win I don’t think they should allow relatives to play it’s not fair on the single competitors. How you all liking it so far and who would you like to see win?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oorxul/squid_game_the_challenge_s2_enjoying_it_way_more/"
    },
    {
        "id": "1oobnhv",
        "author": "Crowned_Toaster",
        "title": "Recommend your best dystopian movies.",
        "content": "I would like movies like Never Let Me Go, Paradise, or In Time. Any movie is generally fine as long as it's non-horror and no dogs die in said movies (we recently lost our dog).",
        "upvotes": 25,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1oobnhv/recommend_your_best_dystopian_movies/"
    },
    {
        "id": "1oobl1n",
        "author": "Hackedbytotalripoff",
        "title": "Got hooked to the show \"Sinner\"",
        "content": "I have started watching the first season of Sinner. Oh boy,  I got hooked right away.   I was so intrigued by the storyline, the slow pace that provided background for each of the characters, and the acting.   It is a fantastic show, and it is going to keep me busy. Binge-watching it for a while.",
        "upvotes": 19,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1oobl1n/got_hooked_to_the_show_sinner/"
    },
    {
        "id": "1oow687",
        "author": "dicklaurent97",
        "title": "Love vs. Nobody Wants This",
        "content": "Does anyone else here remember the show Love from about 10 years ago? It had Britta from Community and a lot of other people who weren't famous at all. The show was about an unlikely romance and wasn't even the first attempt at \"new modern\" romantic comedy in the vein of Annie Hall and When Harry Met Sally; You're The Worst was an earlier attempt at it.\n\n  \nI finished Nobody Wants This and it really reminded me of Love. Anyone else feel this way?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oow687/love_vs_nobody_wants_this/"
    },
    {
        "id": "1oodnq9",
        "author": "graemeisverytired",
        "title": "Netflix has found its Bon Clay for One Piece and are once again having us hope for more seasons beyond season 3",
        "content": "\"Fans of One Piece will be familiar with Bon Clay as a member of Baroque Works, the infamous criminal organization that plays a key role in [the Alabasta Arc](https://www.thepopverse.com/one-piece-arcs-ranked-best-worst-luffy-wano-country-enies-lobby-water-7-crunchyroll-marineford). Although originally male in the manga and anime, [initial reports around](https://deadline.com/2025/11/one-piece-cole-escola-bon-clay-1236604228/) Cole Escola’s casting of Bon Clay indicate that the character has been reimagined as non-binary to match the actor. A master of disguise with the ability to change their face into anyone with the touch of their hand, Bon Clay is a formidable opponent who eventually becomes a stalwart ally of Luffy and the Straw Hats in later arcs.\"",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oodnq9/netflix_has_found_its_bon_clay_for_one_piece_and/"
    },
    {
        "id": "1oo862f",
        "author": "wiredmagazine",
        "title": "Premiere: Netflix’s New True Crime Doc Dives Into a Mother’s Mysterious Disappearance",
        "content": "",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oo862f/premiere_netflixs_new_true_crime_doc_dives_into_a/"
    },
    {
        "id": "1ooyg6q",
        "author": "AxelXyfer",
        "title": "What device is best to watch Netflix in bed? (Bedroom doesn't have space to put a TV)",
        "content": "Tablet? Laptop? Projector on the cieling?\n\nI wanna hear what other peoples thoughts and opinions are...  \nMy boyfriend and I used to love watching stuff in bed but since our new place has a small bedroom, we haven't done that in a long time.\n\nSo reddit, whatdya think?",
        "upvotes": 0,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1ooyg6q/what_device_is_best_to_watch_netflix_in_bed/"
    },
    {
        "id": "1ooqs22",
        "author": "Mountain-Bid4317",
        "title": "Netflix return offer",
        "content": "Has anyone else gotten emails about 10% off Netflix if you've been away for a while on the service? It actually goes to the site and gives you 10% off all plans, but expires at a certain point.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ooqs22/netflix_return_offer/"
    },
    {
        "id": "1op2rxp",
        "author": "MrHumuhumu",
        "title": "Why isn’t Netflix listening to its subscribers and why does it keep focusing on Korean shows?",
        "content": "Social media websites are full of users complaining that Netflix is going too far with adding Korean shows each week, the problem many of  these Korean shows flopped in South Korea yet they are added to Netflix despite their local failure and I heard from someone living in Korea that most Korean men don't watch K-drama because they think it is for women.\n\nafter The Korean president asked the CEO of Netflix to invest in Korean shows to improve Korean economy, Netflix started neglecting other countries and English-language shows, the success of Squid Games doesn't justify this amount of Korean shows added each week.\n\nI read users from Middle East complaining in Arabic that Netflix is becoming too Korean and English comments from people from both East Asian and Western countries complaining that Netflix is full of Korean shows and that they think about canceling their subscriptions\n\nand Netflix news are full of upcoming Korean shows.\n\nWhy don't they create a separate Netflix for English-language shows and films? the number of English speakers in my country is rising but how are they going to improve their English if Netflix is over investing in Korean shows?",
        "upvotes": 0,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1op2rxp/why_isnt_netflix_listening_to_its_subscribers_and/"
    },
    {
        "id": "1oojjfc",
        "author": "beanos4lyf",
        "title": "Murder mindfully season 1, episode 7, 8 minute mark.",
        "content": "Could Bjorn, Toni and sascha have gotten away during their standoff by claiming to have been making a gay porn video?\nRealistically this idea could have worked right?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oojjfc/murder_mindfully_season_1_episode_7_8_minute_mark/"
    },
    {
        "id": "1oobuzc",
        "author": "N3DSdude",
        "title": "Bro netflix probably knows me better than my own friends lol",
        "content": "Real talk, Netflix definitely has me figured out.\n\nThey know when i’m sad, when i’m bored, when i’m trying to fall asleep to the same show again.\n\nMy continue watching list is basically a mood ring.\n\nand if you ever check one of those leak sites, half your old accounts are just sitting there.\n\nWe’re not private online at all, we just like to pretend we are. Kinda scary but also… whatever, play the next episode 😭",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oobuzc/bro_netflix_probably_knows_me_better_than_my_own/"
    },
    {
        "id": "1on4nrc",
        "author": "moodyhippy",
        "title": "i watched Idiocracy for the first time today",
        "content": "after my coworker saw me pour electrolytes in my water and she quoted a line from the movie that i had no idea what she was talking about haha. i enjoyed it, i laughed a lot. kinda wild how on point it is - the ads everywhere, the stupidity, the love of violence. big yikes. ",
        "upvotes": 1844,
        "comments": 258,
        "media": null,
        "permalink": "/r/netflix/comments/1on4nrc/i_watched_idiocracy_for_the_first_time_today/"
    },
    {
        "id": "1ooix5m",
        "author": "TromboneAl",
        "title": "Mirror Netflix to TV During Power and Internet Outage?",
        "content": "I've downloaded Netflix shows and would like to watch them on my TV when my power and internet is out. My WiFi is on a battery backup, so it is available.\n\nIf I mirror my Mac screen, Netflix won't allow it (due to DRM, I'm sure). I can cast the video from my android tablet, but I think that depends on an internet connection(?).\n\nI can connect with an HDMI cable, but that is less convenient.\n\nQ1: Does the Netflix casting work even if the internet is out?\n\nQ2: Is there a simple hardware device that will solve this problem?\n\nThanks!",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ooix5m/mirror_netflix_to_tv_during_power_and_internet/"
    },
    {
        "id": "1oooet1",
        "author": "chi_guy8476",
        "title": "International Travel - New Account",
        "content": "Looking for some advise, as it seems Netflix is getting increasingly tight on location restrictions. Best friend recently moved from the states to Dublin for a 2 year work stint. They have been using their US account and clicking on travel, this has recently stopped working. To add to the matter she has started traveling weekly, typically visiting 2 to 3 different countries per week (no pattern to it). Is the best course to cancel their existing US plan, and sign up for one at their home in Dublin.  Assuming she checks in at least once a month in Dublin, regardless of how many countries she visits within the month (can vary from in Europe, Australia, Japan/China and then the states for the holidays)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oooet1/international_travel_new_account/"
    },
    {
        "id": "1onmrka",
        "author": "rossfororder",
        "title": "Wayward",
        "content": "The show is initially a thriller about a bunch of kids in a school prison but it's so much more. I loved this show, one of the best I've seen in a long while.\n\nToni Collette as a cult leader is impossibly good. Created and starring Mae Martin.",
        "upvotes": 87,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1onmrka/wayward/"
    },
    {
        "id": "1oog75e",
        "author": "brain_rot_101",
        "title": "Horror movie recommendations please...",
        "content": "I'm a huge fan of this genre and have seen A LOT of these movies, so much so that I've run out of any 'actually good horror movies' to watch. \n\nWould be great if you could recommend me any. I've mostly watched English language's horror, but have also covered popular international ones, so I'm open to those as well.\nWould prefer if the recommendations are closer to the paranormal and slasher genre. \n\n\nPlease don't recommend stuff like Get Out, The Babadook, The wailing, etc. Or ones where the ghost isn't even good enough to scare a kid.\n\nI've liked Conjuring 1 &amp; 2, Scream (earlier movies), Oculus, The Visit, Veronica... you get the idea.\n\nThank you...",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oog75e/horror_movie_recommendations_please/"
    },
    {
        "id": "1ooer1r",
        "author": "AlissaKane",
        "title": "Learning German. Any way to get German language for UK resident",
        "content": "I am currently learning German and have been for a couple years, mostly via Duolingo and speaking to some German friends. I know Duolingo isn't the best and I'd like to be able to watch some shows in German as I believe this will really help me out by hearing the language spoken casually and often with real world usage.  I know the German dubs for many shows exist as my friends have acess to both German and English on their end. However for me, who is British, there is only ever English. From googling a bit it also seems VPNs wont work either as your account still remembers where is is from. \n\nCan anyone give any advice or know a way to get access to additional languages?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ooer1r/learning_german_any_way_to_get_german_language/"
    },
    {
        "id": "1oo0zzb",
        "author": "MusicSavesSouls",
        "title": "El Dorado : Everything the Nazis Hate",
        "content": "Has anyone seen this? It looks like it came out a few years ago, but it is so educational and amazing to watch. This happened almost a 100 years ago, and it is also going on today. The same bullsh\\*t and this was almost 100 years ago!! It makes me wish we would all evolve as humans and live peacefully together. If you hate someone, who is not bothering you or does nothing to affect your life in any way, you have a problem. I really enjoyed this film. Old archives from the Nazi days and a different subject than most Nazi movies. It is wild. I knew Nazis didn't like gay or trans people, but I didn't know to what extent they didn't like them. Now, trans are the enemy, again. Without getting too political, it really looks like we are repeating everything that happened in 1933.\n\nEdited to add: A chilling quote from Hitler, in this documentary. \"Homosexuality has to be combated at all costs, otherwise it will be the end of Germany, the end of the Germanic world.\"\n\nCan't we all learn from history?\n\nIf you want a thought-provoking film, I recommend this one!\n\n",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oo0zzb/el_dorado_everything_the_nazis_hate/"
    },
    {
        "id": "1ood3tn",
        "author": "420kai",
        "title": "Netflix no longer working on PC and can't login",
        "content": "Just yesterday, I was using my laptop to watch Netflix, but today when I tried to watch a series, its thumbnail (along with some others) appeared black. Clicking them didn’t load anything. So, I logged out, but now I’m getting the error message: *“Sorry, we are unable to complete that action now. Please try again later.”*\n\nNetflix works completely fine on my mobile and TV.  \nI’ve already tried restarting the router, switching browsers, and even using the app version from the Microsoft Store, but I’m still unable to log in.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ood3tn/netflix_no_longer_working_on_pc_and_cant_login/"
    },
    {
        "id": "1ooox3k",
        "author": "giveaway_yt",
        "title": "did supernatural leave netflix",
        "content": "its not anywhere in the search bar i cant find it anywhere. anyone know whats going on has it been removed i just cant find it i watched it earlier now its not showing.",
        "upvotes": 0,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1ooox3k/did_supernatural_leave_netflix/"
    }
]