[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 642,
        "comments": 4899,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1niy2gn",
        "author": "SunnySouthDetroit",
        "title": "Monsters: The Ed Gein Story = Mind Blown",
        "content": "Just watched the trailer for this show and I am Stupid excited. I was trying to figure out who the lead actor was and had to look it up. Charlie Human omgawd! I'm a rabid SoA fan, and CH fan. \n\nI'm also a huge fan of the movie and watch it a few times a year. I did not have my hopes up for this but if it's half as good as the trailer, I can't wait. Come on October 2! ",
        "upvotes": 111,
        "comments": 95,
        "media": null,
        "permalink": "/r/netflix/comments/1niy2gn/monsters_the_ed_gein_story_mind_blown/"
    },
    {
        "id": "1nikksv",
        "author": "Less-Pen-5705",
        "title": "Yall remember back in the day when Netflix basic no ad plan was like 7/8.99???",
        "content": "Good times….now you have to pay like 20+ bucks to enjoy content without commercials…not only that, they’re piping down on password sharing and making it hard for people to use their family members/friends accounts….not only that, also the very limited new content that they have and the old content that they keep removing….in some ways Tubi is better than Netflix LMFAOOO. Yes tubi may have ads but atleast tubi is free!!! No way I’m paying 10/15+ bucks a month to still watch fucking commercials.",
        "upvotes": 208,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1nikksv/yall_remember_back_in_the_day_when_netflix_basic/"
    },
    {
        "id": "1nj6nwr",
        "author": "Need_Some_Sukoon",
        "title": "Need Netflix series suggestions!",
        "content": "Hey everyone 👋\nI’m looking for some good Netflix series to start watching. Open to any genre — thriller, comedy, drama, sci-fi, or even underrated gems that most people don’t talk about.\n\nSome I’ve already watched and enjoyed:- \n[ Stranger Things, Money Heist, Dark, YOU, Cobra Kai, Mind Hunter, etc.]\n\nWould love to hear your recommendations — what’s a must-watch on Netflix right now?\n\nThanks in advance!!",
        "upvotes": 4,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1nj6nwr/need_netflix_series_suggestions/"
    },
    {
        "id": "1nj5vlb",
        "author": "CaptainDestruction",
        "title": "Should Netflix have a tier of only their exclusive in house movies/shows?",
        "content": "As someone who is only subscribed to a few services I find that the amount I pay for all the services there is alot of overlapping content. My question centers around the idea of subscribing for the exclusive content and paying a lower amount and not getting the outside movies/shows, would this be a smart idea? Would you find it worth it(of course depending on the price)? I personally know many people who don’t subscribe to Netflix, Prime, HBO etc. because they only want to watch the exclusive content but don’t want to pay the price to get content they already have access to elsewhere.",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nj5vlb/should_netflix_have_a_tier_of_only_their/"
    },
    {
        "id": "1nj7nfj",
        "author": "gladeplugin26",
        "title": "Shows on Netflix",
        "content": "Does anybody know how do you pitch a show idea to Netflix? I’m just a random, but I’ve been thinking about this show idea for a while and I think Netflix might like it, considering some of the stuff they have on there now. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nj7nfj/shows_on_netflix/"
    },
    {
        "id": "1nj7jy0",
        "author": "Fun_Molasses5215",
        "title": "Stephen Richardson sues Love Is Blind producers over ‘inhumane working conditions’",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nj7jy0/stephen_richardson_sues_love_is_blind_producers/"
    },
    {
        "id": "1niyop4",
        "author": "FloatingCow-",
        "title": "Travel locked.",
        "content": "Half of my family is currently with me at the hospital while my son is recovering from heart surgery. Around 1-2 months we will be staying here which is 4 hours away from home. Netflix was working fine until it locked me out entirely unless I change home location. When I go home or my family goes home they also use the Netflix account there. Same family same account I pay for the account fully yet I can’t use it anymore. It’s frustrating that they don’t have an option for this situation where I’m temporarily living somewhere else. I called support and they said to just keep switching back and forth the main household. If that’s the case what even is the point of locking you out if you can just keep going back and forth. Problem that shouldn’t exist. I just want to watch some breaking bad while waiting for my son to fully heal. I know nothing can be done and it is what it is but just wanted to rant. Now I’m just watching king of the hill on Hulu until we go home. ",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1niyop4/travel_locked/"
    },
    {
        "id": "1nhxelr",
        "author": "SnooRevelations7068",
        "title": "Netflix cancelled after 10 years. Are you feeling Netflix has gone downhill too?",
        "content": "Hit me yesterday, we haven’t checked out Netflix in awhile. Popped in, layouts completely different and nonsensical, and there really wasn’t anything good or new. Cancelled Netflix after 10 years, but the lack of content and cancelling of interesting shows after a season was ruining Netflix for us anyways. Wife and I both agreed, we don’t give af about the last season of Stranger Things anyways. Anyone else feeling the same way?",
        "upvotes": 801,
        "comments": 545,
        "media": null,
        "permalink": "/r/netflix/comments/1nhxelr/netflix_cancelled_after_10_years_are_you_feeling/"
    },
    {
        "id": "1nj7ges",
        "author": "Routine_Abrocoma_699",
        "title": "recommendations",
        "content": "Need Netflix series suggestions!\n\nHey everyone 👋\nI’m looking for some good Netflix series to start watching. Open to any genre — thriller, comedy, drama, sci-fi, or even underrated gems that most people don’t talk about.\n\nSome I’ve already watched and enjoyed:- \n[ Stranger Things, Money Heist\n\nWould love to hear your recommendations — what’s a must-watch on Netflix right now?\n\nThanks in advance!!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nj7ges/recommendations/"
    },
    {
        "id": "1niqki7",
        "author": "Anthro-Elephant-98",
        "title": "I found Disenchantment very disappointing",
        "content": "This may be an unpopular opinion, but I really did not like Disenchantment. I watched the first two seasons *hoping* I would get into it, but I never did. Personally, the reason that I found the show disappointing was because I went into it thinking it was going to be some epic fantasy quest plot line. Something comparable to that of Lord of the Rings, Game of Thrones, Narnia, Avatar: The Last Airbender, etc. but something with comedy as much as adventure, wonder, and advanced world building.  \n  \nThere was virtually *NO* adventure. At least not an epic one, anyway. Don’t get me wrong, I think there is DEFINITELY a market for an adult cartoon/fantasy parody series, similar to an animated Order of the Stick (iykyk). But with the plot line it currently has, the whole time, I was thinking, “and *whyyyyyy* is it set in a medieval fantasy world?” The setting didn’t seem to add anything interesting to the story. It could've been set in the real world following a rich heiress instead of a princess and literally NOTHING about the plot would change other than a few visual gags.   \n  \nI wanted to like this show. I really did. I watched the whole first and second seasons hoping it would get more interesting but it never did. As a fan of fantasy adventure quest stories, this was a huge disappointment. The only thing that I really enjoyed about this show was the animation. The animation was *exceptionally* good. But again, I feel like they could've done more with the fantasy adventure aspect of the world. Like I said, there is definitely a market for something like that, but this show wasn't it.",
        "upvotes": 9,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1niqki7/i_found_disenchantment_very_disappointing/"
    },
    {
        "id": "1nilndj",
        "author": "darth_vader39",
        "title": "Tom Clancy's Splinter Cell: Deathwatch | Official Trailer | Netflix",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nilndj/tom_clancys_splinter_cell_deathwatch_official/"
    },
    {
        "id": "1ni7h51",
        "author": "Fabulous-Question173",
        "title": "Adolescence",
        "content": "So I started this today and I can't stop watching it. I can definitely understand why it won some awards. The show touches on a lot things that some of us just don't think about. I can't imagine what kids go through with social media nowadays. I was a freshman in HS in 2002. We were right on that beginning of it. We were right at that age where everyone still got outside and did everything. Like drag main street. Later on it was bon fire parties. I can't even begin to imagine the photos and videos that could be out there. ",
        "upvotes": 53,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1ni7h51/adolescence/"
    },
    {
        "id": "1nisopl",
        "author": "ZoinMihailo",
        "title": "King (2019) - Best Netflix film or just overhyped?",
        "content": "WillShakespeare1564 • 2h ago:\nMarry, good sir, thou dost pose a question most vexing to mine authorial heart!\nVerily, young Chalamet doth bear the crown's weight with such gravity as would make mine own Hal weep with recognition. Yet where, prithee, are the \"gilded monuments\" of verse that should accompany such kingly transformation?\nMethinks this film captures well the \"uneasy lies the head that wears a crown\" - the political machinations ring most true to mine intent. But alack! The poetry hath been murdered most foul, replaced by prose as plain as a Puritan's doublet.\nThe French scenes? Chef's kiss - though I confess 'tis strange to see mine Dauphin speak with such... how say you... \"realistic\" dialogue rather than mine flowery conceits.\nTL;DR: 'Tis a worthy adaptation that honors the substance of mine work whilst abandoning its soul. Netflix hath created a fine historical drama, but murdered a poetic tragedy.\nVerdict: Netflix hath honored the plot, but buried the Bard.\nP.S. - Still better than that Mel Gibson Hamlet nonsense, by my troth!",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nisopl/king_2019_best_netflix_film_or_just_overhyped/"
    },
    {
        "id": "1nixi1b",
        "author": "Mossyblues",
        "title": "Accused - Mo's story - Fire?",
        "content": "I noticed while watching this episode at the 44:08 Mark the camera pans down the street and inside one of the windows you can see a fire starts, the next scene shows 2 scobes riding bikes down a street filled with smoke, can anyone explane these scenes? There is no other reference of a fire, and this scene came before the arrests therefore no one at that point knew it was them except the gang that made him do it, the house at the end of the episode altho vandalised on the outside, looks perfect on the inside, just something I noticed if anyone has an answer? \n\nPossible scene that they forgot the remove related to a different scene that was removed? 🤷‍♂️  ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nixi1b/accused_mos_story_fire/"
    },
    {
        "id": "1nixgdx",
        "author": "shitshow2235",
        "title": "Random hdr issues",
        "content": "I have the 4k netflix plan. Today I went to watch \"i am not okay with this\" which is supposed to be in 4k hdr. But for some reason it only shows it in just 4k. That specific show only. Along with stranger things season 1. Is anyone else experiencing shows that are labeled as having hdr, not having said hdr? I've tried watching on other 4k devices nothings working. I think its a netflix issue and most shows labeled as having hdr are working just fine.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nixgdx/random_hdr_issues/"
    },
    {
        "id": "1nj48xz",
        "author": "More-Explanation2032",
        "title": "really nettix",
        "content": "Basically I am trying to download a series/movie but net fix keeps saying that I need to delete my downloads to download more staff regardless of how much storage I have",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nj48xz/really_nettix/"
    },
    {
        "id": "1niqeo2",
        "author": "TheDregn",
        "title": "\"Too many ppl using my account\", while there is only a single device connected",
        "content": "Hi,\n\nI just recently encountered an issue, where I wanted to continue watching a show and an error pops: \"too many ppl are using your account. You should stop the play on the other screen first before to watch what you want \". \n\nIs there a known bug regarding this? \n\nI just checked the account in the browser and did the following steps:\n1) made sure no unknown device is connected \n2) force disconnected every single account, so nothing is connected now, it's clean \n3) changed my PW\n\nWaited a good 20 minutes and it's the same issue! The show that is supposedly watched on a different screen has progressed since then and it is \"halfway watched\".\n\n**What am I supposed to do?** There is no other device connected, I have a new PW and no login is ever recorded in my emails. I want to make sure noone is hijacking my account and I want to use the account I'm paying for.\n\nThank you for the assistance. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1niqeo2/too_many_ppl_using_my_account_while_there_is_only/"
    },
    {
        "id": "1nini25",
        "author": "drawingablanke",
        "title": "Ted Sarandos Recalls Reed Hastings’ Original Pitch to Him About Netflix’s Streaming Future: ‘It Sounded Nuts to Me’",
        "content": "The link is to the section of the podcast interview mentioned in [this Variety article](https://variety.com/2025/tv/news/ted-sarandos-reed-hastings-original-pitch-netflix-streaming-it-sounded-nuts-1236516486/). Also some interesting stuff in there about how the Netflix Co-CEO role works.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nini25/ted_sarandos_recalls_reed_hastings_original_pitch/"
    },
    {
        "id": "1nieev1",
        "author": "Orii21",
        "title": "Girl From Nowhere",
        "content": "Anyone can check if the 2018 thai series \"Girl from Nowhere\" is available in 4K? I'm gonna rewatch it and I'd subscribe to the Premium plan if it is.\n\nThanks.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nieev1/girl_from_nowhere/"
    },
    {
        "id": "1nhznag",
        "author": "theseawoof",
        "title": "Have series ever been renewed years after being cancelled?",
        "content": "Has Netflix been known to bring shows back after having been cancelled by them for years? Seems like shows get cancelled by Netflix quite a bit, but I've never really thought much about if they've been revived or not. \n\nBeen hung up on Skylines (2019) and Archive 81 (2022) for example. Extraordinary shows with great writing, casts and acting. Among shows that found their voices instantly, and continue lingering since they just began intriguing stories with no resolution. I'm over here trying to brainstorm how things would play out 🫠 so many great character journeys that need to continue- a disservice to the art",
        "upvotes": 24,
        "comments": 80,
        "media": null,
        "permalink": "/r/netflix/comments/1nhznag/have_series_ever_been_renewed_years_after_being/"
    },
    {
        "id": "1ni5ls3",
        "author": "Reasonable-Ad-4760",
        "title": "Any shows like Archive 81?",
        "content": "I just started it and love it so far but i know there’s only one season. Particularly looking for something that has a mystery beyond the typical crime show premise ",
        "upvotes": 7,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1ni5ls3/any_shows_like_archive_81/"
    },
    {
        "id": "1nipjvj",
        "author": "lorenasilv_21",
        "title": "Blair de gossip girl.",
        "content": "Can anyone tell me why Blair is mesmerizing in the first two seasons? She has something surreal about her appearance and I can't say what it is. I really wanted to know what made the actress so absurd in the first two seasons.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nipjvj/blair_de_gossip_girl/"
    },
    {
        "id": "1nibkzb",
        "author": "historyinprogress",
        "title": "Smith County Strikes Again (I Am a Stalker)",
        "content": "This was an okay series. Some stories were crazier than others but Episode 5? Come on. It felt like a stupid prank. I laughed a few times because it was so ridiculous. It’s something 13 year old girls would do to scare someone they don’t like. I don’t think it belonged with the rest of the stories in this series because it was so stupid. \n\nBut Smith County is a f-d up place and this is the 3rd documentary I’ve seen that reiterates that. I don’t know why anyone would want to live there. The police in that county are nuts. It feels like one sorry after another shows how bats-t that place is. \n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nibkzb/smith_county_strikes_again_i_am_a_stalker/"
    },
    {
        "id": "1ni6bi3",
        "author": "ReferenceSufficient",
        "title": "Echoes of Survivors; Inside Korea's Tragedy",
        "content": "Netflix most disturbing documentary yet of the Horrific torture and killing (thousands) innocent people including young Children in Korea in 1980s.  \nThe man who was in charge hardly got punished.  ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ni6bi3/echoes_of_survivors_inside_koreas_tragedy/"
    },
    {
        "id": "1ni2hav",
        "author": "Atlast_2091",
        "title": "The Great Flood | Official Teaser | Netflix [ENG SUB]",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ni2hav/the_great_flood_official_teaser_netflix_eng_sub/"
    },
    {
        "id": "1nh8v1b",
        "author": "indiewire",
        "title": "Owen Cooper Wins Emmy for 2025 Best Supporting Actor",
        "content": "",
        "upvotes": 324,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1nh8v1b/owen_cooper_wins_emmy_for_2025_best_supporting/"
    },
    {
        "id": "1ni30hi",
        "author": "HeyItzArrow",
        "title": "Not working?",
        "content": "Netflix won’t load once I click on a movie or show on my PC. It brings up the black loading screen with the red circle that goes around but never actually loads. \n\nAnyone else having this issue right now?",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ni30hi/not_working/"
    },
    {
        "id": "1nhksce",
        "author": "MysteriousDelay6266",
        "title": "The Beast in Me | Official Teaser | Netflix | November 13",
        "content": "# THE BEAST IN ME\n\nClaire Danes, Matthew Rhys, and the team that brought you Homeland. \n\n* **The Beast in Me coming November 13th.**",
        "upvotes": 24,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1nhksce/the_beast_in_me_official_teaser_netflix_november/"
    },
    {
        "id": "1ni4cib",
        "author": "OkPea8377",
        "title": "A Wrong Paris (2025) - review",
        "content": "The Wrong Paris - it has everything, but something seems to be missing.\n\n\nThe brand new romantic comedy from the most famous digital streamer debuted recently and has already achieved great success. Starring former Nickelodeon teen star Miranda Cosgrove, in her second original work on Netflix (her first original work on the streamer was “A Mãe da Noiva”, another big recent success on the platform) and Pierson Fodé (The Perfect Date).\n\nSummary\nDawn (Miranda Cosgrove), a metallurgical artist, lives in the interior of the US state of Texas with her grandmother Bird and her sisters, dreaming of following in her mother's footsteps and becoming a real artist. Dawn, responsible, dedicated herself to working at a local café for a long time due to her private financial funds to study art in Paris. She actually manages to pass university, however, without the full scholarship, her savings are insufficient.\n\nOne of her sisters, a fan of reality shows, suggests that she sign up for the current production, the “Honeypot” or “Honey Pot”, a competition between women with 20 thousand dollars guaranteed to those selected for the great contest in search of the keys to the heart of a rich single man, which conveniently would take place in the City of Lights — or that's what the participants thought.\n\nSelected and gaining the affection of one of the show's producers, Dawn finds herself ready to reach the Eiffel Tower house. However, she is surprised by the production's prank, and the primary cause of the film's name, which lands her in Paris, Texas, less than 100 km from her home. Remaining in the dispute only for contractual reasons, she soon arouses the interest of the millionaire of the moment, Trey McAllen III (Pierson Fodé), a handsome cowboy, initially determined to be eliminated immediately. Throughout the dispute, between tests and intrigues typical of reality shows in confinement and some extra game moments, she will allow herself to live this passion.\n\nComments and opinion\nHome to many successful relationship reality shows, Netflix ironizes its own productions. From the beginning, Honeypot is presented as a self-criticism, properly a parody of the reality television genre. The entire structure and characters involved in the dispute are stereotypes of the most common human types to expose themselves in front of the cameras: the rich and spoiled influencer, the old school biker, the nerd, the free lover, the forgotten celebrity, the alternative girl, etc.\n\nThe film was directed by Janeen Damian, who has experience in the romantic comedy genre. He has already directed two other Netflix productions in the same style: Christmas Eve and Irish Wish. In The Wrong Paris, she inserts all the common and pleasant elements of romantic comedies, being quite predictable, which is no demerit. After all, when watching films or series of this type, we want an escape valve from the chaotic everyday life, where we have little or no control over what is going on around us. The constant presence of Dawn's family is an especially pleasant difference, constituting the viewer's voice within the film.\n\nEspecially her grandmother Bird, an emotional component of the plot, frequently advises her granddaughter and encourages her. Sometimes he interferes in the story that the most anxious audience would like to do for themselves. Miranda brings beauty and humanity to the film; It is perfectly possible to be indignant with her regarding the “villainess”'s far from discreet advances on the handsome millionaire. She conveys the character's insecurities well and definitely makes us fall in love with her too — an essential element for any self-respecting romantic comedy. Pierson fulfilled what his character needed: he delivers someone who is attentive, concerned, handsome and very passionate about the protagonist. There could be a slight touch more chemistry between the two characters (annoying me? Maybe).\n\nFeaturing beautiful landscapes and an interesting cast, the film also stands out for the quality of its production, ideal for the romantic comedy genre. Despite this, the story could have been better worked on. At 1h45 long, the extremely light plot (a good sign) goes by too quickly. There could be better development of the \"villain\" and the protagonist's confidant, through dialogues between them and the main character. In my opinion, there could have been more frank dialogues between the protagonist couple, giving a more solid basis for the passion between them. Some moments between Paris, Texas, and Paris, France, appear to occur with an expressed passion, without much emotional basis. Maybe 15 more minutes of film wouldn't hurt the production.\n\nWith an insightful critique in the background of the futility of influencers and the world of reality shows, limited to the formulas of the genre, it could have promised more than just a light and pleasant romantic comedy for a late afternoon when you just want to turn off your brain and disconnect from the busy routine, with cute moments starring passionate characters. I would have easily given that away. I think it was designed to be a single film, but there could be a sequel expanding this wonderful universe, especially Dawn's relationship with her family, especially her sisters.\n\nFINAL RATING: 4.5 STARS",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ni4cib/a_wrong_paris_2025_review/"
    },
    {
        "id": "1ni6vxu",
        "author": "Puzzleheaded_Sky3043",
        "title": "What are your opinions on the episode “Remember when our boys became men” from family reunion?",
        "content": "do you think it showed the issue poc face well? Whats your thoughts on the episode? I personally haven’t seen the episode in a while so i’m going back to rewatch it, however i do want your opinion on the episode since i do remember the general basic plot of the episode. Was there anything you did or didnt like? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ni6vxu/what_are_your_opinions_on_the_episode_remember/"
    }
]