[
    {
        "id": "1qof7n3",
        "author": "RabbitTrapAMA",
        "title": "Hi /r/movies! I'm Bryn Chainey, writer/director of RABBIT TRAP, a folk-horror starring Dev Patel &amp; Rose McEwen that's out in UK cinemas this weekend. Ask me anything!",
        "content": "*From the* r/movies *Mod team:*\n\nPlease excuse the typo in the title. It's Rosy McEwen (as Bryn says below), not Rose McEwen. Our automod post scheduler screwed up with auto-correct!\n\n*From Bryn:*\n\nHi r/movies, I'm Bryn Chainey. I wrote and directed RABBIT TRAP, a psychological folk-horror that premiered at Sundance last year and that will be out in UK cinemas this weekend via Picturehouse Entertainment. It stars Dev Patel &amp; Rosy McEwen, and I'm here to answer your questions.\n\n**Synopsis:**\n\nIn 1976, married musicians Daphne (Rosy McEwen) and Darcy Davenport (Dev Patel) move to the Welsh countryside to finish their new record. While making field recordings in the ancient woodlands, Darcy captures a forbidden sound not meant for human ears. This brings a strange boy to their doorstep who draws them into an enigmatic realm where the line between reality and myth begins to blur.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=y953Fl\\_BdWM](https://www.youtube.com/watch?v=y953Fl_BdWM)\n\nStarring Dev Patel &amp; Rosy McEwen. In UK cinemas January 30.\n\nAsk me anything! I'll be back Thursday 1/29 at 8 AM ET to answer your questions!",
        "upvotes": 83,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rdm685dpiwfg1.png?auto=webp&amp;s=a08a1aaf1be4aaae83c83affa9664012b165f07b"
        },
        "permalink": "/r/movies/comments/1qof7n3/hi_rmovies_im_bryn_chainey_writerdirector_of/"
    },
    {
        "id": "1qpajg8",
        "author": "SookYinAMA",
        "title": "Hey, /r/movies! I’m Sook-Yin Lee! You may know me from Shortbus, Hedwig and the Angry Inch, or as a musician. My new movie, PAYING FOR IT, a live-action feature film adaptation of cartoonist Chester Brown’s best-selling graphic novel, opens in theaters this weekend. Ask me anything!",
        "content": "Hey, Reddit! I’m Sook-Yin Lee! You may know me from Shortbus, Hedwig and the Angry Inch, or as a musician &amp; ex-MuchMusic VJ. My new movie, PAYING FOR IT, a live-action feature film adaptation of cartoonist Chester Brown’s best-selling graphic novel, opens in theaters: NYC 1/30, L.A. 2/3 &amp; more. AMA!\n\n**Official Trailer**: [https://www.youtube.com/watch?v=VqPfF1lxRxw](https://www.youtube.com/watch?v=VqPfF1lxRxw)\n\n**More Information**: [https://filmmovement.com/paying-for-it](https://filmmovement.com/paying-for-it)\n\n**ABOUT PAYING FOR IT**\n\nSet in the late 90’s, PAYING FOR IT follows the trials and travails of Chester (Dan Beirne), a cartoonist and Sonny (Emily Lê), a TV host, who are in a long-term, committed, romantic relationship. When Sonny introduces the idea of opening up their relationship, Chester begins sleeping with sex workers, forcing him to face his issues with intimacy and romance in the process. Based on the best-selling graphic novel by acclaimed alternative-cartoonist Chester Brown, PAYING FOR IT is a “provocative, hilarious and heartfelt” (The Globe and Mail) personal take on romance and relationships. From writer/director Sook-Yin Lee, the film “displays a maturity and thoughtfulness (...) in the messy contradictions we may hold about love” (RogerEbert.com).  Celebrating the vibrant underground comic and zine era through the experiences of cartoonist Brown, PAYING FOR IT connects the past with the present by bringing together emerging comic actors, performance artists, authors, activists and multimedia creators in front of and behind the camera, and it has resonated for festival audiences and critics alike.\n\n**ABOUT SOOK-YIN LEE**\n\nSook-Yin Lee (Writer, Director, Co-Producer) is a Toronto-based filmmaker, musician, actor and broadcaster (CBC, BBC, MuchMusic). She starred in Shortbus, the ground-breaking 2SLGBTQ movie directed by John Cameron Mitchell that premiered at the Cannes Film Festival. Her feature film writer and directorial debut, Year of the Carnivore, starring Cristin Milioti, premiered at TIFF. In 2014, Lee won the Canadian Screen Award for Best Performance by a Lead Dramatic Actress in Jack and went on to write and perform Unsafe for Canadian Stage, which examined questions of censorship and artistic freedom. She won Best Director and Best Picture at the 2018 Downtown Los Angeles Film Festival for Octavio is Dead! --a ghost story starring Sarah Gadon and Rosanna Arquette. Death and Sickness, her feature movie made with Dylan Gamble, streams on CBC Gem. She acts in Darkest Miriam, executive produced by Charlie Kaufman, and is set to release her experimental comedy Rest and Relax. Sook-Yin is a music recording artist and film score composer. She contributed songs to Brandon Cronenberg's horror movies Infinity Pool and Antiviral.\n\nAsk me anything r/movies! I'll be back tomorrow, Thursday 1/29 at 3 PM ET, to answer your questions.\n\n",
        "upvotes": 569,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qs5edgmbh1gg1.png?auto=webp&amp;s=fdd87b6b0a4b33f0f2a2789c96f11f2b38065715"
        },
        "permalink": "/r/movies/comments/1qpajg8/hey_rmovies_im_sookyin_lee_you_may_know_me_from/"
    },
    {
        "id": "1qq76mi",
        "author": "MarvelsGrantMan136",
        "title": "‘Melania,’ the First Lady’s New Documentary, Abruptly Pulled From Release in South Africa",
        "content": "",
        "upvotes": 12691,
        "comments": 606,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GT7NWbVZjciySyK8pnl67abHFp3yH-izLQVaTvShXQI.jpeg?auto=webp&amp;s=7e8290f61383151a8dce1f0a2c64ce1fe1697af4"
        },
        "permalink": "/r/movies/comments/1qq76mi/melania_the_first_ladys_new_documentary_abruptly/"
    },
    {
        "id": "1qq6036",
        "author": "vought-CEO",
        "title": "Snatch (2000) | “Did you understand a single word of what he just said?” | Brad Pitt, Jason Statham, Stephen Graham | Dir. Guy Ritchie",
        "content": "",
        "upvotes": 1074,
        "comments": 193,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vdvrx4iiw9gg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qq6036/snatch_2000_did_you_understand_a_single_word_of/"
    },
    {
        "id": "1qq1mwq",
        "author": "ChiefLeef22",
        "title": "Odessa A'zion Shares She's Pulling Out of Sean Durkin’s ‘Deep Cuts’ After Whitewashing Accusations",
        "content": "",
        "upvotes": 968,
        "comments": 554,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0jDUDscOXL0oIJMLhpEnrtotD3nBn9Sgn4iD6xsQLAQ.jpeg?auto=webp&amp;s=d2b4da6e8c4d23ee7ac82843f4c4f5f1dd7bd0cf"
        },
        "permalink": "/r/movies/comments/1qq1mwq/odessa_azion_shares_shes_pulling_out_of_sean/"
    },
    {
        "id": "1qpf3wh",
        "author": "MarvelsGrantMan136",
        "title": "First Images of Henry Cavill in Chad Stahelski's ‘HIGHLANDER’",
        "content": "",
        "upvotes": 28540,
        "comments": 2021,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wam706tu34gg1.jpeg?auto=webp&amp;s=fc30a4f2e2770639f8eb2eadd07570c3e294bcdf"
        },
        "permalink": "/r/movies/comments/1qpf3wh/first_images_of_henry_cavill_in_chad_stahelskis/"
    },
    {
        "id": "1qq9oo5",
        "author": "PriestofJudas",
        "title": "Burn After Reading: probably the funniest deconstruction of ego and self importance",
        "content": "I’m a massive Coen brothers fan so even I’m surprised how long it took me to actually watch Burn After Reading. Unfortunately sandwiched between the cynically incredible No Country for Old Men and the Job like epic of A Serious Man, BAR is even by the Coens standards a bit odd. \n\nIt’s also fucking hilarious \n\nThe story of a volatile low level CIA analyst who after being faced with a demotion due to a (not at all well hidden) drinking problem decides to quit and start writing his memoirs only to find his wife is divorcing him whilst she’s having an affair with a paranoid Treasury department officer, only to THEN have his memoirs unintentionally stolen by two dimwitted gym employees who believe the disc it’s on contains government secrets after sed wife decided to copy his financial records and the disc was accidentally left at sed gym, it’s definitely a twisting narrative with a lot of important characters that play a role. \n\nBut what makes it hilarious is that, though in a conventional espionage this would make for a taut, tense, even dark thriller of multiple secretive players trying to double cross each other (not saying that doesn’t happen here but still), in Burn After Reading it ultimately doesn’t mean anything, literally. \n\nWhilst the macguffin of the CD containing the information is important to several of the characters for varying reasons, the key is that it actually isn’t important to pretty much everyone else. Osborne (the analyst) is in fact so so low down the totem pole of the CIA that even the director of the organisation barely cares that the supposed “classified information” is attempting to be sold to the Russian embassy (an extra joke is that Osborne was an analyst for the Balkan region so the Russians additionally wouldn’t care even if it was meaningful).\n\nHowever because, with the possible exception of Osbornes wife who was only using it for divorce leverage, everyone else is placing high importance on the disk, namely, THEY think it’s so valuable, it shows just how badly their own egos play against them. It leads to several somewhat unexpected deaths, multiple profanity laden tirades and a very curious chair. \n\nThe added elements of a tradition spy thriller score at points (pointedly when they’re doing something insanely stupid) also helps to really sell the joke, because they’re so much trying to fill the importance of this thing when really none exists. \n\nI think Burn After Reading is a great example of deflating humour really nailing it. Whilst the setups and the situations are themselves hilarious, what makes it funny is how high stakes and important the situation seemingly are to the central players, only to realise that no one else actually cares. It’s the style of humour that the Coens have perfected and is well worth a watch.\n\nAlso Brad Pitt steals the show ",
        "upvotes": 217,
        "comments": 60,
        "media": null,
        "permalink": "/r/movies/comments/1qq9oo5/burn_after_reading_probably_the_funniest/"
    },
    {
        "id": "1qq2335",
        "author": "Fan387",
        "title": "Voice actor Alexis Ortega, the Latin voice of Spiderman, dies at 38",
        "content": "",
        "upvotes": 663,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aNgAnD8RbLsPfGBzbrPwX5TO4rv6aPMo4g9FSKezicI.jpeg?auto=webp&amp;s=b6734ab55f93308d5f149e2baf8bb725ec9a6c20"
        },
        "permalink": "/r/movies/comments/1qq2335/voice_actor_alexis_ortega_the_latin_voice_of/"
    },
    {
        "id": "1qpo1yk",
        "author": "MarvelsGrantMan136",
        "title": "Brandon Sanderson’s Literary Fantasy Universe ‘Cosmere’ Picked Up by Apple TV, 'Mistborn' Set for Film Adaptation",
        "content": "",
        "upvotes": 3716,
        "comments": 629,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xS5dTxElnNAAHgWkvPVV3ebgfNSLGluqzc2jft32hd8.jpeg?auto=webp&amp;s=ccb20fe0c0d6049a89f9049b7b90182daa345f0a"
        },
        "permalink": "/r/movies/comments/1qpo1yk/brandon_sandersons_literary_fantasy_universe/"
    },
    {
        "id": "1qq7l94",
        "author": "InspectorMendel",
        "title": "What’s a movie that DOESN’T “know exactly what it is”?",
        "content": "A common claim on this sub is that a movie is “not high art, but it knows exactly what it is”. Meaning that it has self awareness that elevates it.   \n\n\nI think this is just a way to feel better about liking a trashy movie, because I’m not sure I’ve ever seen a movie that ”doesn’t know what it is”. What would that even look like?\n\nCan you give an example of a movie that suffers due to “not knowing what it is”?",
        "upvotes": 206,
        "comments": 821,
        "media": null,
        "permalink": "/r/movies/comments/1qq7l94/whats_a_movie_that_doesnt_know_exactly_what_it_is/"
    },
    {
        "id": "1qq3r1n",
        "author": "AdventurousGuest308",
        "title": "Endings you didn't get as a child but understand as a teen/adult?",
        "content": "For me, that is the Cars 1 ending. Spoliers if you haven't seen it yet.\n\n\n\nThe ending to Cars showed Lightning McQueen giving up The Piston Cup to help out The King to finish his last race. As a kid, I never understood why he couldn't just finish and then go out to help The King. However, now as a teenager, I realise the reason was because he learned that trophies are just empty cups. In other words, Lightning is a good sport for giving up the piston cup to make sure The King finished his last race. And Chick got exactly what he deserved.",
        "upvotes": 322,
        "comments": 137,
        "media": null,
        "permalink": "/r/movies/comments/1qq3r1n/endings_you_didnt_get_as_a_child_but_understand/"
    },
    {
        "id": "1qph1lh",
        "author": "MarvelsGrantMan136",
        "title": "‘KPop Demon Hunters’ Is Most-Streamed Movie of 2025 With 20.5 Billion Minutes Watched",
        "content": "",
        "upvotes": 6747,
        "comments": 401,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uYp4VjkT-FnkoG10198jDJTdyehbdoAWl5wFM85FcsE.jpeg?auto=webp&amp;s=45fc2476f5431b9c7ed2638b86e57e0e08ad8dce"
        },
        "permalink": "/r/movies/comments/1qph1lh/kpop_demon_hunters_is_moststreamed_movie_of_2025/"
    },
    {
        "id": "1qq75fj",
        "author": "herequeerandgreat",
        "title": "why brick top is one of the greatest fictional villains ever created.",
        "content": "my second favorite movie of all time is guy ritchie's snatch. it is a film that i am extremely passionate about and one of only a scant few movies that i consider to be perfect. i seriously cannot think of a single flaw that this movie has. the editing, the performances, the writing, it's balance of tone, the characters, the plot, everything is flawless! and one of the big reasons i love it so much is because it features one of my all time favorite fictional villains. brick top!\n\nbrick top is not only in my top 5 favorite movie villains, he's in my top 10 favorite fictional villains of all time. and there are many reasons as to why that is.\n\nfor starters, he perfectly blends being a funny character with genuine menace. he has some of the funniest lines in the entire movie. but, at the same time, the film takes every opportunity to remind you that he's a ruthless gangster. i've never seen a character so funny yet so terrifying.\n\nalso, like i said earlier, he has some of the funniest and best lines in the whole movie. he is one of the fictional characters that i quote most often in my daily life. it's clear to me that guy ritchie had a lot of fun writing brick top's dialogue. \n\nbrick top is also a great example of a character you love to hate. brick top is a piece of shit in every sense of the word. outside of being extremely entertaining to watch, brick top has very few redeeming qualities. and yet, through a combination of good writing and good acting, brick top is a compelling character.\n\noh yes, the acting. how could brick top be one of the greatest villains of all time without a great performer playing him? alan ford isn't a super well known actor but it's clear to me that no one could have played the role of brick top as expertly as him. ford understood the assignment and gave a performance for the ages. he absolutely steals every scene he's in and, like i said earlier, is funny and terrifying at the same time. he manages to steal the show from the bigger names in the cast like brad pitt and benicio del toro. if ford had been nominated for best supporting actor in the 2001 academy awards, the other nominees may as well have not even shown up. in a perfect world, ford would have become a mega star after playing brick top. sadly, i do not live in a perfect world and, as such, ford has remained a gainfully employed character actor but not much else.\n\nall these things combined result in one of the greatest villains ever created. ",
        "upvotes": 130,
        "comments": 80,
        "media": null,
        "permalink": "/r/movies/comments/1qq75fj/why_brick_top_is_one_of_the_greatest_fictional/"
    },
    {
        "id": "1qq4mk3",
        "author": "SanderSo47",
        "title": "National Film Registry Adds ‘The Grand Budapest Hotel’, ‘Karate Kid’, ‘Glory’, ‘Clueless’, ‘The Incredibles’, ‘Inception’, ‘Philadelphia’, ‘The Truman Show’, ‘Before Sunrise’, ‘The Thing’ &amp; More In Latest Class",
        "content": "",
        "upvotes": 162,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1D6t8_iRb53ei_gkRXz8T4CRP1c0Vp6Yjov7N8kY16w.jpeg?auto=webp&amp;s=7e526acee36c1d858d5d5bfbb400c3ca99d7e624"
        },
        "permalink": "/r/movies/comments/1qq4mk3/national_film_registry_adds_the_grand_budapest/"
    },
    {
        "id": "1qq0gxn",
        "author": "BunyipPouch",
        "title": "NBA All Star Steph Curry Wins Top Prize At Sundance Film Festival For Co-Directing Short Film 'The Baddest Speechwriter of All'",
        "content": "",
        "upvotes": 232,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/hfFbtTlVoP9yeNKA4vWa2B_Ht-rhH0fhl23usuRUZrQ.jpeg?auto=webp&amp;s=12f628288297b81471a9e2fc3d22eb2afa4a45f1"
        },
        "permalink": "/r/movies/comments/1qq0gxn/nba_all_star_steph_curry_wins_top_prize_at/"
    },
    {
        "id": "1qpk8wt",
        "author": "BunyipPouch",
        "title": "Live-Action 'Gundam' Film Lands at Netflix - Sydney Sweeney and Noah Centino On Board to Star",
        "content": "",
        "upvotes": 1680,
        "comments": 803,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IJoKQD4hh9FNx6CofdwxIraoM4TL-vfVTfl1CFRSvrM.jpeg?auto=webp&amp;s=e8f4cd2fc6f572f5f25d55deb89c8f063f86bc95"
        },
        "permalink": "/r/movies/comments/1qpk8wt/liveaction_gundam_film_lands_at_netflix_sydney/"
    },
    {
        "id": "1qpchdi",
        "author": "MoneyLibrarian9032",
        "title": "Official poster for Pixar’s next film ‘HOPPERS’ The film follows a girl who transfers her mind into a robotic beaver to help the animals fight the local mayor’s construction plans",
        "content": "",
        "upvotes": 3370,
        "comments": 570,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ec8y4735m3gg1.jpeg?auto=webp&amp;s=ac3ee52f1328d292c356b2b8eaede07862d6e828"
        },
        "permalink": "/r/movies/comments/1qpchdi/official_poster_for_pixars_next_film_hoppers_the/"
    },
    {
        "id": "1qpk4db",
        "author": "sakkkkki",
        "title": "There are movies that are \"timeless.\" What are some movies that are the opposite - as in, harder to appreciate if you weren't around when it came out?",
        "content": "I was inspired to ask this after reading a YouTube comment in which someone said that *Easy Rider* did not \"age well.\"  Instinctively I knew exactly what they meant and I found myself agreeing with that comment.\n\n*Easy Rider* hasn't \"aged poorly\" for the same reasons as, say, *Revenge of the Nerds* (as in, had elements that are blatantly problematic by today's standards).  But what they meant was that it's a movie that is hard to relate to in today's cultural context.\n\nI've also read a Reddit comment that said essentially something similar about *This Is Spinal Tap.*  They essentially said that it is the kind of movie that is much harder to understand if you didn't grow up during the rock era.\n\n**EDIT:**  People, READ MY POST BEFORE YOU ANSWER!  I'm *not* asking about movies that have elements that are offensive by today's standards (like Revenge of the Nerds, Sixteen Candles, Blazing Saddles).  I am asking about movies that are simply hard to relate to for younger viewers because they were very specific to a particular time, place and/or cultural moment.",
        "upvotes": 1306,
        "comments": 1426,
        "media": null,
        "permalink": "/r/movies/comments/1qpk4db/there_are_movies_that_are_timeless_what_are_some/"
    },
    {
        "id": "1qpd177",
        "author": "strychnine-hamburger",
        "title": "Teaser Image For Sony's Mystery-Horror 'Yatsuhaka-Mura', Coming Fall 2026",
        "content": "",
        "upvotes": 1684,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o7ttjrazp3gg1.jpeg?auto=webp&amp;s=b56e0c64cca8fcde266335531b227e1425225a03"
        },
        "permalink": "/r/movies/comments/1qpd177/teaser_image_for_sonys_mysteryhorror/"
    },
    {
        "id": "1qpxpfg",
        "author": "Backstrom",
        "title": "What is a movie that doesn't make a lot of sense, but is still enjoyable because it has heart?",
        "content": "I just researched the movie Be Kind Rewind. None of its plot points make any sense at all. The actual plot is nonsense and it doesn't hold up to any scrutiny. \n\nHowever, the movie is still a great time because the characters and the atmosphere have a ton of heart. It's a feel-good story in a very local environment. The plot points don't seem to matter very much because you're caught up in the emotions. \n\nCan you think of other movies like that?",
        "upvotes": 141,
        "comments": 218,
        "media": null,
        "permalink": "/r/movies/comments/1qpxpfg/what_is_a_movie_that_doesnt_make_a_lot_of_sense/"
    },
    {
        "id": "1qqae2h",
        "author": "Chief_Cthulhu",
        "title": "Godzilla: Final Wars (2004) - Ryuhei Kitamura | Japanese Godzilla vs American Godzilla",
        "content": "",
        "upvotes": 21,
        "comments": 11,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/yo0yh3puvagg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1qqae2h/godzilla_final_wars_2004_ryuhei_kitamura_japanese/"
    },
    {
        "id": "1qq6vbi",
        "author": "Think-Culture-4740",
        "title": "Fargo: Managed to exceed the hype",
        "content": "I must admit, despite being in my early 40s, I somehow missed seeing Fargo. Of course I’ve heard about it and I’m familiar with other Cohen brothers films, but seeing it for the first time made me absolutely slack-jawed at how ridiculously amazing this movie is.\n\nWhat struck me most was how odd the whole setting felt.\n\nI found myself a little depressed in a way because I find I can almost relate to Mr. Lunderguaard a little too much. The constant desire to put up a smiling disarming demeanor even when you are consumed by inadequacy. The depiction also works because he doesn’t look like an obvious loser in terms of physical appearance and his 3 minute elevator first impression actually works until the whole facade just cracks under the weight of his nervous , faltering inadequacy.\n\nThen there’s the two thugs who seem like half brained , yet largely small time crooks who turn out to be utter psychos. The whole car tag scene was just… how is Steve Buschemi going to talk his way out of this..\n\nI almost burst out laughing when he tries to get out of the parking garage with his face blown off and sees the parking attendant.\n\nAnd then of course, that lunch date with Mike… ugh it just brought memories of meeting a stranger and suddenly finding yourself trapped in a “get me out of here before I kill myself” awkward conversation. I’ve unfortunately known plenty of women who have been in that situation.\n\nEven the protagonist- she’s hard to relate to on a personal level which I suppose is the point. Painting her as a female Columbo would probably undermine the film. But the food choices just paint the Midwest in a totally unflattering light.\n\nAnd in that way, it’s such an amazing film given I can’t really find myself relating in a positive way to any of these character. I sadly will take away from this film that it’s unhealthy to the point of depressing to keep smiling your way through relationships that are not healthy.",
        "upvotes": 28,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1qq6vbi/fargo_managed_to_exceed_the_hype/"
    },
    {
        "id": "1qpd29k",
        "author": "ninman5",
        "title": "What are some myths about guns that were created by the movies?",
        "content": "For example, movies tend to show people hiding behind almost any object being safe from gunfire, especially inside cars or behind tables. In reality, neither of those will protect you from most guns.\n\nAnother is that shooting petrol makes it explode.  Again, that's been shown to be pretty much impossible. \n\nI think my favourite is that if a bullet hits pretty much any metal object, it will be deflected by it.\n\nWhat are some others?",
        "upvotes": 1245,
        "comments": 1646,
        "media": null,
        "permalink": "/r/movies/comments/1qpd29k/what_are_some_myths_about_guns_that_were_created/"
    },
    {
        "id": "1qpmt3a",
        "author": "TechnicLePanther",
        "title": "Brazil (1985) Dir. Terry Gilliam - Masked government agents break into a home and kidnap a father of two without explanation",
        "content": "",
        "upvotes": 421,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dyKqLx-XLTj0qGtQJA1P2i8fW9NGx1BNSa7gCYl1qhs.jpeg?auto=webp&amp;s=9aab8d3e2dd42d1798a6973c44af3b04c76afc52"
        },
        "permalink": "/r/movies/comments/1qpmt3a/brazil_1985_dir_terry_gilliam_masked_government/"
    },
    {
        "id": "1qqdeoj",
        "author": "littlemissy145",
        "title": "Disaster Movies",
        "content": "Currently on the East Coast with -20 degree temp and no plans to go out any time soon, so thought Day After Tomorrow was the correct choice of film to watch! Now I have a craving for more; got 2012 all set up but what other natural disaster movies can I add on my list? \n\nNew or old I’m open to ideas! ",
        "upvotes": 10,
        "comments": 29,
        "media": null,
        "permalink": "/r/movies/comments/1qqdeoj/disaster_movies/"
    },
    {
        "id": "1qpnfyo",
        "author": "BoFlix",
        "title": "'My 117th Time In This Diner' | First official clip from GOOD LUCK, HAVE FUN, DON'T DIE | In Theaters February 13",
        "content": "",
        "upvotes": 346,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/D1zoOWbxK-hYBMqD3D_Vjoq0mLEI5szZe8Ye3g3uY3o.jpeg?auto=webp&amp;s=6e1a46c4db37fe776c9e2ebdb412b7a7b67bf3f0"
        },
        "permalink": "/r/movies/comments/1qpnfyo/my_117th_time_in_this_diner_first_official_clip/"
    },
    {
        "id": "1qpm15i",
        "author": "BunyipPouch",
        "title": "‘Phoenician Scheme’ Breakout Star Mia Threapleton Joins Upcoming Prison Film from Director Damien Chazelle ('La La Land', 'Babylon') - Also Starring Cillian Murphy, Daniel Craig, and Michelle Williams",
        "content": "",
        "upvotes": 368,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tfa7uDI_9AZ8j8hLgCF56dD_hrcHeZjmOTQy3LtkU_s.jpeg?auto=webp&amp;s=d9c3da7f15f516ee3f7d9aae20824b4109e8df49"
        },
        "permalink": "/r/movies/comments/1qpm15i/phoenician_scheme_breakout_star_mia_threapleton/"
    },
    {
        "id": "1qpqf73",
        "author": "BunyipPouch",
        "title": "Oscar Nominee Ethan Hawke To Receive Santa Barbara Film Festival Career Achievement Award",
        "content": "",
        "upvotes": 213,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ec10cXogTHuFfnycVOHtqdCkU05PMyh7tQDn46s3qTA.jpeg?auto=webp&amp;s=08632f9baa148de1c89b2c399c30d8d2db84d499"
        },
        "permalink": "/r/movies/comments/1qpqf73/oscar_nominee_ethan_hawke_to_receive_santa/"
    },
    {
        "id": "1qpis3x",
        "author": "BunyipPouch",
        "title": "First Poster for IFC's Folk-Horror 'Dolly' - Macy, a young woman, is abducted by a monstrous figure intent on raising her as their own child.",
        "content": "",
        "upvotes": 376,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3midetg6q4gg1.jpeg?auto=webp&amp;s=7e44f03823c038784e84d62657179562635c606e"
        },
        "permalink": "/r/movies/comments/1qpis3x/first_poster_for_ifcs_folkhorror_dolly_macy_a/"
    },
    {
        "id": "1qp8lpw",
        "author": "zsreport",
        "title": "The punk rock movie that taught a generation of girls not to put out: The reissue of \"Ladies and Gentlemen, the Fabulous Stains\" reclaims the film as a precursor to riot grrrl",
        "content": "",
        "upvotes": 1164,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MWauSuuug3VbMYbVbNlAhuII4oYmI-FTPj1aX2LtnhE.jpeg?auto=webp&amp;s=72bc483b721cc4596a7aa86a95f0dadfeb8e4b30"
        },
        "permalink": "/r/movies/comments/1qp8lpw/the_punk_rock_movie_that_taught_a_generation_of/"
    }
]