[
    {
        "id": "1lzz8vz",
        "author": "Pinchus121",
        "title": "I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix and host of the Naked Lunch podcast. I travel the world eating incredible food and talking to even more incredible people. Let’s dish! AMA.",
        "content": "Hi Reddit! I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix, and host of the Naked Lunch podcast with my good friend David Wild. I’ve spent the last several years traveling the globe with a fork in hand, trying to prove that the best way to connect with people is through good food and a lot of laughs. Season 8 of Somebody Feed Phil is now streaming on Netflix and we’re serving up new episodes of Naked Lunch every week wherever you get your podcasts, including chats with legends like Jane Fonda, John Stamos, Allison Janney, and so many more!  \n  \nGot questions about the best food cities, behind-the-scenes stories from the road (or the sitcom world), or where I stand on pineapple on pizza? I’m all yours!  \n  \nLet’s eat and chat.  \n  \nPhil  \nu/Pinchus121\n\nhttps://preview.redd.it/4k4qn42nrwcf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=19b27cd4f54858b592249a41b78424ec7203a1e5\n\n\n\n&gt;Thanks everyone for joining in! Be sure to check out Season 8 of Somebody Feed Phil now on Netflix and listen to new episodes of my podcast \"Naked Lunch\" every week!",
        "upvotes": 92,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1lzz8vz/im_phil_rosenthal_host_of_somebody_feed_phil_on/"
    },
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1m68qbt",
        "author": "Legal-Mood-3526",
        "title": "Trainwreck: PI Moms",
        "content": "Anyone else feel kinda unfulfilled by this? Maybe it’s bc I based my expectations on poop cruise where they dedicated way too much time to the most useless details, so I thought this would be longer. I knew nothing about this case beforehand so I was very excited by the premise, but it seemed very rushed and I thought more would happen. \n\nThe story seemed quite interesting in the trailer but everything unfolded in the last 20 mins… def feel like they cut out a lot of info. I would have loved to get an extended version of this. Thoughts? ",
        "upvotes": 16,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1m68qbt/trainwreck_pi_moms/"
    },
    {
        "id": "1m6e7he",
        "author": "ToonAdventure",
        "title": "NEW Pokémon Concierge Episodes 🏝️ | Coming September 4 to Netflix | Official Trailer",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6e7he/new_pokémon_concierge_episodes_coming_september_4/"
    },
    {
        "id": "1m6f7ho",
        "author": "hpff_robot",
        "title": "Rivers of Fate | Official Trailer | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m6f7ho/rivers_of_fate_official_trailer_netflix/"
    },
    {
        "id": "1m6axnb",
        "author": "sky3cabe",
        "title": "Any zombie movie recommendations?",
        "content": "Ok I can't find other zombie movies bc I feels like I already watched them all(idk whenever I search zombie, they always appear the one I already watched). So do u guys have any zombie movie recommendations? I only want movies not series since I don't have time to invest in the series. Also I prefer if its English, Korean or Japanese movie(since I understand the language).\n\nThanks in advanced😊\n\nEdit: just tell the movie u hv in mind n I'll reply if I already watch it or not. Thank you again ☺️",
        "upvotes": 6,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1m6axnb/any_zombie_movie_recommendations/"
    },
    {
        "id": "1m5ghm8",
        "author": "Longjumping_Land_977",
        "title": "What do you guys think of the ‘photos’ of Amy Bradley found in 2005?",
        "content": "Could they be her? I personally think they are, which must be truly awful for her family. It’s so sad the FBI couldn’t look into this more and that it’s been dropped. ",
        "upvotes": 335,
        "comments": 684,
        "media": null,
        "permalink": "/r/netflix/comments/1m5ghm8/what_do_you_guys_think_of_the_photos_of_amy/"
    },
    {
        "id": "1m5dw1j",
        "author": "waynejohnson1985",
        "title": "A Netflix original that completely exceeded your expectations?",
        "content": "I just finished watching *The Platform* and honestly went in without expecting much. Maybe just another dystopian thriller. But wow, it completely blew me away. The concept was so unique, and the social commentary was intense without feeling forced. I didn’t think it would stick with me the way it did, but days later I’m still thinking about it.\n\nHave any of you had a similar experience with a Netflix original that really surprised you (in a good way)? Would love to hear your picks.\n\n",
        "upvotes": 499,
        "comments": 437,
        "media": null,
        "permalink": "/r/netflix/comments/1m5dw1j/a_netflix_original_that_completely_exceeded_your/"
    },
    {
        "id": "1m65h0s",
        "author": "hygge6",
        "title": "Not the horse 😭😭(Untamed)",
        "content": "The saddest part was Shane shooting Kyle’s horse 😭😭😭😭 but for real, animal deaths in tv/film always get me no matter how inconsequential they seem. Anyone else?",
        "upvotes": 11,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m65h0s/not_the_horse_untamed/"
    },
    {
        "id": "1m6i9g7",
        "author": "Zealousideal_Map5074",
        "title": "Is Mask Girl (2023) worth watching?",
        "content": "I clicked play just because the banner looked cool, the genre is thriller and my favorite actor Lee Jun‑young is in it. Someone on Reddit told me it’s a thriller with plot twists, which got me interested. But before I go in too deep, is this a slow burn?\n\nI usually get bored if a show takes too long to get to the point, so I’d love to know what to expect.",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1m6i9g7/is_mask_girl_2023_worth_watching/"
    },
    {
        "id": "1m6f7sq",
        "author": "Atlast_2091",
        "title": "Pokémon Concierge Season 2 | New Episodes Trailer | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6f7sq/pokémon_concierge_season_2_new_episodes_trailer/"
    },
    {
        "id": "1m6f261",
        "author": "Establishment240",
        "title": "What's the ethereal song playing at 23:30 of the first episode of The Diamond Heist ?",
        "content": "What's the ethereal song playing at 23:30 of the first episode of The Diamond Heist ?   \n\nThanks :) Would be so cool if somebody could tell me. I would be very grateful :)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6f261/whats_the_ethereal_song_playing_at_2330_of_the/"
    },
    {
        "id": "1m6eob9",
        "author": "aman_attar",
        "title": "Netflix on MacOS 2K Monitor",
        "content": "I recently treated myself to a gorgeous **2K monitor**, excited to finally watch movies and shows in crisp detail. But when I fired up **Netflix on Safari**, the picture looked... well, **awful**. Blurry, pixelated — nothing close to the HD experience I expected. 😩\n\nI double-checked my internet (blazing fast), display settings (perfect), and even tried different shows. Same fuzzy quality.\n\nThat led me down a **deep rabbit hole** of research, developer tools, hidden settings, and overrides. After hours of experimenting and tweaking, I finally found a **clean, repeatable way** to unlock Netflix’s **high bitrate playback** in Safari.\n\nIf you're also stuck with pixelated Netflix on your Mac and 2K display, here's the solution that worked wonders for me 👇\n\n# ✅ Step 1: Enable Developer Features in Safari\n\n1. Open Safari and go to **Settings &gt; Advanced**.\n2. At the bottom, check ✅ **“Show features for web developers.”**\n\n📸 *\\[Image 1\\]*\n\n[Image 1](https://preview.redd.it/h6qhgbuckfef1.png?width=1896&amp;format=png&amp;auto=webp&amp;s=3232cdb46955a14e5a13688e5f0a746f05ff28d9)\n\n# 🔓 Step 2: Disable Cross-Origin Restrictions\n\n1. From the top menu bar, click **Develop &gt; Developer Settings**.\n2. Under “Security,” check ✅ **Disable cross-origin restrictions**.\n\n📸 *\\[Image 2\\]*\n\n[Image 2](https://preview.redd.it/6zxqz5bgkfef1.png?width=1896&amp;format=png&amp;auto=webp&amp;s=9b982357b15b42ef078eb83cb2208bbff8dd9312)\n\n# 📥 Step 3: Download the Player Script Override\n\nDownload this custom script that overrides Netflix’s default playback behavior:  \n👉 [**cadmium-playercore-shim.js (GitHub)**](https://github.com/DavidBuchanan314/Turbo-Recadmiumator/blob/master/src/cadmium-playercore-shim.js)\n\nThis lets you **manually select the highest available bitrate** for each video.\n\n# ▶️ Step 4–9: Override Netflix’s Video Script\n\n1. **Play** any Netflix video.\n2. Go to **Develop &gt; Show Page Source**.\n3. In the **Sources** tab, look for the file named like `cadmium-playercore-*.js`. 📸 *\\[Image 3\\]*\n\n[Image 3](https://preview.redd.it/amwu29elkfef1.png?width=598&amp;format=png&amp;auto=webp&amp;s=5c1e03f0048074721b4d4a11f2590347bc7c92e1)\n\n**4. Right-click** the file and choose **“Create Response Local Override.”**\n\n5. Then click **“Map to File”** and choose the downloaded script.\n\n**6. Refresh** the Netflix tab.\n\n7. A new bitrate selector UI will appear. 📸 *\\[Image 4\\]*\n\n[Image 4](https://preview.redd.it/8iw7fx3skfef1.png?width=4832&amp;format=png&amp;auto=webp&amp;s=bc7a3603036450de6708a1f4c63cc2aadd8a4641)\n\n8. Hit **“Override”** and enjoy **buttery-smooth, sharp video**.\n\n# 🔁 Step 10: Repeat on Every Safari Restart\n\nSafari clears overrides after closing. So you'll need to repeat steps 4–9 each time you reopen Safari. It takes \\~30 seconds once you're used to it.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m6eob9/netflix_on_macos_2k_monitor/"
    },
    {
        "id": "1m6ctp2",
        "author": "LucyLovesApples",
        "title": "Netflix viewing count",
        "content": "When they do the highest watched film/Show chart are they accurate? I’ve read several articles that Netflix often says it’s the highest show but in actual fact it is not and that they’re saying this to boost ratings. ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m6ctp2/netflix_viewing_count/"
    },
    {
        "id": "1m624wl",
        "author": "PuzzleheadedKiwi7107",
        "title": "I have some questions when Netflix still mailed discs",
        "content": "When Netflix used to mail discs, specifically from 2015-2023, were the discs just of the show/movie or were they like actual discs with bonus features and everything?\n\nThis is a weirder question and if no one knows, that's perfectly okay. How specifically did you order these discs? Was it a separate site? Were there any hoops you had to jump through?\n\nDid any one of you rent The Adventures of Puss in Boots (2015)? If so, did it have the bonus features in the image? If any of you still have the discs (DVD or blu ray), would you be willing to sell them to me?\n\nhttps://preview.redd.it/i7mqedqy4cef1.jpg?width=6141&amp;format=pjpg&amp;auto=webp&amp;s=3202c55dd884d5d3bb8ff2adbc2791de9129aa3d\n\n",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m624wl/i_have_some_questions_when_netflix_still_mailed/"
    },
    {
        "id": "1m65uzc",
        "author": "Plazmashock",
        "title": "PLEASE recommend me show or a movie that has epic metal soundtracks and songs",
        "content": "Hi all\n\nJust bought Netflix subscription and I'm really enjoying it so far. Devil may cry was one of the first shows i watched and the soundtrack for intro or battles were amazing and i loved it.\n\nPlease recommend shows where there are epic battles while heavy metal music is playing in the background.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m65uzc/please_recommend_me_show_or_a_movie_that_has_epic/"
    },
    {
        "id": "1m67qt6",
        "author": "photoshop_2023",
        "title": "Now allowed to download",
        "content": "I wanted to download one of episodes from Seinfeld and i got an error message saying i'm not allowed to download this for the rest of the year. Does anyone know whats going on?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m67qt6/now_allowed_to_download/"
    },
    {
        "id": "1m5fu0v",
        "author": "HoneyBootyCakes",
        "title": "“Untamed” either I’m missing something here or it’s just that terrible.",
        "content": "Okay so the show is predictable at best but there are some strange dead ends that I’m just not understanding if someone could explain please. Okay, so what happened to the female cop’s husband/child’s father? There was some strange back story where he needed her to lie for him, he was stalking her. I felt like there was this big build up that ultimately just was him going to jail with no resolution really. Also, in the beginning when the woman falls off the cliff, the police were back and forth about if she was already dead before she fell or not but we could clearly see she was dead. She also had some animal tear up her knee after she had been shot. When they finally showed the chain of events, it showed her getting shot, but no animals attacking her. It only showed her “jump” off the cliff. So, she wasn’t dead? She committed suicide? Another thing, they made it seem like the man that was showing up to see the girl was this creepy ominous guy who she trusted. The way they showed him opening her bedroom window made it seem like he was going to hurt her. Idk, this show felt like the audience was being lead in different directions with no real “ah ha moment” or pay off. oh and, the whole drug ring side plot was incredibly unnecessary in my opinion too. ",
        "upvotes": 80,
        "comments": 76,
        "media": null,
        "permalink": "/r/netflix/comments/1m5fu0v/untamed_either_im_missing_something_here_or_its/"
    },
    {
        "id": "1m6agjx",
        "author": "jumpman3x",
        "title": "Do You Think Blockbuster Would Have Become Netflix If They Accepted Reed Hastings’ Offer?",
        "content": "Apparently Reed Hastings and Marc Randolph offered to sell to Blockbuster back in 2000. Their pitch was that they would handle their streaming division. Would Blockbuster have become what Netflix is today if that happened?",
        "upvotes": 1,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1m6agjx/do_you_think_blockbuster_would_have_become/"
    },
    {
        "id": "1m630jl",
        "author": "Choice-Macaron-276",
        "title": "i love netflix CCs!",
        "content": "i just think it's so great how when characters are speaking important dialogue in another language (other than the selected language for CCs) you don't actually bother to translate the dialogue to the selected CC language and transcribe it, but instead, just add a lovely \"[speaking &lt;language&gt;]\" caption. it's both wonderfully helpful as a viewer to know that the characters from [foreign country] are speaking [foreign language], and really leaves a lot to the imagination!! ❤️❤️❤️❤️❤️❤️\nalso, i'm sure your primary shareholders must love the extra points on your stock price gained by not wasting any resources on translating stuff and transcribing it for the CCs.\ni sure hope that netflix will be around for many, many years to come, and will never be replaced by some other newer/better streaming service (e.g. the way myspace was replaced by facebook).\nexcellent work! three cheers for netflix! yayayay! 🥳🎉🎈🎊😃",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m630jl/i_love_netflix_ccs/"
    },
    {
        "id": "1m650gb",
        "author": "RavenThePerson",
        "title": "Shows randomly skip forward and audio cuts out",
        "content": "Over the last couple weeks shows will randomly skip forward 20-50 seconds and all audio cuts out for 15 ish seconds or until I skip, has anyone been getting this and maybe know a fix? It’s happened on my rogers cable box and on my sisters smart tv (not sure of the brand)",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m650gb/shows_randomly_skip_forward_and_audio_cuts_out/"
    },
    {
        "id": "1m60av0",
        "author": "SativaStrong",
        "title": "Why Doesn’t Netflix Auto-Show Subtitles for Non-English Dialogue?",
        "content": "I'm watching Mr. Robot, and I’ve noticed that whenever characters speak a foreign language like Mandarin, the subtitles don’t automatically appear. I have to manually turn subtitles on, which is pretty inconvenient. Shouldn’t the show automatically display subtitles for non-English dialogue? Is there a way to fix this without constantly turning subtitles on and off?",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m60av0/why_doesnt_netflix_autoshow_subtitles_for/"
    },
    {
        "id": "1m5b559",
        "author": "mschiie",
        "title": "Just started Peaky Blinders… why didn’t anyone shake me sooner?!",
        "content": "As in… wow. I feel robbed for not watching this sooner.\nPeaky Blinders is everything I want in a show sharp, intense, stylish, and full of bite.\nEvery scene feels cinematic, the pacing is tight, and the characters? Complex AF.\n\nIt’s not just a gangster show it’s about trauma, ambition, and power plays wrapped in designer suits and razor hats.\nCillian Murphy eats every scene. The soundtrack? Chef’s kiss.\n\nIf you’re into smart, gritty crime dramas like Breaking Bad, Boardwalk Empire, or Narcos this is your next obsession.\n10/10. No notes.\n",
        "upvotes": 102,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1m5b559/just_started_peaky_blinders_why_didnt_anyone/"
    },
    {
        "id": "1m60s0f",
        "author": "Visible_Star_7783",
        "title": "Anyone watched wall to wall yet?!",
        "content": "What a movie! It’s Korean film about a guy who invests everything into an apartment that has noisy neighbours but all the neighbours are complaining about the same noise blaming each other. It gets really good and if you have been in a real situation like I have with noisy neighbours the movie hits different. Very good film! Recommend ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m60s0f/anyone_watched_wall_to_wall_yet/"
    },
    {
        "id": "1m6gsfe",
        "author": "JustToKnow_",
        "title": "Why Netflix always cancels good TV shows !!!??",
        "content": "I have been in my summer break for the past 2 months, it had been pretty boring I thought I would Watch Netflix for some days, I gave it a go and watched many Series and MAN the number of good SERIES it cancelled, it breaks my heart so muchhhh, here's the list -\nFate: The Winx saga,\nSense 8,\nThe recruit, \nShadow and bone, \nAnne with an E, \nThe society, \n1899,\nMindhunter,\nGLOW,\nAltered Carbon,\nArchive 81,\nWarrior Nun,\nI am not Okay with this,\nChilling adventures of Sabrina,\nDeas Boy detectives, \nThe OA,\nLockwood &amp; Co, \nResident Evil (2022),\nFirst Kill,\nThe order,\nThe punishers,\nThe Imperfects,\nI mean though Netflix has given us some bangers like Strangers Things, Dark, You, Ozark, Alice in Borderland, Squid Game etc. but cmmon man if Netflix would Have not cancelled the shows....I don't know why Netflix does that whyyyyy????despite having good viewership, loved by critics and fans...\n",
        "upvotes": 0,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1m6gsfe/why_netflix_always_cancels_good_tv_shows/"
    },
    {
        "id": "1m4pyf9",
        "author": "AustinBaze",
        "title": "Stop Asking Me \"Who's Watching?\" Dammit.",
        "content": "[Please Stop Asking](https://preview.redd.it/vdi33l6te1ef1.jpg?width=890&amp;format=pjpg&amp;auto=webp&amp;s=efe046b37cc706f4349d0958c889462ec978c8f4)\n\nSingle, no kids.  There is only one Netflix profile.  There is only one subscriber. There has only ever been ONE profile and one subscriber. Ever.   \nThere has only been answer ever to this question for the 10 years or so you have been asking it.  I'm bored with it, are you Netflix?   \n",
        "upvotes": 1187,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1m4pyf9/stop_asking_me_whos_watching_dammit/"
    },
    {
        "id": "1m63p8m",
        "author": "Scmomof4",
        "title": "Netflix buffering issue across devices?",
        "content": "In the last few weeks we have been seeing this issue increase and it’s getting super annoying - we’ll be watching a show and randomly the loading/buffering symbol and 0% pops up and nothing happens. It just sits there on 0% until we back out to the menu and reopen the show. This happens on our LG tv, our Samsung tv, and two different Xbox series X consoles. We’ve tried deleting the app and reinstalling it on our main LG tv and one Xbox, and are still having repetitive issues. The only thing that has changed was that I downgraded from premium to standard without ads, but I haven’t seen any reported issues regarding that. Also, my internet wifi is a steady 400mbps+ and Netflix is the only app that does this, so it’s not an internet problem. Anyone have any advice or tips to try to solve this problem?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m63p8m/netflix_buffering_issue_across_devices/"
    },
    {
        "id": "1m66f2u",
        "author": "Naive-Gas9553",
        "title": "Can’t watch Netflix in portrait mode on iphone?",
        "content": "I really want to watch Netflix in bed on my phone but it automatically goes to landscape mode. I find it difficult to hold my phone sideways while laying down. Is there really no hack to get it into portrait mode? I tried everything. Even looked for apps that can do this for me. Even restarted phone. And yes, rotate lock is off lol\n\nSeems ridiculous of them not to allow it ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m66f2u/cant_watch_netflix_in_portrait_mode_on_iphone/"
    },
    {
        "id": "1m5wlla",
        "author": "leigh_098",
        "title": "Confused about Vis a Vis (Locked up) Season 2 Ep 1 Did I miss something?",
        "content": "I just finished watching Locked Up (Vis a Vis) Season 1 and I'm a bit confused jumping into Season 2. From what I know, Season 1 has 11 episodes. The last scene I watched was Zulema trying to escape by setting herself on fire, the Egyptian getting caught by Macarena's dad, and then her dad having a heart attack. Macarena’s brother was going to the house like the dad told him.\n\nBut when I started Season 2 Episode 1, it suddenly shows Zulema escaping with Macarena, like they’re working together now?? It feels like I missed something in between. Was there a special episode or recap I skipped? Can anyone explain the jump or what I should know before continuing?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m5wlla/confused_about_vis_a_vis_locked_up_season_2_ep_1/"
    },
    {
        "id": "1m5vvt4",
        "author": "Total_Maybe_4945",
        "title": "Squatch",
        "content": "I'm looking for this Movie that was on Netflix about a man who sets out to walk the Great divide solo after losing his wife to cancer also encounters possible Sasquatch noises.\n\"NOT starring Robert Redford\" \n\n\nI can't seem to find it but it had been on Netflix late last year or early this year.... Thanks",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m5vvt4/squatch/"
    },
    {
        "id": "1m5mx82",
        "author": "Intelligent-Quit9226",
        "title": "I highly recommend the Red Riding Trilogy (1974, 1980 and 1983). Anyone else a fan?",
        "content": "I’ve watched them a couple of times a year since they were first on TV. Top notch cast, fantastic production design and cinematography. Part 2 (1980) is probably my favourite as I love a bit of Paddy Considine.",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m5mx82/i_highly_recommend_the_red_riding_trilogy_1974/"
    },
    {
        "id": "1m5otrh",
        "author": "ZackaryAsAlways",
        "title": "Happy Gilmore meal with exclusive cup at Subway",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m5otrh/happy_gilmore_meal_with_exclusive_cup_at_subway/"
    }
]