[
    {
        "id": "1ntdz4q",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 17,
        "comments": 3284,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ntdz4q/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1nulopj",
        "author": "soccer-stats",
        "title": "Post Match Thread: Kairat vs Real Madrid",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1nulopj)",
        "upvotes": 135,
        "comments": 173,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nulopj/post_match_thread_kairat_vs_real_madrid/"
    },
    {
        "id": "1nwr4k9",
        "author": "Omkarop_06",
        "title": "Take care of our little Maestro, AC Milan.",
        "content": "",
        "upvotes": 221,
        "comments": 9,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/06urv3xs6usf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nwr4k9/take_care_of_our_little_maestro_ac_milan/"
    },
    {
        "id": "1nwbydi",
        "author": "chunchunmaru1129",
        "title": "No way this is true 😭",
        "content": "",
        "upvotes": 1475,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qouj5mpusqsf1.jpeg?auto=webp&amp;s=7a219a9aeeaa3ef5d92aca63605afe59a10d7361"
        },
        "permalink": "/r/realmadrid/comments/1nwbydi/no_way_this_is_true/"
    },
    {
        "id": "1nwi0j0",
        "author": "FrrancondonaEra",
        "title": "Arda isn't an ordinary player, this is football sorcery",
        "content": "",
        "upvotes": 580,
        "comments": 54,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/11jixgnqxrsf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nwi0j0/arda_isnt_an_ordinary_player_this_is_football/"
    },
    {
        "id": "1nwppkh",
        "author": "GoEzGetafix",
        "title": "Real Madrid x Taylor Swift",
        "content": "Taylor Swift casually name-dropping Real Madrid… I can’t decide if that’s iconic or just surprising. On one hand, it’s wild to hear a global pop superstar reference the most legendary football club ever. On the other, I’m honestly not sure what the real significance of this unexpected crossover even is. What do y’all think?",
        "upvotes": 143,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cwvze0qyrtsf1.jpeg?auto=webp&amp;s=1b07bd56e5b8b65bdebca41703d0bf1a950d8c98"
        },
        "permalink": "/r/realmadrid/comments/1nwppkh/real_madrid_x_taylor_swift/"
    },
    {
        "id": "1nwfvq1",
        "author": "Messmers",
        "title": "Arda Güler under Xabi Alonso so far (by @_Wangster)",
        "content": "",
        "upvotes": 196,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tk8r12ynirsf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nwfvq1/arda_güler_under_xabi_alonso_so_far_by_wangster/"
    },
    {
        "id": "1nwaato",
        "author": "No-Independent2522",
        "title": "150 wins for Ceballos",
        "content": "",
        "upvotes": 336,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/90gfy1t1iqsf1.jpeg?auto=webp&amp;s=6a6b726f28ef04b6447765a25f184e820efc6842"
        },
        "permalink": "/r/realmadrid/comments/1nwaato/150_wins_for_ceballos/"
    },
    {
        "id": "1nwr08t",
        "author": "pronick786",
        "title": "Elite ball knowledge required",
        "content": "",
        "upvotes": 25,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ip8mevef5usf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nwr08t/elite_ball_knowledge_required/"
    },
    {
        "id": "1nw8poo",
        "author": "ace-s",
        "title": "Similar to Mbappe, Jude is a generational player and alot of people have forgotten that",
        "content": "Right now Mbappe and Arda seem like the only 2 players who have been consistent enough to be undisputed starters. \n\nXabi needs to find his XI, I know he likes to rotate alot but we need an XI for big games. \n\nWe really need to integrate Jude into the system. I feel people forget how amazing he is. In his first season he was a top3 player in the world. In his second season, his form fell of for 2 reasons, he played the entire season injured and the season was a shitshow. \n\nI really feel that we should try him as a CF role. The Benz and dembele role. IMO, it was his best role in his first season here. \n\nWe should try putting Mbappe as a LW or along side Jude as a second forward, and Arda behind them. Jude will also allow us to score goals from headers.",
        "upvotes": 173,
        "comments": 68,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nw8poo/similar_to_mbappe_jude_is_a_generational_player/"
    },
    {
        "id": "1nwcerw",
        "author": "EndouShuuya",
        "title": "🥶 Cool as you like.🧊",
        "content": "",
        "upvotes": 93,
        "comments": 8,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/051qw9nqvqsf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nwcerw/cool_as_you_like/"
    },
    {
        "id": "1nvyg3n",
        "author": "Kalpesh_K",
        "title": "Trent Alexander Arnold they can never replace you.",
        "content": "",
        "upvotes": 541,
        "comments": 77,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jqr7v3dwvnsf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nvyg3n/trent_alexander_arnold_they_can_never_replace_you/"
    },
    {
        "id": "1nwr7ow",
        "author": "kyleyle",
        "title": "Attending 1st game vs Villarreal",
        "content": "I’m visiting from Canada and want to take this great opportunity to see my first live match. I’ll likely be buying the cheap tickets in the 600s section, in the middle. \n\nI want to wear some gear. Scarfs and jersey. I’m assuming there are vendors outside selling these? Are they real? \n\nTips on staying safe getting back to my hostel after the match? I am near the Palacio. \n\nAnd chants and cheers! Where can I find a guide? Thanks!",
        "upvotes": 8,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nwr7ow/attending_1st_game_vs_villarreal/"
    },
    {
        "id": "1nw0vo4",
        "author": "Nyghl",
        "title": "Bellingham and Camavinga isn't our creative outlet.",
        "content": "This doesn't make them bad. They are both GREAT in a lot of other aspects. They are really great players. But I always keep seeing comments like \"Cama should take Arda's place, him and Bellingham are creative players too! We don't need Arda for *just* creativity.\" but that's simply not true.\n\nIf you look at the key passes and chances created stats, it is not even close and I wanted to share that.  \nArda already has the same amount of key passes as Camavinga or Tchouameni last season or for big chances, he even matched Bellingham's last season LaLiga performance which is crazy to do this early.  \n  \nThis boy has been a fresh breath of air and made a big shift in our team. And thanks to Dean Huijsen's addition + Xabi's new system and coaching, we can better direct plays, create LOTS OF MORE chances and overall we just play better. Unless someone more creative comes, I don't see Arda being dropped for anyone in the current squad. He is the key glue of our team in terms of connecting the midfield to attack right now.\n\nI also feel like Bellingham and Arda will compliment each other really well and play together. Even though it wasn't good the last match we did that, I think that was just Bellingham coming out of injury a bit early and not being in form.",
        "upvotes": 215,
        "comments": 86,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nw0vo4/bellingham_and_camavinga_isnt_our_creative_outlet/"
    },
    {
        "id": "1nwdw7d",
        "author": "EndouShuuya",
        "title": "✨Brahim✨Beautiful Goal!",
        "content": "",
        "upvotes": 43,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/c4g51n9s5rsf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nwdw7d/brahimbeautiful_goal/"
    },
    {
        "id": "1nw0inu",
        "author": "Ready_Ad_1353",
        "title": "Champions League table after Matchday 2",
        "content": "",
        "upvotes": 201,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9ahjqhrliosf1.png?auto=webp&amp;s=430ac567c561574e9271a731432de934ed7e5f56"
        },
        "permalink": "/r/realmadrid/comments/1nw0inu/champions_league_table_after_matchday_2/"
    },
    {
        "id": "1nw6ell",
        "author": "KjOnReddit1010",
        "title": "🚨🇪🇺 UEFA release Team of the Week for Champions League Matchday 2! 🔝\n\nPlayer of the Week: Kylian Mbappé. 🇫🇷",
        "content": "",
        "upvotes": 71,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nw6ell/uefa_release_team_of_the_week_for_champions/"
    },
    {
        "id": "1nw213x",
        "author": "HighWoo",
        "title": "Hala Madrid ! 🏆🏆🏆🏆🏆🏆",
        "content": "",
        "upvotes": 122,
        "comments": 7,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dg290v6kwosf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nw213x/hala_madrid/"
    },
    {
        "id": "1nwfddz",
        "author": "ReplacementUnited740",
        "title": "I have a statistic: Since arriving at Real Madrid, vini has won twice as many trophies as Barça.",
        "content": "This was the stats to remind you of the good times, have a good day and hala Madrid \n\nIt also works with Courtois ,Rodrygo , lunin and Brahim \n\n(I have to completely edit the post to make it 300 words.)\nDo you also feel like it's been an eternity since we won a title? Not because it's been a year, but because we're not ready to become the best team in the world again.\nAnd I'm not saying this because I don't believe in Xabi, but what he imagines is so ambitious that it could take at least 2-3 years or at least until he has a real preparation during the offseason with his team",
        "upvotes": 25,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nwfddz/i_have_a_statistic_since_arriving_at_real_madrid/"
    },
    {
        "id": "1nw4k5l",
        "author": "123kallem",
        "title": "Comparing the reaction from this Atletico loss to the one from 2 years ago shows how reactionary you guys are when we lose.",
        "content": "Our current season has been incredibly similar to the 23/24 one, we had won every single game, until matchday 6, where we played Atletico, and we lost 3-1 mostly due to headers and Alaba dropping a stinker, and our only goal being a Kroos banger, which sounds very similar to this game, where Huijsen (A lot of people seem to forget that he absolutely should've won the ball on the 2-2 goal) and Carreras dropped a stinker. And as you guys remember, that ended up being our only loss for that entire fucking league campaign, and we went on to win the CL aswell.\n\n\n\nAs you can read in the post match threads, both in [our sub](https://www.reddit.com/r/realmadrid/comments/16r8p8n/post_match_thread_atl_madrid_vs_real_madrid/?sort=top) and on the [soccer](https://www.reddit.com/r/soccer/comments/16r8o1k/post_match_thread_atletico_madrid_31_real_madrid) sub reddit, the reactions in that season are incredibly similar to what it is right now. And the ''complaints'' that a lot of people had in the 23/24 season are very similar to what we complain about now aswell. Back then, it was about how we didn't sign a Benzema replacement, and now it's how we didn't sign a Kroos replacement.\n\n Let me tell you a few reactions in the post match threads from both the game from 2 years ago and the game from last week:\n\n1: **''If a vulgar team like Atletico can make us look like clowns, I can’t imagine what it will be like once we face the giants of Europe. We are a significantly worst team than the last two years.''**\n\n2: **''it's gonna be a long painful season, buckle up boys''**\n\n\n3: **''This Real team is pretty damn average. Another la liga to Barca.''**\n\n4: **''Three headers scored. Hard to imagine future opponents not pinging crosses in after that defensive performance.''**\n\n5: **''What a fucking embarrassment. Did we win a single aerial ball??? What a joke.''**\n\n6: **''We lost every aerial duel when they crossed, we had no ideas against their bus parking, every of their through balls got through and defense was way to slow to stop them and our mentality was literally not existent. Our defense lost this game.''**\n\n7: **''We need to trade Vini and rodrygo for Haaland.''**\n\n8: **''First big game of the season and Real Madrid already exposed.''**\n\n9: **''Well, guess thats another La Liga we're handing to Barca, again, see you next season''**\n\n10: **''We're so shit and I'm glad we're getting exposed for it. This team needs some serious re-thinking and re-grouping. I bet my left kidney we won't make it out the RO16.''**\n\nI challenge anyone to pinpoint which of these comments are about the 23/24 game, and which is about the game from last week. You wont be able to, which is the entire point. I could include all of the insane comments about ''XabiOut'' and how we need to sell Valverde and 6 other players, but you already know them and you get the idea, now. Thats not to say the honest criticisms toward Xabi or the players are invalid, they are valid, 100%. Its just how you guys will turn up the temperature from ''This player needs to to better here'' into ''The league is lost, sell this player and sack the manager'' at the first chance you get. Seriously, now that we've gotten a big win in the CL and we've been able to cool down since the Atletico game, go back into the match thread and see read some of the comments that are being posted and upvoted as the game is going, its fucking lunacy.\n\nYou guys had the exact same bombastic reactions to the loss in 23/24, which ended up being the best league campaign since the 11/12 season.\n\nThe same fans that post stuff like the ''1% chance, 99% faith'' things, about how we never give up as Madridistas, are now the same people that go ''League is lost, lets sell 5 players in the winter window and #XabiOut''.\n\nLike, yes, it sucks hard that we lost, especially with 5 goals conceded against a disgusting nazi club, but you guys are reacting as if half of our players fucking died or something.\n\nXabi got the starting XI wrong, and definitely got the subs wrong too, Jude shouldn't have started, he needs more gametime to get back into it after this long injury, starting against Atleti wasn't a good idea, and i feel like Huijsen should do better on the 2-2 goal, and Arda's high kick was stupid. I think if Arda stays, we score 1 more goal and the momentum could've shifted in our favour. Way too many dumbass fouls this game, 1 of which resulted in the free kick goal.\n\nBut holy fuck, will you guys calm down? No, we dont need to sell Fede/Cama/Vini or whoever the fuck you dipshits are calling for to be sold. And no, Xabi doesn't deserve to be sacked.\n\nAlso, stop calling for Rodrygo to start over Vini, this player will continue to do nothing, like he has in the 9 months in the league without a goal or assist.\n\nMy general point is:\n\n#Please calm the fuck down, you guys had the exact same reaction 2 years ago and that season ended up being one of the most succesful league campaigns in Madrid history, and the 15th CL to go along with it.",
        "upvotes": 80,
        "comments": 65,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nw4k5l/comparing_the_reaction_from_this_atletico_loss_to/"
    },
    {
        "id": "1nwft8u",
        "author": "ManuMora98",
        "title": "[Basket] We get our first win in Euroleague after coming back against Olympiakos in the 4th quarter",
        "content": "",
        "upvotes": 19,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xeh48g4birsf1.jpeg?auto=webp&amp;s=49f65bd9ca32842f58f83107bd22ccd705ecedd4"
        },
        "permalink": "/r/realmadrid/comments/1nwft8u/basket_we_get_our_first_win_in_euroleague_after/"
    },
    {
        "id": "1nvxxkx",
        "author": "ezgimantocu",
        "title": "Kylian Mbappe Praises Arda Güler: “An Incredible Talent Shaping Real Madrid’s Future” - NSF News",
        "content": "",
        "upvotes": 141,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1nvxxkx/kylian_mbappe_praises_arda_güler_an_incredible/"
    },
    {
        "id": "1nw1ta7",
        "author": "EclipseQQ",
        "title": "RM Market Value Updates - 02/10/2025",
        "content": "",
        "upvotes": 65,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/trtx4rrfuosf1.png?auto=webp&amp;s=44a6169c9734448d670d5b4ba98d49b5db234f1c"
        },
        "permalink": "/r/realmadrid/comments/1nw1ta7/rm_market_value_updates_02102025/"
    },
    {
        "id": "1nwuaxr",
        "author": "Optimal_Lie7824",
        "title": "Our schedule for October. 3 big home matches and 1 away.",
        "content": "Villarreal, Juve and Barca all at home and Getafe away for October.\n\nHow many points are we getting?\n\nVillarreal is tough and in a very good position in the league but we can definitely beat them at home tomorrow.\n\nGetafe after the break is a good match for our players to ease into it again. It's away so it's gonna be tough with their hostile fans for sure but we can beat them. I believe in our boys.\n\nJuve is not in a very good form at the moment with all those draws (just like last season). A good team for sure but very prone to scoring a lot of goals... if our defence is on point that night, we'll win by a good goal difference.\n\nBarcelona... not gonna talk about it, don't want to jinx anything with them. They're dangerous.\n\nWhat do YOU think though?",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/eavxzfh36vsf1.jpeg?auto=webp&amp;s=ebeb9462da3033c768bc42049e64a8ab53d26cac"
        },
        "permalink": "/r/realmadrid/comments/1nwuaxr/our_schedule_for_october_3_big_home_matches_and_1/"
    },
    {
        "id": "1nvxfo8",
        "author": "Annual_Island8066",
        "title": "Ferenc Puskás: the exiled genius who conquered Madrid and the world",
        "content": "Some legends are born, some are made, and some survive everything history throws at them. Ferenc Puskás was all three.\n\n\n\nIn the 1950s, he was the star of Hungary’s Mighty Magyars, the team that changed football forever. Short, stocky, and left-footed, Puskás wasn’t built like a classic athlete. But when the ball came to that left foot, it was magic — thunderous strikes, precise passes, goals from impossible angles. Hungary went unbeaten for four years, humiliated England at Wembley in 1953, and reached the World Cup final in 1954. Puskás was the heartbeat of it all.\n\nBut then came politics and tragedy. The Hungarian Uprising of 1956 forced him into exile. He was branded a traitor, banned from football for two years, and at 31, many thought his career was finished. Overweight, aging, and with no club, it looked like the world had seen the last of Puskás.\n\nAnd then came Madrid. Real Madrid took a gamble, and what followed was one of the greatest second acts in football history. Slimmed down and reborn, Puskás formed a devastating partnership with Alfredo Di Stéfano. Together they turned Madrid into the ultimate powerhouse of European football. Puskás scored goals for fun — hat-tricks, four in a European Cup final, even a famous five-goal haul in a Clásico against Barcelona.\n\nIn total, he scored 242 goals in 262 games for Real Madrid — numbers so outrageous they barely seem real. He won 3 European Cups, 5 league titles, and a Pichichi trophy four times. For a man who was supposed to be finished, it was pure redemption.\n\nWhat made Puskás beloved wasn’t just the goals, though. It was his humanity. He was humble, warm, a joker in the dressing room. Fans called him “Pancho,” and in Madrid he wasn’t seen as a foreigner but as family.\n\nWhen he finally retired, he left behind not just records but a legacy of resilience. He had been a golden boy in Hungary, an outcast in exile, and then a reborn legend in Spain. Today, FIFA’s award for the best goal of the year carries his name — the Puskás Award — a fitting tribute to the man whose left foot was poetry.\n\nFerenc Puskás wasn’t just a footballer. He was proof that genius can’t be broken by politics, age, or exile. For many, he will always be remembered as the exiled genius who conquered Madrid and the world.",
        "upvotes": 115,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/gj05shp1knsf1.png?auto=webp&amp;s=a091f4af9fe95351ff49f9e6ca3f6227d9755871"
        },
        "permalink": "/r/realmadrid/comments/1nvxfo8/ferenc_puskás_the_exiled_genius_who_conquered/"
    },
    {
        "id": "1nvx5po",
        "author": "EffectiveTie3144",
        "title": "OTD, October 2nd 2016, Real Madrid awarded Cristiano Ronaldo for the first place in the club's top scorers list. In almost 2 more years that he played for, he managed to score 451 goals in 438 games",
        "content": "",
        "upvotes": 90,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/buydwcy3hnsf1.jpeg?auto=webp&amp;s=6a4432857b27c4bff797460db353f514f9a5726a"
        },
        "permalink": "/r/realmadrid/comments/1nvx5po/otd_october_2nd_2016_real_madrid_awarded/"
    },
    {
        "id": "1nvnaxh",
        "author": "Puzzleheaded-Delay60",
        "title": "Mbappe at right wing is so dangerous",
        "content": "I really want xabi to try this in one match, with gonzalo in the middle and vini/rodrygo left.",
        "upvotes": 414,
        "comments": 47,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dz2ztq80yksf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nvnaxh/mbappe_at_right_wing_is_so_dangerous/"
    },
    {
        "id": "1nv95w2",
        "author": "No-Independent2522",
        "title": "Fede Valverde statement on reports that he refused to play last night",
        "content": "",
        "upvotes": 1522,
        "comments": 132,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vab243t9cisf1.jpeg?auto=webp&amp;s=66c8e127489b14d2b9354fa48b81933c4d4ac93e"
        },
        "permalink": "/r/realmadrid/comments/1nv95w2/fede_valverde_statement_on_reports_that_he/"
    },
    {
        "id": "1nvn87h",
        "author": "julipacheco10",
        "title": "This is how I want my Real Madrid to make their shirt hurt",
        "content": "",
        "upvotes": 220,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/gmgrtsjexksf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1nvn87h/this_is_how_i_want_my_real_madrid_to_make_their/"
    },
    {
        "id": "1nv7bg4",
        "author": "Hiroshima-6-1945",
        "title": "Mbappé on his hat-trick: \"If I have five chances I have to score five goals, that's why Madrid bought me. Three is very good, but I could had score more, I am going to work to be more efficient in front of the goal. We must never forget, we will not forget what happened over the weekend (Atleti).\"",
        "content": "",
        "upvotes": 1094,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0k-SyFqc9pMDUXj1Ty2JzEYMj6tj2yq7W5fvKdR7Nzk.jpeg?auto=webp&amp;s=c73041735fcee4f06f9ca5ee2d11b9f8af0443da"
        },
        "permalink": "/r/realmadrid/comments/1nv7bg4/mbappé_on_his_hattrick_if_i_have_five_chances_i/"
    }
]