[
    {
        "id": "1ph9lu7",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 17,
        "comments": 5392,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ph9lu7/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1pm78uo",
        "author": "scoreboard-app",
        "title": "Pre Match Thread: La Liga, Round 17 Alavés vs Real Madrid",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1pm78uo)",
        "upvotes": 45,
        "comments": 86,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pm78uo/pre_match_thread_la_liga_round_17_alavés_vs_real/"
    },
    {
        "id": "1pmedxk",
        "author": "CoolIsopod3095",
        "title": "What a player he could have been for the club 💔",
        "content": "",
        "upvotes": 333,
        "comments": 43,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tf4ggslab67g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pmedxk/what_a_player_he_could_have_been_for_the_club/"
    },
    {
        "id": "1pmbmbn",
        "author": "ContextDry9672",
        "title": "journalist, is their a possibility that you might take over training the first team in the coming days?\n🗣️Arbeloa: \"No.\"",
        "content": "",
        "upvotes": 195,
        "comments": 17,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/oxj8way1k57g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pmbmbn/journalist_is_their_a_possibility_that_you_might/"
    },
    {
        "id": "1pmbsb3",
        "author": "Cemo137",
        "title": "A dream came true for me",
        "content": "I‘ll never had the cance to see Marcelo and Toni live, honestly i thought after they retired there is zero chance to see them and i was ok with it after a while, but weeks ago Toni and Marcelo decided to put on their shoes for a last dance on the pitch together in the Icon league and Boy i felt like a 6 year old on christmas waiting to rip open the presents 🤍",
        "upvotes": 97,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pmbsb3/a_dream_came_true_for_me/"
    },
    {
        "id": "1pmbee2",
        "author": "madbunny89",
        "title": "Most of you aren't true RM fans",
        "content": "Hello to all the so called real fans.\n\nI used to come here all the time, checking the Real Madrid subreddit for the latest club news, updates about injured players, or simply to discuss matches with you. Lately though, I get irritated the moment I see what some of you are posting, and I honestly start wondering whether some of you are actually Barcelona fans in disguise, trying to create chaos here.\n\nAll I see are absurd questions like: would we be better without Mbappé? Or would Kane have been a better option instead? It feels like no matter how well the Frenchman performs, you still find reasons to go after him and criticize him.\n\nLast season you were glorifying Valverde and Jude, and now, almost overnight, you have turned your backs on them and want them replaced or sold. You complain nonstop about the state of the club as if you personally invested money and are now losing it because of the players. I have even seen attacks directed at Pérez. Fine, maybe we do not agree with every single decision he makes, but can we seriously not appreciate what we have? After Pérez is gone, you will all regret it, but by then it will be too late.\n\nThis subreddit is dominated by frustration, anger, and regret. Very few people actually stand by the players and the coach. Even fewer show real compassion and genuine love for the biggest football club in the world.\n\nReal Madrid, like any other team, goes through weaker periods. But because many of you are spoiled little bitches who grew up with Champions League trophies, Ballon d’Or winners, and league titles almost every year, the moment things get difficult, instead of acting like real supporters, you rush to Reddit to post all kinds of nonsense.\n\nI genuinely think many of you have forgotten who Real Madrid really are. And that happens because some of you are here only for appearances, or because you support a single player rather than the team as a whole.\n\nIt is time for all of us to show that we are true Real Madrid supporters, because being a true fan of this club is a privilege. Hala Madrid!",
        "upvotes": 89,
        "comments": 73,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pmbee2/most_of_you_arent_true_rm_fans/"
    },
    {
        "id": "1plsn2z",
        "author": "choker_18",
        "title": "This is how I want to see Xabi Alonso.",
        "content": "",
        "upvotes": 1061,
        "comments": 97,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/sr6cgivrn07g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1plsn2z/this_is_how_i_want_to_see_xabi_alonso/"
    },
    {
        "id": "1pmdta8",
        "author": "Frosty_Resource7740",
        "title": "A Reminder to RM fans",
        "content": "I think because of the wide popularity of the club, and being the most successful in Europe especially in the last decade , has attracted fans who are ( glory hunters ), who started supporting the club in its best days, and they aren’t used to RM being a normal team with normal problems?. \n\nThe hate against xabi is just too forced , people can’t handle a manager who suddenly got a room full of egos, superstars, who all wanna play at the same time. And people don’t realize how hard is that, and obviously some people forget that apparently half of the squad is injured and still demanding the SAME results. \n\nThis is a transition stage, after any major success or dominance for a club, things has to change around, and usually the transition stage doesn’t come with the most appealing results, and therefore creating a rage among some fans who can’t handle the fact that losing is part of this game and start booing on the manager to sack him and get zidane. \n\nFYI, i dont think zidane will come, at least in the near future, the guy is dedicated to his NT , And obviously getting him till the end of the season will only mess things more.\n\nWe need a solid foundation, we need to trust the manager this season even if the result aren’t the best. And give him the required time for any manager to deal with those stars, injuries, media.\n\n",
        "upvotes": 35,
        "comments": 35,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pmdta8/a_reminder_to_rm_fans/"
    },
    {
        "id": "1pmekam",
        "author": "chunchunmaru1129",
        "title": "Guy's we are basically going through a transitonal period and most of our players are youngsters and we also don't have any world class experienced campaigner with leadership qualities so just be patient",
        "content": "We literally don't have anyone experienced enough to lead the team from the front.Most of our players are raw and youngsters.Its a transitonal period for us because 2 of our biggest legends Kroos and Modric retired. \n\nExperience matters a lot and we at the moment don't have anyone experienced enough to be the captain and leader. ",
        "upvotes": 19,
        "comments": 31,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pmekam/guys_we_are_basically_going_through_a_transitonal/"
    },
    {
        "id": "1plza7r",
        "author": "asensia-kopfschmerz",
        "title": "Vinicius and Real Madrid go hand in hand: The club's management, starting with the president, are reassured about the striker, especially after hearing the 'reason' for the drop in form.",
        "content": "Reported by José Félix Díaz (Tier 2).\n\nP.S. The cited texts are automatically translated. In the title, \"delantero\" should be more accurately \"forward\", not \"striker\".\n\nP.S. There is a similar post of the same source, but it altered the title.\n\nThe reason for Vini's drop in form is \"he hasn't quite reached his full physical potential\".\n\n&gt; The Brazilian, true to form, tried everything [against Man City], but luck wasn't on his side.\n\n&gt; He [Vini] has no doubt about it [regaining his form], nor about the club's constant support. There is no distance whatsoever between the management and the player.\n\nFlurries of weird statements from a journalist. Almost like José Félix Díaz is a fanboy. But if you imagine these words said in Vini and his entourage's tone, everything makes sense.\n\n&gt; ## Seal the continuity\n\n&gt; The two parties, player and president, maintain an excellent relationship and are in constant communication. In these conversations, they have discussed the future and the possibility of a new agreement that would secure the Brazilian's continued presence at Real Madrid.\n\n&gt; Vinicius has made it clear in recent matches that his understanding with Xabi Alonso is palpable after weeks of tension following the Clásico and the Brazilian's gestures, for which he apologized. Since then, the Brazilian has been untouchable for the coach. His willingness to try is something no one can doubt. He does it time and time again, and the first to know that the striker's streak will change is Xabi Alonso himself.\n\nAnother piece leaked by Vini's agent. The closest thing you get from an apology to Alonso.\n\nSo it looks like Vini's open to renewal again while Alonso remains the coach.\n\n&gt; Since then, the Brazilian has been untouchable for the coach.\n\nCan you believe this sentence is part of evidence that Vini and Alonso have repaired their relationship?",
        "upvotes": 112,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Mh88p0zit7g_Vd1fT-XfBaiPE4HuCP7NWrPtoM-oQEI.jpeg?auto=webp&amp;s=696305bfce85c842503b824714aab0956705dfb7"
        },
        "permalink": "/r/realmadrid/comments/1plza7r/vinicius_and_real_madrid_go_hand_in_hand_the/"
    },
    {
        "id": "1ply7ju",
        "author": "Messmers",
        "title": "Most big chances created in the Champions League so far",
        "content": "",
        "upvotes": 82,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jgckeehuu17g1.jpeg?auto=webp&amp;s=2f9b53cc1eaf601856838af0b1b18b03620fc0a1"
        },
        "permalink": "/r/realmadrid/comments/1ply7ju/most_big_chances_created_in_the_champions_league/"
    },
    {
        "id": "1ply2rl",
        "author": "areno004",
        "title": "“The day Rüdiger almost broke Mbappé",
        "content": "this guy is something else ",
        "upvotes": 83,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9vnyos4mt17g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ply2rl/the_day_rüdiger_almost_broke_mbappé/"
    },
    {
        "id": "1plg39b",
        "author": "Character_Calendar47",
        "title": "Mourinho was 100 percent right...",
        "content": "",
        "upvotes": 1031,
        "comments": 171,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/u58xk17vgx6g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1plg39b/mourinho_was_100_percent_right/"
    },
    {
        "id": "1plgi2a",
        "author": "Bunchdawg",
        "title": "Our Star Boy is a natural infront of goal",
        "content": "",
        "upvotes": 742,
        "comments": 71,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/nbwpc21hlx6g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1plgi2a/our_star_boy_is_a_natural_infront_of_goal/"
    },
    {
        "id": "1plou8x",
        "author": "CaadiWaaye",
        "title": "Cristiano Ronaldo cooking Girona player off the ball (2018)",
        "content": "Wanted to post this because you rarely see defenders get ankle broken like this off the ball. \n\nI can only see Mbappe doing something like this in the box because I’ve seen him use feints off the ball to create space to receive it very well. However, he’s never done it like this. He definitely has the athleticism but needs the instincts and the ability to capitalize off it.",
        "upvotes": 165,
        "comments": 17,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5gj9o7rpvz6g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1plou8x/cristiano_ronaldo_cooking_girona_player_off_the/"
    },
    {
        "id": "1plv721",
        "author": "dragonunborne",
        "title": "The anomaly of Marcus Rashford",
        "content": "How is it that Rashford, the poster boy for laziness, selfishness and wasted potential for so many years suddenly shows up in this barca team and becomes one of their best performers? A loan move, some may say made out of desperation after the failed Nico deal.\n\nI’ll tell you why. Flick understands the strengths and weaknesses of Rashford and plays him to those strengths. That’s it. The responsibility of a manager isn’t just to explain tactics on a board. It’s also to man manage, to manage egos and confidence. It’s extremely naive to expect a team full of world class players to also have perfect personalities. I’ll make it abundantly clear, I’m not suggesting that the blame falls fully on xabi for our performances this season but I will say it’s extremely naive to suggest that it all comes down to “ego”, “selfishness”, “not working hard enough”.",
        "upvotes": 59,
        "comments": 63,
        "media": null,
        "permalink": "/r/realmadrid/comments/1plv721/the_anomaly_of_marcus_rashford/"
    },
    {
        "id": "1pljcf1",
        "author": "Scary-Procedure-6018",
        "title": "Put fanpages on a mental break, they don't know what to post anymore.",
        "content": "If the bear i'm eating breakfast with rn doesn't speak on being a southern undercover spy for the romanian forces, then the migraine forgets its PIN number, a dolphin learns tax law in Nevada and Xabi will get sacked.\n\n If that doesn’t plan out, a mailbox becomes afraid of rectangles and shoves it down the toilet which will sadly lead to Xabi getting sacked.\n\n If neither applies, someone invents a fork specifically for soup and immediately regrets it cuz he'll recieve cyber hectical energy from the aliens that contains the message \"Xabi will be sacked\".\n\n If that fails too, a ladder develops stage fright and won't go up the stairs until Xabi gets sacked.\n\n If the universe still won’t cooperate, a cactus gets banned from a library which will lead to its spikes vibrating from a seizure and flying to spain with the message \"Xabi will be sacked\". If we're still not on the same page, guess what?..",
        "upvotes": 182,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/by9lc9sgjy6g1.jpeg?auto=webp&amp;s=e08e9f058d5cbc80aae282f8519a77d2ed0f58ef"
        },
        "permalink": "/r/realmadrid/comments/1pljcf1/put_fanpages_on_a_mental_break_they_dont_know/"
    },
    {
        "id": "1plq709",
        "author": "AlekhineAl",
        "title": "Jude Bellingham fans, what do you think is his best position and which group of players alongside with him will allow him to play his best?",
        "content": "Two friends who are big Jude followers were discussing Jude’s best position for Real Madrid. One said he is a match-winner Number 10 and his goal scoring threat will be subdued if he is pushed back to being a box 2 box midfielder with additional possession building duties. Said he can also press and steal balls brilliantly in the final third using his pace and strength.\n\nOther one said Jude is a natural box to box midfielder and large part of his game is build on covering each blade of the grass , dealing with pressing and shielding the centre backs. At 10, the game passes by him and he hardly gets to use his best assets. Moreover, he loves to take his time in progressing the game and carrying the ball forward. 10 is too crowded for him and doesn’t let his size come into play nor his durability.\n\nAnother point of discussion was his best partners - Whether Camavinga, Tchouameni and Valverde really compliment him and the common consensus was that one of the three should be benched for a possession building midfielder(Vitinha or Pedri or FDJ type) next season and Jude will cook the best with Trent AA at RB.",
        "upvotes": 41,
        "comments": 147,
        "media": null,
        "permalink": "/r/realmadrid/comments/1plq709/jude_bellingham_fans_what_do_you_think_is_his/"
    },
    {
        "id": "1pktlf3",
        "author": "Modo97",
        "title": "Rodrygo if all teams are Man City:",
        "content": "",
        "upvotes": 2137,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2fcf0e5ccs6g1.png?auto=webp&amp;s=47fb7fe624e94e17a0870600c645426e8e444d5c"
        },
        "permalink": "/r/realmadrid/comments/1pktlf3/rodrygo_if_all_teams_are_man_city/"
    },
    {
        "id": "1plkw1i",
        "author": "ManuMora98",
        "title": "[Fem] Granada 0 - 3 Real Madrid | Comendador 30', Redondo 44', 45'+4 | Comfortable win while giving rest to some important players to keep the good results coming | Liga F Match Day 14",
        "content": "",
        "upvotes": 27,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/mx09ssxfzy6g1.jpeg?auto=webp&amp;s=d5fdca69d744298c78a50951b665454d03d3b7f2"
        },
        "permalink": "/r/realmadrid/comments/1plkw1i/fem_granada_0_3_real_madrid_comendador_30_redondo/"
    },
    {
        "id": "1pkzsda",
        "author": "vil727",
        "title": "What next seasos's Madrid should look like according to this sub.",
        "content": "",
        "upvotes": 684,
        "comments": 176,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/o87975vxjt6g1.png?auto=webp&amp;s=c9d98f9b85c498edf6b081be84910026da71aa31"
        },
        "permalink": "/r/realmadrid/comments/1pkzsda/what_next_seasoss_madrid_should_look_like/"
    },
    {
        "id": "1plsvzs",
        "author": "mr-zeus-",
        "title": "Do you want us to be structured or free flowing offensively ?",
        "content": "This question is purely from an offensive point of view in the final third.\n\nThis question has been running through my mind since the Celta game when the commentator mentioned **\"When you are structured, you are easier to defend, bcs you are predictable\"**. This does have a good value. In the premier league, the big boys have a tough game against brighton/brentford. Brentford are very transitional and hard for the possession hogging teams. Brighton has an insane structural play(especially during De Zerbi) and consistently outplayed Pep and Klopp. What this also tells is, **a structured team can be beaten by another structure.**\n\n  \nThis also correlates to the fact that madrid has won more UCLs over the last decade than the structured teams. Structured teams usually are good with the ball, but aren't as good without the ball when there is chaos(AKA Madrid). This makes me wonder, should we really want to be like them ? From a defensive POV, yes. From a pressing POV, yes. But do we need to be them in the final third. I'd prefer us to have a combination of both. I'd like more overlapping runs being used by our forwards, more low crosses, more third man runs. These keep us unpredictable, other than Vini/Kylian cutting in right now. These wil make the defenders track other players more, creating more space for the frontline attackers. What are your thoughts on this ?",
        "upvotes": 9,
        "comments": 27,
        "media": null,
        "permalink": "/r/realmadrid/comments/1plsvzs/do_you_want_us_to_be_structured_or_free_flowing/"
    },
    {
        "id": "1plmdyd",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [2]-1 CD Guadalajara - Dani Mesonero 49'",
        "content": "",
        "upvotes": 18,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fvo4dpz1cz6g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1plmdyd/real_madrid_castilla_21_cd_guadalajara_dani/"
    },
    {
        "id": "1plicsq",
        "author": "jangwenli",
        "title": "Xabi's madrid struggles are over rated !!!",
        "content": "When we look under at underying data, from understat and fbref, we can find that they deserved more points than they have won. Only bayern are above them in big 5 leagues in xGD. We are good at chance creation. We are underperforming on xG because of wastefullness in front of goal from other players other mbappe. Also mbappe eventhough scored some bangers, having the most outside box goals, he also missed some sitters. I think xabi deserves atleast one year and vinicius has to be sold if dont renew and get a creative left winger with a high floor like yildiz or semenyo. If we get an organizer with like locatelli, who is under the radar in january and incoperate endrick into the side, we can win the league and go deep in the champions league. \nThe most important thing xabi has to improve is the in-game management especially the substitutes. Hoping for the better. All this injuries may be a good thing as we can see the players who have'nt plated that much on where they stand.",
        "upvotes": 35,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1plicsq/xabis_madrid_struggles_are_over_rated/"
    },
    {
        "id": "1plmn11",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [3]-1 CD Guadalajara - Loren Zúñiga 61'",
        "content": "",
        "upvotes": 16,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/09m1yb0xdz6g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1plmn11/real_madrid_castilla_31_cd_guadalajara_loren/"
    },
    {
        "id": "1pl0e2l",
        "author": "8Nakul",
        "title": "Toni Kroos: “Manchester City did NOT deserve to win. Real Madrid were actually the more dangerous team",
        "content": "",
        "upvotes": 335,
        "comments": 58,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pl0e2l/toni_kroos_manchester_city_did_not_deserve_to_win/"
    },
    {
        "id": "1pkw5ec",
        "author": "ContextDry9672",
        "title": "Xabi Alonso will fight for his seat at Real Madrid without CB, two full-backs and without his top scorer, total of 11 players are out",
        "content": "",
        "upvotes": 476,
        "comments": 46,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ql4xpix8us6g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pkw5ec/xabi_alonso_will_fight_for_his_seat_at_real/"
    },
    {
        "id": "1plhx3k",
        "author": "ManuMora98",
        "title": "[Fem] Our Starting XI against Granada (away) | Liga F Match Day 14",
        "content": "",
        "upvotes": 17,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uil9lkiu2y6g1.jpeg?auto=webp&amp;s=041b97323c717ef0779087b8bcb5a8b4c6c8daf0"
        },
        "permalink": "/r/realmadrid/comments/1plhx3k/fem_our_starting_xi_against_granada_away_liga_f/"
    },
    {
        "id": "1pllizc",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Castilla - CD Guadalajara | Primera Federación, Matchday 16",
        "content": "#FT: CASTILLA 3:1 GUADALAJARA \n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n0:1 Salifo Caropitche 25'\n\n1:1 Toño Calvo (own goal) 45'+4\n\nSecond yellow card: Toño Calvo (Guadalajara) 47' \n\n2:1 Dani Mesonero 49'\n\n3:1 Loren Zúñiga 61'\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n17' - Yáñez gets brought down in the box and Arbeloa asks for a challenge, but the referee doesn't change her decision of no penalty\n\n⚽ 25' - goal for Guadalajara - Rivas gets beaten extremely easily by their winger, then Lamini makes a huge marking error in the middle, and Salifo can tap the ball in. Joan and Valde hugely missed due to the injury crisis with the first team\n\n⚽ 45'+4 - GOLLLLL DEL CASTILLA - corner from the left side taken short - Mesonero advances into the box with technique and willpower and lays it off to David - he wants to take a low cross towards the first post, but it gets deflected by Guadalajara's Calvo into his own net \n\nHT - the absence of so many players due to the (yearly...) injury crisis in both Castilla and the first team is duly noted, especially the centre of defense between Rivas and Fati is looking very disoriented - but Castilla manage to equalise with the last kick and salvage a difficult first half\n\n🔄 46' - 2nd half underway, with Arbeloa trying to stabilise the defence by subbing on left back Lezcano for his Castilla debut for Mario Rivas, moving Diego Aguado to center back\n\n🟥 47' - second yellow card for Guadalajara's Toño Calvo, who crowns his nightmare performance with a stupid foul on Palacios, already being on a yellow -harsh decision but not scandalous\n\n\n⚽ 49' - GOOOOLLLL DEL CASTILLA - Golazo de Mesonero! He receives the ball in midfield with a lot of space, drives towards the box and takes a shot from distance, surprising the keeper low at the near post\n\n⚽ 61' - GOOOOLLLLL DEL CASTILLA - huge misunderstanding in Guadalajara's defence after a long clearance by Castilla - their defender heads the ball past the keeper who was storming out of the goal, and Zúñiga only has to pick it up and tap it into the empty net! \n\n🔄 63' - Mesonero comes off after a MOTM performance alongside Palacios, coming in in their stead are Beto for his Castilla debut and Pol Fortuny\n\n🔄 70' - Fortea comes on for David\n\n🔄 77' - and the last sub, Castrelo on for Loren Zúñiga\n\n90' - penalty for Castilla after Manuel Ángel is brought down in the box \n\n90'+4 - after almost 5 minutes of reviewing, the referee overturns it - another correct decision by her imo, way too little of a touch on our player \n\nFT - Castilla with a second half of suffocating dominance and great dynamism from everyone including the debuting players - which is also partly thanks to Guadalajara being their own worst enemy, scoring an own goal out of nowhere, getting an early red card in the second half and gifting us the third goal on top. Castilla continue their good form and are 2nd for now, with the other teams at the top of the table still having to play\n\n&amp;#x200B;\n\n**Kickoff:** 14:00 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid\n\n**Referee**: Olatz Rivera Olmedo\n\n**Competition:** Primera Federación, Grupo 1, Matchday 16\n\n**Viewing options:** \n[LaLiga+](https://www.laligaplus.laliga.com/) (subscription - 14.99€/month) (only available in Spain)\n\n&amp;#x200B;\n\n**Castilla XI** (4-3-3): Fran González - Diego Aguado, Lamini Fati, Mario Rivas (46' Álvaro Lezcano), David Jiménez (70' Jesús Fortea) - Cristian David, Manuel Ángel, Dani Mesonero (63' Diego Martínez 'Beto') - César Palacios (63' Pol Fortuny), Loren Zúñiga (77' Gabri Castrelo), Dani Yáñez \n\nBench: Guille Súnico (GK), Jacobo Ortega. \n\nUnavailable: Sergio Mestre (first team call-up), Joan Martínez (first team call-up), Víctor Valdepeñas (first team call-up), Manu Serrano (injury), Jorge Cestero (first team call-up), Roberto Martín (injury), Hugo de Llanos (injury), Rachad Fettal (injury). \n\nCoach: Álvaro Arbeloa\n\n&amp;#x200B;\n\n**Castilla last five matches:** WLWWD\n\n**1ª RFEF stats:** 4th | 25pt | 8-1-6 | 19:19\n",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pllizc/match_thread_real_madrid_castilla_cd_guadalajara/"
    },
    {
        "id": "1pl0esp",
        "author": "tavorasc",
        "title": "Ernesto Valverde (former FC Barcelona coach during the Negreira era) has testified he had no idea any \"referee reports\" were available for him to use....",
        "content": "As the title says Valverde was not even aware any of the supposed reports which is the excuse the club Barcelona has given for the payments to Enríquez Negreira the vice-president at the time of the technical referee committee of Spanish football which manages the referees of the federation and their promotions, he never knew they existed, the case is clear they were bribing referees. This is the news we should be focusing on, Barcelona is trying to create a smoke screen with Xabi Alonso and our bad performance to hide these declarations.",
        "upvotes": 165,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/d2jgryvcot6g1.jpeg?auto=webp&amp;s=9dd8092660b33ea78420884cdc080dc7c43f63f7"
        },
        "permalink": "/r/realmadrid/comments/1pl0esp/ernesto_valverde_former_fc_barcelona_coach_during/"
    }
]