[
    {
        "id": "1qbv8lf",
        "author": "OrSomethingAMA",
        "title": "Hey /r/movies - We're Kareem Rahma and Mary Neely, stars and screenwriters of the indie film 'Or Something', streaming now on Mubi. You might also know Kareem from the viral talk show 'Subway Takes' and Mary from films like 'Swiped' and 'Valley Girl'. Ask us anything!",
        "content": "Hey r/movies \\- We're Kareem Rahma and Mary Neely, stars and screenwriters of the indie film 'Or Something', streaming now on Mubi. Here to answer your questions!\n\n  \n**Synopsis:** \n\n&gt;Two strangers show up at the same Brooklyn apartment to collect cash they’re both owed. Forced to spend the day together on a journey through New York City, the pair reveal intimate details about their lives. One of them happens to be hiding a harrowing secret.\n\n**More info about us:**\n\n&gt;\n\n&gt;\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=F8Ur-id1H-Y](https://www.youtube.com/watch?v=F8Ur-id1H-Y)\n\n**Starring**: Mary Neely, Kareem Rahma, Brandon Wardell, and David Zayas, with cameos from Lauren Servideo, Petey DeAbreau and Tim Griffin Allan\n\n**Music:** Original composition by Ian Sweet with songs by Third Eye Blind, Melody English and Blaketheman1000\n\nCurrently available to stream on MUBI in the US &amp; Canada, rent or buy on Vimeo (worldwide), YouTube, GooglePlay, Fandango, DirecTV, Dish Network, and in-flight entertainment on all United and Emirates Airlines flights : [https://linktr.ee/orsomething](https://linktr.ee/orsomething)\n\nAsk us anything! We'll be both be back tomorrow (Tuesday 1/13) at 11:00 AM ET to answer your questions.",
        "upvotes": 25,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hheqlvti35dg1.png?auto=webp&amp;s=a79b897bdc241f5f9f27cbd06c38e1a291329d8e"
        },
        "permalink": "/r/movies/comments/1qbv8lf/hey_rmovies_were_kareem_rahma_and_mary_neely/"
    },
    {
        "id": "1qb3wlu",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Freddie Gibbs - Wednesday 1/14 at 4:00 PM - Rapper ('Shadow of a Doubt', 'Freddie', 'Baby Face Killa') &amp; actor ('Night Patrol').",
        "content": "",
        "upvotes": 124,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/t2y44o3yuycg1.png?auto=webp&amp;s=f6709a3f20d6815a0200dd4d04b3edeab2c55ebb"
        },
        "permalink": "/r/movies/comments/1qb3wlu/amaqa_announcement_freddie_gibbs_wednesday_114_at/"
    },
    {
        "id": "1qbu257",
        "author": "MarvelsGrantMan136",
        "title": "Zoe Saldaña Becomes Highest-Grossing Actor of All Time With ‘Avatar: Fire and Ash’",
        "content": "",
        "upvotes": 18888,
        "comments": 1094,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/h6m_Prci4HwqnASInR7HjbaHrOWrmDaHcIYBuXoK7o0.jpeg?auto=webp&amp;s=b039a22183cc2a6e87cff0ea1e9999022cf1ff67"
        },
        "permalink": "/r/movies/comments/1qbu257/zoe_saldaña_becomes_highestgrossing_actor_of_all/"
    },
    {
        "id": "1qc87iq",
        "author": "MarvelsGrantMan136",
        "title": "Marcus Gilbert, Who Played Lord Arthur in Sam Raimi’s ‘Army of Darkness’, Dies at 67",
        "content": "",
        "upvotes": 729,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7FfngtgKrLOFr-Mt4JaMCZX-tqIAwwea9wwe26zxyp8.jpeg?auto=webp&amp;s=57267a525606c3c1371b1c60e6bab7a9a936ad20"
        },
        "permalink": "/r/movies/comments/1qc87iq/marcus_gilbert_who_played_lord_arthur_in_sam/"
    },
    {
        "id": "1qc38p8",
        "author": "MarvelsGrantMan136",
        "title": "28 Years Later: The Bone Temple - Review Thread",
        "content": "**28 Years Later: The Bone Temple - Review Thread**\n\n* [Rotten Tomatoes](https://www.rottentomatoes.com/m/28_years_later_the_bone_temple): 92% (83 Reviews) - Certified Fresh \n* [Metacritic](https://www.metacritic.com/movie/28-years-later-the-bone-temple/): 80 (33 Reviews)\n\nReviews:\n\n[Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/28-years-later-the-bone-temple-review-ralph-fiennes-1236472050/) (70):\n\n&gt;Despite its unevenness, *The Bone Temple* delivers enough carnage and ritual sacrifice to satiate the horror flock. But most of its richest pleasures come down to Fiennes going balls to the wall with a truly memorable character — half lunatic and half visionary. He elevates the movie whenever he’s onscreen.\n\n[Deadline](https://deadline.com/2026/01/28-years-later-the-bone-temple-review-nia-dacosta-ralph-fiennes-1236680553/):\n\n&gt;Key to this is Fiennes’ commando performance, a *tour de force* with so few f\\*cks given that the film’s astonishing, electrifying climax could put him back into the awards conversation with a part that couldn’t be further away from *Conclave*’s Cardinal Thomas. O’Connell, too, confirms his villainous chops with a subtle variation on his *Sinners* role, playing a seductive but sick, delusional psycho who kids himself that he has the devil’s ear.\n\n[Variety](https://variety.com/2026/film/reviews/28-years-later-the-bone-temple-review-ralph-fiennes-1236630014/) (90):\n\n&gt;For genre aficionados, it’s bold, mind-bending work which satisfies that so-often-frustrated craving: for a zombie movie with brains.\n\n[IGN](https://www.ign.com/articles/28-years-later-the-bone-temple-review?utm_source=bluesky,threads,twitter) (8/10):\n\n&gt;28 Years Later: The Bone Temple picks up the same plot but tells a very different story in a surprisingly funny, exceptionally brutal new chapter for the franchise.\n\n[The Wrap](https://www.thewrap.com/author/williambibbiani/) (84):\n\n&gt;Nia DaCosta’s smart, freaky sequel zooms in on the ongoing battle between sense and senselessness until it finds strong, connective tissue between science and religion.\n\n[IndieWire](https://www.indiewire.com/criticism/movies/28-years-later-the-bone-temple-review-1235172860/) (83):\n\n&gt;A strange, hysterical, and thrillingly audacious continuation of a saga about the nature of faith in a godless world, “The Bone Temple” might appear to be a more traditional genre offering than its immediate predecessor, but don’t be fooled by the fact that it wasn’t shot on an iPhone: This is very much the part two that 2025’s smartest and most humane studio horror movie deserves.\n\n[Associated Press](https://apnews.com/article/28-years-later-bone-temple-movie-review-8108fc8e8882a28ef0a26fd9f187d92e) (88):\n\n&gt;There’s plenty of good music in 28 Years Later: The Bone Temple, including Radiohead’s “Everything in Its Right Place” and one of the most gloriously unhinged uses of Iron Maiden’s “The Number of the Beast” ever conceived. If the previous film had a Fellini-esque vibe, this one has punky, anarchic feel.\n\n[Empire](https://www.empireonline.com/movies/reviews/28-years-later-the-bone-temple/) (80):\n\n&gt;Simpler, but also bolder and bloodier, than its predecessor, The Bone Temple is a more-than-worthy sequel.\n\n[Total Film](https://www.gamesradar.com/entertainment/horror-movies/28-years-later-the-bone-temple-review/) (80):\n\n&gt;Nia DaCosta turns things up to 11 with an energized take on the 28 Years Later world. Come for the gore but stay for the surprisingly frequent jokes and a pair of astonishing performances from Ralph Fiennes and Jack O'Connell, whose sadistic Jimmy Crystal is utterly hateful but always compelling.\n\n[The Independent](https://www.the-independent.com/arts-entertainment/films/reviews/28-years-later-bone-temple-review-jack-o-connell-b2899743.html) (80):\n\n&gt;It’s rich thematic territory for the series, and slowly amps up the audience’s anticipation for the moment these two finally cross paths. When they do, it’s spectacular and audacious.\n\n[Screen Daily](https://www.screendaily.com/reviews/28-years-later-the-bone-temple-review-jack-oconnell-ralph-fiennes-fuel-blistering-horror/5212640.article) (90):\n\n&gt;Bold, bloody and blisteringly brutal, this exhilarating follow-up to last year’s 28 Years Later grabs its audience by the throat from the off and never loosens its grip.\n\n[SlashFilm](https://www.slashfilm.com/2074962/28-years-later-the-bone-temple-review/) (80):\n\n&gt;I left 28 Years Later nervous about what might come next. After The Bone Temple, I'm thrilled at the prospect of where this story could go. That's what I call progress.\n\n\\--------------------\n\nDirected by Nia DaCosta:\n\n&gt;Taking place after the events of the previous film, Spike (Alfie Williams) is inducted into Sir Jimmy Crystal's (Jack O'Connell) gang of acrobatic killers in a post-apocalyptic Britain ravaged by the Rage Virus. Meanwhile, Dr. Ian Kelson (Ralph Fiennes) forms a new relationship with potentially world-changing consequences.\n\nRelease Date: January 16",
        "upvotes": 978,
        "comments": 350,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/z3QfHEPbTZK6NU1n_O9eU8l4xiguMeD1AGC1w3PzVNA.jpeg?auto=webp&amp;s=813ae3caa71621f37e200352486e80f33cff08c2"
        },
        "permalink": "/r/movies/comments/1qc38p8/28_years_later_the_bone_temple_review_thread/"
    },
    {
        "id": "1qbs7g8",
        "author": "Comic_Book_Reader",
        "title": "AVENGERS: DOOMSDAY - Teaser Trailer | Wakandans and the Fantastic Four | AGBO",
        "content": "",
        "upvotes": 1746,
        "comments": 1092,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pAt4uBQ_ejIsA40LXgtKpnUvxsMoGd3fgb4ZJVp-j4A.jpeg?auto=webp&amp;s=cc6a35b3f453709b938934f1d1c8a840215e78db"
        },
        "permalink": "/r/movies/comments/1qbs7g8/avengers_doomsday_teaser_trailer_wakandans_and/"
    },
    {
        "id": "1qc50ih",
        "author": "BunyipPouch",
        "title": "First Poster for Horror-Comedy 'Forbidden Fruits' - Starring Lili Reinhart, Alexandra Shipp, Lola Tung, Victoria Pedretti, and Gabrielle Union - At a mall store, Apple leads a secret witch cult with coworkers Cherry and Fig. A new hire named Pumpkin changes everything.",
        "content": "",
        "upvotes": 300,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yexsteanw6dg1.jpeg?auto=webp&amp;s=b4e8d28dd60e0e8bed6e11a46a216bb4ccaa107b"
        },
        "permalink": "/r/movies/comments/1qc50ih/first_poster_for_horrorcomedy_forbidden_fruits/"
    },
    {
        "id": "1qc90md",
        "author": "mikewheelerfan",
        "title": "I Saw The TV Glow…I don’t even know what to say.",
        "content": "Holy shit. I just watched I Saw The TV Glow, and I barely even know what to say. I have never in my life been so moved by a movie before. I felt like I was on the verge of tears for the entire runtime. By the final scene, I couldn’t hold them back, and tears were just streaming down my face and falling onto my shirt. I didn’t know it was possible for a movie to encapsulate the queer experience so perfectly.\n\nThe target audience is obviously trans people, and I am not trans. However, I am lesbian and asexual. I have long since come to peace with being lesbian. I like girls, who cares? Not me. Being asexual is…different. When you’re not interested in sex in such a sex obsessed society, you’re naturally going to feel wrong. Inhuman. And this movie evoked that feeling perfectly.\n\nThroughout the whole movie, there’s such a feeling of unease. What you’re seeing is not right, things aren’t supposed to be this way. Nobody around you understands. So you push it down and down, until you can’t take it anymore. That’s why this movie is classified as horror. Not because of cheap jumps scares or gore, but the dread looming over you for 90 minutes. If you’re a queer person, it’s not just for 90 minutes. It’s your whole life.\n\nI think that’s why there’s such middling reviews on this movie. Before actually watching it, I looked at the plot for and reviews of the movie. And yes, I did spoil the entire plot for myself. But that barely even mattered, because nothing in the world could ever spoil the experience of actually watching it for the first time for me. Anyways, the reviews. People either love or hate this movie. And I genuinely think it might come down to queer vs non-queer people. If you are straight, I honestly don’t believe you can truly appreciate this movie. Of course, that’s a generalization. But I Saw The TV Glow was made by a queer person, for queer people. That almost never happens.\n\nIn the end, whether the TV show was real or not doesn’t even matter. I personally believe it is, but your interpretation of the story doesn’t change the experience, or what it’s actually about. This is a horror film about what it’s like to be queer, and that feeling of wrongness that comes with it. It’s not an eldritch horror like some people seemingly expected. But I’m glad it’s not. It means more this way. You can always watch another movie about eldritch horror. You can’t watch another movie like I Saw The TV Glow.",
        "upvotes": 189,
        "comments": 90,
        "media": null,
        "permalink": "/r/movies/comments/1qc90md/i_saw_the_tv_glowi_dont_even_know_what_to_say/"
    },
    {
        "id": "1qc40ot",
        "author": "LollipopChainsawZz",
        "title": "Netflix Weighs Amending Warner Bros. Bid to Make It All Cash",
        "content": "",
        "upvotes": 300,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CaC5Jduy8sNu30WV7K5F8knT5NIX-YQeibOJkoG5ix0.jpeg?auto=webp&amp;s=9b699bfb631c210e82715d43344424fbfc4a17bb"
        },
        "permalink": "/r/movies/comments/1qc40ot/netflix_weighs_amending_warner_bros_bid_to_make/"
    },
    {
        "id": "1qc4d9w",
        "author": "Fan387",
        "title": "Rotten Tomatoes Awards: ‘Sinners’ Takes Best Movie, ‘Pillion’ Wins Best Romance, ‘Andor’ Named Best Series",
        "content": "",
        "upvotes": 286,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EpZQH__Y2yf7GZ_QGQzsO8UJOEfpA6eDzjTxSLrO_4Y.jpeg?auto=webp&amp;s=b777e2a79c65d8fc89872826ca82df8af183b5c5"
        },
        "permalink": "/r/movies/comments/1qc4d9w/rotten_tomatoes_awards_sinners_takes_best_movie/"
    },
    {
        "id": "1qbtsel",
        "author": "MarvelsGrantMan136",
        "title": "First Images of Sophie Turner and Kit Harrington in 'The Dreadful' - Follows Anne and her mother-in-law Morwen who live a solitary, harsh life on the outskirts of society. But when a man from their past returns, he will set off a sequence of events that become a turning point for Anne.",
        "content": "",
        "upvotes": 635,
        "comments": 210,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1iuofwr7u4dg1.jpeg?auto=webp&amp;s=ca7c1076e6b8d3154be0c00dd52c03bdaba9806c"
        },
        "permalink": "/r/movies/comments/1qbtsel/first_images_of_sophie_turner_and_kit_harrington/"
    },
    {
        "id": "1qc7scg",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Sam Raimi - Thursday 1/15 at 3:00 PM ET - Legendary director of 'The Evil Dead', Tobey Maguire's 'Spider-Man' Trilogy, 'Army of Darkness', 'Drag Me To Hell', 'Doctor Strange in the Multiverse of Madness', 'The Gift', 'A Simple Plan', and much more.",
        "content": "",
        "upvotes": 117,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/brisnvqdg7dg1.png?auto=webp&amp;s=9219d66956ddb27ad74f622f8feaa9b2b0138ab6"
        },
        "permalink": "/r/movies/comments/1qc7scg/amaqa_announcement_sam_raimi_thursday_115_at_300/"
    },
    {
        "id": "1qbyiow",
        "author": "Dmitr_Jango",
        "title": "Michelle Williams Joins Damien Chazelle's Next Film",
        "content": "",
        "upvotes": 311,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jcj28TIiQF70rGT3z14wg78wHiCDlri9Ifs83f769AQ.jpeg?auto=webp&amp;s=02659c87912aa515077540bb330f4f2b3f221492"
        },
        "permalink": "/r/movies/comments/1qbyiow/michelle_williams_joins_damien_chazelles_next_film/"
    },
    {
        "id": "1qc3t5s",
        "author": "UniverslBoxOfficeGuy",
        "title": "All You Need Is Kill - Review Thread",
        "content": "*In the year 20XX, a huge and mysterious flower called \"Darol\" suddenly appears in Japan. Volunteers like Rita, a resourceful but lonely young woman who does not fit in with her peers, are dispatched to help clean up and rebuild. But one day, Darol suddenly emits a deafening signal, and its surrounding fruit bursts, revealing hordes of creatures that quickly slaughter everyone. Rita makes a valiant attempt to escape but dies in the attempt. Then... she wakes up again, only to witness the same tragedy. And again. Stuck in an inexplicable time loop, Rita struggles until she meets Keiji, a shy young man who is also experiencing the loop alongside her. Based on the worldwide best-selling light novel and manga, ALL YOU NEED IS KILL is a thrilling and big-hearted vision of what it means to live for tomorrow.*\n\nCast: Ai Mikami, Natsuki Hanae, Kana Hanazawa, Mochugakusei, Hiccorohee\n\nRotten Tomatoes score: 88% (9 reviews)\n\n2 reviews on Metacritic (one 80 and one 90)\n\nSome reviews:\n\nGregory Nussen, Screen Rant 6/10 - Kenichiro Akimoto's brisk film is a more faithful adaptation of Hiroshi Sakurazaka's book than Doug Liman's was, but what it gains in authenticity it loses in propulsion.\nhttps://screenrant.com/all-you-need-is-kill-movie-review/\n\nAlan French, Sunshine State Cineplex 9/10 - This is a must-watch experience for sci-fi fans, especially given the epic scope Akimoto delivers.\nhttps://sunshinestatecineplex.com/2025/08/04/fantasia-all-you-need-is-kill/\n\nAndrew Mack, ScreenAnarchy - The action sequences are amazing, and the main reason why you shouldn’t miss this when the chance arises. They keep growing in size and scale as Rita learns more about their enemy and equips themselves with stronger and stronger defenses to defeat it.\nhttps://screenanarchy.com/2025/08/fantasia-2025-review-all-you-need-is-kill.html\n\nJake Pitre, In Review Online - It can’t be overstated how much of a marvel the 3D animation is to behold... [but the] considerable pleasures... are unfortunately burdened by essential limitations.\nhttps://inreviewonline.com/2025/08/05/all-you-need-is-kill-review/\n\nRotten Tomatoes page: https://www.rottentomatoes.com/m/all_you_need_is_kill_2025\n\nMetacritic page: https://www.metacritic.com/movie/all-you-need-is-kill-2025/",
        "upvotes": 127,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4DoY-4BWCcltKxx4eecaLfPDxR7EWfZGMeBkKkRO1eA.jpeg?auto=webp&amp;s=7414a91253d47f09bd0ccf551a07256b370289f0"
        },
        "permalink": "/r/movies/comments/1qc3t5s/all_you_need_is_kill_review_thread/"
    },
    {
        "id": "1qc3v7w",
        "author": "BunyipPouch",
        "title": "Teyana Taylor Has Arrived: The Veteran Star on Her Breakout Year with 'One Battle After Another'",
        "content": "",
        "upvotes": 101,
        "comments": 48,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/abHbhF9KNVpWekLDXsunAYzqt2CUwB_7Rzf7ioIIUmA.jpeg?auto=webp&amp;s=0f72ec871755f89abc1c7fc50d39370887b438d4"
        },
        "permalink": "/r/movies/comments/1qc3v7w/teyana_taylor_has_arrived_the_veteran_star_on_her/"
    },
    {
        "id": "1qc3org",
        "author": "Fan387",
        "title": "‘Avatar: Fire And Ash’ Lords Over All With 10 VES Awards Nominations",
        "content": "",
        "upvotes": 101,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/twS8KY6tltoTwti4Cdcsc28TnauAI2vbk63SlEuXK2w.jpeg?auto=webp&amp;s=413c239f04cfef21c90191eede8931e3bbe8b8c6"
        },
        "permalink": "/r/movies/comments/1qc3org/avatar_fire_and_ash_lords_over_all_with_10_ves/"
    },
    {
        "id": "1qbzmt5",
        "author": "TerrifierBlood",
        "title": "Nicolas Cage, Justin Long &amp; Shelley Hennig Starring In Action-Thriller ‘Best Pancakes In The County’ About Deadly Standoff At Small-Town Diner",
        "content": "",
        "upvotes": 149,
        "comments": 34,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Sa5WV77ayFu4vshBGcihsq8kyVgvHwnO1Wy6-1v4GLQ.jpeg?auto=webp&amp;s=cd8824de46aed10d2d887216164297b90a7c9991"
        },
        "permalink": "/r/movies/comments/1qbzmt5/nicolas_cage_justin_long_shelley_hennig_starring/"
    },
    {
        "id": "1qc8asc",
        "author": "bludhavengabagool",
        "title": "Thomas Jane owns a DVD collection of Jean-Pierre Melville's crime films",
        "content": "\"Some of my favorite stuff is the \\[Jean-Pierre\\] Melville stuff right now. I have a collection of all of Jean-Pierre Melville's films. That's a great section of my DVD library that I always return to over and over again.\" -full article [here](https://www.thepopverse.com/tv-thomas-jane-the-expanse-detective-popversations-jean-pierre-melville)   \n  \nThomas Jane, I was not familiar with your game. ",
        "upvotes": 51,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FEhnUAwHnof1gSGFRU2GPsDQAqB6LFHAo_IaCgxbhnM.jpeg?auto=webp&amp;s=6c820397e450e7867177585d4e5f71f05d84ed3c"
        },
        "permalink": "/r/movies/comments/1qc8asc/thomas_jane_owns_a_dvd_collection_of_jeanpierre/"
    },
    {
        "id": "1qbj9h0",
        "author": "salaryboy",
        "title": "\"Why isn't XX a huge star?\"",
        "content": "Sorry for the meta-discussion, but these posts are killing me and the \"Why wasn't Ray Liotta bigger?\" post today was the last straw.\n\nAlmost every actor/actress this is posted about is at the pinnacle of their field and massively successful by any reasonable measure.\n\nIf an actor/actress is starring in feature films, or appearing in multiple projects per year, or has dozens of projects on iMDB, they are the equivalent of an NBA player--one of the top few hundred globally from a passion beloved and pursued by millions.\n\nIf they are recognizable or a household name, they are the equivalent of a starting NBA player--an incredibly elite circle.\n\nThere is only room for a handful of Jordans, Kobes, Lebrons, Brad Pitts, Matt Damons, and George Clooneys. Wondering why an incredible actor/actress isn't \"bigger\" is like wondering why Steph Curry \"isn't a bigger star\".",
        "upvotes": 1115,
        "comments": 388,
        "media": null,
        "permalink": "/r/movies/comments/1qbj9h0/why_isnt_xx_a_huge_star/"
    },
    {
        "id": "1qc7t3o",
        "author": "the_boundless",
        "title": "Ordered a pizza and about to put on Shoot 'em Up (2007)",
        "content": "I've not seen it since it was in theaters, but remember loving it. What other films are in this \"over the top\" action/comedy genre? I can only think of a couple: Smokin' Aces? Maybe? Less comedic than this one, but definitely over the top. How do ya'll feel about this one in particular? I love Giamati in this role as well. So silly!",
        "upvotes": 37,
        "comments": 73,
        "media": null,
        "permalink": "/r/movies/comments/1qc7t3o/ordered_a_pizza_and_about_to_put_on_shoot_em_up/"
    },
    {
        "id": "1qc8zpu",
        "author": "GoldDerby",
        "title": "‘Sinners’ cinematographer explains how they burned the house down in one take:",
        "content": "",
        "upvotes": 25,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nWE-tk9rD9gJdmnOjFtXeGa8AlZ8_qLovY_aemWSAX8.jpeg?auto=webp&amp;s=bef1e9ad806d185cd7c6e4467d8311f678114dd1"
        },
        "permalink": "/r/movies/comments/1qc8zpu/sinners_cinematographer_explains_how_they_burned/"
    },
    {
        "id": "1qbnw12",
        "author": "TeamAggressive1030",
        "title": "Downfall",
        "content": "Just watched the 2005 movie Downfall, a superb German film about Hitler's final days in April 1945, including his suicide, and Germany's surrender to the Allies soon thereafter.  Dunno how I missed it when it came out.\n\nIt's available on Prime Video at no extra cost.  Excellent English language subtitles are provided in the film.  Running time is 150 minutes.  I was quite moved by the ending.  Very happy to recommend it.\n\n\\*Edited to remove incorrect comment about actual war footage.",
        "upvotes": 258,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1qbnw12/downfall/"
    },
    {
        "id": "1qbtrmq",
        "author": "joesen_one",
        "title": "THR Director Roundtable 2026 - Chloé Zhao (Hamnet), Ryan Coogler (Sinners), James Cameron (Avatar: Fire and Ash), Kathryn Bigelow (A House of Dynamite), Joachim Trier (Sentimental Value), Yorgos Lanthimos (Bugonia)",
        "content": "",
        "upvotes": 101,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BfMUIXrLM6XCPOwAgqka561-Epgw2d5qSuXpV1yhd84.jpeg?auto=webp&amp;s=d5e845ce9adf8f589c33707b04fafc2eb347fccc"
        },
        "permalink": "/r/movies/comments/1qbtrmq/thr_director_roundtable_2026_chloé_zhao_hamnet/"
    },
    {
        "id": "1qbuqxx",
        "author": "playboy",
        "title": "Gus Van Sant on How He Rigged a Literal Dead Man's Wire - Playboy",
        "content": "",
        "upvotes": 87,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rLWUwP0jN0I0cM8yQWKxN9BWahWfuXrDzFtdo9YeMts.jpeg?auto=webp&amp;s=71c3f64bb92d55aa965a17f320643a5bf15bce11"
        },
        "permalink": "/r/movies/comments/1qbuqxx/gus_van_sant_on_how_he_rigged_a_literal_dead_mans/"
    },
    {
        "id": "1qc2b65",
        "author": "spinney",
        "title": "The Napa Boys: Official Teaser Trailer",
        "content": "",
        "upvotes": 35,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ARwVELuRf3U7Bmn5Ayg-fBuj1HojxSJJNvS_na977d4.jpeg?auto=webp&amp;s=b00ef8b2f4e13f3c41f2120ad6622561a7590e39"
        },
        "permalink": "/r/movies/comments/1qc2b65/the_napa_boys_official_teaser_trailer/"
    },
    {
        "id": "1qaz1i8",
        "author": "MarvelsGrantMan136",
        "title": "First Images from Lee Cronin's 'The Mummy' - The young daughter of a journalist disappears without a trace in the desert. The shattered family is stunned when the girl suddenly reappears eight years later. But what should have been a joyful reunion quickly turns into a true nightmare",
        "content": "",
        "upvotes": 6020,
        "comments": 461,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/aza2v16g0ycg1.jpeg?auto=webp&amp;s=5c08344a3d600a6820d17d5dd04cc48c439d9789"
        },
        "permalink": "/r/movies/comments/1qaz1i8/first_images_from_lee_cronins_the_mummy_the_young/"
    },
    {
        "id": "1qbxc73",
        "author": "browniebiscuitchildr",
        "title": "What are some movies that seriously explore what happens after the “happily ever after”?",
        "content": "\nThis isn’t limited to romance or marriage. I’m interested in movies that focus on the aftermath of a major win or turning point, like winning a war and returning home, defeating the villain, achieving a lifelong goal, or realizing success doesn’t fix everything.\n\n(FYI Totally inspired by The Scouring of the Shire chapter of Lord of the Rings that really encapsulates what I’m talking about. People who don’t like that penultimate chapter call it “anticlimactic” when that’s the *point.*)",
        "upvotes": 50,
        "comments": 130,
        "media": null,
        "permalink": "/r/movies/comments/1qbxc73/what_are_some_movies_that_seriously_explore_what/"
    },
    {
        "id": "1qb958p",
        "author": "BunyipPouch",
        "title": "Jesse Plemons on ‘Bugonia,’ Conspiracy Theories and Why Tom Cruise’s ‘Digger’ Feels Like a ‘Modern-Day Dr. Strangelove’",
        "content": "",
        "upvotes": 1362,
        "comments": 129,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/P5tlQmJ7w_E8uDMsLsETe8bkELNvPp3hWFYDIgxaDhc.jpeg?auto=webp&amp;s=df36412222b27e973464fcd7c1ed1071c7e0b23a"
        },
        "permalink": "/r/movies/comments/1qb958p/jesse_plemons_on_bugonia_conspiracy_theories_and/"
    },
    {
        "id": "1qb8eyi",
        "author": "abucalves",
        "title": "Boots Riley Confirms He’s Turning Post-Apocalypse ‘Simpsons’ Adjacent Off-Broadway Dark Comedy ‘Mr. Burns: A Post‑Electric Play’ Into A Movie",
        "content": "",
        "upvotes": 1430,
        "comments": 110,
        "media": null,
        "permalink": "/r/movies/comments/1qb8eyi/boots_riley_confirms_hes_turning_postapocalypse/"
    },
    {
        "id": "1qc65vr",
        "author": "SafeBodybuilder7191",
        "title": "Billie Piper, Johnny Flynn, Luke Thompson, Monica Dolan, Juliet Stevenson, Joe Locke, Adeel Akhtar &amp; More Join Andrew Scott &amp; Olivia Colman In Studiocanal’s Ian Charleson Film ‘Elsinore’",
        "content": "",
        "upvotes": 13,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OB_P6ESX6qgAVgxpE_c7VOke8UHVwuTt0AbAlr7tro0.jpeg?auto=webp&amp;s=99c16f570af59433e0bdf40e1b78e88d54daae51"
        },
        "permalink": "/r/movies/comments/1qc65vr/billie_piper_johnny_flynn_luke_thompson_monica/"
    }
]