[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 48,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 18,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qt1pww",
        "author": "MeanNothing3932",
        "title": "Best in Show Catherine O'Hara",
        "content": "For those of you who have or haven't seen it. It's a great movie and we love Catherine O'Hara as Cookie! It's a classic movie from the 90s. RIP Catherine we will miss your talent. ",
        "upvotes": 165,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1qt1pww/best_in_show_catherine_ohara/"
    },
    {
        "id": "1qt1u93",
        "author": "OverPotato2322",
        "title": "Netflix’s Conquest of Hollywood is Complete",
        "content": "",
        "upvotes": 46,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qt1u93/netflixs_conquest_of_hollywood_is_complete/"
    },
    {
        "id": "1qszcsc",
        "author": "Both_Departure_5331",
        "title": "What shows should a Breaking Bad and Better Call Saul fan watch",
        "content": "What would you recommend to someone who views Breaking Bad and Better Call Saul as the goated series - S tier series. Doesn’t necessarily have to be a drug related show but it should be as engaging, full of suspense and exciting - a high stakes show. Please list the shows on Netflix(doesn’t have to be an original) which are as enjoyable as these classics.",
        "upvotes": 71,
        "comments": 207,
        "media": null,
        "permalink": "/r/netflix/comments/1qszcsc/what_shows_should_a_breaking_bad_and_better_call/"
    },
    {
        "id": "1qt6r7i",
        "author": "Ur_Space_Girl",
        "title": "recommendations like new girl, himym, b99, friends",
        "content": "Im trying to find feel good series like new girl, himym, b99, gilmore girls, i could watch and make me feel like my millenial self again who can bingewatch series all night eventho i need to wake up at 4 in the morning. i want to feel like myself again and have a quick escape to this adulting world we are trying to survive in!!!!!!",
        "upvotes": 5,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qt6r7i/recommendations_like_new_girl_himym_b99_friends/"
    },
    {
        "id": "1qtioty",
        "author": "Standard-Party-5696",
        "title": "Stop streaming services from releasing show seasons in parts",
        "content": "Help stop streaming services from releases seasons in parts/episodes weekly like the old days when cable was the primary service for watching shows and movies!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qtioty/stop_streaming_services_from_releasing_show/"
    },
    {
        "id": "1qskipm",
        "author": "kaszpur",
        "title": "What are your go-to comfort shows?",
        "content": "I watch a decent amount of things I haven’t seen before but there are shows I love to rewatch because they feel familiar. Shows that make you feel calm or safe. There are specific shows I’ll just put on even while I’m going to sleep at a low volume. Usually corny light hearted things like the big bang theory has been my go to lately. What are your comfort shows? ",
        "upvotes": 77,
        "comments": 180,
        "media": null,
        "permalink": "/r/netflix/comments/1qskipm/what_are_your_goto_comfort_shows/"
    },
    {
        "id": "1qs7mho",
        "author": "Large-Cardiologist54",
        "title": "Why do I keep rewatching the same shows instead of starting new ones?",
        "content": "I have a whole watchlist. So many “good” shows saved. But every night I end up rewatching the same comfort show I’ve already seen 5 times. It’s like my brain doesn’t have the energy to try something new. Anyone else stuck in this loop? 😅",
        "upvotes": 264,
        "comments": 167,
        "media": null,
        "permalink": "/r/netflix/comments/1qs7mho/why_do_i_keep_rewatching_the_same_shows_instead/"
    },
    {
        "id": "1qt66e5",
        "author": "DevWarrior504",
        "title": "Which horror/thriller shows do you most wish had continued?",
        "content": "I just finished “The Watcher” on Netflix again and started wondering why it never got a proper continuation, and whether it even should have.\n\nWhich horror or thriller TV shows were cancelled way too early and really deserved another season or kept going when they should have stopped a long time ago?",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1qt66e5/which_horrorthriller_shows_do_you_most_wish_had/"
    },
    {
        "id": "1qsayt8",
        "author": "Slow-and-low-15",
        "title": "WHY?!",
        "content": "Rant from US: I didn’t ask for \\*mobile games\\* but my eyes are assaulted by them every time I look at my home page. And now, I’m supposed to watch PODCASTS?? On Netflix?? Who wants this?! I hate it.",
        "upvotes": 135,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1qsayt8/why/"
    },
    {
        "id": "1qt1xzf",
        "author": "ArmyNegative2743",
        "title": "TVD, nasa Netflix na!",
        "content": "Finally nasa Netflix na ang The Vampire Diaries na noon ay napapanood pa natin via DVD series or tyinatyaga sa movie apps na may adds! Labas na mga fans ni Elena, Damon, at Stefan pati na rin ni Bonnie, Caroline, etc. Happy watching sa mga katulad kong nangarap minsan maging vampire!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qt1xzf/tvd_nasa_netflix_na/"
    },
    {
        "id": "1qt5aar",
        "author": "rosstoferwho",
        "title": "Why can you not watch the wrestling properly on your phone next day",
        "content": "When you skip ahead it just goes back to the start of the show. \n\nSo you could be halfway through the show. And it will just go back to the start. No matter how much you try to skip. \n\n.sort your fucking shit out netflix ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qt5aar/why_can_you_not_watch_the_wrestling_properly_on/"
    },
    {
        "id": "1qt7xsl",
        "author": "gamer1913",
        "title": "Why does netflix say there is gonna be new episodes for a show and than just doesen't add it?!",
        "content": "This is the seconde time this happened to me i look forewherd to watching the new ep they said they will add than the day comes there are no new ep but the show is gone frop netflix now its appened again i was looking forewherd for S3 of ghost they sad it came today but no its not here ...",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1qt7xsl/why_does_netflix_say_there_is_gonna_be_new/"
    },
    {
        "id": "1qso67y",
        "author": "Secret_Scallion_3452",
        "title": "Dhurandhar is #1 on Netflix and honestly… I get it now",
        "content": "Just saw Dhurandhar pop up at #1 on Netflix since Day 1.\nI watched it in theatres when it released, thought that was enough.\nBut rewatching at home hits different.\nYou catch so many small things you miss on the big screen because you’re just overwhelmed by everything happening.\nThe rewatch spike is real.\nNo wonder it’s trending like crazy.\n",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qso67y/dhurandhar_is_1_on_netflix_and_honestly_i_get_it/"
    },
    {
        "id": "1qt8jr1",
        "author": "joe102938",
        "title": "Netflix is awful now. I just want to watch 28 years later, but I need to upgrade my subscription to see it. I hate that Netflix has the rights to it.",
        "content": "Seriously, I already pay them a monthly fee. I can't afford to double that. And the only way to watch 28 years later is with a premium Netflix subscription, or rent it. ",
        "upvotes": 0,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1qt8jr1/netflix_is_awful_now_i_just_want_to_watch_28/"
    },
    {
        "id": "1qrdfop",
        "author": "phillygirllovesbagel",
        "title": "Catherine O'Hara Dead at 71",
        "content": "",
        "upvotes": 1488,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1qrdfop/catherine_ohara_dead_at_71/"
    },
    {
        "id": "1qsprgj",
        "author": "Giozztan",
        "title": "Is it just me or does the subs not translate text on screen?",
        "content": "The app is great overall and the collection is superb. I just have a problem with the subs being only on the one line and not being able to cover some important information especially when the dialogue is ongoing over the text shown on screen. This is very evident when watching anime. There are many instances where the text shown on the show is not translated due to an ongoing conversation/dialogue that is being prioritized by the subs. I wish there was a way that the subs would also include the texts seen on screen even when there is an ongoing dialogue.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qsprgj/is_it_just_me_or_does_the_subs_not_translate_text/"
    },
    {
        "id": "1qst8bj",
        "author": "strawberry_arii",
        "title": "Finding her edge- review",
        "content": "I just finish this short show just to try something different and honestly it was a 2 out of 5 stars. Had potential to be something good but the ending was soo  bad. I have the same review for a couple more series I've seen recently ...",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qst8bj/finding_her_edge_review/"
    },
    {
        "id": "1qs2cec",
        "author": "7856356",
        "title": "I don’t think I can continue Tell Me Lies after season 2",
        "content": "I just binge watched Tell Me Lies seasons 1 and 2 over the last two days, and I honestly don’t know how to process what I’m feeling right now.\n\nBy the end of season 2, I felt physically sick. Like genuinely nauseous, sweating, head pounding, stomach turning. I’ve never had a show affect me like this before. It wasn’t just “wow that was intense”, it felt disgusting, suffocating, and overwhelming in a way I can’t even properly describe.\n\nI hate Stephen. I don’t think I’ve ever hated a fictional character this much. He’s manipulative, toxic, emotionally abusive, and watching him operate felt draining and disturbing. But what hurts even more is Lucy. Watching her repeatedly abandon her self respect, excuse his behavior, and spiral deeper just made me angry and sad at the same time. It’s frustrating in a way that feels personal.\n\nHonestly, I can’t even name many “good” characters in this show. The only one who felt remotely decent to me was Wrigley. He’s messed up too, sure, but compared to everyone else, he didn’t actively destroy people the way the others did.\n\nThe worst part is the show is captivating. The writing, the tension, the way it pulls you in… it works. That’s why it’s so hard. I went in planning to watch all three seasons eventually, but after finishing season 2, I’m done. I can’t continue. I don’t care how good the plot is.\n\nMy mental health feels wrecked right now. I’ve got a headache, my chest feels tight, I can’t breathe properly, and I don’t think I’ll be able to eat for at least a day. I know it’s “just a show,” but the emotional weight of it hit way harder than I expected.\n\nI just needed to get this out somewhere because this reaction scared me.\nHas anyone else felt this messed up after watching it? Or am I alone in this?",
        "upvotes": 26,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1qs2cec/i_dont_think_i_can_continue_tell_me_lies_after/"
    },
    {
        "id": "1qses3d",
        "author": "saintly_devil",
        "title": "Eko - an incredibly nuanced thriller",
        "content": "I'm probably going to get bombed with racist comments here, but to those who can look past it.\n\nEko is a Malayalam language slow burn thriller (movie) from India, currently on Netflix. No, it's NOT Bollywood (which sucks, for the most part). No, it DOES NOT have songs and dances. It's two hours of brilliant and nuanced storytelling, building layer upon layer before a finale that not many can see coming. If you're open to foreign movies, give this a look.\n\n",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qses3d/eko_an_incredibly_nuanced_thriller/"
    },
    {
        "id": "1qsptsc",
        "author": "n0name_89",
        "title": "Signing in problems",
        "content": "The context;\n\nI’m a TmObile magenta holder so i get my Netflix account covered through them. \n\nI’m a college student that travels between an apt and their parents\n\nWe have no household internet\n\nThe issue;\n\nBecause I’m the only person in my family that uses Internet, when i moved out for college, we chose to stop paying for the internet. However, even though I’m back home every other weekend, it still forces me to input a temp code. It also does it to my family, even though they don’t travel anywhere, much less overnight. They have to ask me for the temp code too, and I’m just so lost as to how this thing works. I thought it used ip addresses and things to detect a “home” but even though I’m the main owner, and they live in the main house, none of us can enjoy having access to this stupid app. Does this happen to anyone else? Is it bc i don’t have WiFi? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qsptsc/signing_in_problems/"
    },
    {
        "id": "1qspelf",
        "author": "No_Experience_3255",
        "title": "Cooking show name",
        "content": "i’m trying to find out the name of a show from a clip on Instagram I watched. I’m pretty sure it’s a recent clip, but it’s a cooking competition show I believe where an Asian cooks a meal for himself as a challenge and the whole thing is it’s something that he normally cooks for himself after getting off work or something like that. What’s the name? Think it’s a Netflix clip?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qspelf/cooking_show_name/"
    },
    {
        "id": "1qt00wz",
        "author": "Revolutionary-Ad4469",
        "title": "Why is She-Ra leaving Netflix?",
        "content": "Can someone explain why She-Ra is leaving Netflix? I was under the impression it was a Netflix original, so I’m confused why it wouldn’t be staying on the platform. ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1qt00wz/why_is_shera_leaving_netflix/"
    },
    {
        "id": "1qskv78",
        "author": "jcwolf12",
        "title": "Fast forwarding through live event",
        "content": "On mobile. I was trying to fast forward through a streamed event that was already finished. I kept scrubbing through but it was not fast forwarding through to the right part and despite skipping 3 hours ahead it was still pretty much in the first hour despite time codes saying it was 3 hours ahead. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1qskv78/fast_forwarding_through_live_event/"
    },
    {
        "id": "1qsjiy1",
        "author": "No-Mine5802",
        "title": "Alice in 11.22.63",
        "content": "I think it was the first episode where Jake meets a waitress in the past named Alice and seems to recognize who she would be in the future. He tells her to \"behave hersel\" or something like that.  Who is Alice?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qsjiy1/alice_in_112263/"
    },
    {
        "id": "1qrip4p",
        "author": "Pawssabillitysawait",
        "title": "The end of the F***ing world.",
        "content": "I think this is one of my absolute all time netflix favs, and the second season is actually arguably better than the first, which is rare for television shows in my opinion. I never hear anyone talk about it, but i highly recommend it to everyone. It is amazing if you like coming of age/teen shows, that have a more serious theme.",
        "upvotes": 91,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1qrip4p/the_end_of_the_fing_world/"
    },
    {
        "id": "1qrf5r4",
        "author": "Less_Manufacturer218",
        "title": "Elizabeth Smart documentary, what a powerful family. Must watch",
        "content": "Just wanted to say how impressive the entire Smart family is. From Mary Katherine remembering and cracking the case, to her parents and uncles never giving up. And of course Elizabeth, a true survivor with incredible strength.\n\nWill make you cry. ",
        "upvotes": 110,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1qrf5r4/elizabeth_smart_documentary_what_a_powerful/"
    },
    {
        "id": "1qsc5fm",
        "author": "Mochog",
        "title": "Any chance for Netflix to stream live concerts?",
        "content": "Since boxing streams achieved a significant global success—according to google search, will there also be a chance for the platform to stream live concerts? Pretty sure they will also somehow manage to make a profit out of it, and to think that there will be massive to almost unlimited contents for their subscribers to see.",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1qsc5fm/any_chance_for_netflix_to_stream_live_concerts/"
    },
    {
        "id": "1qsmt41",
        "author": "CharmMaximum",
        "title": "Netflix L6 PM - Silence After Final Presentation &amp; Follow-Up (No Response Yet)",
        "content": "I had my final presentation for Netflix L6 Product Manager on Friday, Jan 23 (2-3pm slot).\n\nProcess so far:\n\n•  Recruiter screen\n\n•  Hiring Manager interview\n\n•  4 cross-functional interviews (all passed)\n\nDuring the HM interview, she explicitly said she wants to move forward. I heard back from the recruiter just 1 day after the cross-functional rounds.\n\nAfter the final presentation: total silence. I followed up with the recruiter on Thursday, Jan 29. Still nothing as of Saturday, Jan 31.\n\nThis feels weird given Netflix’s reputation for fast feedback (quick rejections, etc.). \n\nHas anyone experienced similar delays or silence at this stage? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qsmt41/netflix_l6_pm_silence_after_final_presentation/"
    }
]