[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 480,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1h6h49s",
        "author": "misana123",
        "title": "‘Wednesday’ Season 2 Wraps Production",
        "content": "",
        "upvotes": 22,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h6h49s/wednesday_season_2_wraps_production/"
    },
    {
        "id": "1h6ko7w",
        "author": "Atlast_2091",
        "title": "‘Wednesday’ Season 2 Wraps Production and Debuts New Look at Jenna Ortega’s Signature Frown",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h6ko7w/wednesday_season_2_wraps_production_and_debuts/"
    },
    {
        "id": "1h6k9tm",
        "author": "gougluinn",
        "title": "netflix videos are too dark!",
        "content": "hello videos are too dark on netflix and netflix doesnt have adjust video brightness feature and they also banned/blocked 3rd party addons i guess because the screen goes black when i increase brightness via 3rd part addons on chrome.\n\nso how can i increase brightness? right now movies are not watchable.\n\nor maybe microsofts stupid hdr feautre causes this who knows??",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h6k9tm/netflix_videos_are_too_dark/"
    },
    {
        "id": "1h5p4yu",
        "author": "aresef",
        "title": "‘Cunk On Life’ Netflix Special Sets January Premiere Date",
        "content": "",
        "upvotes": 178,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1h5p4yu/cunk_on_life_netflix_special_sets_january/"
    },
    {
        "id": "1h6l3oh",
        "author": "creel_mg",
        "title": "Will be gifting Netflix to my sister for her birthday",
        "content": "I have never purchased Netflix but want to gift at least an year of subscription to my sister. In India, there is no option to have a Netflix gift card but there are workarounds to this. My main concern is that I was initially thinking of buying the Standard Plan (499 INR : 5.89 USD per month) which supports 2 concurrent devices on a household network but I can also afford the Premium Plan (649 INR : 7.66 USD per month) which supports 4 devices. The all time big question - will it be possible to have 2 devices on one wifi at my house and 2 devices on my sister's wifi in her house. She is married but it is possible for us to bring the 4 devices on the same network at least once a month. Will this work with the netflix household? Please any help is appreciated.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h6l3oh/will_be_gifting_netflix_to_my_sister_for_her/"
    },
    {
        "id": "1h6ekw5",
        "author": "Fresh_Elevator7063",
        "title": "Inside Man - Grieff’s Wife ",
        "content": "I might be a little late on this but after finally watching, here’s my take: \n\nGrieffs wife may have walked in on him cheating. That line, \"If you love someone, don’t come home early,\" feels like a major hint. In a fit of rage, she strangles his mistress. Grieff, out of love or guilt, decides to take the blame. Since he’s a criminal psychology expert, he stages everything to make it look like he killed his wife in a moment of madness. She goes into hiding in the UK. \n\nIt seems like the police simply accepted Grieff’s confession and didnt do any further investigating. All they focused on was finding the missing head - to bury her body whole. Grieff knows that if they were ever to find the head it would show that the woman they buried was not his wife ...\n\nFast forward to when Janice bumps into Beth on the train. Although she'd been the one to publicly stand up for Beth, she is very reluctant to chat further and refused multiple times to be interviewed. She also mentioned not having Facebook. She had a very \"loner\" attitude and didn't want to be in the public eye.  \n\nBeth then received the distress message from Janice and essentially starts the process of finding her \"friend\" with Grieff... after long debate. \n\nAlthough Grieff has insane resources at hand.. he seems to know just that little bit more about Janice as the investigation continues. He knew that she had a Skype call with her sister that she never misses... did he know that because he knew his wife would never abandon her sister... even if she was in hiding ... maybe the Skype call was to him every day. The matter of how he got that information before getting into her apartment is suspect. \n\nWhile Janice is trapped she is very strategic and understanding of her circumstances. Taking very tactical measures in attempt to escape... leading me to believe she has this knowledge from growing up with a mafia dad... she's not just a regular math tutor. \n\nAs we all know, the Vicars wife is killed and he is arrested. Him and Grieff are shown on a call together. The Vicar argues to Grieff that he is not a murderer and he did not murder anyone. To which Grieff replies.. \"Oh you didn't murder Janice - But if you hadn't have acted the way you did, would your wife still be alive?\" \n\nHe wants the Vicar to understand that it was solely his actions that resulted in someone's death.. just as his had resulted in the same. They're not so different after all. \n\nNow, let’s talk about the scene where Janice visits Grieff on death row. Their interaction feels... familiar, more than a mere acquaintance from the ordeal. \nDillon’s grin when the guards leave the room shows that there is a mischievous atmosphere between them. \n\nWhen Janice says, \"I understand you'll be dead in a week,\" Grieff replies with, \n\"Do you? Personally, I'm having a little trouble with the fact of my execution.\" \nThe way he emphasizes \"fact of my\" feels like he’s mocking her slightly. \n\nJanice explains why she’s meeting with them - her husband's murder. Dillon says \n\"With all due respect, you do know your husband isn’t actually dead.\" \nHis mannerisms seem like he's hinting towards an inside joke. \nJanice’s response, \"No, but he deserves to be,\" obviously still holding on to a bit of cold blood and referring to his betrayal. \n\nShe asks him why he seems surprised at this.. \n\nGrieff then says, \"This is death row, Janice. We're all murderers here,\" and she grins knowingly... as, theoretically, there are 3 murderers in that room. \n\nIt feels like Janice, after being saved by her husband for a second time, and hearing that he will be executed in a week (because he refused to give up the head/real story), had a change of heart and wanted to plan how they could get away with his \"murder\" and ultimately break him out. \n\nAs for Janice’s father, his involvement in shady stuff—maybe CSAM— that might explain why Janice was so (annoyingly) triggered by what was on the flash drive.\n\nMaybe introducing an impulsive gangster of a father hints towards why she’s a bit of a psychopath herself.\n\nAnd maybe that’s why Beth doesn’t write the story... She knows the truth now and wants to protect her identity.\n\nAny thoughts? \n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h6ekw5/inside_man_grieffs_wife/"
    },
    {
        "id": "1h6huad",
        "author": "Atlast_2091",
        "title": "Sakamoto Days | Official Trailer | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h6huad/sakamoto_days_official_trailer_netflix/"
    },
    {
        "id": "1h68nnc",
        "author": "Best_Mammoth_9589",
        "title": "The Hollow Season 2 sucks",
        "content": "Season one is possibly one of my favorite shows of all time. It was so engaging and intriguing and the characters felt authentic and well rounded the world building was interesting, and while I didn’t like how they went to real people at the end, I was so excited for season two. \n\nSeason two, we start out extremely confused. It feels like season one was all for nothing, seeing as they are still in the game for some reason. Time passes, the characters keep doing the video game thing, but somethings off. Anyway, long story short, season two doesn’t have the main characters in it at all. These are clones, perfect copies yes but they aren’t the original MCs. The original characters are in the real world. I figured this out on episode three. Unlike with the original season one, I immediately knew what was going on pretty much from the get go. \n\nIesperately want to know what happened from there? But I guess we will never know seeing as it got canceled. Not surprised how bad that season was. I would’ve loved it if we had gotten a take two almost. They are a team are they not? They would play hollow over and over again. I would’ve loved to see the same three characters in a different  game of hollow. perhaps new sides of their characters and dynamics would show in different environments? Starting from scratch, no memories. Alternatively, I would’ve loved to see how their lives continued in the real world after the game. Their relationships, etc, etc. What we got was so boring and low stakes in comparison.\n\n  \napparently, a lot of people loved it. So happy for you. I am not there, I don’t think I will ever be there. please don’t yell at me for having a different opinion.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h68nnc/the_hollow_season_2_sucks/"
    },
    {
        "id": "1h68f87",
        "author": "HeliumRhenium",
        "title": "the snow sister",
        "content": "has anyone watched this?! what did you think?? need someone to talk to about it 😭😭😭\n\nknew it was gonna be sad and could also tell that twist was coming BUT it still broke heart...I cried so much 😭😭😭\n\nseeing how depression is expressed differently between the adults and children is so subtle but deeply moving. the ice skates scene...oof. \n\n",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h68f87/the_snow_sister/"
    },
    {
        "id": "1h6f0pj",
        "author": "S4v1r1enCh0r4k",
        "title": "It seems that 'Quicksilver' romantasy adaptation is coming to Netflix, they won the bidding war with a massive 7-figure deal",
        "content": "",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h6f0pj/it_seems_that_quicksilver_romantasy_adaptation_is/"
    },
    {
        "id": "1h5truk",
        "author": "Horror_Effective12",
        "title": "'The Madness' Review - Is it actually binge-worthy?",
        "content": "",
        "upvotes": 29,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1h5truk/the_madness_review_is_it_actually_bingeworthy/"
    },
    {
        "id": "1h67ljv",
        "author": "gumbo100",
        "title": "Unable to cast Netflix and only Netflix, other apps work fine",
        "content": "I can't cast from my laptop or my phone. This is the second time I've restarted my subscription and had this problem. I could really use some TV right now and would appreciate the help.\n\nI've updated my app/browser. I've made sure the chromecast has powered down and then turned back on. They are for sure on the same wifi - other apps work. I simply have no clue what the issue is",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h67ljv/unable_to_cast_netflix_and_only_netflix_other/"
    },
    {
        "id": "1h66q04",
        "author": "TumbleweedCold5792",
        "title": "Dimming problems due to Dolby vision (I think)",
        "content": "So, I was trying to watch a show and whenever I watch it, regardless of how bright I make my screen, it dims down heavily. Anyone solve this or is it just me? I’m using an iPhone to watch I should mention. I think it may have to do with Dolby vision, but I’ve looked through my settings and found nothing. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h66q04/dimming_problems_due_to_dolby_vision_i_think/"
    },
    {
        "id": "1h5nkq3",
        "author": "reddittiess",
        "title": "Subtitle font colour stuck in black",
        "content": "TV Netflix substitute stuck in black font. No matter what style I change it to, it always goes back to black font colour. It’s really hard to read, any help is appreciated ",
        "upvotes": 50,
        "comments": 64,
        "media": null,
        "permalink": "/r/netflix/comments/1h5nkq3/subtitle_font_colour_stuck_in_black/"
    },
    {
        "id": "1h5yman",
        "author": "Same_Celery_6273",
        "title": "netflix with ads but almost none",
        "content": "i watched breaking bad from start to finish and i think i got like 5 ads the whole series. hbo max or peacock have like 5 ads every episode. 7 bucks for this seems like a steal",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1h5yman/netflix_with_ads_but_almost_none/"
    },
    {
        "id": "1h6bzo9",
        "author": "daily_mirror",
        "title": "First Look Review: That Christmas on Netflix from Love Actually's Richard Curtis",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h6bzo9/first_look_review_that_christmas_on_netflix_from/"
    },
    {
        "id": "1h6aj61",
        "author": "crazywave83",
        "title": "Netflix subtitles semi transparent dolby vision… no more?",
        "content": "Hi all. I changed subtitles appearance in the Netflix website to semi transparent some years ago… everything was fine on my OLED TV until yesterday. Now everithing in dolby vision has too bright subtitles. No dolby vision content/SDR is ok with semi transparent subtitles. Does Netflix changed something? I tried also reinstalling the app but nothing changed. Thank you",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h6aj61/netflix_subtitles_semi_transparent_dolby_vision/"
    },
    {
        "id": "1h6agoi",
        "author": "ErosUno",
        "title": "Netflix through FIOS issues ",
        "content": "Since last month Netflix decided my home TV was too old for them to allow me to use. I now must stream through my FIOS. The FIOS remote only responds when it feels like and gets stuck routinely. Is there anything that I can possibly do?  I've tried streaming via phone and the feed starts chattering at random. I am getting ripped off by Netflix. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h6agoi/netflix_through_fios_issues/"
    },
    {
        "id": "1h656b9",
        "author": "Short-E-8814",
        "title": "One more “extra member” notification and I’m cancelling Netflix for a while.",
        "content": "I've been getting these \"extra member\" notations telling me to add an extra member because it detects more than two users. But I don't have more than two users. Netlflix thinks one device is permanently showing even though it's off. They're tying each account to a device. F that. Give me one more notification, I'm out. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h656b9/one_more_extra_member_notification_and_im/"
    },
    {
        "id": "1h6504j",
        "author": "Donceko",
        "title": "Cancelled extra member slot but still being forced to activate account?",
        "content": "Hi, I may have accidentally created extra member slot which I not need. I have already cancelled extra member slot but I am still forced to create an account for extra member. I can't watch anything unless I do it. I don't mind paying £5 extra this month as I have cancelled this membership slot so I won't be charged for the next month. What do I do?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h6504j/cancelled_extra_member_slot_but_still_being/"
    },
    {
        "id": "1h696qi",
        "author": "investorhalp",
        "title": "Help Identifying the Song from \"Dear Sa-chan\" (Sacchan, Boku wa.) Episode 8",
        "content": "Hi everyone,\n\nI’m trying to find a specific song from *Dear Sa-chan* (Sacchan, Boku wa.) Episode 8, which aired in 2024. The track plays around the 11-minute mark, and I’ve tried using Shazam to identify it, but no luck so far. Does anyone happen to know the name of this song or the artist?\n\nIt’s really sticking with me, and I’d love to add it to my playlist. I’ve checked online, but so far, I haven’t been able to find any details. If anyone has an idea or can point me in the right direction, it would be greatly appreciated.\n\nThanks in advance for your help!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h696qi/help_identifying_the_song_from_dear_sachan/"
    },
    {
        "id": "1h5lxxe",
        "author": "WorriedAd870",
        "title": "Arcane Creator Speaks Out on Rushed Story Complaints and Future Plans",
        "content": "",
        "upvotes": 17,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1h5lxxe/arcane_creator_speaks_out_on_rushed_story/"
    },
    {
        "id": "1h5x4xt",
        "author": "WaferMundane5687",
        "title": "Sweet Bobby",
        "content": "Can we just discuss this documentary on Netflix rn? I really wanna know the opinions of others who have watched this. Am I the only one who really doesn't feel bad for this lady? Also how does her cousin have so much time to make a family of fake profiles and text 24/7????? It genuinely made me mad how annoying everyone in this show was.",
        "upvotes": 5,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1h5x4xt/sweet_bobby/"
    },
    {
        "id": "1h66xq7",
        "author": "EnvironmentalAd1988",
        "title": "New subscriber question",
        "content": "I just subscribed to the ad tier for $5.99, it says you can have 2 devices. Does that mean 2 devices in the same household can watch at the same time? Or does that mean you can only login to your netflix on two devices ever? For example, my father has netflix on his tv in the living room and I have nexflix on my PS5 in my room, does that mean I could never login on my laptop? Or could I login on any other device in my house as long as only two are logged in at the same time?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h66xq7/new_subscriber_question/"
    },
    {
        "id": "1h66m7r",
        "author": "DomTheSpider",
        "title": "Mass blocking",
        "content": "I have kids between kindergarten and 4th grade. Whereas I'm *generally* OK with the available content options for the kindergartener, I am much less OK with the content for 10 year olds. And there's so much of it that going through and blocking all the undesirable content show by show is too cumbersome. I'd love it if there were certain blacklists I could just apply once and be done.  Does anything like that exist?\n\nSide note, it is super annoying that the blocking is so specific that in order to block all of some certain series (for example, Blippi), I have to block 6-10 different specific shows and do it on each profile. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1h66m7r/mass_blocking/"
    },
    {
        "id": "1h5uyzy",
        "author": "Gandalf-the-Pro",
        "title": "I Hate Christmas (Odio il Natale) season 3 comming soon?",
        "content": "I can't find any news or info about the series continuation. Is the latest season comming this Christmas or is it canceled? We watched it every year since it came out and would feel weird not having it at this point, ot's like a Christmas tradition to watch the latest season. Would be nice if it continued, especially since it didn't have a proper ending yet. Any info abot this would be appreciated! ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h5uyzy/i_hate_christmas_odio_il_natale_season_3_comming/"
    },
    {
        "id": "1h5mf27",
        "author": "techfinpro",
        "title": "'Longmire' Leaving Netflix in January 2025",
        "content": "",
        "upvotes": 11,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h5mf27/longmire_leaving_netflix_in_january_2025/"
    },
    {
        "id": "1h63cd8",
        "author": "MusicianEven6588",
        "title": "Glitches on phone",
        "content": "",
        "upvotes": 2,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5xbxcjh8bq4e1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1h63cd8/glitches_on_phone/"
    },
    {
        "id": "1h5xuxj",
        "author": "GenTrapstar",
        "title": "How I Met Your Mother",
        "content": "Just finished the show and it was great. Last episode took a little turn I wasn’t expecting. Two Barney(Neil Patrick Harris) in my eyes was the glue of the show. Time to find another show in between my anime shows. Any suggestions. I’ve watched Seinfeld, Friends, Big Bang Theory, The Office and a few others.  Just curious if there’s other long running sitcoms I can check out on Netflix. ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1h5xuxj/how_i_met_your_mother/"
    },
    {
        "id": "1h4r2iw",
        "author": "Robemilak",
        "title": "Dark premiered on Netflix 7 years ago today. One of the best shows ever?",
        "content": "",
        "upvotes": 1361,
        "comments": 242,
        "media": null,
        "permalink": "/r/netflix/comments/1h4r2iw/dark_premiered_on_netflix_7_years_ago_today_one/"
    }
]