[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 5,
        "comments": 38,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 52,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1l65loo",
        "author": "phaffgiraffe",
        "title": "Dept Q - Season 2?",
        "content": "When does Netflix typically announce they’re renewing a series for season 2? I NEED a second dept q series - and fear I won’t sleep until it’s announced. Netflix put me out of my misery please, or help me manage my expectations. 😅 \n\nDoes anyone have any example timelines from other similar shows? \n\n",
        "upvotes": 24,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1l65loo/dept_q_season_2/"
    },
    {
        "id": "1l5zkqa",
        "author": "Movingskyclub",
        "title": "Parents stayed over for a week watching Korean dramas. How do I delete that history so I stop getting recommended shows similar to those?",
        "content": "I have no taste for Korean dramas, sadly, and now I’m getting lots of recommendations for “internationally acclaimed romantic dramas”. How do I stop this, short of resetting my watch history?",
        "upvotes": 68,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1l5zkqa/parents_stayed_over_for_a_week_watching_korean/"
    },
    {
        "id": "1l5yp3d",
        "author": "Inevitable-Scar-2982",
        "title": "Please give me some good mind bending shows!",
        "content": "I love shows that make you think and leave you stunned. I wanted to be genuinely shocked!\nLike I’ve seen Dark and it was the best shows I’ve EVER EVER SEEN! I need shows like Dark, The OA, Umbrella Academy, Love, death and robots, Black Mirror and Years and Years. I can’t explain what you’d call these but just ones with twists and that aren’t predictable. \nPlease give me some actual good shows along these lines, I tried ‘From’ and I just found it too boring and couldn’t get into it. Please no detective dramas! I lot of these shows are going in an AI direction which is really cool. \n\nI just need something gripping from start to finish, no predictability. ",
        "upvotes": 71,
        "comments": 129,
        "media": null,
        "permalink": "/r/netflix/comments/1l5yp3d/please_give_me_some_good_mind_bending_shows/"
    },
    {
        "id": "1l6ayhm",
        "author": "BigAgreeable6052",
        "title": "English dubbing - why so terrible in comparison to other languages?",
        "content": "So I can speak German and English fluently. However, whenever I opt to dub a show I pick German as it tends to be a lot better.\n\nThe English dubbing usually feels like it's been recorded in a tin can, with 0 intonation.\n\nPart of me wonders whether I'm both more used to German dubbing and German dubbing is more developed because they do a lot.\n\nIn contrast, I feel like English speakers don't usually watch dubbed content. Hence English dubbing has less effort in it?\n\nAlso English dubbing also has such heavvvyyy American accents. Sometimes I wish that if it's a Spanish show they'd dub with Spanish English accents to keep it more authentic?\n\nWhat do people think? I literally can't listen to English dubbing as it's sooooo bad.",
        "upvotes": 6,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1l6ayhm/english_dubbing_why_so_terrible_in_comparison_to/"
    },
    {
        "id": "1l6elvj",
        "author": "S4v1r1enCh0r4k",
        "title": "Bunch of Arcane season 2 storyboards, concept art &amp; sketches has been exhibited during Annecy Festival this year",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l6elvj/bunch_of_arcane_season_2_storyboards_concept_art/"
    },
    {
        "id": "1l66hoa",
        "author": "0980988890",
        "title": "Similar shoes to Sirens?",
        "content": "I loved Sirens so so much. Perfectly silly, entertaining and a complete disconnect from real life while watching it. \n\nAre there any other shows that you recommend that are similar to it? I love shows where I switch off from the world and was truly sad when it ended LOL. ",
        "upvotes": 7,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1l66hoa/similar_shoes_to_sirens/"
    },
    {
        "id": "1l6etap",
        "author": "Level_Most_2903",
        "title": "Recommendations",
        "content": "Just bought Netflix and was wondering if there is anything decent to watch on Netflix at the moment? I have just Started watching adolescence. Give me recommendations peeps ",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1l6etap/recommendations/"
    },
    {
        "id": "1l5n21b",
        "author": "Five50am",
        "title": "Anyone else watch Netflix less since they updated the layout?",
        "content": "I personally can't stand it. I loved how you could see many options on the screen and now it's like your zoomed in and have to scroll for days to see everything. I don't understand why they tried to fix what wasn't broken.",
        "upvotes": 72,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1l5n21b/anyone_else_watch_netflix_less_since_they_updated/"
    },
    {
        "id": "1l5v4np",
        "author": "Remote_Nature_8166",
        "title": "I wish they could fix that annoying issue",
        "content": "So if i’m watching a show and it only has three minutes left, if I accidentally exit it and go back to it, it just winds up back at the beginning even though I wasn’t done with the episode and I gotta scroll all the way back. That’s such a stupid feature. It should just be doing that when it hits the credits.",
        "upvotes": 16,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l5v4np/i_wish_they_could_fix_that_annoying_issue/"
    },
    {
        "id": "1l6ania",
        "author": "Lumpy-Addendum8288",
        "title": "watching netflix on pc i get bad video quality",
        "content": "i have a Standard plan and i watch stuf, but the is a weird thing, then i watching netflix on my pc the video quality degrades like then i start playing it shows in 1080p but over a few min it degrades to really bad quality no mater if i'm on web and pc app ver. off netflix. i don't have this problem on my phone, tablet and laptop (same web or app no problem). and yes my internet is really good (i would probably even abile to stream 4k is i had premium plan) and in netflix playback Settings i made data usage to high but still same probem on my pc. any ideas ?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l6ania/watching_netflix_on_pc_i_get_bad_video_quality/"
    },
    {
        "id": "1l5j6ro",
        "author": "jerkoff1610",
        "title": "The story of Raymond West and his link to the Tylenol Murders",
        "content": "Watched The Tylenol Murders, the Netflix doc about a week ago and I still can’t shake the Raymond West story. Everyone talks about the Tylenol poisonings but the way the doc weaves in Ray's disappearance from 1978 is seriously haunting.\n\nHe was this retired truck driver who knew James Lewis and then just… vanished. What they eventually found in his house is wild. And the connection to Lewis is super sketchy.\n\nHonestly feels like this should’ve raised way more red flags back then. Makes the Tylenol case even creepier in hindsight.\n\nAnyone else still thinking about that part? Curious what others make of it, coincidence or something bigger?",
        "upvotes": 66,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l5j6ro/the_story_of_raymond_west_and_his_link_to_the/"
    },
    {
        "id": "1l6dgsr",
        "author": "absolute_bodies23fan",
        "title": "Love death and robots",
        "content": "Coming from someone who loves Sci-fi, drama, and stuff like Black Mirror/1899/Bodies/Hannibal (I know some of these might not correlate, but it's what I'm into), would you recommend Love, Death and Robots to me? \n\nAlso if anyone has any other shows that link in with my interests to recommend I'd love to hear them (and don't say Dark I tried to watch it and I was bored) \n\nBut I would love to hear some recs!! ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1l6dgsr/love_death_and_robots/"
    },
    {
        "id": "1l63tke",
        "author": "dicedtomatoes55",
        "title": "Wait, Is Netflix's 'Secrets We Keep' Actually Based on a 2015 Australian Crime?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l63tke/wait_is_netflixs_secrets_we_keep_actually_based/"
    },
    {
        "id": "1l62fz6",
        "author": "Crafty_Jacket668",
        "title": "I need help finding a show",
        "content": "My mom was browsing through Netflix and she said that she saw a show she wanted to watch but can't find it anymore. She said the cover picture was a woman singing holding the microphone above her, looking up. That's all I have",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l62fz6/i_need_help_finding_a_show/"
    },
    {
        "id": "1l62adj",
        "author": "_V3rt3x_",
        "title": "screen flickering? seems to be the menu triggering randomly but not sure?",
        "content": "tried searching around but couldnt find anything (probably incorrect search terms)\n\nonly happens in fullscreen mode \nrunning on ryzen 7000 series mobile and 32gb of ram so perfermance shouldnt be an issue \n\nmouse speed and acceleration tests show no movement \n\nany potential fixes you all have would be greatly appreciated cheers!\n",
        "upvotes": 0,
        "comments": 3,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hy021spodm5f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1l62adj/screen_flickering_seems_to_be_the_menu_triggering/"
    },
    {
        "id": "1l68s0l",
        "author": "I-am_the_hunter",
        "title": "Possible Netflix Scam situation",
        "content": "Hello everyone, whenever i subscrible to netflix, i use my account for one week only and they ask me to resubscribe, i call support and they tell me account has been disabled and you should recieve a refund soon, but i havent recieved anything, i contacted their support to ask for a receipt of the refund and they refuse to send one saying they dont has the authority to do so, is this a thing or is netflix scamming us??",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l68s0l/possible_netflix_scam_situation/"
    },
    {
        "id": "1l5lkz0",
        "author": "vurryscurry",
        "title": "Tires Season 2 audio is off by a second or two and it’s unwatchable.",
        "content": "Fix this, Netflix. And it’s not just “my tv” either. I have tried on every tv in my house and my phone, the audio still lags. Why does it seem like Netflix drops the ball far more often than not? ",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1l5lkz0/tires_season_2_audio_is_off_by_a_second_or_two/"
    },
    {
        "id": "1l62xbz",
        "author": "gfunk84",
        "title": "WWE live events capped at 540p?",
        "content": "Is anyone else’s WWE live events capped at 540p over the past few weeks?\n\nI’m in Canada so it’s affecting Raw, NXT, Smackdown, and PLEs like tonight’s Money in the Bank.\n\nIt wasn’t this way when they first came to Netflix and it looks so bad.\n\nThis is happening across multiple smart TVs. I can get 1080p on my desktop but it’s not an ideal viewing experience.\n\nI can watch other shows at 1080p/4K no problem so it’s not a network issue.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l62xbz/wwe_live_events_capped_at_540p/"
    },
    {
        "id": "1l5vsal",
        "author": "dailystar_news",
        "title": "WWE Money in the Bank 2025 LIVE on Netflix as Seth Rollins and Stephanie Vaquer set to star",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l5vsal/wwe_money_in_the_bank_2025_live_on_netflix_as/"
    },
    {
        "id": "1l5n6pf",
        "author": "Ruffers75",
        "title": "Becoming Led Zeppelin",
        "content": "Hi Everyone,\nI’ve read that this is available from 7th June(today).\nCan’t seem to find it though?.\nHave I got the date wrong/being thick?.\nMany thanks!!.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l5n6pf/becoming_led_zeppelin/"
    },
    {
        "id": "1l5t61h",
        "author": "rudranksh",
        "title": "Netflix playback for universal and columbia (and maybe sony) is capped on 540p on chrome and edge on windows",
        "content": "i know this gets asked a lot but this is so frustrating especially since we as subscribers pay to get the better quality  \nAnyone got a fix for this or any reason why this happens  \nthanks for your help",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1l5t61h/netflix_playback_for_universal_and_columbia_and/"
    },
    {
        "id": "1l5sju9",
        "author": "Aurora_rage",
        "title": "I'm travelling, and the only two options that I'm getting are either \"Update Netflix Household\" or create an Account\".",
        "content": "There is no option of \"Watch Temporarily\" \n\nCan anyone please tell me the reason or someone has faced the same? \nWhy am I not getting the option to get a code? ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1l5sju9/im_travelling_and_the_only_two_options_that_im/"
    },
    {
        "id": "1l5rpmh",
        "author": "Real_Display2994",
        "title": "Netflix doesn’t work?",
        "content": "My Netflix doesn’t work. It just keeps loading but I can’t see the pictures of the film. Is it just for me or is it a big problem? I hope that they fix that.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l5rpmh/netflix_doesnt_work/"
    },
    {
        "id": "1l5ezez",
        "author": "h2fast",
        "title": "Pineapple Express",
        "content": "What a fucking film 😂, they all played and amazing part what do you all think the cost of making that would be now because of how high up Seth rogan and the other actors are",
        "upvotes": 6,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1l5ezez/pineapple_express/"
    },
    {
        "id": "1l5x76k",
        "author": "Jigagug",
        "title": "Refund request support/form/location?",
        "content": "Is there an official page or channel for a refund form? I wanted to watch Rick and Morty that was still on Netflix last year but isn't anymore?\n\nI couldn't find an easy refund request form in their support, or any sort of support for a refund at all, everyone knows Netflix is very anti-consumer but is my only option really making a reclamation through my bank that can take months?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l5x76k/refund_request_supportformlocation/"
    },
    {
        "id": "1l61i73",
        "author": "dailystar_news",
        "title": "WWE Money in the Bank on Netflix results as Seth Rollins and Naomi emerge victorious",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1l61i73/wwe_money_in_the_bank_on_netflix_results_as_seth/"
    },
    {
        "id": "1l5nxaa",
        "author": "InternPrestigious313",
        "title": "Need some recommendation for series",
        "content": "Something light and fun…\nI thought of asking you guys before randomly watching 2-3 episodes of some stupid show! \nMy fav series are: GOT, HOTD, How I met your mother, Nobody wants this, Schitts creek( i LOVEEEEEE IT), Never have I ever, some K dramas, how to make millions before gradma dies(it was soo heartwarming 🤌🏻) anddddd I can’t remember anymore…. But please recommend something nice😭🙏🏻",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l5nxaa/need_some_recommendation_for_series/"
    },
    {
        "id": "1l4tn78",
        "author": "Safe-Conversation770",
        "title": "Shows similar to Dept Q",
        "content": "As the title suggests, I am looking for recommendations for shows that have the same genre as Dept Q. I thoroughly enjoyed the series. Please help a girl out. ",
        "upvotes": 103,
        "comments": 68,
        "media": null,
        "permalink": "/r/netflix/comments/1l4tn78/shows_similar_to_dept_q/"
    },
    {
        "id": "1l5d0qk",
        "author": "sloppyduc",
        "title": "Solution for getting Old UI back",
        "content": "Hey guys I have found the solution for recent UI change;\n\nGo to your account &gt; security &gt; feature testing and turn it off \n\nNow sign out and sign in again on the Tv \n\nIf that still doesn’t work then uninstall and install the app again\n\nIt worked for me;\nHave a great day:)\n",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1l5d0qk/solution_for_getting_old_ui_back/"
    },
    {
        "id": "1l5lna5",
        "author": "CitizenTony",
        "title": "How many Jackie Chan movies are there on Netflix?",
        "content": "I don't know if those non-party websites where you can see the catalog of available films on various streaming services are really reliable. Except the recent movies starring Jackie Chan bought by netflix, I was wondering how much of his filmography is available overthere\n\nedit : Of course, the question is asked by someone who doesn't own an account anymore (but who might come back in a distant future, depending on certain criteria. Idk) otherwise the question would not be asked. That seems logical.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1l5lna5/how_many_jackie_chan_movies_are_there_on_netflix/"
    }
]