[
    {
        "id": "1lw9k8l",
        "author": "NishinosanTV",
        "title": "KPop Demon Hunters directors and music supervisor is doing an AMA on r/kpop today at 9 AM PT.",
        "content": "Hey r/netflix \n\nWe're being visited by some of the people behind KPop Demon Hunters today for an AMA on [r/kpop](https://www.reddit.com/r/kpop/). Notably the directors Maggie Kang and Chris Appelhans alongside the music supervisor Ian Eisendrath. The AMA starts at 9 AM PT.\n\nYou can send your questions in the thread attached to this post. Or, you can head on over directly to [r/kpop](https://www.reddit.com/r/kpop/) now, it'll be pinned at the top.\n\nNish\n\n[r/kpop](https://www.reddit.com/r/kpop/) modteam",
        "upvotes": 14,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lw9k8l/kpop_demon_hunters_directors_and_music_supervisor/"
    },
    {
        "id": "1lxi3wf",
        "author": "Whorelations",
        "title": "LIVE Tonight: Biggest Event in Women's Boxing History",
        "content": "You’ve probably seen this on your Netflix recommendations—but if not, tune into  ***Katie Taylor vs. Amanda Serrano 3***  live tonight at 8 PM EST, an all-women’s boxing event with international undercards and major titles on the line.\n\nThe event features fighters from the UK, Mexico, Brazil, Canada, the U.S., and Spain, showcasing a global roster of talent. One big name on the card is  *Chantelle Cameron*, who split two fights with Taylor—and never got a third, after Taylor declined the trilogy. That tension still lingers.\n\nIf you watched  ***Jake Paul vs. Mike Tyson***  in November 2024, you probably agree that the co-main stole the show. Tonight, that rematch is back—this time at *Madison Square Garden*. Hopefully Netflix’s servers hold up better this time; last time, glitches meant a lot of fans missed key moments.\n\nAs for the main event: Serrano lost the first fight, barely dropped the second by  *unanimous 95–94*, and left the ring with a nasty cut. She’ll be coming back for blood. Taylor, meanwhile, is looking to shut the door on the rivalry for good—**this bout is billed as the final chapter of their trilogy**.\n\nFrom top to bottom, this card is loaded. This is surely going to be a night to remember. ",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1lxi3wf/live_tonight_biggest_event_in_womens_boxing/"
    },
    {
        "id": "1lxmun8",
        "author": "Few_Substance_705",
        "title": "\"Too much\" is just \"Girls\" repackaged and its cringe and out of touch.",
        "content": "HOT TAKE!! I am yet to meet the Lena Dunham/ Girls Stans. \n\nFor the life of me I couldn't understand who resonated with \"Girls\" the entire premise was a selfish, spoiled jewish chick who made terrible decisions and then became the victim of her own sabotage. Fast forward to I was on a 9 hour flight last night and downloaded \"too much\" on Netflix, within the first few mins it felt familiar. And then when I saw Lena Dunham in the second episode It hit me. The main character is Lena Dunham in \"Girls\" and this entire show is \"Girls\" repackaged and set in London. EVEN her love interest looks and acts like exactly Adam!! \n\nThe worst part is in an interview Lena Dunham said this show was meant to resonate with Gen Z. How???!! I am a millennial who works in marketing and even I know Its so out of touch! ",
        "upvotes": 46,
        "comments": 150,
        "media": null,
        "permalink": "/r/netflix/comments/1lxmun8/too_much_is_just_girls_repackaged_and_its_cringe/"
    },
    {
        "id": "1lxu171",
        "author": "Lazy_Title7050",
        "title": "How do shows like Outerbanks get 5 seasons?",
        "content": "I decided to watch it because it’s like one of the only shows left that isn’t a limited series and I was like wow if Netflix approved it for 5 seasons it must be really good since they cancel really good shows(the OA) after 2. And it’s probably some of the worst, most cringey shit I’ve ever had the displeasure of watching. \n\nThere’s a scene when the characters are following a murderer who they have been trying to take down all season and finally get video evidence of him committing another murder and they are hidden, taping it and as he’s leaving, one of the characters randomly stands up and yells “YOUR A MURDERER!! WHAT’S WRONG WITH YOU?!?!”. But “luckily” is drown out by the rain. The writing is just so bad. Like who the hell is watching this trash?\n\nI just don’t understand how Netflix has gotten so bad. I remember when their originals were just hit after hit(narcos, orange is the new black, ozark, the crown, stranger things,mind hunter, the OA) . Now it’s all limited series, reality shows, or poorly written shows/movies like outer banks, waterfront, old guard 2 etc. Getting ready to cancel.",
        "upvotes": 7,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lxu171/how_do_shows_like_outerbanks_get_5_seasons/"
    },
    {
        "id": "1lxjvp7",
        "author": "No_Restaurant9741",
        "title": "Just started watching Alice in borderland",
        "content": "Wanted to fill the empty hole I had since Squid Game ended so started watching Alice in borderland. Currently on episode 3 and I am going into the series completely blind.",
        "upvotes": 33,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1lxjvp7/just_started_watching_alice_in_borderland/"
    },
    {
        "id": "1lxv5kx",
        "author": "S4v1r1enCh0r4k",
        "title": "Squid Game Creator Keeps Door Open for Season 4: \"Never Say Never\"",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lxv5kx/squid_game_creator_keeps_door_open_for_season_4/"
    },
    {
        "id": "1lxsfy7",
        "author": "AlyBlack96",
        "title": "Controversial opinion about You season 5",
        "content": "Just finished the (hopefully) final season of You and I couldn't help but check what other people thought about it. Unsurprisingly... everyone hated it. But I just can't help but wonder, what did y'all expect? You is perfect trash TV, it's corny and silly and ridiculous. It has been this way since season 2. The acting is exaggerated, the plot twists are wild, the themes are spelled out, nothing about it is subtle or refined... and that's okay!! It's fun! I love just sitting down and watching something that's manufactured to be purely entertaining. You is a show that pretends to be deep but in reality it's just fast food television, and I don't get why people are taking it so seriously and getting so upset about it, let alone expecting an amazing finale when the show has been kind of bad for the longest time. This ain't Game of Thrones guys. The finale was fitting for what the rest of the show was like, it was over the top and silly and I enjoyed it very much! :D",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lxsfy7/controversial_opinion_about_you_season_5/"
    },
    {
        "id": "1lx24tv",
        "author": "jenkinsvr",
        "title": "I just want to say... Thank You Netflix",
        "content": "Wow, thank you so much Netflix. I just recently got into the show, Into the Night. I was hooked from the first episode, fully invested, and halfway through, I had that creeping realization: “Oh no… this feels canceled.” And of course, I was right!\n\n No official announcement, no goodbye, just radio silence. Honestly, it’s such a bold move to lure viewers in with such great storytelling only to pull the plug without warning. Truly inspiring.\n\nWho needs closure or a satisfying conclusion when you can just leave characters and audiences dangling in a void of unfinished arcs? The way you cancel shows based purely on streaming data instead of giving them time to grow? Absolutely visionary. \n\n\nNothing says “we value your time” like pulling the rug mid-binge. Really, Netflix, thank you for reminding me not to get emotionally attached to anything on your platform ever again. Great job keeping disappointment fresh and consistent!\n\n",
        "upvotes": 148,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1lx24tv/i_just_want_to_say_thank_you_netflix/"
    },
    {
        "id": "1lxpi1k",
        "author": "Deez_88",
        "title": "Here we go again",
        "content": "Watching the Amanda Serrano fight and we’re seeing buffering issues. \n\nThis is going to be another Tyson fight, Jake Paul is a common denominator here…",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lxpi1k/here_we_go_again/"
    },
    {
        "id": "1lxvfmg",
        "author": "Different_Fly2025",
        "title": "C'mon Netflix release the good movies - What movie or show would you like to see on Netflix?",
        "content": "C'mon Netflix release the good movies - What movie or show would you like to see on Netflix? \nC'mon Netflix release the good movies - What movie or show would you like to see on Netflix? \nC'mon Netflix release the good movies - What movie or show would you like to see on Netflix? \nC'mon Netflix release the good movies - What movie or show would you like to see on Netflix? \nC'mon Netflix release the good movies - What movie or show would you like to see on Netflix? \nC'mon Netflix release the good movies - What movie or show would you like to see on Netflix? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lxvfmg/cmon_netflix_release_the_good_movies_what_movie/"
    },
    {
        "id": "1lxveal",
        "author": "Objective-Purple8792",
        "title": "Kpop Demon Hunters Polls",
        "content": "It seems like there were multiple Demon Hunters across different generations. If they ever decide to make a part 2, which era would you like to see?\nI personally want to see Pre-Joseon Era or Joseon Era.. and 2000s about Rumi's parents for sure 😆 \n\n1. Pre-Joseon Era – Demon Hunters work solo to hunt down demons, until they eventually meet and begin planning the creation of the first honmoon.\n\n2. Joseon Era – The first official Demon Hunter team rises to battle the Gwi-ma.\n\n3. 1940s – A Demon Hunter group operates during World War II and the Japanese Imperial era, while trying to secure the honmoon.\n\n4. 1990s – A first-generation Demon Hunter K-pop group forms.\n\n5. 2000s – The story of Rumi’s parents and Seline.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lxveal/kpop_demon_hunters_polls/"
    },
    {
        "id": "1lxv3db",
        "author": "BeNiceToBirds",
        "title": "KPop Demon Hunters (blooper?)",
        "content": "Rumi's wearing a sleaveless dress here but somehow her patterns aren't visible?\n\nEarlier when she's a baby here patterns are clearly on her upper arms.\n\nMaybe they used makeup to cover them up?\n\nhttps://preview.redd.it/xqqeisoihecf1.png?width=931&amp;format=png&amp;auto=webp&amp;s=9e1852fcaf4793a4c095744cad1f8b1e86b46f7b\n\n  \n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lxv3db/kpop_demon_hunters_blooper/"
    },
    {
        "id": "1lxtx7s",
        "author": "sly-pickle",
        "title": "Building the band blows",
        "content": "If you’ve ever wondered what would happen if five Instagram influencers, a TikTok guy with a ring light addiction, and one girl who sings like she’s auditioning for American Idol in 2003 were thrown together to form a band—congrats! You’ve already seen Build-The-Band.\n\nThis show is less “music revolution” and more “playlist at a middle school dance in 2007.” Every single contestant apparently got the same memo: Please sing breathy 2000s R&amp;B or pop that sounds like a rejected JoJo demo. And they deliver. Oh boy, do they deliver. The result is a sonic smoothie of the same three vocal runs and lyrics about heartbreak from people who clearly have only ever broken up with their DoorDash driver.\n\nIt’s not that they’re untalented—they can all sing, technically. But talent without taste is like bringing a salad to a pizza party. No one asked for this. We’ve heard it before, and we didn’t like it then either.\n\nWant to actually win over a real audience in 2025? Don’t form a band that sounds like it opened for Ashanti in 2004. Try a little grit. Some distortion. A moody indie bassline. Give us angst. Give us guitars. Give us something other than another sultry cover of “Let Me Love You” by Mario.\n\nIn short: Build-The-Band is a fun watch if you enjoy yelling “BE DIFFERENT!” at your TV while eating popcorn. But if this group really wants to make it big, they need less Auto-Tune and more attitude. Grunge is calling, and she’s tired of being ghosted. *sing creep or anything creed please*",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lxtx7s/building_the_band_blows/"
    },
    {
        "id": "1lwrkhp",
        "author": "Sudden_Pop_2279",
        "title": "‘Squid Game’ Season 3 Achieves Netflix’s Best 10-Day Viewership Ever With 106.3 Million Views",
        "content": "",
        "upvotes": 296,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1lwrkhp/squid_game_season_3_achieves_netflixs_best_10day/"
    },
    {
        "id": "1lxp76e",
        "author": "Virtual-Snow8583",
        "title": "Building the Band thoughts",
        "content": "Here were some of my opinions or thoughts on the first four episodes of Building the Band; let me know if you agree/disagree or if you have other notes to add! Also, do you have a favorite singer or band?\n\n1. First things first: Conor looks so much like Harry Styles to me - the hair, the face in general, the clothes, the tattoos - it was actually insane. Every time I saw him, I thought the same thing and I couldn't let it go. I was waiting for one of his bandmates to mention it when they were talking about each others' looks but they never did. \n2. I found Alison aggravating because she seemed very shallow and entitled, and she was definitely not someone I will be rooting for. Her attitude was annoying, and I understand that this is a reality show, so some of the people need to have distinct personalities, but it was grating to listen to and I disliked everything she said. \n3. Landon's eyes are legitimately the bluest I have ever seen in my life - are they even real? He was wearing a blue shirt in the beginning, so that might have been part of it, but jesus, those caught me off guard. \n4. The dialogue between Mason and Conor when they first started talking (and when they were talking about Vegemite) was really funny to me because Conor just said, \"You're an Aussie, eh?\" and then they started laughing with each other - it was something that I expected but I enjoyed it. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lxp76e/building_the_band_thoughts/"
    },
    {
        "id": "1lxbhl6",
        "author": "corrupted0088",
        "title": "Thank you Netflix for animal kingdom!!!",
        "content": "What should my next show be? I enjoyed animal kingdom and waterfront. I liked ozark so something similar to that ? I have watched the outer banks it was pretty good more for the younger crowd but I enjoyed it.",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lxbhl6/thank_you_netflix_for_animal_kingdom/"
    },
    {
        "id": "1lxbzv6",
        "author": "adele28",
        "title": "Does anyone know the documentary I am talking about?",
        "content": "I watched this a while ago and barely remember it now. What I do remember is that it's a kind of documentary series about a conman. One of the scams was the guy claimes to join a marathon (I think) and he is sponsored by someone who was from the same country that the conman claimed to be from. After receiving the money, he keeps making excuses, gets disqualified from the marathon, etc. My description could be wrong, I watched this quite a while ago 😬",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lxbzv6/does_anyone_know_the_documentary_i_am_talking/"
    },
    {
        "id": "1lxpfg6",
        "author": "No-Stop2423",
        "title": "Netflix constantly being at 99% during film",
        "content": "it keeps being at 99% during movies or shows and i dont know why. it is seriously so annoying and getting on my nerves. \n\nthe only thing i can think of is maybe my ethernet cable is old and got degraded? i really honestly don’t know. it is so annoying. \n\nhas anyone ever solved this issue? it seemed like it just kept happening out of nowhere maybe a couple of months ago. i did reset, updated my tv and other things. \n\ni use ethernet cable too ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lxpfg6/netflix_constantly_being_at_99_during_film/"
    },
    {
        "id": "1lxnsct",
        "author": "Lostinlife213",
        "title": "User login",
        "content": "Can I see who is logged in on Netflix on my Xbox like location or device can’t seem to figure this out without using a pc or laptop only can use my Xbox or google cast ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lxnsct/user_login/"
    },
    {
        "id": "1lxf9o9",
        "author": "Ballin_Like_Curry",
        "title": "What to watch based on my likes?",
        "content": "Just got netflix after about a 7 year break so am looking to catch up on some gems i missed based on my likes. Off the top of my head stuff that i remember watching and liking was Dark,the sandman,stranger things,yellowjackets,squid game,the rain,the oa, and a couple zombie shows",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lxf9o9/what_to_watch_based_on_my_likes/"
    },
    {
        "id": "1lwugb2",
        "author": "Key-Monk6159",
        "title": "Old Guard 2",
        "content": "I can't think of a show I more looked forward to continuing after One and was thrilled when Two finally showed up.\n\nAnd it Really SUCKED!\n\nThey spent the money. Hired the actors. Got the crew together. And this is what they come with?\n\nThat is all.",
        "upvotes": 30,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1lwugb2/old_guard_2/"
    },
    {
        "id": "1lx2v2w",
        "author": "Twikkilol",
        "title": "No obvious way to contact Netflix support",
        "content": "So I cannot log into my account both on my phone and computer(s) and it just gives me \"technical error\" reason. Looking through support, th ere is no obvious reason how to contact support, no phone number listed, no live chat, no email. \n\nHow can such a large company have such a poor service quality? ",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lx2v2w/no_obvious_way_to_contact_netflix_support/"
    },
    {
        "id": "1lxejx8",
        "author": "Kooky_Writer_780",
        "title": "How to fix this??",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o42wpwcmgacf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lxejx8/how_to_fix_this/"
    },
    {
        "id": "1lxc3sg",
        "author": "Distinct-Cup2008",
        "title": "New Interface and Promoted Shows",
        "content": "IMO, i don't like the new interface. This is why:\n\n1. It is a little slow overall\n\n2. 'My List' should have remained a grid because that makes it easier to find shows in a large list. Now you have to scroll one show at a time. With Netflix shuffling the list, it is really painful to  pick the show you want\n\n3. Glad you put the 'Coming Soon' shows back. Those reminders are a goldmine.\n\n4. Can you add a category for \"Leaving Soon\"?\n\n5. I am seeing a lot of canceled and incomplete shows being promoted. These shows should be tagged as such, it's so we don't have to waste time with shows that go nowhere. I have lost 20 hrs of my life to this, but its more about investing your emotions into a show and then you are left hanging. I do Google but sometimes those results are false. We should not have to constantly research this. Just pull shows that are cancelled or have no ending. I think it makes more sense to have every season be self-contained if you are regularly cancelling shows. I think from observing, a lot of people are really frustrated by this, so it makes sense for you to have content providers fashion their content like this but perhaps give them a handful of episodes to come to a close. Some of the shows i wasted time on could have been wrapped up with 2-3 more episodes.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lxc3sg/new_interface_and_promoted_shows/"
    },
    {
        "id": "1lx6wqj",
        "author": "leyy_pink1997",
        "title": "What documentaries is the best to watch ?",
        "content": "Like napanood KO Yung Man on Wire where is\nJames Marsh's doc about artist Phililppe Petit's artful caper brings you every ounce of suspense that can be wrung from a man on a (suspended) wire. The stories was Using actual footage from the event seamlessly mingled with new re-enactments, filmmaker James Marsh masterfully recreates high-wire daredevil Philippe Petit's",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lx6wqj/what_documentaries_is_the_best_to_watch/"
    },
    {
        "id": "1lxg0je",
        "author": "Billybob35",
        "title": "Madea's Destination Wedding is now streaming",
        "content": "Cast:\n\nTyler Perry\nCassi Davis Patton\nDavid Mann\nTamela Mann\nTaja V. Simpson\nDiamond White\nJermaine Harris\nXavier Smalls\n\n[https://www.youtube.com/watch?v=WdAYvmk4QjA](https://www.youtube.com/watch?v=WdAYvmk4QjA)",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1lxg0je/madeas_destination_wedding_is_now_streaming/"
    },
    {
        "id": "1lx3zbd",
        "author": "Important-Tell-1178",
        "title": "Jenna Ortega Returns in 'Wednesday' Season 2: Enid in Danger!",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lx3zbd/jenna_ortega_returns_in_wednesday_season_2_enid/"
    },
    {
        "id": "1lwwinc",
        "author": "Muppet885",
        "title": "Trainwreck: The Real Project X",
        "content": "I really thought this story was going to be based on the Corey Worthington party in Australia that was the movie Project X's inspiration but no this was even more insane then Corey's party. \n\nTrainwreck does these documentaries so damn well! I have watched every single documentary now! ",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lwwinc/trainwreck_the_real_project_x/"
    },
    {
        "id": "1lwwepm",
        "author": "Expensive-Baby-1391",
        "title": "Question for Penville Season 5 Episode 6",
        "content": "There is a song playing in the credits of Season 5 Episode 6 of Penville and I desperately want to know what it is. I tried everything from Shazam to watching the credits to find the name of the song. Does anyone know what its called?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lwwepm/question_for_penville_season_5_episode_6/"
    },
    {
        "id": "1lx9cxs",
        "author": "indiewire",
        "title": "'Too Much' Cameo Guide: Lena Dunham's Life Story, Fact vs. Fiction",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lx9cxs/too_much_cameo_guide_lena_dunhams_life_story_fact/"
    },
    {
        "id": "1lxdvoa",
        "author": "starss4riri",
        "title": "HAWKING???",
        "content": "WHY AM I JUST FIGURING NOW OUT THAT THE DOGS NAME IN THE “ADAM PROJECT” IS HAWKING??? I THOUGHT HIS NAME WAS ROCKET 😓😭 I FEEL LIKE ROCKET SOUNDS SO MUCH BETTER THAN HAWKING",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lxdvoa/hawking/"
    },
    {
        "id": "1lx0lqu",
        "author": "Kiwimati",
        "title": "Battle camp - spelling",
        "content": "Don't really like reality tv but started watching battle camp because I like to see the games they have to play. \nI know reality tv is often scripted and I hope BC is as well. \n\nBecause no way is it possible that the spelling game is real? Words like ocean, steam, revenge?! Seriously... English is not my first language (it's not even my second) and I know perfectly how to spell these super easy words. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lx0lqu/battle_camp_spelling/"
    }
]