[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 33,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pipz34",
        "author": "Beneficial-Anteater2",
        "title": "Netflix needs to add an “already watched” button",
        "content": "Hey guys, now that everyone has to get their own account and every tab is recommendations scroll, can we please add a button that lets us take it off the lists. I think its a good idea because We are paying for good service and seeing all these lists with stuff that I already watched makes me wanna use other streaming platforms. At least add a “watch again tab. ",
        "upvotes": 1835,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1pipz34/netflix_needs_to_add_an_already_watched_button/"
    },
    {
        "id": "1pj49p1",
        "author": "AnotherDarnDay",
        "title": "What did I Just watch?",
        "content": "The sean combs doc. Now to be clear I've never been a fan of Diddy. My first memory of seeing him on TV was when he did the video with faith Evans as a tribute to Biggie. \n\nBut omg, that doc just sheds a lot of things. Like he \"allegedly\" had a part in Tupac and biggies deaths. And he wanted to throw biggie the biggest funeral, made it all about him and made biggies estate pay for the entire thing? How low can a person go. \n\nNot to mention, how stupid were those jurors? They dropped the ball completely. \n\nIts nice to know he likes his \"fans\" so much he needs to shower with peroxide after greeting them. \n\nHe's a vile person.\n\nWhat's your opinion of the doc or the person its about? \n\nOn the upside sting got richy rich from Diddy over that song. Sting earns two thousand dollars a day on it from what I understand. \n\n",
        "upvotes": 10,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1pj49p1/what_did_i_just_watch/"
    },
    {
        "id": "1pj2gz3",
        "author": "claytonium13",
        "title": "How to reset watched seasons?",
        "content": "My toddlers love Trash Truck. We’ve watched both seasons but when when I got back and play an episode it does not auto play the next one. Instead it will show trailers for Elmo and such. How do I make it play the next episode on a series we’ve already watched? On Apple TV if that helps ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pj2gz3/how_to_reset_watched_seasons/"
    },
    {
        "id": "1pi3w47",
        "author": "Routine-Ad-1546",
        "title": "Sean Combs new documentary",
        "content": "One of the greatest things the documentary proved was that the jurors were dumb as fuck. No common sense whatsoever.\n\nI just know they got paid to act dense bc if they didn’t take a payoff I’d be very surprised…. It was shocking the jurors even wanted to save face with some ridiculous excuses to literally let the devil loose. The diddler belongs UNDER the jail, k.",
        "upvotes": 388,
        "comments": 110,
        "media": null,
        "permalink": "/r/netflix/comments/1pi3w47/sean_combs_new_documentary/"
    },
    {
        "id": "1pi9fsh",
        "author": "NoMoreTicks",
        "title": "First We Waited for Seasons, Now We Wait for Volumes",
        "content": "Remember the good old days? We waited a year—maybe two—for a new **season** of our favorite show. It was painful, sure, but the eventual drop was a single, glorious binge-fest. We adapted. We endured the long waits for the return of hits like the final run of *Stranger Things*.\n\nBut now, the streaming overlords have added a new layer of torture: **Volumes**.\n\nIt’s not enough that we waited for what we were promised as \"Season 5\" of *Stranger Things*, only to get Volume 1—a cruel, tantalizing fraction of the story. You get four episodes of vital plot, a massive cliffhanger, and then... nothing. Back to the waiting game for Volume 2, which is essentially just the back half of the same season. The same happened with the highly-anticipated return of *The Family Man*, only for fans to have to wait again between parts.\n\n  \nWe signed up for the convenience of binge-watching, the freedom to control our viewing experience. Now, we are being forced back into an anticipated, staggered release schedule, only without the benefit of the traditional weekly TV model that kept the community discourse alive for months. Instead, we get an initial flash of binge-mania followed by a frustrating, momentum-killing pause.\n\n",
        "upvotes": 108,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1pi9fsh/first_we_waited_for_seasons_now_we_wait_for/"
    },
    {
        "id": "1pj5kgf",
        "author": "Sudden_Pop_2279",
        "title": "Today is the 5 year anniversary of Alice in Borderland",
        "content": "5 years ago, Alice in Borderland season 1 dropped. This year, the series finally reached its conclusion. I only just got into the series during this summer, after Squid Game had ended and I started this before season 3 came out to prepare for it but it quickly surpassed SQ and became one of my favorite live-action tv shows ever. Many hated season 3 but (maybe because of how SQ season 3 left me feeling) I found the ending pretty satisfying. I'm so grateful for this incredible series and would heavily recommend checking it out.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pj5kgf/today_is_the_5_year_anniversary_of_alice_in/"
    },
    {
        "id": "1piv0yw",
        "author": "East_Loss_3332",
        "title": "Love and Death",
        "content": "Did anyone have a favorite character? My fave was the lawyer every time he cursed out the judge had me dying laughing. 😂\n The acting was great and the accents chef kiss* The most accurate Texas accent I've ever seen on TV",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1piv0yw/love_and_death/"
    },
    {
        "id": "1pii396",
        "author": "PeaBite",
        "title": "Four Seasons w/ Steve Carrell",
        "content": "Opinions? \n\nWhen it started, there was a lot of cringy lines so I thought I wouldn’t be able to finish it. Now I finished it and I’m crying. I’m wondering how other people found it because I’m confused about the roller coaster of emotions and opinions I have about it!",
        "upvotes": 26,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1pii396/four_seasons_w_steve_carrell/"
    },
    {
        "id": "1piy2uf",
        "author": "SpecialistKooky3891",
        "title": "Subtitles don’t disappear",
        "content": "Watching stranger things (seasons 3 and 4) and when the Russians are speaking the subtitles don’t disappear after the last sentence and they only disappear when I pause the show, open the subtitle menu, then click English, then close out again then they finally disappear a few seconds later, if I don’t do this, they just stay there and don’t go away. Can I fix this?",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1piy2uf/subtitles_dont_disappear/"
    },
    {
        "id": "1pizosh",
        "author": "Longjumping_Kiwi_762",
        "title": "BREAKING - ‘The Hunting Wives’ Season 2 Just Added New Stars",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pizosh/breaking_the_hunting_wives_season_2_just_added/"
    },
    {
        "id": "1pii7eg",
        "author": "huffpost",
        "title": "When Life Gives You Tangerines | The Unexpected Therapy of K-Dramas",
        "content": "",
        "upvotes": 14,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pii7eg/when_life_gives_you_tangerines_the_unexpected/"
    },
    {
        "id": "1pixw1b",
        "author": "Euphoric_Ostrich1395",
        "title": "Netflix Careers Site",
        "content": "Just applied for a position on the Netflix Careers Site.  \n\nDo they usually send a confirmation email after submitting your application?  I did not receive one and am a bit nervous my application didn't go through.  Did see a \"application submitted\" landing page but neither that (nor the second page of the application) are in my browser history.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pixw1b/netflix_careers_site/"
    },
    {
        "id": "1piwiil",
        "author": "andrestrujillopulido",
        "title": "Frankenstein (2025 )",
        "content": "Reseña en español.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1piwiil/frankenstein_2025/"
    },
    {
        "id": "1pizoxg",
        "author": "Rivcha",
        "title": "Netflix account studying abroad",
        "content": "I am currently studying abroad and can't watch Netflix using my family's account anymore. I can ask for 14 day codes for my phone and laptop but I still haven't figured out a way to watch it in my TV.\n\nIs there any way to watch it on my TV??",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pizoxg/netflix_account_studying_abroad/"
    },
    {
        "id": "1pivw9j",
        "author": "Timely-Atmosphere",
        "title": "Owning Manhattan",
        "content": "I Really enjoyed the 2nd season of Owning Manhattan. I am hoping there is a 3rd. I have followed Ryan since his days on Million Dollar Listing New York. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pivw9j/owning_manhattan/"
    },
    {
        "id": "1pic5nv",
        "author": "Mandarina_Espacial",
        "title": "Is netflix the owner of the nemesis system?",
        "content": "This is my first post here and i wanted to know if now that netflix bought warner, does that mean also has the ownership of the nemesis system?\n\nI hope the answer is YES and also to make it public, because what warner did with the patent was evil",
        "upvotes": 9,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1pic5nv/is_netflix_the_owner_of_the_nemesis_system/"
    },
    {
        "id": "1piob7f",
        "author": "Fluid-Umpire3141",
        "title": "Basic getting more ads",
        "content": "I noticed basic lately been showing more ads compared to like 4 months ago, I guess this is how they programm us sheeps to upgrade forcefully, fking greediness increase for all these trillionares",
        "upvotes": 3,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1piob7f/basic_getting_more_ads/"
    },
    {
        "id": "1pit4ea",
        "author": "unwisemoocow",
        "title": "Netflix starts playing, but only displays loading screen. How do I fix this?",
        "content": "When I hit play I can hear the audio of what in watching, but netflix only displays the loading screen, when I back out I briefly see what im trying to watch before it sends me to the menu. How do I fix this? I just want to watch scarface :(",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pit4ea/netflix_starts_playing_but_only_displays_loading/"
    },
    {
        "id": "1pisq0n",
        "author": "FLIPSTATIC_ENERGY",
        "title": "I do not know if it was ever mentioned here but All of Us Are Dead Season 2 has apparently been delayed until 2027.",
        "content": "[https://www.reddit.com/r/AllOfUsAreDead/comments/1p9vll1/this\\_aint\\_coming\\_out\\_till\\_we\\_all\\_dead/](https://www.reddit.com/r/AllOfUsAreDead/comments/1p9vll1/this_aint_coming_out_till_we_all_dead/)\n\nWe are actually going to get GTA7 before this show finally gets season 2 released. However there is only this image and idk the source of it but I can not find anything else about it online. **News article tag is referencing the image on the linked post.**",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pisq0n/i_do_not_know_if_it_was_ever_mentioned_here_but/"
    },
    {
        "id": "1pisi5h",
        "author": "volcanicnight",
        "title": "Best guest live game",
        "content": "Anyone remember the clues from day 1 and day 2 of the game that aired today and yesterday? Trying to play it with a friend to see how they'd have done.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pisi5h/best_guest_live_game/"
    },
    {
        "id": "1pimvu5",
        "author": "MsAdventuresBus",
        "title": "The Price of Confession",
        "content": "How are Korean dramas just so good? It is like their writers understand human emotions so well AND they don’t need to add gratuitous sex scenes Lin their shows. Violence, yes, so not all together family friendly but the writing is just so good. Another show I enjoyed was Heavenly Ever After. Their depiction of dogs and cats who make it to heaven just makes me cry. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pimvu5/the_price_of_confession/"
    },
    {
        "id": "1pirkp4",
        "author": "salloumz",
        "title": "Black rabbit is stressing me out",
        "content": "Im only in episode 4, this show is too stressful i cant keep watching it fr😭 someone tell me this gets better PLEASE my god just one thi mf after the other after the other. I was just excited to see jason bateman on screen i did NOT sign up for this anxiety man. ",
        "upvotes": 1,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pirkp4/black_rabbit_is_stressing_me_out/"
    },
    {
        "id": "1piknnx",
        "author": "LilyWai",
        "title": "Anyone getting \"No Devices Found\" when trying to stream Netflix App?",
        "content": "This has been driving me batty! On all my iOS devices the Netflix app just will not recognise my smart TV, my streaming box or my Chromecast device &amp; when tapping the streaming logo it just shows a greyed out message saying \"No Devices Found\" with a \"Go To Help Centre\" option. It has been like this for a month &amp; occurred suddenly after working fine for years.\n\nHave gone to Help Centre - which wasn't much help - &amp; tried all their suggestions &amp; few others:\nRebooted modem\nSwitched power off to all devices - modem, TV etc... - &amp; waited 10 mins &amp; powered up again\nRebooted all devices - iPhone, iPad plus all streaming devices including TV\nDeleted Netflix app &amp; re-downloaded\nSigned out of Netflix app &amp; signed back in\n\nNOTHING has worked. Is this an issue anyone else is getting or just me? Or has anyone else encountered this &amp; perhaps found a solution?\n",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1piknnx/anyone_getting_no_devices_found_when_trying_to/"
    },
    {
        "id": "1piov3s",
        "author": "Srapotr",
        "title": "I have a problem downloading Dead cells Netflix edition",
        "content": "I can't download Dead cells Netflix edition and I don't know why I have a Redmi 14 and an active netflix account,proof ? \nMy best friend was able to do it on my account but it just won't download on my device and I played the game before I really want to play today \nPlease help ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1piov3s/i_have_a_problem_downloading_dead_cells_netflix/"
    },
    {
        "id": "1piy5np",
        "author": "MosheTDD24",
        "title": "Would you use a Netflix extension that auto-skips gore/animal abuse scenes and gives a short recap?",
        "content": "Hi everyone, I’m Moshe, I’m a software engineer and I wanted to get your thoughts on an idea that came from some family members. \n\nThey asked me whether it’s possible to build a browser extension for Netflix that can warn you a few seconds before a gory/animal/sexual abuse scenes and offer to skip it. After the skip, it would show a short text recap of what happened so you don’t miss any context. \n\nI’m thinking of building this as a completely free project and open-source, but before I start, I wanted to ask: Is this something any of you would find useful or be interested in using? \n\nHappy to hear any thoughts or feedback in the comments. Thanks for reading!",
        "upvotes": 0,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1piy5np/would_you_use_a_netflix_extension_that_autoskips/"
    },
    {
        "id": "1pi7yo0",
        "author": "Educational_Base_301",
        "title": "I feel like I watched everything on Netflix. Any new 2026 series to look forward to?",
        "content": "I’ve gone through so many shows over the last few years that I’m starting to run out of things to watch.  \nDo you guys have any recommendations for upcoming Netflix series in 2026 or something recent that feels fresh?  \nI’m open to any genre, as long as it keeps me hooked.",
        "upvotes": 7,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1pi7yo0/i_feel_like_i_watched_everything_on_netflix_any/"
    },
    {
        "id": "1pinpqw",
        "author": "Electronic_Stop_9239",
        "title": "How long do used icons remain in the history? Is there a limit to the number of profile icons that are shown in the history?",
        "content": "I'm asking because I want to change my profile icon, but I don't know if I can reuse it whenever I want...\n\n(The icon I'm using now is no longer available for others to use.)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pinpqw/how_long_do_used_icons_remain_in_the_history_is/"
    },
    {
        "id": "1pinl7h",
        "author": "AmazingLeopard6414",
        "title": "Random language",
        "content": "So every time when I open Netflix on my tv, phone or I pad, it is in another language. First it was Japanese, then Greek, now Spanish. I am the only one who uses the account and I also checked the logged in devices. Nothing but me.\nHas anyone else this issue?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pinl7h/random_language/"
    }
]