[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 495,
        "comments": 273,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 16,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1jn0ega",
        "author": "deuxfleurs04",
        "title": "Adolescence",
        "content": "Obviously, I know I’m not the only one who’s really loved ‘Adolescence’, but I had to post here because wow. I cannot think of anything I’ve ever watched where the dialogue was both written and delivered by the actors in a way that felt so natural and hyper-realistic. Incredible work by the camera crew as well to get each episode in a single shot. Also I’m a social worker, and I cannot get over the scene with Jamie and the psychologist. It felt like a masterclass in appropriate/effective methods in evaluation and talk therapy. I am blown away by this show. I hope it gets many accolades come the next awards season.",
        "upvotes": 73,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1jn0ega/adolescence/"
    },
    {
        "id": "1jmwlgn",
        "author": "Visual_Hyena7258",
        "title": "Con mum, is nobody else annoyed with the filmmakers?",
        "content": "I thought it was a good documentary for the most part. But what kind of lazy filmmakers make a documentary about a subject. And do zero research to find the truth? They could have tried to find out where this lady is actually from. Find other victims of hers throughout the years. It could have been multiple episodes about how vile this woman was. It seems to me that they found out about grahams story online somehow. And just found ppl that were scammed at the same time as he was. I just felt they could have done more work to show us who this horrible lady really was. I mean it seems like grahams wife did more research on her than the filmmakers. \n\nIs this just me and my weird self? Or does anybody else feel like this?",
        "upvotes": 52,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jmwlgn/con_mum_is_nobody_else_annoyed_with_the_filmmakers/"
    },
    {
        "id": "1jn5mnw",
        "author": "Baby_0il04",
        "title": "Adolescence, detective did what more parents should do.",
        "content": "The detective saw what was going on with Jamie, the incel and red pill stuff. Saw that his son knew about that stuff even though he’s younger than Jamie. We learn that his son has been distant from him. So the detective makes an effort to be closer to his son and be the role model he needs.\n\nHaven’t seen anyone talking about this, so I had to say something ",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jn5mnw/adolescence_detective_did_what_more_parents/"
    },
    {
        "id": "1jn0394",
        "author": "stellacampus",
        "title": "Talk to Me",
        "content": "This was a good movie that I came close to skipping over, so I thought I would wave a little bit of a flag for those who like horror.  Amazingly it has a 94% critic rating on Rotten Tomatoes.  I do recommend watching it in the original Strine language.",
        "upvotes": 16,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1jn0394/talk_to_me/"
    },
    {
        "id": "1jn7dsk",
        "author": "agravating-cow",
        "title": "Aren't these a little too similar",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jn7dsk/arent_these_a_little_too_similar/"
    },
    {
        "id": "1jn2kcs",
        "author": "forkliftbuilder",
        "title": "The Residence finale: how can this be? (no whodunit spoiler)",
        "content": "Although I have  enjoyed The Residence, there's something I don't get. I'll explain without spoiling the whodunit. During the closed Congressional hearing (present day), we see in a flashback how Cordelia had confronted the killer(s) at the White House and had them arrested. After we return to the hearing, we learn that the committee members are still completely in the dark about the culprit(s) and have even written down their own wrong guesses. But how can this be? Surely the entire world (and especially said committee) would have been aware by now of any arrest(s) made in relation to a murder in the White House?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1jn2kcs/the_residence_finale_how_can_this_be_no_whodunit/"
    },
    {
        "id": "1jn8bef",
        "author": "Logical_Mousse8503",
        "title": "review of adolescence.",
        "content": "i know you have all read about it dozens of times but i gotta give my opinion on this show.\n\ni liked the first two episodes but not enough to really talk about it now. i wanna talk about the last two episodes mainly.\n\nepisode three: i really felt for him when talking to the whatever that person was. ye he got a bit ragefull but he just wanted to be liked by someone. for once he didnt want to be the bullied one he just wanted a bit of love.\n\nepisode four: i cant imagine what the dad is going through. he threatened kids, (who deserved it). he ruined his van. he was obviously going through it. it was good to see him cry in the end tho. its bad to keep such emotions inside. we all need a cry sometime.\n\noverall: a good show it shows real emotion,real trauma. ive always liked these kinda shows but this one hit a bit hard for me. especially since its based on a true story. a 9/10 for me.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jn8bef/review_of_adolescence/"
    },
    {
        "id": "1jn85xm",
        "author": "BWCDaddy66",
        "title": "Anyone have a recommendation on what show to watch after Longest night and Cell 211?",
        "content": "Just finished Cell 211 and about to rewatch the Longest night. Anyone know of any other series or movie that have such intense edge of your seat scenes, like these two? Preferably series that are like 211 and Longest night?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jn85xm/anyone_have_a_recommendation_on_what_show_to/"
    },
    {
        "id": "1jn853x",
        "author": "IndividualPlace5423",
        "title": "Ik I am late but Arcane S2 was dissapointing",
        "content": "I found the writing very cringe and didn't understand half the plot.  The season was obviously rushed with many flaws. I loved the first season, very enjoyable, but season two didn't have too many good things about it, act two was definitely better than act one and act three tho. Anyone agree or going to glaze Arcane?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jn853x/ik_i_am_late_but_arcane_s2_was_dissapointing/"
    },
    {
        "id": "1jn2emm",
        "author": "paleogames",
        "title": "Mulaney: too much phone",
        "content": "I love the show but this new season he's leaning too heavily on viewer phone calls. Be strong my man and interact with your guests as you should. \nThat's pretty much all I have to say but the character minimum on this sub requires me to continue typing and I think that's detrimental to the original point I was making. ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jn2emm/mulaney_too_much_phone/"
    },
    {
        "id": "1jmaee8",
        "author": "AggressiveGrocery773",
        "title": "Con Mum – Graham is not as great as people make him out to be.",
        "content": "It’s honestly wild how much praise this guy gets while his wife is vilified everywhere. People even started a whole Reddit post just to complain about her *vocal fry*—like, really? Meanwhile, Graham dipped right after his wife gave birth so he could drink champagne and eat at Michelin-starred restaurants in Switzerland with his \"*dying\"* mum. Let’s be real—if she wasn’t rich and he didn’t dream of inheriting millions, would he have been this devoted? Doubt it.\n\nThe audacity of this man to take money out of their *joint* account without telling his wife—all for his *rich* mum. And then he had the nerve to go into debt, dragging his wife's finances down with him, just so his mother could continue living this lavish lifestyle (which, let’s be honest, he enjoyed too). I could understand if she was struggling and he was helping with healthcare or basic needs, but no—this was pure greed, and his wife was left alone in a foreign country, raising a newborn with no support.\n\nI get that being abandoned as a kid messed him up, and getting his mum back was a big deal for him. But let’s not pretend her *money* wasn’t a huge factor in his decisions. And then at the end of the documentary, he had the nerve to say, *“My real family are my mates who stuck by me through my worst times.”* (that felt like a direct dig at his wife) Like… excuse me? The irony is unreal—he *didn’t* stick by his *own wife* when she was going through one of the most difficult times in her life. She just had a baby, was alone in a foreign country, and he was too busy chasing inheritance money to be there for her.\n\nJust embarrassing. Instead of taking accountability for how he failed her *and* their child, he basically just doubled down on his selfishness.",
        "upvotes": 294,
        "comments": 91,
        "media": null,
        "permalink": "/r/netflix/comments/1jmaee8/con_mum_graham_is_not_as_great_as_people_make_him/"
    },
    {
        "id": "1jmdv3f",
        "author": "ludefisk",
        "title": "\"His name is Fgwlpskr Pif.\" - The Residence",
        "content": "I mean, stop. Just stop. This show takes the deadpan to a whole new level - everybody gives absolute knock-out performances, and the seriousness with which they deliver some of the best one-liners in Netflix history is just so fun to watch. I'm on episode 6 and I just got to Randall Park saying \"His name is Fgwlpskr Pif\" and I'm just losing it. I'm glad this isn't a background show for me because I know I'd be missing the point of it all ... a lot of the humor is nonverbal and in the pauses and cuts so it's been way better to watch it straight up. \n\nConsider giving this show a watch - it's been a real banger. Heck of a cast and they all seem to play well off of one another. ",
        "upvotes": 112,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1jmdv3f/his_name_is_fgwlpskr_pif_the_residence/"
    },
    {
        "id": "1jn7gr4",
        "author": "Why_Not_Ind33d",
        "title": "Adolesence: Teenager dissects Netflix drama with worried parents",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jn7gr4/adolesence_teenager_dissects_netflix_drama_with/"
    },
    {
        "id": "1jn0ebg",
        "author": "computercavemen",
        "title": "Pulse Check: \"Pop the Balloon\" Is Coming to Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1jn0ebg/pulse_check_pop_the_balloon_is_coming_to_netflix/"
    },
    {
        "id": "1jm3d1p",
        "author": "throw20190820202020",
        "title": "PSA to all the Agatha Christie loving, Jessica Fletcher obsessed cozy mystery lovers out there - “The Residence” and Uzo Aduba’s consulting detective Cornelia Cupp ARE IT!!",
        "content": "I saw it was a house whodunnit and was watching. OMG, it’s Shondaland? Yes please. In the Whitehouse!?? Fun fun! Wait, who is this actual modern warm brilliant and LIKEABLE woman running the show? Crazy Eyes was an awesome character but Uzo Aduba is now firmly our thoughtful birding private eye in my head now. \n\nDare I say I like it more than the Knives Out movies? I do. And I like those movies a lot. ",
        "upvotes": 168,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1jm3d1p/psa_to_all_the_agatha_christie_loving_jessica/"
    },
    {
        "id": "1jmj6py",
        "author": "adamb12345676",
        "title": "New Erin Doherty interview about ''surviving\" Adolescence",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jmj6py/new_erin_doherty_interview_about_surviving/"
    },
    {
        "id": "1jm3pyb",
        "author": "LegitimateCopy4596",
        "title": "Adolescence - Final scene",
        "content": "How absolutely gutting was this scene? I’m not sure what else to say. I haven’t been impacted by a show or movie like that before. I couldn’t fall asleep after finishing it. Truly brilliant acting by Stephen Graham and the entire cast. ",
        "upvotes": 147,
        "comments": 74,
        "media": null,
        "permalink": "/r/netflix/comments/1jm3pyb/adolescence_final_scene/"
    },
    {
        "id": "1jmb9mk",
        "author": "Agile_Cupcake6961",
        "title": "\"Con Mum\" Heather deserves better",
        "content": "Heather had a newborn baby and her husband leaves her alone, no family, no friends for 2 months? Insane work. On top of that he ruins her Christmas and she was just hoping he would realize his mom is lying. I understand he probably has childhood trauma and thought his mom was gonna die in 6 months lalalalalla but still? That seems horrible for heather to enter motherhood in that way. She is truly a real one for sticking by all that bs.",
        "upvotes": 37,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1jmb9mk/con_mum_heather_deserves_better/"
    },
    {
        "id": "1jn2ugj",
        "author": "Block-Busted",
        "title": "What are songs that are played during the end credit of 'Roma' (2018)?",
        "content": "Here are some of the songs that are featured in **Roma**:\n\nhttps://music.apple.com/us/album/roma-original-motion-picture-soundtrack/1444973888\n\nWhich ones were featured in the film's end credit?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jn2ugj/what_are_songs_that_are_played_during_the_end/"
    },
    {
        "id": "1jmv985",
        "author": "Aanen05",
        "title": "Do the Right Thing stuck in 540p",
        "content": "Been trying to watch Do the Right Thing on my PC, but the resolution won't go above 540p. I have the standard plan, and many other titles play seamlessly in 1080p. I have tested on Chrome, Firefox, and Microsoft Edge, all with the same results. Also, I have changed my video streaming settings to the highest quality, yet to no avail. No extensions have fixed the issue. Since the Netflix app has been changed into a glorified browser link, it doesn't work either. Extremely frustrating.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jmv985/do_the_right_thing_stuck_in_540p/"
    },
    {
        "id": "1jmu8yc",
        "author": "Appropriate-Farmer16",
        "title": "Question about Preview Club PIN",
        "content": "I recently received an email notification saying by next preview club is available, and it is appearing on my Netflix Home Screen. However, I haven’t received an email with my PIN that I am required to input before I can watch the movie. I haven’t had this problem with past preview club programs and nothing has changed with my account (same email, etc.). The Netflix FAQ doesn’t cover this.  I haven’t the email with the survey link also, but without my PIN I can’t watch it. Anyone have any suggestions on how I can resolve this issue? Thanks in advance. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1jmu8yc/question_about_preview_club_pin/"
    },
    {
        "id": "1jmu7bd",
        "author": "Tall-Information-465",
        "title": "Tenerife belgium differences",
        "content": "My parents are from Belgium but are living in tenerife now. \n\nThey'd like to subscribe to Netflix again but we've discovered there's a difference between Belgian and Spanish netflix. \n\nCan we get a belgian version in Spain? ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jmu7bd/tenerife_belgium_differences/"
    },
    {
        "id": "1jmkkv4",
        "author": "Relative_Recording47",
        "title": "Dead Talents Society: Netflix's new horror comedy movie that has a glowing 94% Rotten Tomatoes rating",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jmkkv4/dead_talents_society_netflixs_new_horror_comedy/"
    },
    {
        "id": "1jmm2k7",
        "author": "DevotedToNeurosis",
        "title": "Midnight Mass' Filming Locations, Explained",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jmm2k7/midnight_mass_filming_locations_explained/"
    },
    {
        "id": "1jlsaak",
        "author": "Legitimate_Ad3625",
        "title": "‘Adolescence’ Sets Netflix Record With 66.3 Million Views, Best Ever Two-Week Total for a Limited Series",
        "content": "",
        "upvotes": 325,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1jlsaak/adolescence_sets_netflix_record_with_663_million/"
    },
    {
        "id": "1jlr3od",
        "author": "Snoo-67164",
        "title": "Question about Adolescence I haven't seen discussed yet (red pills on Instagram)",
        "content": "Firstly I don't understand why some people are so fixated on the bullying storyline, when it's a story of all the different forces that create violence in teens. Stephen Graham's explanation that he thought about the phrase \"it takes a village to raise a child\" and therefore we've all failed (in the face of rising teen knife crime in the UK) is so clear.\n\nBut did others think it was clear that Jamie made worse comments to Katie than what we learn?\n\nWhat we know is that Jamie received nude photos of Katie, asked her out, she said \"I'm not that desperate\" (this part rang true and I think was meant to feel that way) and then she left comments on his IG implying he's an incel.\n\nTo me, it felt obvious that when Jamie was talking to the psychologist, he left out part of the conversation. He praises himself for being nice to Katie but admits he thought she was at a weak and vulnerable moment. My interpretation was that when she turned him down, he most likely said something about how no-one else would want her now her nudes had been shared. Especially since we know about his anger outbursts. It was these comments that made her post the emojis on his Insta. I thought it was important that her comments aren't about him being ugly or unpopular - which he sees as his biggest issue - but they specifically call out his attitude to women. And DI Bascombe misses the point a second time when his conclusion is \"So Katie was bullying Jamie?\"\n\nAs a fairly online woman, that was where my mind instantly went. It's such a common pattern: misogynist shows woman positive attention, woman turns him down (politely, kindly or not), misogynist shows his true colours. \n\n",
        "upvotes": 248,
        "comments": 121,
        "media": null,
        "permalink": "/r/netflix/comments/1jlr3od/question_about_adolescence_i_havent_seen/"
    },
    {
        "id": "1jm3nyu",
        "author": "MamaMia1325",
        "title": "Million Dollar Secret",
        "content": "Who else is watching? I recently got into The Traitors and on a whim, started watching this the other day. 3 episodes are out now but more come out on April 2nd. It’s GREAT!!! From what I’ve heard, it’s a cross between The Mole (which I’ve never seen) and The Traitors.",
        "upvotes": 37,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1jm3nyu/million_dollar_secret/"
    },
    {
        "id": "1jmnjz5",
        "author": "LeslieWai",
        "title": "I remixed streaming intros",
        "content": "I remixed streaming service logos including Netflix Logo intro",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1jmnjz5/i_remixed_streaming_intros/"
    },
    {
        "id": "1jmwsx4",
        "author": "Jumpy-Beginning3686",
        "title": "Cobra kai",
        "content": "How did a once good tv series become so disappointing, the show used to have character, humor,  nostalgia , lifes lessons now is absolutely sh-t . I'm struggling to finish watching season six it's just ridiculous.",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1jmwsx4/cobra_kai/"
    },
    {
        "id": "1jmdrte",
        "author": "Semiconsistent-Panic",
        "title": "Con Mom - the DNA test, anyone?",
        "content": "Is it just me or is no one questioning the legitimacy of the DNA test? It was one of the most unexpected elements of the entire document yet I felt like it wasn’t explored enough. \n\nI’m assuming the mom voluntarily got her swabs taken by Graham’s request (as opposed to being taken secretly behind her back) so I can’t help but wonder: if the mom was pro enough to fake or befriend real bankers and lawyers and pull off her tricks, I don’t see faking DNA lab results very difficult. In fact, that was my very first thought. Any thoughts or theories on this?   ",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1jmdrte/con_mom_the_dna_test_anyone/"
    }
]