[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 707,
        "comments": 5203,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1o26p1p",
        "author": "No-Relative4683",
        "title": "Victoria Beckham",
        "content": "Well, this was absolute garbage!\n\nNothing on her music career, no interviews with the Spice Girls, no dirt or backstage gossip - just a vehicle to promote her flailing fashion line. \n\nAnybody else extremely disappointed in this 3 hour advertisement?",
        "upvotes": 20,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1o26p1p/victoria_beckham/"
    },
    {
        "id": "1o1xl5o",
        "author": "Ember_Grove20",
        "title": "What’s a Netflix original you think aged really well?",
        "content": "I was rewatching some of the older Netflix originals and honestly, a few of them still hold up so well. I’m curious which ones do you think aged the best? Are there any shows or movies you’ve gone back to and thought, wow, this still slaps?\n\nWould love to hear which ones you think are still worth watching today! \\^\\^",
        "upvotes": 53,
        "comments": 159,
        "media": null,
        "permalink": "/r/netflix/comments/1o1xl5o/whats_a_netflix_original_you_think_aged_really/"
    },
    {
        "id": "1o25yae",
        "author": "reggiepd",
        "title": "Mafia: Most Wanted",
        "content": "This series could have been five minutes long.\n\nSame shit repeated over and over again.\nWhat a waste of time.\n\nI guess I learned about the 'ndrangheta, but Jesus that was painful!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o25yae/mafia_most_wanted/"
    },
    {
        "id": "1o1iob4",
        "author": "pleasedontbemeantom3",
        "title": "Wayward was sooo good until it wasn't.",
        "content": "Did anyone else feel this way?\n\nSpoilers ahead.\n\n\nI was so sucked in by wayward, it was great, the plot the mystery, the acting (Mae was a little flat but that's their shtick and I like them and Toni was so awesome I just didn't mind), I was loving it. \n\nThere was so much energy and intrigue in the show. And then in episode 8, I felt like it just didn't deliver. I think it just wasn't good as a limited series. The mystery that was built was too big for the wrap up. I wanted to understand by the end something about the inner world or workings of the townspeople. In general, for a show which centered so much around emotions, the deeper we got into the series the more shallow the characters seemed to become. It was really disappointing. We never were let into the characters internal experience. \n\nI wanted so badly to see Laura and Alex actually TALK about things. Like the relationship was never sold as functional or emotionally intimate. I get if at first they were freaked out but when they got on the same page, why was the most we got was a a couple arguments? No real conversation. Alex is obsessive and won't let things go about work but his wife is obviously going through all this and not  actually planning on leaving town snd he's not bothering her constantly about it? \n\nThe timeline just felt wonky and poorly conceived following the set up. A great concept with poor follow through. I was left wanting more, but not in a good way, but in the way that I felt they would have to undo what they had done to answer things in a satisfying way. ",
        "upvotes": 120,
        "comments": 106,
        "media": null,
        "permalink": "/r/netflix/comments/1o1iob4/wayward_was_sooo_good_until_it_wasnt/"
    },
    {
        "id": "1o20owh",
        "author": "ArjoGupto",
        "title": "It’s why I got Netflix 9 years ago.",
        "content": "",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o20owh/its_why_i_got_netflix_9_years_ago/"
    },
    {
        "id": "1o27o4e",
        "author": "Jumpy_Music653",
        "title": "recommendation",
        "content": "I work from home and live alone, so to avoid dying of boredom and be more productive, I watch TV series while I work, but I'm in big trouble because I think I've seen everything. Do you have any series you can recommend? I like science fiction, documentaries, romance, I watch almost everything.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o27o4e/recommendation/"
    },
    {
        "id": "1o273km",
        "author": "Responsible-Sign3223",
        "title": "Love Is Blind star is seriously urging cast members to rebel against Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o273km/love_is_blind_star_is_seriously_urging_cast/"
    },
    {
        "id": "1o2aj7f",
        "author": "entryjyt",
        "title": "Downloaded movies don't have all the languages available for the at movie",
        "content": "So basically when you watch a movie or show, there are lots of different languages options. But if i download a movie then all the other languages disappear and only some languages remain. In this case when I download kpop demon hunters I ky mandarin and English remain, but not downloaded all the languages are there. How can I make it so all the languages are there even if it's downloaded?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o2aj7f/downloaded_movies_dont_have_all_the_languages/"
    },
    {
        "id": "1o2aiee",
        "author": "GenevieveCostello",
        "title": "Has anyone seen Nero the Assasin, newly released French Netflix show?",
        "content": "Oh My God, I binge watched all of its 8 episodes yesterday, and I guarantee you that it would be gripping. I couldn't stop watching it. Attractive characters, great actings, captivating plots, it was fascinating!   ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o2aiee/has_anyone_seen_nero_the_assasin_newly_released/"
    },
    {
        "id": "1o1vs6b",
        "author": "voltagejim",
        "title": "Anyone watch True Haunting?",
        "content": "I used to love ghost shows and ghost stories back in the mid 90's through early 00's.  Then I found that all those reality ghost shows were all fake, and a lot of famous ghost stories were fake, and I just stopped believing in all that.\n\n  \nI watched this out of curiosity and honestly enjoyed it.  I honestly was trying to figure out explanations for  some of the things.  The 2nd story with the house was the most wild one.  Anyone have any additional info on these stories with rationale explanations for everything that happened?",
        "upvotes": 10,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1o1vs6b/anyone_watch_true_haunting/"
    },
    {
        "id": "1o1wrdy",
        "author": "Top-Three-USA",
        "title": "Greg Peters Says Netflix Prefers Building Over Buying — Warns Against Big Media Mergers",
        "content": "",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o1wrdy/greg_peters_says_netflix_prefers_building_over/"
    },
    {
        "id": "1o29aef",
        "author": "LengthinessNo7167",
        "title": "What's coming soon",
        "content": "Hey guys, I'm a pretty regular Netflix user, have recently watched the Monster series, thrillers, comedies, dramas, both old and new.\nWhat's coming soon that you are excited about? Are there any interesting shows or movies that are expected to be out in the coming months?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o29aef/whats_coming_soon/"
    },
    {
        "id": "1o1z463",
        "author": "Fantastic-Pension-72",
        "title": "What k-dramas, j-dramas and c-dramas to watch.",
        "content": "Hello anyone got any recommendations for Asian dramas to watch on Netflix or just any good show in general. I’m into fantasy sci-fi, action, romance just any good show to be honest trying to pass time during college and not play to many games. Thanks for the help. ",
        "upvotes": 7,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1o1z463/what_kdramas_jdramas_and_cdramas_to_watch/"
    },
    {
        "id": "1o294g3",
        "author": "Popular-Context4716",
        "title": "Does your Netflix on (PC) webpage keep load very slow.",
        "content": "Netflix on (PC) webpage is getting so slow and my brother PC do face the same thing as me.  \nby entering Netflix took a few mins just to get into the selecting profile. Longest timing of me getting to watch my show will be like 5-6 mins longer 10mins++ for it to load.. PC apps also same only on my Phone is working fine. Anyone had this issue?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o294g3/does_your_netflix_on_pc_webpage_keep_load_very/"
    },
    {
        "id": "1o1yw8w",
        "author": "dicklaurent97",
        "title": "Nurse Jackie is now on Netflix",
        "content": "It's dark, subtle, heartfelt and unexpected. Edie Falco stars as a drug-addicted nurse who is constantly either using or saving someone's life. It's a brilliant series if you want to watch something that is both enjoyable and challenging. ",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o1yw8w/nurse_jackie_is_now_on_netflix/"
    },
    {
        "id": "1o284l1",
        "author": "Kernelly",
        "title": "Feature after feature is taken for no good reason",
        "content": "Will there be a cease to this one day? Does every single well working feature has to be taken off eventually? YouTube search, no cookie websites, Flash online games and animations...\n\nNetflix had an option to quickly resume watching in \"My list\" tab. I go there and bang it's all gone, only three of my faved shows are there. Where is the \"Continue watching\" tab. What is it with the companies nowadays throwing AI at us when it's unecessary, taking working stuff like this continue watching thingie. God damnit...",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o284l1/feature_after_feature_is_taken_for_no_good_reason/"
    },
    {
        "id": "1o27yka",
        "author": "bilektugrul",
        "title": "Low HDR Performance",
        "content": "I have a Redmi Note 12 Pro 5G and i use it for watching almost everything. I mainly download the movies/series that I watch, in the best quality possible, but sometimes I just wanna use Netflix. Today, I was trying to watch Lift (2024) from Netflix and right from the start, I noticed that movie was kinda laggy due to low FPS. I watch HDR stuff all the time, using the Just Player app, sometimes movies that are 50 GB in size with 4K resolution and HDR, I never have any kind of lag. \nIs this possible to fix without sacrificing quality?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o27yka/low_hdr_performance/"
    },
    {
        "id": "1o1vfps",
        "author": "daisyup",
        "title": "Famous Last Words with Dr. Jane Goodall",
        "content": "Does anyone else find the interviewer on this show insufferable?  He doesn't seem to give the interviewee enough space to contemplate and respond.  He's not comfortable sitting in silence.  Instead he leaps to fill any quiet with his own talking.  I want to hear Jane talk, not the interviewer.",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o1vfps/famous_last_words_with_dr_jane_goodall/"
    },
    {
        "id": "1o26fpq",
        "author": "Jak1493",
        "title": "4K tv but you have to get the 4K plan?",
        "content": "Is it true if you have a 4K tv, you have to get the 4K plan for it? Or can you still use a lower plan for Netflix? I ask because I’ve heard not all of Netflix’s stuff is in 4K and seems a bit much ",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1o26fpq/4k_tv_but_you_have_to_get_the_4k_plan/"
    },
    {
        "id": "1o25n50",
        "author": "tzt1324",
        "title": "How do you find good content with the bad recommendations",
        "content": "The recommendation of Netflix is extremely bad. I basically see the same content again and again. Sometimes they even use different pictures to recommend me something I havr already seen or I tried to avoid. \n\nSo my question: how do you actually find something good? Do you use other sides? ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o25n50/how_do_you_find_good_content_with_the_bad/"
    },
    {
        "id": "1o1qhd5",
        "author": "_missEltorri_",
        "title": "Is Monster: The Ed Gein Story really that bad?",
        "content": "I'm on episode 4 atm, and I've seen a lot of people not like this season. I personally found it to be disturbing but in a way that's like \"you wanna look away but you can't.\" I don't see the show as trying to portray him to be sympathetic, I see what he's doing and what he's done. It's creepy as hell. And as disturbing as the previous 2 seasons were, I found them to be quite educational in a way. What signs to look out for, like it's teaching us what to be cautious of. I also heard that the next season has been green lit and will focus on a female killer which is kind of a relief in a way, cause I'd like to see how these people became who they are from both sides of the gender. But I get what others are saying about how Ryan Murphy is \"glorifying\" these people. Idk, I just wanna get other people's opinion on it.\n\nP.S. Forgot to mention that I love what they did with the correlation/motif &gt;!between Gein and the movie Psycho, I think it really brought it to life.!&lt;",
        "upvotes": 17,
        "comments": 135,
        "media": null,
        "permalink": "/r/netflix/comments/1o1qhd5/is_monster_the_ed_gein_story_really_that_bad/"
    },
    {
        "id": "1o25azn",
        "author": "SeargentDoaky",
        "title": "Netflix watch …",
        "content": "I’m watching ‘ True Story ‘ on Netflix and wahhh … didn’t expect Kevin Hart to pull this plot. \n\nGene’s part damn shook me fr though. \nLoyalty moves mad in some of these shows. \n\nThoughts? \n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o25azn/netflix_watch/"
    },
    {
        "id": "1o1w7qw",
        "author": "Practical_Captain_58",
        "title": "In Netflix you can Turn off “Are you still watching?” and tidy your rows . Also take a peak at Behind the scene developer info.",
        "content": "You can change playback, autoplay settings and remove items from “Continue Watching” small chores that make the Netflix homepage actually pleasant. Go to Profile → Account → Playback settings (or Manage Profiles) to tweak. Doing this feels like reclaiming the app.\n\nAlso, When a title is playing on desktop, there are diagnostic shortcuts that show bitrate, CDN, resolution and other behind-the-scenes info. I think it's kind of handy if your stream is laggy or you want to see if you’re getting 4K. The classic key combo is `Ctrl+Alt+Shift+D` (varies by device). It shows a little overlay with stream stats. Use it when you suspect quality issues or...... just to brag you know.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1o1w7qw/in_netflix_you_can_turn_off_are_you_still/"
    },
    {
        "id": "1o22g3i",
        "author": "-0k_0k_0k-",
        "title": "SK Movie Wishlist: Mariam Soulakiotis",
        "content": "I read that they planned on making more SK series after monster. I fell down the SK research hole to see how many victims Gein had. Looked up a list of people that had the highest number of victims and I found her: Mariam Soulakiotis.\n\nI am really surprised the person with one of the highest victim numbers was a woman. She is no Countess Elizabeth Báthory but still...\n\nI never really heard of Mariam before.  \nActress choices: (just playing pretend here)  \n\\- Kathy Bates  \n\\- Tilda Swinton  \n\\- Helena Bonham Carter\n\nWho would you cast? Any others you think would make a good series?\n\n  \n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o22g3i/sk_movie_wishlist_mariam_soulakiotis/"
    },
    {
        "id": "1o1yn2e",
        "author": "SpudmasterBob",
        "title": "Netflix Series Blu-ray Releases?",
        "content": "So my wife and I canceled some of our streaming subscriptions a while back to consolidate to the ones we watch the most, and Netflix was one we cut. \n\nHowever, there are a few shows like Stranger Things, Lost in Space, and Cobra Kai that I wouldn’t mind buying on Blu-ray if Netflix were ever to release them. \n\nHas Netflix said anything about whether or not they will be revisiting blu-ray releases of their popular shows? Or do they still have their heads up their $&amp;@*% about not releasing shows?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1o1yn2e/netflix_series_bluray_releases/"
    },
    {
        "id": "1o21m9w",
        "author": "herebutnotaround00",
        "title": "Netflix shows/series/movies",
        "content": "Hi!\n\nCan anyone recommend some interesting Netflix series that are really good and entertaining to watch every episode? Any genre is fine, as long as it keeps me hooked and helps pass the time.\n\nMy bf has been distant lately and barely talks to me, even when he has free time. He never initiates anything, and it’s starting to get to me so I wanna keep my mind off things 😅\n\nSo yeah, I’d really appreciate your suggestions. Please help a girl out! Thank you! 🧡",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1o21m9w/netflix_showsseriesmovies/"
    },
    {
        "id": "1o1tv6i",
        "author": "Various_History_3900",
        "title": "Billionaire Bunker questions.",
        "content": "I’m only on episode 5!!! Please no spoilers. \n\nHow are they keeping the phone hidden if there are mics in the bracelets? \n\nWhy didn’t max beat Guillermo ass when he started getting beat up? \n\nThanks in advanced ! \n\n",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1o1tv6i/billionaire_bunker_questions/"
    },
    {
        "id": "1o20z3y",
        "author": "freaky33",
        "title": "Sometimes no sound on Apple TV Netflix app with Dolby Atmos?",
        "content": "I have the Netflix app on my Apple TV (latest version of it), but when I start an episode of a series, I don't get any sound sometimes with Dolby Atmos. When I use a different streaming app it helps, and then I hear sound. When I switch back to the Apple TV Netflix app, the sound usually works again. Only the previews on the main page have sound. What's going on? It's only the Netflix app so there is nothing wrong with my HDMI cables or something.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1o20z3y/sometimes_no_sound_on_apple_tv_netflix_app_with/"
    }
]