[
    {
        "id": "1pb9xd4",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 13,
        "comments": 802,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pb9xd4/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1paqc6b",
        "author": "scoreboard-app",
        "title": "Match Thread: Girona FC vs Real Madrid Live Score | LaLiga 25/26 | Nov 30, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1paqc6b)",
        "upvotes": 60,
        "comments": 4918,
        "media": null,
        "permalink": "/r/realmadrid/comments/1paqc6b/match_thread_girona_fc_vs_real_madrid_live_score/"
    },
    {
        "id": "1pc5685",
        "author": "CoolIsopod3095",
        "title": "Throwback to this amazing real madrid counterattack against Ajax. Commentary makes it 10x cooler",
        "content": "",
        "upvotes": 507,
        "comments": 46,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/udam7ogpqr4g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pc5685/throwback_to_this_amazing_real_madrid/"
    },
    {
        "id": "1pcbmwi",
        "author": "o6ohunter",
        "title": "A collective issue, not an individual one",
        "content": "",
        "upvotes": 187,
        "comments": 60,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/km0qvxj99t4g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pcbmwi/a_collective_issue_not_an_individual_one/"
    },
    {
        "id": "1pc5yoq",
        "author": "Tuffyobro",
        "title": "Why is Endrick not getting a chance to prove  himself?",
        "content": "I think it’s very strange that Endrick isn’t getting enough minutes to prove himself. He was only subbed for one game this season with a total of like 12 minutes.\n\nHe was a real bright spark in the Copa del Rey last season, and every time he played, he looked like a genuine goal threat.\n\nHe scored a goal every 121 minutes last season, despite mostly coming on as a late substitute in la liga. He was the top scorer in the Copa del Rey and produced some really nice goals.\n\nI agree that his overall game still needs improvement, but he brings that goal threat which most of our attackers except Mbappé (and to some extent Gonzalo García) are lacking right now.\n\nYoung talent do not want to come to Madrid if they risk rotting on the bench for no reason.   \n",
        "upvotes": 127,
        "comments": 92,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pc5yoq/why_is_endrick_not_getting_a_chance_to_prove/"
    },
    {
        "id": "1pca18h",
        "author": "cyrusmancub",
        "title": "Mendy is out, having suffered a hamstring injury",
        "content": "",
        "upvotes": 62,
        "comments": 58,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pca18h/mendy_is_out_having_suffered_a_hamstring_injury/"
    },
    {
        "id": "1pc3uic",
        "author": "ColdAd3682",
        "title": "Real Madrid Transfer DealSheet: Rodrygo for sale, centre-back and midfield targets",
        "content": "",
        "upvotes": 86,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fnWmINrUxFPyvD-BlbzP6GNfya4F1JNfOQEODte4cjY.jpeg?auto=webp&amp;s=bf747cda2d05dd2bda25613c44c6f16c3bfaefaa"
        },
        "permalink": "/r/realmadrid/comments/1pc3uic/real_madrid_transfer_dealsheet_rodrygo_for_sale/"
    },
    {
        "id": "1pbpydm",
        "author": "Fit_Wrap_9580",
        "title": "Saw this video in X, why is real not playing like this,",
        "content": "It didn't matter who had to score, they played as a team, the important thing was to win no matter if it was with a goal from Fran García (who scored a goal), now it absolutely has to be just one player who scores because they can't be substituted either.\n\n  \nI was so happy to see this real madrid, my depression left my body lol, this real madrid had life in them. \n\nLook at Valverde who is playing so good, he is supposed to play like that.",
        "upvotes": 391,
        "comments": 77,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qg0r2oerxn4g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pbpydm/saw_this_video_in_x_why_is_real_not_playing_like/"
    },
    {
        "id": "1pc3twe",
        "author": "Total_Escape_9778",
        "title": "With 9 goals in only 5 matches, this is already the most prolific Champions League season of Mbappé’s career when it comes to goal scoring.",
        "content": "Just for context, the record of highest goal scoring season in the champions league is held by Cristiano Ronaldo with 17 goals in 11 games in the 2013-14 season.",
        "upvotes": 43,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yndi1rckar4g1.png?auto=webp&amp;s=39d420a1ea4eb22e886704672055577fc3489b7e"
        },
        "permalink": "/r/realmadrid/comments/1pc3twe/with_9_goals_in_only_5_matches_this_is_already/"
    },
    {
        "id": "1pbifs9",
        "author": "o6ohunter",
        "title": "Zinedine Zidane playing some pick up. Safe to say he’s still got it",
        "content": "",
        "upvotes": 783,
        "comments": 30,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/53ip59ynkm4g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pbifs9/zinedine_zidane_playing_some_pick_up_safe_to_say/"
    },
    {
        "id": "1pc416y",
        "author": "Fluffy-Management199",
        "title": "In Hindsight, was Carlo just unfairly treated ?",
        "content": "Now before everyone jumps at me for saying how terrible last season was, I’m not saying he was perfect but he did have a terrible defense all the year round because of injuries \n\nYes the football wasn’t pretty always but we didn’t have drama and well we did decent against smaller teams atleast even if the football wasn’t pretty necessarily. \n\nWas it unfair to be highly critical against Carlo in hindsight given that he had multiple injuries in the back line ?\n\nDo you think he would have succeeded if he had these new signings?\n\n\n\nEDIT: I also think that Xabi is given much more leniency when it comes to the results and football because he was a former player and a legend and if he wasnt, he would have a much higher repercussion in the fanbase",
        "upvotes": 40,
        "comments": 54,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pc416y/in_hindsight_was_carlo_just_unfairly_treated/"
    },
    {
        "id": "1pbfu9r",
        "author": "Nakul03",
        "title": "Kylian Mbappé has now scored 60 goals in 2025, with five matches still to play. 🇫🇷🔥",
        "content": "",
        "upvotes": 1049,
        "comments": 116,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lzno0bmh3m4g1.jpeg?auto=webp&amp;s=b3c6a4649afb0206f32fa614cd25045c36b4ebf5"
        },
        "permalink": "/r/realmadrid/comments/1pbfu9r/kylian_mbappé_has_now_scored_60_goals_in_2025/"
    },
    {
        "id": "1pca59u",
        "author": "Parking_Writer6719",
        "title": "Vini Jr x Bruno Mars",
        "content": "We want this Vini back :(",
        "upvotes": 11,
        "comments": 15,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/shm1mgahys4g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pca59u/vini_jr_x_bruno_mars/"
    },
    {
        "id": "1pccu4w",
        "author": "No-Independent2522",
        "title": "Real Madrid and the Community of Madrid sign a collaboration protocol for the creation of Madrid Innovation District  It will generate 1.2 billion euros annually to the regional GDP and more than 23,000 permanent jobs",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pccu4w/real_madrid_and_the_community_of_madrid_sign_a/"
    },
    {
        "id": "1pbj3ct",
        "author": "Saharan-Gladiator",
        "title": "Xabi is starting to seem like a hypocrite",
        "content": "During the CWC, he was praising Gonzalo Garcia but Gonzalo only gets brought in at the 89th minute. Benching Vini when he's having a bad game is great but Mbappé plays the whole game even if he's not having a good game. Gonzalo and Endrick must feel pretty discouraged right now. There's even a fake AI picture of Endrick crying during the Girona game, that's how he must feeling inside. Xabi has went back on all of his promises since the start of the season. So many questionable decisions from Xabi",
        "upvotes": 312,
        "comments": 164,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbj3ct/xabi_is_starting_to_seem_like_a_hypocrite/"
    },
    {
        "id": "1pbmtik",
        "author": "sosephjr",
        "title": "Vini chance against Girona at 45’. Take a closer look to one player…",
        "content": "",
        "upvotes": 173,
        "comments": 166,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/bzkqoexycn4g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pbmtik/vini_chance_against_girona_at_45_take_a_closer/"
    },
    {
        "id": "1pbg970",
        "author": "Nakul03",
        "title": "Xabi Alonso reaction to Mbappe miss vs Girona 90+4'",
        "content": "",
        "upvotes": 279,
        "comments": 56,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/33kv8un86m4g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pbg970/xabi_alonso_reaction_to_mbappe_miss_vs_girona_904/"
    },
    {
        "id": "1pc5mu7",
        "author": "Cursorium",
        "title": "Is Celta match sold out or am I using the site wrong?",
        "content": "I am visiting Madrid on Sunday, and I wanted to visit the match against Celta, but I am having trouble getting the tickets. I sometimes get the option to choose a seat, but whenever I try to choose a seat, there's a message that there are no seats available anymore. I refresh the site, and then there are new seats available. Am I doing something wrong?",
        "upvotes": 6,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pc5mu7/is_celta_match_sold_out_or_am_i_using_the_site/"
    },
    {
        "id": "1pbek7b",
        "author": "Painting-Best",
        "title": "We have to talk about Federico Valverde...",
        "content": "Straight to the point, this guy has been a shadow of his former self. His perfomances as a middlefielder have been average at best since the cwc. There is not a single thing he contributes to the game. He doesnt create chances, doesnt control the tempo, never takes his space on runs, plays like he's scared to play offensive and the guy doesnt even shoot anymore. He used to be this extremely passionate workhorse but we dont see that nowadays either. He plays like he's tired. Keep in mind this is the captain of real madrid we're talking about here. You wouldnt ever notice that he's the captain if it werent for his armband. This sub is going crazy about Jude and Arda but in reality Fede is the one who's been severly underperforming. Camavinga 100% deserves the starting spot over him. Hope he gets back to his best...",
        "upvotes": 240,
        "comments": 87,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbek7b/we_have_to_talk_about_federico_valverde/"
    },
    {
        "id": "1pbko2o",
        "author": "Critical-Remove-1878",
        "title": "\"We should blame Xabi, these players won the UCL a couple of seasons ago, they didn't suddenly get worse\"",
        "content": "Here's an example of why this couldn't be further from the truth:\n\nManchester City won a treble in 22/23 (in more dominant fashion than our double in 23/24) and yet last season most of their players were terrible. Now Ederson and Gundogan are playing in Turkey, Cancelo and Mahrez are playing in Saudi, De Bruyne and Rodri are injured all the time, Walker plays for the worst team in EPL, Grealish plays for Everton, others like Stones or Ake are washed, even Bernardo or Foden are nowhere as good as they used to be.\n\nApart from Haaland, the only ones who are as good or improved from their 22/23 squad are... Alvarez and Palmer, two players that ironically don't even play for them anymore.\n\nAnd this is just the most recent example, we've seen other teams winning trophies and then regressing a lot soon. Inter 2010, Chelsea 2021 are a couple of good examples. We've seen it with our own team as well. How good were the likes of Marcelo, Isco, Asensio, Varane etc. in 2018 and how these guys were performing a season or two or three later?\n\nI don't understand why people can't grasp the concept of players regressing, even if they won trophies in the near past. Doesn't matter if these players are in their 20s, don't have injury issues or they were very succesful recently. Dembele and Raphinha were both considered failures until a year ago, yet last season they were the two most influential players. Salah went from Ballon d'Or candidate to a completely painful to watch ghost of himself, in a matter of few months. Hazard was considered a top 10 player on earth when he joined us. Players get better and worse all the time, I know some people are too sentimental with our current squad, but it's time we should start accepting that fact, some players (not all of them) are already past their primes.",
        "upvotes": 118,
        "comments": 84,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbko2o/we_should_blame_xabi_these_players_won_the_ucl_a/"
    },
    {
        "id": "1pbbg7o",
        "author": "Frostb1",
        "title": "Aint no way y'all doubting Bellingham",
        "content": "People gonna downvote this shit but Bellingham is so much better than arda, everywhere. We lost because we couldnt convert open chances. The blame doesnt go to Bellingham alone. Anyone who says Bellingham is the problem shouldn't watch madrid. He is alone the reason we won against barca, infact our last UCL was won cause he was there. So before y'all talk about my bubblegum like that. Use your brain.",
        "upvotes": 158,
        "comments": 117,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbbg7o/aint_no_way_yall_doubting_bellingham/"
    },
    {
        "id": "1pbd6ld",
        "author": "Little_Knowledge6249",
        "title": "This club situation is not Xabi’s fault",
        "content": "I will get attacked for this opinion, but even if Xabi gets sacked we will be the same with the new coach because guys, let’s be real, this squad is tactically built wrong. We don’t have a proper 8 or 6 who will make us have a good midfield that makes us win matches Our 6, who is  Tchouaméni, a 90M worth player, he is not a proper 6. many deserve this place more than him: Caicedo or Elliott Henderson or Wharton or De Jong and many more. And our 8, the English model who doesn’t want to play 8 and makes a mess because he wants to play 10 and park at the front to score tap-ins and celebrate, but to play as a proper 8 and be useful for the team ? No it won’t happen.\n And the big two stars Vini and Kylian who only want their personal benefit, not the team. The poor press they don’t even do it.\nVini , who made the disrespectful action in the classico who loses the ball a million times in every match and become a winger can’t get even agianst any Right back in 1v1 except some matches and we saw it and makes stupid decisions most of the matches this season,man even Bradley put him in his pocket \nAnd Kylian, who wants princess treatment. he won’t press like the rest of the team; he doesn’t want to tire himself every match. He just scores goals and celebrates, that’s all.\n\nXabi obviously have faults but will it be Every time the coach faults? So Carlo was first now Xabi, Every time we will do the same mistake and blame the Coach and forget about the Ridiculous players ?",
        "upvotes": 102,
        "comments": 74,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbd6ld/this_club_situation_is_not_xabis_fault/"
    },
    {
        "id": "1pb1efn",
        "author": "No-Independent2522",
        "title": "Losing my sanity over this team 😭 [OC]",
        "content": "",
        "upvotes": 681,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rvyv83dzbi4g1.jpeg?auto=webp&amp;s=a6d26c567a66fb2ac27058c64c1cd73cfd259f42"
        },
        "permalink": "/r/realmadrid/comments/1pb1efn/losing_my_sanity_over_this_team_oc/"
    },
    {
        "id": "1pb9xky",
        "author": "Awkward_Method1552",
        "title": "Madridistas these days",
        "content": "",
        "upvotes": 146,
        "comments": 13,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qi73ytdtqk4g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pb9xky/madridistas_these_days/"
    },
    {
        "id": "1pb2q7u",
        "author": "killorbekilled_",
        "title": "KP Boateng: \"Before I joined Barcelona, I said Cristiano Ronaldo is the best player and Real Madrid is the best.\" \"After I joined Barca, they forced me to say Lionel Messi is the best, otherwise you cannot play here.\" \"I LIED because I wanted to play.\" (@unscriptedtheshow youtube)",
        "content": "",
        "upvotes": 517,
        "comments": 79,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/43rebdbani4g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pb2q7u/kp_boateng_before_i_joined_barcelona_i_said/"
    },
    {
        "id": "1pb4rny",
        "author": "Mean_Teach_6999",
        "title": "In other news... Justin seen wearing a Real Madrid Kit!",
        "content": "I know we're all upset but just saw this and wanted to share !",
        "upvotes": 350,
        "comments": 53,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xvigyc4t5j4g1.png?auto=webp&amp;s=ac01b745875e92c9f9a79ba33b34d4314e23eb33"
        },
        "permalink": "/r/realmadrid/comments/1pb4rny/in_other_news_justin_seen_wearing_a_real_madrid/"
    },
    {
        "id": "1pb8ex1",
        "author": "AffectionateGift3560",
        "title": "Guler's performance against Girona.",
        "content": "What do you think about his performance? \n\n He's playing a bit out of position, but he still played the 10 role at times. People think just because he plays in ten roles we automatically win games. and I don't think he was better than Jude.\n\nI see so many people complaining about Jude's ball hugs, but like, if he didn't, we would just end up backpassing.\n\nI think today's game but Jude and Güler were meant to play CM, but they kept gravitating to their natural position. What do you think?",
        "upvotes": 167,
        "comments": 110,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7spotmiu9k4g1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1pb8ex1/gulers_performance_against_girona/"
    },
    {
        "id": "1pay7qs",
        "author": "No-Independent2522",
        "title": "Courtois on Insta after tonights draw",
        "content": "",
        "upvotes": 581,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w8np2oyhlh4g1.jpeg?auto=webp&amp;s=d7de6c06a202aeb5bc1a23c68c0c8b7c76263638"
        },
        "permalink": "/r/realmadrid/comments/1pay7qs/courtois_on_insta_after_tonights_draw/"
    },
    {
        "id": "1pbwxxi",
        "author": "SingerStark",
        "title": "Watch a game in january/26",
        "content": "Hi, madridistas. \n\nI am going to Madrid at the end of this year, and I would very much like to watch the Real Madrid vs. Real Betis game on January 4, 2025.\n\nI'm Brazilian and I know I'm unlikely to return to Spain again. So this is a unique opportunity. Could you help me with tips on how to buy tickets to watch the game?\n\nI know it's very difficult to buy them online, and I'm already imagining that I won't be able to do it this way. I'm evaluating alternative options: buying directly through socios or buying through reseller websites.\n\nWhat would be the best option?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbwxxi/watch_a_game_in_january26/"
    },
    {
        "id": "1pbji04",
        "author": "Rippersavage",
        "title": "Why does it feel like we're not improving anymore?",
        "content": "At one point you could see the team was improving game by game... but now, it's been awhile since I saw the team actually getting better. If anything we've gotten worse: we're no longer doing those full commitment tackles to win the ball high up the field and our pressing has decreased (it wasn't really that good anyway).\n\nHonestly, besides Arda becoming a starter, everything that changed under Xabi has gone right back to being no different from when we had Ancelotti \n\nI know Xabi hasn't been our coach for that long, but c'mon, there should've been more of a difference by now \n\nI don't want Madrid to become like Manchester United, where we go years of being a shadow of our former selves\n\nThis so called second generation of galacticos already seems like a failed project... just like the one that came before it",
        "upvotes": 20,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1pbji04/why_does_it_feel_like_were_not_improving_anymore/"
    }
]