[
    {
        "id": "1p5e4zn",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 16,
        "comments": 4296,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p5e4zn/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1p7lbwm",
        "author": "scoreboard-app",
        "title": "Post Match Thread : OLY vs RMA, match 5 UCL 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1p7lbwm)",
        "upvotes": 80,
        "comments": 319,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p7lbwm/post_match_thread_oly_vs_rma_match_5_ucl_2025/"
    },
    {
        "id": "1p8mx28",
        "author": "vil727",
        "title": "Champions League heritage.",
        "content": "",
        "upvotes": 501,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yp2uozzppx3g1.jpeg?auto=webp&amp;s=4e65c01bcbe5cd8155b27362acd088ecdec0ccfb"
        },
        "permalink": "/r/realmadrid/comments/1p8mx28/champions_league_heritage/"
    },
    {
        "id": "1p88ait",
        "author": "Ready_Ad_1353",
        "title": "Mbappé shuts down reporter when asked if Madrid is overly dependent on him to win games: “You shouldn’t say that. I think that’s a bad question, with all due respect. I don’t think there’s any kind of dependence. Without the other players we don’t win games. Everyone has a role in the team”",
        "content": "",
        "upvotes": 973,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YlpNshjKcwmR4PYOUHtHHhzKt_vDn3p4kBQfiPqAYF4.png?auto=webp&amp;s=7a9b1679066c0422d7450d64aa1375b6caa1b7e8"
        },
        "permalink": "/r/realmadrid/comments/1p88ait/mbappé_shuts_down_reporter_when_asked_if_madrid/"
    },
    {
        "id": "1p85tyz",
        "author": "o6ohunter",
        "title": "Vinicius Junior goes level with Karim Benzema for all-time UCL assists. Next up? Cristiano Ronaldo.",
        "content": "",
        "upvotes": 655,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/l1cec5d1pt3g1.jpeg?auto=webp&amp;s=6fd679e7fe9cdb61910cc087c9d54eda93d7a0b1"
        },
        "permalink": "/r/realmadrid/comments/1p85tyz/vinicius_junior_goes_level_with_karim_benzema_for/"
    },
    {
        "id": "1p8ddts",
        "author": "IstanbulisLacivert",
        "title": "This is accurate asf",
        "content": "",
        "upvotes": 240,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qlnae2mr8v3g1.jpeg?auto=webp&amp;s=6222f262966a9d41e471cb821a5ebe1307bf2b2a"
        },
        "permalink": "/r/realmadrid/comments/1p8ddts/this_is_accurate_asf/"
    },
    {
        "id": "1p8pl3a",
        "author": "landofphi",
        "title": "[David Ornstein] Real Madrid inform Liverpool they have no intention of signing Ibrahima Konate",
        "content": "",
        "upvotes": 31,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AoFoBp-0o3xe8By4WV_-Q6qiKfaF7tlpZRpOodYxke0.jpeg?auto=webp&amp;s=7c89604820f45cfb6a1c2601c096f263a10c83e7"
        },
        "permalink": "/r/realmadrid/comments/1p8pl3a/david_ornstein_real_madrid_inform_liverpool_they/"
    },
    {
        "id": "1p8epgv",
        "author": "No-Independent2522",
        "title": "Toni Kroos received Germany’s prestigious Knight’s Cross of the Order of Merit at the Bernabéu today",
        "content": "Kroos: “The Bernabéu seems like the perfect place to receive this award.”\n\n“It means a lot because it’s an award that’s not just for football, and it’s the biggest thing you can receive in Germany,” our legend added on Realmadrid TV.\n\nToni Kroos spoke to Realmadrid TV after receiving the Knight's Cross of the Order of Merit of the Federal Republic of Germany. The Real Madrid legend expressed his pride: “I'm very happy. I've received several awards in my career, but this is the highest honor you can receive in Germany. And if it's also for the Foundation, where we help sick children and their families, this award means a great deal.”\n\n\"I knew Florentino Pérez\nand the German president would be there , but I didn't know my former teammates would be there. Not even Antonio (Rüdiger), who is a very good friend, told me. It was a surprise , and it makes me happy to know that I had good teammates and good people.\"\n\nReturning home\n“When they told me the event was going to be at the  Bernabéu  , I was very happy, because it seems like the perfect place to receive this Order. It has been my home for 10 years and I feel it will always be my home. I always enjoy being in this stadium.”\n\nHis spectacular farewell at the Bernabéu\n: “The whole day was spectacular. Weeks before, I'd already said I wanted a farewell at the Bernabéu when we had nothing left to play for, and that we should finally be champions so I could enjoy it. That's exactly what happened, and from the moment I left home until I returned, I enjoyed it. What they prepared for me, the affection of the fans, my teammates, the president, the coach… It was special.”",
        "upvotes": 148,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p8epgv/toni_kroos_received_germanys_prestigious_knights/"
    },
    {
        "id": "1p822og",
        "author": "cyrusmancub",
        "title": "Fede’s statement on the drama surrounding the team in the last week",
        "content": "“After a week in which a lot of things were said about us, we are now more united than ever.\n\nHaving Vini and Mbappé in the team is luck, but playing with the best team in the world and a committed group is a great honor.\n\nOn a personal level, I'm working to return to my best level. The coach has always been by my side, supporting me and doing everything he can to help me continue to develop and help the team.\n\nIt's not always easy, but the technical staff and the players are more united than ever.” 🤍",
        "upvotes": 412,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zqzzlw97ws3g1.jpeg?auto=webp&amp;s=05bcaf0d0424c3a094c1291660ad9ee484073c9c"
        },
        "permalink": "/r/realmadrid/comments/1p822og/fedes_statement_on_the_drama_surrounding_the_team/"
    },
    {
        "id": "1p7w71f",
        "author": "Quirky_Appearance539",
        "title": "Even Mesut didn't have this much of an assist fetish",
        "content": "Jokes apart Guler is a top tier creator no doubts on that",
        "upvotes": 809,
        "comments": 73,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/liuh2tds5r3g1.jpeg?auto=webp&amp;s=8ee7b1fcc8bdf46ee384d7fd77310fb1d7dd0081"
        },
        "permalink": "/r/realmadrid/comments/1p7w71f/even_mesut_didnt_have_this_much_of_an_assist/"
    },
    {
        "id": "1p7xtpy",
        "author": "landofphi",
        "title": "Luka Modric: \"Staying at Real Madrid for 13 years. From 27 to almost 40, that's incredible. It's a club that doesn't tolerate mediocrity. When I arrived, I thought it would be great if I stayed for 6 years. I thought careers lasted until 34. Not only have I surpassed that, I'm still at that level\"",
        "content": "**On AC Milan**\n\n\"I always said that after Real Madrid everything is a step down, everyone can confirm that. But I think I've joined a club that is very close to Real Madrid in terms of reputation and history. It was an ideal situation for me.\n\nWhen the Milan option appeared, I knew that was it. I stayed at a high level. The Italian league is one of the most competitive in Europe, it is not easy to play. But ot was an easy choice for me. Especially because of the approach of the people and the club.\"\n\n**On his departure from Real Madrid**\n\n\"Leaving Real Madrid wasn't easy, I spent half my life there. That was one of the best periods of my life. I arrived quite late, at 27, but I was ready for that leap. Four years in England helped me a lot. Everything after that seems unreal to me, what I achieved.\n\nIf someone had said to me: \"Write what you would be happy with at Real Madrid\", I would have been afraid to write everything I achieved later. Trophies and victories are aside, but staying at a club like that for 13 years... From 27 to almost 40, that's something incredible.\n\nWe know what Madrid is like, a club that doesn't tolerate mediocrity. Staying at a club like that for so many years is the most incredible thing. When I arrived, I thought it would be great if I stayed for five or six years. I thought careers lasted until 33–34. Not only have I surpassed that, I'm still at that level.\"\n\n\"Staying at Real Madrid was really my big wish, it wasn't just platitudes or flattery to the fans. Sometimes some wishes don't come true. Even though my wish to retire in Madrid didn't come true, I achieved some things I never thought I would. I don't regret anything. I never expected this in my wildest dreams.\n\n\"The love of the fans, the club and all the people connected to the club remains forever. I have no words to thank them for that treatment. It was like that from day one. Even though I had difficulties at the beginning, I felt the love and affection of the fans. They felt that I was the one. That gave me the motivation to give back to them in the best way.\"",
        "upvotes": 517,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/u3osJ2AtKjZ5ho1yVncB41cGSFFiyh81Q3wlrQ14wwg.jpeg?auto=webp&amp;s=2dade70bbd8c02832842f7a9f552d9b3cf8ad50b"
        },
        "permalink": "/r/realmadrid/comments/1p7xtpy/luka_modric_staying_at_real_madrid_for_13_years/"
    },
    {
        "id": "1p84748",
        "author": "94Temimi",
        "title": "Real Madrid's goalscorers so far this season",
        "content": "Mbappe has been simply unstoppable this season. The gap is huge, and as much as it's great seeing him be in such an amazing form, it's also a warning for the team that we need our other forwards to start contributing more.\n\nIt's been such a weird period since El Classico with lots of yapping from the media, which, even though it's mostly nonsense, it would still affect the team. So, hopefully with the wave of comments from the players and Xabi after yesterday's match about sticking together and focusing on helping each other, this would bring the team back on track and we resume the upwards momentum we've built up to our match against Barcelona.\n\nThere are things to fix, but as long as the board is supportive of Xabi and the players are fully bought into this new era, we're going to be a very competitive team and we've seen it earlier in the season, we just need that aggression back and we should be good! ",
        "upvotes": 171,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jbusbi3pbt3g1.png?auto=webp&amp;s=4faa298fff7b2435cc089684ea8bab33d4faa3c4"
        },
        "permalink": "/r/realmadrid/comments/1p84748/real_madrids_goalscorers_so_far_this_season/"
    },
    {
        "id": "1p7kuc3",
        "author": "thorof11",
        "title": "What does bro need to do to get a 10💀",
        "content": "",
        "upvotes": 3071,
        "comments": 153,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/08ih3acobo3g1.jpeg?auto=webp&amp;s=b58ddcd05342e80b86c96fd11880a33340ae32dc"
        },
        "permalink": "/r/realmadrid/comments/1p7kuc3/what_does_bro_need_to_do_to_get_a_10/"
    },
    {
        "id": "1p83m96",
        "author": "More-Judgment-9253",
        "title": "Camavinga vs Olympiacos",
        "content": "According to some people here he's not good enough even though he's only had one bad game this season when he has playing on the RW lol. Nobody in our midfield is as press resistant as him and his ball carrying is great along with his tackles which are also the best out of our midfielders ( very close with tchouameni), and his long passes are also top tier. If only he wasn't so injury prone though😔",
        "upvotes": 126,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6rfbw4zl7t3g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p83m96/camavinga_vs_olympiacos/"
    },
    {
        "id": "1p7rdct",
        "author": "SaniaXazel",
        "title": "Alternative angle of the Vini assist to Mbappe and Celebration",
        "content": "",
        "upvotes": 957,
        "comments": 25,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3kvs68p6up3g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p7rdct/alternative_angle_of_the_vini_assist_to_mbappe/"
    },
    {
        "id": "1p7wtrn",
        "author": "SaniaXazel",
        "title": "Yesterday, Raúl Asencio's grandfather passed away and yet today he played with Real Madrid. Rest in peace, and strength to Raúl",
        "content": "",
        "upvotes": 260,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p7wtrn/yesterday_raúl_asencios_grandfather_passed_away/"
    },
    {
        "id": "1p86ts8",
        "author": "o6ohunter",
        "title": "Our fanbase after a result is way too hilarious",
        "content": "We get a positive result and here’s the media:\n“Talks of a heated and divided dressing room are heavily exaggerated. The players remain in FULL backing of Xabi, with no infighting. The coach has made a recent effort to bond with the players that was VERY well received.”\n\nThe media after a loss:\n“Despite recent form, Vinicius STALLS renewal talks INSISTING that he is the top paid on the team, demanding more than Cristiano Ronaldo. Up next? Will Jude Bellingham have to be SOLD in order to accommodate Guler and is Valverde becoming a LIABILITY to the squad?!?”",
        "upvotes": 49,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p86ts8/our_fanbase_after_a_result_is_way_too_hilarious/"
    },
    {
        "id": "1p8ae68",
        "author": "Bunchdawg",
        "title": "All of our goals came from fast paced transition yesterday",
        "content": "I understand the team wants to play more possession-based football, but we also need to mix things up and lean into our strengths. We have some of the fastest attackers who can take on defenders all day, yet it’s difficult for them to thrive when opposing backlines are already set. To maximize their impact, our pressing should adjust, starting lower around midfield to create space for runs in behind.\n\nWe’re fortunate to have the best shot-stopper, and once our backline is fully healthy, defending should become more stable. Right now, though, we lack creativity in midfield. Honestly, when was the last time we scored a truly beautiful team goal, like Olymp’s opener against us?",
        "upvotes": 33,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p8ae68/all_of_our_goals_came_from_fast_paced_transition/"
    },
    {
        "id": "1p8cc7q",
        "author": "TheSayou",
        "title": "The head-to-head archive between Real Madrid and Girona",
        "content": "",
        "upvotes": 19,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3k2tkzi61v3g1.png?auto=webp&amp;s=ece57eb0300120e8c7318a0d57bc61ed82ec2021"
        },
        "permalink": "/r/realmadrid/comments/1p8cc7q/the_headtohead_archive_between_real_madrid_and/"
    },
    {
        "id": "1p7il24",
        "author": "shakhthe",
        "title": "Mbappe scores a HEADER and makes it 1v2. Olympiacos vs RM",
        "content": "Yeah, Mbappe is scoring headers. Nice",
        "upvotes": 1290,
        "comments": 59,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2iyjd4rfvn3g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p7il24/mbappe_scores_a_header_and_makes_it_1v2/"
    },
    {
        "id": "1p7j25i",
        "author": "No-Independent2522",
        "title": "Someone remind Arda he can shoot 😭😆 (MEME)",
        "content": "",
        "upvotes": 1172,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lr9xopm0zn3g1.jpeg?auto=webp&amp;s=410bb84d600a91f185fdf71de5b48be0f9e690ae"
        },
        "permalink": "/r/realmadrid/comments/1p7j25i/someone_remind_arda_he_can_shoot_meme/"
    },
    {
        "id": "1p7nz9y",
        "author": "SaniaXazel",
        "title": "Xabi and Vini during the Match",
        "content": "",
        "upvotes": 522,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/nm51994zzo3g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p7nz9y/xabi_and_vini_during_the_match/"
    },
    {
        "id": "1p7m3z7",
        "author": "TheFeatherDiaries",
        "title": "Arda Güler playing as Number 10 vs Olympiacos",
        "content": "",
        "upvotes": 546,
        "comments": 136,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/x68ui70sko3g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p7m3z7/arda_güler_playing_as_number_10_vs_olympiacos/"
    },
    {
        "id": "1p8754a",
        "author": "RM-PostMatchSurveys",
        "title": "[Post-Match Survey] Real Madrid 4-3 Olympiacos",
        "content": "",
        "upvotes": 20,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p8754a/postmatch_survey_real_madrid_43_olympiacos/"
    },
    {
        "id": "1p7jabz",
        "author": "FearlessWasFounded",
        "title": "Zero goals in 3 games.... then a 7 minute hat-trick.",
        "content": "This is what world class players do. This is what it must've felt like seeing messi and ronaldo going on par for par against each other. Started a game little shaky but once he got that rhythm, he didn't stop🔥 it's just half-time and let's not forget that we still have another half left of exciting thriller of a match",
        "upvotes": 713,
        "comments": 40,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/caoiverl0o3g1.jpeg?auto=webp&amp;s=1ad4b7a059b1f30c9fb4fb64a0e6fee471e46fce"
        },
        "permalink": "/r/realmadrid/comments/1p7jabz/zero_goals_in_3_games_then_a_7_minute_hattrick/"
    },
    {
        "id": "1p7zt2u",
        "author": "Sel2g5",
        "title": "Team set up - Arda vs Belli",
        "content": "At least from the sample of matches we've watched in the Xabi era, is it not clear that Arda's best position is 10 and the team looks better put together when he is in that role? \n\nThink of it this way, Arda was making dangerous passes to the offensive players and moving the ball forward very well yesterday. The connection with mbappe is undeniable at this point. \n\nI like camvinga and he had a great assist  and some good defensive work, but he looked shaky on the ball.  Imagine Jude playing that role, he's an upgrade on cama in every way. \n\nArda is also not selfish, he looks to link up with players as soon as he has the ball. Jude is usually looking to dribble and place himself also in scoring position. If anything, Arda should look to shoot a little more. \n\nThat's not to say if Bellingham sees an opening he doesn't drive or crash the box, but in that case Arda has to drift over more to the right (which is Madrids weak point in the last few years, or drop back to cover ala Modric style.)\n\nGranted, olyimpiacos is one of the worst teams in the UCL, but Madrid at least found it's footing and looked dangerous. \n\nI think both players are phenomenal. What Jude did in his first year was legendary, but what's best to help the team seems Arda at 10 and Jude at 8. Am I right? ",
        "upvotes": 34,
        "comments": 37,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p7zt2u/team_set_up_arda_vs_belli/"
    },
    {
        "id": "1p81945",
        "author": "chunchunmaru1129",
        "title": "If CR7 played his whole career as a striker would would he have already passed 1000 goals? And what age would he have done it?",
        "content": "As we know Ronaldo started his career as a Right midfielder and played in united for some years there before becoming a left winger and from I think 2007-2014 I think he played as a left winger until he got that injury before the world cup which caused his speed to drop significantly and he had to change his position to striker. \n\nNow as we know CR7 has scored more goals after turning 30 then he has before 30.\n\nSo do you guy's think if CR7 played his whole career as a striker would he have already surpassed 1000 and could he be on his way to 1500 and what age he would have reached 1000?\n\n(Sorry I added two would mistakenly in post title)",
        "upvotes": 24,
        "comments": 28,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p81945/if_cr7_played_his_whole_career_as_a_striker_would/"
    },
    {
        "id": "1p7n2l0",
        "author": "Confident-Setting889",
        "title": "Trent Alexander-Arnold appreciation post",
        "content": "This guy is unbelievable. I lost count how many times we were pissing down our leg in the back and when we finally get the ball to him, this guy whips it a crazy distance across the pitch with insane accuracy to beat the press. Not to mention his ability to instantly change the situation, literally one second the opposing team is on the attack, trent stops it, and sends it down the other end of the pitch to vini or mbappe the next. His ability to immediately shift the situation from us stopping their attack, to the cbs chasing vini or mbappe from recieving a trent pass in mere seconds is unlike anything the rest europe currently has to offer.  \n\nAfter his injury recovery im assuming he wasnt 100% fit up until recently. but speaking strictly before then (before the marseille injury), when he was alternating starts with Dani, idek how this guy was sitting on bench, or wtf Xabi was seeing in practice. because everything i've seen on the pitch from him has solved a large amount of our ball progression out the back and has formed a sort of band-aid over the fact that we still lack a deep-lying playmaking MF atm. \n\nI get ppl have reservations about his defensive awareness, but as far as I care, he hasnt made any huge defensive blunder in a madrid shirt. maybe a few lapses, but those happen to any defender. And those would only continue to decrease as we continue to get guys back from injury and strengthen our backline in the upcoming summer. Especially playing alongside guys like tchouameni/fede. \n\n  \nTLDR: this guy is gonna be a generational pick up for us",
        "upvotes": 262,
        "comments": 38,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p7n2l0/trent_alexanderarnold_appreciation_post/"
    },
    {
        "id": "1p7iog2",
        "author": "cosmic_retro",
        "title": "Kylian Mbappé scores a hattrick in 7 minutes vs Olympiacos",
        "content": "",
        "upvotes": 435,
        "comments": 41,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p7iog2/kylian_mbappé_scores_a_hattrick_in_7_minutes_vs/"
    },
    {
        "id": "1p7k3kh",
        "author": "No-Independent2522",
        "title": "Guler's call to Mbappe leaked",
        "content": "",
        "upvotes": 340,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i4on3s8a6o3g1.jpeg?auto=webp&amp;s=066fc7916852a4ada2a04904ee0748e9689763fd"
        },
        "permalink": "/r/realmadrid/comments/1p7k3kh/gulers_call_to_mbappe_leaked/"
    }
]