[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 497,
        "comments": 270,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j31tc7",
        "author": "Certain_Passion1630",
        "title": "Why did Suits get so much more hype than White Collar?",
        "content": "Maybe this is a popular take I wasn’t aware of, but I started watching Suits 1-2 years ago when it seemed like everyone was talking about it. \n\nI just finished season 1 of White Collar, and all the character dynamics are basically the same: the genius criminal (Neal and Mike), the experienced mentor (Peter and Harvey), the quirky ally (Moz and Louis), and the smart woman behind the scenes keeping everyone levelheaded (Elizabeth and Donna). \n\nThen I looked and White Collar came out 2 years before Suits. I don’t know how popular the shows were when they first aired, but Suits was in the Netflix top 10 for weeks and I just happened to see White Collar one day while scrolling through shows. ",
        "upvotes": 64,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1j31tc7/why_did_suits_get_so_much_more_hype_than_white/"
    },
    {
        "id": "1j2ot14",
        "author": "FuturismDotCom",
        "title": "Netflix Is Using AI Upscaling on a 1980s Sitcom and the Results Are Horrific",
        "content": "",
        "upvotes": 202,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1j2ot14/netflix_is_using_ai_upscaling_on_a_1980s_sitcom/"
    },
    {
        "id": "1j34j3w",
        "author": "Independent-Dark-910",
        "title": "Just lost my account",
        "content": "Hey everyone, I need to vent about something wild that just happened. I went to fire up Netflix on my TV last night, only to see my account was signed out. Weird, right? I figured it was a glitch, so I tried logging back in—bam, denied. Okay, no biggie, I’ll reset my password. Except when I tried, Netflix hit me with “no account exists” for my email. This is an account I’ve had for over five years.\n\nAt this point, I’m thinking, “Oh great, I’ve been hacked.” So I call Netflix support to sort it out. I’m assuming five years of payment history tied to my card, watch history, all that jazz would make it obvious I’m the real owner. The rep I talked to was nice enough—she even admitted she could see the new email on the account looked fraudulent (some random string of letters and numbers). But then she drops the bomb: there’s nothing she can do. Apparently, because the email got changed, I’m locked out for good unless I want the whole account wiped. Years of watchlists, recommendations, and profiles? Gone.\n\nLuckily, my Netflix password was unique, so this won’t spiral into other accounts getting compromised. Still, it stings to lose it like that. I’m just baffled they couldn’t verify me with all the data they have—payment records, IP addresses, something! The only option they gave was to nuke the account and start fresh. I get that security protocols exist for a reason, but this feels like punishing the victim instead of the hacker.\n\nHas anyone else dealt with this? Did I miss some secret way to reclaim it? Or am I just stuck rebuilding my Netflix life from scratch?",
        "upvotes": 8,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1j34j3w/just_lost_my_account/"
    },
    {
        "id": "1j2jsij",
        "author": "MysteriousDelay6266",
        "title": "The Electric State | Final Trailer | Netflix",
        "content": "",
        "upvotes": 44,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1j2jsij/the_electric_state_final_trailer_netflix/"
    },
    {
        "id": "1j2yv2n",
        "author": "Lullaby_of_Broadway",
        "title": "Looking for a certain true crime documentary that had animation",
        "content": "Looking for a true crime documentary I saw on Netflix about a teenage murder. What set it apart was that to hide each kids identity they animated them. Does anybody know?",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j2yv2n/looking_for_a_certain_true_crime_documentary_that/"
    },
    {
        "id": "1j31tue",
        "author": "Substantial-Area9201",
        "title": "Medusa trailer language spoken",
        "content": "Which language was it? Sounds like Spanish, unfortunately I'm not familiar enough with other languages to know for sure that it is Spanish and if so which Spanish specifically ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j31tue/medusa_trailer_language_spoken/"
    },
    {
        "id": "1j2zcqa",
        "author": "overpower84",
        "title": "Start live events from the begining",
        "content": "There needs to be a way to start live events from the beging BEFORE you start playback \n\n(I know you can click \"start from begining\" AFTER you start playback of the event) but they need to add the ability to start from the beginning BEFORE you start a currently running event.\n\n(I've got Roku stick+ if the option is available on other platforms)\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2zcqa/start_live_events_from_the_begining/"
    },
    {
        "id": "1j2f9a3",
        "author": "SphincterRelaxer",
        "title": "What Jennifer did",
        "content": "This documentary is crazy. A bit of spoiler here but Jesus Christ I feel for her. What horrible parents. What they did to her when she was obviously suffering under all that pressure is beyond cruel . They didn’t treat her like their child, how could they been so strict and cold is beyond me. I know what she did is horrid but I can’t really judge her. Poor kid ",
        "upvotes": 33,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1j2f9a3/what_jennifer_did/"
    },
    {
        "id": "1j2mg69",
        "author": "Illustrious_Gear_471",
        "title": "Zero Day TV Show Classified Folder Actually Unclassified",
        "content": "In S1E2, 4 minutes and 42 seconds before the end, a folder is shown for a top secret government program known as Proteus. However, on this TOP SECRET folder is a sticker that says “U//FOUO” which literally means UNCLASSIFIED, for official use only. I thought this was funny and wanted to share.",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2mg69/zero_day_tv_show_classified_folder_actually/"
    },
    {
        "id": "1j2zgmu",
        "author": "Shoddy-Scallion-4903",
        "title": "College interview",
        "content": "Hi everybody, For my studies, I have to write a thesis on business models in video streaming platforms. I’d be really happy if someone working in this field could spare a few minutes for a quick chat. Thanks so much!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2zgmu/college_interview/"
    },
    {
        "id": "1j2ync6",
        "author": "johdd435",
        "title": "Not showing shows on one profile",
        "content": "My family has 3 profiles and i was trying to watch raw but on my profile it wasn’t showing up neither was the walking dead which i was watching earlier. I checked the other profiles and they showed both shows. Is there any way to fix this.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j2ync6/not_showing_shows_on_one_profile/"
    },
    {
        "id": "1j2sv9c",
        "author": "rachiepants2017",
        "title": "Did anyone else love Elite? Danna Paola's latest interview makes me want to rewatch!",
        "content": "",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1j2sv9c/did_anyone_else_love_elite_danna_paolas_latest/"
    },
    {
        "id": "1j29utw",
        "author": "hiatitae",
        "title": "I want to watch the credits, why am I now not allowed to?",
        "content": "",
        "upvotes": 38,
        "comments": 16,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/p8s0k1tyceme1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1j29utw/i_want_to_watch_the_credits_why_am_i_now_not/"
    },
    {
        "id": "1j2qoor",
        "author": "Midgar918",
        "title": "Static on Brooklyn 99",
        "content": "Watching this show and only this show I'm getting fuzzy static like I'm watching it on a vcr tape from 1995.\n\nRunning Netflix on an Xbox X. Wondering of its like this for anyone else and if it is the source material. Like I said its only this show. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2qoor/static_on_brooklyn_99/"
    },
    {
        "id": "1j2uu1t",
        "author": "AW5542",
        "title": "Can’t wait movies because I have the ad version?",
        "content": "I’m trying to watch some movies but a lot of the movies I’m trying to watch, like Black Hawk Down, aren’t supported on the ad version of Netflix. Had no idea this plan had less movies. When did this start?",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1j2uu1t/cant_wait_movies_because_i_have_the_ad_version/"
    },
    {
        "id": "1j3483q",
        "author": "vampiricwitch_",
        "title": "Is the script to La Dolce Villa AI generated?",
        "content": "Silly argument, and its not that serious but... is it? I'm no cinephile, I probably couldn't name a single director (well known or otherwise) but what the hell the script is bad. Not just bad, because a bad script isn't uncommon in random movies. \n\nIt literally sounds like chat-gpt, AI generated nonsense/garbage. It's cheesy, full of generic-sounding fluff/filler dialogue to get that pesky exposition out of the way, full of what stinks like recycled \"witty\" dialogue, almost like a disney channel kid's TV sitcom, except its a fully serious movie. I'm genuinely curious. \n\nDid anyone else watch it? I've long since clicked off, but let me know if this is the vibe you got. It says it came out 2025, so at this point I am fully willing to believe they sent an idea into Chatgpt and gave the actors the cheesiest, most generic-sounding lines ever known. It literally sounds like generic garbage. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j3483q/is_the_script_to_la_dolce_villa_ai_generated/"
    },
    {
        "id": "1j2jy6h",
        "author": "S4v1r1enCh0r4k",
        "title": "'The Electric State: Kid Cosmo' Prequel Game To Follow Film's Release On Netflix",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2jy6h/the_electric_state_kid_cosmo_prequel_game_to/"
    },
    {
        "id": "1j27a3d",
        "author": "SnooTomatoes7723",
        "title": "Is it worth to watch 1899 even tho it got cancelled? | Or similar shows like From and Lost?",
        "content": "Hey, I finished the show \"From\" which is a horror mystery, and I heard that 1899 should have a similar vibe. But people said it is not worth starting the show because it ends on a cliffhänger and the second season got cancelled, so I would be just mad after watching it. Do you think it is still worth it, and more importantly, do you have recommendations for shows like From or Lost?",
        "upvotes": 29,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1j27a3d/is_it_worth_to_watch_1899_even_tho_it_got/"
    },
    {
        "id": "1j2rg20",
        "author": "V_DataNerd",
        "title": "Is Kaiju no. 8 available in Netflix us?",
        "content": "I am traveling and I noticed that I can stream the show on Netflix. I will be back home soon and I want to continue watching it. So I want to know I can continue watching it on Netflix.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j2rg20/is_kaiju_no_8_available_in_netflix_us/"
    },
    {
        "id": "1j2r1on",
        "author": "chocpretzel",
        "title": "Question about Cassandra (German series)",
        "content": "Hi everyone,\n\nso I just finished the new series and I was wondering, after the car accident, Cassandra seems to shut down completely, hence the daughter is forgotten in the house, no?   \nBut how did the robot get back into the house, when the new family is moving in? Who moved her and how did that person know where to move her? ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1j2r1on/question_about_cassandra_german_series/"
    },
    {
        "id": "1j2vt15",
        "author": "Ozymandias_UA",
        "title": "I need help",
        "content": "I know this seems sus, but is there any way I can use an account to get BTD6? I won’t use the account in anyway other than to sign up. Any help would be greatly appreciated",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j2vt15/i_need_help/"
    },
    {
        "id": "1j2q87t",
        "author": "CheesyAsFrick",
        "title": "TV issues",
        "content": "Because of the smart TV we have not having the netflix app on it, i've been trying to figure out how to use browser netflix without it directing me to the app download (which just uses the same account to download netflix on another device)\n\nTrying to use desktop mode just led to error E100 and nothing else I've tried so far seemed to work so I'm wondering what to do if it's even possible.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j2q87t/tv_issues/"
    },
    {
        "id": "1j2nl1j",
        "author": "Atlast_2091",
        "title": "Asterix &amp; Obelix: The Big Fight | Official Trailer | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2nl1j/asterix_obelix_the_big_fight_official_trailer/"
    },
    {
        "id": "1j2fnvy",
        "author": "Jemster768",
        "title": "Casting question",
        "content": "I have Netflix Standard and was recently at a friends house and was going to stream a movie onto my iPad and cast it to his Chromecast HD (or straight to his Panasonic TV). \n\nFirst off, Should this be possible?\n\nI could start the movie on the iPad and select cast and pick the Chromecast HD but all that happened was the TV switched to the chromecast and it started its copy of the Netflix app and asked me to sign in. Totally not what I was trying to do. \n\nSame thing happened picking the Panasonic TV as the target. Obviously I don’t want to sign in my account on someone elses device, and that’s not the way casting works for, say, Amazon Prime Video. \n\nSo is this not a thing? Is the casting only to an existing logged in Netflix account?\n\n(Edit: just adding I tried netflix support chat and they had me verifying the chromecast was on the same network, despite me telling them Amazon Prime streamed fine. Then trying to tell me how to log in. Seemed more like an AI chatbot so I gave up)",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j2fnvy/casting_question/"
    },
    {
        "id": "1j2kx0v",
        "author": "ScaleTimely4145",
        "title": "Ricken x Jake from ITOET",
        "content": "If anyone has watched the netflix movie “I’m thinking of ending things”, you might agree with me. Doesn’t Ricken remind you of Jake? I’m rewatching the film and his passive insistence and love of overusing and disrespecting the english language with garbage literature REALLY reminds me of Ricken  ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2kx0v/ricken_x_jake_from_itoet/"
    },
    {
        "id": "1j2998w",
        "author": "Inspired_Owl",
        "title": "The Girl in the Picture",
        "content": "It’s my theory that she fell pregnant when her father was prostituting her. I think Floyd might have fathered the first child, that was supposedly put up for adoption. But I think the other two were results of paid sex. I don’t believe Floyd would have given her enough freedom to do anything other than his exact bidding ",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j2998w/the_girl_in_the_picture/"
    },
    {
        "id": "1j2tjmk",
        "author": "chrisjohnmyers",
        "title": "Unsubscription from Netflix",
        "content": "Did you know that you can't remove your credit card from Netflix to ensure you won't get billed?\n\nThe website disallows removing your card unless you add another first!\n\nThe Netflix app on the TV nags to resubscribe at the touch of a button during the remainder of your subscription - it's too easy for anyone in the household to resubscribe again by mistake.\n\nThis is why I wanted to remove my card. It's a scandal that you can't!\n\nIt turns out there is a way:\n\nI have another bank account where my card is switched off for payments:\n\n I switched my card on. Transferred Netflix to this card. Removed my active credit card &amp; then switched off payments for my second card again.\n\nHa! Bugger off Netflix!\n\nEdit: I'm unsubscribing because they are increasing the charge by £2 a month. That's £24 a year extra, making a total of £156 a year... Wow!",
        "upvotes": 0,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1j2tjmk/unsubscription_from_netflix/"
    },
    {
        "id": "1j15v5s",
        "author": "ellissabain",
        "title": "Gabby Petito’s parents have revealed what happened to the van",
        "content": "",
        "upvotes": 1338,
        "comments": 79,
        "media": null,
        "permalink": "/r/netflix/comments/1j15v5s/gabby_petitos_parents_have_revealed_what_happened/"
    },
    {
        "id": "1j26df8",
        "author": "MOJOBWA",
        "title": "Lip sync issues",
        "content": "I know this isn’t new but numerous shows and movies have this lip sync issue, but why hasn’t Netflix fixed this issue? I’m thinking certain shows have been redubbed to English I’m guessing. ",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1j26df8/lip_sync_issues/"
    },
    {
        "id": "1j1ykpe",
        "author": "Lola_ry08",
        "title": "Good comedies/sitcoms",
        "content": "I love sitcoms so I’m looking for more similar shows! \nSome I’ve watched so far: \nFriday night dinner \nKim’s convenience \nThe office \nSuperstore \n\nAny similar shows would be great! ",
        "upvotes": 10,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1j1ykpe/good_comediessitcoms/"
    }
]