[
    {
        "id": "1kspfrg",
        "author": "AlanAndMattAMA",
        "title": "Hey /r/movies! We're Alan Tudyk &amp; Matt Winn, actor &amp; director of THE TROUBLE WITH JESSICA, a dark comedy also starring Rufus Sewell &amp; Shirley Henderson about a group of longtime friends at a dinner party that goes horribly wrong, recently in theaters and now available on digital. Ask us anything!",
        "content": "You might also know Alan for films and series such as Firefly, Tucker &amp; Dale vs Evil, Serenity, Andor, A Knight's Tale, Resident Alien, Rogue One: A Star Wars Story, Moana, Frozen II, I Robot, Maze Runner, Transformers, Deadpool 2, The Electric State, Harley Quinn, Dodgeball, Raya and the Last Dragon, Ice Age, Arrested Development, 3:10 To Yuma, and much more.\n\nABOUT THE FILM: Married couple Sarah (Shirley Henderson) and Tom (Alan Tudyk) are in terrible financial trouble. On the brink of losing everything, they’ve managed to find a buyer for their stylish London home. When their best friends Richard (Rufus Sewell) and Beth (Olivia Williams) come over for a final dinner, an uninvited old friend, Jessica (Indira Varma), tags along.\n\nAfter a seemingly trivial argument at dinner, Jessica disappears. She has the temerity to hang herself in the garden, totally oblivious to the adverse consequences for Sarah and Tom’s real estate sale. The only solution: Sarah and Tom must convince Richard and Beth to help take care of this little inconvenience. If they’re clever enough about it, what could possibly go wrong? Knives are out and best-kept secrets are revealed in this laugh-out-loud dark comedy featuring a starry ensemble cast of phenomenal UK talent.\n\nTRAILER: [https://www.youtube.com/watch?v=l\\_xhtk8Tj18](https://www.youtube.com/watch?v=l_xhtk8Tj18) \n\nLearn More and Rent/Buy THE TROUBLE WITH JESSICA: https://www.musicboxfilms.com/film/the-trouble-with-jessica.\n\nAsk us anything! Back at 3 PM ET today for answers.\n\n\n\n",
        "upvotes": 644,
        "comments": 415,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ohy0hof2tb2f1.png?auto=webp&amp;s=7039a148f333722fa2414b6009872629b373b2c9"
        },
        "permalink": "/r/movies/comments/1kspfrg/hey_rmovies_were_alan_tudyk_matt_winn_actor/"
    },
    {
        "id": "1kt8f5n",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Mission: Impossible - The Final Reckoning / Lilo &amp; Stitch / Friendship) plus Throwback Discussions!",
        "content": "# New Theatrical Releases\n\n[Mission: Impossible - The Final Reckoning](https://old.reddit.com/r/movies/comments/1kt8b6m/official_discussion_mission_impossible_the_final/?)\n\n[Lilo &amp; Stitch](https://old.reddit.com/r/movies/comments/1kt8b83/official_discussion_lilo_stitch_spoilers/?)\n\n[Friendship](https://old.reddit.com/r/movies/comments/1kt8b9q/official_discussion_friendship_spoilers/?)\n\n# 25th Anniversary Throwback Discussion Threads\n\n[Dinosaur](https://old.reddit.com/r/movies/comments/1kt8baq/official_throwback_discussion_dinosaur_spoilers/?)\n\n[Road Trip](https://old.reddit.com/r/movies/comments/1kt8bc6/official_throwback_discussion_road_trip_spoilers/?)\n\n\n# Still in Theaters\n\n[Final Destination: Bloodlines](https://old.reddit.com/r/movies/comments/1knpnb1/official_discussion_final_destination_bloodlines/?)\n\n[Hurry Up Tomorrow](https://old.reddit.com/r/movies/comments/1knpnfr/official_discussion_hurry_up_tomorrow_spoilers/?)\n\n[Thunderbolts*](https://old.reddit.com/r/movies/comments/1kcpug8/official_discussion_thunderbolts_spoilers/?)\n\n[Sinners](https://www.reddit.com/r/movies/comments/1k1tsoo/official_discussion_sinners_spoilers/?)\n\n\n\n# On Streaming\n\n[Fountain of Youth](https://old.reddit.com/r/movies/comments/1ku0tg1/official_discussion_fountain_of_youth_spoilers/?)\n\n[Fear Street: Prom Queen](https://old.reddit.com/r/movies/comments/1ku0thn/official_discussion_fear_street_prom_queen/?)\n\n[Another Simple Favor](https://old.reddit.com/r/movies/comments/1kdg7p5/official_discussion_another_simple_favor_spoilers/?)\n\n[Havoc](https://old.reddit.com/r/movies/comments/1k7zfyi/official_discussion_havoc_spoilers/?)",
        "upvotes": 75,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1kt8f5n/official_discussion_megathread_mission_impossible/"
    },
    {
        "id": "1kvcddc",
        "author": "Honkydoinky",
        "title": "The princess bride just stole my heart",
        "content": "I watched the princess bride for the first time today, and everything about that movie is perfect in my eyes. At no point of the movie was I bored for a moment, I went in thinking I’d watch half and finish it later. Boy was I wrong. Every character felt charming and fleshed out enough for their role in the story. I really was rooting for Inigo, hoping Westley and buttercup would find a way to end up together. There were funny enough gags to get a chuckle out of me like the mawwage part towards the end. I just wanted to get a short rant off about how much I love this movie",
        "upvotes": 3236,
        "comments": 372,
        "media": null,
        "permalink": "/r/movies/comments/1kvcddc/the_princess_bride_just_stole_my_heart/"
    },
    {
        "id": "1kv1jou",
        "author": "Amaruq93",
        "title": "\"Braveheart\" at 30: Mel Gibson’s gory, hokey 1995 Oscar winner plays like a biblical epic",
        "content": "",
        "upvotes": 4667,
        "comments": 1022,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/44nV70BuAJpxiEJHbSuNSBw5gLjWPG5MKNDBhvXBJSg.jpg?auto=webp&amp;s=77743073bedaaf1e1328ae7a3081f9e99ab16413"
        },
        "permalink": "/r/movies/comments/1kv1jou/braveheart_at_30_mel_gibsons_gory_hokey_1995/"
    },
    {
        "id": "1kvf79v",
        "author": "Dramatic-Airline-415",
        "title": "Missing scene in The Apprentice 2024 was it cut for streaming",
        "content": "I saw The Apprentice in the cinema and remember a scene where Trump, after the scalp reduction procedure, shouts at Ivana saying “Your f***ing doctor has ruined me.”\n\nI just rewatched the movie on a streaming platform and that scene is gone. I checked IMDb and Wikipedia and found no mention of different versions or edits.\n\nIs it possible this scene was removed between the theatrical release and the streaming version? Or am I misremembering? If it was cut, does anyone know the reason?",
        "upvotes": 605,
        "comments": 54,
        "media": null,
        "permalink": "/r/movies/comments/1kvf79v/missing_scene_in_the_apprentice_2024_was_it_cut/"
    },
    {
        "id": "1kvfwij",
        "author": "LiquidDreamtime",
        "title": "School of Rock - Only Jack Black could do that",
        "content": "I watched School of Rock (2003) this morning with my kids and it’s a wonderfully cute film that is paced well and really does a great job of setting up and playing out the whole story.\n\nI think the adults were not cast/acted particularly well, his buddy Ned (Mike White) isn’t a very convincing anything and Patty (Sarah Silverman) as the grating-annoying GF was flat. I even found Principal Mullins (Joan Cusack) to be over the top in all ways. And despite this, Dewey Finn (Jack Black) absolutely steals the show and magically brings along a bunch of kids to fit in perfectly.\n\nWhile watching it, I couldn’t help but think ANY other actor on earth as Dewey Finn and this movie is very quickly just horrible. Who else can do what he does? Or has their own version that fits here?\n\nWhat are some other movies that would seemingly be awful with a different actor/actress, but are actually really great because a special talent pulled it off?",
        "upvotes": 193,
        "comments": 62,
        "media": null,
        "permalink": "/r/movies/comments/1kvfwij/school_of_rock_only_jack_black_could_do_that/"
    },
    {
        "id": "1kvgu3r",
        "author": "indiewire",
        "title": "Scarlett Johansson Says She Has Always Wanted to Direct, but Acting Took Precedence",
        "content": "",
        "upvotes": 168,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/C7tsG-ngybjw6IKfH3PuJWZyvjfrLLTWZd-WKtV8oE4.jpg?auto=webp&amp;s=a9c7626cf85c64658af03c5fc1409e97814485d3"
        },
        "permalink": "/r/movies/comments/1kvgu3r/scarlett_johansson_says_she_has_always_wanted_to/"
    },
    {
        "id": "1kvg4qs",
        "author": "nickrashell",
        "title": "What movies were unexpectedly tear jerkers for you?",
        "content": "For me it was Warrior 2011. I remember going into the theater with a few of my friends excepting an action packed MMA movie. By the end we were all in tears. \n\nI still don’t think I have seen a movie that has evoked a more emotional response. There are at least two scenes that no matter how many times I have seen the film cause tears to fall down my face.\n\nThe movie itself is unique in that there are no true antagonists, except for the past and the pride and bitterness that keeps us from forgiveness. There are two heroes you are equally invested in. \n\nIf you have held out on seeing it because you aren’t into MMA, don’t short change yourself, I am not into MMA either. And if you’ve never heard of it I urge you to seek it out.\n\nBut, what are some movies you didn’t expect to move you emotionally but did?",
        "upvotes": 168,
        "comments": 417,
        "media": null,
        "permalink": "/r/movies/comments/1kvg4qs/what_movies_were_unexpectedly_tear_jerkers_for_you/"
    },
    {
        "id": "1kv4um1",
        "author": "Unused_Content19",
        "title": "What is the most disturbing movie ending you ever saw?",
        "content": "Smile. As much as I hate this movie, seeing that monster come out of the skin and enter Rose’s body, and Joel entering only for the curse to pass onto him as he watches Rose burn herself is quite disturbing for me.                                                                    \n                              \nAnd, I just wanna say, Rose’s burning body being seen in Joel’s eyes is something this movie actually does good.",
        "upvotes": 602,
        "comments": 815,
        "media": null,
        "permalink": "/r/movies/comments/1kv4um1/what_is_the_most_disturbing_movie_ending_you_ever/"
    },
    {
        "id": "1kv970y",
        "author": "crumble-bee",
        "title": "Whenever I say the word \"accoutrement\" I can't help but think of the 40 year old virgin - do you have anything similar?",
        "content": "\"I spent like three hours... like three and a half hours making like, the eggs and the paprika, and the onions and all the other ***accoutrement*** - and then by the time I was done I really didn't feel like eating it. \n\nAnd I didn't have any bread.\"\n\nI think that's just such a funny joke in an excellent movie, but accoutrement is burned into my brain and will forever be associated with this movie. \n\nDo you have one single word that takes you immediately back to the movie you first saw it in? ",
        "upvotes": 263,
        "comments": 259,
        "media": null,
        "permalink": "/r/movies/comments/1kv970y/whenever_i_say_the_word_accoutrement_i_cant_help/"
    },
    {
        "id": "1kvgtnh",
        "author": "Bennett1984",
        "title": "Empire Records, The Doom Generation, Pump Up the Volume and more great forgotten 90s teen movies",
        "content": "",
        "upvotes": 83,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/k1negrQEUY2-EP9KcBc-aAyPiEMJr1UQRnELL2MddgM.jpg?auto=webp&amp;s=7ef77b9582d128d344c201bf6a1e49b7106e45ae"
        },
        "permalink": "/r/movies/comments/1kvgtnh/empire_records_the_doom_generation_pump_up_the/"
    },
    {
        "id": "1kutr6k",
        "author": "blac_sheep90",
        "title": "Justin Long's physical performance in Dodgeball is fantastic.",
        "content": "Rewatched dodgeball for the millionth time this evening and every time Justin is on screen he's doing something with his body that makes me laugh. Be it getting tangled up in exercise equipment, crushed by a large woman, catching and dropping then exploding a beer all over himself, taking wrench to the face, or taking a hard hit from a dodgeball from the White Goodman. He's one of the best aspects of the movie.\n\nDodgeball remains an extremely funny movie.",
        "upvotes": 2241,
        "comments": 175,
        "media": null,
        "permalink": "/r/movies/comments/1kutr6k/justin_longs_physical_performance_in_dodgeball_is/"
    },
    {
        "id": "1kul1g6",
        "author": "LookAtThatBacon",
        "title": "For the movie adaptation of The Martian, Ridley Scott changed the day the crew left Mars from sol six to sol 18 because he wanted to justify the higher amount of human waste used to make fertilizer. What are other instances of a movie adaptation making changes for interesting reasons?",
        "content": "Source for the fact about The Martian: https://www.thedailybeast.com/the-man-behind-the-martian/\n\n&gt; But the movie changed how long the crew spent on the planet for a funny reason. In the book they left after sol six, but in the movie they leave after sol 18. Ridley wanted Mark to stir a nice big bucket of shit when he was creating the fertilizer for the crops. Ridley said, after only six days of six people shitting that’s 36 packets. He wanted them to stay longer, so that the bucket of shit could be full.",
        "upvotes": 11070,
        "comments": 1573,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5BSO5UiPNnyQaThrBsXIGITSv-lq-stoG6S3M-z3qhs.jpg?auto=webp&amp;s=f9bedfeef1801f2abac4b8e982f04f37b475cd4e"
        },
        "permalink": "/r/movies/comments/1kul1g6/for_the_movie_adaptation_of_the_martian_ridley/"
    },
    {
        "id": "1kuvdoh",
        "author": "JenL0159",
        "title": "Annihlation",
        "content": "Why aren’t more people obsessed with this movie?! All female cast. Sci-Fi/Horror/drama. Natalie Portman. Aliens. With a few twists. This movie has everything and it’s incredibly interesting and terrifying!!! And kinda deep haha! I’ve heard it’s starting to be considered a cult-classic, but I’m surprised it’s didn’t win some kind of award. It has a slightly independent-feel. They’re is a lot going on here and it’s well done. Great acting. Not cliche. Suspenseful. Creative. Scary. I am rarely impressed by anything Sci-fi ish but this movie is amazing. It’s one of very few that keep me from multi tasking or playing on my phone at the same time. Iykyk. And I will never recover from the bear…\n\nThis movie is not for kids imo. it’s a little intense.",
        "upvotes": 1202,
        "comments": 357,
        "media": null,
        "permalink": "/r/movies/comments/1kuvdoh/annihlation/"
    },
    {
        "id": "1kuy64g",
        "author": "NotSoEnlightenedOne",
        "title": "Ocean’s 11 is closer to the MIssion Impossible TV show than the films ever were.",
        "content": "I remember watching the original mission impossible when it came out and thought it was good but it was missing the team element and more about Tom Cruise. 8 films on and that has never changed.\n\nThe team dynamic in Ocean’s 11 was fun and sparked the thought the spirit of the MI TV show is much better depicted in that than Tom Cruise’s output.\n\nAnyone else think they should emphasise the team dynamic and the long con/heist going forward once Cruise leaves the building?",
        "upvotes": 622,
        "comments": 122,
        "media": null,
        "permalink": "/r/movies/comments/1kuy64g/oceans_11_is_closer_to_the_mission_impossible_tv/"
    },
    {
        "id": "1kvebo8",
        "author": "paulfromatlanta",
        "title": "Iran summons French envoy in diplomatic row over 'insulting' Cannes remarks",
        "content": "",
        "upvotes": 53,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lUbqQvR716eIIHQ6AyQfv7kb6MkjfiZzyhVAEf7rTcY.jpg?auto=webp&amp;s=388496c05bd7dd0aeeb206af78ddfb4a03726847"
        },
        "permalink": "/r/movies/comments/1kvebo8/iran_summons_french_envoy_in_diplomatic_row_over/"
    },
    {
        "id": "1kv3blw",
        "author": "ubcstaffer123",
        "title": "Mara Corday Dies: ‘Tarantula’ Cult Film Star &amp;amp; ‘Playboy’ Playmate Was 95",
        "content": "",
        "upvotes": 236,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jiow24u_BtUt5cgWfLvjWZF8kNTAQHEJC9TXxmr-MAc.jpg?auto=webp&amp;s=ecde91f773ff03671c59e2a93ea5371a04432086"
        },
        "permalink": "/r/movies/comments/1kv3blw/mara_corday_dies_tarantula_cult_film_star_amp/"
    },
    {
        "id": "1kv51j3",
        "author": "KnightofGarm",
        "title": "Movies you heard bad things about, but ended up liking after seeing it",
        "content": "I watched the first Kingsman movie a few years ago and thought it was a lot of fun. I didn't even know there was a second one until I read some people saying that it was bad, that it disrespected the characters from the first movie, and some going as far as to say that you should only watch the first movie and pretend the sequel doesn't exist.\n\nYesterday I finally got around to watching it, and... just like the first one it was a lot of fun... not as good, but I didn't even think it was mediocre let alone anywhere near as bad as people made it out to be.\n\nThere are a lot of other movies I can think of that fit this criteria (such as The Lost World: Jurassic Park), but most of them I already saw before hearing the bad word of mouth, so I was curious what your experiences are of hearing a movie is bad/mediocre only to end up enjoying it are.",
        "upvotes": 122,
        "comments": 231,
        "media": null,
        "permalink": "/r/movies/comments/1kv51j3/movies_you_heard_bad_things_about_but_ended_up/"
    },
    {
        "id": "1kv9334",
        "author": "BunyipPouch",
        "title": "Miles Teller To Play A Nashville Country Music Star in Fantastical-Comedy ‘Possum Song’ For ‘Sing Sing’ Writer-Director Greg Kwedar",
        "content": "",
        "upvotes": 73,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/H_OeltFM5Pq7w3jPyDxhBMfv1qCqMzglIb5YQmvcWcA.jpg?auto=webp&amp;s=3f9bc624d7f1b534ee759e280a1b772a04e93d5e"
        },
        "permalink": "/r/movies/comments/1kv9334/miles_teller_to_play_a_nashville_country_music/"
    },
    {
        "id": "1kvg55b",
        "author": "LemmyLola",
        "title": "Asteroid City... What an absolute joy",
        "content": "I found it by accident while looking through filmographies and there it was..We watched the trailer and knew it was a must see. So, we're watching it tonight and its so utterly brilliant in its writing, cinematography and casting, I am in love with this film. \nIf you enjoy Coen brothers movies like Intolerable Cruelty and the Hudsucker Proxy, you would likely enjoy this also. Its a Wes Anderson, Roman Copolla film.\nThe cast is stellar and its one of those 'everyone is in it' movies which is why I'm even more bewildered by only finding it now.\nAnyways... All that to say.... Highly recommend:) ",
        "upvotes": 26,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1kvg55b/asteroid_city_what_an_absolute_joy/"
    },
    {
        "id": "1kve1w8",
        "author": "One_Impression_363",
        "title": "King Petar the First - Best WW1 Movie I have seen so far",
        "content": "Also know as “Blood of the Brave”\n\nIf you want to see the reality of the struggles for a brave nation in the Balkans with the highest percentage of population lost in the Great War for freedom - then look no further.\n\nThe film is a masterpiece. Great acting, beautiful shots from the nature and mountains and a one of a kind story about true leadership and hardships people face even beyond the battle field during war. Shows a king who truly serves the people and was loved for it.\n\nYou can find it on Amazon Prime, Tubi with subtitles or the dubbed version is on YouTube.\n\nTrailer: https://youtu.be/PPrSU9dIBrs?si=6XJYGePnFcCKMRdf",
        "upvotes": 26,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p2n6R3UkUOYahcAV836QPg3QIfMlvd7G7zl5pYZMZq0.jpg?auto=webp&amp;s=c34dae5f6670916f7b566517b80505777c4e1a78"
        },
        "permalink": "/r/movies/comments/1kve1w8/king_petar_the_first_best_ww1_movie_i_have_seen/"
    },
    {
        "id": "1kvi4my",
        "author": "trep88",
        "title": "Best examples of a teacher/mentor showing a student that’s the impossible is possible.",
        "content": "In Top Gun: Maverick, Tom Cruise’s character, “Maverick”, completes the mission simulation by flying the course 15 seconds faster than the previously set “impossible” time goal.\n\nAnother example, Yoda lifting the X-wing out of the swamp after Luke failed to do so in Empire. \n\nWhat are your favorite examples of a mentor inspiring a mentee by doing “the impossible”?  ",
        "upvotes": 14,
        "comments": 32,
        "media": null,
        "permalink": "/r/movies/comments/1kvi4my/best_examples_of_a_teachermentor_showing_a/"
    },
    {
        "id": "1kulg3h",
        "author": "MarvelsGrantMan136",
        "title": "Live-Action ‘Voltron’ Movie, Starring Henry Cavill, Wraps Filming",
        "content": "",
        "upvotes": 2467,
        "comments": 258,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vkZTue_9b9yz6ESFeRezXQkODiaHVXkIhPBihMO_J28.jpg?auto=webp&amp;s=f0811b648b7f7f4f4a4dbfdf52e8bd166db68b10"
        },
        "permalink": "/r/movies/comments/1kulg3h/liveaction_voltron_movie_starring_henry_cavill/"
    },
    {
        "id": "1kuptde",
        "author": "Coderkid01",
        "title": "One of the coolest shots in any animated movie ever, from The Thief and The Cobbler Recobbled Cut",
        "content": "",
        "upvotes": 1208,
        "comments": 75,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0s9wx2gknt2f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1kuptde/one_of_the_coolest_shots_in_any_animated_movie/"
    },
    {
        "id": "1kvahdi",
        "author": "Bobbogee",
        "title": "Was there someone in your early life that influenced your love of cinema?",
        "content": "When I was a preteen, around the early 60s,  my parents lived in the west San Fernando valley, and my grandparents lived in Hollywood (they bought a house there in 1924). Since my parents had a lot of kids, they took every chance they could to send us to Grandmas for a few days visit whenever possible. She was my guide to the  wonders of cinema.\n\nWith her, I would often be taken to the Hollywood CineramaDome and saw a number of films that deeply imprinted on me, a thirteen year old: Thunderball, How the West Was Won, Grand Prix and others. I am very sure that Grandma enjoyed them just as much, in their 70mm CinemaScope goodness and awesome sound for the time.\n\nWho was this person for you?",
        "upvotes": 23,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1kvahdi/was_there_someone_in_your_early_life_that/"
    },
    {
        "id": "1kunzia",
        "author": "peachpitt",
        "title": "Break-up movies that DON'T end with a new partner?",
        "content": "Going through a difficult breakup and all the top recommended breakup movies I've seen so far (500 Days of Summer, Forgetting Sarah Marshall) end with what I feel to be a cheesy cop-out: oh here's a new partner to solve all the main character's problems. 500 Days of Summer was especially painful with the very last scene: \"Hi, I'm Autumn.\" What about being with yourself, exploring, and improving, not relying on a partner to make you whole? Doesn't even have to necessarily be a break-up movie as long as it covers these themes of self-exploration and improvement. Thanks.",
        "upvotes": 1019,
        "comments": 629,
        "media": null,
        "permalink": "/r/movies/comments/1kunzia/breakup_movies_that_dont_end_with_a_new_partner/"
    },
    {
        "id": "1kvcn4h",
        "author": "Skull_Boy_ds",
        "title": "Does any movie make you feel a certain way? A way where no other piece of media can replicate?",
        "content": "It can be anything, happiness, sadness, dread, loneliness, love, hate, any type of unique and distinct emotion that the movie can give you in a special way.\n\nMine is Fantastic Mr. Fox. I don't know how to explain it, but the movie feels familiar and cozy to me in a weird way, it is like a warm blanket. The movie is the only one that I personally consider perfect and a 10/10. \n\nEverything from the dialog, comedy, soundtrack, animation, voice acting, everything makes me feel so good. The color palette in specifc makes me feel... Happy? Cozy? It reminds me of home, even though my home never had that color palette. It reminds me of autumn, the unquestionable best season of the year.\n\nI have watched Fantastic Mr. Fox about 30 times now, and I think I will watch it again today. It's so weird how good it makes me feel, sometimes I catch myself crying a bit at random scenes that aren't even relevant, mostly establishing shots for some reason. \n\nIt is truly fantastic.",
        "upvotes": 18,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1kvcn4h/does_any_movie_make_you_feel_a_certain_way_a_way/"
    },
    {
        "id": "1kuer6l",
        "author": "NoCulture3505",
        "title": "Les Dilley Dies: 'Star Wars' Art Director Was 84",
        "content": "",
        "upvotes": 2471,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CQc-mk5k1on-Z_ZVy8apaIkGstd3v1tjoZPK0Gtw2tA.jpg?auto=webp&amp;s=aad5b081f5dbd18a5534663d7c4bdbc170bf12e0"
        },
        "permalink": "/r/movies/comments/1kuer6l/les_dilley_dies_star_wars_art_director_was_84/"
    },
    {
        "id": "1kvg9p5",
        "author": "ashe143",
        "title": "Taste the movie food ideas needed for The Pagemaster.",
        "content": "Hey all!\n\nEvery summer for the last five years, I’ve held a “Taste the Movie” series for my family and I.  We choose five movies that usually have a theme, this year’s theme being “epic fantasy adventures”.  My kids are 10 and 5.\n\nWe are kicking the summer off with “The Pagemaster” and I cannot for the life of me come up with food ideas.  The drink will be Dr Jekylls spicy little mocktail so I have that covered.  I usually do an app, main and treat with a fun drink (and popcorn/candy).  If yall have any suggestions to fill in my numerous blanks, I would be so very appreciative!\n\nOur remaining four movies are “The NeverEnding Story”, “Homeward Bound: An Incredible Journey”, “Disneys Robin Hood” and “The NeverEnding Story II”, just in case curiosity had you in its grasp.  I’d totally take suggestions for these as well!",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1kvg9p5/taste_the_movie_food_ideas_needed_for_the/"
    },
    {
        "id": "1ku9wyu",
        "author": "Ashamed_Feedback3843",
        "title": "Sparrows 1926 Mary Pickford",
        "content": "",
        "upvotes": 4008,
        "comments": 265,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xvpa04fnyp2f1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1ku9wyu/sparrows_1926_mary_pickford/"
    },
    {
        "id": "1kvakfz",
        "author": "Davis_Crawfish",
        "title": "Julianne Moore is a widely revered actress but I always had a soft spot for her Madonna-inspired, nasty and self-absorbed rocker diva part in \"What Maisie Knew\" (2012)",
        "content": "I had the time of my life watching her play the mother of a ten year old girl who struggles to maintain her pop/diva career while raising her own daughter, played by Onata Aprile. \n\nUnfortunately for the daughter, Moore's character is a shrieking harpie prone to temper tantrums and infantile jealousy, who does everything on a whim, including marry a younger man, played by Alexander Skarsgaard, who ends up being a father figure for the daughter while Moore either performs with a guitar or is screaming about how much she hates her ex husband, played by Steve Coogan. \n\nAgain, movie is a trip just to see Moore chew the scenery. But outside of the campfest, Aprile is a natural onscreen. Maisie is a shy but lovely child who yearns for a stable family and finds that in her mother's boy toy and her dad's girlfriend.",
        "upvotes": 12,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1kvakfz/julianne_moore_is_a_widely_revered_actress_but_i/"
    },
    {
        "id": "1kur4tx",
        "author": "delimeat7325",
        "title": "What’s a movie you didn’t see in theatres but wish you had?",
        "content": "One of them for me is Hereditary. It’s one of my favorite films and I wish I could have saw it on the big screen. It was thrilling watching it in my own home, I can only imagine what it was like watching it on large screen with amplified surround sound. The wails of Toni Collette were agonizing and ear piercing, the music and sounds were unsettling and dissonant. Even in the moments of sudden, compete silence were weary for me. It’s just a perfect display of grief and madness if that makes any sense.",
        "upvotes": 250,
        "comments": 629,
        "media": null,
        "permalink": "/r/movies/comments/1kur4tx/whats_a_movie_you_didnt_see_in_theatres_but_wish/"
    }
]