[
    {
        "id": "1gwj4n3",
        "author": "ThePianoLessonAMA",
        "title": "Hi, /r/movies! I am Malcolm Washington, director and co-writer of 'THE PIANO LESSON', starring Samuel L. Jackson, John David Washington &amp; Danielle Deadwyler. It will be released on Netflix tomorrow— Ask me anything!",
        "content": "",
        "upvotes": 204,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ggeqp7uu5a2e1.jpeg?auto=webp&amp;s=9268aa985f3b12b6467a944b05f5a56dd9daca98"
        },
        "permalink": "/r/movies/comments/1gwj4n3/hi_rmovies_i_am_malcolm_washington_director_and/"
    },
    {
        "id": "1h0uf7h",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Gladiator II / Wicked: Part I / Moana 2)",
        "content": "[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/?)\n\n[Wicked: Part I](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/?)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/?)",
        "upvotes": 81,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1h0uf7h/official_discussion_megathread_gladiator_ii/"
    },
    {
        "id": "1h4xny7",
        "author": "TerryBouchon",
        "title": "'Moana' is the most streamed movie of the last 5 years with more than 44 billion minutes of stream time",
        "content": "",
        "upvotes": 872,
        "comments": 109,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/G9Njdcv5VkzPzA01Q9T5Igz3QOBky7KGrckZA8u5yDo.jpg?auto=webp&amp;s=f7a83651e8f32f25d68c17aac558dae4adbde156"
        },
        "permalink": "/r/movies/comments/1h4xny7/moana_is_the_most_streamed_movie_of_the_last_5/"
    },
    {
        "id": "1h4lazw",
        "author": "Naweezy",
        "title": "Margot Robbie Reveals ‘Wolf of Wall Street’ Full-Frontal Nude Scene Was Her Idea",
        "content": "",
        "upvotes": 10160,
        "comments": 756,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/R2X-MiMBSvGQC6r8tC62MVuOeVR9V8NFRZBTF3yunqk.jpg?auto=webp&amp;s=7ab1c22b90e30d381764e29886feba90660ed71c"
        },
        "permalink": "/r/movies/comments/1h4lazw/margot_robbie_reveals_wolf_of_wall_street/"
    },
    {
        "id": "1h4j4dk",
        "author": "MarvelsGrantMan136",
        "title": "Will Ferrell Reflects On ‘Elf’ Legacy",
        "content": "",
        "upvotes": 1631,
        "comments": 284,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Kse8Pp2VRBJdX-g_LvzGAsvEWxghGq3x8tLJB3PwjPI.jpg?auto=webp&amp;s=e53c741ea155dc6610c4c031c5ca08604c0f500c"
        },
        "permalink": "/r/movies/comments/1h4j4dk/will_ferrell_reflects_on_elf_legacy/"
    },
    {
        "id": "1h4licu",
        "author": "omgyoucunt",
        "title": "Nutcrackers (2024) starring Ben Stiller ruined my day",
        "content": "https://www.imdb.com/title/tt30144381/?ref_=ext_shr_lnk  \n  \nNutcrackers is, without a doubt, the worst movie I’ve seen in years. From the psychotic children to the dull, meandering plot, to the blandest cinematography, this film does nothing but waste your time. I already can’t stand David Gordon Green for what he did to the Halloween franchise, and now I can add this to the list of things he’s ruined.\n  \nIt’s rare for me to finish a movie and genuinely wish it didn’t exist. This is one of those times. The movie’s not entertaining, it’s not dramatic, it’s just pointless. I honestly can’t believe this thing was greenlit.  \n  \nBen Stiller returns to the screen after seven years… and this is what he came back to? Either he owed someone a huge favor or needed money because this is a complete disaster. I watched it with friends and at one point, I thought it’s probably almost over. There was still an hour left. I honestly thought I might scream. But we were too deep in at that point, so we kept watching. Spoiler: none of us enjoyed it.\n  \nThis movie feels like you’re stuck in a never-ending loop, with the same boring shots, the same settings, and the same tired characters repeating over and over again for 1 hour and 45 minutes. I’ve never regretted spending time on a movie more. I’m actually angry it exists.\n  \nDo yourself a favor and don’t waste your time. You’ll probably tap out after 45 minutes anyway, so save yourself the trouble. Avoid it at all costs. ",
        "upvotes": 1025,
        "comments": 252,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sJ1UnpLpAR8MFKGzxkE5kwD0NYawQ29IdfZBRVRTWFE.jpg?auto=webp&amp;s=94f52cd589c0006230771a0b945de552e60eb9c4"
        },
        "permalink": "/r/movies/comments/1h4licu/nutcrackers_2024_starring_ben_stiller_ruined_my/"
    },
    {
        "id": "1h4w7lg",
        "author": "Bennett1984",
        "title": "From Roger Moore With Love (2024) | Official Trailer",
        "content": "",
        "upvotes": 131,
        "comments": 54,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kgsOVSGBIGYagr9voByayxhwf_j7VI3AvaAJko9tWak.jpg?auto=webp&amp;s=930e9292e2ebd1299a8eb7f8b8281013dc93bdce"
        },
        "permalink": "/r/movies/comments/1h4w7lg/from_roger_moore_with_love_2024_official_trailer/"
    },
    {
        "id": "1h4mh25",
        "author": "Phyliinx",
        "title": "In Bruges. Wow.",
        "content": "So I watched In Bruges and this is really a reddit movie, in a positive way, because it's one of these movies that you can find quoted around here, mainly in big threads, without loads of context, 'cause everyone and their mum but the reader knows where the damn quote originates from.\n\nThat being said: I absolutely loved it. It's a full circle feature film and made me realize how rare those are.\n\nWhy \"full circle\"? Because in my eyes, everything it does, it does right. \n\nThe setting itself is pretty rich, very interesting and fresh, not used many times before if I recall right.\n\nThe characters are, in my opinion, the closest someone has ever come to Quentin Tarantino.\n\nThe dialogue is vulgar and sometimes pretty deep at the same time. \n\nAnd all in all, the story, centering around three main characters in their small bubble, is a quick but sweet and simple but very interesting affair I loved seeing develop infront of me. There are not a lot of twists and turns, it does not need that, it just needs what it has to entertain all the way through.\n\nIt's darkly comedic and sometimes tragic and it manages both emotions with ease. \n\nAll in all: a fantastic piece of cinema and my personal introduction to the great mind of Martin McDonagh.",
        "upvotes": 524,
        "comments": 146,
        "media": null,
        "permalink": "/r/movies/comments/1h4mh25/in_bruges_wow/"
    },
    {
        "id": "1h4rynx",
        "author": "Peter_Omun",
        "title": "\"Pleasantville\" was unexpected. What started out as a seemingly conventional comedy became a social commentary about conventional vs modernism",
        "content": "Tobey Maguire's character yearning for the conventional world of the B&amp;W traditionl family values, he comes off as a Ben Shapiro-type without the bigotry, yet when he enters the world, he realizes his vision of the cookie cutter dimension isn't what he assumed to be. \n\nOddly enough, the bigger transformation happens with his vapid sister, played by Reese Witherspoon, who manages to have the biggest growth in the story as she realizes she has goals she wishes to accomplish and ends up embracing the B&amp;W universe she previously rejected. \n\nJoan Allen is fantastic, though. The scene of her character discovering what an orgasm is and how it ends up changing her skin color? Superb directing.",
        "upvotes": 171,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1h4rynx/pleasantville_was_unexpected_what_started_out_as/"
    },
    {
        "id": "1h4xlq1",
        "author": "johntentaquake",
        "title": "Christmas Vacation is 35! Where’s the Tylenol?",
        "content": "",
        "upvotes": 40,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0nbrQ0mmdRI8_75EGLp2lDg-z26zpBdBKJeWYFY58JI.jpg?auto=webp&amp;s=ed6c159875b99f89bad1a93dad79d2978589776c"
        },
        "permalink": "/r/movies/comments/1h4xlq1/christmas_vacation_is_35_wheres_the_tylenol/"
    },
    {
        "id": "1h4cvju",
        "author": "TheShadowOperator007",
        "title": "What is the strangest movie fan theory you have ever heard?",
        "content": "I would have to say that Ferris Bueller's Day Off is a prequel to Fight Club and that the Narrator is a grown up version of Cameron Fye. No it never made much sense to me because Ferris Bueller's Day Off and Fight Club are completely different stories. \n\nAnother fan theory that I have heard is James Bond is not the man's real name but a codename that gets passed down from one man to another. No, James Bond is the man's actual name and in fact, the events of OHMSS are referenced throughout the Moore, Dalton, and Brosnan Bond movies.",
        "upvotes": 1236,
        "comments": 1372,
        "media": null,
        "permalink": "/r/movies/comments/1h4cvju/what_is_the_strangest_movie_fan_theory_you_have/"
    },
    {
        "id": "1h4xxa3",
        "author": "TravellingBeard",
        "title": "Who is your favorite movie villain where the actor was a delight and lovely human being in real life?",
        "content": "My gold standard is Louise Fletcher as Nurse Ratched (and for the trekkies here, as Kai Winn in Deep Space Nine... another \"God I hate that character\" role). \n\nIn real life, I heard nothing but praise about how kind and pleasant and unbothered she was before she sadly passed away.\n\nAnother candidate is Alan Rickman who is my favorite Christmas villain (Die Hard and Love Actually) who was loved by nearly everyone who knew him.\n",
        "upvotes": 34,
        "comments": 78,
        "media": null,
        "permalink": "/r/movies/comments/1h4xxa3/who_is_your_favorite_movie_villain_where_the/"
    },
    {
        "id": "1h4g9pt",
        "author": "BunyipPouch",
        "title": "Director Megan Park Discusses Her Coming-of-Age Comedy Film 'My Old Ass' (Starring Maisy Stella and Aubrey Plaza), One of 2024's Most Pleasant Surprises",
        "content": "",
        "upvotes": 626,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3PJEUFFzTz4qyH-2mqVDloooY5LrJMeyzYR97OEKnfM.jpg?auto=webp&amp;s=8a0e252e4ee4be9eb452d57f1beaab02bbeeca41"
        },
        "permalink": "/r/movies/comments/1h4g9pt/director_megan_park_discusses_her_comingofage/"
    },
    {
        "id": "1h4jdii",
        "author": "BlackJacquesLeblanc",
        "title": "In \"The Ninth Gate\" when we meet Green Eyes for the 1st time, Polanski pans to show the space beneath her chair. Why?",
        "content": "It's when Corso goes to see Balkan but he's giving a lecture. Corso sits at the back of the hall and notices Green Eyes there as well. Then the camera pans down to show her outstretched legs and the floor under her chair. I've tried to make out a shape in her shadow but am unsuccessful. The space must mean or indicate something, why else would Polanski focus on it, but what?\n\n[update] It's to show her shoes. Also it provides some hints about the character. Thanks everyone.",
        "upvotes": 360,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1h4jdii/in_the_ninth_gate_when_we_meet_green_eyes_for_the/"
    },
    {
        "id": "1h4d9uf",
        "author": "Outside-Pear9429",
        "title": "Movies to NOT go into blind",
        "content": "Most of the time going into movies with no idea of the plot is fun, and there are a million posts here recommending the best to watch blind, but what are some you went into blind and regretted it? For me it's Martyrs. I had no idea what it was about, and I wish I had some warning (by the way, this movie is not included on enough lists of \"movies you'd never watch again\"). What are some you recommend not watching blind and why?\n\n",
        "upvotes": 631,
        "comments": 1009,
        "media": null,
        "permalink": "/r/movies/comments/1h4d9uf/movies_to_not_go_into_blind/"
    },
    {
        "id": "1h4w4bt",
        "author": "CosmosBazaar",
        "title": "Mohammad Rasoulof Talks Making ‘The Seed of the Sacred Fig’ in Secret",
        "content": "",
        "upvotes": 24,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kt2-SPdoYoeN4ubmUut3rvO5ZLwc3CyNvOUp0cABHYk.jpg?auto=webp&amp;s=0cab5c27e09e33fed3702323e68267864548a539"
        },
        "permalink": "/r/movies/comments/1h4w4bt/mohammad_rasoulof_talks_making_the_seed_of_the/"
    },
    {
        "id": "1h4lwrm",
        "author": "PresentRevenue1347",
        "title": "Contact is one of the best movies I've ever seen, but I absolutely hate some of the ending",
        "content": "Major spoilers for the ending of Contact throughout the post, beware. \n\nContact is an absolutely amazing film in almost every way. The ending is also amazing in a lot of ways. Ellie's character development, from a die-hard skeptic in religion to having had an almost religious experience herself, is extremely moving, and the entire scene where she is in the Machine is spectacular in every way. However. \\[the scene where she is being interrogated by Kitz\\](https://www.youtube.com/watch?v=8CiG9Wgvyj0) and what comes after is extremely out of character and full of plot holes. \n\nOne of the things that makes Ellie's character so compelling is that she is a badass who stands up for herself, and she needs to be. Misogyny isn't talked about as explicitly in the film, but it isn't hard to read between the lines and see the way Drumlin constantly interrupts her and takes credit for her findings (even claiming to be the leader of the project he tried to kill) as a representation of sexism in the science field. This has happened to many, many female scientists throughout history (and is stated explicitly in the book). In order to get by with the cards stacked against her, \\[Ellie learns to stand up for herself\\](https://www.youtube.com/watch?v=wnkEace3rb4) and is very contrary to the typical \"damsel in distress\" story. At the end, they completely betray that. Ellie lets Kitz, a minor antagonist throughout, yell at her and call her crazy. Then, just to twist the knife, Joss defends her where she didn't defend herself, and they ride off into the sunset.\n\nI have issues with the romantic arc between Joss and Ellie in general. Ellie is a genius who is passionate about astronomy; It's abundantly clear that she is very passionate about SETI. Being able to find and meet aliens is her life goal that she worked for all her life. Then Joss intentionally sabotages that goal by asking her an extremely loaded question that leads to her not getting chosen to meet the Vegans because he doesn't want her to die, and she's fine with that? Really? This man she slept with once and then saw again years later completely sabotages her life goal, and she doesn't even get mad? Personally, I don't care how madly in love I am, I would lose my shit if that happened. Most people would. Her reaction to that scene is incredibly out of character for her, but also out of character for pretty much anyone. \n\nBack to the ending: the plot holes. \n\n1. The chair was crushed during her trip, and Ellie only survived because she happened to have left the chair then (although I like to interpret it as her intuition saving her more than chance). If the pod fell through immediately as everyone else saw, either Ellie would have still been in the chair, safe and sound, or she would've been a pancake on the ceiling. It would've been impossible for her to have escaped the chair that quickly. This isn't mentioned at all, but would raise questions to anyone who saw the pod.\n\n2. As previously stated, Ellie isn't the type to let them walk over her like they do in the trial, and she's extremely smart. She absolutely would've asked to see the static that was recorded, and they wouldn't have been able to hide it without being *extremely* suspicious. They could have lied or edited it, and the ending with Ellie not being believed would've remained (and I do really like that part) without making her look spineless. \n\n3. They still have the Machine. They could've sent someone else, or hell, they could've sent a stopwatch if nothing else. Or a plant, or some poor canary. You get the idea. It really just isn't a \"we'll never know\" thing. IMO, if one wanted to preserve the movie's ending as much as possible while fixing the plot holes, the Machine should've been damaged in some way. I doubt the government could've justified building a third one.\n\nThose are my issues with the ending, but as I said, it is still an amazing movie. I just wish the ending had Ellie stay as the badass character she was. Having her lose her spine and become another damsel in distress just seems like a massive betrayal of her character.",
        "upvotes": 117,
        "comments": 77,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_Lsjq_c0oWwRCZE7Gz78UhwgCKpis2HG-She9vdst-8.jpg?auto=webp&amp;s=48a176440ad04313cef21da4fa0d6ce10847c142"
        },
        "permalink": "/r/movies/comments/1h4lwrm/contact_is_one_of_the_best_movies_ive_ever_seen/"
    },
    {
        "id": "1h4snrx",
        "author": "iakgk",
        "title": "What are the movies in your watchlist that you still haven’t watched?",
        "content": "We all have that never-ending watchlist filled with movies we keep adding but never actually watch. Whether it’s because of lack of time, the right mood, or just forgetting about them, some movies just sit there forever.\n\nWhat’s been sitting in your watchlist for ages, and why haven’t you watched it yet? Let’s share and maybe motivate each other to finally hit play!\n\n",
        "upvotes": 29,
        "comments": 122,
        "media": null,
        "permalink": "/r/movies/comments/1h4snrx/what_are_the_movies_in_your_watchlist_that_you/"
    },
    {
        "id": "1h45pqs",
        "author": "Scoreback",
        "title": "What are your favorite uncommon Christmas movies?",
        "content": "Everyone watches Home Alone 1-2, Die Hard, Love Actually, The Holiday, Gremlins, Elf, The Grinch, Nightmare before Christmas, Christmas Vacation...., but what are some movies you started watching as a new tradition? For me its The Hateful Eight. The location together with the snow storm always puts me in a good Christmas mood.",
        "upvotes": 861,
        "comments": 2405,
        "media": null,
        "permalink": "/r/movies/comments/1h45pqs/what_are_your_favorite_uncommon_christmas_movies/"
    },
    {
        "id": "1h4ygav",
        "author": "angularvisage69",
        "title": "The Sound of Music ",
        "content": "I don't know if this is the right place to discuss this,but I cannot express the nostalgia and love I have for The Sound of Music. The whole movie makes me feel comfortable and at home. I could watch it repeatedly and never get tired of it. The whole story is so beautiful,and I can never get enough of it. ",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1h4ygav/the_sound_of_music/"
    },
    {
        "id": "1h4z3fs",
        "author": "KillerCroc1234567",
        "title": "Legendary Conservationist Jane Goodall’s Life To Be Made Into A Movie; Appian Way Developing For Disney With ‘The Luminaries’ Scribe Eleanor Catton Penning The Screenplay",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kGjHvc2m0u-q64erlyu_R2fi-8MQLSMidyOhMpl6WCQ.jpg?auto=webp&amp;s=60fdd227fd63ac0566c884571f830d9134ba0d1f"
        },
        "permalink": "/r/movies/comments/1h4z3fs/legendary_conservationist_jane_goodalls_life_to/"
    },
    {
        "id": "1h4x8gq",
        "author": "Myslivir",
        "title": "Non-american parody movies\n",
        "content": "Hi, have you guys seen any good parody movies that aren't from mainstream Hollywood? My student group would like to have special screenings in our local theater for ten evenings and we are running low on options. We got mostly american ones, but we are looking for some parodies that are not so famous/commonly known.",
        "upvotes": 11,
        "comments": 72,
        "media": null,
        "permalink": "/r/movies/comments/1h4x8gq/nonamerican_parody_movies/"
    },
    {
        "id": "1h468gb",
        "author": "MarvelsGrantMan136",
        "title": "Marshall Brickman, Oscar-Winning Screenwriter on ‘Annie Hall,’ Dies at 85",
        "content": "",
        "upvotes": 547,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8rJmh4dTGRbp4eGeLW-bhVMBF-4rJ9ylc_bPjDUpdBs.jpg?auto=webp&amp;s=504ffd34ccf44acac92671207a146163eeb87d95"
        },
        "permalink": "/r/movies/comments/1h468gb/marshall_brickman_oscarwinning_screenwriter_on/"
    },
    {
        "id": "1h45fx3",
        "author": "Beefyvalkyrie",
        "title": "You Favourite Movies of 2024 so far ",
        "content": "We've almost reached the end of 2024 and it's been a subtle \"fresh breeze of air \" kind of a year , with low quantity but high quality of movies coming out .\n\nWhat are your Top 5 favourite movies of this year so far ?\n\nMine are                       -\n\n1. Dune Part 2  - No doubt the greatest movie of the year and a perfect balance between  spectacle and detailed world building .\n\n\n2. The Wild Robot   - Dramwork's best in years and one of the most hard hitting movies of the decade.\n\n\n\n3. Kill     - An Indian movie which surpasses the level of modern Hollywood Action movies with ease imo . Non Stop insane ride of high octane realistic action sequences . ( Chad Stahelski is going to remake this movie in English )\n\n\n\n4. The Substance    - The craziest a movie can get .\n\n\n\n5. Smile 2      - A fresh engaging horror flick which lives up to the hype.\n",
        "upvotes": 567,
        "comments": 666,
        "media": null,
        "permalink": "/r/movies/comments/1h45fx3/you_favourite_movies_of_2024_so_far/"
    },
    {
        "id": "1h4h1lz",
        "author": "OutOfPlaceArtifact",
        "title": "What is the movie you have heard referenced the most, but never seen your self? if allowed, add your general age range",
        "content": "I (36M) have never seen My dinner with Andre. Im downloading it tonight and watching it because I feel like I have been missing out on a ton of references in popular TV/movies, and probably a good movie!\n\nFull disclosure I just rewatched 'Communitiy's Critical film Studies and now I need to watch My Dinner With Andre",
        "upvotes": 101,
        "comments": 439,
        "media": null,
        "permalink": "/r/movies/comments/1h4h1lz/what_is_the_movie_you_have_heard_referenced_the/"
    },
    {
        "id": "1h4m1h9",
        "author": "outremer_empire",
        "title": "Kate Winslet's emotional \"Titanic\" reunion",
        "content": "",
        "upvotes": 46,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6KU40zISL3viZt_sEM_FQmjewnDTgbjFZCsMaIRSjUo.jpg?auto=webp&amp;s=790bf2d5cf23529865c5c2372456ef10184554b4"
        },
        "permalink": "/r/movies/comments/1h4m1h9/kate_winslets_emotional_titanic_reunion/"
    },
    {
        "id": "1h46m27",
        "author": "salaryboy",
        "title": "\"Slowly spiraling downward into destruction\" films",
        "content": "I love films where we watch people's lives fall apart at the seams as their inner flaws and bad choices gradually bear fruit. Done best when a small group of family members or friends dip their toes into crime and are unable to handle the consequences. Call it schadenfreude or just the pleasure of watching someone else's life go worse than mine.\n\nClassics of the genre:\n\nBefore the Devil Knows You're Dead - One of Philip Seymour Hoffman's* masterclasses with a stunning Marisa Tomei and desperate Ethan Hawke. Great soundtrack and vibes reminiscent of David Mamet films.\n\nA Simple Plan - The story flows flawlessly from beginning to end. Bill Paxton and Billy Bob Thornton are perfect casting. One of the few films I loved so much that I read the book (the first 80% is beat for beat the same as the film, but that last 20%, damn).\n\nThe Way of the Gun - Brilliant film by Christopher McQuarrie before he became tied at the hip with Tom Cruise. Benicio del Toro's best performance IMHO.\n\nHonorable mention - Bloodline (season 1 especially), Full Circle on Max has a lot of these vibes.\n\nWhat others?",
        "upvotes": 381,
        "comments": 452,
        "media": null,
        "permalink": "/r/movies/comments/1h46m27/slowly_spiraling_downward_into_destruction_films/"
    },
    {
        "id": "1h3owte",
        "author": "indiewire",
        "title": "Cannes: 17 Unsimulated Sex Scenes in the Festival's History",
        "content": "",
        "upvotes": 8124,
        "comments": 899,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/klhSSzn9TFAttOFbgAdQifduNyaRMdsHu6zBIsqyXy4.jpg?auto=webp&amp;s=a68a320fc8faeb2986a0f53760b14a04c8901ebf"
        },
        "permalink": "/r/movies/comments/1h3owte/cannes_17_unsimulated_sex_scenes_in_the_festivals/"
    },
    {
        "id": "1h4a87h",
        "author": "Tyrionthedwarf1",
        "title": "Great Opening Movie Scenes that set the tone for the rest of the movie",
        "content": "I will go first, I have two particular scenes that come to mind. The first is the shadow boxing scene in Raging Bull (1980). The second movie is the scene in the Thing 1982, which involves a guy in the helicopter trying to kill a dog.\n\nPlease feel free to share your favourite opening movie scenes that sets the tone for the rest of the movie.",
        "upvotes": 110,
        "comments": 365,
        "media": null,
        "permalink": "/r/movies/comments/1h4a87h/great_opening_movie_scenes_that_set_the_tone_for/"
    },
    {
        "id": "1h4y8sg",
        "author": "Difficult-Possible78",
        "title": "Spy Kids 3D Floop intro",
        "content": "Hello! I was wondering if anyone has the 3D version of the third film on DVD and if the intro with Floop is still on it? \nI want to find a a way to share the English version! I did hear that it's present on the Spy Kids/Shark Boy and Lava girl blueray but I'm not sure if it's on the 3D DVD!\n\nThank you! ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1h4y8sg/spy_kids_3d_floop_intro/"
    },
    {
        "id": "1h3vis7",
        "author": "newredditaccount_24",
        "title": "What \"true\" movie did the greatest injustice to its main character?",
        "content": "As in, most people who see the movie will come away with the completely wrong belief about that real person? Either the movie emphasized the wrong things, bungled facts, filled in a lot of blanks, or just straight up lied.\n\nI imagine ones about world leaders or hugely impactful figures will necessarily attract a ton of controversy, but there's definitely got to be ones where there's no question about how wrong the portrayal was.",
        "upvotes": 1195,
        "comments": 934,
        "media": null,
        "permalink": "/r/movies/comments/1h3vis7/what_true_movie_did_the_greatest_injustice_to_its/"
    },
    {
        "id": "1h4n7uk",
        "author": "Dense_Ad_44",
        "title": "Do you know any movies entirely made/filmed/edited by 1 person?",
        "content": "Edit: Inside by Bo Burnham works perfectly, thanks y'all. I argue with my friend for like 3h and I won because of you all. You are the heros of my night \\^\\^  \n  \nMy friend demands a proof to admit that a movie can be made alone and successful. It needs to have made at least like 1 dollars of profit over the money taken to produce it (equipment aquired by other means than buying/already owned doesn't count) and it needs to have been officially critique by some official cinema sources (cause he thinks that a movie isn't successful if it isn't criticised officially for some reason). It can have been published on youtube or anything but needs to be at least an hour long, tho if it's not 1 hour long pls tell me anyways. Thanks, ask me if I forgot some important details to explain.\n\nEdit: He also needs to be the sole actor in the movie (animals count as actor but sounds out cam are fine)",
        "upvotes": 12,
        "comments": 62,
        "media": null,
        "permalink": "/r/movies/comments/1h4n7uk/do_you_know_any_movies_entirely_madefilmededited/"
    }
]