[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 495,
        "comments": 262,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1iz1co8",
        "author": "anonRedd",
        "title": "What We Watched the Second Half of 2024",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iz1co8/what_we_watched_the_second_half_of_2024/"
    },
    {
        "id": "1iyt6v9",
        "author": "Flat-Creek93",
        "title": "The Woman in the House Across the Street from the Girl in the Window",
        "content": "I’m going preface this by saying I’m a complete moron. I had no clue this was satire until like the last or second to last episode. In my defense, I knew nothing about this show when I clicked on it and was slightly preoccupied when I watched it. But OMG looking back on it, there’s so much dumb stuff I missed that’s absolutely hilarious. I might have to watch it again.",
        "upvotes": 207,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1iyt6v9/the_woman_in_the_house_across_the_street_from_the/"
    },
    {
        "id": "1iynxln",
        "author": "Sweaty-Toe-6211",
        "title": "Netflix CEO Ted Sarandos Explains Why Traditional Sitcoms Like 'The Big Bang Theory' Are Still Big Business",
        "content": "",
        "upvotes": 61,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1iynxln/netflix_ceo_ted_sarandos_explains_why_traditional/"
    },
    {
        "id": "1iyoes0",
        "author": "nycsbestkeptsecret",
        "title": "This season is bad ? (The Night Agent )",
        "content": "I really just couldn’t get behind this season. This romance between Peter and Rose just doesn’t give me life. She also doesn’t have any sex appeal as well (as does Peter), the storyline between the US and Middle East is a bit redundant. \n\nNoors character got on my nerves (&amp; and man her brother same ) .\n\nI’m sorry for all the negativity, but I just couldn’t stand it. \n\nDoes anyone else feel this way ?! ",
        "upvotes": 27,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1iyoes0/this_season_is_bad_the_night_agent/"
    },
    {
        "id": "1iyrd7j",
        "author": "MysteriousDelay6266",
        "title": "HAVOC | Official Teaser | Netflix",
        "content": "",
        "upvotes": 12,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1iyrd7j/havoc_official_teaser_netflix/"
    },
    {
        "id": "1iyn6tg",
        "author": "Robemilak",
        "title": "'Zero Day' Ranks as Second Most Watched Netflix TV Shows This Week (Worldwide)",
        "content": "",
        "upvotes": 18,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1iyn6tg/zero_day_ranks_as_second_most_watched_netflix_tv/"
    },
    {
        "id": "1iypg9a",
        "author": "Internal-Bed-3150",
        "title": "Netflix begins adapting the best season of Avatar: The Last Airbender to live-action",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iypg9a/netflix_begins_adapting_the_best_season_of_avatar/"
    },
    {
        "id": "1iyzmes",
        "author": "TheLakeGuardian",
        "title": "Kaiju movies in Netflix",
        "content": "Are there any kaiju movies on Netflix? (Excluding any Godzilla film and Love and Monsters, as I've already watched those). Shows such as Gamera Rebirth don't count because I want a film to watch. Kaiju movies are my favourite genre, so I'm looking forwards to seeing if there's any. Thanks in advance! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iyzmes/kaiju_movies_in_netflix/"
    },
    {
        "id": "1iz3un2",
        "author": "ECO_FRIENDLY_BOT",
        "title": "Zero Day is so poor",
        "content": "Just finished Zero Day and it was excruciating. Apart from the terrible plot and hammy dialogue most of the actors looked like they were phoning it in apart from Jesse Plemons. Netflix has been in decline for years now and while it still produces a good show now and again the overall output has been horrendous. I know De Niro has a lot of alimony to pay but it's sad to see him in sub par tv shows like this.",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1iz3un2/zero_day_is_so_poor/"
    },
    {
        "id": "1iypadu",
        "author": "Somethingman_121224",
        "title": "Hayden Schlossberg Reveals His Top Five Fighters in 'Cobra Kai'",
        "content": "",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iypadu/hayden_schlossberg_reveals_his_top_five_fighters/"
    },
    {
        "id": "1iyxfds",
        "author": "sorrybroorbyrros",
        "title": "Is it weird that the series I'm watching changes seasons/episodes while I'm away?",
        "content": "I'm watching Dark. I'm in season 3.\n\nWhen I go to watch again, it's back in the middle of season 2. It's happened 3 times now and returns to different points.\n\nDoes that mean someone else is accessing my account?\n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iyxfds/is_it_weird_that_the_series_im_watching_changes/"
    },
    {
        "id": "1iyr6sh",
        "author": "mad_max_mb",
        "title": "What’s the Best Show or Movie You’ve Watched on Netflix?",
        "content": "With so many options on Netflix, it’s hard to pick what to watch next. From intense thrillers to heartwarming dramas, the platform has something for everyone.\n\nFor me, \"Money Heist\" was an absolute game-changer—the tension, the characters, and that iconic Bella Ciao just made it unforgettable!\n\nWhat’s your top Netflix recommendation? A hidden gem, a must-watch series, or a recent favorite? Let’s share our best picks!",
        "upvotes": 4,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1iyr6sh/whats_the_best_show_or_movie_youve_watched_on/"
    },
    {
        "id": "1iyst2b",
        "author": "LingLings",
        "title": "Does anyone know why the episode count for S1 of The Fall (2016) is different from Wikipedia page.",
        "content": "Wikipedia shows 17 episodes in total over three seasons (5,6 and 6) but ..\n\n..on Netflix the first season has only 3 episodes , not 5.  The remaining seasons have 6 each so match Wikipedia.\n\nI’m based in Spain if that might make a difference.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iyst2b/does_anyone_know_why_the_episode_count_for_s1_of/"
    },
    {
        "id": "1iy5f5d",
        "author": "AwkwardUrkel",
        "title": "Disrupt The Market",
        "content": "I cancelled my Netflix today. \n\nI've been around since the DVD in the mail phase. I'm so tired of the incremental increase of subscriptions. At what point will enough of us hit cancel so they understand! ",
        "upvotes": 74,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1iy5f5d/disrupt_the_market/"
    },
    {
        "id": "1iyx3yg",
        "author": "albert_er",
        "title": "Issue with movie search",
        "content": "Has anyone else noticed issues with the title search?  \nWhen I search for a title in the Search (on PC, Firefox), select a title to look on the details and then close the details popover, the other titles can not be selected anymore.  \nThe only Option I have is to relaod the Page.\n\nI could not find a place to report this bug, so I am posting it here, so maybe a Neflix employee sees it.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iyx3yg/issue_with_movie_search/"
    },
    {
        "id": "1iywptw",
        "author": "katiekat1342",
        "title": "How do I \"re-merge\" an extra member back into a main account?",
        "content": "My parents have Netflix and I bought an extra member slot on their account when I moved out so I could continue using my profile from a different location. \n\nI've since moved back home and wanted to know if there was a way to \"re-merge\" my extra slot into my parents main account, so I don't have to log them out and log myself in each time I want to watch something. Is my only option to create a new profile and lose my recommendations and shows I'm currently watching?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iywptw/how_do_i_remerge_an_extra_member_back_into_a_main/"
    },
    {
        "id": "1iyv4fr",
        "author": "NoahDSanders",
        "title": "Auto profile creation glitch??",
        "content": "I was playing on my PlayStation 3 on a HDMI 3 and my PS5 was online and on HDMI 1. I believe I dropped my controller on the ground sometime when on my ps3. When I switched back to HDMI1 for the PS5 it was on my girlfriends Netflix account however I noticed it logged me into a brand new profile with a bunch of random letters and numbers for a name and what’s even weirder is I cannot delete the profile. Ironically it chose Lucifer as the main profile. Has this ever happened to anyone else? If so what might have caused this ?? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iyv4fr/auto_profile_creation_glitch/"
    },
    {
        "id": "1iyu7te",
        "author": "IllustriousEgg609",
        "title": "Just one more time",
        "content": "SPOILER\n\n\n\n\nSo i had the feeling since she first met the guy(she later marries, forgot name) i always had a bad feeling with him and was praying that she gets back together with atlas :(\n\nGood to know i have a sense for red flags.\n\n\nDid you feel this too?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iyu7te/just_one_more_time/"
    },
    {
        "id": "1iyjjrn",
        "author": "RealityShrine",
        "title": "Too Hot To Handle star Holly Scarfone claims Scott Disick 'pressured' her to get surgery",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iyjjrn/too_hot_to_handle_star_holly_scarfone_claims/"
    },
    {
        "id": "1iy8ogp",
        "author": "MotherofBook",
        "title": "These Category titles are hilarious. Have y’all seen these?",
        "content": "Idk why this is so funny to me but ***‘Rich People Behaving Badly’*** As A category title, on Netflix, has taken me all the way out. \n\nThat’s very much how I name my categories. 🤣😂🤣🤣🤣",
        "upvotes": 29,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1iy8ogp/these_category_titles_are_hilarious_have_yall/"
    },
    {
        "id": "1iyrt5u",
        "author": "anxietyrainbows",
        "title": "I need of some help",
        "content": "Hey, i wanna add some shows to my library that i saw on my brothers  acoount but they dont exist on mine?  For 15 bucks a month i should be able to view my whole countries library. We literally live in the same house so its weird i can't view the same shows ? We both have the 18 plus option, so its not due to age restrictions on the profile\n\nEdit for more clarification:\nI pay for netflix its my account and my brothers account is just another profile made on that. \nHis profile is the only one different and shows many titles my profile and the general profile dont have.   Its been like this since 2018 and we cycled through different accounts. He didn't have any specicial settings or anything ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1iyrt5u/i_need_of_some_help/"
    },
    {
        "id": "1iyrsgk",
        "author": "Fit_Bee367",
        "title": "Need some good TV show recs",
        "content": "Hey, might sound kinda weird, but I’m looking for American or British shows with good-looking characters \" especially the male lead\" i don't want smth classic, Don’t really care about the genre, just need a solid story that won’t put me to sleep.\n\nWatched *The Gentlemen 2024*—loved it. Also saw *The Hating Game*. So yeah, my taste is all over the place \n\n**Please don't suggest any shows with a lot of sexual content**",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1iyrsgk/need_some_good_tv_show_recs/"
    },
    {
        "id": "1ixzcpp",
        "author": "S4v1r1enCh0r4k",
        "title": "Netflix hit a record 8.6% of total TV screen time in January with Squid Game racking up an astonishing 9 billion minutes of viewing time",
        "content": "",
        "upvotes": 74,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1ixzcpp/netflix_hit_a_record_86_of_total_tv_screen_time/"
    },
    {
        "id": "1iyhzqa",
        "author": "Robemilak",
        "title": "‘FEAR STREET: PROM QUEEN’ premieres May 23 on Netflix.",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iyhzqa/fear_street_prom_queen_premieres_may_23_on_netflix/"
    },
    {
        "id": "1iynmla",
        "author": "Lumpy-Addendum8288",
        "title": "HDR is werd on netfilx",
        "content": "So i got premium to see content in HDR on my samsung S23 that does suport HDR10+ and was watching ,,zero day\" and it looks bad, the colors look bland and flat and SDR (before geting premium i was on standerd) for some reason looks beter, but i went to watch \"super mario\" in HDR it dosent balnd out the colors qite the oposite it looks realy good and looks more like what i think of HDR. Is anyone have similer exsperiance with netfilx HDR ? \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iynmla/hdr_is_werd_on_netfilx/"
    },
    {
        "id": "1iz0if6",
        "author": "Longjumping_Land_977",
        "title": "Gabby Petito’s mum reveals huge red flags she saw in Brian Laundrie before daughter’s murder",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1iz0if6/gabby_petitos_mum_reveals_huge_red_flags_she_saw/"
    },
    {
        "id": "1iygvmg",
        "author": "cartgirl69",
        "title": "Full Swing Season 3 Discussion",
        "content": "Not finished yet but I think this is infinitely better than the prior seasons. Personal favorites: Neal Shipley and Min Woo Lee. Thought first ep was great too. Looking forward to finishing last 2 eps tomorrow. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iygvmg/full_swing_season_3_discussion/"
    },
    {
        "id": "1iykz7o",
        "author": "Pe45nira3",
        "title": "Is anyone else reminded of the video games \"Portal\" and \"Portal 2\" with \"Cassandra\"?",
        "content": "This series feels like it has been heavily influenced by Portal and could be a kind of live-action Portal adaptation set in a family home, rather than an underground facility.\n\nHorst is Cave Johnson, Cassandra is Caroline (and GLaDOS), and her victims are Chell and the various test subjects who had the misfortune of falling under GLaDOS's \"care\".\n\nAs a Portal fan, I adored this series.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iykz7o/is_anyone_else_reminded_of_the_video_games_portal/"
    },
    {
        "id": "1ixykn6",
        "author": "CampMain",
        "title": "Fifth and final series of You coming to Netflix April 24th",
        "content": "",
        "upvotes": 30,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ixykn6/fifth_and_final_series_of_you_coming_to_netflix/"
    },
    {
        "id": "1iy86ou",
        "author": "RJMC5696",
        "title": "Kaos",
        "content": "Just finished rewatching it for the second time. I Think it was a brilliant show with great actors, and had so much potential. Sad that there’ll be no season two. Anybody else wish there would be a second season? ",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1iy86ou/kaos/"
    },
    {
        "id": "1iyaux4",
        "author": "br_web",
        "title": "Your device isn’t part of the Netflix Household for this account",
        "content": "I have been living in the same house for 6 years, I have had the same ISP for all the 6 years, I have 3x Apple TVs, 1x iPhone, 1x iPad and 1x MacBook Pro, all devices, but the MacBook Pro work fine with Netflix, only with the MacBook Pro I don't have access to Netflix and get the message below.\n\nWhy is this happening, none of the devices have been outside the house or connected to a different Wifi network or ISP, I would understand this could happen if the ISP changes the WAN IP, but in that case all devices in the house will be impacted (they all share the same WAN IP) not just one device, is there a reasonable explanation for this?\n\nNote: I already signed-out from all devices and rebooted them as requested by Netflix customer support (honestly it is a joke, zero power to do anything), then, the representative submitted a ticked with the \"offline team\", who is like a ghost team, they never called you back and send any communication with the status of the ticket, I had this exact same problem a year ago. \n\nThanks\n\n# Your device isn’t part of the Netflix Household for this account ",
        "upvotes": 4,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1iyaux4/your_device_isnt_part_of_the_netflix_household/"
    }
]