[
    {
        "id": "1hmfpsf",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Nosferatu / a Complete Unknown / Babygirl / The Fire Inside / The Order)",
        "content": "# New Theatrical Releases\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n[Nosferatu](https://old.reddit.com/r/movies/comments/1hmffh4/official_discussion_nosferatu_2024_spoilers/?)\n\n[Babygirl](https://old.reddit.com/r/movies/comments/1hmffj8/official_discussion_babygirl_spoilers/?)\n\n# Streaming Releases\n\n[Nightbitch](https://old.reddit.com/r/movies/comments/1homiqy/official_discussion_nightbitch_spoilers/)\n\n[The Order](https://old.reddit.com/r/movies/comments/1hlsi4b/official_discussion_the_order_spoilers/?) on VOD\n\n[Juror #2](https://old.reddit.com/r/movies/comments/1hjiwvb/official_discussion_juror_2_spoilers/?) on MAX\n\n# Still in Theaters\n\n[Sonic the Hedgehog 3](https://old.reddit.com/r/movies/comments/1hiae45/official_discussion_sonic_the_hedgehog_3_spoilers/?)\n\n[Mufasa: The Lion King](https://old.reddit.com/r/movies/comments/1hiae58/official_discussion_mufasa_the_lion_king_spoilers/?)\n\n[Wicked: Part 1](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/)\n\n[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/)\n\n[Kraven the Hunter](https://old.reddit.com/r/movies/comments/1hd2v8v/official_discussion_kraven_the_hunter_spoilers/?)\n\n[The Lord of the Rings: The War of Rohirrim](https://old.reddit.com/r/movies/comments/1hd2vab/official_discussion_the_lord_of_the_rings_the_war/?)",
        "upvotes": 69,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hmfpsf/official_discussion_megathread_nosferatu_a/"
    },
    {
        "id": "1hpp7yt",
        "author": "SanderSo47",
        "title": "December 27-29 Box Office Recap: 'Sonic 3' and 'Mufasa' fight for the top spot at the box office. 'Nosferatu' opens with a fantastic $40.3 million in its first five days, already becoming Robert Eggers' highest grossing film. 'A Complete Unknown' settles for sixth place with $23.1 million.",
        "content": "https://preview.redd.it/k21dn07d40ae1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=5b2edf912cefe80f8f6936c9ec0814e5006ae794\n\n#**Normally you'd wait till the Weekend Actuals are out. But the numbers are delayed due to the holidays, so you'll only have estimates for now. The same could happen next week.**\n\nIt was a fierce battle at the box office.\n\n***Sonic 3*** and ***Mufasa: The Lion King*** fought for the top spot, with the hedgehog currently leaning on the top spot for now. On Christmas, we got 4 newcomers, with mixed results. ***Nosferatu*** delivered a fantastic debut and became Robert Eggers' highest grossing film in just 5 days, while ***A Complete Unknown*** had a very solid start. On the other hand, ***Babygirl*** had a soft start, while ***The Fire Inside*** failed to attract interest.\n\nThe Top 10 earned a combined $159.2 million this weekend. That's up a huge 58% from last year, when ***Wonka*** returned to the top spot.\n\nStaying on top, ***Sonic 3*** earned $38 million this weekend ($59.9 million five-day). That represents a 37% drop, which is better than the previous films. There were concerns over the weekdays, as it appeared that it was front-loaded and would show weak legs, but it looks like it recovered for now.\n\nThrough ten days, the film has amassed $136.8 million. It should have another great hold this weekend, which will allow it to hit $200 million very soon. It can go as high as $250 million at this pace.\n\nSettling for second place, ***Mufasa*** made $37.1 million this weekend ($63.7 million five-day). That's a very nice 5% increase from last weekend. It had a soft debut but it's showing some strength. Through 10 days, it has made $113.4 million. Despite this increase, the film is still off a massive 68% from the 2019 film through the same point. We'll see how much it can earn through the holidays.\n\nExceeding expectations, Robert Eggers' ***Nosferatu*** debuted with a fantastic $21.1 million this weekend ($40.3 million five-day). This is not just Eggers' biggest debut by a wide margin, but it's already his highest grossing film domestically, passing ***The Northman*** ($34.2 million). It's also the fourth biggest debut for Focus Features.\n\nThis is an amazing result in any sense of the word, and showed that Eggers could finally hit the mainstream audience (***The Northman*** was supposed to be that film, but it didn't quite land at the box office). But that still raises the question: how was this film able to debut this high and far above Eggers' films? Credit must go to a fantastic marketing campaign, which offered enough intrigue and darkness to attract audiences. The decision to hide Bill Skarsgård's appearance as the iconic Count Orlok from the trailers panned out very well; if you want to watch him, you have to pay a ticket.\n\nIt can be said that Eggers' brand has also increased in past years. While ***The Northman*** wasn't a box office hit, Focus Features confirmed that the film eventually became profitable after a few months thanks to strong VOD numbers and other post-theatrical markets, and this was a big reason why they were confident in greenlighting ***Nosferatu***. Also, while remaking a 1922 silent German Expressionist film feels like it would struggle to get recognition, ***Nosferatu*** actually had some exposure to the audience. A lot of kids were introduced to this character in that iconic ***SpongeBob SquarePants*** episode. That helped the film build awareness. \n\nAccording to Focus Features, 55% of the audience was male and 56% of the audience was in the 18-34 demographic. While critics raved about the film, audiences wasn't as much; they gave it a weak \"B–\" on CinemaScore. That's not actually a bad score for a horror film, given they often fall in the C range. Nevertheless, without horror competition till ***Wolf Man*** in mid January, ***Nosferatu*** should hold well through the holidays. While it's unclear how much it can earn, one thing is clear: this is hitting $100 million domestically, which is an amazing result.\n\n***Wicked*** rose 37%, adding $19.4 million this weekend ($31.7 million five-day). On Christmas day, it added a sing-along version, which boosted the numbers. The film has earned a fantastic $424 million so far.\n\nAfter its weak legs, ***Moana 2*** had its best drop so far. It jumped 38%, adding $18.2 million this weekend. A much needed recovery, given it wasn't holding well after its gigantic opening. The film has earned $394.6 million so far, and will hit the $400 million milestone in a few days.\n\nDebuting in sixth place, Searchlight's ***A Complete Unknown*** earned $11.6 million ($23.1 million five-day). This is one of the best debuts for Searchlight, and its opening day ($7.2 million) was a record for the studio. If we want to compare it to James Mangold's films, the five-day debut is slightly above of what ***Walk the Line*** made in 3 days ($22.3 million). \n\nThis is a solid start, and the only reason why it's not fantastic is that it's carrying an extensive $60-$70 million budget, putting a lot of pressure in the film. Bob Dylan is one of the most iconic singers and songwriters of the past century, although he is still not as popular as other musicians in other biopics. For example, Queen, Elton John and Bob Marley are more popular with current audiences than Dylan. So the film had only one selling point: its star Timothée Chalamet.\n\nLike him or not, Chalamet is one of the most popular young stars of our times. He already had huge hits in the past year with ***Wonka*** and ***Dune: Part Two***, and he's already set for another film, ***Marty Supreme***, which also opens on Christmas Day next year. Deadline reported that 36% of the audience watched the film for Chalamet, cementing a status as a box office draw. Reviews were also solid enough to win over audiences, and some Oscar buzz is on the horizon.\n\nAccording to Searchlight, the audience was equally split between men and women. Unsurprisingly, the big demo was adults; 62% of the audience was 35 and over. They gave it a strong \"A\" on CinemaScore, which bodes very well for its legs. And you have to remember that this is targeting an old audience, which doesn't rush out to watch a film as soon as possible. We'll keep an eye on this one, but the incoming Oscar buzz should help it stay in theaters for quite  a long time.\n\nIn a distant seventh place, A24's ***Babygirl*** earned $4.3 million ($7.2 million five-day). That's quite a soft start, especially considering that the film was playing in 2,115 theaters, and the fact that A24 pushed it as its main attraction for the holidays.\n\nThe film is sold as an erotic thriller, but that can be a mixed bag at the box office. Outside the ***Fifty Shades of Grey***, erotic thrillers haven't performed very well at the box office. And despite having a big name in Nicole Kidman, she hasn't had a good run as of late; she hasn't had a single box office hit since ***The Upside*** back in 2019. Her recent success has been on streaming and on TV, leaving questions over her star power at the box office (even though she's the face of AMC).\n\nAccording to A24, 53% of the audience was female and 44% of the audience was 35 and over. While critics were positive of the film, the audience wasn't forgiving; they gave it a very weak \"B–\" on CinemaScore, which might be due to the nature of the film itself. While Kidman has some Oscar buzz, it would be a surprise if the film made anything above $20 million domestically.\n\n***Gladiator II*** continues showing some great late legs. The film eased just 9% and earned $4.1 million this weekend. That takes its domestic total to $163 million. It's gonna head to around $175 million.\n\nAngel Studios' ***Homestead*** had the worst drop in the Top 10. It dropped 47%, adding $3.1 million this weekend. That takes its domestic total to $12.8 million, and it suggests that it will fall off when the holidays are over.\n\nRounding up the Top 10 was the last newcomer of the week, Amazon MGM's ***The Fire Inside***. Despite setting it at 2,006 theaters, the film bombed with just $2 million ($4.3 million five-day). That's the 28th worst debut for any film playing at 2,000+ theaters.\n\nThis isn't a surprising result. Amazon didn't appear to focus on properly marketing the film, choosing to simply dump it on Christmas and hoping that it would find an audience. After all, ***The Boys in the Boat*** over-performed last year, showing there was a market for sports dramas. But the film simply lacked a hook; people simply weren't interested in Claressa Shields' story. Even with the talent involved, it simply wasn't enough.\n\nAccording to MGM, 51% of the audience was female and 51% was 35 and over. On the bright side, the audience gave it a strong \"A\" on CinemaScore, which fits nicely with its great reviews. But even with that, it's unlikely it can turn things around.\n\n***Kraven the Hunter*** slightly recovered after its awful second weekend drop, even if it fell on the bad side of the drops. It dropped 44%, adding $1.7 million this weekend. Sadly, with an anemic $21.3 million domestic total so far, there's nothing to celebrate here. It might hit $25 million, but it won't get much higher than that.\n\nBut while ***Kraven*** kept showing weak legs, ***The Lord of the Rings: The War of the Rohirrim*** does not appear to have any legs. The film collapsed 63%, earning just $455,000 this weekend. Absolutely horrible considering the rest of the films had fantastic holds. The film has made just $8.5 million domestically, and it's now guaranteed to finish below $10 million.\n\nParamount chose to open the Robbie Williams biopic ***Better Man*** in 6 theaters, ahead of its wide release on January 10. But the film flopped with just $18,000 ($35,000 five-day), which translates to a very poor $3,000 per-theater average. Not a surprise, considering Williams failed to find an audience in America. This is a bad sign for its wide release.\n\n#**OVERSEAS**\n\n***Mufasa*** was still on top in the rest of the world, albeit only slightly. It added $77 million this weekend, taking its worldwide total to $327 million. The best markets currently are France ($20.9M), UK ($15.8M), Mexico ($15.5M), Italy ($14.4M) and Germany ($13.6M).\n\n***Sonic 3*** made its debut in the rest of the world, debuting with a dazzling $74 million in 52 markets, taking its worldwide total to $210 million. That's a huge 83% of the second film's debut. The best debuts were the UK ($15.1M), Mexico ($10.3M), France ($7.3M), Australia ($5.5M), Germany ($5.5M), Spain ($3.3M), Panama ($2.3M); Peru ($1.6M), Colombia ($1.3M) and Malaysia ($1.3M), all of which were records for the franchise. It should have no problem hitting $500 million, and it still has some markets left.\n\n***Moana 2*** added $36 million this weekend, and its worldwide total is now $882 million. The best markets are France ($53.9M), UK ($42.6M), Germany ($34.8M), Mexico ($28.2M) and Brazil ($25.7M).\n\nIn a major milestone, ***Wicked*** has now passed ***Mamma Mia!*** to become the highest grossing Broadway adaptation, with a current worldwide total of $634 million. The best markets are the UK ($67M), Australia ($24.8M), Korea ($14.2M), Germany ($11.8M) and Mexico ($9.9M).\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Heretic* | Nov/8 | A24 | $10,829,810 | $27,716,205 | $42,703,807 | $10M\n\n- A24's ***Heretic*** has closed with $42 million worldwide. That's a very solid start, even if the film didn't have a lot of staying power after its good debut. If Hugh Grant making a Jar-Jar impression is not enough to get you to buy a ticket, nothing will.",
        "upvotes": 31,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UsfdGAkh1IxdywQuaZAtKyPHE84GbGZoPXH8oqdNDxc.png?auto=webp&amp;s=e0931a977d1cac08b034c4a0a03fb55a018ab231"
        },
        "permalink": "/r/movies/comments/1hpp7yt/december_2729_box_office_recap_sonic_3_and_mufasa/"
    },
    {
        "id": "1hpoeci",
        "author": "dragondiaper",
        "title": "PSA: Hundreds of Beavers is free on YouTube",
        "content": "",
        "upvotes": 871,
        "comments": 212,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/76ZReWomzFEI3mpen9c1ztPqZ4wAUAgDkBrEDerXs3Y.jpg?auto=webp&amp;s=08246297a9423eac8d8c3f75e632c26ed24cdeb3"
        },
        "permalink": "/r/movies/comments/1hpoeci/psa_hundreds_of_beavers_is_free_on_youtube/"
    },
    {
        "id": "1hpaj6c",
        "author": "Gato1980",
        "title": "Robert De Niro’s $1 billion Wildflower Studios, the world’s first vertical film studio and production soundstage in Queens, NY, is complete and already operational",
        "content": "",
        "upvotes": 14300,
        "comments": 805,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j9xB8Zx68285-ZMPznMHYZaZMmeUm1Rx4nktVVzT4yk.jpg?auto=webp&amp;s=6223e2d00b85c9034c9075530826596f17a2aed4"
        },
        "permalink": "/r/movies/comments/1hpaj6c/robert_de_niros_1_billion_wildflower_studios_the/"
    },
    {
        "id": "1hphh03",
        "author": "Front_Sugar4784",
        "title": "The (Good Will Hunting) “will leaving Skylar scene” is so devastating to me",
        "content": "I watched the movie for the first time today, decided to give it a shot. Great movie. The part in the scene that truly got to me is where Skylar starts crying after will reveals his dad put cigarettes out on him when he was younger. It all goes down hill from there as will says he doesn’t love her and she breaks down. Something about the scene makes it stick out like a sore thumb. It’s incredible, acting is crazy good. \n\n\nhttps://youtu.be/e4hXrrc8fA8?si=WqNx3YCfEwLuNiJH\n",
        "upvotes": 995,
        "comments": 102,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bOyxqI1KEzyX6QdtKbT9VrMM9EPBBfgwdXvldcsCmKA.jpg?auto=webp&amp;s=80d729440a237d92873090b6ac6ad56e4b89bf0d"
        },
        "permalink": "/r/movies/comments/1hphh03/the_good_will_hunting_will_leaving_skylar_scene/"
    },
    {
        "id": "1hpdh9u",
        "author": "gearwest11",
        "title": "I never realize how many serious blows the major movie industry dealt with in the 2010’s ",
        "content": "From the death of the video rental stores (especially with Blockbuster), to the Sony Pictures hack, to the rise of streaming and the misguided push from the major  studios by creating their own or rebranding one, to the Harvey Weinstein scandal which leads to the #Metoo movement, and the big blow of it all was the Disney/Fox merger resulting one less major studio to make movies and less variety now.\n\nAnd honestly those factors feel like the reasons why this decade so far as far as mainstream movies goes has been less than stellar. \n\nIt's sad too because there was a time a studio would greenlight a quirky comedy like Zombieland or Hot Tub Time Machine or the Oscar bait but crowd pleasing drama like Argo or The Martian. Now those kinds of movies are so far in between and mostly become Netflix filler even if the film is good it's buried by a cluttered algorithm. \n\n\n\n",
        "upvotes": 1255,
        "comments": 155,
        "media": null,
        "permalink": "/r/movies/comments/1hpdh9u/i_never_realize_how_many_serious_blows_the_major/"
    },
    {
        "id": "1hp017o",
        "author": "MarvelsGrantMan136",
        "title": "‘Wicked’ Overtakes ‘Mamma Mia!’ To Become No. 1 Stage Musical Adaptation Ever Worldwide",
        "content": "",
        "upvotes": 5172,
        "comments": 392,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xTyd-JjP9SqSPbqD35DgO-zB6ZE3k4cTOy0muCs7_7E.jpg?auto=webp&amp;s=2b34f87749fcf44781623ae25cef3078090eb366"
        },
        "permalink": "/r/movies/comments/1hp017o/wicked_overtakes_mamma_mia_to_become_no_1_stage/"
    },
    {
        "id": "1hprdj0",
        "author": "Task_Force-191",
        "title": "The Wild Robot Returns To Theaters On January 17th",
        "content": "",
        "upvotes": 61,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6xjsCy0XCpiwkODnYPJa68Gm4lGESJC--ZSydrrabAs.jpg?auto=webp&amp;s=7c01c588ec3e9f79bf13c23dc0754b7efe768a73"
        },
        "permalink": "/r/movies/comments/1hprdj0/the_wild_robot_returns_to_theaters_on_january_17th/"
    },
    {
        "id": "1hpogfs",
        "author": "SuplexCity-Mayor",
        "title": "Se7en 30th Anniversary | Experience It In IMAX | Official Trailer",
        "content": "",
        "upvotes": 69,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Yo9rsYx4GSdlUJnzOd9GIXCyLWNkuLgUyaS7le4QVcs.jpg?auto=webp&amp;s=37cdeac2299f522987969e6d54f57e2e2d62f078"
        },
        "permalink": "/r/movies/comments/1hpogfs/se7en_30th_anniversary_experience_it_in_imax/"
    },
    {
        "id": "1hp805m",
        "author": "DonkeyOT65",
        "title": "The best \" Brit playing an American \" accent or vice versa? ",
        "content": "Was watching Bullet Train tonight, not the first time I've seen it, but Brian Tyree Henry was the most convincing American actor portrayal of an English accent I've ever encountered. \n\nI was convinced he was British, only to Google him and find he is American. Brilliant accent and portrayal. \n\nWho else has done such a convincing Anglo/American or American/Anglo mastery of the respective accents? ",
        "upvotes": 1242,
        "comments": 1980,
        "media": null,
        "permalink": "/r/movies/comments/1hp805m/the_best_brit_playing_an_american_accent_or_vice/"
    },
    {
        "id": "1hpkfwj",
        "author": "Blindfolded66",
        "title": "Top 10, but excluding IMDB top 250",
        "content": " What is your Top 10 list that doesn't include your typical Shawshanks, Terminator2s, Godfathers, etc?  The bottom of the Top 250 is 8.0, so for simplicity I made my list of 7.9 or lower.  But anything 8.0 but not currently on Top250 is fair game.  \n\nMine, in no particular order:\nGattaca\nOceans 11\nHigh fidelity \nBack to the Future 2\nEdge of tomorrow \nArrival\nRounders\nPrimer\nBig Short\nMoneyball",
        "upvotes": 90,
        "comments": 112,
        "media": null,
        "permalink": "/r/movies/comments/1hpkfwj/top_10_but_excluding_imdb_top_250/"
    },
    {
        "id": "1hpccgk",
        "author": "Bubbsindistress",
        "title": "I’ve been looking for anybody who has seen Russian vampire movie “Night Watch” for years. Has anybody seen it here so i can finally yap about it? ",
        "content": "It is such a niche movie for me. None of my friends have seen it since its a Russian movie and none of them speak the language except me and I dont think its dubbed anywhere.\nI’d love to watch it again and discus it with whoever has seen it here😁",
        "upvotes": 297,
        "comments": 199,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lC07aRIuQrYY5nBPyx_Sa50zjf9XbD3j9xKXrotnAEw.jpg?auto=webp&amp;s=d380ab15d3182de7ef021c60e8e48a98c7e5a3f0"
        },
        "permalink": "/r/movies/comments/1hpccgk/ive_been_looking_for_anybody_who_has_seen_russian/"
    },
    {
        "id": "1hp88h7",
        "author": "1ThousandDollarBill",
        "title": "I didn’t know Threat Level Midnight was largely based off of an actual movie, Sudden Death. ",
        "content": "Sudden Death is a ridiculous movie. At no point can you take it even remotely seriously. \n\nEarly on, Van Damme has his probably toughest fight in the entire movie against a 110 pound model in a mascot costume. \n\nVan Damme then spends the rest of the movie trying to save his kids who got caught up in a plot to kill the vice president along with every one else in the stadium. \n\nHe’s dodging machine gun fire from bad guys throughout the entire film while a very important hockey game is going on. \n\nHowever, Van Damme does find a way to make it on to the ice as goalie to make a very important goal save in the third period. He then signs “I love you” to his son in the stands. \n\nAfter watching Sudden Death I feel like Threat Level Midnight may be a more sane movie than what this movie was. ",
        "upvotes": 302,
        "comments": 67,
        "media": null,
        "permalink": "/r/movies/comments/1hp88h7/i_didnt_know_threat_level_midnight_was_largely/"
    },
    {
        "id": "1hp50pt",
        "author": "Youngs-Nationwide",
        "title": "Which titular character has the least significant role?",
        "content": "Which titular character **that actually appears in the movie** has the least prominent overall role?\n\nTo qualify, the character must be a particular individual who can be uniquely identified by the movie's title AND must make at least one physical appearance on screen. Imaginary or metaphorical entities don't count.\n\nThe prominence of the role could be judged as a function of screen time, plot relevance or interpreted more loosely by how important they are to the theme or message.",
        "upvotes": 446,
        "comments": 554,
        "media": null,
        "permalink": "/r/movies/comments/1hp50pt/which_titular_character_has_the_least_significant/"
    },
    {
        "id": "1hpro0n",
        "author": "pickuppencil",
        "title": "Have you timed a movie with the ringing in of New Years?",
        "content": "Talking with friends, I learned back when Infinity War was on Netflix, they timed it so the Thanos Snap occurred at midnight.\n\nI'm planning on timing of the New Year's Eve party countdown from \"When Harry Met Sally.\"\n\nOther movies I've heard were Forest Gump's New Years party and Spiderman 2 pizza time. ",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/movies/comments/1hpro0n/have_you_timed_a_movie_with_the_ringing_in_of_new/"
    },
    {
        "id": "1hpdpcr",
        "author": "homecinemad",
        "title": "Strange Darling is awesome, Willa Fitzgerald is incredible ",
        "content": "I will say nothing about the films style, structure, tone. I went in blind and it was very rewarding. It was expertly made and I'm so glad the Miramax hacks' plans to take over the film failed. This movie rocks.\n\nOnto Willa. I only know her from Reacher. She was fantastic. So many moments where I thought, I've never seen that before! One scene in particular, where she's fighting exhaustion, she was doing so much with her face and body, conveying so many whirling feels and sensations...I'm in awe.\n\nI hope the director makes more shit. This film is a 10/10 for me.",
        "upvotes": 72,
        "comments": 38,
        "media": null,
        "permalink": "/r/movies/comments/1hpdpcr/strange_darling_is_awesome_willa_fitzgerald_is/"
    },
    {
        "id": "1hpqs6p",
        "author": "everonwardwealthier",
        "title": "What's a good movie to watch on New Year's Eve?",
        "content": "I'm not getting any good ideas and want the movie to be holiday appropriate for once since I don't usually. Maybe a movie that takes place on new years and has new years as a theme. Got some ideas about this?\n\nThis post needs to contain 300 words but there really isn't anything to say except what I wrote in paragraph one so I am going to add this second paragraph amd let the thread slide past the Reddit censor bots but I tell you what they should let you re-edit a rejected post instead of making you create a new one that would make things somewhat easier without the redundancy so there it is if that ain't enough then I am not going to write a third one.",
        "upvotes": 7,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1hpqs6p/whats_a_good_movie_to_watch_on_new_years_eve/"
    },
    {
        "id": "1hpoztr",
        "author": "indiewire",
        "title": "The Best New Year's Eve Movies to Watch",
        "content": "",
        "upvotes": 9,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sfQMF_PL6uvCgXB30iACLiTQbw0oe9Ovf8GFEjROCI4.jpg?auto=webp&amp;s=976aad7a053d0f0730feeda2d0fd10af1ce0f60d"
        },
        "permalink": "/r/movies/comments/1hpoztr/the_best_new_years_eve_movies_to_watch/"
    },
    {
        "id": "1hpc8br",
        "author": "Comprehensive-Fun47",
        "title": "Catch me up on the best movies of the year 2024",
        "content": "I've only watched a handful of movies this year that I think will be contenders come award season. I'm not specifically looking for films with Oscar buzz, but I want recommendations of films of that caliber.\n\nWhat were your favorites this year? What are the must-see movies? Tell me what to watch., including foreign films. \n\nMy faves this year were Challengers, Civil War, and Flow. I've seen Wicked and Dune 2, Emilia Pérez, Small Things Like These. Anora, A Complete Unknown, and Nightbitch are on my list.",
        "upvotes": 73,
        "comments": 154,
        "media": null,
        "permalink": "/r/movies/comments/1hpc8br/catch_me_up_on_the_best_movies_of_the_year_2024/"
    },
    {
        "id": "1hp3u0a",
        "author": "indiewire",
        "title": "The Best Vampire Movies of All Time: 'Dracula,' 'Martin,' and More",
        "content": "",
        "upvotes": 219,
        "comments": 132,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/mTb1M2ISMTvS97QUoeieK4PM0PfyLtQ70ZlTV5j8E1o.jpg?auto=webp&amp;s=a8fce36f31920053bf3f08b9cec928c51bfd591c"
        },
        "permalink": "/r/movies/comments/1hp3u0a/the_best_vampire_movies_of_all_time_dracula/"
    },
    {
        "id": "1hoo1me",
        "author": "JannTosh50",
        "title": "20 Years Later, Lemony Snicket and Director Brad Silberling Look Back on A Series of Unfortunate Events",
        "content": "",
        "upvotes": 3509,
        "comments": 282,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bimzJ_LEjWXrrunkJBimWlHATHxoPRmByHhijhzD5U0.jpg?auto=webp&amp;s=c6747ca5525c00573d8fabbbd5a72474594c0ebc"
        },
        "permalink": "/r/movies/comments/1hoo1me/20_years_later_lemony_snicket_and_director_brad/"
    },
    {
        "id": "1howd97",
        "author": "Mst3Kgf",
        "title": "It's easy to overlook given it's in a fun family-friendly animated comedy, but Hal/Titan in \"Megamind\" is actually a pretty scary concept for a supervillain.",
        "content": "Much like Syndrome in \"The Incredibles\", this character should easily work in a \"serious\" live-action superhero movie. And while Hal/Titan isn't portrayed as dangerous/evil as Syndrome is (he never tries to kidnap or kill children, at least not on camera), he's still a very disturbing concept, as in \"What if an incel type got superpowers?\" His behavior towards Roxanne was creepy from the start (the guy has a cutout of her over his bed with \"GOOD NIGHT HAL\" added to it, yikes), but once he gets superpowers, it just gets to another level. Especially once she gently turns him down, because then his sense of entitlement and rage at rejection causes him to go to some very dark places.\n\nThe sequence where he shows off his powers by taking her flying especially shows this off. The scene is of course a parody of the classic Superman and Lois flight sequence in the original film, but in that, Superman invites Lois to fly and after she accepts, he gently and gracefully takes her on the flight while always being mindful of her safety. Hal/Titan just grab Roxanne against her will and takes her flying around while constantly putting her in danger so he can \"save\" her. Because while Superman genuinely cares for and respects Lois as a person, to Hal/Titan, Roxanne is just an object he's owed. And once he doesn't get his prize, like a classic example of an incel, he can't fathom it (he's a nice guy AND he has powers now!) and he turns violent. You can also justifiably see how terrified Roxanne is of him on that scene alone; if he almost killed her trying to \"save\" her, she knows how much damage he could do if he was intentional about it.\n\n\"Megamind\" as a whole is an unexpectedly more complex and well-made film than many might expect (I can see why its reputation and popularity have grown in recent years), but having a genuinely unsettling villain concept is one of its best features. If Syndrome personifies toxic fanboy culture, Hal/Titan is the worst case scenario of the guy who won't take \"no\" for an answer.",
        "upvotes": 585,
        "comments": 63,
        "media": null,
        "permalink": "/r/movies/comments/1howd97/its_easy_to_overlook_given_its_in_a_fun/"
    },
    {
        "id": "1hpqu6n",
        "author": "horizonsfan",
        "title": "My family has no love for Godzilla",
        "content": "This can be filed under \"mildly interesting\" but I thought I'd share.\n\nOver the Christmas break, my 82 year old dad asked the family what their favorite movies were for 2024. I said *Godzilla Minus One.* Got a blank stare from everyone. My wife won't watch it even though I explained it's really a drama about relationships, taking responsibility, and what courage means that just happens to be set at the end of WW2, oh and has a giant monster in it. I can see them lose interest when I get to that part! Adding this to the list of movies only I seem to appreciate.",
        "upvotes": 7,
        "comments": 66,
        "media": null,
        "permalink": "/r/movies/comments/1hpqu6n/my_family_has_no_love_for_godzilla/"
    },
    {
        "id": "1hozgds",
        "author": "Flat_Living_7415",
        "title": "Favorite Visually Stunning Films",
        "content": "Just finished watching Interstellar.  I’m not sure why it took me so long to get to it, but I really liked it.  Acting and story were great and the science aspect seemed pretty well thought out.  (I’m no scientist…)  It was, in parts, visually amazing.  What movies really took your breath away visually?  What are some of your favorite films strictly from a visual standpoint?",
        "upvotes": 290,
        "comments": 698,
        "media": null,
        "permalink": "/r/movies/comments/1hozgds/favorite_visually_stunning_films/"
    },
    {
        "id": "1hpbrvv",
        "author": "VirgoVenusLady",
        "title": "Re-watching a movie years later &amp; seeing how your perspective has changed (Spoilers)",
        "content": "When I was younger, my favorite movie on earth was The Parent Trap with Lindsey Lohan. Of course, watching it as a 7 year old I would wonder if I had a secret twin I’d meet at summer camp. As a kid, I would think about how cool it’d be to have a twin, what if I switched places with her, I wish I went to that summer camp, etc etc. Well, I’m aware we should re-read things &amp; re-watch things years later to see how our perspective has changed &amp; it was so wild to watch as an adult in my 30’s. I was curious about the Mom’s point of view. What if my ex husband was engaged, but my daughters wanted me to work things out? Would I have gone on the camping trip? Was that a plan to break them up? Would I have kissed him in the wine cellar? Also, the ending when he did come after her when that’s what she wanted before when younger, honestly made me cry because I was so happy for her. Just makes you think, thanks for reading!",
        "upvotes": 48,
        "comments": 43,
        "media": null,
        "permalink": "/r/movies/comments/1hpbrvv/rewatching_a_movie_years_later_seeing_how_your/"
    },
    {
        "id": "1hp5fta",
        "author": "EvergladesMiami",
        "title": "The Great Mouse Detective - Workprint Sample",
        "content": "",
        "upvotes": 90,
        "comments": 25,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8oDZSUv9Z8bEtpLdeLsQ8eRlLUeQpra_f-A6FxDpHAM.jpg?auto=webp&amp;s=faecb5ff808e5274b285a0cca03c5314932829b5"
        },
        "permalink": "/r/movies/comments/1hp5fta/the_great_mouse_detective_workprint_sample/"
    },
    {
        "id": "1hp7eqn",
        "author": "LemonLate",
        "title": "Call Me By Your Name Ripped My Heart Out",
        "content": "***spoilers***\n\n\nI somehow never got around to watching this movie, and now I can’t function. There’s nothing more brutal or beautiful than the way Elio repeats, “Because I wanted you to know.”\n\nI’ve learned that love isn’t supposed to make sense. It’s not always easy. Sometimes it’s butterflies and other times it’s an overbearing feeling of the weight of the world. The cast replicating the perfect depiction of what love *feels* like despite it being nearly impossible to replicate is impressive. \n\nThis film encapsulates the journey of falling in love so well. Is it all worth it? Are the short, beautiful memories of looking at the person you’re in love with worth the hours of agonizing pain when you’re not around them? Is the obsesssion normal? Is it all worth it in the end?\n\nIn the end when Mr. Perlman notices how sad Elio is, and tells him that what he had with Oliver was a truly special friendship, and eludes that he knows it was more than just that. He tells Elio not to cut himself off from his feelings to not feel grief because then you lose the ability to feel the kind of joy he felt with Oliver. He tells him about how he came close, but never had the kind of connection that they had. Mr. Perlman says,\n\n\n“We rip out so much of ourselves to be cured of things faster, that we go bankrupt by the age of thirty. And have less to offer each time we start with someone new. But to make yourself feel nothing so as not to feel anything? What a waste.”\n\n\nThe universal understanding for so many queer people with those heart shattering sentences. Those whose lives have been dictated and are unable to pursue their natural instincts. Their ability to love has been restricted, threatened. The decades of generations who have wasted their lives out of fear from our deeply rooted homophobic society. ",
        "upvotes": 68,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1hp7eqn/call_me_by_your_name_ripped_my_heart_out/"
    },
    {
        "id": "1hprezm",
        "author": "timetravlrfromthepst",
        "title": "What was your favorite film score from this year?",
        "content": "Here's my list:\n\nDune 2:\n\n[Beginnings Are Such Delicate Times](https://www.youtube.com/watch?v=acSkvBrfluM&amp;list=OLAK5uy_n7XC2b7RGlYFwWtXrFrKoARDZScip1GpQ&amp;ab_channel=HansZimmer-Topic)\n\n[A Time of Quiet Between the Storms](https://www.youtube.com/watch?v=igtwOdqboT0&amp;ab_channel=WaterTowerMusic)\n\n[Worm Ride](https://www.youtube.com/watch?v=zzYPIuHi4fA&amp;ab_channel=WaterTowerMusic)\n\n[Arrival](https://www.youtube.com/watch?v=iPypPemhFls&amp;ab_channel=WaterTowerMusic)\n\n[Worm Army](https://www.youtube.com/watch?v=VkIWIe0BIeM&amp;ab_channel=WaterTowerMusic)\n\n[Kiss the Ring](https://www.youtube.com/watch?v=AkZBjK69VcE&amp;ab_channel=WaterTowerMusic)\n\nThe First Omen:\n\n[Tighten the Noose](https://www.youtube.com/watch?v=8gvOCUUygAc&amp;ab_channel=MarkKorven-Topic)\n\n[Ave Satani](https://www.youtube.com/watch?v=DK1O259-dQQ&amp;ab_channel=MarkKorven-Topic)\n\nChallengers:\n\n[The Signal](https://www.youtube.com/watch?v=OlaQfG9q-CE&amp;ab_channel=SonySoundtracksVEVO)\n\n[Challengers](https://www.youtube.com/watch?v=WhDfboK6JaQ&amp;ab_channel=SonySoundtracksVEVO)\n\n[Yeahx10](https://www.youtube.com/watch?v=vGWunN3494U&amp;ab_channel=SonySoundtracksVEVO)\n\n[Match Point](https://www.youtube.com/watch?v=63k6AfvLsso&amp;ab_channel=SonySoundtracksVEVO)\n\nThe Ministry of Ungentlemanly Warfare:\n\n[The Ministry of Ungentlemanly Warfare](https://www.youtube.com/watch?v=I9YA-ypObyA&amp;ab_channel=ChrisBenstead-Topic)\n\n[A Team of Misfits](https://www.youtube.com/watch?v=nLHDofvU5gA&amp;list=OLAK5uy_ltnCZktRxCOBUaqjvlpt4070-jFJ9pbQA&amp;ab_channel=ChrisBenstead-Topic)\n\n[Officers Fancy Dress](https://www.youtube.com/watch?v=e9kuvET1B6o&amp;list=OLAK5uy_ltnCZktRxCOBUaqjvlpt4070-jFJ9pbQA&amp;index=11&amp;ab_channel=ChrisBenstead-Topic)\n\n[Heron's Hop](https://www.youtube.com/watch?v=x8XAFaX9wNg&amp;list=OLAK5uy_ltnCZktRxCOBUaqjvlpt4070-jFJ9pbQA&amp;index=17&amp;ab_channel=ChrisBenstead-Topic)\n\n[Absconding With The Duquesa](https://www.youtube.com/watch?v=UL16gE10Clc&amp;list=OLAK5uy_ltnCZktRxCOBUaqjvlpt4070-jFJ9pbQA&amp;index=18&amp;ab_channel=ChrisBenstead-Topic)\n\nThe Fall Guy\n\n[Ball Biter](https://www.youtube.com/watch?v=Sx-BIABvC8A&amp;list=PLxA687tYuMWg3CYhTf-mANOVW0Gy6Wa0n&amp;index=12&amp;ab_channel=BackLotMusic)\n\nIF:\n\n[The IF Suite](https://www.youtube.com/watch?v=TGirO39Ml7Y&amp;ab_channel=SonySoundtracksVEVO)\n\nFuriosa\n\n[Dementus is Gaining](https://www.youtube.com/watch?v=BBFB8Oo4dBY&amp;ab_channel=WaterTowerMusic)\n\n[The Darkest of Gods](https://www.youtube.com/watch?v=TQNS9EiQSRQ&amp;ab_channel=WaterTowerMusic)\n\n[The Stowaway](https://www.youtube.com/watch?v=gEcGrgPKtrE&amp;ab_channel=WaterTowerMusic)\n\nInside Out 2:\n\n[Outside Intro](https://www.youtube.com/watch?v=7nfJX-pD4cM&amp;ab_channel=AndreaDatzman-Topic)\n\n[The Life of Riley](https://www.youtube.com/watch?v=o93R98ra428&amp;ab_channel=AndreaDatzman-Topic)\n\n[Glide and Joy](https://www.youtube.com/watch?v=uAF9pp-KmzY&amp;ab_channel=AndreaDatzman-Topic)\n\nDeadpool &amp; Wolverine:\n\n[Name for Myself](https://www.youtube.com/watch?v=c4WxxDdegok&amp;ab_channel=MarvelMusicVEVO)\n\n[Hideout](https://www.youtube.com/watch?v=it9biuW4TaI&amp;ab_channel=MarvelMusicVEVO)\n\n[I Called Some Friends](https://www.youtube.com/watch?v=Agq3ofNg4N8&amp;ab_channel=MarvelMusicVEVO)\n\nAlien Romulus:\n\n[He's Glitchy](https://www.youtube.com/watch?v=vaq-Nb3D8t8&amp;ab_channel=BenjaminWallfisch-Topic)\n\n[The Chrysalis](https://www.youtube.com/watch?v=RC9Rna4nrpw&amp;ab_channel=BenjaminWallfisch-Topic)\n\n[Run!](https://www.youtube.com/watch?v=VzknnmKlqR4&amp;ab_channel=BenjaminWallfisch-Topic)\n\nSaturday Night:\n\n[Saturday Night Live](https://www.youtube.com/watch?v=SZtKwjb0EuM&amp;ab_channel=JonBatiste-Topic)\n\n[Lorne on 50th St](https://www.youtube.com/watch?v=IbrLllEmdEs&amp;ab_channel=JonBatiste-Topic)\n\nGladiator II\n\n[Gladiator II Overture](https://www.youtube.com/watch?v=sQnnWpcv6p8&amp;ab_channel=HarryGregson-Williams-Topic)\n\n[The Dream is Lost](https://www.youtube.com/watch?v=Go49qt9kcp4&amp;ab_channel=HarryGregson-Williams-Topic)\n\n[Strength and Honor](https://www.youtube.com/watch?v=XHCLu1myAu4&amp;ab_channel=HarryGregson-Williams-Topic)\n\nBabygirl:\n\n[Mommy's Dollhouse](https://www.youtube.com/watch?v=JK9Y3rmavOI&amp;ab_channel=CristobalTapiaDeVeer-Topic)\n\n[Whatever You Tell Me To Do](https://www.youtube.com/watch?v=lTEGpU9GlmM&amp;ab_channel=CristobalTapiaDeVeer-Topic)\n\n[Wolves](https://www.youtube.com/watch?v=PiztIvOm-OQ&amp;ab_channel=CristobalTapiaDeVeer-Topic)\n\nNosferatu:\n\n[Increase thy Thunders](https://www.youtube.com/watch?v=z622Jp2aRmE&amp;ab_channel=RobinCarolan-Topic)\n\n[Goodbye](https://www.youtube.com/watch?v=203A3kEGyIg&amp;ab_channel=RobinCarolan-Topic)\n\n[A Carriage Awaits](https://www.youtube.com/watch?v=blWsUPk35Mk&amp;ab_channel=RobinCarolan-Topic)\n\n[Orlok's Shadow](https://www.youtube.com/watch?v=ckOcD2Ha8Uc&amp;list=PLnoIi4YKKKd-8m2M4zN51kTVif_-wV91O&amp;index=20&amp;ab_channel=BackLotMusic)\n\nThe Brutalist:\n\n[Overture-Bus](https://www.youtube.com/watch?v=zKU3Cq5uY4o&amp;ab_channel=SonySoundtracksVEVO)\n\n[Overture-Ship](https://www.youtube.com/watch?v=2olBDm1ekFQ&amp;ab_channel=SonySoundtracksVEVO)",
        "upvotes": 2,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MuafZIukCz5A27rN1qi_7TsOKkAziABKBnz5ehf5fXg.jpg?auto=webp&amp;s=0668d363b3aae0c741a6917cdbc1f0f689619a50"
        },
        "permalink": "/r/movies/comments/1hprezm/what_was_your_favorite_film_score_from_this_year/"
    },
    {
        "id": "1hpr9hk",
        "author": "hammnbubbly",
        "title": "The Instigators = The Last Detail/Out of Sight by way of Richard Linklater.",
        "content": "I know reviews for The Instigators weren’t great, and I can kind of see why. The trailers painted it as a wise cracking, action heavy heist movie. While there’s plenty of cracking wise and some pretty thrilling action set pieces, what I enjoyed as much (or more) was the relatively light feeling to the whole thing. The two main characters are in the middle of something very serious, yet their approach is one of naïveté and/or ambivalence. While I was watching and settling into the fact that the movie wasn’t exactly what the trailers advertised, I was reminded of The Last Detail or Out of Sight - both movies where characters find themselves in serious situations at various times and their responses are humorous and/or blunt and/or confused all while still being a thrilling experience. At times, the movie also had a bit of a free flowing/stream of consciousness feel like some of Linklater’s work.\n\n\nI know the reviews (as well as many of you) likely wouldn’t agree, but I thoroughly enjoyed The Instigators.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hpr9hk/the_instigators_the_last_detailout_of_sight_by/"
    },
    {
        "id": "1hpnx4j",
        "author": "ewok989",
        "title": "Robbie Williams - Better Man",
        "content": "Went into this movie with low expectations and ended up really impressed.\n\nBasically, it's the story of Robbie Williams but he is replaced with a CGI ape. At first, it looks like it will be an annoying gimmick but somehow it works. In some ways, it's even less distracting than an actor who looks a bit like Robbie but isn't him.\n\nWhat does the ape signify? Is it that entertainers are performing monkeys? For me at least, my takeway was that firstly, as Robbie Williams the mega star he is different to everyone around him. He took risks they didn't take and achieved things they never did. In this sense, pop stars are indeed like another species or a variation on us regular folk. Either this is true or just the way I see pop stars, but that's what made the CGI ape less jarring for me. \n\nIt also might be an unintentional critique on the similarity of all these biopics (they're all loners who get rejected and find success and then turn to drugs and then go to rehab). In having an ape play Robbie removes a lot of his individual quirks, emphasizing that he's just another guy going through this story arc we've all seen before. The ape both dehumanizes the subject but due to the originality of the idea make it more unique than any other biopic at the same time. Somehow, it works.\n\nOne thing I really enjoyed was the use of music. Not only were the dance montages thrilling but many of the songs thesmelves were remixed to have different sections or mixing of volume/drums or even complete reimaginings (in the case of 'Better Man) that make you as a fan of Robbie feel like you are re-experiencing his ouvre again. The most exciting segment was the Take That scene in London to Rock DJ. It capure the youth and optimism and excitement of this point of his life and career.\n\nThe use of music takes inspiration from 'Rocket Man' in that this isn't like Bohemian Rhapsody - showing how certain songs came up in chronological order and made an impact. Instead, the emotional core of the songs is linked to various moments on Robbie's life, sometimes the song is linked to a time far earlier than when it was written or recorded. This works because it gets to the core of the emotional root of the songs rather than just biographical detailings of the writing process.\n\nAs a child of the 90s myself, it was enjoyable seeing all these figures - from Oasis to All Saints to Gary Barlow - appear in various forms. Often, they just cariactures but all have their moments. Even though love interest Nicole Appleton is not on screen for long you can see the raw chemistry they have followed by a particularly dazzling dance number.\n\nHowever, the emotional core of the movie is family. Starting with Robbie's dad as nightclub performer inspiration and then his supportive mother and grandmother. There were numerous moments where I had tears streaming down my face as these early childhood connections are severed (either through death or disconnect) later in life and the various attempts at reconnection can't help but make me (and I assume others) reflect on their own family dynamics. \n\nFor me, it's the importance placed on family that put this above 'Rocket Man' and 'Bohemian Rhapsody' as it give the movie a heart transcending the superstar rise and fall arc. Despite the ape, this is all too human.\n\n",
        "upvotes": 4,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1hpnx4j/robbie_williams_better_man/"
    },
    {
        "id": "1hoq8wt",
        "author": "BearBearChooey",
        "title": "I forgot how great the 2000s comedies were ",
        "content": "I’ve been spending some of my time off around the holidays watching some 2000s comedies. Old school, Wedding Crashers, Dodgeball, Talladega Nights. Man they were all so good. Maybe it’s just the nostalgia in me, but I still laugh everytime I watch these and enjoy them so much on rewatch. \n\nWhat are some of your favorite 2000s comedies? ",
        "upvotes": 876,
        "comments": 386,
        "media": null,
        "permalink": "/r/movies/comments/1hoq8wt/i_forgot_how_great_the_2000s_comedies_were/"
    },
    {
        "id": "1hphsnk",
        "author": "Newboy001871",
        "title": "BlacKKKlansman (2018) has an AMAZING soundtrack",
        "content": "I just watched BlacKKKlansman for the first time the other day and thought it was a funny movie with a decent plot and message, but boy oh boy was the soundtrack AMAZING. I was getting eargasms the whole time watching that movie. Whenever the main theme would come on or Ron's theme I would get literal chills. That style of music with the electric guitar sounds sooo freaking good! If you haven't watched it I would recommend watching it just for the music. But if you'd rather not then at least go give it a listen on spotify. Terence Blanchard is a music genius I swear.",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1hphsnk/blackkklansman_2018_has_an_amazing_soundtrack/"
    }
]