[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 15,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pdkhjy",
        "author": "Wayman52",
        "title": "Netflix is removing Lost, Supernatural and The 100 all in one month.",
        "content": "This is ridiculous, there's so much slop on this site now, maybe 1 in 10 shows (and that's being generous) is actually watchable, and they continually get rid of beloved movies and shows. They cancel good Netflix originals or just quietly never giving them a second season, why does anyone keep their subscription? ",
        "upvotes": 65,
        "comments": 79,
        "media": null,
        "permalink": "/r/netflix/comments/1pdkhjy/netflix_is_removing_lost_supernatural_and_the_100/"
    },
    {
        "id": "1pden8k",
        "author": "brysonboompaul",
        "title": "Kalenna Harper Claims Diddy Was Awake 14 Days On Cocaine In Netflix Doc",
        "content": "",
        "upvotes": 25,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1pden8k/kalenna_harper_claims_diddy_was_awake_14_days_on/"
    },
    {
        "id": "1pdclni",
        "author": "dailymail",
        "title": "Love Is Blind's Alexa and Brennon Lemieux announce they are divorcing after four years of marriage and just one year after welcoming their daughter",
        "content": "",
        "upvotes": 29,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1pdclni/love_is_blinds_alexa_and_brennon_lemieux_announce/"
    },
    {
        "id": "1pd5cy5",
        "author": "ohsoyouhunnii",
        "title": "The Beast in Me",
        "content": "I'm sitting here watching episode 6 &amp; I have been so annoyed at this show since the beginning &amp; am finally feeling the urge to tell someone. \n\nWhy am I annoyed might you ask? 1. because its such a slow burner &amp; 2. Aggie DOES NOT KNOW HOW TO SAY NO TO NILE. Its annoying as hell. Then the faces she makes, the stuttering every time she speaks to him—I'm aware that its acting but she is so bad &amp; needs to tell his weird ass NO. \n\n😆 I just needed to rant!",
        "upvotes": 67,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1pd5cy5/the_beast_in_me/"
    },
    {
        "id": "1pdeo6y",
        "author": "brysonboompaul",
        "title": "Gigolo Recalls Diddy Beating Up Cassie During Sex In New Netflix Doc",
        "content": "",
        "upvotes": 19,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pdeo6y/gigolo_recalls_diddy_beating_up_cassie_during_sex/"
    },
    {
        "id": "1pd6pbo",
        "author": "JelliBabySkyyy",
        "title": "Sean Combs: The Jury",
        "content": "In my country, we don't use the jury system. Watching the interviews with the jury members really shocked me. They seemed so chuffed in their interviews. I was losing my mind!\nIs this normal? For people in jury system countries, are you guys comfortable putting your life in the hands of randos that didn't go to law school and are exposed to uneducated tik tok opinions?",
        "upvotes": 29,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1pd6pbo/sean_combs_the_jury/"
    },
    {
        "id": "1pclmvl",
        "author": "BurgerNugget12",
        "title": "‘Stranger Things 5’ Opens With 59.6 Million Views, Netflix’s Biggest English-Language TV Debut Ever",
        "content": "",
        "upvotes": 639,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1pclmvl/stranger_things_5_opens_with_596_million_views/"
    },
    {
        "id": "1pddrf7",
        "author": "Mucek121",
        "title": "What to watch next After Life or The Crown or House of Cards or Behind Her Eyes",
        "content": "My Mom looking to watch next show\n\nwhat should she watch next\n\nHow good are this shows ?\n\nAfter Life\n\nThe Crown\n\nHouse of Cards\n\nBehind Her Eyes\n\nor any other recommand\n\nThank you for answer",
        "upvotes": 10,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1pddrf7/what_to_watch_next_after_life_or_the_crown_or/"
    },
    {
        "id": "1pctv6n",
        "author": "Glad-Ad-6240",
        "title": "sean combs the reckoning",
        "content": "This doc was put together so well. What really gets me is how he got so huge without much talent, just by attaching himself to other people’s success. Diddy has harmed a lot of people, but the part that blew my mind was the evidence pointing toward his involvement with Pac’s death. I honestly think he had something to do with both Biggie and Pac’s death and was jealous of both him and Biggie, like he created this whole “beef” to get rid of them. A 50-month sentence isn’t long enough.\n",
        "upvotes": 175,
        "comments": 73,
        "media": null,
        "permalink": "/r/netflix/comments/1pctv6n/sean_combs_the_reckoning/"
    },
    {
        "id": "1pcw8wa",
        "author": "YaNiBBa",
        "title": "Wolf of Wall Street is censored now?",
        "content": "So Wolf of Wall Street is back on Netflix and I decided to watch it, yet again. But this time for whatever reason, it's censored with blurred out genitals which I've never seen on Netflix, especially when it wasn't censored before.",
        "upvotes": 106,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1pcw8wa/wolf_of_wall_street_is_censored_now/"
    },
    {
        "id": "1pdkqco",
        "author": "lifesyndrom",
        "title": "Am I the only one who can’t stand Shelley in The beast in me (mini-series)",
        "content": "So far I’m halfway through the show \n\n\n\nLike I get her frustration but she’s doing too much (and I’m not saying Aggie is perfect or anything) \n\n\n\nLike the way she’s judging Aggie about that guy who killed their son (forgot his name) how tf does she expect Aggie to move on ON TOP of the guy not getting any prison time????? I wouldn’t rest if someone recklessly killed my child via drunk driving and didn’t get any type of punishment. and he had the audacity to come to his grave…..I would’ve lost it \n\n\n\nAnd then she tries to blame Aggie for his “death” is beyond wild. I understand she moved on  but expecting Aggie to move on as easily as she did is crazy \n\n\nAnd when she got offered the gallery opportunity, I didn’t recall her calling Aggie to thank her…but when she lost it, she was so quick to call her and blame her. It’s like she’s only focusing on the bad things.\n\n\n\nOnce again I get her frustration in general but she’s doing too much in my opinion ",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pdkqco/am_i_the_only_one_who_cant_stand_shelley_in_the/"
    },
    {
        "id": "1pdfc3k",
        "author": "tomaz1989",
        "title": "What are the best shows to binge and finish?",
        "content": "I’ve noticed I would start on a show, stop, &amp; start on another one. I need a show that i won’t get bored of &amp; can watch it until it’s finished \n\nthanks",
        "upvotes": 5,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1pdfc3k/what_are_the_best_shows_to_binge_and_finish/"
    },
    {
        "id": "1pczyi7",
        "author": "huffpostuk",
        "title": "Netflix Defends Sean Combs Documentary After Diddy Brands Series 'Shameful'",
        "content": "",
        "upvotes": 31,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1pczyi7/netflix_defends_sean_combs_documentary_after/"
    },
    {
        "id": "1pdn4kh",
        "author": "Nichiw4",
        "title": "Issue with their new game",
        "content": "Having an issue with the Red Dead Redemption game, it keeps asking me to download the same 3.7GB of resources at the start, I have done so for about 3-4 times now and it almost always happens when I open the game ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pdn4kh/issue_with_their_new_game/"
    },
    {
        "id": "1pdmvmx",
        "author": "Exotic-Internet-5470",
        "title": "Audio Issues, Audio gets better while playing game?",
        "content": "I’m having this problem with Netflix again where when I play the audio it sounds fine when it’s in MiniPlayer and in a game like wuthering waves but when I go full screen in Netflix the audio is noticeably worse. When it’s in MiniPlayer and in the game the sound is nice and feels like it’s around me. I’m using an iPad and AirPods btw.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pdmvmx/audio_issues_audio_gets_better_while_playing_game/"
    },
    {
        "id": "1pdmryk",
        "author": "ChemistryKind3948",
        "title": "show recommendations",
        "content": "hi! i really enjoy shows on netflix but i can’t seem to find anything that really interest me! i like reality tv, fantasy, drama, etc. are there any shows similar to gossip girl, selling OC or just any shows over 3 seasons that you would recommend? \n\nthey don’t have to be anything like the ones mentioned just something you think other people would enjoy and should watch! ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pdmryk/show_recommendations/"
    },
    {
        "id": "1pdm0ny",
        "author": "Kkimp1955",
        "title": "Grantchester",
        "content": "Why are all of the closed captions from the 1st episode.. I would love to watch it.. but I am old and my hearing is not great.. especially with accents.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pdm0ny/grantchester/"
    },
    {
        "id": "1pdjwfx",
        "author": "MulchImpression081",
        "title": "Netflix Pricing Update Survey",
        "content": "Sorry to bother you, I'm a grad school student at Georgetown and I built a survey discussing different pricing options for Netflix.\n\nIf you have time, please check it out. Thanks! [https://forms.gle/SQ3qKGLER1FyVt8o6](https://forms.gle/SQ3qKGLER1FyVt8o6)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pdjwfx/netflix_pricing_update_survey/"
    },
    {
        "id": "1pdjj7l",
        "author": "unboxthemessage",
        "title": "What is the answer?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pdjj7l/what_is_the_answer/"
    },
    {
        "id": "1pcu3uc",
        "author": "michelob81",
        "title": "Sean Combs the reckoning",
        "content": "Fantastic watch but surely 4 years in prison can't be the end of the story! The female jury member came across like she'd been on an interview for Pop idol instead of a court case. Puffy appeared to be demonic and should have received at another 2 years for his fixation with baby oil alone.",
        "upvotes": 33,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1pcu3uc/sean_combs_the_reckoning/"
    },
    {
        "id": "1pcdorr",
        "author": "SaberNoble47",
        "title": "The Matt Rife Xmas auto-play trailer ruins Santa in its immediate first second of dialog (US) upon entering the Netflix menu",
        "content": "Look I get it, there’s custom settings, you can turn off the auto-play trailers, you can mute, you can have kid friendly user accounts that won’t play more mature content but for the most part I don’t give a sh*t about that, my little kids don’t care and aren’t paying attention. Yes this one is ultimately on me, but I feel like  you turn Netflix on and IMMEDIATELY the auto trailer is that comedian sitting in a chair and he blurts out “it was hard when you find out your parents are Santa clause” and it’s loud and crisp and you’re just in the opening menu without navigating anywhere I think it’s a jerkoff move. Also that guy sucks. ",
        "upvotes": 239,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1pcdorr/the_matt_rife_xmas_autoplay_trailer_ruins_santa/"
    },
    {
        "id": "1pdi5ut",
        "author": "a_san_38",
        "title": "Belle Gibson tops this list thanks to Netflix's 'Apple Cider Vinegar'",
        "content": "",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pdi5ut/belle_gibson_tops_this_list_thanks_to_netflixs/"
    },
    {
        "id": "1pdg4cj",
        "author": "Satchisee",
        "title": "Screen Mirror Question",
        "content": "I'm using the ad supported subscription in Canada. Lately the Netflix app on my TV is giving me trouble, so while I fix it (I've already tried solutions like deleting the app and reinstalling it, and Netflix support sent me few more that I need to try), I decided to open Netflix on my browser on Mac and use Apple mirror to watch Netflix. I learnt quickly that on ad supported tier that's not possible.  \n\nI'm willing to change the plan to higher one, if it guarantees screen mirroring. Does anyone know if it's supported in the higher tier? I don't know want to upgrade and then be faced with the dreaded black screen again.",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pdg4cj/screen_mirror_question/"
    },
    {
        "id": "1pd9j83",
        "author": "updatemonger",
        "title": "Why can’t I download the app?(iPhone)",
        "content": "I’d add a screenshot, but I can’t post pictures. Whenever I try to download the app, I keep getting a “Verification Required” message, telling me I need to sign in to view my billing info. When I hit continue, I add my card, and it says my payment method failed. \n\nWhat am I supposed to be paying for here? I already have a Netflix account, I just want to download the app, which should be free, right? Any answers appreciated.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pd9j83/why_cant_i_download_the_appiphone/"
    },
    {
        "id": "1pd82ph",
        "author": "YippyYeti",
        "title": "What does this error code mean?",
        "content": "Can’t log in on my phone at all. When it doesn’t provide this error code, it says network error. \n\nThe code is this: \"The operation couldn’t be completed. (MSL error 5403 - HTTP error: 403 - forbidden)\"\n\nMy network connection is fine though. Anyone else encounter this?\n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pd82ph/what_does_this_error_code_mean/"
    },
    {
        "id": "1pdd5ud",
        "author": "Next-Area6808",
        "title": "Any feedback on this presentation I created on stranger things?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pdd5ud/any_feedback_on_this_presentation_i_created_on/"
    },
    {
        "id": "1pd6ul7",
        "author": "harpreetthind",
        "title": "Movie or TV show suggestions",
        "content": "Yesterday I got done watching the haunting of Bly Manor. Does anybody know any other shows similar to it? Thanks. Let me know in the comments what you guys would recommend or recommendations are appreciated.",
        "upvotes": 2,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1pd6ul7/movie_or_tv_show_suggestions/"
    },
    {
        "id": "1pcakae",
        "author": "businessinsider",
        "title": "Netflix show developer to stand trial for $11 million spending spree, including 5 Rolls-Royces, $638,000 in mattresses",
        "content": "",
        "upvotes": 156,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1pcakae/netflix_show_developer_to_stand_trial_for_11/"
    }
]