[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 98,
        "comments": 304,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mllxlr",
        "author": "Legitimate_Ad3625",
        "title": "As Stephen Colbert Signs Off For Summer Hiatus, He Says: “Netflix, Call Me I’m Available In June”",
        "content": "",
        "upvotes": 80,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1mllxlr/as_stephen_colbert_signs_off_for_summer_hiatus_he/"
    },
    {
        "id": "1mlelak",
        "author": "Narrow_Tomorrow_7971",
        "title": "just finished apple cider vinegar",
        "content": "okay wait i need someone to talk to about this show. i had personally never heard of belle gibson (im american and not really into the health side and i was in middle school when all that happened) but i was instantly hooked. and idk i have a couple things. i do feel sympathetic for belle because its obvious she never really got love in her life and no one deserves that, but the way she went about finding it is insane. the fact that clive stayed with her when the whole time i was like babe youre too cute for this please leave her. and millas whole arc was insane and i really enjoyed this show overall and would love to hear everyones thoughts &lt;3",
        "upvotes": 41,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1mlelak/just_finished_apple_cider_vinegar/"
    },
    {
        "id": "1mlmo7a",
        "author": "ysleez",
        "title": "Unbelievable- Netflix mini series, most underrated true crime series",
        "content": "If you love shows like Mindhunter, slow paced true crime show with a lot of emotions, I'm sure you'll love this. The story really gets you to feel how upset and helpless Marie (Kaitlyn Dever) gets and it's a great performance by her as well. But you have to hold your patience, there's some unnecessary stuff tho.",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mlmo7a/unbelievable_netflix_mini_series_most_underrated/"
    },
    {
        "id": "1mltu2p",
        "author": "skylarkills69",
        "title": "the show “secrets we keep”",
        "content": "Dude this was so crazy and shocking, then i watched the glass dome and was more shocked. \nThese shoes are binge worthy. I was hooked on my tv screen for a while, the plot twists and jumpscares were intense. \n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mltu2p/the_show_secrets_we_keep/"
    },
    {
        "id": "1mlsari",
        "author": "crosstheroom",
        "title": "Does Sandman Season 2 get any better?",
        "content": "So far I'm trying to force myself thru episode 3 but so far all the episodes have had long stretches of boredom so it takes a few days to watch each one\n\nI'm about to give up, does it get better. \n\nEven in Season 1 the Diner Episode moved too slow, at least in the end it paid off.  ",
        "upvotes": 3,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1mlsari/does_sandman_season_2_get_any_better/"
    },
    {
        "id": "1ml07rs",
        "author": "Anxious_Cricket_1835",
        "title": "Been watching Mr. Robot and now I’m paranoid as hell about my personal info",
        "content": "I just finished watching season 1 of Mr Robot and it's great, no one warned me it's a horror series in disguise lol. I know it’s a TV show but damn watching Mr. Robot has me questioning everything. The way they gather people’s data, hack accounts, clone phones it’s way too realistic.  \n  \nNow I’m just sitting here thinking about how much of my info is floating around considering I've had the same phone number and email for years, signed up for hundreds of sites probably and no clue where half that data ended up. You hear of data breaches as well and it feels like anyone with enough motivation could piece together my whole life.  \n  \nLowkey freaking out about it lol.",
        "upvotes": 197,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1ml07rs/been_watching_mr_robot_and_now_im_paranoid_as/"
    },
    {
        "id": "1mkz2o0",
        "author": "wildhawk642",
        "title": "Half Season Releases Are Awful",
        "content": "I really can’t stand these half season releases - I’d so much rather it either be week by week or the full season at a time.  With these half season releases I’m just going to wait until the full season is out and avoid discussions of the first half as best I can, which I think defeats their goal of trying to make series be in the spotlight longer. Either way, between this and their show cancellation decisions, it seems like Netflix figures out the worst thing they could do and then do that thing. ",
        "upvotes": 194,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1mkz2o0/half_season_releases_are_awful/"
    },
    {
        "id": "1mlt8ay",
        "author": "rigellus",
        "title": "Am I the only one that uses two networks?",
        "content": "So just spent an hour on support with Netflix, and apparently, with Network Household, I have to have all devices on the same network. All of my streaming devices, which I kept on the guest network, no longer work due to my computer and my wife's iPad using Netflix on my regular wireless. And they directly told me that all devices have to be on one network or the other. Kinda sucks, since I'll probably just stop watching on my computer, but if I put the iPad on the guest network it kills a bunch of connectivity I set up for my wife for playing on the Mac for file sharing and image generation. Confirmed with Netflix.",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mlt8ay/am_i_the_only_one_that_uses_two_networks/"
    },
    {
        "id": "1mlsi87",
        "author": "mrchase434",
        "title": "How to fix missing audio in Kpop Demon Hunters?",
        "content": "I just started the Kpop Demon Hunters movie and already 2 minutes in there's a lot of voice lines that just straight up aren't playing. The background music, sound effects, and subtitles are all working fine, the characters lips are moving, I just can't hear certain voice lines. How do I fix this?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mlsi87/how_to_fix_missing_audio_in_kpop_demon_hunters/"
    },
    {
        "id": "1mlm2pa",
        "author": "Extra_Put7162",
        "title": "Help me find this show",
        "content": "I waa watching a vlog and saw that youtuber is watching this Netflix series/youtuber. I screen shotted that part of the video. Can y'all help me find what series/show is this? \n",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mlm2pa/help_me_find_this_show/"
    },
    {
        "id": "1mloyoq",
        "author": "refdeser",
        "title": "Stolen : Heist of the Century",
        "content": "Just finished watching, this is exactly how I imagine a vault robbery would play out in real life. Kudos to the police officers for catching the criminals and following every clue they left behind.\n\n**spoiler**\n\nI believe this could have been the perfect crime if they had handled the rubbish differently by burning it all, so the police couldn’t follow their trail. But it happened the way it did, so all the time spent planning the robbery ended up going to waste, I guess.\n\nAt the end, Leonardo Notarbartolo still insists that he wasn’t the mastermind of the crime, but just one of the gang. What’s your opinion on this? Was he really just following the gang’s lead, or was he actually the one in charge? I still believe he’s a genius for hiding the fact that he was the mastermind. \n\nWhat happened to Agim, the police officer, in 2015, when he was found in possession of illicit diamonds is truly devastating. I believe he fell in with the wrong crowd and got caught red-handed. I hope he’s living a better life now.\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mloyoq/stolen_heist_of_the_century/"
    },
    {
        "id": "1mln5xa",
        "author": "Disastrous_Flight969",
        "title": "Binge watching weekend #bingewatching",
        "content": "Looking for some new shows to binge. I have pretty much all streaming apps. I loved Pieces of Her, All Rise, The Good Wife, Blindspot, Fire Country and Reacher. #bingewatching #beapal",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mln5xa/binge_watching_weekend_bingewatching/"
    },
    {
        "id": "1mltxo1",
        "author": "HoneyMoonPotWow",
        "title": "A show where the MALE main character or some other frequently appearing character wears very tight skinny jeans?",
        "content": "Hey guys. Don’t ask for an explanation lol! For an essay I need to analyze movies or shows where men wear very tight skinny jeans like these:  \n[https://de.pinterest.com/pin/561050066102658431/](https://de.pinterest.com/pin/561050066102658431/)  \nThey were in fashion about 10 years ago or so. I need male characters, no female ones. It doesn’t matter if it’s a series or a movie. Thank you so much! I literally can’t think of a single one, and it’s really hard to search for. 😭",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mltxo1/a_show_where_the_male_main_character_or_some/"
    },
    {
        "id": "1mlmd2l",
        "author": "Babkat",
        "title": "Video Freezes but Audio continues",
        "content": "I found old threads with this issue but zero solutions. The internet is no help either. Everything blames it on bad luck or internet issues.\n\nSeems to happen to me immediately after going to next episode. Any slight hiccup seems to cause it. Only way to fix it is to back out of the episode and resume the episode again. It's running on my second monitor. Not sure if it's a netflix issue or something on the computer side of things.\n\non PC. Specs are near top of the line. Netflix app from Microsoft Store.\n\nEdit: I seem to have found a fix. Disabled graphics acceleration in Microsoft Edge (which is what the netflix app is technically running)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mlmd2l/video_freezes_but_audio_continues/"
    },
    {
        "id": "1mlm2x5",
        "author": "Jkwaks",
        "title": "How do I pay monthly each time?",
        "content": "To give a context I’ve been paying automatically for Netflix monthly with my CC. But recently I switched to a CC which uses Diners Club and I’m not able to put my card for recurring payments. So I read somewhere that Diners do not support recurring payments. So how do I pay each month without having to put card down for automatic payments. Thank you ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mlm2x5/how_do_i_pay_monthly_each_time/"
    },
    {
        "id": "1mlloa0",
        "author": "Stup_08",
        "title": "Can Netflix game still be played even after end of subscription",
        "content": "Can I still have the paid Netflix games on my phone even after the subscription on Netflix end? Or the app is deleted/signout or anything will the game still run as is used to?",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mlloa0/can_netflix_game_still_be_played_even_after_end/"
    },
    {
        "id": "1mkyq0z",
        "author": "AltruisticAide9776",
        "title": "Has anyone started Wednesday season 2 and is finding it boring?",
        "content": "I found season 1 a bit of a drag too , it just doesn't compel you. At least if they had kept Xavier there would be something i d be curious about but as it the episode gelt a bit longer than it needed to be.",
        "upvotes": 23,
        "comments": 47,
        "media": null,
        "permalink": "/r/netflix/comments/1mkyq0z/has_anyone_started_wednesday_season_2_and_is/"
    },
    {
        "id": "1mlqoq4",
        "author": "Think_Lime3219",
        "title": "Help with restarting my membership",
        "content": "I had my mobile account one month back. I had set up the Autopay with Google pay UPI. Then I no longer needed the membership so I stopped the Autopay on Google pay. So netflix was not able to process the payment and my account was put on hold. Now after almost a month, I want to watch one series and hence want to restart the membership. But I am not able to do it. When I tried to update my payment method, it should this error -\"Sorry, unable to process your request. Please try again later.\" Then after trying multiple time with multiple devices, I contacted the customer support and chatted with one of their assistant. They then suggested me to delete my account and then recover it. So I followed it. But when I tried to restart my account, it shows same issue on the choose the plan page. Now, I am stuck and the customer assistant didn't also know the solution. So if there's anybody out there who has faced same issue and found any solution to this then please help me.\n\nI have attached the screenshots for the reference.\n",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1mlqoq4/help_with_restarting_my_membership/"
    },
    {
        "id": "1mlg2yl",
        "author": "Lonely_Holiday9034",
        "title": "One taste",
        "content": "Okay so I know this is an old documentary but I just watched it and holy shit, I feel absolutely horrible for these women that were basically told domestic violence is welcomed and then gaslight them when they were obviously upset. This woman is insane and I hope she rots!!! She needs such extensive counseling and is obviously very mentally ill and controlling. Has anyone else seen it?! ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mlg2yl/one_taste/"
    },
    {
        "id": "1mky48e",
        "author": "graemeisverytired",
        "title": "The K-pop in KPop Demon Hunters was added at the end to give it spectacle but became the \"spine\" of the Netflix hit",
        "content": "Despite being something that was a relatively late addition to the core idea, it was the K-pop angle that helped bring Maggie’s directing and writing partner, Chris Appelhans, onto the project. “I also grew up as a musician, and I love music as much as I love film, and I always wanted to find a project that had a justification for using music as the spine in not a Disney musical way. As soon as Maggie told me about this, I’m like, ‘This is the one.’”\n\nMore: [https://www.thepopverse.com/movies-kpop-demon-hunters-netflix-music-added-last-k-pop-interview](https://www.thepopverse.com/movies-kpop-demon-hunters-netflix-music-added-last-k-pop-interview)",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mky48e/the_kpop_in_kpop_demon_hunters_was_added_at_the/"
    },
    {
        "id": "1mlf6le",
        "author": "Anonoso",
        "title": "3D effects?",
        "content": "So I opened Netflix and saw that it recommended \"Vampire Knight\" to me. I saw that it had a sort of 3D effect to it where it would pop out in layers. Is that the norm for that or is that something Netflix is doing now for certain TVs or something?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mlf6le/3d_effects/"
    },
    {
        "id": "1mlemw4",
        "author": "bate4her2master",
        "title": "Pausing to read",
        "content": "Hey, just was watching a show &amp; I’m not sure if this is just because I have the cheapest version of Netflix (ads included now), but, anyone else try to pause a show to read something like a letter/note/document &amp; an ad pops up within seconds so you don’t have the time to read it? \n\nI know I used to be able to. \n\nIt’s just really annoying lol. \n\nI’m probably the annoying one wanting to pause and read shit that doesn’t even need to be read but, idk.\n\nTysm for reading if you did. Bye xo",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mlemw4/pausing_to_read/"
    },
    {
        "id": "1mle8ho",
        "author": "rickros123456",
        "title": "2 things I just watched thirteen and who wants to talk about it.",
        "content": "Ok so I just watched thirteen an wow I’m speechless just from the deeper she goes the colors change and just all the stuff she is doing. It’s just crazy to me that’s it also kinda based on Evie’s actor actually like. If your down to talk about the movie just comment. But man towards the ending I almost started crying I don’t why but I did.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mle8ho/2_things_i_just_watched_thirteen_and_who_wants_to/"
    },
    {
        "id": "1ml961a",
        "author": "OkPainter6232",
        "title": "If Trainwreck gets another season what topics would you like to see get covered?",
        "content": "For me personally I'd LOVE to see them tackle \"Crazy Eddie\" as everything about that story is just nuts and i'm amazed nobody's done a feature length documentary on it yet.\n\nAlso that one time in the 80s where they had people release hundreds of balloons at once which proved to be a disaster and led to some people getting killed.\n\nJoe Millionaire also comes to mind.\n\nAlso Stephen Glass, nuff said.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ml961a/if_trainwreck_gets_another_season_what_topics/"
    },
    {
        "id": "1mlnk1x",
        "author": "1c2shk",
        "title": "Amy Lynn Bradley doc was lame and biased in favor of ridiculous trafficking theory.  There is no chance Amy Lynn Bradley was trafficked because you'll have to believe in this long string of unlikely events...",
        "content": "You'd have to believe in all or almost all of the following:\n\n* You have to believe Amy, after a few days on a cruise, would throw away her college degree and go for a sexy career change in a foreign country she's never been to.\n* You have to believe this team of trafficker would partner with Amy, someone they barely know, in an elaborate transnational crime.  Would they trust a stranger that much?\n* You have to believe traffickers would risk putting her in a container and smuggling her off the ship without fear of detection and confident no CCTV or witnesses would see their activities.\n* You have to believe Amy would agree to being put into an uncomfortable container for an unknown duration by people she barely knew.  It'd be far easier to just walk off the ship with family and then ditch the family.\n* You have to believe that after 20+ years, no one in the team of traffickers is interested in collecting a large reward, equal to several year's salary of someone living in Curacao.\n* The bar/brothel must have other employees and sex workers.  After 20+ years, you have to believe none of these people are interested in collecting a large reward either.\n* You have to believe Amy has no interest in ever leaving Curacao, which would blow her cover.  She's effectively stranded on a small island.\n* You have to believe traffickers are dumb enough to put Amy’s photos onto a public prostitution website despite an international search for her.\n* You have to believe Amy doesn't leave the bar/brothel much.  Despite global news coverage, there are very few who've claimed to see her in Curacao.\n* You have to believe the traffickers are bold enough to have her work in a bar/brothel frequented by Westerners and not fear a customer would recognize her.\n* You have to believe the traffickers are bold enough to have her work in a bar/brothel in an area crawling with police, FBI and amateur crime sleuths looking for her.\n* You have to believe Amy would hold a grudge against family for over 20 years and not reach out.\n* You have to believe that after a few years, Amy would not miss anything about life in America or her friends there and want to return.\n\nAll this really strains the credibility of the trafficking theory.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1mlnk1x/amy_lynn_bradley_doc_was_lame_and_biased_in_favor/"
    },
    {
        "id": "1mldf9x",
        "author": "Bulky-Weakness-5445",
        "title": "Game recs",
        "content": "hey guys, looking for game recs on console-like games that are well known on other consoles and would have to be paid for otherwise. looked into sonic mania plus and dead cells, what others? wanted to get hades but got deleted :(cthanks!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mldf9x/game_recs/"
    },
    {
        "id": "1mkuaz7",
        "author": "aaaaaaarrrrrcccccc",
        "title": "Suggest some series",
        "content": "Suggest something that is similar to stranger things or Wednesday I also liked the vampire diaries, outer banks, chilling adventures of sabrina and the umbrella academy.\nI like something mysterious, Sci-fi \nSomething like that idk",
        "upvotes": 7,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1mkuaz7/suggest_some_series/"
    },
    {
        "id": "1mkng3z",
        "author": "MoneyLibrarian9032",
        "title": "Michael Bay Exits Netflix’s Will Smith Action Film ‘Fast and Loose’",
        "content": "",
        "upvotes": 23,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mkng3z/michael_bay_exits_netflixs_will_smith_action_film/"
    },
    {
        "id": "1ml4qp5",
        "author": "hoopheid",
        "title": "Netflix said to be in talks for MLB Home Run Derby, possibly additional content too",
        "content": "The Red Sox documentary series and the other baseball stuff like The Turnaround, The Comeback etc have been awesome. Live games and big events like this would be another cool addition, if it happens.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ml4qp5/netflix_said_to_be_in_talks_for_mlb_home_run/"
    },
    {
        "id": "1mla390",
        "author": "Kdubhutch",
        "title": "When will Josh Johnson get a comedy special?",
        "content": "I’ve been watching him for about a year now on YouTube and the Daily Show. I think he needs a Netflix Special. When he called a public bus “the people’s limousine” I almost spat out my coffee laughing so hard. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mla390/when_will_josh_johnson_get_a_comedy_special/"
    }
]