[
    {
        "id": "1k49ucs",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 13,
        "comments": 1457,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k49ucs/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1k6o2t4",
        "author": "[deleted]",
        "title": "Before you blame Carlo for this year, please watch this",
        "content": "",
        "upvotes": 1248,
        "comments": 76,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dfevm1u75rwe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k6o2t4/before_you_blame_carlo_for_this_year_please_watch/"
    },
    {
        "id": "1k6q189",
        "author": "Charybd1ss",
        "title": "[The Athletic] Vinicius Jr’s entourage strongly deny that a new contract is close and insist that the ball is in Madrid’s court. The forward wants a package of around €30m per year that is in the region of the highest ever at the club, which was given to Cristiano Ronaldo.",
        "content": "",
        "upvotes": 302,
        "comments": 273,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1qREV07urm8JP3sxWHweEtyCF2N--GvUj__HbSlVr-k.jpeg?auto=webp&amp;s=b92cc4f5cbd89467272b85af5274f8c75fe650c5"
        },
        "permalink": "/r/realmadrid/comments/1k6q189/the_athletic_vinicius_jrs_entourage_strongly_deny/"
    },
    {
        "id": "1k6ods6",
        "author": "Sl_PROXY",
        "title": "[Parte médico] Eduardo Camavinga has been diagnosed with a complete tear of his left adductor tendon.",
        "content": "",
        "upvotes": 239,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4Zi0mI0v73EJmHIlWbfMqlHxLRsIoY-o32oej3ZXmgY.jpg?auto=webp&amp;s=0891e8870e335090d2fd54d1b59c5784bb406ee8"
        },
        "permalink": "/r/realmadrid/comments/1k6ods6/parte_médico_eduardo_camavinga_has_been_diagnosed/"
    },
    {
        "id": "1k6lx09",
        "author": "Limp_Appointment7092",
        "title": "Your vacancy has not yet been filled, king",
        "content": "",
        "upvotes": 358,
        "comments": 23,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/17y2b45udqwe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k6lx09/your_vacancy_has_not_yet_been_filled_king/"
    },
    {
        "id": "1k6drvy",
        "author": "busyblckboy",
        "title": "Football heritage!!!",
        "content": "Be patient, honestly I'm glad they didn't put pressure on arda and endrick",
        "upvotes": 1237,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/j175942h6owe1.jpeg?auto=webp&amp;s=bb5d68a05b503ee2a5ca7fa7914da4c97d8b1030"
        },
        "permalink": "/r/realmadrid/comments/1k6drvy/football_heritage/"
    },
    {
        "id": "1k68nfl",
        "author": "TheGhost5322",
        "title": "Arda makes it 1-0!!!",
        "content": "",
        "upvotes": 2047,
        "comments": 82,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/07m5bq8h3nwe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k68nfl/arda_makes_it_10/"
    },
    {
        "id": "1k6bly1",
        "author": "Pebbledthoughts",
        "title": "Arda Guler....What the hell!!!! What is this Level?",
        "content": "",
        "upvotes": 1351,
        "comments": 137,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0yt0yel7pnwe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k6bly1/arda_gulerwhat_the_hell_what_is_this_level/"
    },
    {
        "id": "1k6j462",
        "author": "Emintro7",
        "title": "Arda Güler every touch vs Getafe",
        "content": "",
        "upvotes": 327,
        "comments": 41,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/917s00ddhpwe1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k6j462/arda_güler_every_touch_vs_getafe/"
    },
    {
        "id": "1k6iozk",
        "author": "PrimusHimself",
        "title": "Jude should get the shoulder injury before it becomes a big problem.",
        "content": "This is a video of him vs the match against Getafe.",
        "upvotes": 328,
        "comments": 46,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/mhs48axzdpwe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k6iozk/jude_should_get_the_shoulder_injury_before_it/"
    },
    {
        "id": "1k6mtvw",
        "author": "HaalandMbappeVini",
        "title": "Are we broke? What is going on with all the money we were going to make back from events?",
        "content": "I have heard about events being canceled and instead being re-assigned to Wanda, because of noise complaints, the Bernabeu is very centric so it makes sense. So how did no one see this coming?? If this is how we we are going to pay back our renovation costs then we are COOKED. \n\nDoes any one have any information about this? ",
        "upvotes": 74,
        "comments": 45,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k6mtvw/are_we_broke_what_is_going_on_with_all_the_money/"
    },
    {
        "id": "1k6c3jn",
        "author": "Modo97",
        "title": "I'm not afraid anymore to say that Courtois is the greatest RM keeper that I've ever seen 🐐❤️",
        "content": "And yes, I've watched Casillas in his prime years between 2007 and 2012. I've watched Keylor Navas and even Diego Lopez that I actually loved. I think we've always been lucky when it comes to goalkeepers. Even Lunin was brilliant for us last season.\n\nBut honestly I've never felt safe with any other GK like I feel these years with Courtois. Except for his first season, I think Courtois has been the most consistent keeper for us. Casillas, with all respect, used to have some obvious flaws, like dealing with aerial balls and crosses (he was very poor with his feet as well). Navas was a bit inconsistent comparing to Casillas (in his prime) and Courtois, but I have massive respect for him too.\n\nCourtois is just perfect in every possible way.. his 2021/22 season might be the best that I've ever seen for a GK, especially in Champions League. His performance against Liverpool in the final is unmatched, in my opinion. \n\nHe will never play over 700 games for us like Casillas, and he might not end up being the RM keeper with most titles. But in my opinion, he's the best that I've ever seen.. and in my Top 3 GKs of all times (with Buffon + Neuer). I hope he still has 3 or 4 more years in him, because replacing him will be hard.",
        "upvotes": 302,
        "comments": 86,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k6c3jn/im_not_afraid_anymore_to_say_that_courtois_is_the/"
    },
    {
        "id": "1k6dc70",
        "author": "Messmers",
        "title": "Let's address the elephant in the room: Vini and Mbappe play much better when one of the two isn't on the pitch.",
        "content": "Mbappe's best games this season have been games where Vini wasn't playing\n\nVini's best games have been the best when Mbappe wasn't playing.\n\nOf course there's been games where they shined while they were both on the pitch like Mbappe's hattrick vs City and Vini's vs Dortmund but even in those games the synergy between them wasn't as good as with their teammates when the other isn't playing.\n\nThey have so much more to work with when they get the ball constantly rather than on and off, their synergy isn't that great either, it's already an issue now and might only get worse, a new coach isn't going to fix this.\n\nWhat's the solution?",
        "upvotes": 217,
        "comments": 102,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k6dc70/lets_address_the_elephant_in_the_room_vini_and/"
    },
    {
        "id": "1k6uv0a",
        "author": "Domesticated_Cum",
        "title": "Lets play fantasy Real Madrid managers!  Give me your 4780 IQ lineups and tactics and discuss others! I'll start",
        "content": "This is a fun fluff post for the armchair manager-wannabes in this subreddit. Give me your UCL winning tactical genius approach your would use.\n\nOnly rule is: Only use current squad.\n\nOther people can chip in and discuss your ideas and vote for the funniest, best, and overall most interesting ideas.\n\nTHIS IS NOT A SERIOUS POST. WE ARE JUST FANS. NONE OF US ARE QUALIFIED TO TOUCH THE GRASS. PLEASE DONT BE SERIOUS.\n\n  \n\\-----------\n\nMy Real Madrid GEGENPRESS football. 90 min press with super high defense line that relies on offside traps and physicality to harass forwards.\n\nLineup is 3-4-3 -&gt; 3-3-1-2-1 in possession : [https://imgur.com/a/njaWOAO](https://imgur.com/a/njaWOAO)\n\nAscensio and Rudiger as Wide Center Backs with Tchouameni in the middle organizing the whole line and playing the ball to midfielders in the build up.\n\nValverde and Camavinga as wide midfielders, defensively they support the backline and press the opposition wingers/wingbacks. Offensively they present passing options in wider spaces and cover some of the central spaces forward as more players move into the box. They can also play more centered and form the midfield trio with Guler while Rodrygo and Vinicius play more wider roles.\n\nGuler and Bellingham are my main engines in the midfield. Guler is the creative outlet and Bellingham is the work horse. Guler will hold the ball more often and link with the wide midfielders for options forming a midfield trio (Cama, Fede, Guler) while looking to unlock the defense with killer balls to the final thirds. Jude will move forward with and without the ball and form a trio with Rodrygo and Vinicius. He will be a Muller-esk Ramdeuter.\n\nVinicius and Rodrygo are the central forwards. Flexible in positioning and expected to play close together with Jude. Synergy is needed for one-two passes that unlocks any deep defense. But they are also expected to dribble and shoot as much as possible. Expected to press hard when out of possession.\n\nMbappe will have to turn into a Poacher. His job is to lock defenders with him and finish any half chances we get. The team pressing high and crowding the edge of the area will allow lots of balls inside the box. Kylian is expected to pick them up. Expected to press hard when out of possession.\n\n  \nPlaystyle will be a high intensity passing with players generally being close to eachother. Beating defense with dribbling and one-two link ups. NO FUCKING CROSSES.\n\n  \nHow many goals do you think we will concede?\n\nHow many injuries per season?",
        "upvotes": 10,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L5z6B4AIpXiL0LJtj9kqNfN2gxlWrrFF66QW_U8LItg.jpg?auto=webp&amp;s=459d65d36cc03163644d404b8c0955963f51ca24"
        },
        "permalink": "/r/realmadrid/comments/1k6uv0a/lets_play_fantasy_real_madrid_managers_give_me/"
    },
    {
        "id": "1k6p351",
        "author": "Friendly-School5406",
        "title": "Title Race(Laliga or Copa) Which cup do you think Madrid will have a chance to win? Will they be cup less this season or?",
        "content": "Madrid was performing really well until the end. From my hopes of it could be Madrid Treble season, to loosing all hope to a point where I feel we would go wont win the copa finals, and would be difficult to secure the league win unless barca loses a game and we beat them in the el classico. What do you guys feel Madrid has a chance to win either one of the cups?",
        "upvotes": 22,
        "comments": 47,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k6p351/title_racelaliga_or_copa_which_cup_do_you_think/"
    },
    {
        "id": "1k64swx",
        "author": "PriorSnow6874",
        "title": "Which Player’s Transfer From Madrid Broke Your Heart the Most? I’ll Start - Ronaldo🐐",
        "content": "After everything Ronaldo did for Real Madrid 4 UCL titles, countless goals his exit felt unreal.\n“I Don’t Want To Wake Up”",
        "upvotes": 510,
        "comments": 66,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vdk2vv2wbmwe1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k64swx/which_players_transfer_from_madrid_broke_your/"
    },
    {
        "id": "1k657h2",
        "author": "Mastermind_737",
        "title": "Vinicius stays: Real Madrid will announce the Brazilian's renewal at the end of the season. Manu Carreño reports that the number 7 will extend his relationship with Real Madrid for \"two or three more years.\"",
        "content": "https://cadenaser.com/nacional/2025/04/22/el-real-madrid-anunciara-la-renovacion-de-vinicius-a-final-de-temporada-cadena-ser/\n\nSaudi Arabia was making a strong bid, with a substantial financial offer of up to €1 billion spread over five years, but as Carreño also reported last March, Vinicius wasn't convinced by such a long-term contract. For their part, the Saudi investors weren't keen on making a huge outlay to keep the Brazilian for a couple of seasons, and this disagreement ultimately broke down negotiations.\n\nNow, the latest information suggests that, following the player's desire to stay in Spain, Real Madrid will announce a contract extension (\"for two or three years\"), beyond the current one, which expired in 2027.\n",
        "upvotes": 247,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/066Vc3wF8uXuLSj1zWE5wtbL6VE7ZdLs8U9hVpJglQ8.jpg?auto=webp&amp;s=e31d28e79e86ba77e13d9aad0222ba826fbb6051"
        },
        "permalink": "/r/realmadrid/comments/1k657h2/vinicius_stays_real_madrid_will_announce_the/"
    },
    {
        "id": "1k5wg71",
        "author": "Ready_Ad_1353",
        "title": "Hansi Flick: “It’s not nice to see what happened to Ancelotti… Real Madrid have one of the best coaches in the world, he deserves respect. Carlo won everything at every club, he’s a gentleman. I have the highest respect for him... I can say Ancelotti is an unbelievable coach.\"",
        "content": "",
        "upvotes": 700,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IlzG9Zu_E-DL6r045Mpepz10uSABuG6cY4kU0KZ2MJw.jpg?auto=webp&amp;s=ef44ee5429a47325785a921de0b7c831f483bcd3"
        },
        "permalink": "/r/realmadrid/comments/1k5wg71/hansi_flick_its_not_nice_to_see_what_happened_to/"
    },
    {
        "id": "1k6i65m",
        "author": "Zealousideal-Ad-2685",
        "title": "We're So Close To A Gala 11 That Will Cook Europe",
        "content": "What I really really want to see next season is a 4-4-2 diamond with xabi as the manager. if we pull this off, oh boy... we're going to cook\n\ntrent as a RB can work really well with valverde as the RM in front, they can constantly switch with each other throughout the game.\n\ni really hope the board goes for hujisen and doesn't want to save money for the stadium or whatever, cuz having rudiger hujisen and asencio as our 3 CBs would be great. \n\ncamavinga as the LB is just better than mendy and garcia if he gets consistency, and we're not gonna buy anyone else this summer. \n\ni wasn't confident in tchouameni, but he's done a 180 in the second half of the season and he can be a great destroyer CDM when he's paired up wth guler doing the build up play from deep.\n\nbellingham as a free roaming 10, and crashing into the box for aerial presence. the vinicius and mbappe sync hopefully gets figured out by xabi. this might sound crazy but i think putting vini more on the right than he usually goes should be experimented more. \n\n* courtois\n* trent rudiger huijsen camavinga\n* valverde tchouameni guler\n* bellingham\n* vinicius mbappe ",
        "upvotes": 26,
        "comments": 26,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k6i65m/were_so_close_to_a_gala_11_that_will_cook_europe/"
    },
    {
        "id": "1k6ejd3",
        "author": "InformationFresh9605",
        "title": "Important signing for next year.",
        "content": "Without a doubt we need 3 important signings. Obviously Xabi to step in as our new manager. Carlo is one of greatest managers of all time but everything eventually comes to an end. Dean Huijsen is an incredible young player who would do amazing in our system. He’s been practically begging to join us. We would actually be mental not sign him for only £50m. And obviously Trent. I think these signings would def benefit us and we would be back to the same level as last year or even better.",
        "upvotes": 32,
        "comments": 22,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k6ejd3/important_signing_for_next_year/"
    },
    {
        "id": "1k5ub9k",
        "author": "Far-Willingness-9705",
        "title": "The Beauty of Valverde Goal. Hala Madrid Y Nada Màs Hala Madrid",
        "content": "",
        "upvotes": 490,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dkj9f0l3sjwe1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k5ub9k/the_beauty_of_valverde_goal_hala_madrid_y_nada/"
    },
    {
        "id": "1k66ky0",
        "author": "scoreboard-app",
        "title": "Match Thread: Getafe CF vs Real Madrid Live Score | La Liga (Spain) | Apr 23, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1k66ky0)",
        "upvotes": 73,
        "comments": 2233,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k66ky0/match_thread_getafe_cf_vs_real_madrid_live_score/"
    },
    {
        "id": "1k64vc4",
        "author": "Sl_PROXY",
        "title": "Starting XI vs Getafe",
        "content": "",
        "upvotes": 73,
        "comments": 100,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WbPSgaC8YeKJTi5_HFChy6_pJKI-JHbcjQoiX3qTVQk.jpg?auto=webp&amp;s=03b06465fd97f1d7aefb69c16e6377c9ebb00426"
        },
        "permalink": "/r/realmadrid/comments/1k64vc4/starting_xi_vs_getafe/"
    },
    {
        "id": "1k5rso8",
        "author": "EffectiveTie3144",
        "title": "On April 23 2003 Ronaldo Nazario received a standing ovation at Old Trafford for scoring a Champions League hat-trick against Man Utd.",
        "content": "",
        "upvotes": 507,
        "comments": 17,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k5rso8/on_april_23_2003_ronaldo_nazario_received_a/"
    },
    {
        "id": "1k62d4u",
        "author": "muaazmuaaz123",
        "title": "Day 3: Midfielders, Most upvoted will be selected",
        "content": "I got to know di Stefano got a lot of upvotes so I changed him with R9, ",
        "upvotes": 80,
        "comments": 90,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k62d4u/day_3_midfielders_most_upvoted_will_be_selected/"
    },
    {
        "id": "1k5vvcb",
        "author": "busyblckboy",
        "title": "veni vidi vici Vini ! 2030?",
        "content": "",
        "upvotes": 204,
        "comments": 44,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8ih56d9cbkwe1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1k5vvcb/veni_vidi_vici_vini_2030/"
    },
    {
        "id": "1k6ayhu",
        "author": "RM-PM-Surveys",
        "title": "[Post Match Survey] Real Madrid 1-0 Getafe",
        "content": "[https://docs.google.com/forms/d/e/1FAIpQLSdHSDlCapk5Gyg\\_ce0zEQpwVXOsIT5RnLbqpJ2lumMJLllXSw/viewform?usp=header](https://docs.google.com/forms/d/e/1FAIpQLSdHSDlCapk5Gyg_ce0zEQpwVXOsIT5RnLbqpJ2lumMJLllXSw/viewform?usp=header)\n\n  \nThis is the post-match survey. When recording your responses, keep in mind that a **1** should be reserved for awful, career-worst games, while a **10** should reflect an exceptional, near-perfect match. Try to be as objective as possible—focus on the overall gameplay.",
        "upvotes": 26,
        "comments": 27,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kJS3jSNgR9KX5xMzxmjBaYqH982M20toBLox-3KzLHY.jpg?auto=webp&amp;s=a067ca5e18c530d3fd4d2c33f194f81c5ef17aa0"
        },
        "permalink": "/r/realmadrid/comments/1k6ayhu/post_match_survey_real_madrid_10_getafe/"
    },
    {
        "id": "1k5h875",
        "author": "PriorSnow6874",
        "title": "Cristiano Ronaldo: The Greatest Galáctico of All Time?",
        "content": "Here’s a look at Cristiano Ronaldo’s legendary legacy at Real Madrid:\n\n1. 450 goals in 438 appearances all time top scorer for the club.\n2. 4 Champions League titles including the iconic three peat (2016, 2017, 2018).\n3. 2 La Liga titles 2011–12 and 2016–17.\n4. 2 Copa del Rey wins 2010–11 and 2013–14.\n5. 3 UEFA Super Cups and 3 Spanish Super Cups.\n6. 3 FIFA Club World Cups.\n7. 4 Ballon d’Or awards while at Real Madrid.\n8. Scored in 11 straight Champions League games a record.\n9. Most goals in a single Champions League season 17 in 2013–14.\n10. Fastest to reach 100, 200, 300, and 400 goals for Real Madrid.\n11. Scored in every El Clásico at Camp Nou for multiple consecutive seasons.\n12.\tOnly player to score in 3 different Champions League finals for the club.\n13.\tWon Pichichi Trophy (La Liga top scorer) 3 times.\n14.\tCountless iconic moments – headers, hat-tricks, clutch goals, and unforgettable celebrations.\n\nIs there anyone else who defined an era at the Bernabéu like Ronaldo? ",
        "upvotes": 1837,
        "comments": 160,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k5h875/cristiano_ronaldo_the_greatest_galáctico_of_all/"
    },
    {
        "id": "1k5s868",
        "author": "RamsesII89",
        "title": "“If you want a coach with a whip, sign a different manager” – Carlo Ancelotti on Real Madrid discipline",
        "content": "This somes up Carlo's style of management well:   \n\"I try to manage my relationships with people based on who I am; in a relationship, you have to show what you’re really about. You think I’ve never been angry this season? I’ve been angry many times. My relationship is about having relationships with people on the same level, and for that, you have to have respect and be respected, and that’s happened, even in the difficult times. A footballer, before being a footballer, is a person.\"",
        "upvotes": 276,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BiuD4Y0qjah2sRvki-gsRG8Fk8lztC_JApQcxox9b1c.jpg?auto=webp&amp;s=e4219413a5959d1029c4fd1388b693c9efd6cdc8"
        },
        "permalink": "/r/realmadrid/comments/1k5s868/if_you_want_a_coach_with_a_whip_sign_a_different/"
    },
    {
        "id": "1k6wb54",
        "author": "gazillrey",
        "title": "Yamal 180m€ vs. Güler 45m€ - why the big difference?",
        "content": "So Yamal is 3 years younger, I get that...  \nBut why isnt Güler valued WAY more?",
        "upvotes": 0,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Ipw7XMOXgOp-qCUnvdsSsO7so3WEA4GQrhd4Ui0CgyA.jpg?auto=webp&amp;s=77859d3557b6d5df47c89dbb12c9b498ddc8217c"
        },
        "permalink": "/r/realmadrid/comments/1k6wb54/yamal_180m_vs_güler_45m_why_the_big_difference/"
    },
    {
        "id": "1k63djf",
        "author": "gtfoatonce",
        "title": "Are the “Zidane had inherited a great team already” claims any true?",
        "content": "Barça fan here. Not willing to create any fuss. I’m a football fan in general and love this sport, I’m also curious about certain myths or whether or not they hold any merit. Like for example the claim that Zidane’s three-peat is down more to how excellent of a Madrid side that was rather than his own tactical prowess or whatever \n\nI wasn’t following football as much as I do now back in that era, so any of you who’ve been there week in week out during that time and witnessed his rotations, his tactics, his adaptations to opponents from different European leagues, how true is that claim?\n\nAnd tbf this is not just one myth I wanna debunk, the online discourse is full of nonsense about coaches and a lot of the talk is trying to discredit hard working people out of pure hatred.\n\n",
        "upvotes": 35,
        "comments": 64,
        "media": null,
        "permalink": "/r/realmadrid/comments/1k63djf/are_the_zidane_had_inherited_a_great_team_already/"
    }
]