[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 5,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1nv36qv",
        "author": "skippymetal",
        "title": "Mirafiori ieri",
        "content": "Ma cosa diamine è successo? (Cosa c'entrava l'uomo calvo?) Ho controllato e non mi sembra sia ancora stato postato, in caso contrario mi scuso in anticipo e vi chiedo di cancellarlo\n https://www.torinotoday.it/cronaca/machete-auto-sanremo-30-settembre-2025.html?utm_source=newsshowcase&amp;utm_medium=discover&amp;utm_campaign=CCwQ64Xd6NzO9_LBARic95P1yu3P7rUBKikIMBCnkcmD29Lp5c4BGNnag-GP_oeKnQEqDwgAKgcICjDomaEJMKe6cQ&amp;utm_content=related",
        "upvotes": 15,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uBv5LAak8HXHlYobMU2ytJNFwSXZuf4KB3ozpPNLeng.jpeg?auto=webp&amp;s=b476cac14a5f0436d06dbb9ae68ee77692d7b1c0"
        },
        "permalink": "/r/torino/comments/1nv36qv/mirafiori_ieri/"
    },
    {
        "id": "1nvahds",
        "author": "Slow-Pie109",
        "title": "Ristoranti imperdibili a Torino?",
        "content": "Ciao a tutti!\n\nSiamo a Torino e ci piacerebbe avere qualche dritta su ristoranti di cucina italiana da non perdere. Finora siamo stati da Sorbillo, Il Mannarino, e Brun. Ci piacciono i piatti autentici, semplici ma fatti bene, niente di troppo elaborato, solo buon cibo di qualità.\n\nAvete dei posti preferiti da consigliarci? Restiamo qui ancora per 24 ore. Grazie mille!",
        "upvotes": 3,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1nvahds/ristoranti_imperdibili_a_torino/"
    },
    {
        "id": "1nv6qug",
        "author": "Parking-Job-3175",
        "title": "Com’é il mercato lavorativo a Torino? Come é cambiato negli ultimi anni?",
        "content": "",
        "upvotes": 4,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1nv6qug/comé_il_mercato_lavorativo_a_torino_come_é/"
    },
    {
        "id": "1nv543k",
        "author": "toast_118",
        "title": "Ragazzi devo prendere un treno venerdì con lo sciopero aiutatemi",
        "content": "Questo venerdì sarà un disastro, ne sono perfettamente a conoscenza, per un grosso impegno non posso stare qui e devo per forza spostarmi. Ho un Frecciarossa garantito che dovrebbe passare ma dopo che hanno bloccato i binari di Porta Nuova non so più se partire, devo fare un cambio di sera tardi con un altro treno sempre garantito e non posso permettermi di avere il treno in ritardo o altrimenti rimango a piedi a metà strada. Che faccio?",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1nv543k/ragazzi_devo_prendere_un_treno_venerdì_con_lo/"
    },
    {
        "id": "1nvcijk",
        "author": "Remarkable_State_474",
        "title": "Lavoro Comune Torino",
        "content": "Buondì, sono un impiegato in un Comune della provincia e visto che è appena uscito il bando per Torino stavo facendo un pensierino sul cercare di entrare qua, in modo da avvicinarmi un po' a casa. C'è qualcuno già dentro che mi possa raccontare qualcosa su come sia l'ambiente e se esista un minimo di welfare? \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nvcijk/lavoro_comune_torino/"
    },
    {
        "id": "1nva5vm",
        "author": "BitterApple505",
        "title": "Gruppi telegram per meet up o spedizioni a Torino",
        "content": "Raga qualquno che mi puo aiutare ?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nva5vm/gruppi_telegram_per_meet_up_o_spedizioni_a_torino/"
    },
    {
        "id": "1nv8j9i",
        "author": "SimoSian93",
        "title": "Gruppo uscite a Torino 🍕🍻 – In cerca di persone che abbiano davvero voglia di socializzare",
        "content": "Ciao a tutti!\n\nUso raramente Reddit, ma su consiglio di un amico oggi lo sfrutto. Da un po’ gestisco #ShakeUpTorino, un gruppo WhatsApp nato per conoscere nuove persone in città. Siamo ragazzi e ragazze tra i 21/22 ed i 40 anni circa ed organizziamo uscite semplici: una pizza, un giro in centro, una serata al pub, un caffè pomeridiano… l’idea è semplicemente quella di fare due chiacchiere e ampliare le amicizie.\n\nNon è un gruppo dating, non è un’associazione, non ci sono soldi di mezzo: solo persone che vogliono socializzare.\n\n👉 Se sei interessato/a, scrivimi in privato qui su Reddit oppure ancor meglio su Instagram (la pagina è @shakeuptorino). Preferisco non lasciare link o numeri diretti per evitare che entri proprio il disagio più estremo 🤣 \n\nA presto! \n\n",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nv8j9i/gruppo_uscite_a_torino_in_cerca_di_persone_che/"
    },
    {
        "id": "1nv6rsw",
        "author": "met_97",
        "title": "Regionale diretto per milano del 11 ottobre",
        "content": "Ciao a tutti, qualcuno ha idea del perché sul sito di trenitalia sono spariti tutti i regionali diretti per milano del 11 ottobre? Mi fa vedere solo percorsi con 3 cambi. Sto provando ad organizzare un weekend sul lago maggiore ma sembra impossibile 🥲",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1nv6rsw/regionale_diretto_per_milano_del_11_ottobre/"
    },
    {
        "id": "1nv3t37",
        "author": "Current-Remote8989",
        "title": "Student Housing at Torino",
        "content": "Hi guys, I would like to know what are your experiences with student housing options such as Camplus, CX Turin, etc. Which ones are the best?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nv3t37/student_housing_at_torino/"
    },
    {
        "id": "1nupz37",
        "author": "Ancient_Tourist_4268",
        "title": "Come si vive in borgata San Paolo?",
        "content": "Ciao io la mi ragazza, io Torino sud, lei Torino nord, abbiamo deciso di andare a vivere insieme, allora vorremmo trovarci in un punto intermedio , ossia San Paolo, tra un paio di mesi andremmo a convincere insieme più o meno in quelle zone.\n\nVolevo chiedervi come fosse la vita in San Paolo, come si sta…. Si trova facilmente parcheggio al contrario di santa Rita?\n\nIo ci sono passato qualche volta, ma in generale a parte via monginevro se non sei di quelle zone là difficilmente ci passi essendo più un quartiere residenziale direi o mi sbaglio? ",
        "upvotes": 4,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1nupz37/come_si_vive_in_borgata_san_paolo/"
    },
    {
        "id": "1nuli99",
        "author": "no-unit-6293",
        "title": "Night study room",
        "content": "Does anyone know where can I study and work on my pc (editing text no need to make calls) at night in Turin? ideally from 8pm to 6am?\n\nideal setup would be table, chair, internet, plug",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1nuli99/night_study_room/"
    },
    {
        "id": "1nuhyfx",
        "author": "asilorepublic95",
        "title": "Dentisti a torino",
        "content": "Dentisti \"onesti\" non troppo esosi coi prezzi...qualcuno sa dove indirizzarmi? So che sono cari tutti pero magari c'è qualcuno dove voi vi servite che è Abbastanza più agevole per me..",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1nuhyfx/dentisti_a_torino/"
    },
    {
        "id": "1nup47s",
        "author": "whiteobama123",
        "title": "Flibco to Malpensa",
        "content": "Hi everyone, I was wondering if anyone has taken the Flibco bus from Torino to Malpensa at 2 a.m. before. I read some reviews on TripAdvisor saying it’s a no-show. I’d really appreciate it if anyone could let me know. Thank youuu!!!",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1nup47s/flibco_to_malpensa/"
    },
    {
        "id": "1nuasxd",
        "author": "Psi_ale",
        "title": "Ricerca partecipanti esperimento",
        "content": "Ciao!\nSono una ragazza che studia Psicologia Clinica all’Università di Torino e, per il mio progetto di tesi, sto cercando persone tra i 18 e i 63 anni disposte a partecipare a un esperimento in presenza.\nL’esperimento ha una durata di circa un’ora e mezza e si svolge presso l’università. Lo scopo è esplorare alcuni aspetti legati alla personalità.\nLa partecipazione è volontaria e i dati raccolti saranno trattati in modo anonimo e riservato.\nSe sei interessato/a o vuoi maggiori informazioni, contattami pure!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tshliz2qgasf1.jpeg?auto=webp&amp;s=092c1591bffdca96e228176dcf78ceea011d99b3"
        },
        "permalink": "/r/torino/comments/1nuasxd/ricerca_partecipanti_esperimento/"
    },
    {
        "id": "1ntejg1",
        "author": "Bruno_Barbiere",
        "title": "Confermate che a Torino si può vivere bene con 1.400 euro netti al mese?",
        "content": "",
        "upvotes": 101,
        "comments": 167,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/psaevj0ig2sf1.jpeg?auto=webp&amp;s=e9ee87de1a0384625cc9b936d36143c70af7345a"
        },
        "permalink": "/r/torino/comments/1ntejg1/confermate_che_a_torino_si_può_vivere_bene_con/"
    },
    {
        "id": "1ntcke1",
        "author": "Peregrineperceiving7",
        "title": "Bar caotico sotto casa",
        "content": "Ciao a tutti, avrei una domanda relativa alla situazione in cui vivo - mi sono trasferita circa 4 anni fa in zona Crocetta,con un contratto francamente miracoloso che non mi prende tanti soldi nonostante il quartiere. Abito al terzo piano di un vecchio palazzo e all epoca del mio trasferimento era già presente a livello strada un bar/caffè di grande successo ma che è sempre stato gestito da persone tranquille,quindi nonostante avesse orari lunghi (dalle 6 alle 23 di sera) il rumore era soprattutto ascribile a chiacchiericcio dei clienti e tintinnio delle stoviglie,tutto molto gestibile. Da qualche mese il bar ha purtroppo cambiato gestione e hanno deciso di ampliare il dehors qui nella via mettendo una struttura in metallo. Oltre al caos quotidiano,mi trovo a essere svegliata quotidianamente dall \"arredamento\" del dehors con sedie e tavoli che vengono trascinati rumorosamente alle 5 e mezza o sei del mattino senza alcun riguardo per il vicinato,urlando,mettendo musica e appunto lanciando sembrerebbe queste sedie. Ho fatto presente chiamando il locale e nulla è cambiato e anzi a ogni mia chiamata o di un paio di altri vicini si sono fatti cafoni e maleducati e tutto è continuato come prima. Dalla stanchezza per la situazione (purtroppo lavoro su turni e vorrei solo poter dormire oltre le 5 e mezza/6 ogni tanto) ho preso a registrare il caos creato - a volte dopo tutto non aprono nemmeno il bar,se ne stanno lì sulle sedie a chiacchierare o sgommano con le moto davanti. Cosa si potrebbe fare,esattamente? Gli ho fatto presente che andando avanti con la stagione oltretutto a quell ora è buio e freddo e se potessero spostare l apertura del dehors anche solo alle 7/sette e mezza ma mi hanno detto sisi ok capito,buttando giù telefono. Non mi aspetto che non ci sia il dehors ma che semplicemente si comportino con un minimo di considerazione. Grazie per attenzione a tutti!",
        "upvotes": 16,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1ntcke1/bar_caotico_sotto_casa/"
    },
    {
        "id": "1ntx6k1",
        "author": "ricess_",
        "title": "EDISU Borse di Studio Piemonte",
        "content": "Ho bisogno di sapere come ci si muove per le borse di studio EDISU. Vorrei iniziare il Biennio all’Accademia Albertina di Belle Arti (non commentate o datemi consigli a riguardo, ci vado perché mi piace Torino). Ne vengo da Genova. Generalmente ho capito, in sti giorni mi sto praticamente studiando il bando per il prossimo anno scolastico (2026/27) in cui mi voglio iscrivere. Mal che vada si finisce nella categoria fuori sede a quanto sto capendo, quello che mi preme è che se non ho un alloggio sovvenzionato da loro i soldi per l’alloggio inizialmente da dove arrivano? Perché si sono quei 5/6 mila euro ma quando arrivano e come arrivano? Perché se andare a Torino significa pagarmi quei 350€ euro di affitto i primi mesi almeno ci arrivo che lo so e sono preparato. Vi ringrazio in anticipo, se qualcuno sa dirmi anche se fanno delle EDISU da delle consulenze/orientamenti per capirci meglio (so che nella mia regione si fanno), oppure chi ha esperienza mi scriva in privato. Grazie 🫶🫶",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ntx6k1/edisu_borse_di_studio_piemonte/"
    },
    {
        "id": "1ntwa3f",
        "author": "mellohe",
        "title": "Where to take a zoom call",
        "content": "Hi! I'll be in Torino on Friday and need to take a Zoom call in a relatively quiet place with good wifi from 1300-1400. Does anyone have any recommended places? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ntwa3f/where_to_take_a_zoom_call/"
    },
    {
        "id": "1nttop0",
        "author": "Quentin_T84",
        "title": "Banco del pesce fresco",
        "content": "Dove posso comprare del pesce fresco al banco nella zona di None/Volvera? Si accettano consigli sia di punti vendita che banchi del mercato rionale.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1nttop0/banco_del_pesce_fresco/"
    },
    {
        "id": "1ntgroa",
        "author": "glorious-ahole",
        "title": "Places to visit and explore the city in evening",
        "content": "Hi everyone, me and my girlfriend want to explore the city in the evening because both of us are busy during the day so we can't visit any of the museums because they're closed. Can anyone give any recommendation to walk around and explore the city from 7 or 8pm onwards ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ntgroa/places_to_visit_and_explore_the_city_in_evening/"
    },
    {
        "id": "1ntdyze",
        "author": "Any-Somewhere-4864",
        "title": "Cerco posto dove poter lavorare con il pc",
        "content": "Sto cercando un posto dove mettermi a lavorare anche 4/5 ore di fila con il pc, non ho molte necessità, basta avere una presa della corrente (ma anche quella non necessaria visto che la batteria del mac dura svariate ore). Stavo pensando a mettermi all'Imbarchino sul Po, ma non so se lo permettono.  \nQualche lavoratore in full remote come me che ha consigli?",
        "upvotes": 4,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1ntdyze/cerco_posto_dove_poter_lavorare_con_il_pc/"
    },
    {
        "id": "1ntihzr",
        "author": "USS-Ventotene",
        "title": "Meccanico Moto Guzzi a Torino (o immediati dintorni)",
        "content": "Finalmente mi sono deciso a portare la moto a Torino, ci ho messo *solo* cinque anni a decidermi. Dato che Google Maps non mi ha saputo aiutare, e il vecchio forum Guzzi non è aggiornato da quasi dieci anni, vorrei chiedere agli amici redditor: conoscete un buon meccanico specializzato in Moto Guzzi a Torino?   \nLa mia è una V7 del 2014, ben tenuta anche perché frequentavo regolarmente un'officina specializzata: mi piacerebbe continuare in tal senso.\n\n*Aiutami Obi-wan Kenobi, sei la mia unica speranza!*",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ntihzr/meccanico_moto_guzzi_a_torino_o_immediati_dintorni/"
    },
    {
        "id": "1nto05y",
        "author": "ArminiusRev",
        "title": "Indicazioni costo vita per possibile trasferimento",
        "content": "Buonasera a tutti,\n\ninsieme alla mia famiglia (moglie + figli piccoli) stiamo considerando un trasferimento a Torino. È una delle città del Nord Italia che preferisco e per entrambi ci sarebbero opportunità abbastanza interessanti. Veniamo dal centro-nord europa.\nPer considerare quanto la cosa sia fattibile ovviamente dovremo considerare il rapporto tra i costi della vita e lo stipendio che ci si può aspettare. E qua faccio fatica a stimare cosa potrebbe aspettarci, perché è tanto che non visito Torino.\nConsiderando una casa sopra i 100m2 in una zona a max circa 20-30 Min dal centro, facilmente raggiungibile ma magari anche un pochino verde (esiste?!), all'inizio in affitto. E poi le spese medie di una famiglia con un tenore medio, ma che comunque da valore al \"godersi le piccole cose della vita\" (nessun problema a fare spesa con occhio agli sconti al discount, la cena fuori ogni tanto, qualche weekend fuori all'anno in zone vicine, l'abbonamento allo streaming o al tool AI di turno, etc.).\n\nInsomma, quanto ci vuole a Torino (e dintorni) per vivere decentemente/bene con una famiglia?",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1nto05y/indicazioni_costo_vita_per_possibile_trasferimento/"
    },
    {
        "id": "1ns60by",
        "author": "Iaco_V8",
        "title": "Quanto è bello vedere le vie del centro così vive e piene di gente!",
        "content": "È bellissimo vedere il centro di Torino così vivo durante il Salone dell'Auto: le vie affollate, turisti che parlano inglese, francese, cinese, gente che scatta foto ai monumenti. Via Po, via Roma, via Garibaldi, via Lagrange brulicano di persone, e perfino zone più tranquille come via Palazzo di Città o le viuzze del quadrilatero sono piene di vita. È bello pensare che molti vengano anche dall’estero per venire a Torino, vedere persone scattare foto ai monumenti e sentire chiacchiere su tutto ciò che Torino ha da offrire: musei, piazze storiche, il parco del valentino, la Mole Antonelliana...\n",
        "upvotes": 196,
        "comments": 38,
        "media": null,
        "permalink": "/r/torino/comments/1ns60by/quanto_è_bello_vedere_le_vie_del_centro_così_vive/"
    },
    {
        "id": "1ntbmc8",
        "author": "pinkpenguininaustria",
        "title": "Nuovi Friends (:",
        "content": "ciau a tutti, innanzitutto studio filosofia, sono al secondo anno, ho vent'anni e nulla\ncerco qualcuno con cui fare amicizia (possibilmente in facoltà ma va bene ovunque) \nmi piace la poesia, fare discorsi profondi a casissimo, le birre IPA, le avventure organizzate all'ultimo, ridere, la bicicletta e un sacco di cose belle \nquindi, se qualcuno vuole fare amicizia ed essere silly insieme, scrivete pure :3 \npeace and love everybody ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ntbmc8/nuovi_friends/"
    },
    {
        "id": "1nsu1un",
        "author": "SkytechMC",
        "title": "Cambridge English Exams Torino è uno scam?",
        "content": "In questi giorni mi stavo informando su come ottenere la certificazione B1, e sono venuto a conoscenza del Cambridge English Exams Torino. \nCi sono i social, il sito, e viene anche citato dai siti ufficiali di Cambridge English. \nVorrei cercare di andare da loro per candidarmi come privatista, solo che quando digito l'indirizzo su Maps trovo solo un condominio davanti a me senza nulla che indichi la presenza di questa fantomatica sede.\nVoi avete avuto un'esperienza simile alla mia? L'indirizzo è sbagliato? Se sì, dove si trova davvero?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1nsu1un/cambridge_english_exams_torino_è_uno_scam/"
    },
    {
        "id": "1nsu18d",
        "author": "Norand87",
        "title": "Pozzo Strada, Parella, Cenisia o San Paolo?",
        "content": "Ciao tutti? \nQuali tra questi quartieri\n1) risulta più congestionato al traffico? Quali corsi/vie in particolare sono da evitare?\n2) risulta più completo in termini di servizi/logistica?\n3) risulta più rumoroso?\n4) risulta meno sicuro?\n5) piu adatto a famiglie?\n\nGrazie a tutti!",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1nsu18d/pozzo_strada_parella_cenisia_o_san_paolo/"
    },
    {
        "id": "1nsnpic",
        "author": "asilorepublic95",
        "title": "Locali da 30 enni in su",
        "content": "Quali locali consigliate dai 30 anni in su a Torino?",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1nsnpic/locali_da_30_enni_in_su/"
    }
]