[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 490,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i8muj5",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game Season 3 Is Coming ‘Sooner Than You Expect’ Director Says",
        "content": "",
        "upvotes": 251,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1i8muj5/squid_game_season_3_is_coming_sooner_than_you/"
    },
    {
        "id": "1i8956q",
        "author": "OkImpression1223",
        "title": "Second Bling Empire cast member dies since Netflix cancellation",
        "content": "",
        "upvotes": 165,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1i8956q/second_bling_empire_cast_member_dies_since/"
    },
    {
        "id": "1i7y9hk",
        "author": "Pogrebnik",
        "title": "'Stranger Things 5' Release Date Leaked By Examining Netflix’s Website Code",
        "content": "",
        "upvotes": 503,
        "comments": 90,
        "media": null,
        "permalink": "/r/netflix/comments/1i7y9hk/stranger_things_5_release_date_leaked_by/"
    },
    {
        "id": "1i8hxyk",
        "author": "bell-fruit-205",
        "title": "Night Agent S2 - does anyone else find Rose to be extremely annoying?",
        "content": "I just started season 2 but she literally didn’t need to be involved in any of this but she felt like she had to find Peter which made her involved. \n\nBut then she’s worried about being in danger…when finding Peter in fact puts her in danger\n\nThen she’s hung up on the fact that Peter didn’t call for 10 months. Like girl take a clue! And also even if we wanted to call, you know he’s an agent it’s not like he’s really able to just call whenever and it be safe \n\nIdk she’s just so annoying\n\nThoughts?",
        "upvotes": 22,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1i8hxyk/night_agent_s2_does_anyone_else_find_rose_to_be/"
    },
    {
        "id": "1i8qv8m",
        "author": "Ok-Frame-5421",
        "title": "Rose as a character in night agent is BEYOND insufferable",
        "content": "Does anyone else share this opinion? Sure she’s helpful at times but in general she’s causing more trouble than anything ESPECIALLY in ep 5-6. Rose wants everything to be perfect and ideal when it’s not realistic at all, for example she demands that the agent go and save noors family with little to no time to prepare not only endangering his life but noors family as well but then when it goes wrong she gets upset about it when it should’ve already been expected as a possibility, then she’s iffy about having to lie to get the pictures when she’s already been told that thousands of lives could be at risk but no she’s right it’s a hard choice wavering honesty over thousands of lives. She’s extremely entitled and full of herself. I think the actor did a great job it’s just the way the character was written. \n\nEdit: also biggest nitpick later on rose acts like she was dragged into all this and didn’t ask to be a “night agent” after having her tantrum when she quite literally inserted herself into every situation any way she could when everyone was hesitant on her doing so.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i8qv8m/rose_as_a_character_in_night_agent_is_beyond/"
    },
    {
        "id": "1i86816",
        "author": "Robemilak",
        "title": "Every Movie &amp; Series Coming to Netflix in February 2025",
        "content": "",
        "upvotes": 53,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1i86816/every_movie_series_coming_to_netflix_in_february/"
    },
    {
        "id": "1i84c7r",
        "author": "Tuktuktuk2020",
        "title": "American Primeval (trigger warning, spoilers)",
        "content": "I've never seen a better depiction of women in a historical series, or any other series at that. Women are allowed to be independent, opinionated, and vulnerable and feminine - fleshed out and whole people just as much as the male protagonists. \nFurthermore, as a s/a survivor, I was touched by the way it was handled in the series. Delicately, not exploitedly, and showing strength and resilience in the survivor, instead of the usual crumbling and broken victim. It felt authentic. It was treated with compassion and without shame. \nI do think I would have ended many things differently, it was depressing AF, but overall I liked the series. ",
        "upvotes": 64,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1i84c7r/american_primeval_trigger_warning_spoilers/"
    },
    {
        "id": "1i8q78y",
        "author": "dyslexic2",
        "title": "My monitor shuts down as if you unplug the display port from the GPU whenever i browse netflix.",
        "content": "This issue has been annoying me for 3 days. whenever I browse netflix, my monitor shutsdown. I have no problem with gaming like god of war and warframe and other stuffs. I had to unplug my display port and plug it again to turn on the display again. What is going on? can you help me please?\n\nPS even replacing display port. doesnt work. I use the netflix app instead of MS edge. still same thing. there is something wrong with netflix.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i8q78y/my_monitor_shuts_down_as_if_you_unplug_the/"
    },
    {
        "id": "1i8fb0z",
        "author": "Strict_Emu5187",
        "title": "Resident alien",
        "content": "So I know I'm late to the party but this is the best thing I've ever seen. I'm usually a true crime horror kind of girl but I am literally LOLing throught this whole thing. I can't wait for season 3.",
        "upvotes": 9,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1i8fb0z/resident_alien/"
    },
    {
        "id": "1i801x6",
        "author": "NathLWX",
        "title": "These are the 8 biggest anime premieres on Netflix (+ Synopsis).",
        "content": "I believe these are the views for the first time they appear in the Netflix Top 10 site.\n\nI recommend giving them a try. I've watched most of them, except Baki Hanma, Dragon Ball Daima, Demon Slayer Season 4. All of them are available in English dub too.\n\n**Sakamoto Days** (Currently simulcasting/weekly release) - 8/10  \nComedy action anime about a hitman who left his job after falling in love at first sight with a convenience store lady. As a result, he left his job and became a father who helped people, prohibited from killing. He's now living his peaceful quiet life... or is he?  \nHe is also being hunted or searched by his former rivals and partners, so he has to stop his enemies without killing them.\n\n**DAN DA DAN** (there's an attempted rape at ep. 1 by the aliens, afterwards it's safe) - 8.5/10  \nHe was an alien fanboy, she was a ghost fangirl. They're in dispute over which one is real since they believe the other one doesn't exist, so the female MC (main character) decided to look for alien; male MC looked for ghost. Turns out both are real. Male MC lost his balls (literally) to Turbo Granny in a tunnel. Long story short they both gain supernatural powers, guess you can say they are a match.\n\n**Record of Ragnarok** - 7/10  \nAnimation needs improvements imho, but it's still enjoyable. The gods want to wipe out humanity due to their sins and selfishness, but one of the Valkyries (Brunhilde) said hold up, let them cook, and proposed an idea to make humans literally fight against the gods in an arena instead. If humans have more wins than gods, humankind will be spared. Some of the fights include Adam vs Zeus, Lü Bu vs Thor, Jack the Ripper vs Heracles, Raiden vs Shiva.\n\n**My Happy Marriage** - 7.5/10  \nThe female MC lives in an abusive household ever since her mother died and her father remarried an evil woman and her daughter. She got forced to be a servant/mais. Her father suddenly brought a news that she is to marry a guy from a noble and distinguished family. Her fiancee is known to be callous and dismissed all his previous fiancees. That's what she expected, but turns out he treated her nicely.\n\n**Ranma 1/2** (2024 remake) - 8/10  \nI'm sure you've heard of this slapstick romance comedy before; if not, it's about a dude (Ranma) who is a gender bender after falling into a hot lake in China; likewise his father who can turn into a Panda. Ranma got engaged with a tomboy girl by his father who is a friend to the fiancee's father.",
        "upvotes": 79,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1i801x6/these_are_the_8_biggest_anime_premieres_on/"
    },
    {
        "id": "1i8lq9y",
        "author": "lenystar",
        "title": "NO 2FA YET?",
        "content": "my netflix changes to foreign languages ALL THE TIME even i dont know how do they log in  \nbut if there was 2fa i could just enjoy my netflix without having billions of random peoples accounts  \nis it that hard to add 2fa? google is about to leave 2fa behind with something safer while we cant just have 2fa to prevent stupid hackers into our accounts",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i8lq9y/no_2fa_yet/"
    },
    {
        "id": "1i7c7cu",
        "author": "TheExpressUS",
        "title": "Bling Empire New York star Lynn Ban dies aged 51 after brain surgery",
        "content": "",
        "upvotes": 852,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1i7c7cu/bling_empire_new_york_star_lynn_ban_dies_aged_51/"
    },
    {
        "id": "1i7zuqy",
        "author": "JaffaCakesAreMyJam",
        "title": "The Night Agent star Gabriel Basso: ‘Thriller’s 98,000,000 views freaks me out’",
        "content": "",
        "upvotes": 16,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i7zuqy/the_night_agent_star_gabriel_basso_thrillers/"
    },
    {
        "id": "1i89m8e",
        "author": "Atlast_2091",
        "title": "Sweet Magnolias: Season 4 | Official Trailer | Netflix",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i89m8e/sweet_magnolias_season_4_official_trailer_netflix/"
    },
    {
        "id": "1i8h88u",
        "author": "ILikeTheTinMan83",
        "title": "Netflix preview club question",
        "content": "I got sent an email today saying that the new Netflix preview club screening is available to watch in my feed and I can’t find it. I have watched several previews before so I’m not new to this. I am logged into my main profile. I even tried resetting the app and logging in and out and nothing. Anyone else having an issue with the newest screening and it not showing up in your feed? ",
        "upvotes": 1,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1i8h88u/netflix_preview_club_question/"
    },
    {
        "id": "1i7vaiu",
        "author": "okraisyummy",
        "title": "Two Must-Watch Documentaries on War, International Relations, and Terrorism",
        "content": "Just finished watching two Netflix docuseries: Turning Point: The Bomb and the Cold War and Turning Point: 9/11 and the War on Terror. Honestly, both were super interesting and packed with details about these major events in history.\n\nIf you’re into learning about big global moments or people like Oppenheimer, these are definitely worth a watch. They break down a lot of important stuff without feeling too overwhelming. Highly recommend if you’re into history or just want to understand these topics better!\n",
        "upvotes": 28,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i7vaiu/two_mustwatch_documentaries_on_war_international/"
    },
    {
        "id": "1i7a5uk",
        "author": "Glitchy_McGee",
        "title": "Is Netflix shooting itself in the foot with these constant price hikes?",
        "content": "I’ve been a Netflix subscriber for years, but with the latest price hike for the Premium plan (now $24.99/month!), I’m really starting to question if it’s worth it anymore. They keep raising prices while pushing out content that, honestly, doesn’t always hit the mark. It feels like they’re making us pay for their poor-performing shows and movies instead of focusing on producing quality content that people actually want to watch.\n\nAnd the password-sharing crackdown? I get that they want to boost profits, but it feels like they’re ignoring how modern households actually function. Not everyone under one account lives in the same house 24/7—people go to college, travel for work, or stay with family temporarily. It just seems dumb to alienate loyal customers who aren’t trying to cheat the system but just have a normal life.\n\nA lot of people I know have either canceled their subscriptions or switched to other streaming services that offer just as much—if not more—for less money. It just doesn’t make sense to me. If they’re losing subscribers because of price hikes, why keep doing it? Shouldn’t they focus on improving their content and keeping people around instead of squeezing every dollar out of us?\n\nWhat do you guys think? Are you sticking with Netflix, or are you moving on to other platforms?",
        "upvotes": 397,
        "comments": 366,
        "media": null,
        "permalink": "/r/netflix/comments/1i7a5uk/is_netflix_shooting_itself_in_the_foot_with_these/"
    },
    {
        "id": "1i7s8m4",
        "author": "Big-Acanthisitta8797",
        "title": "Just finished rewatching season 1 of The Night Agent and The Recruit.",
        "content": "My take is The Night Agent and The Recruit are smartly written, well-acted, and packed with edge-of-your-seat action. Who else is excited for the new seasons? Let's get ready for more thrilling twists and turns! 🎬🔥\nAnyone else planning to binge-watch season 2 for both shows?",
        "upvotes": 32,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1i7s8m4/just_finished_rewatching_season_1_of_the_night/"
    },
    {
        "id": "1i8cv2z",
        "author": "heyitsJanny02",
        "title": "XO KITTY SEASON 2",
        "content": "xo kitty doesn't have the best acting or plot but it somehow manages to get me seated through the whole season, it's like telenovelas where quality doesn't matter i'm just here to see where the characters gonna go hahahaha\n\nthough ,I'm quite disappointed to some scenes, plus their acting is not giving.\n\nNot excited for season 3 tho but I'm hoping that they will redeem and could improve it din naman. Still gonna watch S3 parin. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i8cv2z/xo_kitty_season_2/"
    },
    {
        "id": "1i84zp8",
        "author": "Remorse_123",
        "title": "Netflix Films Earn 18 Oscar Nominations, Led by Emilia Pérez",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i84zp8/netflix_films_earn_18_oscar_nominations_led_by/"
    },
    {
        "id": "1i80mks",
        "author": "ElephantElmer",
        "title": "Getting returned to the sign in screening when signing in",
        "content": "This happens whether I used my password or the sign in code. Has anyone experienced this and how did they resolve it? This has happened across multiple (but not all) devices.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i80mks/getting_returned_to_the_sign_in_screening_when/"
    },
    {
        "id": "1i891kd",
        "author": "NathLWX",
        "title": "WITCH WATCH - Official Trailer (April 2025)",
        "content": "Synopsis: Every witch has to choose their familiar. Unlike other witches who chose an animal, Nico decided to choose her childhood friend, Otogi. Otogi is opposed to it. Thing is, he'd revert back into a cow-tiger hybrid if he were to disobey the witch's order. Since both their parents are busy with works, both of them live under a roof. Otogi found out about the disaster prophesied to befall Nico within the year, and has to protect her as her bodyguard, while upholding his duty as her familiar.\n\nComing to Netflix, Hulu, and Crunchyroll, thanks to MBS, the producer of the anime. Same situation as DAN DA DAN. Most likely a simulcast (new episode every week).",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i891kd/witch_watch_official_trailer_april_2025/"
    },
    {
        "id": "1i7x0tp",
        "author": "andreimotin",
        "title": "Can’t sign in",
        "content": "Hey, so yesterday I was trying to log into Netflix on my new iPad mini, and when I tried logging in trough the app, it didn’t work, through the website, it didn’t either, I got this error Ion the website: “Something went wrong We are having technical difficulties and are actively working on a fix. Please try again in a few minutes.”, not in a few minutes, not in a few hours worked.\nI tried again today, and now, though I’m using the same password, the correct password, it says “Incorrect password for (my email). You can use a sign in code, reset your password or try again.”\nAnd in the app, I pretty much always get the same error always that’s stating that I’m using the wrong password, and it suggests using a sign in code, reset password or try again.\nAny solutions on it? Thanks in advance.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i7x0tp/cant_sign_in/"
    },
    {
        "id": "1i8hwe6",
        "author": "nicklz",
        "title": "The First Wall | Netflix | Trailer",
        "content": "",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i8hwe6/the_first_wall_netflix_trailer/"
    },
    {
        "id": "1i7jxur",
        "author": "BillDaily",
        "title": "Love, Death, and Robots season 4",
        "content": "Saw that the series was renewed for season 4 back in summer of 2022. Has there been any updates on filming or production?",
        "upvotes": 24,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i7jxur/love_death_and_robots_season_4/"
    },
    {
        "id": "1i7mfwt",
        "author": "Bulky-Board-5090",
        "title": "Is it worth to watch “The 8 show”serie",
        "content": "I just wanted to ask if it’s worth watching or not ,I’ve seen Squid Game and Alice in Borderland, and I’ve heard this series has a similar concept. If it’s really good, I think I’d enjoy it, but I don’t want to waste my time if it’s not that exciting or creative. Could you share your opinion about it without any spoilers, please?",
        "upvotes": 13,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1i7mfwt/is_it_worth_to_watch_the_8_showserie/"
    },
    {
        "id": "1i6tod5",
        "author": "misana123",
        "title": "Netflix Raising Prices in U.S. Again, Including First Hike on Ad-Supported Tier",
        "content": "",
        "upvotes": 1213,
        "comments": 524,
        "media": null,
        "permalink": "/r/netflix/comments/1i6tod5/netflix_raising_prices_in_us_again_including/"
    },
    {
        "id": "1i8fu4g",
        "author": "Crafty_Piece_9318",
        "title": "Did you guys forget you're a streaming platform? (I know this is an unofficial subreddit)",
        "content": "https://preview.redd.it/mleozycfjtee1.png?width=1832&amp;format=png&amp;auto=webp&amp;s=081d31af420171f1464ae150602b3063115868c7\n\nBanishing the playables to a neat corner is one thing, sure I'll put up with having to scroll past it. But shoving them down my throat and brandishing them front and center? You guys really need a new marketing department",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i8fu4g/did_you_guys_forget_youre_a_streaming_platform_i/"
    },
    {
        "id": "1i7sfpn",
        "author": "Emotional-Pop-4621",
        "title": "Banditos",
        "content": "Just finished season one and two of bandito anyone feel like it’s a different version of outbanks I loved season two and the different age groups all in one so every can appeal to it ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i7sfpn/banditos/"
    },
    {
        "id": "1i78ysr",
        "author": "TimesandSundayTimes",
        "title": "The fourth quarter of 2024 was the last for which Netflix will report numbers of paying subscribers, suggesting growth in numbers is slowing",
        "content": "",
        "upvotes": 55,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1i78ysr/the_fourth_quarter_of_2024_was_the_last_for_which/"
    }
]