[
    {
        "id": "1mje7bo",
        "author": "WiredForChaosAMA",
        "title": "Howdy, r/movies! I’m documentarian Rex Miller. I’ve earned 2 Peabodys, several Emmys and 2 Oscar shortlists. Past films include Citizen Ashe, A Crime on the Bayou and The Rape of Recy Taylor. My latest, HARLEY FLANAGAN: WIRED FOR CHAOS, tells the story a punk/hardcore legend, Harley Flanagan. AMA!",
        "content": "Howdy, r/movies! I'm Rex Miller, director of HARLEY FLANAGAN: WIRED FOR CHAOS. Harley Flanagan founded the hardcore punk band the Cro-Mags. He is currently the bassist, vocalist, and sole remaining founding member of the band.\n\nTrailer: [https://www.youtube.com/watch?v=ojOfP12Glok](https://www.youtube.com/watch?v=ojOfP12Glok)\n\nFrom August 8-15, there will be a limited time digital event for HARLEY FLANAGAN: WIRED FOR CHAOS – it will be available online for viewing at either https://wiredforchaos.com or https://geni.us/WiredForChaosEvent; aside from the film, the online event also features a Cro-mags performance Live at Hellfest 2022 and the Opening Night post-screening Q&amp;A.\n\n**ABOUT WIRED FOR CHAOS:**\n\nFounder of the pioneering band Cro-Mags, Harley Flanagan is a punk rock/hardcore legend who’s defied the odds – along with neglect, sexual abuse, drugs, violence and PTSD -- and lived to tell the tale.  The feature-length documentary, HARLEY FLANAGAN: WIRED FOR CHAOS, dives headfirst into the wild life and times of this larger-than-life icon and is a no-holds-barred ride, that isn’t just about the music; it’s about a man forged in fire who’s lived to tell the tale. \n\nRaised by a Warhol Factory “it” girl, Harley was thrown into the Lower East Side’s underground scene in the ’70s. Left to fend for himself, by his teens, he was squatting in Alphabet City, stealing food, dodging gangs, and living in a world that he describes as “some serious Lord of the Flies shit.” But, as his life descended into a hellish day-to-day, he was simultaneously becoming a punk rock legend: at the age of 11, he was drumming at CBGBs and Max’s Kansas City with his aunt’s band, the Stimulators. Sex, drugs and rock ’n’ roll weren’t a choice – they were survival.   But Harley was a fighter. Whether on stage, in the streets, or in the Jiu-Jitsu gym with Renzo Gracie, he never backed down. As the ferocious frontman of the Cro-Mags, he pushed NYC Hardcore into uncharted territory. But violence, addiction and a traumatic past left deep scars. The streets made him, but they also nearly destroyed him.\n\nDirected and Produced by Emmy and Peabody Award-winner Rex Miller (Citizen Ashe) for Rexpix Media, and produced by Laura Lee Flanagan, Elisabeth Haviland James and Rex Miller, HARLEY FLANAGAN: WIRED FOR CHAOS, WIRED FOR CHAOS dives deep into Harley’s past, but it’s not just war stories. It’s about what happens after. Friends like Flea, Henry Rollins, Ice T, Roger Miret, Keith Morris, Michael Imperioli, Matt Serra, Jocko Willink, Darryl Jenifer, Glenn Danzig, Brooke Smith, Marcia Resnick, Kate Schellenbach and the late Anthony Bourdain reveal the man behind the legend – confronting demons, raising a family, and sharing the knowledge of his experience to help others.  Harley Flanagan didn’t just live hardcore – he is hardcore, and WIRED FOR CHAOS is his story – loud, unfiltered, and real as hell\n\n**REX MILLER BIO:**\n\nFilmmaker Rex Miller's documentary career spans more than twenty five years. He recently directed (with Sam Pollard) the film Citizen Ashe (CNN Films), which premiered at Telluride and won Best Documentary at both the 2022 Critics Choice and Grierson Awards and was nominated for a Sports Emmy for Best Feature Doc. Miller was a frequent collaborator of Nancy Buirski’s, shooting six of her movies before her untimely death in 2023. His work has aired on Netflix, American Masters/PBS, American Experience, Starz, ESPN, Hulu, Apple TV and played many high profiles festivals including Sundance, Tribeca, Telluride, Venice, New York Film Festival, London Film festival, SxSW and DOCNYC.\n\nAsk me anything! Back at 4 PM ET tomorrow (Thursday 8/7) to answer your questions.",
        "upvotes": 43,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/pax3zqzt9ghf1.png?auto=webp&amp;s=b17e15f31bd845ee3b26d7b254bd41b9363c20da"
        },
        "permalink": "/r/movies/comments/1mje7bo/howdy_rmovies_im_documentarian_rex_miller_ive/"
    },
    {
        "id": "1mjn25b",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Paul Walter Hauser - Friday 8/8 at 1:30 PM ET - Actor in 'Richard Jewell', 'Americana', 'Black Bird', 'The Naked Gun', 'The Fantastic Four: First Steps', 'I Tonya', 'It's Always Sunny In Philadelphia', 'BlacKkKlansman', 'Inside Out 2', 'Cobra Kai', and lots more.",
        "content": "",
        "upvotes": 112,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rydu3s2y3ihf1.png?auto=webp&amp;s=764117549d53546cd1ba64f11a9f79dcbe57d21b"
        },
        "permalink": "/r/movies/comments/1mjn25b/amaqa_announcement_paul_walter_hauser_friday_88/"
    },
    {
        "id": "1mk3ftb",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Good Boy' - Follows a loyal dog who, upon moving to a rural farmhouse with his owner Todd, must confront supernatural forces invisible to his human companion to protect him from the malevolent entities dwelling there.",
        "content": "",
        "upvotes": 8860,
        "comments": 521,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fjtufq05amhf1.jpeg?auto=webp&amp;s=f99a6dc01ff90354b2197dbd89f4176ceb1aff70"
        },
        "permalink": "/r/movies/comments/1mk3ftb/official_poster_for_good_boy_follows_a_loyal_dog/"
    },
    {
        "id": "1mjy60a",
        "author": "Capable_Explorer_458",
        "title": "First image of Rebecca Ferguson in 'A House of Dynamite' directed by Kathryn Bigelow",
        "content": "",
        "upvotes": 2985,
        "comments": 279,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/klxh5lqo7lhf1.jpeg?auto=webp&amp;s=75e1246d58eecaea6c63c9eb5556e1305dad7a4f"
        },
        "permalink": "/r/movies/comments/1mjy60a/first_image_of_rebecca_ferguson_in_a_house_of/"
    },
    {
        "id": "1mjyk7c",
        "author": "darth_vader39",
        "title": "James Gunn to Direct ‘Next Movie in the Super-Family’ at DC Studios After ‘Superman’ Success",
        "content": "",
        "upvotes": 2173,
        "comments": 420,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/h_yfhn9w3-FnQ7nOR79FrFNZQFUDZHbYulXuMT8nAdM.png?auto=webp&amp;s=fd3d4e0c606c1f1be915bc5181b8de9b15b3e84b"
        },
        "permalink": "/r/movies/comments/1mjyk7c/james_gunn_to_direct_next_movie_in_the/"
    },
    {
        "id": "1mjy2ca",
        "author": "MarvelsGrantMan136",
        "title": "‘The Batman 2’ Is Preparing to Begin Shooting Next Spring, Warner Bros. Discovery Announces",
        "content": "",
        "upvotes": 1250,
        "comments": 297,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/y2XdcI25NcaNL_SH1SNjE6_njRn-CKF5pd1fsKq5pP8.png?auto=webp&amp;s=f33c98e4bdbc68a9d13897edc2e7268db7df4fac"
        },
        "permalink": "/r/movies/comments/1mjy2ca/the_batman_2_is_preparing_to_begin_shooting_next/"
    },
    {
        "id": "1mk2lv9",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'HIM'",
        "content": "",
        "upvotes": 668,
        "comments": 220,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/61ddht605mhf1.jpeg?auto=webp&amp;s=3f65dd7dd9f4e9bac6464803a6bde6e6a359e239"
        },
        "permalink": "/r/movies/comments/1mk2lv9/new_poster_for_him/"
    },
    {
        "id": "1mjk7dh",
        "author": "MarvelsGrantMan136",
        "title": "AMC Theatres Looks To Shorten Ad Preshow Following Studios’ Ire",
        "content": "",
        "upvotes": 8137,
        "comments": 1163,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/et6TD1PZfbmBo3DxXjnWBze8zZTlwJC6wQykA8YZxBk.jpeg?auto=webp&amp;s=f2c13e1aea20f310e2af95d31e24b8752fdd4c04"
        },
        "permalink": "/r/movies/comments/1mjk7dh/amc_theatres_looks_to_shorten_ad_preshow/"
    },
    {
        "id": "1mjz7qt",
        "author": "MarvelsGrantMan136",
        "title": "Skydance Closes $8 Billion Paramount Acquisition",
        "content": "",
        "upvotes": 468,
        "comments": 82,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qr7I8sO6EslX9grVT3qPrVQxUw7XhiZ2q3Nx7CtLp5I.jpeg?auto=webp&amp;s=f35b07a451d2001b3d1fda9026bda5a57c73a8c9"
        },
        "permalink": "/r/movies/comments/1mjz7qt/skydance_closes_8_billion_paramount_acquisition/"
    },
    {
        "id": "1mk3wid",
        "author": "PaulWalterHauserAMA",
        "title": "Hey /r/movies, I'm Paul Walter Hauser. You might know me from The Naked Gun, Fantastic Four, Black Bird, Richard Jewell, I Tonya, BlacKkKlansman, Cobra Kai or as Jamie Taco’s nemesis in I Think You Should Leave. I'm starring in Lionsgate's Americana, out in theaters August 15th. Ask me anything!",
        "content": "Hey r/movies, I'm Paul Walter Hauser.\n\nYou might know me from The Naked Gun, The Fantastic Four: First Steps, Black Bird, Richard Jewell, I Tonya, BlacKkKlansman, Queenpins, Kingdom, Cobra Kai or as Jamie Taco’s nemesis in I Think You Should Leave. Maybe other things too, like The Luckiest Man In America, Always Sunny in Philadelphia, Cruella, The Instigators, and Da 5 Bloods. You might've also heard my voice in Inside Out 2.\n\nMy newest film, Americana, premiered at SXSW and is out in theaters nationwide via Lionsgate August 15th.\n\n**Trailer:**\n\n[https://www.youtube.com/watch?v=ulZoLec80fs](https://www.youtube.com/watch?v=ulZoLec80fs)\n\nA shy waitress and a lovelorn military veteran find themselves in the crosshairs of a ruthless criminal as they try to retrieve a rare Native American artifact.\n\n**Cast:**\n\n* Sydney Sweeney\n* Paul Walter Hauser\n* Halsey\n* Eric Dane\n* Zahn McClarnon\n* Simon Rex\n\nAsk me anything! I'll be back Friday 8/8 (tomorrow) somewhere around 12:30 PM ET to 1:30 PM ET to answer questions.\n\n",
        "upvotes": 185,
        "comments": 146,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nm9sb3wy6mhf1.png?auto=webp&amp;s=059e378b356bb7b14f195ecfbb54ddbb01aa1fdd"
        },
        "permalink": "/r/movies/comments/1mk3wid/hey_rmovies_im_paul_walter_hauser_you_might_know/"
    },
    {
        "id": "1mjqu4o",
        "author": "soozerain",
        "title": "Rachel Weisz’s drunk acting in The Mummy is top notch.",
        "content": "It’s low-hanging fruit to make a post about the movie here but I just rewatched it after a decade plus and it stood out to me. She’s alternately charming, vulnerable and defiant during the course of the scene and her monologue is delivered perfectly 👌 \n\n“I….am a LIBR*Aaa*RIAN!”\n\nThe way she kinda draws out the middle part of that word is priceless. You can see the exact moment Rick falls in love with her. Brendan Fraser gives this bemused, but slightly dazed smile which I feel represents almost every guy in the audience too lol",
        "upvotes": 1188,
        "comments": 104,
        "media": null,
        "permalink": "/r/movies/comments/1mjqu4o/rachel_weiszs_drunk_acting_in_the_mummy_is_top/"
    },
    {
        "id": "1mj3qei",
        "author": "LowCarbScares",
        "title": "Behold, a landmark achievement for stunts and pyrotechnics. This is the first time in Hollywood history any stuntman was fully engulfed in flames for a scene!!! (The Thing From Another World, 1951)",
        "content": "The full body burn is credited to stuntman and actor Tom Steele! I have no idea how nobody died or got hurt doing this scene. It looks far more dangerous and insane than most fire stunts since then. Like they really did just throw buckets of gasoline at a stuntman while he is already engulfed in flames thrashing about the set",
        "upvotes": 10695,
        "comments": 317,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/et3m5uxzaehf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1mj3qei/behold_a_landmark_achievement_for_stunts_and/"
    },
    {
        "id": "1mj8tod",
        "author": "apple_kicks",
        "title": "Universal Pictures to Big Tech: We'll Sue If You Steal Movies For AI",
        "content": "",
        "upvotes": 4929,
        "comments": 284,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p0Fi-6hCwt1r8DcDUMfdabi-L_z4zsGj1R0Glozhff8.jpeg?auto=webp&amp;s=5686fa7b45fbfb5d489405cb631081299fa54b9e"
        },
        "permalink": "/r/movies/comments/1mj8tod/universal_pictures_to_big_tech_well_sue_if_you/"
    },
    {
        "id": "1mk0r7n",
        "author": "chucktastic88",
        "title": "The Thursday Murder Club - Official Trailer",
        "content": "",
        "upvotes": 84,
        "comments": 31,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vYgM5aX8iS7XMlrhGq66Y33F4TzdhtWg2cIYW3hfn5Q.jpeg?auto=webp&amp;s=e8697227df4a1efda9c5b459780b6999a1306f1a"
        },
        "permalink": "/r/movies/comments/1mk0r7n/the_thursday_murder_club_official_trailer/"
    },
    {
        "id": "1mjm62m",
        "author": "Sonia341",
        "title": "‘The Long Walk’ Rated “R” for Strong Bloody Violence and Grisly Images",
        "content": "",
        "upvotes": 764,
        "comments": 82,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/0sBao8jmgXYLDZXrPvQa-560_ktekewP8P-WPTiK_Fk.jpeg?auto=webp&amp;s=2733c73a6913f0c1e1f24e26dcf64fbb1c11fb1c"
        },
        "permalink": "/r/movies/comments/1mjm62m/the_long_walk_rated_r_for_strong_bloody_violence/"
    },
    {
        "id": "1mj6zk8",
        "author": "MarvelsGrantMan136",
        "title": "HIM | Official Trailer",
        "content": "",
        "upvotes": 4473,
        "comments": 860,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ssYRRVXFYehCQDjTw3X86ZO_rUptMNuS7PMC_lPTxiQ.jpeg?auto=webp&amp;s=b770e4f49403f4436509863138b4347a5e6b65c8"
        },
        "permalink": "/r/movies/comments/1mj6zk8/him_official_trailer/"
    },
    {
        "id": "1mjf2kj",
        "author": "MarvelsGrantMan136",
        "title": "First Image of Dave Bautista and Bobby Cannavale in 'Trap House' - In El Paso, Texas, an undercover DEA agent (Bautista) and his partner embark on a game of cat and mouse with their own teenage children, who are using their parents' tactics and intel to rob a dangerous cartel.",
        "content": "",
        "upvotes": 1551,
        "comments": 152,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/80tmotysgghf1.jpeg?auto=webp&amp;s=ed012d842ce91ec3adf9ad4f54c0e8746b86243a"
        },
        "permalink": "/r/movies/comments/1mjf2kj/first_image_of_dave_bautista_and_bobby_cannavale/"
    },
    {
        "id": "1mjvyq4",
        "author": "1961Deckard",
        "title": "The magic of cinema in its purest form: opening scene of West Side Story (1961), choreography, music and camera in perfect harmony",
        "content": "Few films have achieved such a memorable opening as West Side Story (1961), directed by Robert Wise and Jerome Robbins, the latter also responsible for the original Broadway choreography. The opening scene, without a single word, immediately immerses us in the tension between youth gangs in New York in the 1950s.\n\nWith music by the legendary Leonard Bernstein, lyrics by Stephen Sondheim and photography by maestro Daniel L. Fapp, this film became a benchmark of the modern musical. It won 10 Oscars, including Best Picture.",
        "upvotes": 101,
        "comments": 30,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/dvcsiz62mkhf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1mjvyq4/the_magic_of_cinema_in_its_purest_form_opening/"
    },
    {
        "id": "1mj798u",
        "author": "MarvelsGrantMan136",
        "title": "New Posters for 'HIM' - A legendary quarterback (Marlon Wayans) is tasked with training a rising young athlete (Tyriq Withers) who goes to train at the aging athlete’s isolated compound.",
        "content": "",
        "upvotes": 3203,
        "comments": 327,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/z3wxsjih0fhf1.jpeg?auto=webp&amp;s=79bd6323495b412e5d67948775a53cf616a77354"
        },
        "permalink": "/r/movies/comments/1mj798u/new_posters_for_him_a_legendary_quarterback/"
    },
    {
        "id": "1mjzozu",
        "author": "tinoy1989",
        "title": "Which Time Travel Movie Blew Your Mind?",
        "content": "What’s the most thought-provoking time travel movie you’ve seen? Indie, low-budget, or foreign—anything goes. I’m looking for films that hit hard emotionally or make you really think. Drop your pick and tell me why it stayed with you. Let’s talk time loops, twist endings, paradoxes, and unforgettable stories.",
        "upvotes": 54,
        "comments": 400,
        "media": null,
        "permalink": "/r/movies/comments/1mjzozu/which_time_travel_movie_blew_your_mind/"
    },
    {
        "id": "1mjv8n9",
        "author": "New-Fan-4632",
        "title": "Terminator 2: Judgement Day is the gold standard of utilization of both practical and digital effects.",
        "content": "In T2, The T-800 (Arnold) was 100% practical effects. The T-1000 (liquid metal Robert Patrick) was about 50% CGI. In fact, many of the scenes that general moviegoers assume may be CGI are actually practical. \n\nIn the hospital chase when Robert Patrick is being shot at, he has tiny holes in a shirt - devices are hidden inside them, that when operated via remote control, they expand outward through the hole revealing the metal plate, aka gunshot. The elevator blast was a dummy on a spring. The shotgun blast through the windshield of the nitrogen truck was a dummy. The blade through the hospital security guard was a real blade on a dummy's head from the back view. Eye hole was a dummy. The loss of legs when frozen was a amputee stuntman. CGI was only used when we see him in metal form reverted back to his Robert Patrick mode, the bullet holes reverting to normal on camera, the bar scene, the helicopter morph, and a couple of other shots.\n\nIf T2 were made today, not only would the T-1000 be 100% CGI, most of the T-800's effects would be CGI, too.\n\nIt's the gold standard for me because they only used CGI when practical was not possible, like things that are liquid taking shape. For mechanical structures like a machine, you don't need it, as a machine can be built. For puppets like Chucky, you don't need it, because animatronic dolls can be made.  Now it's used for almost anything that isn't human. ",
        "upvotes": 81,
        "comments": 45,
        "media": null,
        "permalink": "/r/movies/comments/1mjv8n9/terminator_2_judgement_day_is_the_gold_standard/"
    },
    {
        "id": "1mk1dhf",
        "author": "ebradio",
        "title": "The Rocky Horror Picture Show Celebrates 50th Anniversary with Nationwide Screening Tour, Fan Convention, New Reissues of Film and Soundtrack",
        "content": "",
        "upvotes": 29,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SuKYJSjoQstYUvIAJp75mABshi_0W2iGhz9WJDAzsB0.jpeg?auto=webp&amp;s=02f30e6916f5e409af7fa03e477dbc3f2d83ed37"
        },
        "permalink": "/r/movies/comments/1mk1dhf/the_rocky_horror_picture_show_celebrates_50th/"
    },
    {
        "id": "1mjm7o8",
        "author": "DiaDeLosMuebles",
        "title": "Going into \"Companion\" blind and why I refuse to watch trailers",
        "content": "WARNING: MAJOR Companion Spoilers ahead\n\n\n\nI'm one of those people who refuse to watch trailers.  It annoys the hell out of my wife.  But anyway, I knew nothing at all about the movie Companion other than Jack Quaid and the poster.  Which had a girl with white eyes.  No idea why.\n\n\\*Spoilers\\*\n\nI'm watching it, and I see this dude's girl get shit on by his friends and then almost raped and she has to kill to protect herself.  Then people rush to help the rapist. And I'm like \"wtf?\".  Then, he shuts her down and my jaw hit the floor.  I had no idea she was a robot and they did such a good job hiding it until then.  \n\nFast forward and, then I learn that it was on purpose and that this is actually a murder/heist. Second turn I didn't see coming. \n\nAfter watching the movie I decided to see if the trailer spoiled anything.  And. I guess it's hard to market a robot murder movie without a robot in the trailer.  But the reveal in the movie was amazing. And then they show the millions in cash and spoil the heist part too!  \n\nAnyway, I really enjoyed the experience of watching the movie and it kills me that anybody who saw the trailer wouldn't experience the same movie I did. ",
        "upvotes": 238,
        "comments": 100,
        "media": null,
        "permalink": "/r/movies/comments/1mjm7o8/going_into_companion_blind_and_why_i_refuse_to/"
    },
    {
        "id": "1mjxth9",
        "author": "NoCulture3505",
        "title": "Warner Bros. Discovery Swings to Q2 Profit, Boosted by HBO Max Expansion, ‘Minecraft’",
        "content": "",
        "upvotes": 31,
        "comments": 14,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Mcd61j8Iyk11CTwtHSS06J8mzEG-NFzKyw1LU8-SjGc.jpeg?auto=webp&amp;s=36b1e661a9dcd3ee4f2ebf559a12b6002402411f"
        },
        "permalink": "/r/movies/comments/1mjxth9/warner_bros_discovery_swings_to_q2_profit_boosted/"
    },
    {
        "id": "1mj7xad",
        "author": "MarvelsGrantMan136",
        "title": "Aubrey Plaza to Star as Heidi Fleiss in Upcoming Biopic From Pinky Promise",
        "content": "",
        "upvotes": 1010,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1gniVGc5q7FlPITZyTHamoHHuPuO6_Fgf11tyFh2Olc.jpeg?auto=webp&amp;s=f5892014978dca73e58785d3a4f82e7c05c25b47"
        },
        "permalink": "/r/movies/comments/1mj7xad/aubrey_plaza_to_star_as_heidi_fleiss_in_upcoming/"
    },
    {
        "id": "1mjc4hy",
        "author": "girafa",
        "title": "What's a good romantic movie where the protagonist doesn't get the girl/guy?",
        "content": "Friend of mine and I were talking, she said she loves romantic movies where they end up alone at the end. \n\nCould be that they don't end up together because a partner dies, they don't match in their personalities, the Nazis are chasing them, etc. Doesn't matter. Just the main character ends up alone. \n\nWhat's the first thing that comes to mind?",
        "upvotes": 578,
        "comments": 808,
        "media": null,
        "permalink": "/r/movies/comments/1mjc4hy/whats_a_good_romantic_movie_where_the_protagonist/"
    },
    {
        "id": "1mj408c",
        "author": "NoCulture3505",
        "title": "If I Had Legs I'd Kick You | Official Trailer HD | A24",
        "content": "",
        "upvotes": 1645,
        "comments": 221,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/AYbaw0giOwbGnwXATKG3dqyMtUyZfBx6tD0pG1GE60Y.jpeg?auto=webp&amp;s=21f248112e38f6d6e1d321e67be2ebaf65a01ac4"
        },
        "permalink": "/r/movies/comments/1mj408c/if_i_had_legs_id_kick_you_official_trailer_hd_a24/"
    },
    {
        "id": "1mjzmam",
        "author": "KillerCroc1234567",
        "title": "Blue Moon - Official Trailer - Only In Cinemas November 14",
        "content": "",
        "upvotes": 16,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/eNQjkc3B9IdNLJGjazvBoRMa0Fx_tBkWxckUygQbikk.jpeg?auto=webp&amp;s=bdf0fe97cd4e1db83b57e6f6586503ab57210b90"
        },
        "permalink": "/r/movies/comments/1mjzmam/blue_moon_official_trailer_only_in_cinemas/"
    },
    {
        "id": "1mjzau0",
        "author": "KillerCroc1234567",
        "title": "Warner Bros. Targeting 12-14 Theatrical Releases Annually Across Key Labels",
        "content": "",
        "upvotes": 15,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-AkvOYQr-dzDYDi4Li4AWuSk0d3pztZgwAdMZ2V9I_Y.jpeg?auto=webp&amp;s=51e425c348f6869630ef17579ef2de05ec97faa1"
        },
        "permalink": "/r/movies/comments/1mjzau0/warner_bros_targeting_1214_theatrical_releases/"
    },
    {
        "id": "1mk3noq",
        "author": "Bradyboy11",
        "title": "How many movies have attempted the “It was all a dream” trope and actually pulled it off?",
        "content": "How many movies (or shows) have attempted the closing sequence where everything was all just in the main character’s head? Has this been done well? Who was the first to do it?\n\nPeople always talk about how this would be the worst ending to whichever show they’re invested in, but at some point when this happened for the first time, it must have been an interesting take… right?",
        "upvotes": 11,
        "comments": 89,
        "media": null,
        "permalink": "/r/movies/comments/1mk3noq/how_many_movies_have_attempted_the_it_was_all_a/"
    },
    {
        "id": "1mj7y0m",
        "author": "AggravatingLeg5789",
        "title": "Paul Walter Hauser on his 'psychotic' year and four massive films",
        "content": "Americana was just one of these things where I read it and I thought, \"Well, this could be the next somebody as far as auteurs or people that everyone gets excited about.\" The way they did with Shane Black and Quentin Tarantino and Diablo Cody. I thought, \"This is a voice, this is a brain working in concert with voice, and this is someone who loves storytelling in cinema.\" You could just tell right on the page. So I was ecstatic to get to be any part in that film. And it just so happens the way he cast it, I would randomly text Tony Tost and be like, \"Hey, what about so-and-so for this or that?\" I do that with everything I act in, whether I produce or not. I'm always just giving ideas and trying to be helpful. And Tony knew exactly who he wanted for every role. And he was really dogged about knowing what he knew and sticking to his vision. And then when I saw the movie, I was like, \"Oh my God, he got great performances out of everyone.\" There's no weak link in the bunch. It's a film that is so dependent upon the writing and the actors, you know? We don't have any big budget-y stuff to throw at you. So it really had to work, and like I've been saying in all my press, I think it's the best movie I've ever been a part of. I really, really do.",
        "upvotes": 703,
        "comments": 91,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Uh7P-fnVvmz2k4jXdGpj8yZ39P_NuOQAnfba6He6-6E.jpeg?auto=webp&amp;s=212361e27508549e3c4b5e5ca5779c880ad4c2d3"
        },
        "permalink": "/r/movies/comments/1mj7y0m/paul_walter_hauser_on_his_psychotic_year_and_four/"
    },
    {
        "id": "1mk1253",
        "author": "Imaginary_Ride_6185",
        "title": "What’s a movie you’ve never rewatched, not because it was bad, but because it brought up something you weren’t ready for?",
        "content": "Not talking about horror or gore ( yeah, those can count too). I mean a movie that hit you in a weirdly personal way.\nLike, it reminded you of something you didn’t excpect. Or made you feel stuff you didn’t want to bat an eye on at the time.\nOr maybe it just got too personally real and you’ve avoided it ever since.\n\nYou still think about it sometimes, but you haven’t gone back to it and probably won’t.",
        "upvotes": 12,
        "comments": 47,
        "media": null,
        "permalink": "/r/movies/comments/1mk1253/whats_a_movie_youve_never_rewatched_not_because/"
    }
]