[
    {
        "id": "1o910r7",
        "author": "torinomod",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 2,
        "comments": 18,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/upRiLp7Isj_FLiwrKxS4RdVlRpIYCWY_A7kAQ5xmX4I.jpeg?auto=webp&amp;s=faac09b31cbf736f8629642ea6cd085999a6216a"
        },
        "permalink": "/r/torino/comments/1o910r7/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1o90rn3",
        "author": "torinomod",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[SHAKEUP TORINO](https://www.instagram.com/shakeuptorino/): community Whatsapp creata per fare nuove amicizie organizzando eventi molto semplici come serate al pub, passeggiate in centro o pizzate 😀 (mandare DM su instagram per essere invitati)\n\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 15,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o90rn3/la_piola_friends_meetup/"
    },
    {
        "id": "1reeiwi",
        "author": "Maleficent-Regret802",
        "title": "Stiamo pensando di creare un gruppo whatsapp per andare al cinema in gruppo. Qualcuno sarebbe interessato?",
        "content": "Ciao!\n\nL'altro giorno avevo fatto un post in cui chiedevo se ci fossero cineforum a Torino. Purtroppo la risposta è stata negativa, ma alcune persone hanno manifestato il proprio interesse.\n\nQuindi, è nata un po' lì, sul momento, l'idea di creare un gruppo whatsapp per beccarsi e organizzare uscite o andare al cinema e parlarne in compagnia una volta usciti dalla sala. Sono dell'idea che la sala sia un luogo magico e che parlare di un film dopo la visione sia parte integrante di quest'esperienza.\n\nQualcuno qui sarebbe interessato? Se sì, fatemi sapere (qui o in privato)!",
        "upvotes": 36,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1na5cf0kgnlg1.jpeg?auto=webp&amp;s=1a93e5f62518e81b2061cb1d9828db8ae358a917"
        },
        "permalink": "/r/torino/comments/1reeiwi/stiamo_pensando_di_creare_un_gruppo_whatsapp_per/"
    },
    {
        "id": "1reqyfk",
        "author": "glorious-ahole",
        "title": "Looking for new friends",
        "content": "hey everyone I'm a 24 year old guy. i am new to turin and im looking to meet new people here in the city. I like to reading books, cycling, playing board games and getting drunk haha. if any of these sound something like you'd be interested in, let me know. ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1reqyfk/looking_for_new_friends/"
    },
    {
        "id": "1rejbqx",
        "author": "MagnoliaTree888",
        "title": "Università di Torino",
        "content": "Ciao!\n\nVolevo sapere se qualche studente UniTo fosse disponibile a darmi una mano perché sono un po' persa e su Universitaly non mi hanno risposto purtroppo.\n\nVorrei provare a iscrivermi all'università di Torino l'anno prossimo (scienze della formazione primaria), ma prima di mettermi a studiare per il test vorrei parlare con uno studente per capire un po' di cose che sul sito non sono chiarissime.\n\nSe avete consigli di qualsiasi tipo fatemi sapere :) \n\nho scritto su un gruppo telegram ma non so quanto sia attivo, ho anche pensato di contattare un rappresentante studenti ma non so se sia il caso e se rientri nel loro ruolo 😅 \n\nApprezzo qualsiasi risposta!\n\ngrazie mille ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rejbqx/università_di_torino/"
    },
    {
        "id": "1reaynr",
        "author": "enoughtodo67",
        "title": "Ristoranti/trattorie cinesi",
        "content": "Ciao popolo torinese...\nVorrei conoscere qualche nuovo ristorante, trattoria o perché no, anche street food di cucina cinese autentica.\nNon le solite pietanze (che mi pare di avere capito nemmeno mangino in Cina), ma qualcosa di particolare.\nAvete suggerimenti?🤍",
        "upvotes": 11,
        "comments": 30,
        "media": null,
        "permalink": "/r/torino/comments/1reaynr/ristorantitrattorie_cinesi/"
    },
    {
        "id": "1reqnak",
        "author": "MissLonely988",
        "title": "Qualcuno ha frequentato i corsi di teatro della Sergio Tofano?",
        "content": "Ciao a tutti! Vorrei mettermi alla prova con il teatro e, tra le tante possibilità che offre Torino, ho visto che ci sono dei corsi presso la Scuola Sergio Tofano. Non potrei frequentare il corso accademico per motivi di lavoro, ma ho visto che hanno varie opzioni. Qualcuno di voi l'ha frequentato o comunque conosce questa realtà? 🤍",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1reqnak/qualcuno_ha_frequentato_i_corsi_di_teatro_della/"
    },
    {
        "id": "1refkf2",
        "author": "Plenty-Hat-6661",
        "title": "Questiom about a traffic fine",
        "content": "Ciao, a dicembre eravamo a Torino con un'auto a noleggio. Ho appena ricevuto una notifica dalla compagnia di autonoleggio che mi comunica che ho una multa con la Polizia di Torino - VIOLAZIONE CIRCOLAZIONE CENTRI ABITATI. Se non ricordo male, Google Maps ci ha guidato attraverso il centro città. C'è un sito dove posso verificare se la multa è stata emessa? Ho un numero di denuncia, ma mi trovo in un altro paese dell'UE e dubito che i nostri servizi postali consegneranno la multa?\n\nSapevo che c'era qualcosa che non andava visto che eravamo l'unica auto in centro 🥲\n\nGrazie!",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1refkf2/questiom_about_a_traffic_fine/"
    },
    {
        "id": "1rej6ls",
        "author": "stirlingWizard",
        "title": "Incontri scacchistici",
        "content": "Ciao, sono un ragazzo di 32 anni, sto cercando un amico/a a Torino per giocare a scacchi e migliorarsi a vicenda nel tempo libero (che non è tanto purtroppo). Ho un ELO attuale di 1100 circa (non ufficiale), quindi non ho grosse pretese. \n",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1rej6ls/incontri_scacchistici/"
    },
    {
        "id": "1refftz",
        "author": "Separate_Fix_",
        "title": "Cercasi Co-Founder",
        "content": "Ciao a tutti,\n\nNon so se sono OT ma ho pensato che questo approccio possa essere promettente.\n\nCerco un co-founder per una serie di progetti principalmente di natura tech.\n\nHo già dei progetti avviati e ne voglio avviare altri.\n\nPer poterlo fare nel modo giusto so di aver bisogno di almeno uno (o più) cofounder.\n\nSe vi sentite incentivati a mettervi in gioco e vedere come funzionano le cose quando sei autonomo scrivetemi e parliamone, spero che ci sia reciproco interesse.\n\nLe idee sono tante e seguo l’approccio a container per i miei progetti.\n\nNon ho affiliazioni con prodotti ne aziende, sono semplicemente una persona che si lancia in qualcosa di nuovo (di nuovo).\n\nGrazie :)\n\nEdit:\n\nNon l’ho specificato ma sono progetti che vorrei far partire in città o nelle limitrofe",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1refftz/cercasi_cofounder/"
    },
    {
        "id": "1re7xpv",
        "author": "Albert230398",
        "title": "Band stile Royal Blood",
        "content": "Ciao! Non so se è il posto giusto; sono un batterista di 27 anni, mi piacerebbe avviare o unirmi a un progetto di inediti alt-rock stile Royal Blood.\n\nQualcuno interessato? ",
        "upvotes": 4,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1re7xpv/band_stile_royal_blood/"
    },
    {
        "id": "1rebu3p",
        "author": "Tusus_",
        "title": "Question about public transport card",
        "content": "Hi, \n\nI have a question regarding the BIP card and the monthly subscription. I just got the card and managed to get one month but I was wondering that if I need more months later is it possible to buy them online and load them to the card. Thank you for the answers. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rebu3p/question_about_public_transport_card/"
    },
    {
        "id": "1re8oin",
        "author": "sodomaioo",
        "title": "Di chi e?",
        "content": "Ciao ho trovato questo cofano di auto nel mio giardino di quale auto è? ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1re8oin/di_chi_e/"
    },
    {
        "id": "1rdy70r",
        "author": "nickt001",
        "title": "\"Le cansson dla Piola\" qualcuno hai testi di questi album",
        "content": "Ho scoperto Roberto Balocco da poco, mi sta facendo innamorare del mio dialetto in modo assai divertente, ma non capisco tutto, e non ho persone vicine a cui far ascoltare per tradurre senza scadere in grande imbarazzo\n\nConoscete altri cantautori che cantano in piemontese?\n\n\n\n",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1rdy70r/le_cansson_dla_piola_qualcuno_hai_testi_di_questi/"
    },
    {
        "id": "1rdp1p2",
        "author": "Maleficent-Regret802",
        "title": "Cineclub a Torino?",
        "content": "Ne esistono, per caso? O posti in cui si parla di cinema in generale(?)",
        "upvotes": 12,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1rdp1p2/cineclub_a_torino/"
    },
    {
        "id": "1rdtc2j",
        "author": "LaFaticaDellaRagione",
        "title": "Vivere ad Airasca",
        "content": "Ciao a tutti, \n\nsto valutando l’acquisto di una casa ad Airasca, comune sulla direttrice Pinerolo-Torino. Io lavoro a Torino e dal lunedì al venerdì dovrei muovermi per venire in città. Secondo voi è fattibile? Qualcuno che vive tra Torino e Pinerolo potrebbe darmi qualche feedback? Sto valutando di comprare un appartamento di ottima metratura immerso nel verde. Sono automunito ma non mi dispiacerebbe utilizzare anche il treno (porta Susa dovrebbe essere raggiungibile in 31 minuti). \n\nGrazie ",
        "upvotes": 5,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1rdtc2j/vivere_ad_airasca/"
    },
    {
        "id": "1rdkld9",
        "author": "kacokaj_kejdis",
        "title": "Cosa vuol dire o chi l'ha fatto e perche l'ha fatto la scritta nacho sui muri?",
        "content": "",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1rdkld9/cosa_vuol_dire_o_chi_lha_fatto_e_perche_lha_fatto/"
    },
    {
        "id": "1rdozfe",
        "author": "Dangerous_Bite_7601",
        "title": "Cerco signora per pulizie a casa",
        "content": "Ciao ragazzi come da titolo, entrando a casa nuova venerdì cerco qualcuno che possa aiutarmi un paio d'ore almeno per le pulizie di casa..sapreste indicarmi associazioni/gruppi/ o qualcuno di vostra conoscenza?\n\nEdit: zona fermata metro Spezia",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rdozfe/cerco_signora_per_pulizie_a_casa/"
    },
    {
        "id": "1rdq05x",
        "author": "Accurate-Writing6926",
        "title": "Primo lavoro per Ing Meccanico magistrale",
        "content": "Ciao\n\nQuali sono le opportunità per un neo laureato in ing meccanica qui a Torino?\n\nQuali aziende é utile controllare o sono migliori di altre?\n\nSe fossero aziende di consulenza mi chiedevo quali dessero la possibilità di esperienze più “utili” e non puro body rental senza grandi risultati in termini di formazione e crescita\n\nSecondo voi quale é un range onesto di RAL per un primo impiego?\n\nOgni altro consiglio é ben accetto\n\nGrazie",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1rdq05x/primo_lavoro_per_ing_meccanico_magistrale/"
    },
    {
        "id": "1rdi4dp",
        "author": "DanielVip3",
        "title": "Gruppi e/o canali per lingue UniTO",
        "content": "Ciao! Sto cercando dei gruppi o canali per chiedere informazioni relativi alle lauree magistrali in lingue di UniTO, ma non trovo nulla (o quasi), essenzialmente solo canali abbastanza vuoti fatti da qualche associazione.\n\nNon esiste un gruppo o canale per i corsi di lingue magistrali? Per chiedere informazioni sui corsi di laurea a chi li ha già sperimentati.\n\nGrazie mille per l'aiuto!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1rdi4dp/gruppi_eo_canali_per_lingue_unito/"
    },
    {
        "id": "1rdh4c3",
        "author": "AwkwardPossibility94",
        "title": "Application date for Global Law - UniTO",
        "content": "Im planning on studying the undergraduate of Global Law and Transnational Studies at UniTO but apparently the applications are not available yet, meanwhile the other programs are already open and ready for one to apply. I even thought they might not allow applications this year. I'm a little worried. I've messaged the university but no answer so far. Does anybody know anything about this?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1rdh4c3/application_date_for_global_law_unito/"
    },
    {
        "id": "1rcubl5",
        "author": "South-Pair-3440",
        "title": "Calabrese alla UniTo",
        "content": "Ciao a tutti! Sono uno studente calabrese e studio a Torino. Finora ho fatto solo esami scritti, ma a breve inizierò con gli orali e ho un po' d'ansia.\n\nIl mio accento non è eccessivo, però inevitabilmente in alcune frasi viene fuori. La mia paura è che il professore possa farci caso e giudicare negativamente  la forma anziché la sostanza, magari decurtando dei punti al voto finale.\n\nVorrei quindi chiedere un parere:\n\n \\-Ai fuori sede meridionali: che esperienze avete avuto agli orali?\n\n \\-Ai piemontesi: onestamente, come percepite l'accento meridionale ? Notate pregiudizi o è solo una mia paranoia?",
        "upvotes": 22,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1rcubl5/calabrese_alla_unito/"
    },
    {
        "id": "1rcrvcq",
        "author": "man-teiv",
        "title": "Chi è SIT, la cordata che prende il posto del Comala nella gestione degli spazi della ex caserma Lamarmora",
        "content": "",
        "upvotes": 15,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1rcrvcq/chi_è_sit_la_cordata_che_prende_il_posto_del/"
    },
    {
        "id": "1rcpf9b",
        "author": "NoraPinkUniverse",
        "title": "Ristoranti giapponesi autentici a Torino",
        "content": "Quali sono i migliori ristoranti giapponesi autentici a Torino per uno shoyu ramen con gyoza o una tempura di gamberi o un okonomiyaki? Come riferimenti ho Fukurou/Ninomiya o Poporoya a Milano, vorrei avere un'esperienza simile anche a Torino :) grazie",
        "upvotes": 13,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1rcpf9b/ristoranti_giapponesi_autentici_a_torino/"
    },
    {
        "id": "1rcsz2i",
        "author": "ghostofTorino",
        "title": "Chiavi perse alla fermata 391 del 10",
        "content": "Se hai perso le chiavi o conosci qualcuno che ha perso le chiavi alla fermata \"391 filadelfia\" del tram 10 vicino allo stadio Olimpico in c.so Agnelli, la serata di lunedì 23 febbraio \\~ alle 21, per favore scrivimi i dettagli.\n\nLe terrò con me finché non aprirà il bar qui vicino, poi le lascerò lì e aggiornerò questo post con la loro posizione..",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rcsz2i/chiavi_perse_alla_fermata_391_del_10/"
    },
    {
        "id": "1rcmf6a",
        "author": "Ok-Elevator-2778",
        "title": "Pool game/ billiards / snookers",
        "content": "I want to know where the Pool game is cheaper in Torino, with decent boards , since me and my friends are noobs, we are spending more time playing the game , we usually play 2 times a week and 3-4 hours each time, and we end up paying 40-50 euros each time in funmily. I don't know the hourly price now . but I would like to know any other cheaper alternatives .\n\nthank you in advance. probably I might miss some details here so please let me know",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1rcmf6a/pool_game_billiards_snookers/"
    },
    {
        "id": "1rclvgc",
        "author": "mattgwa",
        "title": "Gruppo musei molto vivace a Torino",
        "content": "Ciao! Ho scoperto un gruppo che organizza visite ai musei. È totalmente gratuito e basato sul volontariato, si paga solo l'ingresso al museo nel caso non si avesse la Carta Musei. Ogni weekend organizzano una visita a un museo o una gita. Ho incontrato persone molto gentili e simpatiche. Siccome mi è piaciuto molto condivido il link per entrare: https://chat.whatsapp.com/JrqhgFdYRwuKpie59Hu1lW",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1rclvgc/gruppo_musei_molto_vivace_a_torino/"
    },
    {
        "id": "1rdft20",
        "author": "No_Kitchen_2850",
        "title": "Il tuo nuovo tatuatore è arrivato",
        "content": "Ciao a tutti!  \nSono un tatuatore con 10 anni di esperienza in diversi stili — dal fineline ai lavori più coprenti, sempre con l’obiettivo di creare tatuaggi ben eseguiti, pensati per durare e invecchiare bene.  \nMi sono trasferito recentemente a Torino e, al momento, ho disponibilità per nuovi lavori.  \nSe stavi cercando un tatuatore, l’hai appena trovato.  \nPer conoscere i miei lavori o fare due chiacchiere, scrivimi pure.  \n👉 [instagram.com/agumtattoos](https://www.instagram.com/agumtattoos)",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rdft20/il_tuo_nuovo_tatuatore_è_arrivato/"
    },
    {
        "id": "1rcnsuv",
        "author": "[deleted]",
        "title": "Any French- or German-speaking people?",
        "content": "Hi! I'm an Italian student from Turin. I'm currently studying German, and I speak French, and I was looking for someone to do some practice with in those languages.\nIf you're interested in practicing your Italian, or simply meeting someone new, I'd be glad to help 🙌",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1rcnsuv/any_french_or_germanspeaking_people/"
    },
    {
        "id": "1rckl89",
        "author": "Purple_Life_7850",
        "title": "Cerco roba da fare a torino",
        "content": "ciao! sono un ragazzo di 17 anni di Novara, vado a Torino 1 volta ogni circa 2 mesi e solitamente passo il tempo con amiche, ma spesso non abbiamo tappe ben definite o cose specifiche da fare.\n\nSo che questo è l'ennesimo post di questo genere ma mi piacerebbe sapere posti carina dove poter andare.\n\nmi piace molto anche la roba underground, musica, videogiochi, fumetti, etc.\n\nma in generale tutto mi andrebbe bene pur di esser divertente e passare un buon attimo diverso dal solito in una città più grande.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1rckl89/cerco_roba_da_fare_a_torino/"
    }
]