[
    {
        "id": "1o6g02t",
        "author": "ScreamAndCryAMA",
        "title": "Hi reddit! I'm EG Daily. I've voiced many of your childhood-favorite characters like Tommy Pickles in Rugrats, Buttercup in Powerpuff Girls, Mumble in Happy Feet &amp; Bamm-Bamm in The Flintstones. You might also know me from live-action films like Valley Girl &amp; Pee-Wee's Big Adventure. Ask me anything!",
        "content": "Hi reddit!\n\nI'm EG Daily. You might know me as the voice of...:\n\n* Tommy Pickles - Rugrats\n* Buttercup - The Powerpuff Girls\n* Babe - Babe: Pig in the City\n* Baby Mumble - Happy Feet\n* Bamm-Bamm - The Flintstones\n* Froggy - The Little Rascals\n* Julius - Julius Jr\n\n...and lots more!\n\nYou might've also seen in in live-action films such as Valley Girl, Pee-Wee's Big Adventure, The Devil's Rejects, Streets of Fire, Better Off Dead.\n\nFull list of credits here:\n\n[https://www.imdb.com/name/nm0197354/](https://www.imdb.com/name/nm0197354/)\n\nNew newest project, SCREAM AND CRY HORROR MOVIE REVIEW, is now streaming on Magnolia Selects.\n\n**Synopsis:**\n\n“Scream and Cry Horror Movie Review” follows a goth girl, Scream (Mimi Torres), and a possessed puppet rat, Cry (voiced by E.G. Daily) as they battle demons and review horror movies in their chamber basement. The campy horror-comedy review show chronicles the devilish stories of both Scream and Cry while discussing the very best in horror from the Magnolia Pictures catalog alongside a revolving cast of characters including Juliet Landau, Thom Pinto, Bill Prokopow and Donte Paris. The films being reviewed in the first season include Agnes, Alone, Amulet, Censor, Held, Kiss of the Damned, Severance, Splinter, The Canyon, The Sacrament, Tucker and Dale Vs. Evil and V/H/S: Viral. Participating in today’s AMA are both Mimi Torres and E.G. Daily as well as show creator, Heidi Holicker. \n\n**Here's our trailer:**  \n[https://www.youtube.com/watch?v=jz-Ut-ekzms](https://www.youtube.com/watch?v=jz-Ut-ekzms)\n\n  \nAsk me anything! I'll be back at 4 PM ET today (Tuesday 10/14) to answer your questions.",
        "upvotes": 878,
        "comments": 201,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/6qcojazbu2vf1.png?auto=webp&amp;s=ef1671a7788896050cd8f169f6e6886f44416e86"
        },
        "permalink": "/r/movies/comments/1o6g02t/hi_reddit_im_eg_daily_ive_voiced_many_of_your/"
    },
    {
        "id": "1o6ta5r",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Mark Mancina - Thursday 10/16 at 1:00 PM ET - Composer of 'Speed', 'Moana 1 &amp; 2', 'Training Day', 'Bad Boys', 'Twister', 'Brother Bear', 'Tarzan', 'Juror #2', 'Con Air', and lots more.",
        "content": "",
        "upvotes": 31,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/f1isk7lqg5vf1.png?auto=webp&amp;s=de2615afe5dfc13acd6730957ee09b81def520a0"
        },
        "permalink": "/r/movies/comments/1o6ta5r/amaqa_announcement_mark_mancina_thursday_1016_at/"
    },
    {
        "id": "1o7clot",
        "author": "MarvelsGrantMan136",
        "title": "‘One Battle After Another’ Projected to Lose $100 Million Theatrically as ‘Smashing Machine’ and Others Also Struggle Due to Oversized Budgets",
        "content": "",
        "upvotes": 4847,
        "comments": 1683,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xjQ7RsKgaWmH8L0BETqAAQMXaxiJi5xze7JB9eI8kRc.jpeg?auto=webp&amp;s=166a46947fabacab3341ca0948d2fe584b86a9b6"
        },
        "permalink": "/r/movies/comments/1o7clot/one_battle_after_another_projected_to_lose_100/"
    },
    {
        "id": "1o79ll5",
        "author": "TheLastDragonAMA",
        "title": "What's up reddit! I'm Taimak, star of THE LAST DRAGON, the 1985 cult classic martial arts film. It's coming back to theaters for its 40th anniversary. Ask me anything!",
        "content": "What's up reddit! Taimak here. You might know me as Bruce Leeroy, the lead from THE LAST DRAGON. It's coming back to theaters starting this Sunday. Ask me anything!\n\n\\----------------------------------------------------------\n\nBerry Gordy’s The Last Dragon returns to theatres in celebration of its 40th Anniversary October 19, 20 &amp; 22 only!\n\nThis action-packed story of bravery, dedication, and physical prowess tests the limits and goals of a once mysterious self-defense art form. Martial arts expert Leroy Green (Taimak) seeks to achieve the 'final level' in his craft - the level beyond the dragon, beyond excellence. On his quest, Leroy falls in love with a beautiful singer and video disc jockey, Laura Charles (Vanity). Together, they confront a power-hungry record producer bent on revenge against the young singer, as well as a bloodthirsty egomaniac determined to fight and permanently defeat Leroy. This romantic story centers on the life and death struggle between the love of power and the power of love. Leroy must ascend to the final level, but can he protect Laura's life at the same time?\n\n**Secure your tickets here:** \n\n[https://www.iconicreleasing.com/events/the-last-dragon/tickets/](https://www.iconicreleasing.com/events/the-last-dragon/tickets/)\n\n**Trailer for the re-release here:**\n\n[https://www.youtube.com/watch?v=d\\_k36pNExKg](https://www.youtube.com/watch?v=d_k36pNExKg)\n\n\\-----------------------------------------------------------\n\nAsk me anything! I'll be back at 5 PM ET today (Wednesday 10/15) to answer your questions.\n\n",
        "upvotes": 1839,
        "comments": 221,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ta3m4u0oq9vf1.png?auto=webp&amp;s=3c7104f313bdd26cfbe33635df3455f9c10542fa"
        },
        "permalink": "/r/movies/comments/1o79ll5/whats_up_reddit_im_taimak_star_of_the_last_dragon/"
    },
    {
        "id": "1o77h0q",
        "author": "Space-cowboy67",
        "title": "The Hunt 2012 is making me angrier than any movie I’ve ever seen",
        "content": "Never in my life have I watched a movie so tense and aggravating. It’s incredible. But god damn, I’m only an hour in and had to pause it and go for a walk. I haven’t had a cigarette in 8 years but almost considered smoking again for a fleeting moment. For those who don’t know it’s a danish film about a nice man who gets accused of being a pedophile. \n\nI want to kill every character in this movie lol. Holy fucking leading questions. It’s realistic and this shit can happen to anybody, which makes it so hard to watch. There’s been several instances so far where I yell the screen. I’m not usually one to get bothered by film but this is just too real, and too helpless of a situation. \n\nI would never normally pause a movie to make a rant post. It’s an odd thing to do. But I had to get that out of my system if I’m going to finish this rollercoaster ride to suburban hell. Fuck all these people. I get why they’re handling everything so poorly, it’s a hard thing to deal with. But fuck the cop and his leading ass questions, fuck Gerthe, and fuck the parents for convincing their daughter that she was abused even though she told them she made it all up. \n\nI’m glad I don’t work with kids. \n\nEdit: finished. What a ride. I was surprised to see a happy ending and then BANG. right back to fuck this whole town. Idk if I missed something but idk who the shooter was. Fuck him. \n\nEdit 2: this post may seem like a complaint. It is not. I love this movie and would recommend it to anyone who likes movies that make them feel something, even if it’s a bad feeling. ",
        "upvotes": 504,
        "comments": 160,
        "media": null,
        "permalink": "/r/movies/comments/1o77h0q/the_hunt_2012_is_making_me_angrier_than_any_movie/"
    },
    {
        "id": "1o7d58h",
        "author": "LiteraryBoner",
        "title": "Vince Vaughn destroys a car with his bare hands in Brawl in Cell Block 99 (2017, dir. S. Craig Zahler)",
        "content": "",
        "upvotes": 156,
        "comments": 144,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/95vnxwtigavf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1o7d58h/vince_vaughn_destroys_a_car_with_his_bare_hands/"
    },
    {
        "id": "1o7dhcq",
        "author": "Comic_Book_Reader",
        "title": "The VelociPastor 2 | OFFICIAL TRAILER",
        "content": "",
        "upvotes": 102,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Dx98rAZNE2JKQ06kFzEWFe7eVykkgZflyvFVY4aYosY.jpeg?auto=webp&amp;s=62ee12efd397d837e601b31e6300df5f6a1aba0f"
        },
        "permalink": "/r/movies/comments/1o7dhcq/the_velocipastor_2_official_trailer/"
    },
    {
        "id": "1o7brhq",
        "author": "MarkMancinaAMA",
        "title": "Hey Reddit, I'm Mark Mancina — I’ve scored films like Speed, Bad Boys, Moana, Training Day, Brother Bear, and Twister. Here to answer questions about my journey in film scoring. I’ve also launched a YouTube channel diving into Hollywood music, BTS moments, and classic guitars. Ask me anything!",
        "content": "Hi Reddit, \n\nI'm Mark Mancina, I've scored/composed movies such as Speed, Bad Boys, Moana 1 &amp; 2, Twister, Training Day, Brother Bear, Tarzan, August Rush and more. I've also worked in the music department for films such as Terminator 3, Rollerball, Fight Club, Con Air, The Lion King, True Romance, Cliffhanger, and lots more.\n\nFull list of credits here: \n\n[https://www.imdb.com/name/nm0006183/](https://www.imdb.com/name/nm0006183/)\n\nI'd love to talk to you all about anything ranging from scoring films, working with Hans Zimmer, classic guitars, the Lion King play,  to breaking into the music industry. I've been nominated for 4 Grammys (The Lion King x2, Tarzan, Moana) and a Tony.\n\nI look forward to what you all have to say! And afterward, please follow me on YouTube where I tell more stories from throughout my music career: [https://www.youtube.com/@MarkMancinaMusic](https://www.youtube.com/@MarkMancinaMusic)\n\nAsk me anything! Back at 1 PM ET tomorrow (Thursday 10/16) to answer your questions.",
        "upvotes": 103,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8xuo3i0y6avf1.png?auto=webp&amp;s=ebd2b55fb12f9d56e8eb339d78821a772bc01d1c"
        },
        "permalink": "/r/movies/comments/1o7brhq/hey_reddit_im_mark_mancina_ive_scored_films_like/"
    },
    {
        "id": "1o6imkx",
        "author": "Thndrcougarfalcnbird",
        "title": "Movie poster legend Drew Struzan has passed away",
        "content": "",
        "upvotes": 6408,
        "comments": 219,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BlXe0ctAE7Qy-ezUF8co-IjCkxb2rcf42fEXb5CoZQ4.jpeg?auto=webp&amp;s=8bf10c371dd3234b315f322947f8c71e8b19bead"
        },
        "permalink": "/r/movies/comments/1o6imkx/movie_poster_legend_drew_struzan_has_passed_away/"
    },
    {
        "id": "1o6xkax",
        "author": "average_dudereino",
        "title": "Anyone remember calling Movie Theaters for showtimes before internet or looking in newspapers?",
        "content": "It just occurred to me that I used to have to call the theater or look in newspapers to get showtimes instead of using the internet. It was quite the 80's/90's flashback that I completely forgot about about and never gave much thought to. Anyone else recall this distant memory? It such a blast from the past and how much our world has changed! ",
        "upvotes": 611,
        "comments": 234,
        "media": null,
        "permalink": "/r/movies/comments/1o6xkax/anyone_remember_calling_movie_theaters_for/"
    },
    {
        "id": "1o7cvmv",
        "author": "Danaged",
        "title": "Looking for films that portray lower/working-class life in a positive light",
        "content": "I’m don't like how a lot film and TV constantly depict the lower or working class as hopeless, self-destructive, uneducated losers. Someone’s poor, therefore their life must be a tragedy of abuse, neglect, addiction, and ignorance, not a condition of unfettered capitalism. And it’s usually packaged as “gritty realism” or “melodrama with heart.” It seems sympathetic, but they still treat poverty as a moral failure, like being poor automatically makes you broken. I listed some examples but removed them because I feel that would make this post dwindle into a debate about how wrong I am about them and that isn't my point.\n\nObviously movies like Norma Rae do a good job. Billy Elliot and The Full Monty are good examples of movies that do it right. And the original run of Roseanne (I know, I know and I haven't seen The Conners) is pretty perfect in its tone. David Lynch's The Straight Story just came to mind. I am trying to remember but I feel My Name Is Earl didn't punch down at its characters.\n\nI'd love some recommendations for other movies/shows that would fit.",
        "upvotes": 38,
        "comments": 101,
        "media": null,
        "permalink": "/r/movies/comments/1o7cvmv/looking_for_films_that_portray_lowerworkingclass/"
    },
    {
        "id": "1o7f302",
        "author": "SanderSo47",
        "title": "Laika at 20: ‘ParaNorman’ Returns, Live-Action and How the Company Is Ramping Up Development",
        "content": "",
        "upvotes": 33,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vlxZhLabccJMxTEipMXhRS4rO9QtvwkqnIxKbwE7Z00.jpeg?auto=webp&amp;s=40c1d91840d0c7cbeb7ea24b4fed0bea0bb45fd6"
        },
        "permalink": "/r/movies/comments/1o7f302/laika_at_20_paranorman_returns_liveaction_and_how/"
    },
    {
        "id": "1o73744",
        "author": "LilNello1",
        "title": "Back To The Future 40th Anniversary Rerelease In Theaters and First Time In IMAX",
        "content": "",
        "upvotes": 157,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/td0RI9pXCNeI1LBvBlvcCHCax3WydP-tiqyzWHfm0Fw.jpeg?auto=webp&amp;s=6968258c54317a5afde2ab842a7137859b9573a6"
        },
        "permalink": "/r/movies/comments/1o73744/back_to_the_future_40th_anniversary_rerelease_in/"
    },
    {
        "id": "1o7088c",
        "author": "Representative-Eye86",
        "title": "AMC just set up Kelly Reichardt bad",
        "content": "So, Kelly Reichardt is getting her new movie, \"The Mastermind\", realesed soon. AMC decided to use it as their monthly UNSEEN SCREENING. If you don't know, AMC shows off a new movie, that hasn't realesed yet, early and the audience won't know what it is. It's kept a secret and all you know about it going in is the rating and runtime. \n\nI say all this because Kelly Reichardt is not a general audience director. Her movies are very slow and methodical. Alot of scenes of nobody talking and just jazz music playing, which alot of people like. This is not a director who pleases the general audience. The day after the screenings, people have posted (on other socials) how boring the movie was. Rimming the director's usual style. \n\nNow, you could say \"Why hate on the director's style that she is know for?\" Thats the thing. No normal person knows Kelly Reichardt. To make an audience of regular joes go raw into one of her movies was not a good idea. I don’t know why AMC chose this of all upcoming realeses.",
        "upvotes": 251,
        "comments": 87,
        "media": null,
        "permalink": "/r/movies/comments/1o7088c/amc_just_set_up_kelly_reichardt_bad/"
    },
    {
        "id": "1o6jik9",
        "author": "MarvelsGrantMan136",
        "title": "Send Help | Official Trailer | In Theaters Jan 30",
        "content": "",
        "upvotes": 1727,
        "comments": 277,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CL3VCHo_g39vu1JdUCJd7Duj_Q-vL3yhSpf5cOgGoEA.jpeg?auto=webp&amp;s=21c3fbadcb98d520e2a95dea57aac9530b83b742"
        },
        "permalink": "/r/movies/comments/1o6jik9/send_help_official_trailer_in_theaters_jan_30/"
    },
    {
        "id": "1o6jr3s",
        "author": "NoCulture3505",
        "title": "New Poster for \"Keeper\"",
        "content": "",
        "upvotes": 1392,
        "comments": 156,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rvjrt9k0q3vf1.jpeg?auto=webp&amp;s=f9684e189fc2ed2976790225e0662e9d0c610938"
        },
        "permalink": "/r/movies/comments/1o6jr3s/new_poster_for_keeper/"
    },
    {
        "id": "1o6joaa",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Sam Raimi's 'Send Help' Starring Rachel McAdams &amp; Dylan O'Brien",
        "content": "",
        "upvotes": 1227,
        "comments": 96,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bddor2xgp3vf1.jpeg?auto=webp&amp;s=6c5f923d20b31a10486b35b34d8844f3a96442cc"
        },
        "permalink": "/r/movies/comments/1o6joaa/official_poster_for_sam_raimis_send_help_starring/"
    },
    {
        "id": "1o6blh0",
        "author": "mr_beanoz",
        "title": "New poster for the \"All You Need is Kill\" anime movie",
        "content": "",
        "upvotes": 3501,
        "comments": 174,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/b82688hxy1vf1.png?auto=webp&amp;s=08e55b5a269303a8944d9976bc23a69721473394"
        },
        "permalink": "/r/movies/comments/1o6blh0/new_poster_for_the_all_you_need_is_kill_anime/"
    },
    {
        "id": "1o6eyt1",
        "author": "MarvelsGrantMan136",
        "title": "First Images from Sam Raimi's 'Send Help' Starring Rachel McAdams &amp; Dylan O'Brien - Follows Linda Liddle and Bradley Preston, two co-workers who become the sole survivors of a plane crash while on a business trip. Stranded on a deserted island, they have to work together to survive.",
        "content": "",
        "upvotes": 1826,
        "comments": 220,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3wb02llys2vf1.jpeg?auto=webp&amp;s=c1d34e5c1bfc8c2c0f3958d4a10694377d288cd2"
        },
        "permalink": "/r/movies/comments/1o6eyt1/first_images_from_sam_raimis_send_help_starring/"
    },
    {
        "id": "1o6sf1m",
        "author": "FloridianGator1845",
        "title": "Movies about a character slowly destroying themselves with their own personality?",
        "content": "I am wondering if there are any movies and/or the best movies about a scenario where a main character or just a character in general but at least a major character who’s goals and personality slowly leads to their eventual demise. Also preferably a character who has selfish goals and not that great of a person who has this type of situation occur. It’d be even more interesting if they were close to achieving their goal but then lose it all before it.",
        "upvotes": 358,
        "comments": 522,
        "media": null,
        "permalink": "/r/movies/comments/1o6sf1m/movies_about_a_character_slowly_destroying/"
    },
    {
        "id": "1o6nnj5",
        "author": "BunyipPouch",
        "title": "‘Succession’ Star Nicholas Braun Joins Dave Franco, Peter Dinklage, and O'Shea Jackson Jr In ‘The Shitheads’ from Writer/Director Macon Blair ('The Toxic Avenger', 'I Don't Feel At Home In This World Anymore')",
        "content": "",
        "upvotes": 607,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Qyz7fvHbO7za2ko7Zy_nYybBUcICXLjMcU3FE9TQ5fU.jpeg?auto=webp&amp;s=52ea62a1e5fbc8339c442d802969c034684efaa8"
        },
        "permalink": "/r/movies/comments/1o6nnj5/succession_star_nicholas_braun_joins_dave_franco/"
    },
    {
        "id": "1o6fmlh",
        "author": "thatdani",
        "title": "What's something in filmmaking that is a logistical nightmare, but is often unappreciated by the average viewer?",
        "content": "This question occurred to me while watching Ferris Bueller's Day Off, during the Twist &amp; Shout scene - whenever I hear a Beatles song in a movie, I always think \"man, that must've cost a fortune\", due to how notoriously expensive their music rights are.\n\nSame with Led Zeppelin, which I'm not sure if they're expensive, but rather don't allow their music to be used in movies very often. Jack Black had to make a video begging them for the rights to use Immigrant Song in School of Rock.\n\nTo expand the topic, another filmmaking aspect that is well known in the industry, but underappreciated by the general public is filming during golden hour and how incredibly difficult it is to pull off. Setting up all the equipment for such a short period of time means you have to be extremely well prepared beforehand.",
        "upvotes": 1262,
        "comments": 582,
        "media": null,
        "permalink": "/r/movies/comments/1o6fmlh/whats_something_in_filmmaking_that_is_a/"
    },
    {
        "id": "1o7fdtp",
        "author": "fdmstrange",
        "title": "Fire And Water: Making The Avatar Films | Official Trailer | November 7 on Disney+",
        "content": "",
        "upvotes": 9,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GJQWjicwSjv30gl4ufEUjojt7ZaNfNkgor7DNMugUtM.jpeg?auto=webp&amp;s=899af0d10daf679cb9a86f64380d5fb3d4f74acf"
        },
        "permalink": "/r/movies/comments/1o7fdtp/fire_and_water_making_the_avatar_films_official/"
    },
    {
        "id": "1o71w43",
        "author": "dood0906",
        "title": "Who is France’s most notable actor?",
        "content": "I’m starting to watch more French films but I’m not really informed on french cinema. The only french actor I really recognized or knew about growin up is Jean Reno &amp; I read somewhere he’s not even really french but spanish, lol. I’m not even sure if he’s regarded or as well known to French people as he is in America. So who are considered the all time greats in France? Like if you were to ask someone in France who is the greatest actor, what would the answer be for most people? Like in America some common answers would be Nicholson, Leo, Denzel, etc, etc. Thanks!",
        "upvotes": 53,
        "comments": 158,
        "media": null,
        "permalink": "/r/movies/comments/1o71w43/who_is_frances_most_notable_actor/"
    },
    {
        "id": "1o6tamk",
        "author": "BunyipPouch",
        "title": "Ben Foster to Play Stuntman Evel Knievel in Biopic ‘The Stunt Driver’ - Ed Helms, Laurence Leboeuf and Dan Bakkedahl Also Join Jay Baruchel in the Cast",
        "content": "",
        "upvotes": 171,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qeO00NzUvxR0apJAnHPyhUpX4WezeBpIyofMwJik2Kg.jpeg?auto=webp&amp;s=2f974f1a141c5fbeda1f22494611d212fd4c119e"
        },
        "permalink": "/r/movies/comments/1o6tamk/ben_foster_to_play_stuntman_evel_knievel_in/"
    },
    {
        "id": "1o7g694",
        "author": "PyroxCrymson",
        "title": "Disney has considered a co-CEO structure to replace Bob Iger. Its history may make that a bad idea",
        "content": "",
        "upvotes": 7,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RyTXGaz6GyB2dYlksyhqhCqxYc1ublJn_ch-AP_F8mY.jpeg?auto=webp&amp;s=66a5396671f8ad6c32efcef43902559f8aba7ce1"
        },
        "permalink": "/r/movies/comments/1o7g694/disney_has_considered_a_coceo_structure_to/"
    },
    {
        "id": "1o7fc9r",
        "author": "Born-Cucumber-7316",
        "title": "LA’s famous Bradbury Building has run the “noir” gamut, appearing in classic to neo noir movies like Blade Runner",
        "content": "Several classic noir films have used the gorgeous building, The Bradbury, as a location with its five-story atrium with ornate ironwork, elevators, and staircases. This iconic Los Angeles building was used as a setting in The Unfaithful (1947), Shockproof (1949), DOA (1950), M (1951), and I, The Jury (1953).  Additionally, The Bradbury underwent marvelous art and production design to play a major role in Ridley Scott’s neo-noir sci-fi landmark, Blade Runner. The use of the building helped the movie to earn an Oscar nomination for Best Art Direction-Set Decoration. The Bradbury served as the rundown location and “tchotchke-filled” apartment—remember those wondrous biomechanical creations inside that walk about and speak with childlike voices—of genetic designer J.F. Sebastian, where Deckard (Harrison Ford) battles the replicants Roy Batty (Rutger Hauer) and Pris (Daryl Hannah). \n\nVisitors are free to check out and photograph the ground floor with views of the breathtaking atrium and skylight above, and the ironwork that was especially highlighted in those black/white noir classics. \n\nHere are some glorious stills from Blade Runner’s Deckard entering The Bradbury and J.F.’s apartment: \n\nhttps://www.youtube.com/watch?v=uMGtmNCrQKM\n",
        "upvotes": 6,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ioy32v77glPwyooUmvRhBDgeWeLFok08adMQ-UNA19A.jpeg?auto=webp&amp;s=f6a7fe5fd542d3fb9bfd1959d4b0cab2b2921af8"
        },
        "permalink": "/r/movies/comments/1o7fc9r/las_famous_bradbury_building_has_run_the_noir/"
    },
    {
        "id": "1o6bmwr",
        "author": "mr_beanoz",
        "title": "\"All You Need is Kill\" anime movie trailer",
        "content": "",
        "upvotes": 1168,
        "comments": 186,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Q_ZrcNUV8JRylOHmHER3-d9mUyF7boB-QBVQABVjnvc.jpeg?auto=webp&amp;s=d9fb59dade63b12f2c1cda4434e02073ee5060be"
        },
        "permalink": "/r/movies/comments/1o6bmwr/all_you_need_is_kill_anime_movie_trailer/"
    },
    {
        "id": "1o6e4id",
        "author": "Sheik-Slayer",
        "title": "Phone scene from PT Anderson's Punch Drunk Love (2002)",
        "content": "",
        "upvotes": 531,
        "comments": 96,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dO5W331ZXVvpxz9GRnUwcAetSa9dG3JjJ5Qc7p32m6M.jpeg?auto=webp&amp;s=df4bb5b3a4e0989bed5ed768169c97e53aa471ee"
        },
        "permalink": "/r/movies/comments/1o6e4id/phone_scene_from_pt_andersons_punch_drunk_love/"
    },
    {
        "id": "1o6pq9w",
        "author": "JulesUdrink",
        "title": "Most impressive non CGI movie sets?",
        "content": "Think along the lines of Jurassic Park, Water World, Hook, Planet of the Apes etc. Looking for big, outlandish, hand made movie sets before almost everything was made with CGI. I recently watched Hook and Jurassic Park and got to thinking how I really appreciate how much work and creativity went into the set designs. Ill take the big clunky mechanical shark from Jaws over a CGI any day ",
        "upvotes": 127,
        "comments": 397,
        "media": null,
        "permalink": "/r/movies/comments/1o6pq9w/most_impressive_non_cgi_movie_sets/"
    }
]