[
    {
        "id": "1if0swi",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1if0swi/la_piola_friends_meetup/"
    },
    {
        "id": "1if0swb",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1if0swb/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1igsj2t",
        "author": "gbbarbaro",
        "title": "Ma alla fine i monopattini?",
        "content": "Col nuovo codice della strada a guardare il TGR sembrava che i monopattini dovessero sparire se non dotati di targa luci ecc ma girando per Torino ne vedo a pacchi che girano come niente fosse (al massimo il caschetto da bici). Per non parlare di quelli in sharing: ma non dovevano sparire?\nBoh?",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1igsj2t/ma_alla_fine_i_monopattini/"
    },
    {
        "id": "1igqifd",
        "author": "LOIPpP",
        "title": "Vendere GTT ai cinesi",
        "content": "Ninet, ho un piano per vendere GTT ai cinesi e smettere quindi con gli scioperi inutili, oltre a garantire la puntualità. \n\nAight, hear me out: \n\n1) *Aumento della pressione debitoria su GTT*\nNotifichiamo alle banche che detengono il debito GTT di 150mln+ che la compagnia ha triplicato la sua liquidità negli ultimi due mesi.(prepariamo finti documenti di bilancio provvisorio, incassi mai avvenuti ecc.). \nIn questo modo le banche si sentiranno giustificate a rimuovere le sospensive/grazie attivate nei confronti di GTT. \n\n2)*Rapimento di 2/3 azionisti*\nOk, so che il piano sta diventando un pochino losco, ma che pensavi, che FCT Holdings mollasse la presa così facilmente?\nCredi che basti dir loro che forse è arrivata l’ora di vendere? A l’è l’istès cume versè d’aqua ant ‘l Pò. \n\nCi serviranno i due o tre maggiori azionisti, di modo che l’assemblea societaria non possa tenersi regolarmente, e di modo che la loro risposta alle pressioni non sia abbastanza forte. \nGli ostaggi saranno liberati al punto 3. \n\n2bis) *Trattativa asimmetrica*\nOra iniziamo la trattativa di vendita con la Corea del Sud. \nChiediamo 40 mln + ovviamente il pareggio dei debiti a breve. \n\n(Loro ovviamente chiameranno l’ufficio degli shareholders, ma indovina un po’? I maggiori azionisti li abbiamo già rapiti, quindi difficilmente avranno una risposta concreta :D) \n\nIniziamo a dir loro di avere i pullman ad idrogeno, con le rampe automatiche per i disabili e che sono localizzati in tempo reale, con un satellite apposito per ogni pullman, che lo segue in ogni sua fermata. \n\nDiciamo loro anche che se comprassero GTT avrebbero il diritto ad ri-acquisti di questi mezzi, anche da mandare in Corea. \n\n3) *China joined the chat* \nA questo punto comunichiamo la trattativa ai cinesi, e il gioco è quasi fatto. \n\nLa paura di non essere il primo paese asiatico a possedere pullman ad idrogeno, localizzati via satellite e con rampe per i disabili sarà abbastanza da inasprire la guerra commerciale tra Corea de sud e Cina. \n\nMa non è l’unico bonus! \nA questo punto inizierebbe un’asta catafratta per l’acquisto di GTT. \n\nA questo punto si possono liberare gli ostaggi, che saranno meravigliati dal fatti di avere NON UNA, ma due offerte di acquisto. \nSospetteranno l’inciuccio, ma non faranno nulla, poiché andrebbe a loro discapito. \n\n4) *Finish Line*\nMossa dai cittadini che inneggiano alla transazione, dalle banche che vedono nei nuovi acquirenti una maggiore capacità di ripagare il debito, e dalla paura di non ricevere mai più un’offerta simile, GTT verrà venduta ai cinesi, per un prezzo che si aggira attorno ai 120mln. \n\nI cinesi verranno a scoprire che i pullman non vanno ad idrogeno, che a malapena hanno delle rampe per i disabili e che a volte manco il ticketing online funziona… ma non è la fine. \n\nI cinesi sarebbero gravemente feriti nell’orgoglio, a colpa delle menzogne della controparte, che tanto amichevole e trasparente pareva. \nLa notizia, tuttavia, non verrà resa pubblica, poiché lederebbe assai alla credibilità della Cina, in materia di sviluppo e conoscenza tecnologica. \n\nIncasserebbe quindi il colpo, e proverebbe a rilanciare GTT come IPO, ma ahimè, a questo punto non ci riguarda più. \n\n——\n\nFatemi sapere se avete modifiche al piano da suggerire.\nPensavo anche che sarebbe necessario sabotare il traffico torinese, dal punto 1 al punto 3, ma tanto alla fine basta che un ansian ti faccia la fiancata in Piazza Baldissera, e casca tutta Torino. ",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1igqifd/vendere_gtt_ai_cinesi/"
    },
    {
        "id": "1igoico",
        "author": "Inevitable-Bad5953",
        "title": "Lavori a Torino :)",
        "content": "Ciao a tutti, mi sono appena trasferito in Italia e vorrei chiedere se alcuni di voi conoscete aziende che hanno bisogno di specialisti in lingue/lavori per cui l’uso di lingue e necessario. Sono madrelingua Inglese e conosco anche Francese, Tedesco, e Italiano e possiedo una laurea triennale in lingue moderne (francese e tedesco). Se ci sono anche persone che vorrebbero connettere con me su LinkedIn sarei contento di condividere il link con voi :). Ho esperienza lavorativa in Francia e nel Regno Unito. Ho cercato lavori a Torino online però non conosco bene il mercato di lavoro qui, ecco perché vengo qui per chiedervi. Qualsiasi consiglio è molto apprezzato 😁.",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1igoico/lavori_a_torino/"
    },
    {
        "id": "1ifvk4a",
        "author": "angulario",
        "title": "Tombino extracomunitario",
        "content": "Cosa dice questo tombino in corso Belgio? Perché è un arabo?",
        "upvotes": 391,
        "comments": 47,
        "media": null,
        "permalink": "/r/torino/comments/1ifvk4a/tombino_extracomunitario/"
    },
    {
        "id": "1ignuo3",
        "author": "Agreeable_Produce_86",
        "title": "Darkroom / Camera oscura Workshop",
        "content": "Hey, I would like to share with you a Darkroom workshop in Turin.\n\nFind more details here:\n https://docs.google.com/forms/d/e/1FAIpQLScdd9PyiJLsrdvTs1AU11TjAMnv41pYbcOgtg7PVZOt8YRBKQ/viewform?usp=sf_link",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/io40f3kz2xge1.png?auto=webp&amp;s=b9f1cce4e5bac78b02bd852f31cd0f7a9a9d499f"
        },
        "permalink": "/r/torino/comments/1ignuo3/darkroom_camera_oscura_workshop/"
    },
    {
        "id": "1igpu6t",
        "author": "Soggy_Disk5588",
        "title": "Spedire buoni pasto edenred",
        "content": "Salve a tutti, qualcuno conosce qualche posto a Torino dove prendono i buoni pasto per acquistare card amazon o beni elettronici?\n*spendere",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1igpu6t/spedire_buoni_pasto_edenred/"
    },
    {
        "id": "1ignzll",
        "author": "swimmerturkey",
        "title": "Part-Time Jobs in Turin",
        "content": "Hey! I need some advice on whether international students who don't speak Italian can get part-time jobs here. What kind of part-time jobs are open to us? TIA! ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1ignzll/parttime_jobs_in_turin/"
    },
    {
        "id": "1igns5u",
        "author": "MartemisFowl14",
        "title": "Gruppi studenti tailandesi",
        "content": "\nuna mia amica è appena arrivata dalla tailandia e studierà qua per qualche anno. Qualcuno conosce gruppi (facebook, telegram etc) che possano aiutarla ad ambientarsi??",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1igns5u/gruppi_studenti_tailandesi/"
    },
    {
        "id": "1ifvoyj",
        "author": "Worth-Perception-659",
        "title": "Minacciato di morte",
        "content": "Questa mattina esco di casa e faccio due passi in corso Matteotti. Mi ferma un signore sui 55. Mi dice “non avere paura eh” e gli rispondo che sono di fretta. Lui risponde “anche io sono di fretta, se non pago entro tot giorni mi cacciano fuori di casa”. Gli dico che non gli avrei mai dato dei soldi. Allora inizia a dirmi che mi ammazza, che non devo farmi più vedere nella zona altrimenti mi fa fuori etc. Io me ne sono andato sbattendomene i coglioni ma la tentazione di riempirlo di botte è stata grande. Come vi comportate in queste situazioni?",
        "upvotes": 71,
        "comments": 38,
        "media": null,
        "permalink": "/r/torino/comments/1ifvoyj/minacciato_di_morte/"
    },
    {
        "id": "1igm10h",
        "author": "Key-Manufacturer-606",
        "title": "Badminton in Torino",
        "content": "Hi, I'm an international student who will  be studying in Torino for a semester starting next week. I love playing Badminton and would say that I'm on an lower intermediate level. Do you guys have any suggestions where I could go? CUS Torino is sadly already full.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1igm10h/badminton_in_torino/"
    },
    {
        "id": "1igbrt0",
        "author": "Cool_Somewhere_2307",
        "title": "Events or places where to meet interesting people",
        "content": "Reddit, I need your help. I'm ~30, I moved to Turin around a year ago. I need help finding events or places where to meet like-minded people. Let me explain.\n\nI have been doing many activities in the past year. I have also been around the Politecnico for work-related reasons. I have been struggling really hard to find people that like to engage in meaningful conversations. Everybody seems to be okay with joking (mainly about sex-related topics) all the time and never have a constructive conversation, i.e. talk about their interests, their passions, what they would like to do or achieve, or even just about some interesting fact they have heard or know.\n\nI hope somebody can help me because I feel like I've been teleported to a dystopian world. In particular, I would be interested about technology or entrepreneurship oriented events.",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1igbrt0/events_or_places_where_to_meet_interesting_people/"
    },
    {
        "id": "1ifyrt8",
        "author": "South-Bite5598",
        "title": "Torino hacks &amp; best places to eat",
        "content": "Ciao! I’ll be in Torino for 2 months and I want to know the city’s ins &amp; outs, hacks, best restaurants / holes in the wall, must do’s — anything I NEED to do to fully immerse myself in Torino! \n\nI’ll be staying in the Lingotto area and will be getting a bike \n\nInterests are food and coffee (of course), nature/outdoors, hiking \n\nAnd with that… all recommendations welcome &amp; appreciated! Grazie mille 💚",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ifyrt8/torino_hacks_best_places_to_eat/"
    },
    {
        "id": "1ig0e7j",
        "author": "Substantial-Oil-1363",
        "title": "Discoteche dove ascoltare musica elettronica/dance",
        "content": "Ciao! Sono nuova qui a Torino e non sono neanche molto esperta riguardo alle discoteche visto che spesso la musica che mettono lì non mi piace. Ho amato la musica del c2c e mi chiedevo se esistessero dei locali/discoteche con musica del genere. Mi sono piaciuti moltissimo gli Snow strippers e Sega bodega ",
        "upvotes": 2,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1ig0e7j/discoteche_dove_ascoltare_musica_elettronicadance/"
    },
    {
        "id": "1ifxcz7",
        "author": "Wonderful_East_5741",
        "title": "ciao! richiesta strana, ho necessità di una tv a tubo catodico per un progetto universitario, qualcuno ne ha una funzionante da fare fuori?",
        "content": "",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ifxcz7/ciao_richiesta_strana_ho_necessità_di_una_tv_a/"
    },
    {
        "id": "1iftyd9",
        "author": "NecessaryConcert3603",
        "title": "Parcheggio Centro commerciale Parco Dora",
        "content": "Ciao a tutti! Mi sono trasferito da poco a Torino, mi chiedevo se qualcuno sapesse se potessi abbandonare la macchina ai parcheggi del Centro Commerciale Parco Dora. È sempre aperto? C'è un limite di orario?\n\nGrazie in anticipo!",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1iftyd9/parcheggio_centro_commerciale_parco_dora/"
    },
    {
        "id": "1ifsji1",
        "author": "juulu",
        "title": "Driving License Translation ENG - IT",
        "content": "Hi all, I’m needing to swap my english driving license for an Italian license, however, the requirements state I need to provide a full translation of the license from English to Italian when doing so.\n\nHas anyone done this in Torino recently and can recommend who I could approach for this?\n\nThanks.",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ifsji1/driving_license_translation_eng_it/"
    },
    {
        "id": "1ifbegi",
        "author": "DunnoWhatToChooze",
        "title": "Musica torinese",
        "content": "Vivo a Torino da una vita ma gli artisti musicali torinesi di cui sono a conoscenza li conto sulla dita di una mano. Ascolto principalmente post-punk, hardcore, industrial, doom/ sludge metal, noise rock, folk, psichedelia e musica che si potrebbe genericamente definire \"alternativa\", quindi roba che orbita attorno a questi generi sarebbe top, ma più generalmente cerco musica torinese o piemontese che apprezzate di qualsiasi tipo, anche musica che potrebbe non piacermi anche solo per conoscere un po' la storia e lo stato attuale della musica torinese, dal compositore barocco seicentesco semi-sconosciuto all'astro nascente della scena drill alla cover band dei Guns 'n' Roses di mio cuggino (no ok magari quella no)",
        "upvotes": 11,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1ifbegi/musica_torinese/"
    },
    {
        "id": "1if3vty",
        "author": "CryingAlwaysCrying",
        "title": "Consiglio: non lasciate l'auto a Rebaudengo Fossata",
        "content": "Se tenete alla vostra macchina, **NON parcheggiatela a Rebaudengo Fossata**. In soli **due giorni** ho visto **furti** su **cinque auto diverse**.\n\nBorgo Vittoria sta diventando un **far west**: vetri rotti, auto svaligiate e nessuno che interviene. Se lasciate la macchina lì, aspettatevi di trovarla con il finestrino sfondato o peggio.",
        "upvotes": 27,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1if3vty/consiglio_non_lasciate_lauto_a_rebaudengo_fossata/"
    },
    {
        "id": "1ife3nf",
        "author": "Babele_20",
        "title": "Carte Pokémon: segreto fiabesco",
        "content": "Ciao! Io vorrei iniziare a collezionare carte pokémon e ho puntato gli occhi su segreto fiabesco. Mi chiedevo se qualcuno conoscesse dei venditori di queste carte (Anche su vinted) a un buon prezzo, insomma che una fuori sede squattrinata come me possa comprare. ",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1ife3nf/carte_pokémon_segreto_fiabesco/"
    },
    {
        "id": "1ifhl67",
        "author": "Careless_Way_3818",
        "title": "Posti interessanti Mirafiori sud?",
        "content": "Salve, sono un ragazzo campano neolaureato di 25 anni, a breve mi trasferirò a Mirafiori sud per lavoro, volevo sapere com'è la zona se si può camminare di notte tranquillamente e inoltre volevo sapere se ci fossero locali o le piazze universitarie in zona dove poter bere una birra e fare due chiacchiere o comunque posti dove poter passare una serata tranquilla. Grazie per le risposte.",
        "upvotes": 1,
        "comments": 21,
        "media": null,
        "permalink": "/r/torino/comments/1ifhl67/posti_interessanti_mirafiori_sud/"
    },
    {
        "id": "1ifbp4p",
        "author": "Gintokoz",
        "title": "Incontri di fotografia e videomaking",
        "content": "Pensavo di creare un piccolo gruppo di persone qui a Torino con le quali trovarsi per creare video e fare foto. Sarebbe bello trovarsi in modo e creare qualcosa di veramente bello! Mi piacerebbe anche che al gruppo si aggiungesse qualcuno che sappia \"recitare\" o improvvisare di fronte ad un obiettivo. Se interessati scrivetemi pure :)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ifbp4p/incontri_di_fotografia_e_videomaking/"
    },
    {
        "id": "1if1jhs",
        "author": "Sepp7",
        "title": "Controviali e traverse a destra",
        "content": "C'è un dubbio che mi assale sui controviali e le traversine a destra a senso unico. Se sono nel contro viale e vado dritto teoricamente dovrei dare la precedenza a destra a quelli che vengono da una traversa a destra. Però loro si stanno immettendo in una via principale mentre io sto andando dritto. Chi ha ragione in questi casi? Sono confuso ",
        "upvotes": 6,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1if1jhs/controviali_e_traverse_a_destra/"
    },
    {
        "id": "1if38xk",
        "author": "Stoploss888",
        "title": "Alloggio breve zona San Paolo",
        "content": "Salve a tutti,\n\nsapreste suggerirmi dei posti per alloggi brevi (1-2 settimane) presso Borgo San Paolo? Stavo dando un occhiata su AirBnb e i prezzi sono onestamente molto alti (40-50 euro a notte).\n\nAvete in mente zone limitrofe ben collegate magari più economiche? O conoscete qualcuno, gruppi telegram etc ?\n\n  \nGrazie in anticipo :)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1if38xk/alloggio_breve_zona_san_paolo/"
    },
    {
        "id": "1iesvre",
        "author": "_Mini_Hulk_",
        "title": "Cerco giocatori per una campagna Dnd dal vivo a Torino",
        "content": "So che non è un gruppo lfg ma ci provo lo stesso \n\n\nCampaign: The dragon of icespire peak 🐉\n\nI am a NEW DUNGEON MASTER running my first ever campaign (please be nice to me hahaha) and I'm looking for players (4 players) \n\n👁️‍🗨️ Campaign info\n\n🗣️Language: English 🇬🇧 (cz I'm not italian and am more comfortable DMing in English) \n📍Location: Torino, Italia (details later) 🇮🇹\n\n🗓️ Start date: around March 2025\n⏰ Duration: 8 to 15 sessions for part 0 (depending on the pace of the group) and if we enjoy it then we could do part 1, 2 and 3 (you can opt out between parts but please not in the middle of the campaign) \n⏳ Pace: once a week on Saturday or Sunday \n⌚Session length: 3-4 hours\n\n🗂️ Campaign parts\nPart 0: Dragon of icespire peak\nPart 1: Storm Lord’s Wrath: 7–10 sessions\nPart 2: Sleeping Dragon’s Wake: 6–9 sessions\nPart 3: Divine Contention: 8–12 sessions\n\n📃 To potentially join the campaign, please fill the form!\n\nhttps://forms.gle/Rh8exc49WLmxtmw56",
        "upvotes": 10,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/p-0aM718ODS2HCmIna9P0qjwhUIWA3jlXAV9O1s5Jvo.jpg?auto=webp&amp;s=0eeb7363e205cb44fe66fc2d05cb1e34d29200f2"
        },
        "permalink": "/r/torino/comments/1iesvre/cerco_giocatori_per_una_campagna_dnd_dal_vivo_a/"
    },
    {
        "id": "1iel0ye",
        "author": "Dear_Following5665",
        "title": "Gruppo di lettura a Torino!",
        "content": "Ciao!\n\nSono Federico di Romanzoapranzo, un blog in cui ogni venerdì, all'ora di pranzo, parlo dei libri che sto leggendo ☺️📚\nHo aperto un gruppo di lettura in presenza, a Torino: se sei interessat* e vuoi partecipare, scrivimi! ☺️",
        "upvotes": 22,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1iel0ye/gruppo_di_lettura_a_torino/"
    },
    {
        "id": "1ieom3x",
        "author": "Francigarla03",
        "title": "Nuovi Amici a Torino",
        "content": "Ciao a Tutti , siamo due ragazzi in cerca di nuovi amici :\n\n-Abbiamo entrambi 21 anni\n\n-Siamo persone che amano parlare di tutto e tendiamo molto a essere filosofeggianti\n\n-siamo Neurodivergenti ( io AuDHD , lui solo autistico)\n\n-siamo aperti ad ogni tipo di persona ma astenersi persone eccessivamente giudicanti\n\nNon vediamo l’ora di conoscervi 🤗 ( ah scrivetemi tranquillamente in privato ;)",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1ieom3x/nuovi_amici_a_torino/"
    },
    {
        "id": "1ievknv",
        "author": "CarpenterCritical63",
        "title": "Qualcun altro qui piace truccarsi da clown? 🎪🤡 (M21)",
        "content": "Ciao a tutti! Qualche tempo fa mi hanno truccato da clown e, anche se prima li vedevo come personaggi un po' strani, l’esperienza mi ha fatto scoprire un lato divertente e liberatorio che non mi aspettavo. Per ora ho provato solo lo stile classico, ma sono curioso di esplorare altri tipi di trucco. C’è qualcun altro qui a cui piace questo hobby?  \n\nA parte il trucco da clown, mi piacciono un sacco di altre cose. Ad esempio, sono un grande fan del fantasy, sia nei libri che nei film, anche se ultimamente faccio fatica a trovare qualcosa di nuovo che mi prenda. Nel frattempo, mi tengo occupato con i videogiochi: sto rigiocando a Monster Hunter World in attesa di Wilds, ma ogni tanto mi lascio tentare da League of Legends.\n(piccola parentesi ci sono Sonic e Garfield, due icone che adoro).\n\nE poi c’è la musica: passo da Hatsune Miku agli Smiths, dai Radiohead ai Prozac… insomma, un po’ di tutto!  \n\nSe anche voi avete hobby simili o volete semplicemente chiacchierare, scrivetemi pure!",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1ievknv/qualcun_altro_qui_piace_truccarsi_da_clown_m21/"
    },
    {
        "id": "1ien9qz",
        "author": "Adsodamelk17",
        "title": "Dove alloggiare bene a prezzi modici",
        "content": "Salve a tutti, a fine mese verrò per un weekend a Torino a trovare un amico e mi chiedevo se qualcuno potesse consigliare un posto per alloggiare senza spendere troppo ma che non sia una topaia. Per quanto riguarda la zona non conosco molto la città ma cercherei qualcosa di non troppo decentrato e/o comunque ben connesso con il resto della città. Grazie in anticipo a tutti quelli che mi vorranno dare una dritta",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1ien9qz/dove_alloggiare_bene_a_prezzi_modici/"
    },
    {
        "id": "1idyfb7",
        "author": "NamelessNiner",
        "title": "GTT, perché?",
        "content": "\"A seguito del proseguimento dei lavori di migrazione al nuovo sistema digitale operati da Infra.To, il servizio della metropolitana modifica gli orari dal 2 febbraio al 16 aprile 2025\"\n\nE tornano agli orari di sempre, chiusura alle 21:30 in settimana. I turnisti che staccano alle 23? Possono fottersi. Era così bello poter credere di avere una metropolitana funzionante, degna di questa nome.\n\nUn mese è durato, ora torniamo alla barzelletta di sempre. &gt;!E hanno il coraggio di scioperare.!&lt;",
        "upvotes": 67,
        "comments": 47,
        "media": null,
        "permalink": "/r/torino/comments/1idyfb7/gtt_perché/"
    },
    {
        "id": "1iegos1",
        "author": "Nearby-Tea1646",
        "title": "Can I sue my company?",
        "content": "Hello lovely people, I am in a weird situation. I work as a consultant for company, and I had discussions with them last year, October to have my salary increased. And I got a confirmation in written from them that they will increase my salary from January 2025. Low and behold, I got my pay slip and nothing changed. I really don't know the law here in Italy, but can I sue them for not keeping their promise?",
        "upvotes": 3,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1iegos1/can_i_sue_my_company/"
    }
]