[
    {
        "id": "1iwzhr9",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 18,
        "comments": 1326,
        "media": null,
        "permalink": "/r/realmadrid/comments/1iwzhr9/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1iya1ng",
        "author": "yaboiviv",
        "title": "This Modric pic goes hard🔥🐐",
        "content": "Reposted by Modric on his IG story\nCredit: IG - aleh.prod &amp; lejournaldureal",
        "upvotes": 1508,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k16sn5mmkdle1.jpeg?auto=webp&amp;s=77a687d3dd1b723e585ac0b8ac6bdae14d7fbb0a"
        },
        "permalink": "/r/realmadrid/comments/1iya1ng/this_modric_pic_goes_hard/"
    },
    {
        "id": "1iyctb3",
        "author": "EffectiveTie3144",
        "title": "Happy Birthday to club legend Kepler Laveran de Lima Ferreira \"Pepe\" 🇵🇹",
        "content": "",
        "upvotes": 507,
        "comments": 21,
        "media": null,
        "permalink": "/r/realmadrid/comments/1iyctb3/happy_birthday_to_club_legend_kepler_laveran_de/"
    },
    {
        "id": "1iyipka",
        "author": "EMJG30",
        "title": "It was a few days ago but this touch from Mbappé was absolutely absurd and the acceleration was even more absued how is he this fast💀",
        "content": "",
        "upvotes": 163,
        "comments": 22,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/gz3xisiezfle1/DASH_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1iyipka/it_was_a_few_days_ago_but_this_touch_from_mbappé/"
    },
    {
        "id": "1iy26ps",
        "author": "Optimal_Lie7824",
        "title": "The player with the most minutes in the top 5 leagues! Federico Valverde is truly one of a kind.",
        "content": "",
        "upvotes": 1422,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/64727cbaxble1.jpeg?auto=webp&amp;s=0445d7e1f151c65cb2a6cf565e09c155cbaa62f7"
        },
        "permalink": "/r/realmadrid/comments/1iy26ps/the_player_with_the_most_minutes_in_the_top_5/"
    },
    {
        "id": "1iyivx5",
        "author": "aprilhyped",
        "title": "🚨 JUST IN: Joan Martínez is close to making his return! He passed a key medical test recently and his knee is PERFECT",
        "content": "Source: Marca",
        "upvotes": 84,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ulp3Rizvh2hL7E21RKHTeEUGstzMdIrf51CRPLCSrZQ.jpg?auto=webp&amp;s=f82b1c86275cfe28d5a3421c3f2fb71e57b71594"
        },
        "permalink": "/r/realmadrid/comments/1iyivx5/just_in_joan_martínez_is_close_to_making_his/"
    },
    {
        "id": "1iy88an",
        "author": "ExcellentTheory8460",
        "title": "Barca fans chanting \"vinicius die\" before their match vs atletico de madrid",
        "content": "",
        "upvotes": 442,
        "comments": 113,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/huejac676dle1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1iy88an/barca_fans_chanting_vinicius_die_before_their/"
    },
    {
        "id": "1iyb1go",
        "author": "Proof-Pollution454",
        "title": "Happy Birthday To me Madridistas. Happy with the way my Real Madrid cake come out today. Hala Madrid",
        "content": "My Birthday cake with the Real Madrid design and my name on it. Hala Madrid ",
        "upvotes": 196,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ot26rck0tdle1.jpeg?auto=webp&amp;s=61cf3be52333d196dab1edc8f8433ee6020e8513"
        },
        "permalink": "/r/realmadrid/comments/1iyb1go/happy_birthday_to_me_madridistas_happy_with_the/"
    },
    {
        "id": "1ixox6s",
        "author": "Main_Rhubarb_3592",
        "title": "WATCHED AT LEAST 100 ANGLES OF THIS SPECTACULAR GOAL STILL UNBELIEVABLE",
        "content": "",
        "upvotes": 3403,
        "comments": 56,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/i2aascnrf8le1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ixox6s/watched_at_least_100_angles_of_this_spectacular/"
    },
    {
        "id": "1ixrvvs",
        "author": "PenguinFootballClub",
        "title": "The duality of being a Real Madrid fan:",
        "content": "",
        "upvotes": 1323,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sbsm374uh9le1.jpeg?auto=webp&amp;s=b10fa866e5f2c94ced4a6a159655b3676318b299"
        },
        "permalink": "/r/realmadrid/comments/1ixrvvs/the_duality_of_being_a_real_madrid_fan/"
    },
    {
        "id": "1ixrlto",
        "author": "itsshpadoinkleday",
        "title": "19 y.o Valverde played 651 minutes in La Liga. Rodrygo @19 had 983 min. Guler has 608 right now with still 1/3 of the season ahead of him. Stop crying you muppets.",
        "content": "Just take a look how today's undisputed starters where used when they were still teenagers at RM. Even 19 y.o. Vini played oly 1374 minutes, and that was when Hazard was injured all the time. \n\nYou have to realize that this team is not fucking tottenham or some academy, we are competing for major trophies every single year and that's how it goes with teenagers here. They have to be a world beaters almost without flaws, like Jude Bellingham, to start in this team. \n\nWhat kind of moron you have to be to bitch about the minutes of 19 y.o. kid when he decided to join the biggest club itw packed with stars, and then said he didn't want a loan? On top of that, when he did have a chance in a tough match vs Liverpool he was poor. \n\nJust calm the fuck down, if he works hard he could be very important player at RM, but nothig is given for free here. And it's not Ancelotti's characteristic, it was the same with Zidane and will be the same with every other manager. Some stans are just mad that their boy isn't a hybrid of Messi and Zidane like they wanted us to believe.",
        "upvotes": 1082,
        "comments": 134,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ixrlto/19_yo_valverde_played_651_minutes_in_la_liga/"
    },
    {
        "id": "1iy4pxp",
        "author": "mishhka1",
        "title": "Some matching Real Madrid wallpapers for you guys",
        "content": "",
        "upvotes": 153,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1iy4pxp/some_matching_real_madrid_wallpapers_for_you_guys/"
    },
    {
        "id": "1ixv31p",
        "author": "dark4403",
        "title": "Jude Bellingham giving his blanket to this child so he would stop feeling cold",
        "content": "",
        "upvotes": 516,
        "comments": 49,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tvb57ntlfale1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ixv31p/jude_bellingham_giving_his_blanket_to_this_child/"
    },
    {
        "id": "1ixvqrs",
        "author": "ok-computer-x86",
        "title": "25/26 Home Kit Leaked (Footy Headlines)",
        "content": "",
        "upvotes": 386,
        "comments": 67,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ixvqrs/2526_home_kit_leaked_footy_headlines/"
    },
    {
        "id": "1ixgml1",
        "author": "johnmichsenpai",
        "title": "The aura of modric in this photo",
        "content": "First time seeing Real in person and I took this gem of a photo.",
        "upvotes": 829,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8bnnd60ga6le1.jpeg?auto=webp&amp;s=91aba02805bc649a769ee0899b1a1b133400eee2"
        },
        "permalink": "/r/realmadrid/comments/1ixgml1/the_aura_of_modric_in_this_photo/"
    },
    {
        "id": "1ix3e6e",
        "author": "EffectiveTie3144",
        "title": "Luka Modric gives away his shirt to 12 yrs old fan who came all the way from Croatia to see her favourite player on the pitch",
        "content": "",
        "upvotes": 4069,
        "comments": 55,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/wsi27n79l3le1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ix3e6e/luka_modric_gives_away_his_shirt_to_12_yrs_old/"
    },
    {
        "id": "1ixcuhj",
        "author": "DonuandDeca",
        "title": "Happy 20th birthday to Arda Guler 🎂🥳🙌",
        "content": "",
        "upvotes": 920,
        "comments": 42,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ixcuhj/happy_20th_birthday_to_arda_guler/"
    },
    {
        "id": "1ixevht",
        "author": "aprilhyped",
        "title": "Jude with Zidane-esque goal in training",
        "content": "",
        "upvotes": 714,
        "comments": 30,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7403v102x5le1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ixevht/jude_with_zidaneesque_goal_in_training/"
    },
    {
        "id": "1ix764j",
        "author": "intelligence3",
        "title": "Arda Güler's family were at the Bernabeu at yesterday's match",
        "content": "",
        "upvotes": 1824,
        "comments": 155,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hakq8rvhd4le1.jpeg?auto=webp&amp;s=051e4ef6f7165ad27c6b71fd92082026ba86aa2c"
        },
        "permalink": "/r/realmadrid/comments/1ix764j/arda_gülers_family_were_at_the_bernabeu_at/"
    },
    {
        "id": "1ixq67h",
        "author": "SixFeetBlunder-",
        "title": "as option number 1, 2 and 3 on Real list remains Trent Alexander-Arnold since March 2024.",
        "content": "",
        "upvotes": 81,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jAvb3yOKwElPdhDjHBgT_FrX-BNZePe6kAzyAZSnj3I.jpg?auto=webp&amp;s=aa681bb451831e359d523f69662ce5ed00e6f2ea"
        },
        "permalink": "/r/realmadrid/comments/1ixq67h/as_option_number_1_2_and_3_on_real_list_remains/"
    },
    {
        "id": "1ix90h8",
        "author": "BdBoss_777",
        "title": "Honestly these Arda and Endrick stans need to calm down.",
        "content": "“Carlo out because he doesn’t start kids in important games over 3 literal superstar Ballon d’Or level footballers”. It’s just getting annoying man. I don’t know what these stans even want because Vini, Mbappé and Rodrygo are just hitting their prime and will be the starters for the minimum next 5 years. They need to learn, work hard and listen so that one day they could be great but in the present there’s no place for them in the 11. Maybe they can go on loan for a couple of seasons or just fight everyday to be better.",
        "upvotes": 480,
        "comments": 89,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ix90h8/honestly_these_arda_and_endrick_stans_need_to/"
    },
    {
        "id": "1ixpg4m",
        "author": "EnjoyTheCold",
        "title": "First visit ever/AMA/personal experience post/important for people that are afraid of heights",
        "content": "I fulfilled my dream and finally visited Santiago Bernabéu this weekend. I’m going to write a piece about how I felt about the Classic Tour and everything before, during, and after the match so it can help people get a better understanding.\n\nI went with a friend and chose the Girona match to be sure we had tickets – well, this did not go well. Both of us are Madridistas and joined the queue on Tuesday at 10 AM. I had 36 minutes in the waiting line, while he had 42. We didn’t get a ticket after the wait, and my friend got in, only to be kicked out instantly. We thought this can't be real, so we tried all day and still nothing. We tried again the next day when tickets opened to the public, but still nothing. We tried searching with third-party sellers, where you had to pay 350-400 euros instead of 100 euros on the official site, but we said no way. We decided to buy tickets even though we wouldn’t sit next to each other, because sometimes you saw empty seats, and 95 percent of the time, there was only one seat free on Entradas or the official Real Madrid site. While we were waiting on our flight Friday, we both lucked out and found seats—my friend for 208 euros and myself for 110. He was sitting in Sector 232, while I was way up in 601. Important thing for people who are afraid of heights: don’t buy a ticket that is higher up, even if you manage to get one. I was dizzy the whole time, and my hand didn’t leave the railing. I was thinking about buying a new ticket as soon as I was up there. The people next to me didn’t have any problem. Pro tip: Do the tour before you go and watch the game. With the Classic Tour, you get a panoramic view, and it’s perfect to see if you have any issues with the steepness.\n\n# Classic Tour Experience\n\nSeeing the stadium was insane, even while construction outside is still happening. Take the Metro; it’s very easy, and you come out right in front of the stadium. You walk 3 minutes to the tour entrance. We reserved time slots and didn’t wait a second. The tour was very nice, with an amazing amount to see, but it was packed with tons of people, so you had to wait several minutes at popular spots like the Wall of Ballon d'Or and other areas.\n\n**Cons of the tour:** You can take pictures with the Champions League trophy and in front of a green screen with your choice of player. You get a QR code and think, nice, but it didn’t say anything about the costs or that you had to pay. Right before the tour ends and you enter the shop, you have to wait in line to pay for the pictures. After 15 minutes of waiting, the lady started charging 15 euros per picture, but when I just asked, “How much for digital only?” she replied that you can’t buy them digitally. It was a big waste of time, and people were annoyed around us. The shop was packed too, and it’s expensive—10 euros for a keychain and 6 euros for the usual shopping bag with a Madrid logo on it. Be prepared to pay a ton of money for merch\n\n# Matchday vs Girona\n\nWe went 3 hours earlier, and it was already packed. Since I was searching Reddit and didn’t find much info about the arrival of the team bus, I’ll try to be precise about how it was for me that day. Plaza de los Sagrados Corazones is where people were waiting and where the bus passes. I added a picture showing where the bus comes from and where it passes. We waited on the roundabout, heading toward the stadium (Taco Bell is visible in the picture), and the police moved us 3 times to the right side. The Girona team bus arrived 2 hours before the match. Real Madrid’s team bus arrived exactly at 14:40 (match start was 16:15), and it was not worth it. You stand the whole time, with people bumping into you, wanting to get closer, and after waiting 1 hour 30 minutes, the bus didn’t do a round in the roundabout but drove straight to the stadium entrance for the bus. We were hoping they would circle at least once so people could enjoy it more and maybe see someone. A 90-minute wait for a 15-second look at the team bus without seeing anyone is the summary of that experience.\n\n[marked lines is where the bus passes](https://preview.redd.it/lc9liy8sl8le1.jpg?width=1206&amp;format=pjpg&amp;auto=webp&amp;s=0c2648eecde75e430f715c3b56c39273f8899962)\n\nAfter that, the gates opened (90 minutes prior to the match), and the lines formed were insane. Got lucky and waited only 5 minutes, if even, and went up to Sector 601 to my seat. My friend was at the opposite side near the coaches. Again, if you’re afraid of heights, do the tour with the panoramic view. Even my friend, who’s not afraid of heights, got dizzy when we did the tour. Only me and one other person were in the row, and I was thinking, “Why was it so hard to find tickets? It’s not even sold out.” 20 minutes before the match started, some people started coming, but not many, and then 5-10 minutes before the match, our row was full. I was surprised that even that high up, it was going to be full. It gets easier with the dizziness as soon as people are next to you, and when the match starts, you forget about it almost completely. Seeing the warm-up and the match start was an indescribable feeling—every Real Madrid fan has to experience this insane feeling. Buy your snacks and drinks before the match, believe me—you’ll wait 10-15 minutes if you’re lucky to buy something, and another 5 if you need to visit the toilet. When the final whistle blew and the match ended, it was disappointing that the team didn’t come and celebrate with the fans in the stands. They almost sprinted into the changing room; only a few players stood there after the game—a big thank you to them.\n\nDon’t try to rush out. You won’t be the first or last to leave the stadium. Take your time, enjoy the stadium, and leave after some minutes. When I got out, 15 minutes after the game, there were still tons of people outside. My friend and I had decided beforehand to make reservations at a restaurant near the stadium so we could eat and then go back to the hotel after. This was a very good decision, considering the thousands of people taking public transport.\n\n# Conclusion\n\nEvery cent I spent on this trip was worth it. Watching a game live and seeing the dream goal of Modrić was the absolute highlight. So if you ever ask yourself if it’s worth it—100 percent. Don’t buy tickets from third-party sites. We always found some seats 2 days or 1 day before—even 30 minutes before the game, I checked, and some spots were available. Don’t give up; you’ll find one eventually, but don’t expect to sit next to each other. If you have any questions, feel free to comment or DM. I hope this post will be helpful to atleast someone and sorry for all the spelling mistakes, English is not my fist language :) \n\n",
        "upvotes": 37,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ixpg4m/first_visit_everamapersonal_experience/"
    },
    {
        "id": "1ix4wn2",
        "author": "CkSned",
        "title": "Had my second Bernabeu visit this weekend. AMA for overseas folks looking to attend while I'm at the airport?",
        "content": "",
        "upvotes": 570,
        "comments": 73,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ix4wn2/had_my_second_bernabeu_visit_this_weekend_ama_for/"
    },
    {
        "id": "1ix21hy",
        "author": "Ready_Ad_1353",
        "title": "Ancelotti: Modric is a gift to football. I had another player who was 40 years old, who was Maldini. The two can be compared in terms of what a footballer had to be. They are fantastic examples, It is no coincidence that they have reached 40. Genetics matter, but so does commitment, attitude...''",
        "content": "",
        "upvotes": 655,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/m2OKTCk76xpBnbLSt5mYq-Euc-CPMfzBYkKkXeTPNRU.jpg?auto=webp&amp;s=7179a5df12acd210696c44546c11a58bca199d88"
        },
        "permalink": "/r/realmadrid/comments/1ix21hy/ancelotti_modric_is_a_gift_to_football_i_had/"
    },
    {
        "id": "1ix9c3l",
        "author": "Ready_Ad_1353",
        "title": "Luka Modrić is the ONLY PLAYER with 100+ accurate passes, 5+ key passes and a goal in a single La Liga match since the start of the 2016/17 season. @SofascoreINT",
        "content": "",
        "upvotes": 235,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HSrOvQFwy_jMEKxxy94JkMQ7DvmzOuXRnqbAF7ONtIQ.jpg?auto=webp&amp;s=f508b721e6c3e01d4d89a2066d4c2e73c81266e8"
        },
        "permalink": "/r/realmadrid/comments/1ix9c3l/luka_modrić_is_the_only_player_with_100_accurate/"
    },
    {
        "id": "1ixavlh",
        "author": "RM-PM-Surveys",
        "title": "[Post Match Survey Results] Real Madrid 2-0 Girona",
        "content": "",
        "upvotes": 173,
        "comments": 10,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ixavlh/post_match_survey_results_real_madrid_20_girona/"
    },
    {
        "id": "1iwyq05",
        "author": "ArmageddonJundy",
        "title": "what is my guy doing here??!! xD",
        "content": "",
        "upvotes": 893,
        "comments": 20,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/iwcp47pt92le1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1iwyq05/what_is_my_guy_doing_here_xd/"
    },
    {
        "id": "1iwtnge",
        "author": "Ready_Ad_1353",
        "title": "Close up of Modric's goal from the Stadium",
        "content": "",
        "upvotes": 2349,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/01d1d3ncl0le1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1iwtnge/close_up_of_modrics_goal_from_the_stadium/"
    },
    {
        "id": "1ixf3qp",
        "author": "V_y_z_n_v",
        "title": "'Real Madrid are a crying club' - Javier Tebas rips Los Blancos as La Liga president blasts 'aggressive, verbal and manipulated' referee complaints",
        "content": "",
        "upvotes": 67,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LhtGchOamMxISv8dPHLZREQ6XNEER7zdLnvKuVEWGtY.jpg?auto=webp&amp;s=a8549ebb805a1cfcacbfc15d15390a1efbf88a9f"
        },
        "permalink": "/r/realmadrid/comments/1ixf3qp/real_madrid_are_a_crying_club_javier_tebas_rips/"
    },
    {
        "id": "1ix3775",
        "author": "dark4403",
        "title": "🗣️ Fernando Sanz: \"Tebas? Thanks to this whiny club, television rights are being sold the way they are being sold.\"",
        "content": "",
        "upvotes": 249,
        "comments": 17,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1fxysu1oj3le1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ix3775/fernando_sanz_tebas_thanks_to_this_whiny_club/"
    },
    {
        "id": "1ix8ryh",
        "author": "Ready_Ad_1353",
        "title": "MARCA]: Thibaut Courtois will return to the Belgium national team. He will be called up in March.",
        "content": "",
        "upvotes": 103,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/VNVO6bvshqv2eG0wGNyh2QP_6uDXGwmnPBgukepygr8.jpg?auto=webp&amp;s=c6b442c109cfafd7f052aa509f70363e1adbf83c"
        },
        "permalink": "/r/realmadrid/comments/1ix8ryh/marca_thibaut_courtois_will_return_to_the_belgium/"
    }
]