[
    {
        "id": "1m5euwz",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 8,
        "comments": 133,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m5euwz/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1lbetgi",
        "author": "RM_Official_Thread",
        "title": "r/RealMadrid Reddit CWC Fantasy League and Prediction Bracket Challenge",
        "content": "FIFA Official app has 2 games going on for the CWC and it would be fun if we use both to determinate if you guys know as much football as you pretend to when  you're all arguing tactics in the sub and claiming you know how to fix the team and that Carlo had none.\n\n\\# Join the Fantasy League for this subreddit here:\n\n[https://play.fifa.com/fantasy/join-league/BDHSOJPY](https://play.fifa.com/fantasy/join-league/BDHSOJPY)\n\n\\# Join the Prediction bracket for this subreddit here:\n\n[https://play.fifa.com/bracket-predictor/join-league/60B7D21B](https://play.fifa.com/bracket-predictor/join-league/60B7D21B)\n\npost your bracket or fantasy team here to get people going.\n\nWinner of each will get a custom flair set to whatever you want (as long as its reasonable)",
        "upvotes": 21,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L2IQgNCexcLebmnUV4r1PsoE08WHXZ9oOuLG1NvcOCg.png?auto=webp&amp;s=e5d92205c44c2e30bc741130b750be458855c060"
        },
        "permalink": "/r/realmadrid/comments/1lbetgi/rrealmadrid_reddit_cwc_fantasy_league_and/"
    },
    {
        "id": "1m5lza4",
        "author": "Imetanga",
        "title": "Isco prime vs Iniesta",
        "content": "",
        "upvotes": 307,
        "comments": 36,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kkucpdnbx8ef1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m5lza4/isco_prime_vs_iniesta/"
    },
    {
        "id": "1m5dllq",
        "author": "Optimal_Lie7824",
        "title": "The new four captains of the team!",
        "content": "Thoughts?",
        "upvotes": 808,
        "comments": 106,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/q8dls41gw6ef1.jpeg?auto=webp&amp;s=26f776f6abde0328fdccc73f3fda1882a1a5f78c"
        },
        "permalink": "/r/realmadrid/comments/1m5dllq/the_new_four_captains_of_the_team/"
    },
    {
        "id": "1m5g3go",
        "author": "EffectiveTie3144",
        "title": "Happy birthday to Endrick Felipe Moreira de Sousa 🇧🇷",
        "content": "",
        "upvotes": 205,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m5g3go/happy_birthday_to_endrick_felipe_moreira_de_sousa/"
    },
    {
        "id": "1m5f4fj",
        "author": "Sl_PROXY",
        "title": "[Fabrizio Romano] Jacobo Ramón to Como, here we go! Deal agreed with Real Madrid for the defender. €2.5m fee plus add-ons based on the appearances. Real Madrid will have 50% sell-on clause and also 3 buy back clauses, same as Nico Páz deal.",
        "content": "",
        "upvotes": 203,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zJ_yVpKMI4mDio8VnogqUucD1e69nkLxzS_9kKFdsPU.jpg?auto=webp&amp;s=d13c17698d284b404dabf32fd7b1ae838f21b6d3"
        },
        "permalink": "/r/realmadrid/comments/1m5f4fj/fabrizio_romano_jacobo_ramón_to_como_here_we_go/"
    },
    {
        "id": "1m5msn5",
        "author": "RioPlatense1996",
        "title": "Real Madrid any time a player with a recent injury becomes available",
        "content": "After reading a report that Real Madrid are heavily interested in Rodri I couldn’t help but think of this. Why are we always buying players that are injury prone? Alaba was already having injury issues at Bayern and we still decided to bring him on at 29 years old with a huge salary. Currently 2nd highest paid players. Rodri is now 29 and coming back from an ACL injury. I don’t think it would be a smart investment.  ",
        "upvotes": 56,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/nm1g8zur29ef1.jpeg?auto=webp&amp;s=3952dae751bbd13932d2b8a7caae449027b156f4"
        },
        "permalink": "/r/realmadrid/comments/1m5msn5/real_madrid_any_time_a_player_with_a_recent/"
    },
    {
        "id": "1m5f66e",
        "author": "Ineedhelpistaken",
        "title": "Who’s the most “Real Madrid-coded” player who never played for us?",
        "content": "Just curious what everyone thinks, who’s that one player who felt like they should’ve worn the white shirt but never actually did?\n\nCould be due to their playing style, mentality, aura, winning mindset, clutch moments, or even off-the-pitch charisma. Someone who just fits the Real Madrid DNA even though they never played a single minute for us.\n\nWho’s your pick and why?\n",
        "upvotes": 140,
        "comments": 160,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m5f66e/whos_the_most_real_madridcoded_player_who_never/"
    },
    {
        "id": "1m5cf88",
        "author": "Ready_Ad_1353",
        "title": "Toni Kroos: \"I retired at the peak of my powers. It's a great feeling as you’re the one who made the decision [...] Neither my coach, nor my family, nor my body were going to tell me when to retire. You can't stand it until you're 40. You have to leave football before football leaves you.”",
        "content": "**The full quote on his retirement:**\n\n'I spent several months thinking about this. I mean, I didn't just get out of bed one morning and suddenly say to myself, \"You have to retire!\" No, I thought about it a lot. I had already thought about retiring the year before, but in the end I decided to renew for another year with Real Madrid, they had been very insistent. But that didn't change my idea, which was always to retire like this, and luckily I've managed it. I think it's difficult to do better than I did in my last season with Real Madrid. I left after winning La Liga and the Champions League. Adiós.\"\n\nThe best thing is to leave at the very top. You walk away with a great feeling because you’re the one who made the decision. And before someone sent me to the bench because I wasn’t as good anymore or because I wasn’t as important to the team as I was right up to the end. I preferred to be the one to step away. I wanted to avoid all that. Neither my coach, nor my family, nor my body were going to tell me when to retire. You can't stand it until you're 40. You have to leave football before football leaves you\"",
        "upvotes": 207,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7JEBsboZJ78tME1pRegwa0sI89cFS0N6hMaaVQ5sllY.jpeg?auto=webp&amp;s=b0e3eec53058dccdc3b0578e83c1ecdb37e67a42"
        },
        "permalink": "/r/realmadrid/comments/1m5cf88/toni_kroos_i_retired_at_the_peak_of_my_powers_its/"
    },
    {
        "id": "1m5k6am",
        "author": "AjVine",
        "title": "The sense of an actual team these players transmitted. Everybody including Ronaldo running and defending together. Man we might never have a team like this again.",
        "content": "I think everyone except maybe Courtois in that team would not start over any of our current team. They’re legends of their own, you see them all pressing, running behind the ball. You even see Cristiano at minute 75 in our area defending a corner. That’s why we won 3 CL in a row. Nobody complained about anyone’s work rate and they all ran. That was a team. We have some of the best players in each position at this day and age and I believe things can work out but our team has an attitude problem not necessarily lack of quality or tactics and I do think even Vini and Mbappe can play together. I hope Xabi’s presence shows that he is not there to make friends but to mold a bunch of players into a team. If they all collectively put as much heart as Valverde does, we would steamroll most teams in La Liga and compete against the big ones in Europe. ",
        "upvotes": 50,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kyLrook_JR3tKYhk8tit3E4aBt2xxF0ukNWEpu9zuyE.jpeg?auto=webp&amp;s=cd4621020af5f5ea1c0276b4a9aa4861f4733607"
        },
        "permalink": "/r/realmadrid/comments/1m5k6am/the_sense_of_an_actual_team_these_players/"
    },
    {
        "id": "1m5nkwr",
        "author": "Low_Gap8692",
        "title": "Little Madrid edit I made for next season 🇪🇸🤍",
        "content": "Should I make another?",
        "upvotes": 14,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tg5ladul79ef1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m5nkwr/little_madrid_edit_i_made_for_next_season/"
    },
    {
        "id": "1m58ig0",
        "author": "Thatone_Guy22",
        "title": "Thank you,Luka Modrić and Lucas Vasquez ❤️",
        "content": "So I  was chilling and there's a channel on my TV that shows nothing but Champions League, from classic matches, replays, etc, and since I was bored I clicked it and it happened to show our comeback against Dortmund on MD 3.\nI have to say when I saw that Luka and Vasquez were leaving  I  always try to stay composed (I've done that when other players left as well), but seeing what both did in that match again I did shed a tear.\nThese two were a part of my  football heroes list and they made football great and fun for me growing  up and I feel really  bad for Vasquez considering he was the one to get criticized  quickly (even tho was out of position  for most of the season.)\nEither way, since  I haven't been active in this community and haven't said it yet.\nThank you, Luka Modrić  and Lucas Vasquez  you'll always be legends \n🤍💙💛",
        "upvotes": 107,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m58ig0/thank_youluka_modrić_and_lucas_vasquez/"
    },
    {
        "id": "1m4hieh",
        "author": "menu07",
        "title": "How do I explain to my children that Gareth Bale's favorite sport is golf?",
        "content": "",
        "upvotes": 2975,
        "comments": 120,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zv194hkvyydf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m4hieh/how_do_i_explain_to_my_children_that_gareth_bales/"
    },
    {
        "id": "1m4n9s4",
        "author": "Superb-Wolf1008",
        "title": "El capitano will forever be missed",
        "content": "",
        "upvotes": 645,
        "comments": 26,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3qhh9jexr0ef1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m4n9s4/el_capitano_will_forever_be_missed/"
    },
    {
        "id": "1m4imie",
        "author": "landofphi",
        "title": "Toni Kroos: \"I retired at the peak of my powers. It's a great feeling as you’re the one who made the decision. [...] Neither my coach, nor my family, nor my body were going to tell me when to retire. You can't stand it until you're 40. You have to leave football before the body asks you to stop.\"",
        "content": "**The full quote on his retirement:**\n\n'I spent several months thinking about this. I mean, I didn't just get out of bed one morning and suddenly say to myself, \"You have to retire!\" No, I thought about it a lot. I had already thought about retiring the year before, but in the end I decided to renew for another year with Real Madrid, they had been very insistent. But that didn't change my idea, which was always to retire like this, and luckily I've managed it. I think it's difficult to do better than I did in my last season with Real Madrid. I left after winning La Liga and the Champions League. Adiós.\"\n\nThe best thing is to leave at the very top. You walk away with a great feeling because you’re the one who made the decision. And before someone sent me to the bench because I wasn’t as good anymore or because I wasn’t as important to the team as I was right up to the end. I preferred to be the one to step away. I wanted to avoid all that. Neither my coach, nor my family, nor my body were going to tell me when to retire. You can't stand it until you're 40. You have to leave it before the body asks you to stop.\"",
        "upvotes": 898,
        "comments": 56,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FO-aHrpdzh49l4F7eW3CfK0EWegSxmSVAD2rBXqAF2E.jpeg?auto=webp&amp;s=2b88b82c1a7a37962d3beeadf12302e29356342d"
        },
        "permalink": "/r/realmadrid/comments/1m4imie/toni_kroos_i_retired_at_the_peak_of_my_powers_its/"
    },
    {
        "id": "1m4nnj1",
        "author": "More-Judgment-9253",
        "title": "Almost every goal we conceded in the CWC was because of Rudiger and Asencio💀.",
        "content": "Against Al Hilal: Pen conceded because of asencio ( to be fair huijsen kinda messed up the offside trap but still)\n\nAgainst Pachuca: Not directly anyone's fault but asencio getting a red card didn't help.\n\nAgainst Dortmund: Rudiger had a horrendous clearance for the first goal and then he lost guirassy for the second goal ( yes huijsen was reckless but rudiger really didn't do anything good either)\n\nAgainst PSG: We all know about the first 2 goals but I would also say the 3rd goal is rudiger's fault as well because he was nowhere to be seen ( or maybe we should just blame the whole team for that)\n\nNow I understand rudiger played with basically one knee last season so he deserves praise for that and asencio saved us a lot last season but we really need another CB. They should still start games tho but maybe against smaller teams first",
        "upvotes": 214,
        "comments": 30,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m4nnj1/almost_every_goal_we_conceded_in_the_cwc_was/"
    },
    {
        "id": "1m4iwa5",
        "author": "landofphi",
        "title": "Former Real Madrid player Javier \"Chicharito\" Hernandez sparks fury by accusing women of 'eradicating masculinity by making society hypersensitive' and claims they should focus on 'multiplying, cleaning, and sustaining the home'",
        "content": "**The full quote**\n\nWomen, you are failing. You are eradicating masculinity by making society hypersensitive. Embrace your feminine energy: nurturing, caring, receiving, multiplying, cleaning, maintaining the home, which is the most precious place for us men. Do not be afraid to be women, to allow yourselves to be led by a man who only wants to see you happy, because we do not know heaven without you. Holding yourselves responsible for your energy is also a way of loving you.",
        "upvotes": 461,
        "comments": 252,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pbu46iacezdf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m4iwa5/former_real_madrid_player_javier_chicharito/"
    },
    {
        "id": "1m4odzj",
        "author": "Limp-Yesterday-5669",
        "title": "A complete TACTICAL analysis of the CWC (by @Football Made Simple in youtube)",
        "content": "**I Watched 597 Minutes Of Alonso's Madrid, We HAVE To Talk About His Tactics | Complete Analysis**",
        "upvotes": 94,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/fsrvjvmSFK9EBqSximcwP_oLfW3NVc1b-7Ss5VbSLpw.jpeg?auto=webp&amp;s=b6fd4257c459fc18158bcd69172e1e02c2fedb63"
        },
        "permalink": "/r/realmadrid/comments/1m4odzj/a_complete_tactical_analysis_of_the_cwc_by/"
    },
    {
        "id": "1m48b38",
        "author": "Imetanga",
        "title": "Courtois might actually be the best keeper we’ve ever had",
        "content": "I know this might sound unpopular, but hear me out. I’ve followed Real Madrid for a long time. I remember watching Iker Casillas make his debut at 18 against Athletic Bilbao. He was a legend, no doubt. Amazing reflexes, clutch saves, a symbol of the club.\n\nBut if we’re being honest, Casillas had flaws too. He was shaky at times, especially on crosses and aerial balls. That’s one of the reasons why he eventually lost his place to Diego López around the age of 31.\n\nNow look at Courtois.\n\nSince he joined Real Madrid, he completely owned the number one spot. Nobody questioned it. Not even Keylor Navas, who had great moments and made big saves, could truly challenge him. But Keylor also had weaknesses, especially when it came to dealing with high balls and staying consistent.\n\nCourtois brings something different. He’s calm, dominant in the air, and shows up in big matches. Just think about the Champions League final in Paris. That performance wasn’t just good, it was historic.\n\nEven now, despite his age and the time missed due to injury, nobody is seriously thinking about replacing him. That level of trust says a lot.\n\nIn my opinion, Courtois is the most complete and consistent goalkeeper we’ve had in modern Real Madrid history. Not trying to erase what Casillas did. But based on what I’ve seen, Courtois is that guy.",
        "upvotes": 464,
        "comments": 86,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m48b38/courtois_might_actually_be_the_best_keeper_weve/"
    },
    {
        "id": "1m43bj0",
        "author": "Arka_ji1729",
        "title": "They said 'mark your man'-I took it literally.",
        "content": "",
        "upvotes": 815,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vcowl3dgjvdf1.jpeg?auto=webp&amp;s=dc781473760befb01c8e59f288f53f7770515dc9"
        },
        "permalink": "/r/realmadrid/comments/1m43bj0/they_said_mark_your_mani_took_it_literally/"
    },
    {
        "id": "1m3ur3e",
        "author": "No-Independent2522",
        "title": "Figo at Coldplay concert in 2000",
        "content": "",
        "upvotes": 1858,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wf2mel2lotdf1.jpeg?auto=webp&amp;s=93d78897a523c77b0138456f8d09e21aa150fc2b"
        },
        "permalink": "/r/realmadrid/comments/1m3ur3e/figo_at_coldplay_concert_in_2000/"
    },
    {
        "id": "1m3rzvf",
        "author": "Ready_Ad_1353",
        "title": "I desperately want this Vini Jr back!!!",
        "content": "",
        "upvotes": 2061,
        "comments": 73,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ommeuiolusdf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m3rzvf/i_desperately_want_this_vini_jr_back/"
    },
    {
        "id": "1m3y6zt",
        "author": "choker_18",
        "title": "The vini, every madridista wants next season.",
        "content": "",
        "upvotes": 471,
        "comments": 60,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/csacjaochudf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m3y6zt/the_vini_every_madridista_wants_next_season/"
    },
    {
        "id": "1m4ag9d",
        "author": "Small_Gas_8827",
        "title": "How many goals will Mbappé score next season?",
        "content": "Last season, I asked this same question. I said it was going to be between 40 and 45, and look, he ended up with 44, breaking Zamorano's record for more goals in a debut season with Real Madrid. My guess is that he'll score more than last season, like between 45 and 50 maximum. What is your opinion on this, guys?",
        "upvotes": 39,
        "comments": 51,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m4ag9d/how_many_goals_will_mbappé_score_next_season/"
    },
    {
        "id": "1m3qnog",
        "author": "Ghost-Ripper",
        "title": "@ascencio on his IG: Thankyou for everything, Captain..#GraciasLucas#",
        "content": "",
        "upvotes": 532,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m3qnog/ascencio_on_his_ig_thankyou_for_everything/"
    },
    {
        "id": "1m45ck1",
        "author": "basedzone",
        "title": "How do you see Madrid performing next season?",
        "content": "I believe we'll be fine. The defence is sorted. We just need to take care of the striker partnership. Vini/Mbappe need to get their shit together. Or maybe not play together.\nArda also has to step up big time unless we buy a new midfielder.\n\nI have faith in Xabi. But im also scared. Hope it works well and I think it will. What about you?",
        "upvotes": 53,
        "comments": 83,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m45ck1/how_do_you_see_madrid_performing_next_season/"
    },
    {
        "id": "1m3at33",
        "author": "Optimal_Lie7824",
        "title": "What is your mount Rushmore of the last decade?",
        "content": "",
        "upvotes": 1047,
        "comments": 145,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/u49s04gpjodf1.jpeg?auto=webp&amp;s=557830d7e33e51955d20bbaf184d1f9f84bb1642"
        },
        "permalink": "/r/realmadrid/comments/1m3at33/what_is_your_mount_rushmore_of_the_last_decade/"
    },
    {
        "id": "1m3qhiv",
        "author": "barrymj26",
        "title": "Xabi Alonso and the Non-Negotiable Work Rate: Will Mbappe or Vini Jr. Face the Bench?",
        "content": "Alright Madristas,\n\nLet's talk about the burning question at Real Madrid under Xabi Alonso: Will he actually bench Kylian Mbappé or Vinicius Jr. if they don't consistently track back and contribute defensively?\n\nWe've all seen the dazzling runs, the insane goals, the moments of pure individual brilliance from these two. But for years, a common criticism, especially of Mbappé at PSG and at times Vini Jr. under Ancelotti, has been their perceived lack of defensive involvement. With Alonso now at the helm, a manager who built a historically disciplined, high-work-rate Bayer Leverkusen side, this issue is amplified.\n\nAlonso's philosophy is crystal clear. He has repeatedly stressed the importance of a collective defensive effort, stating, \"In my view, we ALL have to defend. The 11 players have to press. Vinicius Jr, Jude, Fede Valverde, Mbappé. All of them.\" This isn't just lip service; his Leverkusen team operated with an intense, synchronized press and positional discipline that was instrumental to their unbeaten season.\n\nLooking at last season, particularly in the recent Club World Cup semifinal loss to PSG, reports surfaced about Alonso holding \"crunch talks\" with both Mbappé and Vini Jr. regarding their on-field attitudes and defensive work rate. While Mbappé's illness might have played a role, the sentiment from the club hierarchy, as reported by Marca, was a concern over the team's lack of fluency and failure to work together defensively, stemming from an alleged lack of effort from the attacking duo.\n\nWe saw glimpses of Vini Jr. putting in more defensive shifts under Ancelotti at times, but it was often inconsistent. Mbappé, on the other hand, has a well-documented history of conserving energy for attacking exploits.\n\nSo, the question is: are these world-class talents truly \"non-negotiable\" in Alonso's system, even if their defensive contributions don't meet his rigorous standards? Or will the sheer offensive output outweigh the defensive compromises? Leverkusen's success was built on a strong collective, not just individual brilliance.\nWhat do you all think? Has Xabi Alonso shown enough resolve at Leverkusen to suggest he'd make such a drastic call? Or are Mbappé and Vini Jr. simply too important to ever be benched, forcing Alonso to adapt his system around them? \n",
        "upvotes": 88,
        "comments": 44,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m3qhiv/xabi_alonso_and_the_nonnegotiable_work_rate_will/"
    },
    {
        "id": "1m37zd8",
        "author": "amungus45",
        "title": "Our Chill Guy (Dean Huijsen) in aura farming mode",
        "content": "",
        "upvotes": 1170,
        "comments": 40,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jgiauyqa0odf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m37zd8/our_chill_guy_dean_huijsen_in_aura_farming_mode/"
    },
    {
        "id": "1m376yh",
        "author": "Mindless_Life_3585",
        "title": "This is beautiful, Thanks Lucas ❤",
        "content": "",
        "upvotes": 1181,
        "comments": 24,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/nctt6rd2vndf1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1m376yh/this_is_beautiful_thanks_lucas/"
    },
    {
        "id": "1m3vjrp",
        "author": "MemphisGrizz4974",
        "title": "Real Madrid Basket signed Forward Chuma Okeke (201) from NBA",
        "content": "",
        "upvotes": 22,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/MMsLJBFdvzs3N9RW3mr-s72zMPHVEEBGTDdz3YIFnTM.jpeg?auto=webp&amp;s=cb4aa0765cefe279493b85b150dbf8d6cb090809"
        },
        "permalink": "/r/realmadrid/comments/1m3vjrp/real_madrid_basket_signed_forward_chuma_okeke_201/"
    },
    {
        "id": "1m3i751",
        "author": "cluelessa",
        "title": "Which Real Madrid signing were you really excited about, but didn’t end up to your expectations",
        "content": "Most obvious one is Eden hazard. He was going to be our golden boy and seemed the perfect player to finally take over Ronaldo spot.\n\nThe next one is Kaka for me. He wasn’t a terrible player for us, just didn’t live to hype or expectations. Former B allon d'Or winner, paired with cr7; it  seemed we were going to have an unstoppable front.",
        "upvotes": 144,
        "comments": 162,
        "media": null,
        "permalink": "/r/realmadrid/comments/1m3i751/which_real_madrid_signing_were_you_really_excited/"
    }
]