[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 480,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1h729mg",
        "author": "Longjumping_Pen_2405",
        "title": "Looking for netflix series that are COMPLETED already with multiple seasons (not limited series). Im sick to death of them cancelling every second good fkn show",
        "content": "Just finished KAOS. Thought it was unique, creative, and incredibly well done. Its obviously been cancelled. As was archive 81, lockwood &amp; co, Mindhunter, CAOS (sabrina), midnight club, the society, 1899..... all this suspenseful and engaging shows that I've LOVED. \n\nSuggestions for series with at least 2 seasons and that have a proper conclusion/ending?",
        "upvotes": 61,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1h729mg/looking_for_netflix_series_that_are_completed/"
    },
    {
        "id": "1h794tn",
        "author": "hospitalsinwinter",
        "title": "Spielberg and critics are fans of Mo, and season 2 is finally coming in January",
        "content": "",
        "upvotes": 11,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h794tn/spielberg_and_critics_are_fans_of_mo_and_season_2/"
    },
    {
        "id": "1h77fvm",
        "author": "Whobitmyname",
        "title": "'One Piece' Season 2 Aiming for Christmas 2025 Release According to Actor",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h77fvm/one_piece_season_2_aiming_for_christmas_2025/"
    },
    {
        "id": "1h7b6qm",
        "author": "indiewire",
        "title": "The 27 Scariest Movies on Netflix: Pearl, Psycho, Jaws &amp; More",
        "content": "",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h7b6qm/the_27_scariest_movies_on_netflix_pearl_psycho/"
    },
    {
        "id": "1h7a1nx",
        "author": "Tomhyde098",
        "title": "Yearly return for one month!",
        "content": "It's that time of year, I'm subscribing to Netflix for a month so I'm wondering what are the best things that I missed out on! I also skipped last year so technically what are some of the best shows and movies from the last couple years? Thanks!",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h7a1nx/yearly_return_for_one_month/"
    },
    {
        "id": "1h73dzr",
        "author": "upikaroh",
        "title": "Netflix's horror code is 8710 and 8711.",
        "content": "Hie fellow redditors. \n\nJust type 8710 (for Dark movies) and 8711 (for the horror movies) in the search bar and it will bring up all things horror (and one or two weirdly not) .\n\nThese are all the horror themed films and shows without an algorithm applied.\n\nEnjoy and happy spooky season",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h73dzr/netflixs_horror_code_is_8710_and_8711/"
    },
    {
        "id": "1h6h49s",
        "author": "misana123",
        "title": "‘Wednesday’ Season 2 Wraps Production",
        "content": "",
        "upvotes": 136,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1h6h49s/wednesday_season_2_wraps_production/"
    },
    {
        "id": "1h75rok",
        "author": "Fit_Argument3087",
        "title": "What's Your Perception of English Dubbing?",
        "content": "Hi everyone! I’m currently working on my master’s thesis and I’m exploring English dubbing - its quality, cultural impact, how it’s perceived by audiences. I’d love to hear your thoughts! \n\n\\- What do you think of English dubbing in general? (e.g., films, TV shows, anime, etc.)\n\n\\- Are there any specific examples (good or bad) that stand out to you?\n\n\\- Have you watched \"Dark\" or \" Money Heist \" in English? Did you like it?\n\n\\- Do you think it is useful to watch English dubbed movies to learn English (if you are not a native English speaker)?\n\nPlease also let me know, if possible, where you're from (or, at least, if you are a native English speaker or not). Your input would be invaluable to my research, and I’m truly grateful for any insights you can share. Feel free to be as detailed or brief as you’d like!\n\nThank you so much for helping out, and I’m looking forward to reading your opinions.",
        "upvotes": 3,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1h75rok/whats_your_perception_of_english_dubbing/"
    },
    {
        "id": "1h79zh5",
        "author": "Pink_Raven88",
        "title": "Teenage bounty hunters",
        "content": "Stumbled across this one recently. It’s so cute! Only one season because I think Covid got in the way, but I recommend it. I would’ve lived to get another season or 2 out of it. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h79zh5/teenage_bounty_hunters/"
    },
    {
        "id": "1h79iau",
        "author": "Proper_Ad_5547",
        "title": "Looking for a Netflix show I watched a few years ago ",
        "content": "Basically where people would pitch to a crowd and people would press a light if they wanted to buy it. It was in the Uk and potentially a collab with channel 4- driving me crazy that I can’t remember the name!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h79iau/looking_for_a_netflix_show_i_watched_a_few_years/"
    },
    {
        "id": "1h74m3w",
        "author": "Few-Revolution8907",
        "title": "Tv show reccomendations ",
        "content": "I’m on the hunt for a new TV show to completely obsess over! I absolutely LOVE romantic TV shows, so if it’s got a swoon-worthy love story, I’m in. Whether it’s light and feel-good, dramatic and steamy, or filled with heartache and longing, I’m open to anything as long as romance is at the center of it. Bonus points if it has great chemistry between the leads, compelling storylines, or unforgettable moments that will have me rewatching scenes over and over again.\n\nHelp me expand my watchlist—I want something I can binge and completely fall in love with. What’s the most romantic TV show you’ve ever seen? Drop your recommendations below!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h74m3w/tv_show_reccomendations/"
    },
    {
        "id": "1h77o52",
        "author": "kaylabedumb",
        "title": "To those who have watched “A Good Girls Guide to Murder”",
        "content": "I’m planning to draw a comic strip of one specific scene from AGGGTM but I want it to be an important scene but I can’t come to a conclusion on which one is best\n\nWhat would you say is the most significant scene in the show/book?? 🙏 ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h77o52/to_those_who_have_watched_a_good_girls_guide_to/"
    },
    {
        "id": "1h70bkr",
        "author": "Famous-Back8353",
        "title": "In the series “baby” what happens at the club? ",
        "content": "I have so many questions from the pilot. When chiara and ludo go to club. There are two guys who say “those two will make me a lot of money” but in the second episode it doesn’t mention what happens after that. It time jumps to the next day instead. Did those guys drug them or did they get away? Also I’m so upset for chiara ignoring ludo in front of her friends.. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h70bkr/in_the_series_baby_what_happens_at_the_club/"
    },
    {
        "id": "1h76ye0",
        "author": "credoinvisibile",
        "title": "Cheers, darlings! Black Doves is now playing on Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h76ye0/cheers_darlings_black_doves_is_now_playing_on/"
    },
    {
        "id": "1h76xzy",
        "author": "JCEurovision",
        "title": "Interactive specials regarding trivia are gone, forever.",
        "content": "I enjoy playing \"Trivia Quest\" and \"Triviaverse\" because there would be excellent interactive specials for game show aficionados and those who want to do more quizzes. Sadly, that has been long gone, and I wish all those interactive specials would return on Netflix. But now, only four interactives remain from the Netflix library, and I can't watch any of them.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h76xzy/interactive_specials_regarding_trivia_are_gone/"
    },
    {
        "id": "1h70026",
        "author": "Ashyboi13",
        "title": "Weird color saturation",
        "content": "So I was watching Stranger Things tonight and in the middle of an episode the color saturation went wild. Scenes will switch being looking completely normal to being colored green to colored red, to the point it’s hard to see in darkly lit scenes. On the Netflix menu everything is colored normally. In fact, my entire TV looks totally normal, and I went through my color settings and everything was fine. Has anyone else had this problem ever? Any possible fixes?",
        "upvotes": 5,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h70026/weird_color_saturation/"
    },
    {
        "id": "1h6huad",
        "author": "Atlast_2091",
        "title": "Sakamoto Days | Official Trailer | Netflix",
        "content": "",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h6huad/sakamoto_days_official_trailer_netflix/"
    },
    {
        "id": "1h6f0pj",
        "author": "S4v1r1enCh0r4k",
        "title": "It seems that 'Quicksilver' romantasy adaptation is coming to Netflix, they won the bidding war with a massive 7-figure deal",
        "content": "",
        "upvotes": 14,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1h6f0pj/it_seems_that_quicksilver_romantasy_adaptation_is/"
    },
    {
        "id": "1h6lhs9",
        "author": "Accomplished-Dress-9",
        "title": "Black subtitles",
        "content": "Suddenly my white normal subs have turned black on the tv. The serie itself is dark so i cant see them.. how do i change them? I tries the settings on netflix tv app",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h6lhs9/black_subtitles/"
    },
    {
        "id": "1h6ttmg",
        "author": "EnvironmentalAd1988",
        "title": "Changing internet providers",
        "content": "Will I be locked out of my netflix when I change internet providers tomorrow. Obviously I will have a new IP address so will netflix lock me out because it won't think I'm part of the household? ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h6ttmg/changing_internet_providers/"
    },
    {
        "id": "1h6tad4",
        "author": "unitedfan6191",
        "title": "What upcoming (live or pre-recorded) shows or movies are you looking forward to watching in 2025?",
        "content": "Hi all.\n\nHope you’re doing well.\n\nThis is not a suggestion thread, but a discussion about what especially intrigues you about upcoming movies or shows.\n\nI am *really* looking forward to Wallace &amp; Gromit: Vengeance Most Fowl because I’ve always been a fan of stop-motion animation and grew up watching Wallace &amp; Gromit and key creative personnel from the original (including the original creator) are returning. \n\nMaybe it turns out to be nostalgia bait, but that’s not something I will hold against it before it’s released.\n\nI am also curious how Netflix handles regular live programming for the first time with the WWE.\n\nWhat about you?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h6tad4/what_upcoming_live_or_prerecorded_shows_or_movies/"
    },
    {
        "id": "1h6xigq",
        "author": "camiliski",
        "title": "Leave The World Behind 👂💥",
        "content": "#spoilers. \nthis movie. This movie bout PISSED me tf off. \nlikeeee, it needs more. \nThe mom finding the daughter. \nThe boy that’s sick. Getting better or ???\nThe adults locating the bunker. \nFINDING OUT WHATS REALLY GOING ON..??!  Like hello. Cliffhanger or just a LAME @$$ ending??! So mad. ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1h6xigq/leave_the_world_behind/"
    },
    {
        "id": "1h6l3oh",
        "author": "creel_mg",
        "title": "Will be gifting Netflix to my sister for her birthday",
        "content": "I have never purchased Netflix but want to gift at least an year of subscription to my sister. In India, there is no option to have a Netflix gift card but there are workarounds to this. My main concern is that I was initially thinking of buying the Standard Plan (499 INR : 5.89 USD per month) which supports 2 concurrent devices on a household network but I can also afford the Premium Plan (649 INR : 7.66 USD per month) which supports 4 devices. The all time big question - will it be possible to have 2 devices on one wifi at my house and 2 devices on my sister's wifi in her house. She is married but it is possible for us to bring the 4 devices on the same network at least once a month. Will this work with the netflix household? Please any help is appreciated.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1h6l3oh/will_be_gifting_netflix_to_my_sister_for_her/"
    },
    {
        "id": "1h6qe3a",
        "author": "VisualDapper",
        "title": "Anyone else unable to watch their shows after new ui on iOS?",
        "content": "Netflix auto updated and I am now unable to see my continue watching list and when I go to search for my show there’s no option to play an episode only a “remind me” button. Is anyone else experiencing something similar?",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h6qe3a/anyone_else_unable_to_watch_their_shows_after_new/"
    },
    {
        "id": "1h5p4yu",
        "author": "aresef",
        "title": "‘Cunk On Life’ Netflix Special Sets January Premiere Date",
        "content": "",
        "upvotes": 184,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1h5p4yu/cunk_on_life_netflix_special_sets_january/"
    },
    {
        "id": "1h6ndby",
        "author": "ProcedureNo2050",
        "title": "Why arcane disappeared from my netflix?",
        "content": "I started to watch season 2 of arcane and today i opened netflix and i cant find arcane with any kind of search? Does anyone know what could be the cause for this?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h6ndby/why_arcane_disappeared_from_my_netflix/"
    },
    {
        "id": "1h6nbbo",
        "author": "realjacksonluck",
        "title": "The Merry Gentlemen Netflix Christmas Moive MC Is See Through",
        "content": "Anyone else notice that at about 19mins 10 seconds (1hr 8mins 36sec Remaining) Ashely goes somewhat see through XD. Idk why that would happen. I don't see a reason why they would have had to record her on a greenscreen and then add her in post. But thats the only thing I can think of that happened. Anyone else have a better idea?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h6nbbo/the_merry_gentlemen_netflix_christmas_moive_mc_is/"
    },
    {
        "id": "1h68f87",
        "author": "HeliumRhenium",
        "title": "the snow sister",
        "content": "has anyone watched this?! what did you think?? need someone to talk to about it 😭😭😭\n\nknew it was gonna be sad and could also tell that twist was coming BUT it still broke heart...I cried so much 😭😭😭\n\nseeing how depression is expressed differently between the adults and children is so subtle but deeply moving. the ice skates scene...oof. \n\n",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h68f87/the_snow_sister/"
    },
    {
        "id": "1h6xmcb",
        "author": "curious_they_see",
        "title": "Another Churchill Drama?",
        "content": "( Downvote me all you want but want to vent anyways).\n\nAs an Asian, sick of another drama/documentary glorifying Churchill. I totally understand this is catered to the Western Audience but come on, not a bit about 3 Million Indians who died because of Famine caused due to direct Actions of Churchill.\n\nHitler's actions cannot be condoned, but number of Jews killed in Holocaust: Six Million. Number of Black and Brown people killed by European Imperialism: North of 10 Million.\n\nNumber of Documentaries/Dramas promoted in Netflix showing Imperialism/Colonialism: Zero.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h6xmcb/another_churchill_drama/"
    },
    {
        "id": "1h5truk",
        "author": "Horror_Effective12",
        "title": "'The Madness' Review - Is it actually binge-worthy?",
        "content": "",
        "upvotes": 37,
        "comments": 87,
        "media": null,
        "permalink": "/r/netflix/comments/1h5truk/the_madness_review_is_it_actually_bingeworthy/"
    }
]