[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 13,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oaximx",
        "author": "SaltPomegranate4",
        "title": "The Perfect Neighbour is one of the most incredible documentaries I’ve ever seen.",
        "content": "Absolutely powerful. No narration. Just body cam footage acting as a first person account. Incredibly painful to watch. I cried a lot. \n\nThe anger that they didn’t arrest her. That they said “thank you” after she finally stood up to be taken to be charged. America has a big racism problem and it’s not just Susan Lorincz. \n\nIt’s an indictment on the US justice system that I had predicted she’d get away with it or given just a few years in prison. The absolute RELIEF when she got sent down. I hope she’s miserable for the rest of her days. \n\nWhat a beautiful community. I hope the boys and all the neighbours affected are supported through their pain. ",
        "upvotes": 336,
        "comments": 60,
        "media": null,
        "permalink": "/r/netflix/comments/1oaximx/the_perfect_neighbour_is_one_of_the_most/"
    },
    {
        "id": "1ob7ipu",
        "author": "typetiming",
        "title": "something weird abt the perfect neighbor",
        "content": "Susan never talks about any of the other kids in the documentary. Out of all the kids that i could see maybe about 7 of them were black meanwhile there was an entire community of kids that were a mix of races from hispanic to white. \n\nI was honestly surprised the detectives didn’t bring up the fact that she only ever had issues with the black children and not the other children considering the parents of the other children, like that mom, would yell at Susan as well. I think them bringing this up might’ve strengthened their case about her obvious racism as well",
        "upvotes": 69,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1ob7ipu/something_weird_abt_the_perfect_neighbor/"
    },
    {
        "id": "1oaxz4z",
        "author": "JusHarrie",
        "title": "The Perfect Neighbour- What shocked me so much....",
        "content": "...was that this could have been any neighbourhood and could happen anywhere. I remember playing out in the village I was raised in as a child, and there was always one weird house where a scary adult would live. You and your friends would all avoid them at all costs, but sometimes a ball would just go into their garden by accident or you'd just be existing and they'd make your life a misery when they came out, etc. I forgot how scary that used to be as a child and this documentary really reminded me of that fear and power imbalance of an adult making you feel that way when you are just playing and having fun outdoors which should be such a magical part of childhood. I knew something horrible was going to happen in this situation of course, but for some reason I didn't think it would be such a cruel and barbaric murder like that for some reason. Yes, the lady is definitely mean, racist, angry and a nasty bully, but for her to take the life of that wonderful lady and mother, and leave those babies motherless just absolutely broke my heart, I just didn't see it coming. All of that loss and hurt over something minor. One minute they had their lovely mother just advocating for her children and defending them like she had every right to do so, and then next minute she was gone. Her life was lost, and those poor children of hers will never feel the same again. All over that evil lady, who had years to just go live somewhere else if she wasn't happy in a family neighbourhood.\n\nI don't know. It's just really broken my heart. It's just so senseless. ",
        "upvotes": 227,
        "comments": 165,
        "media": null,
        "permalink": "/r/netflix/comments/1oaxz4z/the_perfect_neighbour_what_shocked_me_so_much/"
    },
    {
        "id": "1ob2x5q",
        "author": "AdvancedDay7854",
        "title": "The Perfect Neighbor- What was the deal with Susan breaking down that fence",
        "content": "Felt it was kind of a loose end, but did Susan end up paying for that fence she broke through? Was it ever revealed why she did it other than her excuses? Did she feel emboldened because she’d ‘gotten away’ essentially with this to be more brazen? ",
        "upvotes": 88,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1ob2x5q/the_perfect_neighbor_what_was_the_deal_with_susan/"
    },
    {
        "id": "1ob5bpx",
        "author": "aspiringimmortal",
        "title": "WTF Netflix??",
        "content": "Netflix, my dude, explain something to me…\n\nHow on earth are you releasing Frankenstein **A WEEK AFTER** Halloween?\n\nI don’t understand. That’s like releasing a Santa movie in January. Do you hate money? Make this make sense?",
        "upvotes": 55,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1ob5bpx/wtf_netflix/"
    },
    {
        "id": "1ob5wlo",
        "author": "tellmestuffineed2kno",
        "title": "Perfect Neighbor",
        "content": "I have 30 minutes left in this documentary and WHY ISN’T THIS PIECE OF $HIT NOT IN JAIL YET????? I pray to God she doesn’t walk free. She was using the N word like it was nothing being interviewed by the detectives the first time. Evil. Pure evil\n",
        "upvotes": 23,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ob5wlo/perfect_neighbor/"
    },
    {
        "id": "1ob5tuk",
        "author": "gamblinonme",
        "title": "Boots is so fucking good",
        "content": "Idk how accurate the portrayal of Marine boot camp is but they did an amazing job of character development. They did a great job of addressing toxic masculinity, how men struggle with sexuality in the armed forces at any age, how young kids struggle with figuring out who they are and their purpose, loss, relationship dynamics and much more. Kudos to Netflix- can’t wait to read the book. ",
        "upvotes": 20,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ob5tuk/boots_is_so_fucking_good/"
    },
    {
        "id": "1obb73c",
        "author": "AdExtension917",
        "title": "Just watched the perfect neighbour",
        "content": "I'm 35 year old male and I haven't cried in 17 years for bad or for worst but when the dad tells the kids the mom isn't coming back man, I was crying like a baby.. And it got me thinking about when I was young and we'd play football in the street and there was one guy who always moved us on yet nobody else cared. It's wild what memories flood back to you but I'd urge everyone to watch this ",
        "upvotes": 8,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1obb73c/just_watched_the_perfect_neighbour/"
    },
    {
        "id": "1oagjm6",
        "author": "Ok-Intention-4593",
        "title": "The Perfect Neighbor- where did Susan live before?",
        "content": "I just finished the perfect neighbor and it was horrifying. Susan was so consistently malignant and evil, it made me wonder where she lived before she moved to AJs neighborhood and if her prior neighbors have similar stories? Her next level insane behavior and repetitive but very similar lies (always fearing for her life, even as she is being placed under arrest) makes me think it’s not possible this HASN’T happened before? May she rot in prison, I’d bet my last dollar she’s terrorizing other inmates and guards daily. \nIf anyone knew her before I’d be curious to know your experience. I’m sad the law couldn’t have stopped this from happening but I don’t blame anyone but Susan. ",
        "upvotes": 607,
        "comments": 639,
        "media": null,
        "permalink": "/r/netflix/comments/1oagjm6/the_perfect_neighbor_where_did_susan_live_before/"
    },
    {
        "id": "1oarvcp",
        "author": "689Dementia",
        "title": "The Perfect Neighbor, did everyone truly consent?",
        "content": "I’m feeling deeply uncomfortable about the fact that we have access to intimate footage from a tragic event involving dozens of children, parents, couples, and people who lost their mothers. For us, it’s \"entertainment\". For them, it’s their actual lives.\n\nThis documentary is currently trending on Netflix, but I can’t stop thinking: did everyone involved truly consent to having their trauma turned into a top-rated film?\n\nI’ve seen posts on Facebook from people close to the victims, and many of them are clearly upset. Some mention that one person may have agreed, and possibly received money for everyone(maybe just a rumors), but even if that’s true, does it justify broadcasting such personal pain?\n \n- What do we know about the consent process for this kind of media?  \n- Do you think it’s ethical to share such footage if only one person agreed?  \n- Where do we draw the line between public interest and exploitation?\n\nCurious to hear your thoughts.\n",
        "upvotes": 88,
        "comments": 77,
        "media": null,
        "permalink": "/r/netflix/comments/1oarvcp/the_perfect_neighbor_did_everyone_truly_consent/"
    },
    {
        "id": "1oar7ff",
        "author": "Mylo_Does",
        "title": "I don’t start Netflix shows unless they’ve already finished",
        "content": "The OA being cancelled changed the way I watch streaming content. I thought I was watching one of the greatest stories of all time, as did many others. Now I can’t even recommend it to others because of the heartbreak.\n\nUnfinished stories are a big pet peeve of mine.\n\nAnyone else the same?",
        "upvotes": 64,
        "comments": 43,
        "media": null,
        "permalink": "/r/netflix/comments/1oar7ff/i_dont_start_netflix_shows_unless_theyve_already/"
    },
    {
        "id": "1ob7z7t",
        "author": "TemporaryBarnacle307",
        "title": "The Perfect Neighbor",
        "content": "What kind of meds do you think old Susan was on?  She seems oddly angry and paranoid, and has this weird spaced out look the entire time.  Something seems off with her cognition    She just always looks robotic and blank ",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ob7z7t/the_perfect_neighbor/"
    },
    {
        "id": "1oao54e",
        "author": "Real-Ad-5297",
        "title": "Dr Susan Lorincz - delusional",
        "content": "The most frustrating part is her sat in the interrogation room saying 'No. I can't do this. I'm not going.'\n\nWhat the actual fuck. Delusional. \n\nThe most frustrating part is her sat in the interrogation room saying 'No. I can't do this. I'm not going.'\n\nWhat the actual fuck. Delusional. ",
        "upvotes": 44,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1oao54e/dr_susan_lorincz_delusional/"
    },
    {
        "id": "1oaget4",
        "author": "Funny-Cup-9416",
        "title": "Alright Reddit, please cure my boredom, what’s something absolutely worth watching right now?",
        "content": "I want to watch something really good doesn’t matter if it’s new or old, but please no fantasy or political stuff.\n\nI watch thrillers, drama, crime, emotional stories.\n\nWhat’s that one show or movie that you guys think i should be watching tonight. \n\nI’m doing a night shift, so even if it’s a Tv Show it’s okay to me.\n\nPs: Women in the Cabin 10 sucks one of the worst films i’ve ever seen on Netflix.\n\nEdit: I finally decided to watch, “The perfect Neighbor”.",
        "upvotes": 133,
        "comments": 255,
        "media": null,
        "permalink": "/r/netflix/comments/1oaget4/alright_reddit_please_cure_my_boredom_whats/"
    },
    {
        "id": "1ob8cn3",
        "author": "InterviewCareful1784",
        "title": "THRILLER MYSTERY RECOMMENDATION",
        "content": "intense suspense murder mystery thriller soap opera original TV shows like desperate housewives with multi seasons and focused on solving murder and is fast paced",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ob8cn3/thriller_mystery_recommendation/"
    },
    {
        "id": "1obbt3r",
        "author": "Rough_Abrocoma_5663",
        "title": "NEED A GOOD MOVIE!",
        "content": "Can yall recommend me some good movies on here? I feel like I been looking, but nothing seems to interest me. I’m a whatever genre kind of guy. I don’t wanna start a movie and it’s terrible ya know lol thanks in advance \n",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1obbt3r/need_a_good_movie/"
    },
    {
        "id": "1oaxtjl",
        "author": "Adelphos33",
        "title": "Perfect Neighbor - help me solve a debate between me and my wife - should PD have intervened more forcefully earlier?",
        "content": "My argument is that the police department should have had social workers or other officials intervene into what was clearly an escalating situation. Have them talk to the lady, the kids, and the kids parents, encourage the lady to move out (especially when they learned she had a gun, which was before the shooting happened), make sure the lady is on the appropriate meds, have a cop and a social worker observe the kids play, etc. Just repeatedly sending police to that situation should have resulted in the sheriff’s office escalating to some kind of intervention.\n\nMy wife basically says you can’t do that, and it’s pointless.\n\nAm I crazy to think the police department really failed the community here by not getting more involved?",
        "upvotes": 6,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1oaxtjl/perfect_neighbor_help_me_solve_a_debate_between/"
    },
    {
        "id": "1ob0g66",
        "author": "SplitNational2929",
        "title": "Netflix's The Perfect Neighbor is currently sitting at #1, ahead of KPop Demon Hunters",
        "content": "",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ob0g66/netflixs_the_perfect_neighbor_is_currently/"
    },
    {
        "id": "1oa17bq",
        "author": "chunkybonks",
        "title": "The Perfect Neighbor - Dr. Susan Lorincz",
        "content": "Umm excuse me. What exactly was this murderer a “doctor” of? She only referred to herself as a doctor once and nothing comes up when you search for it. Anyone know?",
        "upvotes": 613,
        "comments": 1183,
        "media": null,
        "permalink": "/r/netflix/comments/1oa17bq/the_perfect_neighbor_dr_susan_lorincz/"
    },
    {
        "id": "1ob4xpi",
        "author": "bridgeb0mb",
        "title": "question about wayward? spoiler alert",
        "content": "this show confused the hell out of me, but i finished all 8 eps. so are we supposed to be led to believe Evelyn set Alex up to kill the first person he killed before they moved to twin pines? like, Evelyn set up the scenario so Alex would feel inclined to move to Twin Pines for a fresh start?\n\n\nthe only reason laurie can have a baby is because she did the leap thing, right? so Evelyn wanted both of the babies parents to do the leap? am i understanding this all correctly?\n\n\n\nin the beginning evelyn gives Alex a granola bar that she made. did the granola bar have whatever drug they use for leap in it? and then when alex gave the bar to riley and he ate it instead, he was crazy and that's why he tried to kill laurie? (or was it just a granola bar ???)\n\n\nare these things we are supposed to assume? admittedly i scrolled on my phone a lot while watching this show.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ob4xpi/question_about_wayward_spoiler_alert/"
    },
    {
        "id": "1ob8mko",
        "author": "Niburu_Exus_4311",
        "title": "Does anyone watching on a phone also have this annoying glitchy top right corner?",
        "content": "More specifically, it looks like a barcode turned sideways, flashing different colors in a very fast-paced tempo. This glitch doesn't occur all the time, but it does occur most of the time.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ob8mko/does_anyone_watching_on_a_phone_also_have_this/"
    },
    {
        "id": "1ob7m6l",
        "author": "melinda_louise",
        "title": "Added an extra household member, but don't have to use it?",
        "content": "I moved to a new apartment so of course eventually Netflix gave me the boot because I'm not in the household. We upgraded our plan, I was invited as an extra member - but when I went to login on my TV it just magically started working again with the old setup? \n\nI thought adding an extra household member was supposed to give me my own separate account with only me as a profile. Has anyone else had this happen before? If we cancel the extra household member will it kick me off again? \n\nNot complaining, I'd rather be able to keep my same profile and all my watch history, I just don't understand what's going on.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ob7m6l/added_an_extra_household_member_but_dont_have_to/"
    },
    {
        "id": "1oayoo6",
        "author": "Upbeat_Nectarine5010",
        "title": "The perfect neighbor documentary",
        "content": "Did anyone watch the actual trial footage of the case? I’m halfway through the testimonies of the people who knew Susan and I feel like this all sounds like idk manipulation or something, I’m sure she showed signs of being racist.. as much as she called the cops I’m sure she complained to the church goers who were “so close to her” I feel like I’m not here to demonize anyone but her past and what happened to her doesn’t warrant for her to hate children and specific races! She needed major therapy from what i heard and was untreated and committed this horrible act. \n\nAny thoughts if you watched? ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oayoo6/the_perfect_neighbor_documentary/"
    },
    {
        "id": "1oaycqp",
        "author": "akrazyho",
        "title": "Help, blind person here I can’t get audio description on the TV, but I can get it on the app",
        "content": "If it matters, I’m on the free plan, the basic one from T-Mobile.\n\nI’m more than willing to admit that I’m just not doing the right thing and this just might be a me issue But I will say I’m pretty technically savvy and I normally don’t have problems turning on audio description in the TV app.\n\nMaybe somebody can test it out for me and see if you can change to audio description for the show the residence on the basic plan on a TV \n\nIt’s strange because for other shows, I have no issues changing it to auto description, but for this one is not listed as an audio option on my TV   Audio description is definitely available through the Netflix app for this show for me, but for whatever reason it’s just not working on the TV \n\n\n\nAlso, what happened to the casting option on Netflix because if I could just cast what’s on my phone to my TV that would work and it’s weird because I have the same Netflix app signed into my phone and TV which I know you can’t use it at the same time on the basic plan, but still if I could just cast it, it would cast the audio description as well",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oaycqp/help_blind_person_here_i_cant_get_audio/"
    },
    {
        "id": "1obac6l",
        "author": "Strange-Leading269",
        "title": "The Worst Ex Ever",
        "content": "im quite late to watching this but in episode 1, the woman at the beginning (angie) explains how she recognized ben foster running out of the house since she had met him a few days prior. but justine says she stopped talking to ben for like a year before the attack. and theres no way angie couldve ran into him at the bar bc he was fired. any thoughts?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1obac6l/the_worst_ex_ever/"
    },
    {
        "id": "1o9ypkn",
        "author": "jonnyson14",
        "title": "Boots is the best show on Netflix right now",
        "content": "If you haven't watched it you absolutely need to. I laughed, I cried, I got angry, it's absolutely brilliant. I stuck it on with no knowledge of what it was, I thought I was just in for a modern take on stripes. Instead I got treated to the most compelling show I've watched in years! I'm begging people to watch it so it gets a season 2! I need it in my veins.",
        "upvotes": 435,
        "comments": 262,
        "media": null,
        "permalink": "/r/netflix/comments/1o9ypkn/boots_is_the_best_show_on_netflix_right_now/"
    },
    {
        "id": "1ob4jzt",
        "author": "waynehastings",
        "title": "The Diplomat season three",
        "content": "I absolutely love The Diplomat. The writing is so good: funny, tight, smart. The acting is top notch. Somehow I missed that season 3 was released. I'm binge watching seasons 1 and 2 for the third time before starting 3. Who's with me? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ob4jzt/the_diplomat_season_three/"
    },
    {
        "id": "1oacifb",
        "author": "EitherSheepherder854",
        "title": "The Diplomat",
        "content": "I am so hooked on this show. I love the cast and I love the story.  Currently I am on season 3 and I do not want it to end . Has anyone watched this yet? \n",
        "upvotes": 60,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1oacifb/the_diplomat/"
    }
]