[
    {
        "id": "1icviop",
        "author": "Eudmovie",
        "title": "Hey r/movies! We are Harrison Xu and Ivan Leung, the director/writer/producers/stars of EXTREMELY UNIQUE DYNAMIC and the idiots behind the keyboard of Winnie-the-Pooh: Blood and Honey. AMA!",
        "content": "",
        "upvotes": 0,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/v3a8r14ndwfe1.png?auto=webp&amp;s=24bb685e8ab2cbf92ac14035888932becf6b3a00"
        },
        "permalink": "/r/movies/comments/1icviop/hey_rmovies_we_are_harrison_xu_and_ivan_leung_the/"
    },
    {
        "id": "1icsd4p",
        "author": "BiscottiPatient824",
        "title": "Movies that are peaceful with almost no tension",
        "content": "Hello\nI'm pretty stressed lately and I'm looking for movies that are, in all aspects, calm and peaceful. It's okay if its a little sad or bittersweet or even funny—but I'm looking for something with almost no tension.\n\nMost movies, even really calm ones like howl's moving castle, have an act with a lot of tension and fighting, i'm looking for a movie without that. The first examples I come up with are where is marnie, which has beautiful scenery but is essentially devoided of big tension acts—and it's still great. Another example is lady bird, which even though had some tension with the mom plot, is pretty easy and not stressful to watch. For a show counterpart i'd say adventure time, midnight ghospel, gumball or hilda, since they are mostly quacky adventures that get resolved easily (I've watched those like a 100times though so thats why im looking now xD)\nIf you have ideas for series/shows too im up to it!\nI hope yall have some good ideas! Have a beautiful day everyone!\n\n\nEdit: Wow so many answers! I didnt expect it im so thankful for all I've received so far but I might not be able to answer to everything 😅. I'll watch them over the next few days. Thanks again!",
        "upvotes": 823,
        "comments": 1243,
        "media": null,
        "permalink": "/r/movies/comments/1icsd4p/movies_that_are_peaceful_with_almost_no_tension/"
    },
    {
        "id": "1ictbnx",
        "author": "SafeBodybuilder7191",
        "title": "The Sundance Film Festival failed to heat up, with few deals even for titles like Jennifer Lopez's \"Kiss of the Spider Woman\" and the acclaimed \"Twinless.\"",
        "content": "",
        "upvotes": 201,
        "comments": 128,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aQMDaz4VAlPLQWfrjAk72cdVN__md3DLxzy_V_Uza-A.jpg?auto=webp&amp;s=35862db8d0b3ab4a7fb90eb51736bd1a27fe537c"
        },
        "permalink": "/r/movies/comments/1ictbnx/the_sundance_film_festival_failed_to_heat_up_with/"
    },
    {
        "id": "1icjxk8",
        "author": "Aqueraventus",
        "title": "What do you think was the most snubbed non-nominee for the Oscar’s ever?",
        "content": "Personally for me it was Hereditary.\n\nToni Collette delivered one of the most Oscar worthy performances I have ever seen, all of the actors were fantastic, the music, the direction, the symbolism, it all worked in perfect harmony to create one of the best movies ever made.\n\nBut also horror movies are traditionally overlooked and snubbed at the academy awards.\n\nWhat would some of your picks be? ",
        "upvotes": 755,
        "comments": 646,
        "media": null,
        "permalink": "/r/movies/comments/1icjxk8/what_do_you_think_was_the_most_snubbed_nonnominee/"
    },
    {
        "id": "1ic5vtg",
        "author": "NoYoureACatLady",
        "title": "In the Jumanji universe, it's entirely possible that if you die in the game, you're simply returned to reality unharmed and escape. We never find out because all characters assume that you die IRL if you die in the game.",
        "content": "In the Jumanji universe, it's entirely possible that if you die in the game, you're simply returned to reality unharmed and escape. We never find out because all characters assume that you die IRL if you die in the game.\n\nIt's funny to think that in the reboot movies, they could possibly have escaped the game in a few seconds by simply dying a few times. Of course the original movie required going through the entire gameplay sequence but it's still possible that dying wouldn't have killed you in real life.",
        "upvotes": 4831,
        "comments": 385,
        "media": null,
        "permalink": "/r/movies/comments/1ic5vtg/in_the_jumanji_universe_its_entirely_possible/"
    },
    {
        "id": "1icdqgg",
        "author": "soalone34",
        "title": "‘No Other Land’ receives Best Documentary Oscar nomination despite no U.S. distribution deal",
        "content": "",
        "upvotes": 1396,
        "comments": 74,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/be7E0Dx5evEzFbtwaOC2_966xrb2hviV_QmnAmf2l_U.jpg?auto=webp&amp;s=08f62270c15a8351ff99b6951e6e879c4ee87019"
        },
        "permalink": "/r/movies/comments/1icdqgg/no_other_land_receives_best_documentary_oscar/"
    },
    {
        "id": "1icmfdi",
        "author": "EggsyBenedict",
        "title": "What makes some actors look \"period\" or \"modern\"?",
        "content": "The other day I read someone saying that Ben Affleck has \"a face that knows about emails\", which I though was hilariously apt. He was excellent in The Last Duel, but I definitely feel his look doesn't lend to roles in period films. \n\nOn the other end of the spectrum, actors like Tobias Menzies and Mark Rylance seem to blend into period settings more than contemporary ones. \n\nThis makes me wonder, what makes some actors look more \"period\" than others? I think super neat dental veneers and plastic surgeries play a role here (for example, Nicole Kidman in The Northman looked distinctly modern), but I don't think that's the full answer. What are your thoughts? ",
        "upvotes": 374,
        "comments": 141,
        "media": null,
        "permalink": "/r/movies/comments/1icmfdi/what_makes_some_actors_look_period_or_modern/"
    },
    {
        "id": "1icvcmd",
        "author": "Inside-Range9647",
        "title": "Finally saw Apocalypse Now last night",
        "content": "The horror.... First time watch. All I can really say, is that I didn't know what I expected, but if there were any kind of expectations, they were blown out of the water. It was more psychedelic than I expected but I was all here for it. I thought it was fantastic and I threw it in my top 4 on letterboxd for now. Should I watch the redux cut at some point? I don't know the general consensus on if its worth it or not.",
        "upvotes": 59,
        "comments": 69,
        "media": null,
        "permalink": "/r/movies/comments/1icvcmd/finally_saw_apocalypse_now_last_night/"
    },
    {
        "id": "1icw2qo",
        "author": "indiewire",
        "title": "'Virtuosity' New 4K Restoration Shows Influence on 'The Matrix'",
        "content": "",
        "upvotes": 50,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/h3AJFuhXeubzqrl9Y-jCX85RRLmyxe92m8BncoQRXzs.jpg?auto=webp&amp;s=ed5e286778db4ff4b1de83d884290ad2433dd9d5"
        },
        "permalink": "/r/movies/comments/1icw2qo/virtuosity_new_4k_restoration_shows_influence_on/"
    },
    {
        "id": "1icuo16",
        "author": "KillerCroc1234567",
        "title": "Body Horror Film ‘Together’ Lands at NEON",
        "content": "",
        "upvotes": 58,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/C5g_weUkVqEWU8RGwoZ6CmmZEDMiw13n1_euUzSCfXc.jpg?auto=webp&amp;s=5ce4c4e9590ffde065ed5c5c275bdb56b20484a1"
        },
        "permalink": "/r/movies/comments/1icuo16/body_horror_film_together_lands_at_neon/"
    },
    {
        "id": "1icvigf",
        "author": "Lionel_Hislop",
        "title": "How did such a bad actor like Steven Seagal made so many popular action movies in the 90s?",
        "content": "Under Siege 1 and 2, Hard to Kill, Exit Wounds, The Glimmer Man, On Deadly Ground (this one works best as a comedy and Michael Caine is highlarious as a bitchy evil businessman, Mr Burns meets Alfie), the other one which was about the Environment and had Marg Helgenberger. \n\nSeagal never changed his expressions, he was always filmed from the waist up when he got too fat and the fight scenes were often over the top in their violence. \n\nSeagal's characters weren't even likable, they always came off as ice cold psychos who just so happened to be on the good side. If you ever watched the Mad TV parodies, they only exaggerated a tiny bit. \n\nThank god for Tommy Lee Jones and Gary Busey in Under Sieger who were so crazy they managed to make Seagal seem subtle by comparison. And Kelly LeBrock had Daffy Duck lips while playing a medical surgeon (laugh!!!). \n\nHis movies were SOOOOOOOOOOO dumb!!!!!",
        "upvotes": 39,
        "comments": 176,
        "media": null,
        "permalink": "/r/movies/comments/1icvigf/how_did_such_a_bad_actor_like_steven_seagal_made/"
    },
    {
        "id": "1icruo0",
        "author": "verissimoallan",
        "title": "France’s Cesar Awards Nominations: ‘The Count of Monte Cristo,’ ‘Beating Hearts,’ ‘Emilia Perez’  Lead the Race",
        "content": "",
        "upvotes": 52,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8MuD2MnKwVKUVhF5cXyGvbF0pv0f0D9mYtb-HoTQpDQ.jpg?auto=webp&amp;s=770b11da8a3c7c27d081802f4abea0319758fdb0"
        },
        "permalink": "/r/movies/comments/1icruo0/frances_cesar_awards_nominations_the_count_of/"
    },
    {
        "id": "1ic88pp",
        "author": "flamehead243",
        "title": "Movies where the main character is NOT a badass?",
        "content": "Inspired by [this thread from yesterday](https://old.reddit.com/r/movies/comments/1ibmd79/movies_where_the_main_character_is_secretly_a/), what are some examples of movies where main character(s) are thrown into situations where they don't have any special skills? Two movies that come to mind are United 93 (2006) and Blue Ruin (2013). IMO, both solid movies for different reasons.",
        "upvotes": 1220,
        "comments": 1409,
        "media": null,
        "permalink": "/r/movies/comments/1ic88pp/movies_where_the_main_character_is_not_a_badass/"
    },
    {
        "id": "1icefbu",
        "author": "BunyipPouch",
        "title": "Ruben Östlund’s Dark-Satire ‘The Entertainment System Is Down’ Begins Filming &amp; Adds to Cast - The set has been built around a real Boeing 747. About a long-haul flight where the entertainment system fails, the film will see passengers forced to face the horror of being bored.",
        "content": "",
        "upvotes": 563,
        "comments": 61,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/C4PoOoiNxoFLCf7a0dIkTT7ecR0apHUyamrD0zhfFBg.jpg?auto=webp&amp;s=7278cc3aff957603798dc19eaae2a5433a3cda7d"
        },
        "permalink": "/r/movies/comments/1icefbu/ruben_östlunds_darksatire_the_entertainment/"
    },
    {
        "id": "1icpp4v",
        "author": "Random_Introvert_42",
        "title": "Streaming is the death of the bonus content",
        "content": "Something I realized fairly recently. It's well known that streaming has the massive downside of making you dependent on a remote server instead of having a physical object to own, meaning you \"buy\" something that can be taken away at any point. But a similarly bad issue in my opinion is that, with the slow death of home releases, we lose the \"bonus features\". Director/cast commentary, deleted scenes, making-ofs. Sure, a lot of people probably don't care about it, but a lot probably also do.\n\nPersonally, for me the production-story is sometimes more interesting than rewatching a movie, to the point that I, at one point, spent an absurd amount on a big [Harry Potter Box Set](https://i.ebayimg.com/images/g/p44AAOSwlqtnZJIR/s-l1600.webp) because it came with literal hours of making-off and similar content. And I'm kinda sad that that era is (soon) over, with something like commentaries just about gone and \"making of\" limited to more or less official snippets you have to dig through youtube for.",
        "upvotes": 76,
        "comments": 36,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/s5pQCwAAlMGjtWll2WrMYHb6BGiu3v--FfCrEUCq7L8.jpg?auto=webp&amp;s=8144936c99fbc6da39b1490ce53c8e92c8cb9105"
        },
        "permalink": "/r/movies/comments/1icpp4v/streaming_is_the_death_of_the_bonus_content/"
    },
    {
        "id": "1ic68x9",
        "author": "MarvelsGrantMan136",
        "title": "SINNERS | Official Trailer 2",
        "content": "",
        "upvotes": 1197,
        "comments": 387,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RJECwi0NogrwS7_SM6wlABiukoi3EkXhstvnob-gLps.jpg?auto=webp&amp;s=f1cf6d51a19d052f1536ba26a634f5a986ffda4e"
        },
        "permalink": "/r/movies/comments/1ic68x9/sinners_official_trailer_2/"
    },
    {
        "id": "1icw10w",
        "author": "JonnyBunning",
        "title": "Riff Raff trailer - crime-comedy with Jennifer Coolidge",
        "content": "",
        "upvotes": 17,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/CK8EviC2ZgLGSts3iB6Yx_SF2mEb1zMfy96QBbpSGks.jpg?auto=webp&amp;s=dd68c2e1ef2fce820b74b10e37b9ba1f7d7cb425"
        },
        "permalink": "/r/movies/comments/1icw10w/riff_raff_trailer_crimecomedy_with_jennifer/"
    },
    {
        "id": "1ichvh9",
        "author": "The_Flash_20",
        "title": "Please Recommend me some Time Travel Movies",
        "content": "I have seen Back to the Future, Primer, Timecrimes, Interstellar, Groundhog Day, Terminator etc.\n\nI really want to see movies from this genre as it is quite unexplored in my opinion. \n\nPlease recommend me some who are lesser known or were not received well during their release.\n\nMovies from Non - English languages are welcome as well.\n\nMuch appreciated.\n\n**Edit:- Thanks Everyone who suggested PROJECT ALAMANAC. This movie has been haunting me for last 8 years. I always remembered a movie about a guy who went to see his father back in time whose building a time machine and comes back to the same day. Was disappointed in that movie when I saw it in 2016. Couldn't remember it's name even after trying hard.** \n\n\n**Interestingly enough I made this post so that someone would recommend me that movie as I knew it was around 2014-16.**\n\n**I have finally found the movie which has been haunting me.**\n\n**Thanks everyone. Sincerely**",
        "upvotes": 197,
        "comments": 1293,
        "media": null,
        "permalink": "/r/movies/comments/1ichvh9/please_recommend_me_some_time_travel_movies/"
    },
    {
        "id": "1ic1dvk",
        "author": "dickbilliamson",
        "title": "33 years before Alien: Earth, 'Alien 3' was set to be the introduction of the xenomorph to our planet. The concept was teased in a trailer and then abandoned.",
        "content": "",
        "upvotes": 1560,
        "comments": 309,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/esK1pIFTb6uyIpLlfncnZ6PPipOZFmsiEeMsXNvfrVk.jpg?auto=webp&amp;s=262edd651f8cc59f28b4ff64ec3de7b075386744"
        },
        "permalink": "/r/movies/comments/1ic1dvk/33_years_before_alien_earth_alien_3_was_set_to_be/"
    },
    {
        "id": "1ic50oa",
        "author": "SanderSo47",
        "title": "Robert Eggers’s Criterion Movie Closet Picks",
        "content": "",
        "upvotes": 904,
        "comments": 141,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TollomFyEYnOUzdTkEsvBVy5f9-RE5tCWmvIxRh1HFg.jpg?auto=webp&amp;s=8319a02f85997f44fa4e0f5ecb4bf0f19526e3e9"
        },
        "permalink": "/r/movies/comments/1ic50oa/robert_eggerss_criterion_movie_closet_picks/"
    },
    {
        "id": "1ic78pb",
        "author": "outremer_empire",
        "title": "Alien: Romulus NEW Version Comparison",
        "content": "",
        "upvotes": 654,
        "comments": 344,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QFNHqd6nUZyqLwLUNry_LPLAX6R4NVjE03KRZilUY5k.jpg?auto=webp&amp;s=71dd6cb5cf471daf450493921dd803dae7d9bbbd"
        },
        "permalink": "/r/movies/comments/1ic78pb/alien_romulus_new_version_comparison/"
    },
    {
        "id": "1ic9w2c",
        "author": "bitbot",
        "title": "Star Trek: Section 31 - re:View",
        "content": "",
        "upvotes": 416,
        "comments": 250,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pt-x2d-YhskQGxM8dyNN4Hqn6UAeNWYNqzCzD16zxCo.jpg?auto=webp&amp;s=3a3b3d0146335371c9af3ccd9497e97825fda57b"
        },
        "permalink": "/r/movies/comments/1ic9w2c/star_trek_section_31_review/"
    },
    {
        "id": "1ic9rbv",
        "author": "Alternative-Cake-833",
        "title": "The Mission: Impossible movies are some of the best action movies of all-time.",
        "content": "A while back, I finally decided to bit the bullet and finally watch some movies that I didn't get around to watching (e.g. Jason Bourne and Jack Ryan). I still haven't gotten around to the James Bond and John Wick films though.\n\nBut oh man, the Mission: Impossible movies might be some of the best action movies of all-time. The first one may be the slow one out of the whole series but even 2 isn't a bad movie in general despite being the worst of the Mission: Impossible movies. Fallout even blows most of the Marvel movies out of the water besides for Captain America: The Winter Solider and Spider-Man: No Way Home. It's surprising to me that Tom Cruise does his own stunts for all of the Mission: Impossible movies, if someone like Brad Pitt or Bruce Willis were Ethan Hunt, they wouldn't do most of their own stunts. And the most divisive movie of the series, Dead Reckoning is still actually a really good movie besides for IIsa's death. Just really good movies around.\n\nI really hope that Mission: Impossible - The Final Reckoning is actually the best Mission: Impossible just because of how good it looks.",
        "upvotes": 426,
        "comments": 177,
        "media": null,
        "permalink": "/r/movies/comments/1ic9rbv/the_mission_impossible_movies_are_some_of_the/"
    },
    {
        "id": "1icxovi",
        "author": "MichaelFuery",
        "title": "Just finished watching A Complete Unknown here are my thoughts",
        "content": "For starters I've never watched a timothée chalamet film \nBut I'm very impressed how he managed to get bob Dylan's voice and the way he acts perfectly down to the way he lights his cigarettes \n\nLike the job of an actor is to make you believe in the character that they are playing watching this film I believed that timothée chalamet was bob Dylan he managed to convey the character so well that I was invested into watching the film despite the films duration starting to drag I wanted to see the end what the conclusion was as unlike a lot of biopics the ending can't be his death as as of today Bob Dylan is still alive and kicking \n\nWhat I loved about the film \n\nThe fact that everyone including the two main actors timothée chalamet &amp; Boyd Holbrook actually sang their characters songs and were amazing at it everyone who sang knocked it out of the park\nEspecially timothée chalamet he sings bob Dylans songs with the perfect tone it's like he's bob Dylan from the clothing the attitude, the voice and little details like the way someone in the 60s would light a cigarette to the way they would rides a motorcycle 🏍️ \n\nBoyd Holbrook as Johnny cash was really well done and I loved the relationship between Johnny cash and bob Dylan so much that I would love a Johnny cash biopic\n\nNow I know Joaquin Phoenix starred in a biopic the early 2000s right after Johnny cash passed away with his permission and guidance but it be really nice to get a updated biopic in 2025 or sometime after staring him like to me he really did Johnny cash justice he even has the accent spot on\n\nThanks for reading my review \n\nMr Michael Fuery ",
        "upvotes": 6,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1icxovi/just_finished_watching_a_complete_unknown_here/"
    },
    {
        "id": "1ichfvu",
        "author": "ThingsAreAfoot",
        "title": "Whoopi Goldberg in Ghost",
        "content": "Famous romantic movie of course, the music, the pottery, etc. That early scene with Unchained Melody is one of the most romantic sequences ever filmed. \n\nAnd it’s also not novel to highlight Whoopi, who won the Oscar here. \n\nBut upon rewatch, it really is an impressive performance.  Whoopi is absolutely electric in this movie. She bursts in like lightning and so smoothly carries the tone from comedy to drama and back again and she pulls that off effortlessly even in individual scenes. She doesn’t even show up in the movie at all till 40 minutes in. \n\nIt’s a brilliant performance and again she won the Oscar so it’s not underrated or anything, but I think it’s often viewed as a sort of silly performance or even a Magical Negro (ess) one, but it isn’t anything like that. She’s just so warm and just so alive, it’s wonderful to rewatch after so long. ",
        "upvotes": 104,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1ichfvu/whoopi_goldberg_in_ghost/"
    },
    {
        "id": "1icvit7",
        "author": "Joshual1177",
        "title": "Shutter Island",
        "content": "I just finished watching this movie for the first time. I’ve always appreciated and enjoyed Leo’s work. This was by far one of my favorite films that he’s been in. Prior to this, it was Inception. I can’t really compare the two, but they both leave you guessing until the end. \n\nThis movie was superb. During the cliff scene, I had parts of it figured out, but didn’t really fully believe it until the lighthouse scene. But I never could have predicted everything else that was revealed. \n\nThe ending after that is expected but sad. Who wouldn’t turn out like that if they had experienced what he did. ",
        "upvotes": 7,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1icvit7/shutter_island/"
    },
    {
        "id": "1icdggl",
        "author": "Cultural-Glass6729",
        "title": "What’s the most otherworldly movie you’ve seen?",
        "content": "I’m not just asking about what movies were amazing, I’m asking what movies made you question if the director, actors, and/or crew were human? What movies transcended the media and became something else? What movie made you question everything you thought you knew by the end of it? After watching the movie you couldn’t move for minutes, just thinking about what you just consumed.",
        "upvotes": 108,
        "comments": 332,
        "media": null,
        "permalink": "/r/movies/comments/1icdggl/whats_the_most_otherworldly_movie_youve_seen/"
    },
    {
        "id": "1icn7m4",
        "author": "Wulfey7",
        "title": "What movie moment/character still gives you chills, even after re-watching the film?",
        "content": "I'll go first...\n\nI’m currently recovering from a respiratory infection because asthma is dumb. It’s been rough and I’ve been feeling pretty down. To cheer myself up, I decided to have a Disney movie marathon while coughing my lungs up.\n\nDisney’s animated Tarzan was among the movies I re-watched. For me, the soundtrack remains a masterpiece. I feel like it was perfectly interwoven with the narrative and just amazing in general.\n\nThe opening scene still hits me in the feels, especially with the accompanying music.\n\nSabor herself still gives off a deadly ambiance also. The terrifying sounds she makes and her overall vibe feel incredibly intense, especially with it being a Disney movie,. The way her claws are animated and the fluidity of her movements just feel super deadly, even after all these years. Combined with the background music, her scenes still give me chills, even with the occasional touches of humor thrown into them.\n\nThat's my movie moment/character that still gives me chills, even after re-watching the movie. What's yours?",
        "upvotes": 24,
        "comments": 94,
        "media": null,
        "permalink": "/r/movies/comments/1icn7m4/what_movie_momentcharacter_still_gives_you_chills/"
    },
    {
        "id": "1ic04o2",
        "author": "Hermit0fAlbion",
        "title": "Save The Prince Charles Cinema",
        "content": "",
        "upvotes": 592,
        "comments": 43,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cpv5db4pyinwALoPV859CTfcRjAOXylfzS6HgCK__6U.jpg?auto=webp&amp;s=9ba1b75ce897995d0259fccecbd4bef2dab63563"
        },
        "permalink": "/r/movies/comments/1ic04o2/save_the_prince_charles_cinema/"
    },
    {
        "id": "1ibw46c",
        "author": "Tehgumchum",
        "title": "Pointless movie facts!",
        "content": "Anybody up for some pointless movie facts? I will start\n\n- Marty McFly never makes it back to his original timeline in any of the Back to the Future movies and finishes his life in an alternate timeline\n\n- Sigourney Weaver has played basketball in outer space in 2 different movies involving aliens and neither of them were Spacejam or its sequel\n\n- If you remove all of Millie Bobby Browns scenes from Kong vs Godzilla, it will have no impact on the movie/plot at all\n\nEdit: have another one to add\n\n- When Captain America travels to the past by himself to live his life, he completely ignores the fact Bucky is being tortured somewhere, or he cold prevent JFKs assassination\n\nEdit 2: One more to add\n\n- Mary Steenburgen has a tendency to seduce time travellers!",
        "upvotes": 1326,
        "comments": 1220,
        "media": null,
        "permalink": "/r/movies/comments/1ibw46c/pointless_movie_facts/"
    },
    {
        "id": "1ic3sxy",
        "author": "BunyipPouch",
        "title": "First Poster for Drama 'Long Day's Journey Into Night' - Starring Jessica Lange, Ed Harris, and Ben Foster - Over the course of a day, a married couple and their two sons grapple with the mother's morphine addiction and confront each other over the past in a series of tense and volatile exchanges.",
        "content": "",
        "upvotes": 287,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/u8czpez63rfe1.jpeg?auto=webp&amp;s=55a71f479a20f1a1adac601734743fa589185ee2"
        },
        "permalink": "/r/movies/comments/1ic3sxy/first_poster_for_drama_long_days_journey_into/"
    }
]