[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 36,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pk07y1",
        "author": "intelerks",
        "title": "'Hunger Games' prequel brings back Jennifer Lawrence and Josh Hutcherson after a decade",
        "content": "",
        "upvotes": 13,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1pk07y1/hunger_games_prequel_brings_back_jennifer/"
    },
    {
        "id": "1pjxa97",
        "author": "nullunwn",
        "title": "How much are you really paying for streaming?",
        "content": "I just looked at my bills for the year and realized I’m spending way too much on streaming. Netflix, Disney+, Max, Viaplay… and it feels like I still don’t have everything I want because every show is on a different service.\n\nIt’s getting out of hand. I didn’t notice the small monthly fees, but when I added it all up for the year, it was a wake-up call.\n\nHow much did you spend on streaming this year? How many services do you have? Do you switch between them, share with family, or just deal with the chaos?\n\nI’m curious how others are managing, because I need to rethink how I do it next year.",
        "upvotes": 13,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pjxa97/how_much_are_you_really_paying_for_streaming/"
    },
    {
        "id": "1pj49p1",
        "author": "AnotherDarnDay",
        "title": "What did I Just watch?",
        "content": "The sean combs doc. Now to be clear I've never been a fan of Diddy. My first memory of seeing him on TV was when he did the video with faith Evans as a tribute to Biggie. \n\nBut omg, that doc just sheds a lot of things. Like he \"allegedly\" had a part in Tupac and biggies deaths. And he wanted to throw biggie the biggest funeral, made it all about him and made biggies estate pay for the entire thing? How low can a person go. \n\nNot to mention, how stupid were those jurors? They dropped the ball completely. \n\nIts nice to know he likes his \"fans\" so much he needs to shower with peroxide after greeting them. \n\nHe's a vile person.\n\nWhat's your opinion of the doc or the person its about? \n\nOn the upside sting got richy rich from Diddy over that song. Sting earns two thousand dollars a day on it from what I understand. \n\n",
        "upvotes": 641,
        "comments": 170,
        "media": null,
        "permalink": "/r/netflix/comments/1pj49p1/what_did_i_just_watch/"
    },
    {
        "id": "1pipz34",
        "author": "Beneficial-Anteater2",
        "title": "Netflix needs to add an “already watched” button",
        "content": "Hey guys, now that everyone has to get their own account and every tab is recommendations scroll, can we please add a button that lets us take it off the lists. I think its a good idea because We are paying for good service and seeing all these lists with stuff that I already watched makes me wanna use other streaming platforms. At least add a “watch again tab. ",
        "upvotes": 3025,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1pipz34/netflix_needs_to_add_an_already_watched_button/"
    },
    {
        "id": "1pk2mjf",
        "author": "vishesh_07_028",
        "title": "Quality Over Quantity was a LIE.",
        "content": "We paid more, lost password sharing, and the catalog shrank. They promised quality, but I'm still scrolling through mediocrity and re-watching Ozark. Netflix has replaced content with controversy. Where is the value for $20/month?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pk2mjf/quality_over_quantity_was_a_lie/"
    },
    {
        "id": "1pjxu88",
        "author": "VanVeleca",
        "title": "So...is the Death Note Netflix Series still happening?",
        "content": "So all the way back in 2022 the guys who made Stranger Things announced that Netflix was working on a new project for Death Note (completely unrelated to the 2017 movie, to be clear)\n\nStranger Things recently finished, right? The final season is out...so is development on this secretive new DN series still happening or did it get quietly canned? They announced like 3 years ago and from the articles I've read it seems they were still just busy with scripting, maybe filming will finally happen next year???\n\nThen again they also say that they're working on two other projects and maybe even a spin-off to Stranger Things so I dunno.......\n\nHere are the articles btw just in case someone is reading this and thinks I'm talking out of my ass:\n\n[https://deadline.com/2022/07/stranger-things-duffer-brothers-netflix-upside-down-pictures-deal-spinoff-series-stephen-daldry-stage-play-manga-death-note-the-talisman-1235058665/](https://deadline.com/2022/07/stranger-things-duffer-brothers-netflix-upside-down-pictures-deal-spinoff-series-stephen-daldry-stage-play-manga-death-note-the-talisman-1235058665/)\n\n[https://deadline.com/2022/10/death-note-halia-abdel-meguid-series-adaptation-manga-netflix-duffer-bros-1235151144/](https://deadline.com/2022/10/death-note-halia-abdel-meguid-series-adaptation-manga-netflix-duffer-bros-1235151144/)\n\nMaybe I'm huffing huge amount of copium but I'm still on the side of \"It's still happening just slowly\", and I have several reasons for my hope:\n\n1. The Death Note anime is on Netflix now and available for world wide users, not just japan, the country specifics dubs aren't available everywhere but it's unusual for Netflix to release one show in so many regions anyhow (\\*that is not a Netflix original)\n2. A metric FUCK TON of merch released this year and there's still more announced to come out in 2026, maybe it's just because the anime is turning 20 years old but maybe also because behind the scenes they are working on some kind of new project, wheter it's this supposed new Netflix series or something completely different\n3. Killer Within and the social media accounts. Killer Within still has decent success and is still getting updates even after the initial hype died down around it, and many Death Note related official social media accounts have been active or have been revived ever since 2024, posting almost every day or every week.\n\nFinally, Death Note is still really damn popular even among new gen anime fans, it just kinda makes sense for it to be revived with a BIG project someday right?...I mean, they did try that in 2017 I guess. :P\n\nIf anyone has any sort of new information, I would appreciate hearing some kind of new info that I haven't stumbled on. Because after writing all this out, I feel like I'm having a Pepe Silvia moment.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pjxu88/sois_the_death_note_netflix_series_still_happening/"
    },
    {
        "id": "1pk10q5",
        "author": "long_khan",
        "title": "Muvi users — does it actually hold up for Netflix-like streaming?",
        "content": "I’ve been testing [Muvi](http://www.muvi.com/) for a video project and wanted to hear from people who’ve actually used it. I know platforms like Netflix use OTT-style setups, and Muvi claims to offer something similar on a smaller scale, but I’m not sure how true that feels in real use.\n\nIt seems convenient since hosting, monetization, and the player are already handled, but I’m still unsure about long-term performance.\n\nIf you’ve used it:\n\nIs it reliable over time?\n\nHow does it handle regular live streaming?\n\nAny limitations or issues I should know about?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pk10q5/muvi_users_does_it_actually_hold_up_for/"
    },
    {
        "id": "1pk0xpv",
        "author": "VioletBanks0591",
        "title": "Netflix and AppleTV",
        "content": "Wanted to watch Netflix content on AppleTV. The content only had teasers. Netflix agent was not helpful. Since Netflix is also on my iPad I signed in there and saw download icon for the content I wanted to watch. Does anyone know why I have to watch the content on my iPad instead of my AppleTV? Thanks for your help.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pk0xpv/netflix_and_appletv/"
    },
    {
        "id": "1pjjygl",
        "author": "jvincentsong",
        "title": "Simon Cowell: The Next Act",
        "content": "I watched Simon Cowell trying to compete with kpop boy bands. It was actually guide on how to not make a modern boyband to rival kpop. First, it was all about Simon Cowell. It was selfish as he sold himself over the actual members. Hybe’s hitmaker Bang wasn’t the focus of Dream Academy. Second, Simon doesn’t understand that kpop is a rigorous program. You can’t just wing it. For example, the boys had a staged meeting with the label CEO and they supposedly were nervous. It talked about how they were nervous and couldn’t banter because they didn’t know each other so well. In Dream Academy, most of the girls spent 2 years with each other and had media training. There is a reason why Katseye has so much chemistry. Simon didn’t do any research on why Hybe is successful. He is a dinosaur that is still stuck to live auditions. Two of Katseye’s members Lara and Manon were scouted online.\nThe last thing is December 10 doesn’t even have a single launching today. Katseye had a single that launched with Dream Academy. There is lack of strategy from a producer of supposed hit groups. Yet, I do see potential in one or two members. I can see that he is trying to replicate Harry styles again. It is such a pity that the boys are being used for his ego. Hope they get to release a single at least.",
        "upvotes": 14,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1pjjygl/simon_cowell_the_next_act/"
    },
    {
        "id": "1pjt9bt",
        "author": "Fun_Smile3175",
        "title": "What's your favorite Netflix movie?",
        "content": "I spend roughly three to four hours watching Netflix every day, but lately I can’t seem to find any content that’s particularly interesting—most of it feels boring to me. That’s why I want to see what everyone’s favorite movies are, to make my spare time more enjoyable!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pjt9bt/whats_your_favorite_netflix_movie/"
    },
    {
        "id": "1pjwfxc",
        "author": "404_cactus",
        "title": "Morally grey ML and overly righteous FL are the most annoying trope",
        "content": "I was watching an old Japanese series now in Netflix \"The black swindler\" plot is cool and all. About ML who is \"the black swindler\" a scammer guy who ONLY scam other scammer. \n\nThe FL is a character trying to be a prosecutor. So she got this overly righteous character. \n\nThese two crossed paths because the FL's uncle got scammed and wanted to off himself by jumping on a train track, the ML saved him and the ML offered his help. The FL was skeptical (which is acceptable bc he's a stranger) and she begged the uncle just let the police handle it rather than accepting a help from a sketchy guy. \n\nThe police, being on the wrong side of justice (typical) basically told them there's nothing they could do to catch the scammers. In fact, the police was basically more busy spending their resources trying to catch the ML rather than other scammers. \n\nThe ML wanted to include the uncle in his scam to scam back the ppl who scammed the uncle. Which the FL was against of her uncle being accessory to a crime and she doesn't believe in \"an eye for an eye\". Long story short, the ML successfully got the uncle money back and basically berates the uncle for trying to off himself when he have a family. Happy ending? But you know what the FL did? She basically told the ML off for getting the money back while yelling \"I won't thank you bc this is still wrong\" yada yada yada gurl even slapped the ML. \n\nFr this girl is pissing me off, I get that she wanna blindly believe the law exists for a reason, but what I cannot accept is all these bs ideal she is talking about when she doesn't contribute to solve the main scam issue. In fact she tried to sabotage the ML plan too many times. And after he got the money back still you wanna complain? Girl, be fr, Turn the money back to the police then. Why you didn't complain to uncle for accepting the money and just look down on the one guy who basically saved your family?\n\nDon't speak about ideals when you don't do anything. It's so annoying in these types of dramas, whoever wrote the character just give one character all the common sense and one character just have too much ideals but no actions. It pissed me off bc they give the ML all the cool traits while the FL is so one dimensional, arrogant and have zero brain cell. \n\nAlso the ML end up being the FL landlord and she still act like she got a stick up her ass, gurl you're too broke to be so arrogant to a guy letting you rent his place for cheap. Mind you the ML just mind his own business and doesn't act like a typical jerk or even stuck up. Dude is still letting her stay despite her insulting him too many times.\n\nIt's only the first episode and I just boiling in hatred for the FL. Thank you for listening to my rant haha",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pjwfxc/morally_grey_ml_and_overly_righteous_fl_are_the/"
    },
    {
        "id": "1pjqo67",
        "author": "Broqpace",
        "title": "Netflix just skipped an episode",
        "content": "I know this sub doesn’t allow images, but I was watching Lucifer season 4 and while hitting play next it skipped from episode 4.2 - episode 4.4 and I didn’t even notice until it was over. I had to check IMDb to see that I missed an episode. Has this happened to anyone else? Appalling bug if true.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pjqo67/netflix_just_skipped_an_episode/"
    },
    {
        "id": "1pjmtim",
        "author": "OpeningSorry1550",
        "title": "Anyone having trouble",
        "content": "Netflix wont load for me and all my connections are good. Everything else works fine but Netflix says they don’t have any issues. I open the app and its just none stop loading wheel. Anyone else ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pjmtim/anyone_having_trouble/"
    },
    {
        "id": "1pjoz37",
        "author": "Sapphire2345",
        "title": "Rant: I'm watching The Gardener and the two detectives really piss me off",
        "content": "First off, Carrera makes Torres (an old married man) feel guilty for not wanting to CHEAT ON HIS WIFE with her! Eventually he gives in and anytime they popped up on my screen it made me feel so weird. Also I thought it was strange how for whatever reason, Carrera always seemed to have an answer for everything. It just seemed unrealistic like that they connected dots that weren't even there in the first place. I wish they took more time to establish how they could have made a connection between the murders and Elmer. It was just like \"oh 10 people went missing but all of them are definitely dead and i don't know why but it definitely has something to do with this strange boy and his mother\". Like the swimmer that got murdered in the first episode...after talking to the fake witnesses that said they saw only him and he definitely drowned in the OCEAN, how did Carrera refuse to believe any single person and just conclude that he didn't drown???!!! Like obviously we know he didn't actually drown as the viewers but it didn't make sense that she immediately thought \"hmm three people are giving the same account of this man drowning but nope he was murdered\". I think I'm being over dramatic but I really needed to rant about this part of the series.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pjoz37/rant_im_watching_the_gardener_and_the_two/"
    },
    {
        "id": "1pjgy69",
        "author": "FreeAd2458",
        "title": "Blood and gold was so good.",
        "content": "Love both sisu films and this felt like a sisu side quest.you could tell the people behind the camera had some talent. Finally a half decent film on netflix!!",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pjgy69/blood_and_gold_was_so_good/"
    },
    {
        "id": "1pj5kgf",
        "author": "Sudden_Pop_2279",
        "title": "Today is the 5 year anniversary of Alice in Borderland",
        "content": "5 years ago, Alice in Borderland season 1 dropped. This year, the series finally reached its conclusion. I only just got into the series during this summer, after Squid Game had ended and I started this before season 3 came out to prepare for it but it quickly surpassed SQ and became one of my favorite live-action tv shows ever. Many hated season 3 but (maybe because of how SQ season 3 left me feeling) I found the ending pretty satisfying. I'm so grateful for this incredible series and would heavily recommend checking it out.",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pj5kgf/today_is_the_5_year_anniversary_of_alice_in/"
    },
    {
        "id": "1pjkswz",
        "author": "Imaginary_Salary198",
        "title": "Why does Dexter pop on and off",
        "content": "Can someone explain to me why in the world is Dexter popping on and off of Netflix? I literally watched Dexter with my friend at lunch yesterday and then today it’s nowhere to be found. (On Netflix)\n\nThis has happend once before and I thought it was just an error but this is the second time and it’s just really weird???",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pjkswz/why_does_dexter_pop_on_and_off/"
    },
    {
        "id": "1pjf6iv",
        "author": "PresentationLimp7683",
        "title": "How do I find upcoming shows/movies on the Netflix app?",
        "content": "There used to be a page on the Netflix app, where you can scroll through to see upcoming shows and movies. You could watch the trailer of the movie/show, and click on “remind me”, when it releases. I can’t seem to find it anymore on the app. Now there’s only Home, clips and the profile page. How do you find the upcoming shows/movies and the new releases? ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pjf6iv/how_do_i_find_upcoming_showsmovies_on_the_netflix/"
    },
    {
        "id": "1pjiy6a",
        "author": "CurtD34",
        "title": "What is the Best Movie on Streaming Services Right Now? - Looking for a ...",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pjiy6a/what_is_the_best_movie_on_streaming_services/"
    },
    {
        "id": "1pjlah7",
        "author": "GreenExoticBiotopes",
        "title": "Netflix 4K?",
        "content": "Is a Netflix Premium subscription worth it?\nI just bought a 75-inch 4K TV. It's not OLED, but considering I'm coming from a 50-inch FHD TV that's about 10 years old, I expect to notice a significant difference. A soundbar with a subwoofer is arriving in a few weeks to improve the sound quality.\nMy sofa is about 3 meters from the TV, so the question is... is a premium subscription worth it to enjoy the available 4K titles? I currently have basic Netflix and Amazon Prime, and I've considered upgrading to the premium plan, but I'm not sure. Which platform would you recommend for 4K series and movies?",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1pjlah7/netflix_4k/"
    },
    {
        "id": "1pjkuxs",
        "author": "Pencer-",
        "title": "Update household",
        "content": "Great feature with the update household thing that pops up whenever i’m having a bad day. Great great stuff guys, in actuality i’m going to be ending my subscription and doing everything physically, mentally and emotionally possible to see your down fall. \n\nYou’d think these companies would figure out people love accessibility, and want their subscriptions to be the utmost worth it. But no, let’s make our app considerably more expensive, and somehow make features that make that more expensive subscription not even worth it.\n\nTo end on a positive note i hate you.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pjkuxs/update_household/"
    },
    {
        "id": "1pj2gz3",
        "author": "claytonium13",
        "title": "How to reset watched seasons?",
        "content": "My toddlers love Trash Truck. We’ve watched both seasons but when when I got back and play an episode it does not auto play the next one. Instead it will show trailers for Elmo and such. How do I make it play the next episode on a series we’ve already watched? On Apple TV if that helps ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pj2gz3/how_to_reset_watched_seasons/"
    },
    {
        "id": "1pjdx2q",
        "author": "Wise-Cover9603",
        "title": "Shallow depth of field is not always good!",
        "content": "Has anyone noticed recently that shows (Netflix more than others) are filming in this really odd shallow depth of field with diffused edges way? It’s annoying af. \n\nLike filming everything in the dark wasn’t bad enough, now they’re making me need to put on glasses! \n\nI just watched Ripple - a good example. ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pjdx2q/shallow_depth_of_field_is_not_always_good/"
    },
    {
        "id": "1pi3w47",
        "author": "Routine-Ad-1546",
        "title": "Sean Combs new documentary",
        "content": "One of the greatest things the documentary proved was that the jurors were dumb as fuck. No common sense whatsoever.\n\nI just know they got paid to act dense bc if they didn’t take a payoff I’d be very surprised…. It was shocking the jurors even wanted to save face with some ridiculous excuses to literally let the devil loose. The diddler belongs UNDER the jail, k.",
        "upvotes": 454,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1pi3w47/sean_combs_new_documentary/"
    },
    {
        "id": "1pjanmp",
        "author": "Blue-Sea2255",
        "title": "Late to he party: Sean Combs: The Reckoning",
        "content": "I didn’t like the way they wrapped it up, but it’s a good documentary, a clear expose. It should have had a few more episodes to feel like a perfect nail to the coffin.\n\nI think everyone knows who killed both of them, but no one says it loud enough, probably because of a lack of evidence, or the fear of what will happen if it’s a hit and miss, when the feeak is influential and financially sound.\n\nIt’s really a shame it's only 50 months, and I suspect, based on the current events, that a pardon might be waiting for him since he seems to qualify for the current pardon scheme. I’m not sure about the legality of that.\n\nIf he gets out, I wonder what safety measures will be in place for all those people.\n\n50cent smile 😂 professional hater.",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1pjanmp/late_to_he_party_sean_combs_the_reckoning/"
    },
    {
        "id": "1pj9why",
        "author": "LouisTully9000",
        "title": "Welcome to Netflix House: Please Keep Your Arms Inside the Franchise",
        "content": "Enter the immersive art experience, the modern American pilgrimage, which is equal parts spectacle, nostalgia, and Instagram backdrop. Disney and Universal, those amusement-park aristocrats, were the original architects of the phenomenon, training us from childhood to walk into a warehouse full of plywood and fog machines and call it “magic.” But now, the genre has a new mogul, and its name is Netflix.\n\nYes, Netflix, the streaming giant with the financial reserves of a small nation-state, has debuted its own immersive megaplex, Netflix House. And one of these can be found, improbably, in the once-illustrious Galleria Mall in Dallas, where Saks Fifth Avenue used to stand and where I once bought cologne that promised “notes of sandalwood” but mostly smelled like commitment issues.\n\nNetflix House is what happens when a corporation throws several vaults’ worth of capital at a single question, What if you could walk into your favorite shows, preferably without having to act or bathe like someone from the actual 1980s?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pj9why/welcome_to_netflix_house_please_keep_your_arms/"
    },
    {
        "id": "1piv0yw",
        "author": "East_Loss_3332",
        "title": "Love and Death",
        "content": "Did anyone have a favorite character? My fave was the lawyer every time he cursed out the judge had me dying laughing. 😂\n The acting was great and the accents chef kiss* The most accurate Texas accent I've ever seen on TV",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1piv0yw/love_and_death/"
    },
    {
        "id": "1pi9fsh",
        "author": "NoMoreTicks",
        "title": "First We Waited for Seasons, Now We Wait for Volumes",
        "content": "Remember the good old days? We waited a year—maybe two—for a new **season** of our favorite show. It was painful, sure, but the eventual drop was a single, glorious binge-fest. We adapted. We endured the long waits for the return of hits like the final run of *Stranger Things*.\n\nBut now, the streaming overlords have added a new layer of torture: **Volumes**.\n\nIt’s not enough that we waited for what we were promised as \"Season 5\" of *Stranger Things*, only to get Volume 1—a cruel, tantalizing fraction of the story. You get four episodes of vital plot, a massive cliffhanger, and then... nothing. Back to the waiting game for Volume 2, which is essentially just the back half of the same season. The same happened with the highly-anticipated return of *The Family Man*, only for fans to have to wait again between parts.\n\n  \nWe signed up for the convenience of binge-watching, the freedom to control our viewing experience. Now, we are being forced back into an anticipated, staggered release schedule, only without the benefit of the traditional weekly TV model that kept the community discourse alive for months. Instead, we get an initial flash of binge-mania followed by a frustrating, momentum-killing pause.\n\n",
        "upvotes": 123,
        "comments": 72,
        "media": null,
        "permalink": "/r/netflix/comments/1pi9fsh/first_we_waited_for_seasons_now_we_wait_for/"
    }
]