[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 664,
        "comments": 5000,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nm11v6",
        "author": "Capital_Gate6718",
        "title": "Netflix may try to acquire Warner Bros.",
        "content": "",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1nm11v6/netflix_may_try_to_acquire_warner_bros/"
    },
    {
        "id": "1nlz8tn",
        "author": "LyNx_Op_11",
        "title": "Today I learned Linux is outdated.",
        "content": "I recently bought the Premium Netflix subscription, and wanted to stream shows/movies in 4K from my browser. (Yes, I was just trying to use the thing which I paid for).\n\nBut apparently, since I'm using Linux, I'm unable do so.\n\nAll the content was tagged as HD and the video stats showed that I was streaming 720p content.\n\nSo, I reached out to customer support regarding streaming 4k content using the Netflix Web Application and their advice was to install Windows 11, since \"Linux is an outdated OS\" (as quoted by their customer support chat rep).\n\nI do admit my \"***lack of research\"*** for not reading the browser support for linux which is nested deep down inside 2 links in the Pricing page, but I told them to cancel my subscription and got a no questions asked refund immideately.\n\nIt is really frustrating that this is still an issue.",
        "upvotes": 9,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1nlz8tn/today_i_learned_linux_is_outdated/"
    },
    {
        "id": "1nlkwl5",
        "author": "AnotherDarnDay",
        "title": "The Wrong Paris",
        "content": "Now, don't get me wrong I love box office hits as much as anyone but sometimes I need a little crappy made for TV movie to watch when I'm having a bad day. \n\nCheesy, predictable, over the top, horribly acted hallmark type movies. You can pop them like m&amp;ms.\n\nSo the wrong Paris definitely did it's job, it was all of the above and entertaining and some parts had me dealing with a bout of secondhand embarrassment. (Hello mechanical bull, I'm looking at you and one very icky rider)\n\nI also love movies that poke fun at those reality dating shows like the bachelor, so that was a nice topper. Over all I thought it was pretty good for one of those crappy made for Netflix type movies. I like christmas-y ones so this was a nice change. \n\nMy personal favorite is still love hard though and a Christmas prince. \n\n\nThoughts, did you enjoy? \nI don't want to say anything that might spoil it but it's so predictable that I don't think anything could tell you what you'd already figure out. \n",
        "upvotes": 55,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1nlkwl5/the_wrong_paris/"
    },
    {
        "id": "1nljpn6",
        "author": "something-um-bananas",
        "title": "Haunted Hotel on Netflix is seriously good! I just finished binge watching it",
        "content": "It’s really humorous and more or less light hearted (more, actually). The characters have their own quirks that they carry in every episode but it never feels overdone. I just really hope they don’t cancel this show as there’s huge scope for character development with more seasons. Overall it was very entertaining. \n\nReally good first season and I’m hoping there’s more. ",
        "upvotes": 58,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1nljpn6/haunted_hotel_on_netflix_is_seriously_good_i_just/"
    },
    {
        "id": "1nl5mw2",
        "author": "HotComplaint1203",
        "title": "Just finished binging Black Rabbit and don't see anybody on here talking about it yet. I'm surprised.",
        "content": "Jason Bateman and Jude Law in a dark crime drama with gangster loan sharks, shady business dealings, extremely flawed to downright despicable characters, and an interesting look at familial relationships? I was signed up for it the instant I saw the trailer. How is this show not the talk of the town on the sub right now? Great acting, overall great story. It was a bit like The Bear meets Uncut Gems to me, and I thought it was absolutely great.\n\nIf you're into the genre, please check it out, because these are the exact type of shows I want Netflix to make more of!",
        "upvotes": 317,
        "comments": 288,
        "media": null,
        "permalink": "/r/netflix/comments/1nl5mw2/just_finished_binging_black_rabbit_and_dont_see/"
    },
    {
        "id": "1nlzq1d",
        "author": "GRB787",
        "title": "Black Rabbit",
        "content": "Jason Bateman doesn’t miss!!!!\n10/10\n\nHonestly, I didn’t expect the series to be this good. I think I am on episode three and can’t wait to see how this finishes.",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nlzq1d/black_rabbit/"
    },
    {
        "id": "1nlhntr",
        "author": "Shot_psychology_5343",
        "title": "A little late but adolescence really messed me up.",
        "content": "It was great but like another redditor said, I’ve never wished I could unwatch something. Not like “oh haha I wish I could watch this again for the first time” no. I wish I had never watched it.\n\nI’m a 17 year old boy. I feel like an awful person saying this, but I relate to Jamie a lot. I unfortunately saw a lot of myself in Jamie. His outbursts, his overall personality and demeanor, the way he seemed to try to use people and shift the narrative in his favor, etc. I used to be a very aggressive and unpredictable person. I was angry, and even violent. When I would get into a rage, I wanted to hurt people. I’ve done a lot of work on myself, trying my hardest to be better. But watching this brought all of these feelings I thought I had overcome back. Feelings of self doubt. Am I a good person? Could that have been me? I was very manipulative, and I still have tendencies to use people to get what I want, even if not out of malice. It’s made me scared of myself. I always thought “I could never actually hurt someone. Kill someone. I have a conscience, I’m not that bad of a person. I’m not that angry.” But now I don’t know. I still have outbursts from time to time, and that makes me scared of what if one day I go too far? Am I capable of hurting someone in a rage? I take medicines, I see a therapist. I do everything I’m supposed to? \n\nBut should I even be thinking this? Is it concerning that these questions even enter my head? That I have to genuinely think about these things? I would like to say I am a kind, decent person, who has a good moral compass, but what if I’m just kidding myself? What if I’m just pretending? \n\nWhat do you think of my conundrum?\n\n(Ps, sorry if this is the wrong subreddit to discuss this, but I figured it was adequate as this has to do with a Netflix series.)",
        "upvotes": 40,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1nlhntr/a_little_late_but_adolescence_really_messed_me_up/"
    },
    {
        "id": "1nlz7hg",
        "author": "fbutterfield96",
        "title": "Junichi Okada’s Epic Netflix Samurai Survival Drama Promises Blood, Honor and Hype",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nlz7hg/junichi_okadas_epic_netflix_samurai_survival/"
    },
    {
        "id": "1nm0l6a",
        "author": "peoplemagazine",
        "title": "Love Is Blind’s Marissa Speaks Out Against Stephen’s Lawsuit Alleging Unpaid Wages and 'Inhumane Working Conditions' on the Show",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nm0l6a/love_is_blinds_marissa_speaks_out_against/"
    },
    {
        "id": "1nlff9a",
        "author": "Sudden_Pop_2279",
        "title": "'Wednesday' Season 2 Boots 'Stranger Things 3' Off Netflix's Most Popular TV List With 95.4 Million Views",
        "content": "",
        "upvotes": 27,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nlff9a/wednesday_season_2_boots_stranger_things_3_off/"
    },
    {
        "id": "1nls28v",
        "author": "user_notFoundError",
        "title": "Any good webseries suggestions?",
        "content": "i have nothing to do on this weekend. So pls suggest me some web series which are truely interesting and help me enjoy my weekend? i am more into thriller .",
        "upvotes": 3,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1nls28v/any_good_webseries_suggestions/"
    },
    {
        "id": "1nlwolz",
        "author": "AgeOptimal7728",
        "title": "Any movie similar in artstyle to Mahavatar Narsimha?",
        "content": "I recently watched this movie Mahavatar Narsimha and it felt so unique in its artstyle. This doesn't look like disney nor sony animation style and felt like watching something new. \n\nIs there anything similar available. Doesn't matter if it's not english.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nlwolz/any_movie_similar_in_artstyle_to_mahavatar/"
    },
    {
        "id": "1nlijj0",
        "author": "GWeronika",
        "title": "Black Rabbit Vince character is so irritating",
        "content": "I finished my binge of Black Rabbit and Vince's character irritates me so much. He's the older brother who takes no accountability for anything. It's somehow his brother's responsibility to fix everything he touches.  Jake allows him to do it, which is equally irritating. \n\n1) Vince takes out a lien on his mom's house with loansharks and doesn't pay it back. Somehow it's Jake's responsibility to pay it for him\n2) Vince puts his daughter in harm's way because of the loan and guilt trips Jake \"to think about his niece\" when he didn't give two shits about abandoning his daughter in the first place \n3)  Promises to repay the whole amount not communicating with his brother first about where the money has to be allocated first then gets mad about it\n4)  Agreed to watch the waitress around the predator and she ends up ODing, because he got sidetracked \n5)  Guilts his brother for having money after he worked his ass off at the restaurant. Vince just wants the easy way out everytime like a toxic leech\n\n\nIt's like watching a 50 year old toddler. ",
        "upvotes": 11,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1nlijj0/black_rabbit_vince_character_is_so_irritating/"
    },
    {
        "id": "1nlpjj5",
        "author": "babyinatrenchcoat",
        "title": "“Untamed” Cake",
        "content": "Just finished this mini series and guess I’m the minority who loved it. Been bawling the last 3 episodes and didn’t catch any of the twists.\n\nBut I have a question- what’s up with cake? Every single episode features cake (different kinds) and I just cannot decipher what the underlying meaning is if there is one. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nlpjj5/untamed_cake/"
    },
    {
        "id": "1nlasox",
        "author": "chungaroo2",
        "title": "Netflix has been killing it with new anime",
        "content": "I just wanted to point out how Netflix has been getting amazing studios and writers to make shows on there platform shout out to dandandan top tier and shout out to sakamoto days top tier. Honorable mentions record of ragnarok. I hope they keep supporting these amazing writers and extremely talented artists and push more amazing shows. ",
        "upvotes": 14,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1nlasox/netflix_has_been_killing_it_with_new_anime/"
    },
    {
        "id": "1nl8zzn",
        "author": "tinycitygirl",
        "title": "Black Rabbit",
        "content": "Jason Bateman is always great. Took me a min to recognize him! \nOzark feels for sure. Saw Laura Linney directed at least one episodes. \nRecommend for sure! ",
        "upvotes": 11,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nl8zzn/black_rabbit/"
    },
    {
        "id": "1nlq85b",
        "author": "Theangrybul",
        "title": "Help me find this show?",
        "content": "To be fair I have no idea if this was a dream or not but lately I've been wanting to watch a new show or movie and my mind made me remember this one trailer or something. Its about a teen I think trying to get his friend or childhood friend (maybe girlfriend?) To remember this show from their past? Maybe in like a dream hes been having recently? Sorry the details are a bit fuzzy. Any suggestions?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nlq85b/help_me_find_this_show/"
    },
    {
        "id": "1nlcn5e",
        "author": "Euphoric_Breakfast79",
        "title": "Alice in Borderland Season 3 Early Reviews Praise Thrilling Return",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nlcn5e/alice_in_borderland_season_3_early_reviews_praise/"
    },
    {
        "id": "1nldzlb",
        "author": "KuchiferToolAPC",
        "title": "Monsters Inside: The 24 Face of Billy Milligan",
        "content": "I'm literally 17 minutes into this documentary and already side-eyeing the hell out of the people being interviewed.\n\nBilly Mulligan's brother says when he heard his brother was arrested as the Ohio State Campus R\\*pist\\* his response, \"I probably didn't believe it as well. I think I said, 'There has got to be a mistake here.' Nobody's family wants to admit their child... or their husband or their brother could do such a thing\"\n\n  \nWhat? I get that reaction or sentiment if this is the first time they have been caught or this is the first time you are hearing of it... How would a brother not be aware that his little brother served time in juvenile detention for r\\*pe but this reaction after this guy already did time for the same damn thing when he was THAT young? \n\n  \nThen the subsequent other childhood friends from the self-described small town, when typically everyone knows each other's business or at least would notice a 10th grader just missing from school for however long he was incarcerated, said there is no way he \"was capable of any of this\". SMH. \n\n  \nIf this is addressed later, apologies for the premature post but since so many of these docs are getting lazier and lazier, interviewing people that are just not credible at all, this right off the bat irked me. \n\n  \n",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nldzlb/monsters_inside_the_24_face_of_billy_milligan/"
    },
    {
        "id": "1nm0rcl",
        "author": "Ok-Bug8420",
        "title": "Netflix possible comeback?",
        "content": "I feel like Netflix had so many good shows and movies like Mulan, lion king, K-On, little witch academia, glitter force, Julie and the phantoms, etc.They had so many great options and I think that they should bring some back. I know that the Disney movies are never coming back. But they had so many great original series that they ended that people liked. I feel like they are even some non Netflix shows that they could buy and bring back or just take inspiration from. They need shows that don’t give recision, including movies because I’m tired of seeing that girl from descendants every time I look through Netflix.Netflix will never make a comeback unless they ask the public your take some type of inspiration from.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nm0rcl/netflix_possible_comeback/"
    },
    {
        "id": "1nl6c1s",
        "author": "DetectiveHot2071",
        "title": "“I did not f*** a single person on Riverdale”: Madelaine Petsch shuts down KJ Apa rumours",
        "content": "update to the article from a couple weeks back hahahaaha",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nl6c1s/i_did_not_f_a_single_person_on_riverdale/"
    },
    {
        "id": "1nlntuu",
        "author": "Witty-Ad5008",
        "title": "DOES ANYONE REMEMBER",
        "content": "Does anyone remember on old old Netflix that one guy who would ask you questions about things you liked and it would recommend you shows? I cannot find anything on it and I'm wondering if this is some sort of mass hallucination me and my siblings had.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nlntuu/does_anyone_remember/"
    },
    {
        "id": "1nlnb3y",
        "author": "FocusSlo",
        "title": "Does anyone know how to get english subtitles to show when watching a foreign show and they speak english?",
        "content": "Watching KDramas and I have english subtitles on. But whenever a character speaks in english, there are no subtitles, which makes it a bit difficult. I usually have subtitles on no matter what since my volume needs to be low.\n\nAny way to ensure they’re on always?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nlnb3y/does_anyone_know_how_to_get_english_subtitles_to/"
    },
    {
        "id": "1nkvxdf",
        "author": "_mcklovin_",
        "title": "Adolescence (groyper, incel)",
        "content": "Okay, I have a few things to say. So, first of all this was a super weird coincidence that I watched this today because I’ve been learning about the alt-right incel groyper pipeline on TikTok literally all week after the you-know-who assassination because I was totally ignorant to all of that, and I watched Adolescence today literally not knowing AT ALL that’s what it is about. I started watching it because that kid was the youngest to ever when an Emmy, and I was like oh must be good. Well it was good, and it was objectively the best time I could’ve watched it and deeply understood it. I need to lie down. \n\nSecond, media literacy is literally dead methinks. I was on a different subreddit and this girl said she didn’t like how the show propped up the killer and diminished the victim and other female characters, but that was LITERALLY the entire point. It even pointed out that the killers are always remembered and the victims are forgotten. Again, maybe if you’re not super familiar with the alt-right incel groyper stuff which I also wasn’t aware of until this week, I can see where you wouldn’t totally fill in all the gaps, but the entire point was to show this normal kid who you could chalk his actions up to bullying when in reality, even if he was bullied (2 things can be true at once) he clearly displayed woman-hating, aggressive, and isolated tendencies that the girls in his class could recognize via his Instagram posts and behavior. Why would a girl want to hang out with someone like that? She also could see right through his little “clever” scheme of asking her out when she was at her weakest when it wasn’t clever, he just thinks women are stupid and sub-humans that are just a means to a sexual end. To incels, they always look outward, never inward. This was also highlighted by the fact this was clearly a cute, not ugly at all little boy saying “I’m ugly” over and over, so his scapegoat was his looks when that wasn’t the problem at all. A lot of these incels who claim they are unattractive are actually attractive on the outside but behave in such a way that their physical appearance doesn’t matter at all which is really the reason they can’t get girls. It has nothing to do with looks at all, but the online chat forums and the rejection by girls reinforces their untrue ideas.\n\nThird, which pretty much I’ve already covered more or less is that there was no twist which ended up actually being the twist because this is simply reality. It’s these kids who are by all means normal at first but then fall into this echo chamber they can’t get out of because their behavior reinforces their perception, and the parents are not sitting down with them and having important conversations about women and sex and simultaneously letting them stay on the computer all the time. The truth is right in front of us, which in this case is a double truth (1. we can clearly see him committing the crime on camera, so there is no plausible deniability at any point even though we want to believe there will be some big twist. 2. we know why young men are growing violent and discontent i.e. groyper chat rooms and unchecked internet use), but we don’t want to see the truth. We the audience and we society. This was covered in the end with the parents pretty well. Tell me your thoughts. ",
        "upvotes": 42,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1nkvxdf/adolescence_groyper_incel/"
    },
    {
        "id": "1nklwhg",
        "author": "BlackDoom_26",
        "title": "Which Netflix movie or show had the best twist?",
        "content": "Netflix has so many movies and shows that pull off twists you don’t see coming. I’d love to hear which one surprised you the most and stuck with you. Excited to see what everyone else thought was the most surprising.",
        "upvotes": 179,
        "comments": 254,
        "media": null,
        "permalink": "/r/netflix/comments/1nklwhg/which_netflix_movie_or_show_had_the_best_twist/"
    },
    {
        "id": "1nlkvcq",
        "author": "ibabbar18",
        "title": "Payment deducted but netflix still showing payment pending. any solution ?",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nlkvcq/payment_deducted_but_netflix_still_showing/"
    },
    {
        "id": "1nlus11",
        "author": "ChampionshipFun4706",
        "title": "TV not part of household",
        "content": "So it was working for a while but now out TV won't let us use my bris Netflix.\n\nHe lives elsewhere. \nWe use his Netflix \nHe uses our Disney+\n\nAny hacks to get around this stupid rule? \n\nTV runs on wifi. We live 20min away from him. At first it let us say we were \"travelling\" and enter a code doesn't give us this option now ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nlus11/tv_not_part_of_household/"
    },
    {
        "id": "1nlj388",
        "author": "Professional_Fig6820",
        "title": "Netflix UX be like: hide &amp; seek edition",
        "content": "After 6 years I discovered Netflix lets you download your entire watch history.  \n**Account → Profiles - Parental Controls &amp; Permissions → \\[Your\\] Profile → Viewing Activity → Download all**.  \nStaring in shock at 2 spreadsheets. My manual one with 350 lines and this 'real one' 2k+ lines. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nlj388/netflix_ux_be_like_hide_seek_edition/"
    },
    {
        "id": "1nlyz1v",
        "author": "Sippi66",
        "title": "Get us Jimmy Kimmel",
        "content": "Disney threw away a gem so why not bring him to Netflix? He is funny, tells it like it is with humor and shouldn’t have been targeted by a thin skinned orange nut case via the FCC. \n\nWe need a company that isn’t afraid to stand up to bullies. \n\n",
        "upvotes": 0,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1nlyz1v/get_us_jimmy_kimmel/"
    },
    {
        "id": "1nlfb7i",
        "author": "XxPk76xX",
        "title": "Final Draft",
        "content": "What is the theme song that keeps on playing over and over again . It is quite catchy and I need to know the title of the song.\n\n\nI believe that June One Kim is the composer of the music but that’s all I was able to find out . ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nlfb7i/final_draft/"
    }
]