[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 7,
        "comments": 37,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1o7bqyy",
        "author": "Iaco_V8",
        "title": "Qualcuno di voi sa cosa sono questi \"cerchi di vetro\" in via Pietro Micca?",
        "content": "Passo spesso sotto i portici di via Pietro Micca e noto che molti bambini saltano sopra questi cerchi di vetro per divertimento. \nOra sono curioso di sapere cosa siano esattamente",
        "upvotes": 12,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/y05iouwg7avf1.jpeg?auto=webp&amp;s=deee826dcf109ba813be2c74e0777913377b8ec2"
        },
        "permalink": "/r/torino/comments/1o7bqyy/qualcuno_di_voi_sa_cosa_sono_questi_cerchi_di/"
    },
    {
        "id": "1o758xb",
        "author": "Bruno_Barbiere",
        "title": "Ma è vero che la situazione al Bar Casablanca è diventata così ingestibile? Qualcuno ha avuto esperienze lì?",
        "content": "",
        "upvotes": 17,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ygzhan2ci8vf1.jpeg?auto=webp&amp;s=8b8d46044ec724abc4bf2fb856b97ac6ad6c5845"
        },
        "permalink": "/r/torino/comments/1o758xb/ma_è_vero_che_la_situazione_al_bar_casablanca_è/"
    },
    {
        "id": "1o74s6o",
        "author": "bumby104",
        "title": "Spot intimi in città",
        "content": "Ciao ragazzi, vivo da poco in città e avrei bisogno di sapere quali sono i migliori posti tranquilli in cui stare con una ragazza in intimità, grazie mille!",
        "upvotes": 7,
        "comments": 24,
        "media": null,
        "permalink": "/r/torino/comments/1o74s6o/spot_intimi_in_città/"
    },
    {
        "id": "1o7gobm",
        "author": "bbHiron",
        "title": "Depilazione uomo?",
        "content": "Ciao a tutti, per caso conoscete centri estetici a torino che effettuino depilazione maschile? Preferibilmente qualcosa di economico, non 80€ per mezza gamba ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o7gobm/depilazione_uomo/"
    },
    {
        "id": "1o7fftl",
        "author": "Feeling_Smile7869",
        "title": "Opinions about areas in Torino",
        "content": "Hi everybody! I’m planning to buy an apartment and move to Torino. It seems that all affordable apartments are located in Lucento area (Corso Toscana / Via Borgaro  area) or in Borgata Vittoria area bordering Lucento. What are your opinions / experiences about this area (safety, demographics, facilities)?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o7fftl/opinions_about_areas_in_torino/"
    },
    {
        "id": "1o7cuqe",
        "author": "not-a-bot_maybe",
        "title": "aiuto psicologico",
        "content": "ciao a tutti, account fake per motivi di privacy personale, volevo chiedere se qualcuno ha qualche esperienza o informazione sullo Sportello di Ascolto Psicologico Torino, Circoscrizione 7.\nQualsiasi indicazione su come muovermi, sul funzionamento, su come vi siete trovati... sarà ben accetta.\n\nSono in un periodo davvero difficile e preferirei non chiedere ai miei genitori di pagare per uno psicologo, non abbiamo quel tipo di rapporto, quindi pensavo a questa opzione gratuita.\nRingrazio in anticipo chi mi saprà dare qualsiasi consiglio :)\n\nps sono maggiorenne, non dovrebbero quindi esserci problemi a mantenere l'anonimato. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o7cuqe/aiuto_psicologico/"
    },
    {
        "id": "1o7bus2",
        "author": "Senzanima2",
        "title": "Consiglio tecnico PC a Torino per riparazione cerniera notebook Acer",
        "content": "Ciao a tutti 👋\n\nSto cercando un consiglio su come muovermi per riparare la cerniera dello schermo del mio notebook Acer Extensa 15 EX215-51-577DE, acquistato su Amazon nel 2020.\n\nLa cerniera destra fa troppo attrito, tanto che, aprendolo, si è staccata la sede filettata delle tre viti che la fissano. La parte esterna in plastica che copre la cerniera sembra invece integra.\n\nAvevo già inviato questo PC in assistenza quando era ancora in garanzia, per lo stesso problema alla cerniera sinistra, quindi credo sia un punto debole del modello.\n\nHo visto che online i ricambi costano indicativamente:\n\n* cerniera: circa 10 €\n* cover esterna: circa 40–50 €\n\nMi chiedevo:\n* conoscete qualche tecnico o laboratorio affidabile su Torino che faccia questo tipo di riparazioni (cerniere / scocche notebook)?\n* secondo voi, quanto sarebbe un prezzo onesto per la manodopera (smontaggio schermo, sostituzione cerniera e sistemazione cover)?\n\nGrazie mille in anticipo a chi risponderà 🙏",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o7bus2/consiglio_tecnico_pc_a_torino_per_riparazione/"
    },
    {
        "id": "1o76ryg",
        "author": "Lale_banane",
        "title": "Bancarella Orecchini Gran Balon",
        "content": "Ciao!  \nDomenica sono andata al gran balon e ho trovato una bancarella davvero particolare che vendeva orecchini e collane con parti del corpo scolpite.  \nErano davvero delle mini opere d'arte indossabili.\n\nPurtroppo avevo il cellulare scarico e non ho potuto scannerizzare il qr code che portava alla pagina di instagram della persona che li realizzava e adesso non riesco a trovarla.  \nQualcuno saprebbe dirmi come si chiami l'artista e/o la sua pagina instagram? Grazie ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o76ryg/bancarella_orecchini_gran_balon/"
    },
    {
        "id": "1o7a5fc",
        "author": "alistairalbani",
        "title": "Tavoli da ping-pong a Torino",
        "content": "Salve, vivo in via Barnaba Panizza e ho un amico in via svizzera, vorremmo trovare una zona dove giocare a ping-pong su un tavolo libero, abbiamo racchette e palline nostre. Attualmente giochiamo al Politecnico dato che è l'area più a metà per entrambi. Qualcuno saprebbe consigliarmi un posto più comodo? Grazie",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o7a5fc/tavoli_da_pingpong_a_torino/"
    },
    {
        "id": "1o78g5a",
        "author": "bookbookitaita5",
        "title": "Torino e d'intorni. Ragazze, mia sorella si sposa e cerca disperatamente un vestito \"diverso\". \"Elfico\" come dice sempre lei o da \"favola dei boschi\"...",
        "content": "",
        "upvotes": 1,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/70lq4ejyc9vf1.jpeg?auto=webp&amp;s=a7f74d3683908076197830dac792c1170f825788"
        },
        "permalink": "/r/torino/comments/1o78g5a/torino_e_dintorni_ragazze_mia_sorella_si_sposa_e/"
    },
    {
        "id": "1o77p50",
        "author": "Ugabugacugabuga",
        "title": "Are there any indoor volleyball courts here in Torino",
        "content": "Me and a friend are here for an internship and we’re looking for any indoor courts so we can  play do you guys have any tips or suggestions on how and where we could play?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o77p50/are_there_any_indoor_volleyball_courts_here_in/"
    },
    {
        "id": "1o76unp",
        "author": "esluisge",
        "title": "Amici per andare in palestra",
        "content": "Ciao a tutti, faccio questo post perche pensavo di iscrivermi alla FitActive di Corso Svizzera ma non conosco nessuno con cui andare e non sono mai andato seriamente in palestra per cui vorrei andare con qualcuno che mi guida un attimo su come si fanno gli esercizi. Mi piacerebbe anche trovare amici con cui fumarmi le j",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o76unp/amici_per_andare_in_palestra/"
    },
    {
        "id": "1o76oi1",
        "author": "Superb_Wealth1960",
        "title": "persone per pallavolo / beach volley",
        "content": "ciao ragazzi, sto cercando un gruppo di persone per organizzare settimanalmente in maniera continuativa partite di pallavolo / beach volley per divertimento, con un livello medio - alto.\nConoscete qualcuno o sapete di gruppi già organizzati?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o76oi1/persone_per_pallavolo_beach_volley/"
    },
    {
        "id": "1o74bsm",
        "author": "BidCalm7210",
        "title": "Trasferirsi a a Torino",
        "content": "Ciao a tutti!\nSono siciliana e sto pensando di trasferirmi a Torino per un master in eventi e comunicazione digitale. Ho visto un sacco di pareri contrastanti sulla città — da un lato mi ha davvero colpita, ma vorrei capire:\nCosa posso aspettarmi in termini di\n• costo della vita\n• opportunità lavorative\n• qualità / quantità di eventi\n• possibilità reali di entrare nel settore una volta finito il master\nIn più suono anche come dj! che situazione c'è a livello di eventi techno, elettronica?",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1o74bsm/trasferirsi_a_a_torino/"
    },
    {
        "id": "1o6q92u",
        "author": "ryu468",
        "title": "Politecnico di Torino - can I apply for classes across different years as an exchange student?",
        "content": "Hi all, please let me know if this is the wrong subreddit to post this to, but I need some guidance as a future exchange student for Politecnico di Torino in spring 2026. I'm wanting to apply for their Civil &amp; Environmental Engineering degree, but their course curriculum on their website is pretty confusing for me. They section their classes into Year 1, Year 2, and Year 3, and by semesters. They don't offer a vast catalogue either, mostly restricted to 3 or 4 specifically listed classes per semester. I'm currently a 3rd year in a US university, so I've already taken most of their Year 1 classes (except for some that aren't required at my uni for CE). Could I apply for classes across different years as an exchange student, or am I automatically placed in Year 1 as if I were a freshman? Of course keeping in mind prerequisites. Thank you!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1o6q92u/politecnico_di_torino_can_i_apply_for_classes/"
    },
    {
        "id": "1o6u1ld",
        "author": "Usual_Ad8650",
        "title": "Amicizie",
        "content": "Noi siamo una coppia cerchiamo nuove amicizie ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1o6u1ld/amicizie/"
    },
    {
        "id": "1o6egj2",
        "author": "Separate_Win7649",
        "title": "Assegnazione numero linee autobus e tram",
        "content": "Ciao! C'è qualche espert di Torino e di mezzi pubblici che sa con che criterio vengono assegnati i numeri alle linee di autobus e tram?",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1o6egj2/assegnazione_numero_linee_autobus_e_tram/"
    },
    {
        "id": "1o6toq9",
        "author": "Esp3t0",
        "title": "Problemi con i documenti di conformità per il certificato di idoneità alloggiativa — qualcuno è passato per lo stesso?",
        "content": "Hi everyone,\nI’m currently living in Turin and trying to request the certificato di idoneità alloggiativa to regularize my wife’s stay.\n\nThe problem is that the Comune requires several technical documents about the gas and electricity installations of the apartment — but my landlord doesn’t have them. From what I’ve read, these documents (dichiarazioni di conformità) are mandatory, and technically the property shouldn’t even be rented without them.\n\nStill, it seems like this is a very common situation, because my rental contract is registered with the Agenzia delle Entrate, and yet these documents simply don’t exist or aren’t provided.\n\nI’ve already talked to the tenants’ union (SUNIA), and they said I can officially notify the landlord — but I’d really like to hear from someone who has been through this before in Turin.\nHow did you solve it? Is there any other way to get the certificato di idoneità when the owner can’t provide those documents?\n\nThanks a lot in advance for any guidance. I’m starting to run out of options.\n\n\nItalian version:\n\nCiao a tutti,\nvivo a Torino e sto cercando di richiedere il certificato di idoneità alloggiativa per regolarizzare la posizione di mia moglie.\n\nIl problema è che il Comune richiede diversi documenti tecnici sugli impianti di gas ed elettricità, ma il proprietario dell’appartamento non li ha. Da quanto ho capito, queste dichiarazioni di conformità sono obbligatorie, e tecnicamente non si potrebbe nemmeno affittare un immobile senza di esse.\n\nNonostante ciò, il mio contratto di locazione è regolarmente registrato all’Agenzia delle Entrate, quindi non so bene come sia possibile.\n\nHo già parlato con il sindacato degli inquilini (SUNIA), che mi ha detto che posso fare una notifica ufficiale al proprietario — ma vorrei sapere se qualcuno a Torino ha avuto la stessa esperienza.\nCome avete risolto? Esiste qualche alternativa per ottenere il certificato se il proprietario non fornisce quei documenti?\n\nGrazie mille a chiunque possa darmi un consiglio — sto iniziando a non sapere più come muovermi.",
        "upvotes": 1,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1o6toq9/problemi_con_i_documenti_di_conformità_per_il/"
    },
    {
        "id": "1o74rzk",
        "author": "bumby104",
        "title": "Spot intimi in città",
        "content": "Ciao ragazzi, vivo da poco in città e avrei bisogno di sapere quali sono i migliori posti tranquilli in cui stare con una ragazza in intimità, grazie mille!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o74rzk/spot_intimi_in_città/"
    },
    {
        "id": "1o6qmxe",
        "author": "Kugelfisch_",
        "title": "Apprendisti tatuatori Torino",
        "content": "Buonasera a tutti, qualcuno conosce studi a Torino che accettano apprendisti? Ho 21 anni e ho iniziato a tatuare da circa un paio d’anni, prima su pelle sintetica e poi su persone. Ho un pochino di esperienza tatuando in casa, ora però ho fatto il corso per l’abilitazione e sono in possesso della certificazione per tatuare nella regione Piemonte. ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o6qmxe/apprendisti_tatuatori_torino/"
    },
    {
        "id": "1o68qak",
        "author": "IndependentLove3789",
        "title": "Com'è il c2c Torino?",
        "content": "Ci andrò il 1 novembre per la prima volta. Per chi ci fosse già stato com'è il festival? È tanto affollato? I prezzi dei cibo/bere sono tanto alti? Invece la scaletta con gli orari dei cantanti dove posso trovarla? non c'è da nessuna parte. Graziee ",
        "upvotes": 7,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1o68qak/comè_il_c2c_torino/"
    },
    {
        "id": "1o5zhf8",
        "author": "LessImportance2881",
        "title": "Come si vive in zona metro Dante a Torino?",
        "content": "Buongiorno, dovrei trasferirmi a Torino a fine mese con la mia ragazza? Ho letto tanto sulla zona di San Salvario ma non ho capito se tutto il quartiere è da non considerare oppure se ci sono zone più tranquille. Ho letto di problemi di spaccio ma che comunque non è nulla di eccessivamente pesante per chi ci vive, vorrei comunque evitare ci fosse in quella zona.\nSe riusciste a dare feedback anche sulla fermata della metro ve ne sarei grato ♥️",
        "upvotes": 26,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/s6tw8gkqoyuf1.jpeg?auto=webp&amp;s=cea2e315510b1c35fcb01e1ae29a3e5d3ec6ca35"
        },
        "permalink": "/r/torino/comments/1o5zhf8/come_si_vive_in_zona_metro_dante_a_torino/"
    },
    {
        "id": "1o6huxd",
        "author": "claytononset",
        "title": "English Stand-up Comedy Night in Turin @ Jumping Jester, 21 OCT",
        "content": "One night only special event!! :)",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/I1IyiUPajiWyPnSyapJm0X8cSOrrbFWNJYgeG9s2RyI.jpeg?auto=webp&amp;s=87189acdf742446858b34df6babfa8f2236c830c"
        },
        "permalink": "/r/torino/comments/1o6huxd/english_standup_comedy_night_in_turin_jumping/"
    },
    {
        "id": "1o68l11",
        "author": "Outrageous_Lab_7106",
        "title": "Consigli zone torino",
        "content": "Cerco una stanza per l'uni, com'è San Salvario? All'altezza della metro Nizza. Ho letto che la parte alta vicino la stazione è molto sconsigliata... A me starebbe comoda e non mi sembra lontana dal centro...\nIn generale che zone sconsigliate per vivere? ",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1o68l11/consigli_zone_torino/"
    },
    {
        "id": "1o67kr5",
        "author": "MildlyRadioactive",
        "title": "Aiuto urgente – amica bloccata dopo il rilascio del visto ma senza possibilità di immatricolazione finale (UniTo – Business &amp; Management)",
        "content": "Ciao a tutti,  \nScrivo per conto di una mia amica che si trova in una situazione davvero frustrante e avrebbe bisogno di qualche consiglio.\n\nHa completato le scuole superiori qui in Pakistan e ha fatto domanda all’**Università di Torino** (UniTo) per il corso di **Laurea in Business and Management**. È andato tutto bene — è stata accettata, ha ricevuto la **lettera di idoneità**, ha completato la procedura su Universitaly, e le è stato anche **rilasciato il visto**.\n\nIl problema è sorto al momento dell’immatricolazione finale.  \nAveva sostenuto il test **TOLC-E**, che all’inizio dell’anno era accettato per questo corso. Tuttavia, UniTo ha improvvisamente aggiornato i requisiti, rendendo il **SAT obbligatorio** per gli studenti non-UE. Lei non era stata informata di questo cambiamento in tempo e, quando l’ha scoperto, **la scadenza per l’immatricolazione era già passata**.\n\nHa contattato l’università, che le ha confermato che **non può immatricolarsi ora**, e che dovrà **rifare domanda l’anno prossimo**, **dopo aver sostenuto il SAT**.\n\nOvviamente, non vuole perdere un intero anno solo ad aspettare.\n\nSta pensando di cambiare corso di laurea (scegliendone uno **che non richieda il SAT**), oppure di iscriversi a un **Foundation Year**. Ma ci siamo bloccati in alcuni punti, e avremmo davvero bisogno di aiuto.\n\n\n\n# ❓ Le nostre domande:\n\n1. Il suo **visto è ancora valido**, ma l’università dice che è **legato al corso specifico per cui ha fatto domanda**. È vero che **non può cambiare corso** e che dovrebbe **fare domanda per un nuovo visto**, anche se quello attuale è ancora valido?\n2. Se fosse vero, **come si fa a richiedere un nuovo visto se si ha già un visto valido** per diversi mesi?\n3. I corsi di Foundation Year in Italia (ad esempio a UniTo o in altre università) **richiedono il SAT** o no? Potrebbe essere una soluzione valida per lei?\n\n\n\nSe qualcuno ha vissuto una situazione simile — o conosce qualcuno che ci è passato — saremmo davvero grati per qualsiasi consiglio, anche solo per sapere a chi rivolgerci o quale ufficio contattare.\n\nGrazie mille in anticipo 🙏",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1o67kr5/aiuto_urgente_amica_bloccata_dopo_il_rilascio_del/"
    },
    {
        "id": "1o6berb",
        "author": "FutureVirtual6811",
        "title": "Residence Permit Help",
        "content": "Hey everyone, I’m in kind of a complicated situation and would really appreciate some guidance on a few things related to my residence permit application:\n\n\t•\tIs it okay if I include the hotel I’m currently staying at as my address for the residence permit application? I’ll probably check out of the hotel one day after submitting the application and then return to my home country for a few months.\n\n\t•\tWould it be a problem at my fingerprint appointment — or when I re-enter Italy — that I stayed a few months outside of Italy right after applying for the residence permit (basically the same week I arrived and applied)? I don’t have permanent accommodation yet and am waiting on credit transfer confirmation from my school, which should be finalized around December or January. I can attend classes, but it’s kind of pointless until that’s settled.\n\n\t•\tI’m hearing that fingerprint appointments are being given for March–April. Do I need to have a rental contract or residential address by then? Can I just provide a friend’s address and say I’m staying with them?\n\n\t•\tCan I come back to Italy only for exams and maybe stay a week every month or two until I officially receive my residence permit? I’ll still be on a valid multiple-entry visa during this time.\n\n\t•\tWhat are the actual rules about how much time I need to spend in Italy once I receive the residence permit?\n\n\t•\tDoes the residence permit validity start from the date of application or from the start date of my health insurance? I heard that some people submit their health insurance only at the fingerprint appointment, and that way their permit starts around that time (so it’s valid for a full year from then, not from the initial application date).\n\n\t•\tLastly, are the Questura officers or border police usually strict about the time spent outside Italy between the application and fingerprint appointment or between the issuance of the permit and expire date?\n\nThanks a lot in advance — any insights or personal experiences would really help!",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1o6berb/residence_permit_help/"
    },
    {
        "id": "1o5f383",
        "author": "happy_arounding15",
        "title": "La pace di Borgo Dora al mattino presto",
        "content": "",
        "upvotes": 85,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3sxsyo3uluuf1.jpeg?auto=webp&amp;s=877355468e71c0b77d5e868f5f6dbb7d97dd9fd2"
        },
        "permalink": "/r/torino/comments/1o5f383/la_pace_di_borgo_dora_al_mattino_presto/"
    },
    {
        "id": "1o5tlsr",
        "author": "Specialist-Cold-1459",
        "title": "Asili nido privati in zona Corso Dante?",
        "content": "Un noto nido di Torino mi ha dato un pacco clamoroso scrivendomi stasera che non apriranno (bambino iscritto a Maggio...)\n\nQuindi sono alla disperata ricerca di un posto nido. Se sentite qualcosa mi fate un favore grazie!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1o5tlsr/asili_nido_privati_in_zona_corso_dante/"
    }
]