[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 43,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1qgmuur",
        "author": "SpecialistTour4232",
        "title": "Netflix new layout SUCKS",
        "content": "Bro why did they change the layout of Netflix to be so difficult to navigate?? It’s like Hulus horrendous layout. Literally the reason I preferred Netflix was the ease of use. ",
        "upvotes": 223,
        "comments": 45,
        "media": null,
        "permalink": "/r/netflix/comments/1qgmuur/netflix_new_layout_sucks/"
    },
    {
        "id": "1qgyskn",
        "author": "IntrepidIndication14",
        "title": "His &amp; Hers",
        "content": "Just finished his &amp; hers on Netflix and kinda confused. I liked it until it got to the end - it did not make any sense. Her mother was the killer?? Hmmmm so much misleading dialogue that didn’t make any sense or align to actual events.\n\n\\- Rachel tells Jack “Anna isn’t who you think she is.”\n\n\\- Richard stating he killed the three other women but didn’t actually\n\n\\- Lexy/Richard luring Anna to their property &amp; just planning to kill her??? If lexy didn’t kill the three others, why is she all of a sudden wanting to kill Anna now?\n\nWeird.",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qgyskn/his_hers/"
    },
    {
        "id": "1qgj2w1",
        "author": "itzclicker",
        "title": "Netflix \"random\" button",
        "content": "Does anyone else wish that Netflix had a \"random\" button where when pressed it would put on a random film that you haven't watched before. I wish it did because it's alway's so hard to find new stuff to watch!",
        "upvotes": 68,
        "comments": 53,
        "media": null,
        "permalink": "/r/netflix/comments/1qgj2w1/netflix_random_button/"
    },
    {
        "id": "1qgrvdk",
        "author": "cheesycat6969",
        "title": "Lost in space is so good but so infuriating",
        "content": "My roommate and i started watching Lost in Space (season 1, ep 9), and even though it’s pretty entertaining im losing my patience with how the plot barely progresses. literally every time they try to do anything, something goes wrong. i know conflict is necessary but when it happens every single time it just feels repetitive annoying and predictable. I haven’t seen anyone complain about this so that’s just my rant. have a good day. ",
        "upvotes": 17,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1qgrvdk/lost_in_space_is_so_good_but_so_infuriating/"
    },
    {
        "id": "1qgt8ly",
        "author": "feelingwizzed",
        "title": "Spoiler: who saw the His &amp; Hers ending coming?",
        "content": "I had a feeling she was the one who was assaulted after what Zoe said at the police station. \n\nAlso, I totally saw the mom had something to do with it once they mentioned she kept getting lost but only at night. \n\nThey had me fooled for like 2 minutes that it was only Catherine but then I thought about how she may have killed her sister but the killing for the attack thing…eh. \n\nThinking MEDIA wise, it would’ve made “more sense/more drama” to go after the men who did it AND the women. \n\nSo anyways, enjoyed my binge but it wasn’t great. ",
        "upvotes": 12,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1qgt8ly/spoiler_who_saw_the_his_hers_ending_coming/"
    },
    {
        "id": "1qfs60q",
        "author": "DemiFiendRSA",
        "title": "Matt Damon Says Netflix Wants Movies to Restate the ‘Plot Three or Four Times in the Dialogue’ Because Viewers are on ‘Their Phones While They’re Watching’",
        "content": "",
        "upvotes": 1509,
        "comments": 128,
        "media": null,
        "permalink": "/r/netflix/comments/1qfs60q/matt_damon_says_netflix_wants_movies_to_restate/"
    },
    {
        "id": "1qgvv8c",
        "author": "LilNello1",
        "title": "The Rip",
        "content": "So just got done watching The Rip and wanted to know for those of you who have watched it so far.  Without giving away too many spoilers, if any.  What are your thoughts and why did you like or not like it?",
        "upvotes": 5,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1qgvv8c/the_rip/"
    },
    {
        "id": "1qgw10v",
        "author": "FunRealistic7609",
        "title": "Thanks for the Recommendations!!",
        "content": "I’ve watched His &amp; Hers and The Beast in Me.\n\nJust wanted to say thanks to everyone who suggested them. I really enjoyed both shows!..\n\nhttps://www.reddit.com/r/netflix/s/iY7Ope6WQE",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qgw10v/thanks_for_the_recommendations/"
    },
    {
        "id": "1qh17ur",
        "author": "HarinNakashimo",
        "title": "Next, I NEED HELP",
        "content": "Here's a case of a human being who finished two series today, Brooklyn Nine-Nine and Spy X Family (I know it's anime, but whatever). I need recommendations for Netflix. I'm the type who likes everything, there are only three things I don't want:\n\n1- Very dramatic series (like Shameless)\n\n2- Series with very long episodes. 20 minutes is my limit, 40 minutes is a crime (right, Shameless?)\n\n3- It's not exactly a rule, but I have a weakness for sitcoms and romances (especially LGBT). If you recommend any, I'm more likely to watch them (except Shameless).\n\nNow that my love for Shameless has been proven, I'm ready.\n\nLast edit: someone can probably recommend Heartstopper, but I prefer to finish watching it today. webtoon first.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qh17ur/next_i_need_help/"
    },
    {
        "id": "1qgwwcc",
        "author": "FenkDaddy",
        "title": "Noticed another movie on a screen in a scene in “the rip” and was curious if there’s a connection",
        "content": "There’s a scene in Netflix’s new movie where JD (Ben Affleck) goes into a house across the street to investigate the house light that signals “pigs” through Morse code. I believe the movie on the screen to be the Belko experiment from 2016. I was curious if anyone could find any correlation between the two movies because I can’t seem to.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qgwwcc/noticed_another_movie_on_a_screen_in_a_scene_in/"
    },
    {
        "id": "1qggiio",
        "author": "RiskAndReason",
        "title": "What did you WATCH THIS WEEKEND?",
        "content": "What did you end up watching on Netflix this weekend?   \n  \nA new series, a comfort rewatch, or a random movie you finally gave a chance? Looking for ideas to add to my watchlist.",
        "upvotes": 19,
        "comments": 141,
        "media": null,
        "permalink": "/r/netflix/comments/1qggiio/what_did_you_watch_this_weekend/"
    },
    {
        "id": "1qgq8jx",
        "author": "itsssstonyyy",
        "title": "His and hers",
        "content": "What’s a shit show, In the last episode how did Priya arrive the same time as Jack to take the shot killing lexy, literally makes zero sense when jack had left priya unconscious ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qgq8jx/his_and_hers/"
    },
    {
        "id": "1qg5yyv",
        "author": "Miserable-Bother-572",
        "title": "Agatha Christie's Seven Dials",
        "content": "I am a big fan of Agatha Christie and her work. Books are great, and Poirot with David Suchet is one of my favourites. The newest adaptation, which aired on Netflix is a huge let down for me, and my greates impression is that they have really dumbed it down. what is you opinion? ",
        "upvotes": 37,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1qg5yyv/agatha_christies_seven_dials/"
    },
    {
        "id": "1qgpwdx",
        "author": "KittyDomoNacionales",
        "title": "Amo (2018)",
        "content": "I’m rewatching an old show, Amo (2018). I forgot how weird and kinda disturbing it was that the director chose to include irl crime scenes in the intro. As in, you could see the blood and corpses for a few seconds and it’s real. I feel like shows like this, with absolutely realistic graphic violence and sex, should warrant more than a TV-MA rating. I checked the ratings guide and there’s actually a higher rating which is NC17. I’m just wondering how graphic something has to be before it gets bumped up to that.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qgpwdx/amo_2018/"
    },
    {
        "id": "1qgp6pf",
        "author": "Achenar459",
        "title": "Is there a built-in way to tell if all the episodes in a season are available to watch?",
        "content": "Is there any built‑in way on Netflix to see whether a season is fully available, or do I need to check somewhere else—like Google or IMDb—to know if more episodes are still pending?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1qgp6pf/is_there_a_builtin_way_to_tell_if_all_the/"
    },
    {
        "id": "1qh5j2e",
        "author": "th3shoes",
        "title": "Does “The Rip” have AI backgrounds?",
        "content": " Did anyone notice for the first like 20-30 it’s just the main characters sitting in the office and the glass window is showing people walking by around the office?\n\nI cannot help but think this is AI, why on earth would they hire like a dozen people just to walk around a blurry background? \n\nI really hope movies aren’t going to start cutting corners like this.",
        "upvotes": 0,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1qh5j2e/does_the_rip_have_ai_backgrounds/"
    },
    {
        "id": "1qgiqnu",
        "author": "Tricky-Bat-2638",
        "title": "Any good true crime documentaries?",
        "content": "I’m looking for some good true crime documentaries that aren’t too long. Maybe where each episode is a different crime or only 2-3 episodes long. Anything too long I can lose interest in. \n\nThanks in advance 😊 ",
        "upvotes": 4,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qgiqnu/any_good_true_crime_documentaries/"
    },
    {
        "id": "1qh3nio",
        "author": "Gatto_2040",
        "title": "Netflix sensors dodgeball",
        "content": "So doggeball popped up on my Netflix and I thought I have not watched that for years since I had it on dvd and it gets to bit with the cheer leading try out and a hold sentence is removed making the whole joke not so funny. So my question is how many other movies are Netflix censoring? And if I am paying for a subscription why are they censoring in the first place and who gets to choose what is censored and what is not ? Also what else am I missing from shows that I have not watched before on dvd ? ",
        "upvotes": 0,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1qh3nio/netflix_sensors_dodgeball/"
    },
    {
        "id": "1qh24ec",
        "author": "backupjedi",
        "title": "Why is the sound on Netflix so mid",
        "content": "I have a sony home theater, and I stream on multiple apps. \n\nthe volume of dialogues is so low on Netflix when I choose 5.1 \n\non every other streaming app it's perfectly fine. \n\nI have connected via an optical cable. because I don't have atmos output, just 5.1 \n\nEven with headphones, Netflix requires high volume compared to the rest of them. \n\nanyone has any solution? ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qh24ec/why_is_the_sound_on_netflix_so_mid/"
    },
    {
        "id": "1qgs72a",
        "author": "Perfect_Parking1155",
        "title": "Finally located the unknown music from Monster: Ed Gein's finale",
        "content": "Music used in the cemetery in the finale. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1qgs72a/finally_located_the_unknown_music_from_monster_ed/"
    },
    {
        "id": "1qgrcnw",
        "author": "Funny-Cup-9416",
        "title": "Fight Club-Similar suggestions please !!",
        "content": "I’m looking for movies like Fight Club, and right now Netflix is the only platform I have.\n\nWhat I loved about Fight Club wasn’t just the chaos. The dialogue felt uncomfortably real, like the movie was saying things we all think about but never actually realise. It hits you with hard truths and makes you wonder how we’ve all been ignoring them for so long.\n\nI’m not looking for flashy action or feel good stories. I want something raw, uncomfortable, and real. Movies that leave you thinking after they end, where the dialogue sticks because it feels true.\n\nIf you know any Netflix movies that give off that same Fight Club kind of feel and hard-hitting dialogues, drop your suggestions.",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1qgrcnw/fight_clubsimilar_suggestions_please/"
    },
    {
        "id": "1qgqw7o",
        "author": "Ariesthebigram",
        "title": "GLOW filmed 2 episodes before being shut down due to the COVID pandemic (and later cancelled). How likely will they get released (assuming little to no post-production work)?",
        "content": "A lot of people still want a GLOW series finale movie of some sort but I am definitely intrigued to see these two episodes that were already filmed and have never seen the light of day...yet, but there's hope, just maybe, they can finally be seen.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1qgqw7o/glow_filmed_2_episodes_before_being_shut_down_due/"
    },
    {
        "id": "1qgbi6t",
        "author": "sagar-waykar-seo",
        "title": "What to watch next based on my choice?",
        "content": "I feel like, I am out of options. Please help.\n\nBelow are my top choices.\n\nSeries - Dark, Stranger Things, 1899, Ozark, American Gods, Legion, Black Mirror, Sense8, House Of Cards, Squid Games\n\nInside Mossad, The Girl from Oslo, The Spy, Captive, Caliphate, Return From ISIS\n\nDocumentary - The Social Dilemma, The Great Hack.\n\nGOT, Breaking Bad, Narcos - watched once, it is worth watching once onky for me, except few scenes.",
        "upvotes": 7,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1qgbi6t/what_to_watch_next_based_on_my_choice/"
    },
    {
        "id": "1qgkpb6",
        "author": "Kendikay1966",
        "title": "Kids movies",
        "content": "Flying frontier with 2 younger children (boys). Any good movie recommendations to download for them?  They like all kinds of genres.  Aged are 4 and 6. Thx!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1qgkpb6/kids_movies/"
    },
    {
        "id": "1qh21z1",
        "author": "godguided",
        "title": "Killing eve is worst show ever made",
        "content": "I just completed killing eve and man if i could have my time worth 3 seasons back. How can team be this bad in content writing with such fine actors and story premise so good in first season. I mean what an absolute shit. Only good happened with killing eve was rise of Jodie Comer. Last episode i guess is the worst episode of tv history. \n\nI know it’s more about psychological thriller than real spy world but still there should be some sense into it. There’s no urgency, no consequences, and no sense of direction. Characters commit murders, betrayals, and world-altering “reveals” and then casually walk away as if nothing happened. Institutions don’t matter. Death doesn’t matter. Revelations don’t matter. Storyline remains the same. What’s the point?\n\nEve was written in worst possible way or casting isn’t done right. All she mainly done is “wide eye” expressions. \n\nJodie Comer is the only reason this show worked at all. Her performance is pure, generational talent effortless physicality, terrifying charm, razor-sharp comedy, and emotional precision all at once. She doesn’t just play Villanelle; she inhabits her. Every scene bends around her. Even weak writing becomes watchable because of her control and magnetism.\n\nA strong pilot. A phenomenal actor. And four seasons of a story that never knew where it was going.\n\nPeople didn’t stay for the plot.\n\nThey stayed for Villanelle.",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1qh21z1/killing_eve_is_worst_show_ever_made/"
    },
    {
        "id": "1qh0pks",
        "author": "TimeTravelingTeapot",
        "title": "Is it time to quit Netflix?",
        "content": "With ads, no password sharing and ST finished, I can't see the point anymore. Novelty of streaming died out and Netflix is not unique or interesting anymore (though I do like their app allowing to adjust the brightness 👍)",
        "upvotes": 0,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1qh0pks/is_it_time_to_quit_netflix/"
    },
    {
        "id": "1qgmwbi",
        "author": "PracticalMagic3015",
        "title": "Love Through a Prism VA",
        "content": "am I the only one who felt that lead female VA was a massive miscast. Netflix has a huge budget so it’s a bit frustrating when it feels like they hire actors who can’t act. her dub was very robotic and felt like ai reading. I love kit and the professor and Catherine’s va’s but I found myself switching to sub just bc the of her",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1qgmwbi/love_through_a_prism_va/"
    },
    {
        "id": "1qgmdxt",
        "author": "MoroccanChristmas",
        "title": "His and Hers - Hot Take (SPOILERS)",
        "content": "\\*SPOLER ALERT\\*\n\nAm I the only one that initially thought Jack might be the killer and he was trying to cover himself? Of course different guesses came along after watching the middle to end of the show, but towards the beginning, more and more hints made me think that Jack had a neurological disorder and was murdering people while he was unconscious.\n\nI thought that maybe he started slowly realizing that more and more evidence was pointing at him, which started Priya's suspicion about Jack (shoe size, swabbing his niece, having Rachel's phone and getting it unlocked, a flashback of Rachel bringing up his wife while in the truck which made him angry, and more), and he started panicking as he realized that he himself was doing all of this.\n\nPerhaps that could have been a pretty interesting plot that still had the same ending twist.",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1qgmdxt/his_and_hers_hot_take_spoilers/"
    }
]