[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 13,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 66,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1li2xbf",
        "author": "BarracudaJazzlike730",
        "title": "Forget the critics, Tires is extremely funny",
        "content": "Tires is a great show. Absolutely hilarious. I have no idea why the critics (look at metacritic) gave the show terrible reviews. It's like a mix of the office meets East Bound and Down. Am I alone in thinking this show is awesome? ",
        "upvotes": 129,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1li2xbf/forget_the_critics_tires_is_extremely_funny/"
    },
    {
        "id": "1li6s5y",
        "author": "ispankoldpeople",
        "title": "What is your fave hidden gem on Netflix?",
        "content": "\nLooking for recommendations of what you believe to be the most underrated shows that you have watched on  Netflix/Prime apps. My only hard no is anything dubbed, it’s just way too distracting for my tiny little mind.",
        "upvotes": 39,
        "comments": 94,
        "media": null,
        "permalink": "/r/netflix/comments/1li6s5y/what_is_your_fave_hidden_gem_on_netflix/"
    },
    {
        "id": "1lhqury",
        "author": "Afraid_Orange6762",
        "title": "3 body problem is one of the best sci-fi shows I’ve watched in a while",
        "content": "The show is beautiful. The cinematography, how the plot advances and how the characteristics of each person is introduced to the viewers in a very subtle but definitive way. I love the show and I hope to god that they don’t discontinue. I’ve never posted a review in my life but knowing Netflix and how they’ve cancelled a lot of the shows I was eagerly  waiting for, I just wanted to post my opinion on this subreddit so that even if there was a 0.01% chance that this post could make the show gain some traction I had to do it.",
        "upvotes": 139,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1lhqury/3_body_problem_is_one_of_the_best_scifi_shows_ive/"
    },
    {
        "id": "1liav4r",
        "author": "kuromisparkles",
        "title": "Suggest me your favorite documentary film!",
        "content": "I’ve been in a documentary mood lately and would love to hear your favorites. I recently watched AM: Laci Peterson documentary.\n\nWhat’s a documentary you really loved or that stuck with you long after watching? Could be about food, true crime, history, art, anything, really. I’m open to all kinds! Thanks.",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1liav4r/suggest_me_your_favorite_documentary_film/"
    },
    {
        "id": "1li3fww",
        "author": "LectureJaded1233",
        "title": "Is “The Waterfront” worth watching?",
        "content": "Thinking about starting “The Waterfront\" but haven't heard much about it. For those who've seen it, is it worth watching? Any quick thoughts or recommendations are appreciated!\nThanks!",
        "upvotes": 19,
        "comments": 27,
        "media": null,
        "permalink": "/r/netflix/comments/1li3fww/is_the_waterfront_worth_watching/"
    },
    {
        "id": "1li5zd2",
        "author": "Tell-Uh-Tubbie",
        "title": "Sirens could be better",
        "content": "My review........it was....OK.  Julianne Moore was great...as expected.  I feel like she's super hot these days....very deserved!.  Milly Alcock...also great! Both held their part of the bargain...great actresses!   The storyline was ...meh if I'm gonna be honest.   The success of this series was really based on the cast...not the story line.  I felt that the real interest was in Meghann Fahy and Felix Solis' characters. Their chemistry was amazing and I wanted to see more! Her and his backstory, ,  how this cult started, who was the first wife, \"hey hey\"? Josh Segarra's character? Like wtf is that about? There is soooo much more to unpack here that is bigger than this storyline! PLEASE MAKE A PREQUEL  or a spinoff with Meghann Fahy and Felix Solis!.  So many questions unanswered!",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1li5zd2/sirens_could_be_better/"
    },
    {
        "id": "1lhynfp",
        "author": "PeskieBrucelle",
        "title": "Can we talk about kpop demon hunters?",
        "content": "When I first saw the title I was like, eh this is weird. However the animation caught my eye. With nothing else to watch I gave it a shot. \n\nI had to stop watching to go to an appointment but when I came back I restarted it to show my significant other and.... \n\nWow. Just wow. The animation was unique and hilarious the singers voices were beautiful and just, flawless. The music was catchy, the feels were Feely. As a kid who loved power puff girls it gave me that same thrill I had as a kid. I never really got into kpop I read some web toons but my significant other and I now get the appeal why these kpop teens love it. \n\nThe story was unique and authentically pleasing rich with culture and life and I need a plushy of that blue tiger with his bird friend. ",
        "upvotes": 11,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lhynfp/can_we_talk_about_kpop_demon_hunters/"
    },
    {
        "id": "1lhs33k",
        "author": "Expensive-Energy-818",
        "title": "Molly Martens is a psycho - A Deadly American Marriage",
        "content": "The first wife died of an asthma attack. It's possible to die of asthma as a non asthmatic. And the prosecutors was presenting is as if Janson had strangled her, with no marks on her neck. It's crazy because strangulation can be seen on the outside and not be seen on the outside but have a full on  impact from inside the neck. But what makes this whole case a mystery is that Tom ( the father) and Molly hade bearly any scratches or woundes on them. But parts of Jansons brain was out. If Molly really had been struggled there would have been injuries from inside the neck.He was much bigger and stronger. \n\n I don't believe ether that she was unconscious. Every woman pees while being nervous or it's something she looked up for her story.   \n\nI believe that it was all pre planned. She read about the first wife and made up a story that would fit. Intoxicated him weak and begun hitting him with the bat. Then shouted out so that the father could come up and help her finish the story. Why was there a whole brick in their bedroom?  And why was it so easy for the to hit him with it? Why was blood splattered on the backside of the door ? Was  Mollys mother on the other side the door, preventing him from running out? \n\nIf Tom was there while Janson was alive... he could have them stop the altercation and calm things down, run or even right then call 911 ? \n\nNOOOO ! Tom was an ex FBI agent. He knew how to save his daughter and work around the crime she hade committed. Tom was educating students on investigation after his job at FBI.  \n\nI feel sorry for them kids. Me, myself and I have also been manipulated as a child and used as a spokes person. I understand. They are grown now and can recall memory better.",
        "upvotes": 22,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhs33k/molly_martens_is_a_psycho_a_deadly_american/"
    },
    {
        "id": "1li4e6c",
        "author": "Fragrant_Peanut_9661",
        "title": "3 Body Problem",
        "content": "To whoever posted earlier about this show, THANK YOU! Based on that post, I decided to give it a rewatch. (I've already watched it once, when it first came out.) And now I remember why I loved it so much. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li4e6c/3_body_problem/"
    },
    {
        "id": "1lh9ft8",
        "author": "Less_Manufacturer218",
        "title": "Dept. Q on Netflix best show",
        "content": "One of the best shows I’ve seen in a while. Characters, plot and ending all really stuck with me. Almost as much as Young Wallander. Hoping for a second season. ",
        "upvotes": 424,
        "comments": 82,
        "media": null,
        "permalink": "/r/netflix/comments/1lh9ft8/dept_q_on_netflix_best_show/"
    },
    {
        "id": "1lhnz54",
        "author": "HurricaneLogic",
        "title": "The new format",
        "content": "This new format is absolutely awful. \n\nPreviously, all categories were in subcategories, to make it easy to navigate through. \n\nNow it's a jumbled mess, with everything thrown together. I have lost interest in watching, and am seriously considering canceling. ",
        "upvotes": 30,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lhnz54/the_new_format/"
    },
    {
        "id": "1li7481",
        "author": "Plastic-Reveal505",
        "title": "What is the best Canadian netflix horror movie?",
        "content": "My partner and I are trying to have a spooky Sunday! So far we are thinking about the Wailing but I figured it cannot hurt to ask !! \n\nI dont mind paranormal, slasher, thriller or anything! Just need good recs :) ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li7481/what_is_the_best_canadian_netflix_horror_movie/"
    },
    {
        "id": "1lialrd",
        "author": "Romipro",
        "title": "13 reasons why deserved better",
        "content": "Been noticing in the recommended series to watch in this sub that no one really talks about some really good gems that are so good and people or just forget about them or what. Is it just me? For example “13 reasons why” sush a good series. Of it was popular at the time but should it continue as new member join Netflix.",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lialrd/13_reasons_why_deserved_better/"
    },
    {
        "id": "1li9a9k",
        "author": "New_Opportunity_742",
        "title": "Is there any size chart for the products in the Shop?",
        "content": "So, just as the title says. \n\nI just found out there is a shop and that is has some merch that I want, but none of the products have a size chart and I’m freaking out thinking that if I buy one its going to arrive in the wrong size. I'm not from the US so, even if the shop offered the possibility to change it after I would not be able to do it. Soo, help pls???\n\nEnglish is not my first language so sry if I made a mistake.\n\nPD: Here are the links to the items, if it helps somehow: \n\n[https://www.netflix.shop/en-ar/collections/avatar-the-last-airbender/products/avatar-the-last-airbender-fire-nation-wide-leg-pants?variant=43556908007471](https://www.netflix.shop/en-ar/collections/avatar-the-last-airbender/products/avatar-the-last-airbender-fire-nation-wide-leg-pants?variant=43556908007471)\n\n[https://www.netflix.shop/en-ar/collections/avatar-the-last-airbender/products/avatar-the-last-airbender-water-tribe-wide-leg-pants](https://www.netflix.shop/en-ar/collections/avatar-the-last-airbender/products/avatar-the-last-airbender-water-tribe-wide-leg-pants)\n\n[https://www.netflix.shop/en-ar/collections/k-pop-demon-hunters/products/k-pop-demon-hunters-huntrix-oversized-faded-t-shirt?variant=43856807198767](https://www.netflix.shop/en-ar/collections/k-pop-demon-hunters/products/k-pop-demon-hunters-huntrix-oversized-faded-t-shirt?variant=43856807198767)",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li9a9k/is_there_any_size_chart_for_the_products_in_the/"
    },
    {
        "id": "1li8zj4",
        "author": "Comprehensive-Gate37",
        "title": "Kpop Demon Hunters SONG HELP",
        "content": "While listening to the song 'What It Sounds Like' in the movie game *Kpop Demon Hunters*, I noticed that it left some words in the back of my throat like the song sounds like another pop song. PLEASE SOMEONE listen to 'What It Sounds Like' and the part is 37 seconds to 48 seconds. I CANT PUT MY FINGER ON IT. IT'S KILLING ME! ;-;",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li8zj4/kpop_demon_hunters_song_help/"
    },
    {
        "id": "1li4g0a",
        "author": "lendmeflight",
        "title": "How is this possible?",
        "content": "I’m sure I’m the idiot in this scenario and I’m prepared to accept that but I cannot think of a reason this could happen\n\nHere is the scenario. \n\nI am in the United States and my friend, also in the United States but a different time zone, has a different movie selection than I do. \n\nHow is this possible?",
        "upvotes": 2,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1li4g0a/how_is_this_possible/"
    },
    {
        "id": "1li3rh4",
        "author": "17pounder",
        "title": "Language options not available?",
        "content": "I’m trying to watch ATLA in Polish, as I know the story and broad dialogue for immersion. I know that a Polish dub of the show exists and should be on Netflix. But changing my audio/language settings and location don’t appear to work, the only offer language is English. Is there a way to access the Polish version? I’m thinking to use this for a couple languages.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li3rh4/language_options_not_available/"
    },
    {
        "id": "1lhlw9e",
        "author": "NoCrew_Remote",
        "title": "Lockwood &amp; Co Cancelled [RANT]",
        "content": "Lockwood and Co got canceled after just 8 episodes. I don’t care what anyone says, that’s not a full season. That’s one third of a season. It barely had time to breathe before Netflix pulled the plug.\n\nThis is exactly why people are losing faith in Netflix. You finally make something with original IP, solid cast, great atmosphere, smart writing, and instead of giving it time to grow, you kill it off faster than a ghost hunt in episode one.\n\nMeanwhile, the most mind-numbing reality shows get renewed before the first season even finishes airing. Why? Because they’re cheap and easy and someone in a boardroom thinks short-term numbers matter more than actual storytelling.\n\nPeople keep asking why fans don’t get invested anymore. This is why. You give us something promising, with real potential, then yank it away like it never mattered.\n\nLockwood and Co deserved better. The actors deserved better. And honestly, the fans who actually stuck around and told people to watch it deserved better too.\n\nSo yeah, maybe it didn’t bring in Stranger Things numbers overnight, but maybe if you let your shows breathe instead of canceling everything that isn’t a viral hit in 24 hours, you’d have more to show for it.\n\nNetflix is out here ghosting its own content. Fitting for a ghost hunting show, I guess.",
        "upvotes": 12,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1lhlw9e/lockwood_co_cancelled_rant/"
    },
    {
        "id": "1lho628",
        "author": "Round-Refrigerator99",
        "title": "I need a sequel to Kpop Demon Hunters NOW",
        "content": "That movie was so amazing it should've been playing in theaters. It's been a while since I saw a good Netflix film. People were not lying when they said it was a 10/10. The songs were amazing as well and I loved the characters",
        "upvotes": 6,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lho628/i_need_a_sequel_to_kpop_demon_hunters_now/"
    },
    {
        "id": "1li29u2",
        "author": "StoicSloth5",
        "title": "K-pop demon hunters jammies",
        "content": "Does anybody know where I could get polar bear jammies like the ones Mira wears in the movie? They look super cute and I wanna wear them. Am I gonna have to sew them myself or do they exist somewhere?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li29u2/kpop_demon_hunters_jammies/"
    },
    {
        "id": "1li25ov",
        "author": "MoonMonster55",
        "title": "Somewhere Between is a pretty good show",
        "content": "I thought the show had a pretty good story even if it was hard to follow at times. The acting was... Not good at times. Especially the lead actress moving around so much, but I don't have any critiques for anyone else. The dialogue was a bit cringe but it's 2017.\n\nI wish TV shows had epilogues or aftermath or something. Like what happened to Ruskin? Did he die with no consequences? Anything about the police? Was Cupcake really the only compromised one? Did Serena just get over her dad dying and Nico being her step dad? The DA was shot in the head and nbgaf? Logan, his brother and the governor's wife crash a plane and we can't see the aftermath? I know they live happily ever after, with a picnic in the forest they all almost died in but come on. \n\nEDIT: I know the whole fate thing, somebody had to die for one to live but HELLA people died. Logan said he'd kill himself before facing consequences, and he gets to die. Danny loses 10 years of his life, but Logan can't spend 1 day in a cell? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1li25ov/somewhere_between_is_a_pretty_good_show/"
    },
    {
        "id": "1li20c4",
        "author": "Jay_Jaxxson",
        "title": "What do Pogues and Kooks do for fun?",
        "content": "I'm planning a trip to Charleston and during my time there I want to visit some of the OBX film locations. \n\nI think it would be cool for the first day to do things around the area that Pogues would do such as boating, fishing, and maybe bar-hopping 🤔 \n\nOn the second day, I was thinking about doing things Kooks would do, like shopping downtown, golfing, and possibly scuba diving.\n\nWhat are all the things that Pogues and Kooks do for fun throughout the Outer Banks series, based on your memory?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li20c4/what_do_pogues_and_kooks_do_for_fun/"
    },
    {
        "id": "1li5r0e",
        "author": "South_Break6321",
        "title": "Why I think K-pop Demon Hunters could have been soooo much better",
        "content": "I think there was so much potential but they honestly fumbled so bad. at first I thought i really liked it but the more i think about it, the more i feel like i just liked the idea of it. The animation and music was awesome but i feel like it was rushed and it didn't have as much of an impact as it could have. And don't get me wrong it was still good and enjoyable but i think it genuinly had the potential to be like insanly perfectly awesome.\n\nMy reasons and how they could have fixed it:\n\n1.) The rest of the Saja boys had literally no personality, its unrealistic that Jinu was the only demon with a backstory and personality. It would have been so much more fun to see and connect to all the boys, i wanted to love them but they were practically background characters. It would have been a lot more emotional to see them die if they had actually seemed like real people who had emotions, instead of just zombies.\n\n2.) Rumi and Jinu's romance thingy was so weird and the chemistry was definetly there but we saw so little of it. Again it just felt rushed, they barely met and then all of a sudden they were singing some love song about how being with each other was so freeing and how no one else sees them like they do. I can't imagine who's dumb idea it was to take out the aquarium date and kiss, it wouldn't have fixed everything but they seriously needed a few more quite romantic moments.\n\n3.) Rumi's reaction after Jinu's death seemed so like unemotional. Like she was more upset when she found out that Juni had betrayed her than when he literally died to save her. She shed like 3 individual tears and then started smiling and hugging her friends. That scene honestly ruined everything that they had for me, because it made it seem like she didn't care. The emotion before he died, was fairly on point but after he died it just seemed to completely ignore the fact that the boy who she supposedly loved had just died. I mean I've lost people I love before and it has taken months if not years to heal, and they hadn't even died they just left me.\n\n4.)The actual villain (whats his face, the fire dude) was just sooo boring, like he had no personality the fire persona was eh, honestly pretty bad. It wasn't scary and it wasn't unique or iconic. I mean i looveee a good iconic villain, just a good character design will take it a long way. I mean, take HTTYD as an example, Drago, Grimmel, and even Viggo, they all had unique character design and complex personalities. And i think there would have been soooo many possibilities to make the demon lord dude have an epic design, like hes a demon lord they did awesome with Jinus demon design i don't know why they started slacking off with the fire dude.\n\n5.) Why did Jinu and the other boy band member look and act differently than all the other demons? I feel like all the other demons were literally just ugly zombies who couldn't talk and then you have Jinu who isn't said to have anything special about him whos hawt and talks quite a lot and is capable of emotion. It's inconsistent and it feels lazy.\n\n6.) Mystery and Romance's hair to face proportion bothered me, like why is their head so big? Idk I didn't like it.\n\n7.) Also why could the Saja boys hide their marks but Rumi couldn't?\n\nI have a lot more i could say and suggestions on how they could have made it better but i've already written a lot and doubt anyone will even read this much. Anyways i think we were robbed of a really amazing, complex story that would have been much better as a series than it was a movie. So if netflix actual reads these and needs help making the next movie amazing, because there is going to be another movie obviously, then like ask for a few teenager to read the script, look at the character designs, and watch it before you release it. Try to find some that are really judgy and good writers, Ao3 is a great place to find em, i also volunteer.\n\nAlso was i the only person who was reminded of Zuko and Katara by Jinu and Rumi?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li5r0e/why_i_think_kpop_demon_hunters_could_have_been/"
    },
    {
        "id": "1li156r",
        "author": "Mindless-Nothing-109",
        "title": "Epic × Kpop Demon Hunters",
        "content": "Everytime I listened to GOLDEN, I always wondered why does it sound so familiar? I saw some people comparing it to \"I AM\" By IVE and I see the similarities! But the part that goes \"I'm done hidin, now im shining...\" always itched my brain because it sounded soooo familiar to something! And then yesterday my brain decided to sing this wherever that part comes up: \" Aphrodite, Can you guide me?\". ...It was this!! This is what sounded so similar!  For those who might not know its one of the cut songs Jorge made in Epic.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1li156r/epic_kpop_demon_hunters/"
    },
    {
        "id": "1lhzpcg",
        "author": "OutlandishnessSea258",
        "title": "English subtitle disappeared all of a sudden",
        "content": "I’ve been watching Reply 1988 and have always used the English subtitles. It was there last weekend but when I checked yesterday the English subtitles were. Same with the previous and future episodes. Has anybody experienced this before? I tried closing the app but no luck.",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lhzpcg/english_subtitle_disappeared_all_of_a_sudden/"
    },
    {
        "id": "1lhj0fp",
        "author": "No-Opportunity-8964",
        "title": "KPop Demon Hunters could have worked as a Mini-Series",
        "content": "Yeah after watching the movie... I love it to bits! The music, the characters, I could instantly rewatch it again :D \n\nBut it also felt rushed. There is so much plot potential, but it seemed like they didn't really had the time to go in depth with the different characters.. \n\nWhile the Movie was good, I think it would have been better as a mini series, like with 5-6 Episodes. To give those deep plots more screentime.\n\nActually when I first heared about it I thought it would become an Anime like Series. \n\nWhat do you guys think? ",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lhj0fp/kpop_demon_hunters_could_have_worked_as_a/"
    },
    {
        "id": "1lhvol3",
        "author": "NothingIsACoolHand",
        "title": "The Cast Of 'Sirens' On The Themes Of Class, Power, And Sisterhood",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lhvol3/the_cast_of_sirens_on_the_themes_of_class_power/"
    },
    {
        "id": "1lhvgwd",
        "author": "_issio",
        "title": "Olympo pissed me off... a lot",
        "content": "In itself the series is “good” (a Spanish version of Tiny Pretty Liars), but it pissed me off. It's eight chapters of stress because the characters are softer than bread.\n\nAmaia is cast as the bad guy and I spent seven chapters wanting to pull my hair out because they were all more blind than a drunk at a party, and then in the eighth chapter they give you the typical “she does something bad because her mother is pressuring her” to make it seem like she has depth and that everything is rolling because the series is already over. Zoe doesn't understand shit, Roque even less and Cristian sucks.\n\nOlympo is almost a Russian mafia, when it's a copy of Adidas. The three enlightened Olympo think they are mafia bosses when you can see eighty kilometers away that they are scumbags, and the viewer knows it and has to see how all the characters wonder “what's going on”. Hell, we all know it except the main characters. It's a fucking tracksuit brand, not a multimillionaire company that's getting its ass licked so much (yes, I know that in real life sponsorships are key, but it's not that bad).\n\nThe performances themselves are decent (the best for me is Clara, she comes with experience and I'm glad she didn't stick with what she did in Through My Window), the cinematography is perfect and the soundtrack is meh. You can tell they tried to make another Élite and let's see how it turns out.\n\n",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lhvgwd/olympo_pissed_me_off_a_lot/"
    },
    {
        "id": "1li64wd",
        "author": "Hopeful-Attempt-6016",
        "title": "I enjoyed KPOP Demon Hunters, but it also made me realize the numbness of the society on male sexualization.",
        "content": "For example, one of the character's name was literally abs, and he signed his signatures on his abs too. That was literally just about all the special thing he had to show in the movie. If this was the other way around, and a female character was named whatever physical factor that women have more than men(example: boobs) and signed their signatures on that body part, a lot of people will certainly have talked about it by now. This also made me remember a scene in Spider Man(can't remember the movie's specific name) where Peter was forced to be nude in front of an old woman. And he was a minor!\n\nI don't really think that having male characters being like that in the movie was a bad thing, but I feel like society is just either more numb on these things for male, or too sensitive for female's sexualization.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1li64wd/i_enjoyed_kpop_demon_hunters_but_it_also_made_me/"
    },
    {
        "id": "1lhef2v",
        "author": "Creative-Ad-1363",
        "title": "Sweet Bobby",
        "content": "I'm re-watching Sweet Bobby and I'm still as shocked as the first time seeing it.\n\nWhat I'm seeing in the show this time around is how Kirat fell into an unverified fantasy so easily. We live in a romance obsessed culture, and some people will ignore hard facts and red flags to claim a relationship. Our obsession with romance is what makes women such easy victims to predatory personalities. \n\nMy hope is for women especially in marriage obsessed cultures, is to wake up and realize they're more worthy endeavors in life. It's so silly and I'm just so sooo sad for women like Kirat who are stigmatized for being single, and through their desperation are easily fooled.",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lhef2v/sweet_bobby/"
    }
]