[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 492,
        "comments": 270,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 10,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1j44a6s",
        "author": "Pogrebnik",
        "title": "Millie Bobby Brown Confirms 'Enola Holmes 3' Filming Start Window",
        "content": "",
        "upvotes": 29,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1j44a6s/millie_bobby_brown_confirms_enola_holmes_3/"
    },
    {
        "id": "1j3y8l9",
        "author": "AnagnorisisForMe",
        "title": "With Love Meghan thoughts...",
        "content": "Posting this with great trepidation as I am not a bot (and I'm really hoping I have enough karma points after all the downvotes that I don't get kicked off Reddit). I think there are good parts of the With Love Meghan series. The episode with Roy Choi is in particularly good as the Korean sauces and cooking techniques are interesting as is his brining technique. The series is not exactly Carl Sagan, but that it is not what the intention is. If you want light background entertainment, give With Love Meghan a chance.",
        "upvotes": 97,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1j3y8l9/with_love_meghan_thoughts/"
    },
    {
        "id": "1j3z2f4",
        "author": "S4v1r1enCh0r4k",
        "title": "Ezra Edelman Slams Netflix for Scrapping His 9-Hour Prince Documentary. Says that Netflix and Prince's estate won't release it since it could \"do generational harm to Prince\"",
        "content": "",
        "upvotes": 39,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1j3z2f4/ezra_edelman_slams_netflix_for_scrapping_his/"
    },
    {
        "id": "1j41axh",
        "author": "Robemilak",
        "title": "'Bullet Train Explosion' Gets a Teaser Trailer, Releasing April 23",
        "content": "",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j41axh/bullet_train_explosion_gets_a_teaser_trailer/"
    },
    {
        "id": "1j3hzk7",
        "author": "Neat_Panda9617",
        "title": "I HIGHLY recommend Toxic Town!",
        "content": "Typical British production with incredible actors, well-written script, and compelling story. Thought it might be too much of a bummer but then I saw who was in it and gave it a shot. Watched all four episodes yesterday and stood up cheering when it ended.",
        "upvotes": 139,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1j3hzk7/i_highly_recommend_toxic_town/"
    },
    {
        "id": "1j3r39q",
        "author": "No_Culture7573",
        "title": "STILL not over this…",
        "content": "Is anyone else still salty about the ANNE WITH AN E cancellation ordered “jointly” by CBC and Netflix in 2019 just ahead to its season 3 premiere? I have never seen such fierce retaliation and clap back from a fanbase after a series cancelation ever, with a change.org petition reading 1.5 MILLION signatures. Hello CBC and Netflix executives???? Still also salty about Netflix saving Manifest for 2 more seasons despide being originally cancelled. Who even asked for that? 😂 ",
        "upvotes": 34,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1j3r39q/still_not_over_this/"
    },
    {
        "id": "1j3n6kb",
        "author": "ECO_FRIENDLY_BOT",
        "title": "American Primeval",
        "content": "Really enjoyed this latest Western from Netflix which was surprisingly good and was up there with Godless in terms of quality. It's a pity they didn't make it 8 episodes as it's a very interesting period in American history especially the evolution of the Mormons and their bloody past. The cast was excellent especially rhe always reliable Betty Gilpin and Taylor Kitsch who is good in most things despite some of the hate he gets from critics. Shea Whigham is impressive as always and must be one of the best character actors working today. Also nice performance from Dane Dehaan who always delivers a memorable performance and really should be a bigger name in Hollywood. A quality show that stands out amongst all the rubbish on Netflix.",
        "upvotes": 40,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j3n6kb/american_primeval/"
    },
    {
        "id": "1j43viw",
        "author": "Atlast_2091",
        "title": "How to Sell Drugs Online (Fast): The Final Season | Official Trailer",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j43viw/how_to_sell_drugs_online_fast_the_final_season/"
    },
    {
        "id": "1j432e2",
        "author": "skidmarks731",
        "title": "Where did the download button go?",
        "content": "I usually watch content on my phone on my train ride in. The typical \"my Netflix\" does not have my downloaded content anymore and there's no more icons for downloading any show or movies. Did something happen? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j432e2/where_did_the_download_button_go/"
    },
    {
        "id": "1j47eaj",
        "author": "luvlils",
        "title": "Shows not showing up",
        "content": "Is anyone else experiencing shows are not showing up on my tv for Netflix where im not able to see gossip girl for example it shows as remind me but when I go into the app its there for me to watch. Its the same with switching profiles everything is there except for the shows on my profile",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j47eaj/shows_not_showing_up/"
    },
    {
        "id": "1j436b2",
        "author": "flydaychinatown1",
        "title": "Specific movie only available in HD on phone?",
        "content": "Im watching Netflix via the app on desktop and im able the watch shows/movies in HD except one which im able to get in HD on my phone but I want to watch it in HD on desktop. Any solution?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j436b2/specific_movie_only_available_in_hd_on_phone/"
    },
    {
        "id": "1j3xaww",
        "author": "AllisonBurgers_O",
        "title": "Guysss , Never Have I ever / Emily in Paris / Ginny and Georgia .. Which one would you recommend other than the two .",
        "content": "I just wanna chill in-between by Studies tbh .\nIf I kept studying I'd be drained .So which one of these is better to Relax and Enjoy at the same time ? Any Suggestions appreciated 👏 ❤️ !!!",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1j3xaww/guysss_never_have_i_ever_emily_in_paris_ginny_and/"
    },
    {
        "id": "1j41kd4",
        "author": "HisztisMyrtle",
        "title": "How to access a movie available only in one country?",
        "content": "Hi All,\n\nI have Netflix in Poland, and now I travelled to Hungary for a short time. I can access my Netflix, but I think it's the same selection as back in PL. The point is, in Hungary, there should be a certain movie available on Netflix (and only here) but it's not coming up for me, even though my current IP is obviously Hungary. Is there a way to somehow access this movie? I thought the selection updates based on your IP, but apparently not? Is this another EU regulation?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j41kd4/how_to_access_a_movie_available_only_in_one/"
    },
    {
        "id": "1j45gzh",
        "author": "ellie_gina",
        "title": "The reviews for With Love, Meghan are in and it's getting slated",
        "content": "",
        "upvotes": 0,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1j45gzh/the_reviews_for_with_love_meghan_are_in_and_its/"
    },
    {
        "id": "1j3gdch",
        "author": "SpecialistWeb8987",
        "title": "Wtaf does Netflix think by labeling this as fit for 6yo?",
        "content": "",
        "upvotes": 22,
        "comments": 23,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8p3gbhvukpme1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1j3gdch/wtaf_does_netflix_think_by_labeling_this_as_fit/"
    },
    {
        "id": "1j3zoh8",
        "author": "heachx",
        "title": "Movies/shows with jungle adventures",
        "content": "Please recommend movies/shows like Jumanji, Lara Croft, Uncharted, Indiana Jones, The Lost City.\n\nBasically everything with treasure hunt, jungles, action, comedy that is available on netflix. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3zoh8/moviesshows_with_jungle_adventures/"
    },
    {
        "id": "1j3mupv",
        "author": "zachteria",
        "title": "Any similar shows to Toxic Town?",
        "content": "I watched Toxic Town yesterday and it was really good, any other dramas based on actual corruption/issues? Like Toxic Town or Three Girls (BBC) Preferably British too.",
        "upvotes": 9,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1j3mupv/any_similar_shows_to_toxic_town/"
    },
    {
        "id": "1j3s9hj",
        "author": "dAlembertFula",
        "title": "Running Point Connections",
        "content": "Has anyone watched 'Running Point' on Netflix and 'How to Lose a Guy in 10 Days'. Both starring Kate Hudson. I just finished 'Running Point' and there are SO many similarities (in terms of plot points/activities) to 'How to Lose a Guy in 10 Days'. First, the basketball. Like 40% of 'How to Lose a Guy in 10 Days' is spent watching basketball/at the basketball game, where the colors are similar to those in 'Running Point'. Second, the 'Game 7' importance. I'm not a basketball nerd, so that term has no importance to me, but it was a key piece in both movie and show. \n\nI had 2 more points that I forgot, so I'll edit it later when I remember, but if anyone has found more similarities, please tell. They were written by different people, so that can't be why. I was wondering if 'Running Point' was supposed to be this homage to 'How to Lose a Guy in 10 Days.'",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3s9hj/running_point_connections/"
    },
    {
        "id": "1j34j3w",
        "author": "Independent-Dark-910",
        "title": "Just lost my account",
        "content": "Hey everyone, I need to vent about something wild that just happened. I went to fire up Netflix on my TV last night, only to see my account was signed out. Weird, right? I figured it was a glitch, so I tried logging back in—bam, denied. Okay, no biggie, I’ll reset my password. Except when I tried, Netflix hit me with “no account exists” for my email. This is an account I’ve had for over five years.\n\nAt this point, I’m thinking, “Oh great, I’ve been hacked.” So I call Netflix support to sort it out. I’m assuming five years of payment history tied to my card, watch history, all that jazz would make it obvious I’m the real owner. The rep I talked to was nice enough—she even admitted she could see the new email on the account looked fraudulent (some random string of letters and numbers). But then she drops the bomb: there’s nothing she can do. Apparently, because the email got changed, I’m locked out for good unless I want the whole account wiped. Years of watchlists, recommendations, and profiles? Gone.\n\nLuckily, my Netflix password was unique, so this won’t spiral into other accounts getting compromised. Still, it stings to lose it like that. I’m just baffled they couldn’t verify me with all the data they have—payment records, IP addresses, something! The only option they gave was to nuke the account and start fresh. I get that security protocols exist for a reason, but this feels like punishing the victim instead of the hacker.\n\nHas anyone else dealt with this? Did I miss some secret way to reclaim it? Or am I just stuck rebuilding my Netflix life from scratch?",
        "upvotes": 133,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1j34j3w/just_lost_my_account/"
    },
    {
        "id": "1j3kqzd",
        "author": "Internal-Bed-3150",
        "title": "Netflix is making a vampire show based on a popular horror podcast",
        "content": "",
        "upvotes": 8,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1j3kqzd/netflix_is_making_a_vampire_show_based_on_a/"
    },
    {
        "id": "1j3uezs",
        "author": "nodakskip",
        "title": "Questions on adding an extra account.",
        "content": "Ok for years I have used my moms netflix (she knew) and we live in the same city. After netflix cracked down on that my devices like Roku said I could not log in since I was not at the registered home address. Thats fine. My pc netflix still let me log in. Now that no longer works either. I was thinking of getting my own netflix account, but wanted to ask about the new thing to add a second account to her existing account where I can register at my home. \n\nMy questions are...\n\n1. Is there any real benifit money saving wise if I have an extra account under her?\n\n2. I would pay for my own, but wondering if it would make her pay for my new account if I made one under her? Can I use my own cc card or paypal?\n\n3. Does netflix servers still screw up when its an extra account under someone else? Does it still want me in the same address?\n\nIf I get my own, that is fine. I just wanted to ask first.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1j3uezs/questions_on_adding_an_extra_account/"
    },
    {
        "id": "1j3ergl",
        "author": "ImpossiblePeak1722",
        "title": "With love, Megan",
        "content": "I can't seem to ignore, but the energy between Michael and Meghan in the kitchen is just off. Why she does not maintain eye contact, she keeps looking down while talking.",
        "upvotes": 14,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1j3ergl/with_love_megan/"
    },
    {
        "id": "1j42bf3",
        "author": "Aimzyrulez",
        "title": "Netflix saying not part of home network but the device definitely is?",
        "content": "So my partner went to watch Netflix on his PC and got a \"This device isn't part of your Netflix household\" other than his phone this is the only thing he's ever watched Netflix on, it's all within his home on his home network. Neither of us understand how the hell this has happened. How do we fix it? We don't have access to a TV to go the route that Netflix recommends.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1j42bf3/netflix_saying_not_part_of_home_network_but_the/"
    },
    {
        "id": "1j3ibfy",
        "author": "AggressiveDrinker",
        "title": "Rachel Weisz To Star In ‘Vladimir’ Limited Series Ordered By Netflix. 20th Television is the studio.",
        "content": "",
        "upvotes": 11,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3ibfy/rachel_weisz_to_star_in_vladimir_limited_series/"
    },
    {
        "id": "1j31tc7",
        "author": "Certain_Passion1630",
        "title": "Why did Suits get so much more hype than White Collar?",
        "content": "Maybe this is a popular take I wasn’t aware of, but I started watching Suits 1-2 years ago when it seemed like everyone was talking about it. \n\nI just finished season 1 of White Collar, and all the character dynamics are basically the same: the genius criminal (Neal and Mike), the experienced mentor (Peter and Harvey), the quirky ally (Moz and Louis), and the smart woman behind the scenes keeping everyone levelheaded (Elizabeth and Donna). \n\nThen I looked and White Collar came out 2 years before Suits. I don’t know how popular the shows were when they first aired, but Suits was in the Netflix top 10 for weeks and I just happened to see White Collar one day while scrolling through shows. ",
        "upvotes": 117,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1j31tc7/why_did_suits_get_so_much_more_hype_than_white/"
    },
    {
        "id": "1j3urma",
        "author": "Eccentric1286",
        "title": "How to stop autoplay spoiling WWE events in progress/afterwards?",
        "content": "When clicking on a WWE live event either during or after its aired, as soon as I launch the item, the page loads with the cursor in the middle or the end of the event.   \nThis spoils the event.   \nI like autoplay for non-WWE tv shows.  \nBut for WWE, I want the page to load paused without it auto-playing at its live point/end credits.  \nHow can I do this?  \n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3urma/how_to_stop_autoplay_spoiling_wwe_events_in/"
    },
    {
        "id": "1j3e25m",
        "author": "Sudden_Pop_2279",
        "title": "Jurassic World Chaos Theory Season 3 Gets April 2025 Release Date on Netflix; Know When and How to Watch",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1j3e25m/jurassic_world_chaos_theory_season_3_gets_april/"
    },
    {
        "id": "1j3tx3q",
        "author": "Curious-Ad-966",
        "title": "Give me show recommendations",
        "content": "My top 10 ( I like long shows)\n\nBridgeton \n2. Gossip girl\n3. Grey's anatomy \n4. The vampire diaries\n5. Emily in Paris \n6. Riverdale \n7. The originals\n8. Hart of Dixie\n9. New girl\n10. How I met your mother",
        "upvotes": 0,
        "comments": 33,
        "media": null,
        "permalink": "/r/netflix/comments/1j3tx3q/give_me_show_recommendations/"
    },
    {
        "id": "1j3z0wt",
        "author": "Makiyage",
        "title": "With Love, Meghan 😭🌹🍷",
        "content": "In a time where people struggle to figure out what the heck to cook and how to view food, Meghan pulled out very real, healthy, and delicious meal ideas. Being American, I appreciated the different ethnic recipes she brought to her show instead of sticking to one specific type of cuisine. This was relatable!!! I cook Mediterranean, Korean, Turkish, French and Mexican cuisine. I alternate and have been on my own food journey as well.\n\nLike Megan, I’m comfortable in the kitchen so I could tell by little things she would do or say, she too is quite comfortable in the kitchen. I believe with all my heart she is genuine when she says she loves cooking for her kids as much as she can and hosting. I love the fact that she mentions her humble beginnings like eating Jack in the Box when she was younger and that she truly is blessed to have a garden of her own. \n\nIt was a lot more relatable than I would imagine for someone who isn’t rich like her. It’s easy to go to the local grocery store and cook her meals on a budget. She gave amazing tips for helping your kids see food in a healthy and appetizing light. My husband was so into the show as well he stopped what he was doing and couldn’t help but pay attention and engaging with the show. \n\nI BAWLED when I found out Guy passed away. RIP Guy ♥️ he was the cutest thing ever. \n\nI hope to see more series. I was so tempted to rewatch it. I probably will again. It gave me so many ideas and I appreciate Megan’s way of leveling down certain things so that everyone in a lower tax bracket can participate and take so much away from what she was sharing. So beautiful 🫶🫶🫶",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1j3z0wt/with_love_meghan/"
    },
    {
        "id": "1j2ot14",
        "author": "FuturismDotCom",
        "title": "Netflix Is Using AI Upscaling on a 1980s Sitcom and the Results Are Horrific",
        "content": "",
        "upvotes": 343,
        "comments": 49,
        "media": null,
        "permalink": "/r/netflix/comments/1j2ot14/netflix_is_using_ai_upscaling_on_a_1980s_sitcom/"
    }
]