[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 504,
        "comments": 276,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 21,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1k3wirp",
        "author": "Hopeful-Bee-4030",
        "title": "Million Dollar Secret on Netflix",
        "content": "SPOILER (season 1) \n\nIt hurts to see Kyle leave because of how much he truly needed the money and how fair he played the game. Cara was definitely threaten by him but honestly, that makes respect them both so much more for how smart they are playing the game, compared to other players like Jaimi and Sydnee (who irritated me the whole time). I want to know others’ thoughts and opinions about these specific players or even other players as a whole. ",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k3wirp/million_dollar_secret_on_netflix/"
    },
    {
        "id": "1k3elg5",
        "author": "user_promedio",
        "title": "Recommend very good Netflix series",
        "content": "I've already watched Better Call Saul, Dexter, Dark, and a few other series, and now I don't know what to watch. I'm anxiously waiting for the fifth and final season of YOU, and in the meantime, I'll start watching Ozark. But when I say good series, I mean really good.\n\nEdit:\nI'm open to anime, two of my favorites are Death Note and Monster",
        "upvotes": 174,
        "comments": 298,
        "media": null,
        "permalink": "/r/netflix/comments/1k3elg5/recommend_very_good_netflix_series/"
    },
    {
        "id": "1k41hyl",
        "author": "Nukesnipe",
        "title": "How do I force Netflix to play in HD on desktop in 2025?",
        "content": "I've tried Chrome, Firefox, Edge and the Windows app, and all of them are stuck at 540p.  My download speed is like 300 mbps, every other streaming service else can do 1080p or better with no problem.  I read that Chrome and Firefox won't do more than 720p, but even that would be an improvement to what I'm getting!\n\nI've gone through all the Netflix settings, it's supposed to only play highest quality.  None of the other threads and posts I can find still work.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k41hyl/how_do_i_force_netflix_to_play_in_hd_on_desktop/"
    },
    {
        "id": "1k41dbv",
        "author": "dailystar_news",
        "title": "TNA star Joe Hendry answers Randy Orton's WWE WrestleMania 41 challenge",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k41dbv/tna_star_joe_hendry_answers_randy_ortons_wwe/"
    },
    {
        "id": "1k37imf",
        "author": "Chance_Run3753",
        "title": "Why are some seasons backwards on shoes",
        "content": "",
        "upvotes": 134,
        "comments": 50,
        "media": null,
        "permalink": "/r/netflix/comments/1k37imf/why_are_some_seasons_backwards_on_shoes/"
    },
    {
        "id": "1k40wck",
        "author": "always_onward",
        "title": "Brightness problem",
        "content": "The brightness on my Netflix app when I watch on my Android phone keeps periodically dimming and then immediately brightening again. This seems to happen at random intervals as often as every few seconds. It makes it impossible to watch anything. Is this happening to anyone else? I cannot figure it out for the life of me.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k40wck/brightness_problem/"
    },
    {
        "id": "1k3zqmg",
        "author": "llinusnepomuk",
        "title": "Show doesn’t appear on safari browser",
        "content": "I noticed the show 1883 doesn’t appear on Netflix when I’m using Safari but does show up in the app and on chrome. Even when I search for the direct Netflix link in safari it only shows the shows page without any pictures or episodes. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k3zqmg/show_doesnt_appear_on_safari_browser/"
    },
    {
        "id": "1k3yswo",
        "author": "NathalieDelReyes",
        "title": "Con mum",
        "content": "So many people have been saying that Graham was only interested in his mum for the money. Am I the only person who thinks that’s not true?\nHaving grown up not knowing one of my parents, you literally cling onto that fantasy of them above anything else. I met up with mine several times hoping that he would somehow become that superhero I had in my mind. That image which you form over the years is so hard to lose, it feels like grief.\nSo whilst the other people definitely wanted Dionne for her perceived wealth, I don’t think Graham was one of them, nor Heather.\n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k3yswo/con_mum/"
    },
    {
        "id": "1k3vkpe",
        "author": "Fortunate-Zoo2831",
        "title": "Does netflix send the account holder a confirmation email if a pin lock is added to a profile?",
        "content": "My parents are the account holders and I think it's my father's email account. We all have separate profiles. I want to create a pin lock for my profile so they can't access it, but I don't want them to know right away that I've added the pin lock.\n\nIs a confirmation email sent when a pin lock is added?\n\nCan the account holder override pin locks?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k3vkpe/does_netflix_send_the_account_holder_a/"
    },
    {
        "id": "1k3e5hr",
        "author": "honeycomb1300",
        "title": "Million Dollar Secret Plot-hole?",
        "content": "SPOILER!! Tell me if I’m missing something here… when Cara got the box with the million dollars, Sam also got a clue. All the contestants knew there was 1 person getting a clue and 1 person getting the million that morning. Sam told Corey she got the clue, meaning she could not have gotten the million also. The box never moved again before the finale. So how did Corey not know it was Cara if it obviously wasn’t him and logically could not have been Sam? ",
        "upvotes": 13,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k3e5hr/million_dollar_secret_plothole/"
    },
    {
        "id": "1k41bvg",
        "author": "dailystar_news",
        "title": "Drew McIntyre takes mid-match WrestleMania 41 selfie as photo goes viral",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k41bvg/drew_mcintyre_takes_midmatch_wrestlemania_41/"
    },
    {
        "id": "1k3rci8",
        "author": "Trigger-ZZZ",
        "title": "Slow burn Period Drama recs?",
        "content": "Hello! I'm looking for Period dramas with a slower romance development.\nIdm any country of origin, I'll happily watch with subtitles.\n\nI really liked first season of Bridgerton so I'm looking for stuff similar to that, or Anne with an E where the romance is a subplot and takes a while. I've tried The Empress but they fall for eachother way too quickly. Bonus points if he falls first though! ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1k3rci8/slow_burn_period_drama_recs/"
    },
    {
        "id": "1k3xexd",
        "author": "VDA_Killjoy",
        "title": "PG Programs showing as G",
        "content": "We have noticed that titles such as “Babysitters Club” or “The Good Witch” will have the G rating on their main page but once you start an episode and the details fade - it will then say “PG - Mild themes”\n\nWe have a rule that our daughter can only watch G rated programs and she is great with following this but not being able to tell from the initial information makes it pretty difficult. \n\nYesterday she was watching a G rated show about gymnastics and one of the characters died and there was a funeral. It was a bit much for something advertised as “G-Rated”\n\nRant over. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k3xexd/pg_programs_showing_as_g/"
    },
    {
        "id": "1k2zvph",
        "author": "okaynowhat",
        "title": "How many of you just subscribe for a month, a few times a year?",
        "content": "I let my netflix subscription end last November. I'd always have the 4k plan through some deal, I believe the last year I had it through a verizon deal of like $140 bucks for the year with amc+. And I'd get something similar all previous years for the past like 5 years. But there have been zero deals this go around, and I'm now at a point where I'll be cancelling a couple other streaming services that are lacking or cheaper trials ending (i.e. apple 3 month trial). \n\nAnyway, the 4k plan is now $25 which is pretty insane to me. I did get a quality tv and sound system back in 2020 and am used to 4k on every other service. So I'm deciding if I want to do $25 a few months a year, or do $8/mo continuously for 1080p. Since netflix releases all episodes at once, it doesn't really create the weekly discussions the way a show like severance, last of us, white lotus, etc do. So I'm heavily leaning towards just subscribing for a month at $25, immediately cancel it so it ends that month, and rejoin when theres at least a few more new shows/seasons that actually appeal to me. Wondering how many other people just subscribe occassionally throughout the year. ",
        "upvotes": 55,
        "comments": 39,
        "media": null,
        "permalink": "/r/netflix/comments/1k2zvph/how_many_of_you_just_subscribe_for_a_month_a_few/"
    },
    {
        "id": "1k3qnrq",
        "author": "CookieBat666",
        "title": "Netflix app and TV too dark",
        "content": "Both on the mobile app and on my smart TV the screen is always too dark no matter what I do. How can I change it? Some shows are borderline unwatchable.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k3qnrq/netflix_app_and_tv_too_dark/"
    },
    {
        "id": "1k2urft",
        "author": "biascourt",
        "title": "Netflix will soon get a new design for its TV app",
        "content": "If the experiment gains traction, Netflix hopes to extend it to its broader audience over the coming months and quarters.",
        "upvotes": 69,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1k2urft/netflix_will_soon_get_a_new_design_for_its_tv_app/"
    },
    {
        "id": "1k3u4fl",
        "author": "radu_014",
        "title": "Just finished the mini-series \"Adolescence\" on Netflix",
        "content": "Hello, everyone! I want to review this series from my perspective. I felt shocked at the first episode, because it felt absolutely real, no act cuttings, just a camera filming the entire interactions... at some point it felt like it's boring to watch something so long from one perspective (don't blame me, i'm in gen z lol) but the subject is the most attractive thing that kept me watching. This series has rolled the effect of this masculine toxicity and it's a masterpiece because it's real and current. As Jamie said, when he was playing football and had a bad time, his dad didn't want to look him in the eye, so that I think he felt like he had no help and developped some defender conversațional behaviour (episode 3). An important lesson is that parents should be more involved in their children lives (ending of episode 4). Nothing can motivate what Jamie did, but he also lied about it! Jamie's parents thought that he can be safe when he is in his room. One of the most hard things that shocked me was the dad's suffering. He thought he failed as a parent and it's destroying him. As a future parent and husband, I want to raise my boy in order to respect women, protect them and not to make fun of them and not beating them! I am very curious to hear your thoughts guys! Thank you. 🙏",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k3u4fl/just_finished_the_miniseries_adolescence_on/"
    },
    {
        "id": "1k32315",
        "author": "Accomplished-Bug9930",
        "title": "On Netflix movie descriptions, not saying which country it is from if it is a foreign movie or show?",
        "content": "Recently I watched The Tailor. When I looked at the description on Netflix, it did not way what country it is from! It would be so nice if Netflix tells me (us) if it is a foreign movie and which country it is from! No?",
        "upvotes": 20,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1k32315/on_netflix_movie_descriptions_not_saying_which/"
    },
    {
        "id": "1k3gu5w",
        "author": "Zioticc",
        "title": "Behind the Scenes of FROM Freezing Temps Tireless Effort and Total Dedication",
        "content": "Not many people realize how brutal it was filming FROM. This short clip shows one of the cast members completely wiped out from shooting in freezing conditions. The whole team went through insane weather cold, wind, delays and still pulled through to deliver something amazing.\n\nIt’s easy to watch a show and forget how much work happens behind the scenes. But seeing moments like this reminds you just how much effort goes into making every scene perfect.\n\nBig respect to the cast ",
        "upvotes": 0,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/x9ni5l1yuxve1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1k3gu5w/behind_the_scenes_of_from_freezing_temps_tireless/"
    },
    {
        "id": "1k399ry",
        "author": "Meshynodes",
        "title": "Netflix, why can’t we pick our own video quality— and keep it that way?",
        "content": "I get that this is an unofficial sub, but honestly—how is manual resolution control still missing in 2025?\nWe’re paying subscribers, not freeloaders.\nYet, the moment bandwidth dips, your movie turns into a pixelated mess—and when it stabilizes, you have to hope that the app decides to bump the quality back up.\n\n\n“But there’s already a quality setting!”\nSure—under App Settings ➜ Video Playback you can choose (Good / Better / Best ) but those labels are just fuzzy bitrate targets—they don’t always guarantee 2160p.\n\nThey reset or get overridden by network “optimisation.”\n\nYou still can’t switch mid-stream.\n\nWe all lose under the current “trust us, we’ll auto‑select for you” approach.\n\nNetflix, if you’re listening: give us the basic checkbox that says, “Force 2160p” (or 1080p, or 480p—whatever we choose). Until then, we’re stuck paying premium prices for an experience that can drop to VHS quality without warning.\n\nWho else is tired of this?  ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k399ry/netflix_why_cant_we_pick_our_own_video_quality/"
    },
    {
        "id": "1k3xdxa",
        "author": "GoldAdhesiveness3369",
        "title": "can't believe THE PASSION iw on Netflix now",
        "content": "I know it's 20 years late, but we finally got it, i mean today is a special day cuz christ really rose and he gave us eternity, and watching the movie today gives a special vibe other than any other day, so what's ir thoughts??",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1k3xdxa/cant_believe_the_passion_iw_on_netflix_now/"
    },
    {
        "id": "1k3flhw",
        "author": "Kind-Crab-1564",
        "title": "Help me to fix this",
        "content": "Idk what happened ",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/9fs4dqd0gxve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1k3flhw/help_me_to_fix_this/"
    },
    {
        "id": "1k3i9gw",
        "author": "LONk_SLJr",
        "title": "What is going on with Netflix",
        "content": "I opened up Netflix today and one piece is gone, same with other shows I was watching, is something wrong with my Netflix or is it happening to anyone else ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1k3i9gw/what_is_going_on_with_netflix/"
    },
    {
        "id": "1k3h9cp",
        "author": "t4ctic4lbeef",
        "title": "Terrifying Glitch",
        "content": "hey guys, on my Netflix mobile app every time i try to full screen and go sideways this terrifying monkey with a clock in the background appears and if i try to exit out it starts yelling at me. i threw my phone in water so it would turn off then did the rice thing and it’s back on but i’m scared to go back on the app right now. i was trying to watch The Electric State. has anyone else had this glitch?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k3h9cp/terrifying_glitch/"
    },
    {
        "id": "1k2yehm",
        "author": "Dear_Event3099",
        "title": "Wasn’t Expecting Much From Netflix’s Devil May Cry",
        "content": "I went into the new Devil May Cry anime with low expectations. Let’s be real — video game adaptations rarely hit the mark, and Netflix has a mixed track record.\n\nBut this one? It actually kinda worked.\n\nI’m still iffy on a few things, but there’s some solid animation, the action feels like DMC, and surprisingly… they didn’t butcher Dante.\n\nI broke down my thoughts in this short review if you’re on the fence about watching.\n\nCurious if anyone else was expecting a mess but ended up enjoying it too?",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k2yehm/wasnt_expecting_much_from_netflixs_devil_may_cry/"
    },
    {
        "id": "1k3cx1h",
        "author": "Dull-Animal5299",
        "title": "Settings?",
        "content": "Recently I’ve noticed that when I open my tv settings while Netflix is playing, it pauses whatever show I am watching until the settings are closed. Any one have similar problems? Or is this a tv issue ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1k3cx1h/settings/"
    },
    {
        "id": "1k31p82",
        "author": "ProfessionalLife970",
        "title": "Why does Netflix automatically open on my TV at the same time every day?",
        "content": "No matter what other app (Prime, Disney) is on, Netflix opens up at 11:00 pm, everyday at the exact same time without any prompts, and doesn't close without me turning my TV on &amp; off.",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1k31p82/why_does_netflix_automatically_open_on_my_tv_at/"
    },
    {
        "id": "1k3k9kt",
        "author": "Top-Three-USA",
        "title": "Meghan Markle’s Canceled Netflix Project \"Pearl\" Sparks Plagiarism Claims from British Author",
        "content": "",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1k3k9kt/meghan_markles_canceled_netflix_project_pearl/"
    },
    {
        "id": "1k36kr8",
        "author": "GameOverBibo",
        "title": "I got a problem",
        "content": "When I tap on the screen, the buttons (the play button, +10, etc) don't go away and nothing goes away except for the brightness thingy.\nCould somebody help me?",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vu185kbkyuve1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1k36kr8/i_got_a_problem/"
    },
    {
        "id": "1k2x1iy",
        "author": "Majestic-Factor9390",
        "title": "Secret menu for better quality streaming",
        "content": "Lately I’ve noticed the quality of Netflix streams going downhill even though I pay for highest tier.  I think I’ve found the solution \n\nLogin to Netflix in a browser and go to your profile settings and change it from auto to high.  They are sneaky…",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1k2x1iy/secret_menu_for_better_quality_streaming/"
    }
]