[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1oxh2pj",
        "author": "therealkingwilly",
        "title": "After 7 years as loyal Netflix customers, our account was permanently cancelled with no right of appeal.",
        "content": "\nMy family has been Netflix members since 2018. We live internationally, where I work in education. Like many expat families, we travel frequently - we’ve lived across multiple countries in Asia, Europe, Africa, and Oceania.\n\nLast week, my wife traveled overseas to care for her sick mother. Meanwhile, our children and I stayed home for school. We continued using Netflix on our various devices as we always have.\n\nNetflix’s automated system flagged this as “unusual activity” and permanently cancelled our account. When I contacted customer service, I was told:\n\n❌ There is no appeals process\n❌ There is no formal complaint procedure  \n❌ The decision cannot be reversed\n❌ Seven years of customer history means nothing\n\nThe representative literally said: “Once the system detected the issue, then there’s no option to recover it.”\n\nSo Netflix’s algorithm is judge, jury, and executioner. No human review. No consideration of our account history. No recognition that international families exist. No way to appeal an automated decision.\n\nThis isn’t fraud prevention - it’s punishing legitimate customers for living globally.\n\n@Netflix - Is this really how you treat long-term international subscribers? Where’s the humanity in your customer service?",
        "upvotes": 511,
        "comments": 160,
        "media": null,
        "permalink": "/r/netflix/comments/1oxh2pj/after_7_years_as_loyal_netflix_customers_our/"
    },
    {
        "id": "1oy8ryq",
        "author": "baggagefree2day",
        "title": "Beast in Me",
        "content": "SPOILERS)What does everybody think about this? I’m on the second or third episode and seriously there are so many inconsistencies. Niles has the most top notch security system in the world on his mansion, but an FBI agent can sneak in through a window that doesn’t trigger any alarms?. He has no cameras in his office?. He’s not notified when somebody tries to access his files?\nAnd I didn’t even think it was possible for anybody to just knock out a Belgian malinois. And what makes them not even consider the fact that the bodyguard is tapping her phone.",
        "upvotes": 9,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oy8ryq/beast_in_me/"
    },
    {
        "id": "1oy8xt1",
        "author": "nettspendfannn",
        "title": "This household update is terrible",
        "content": "I can't use Netflix anymore because my sister went to college and has Netflix set up there. So now its giving me this bs about not being part of the house hold. FIX THIS NETFLIX",
        "upvotes": 8,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oy8xt1/this_household_update_is_terrible/"
    },
    {
        "id": "1oxr666",
        "author": "Kendikay1966",
        "title": "Dept. Q",
        "content": "Anyone else watching??  The first episode I was ready to call in the chips.  Then the second…getting warmer.   I’m into the 7th episode…WOW!  It’s got me hooked!   The acting’s excellent and the story line keeps you guessing.   So good.   Highly recommend.   ",
        "upvotes": 51,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1oxr666/dept_q/"
    },
    {
        "id": "1oxirji",
        "author": "Short_Pin_6243",
        "title": "The Beast and Me is one of the best drama shows Netflix has put out in awhile *no spoilers*",
        "content": "*****The Beast In Me******* is the title\n\nNot going to get into specifics because it’s brand new and don’t want to ruin it for anyone else. \n\nBut there was a time when Netflix put out pretty good tv dramas yearly. That time has been replaced as of recent by some pretty big misses.\n\nEven the shows I can think of from this year like Untamed, Wayward, Waterfront, Hunting Wives, Black Rabbit etc are all lacking a lot. It feels like the only shows Netflix sometimes hit on are British dramas. \n\nSo if you are reluctant to check it out, don’t be. (In my opinion of course) ",
        "upvotes": 73,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1oxirji/the_beast_and_me_is_one_of_the_best_drama_shows/"
    },
    {
        "id": "1oxyx1x",
        "author": "rdv100",
        "title": "Physical Asia is one of my favorite shows now",
        "content": "The show is about six people representing six countries (I think there are six countries):\n\n* Australia\n* Korea\n* Japan\n* Australia\n* Mongolia\n* Thailand\n* Turkey\n\nThey fight with each other to show which country has the strongest people.\n\nIn this show, although it starts slow, there are so many neck-and-neck matches between different teams representing different countries in Asia. It's absolutely fascinating and amazing, and there were some that were truly mind-blowing to see the intensity and also some of the games where these underdogs beat these obvious leaders or at least who look like obvious leaders. \n\n  \nAnyway, I'm personally enjoying it. I encourage you to also check it out. Definitely, I think episodes 2 and 3 onwards it becomes very intense, so if things feel a little slow in the first episode, don't give up. I highly recommend it. \n\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxyx1x/physical_asia_is_one_of_my_favorite_shows_now/"
    },
    {
        "id": "1oy3ff6",
        "author": "frostybookworm",
        "title": "Shows like Squid Games and Alice in Borderland?",
        "content": "Looking for similar shows to watch. Or if you enjoyed these shows, what other shows would you recommend? I like survival games and win or die kind of shows. The hunger games is also a favourite of mine. Any ideas? Thanks ",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1oy3ff6/shows_like_squid_games_and_alice_in_borderland/"
    },
    {
        "id": "1oy69kg",
        "author": "AcanthocephalaOk8931",
        "title": "Please tell me some shows to watch?",
        "content": "I just finished money heist and that was PEAK it was so addictive that show I need something like that to watch. I tried watching peaky blinders but to be honest it isn’t that good.",
        "upvotes": 1,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1oy69kg/please_tell_me_some_shows_to_watch/"
    },
    {
        "id": "1oxscjt",
        "author": "redditgatorx",
        "title": "Hevelius Ferry Tragedy: How Bad Was the Storm Really?",
        "content": "https://youtu.be/_KhrXyMTll4?si=8Mp1XjedIt2cIkDz\n\nShort video about the newest Netflix's series about Hevelius from the perspective of a data scientist",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxscjt/hevelius_ferry_tragedy_how_bad_was_the_storm/"
    },
    {
        "id": "1oxwuwr",
        "author": "abhilash512",
        "title": "WWE 2K25 Netflix Edition Pre-Register &amp; Release Date Exclusive Update",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxwuwr/wwe_2k25_netflix_edition_preregister_release_date/"
    },
    {
        "id": "1oxok9s",
        "author": "lil-g4565",
        "title": "Strange glitch?",
        "content": "I'm not sure what's happening but anytime I click on a movie or TV show it's just instantly playing it. It won't take me to the \"home screen\" of said show or movie that shows the trailers seaons etc it just starts playing. I've tried searching instead to see if it's just the home screen part of netflix doing that but nope. Nothing's working I'm not sure how to fix it. ",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1oxok9s/strange_glitch/"
    },
    {
        "id": "1oxo1j0",
        "author": "TakesOneToKnowOne1",
        "title": "The Beast in Me — final scene",
        "content": "What is the final scene in the last ep of The Beast in Me meant to indicate? The one with Nina and the baby? Are we saying the baby is like Nile? Find that ridiculous because it’s literally just a baby.",
        "upvotes": 6,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1oxo1j0/the_beast_in_me_final_scene/"
    },
    {
        "id": "1oxz7p2",
        "author": "dcthegeek",
        "title": "The new TV interface is horrible",
        "content": "Can the updated interface on the Android/TV app be fixed...it is horrible.  I get the idea of conforming to most other streaming apps, but displaying all content in a single line to scroll through just doesn't work.  Some of us have many titles in our watchlists, and scrolling through them on a single line is annoying.  It would be much more usable to display them in a grid to make finding the wanted title faster and simpler.  Also, PLEASE add an option to sort the list (by title, date added, etc.).  This also makes the interface more user friendly.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oxz7p2/the_new_tv_interface_is_horrible/"
    },
    {
        "id": "1oxoa4d",
        "author": "TomDucq",
        "title": "Downloads not accesible?",
        "content": "I’m about to board a 11h flight and downloaded some shows and movies yesterday. When I tried to access them on my first flight i got an error that I was offline. \nI’m now connected to the internet and my downloads list is empty. \nWhen I go to the show itself it says the episode is downloaded but still the list is empty. \nI only get the message to activate smart download?\n\nAnyone else who experienced this issue?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oxoa4d/downloads_not_accesible/"
    },
    {
        "id": "1ox8qwr",
        "author": "yoggsmu",
        "title": "College football coach John Beam from ‘Last Chance U’ has died after being shot, Oakland police say",
        "content": "This is awful news… sounds like he was targeted, too. I enjoyed watching him on Last Chance U and thought he was a well-meaning coach who really cared about his kids. ",
        "upvotes": 19,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ox8qwr/college_football_coach_john_beam_from_last_chance/"
    },
    {
        "id": "1oxf4xp",
        "author": "phredo_71",
        "title": "No translations for sign language in Orphan Black: Echoes",
        "content": "Anybody else having an issue where sign language is not translated to text, even with subtitles turned on? It happens in episode 1 of Orphan Black: Echoes but I’m sure it’s happening elsewhere. ",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1oxf4xp/no_translations_for_sign_language_in_orphan_black/"
    },
    {
        "id": "1oxr3mf",
        "author": "Successful_Ask_2380",
        "title": "Has anyone had issues signing into Netflix with sky?",
        "content": "I had an account under my daughters email\nUsing my own email Netflix keeps trying to charge me to sign up even though the price is included in my my sky broadband subscription \n",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1oxr3mf/has_anyone_had_issues_signing_into_netflix_with/"
    },
    {
        "id": "1oxex7o",
        "author": "harpreetthind",
        "title": "Just wondering, what shows everybody recommends watching on Netflix",
        "content": "I’m watching Brooklyn Nine-Nine already watched superstore and I’m watching Wednesday. What other shows do people recommend? Let me know in the comments since I’m currently in the looking for other shows or movies\nThanks ",
        "upvotes": 10,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1oxex7o/just_wondering_what_shows_everybody_recommends/"
    },
    {
        "id": "1oy3c4u",
        "author": "reddit_job1234",
        "title": "Philippines, Indonesia, Australia has filipino blood",
        "content": "Philippines, Australia, Indonesia has filipino players playing ... kinda cool just found out yesterday...hoping Mongolia wins.. or japan ..Who are you guys want to win?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oy3c4u/philippines_indonesia_australia_has_filipino_blood/"
    },
    {
        "id": "1oxmpbh",
        "author": "Sufficient-Curve2951",
        "title": "Had I Not Seen the Sun ending",
        "content": "I have read many articles about this new Taiwanese show and I still wonder if Pin-yu holds a connection to Jen-yao? What do you guys think? The blind woman also brings a lot of mystery to the story, I can't wait for Part 2! But is Pin-yu Jen-yao's girlfriend from his past?\n\n  \n[https://www.soapcentral.com/shows/had-i-not-seen-sun-part-1-ending-explained-chou-pin-yu-uncovers-troubling-secrets-li-jen-yao-s-past](https://www.soapcentral.com/shows/had-i-not-seen-sun-part-1-ending-explained-chou-pin-yu-uncovers-troubling-secrets-li-jen-yao-s-past)",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxmpbh/had_i_not_seen_the_sun_ending/"
    },
    {
        "id": "1oxq4wp",
        "author": "TimesandSundayTimes",
        "title": "One Day's Leo Woodall: ‘Being objectified messes with your head’",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxq4wp/one_days_leo_woodall_being_objectified_messes/"
    },
    {
        "id": "1oxk8mh",
        "author": "Comfortable-Ice-5584",
        "title": "Ikusagami - Last Samurai Standing",
        "content": "Hey Folks. \nI just finished the last samurai standing in one binge and except a few minor details I really enjoyed the series.\nAs I am unpaciant as one can be I would love to read the novel from shogo imamura.\nUnfortunately all I can find is the manga adaption. Does anyone know if there is an English version of the novel for purchase and where to get it ? \n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxk8mh/ikusagami_last_samurai_standing/"
    },
    {
        "id": "1oxx9q6",
        "author": "Ok_Hippo6727",
        "title": "Careful Buying Clothing on the Netflix Shop",
        "content": "Not sure if this is the right spot, but I recently bought and then returned a Kpop demon hunter shirt from the netflix shop. I order \"small\" size shirt and received something big enough to fit on my 6'2 friend. I used the pre-paid return label provided, but they charged shipping. \n\nBasically a word of caution, the products are not well made and you could just end up out the cost of shipping. ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1oxx9q6/careful_buying_clothing_on_the_netflix_shop/"
    },
    {
        "id": "1oxnlga",
        "author": "abablawan",
        "title": "Subtitles Font On Apple TV",
        "content": "\nHello everyone, I’m new here and still getting familiar with how things work. I wanted to ask if anyone knows whether the Netflix app on Apple TV allows users to change the subtitles font style or customize it in any way. I’ve seen options for adjusting subtitle size and background on some devices, but I’m not sure if Apple TV has the same flexibility. Any tips or guidance would be greatly appreciated!\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1oxnlga/subtitles_font_on_apple_tv/"
    },
    {
        "id": "1oy6tay",
        "author": "Apprehensive_Name445",
        "title": "Turned out they deleted my account because I kept making temporary accounts after they changed their price this year and I only paid for basic plan instead of standard plan",
        "content": "It's actually very bizarre because they could have had just sent me an email (they probably did I thought they were just trying to get me to change plan). Either way I have been getting the standard plan but had only paid for the basic plan price. It had been going on for 11 months and I kept making temporary accounts. Now my account is terminated. ",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1oy6tay/turned_out_they_deleted_my_account_because_i_kept/"
    },
    {
        "id": "1oxnh8h",
        "author": "Riddleboxed",
        "title": "How to change extra member to no ads?",
        "content": "Hi. \n\nI currently have an ad free subscription, and I added my brother as an extra member, but accidentally selected the 'with ads' option for him. I'd like to change it so that he doesn't see adverts, but I  cant seem to figure out how to change it.\n\nAny help would be greatly appreciated. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxnh8h/how_to_change_extra_member_to_no_ads/"
    },
    {
        "id": "1owzj6u",
        "author": "the_oncoming_doctor",
        "title": "One of the worst UI updates ever",
        "content": "I just got the latest UI update and they just seems to have butchered the UI. Clicking on a title now starts playing it instead of showing the earlier menu. This is bad because if I have to look at the episodes list or add or remove an item from my list I have to start playing which also bring it to my continue watching.\n\nSometimes my wife just watches something from my profile forgetting to switch to hers and now when I go to watch it starts from the middle. What’s more infuriating is that I don’t see a start over button anymore. So I have to rewind it and make sure I don’t see the clips when rewinding.\n\nThe previous menu list was good enough they did they have to update it to this shit.",
        "upvotes": 20,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1owzj6u/one_of_the_worst_ui_updates_ever/"
    },
    {
        "id": "1oxwlmv",
        "author": "myggghm",
        "title": "Bro, is it just me?",
        "content": "I hate when people change the cast midway through the season like just ended at this point. I was literally watching greenhouse Academy and now I’m like literally gonna crash out both of the two characters that I loved are replaced.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1oxwlmv/bro_is_it_just_me/"
    }
]