[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 484,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1hqq5d8",
        "author": "Sudden_Pop_2279",
        "title": "‘Squid Game’ Season 2 Opens With 68 Million Views, Netflix’s Biggest TV Debut Ever",
        "content": "",
        "upvotes": 435,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1hqq5d8/squid_game_season_2_opens_with_68_million_views/"
    },
    {
        "id": "1hqysej",
        "author": "badboy_1432",
        "title": "\"From the green tracksuit to...? The suspense is killing me! #SquidGameSeason3",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/z422muj7dcae1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1hqysej/from_the_green_tracksuit_to_the_suspense_is/"
    },
    {
        "id": "1hqt38y",
        "author": "citrusgrimm",
        "title": "Does it bother anyone else when you select a show and you get a review instead of the description of the show? ",
        "content": "It's definitely a pet peeve of mine. I just wanna know what this show/movie is about, you want me to go in blind? I know I can just look up the movie/show but I shouldn't have to. Am I wrong about this opinion? \n\n",
        "upvotes": 10,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hqt38y/does_it_bother_anyone_else_when_you_select_a_show/"
    },
    {
        "id": "1hqx0s4",
        "author": "Vojuln3",
        "title": "Don't Die: The Man Who Wants to Live Forever - Discussion Thread\n",
        "content": "How far would you go to live forever - or even just slow down the aging process? This startling documentary by Chris Smith (Fyre, 100 Foot Wave) is told through intimate access to Bryan Johnson, a man who has dedicated his life to defy aging. Don't Die: The Man Who Wants to Live Forever dives into the controversial wellness practices one man is using to maintain youth and vitality, and the effect this journey has on himself and those around him.\n\nReleased today on Netflix\n\nTrailer: [https://www.youtube.com/watch?v=kf9e1o7rUeo](https://www.youtube.com/watch?v=kf9e1o7rUeo)",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hqx0s4/dont_die_the_man_who_wants_to_live_forever/"
    },
    {
        "id": "1hqpeg3",
        "author": "raknor88",
        "title": "Is there a setting where I can turn off the game suggestions?",
        "content": "I really have ZERO interest in playing the browser games that they keep offering. Is there somewhere in the settings that I can go to turn those off?\n\nI use Netflix for shows and movies. If I wanted to game I'd open up Steam. I'm getting very annoyed seeing that stupid watermelon everytime I open up Netflix.",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hqpeg3/is_there_a_setting_where_i_can_turn_off_the_game/"
    },
    {
        "id": "1hqtowz",
        "author": "SongsOfTheYears",
        "title": "What is the official guidance given for the thumbs (\"like\" vs. \"love\" vs. \"not for me\")?",
        "content": "I reflexively dismissed that screen and then regretted doing so, as I am curious for what they consider those to be, even though it's obviously fairly intuitive.  But I couldn't get it to display again after having dismissed it.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hqtowz/what_is_the_official_guidance_given_for_the/"
    },
    {
        "id": "1hqirtk",
        "author": "skullywogging",
        "title": "Seasonal Shows that take too long.",
        "content": "I used to love stranger thing especially after the first season.\n\nI used to love demon slayer after the first season.\n\nSame for breaking bad.\n\nSame for attack on titans. \n\n\nThen seasons taking years long to drop new episodes are causing these shows downfall. By time you bring out a new season we don't even C A R E about what happened prior anymore. The hype is gone. The excitement has dissipated.  And people actually start resenting being left with cliffhangers and don't watch the show anymore. \n\nI think it'll be a good idea to pre-make the shows episodes at LEAST 1 year in advance so they can have a steady flow of episodes with a waiting period of 2 months apart.\n\nLife is so hectic and fast paced. So much happens. Mr.Directors n Actoring peoples. We need to move a little quicker than that. ",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1hqirtk/seasonal_shows_that_take_too_long/"
    },
    {
        "id": "1hqivvd",
        "author": "sfmike99",
        "title": "Barbie, Dune 2 and Furiosa not in 4k?",
        "content": "That \"premium\" plan is tough to justify when the biggest new movies are HD only. I watched Dune 1 on 4k on HBO MAX but let the subscription drop. I'd switch back if my SO wasn't hooked on Korean dramas.",
        "upvotes": 10,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1hqivvd/barbie_dune_2_and_furiosa_not_in_4k/"
    },
    {
        "id": "1hqnmh5",
        "author": "ConsiderationMost497",
        "title": "First time Netflix subscriber ",
        "content": "Like the title said. I'm a first time subscriber   I'm a long time pro wrestling fan so I bought mainly for WWE Raw starting Jan 6th.  Was a few other things I wanted to see also anyone else here first time subscribers + because of WWE? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hqnmh5/first_time_netflix_subscriber/"
    },
    {
        "id": "1hqvdyt",
        "author": "TheTropicalDog",
        "title": "No Good Deed",
        "content": "Has anyone watched this? I have some questions. Possible spoilers below. \n\n*\n\n*\n\n*\nWhy is it called No Good Deeds? Because there aren't any? That's what I'm assuming. \n\nWhat did Mikey go to prison for? I don't believe I missed the explanation but idk. He keeps saying he did Paul &amp; Lydia a huge favor &amp; it seems to relate to Jacob's death but what was it? I'm so confused. \n\nWhy was there the lame side story with Margo &amp; Gwen? Was Margo a realtor? Did I miss that too? She didn't seem to work but was making deals with Gwen. \n\nWhy didn't the nosy neighbor (RIP Linda Lavin!) catch the shooting on her surveillance camera? Maybe she installed that after the murder. \n\nI think that's it. I had more but I can't remember. Sorry if these are dumb questions. It was a good show but I spent most of it wondering what Mikey did. Love seeing Denis Leary in screen again! \n\nThanks! Happy NY! ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hqvdyt/no_good_deed/"
    },
    {
        "id": "1hqo6hd",
        "author": "Powerful-Look324",
        "title": "The platform/platform 2 questions",
        "content": "The Platform/Platform 2 questions \n\nHey I just watched these two movies and I am very very confused. I’m not good at understanding themes so forgive me if some of my questions are really stupid. \n\nTHEME QUESTIONS \n\n1. What does the child being sent up represent in both movies? I understand how the platform is supposed to represent capitalism and society but what does that he children being sent up supposed to represent? \n\n2. What does the children scene in platform 2 represent? The one with all the kids fighting for the top of the pyramid? Why does the winner of the game get sent to the bottom of the platform? What is that even supposed to mean. \n\n3. What was the animal cruelty supposed to represent? The cruelty of people? There’s one scene where the platform goes all the way to the bottom and we hear animals clawing and growling. What does that mean?\n\n4. What was the point of the fat guy who liked pizza. What was his representation of the theme? \n\n5. There were several biblical references throughout, like mentoring the word savior multiple times, 666 people in the platform, and the christian black guy. What do those represent? \n\n6.  Does the law and the people trying to enforce the one meal a day in platform 2 supposed to represent communism? \n\n\n\nPLOT QUESTIONS \n\n1. Was the girl at the bottom real in platform 1? Was she the message? I’m pretty sure she’s not because they show in the mid credits scene the chefs reacting to the panna cotta but not the kid.\n\n2. How does the main character girl of platform 2 survive at the very bottom of the pit all the way until she is reunited with her ex?\n\n3. What is the point of the platform? Is it like the cube where we’ll never know its purpose? \n\n4. Why does miharu search for her kid after willingly let her kid play in the pyramid game? She knew that there was a chance of her kid getting chosen right?\n\n5. So sending a kid up wasn’t the message right? Because the girl sent up the black kid and the platform kept on going. What’s the point of the kids then. \n\nI know it’s a lot and some of them might be stupid questions but i’m a stupid person so thanks if you can answer these ",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hqo6hd/the_platformplatform_2_questions/"
    },
    {
        "id": "1hqvtlf",
        "author": "VolkPlsWin",
        "title": "Squid game season 2 was good but...",
        "content": "It was really Season 2 part 1.    Start of the final episode it's like how are they going to wrap this up. I know they announced the new season comes this year but it was still the first half of whatever they're creating since season 1.\n\n  \nI also enjoyed it more than the first season tbf it was more complex not just omg hunger games on steroids.\n\n  \n",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hqvtlf/squid_game_season_2_was_good_but/"
    },
    {
        "id": "1hqilrj",
        "author": "Vast_Long7872",
        "title": "Series for my mom",
        "content": "Hello, so my mum loves to watch series (only on Netflix) and she's looking for some recommendations and since I don't watch series I thought I'd ask here. She's into police stuff (like criminal minds) and misteries, drugs (like narcos) and action movies. Any recommendation is appreciated&lt;3 ",
        "upvotes": 3,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1hqilrj/series_for_my_mom/"
    },
    {
        "id": "1hqr42m",
        "author": "suwubin",
        "title": "Squid Games 2 keeps buffering",
        "content": "So I was able to watch the first 3 episodes fine since Dec. 26, but ever since Dec. 28 Netflix gets stuck at the loading page with 0% load. We’ve tried moving our WiFi router closer to the TV but that didn’t work. WiFi works great too.\nWe only have this issue right now with Squid Games, every other show seems to be fine. We’ve had this issue too when Outer Banks first came out, wasn’t able to watch it till 3 weeks later, so I’m suspecting that this issue is with new shows. Has anyone else had this problem?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hqr42m/squid_games_2_keeps_buffering/"
    },
    {
        "id": "1hplhai",
        "author": "S4v1r1enCh0r4k",
        "title": " Park Sung Hoon Apologizes After Accidentally Sharing Nude 'Squid Game'-NSFW Video Cover ",
        "content": "",
        "upvotes": 752,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1hplhai/park_sung_hoon_apologizes_after_accidentally/"
    },
    {
        "id": "1hqqq44",
        "author": "ritzyravioli",
        "title": "What is the best tablet? Netflix Streaming",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hqqq44/what_is_the_best_tablet_netflix_streaming/"
    },
    {
        "id": "1hqhu77",
        "author": "WastedTalent442",
        "title": "How Should TV Shows Be Released?",
        "content": "",
        "upvotes": 3,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1hqhu77/how_should_tv_shows_be_released/"
    },
    {
        "id": "1hqmyyn",
        "author": "Pooseycat",
        "title": "Where has Watermelon Fruit Merge gone?",
        "content": "We frickin love this game and it disappeared from our Netflix, and I have no idea why. It was even after they made some updates to the game. Does anyone know what happened?",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hqmyyn/where_has_watermelon_fruit_merge_gone/"
    },
    {
        "id": "1hqmtuq",
        "author": "Dingo8MyBabyMon",
        "title": "Do any other users of a Fire TV Stick experience this problem?",
        "content": "If I leave a show paused long enough it'll eventually return to the show's title screen.\n\nWhen I click resume it'll show a loading screen at 91% while playing the video and sound in the background but it'll never finish loading and remove the loading screen. However, as soon as I hit the back button on my remote it removes the loading screen and shows the video playing before it goes back to the title screen, but I still run into the same problem if I click resume again. I have to restart my device for it to work again.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hqmtuq/do_any_other_users_of_a_fire_tv_stick_experience/"
    },
    {
        "id": "1hqgxd9",
        "author": "LastOnesLeft92",
        "title": "Sorting away already viewed materiel",
        "content": "Is there any way to remove already viewed materiel?\n\nFeels like there is no point for Netflix in filling my screen with things I have already seen or rated.",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1hqgxd9/sorting_away_already_viewed_materiel/"
    },
    {
        "id": "1hqa8ss",
        "author": "noneofmybusines",
        "title": "Can you suggest some mystery or crime drama",
        "content": "I wanna watch a mystery or crime thriller movie. I can’t find any new. Can you suggest some?\nI want something that is either originally made in English or Hindi.",
        "upvotes": 7,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1hqa8ss/can_you_suggest_some_mystery_or_crime_drama/"
    },
    {
        "id": "1hqvgdi",
        "author": "MechanicalKiller",
        "title": "Big Hollywood Actor Joining Squid Game Season 3 (SPOILERS)",
        "content": "2 years ago the creator of Squid Games said if season 3 happened, hollywood actors would be in it. It is now reported Leonardo DiCaprio is joining the cast.\n\nPeople might think “Leonardo on a Nettlix show, in a korean production?”\n\nLets not forget he was star of Netflix’s “Dont Look Up”. Also he was a big fan of S1 and the creator has wanted him on the show. \n\nThe VIP’s who watch the game are American so it makes sense.",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hqvgdi/big_hollywood_actor_joining_squid_game_season_3/"
    },
    {
        "id": "1hqdqf6",
        "author": "khush-sk",
        "title": "Show not on my profile, but appears just fine on a different profile on the same account.",
        "content": "On the TV and tablet it's the same except an option for Gilmore Girls does appear, but it doesn't have a play or continue watching option. Same with Better Call Saul. The thumbnail is in my continue watching but there's no play option.\n\nhttps://preview.redd.it/fecw0q60h6ae1.jpg?width=1236&amp;format=pjpg&amp;auto=webp&amp;s=5b1cab50273aa98573c588033f6c2e9d7d92cb48\n\nhttps://preview.redd.it/i1ufib9zg6ae1.jpg?width=1231&amp;format=pjpg&amp;auto=webp&amp;s=a636f4097a11cddd66c10006e37a9e56d6e319bf\n\n",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hqdqf6/show_not_on_my_profile_but_appears_just_fine_on_a/"
    },
    {
        "id": "1hqeflj",
        "author": "RumB96",
        "title": "Only the children profiles seem to work on my Fire HD 8 (10th gen)",
        "content": "\nSo I have been using Netflix on my tablet for a while now.\n\nAll of a sudden today it stopped working. I click on my profile and it crashes. \n\nI have cleared data, cleared cache, restarted the device, uninstalled and reinstalled etc, used a different network connection… nothing works. The Netflix app is up to date. \n\nEvery other app works fine, I.e. prime video, Iplayer etc. \n\nThe very odd thing is that the children’s profiles seem to work completely fine. Can’t figure it out at all. I called Netflix and they’ve escalated the issue but something tells me they won’t be able to fix it.\n\nHas anyone else experienced this? It’s driving me mad. I use Netflix a lot!",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hqeflj/only_the_children_profiles_seem_to_work_on_my/"
    },
    {
        "id": "1hqcfai",
        "author": "Lord-LabakuDas",
        "title": "The duality of humans. ",
        "content": "",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hqcfai/the_duality_of_humans/"
    },
    {
        "id": "1hqijng",
        "author": "Ancient-Reference-21",
        "title": "Ability to watch The Seven Dials Mystery series in the US?",
        "content": "Back in November I saw in my Facebook feed an advertisement for The Seven Dials Mystery. I went to search for it and couldn't find it.  I searched again today and noted that it isn't available in the US. Will it ever be? Or is there a way to legally access British content? ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hqijng/ability_to_watch_the_seven_dials_mystery_series/"
    },
    {
        "id": "1hq5a69",
        "author": "MechanicalKiller",
        "title": "Squid Game 2 (slight spoilers)",
        "content": "Idk why but a lot of people thought this was going to be a “cash grab” even though the first season set up a season 2.\n\nI honestly think that this season out does season 1. It was cool seeing more sides of the Squid Games other than the games themselves.\n\nLee Jung-jae does an incredible job in showing the development his character went through and how it has matured Gi-hun.\n\nNew additions like Thanos, Kim Jun Hee, Cho Hyun-ju and others were great additions to the show. \n\nAnd seeing the mastermind play the games, at one point, i thought he actually turned good. But later events proved otherwise…\n\nI want to specifically point out that those last 2 episodes were also INSANE.\n\nMy only complaint is how the season ends, in my opinion it was a bad spot to end it. It kinda feels like were in the middle of an episode and BOOM, ending.\n\nI cant wait to see how season 3 picks up, especially after how it ended.\n\nAnd this last thing is kind of a tangent. I wonder if David Finchers American remake wont be a remake, but possibly a spin off, showing that the organization is global, and season 3 could possibly set that up.",
        "upvotes": 12,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1hq5a69/squid_game_2_slight_spoilers/"
    },
    {
        "id": "1hqs11i",
        "author": "Wooden-Reserve-2573",
        "title": "Netflix Games on Instagram: \"if you haven't though about your new year resolution yet here's some inspo #netflixgames\"",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hqs11i/netflix_games_on_instagram_if_you_havent_though/"
    },
    {
        "id": "1hqs0qz",
        "author": "Training-Pangolin115",
        "title": "Will Season 3 of SG have enough time to connect the dots?",
        "content": "Will Season 3 of SG have enough time to connect the dots?\n\nI’ve sat with the shows second season for almost a week now, and have watched it multiple times. I enjoy most parts of the season, and am excited for the next, however, I’m a bit confused as to where exactly it will go from here.\n\nObviously, S2 is only around half of the complete storyline Dong-hyuk wrote, with S3 being the other half, as well as the finale of the show. Gi-hun being captured\n\nS2 ends with Gi-hun and Jung-bae being captured, after In-ho, who is (unbeknownst to the other characters) the Frontman, switches back to his true identity whilst they think he is dead. Jung-bae is killed in front of Gi-hun, and the show ends there, with many things left up in the air.\n\nUnlike S1, there are other players aside from Gi-hun who are alive, since we hadn’t even made it passed all the games. \n\nThere are many subplots within this season. \n\nThere are many side characters with their own developments.\n\nFor example, whilst the game is going on, we have Gi-gun and Jun-ho’s crew going island to island looking for him. In the final episode, Captain Park is revealed to be traitor (once again, unbeknownst to the other characters). The next season not only has to address that, but also wrap up this subplot by them either finding the island, or someone finding them.\n\nAnother example, a woman (whose name I forget) is shown throughout the series from her perspective as a guard in the games. She was given a background earlier in the show, and has had decent amounts of screen time. The show clearly wants us to acknowledge her. However, not much really happens with her character. She recognizes a person in the game that she knew in real life, and she goes out of her way to disrupt the other guards organ-selling operation by making sure the players are all the way dead before buried, but other than that, her arc is left up in the air with no real sense of direction.\n\nOf course, they also have to address the main game itself. Do the games just, continue? It’d feel weird if there wasn’t some sort of shift between S2 and 3.\n\nI have much more on my mine but my yap session is about over. In all, I have high hopes for season 3 considering I like season 2, and they were both filmed at the same time, and I trust that Dong-hyuk has fully realized the story.\n\nI only hope that they are able to tie everything together without rushing past things they previously set up.",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hqs0qz/will_season_3_of_sg_have_enough_time_to_connect/"
    },
    {
        "id": "1hqh2ch",
        "author": "The-Raccoon-Is-Here",
        "title": "Netflix and Travelling ",
        "content": "I am on the road for work regularly.  Will Netflix allow two people to use it if they have different locations or will i have to tell the household they are out of luck if I want to use the account while in a different time zone (since I assume this looks like account sharing to them).\n\nAlso how much time of commercials do you see if you sign-up for the cheaper option on a 90 minute movie?\n\nNever previously considered Netflix but one of the hotels I frequent has blocked devices from functioning on their TVs (so no more travelling with a firestick).",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hqh2ch/netflix_and_travelling/"
    }
]