[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 490,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1i1jxms",
        "author": "Temporary-Spell3176",
        "title": "American Primeval is amazing, give it a try.",
        "content": "If you’re into gritty, no holds barred Wild West stories, this is it. Set in 1857, it throws you right into the chaos of frontier life, no sugarcoating, just raw survival. The landscapes are insane, the action hits hard (not just shootouts, but brutal hand-to-hand stuff), and the story actually moves.\n\nIt’s not all talky drama, but when there’s dialogue, it matters. The main characters are solid. Isaac Reed is a total mystery, and the tension between settlers, Native tribes, and religious groups feels so real. It also ties in actual historical events, which makes it feel even more grounded.\n\nNot gonna lie, it’s dark and violent, so don’t expect any warm, fuzzy cowboy vibes. It’s like if Yellowstone and The Revenant had a gritty baby. Definitely worth the watch if you’re into intense Westerns or just want a break from the usual predictable shows. \n\n",
        "upvotes": 340,
        "comments": 124,
        "media": null,
        "permalink": "/r/netflix/comments/1i1jxms/american_primeval_is_amazing_give_it_a_try/"
    },
    {
        "id": "1i1bydj",
        "author": "S4v1r1enCh0r4k",
        "title": "'The Witcher: Sirens of the Deep' animated movie just released its first trailer, The movie takes place between episodes 5 and 6 of The Witcher Season 1.",
        "content": "",
        "upvotes": 120,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1i1bydj/the_witcher_sirens_of_the_deep_animated_movie/"
    },
    {
        "id": "1i132cg",
        "author": "dailystar_news",
        "title": "WWE fans confused as Netflix show with huge debut 'runs short' as new champ crowned",
        "content": "",
        "upvotes": 375,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1i132cg/wwe_fans_confused_as_netflix_show_with_huge_debut/"
    },
    {
        "id": "1i1t0t8",
        "author": "Whobitmyname",
        "title": "‘Squid Game 2’ Becomes Netflix’s Third Most-Watched Season Ever, After ‘Squid Game 1’ and ‘Wednesday’",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i1t0t8/squid_game_2_becomes_netflixs_third_mostwatched/"
    },
    {
        "id": "1i1s4ko",
        "author": "Robemilak",
        "title": "The trailer for ‘APPLE CIDER VINEGAR’, starring Kaitlyn Dever, Alycia Debnam-Carey, and Aisha Dee has been released. Releasing on Netflix February 6.",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i1s4ko/the_trailer_for_apple_cider_vinegar_starring/"
    },
    {
        "id": "1i123z9",
        "author": "HandsomeStarLord",
        "title": "This the movie we need the 1995 version not this crap version of Tom cruise Netflix UK ",
        "content": "",
        "upvotes": 265,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1i123z9/this_the_movie_we_need_the_1995_version_not_this/"
    },
    {
        "id": "1i1jifs",
        "author": "helpforhorror",
        "title": "Behind Her Eyes",
        "content": "Okay first of all- what? Second of all.. what? I need someone I can talk to about this show. It absolutely blew my mind and made me deeply uncomfortable at the end. Can I hear your thoughts? How it made you feel?",
        "upvotes": 17,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1i1jifs/behind_her_eyes/"
    },
    {
        "id": "1i1k4p1",
        "author": "krybaebee",
        "title": "Younger",
        "content": "Is anyone watching Younger?  It was recently added to the lineup.\n\n\n\nI watched it during its OG run on TV Land starting back in 2015.   I binged the whole thing over the past week, the episodes are short.\n\n\n\nIt's cotton candy tv for me - sweet and airy with zero nutritional value for the brain.   If you like Emily in Paris - Younger is a much better show from the same Darren Star production house.",
        "upvotes": 12,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1i1k4p1/younger/"
    },
    {
        "id": "1i1n0qe",
        "author": "Lamboo-",
        "title": "Most Watched Netflix Series And Movies of 2024 (And Biggest Disappointments)",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i1n0qe/most_watched_netflix_series_and_movies_of_2024/"
    },
    {
        "id": "1i1sm5q",
        "author": "Glittering_unicycle",
        "title": "100 years of solitude",
        "content": "100 years of solitude \n\nI have been loving this show so far and can’t get enough of it! I’m practicing my Spanish so it listening and watching the show helps. \n\nSomething that shocked me was when in the first episode there was a small child running around with no clothes. I understand what this means in the fictional world of macondo and different cultures but from a reality stand point. \n\nIs Netflix not worried about pedios? I mean a naked kid running around on set? I understand the innocence and cultural part of it and the indigenous culture but it boggles me any pedo with a Netflix subscription can see these children. \n\nI understand if my mind is tainted but in the USA there is a lot of pedos and the internet is the worse place for them. \n\nMy questions are is Netflix not worried about pedos? Why didn’t they blur it out? I see it as Netflix is so big a company to care if pedos watch their shows as long as they get paid and there isn’t anything u can really do. Just boggled me. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i1sm5q/100_years_of_solitude/"
    },
    {
        "id": "1i1skz5",
        "author": "Puzzleheaded-Mail581",
        "title": "The Show 8 - only 7 votes for the toilet?",
        "content": "    Why only 7 votes were cast for the toilet, when 8 people were voting? We can see that 8 people had voted, but only 7 of those votes were counted in the final tally.\n\nWhy only 7 votes were cast for the toilet, when 8 people were voting? We can see that 8 people had voted, but only 7 of those votes were counted in the final tally.\n\nhttps://preview.redd.it/u5eav9ye54de1.png?width=927&amp;format=png&amp;auto=webp&amp;s=b6035348e45d55587141e632b1980378b47b8614\n\n",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i1skz5/the_show_8_only_7_votes_for_the_toilet/"
    },
    {
        "id": "1i1lfip",
        "author": "Noonebutme23",
        "title": "I can't log in",
        "content": "Anyone else having issues with Netflix logging you out of all devices and your password not working to log back in? I hit 'forgot password' and it emailed me in Spanish. No Español here. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i1lfip/i_cant_log_in/"
    },
    {
        "id": "1i1d8pk",
        "author": "Rootintootintrucker",
        "title": "Deployed overseas and can’t watch Netflix (Canada account) ",
        "content": "As the tittle states I’m currently deployed overseas with the military and I went to log into my Netflix Canada account, a pop up stating my device/cellphone isn’t apart of the household Netflix account. \n\nI got a temporary code but I’m not back in Canada until June. Can I keep renewing the code every 14 days or will I be shit outta luck after that? \n\n- I got a SIM card from the country I’m in to use data since there is no wifi here. \n- I also have my laptop here that I watch Netflix on as well. \n\nAny suggestions on what I can do? \n\nThanks!! ",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1i1d8pk/deployed_overseas_and_cant_watch_netflix_canada/"
    },
    {
        "id": "1i17q1s",
        "author": "Robemilak",
        "title": "Anton David Jeftha and Mark Penwill have joined the cast of Netfix’s live-action ‘ONE PIECE’ series as K.M. and Chess.",
        "content": "",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i17q1s/anton_david_jeftha_and_mark_penwill_have_joined/"
    },
    {
        "id": "1i1isw7",
        "author": "FencePannel",
        "title": "Blue screen on certain shows",
        "content": "Hi guys. Basically i was trying to watch the live action avatar the last air bender and halfway through the second episode i just got completely blue screened and now it won’t stop. But it only does it on certain shows like avatar, stranger things etc etc. i’ve tried restarting my tv, changing the setting etc etc. even the ole turning it off and on. \n\nWould really appreciate some help as its only when i try to watch certain things on netflix. ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i1isw7/blue_screen_on_certain_shows/"
    },
    {
        "id": "1i088vi",
        "author": "Robemilak",
        "title": "‘Squid Game’ creator explains why the new character is called Rapper Thanos: \"It doesn’t really suit a rapper as a name, it was to design him to be a character fans worldwide could love.\"",
        "content": "",
        "upvotes": 3083,
        "comments": 287,
        "media": null,
        "permalink": "/r/netflix/comments/1i088vi/squid_game_creator_explains_why_the_new_character/"
    },
    {
        "id": "1i1gqay",
        "author": "Enriched_Wisp",
        "title": "1980s - early 2000s recommendation",
        "content": "I've been into horrors at the moment (preferably 1980's - early 2000s because the camera definition of these peroids is perfect for the genre)\n\nWhat are your favorite horrors currently on netflix?",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i1gqay/1980s_early_2000s_recommendation/"
    },
    {
        "id": "1i1js6z",
        "author": "Jazzlike_Pepper9626",
        "title": "Need a new show ",
        "content": "I’m almost finished watching sex and the city for the first time and now I’m obsessed and I don’t want it to end😭 please give me some recommendations on something else I could watch when I finish , Im someone who needs to be intrigued within the first 5-10 mins or I can’t watch it so please give me options ",
        "upvotes": 1,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1i1js6z/need_a_new_show/"
    },
    {
        "id": "1i1j5pr",
        "author": "jackdempsy2345",
        "title": "Recruit season 2 different",
        "content": "I’ve just finished watching season 1 and the ending was really good and left it at a cliffhanger. I’ve watched the trailer for sssson 2 and it looks like a conpoeteoy different plot and storyline with different characters. Don’t tell me they switched plots ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i1j5pr/recruit_season_2_different/"
    },
    {
        "id": "1i1hkqy",
        "author": "GrassyAss508",
        "title": "ANXIETY",
        "content": "The show “escape at dannemora” gave me such bad anxiety, I felt like I was the one escaping , I could feel the tension fr. Was I the only one disappointed that tilly didn’t go through with the plan? 🤣 I really really liked this show, i’d give it a 10/10 . Let’s talk about it!!! ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i1hkqy/anxiety/"
    },
    {
        "id": "1i1khjz",
        "author": "Archgate82",
        "title": "Wrong Show Comes On",
        "content": "When I select the new Irish drama “Kin” on Netflix, instead of that show a movie comes up called The Grudge. Wtf with that?? I’ve never had that happen before. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i1khjz/wrong_show_comes_on/"
    },
    {
        "id": "1i0syvm",
        "author": "tinabelchersupremacy",
        "title": "“Missing You“ Series ",
        "content": "Just finished watching this show with my Mom. I feel like I just got punked lmao. Are there any cameras around me? \n\nThey spent five episodes emphasizing how much Kat loved her dad  and how she would literally stop at nothing to find out what happened to him, including illegally visiting his supposed murderer in prison. Then she finds out that not only was the ex fiancé, who abandoned her and broke her heart, was the one who killed her dad. But that her best friend (who had lied to her before) WITNESSED IT. I realized then that the show was pretty much over so I was waiting to see her reaction. \n\nShe was gonna at least yell at the ex, right? WRONG. She reaches over after a few seconds and holds his hand. \n\nWhat the actual hell? \n\nThe show was pretty all over the place to begin with. The weird dog breeder plot, The detective constantly being lied to by her closest friends and family, All these forced “twists and turns“ about Josh that turned out to have nothing to do with him etc. \n\nI guess I should’ve kept my expectations low lol but I at least expected an ending that would be a teeny bit satisfying. ",
        "upvotes": 33,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1i0syvm/missing_you_series/"
    },
    {
        "id": "1i17ydj",
        "author": "VeryStressedOwl",
        "title": "Academic research on criminal representation in entertainment",
        "content": "Hello everyone!\n\nI need a brief moment of your time.\n\nFor my master's thesis I'm conducting research on how criminal characters are presented in entertainment media and its effect on the participant's moral &amp; punishment attitudes. I still need 100+ responses to be able to start the analysis and I would be immensely grateful if you'd participate!\n\nIt won't take more than 5-10 minutes! Thank you so much!\n\n  \nhere's the link to the survey: [https://uva.fra1.qualtrics.com/jfe/form/SV\\_39lwKA0b2b8ZyQu](https://uva.fra1.qualtrics.com/jfe/form/SV_39lwKA0b2b8ZyQu)",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i17ydj/academic_research_on_criminal_representation_in/"
    },
    {
        "id": "1i0utsx",
        "author": "Such-Possibility1285",
        "title": "Loudermilk suffers from arrested development and doesn’t require new seasons",
        "content": "Love to hear about shows that get a second life and a new audience on a different platform.    And Loudermilk picked up a new audience on NF with calls for new seasons.  I’ve enjoyed the show but leave well alone, cos everything interesting to say about the characters has already been done.  \n\nThe writers stymied the progress of Sam Loudermilk by blunting significant storylines that involved him having to grow beyond his hound dog persona.  \n\nIn S1 he pursues Allison then wins her in final episode, as he is league jumping he’ll have to evolve to keep her heart.  Her character is killed off in 1st episode of S2. \n\nBen marrying Sam’s Ex as S1 big finale story beat, is completely reset to starter positions early on in S2.  Mid S2 they are living back together like it never happened.   \n\nEnd S2 Sam is literally left holding the baby, he’ll sure have to grow up fast now.  Early S3 the baby subplot is wrapped up within 1 episode.  \n\nI wish the writers had the confidence to grow the characters and not contrive to have them in their starter positions every season. It feels like they were making it up on the hoof every season, with no story arc.  \n\nThe show is a gem to discover as a joyful distraction, with Ron Livingston perfecting the grouch.  But any more seasons will lose its charm and overstay the welcome.  It’s of its time and should be enjoyed as such.  ",
        "upvotes": 24,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1i0utsx/loudermilk_suffers_from_arrested_development_and/"
    },
    {
        "id": "1i15xtc",
        "author": "Atlast_2091",
        "title": "Back in Action | Jamie Foxx, Cameron Diaz | Official Trailer | Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1i15xtc/back_in_action_jamie_foxx_cameron_diaz_official/"
    },
    {
        "id": "1i1mns3",
        "author": "mastergam3r",
        "title": "Censorship",
        "content": "Why is Jojo so much sensored. Isn't it à 18+ show. Why Netflix? On some platform this show is not censored.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i1mns3/censorship/"
    },
    {
        "id": "1i0n84v",
        "author": "Lil_Cam_5_1",
        "title": "Anyone else addicted to the Squid Game / I-Land / 3% genre?",
        "content": "# Or the Circle (2015) and Birdbox genre of Movies via Netflix.\n\n# Or outside Netflix movies like the Cube Trilogy... \n\n# Nine Dead (2010)... \n\n# Escape Room (2019)... \n\n# House of 9 (2005)...\n\n# The Belko Experiment (2016)...\n\n# The Killing Room (2009)...\n\n# Fermat's Room (2007)",
        "upvotes": 29,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1i0n84v/anyone_else_addicted_to_the_squid_game_iland_3/"
    },
    {
        "id": "1i0m65s",
        "author": "nomnomsquirrel",
        "title": "Rumor: Old Guard 2 Going Back for Reshoots in Early Summer 2025",
        "content": "Just when we thought Netflix was finally going to release the sequel this year (which they initially finished filming in summer 2022), the movie is rumored to be going back for another round of reshoots, which means it probably won't be released in 2025 if that's the case. It was a fairly popular movie with a good number of fans. Do you guys think this is a case of trying to ensure a good product or finding some excuse to bury it for tax purposes at some point? It's been ~~84~~ 5 years almost since the first movie... \n\n[https://m.imdb.com/news/ni65065549/?ref\\_=nmnw\\_art\\_plk](https://m.imdb.com/news/ni65065549/?ref_=nmnw_art_plk) has some more info on this rumor.",
        "upvotes": 26,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1i0m65s/rumor_old_guard_2_going_back_for_reshoots_in/"
    },
    {
        "id": "1i0zmwt",
        "author": "Piece_Alarmed",
        "title": "The 8 Show",
        "content": "episode 6, or whenever the main character n the other innocent ppl were free, couldnt they just have bought through their time finally? like that route seems forgotten or idk if somehow smth happened that stops that.? \n\n",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1i0zmwt/the_8_show/"
    },
    {
        "id": "1i14kxn",
        "author": "Cjale-sama",
        "title": "Video Play Bar won't go away on phone even if I tap the screen",
        "content": "Whenever I play a show, the buttons won't disappear for 14 seconds which is a bit irritating. I tried tapping the screen to make it go away but to no avail. Please help",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1i14kxn/video_play_bar_wont_go_away_on_phone_even_if_i/"
    }
]