[
    {
        "id": "1kc1pmw",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram groups for apartment hunting:\n\n* https://t.me/CaseStudentiTorino\n* https://t.me/AppartamentiaffittoTorino_SBG\n* https://t.me/stay_buy_home_community\n* https://t.me/rbh_homer_bot\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1kc1pmw/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1l0hsky",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://chat.whatsapp.com/LxRuDtXedFzAYid0vVRMK9): gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[GIOCHI IN TAVERNA](https://t.me/giochiintaverna): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala e ogni mercoledì in conceria Vanchiglia\n\n[RACCONTAPASSI](https://t.me/raccontapassi): ogni weekend propongono attività in giro per il Piemonte\n\n[TREKKING TURIN](https://chat.whatsapp.com/J7cE64PnQqJ0D0rj0Iu7wg): gite e trekking ogni weekend con partenza da Torino! Langhe, Liguria, Piemonte etc\n\n[TUTTI LIBERI](https://chat.whatsapp.com/Ld9PMqbHF1FLJAFFdzWjbb): scrivi cosa vuoi e quando vuoi, aggiungi più persone possibili, sii educato, vivi e lascia vivere, divertiti!\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/S724xoGIaFT5er3lDWaxUubBejlqByORKznsztzXsg0.jpg?auto=webp&amp;s=391cf4d2a70c1f367d13be1740af83131b1f32e0"
        },
        "permalink": "/r/torino/comments/1l0hsky/la_piola_friends_meetup/"
    },
    {
        "id": "1n29euu",
        "author": "sofritto_per_te",
        "title": "Is Turin really getting worse?",
        "content": "Hi!\n\nI'm considering moving to Turin, after visiting a few times and after reading a lot of positive recommendations all over the Internet. That is, all over the Internet except this sub. You’d think locals here would have the best insight, but so many posts focus on the city’s “degradation”, making me a bit sceptical about the project. But I wonder if that scepticism really is warranted, or if it has more to do with the state of world than Turin specifically.\n\nSo I’d love your honest take: is Turin a bad place to live, or is it just going through the same challenges as everywhere else? Are there other (large-ish) cities where you actually see optimism, opportunities, or better quality of life?\n\nI’m Norwegian, in Oslo right now, working remotely (“smart working,” as I’ve learned you for some reason call it), and I’m mainly motivated by the idea of a better quality of life at a more reasonable cost.",
        "upvotes": 30,
        "comments": 69,
        "media": null,
        "permalink": "/r/torino/comments/1n29euu/is_turin_really_getting_worse/"
    },
    {
        "id": "1n28511",
        "author": "Ok_Gold_2107",
        "title": "Chi è il genio che pensa di far del bene lasciando della spesa gratis d'agosto per il marciapiede?",
        "content": "Sulla spesa c'è scritto \"cibo gratis\" o qualcosa del genere non si legge bene perchè ha piovuto.\n\nora, normalmente non ho mai preso nulla perchè non ne ho bisogno ma non ho capito proprio ne la spesa ne la tipologia.\n\nProblemi di questa spesa:\n\n1- Metà delle cose devono essere conservate in frigo è li da 1 giorno quindi la probabilità che vada male è altissima\n\n2- Ci sono anche degli avocado, sono costosissimi gli avocado poteva prendere delle mele\n\n3- A chi è rivolta??? perchè non può portarsela a casa o evitare di comprarla?\n\n  \nRispondo a domande che vi verranno in mente:\n\nSono scaduti? No, la scadenza è fra 7 giorni.",
        "upvotes": 20,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/jx5mkwe1hqlf1.jpeg?auto=webp&amp;s=f67f57948ba9ade09017725b7ec4757aa9e849ec"
        },
        "permalink": "/r/torino/comments/1n28511/chi_è_il_genio_che_pensa_di_far_del_bene/"
    },
    {
        "id": "1n2g1zq",
        "author": "in_flames_666",
        "title": "Cosa rende speciale Torino?",
        "content": "Qual è la cosa che vi piace di più di questa città? E quella che vi piace di meno e cambiereste? Cosa rende speciale Torino rispetto alle altre città? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n2g1zq/cosa_rende_speciale_torino/"
    },
    {
        "id": "1n2hab4",
        "author": "yotama9",
        "title": "è habituale comprare degli libri scolastichi usati?",
        "content": "Ciao tutti, \n\nSono nuovo nella cità, e in Italia. I miei regazzi hanno ricevuto la lista degli libri per la scuola (della scuola vittoria). Pensavo forse posso trovare i libri second-hand? È possibile qua? Conosci forse dove posso ne trovare?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n2hab4/è_habituale_comprare_degli_libri_scolastichi_usati/"
    },
    {
        "id": "1n281go",
        "author": "Lucky-Supermarket106",
        "title": "Cerco testimonianze: studenti fuorisede e il problema delle referenze negli affitti a Torino",
        "content": "Ciao a tutti!  \nSto lavorando a un articolo sulla ricerca di alloggio per studenti fuorisede a Torino.\n\nIn particolare mi interessa capire **come le richieste di referenze o di un garante (spesso con contratto a tempo indeterminato)** stiano influenzando la possibilità per gli studenti di trovare una stanza o un appartamento.\n\nSe sei uno studente e stai vivendo questa situazione — o se hai dovuto rinunciare a un affitto perché non potevi fornire le garanzie richieste — mi piacerebbe raccogliere la tua esperienza (anche in forma anonima, naturalmente).\n\nScrivimi pure in privato: bastano pochi minuti di chiacchierata.\n\nGrazie a chi vorrà condividere la sua storia 🙏",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n281go/cerco_testimonianze_studenti_fuorisede_e_il/"
    },
    {
        "id": "1n2azva",
        "author": "Guilty_Condition_300",
        "title": "Corso d'Inglese a Torino",
        "content": "Buongiorno a tutti,\n\nmi piacerebbe frequentare un corso di Inglese a Torino che permetta anche di fare serate di conversazione nella lingua. So' che ci sono molti centri, ma non avendone mai provato uno mi servirebbe un consiglio su quali reputate tra i migliori.\n\nSapreste, per cortesia, aiutarmi? Sarebbe molto utile per il mio lavoro.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n2azva/corso_dinglese_a_torino/"
    },
    {
        "id": "1n1thms",
        "author": "carmelolg",
        "title": "Affittare una sala per feste di compleanno a Torino Nord o Nord-Est",
        "content": "Ciao a tutti,\n\nqualcuno conosce dei posti dove affittano sale abbastanza grandi per poter fare una festa di compleanno?\n\n__Range orario__: 15h00 / 20h00\n\n__Tipologia__: festa per bambini\n\n__Numero di persone__: 40-50\n\n__Zona__: Vanchiglia, Vanchiglietta, Regio Parco, Aurora\n\n\nValuto anche bocciofile o affini che affittano gli spazi senza l’obbligo della consumazione nel ristorante locale.\n\nVi ringrazio molto.\n",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n1thms/affittare_una_sala_per_feste_di_compleanno_a/"
    },
    {
        "id": "1n1rfd4",
        "author": "One-Detective-4646",
        "title": "Parcheggi Parkito Torino?",
        "content": "Ciao a tutti! Sto cercando posti dove lasciare la macchina a Torino in zona Vanchiglia/Vanchiglietta e ho notato la presenza di molti parcheggi privati gestiti da Parkito. Cercando su internet non si trova molto al di fuori dei risultati relativi al loro sito/app, ma mi sembra di capire che si tratti di parcheggi di privati all’interno di condomini, messi in affitto singolarmente. Qualcuno ha già utilizzato questo tipo di servizio e sa dirmi se è affidabile? Non trovando recensioni e non avendone mai sentito parlare prima sono un po’ diffidente.\nGrazie a chi mi aiuterà! 🤗",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n1rfd4/parcheggi_parkito_torino/"
    },
    {
        "id": "1n1cgf2",
        "author": "glorious-ahole",
        "title": "Learning italian",
        "content": "I've recently shifted to Turin and I want to learn italian. I've heard that some communes teach italian which are free. If anyone knows, can you please let me know where are they offered and how can I enrol",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1n1cgf2/learning_italian/"
    },
    {
        "id": "1n1hkg3",
        "author": "Ok_Temperature_6649",
        "title": "i need help with my Til- A scoring",
        "content": "hello! im an EU student and i took the architecture exam at PoliTo and i got 50,50 and the results still have to be published and im really anxious since they postponed it again, does anyone happen to know someone who got into architecture in PoliTo last year and what was their score? or if my score is enough to make it in PoliTo? \n\n\nCiao! Ho fatto il test di ammissione ad Architettura al PoliTo e ho ottenuto 50,50. I risultati devono ancora essere pubblicati e sono davvero in ansia, visto che li hanno rimandati di nuovo. Qualcuno per caso conosce qualcuno che l’anno scorso è entrato ad Architettura al PoliTo e con che punteggio? Oppure se il mio punteggio è sufficiente per entrare al PoliTo?",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1n1hkg3/i_need_help_with_my_til_a_scoring/"
    },
    {
        "id": "1n1aue8",
        "author": "Ancient_Tourist_4268",
        "title": "Fantacalcio",
        "content": "Ciao a tutti, vorrei fare un fantacalcio.\nFaremo l’asta alla fine del mercato , chi ha piacere di partecipare mi scriva.\nSiamo una lega a 10 partecipanti.\nCosto di iscrizione: 10€ \n\nMontepremi \n1⭐️ 50€ \n2🥈30€\n3🥉20€ \n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n1aue8/fantacalcio/"
    },
    {
        "id": "1n1g78v",
        "author": "nicco_lo",
        "title": "Zona Corso Rosselli all'incrocio con Corso Re Umberto",
        "content": "Ciao a tutti, sapete dirmi com'è vivere nella zona di corso rosselli/corso re umberto? È una zona tranquilla? Grazie mille.",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1n1g78v/zona_corso_rosselli_allincrocio_con_corso_re/"
    },
    {
        "id": "1n12uol",
        "author": "papa_commie",
        "title": "Come funzionano le scuole serali a Torino?",
        "content": "Faccio la terza liceo e probabilmente domani all'esame del debito verrò bocciato e sono stanco del liceo perchè lo vedo come una perdita di tempo considerando quanto effettivamente vale il diploma del linguistico, però voglio comunque andare all'università. In caso di bocciatura volevo quindi vedere di andare ad una scuola serale sia per poter magari lavorare di giorno e costruirmi un minimo di curriculum sia per poter anche magari riuscire a condensare due anni in uno. Sono completamente estraneo a qualunque cosa riguardi le scuole serali pls help😭🙏",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1n12uol/come_funzionano_le_scuole_serali_a_torino/"
    },
    {
        "id": "1n0hqej",
        "author": "yotama9",
        "title": "D&amp;D, in Inglese, a Torino?",
        "content": "Hi all, \n\nSeeing that post of someone looking for a group in Torino, I thought I should post myself as well. Meaning, I'm looking for a group too. \n\nI've been playing for most of my life (I'm M45 BTW). I speak Italian, but no well enough (yet) to play, sadly. I can DM (though I prefer doing so in Dungeon World) or play in pretty much any system that you prefer. \n\nThe problem, though, is that I don't live in Torino, but outside of it. Which means I need to finish playing by, say, 21.30 so I can make it to the bus. \n\nAnyone up for a game?",
        "upvotes": 10,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1n0hqej/dd_in_inglese_a_torino/"
    },
    {
        "id": "1n0irjq",
        "author": "CDive20",
        "title": "Supermercati più economici a Torino?",
        "content": "Ciao a tutti!\nSto cercando di capire quali siano i supermercati o discount più convenienti a Torino. \nQualcuno di voi ha esperienze dirette o consigli pratici? Ad esempio su dove conviene davvero fare la spesa settimanale, o se ci sono mercati di quartiere particolarmente economici (tipo Porta Palazzo)?",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1n0irjq/supermercati_più_economici_a_torino/"
    },
    {
        "id": "1n0gz96",
        "author": "eddz_",
        "title": "Advice: Living in Barreria Di Milano",
        "content": "Hello! my friend and i will be living in Barreria Di Milano Somewhere close to the Giovanni Hospital. Is it considered safe?",
        "upvotes": 4,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1n0gz96/advice_living_in_barreria_di_milano/"
    },
    {
        "id": "1n0h2g9",
        "author": "Parking_Double_3855",
        "title": "Attivita' per bambina di 10 anni",
        "content": "Ciao a fine settembre sarò in citta con mia figlia di 10 anni, volevo qualche idea per fare qualche attività divertente con lei, soprattutto dopo  cena, avevo pensato allo zero gravity ma chiude abbastanza presto. avete qualche idea? deve essere raggiungibile con i mezzi o a piedi, siamo zona quadrilatero. Grazie",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1n0h2g9/attivita_per_bambina_di_10_anni/"
    },
    {
        "id": "1n0i8w3",
        "author": "4thWAVEofficial",
        "title": "(Cybersecurity) Certificazione Comptia security+",
        "content": "Cerco a Torino la possibilità di fare un corso in presenza (+esame) per ottenere la certificazione Comptia security+. La mia ricerca di tale possibilità è stata effettuata principalmente online, dato che mi manca ancora un mese per tornare a Torino. Io vivo nei paraggi dell'ultima fermata della metro, più precisamente bengasi. Qualcuno saprebbe aiutarmi?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1n0i8w3/cybersecurity_certificazione_comptia_security/"
    },
    {
        "id": "1n0ftny",
        "author": "Gracchio_Alpino",
        "title": "Parcheggio feriale per chi viene da fuori",
        "content": "Ciao! Verrò a Torino da mercoledì a venerdì e volevo cercare un parcheggio che non costi un rene. Mi va bene anche prendere i mezzi per arrivare in centro. È solo che, stando alle recensioni Google dei parcheggi coperti intorno alla città, fanno sembrare che lasciandola lì sia inevitabile pagare 2000€ di carrozzeria perché sono progettati male oppure di vetri perché te li sfondano per svuotartela. Magari è un'alternativa lasciarla in un paesino fuori e arrivare in treno? Grazie!",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1n0ftny/parcheggio_feriale_per_chi_viene_da_fuori/"
    },
    {
        "id": "1mzxwbu",
        "author": "twenty_Two_9594",
        "title": "D&amp;d a Torino",
        "content": "Ciao f26 di Torino, ho sempre fatto fatica a trovare amicizie ma da settembre mi piacerebbe trovare qualcuno con cui iniziare una campagna di D&amp;D e magari creare nuove amicizie. C’è qualcuno che magari sta per iniziare e a cui potrei aggregarmi? \n(P.s per ora ho giocato solo one shot u.u) ",
        "upvotes": 9,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1mzxwbu/dd_a_torino/"
    },
    {
        "id": "1mzyaon",
        "author": "TheAnt89",
        "title": "Qualcuno ha mai fatto un corso al talent garden?",
        "content": "Ciao a tutti, \n\nVorrei intraprendere un cambio di carriera e ho visto un corso abbastanza interessante al talent garden in Content Management &amp; AI Master. \n\nQualcuno ha mai fatto un corso del genere? O in generale al talent garden? Se si come vi siete trovati? \n\nGrazie\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mzyaon/qualcuno_ha_mai_fatto_un_corso_al_talent_garden/"
    },
    {
        "id": "1n016qs",
        "author": "screaming4bengeance",
        "title": "Men's hair consultation and cut",
        "content": "Hi: I'm visiting Turino as a digital nomad and will need a haircut. I'm somewhat tired of my current 'do (no razor -- all scissors with lots of texture) and would like an appropriately stylish (for a 50 year old) consultation before a cut. As opposed to \"do what you want.\" Anyone come to mind?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1n016qs/mens_hair_consultation_and_cut/"
    },
    {
        "id": "1mzo1c7",
        "author": "Complex_Lynx_8546",
        "title": "PROBLEMA TEMPERATURA INTERNA",
        "content": "Ciao a tutti\n\nQuesto post è rivolto a chi vive attualmente in case di inizio 900 o case senza isolamento né interno né esterno. \nAvrei una domanda per voi: come fate con le temperature in casa? \nIo sono in una casa con 3 lati su 4 che sono muri perimetrali e ho problemi con le temperature. Ho fatto la ristrutturazione cambiando gli infissi ma non ho pensato all’isolamento, non mi è neanche passato di mente perché già la casa era in situazioni critiche.Ora in estate a parte questi ultimi giorni che ha iniziato a piovere e quindi le temperature si sono abbassate avevo in casa il termostato che non scendeva mai sotto i 30 gradi, mentre d’inverno appena spengo i termosifoni in casa inizia a fare freddo e riesco ad arrivare a stento ai 18 gradi.. C’è qualcuno che ha avuto  il mio stesso problema e ha risolto in qualche modo? Se si come? Vi ringrazio in anticipo per le risposte",
        "upvotes": 8,
        "comments": 19,
        "media": null,
        "permalink": "/r/torino/comments/1mzo1c7/problema_temperatura_interna/"
    },
    {
        "id": "1mzpbws",
        "author": "iluvorangecats111",
        "title": "amici a torino",
        "content": "ciao! sto cercando nuovi amici con cui uscire, magari girare in centro, andare in libreria, prendere un caffè o un gelato, fare shopping o guardare un film ecc. Mi piacciono gli anime, le serie, i musical, disegnare e andare sui rollerblade. Ho quasi 18 anni e parlo anche inglese.",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1mzpbws/amici_a_torino/"
    },
    {
        "id": "1mztobv",
        "author": "mainapizza",
        "title": "Guide alpine/corsi di avanzamento sul ghiaccio",
        "content": "Ciao a tutti, il prossimo inverno/anno vorrei andare un pochino avanti con l'esperienza in montagna e imparare l'avanzamento sul ghiaccio e quanto è collegato. Qualcuno è o conosce guide che facciano anche questo?\n Grazies",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mztobv/guide_alpinecorsi_di_avanzamento_sul_ghiaccio/"
    },
    {
        "id": "1mzytnh",
        "author": "Independent-Job3535",
        "title": "Cerco casa abbandonata da esplorare",
        "content": "Ciao cerco una casa abbandonata a Torino barriera di Milano, di preferenza in un posto con costante flusso di gente o anche no. Fatemi sapere, GRAZIE!😎",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1mzytnh/cerco_casa_abbandonata_da_esplorare/"
    },
    {
        "id": "1mzkq6t",
        "author": "Ale1117",
        "title": "Affitto a Torino",
        "content": "Ciao, sapreste consigliare una bella zona ben servita per chi ferquenta università a  Cuneo? dove consigliate di cercare casa ( affitti nontroppo cari e buoni collegamenti)",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1mzkq6t/affitto_a_torino/"
    },
    {
        "id": "1myzz62",
        "author": "Murky_Giraffe8700",
        "title": "Vuelta 2025 a Torino, rubata davanti all'hotel la bici da 15.000 euro del manager Shimano",
        "content": "",
        "upvotes": 73,
        "comments": 29,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_U5eZVS9CN-nl1smg_2zSI1G1IJwFab5Qq4qvl7UUrA.jpeg?auto=webp&amp;s=b4c460874b031097a72da19219cb881a3af65385"
        },
        "permalink": "/r/torino/comments/1myzz62/vuelta_2025_a_torino_rubata_davanti_allhotel_la/"
    },
    {
        "id": "1mzlu5r",
        "author": "Electrical_Acadia_87",
        "title": "Corso di fumetto/illustrazione?",
        "content": "Ciao! Mi chiedevo se ci fosse un corso/laboratorio in cui fosse possibile imparare l’arte del fumetto e dell’illustrazione a Torino. (Non la Scuola Comics che dura troppo). Grazie ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1mzlu5r/corso_di_fumettoillustrazione/"
    },
    {
        "id": "1mzr0hq",
        "author": "Solid-Government-214",
        "title": "Obtaining the ISEE Parificato.",
        "content": "Hi! I wanted to know if anyone has obtained the isee parificato with one of the CAF in Torino. Could you obtain it, did you have any difficulties? And was it worth it? Because just the official translation of the documents is around 1000€, plus the CAF office said all documents needed to be legalised which is another whole issue. I would really appreciate getting to know your experiences! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1mzr0hq/obtaining_the_isee_parificato/"
    }
]