[
    {
        "id": "1obhocr",
        "author": "MistressDispeller",
        "title": "Hi Reddit! I’m Elizabeth Lo, director-producer-cinematographer of MISTRESS DISPELLER (Venice &amp; TIFF 2024, 20 awards, releasing via Oscilloscope) and STRAY (Indie Spirit nominee 2021). MISTRESS DISPELLER is a documentary about a woman who breaks up affairs in China. It's out in theaters now. AMA!",
        "content": "Hi Reddit! I’m Elizabeth Lo, director-producer-cinematographer of MISTRESS DISPELLER (Venice &amp; TIFF 2024, 20 awards, releasing via Oscilloscope) and STRAY (Indie Spirit nominee 2021). MISTRESS DISPELLER is a documentary about a woman who breaks up affairs in China. It's out in theaters now. Ask me anything!\n\nIn China, a new industry has emerged devoted to helping couples stay married in the face of infidelity. Wang Zhenxi is part of this growing profession and is hired to go undercover and break up affairs by any means necessary; a “mistress dispeller.” Offering strikingly intimate access to a real, unfolding love triangle, Mistress Dispeller documents all sides of what is usually kept behind closed doors. As Teacher Wang attempts to bring a couple back from the edge of crisis, sympathies shift between husband, wife and mistress while emotion, pragmatism and cultural norms collide in this spellbinding look at modern love.\n\n**Trailer:** \n\n[https://www.youtube.com/watch?v=yUep-cxvQZo](https://www.youtube.com/watch?v=yUep-cxvQZo)\n\nThe film opens in New York on 10/22 and Los Angeles on 10/23 before expanding around the country in the weeks that follow.\n\nAsk me anything! I'll be back later today (Monday 10/20) at 3:00 PM ET to answer questions :)",
        "upvotes": 49,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/5blq5cjif9wf1.png?auto=webp&amp;s=5b3bb73ba5a197ee081188413e052fa6d24ea95f"
        },
        "permalink": "/r/movies/comments/1obhocr/hi_reddit_im_elizabeth_lo/"
    },
    {
        "id": "1objtix",
        "author": "MarvelsGrantMan136",
        "title": "How ‘Tron: Ares’ Ran Off The Grid: Disney Sci-Fi Movie Set To Lose $132M+",
        "content": "",
        "upvotes": 743,
        "comments": 448,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/8ahp64PgYnymGD6-EsDONM6TMw9LB2K_TcIGRJx-QeU.jpeg?auto=webp&amp;s=25246ef2df18d33c47d3af3339c7a342d6b1c48e"
        },
        "permalink": "/r/movies/comments/1objtix/how_tron_ares_ran_off_the_grid_disney_scifi_movie/"
    },
    {
        "id": "1ob91qk",
        "author": "Kimosabae",
        "title": "Finally Saw 28 Years Later... and Discussions about the Ending Has Me Wondering if I'm Brain Damaged.",
        "content": "The Movie itself is pretty good. Not without some issues, but I really appreciate this thing swinging for the fences. One of the most legitimately beautiful films I've seen in some time with some strange editing choices that can't all be easily explained away as stylistic.\n\nIt's divisive for a reason.\n\nThat said... the ending should be one of the least controversial aspects of the film and online criticisms in spaces like this have me wondering if my whole face should be wrapped in a strait jacket.\n\nVAGUE SPOILERS\n\nIf you didn't know that there's supposed to be a follow up film... *maybe* I could understand having pure tonal whiplash. But even then... it's clear the Power Rangers montage wasn't the ending. This was more of a post-credits/epilogue scene further expanding the world.\n\nBut even in the context of the film alone; it earns this supposedly hysterical idea. It's evident from the film itself that there are disperse communities in this post-apocalyptic UK and segregation would engender sociological differences in how they adapt to this hostile world.\n\nThis is Mad Max, post-apocalyptic world-building 101.\n\nThis particular band of roving, Sentai-simulating crazies isn't any more outlandish than an isolated doctor making a tower of babel out of human skulls.\n\nFinding the tone off-putting is one thing (it would likely have worked better as a post-credits scene overall) but I've seen many occasions of people stating that the scene put them off the film and the sequel entirely, which I find to be *completely* mental, personally.\n\nThere are other aspects of the film that I find to be *far* more outlandish than the ending (\"*the magic of the placenta*\"???).\n\nBut maybe it's just me.\n\nDownvote away.",
        "upvotes": 1789,
        "comments": 722,
        "media": null,
        "permalink": "/r/movies/comments/1ob91qk/finally_saw_28_years_later_and_discussions_about/"
    },
    {
        "id": "1ob8go5",
        "author": "TheWor1dsFinest",
        "title": "What do you think is Netflix’s best movie so far?",
        "content": "Got to thinking about this because I just got done watching K-pop Demon Hunters for the first time (as fantastic as everyone said). \n\nMy vote would be for The King (2019). I don’t understand how it continues to fly under the radar. 2019 was absolutely stacked with great films (Parasite, Midsommar, Little Women, Once Upon a Time in Hollywood, etc.). and this was right up there with any of them to me. The screenplay and cinematography are fantastic, the performances are great (though I think Robert Pattinson might have been a miscast), and it’s Timothee Chalamet’s best role to date in my opinion.",
        "upvotes": 1012,
        "comments": 817,
        "media": null,
        "permalink": "/r/movies/comments/1ob8go5/what_do_you_think_is_netflixs_best_movie_so_far/"
    },
    {
        "id": "1oaoxy8",
        "author": "Amaruq93",
        "title": "Behind the Scenes footage from the making of \"Van Helsing\" (2004)",
        "content": "",
        "upvotes": 8556,
        "comments": 368,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/1mlqn1vtf2wf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1oaoxy8/behind_the_scenes_footage_from_the_making_of_van/"
    },
    {
        "id": "1ob40ll",
        "author": "Amaruq93",
        "title": "\"Re-Animator\" at 40 | A famously lurid horror movie turned Jeffrey Combs into a genre all-star",
        "content": "",
        "upvotes": 741,
        "comments": 63,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5GZHSefpwgjpIkyFHtqXqltpqdSWH2cjNKAf08zaMgM.jpeg?auto=webp&amp;s=c715aa68412931c2009f7672b4bdcaadaca445f4"
        },
        "permalink": "/r/movies/comments/1ob40ll/reanimator_at_40_a_famously_lurid_horror_movie/"
    },
    {
        "id": "1obabwz",
        "author": "vrschikasanaa",
        "title": "What is the most well-executed and/or memorable jump scare you've ever seen in a movie/show?",
        "content": "What is the one scene that stuck with you to this day and scared the hell out of you?\n\nI think mine would probably be in Hereditary when there's a certain someone sawing away....I was already so tense from the very beginning of that scene, I remember having such a visceral reaction to even the sounds the wire was making.",
        "upvotes": 164,
        "comments": 456,
        "media": null,
        "permalink": "/r/movies/comments/1obabwz/what_is_the_most_wellexecuted_andor_memorable/"
    },
    {
        "id": "1oaunvh",
        "author": "Slight-Response-6613",
        "title": "Romeo + Juliet (1996) absolutely rules",
        "content": "I have no idea why this movie isn’t considered a classic. It is one of the most stylistically interesting and entertaining movies I have seen a while - and I’m not just talking about Shakespeare adaptations here, I mean literally out of all movies.\n\nIt oozes phrenetic energy, swagger and sheer style in every single frame. The costumes, the sets, the lighting, the editing - you feel like watching an explosion of overconfident late 90s aura that’s injected directly into your eyeballs.\n\nAnd the acting? I’m just gonna say every single actor knew exactly what kind of film they were in and they deliver appropriately scene chewing performances. With young Leo dicaprio at the height of his twink fame, as well as Claire Danes as Juliet (who we all know has insane chops from her TV outings) - their chemistry is just fantastic. Everyone else in this movie is fantastic too (shout out to Mercurio).\n\nLike this movie might have been seen as over the top when it first came out, but I’m not gonna lie it aged like a fine wine. I feel like it is probably more in tune with pop culture nowadays than it was even in the 90s (I literally wanna wear every single outfit from this movie).\n\nNot to say it’s all just bombastic silliness - some scenes, like the balcony scene, feel genuinely sweet, and oddly ethereal. This movie has such a unique vibe (I honestly feel that euphoria was kinda inspired by it in terms of the atmosphere it manages to create).",
        "upvotes": 1010,
        "comments": 236,
        "media": null,
        "permalink": "/r/movies/comments/1oaunvh/romeo_juliet_1996_absolutely_rules/"
    },
    {
        "id": "1oaxq6q",
        "author": "LiteraryBoner",
        "title": "Snake Eyes (1998, dir. Brian De Palma) Detective Santoro questions the boxer. Featuring Nicolas Cage and Stan Shaw",
        "content": "",
        "upvotes": 557,
        "comments": 51,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o0z28m3674wf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1oaxq6q/snake_eyes_1998_dir_brian_de_palma_detective/"
    },
    {
        "id": "1obf6wd",
        "author": "Alicentscat",
        "title": "His Three Daughters deserved to be recognized",
        "content": "Probably few of you are familiar with His Three Daughters. It was a movie on Netflix last year starring Natasha Lyonne, Elizabeth Olsen and Carrie Coon. I wanted to spread this awareness because it's too good and I remember it wasnt even top 5 movies when it released on Netflix and neither did it get any award.  \nIt currently holds 97/82% on RT and the plot is basically three estranged daughters reunite to take care of their dying father.  \nThe thing about the movie is that from the very first scene you know it's different and it seems almost like a stage play with it's monologues, you truly get into the person's head. All those actresses did one of the best performance I've seen them do ever, but what I truly love about the film is how comforting it is. With it's fall season theming think of Little Women but more personal and quiter.   \nIt's Fall so I really recommend you check it out because that film really deserved the attention it sadly never got",
        "upvotes": 33,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1obf6wd/his_three_daughters_deserved_to_be_recognized/"
    },
    {
        "id": "1obaq6w",
        "author": "CosmosisJones42",
        "title": "What’s one tiny behind the scenes thing that completely changed movie history?",
        "content": "i’ve been thinking about how one tiny decision can flip movie history. like how pulp fiction only exists because tarantino’s first idea for true romance 2 got rejected, or how toy story 2 was almost deleted entirely when someone hit the wrong key, and a backup on one animator’s home computer literally saved it.\n\nstar wars almost fell apart when fox slashed the budget and rushed the schedule, but all those limitations ended up forcing lucas to get creative with models and editing, which gave it that rough, lived-in feel everyone loved. and titanic nearly got shut down halfway through filming because of cost overruns, but cameron gambled everything and pushed through, and it became the biggest movie ever.\n\nit’s wild how much of film history just comes down to luck, chaos, or someone refusing to quit. what’s your favorite little behind-the-scenes thing that ended up changing everything?",
        "upvotes": 71,
        "comments": 116,
        "media": null,
        "permalink": "/r/movies/comments/1obaq6w/whats_one_tiny_behind_the_scenes_thing_that/"
    },
    {
        "id": "1oaxwpk",
        "author": "Myhole567",
        "title": "Times when an actor did Deja-Vu, where they went to the same location twice in 2 unrelated projects.",
        "content": "For example,\n\nClint Eastwood went to Alcatraz twice. The first time, he went over for a bit in 'The Enforcer' (1976). Then he was there as a prisoner for the entire movie in 'Escape From Alcatraz' (1979). \n\nAnother example,\n\nWoody Harrelson sat in the Jeopardy game show audience twice. First time was in Cheers s8 e14 (1990), where Cliff was competing on it and Woody and Norm were sitting in the audience. The second time was in 'White Men Can't Jump' (1992), where Woody's girlfriend Rosie Perez is competing, and Woody is sitting in the audience again with Wesley Snipes. It was the same host Alex Trebek both times.\n\nSo some real Deja Vu stuff.\n\nAny more like these?",
        "upvotes": 408,
        "comments": 156,
        "media": null,
        "permalink": "/r/movies/comments/1oaxwpk/times_when_an_actor_did_dejavu_where_they_went_to/"
    },
    {
        "id": "1ob7xtg",
        "author": "FakeRedditRedditor",
        "title": "Actors your can’t take your eyes off of",
        "content": "\nI’m watching Unlawful Entry with Ray Liotta and Kurt Russell, and I can’t take my eyes off the screen. I’ve never seen it before, but these two are just incredible. There’s a scene where Ray Liotta just stares, and I’m completely locked in — it’s magnetic.\n\nIt’s kind of like walking through a subway station and stumbling across a street musician who’s so good you stop whatever you’re doing just to listen. You can’t help it — they’re that good.\n\nWatching this made me realize how rare that kind of acting feels today. Back then, you had performers who were so captivating you couldn’t look away. Nowadays, it’s like that magic’s gone missing. There is a pedigree of performer that is missing from the American actor. \n\nCan anyone name some recent films or actors who still have that kind of power — that “you can’t look away” energy?\n",
        "upvotes": 102,
        "comments": 201,
        "media": null,
        "permalink": "/r/movies/comments/1ob7xtg/actors_your_cant_take_your_eyes_off_of/"
    },
    {
        "id": "1ob70je",
        "author": "WaltzGrouchy2511",
        "title": "How would you describe Ridley Scott's legacy?",
        "content": "With Scott's upcoming film, **The Dog Stars**, set to be released in theaters on March 2026, it will be the 30th film of his illustrious 49 year career, going all the way back to 1977. Ever since his directorial debut with **The Duelist**, he has directed some of the most memorable films in history. From the ambitious **Blade Runner** to the terrifying **Alien** to the Oscar-winning **Gladiator**, he has some truly great films in his belt. But ever since the Oscar-winning success of Gladiator, his filmography has been up-and-down. He has directed 18 films in 25 years since Gladiator, which is honestly really impressive, and while some have been good, others have not. **The Martian**, **Kingdom of Heaven** (director's cut), **The Last Duel**, and **Prometheus** (despite fans being divided of the movie) have been some of his best work, showing he has no intention of slowing down, even if he's reaching 90. But throughout that great work, there have been some divisive films at best and downright awful films at worst. **Exodus Gods and Kings** was a whitewashed, historically innacurate mess which fumbles its massive potential of retelling one of the most important stories in history. Same with **Napoleon**, and while it's miles better than Exodus, in terms of basically everything lol (expect accuracy, which Napoleon does a bit better, but it isn't saying much), it really didn't live up to expectations as an epic historical biopic about the French commander. And some others like **Robin Hood**, **The House of Gucci**, ect.\n\nI'm a big fan of his work, and I'm sure a lot of you guys are as well, and there will always be his critics. And the criticism he receives is valid, because every filmmaker isn't perfect. That being said, his legacy is undeniable, having redefined the sci-fi genre with Alien and Blade Runner and the attention to detail in his visual style being influential to a new generation of filmmakers who want to approach that same visual style as Scott. But what do you think? ",
        "upvotes": 92,
        "comments": 212,
        "media": null,
        "permalink": "/r/movies/comments/1ob70je/how_would_you_describe_ridley_scotts_legacy/"
    },
    {
        "id": "1oaxgjq",
        "author": "Miserable_Golf6542",
        "title": "Berry Gordy's 'The Last Dragon' Returns to Celebrate 40th...",
        "content": "",
        "upvotes": 282,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Iaf1G4Nd9WB7orsVEpptbNYd3cBHi-kOlMJIIre8wB8.jpeg?auto=webp&amp;s=f559f3a5d698acdf9ce7d3eef033f97c7ed1ddcb"
        },
        "permalink": "/r/movies/comments/1oaxgjq/berry_gordys_the_last_dragon_returns_to_celebrate/"
    },
    {
        "id": "1oabbtx",
        "author": "disablednerd",
        "title": "What’s your under 20% on Rotten Tomatoes “hear me out?”",
        "content": "I’m not talking about your Hooks or Bullet Trains, I’m looking for the hottest of hot takes. \n\nI just watched Ghost Rider: Spirit of Vengeance and I thought it was actually kind of kick ass despite the 18% on Rotten Tomatoes. Nic Cage is suitably unhinged, and the action scenes and production design are manic and over-the-top in a fun way. Directed by the people who brought the Crank movies, if you watched the behind the scenes they put their lives on the line to pull off the stunts. The story is whatever, but are you there for that or to see Ghost Rider piss fire? The only thing missing was a hard R rating but I was entertained and it didn’t overstay its welcome \n",
        "upvotes": 5118,
        "comments": 4445,
        "media": null,
        "permalink": "/r/movies/comments/1oabbtx/whats_your_under_20_on_rotten_tomatoes_hear_me_out/"
    },
    {
        "id": "1obk50m",
        "author": "CorporealGuybrush",
        "title": "The Last Action Hero featurette - Interviews with Arnold Schwarznegger And Crew | 1993",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cVASlwWr1ikMgcUfu0OVpznUINa-Ffj8fGgf7riXtXw.jpeg?auto=webp&amp;s=738610b2a1fef76e3d760208042d2cbf61e52d07"
        },
        "permalink": "/r/movies/comments/1obk50m/the_last_action_hero_featurette_interviews_with/"
    },
    {
        "id": "1obmw37",
        "author": "MrShadowKing2020",
        "title": "Netflix Lands Holiday Comedy ‘The In-Claus’ From Lord Miller And Writer Travis Braun",
        "content": "",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1obmw37/netflix_lands_holiday_comedy_the_inclaus_from/"
    },
    {
        "id": "1oav9pa",
        "author": "SarcasticOptimist",
        "title": "Steve Eisman (who was played by Steve Carrell) discussing The Big Short",
        "content": "",
        "upvotes": 120,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gJ2lO9TO-H3wHVMZjqN2CR6BFxB3-NtZzFcAwqT8cHs.jpeg?auto=webp&amp;s=30ed1de24bbf9fcebf8dea268c0ee7c399d12544"
        },
        "permalink": "/r/movies/comments/1oav9pa/steve_eisman_who_was_played_by_steve_carrell/"
    },
    {
        "id": "1oaq6t4",
        "author": "Sabledude",
        "title": "Movies that answer the “money isn’t everything” plot the best?",
        "content": "Recently went to watch the new Keanu reeves movie Good Fortune. For me it was largely a hilarious comedy that had my theater cackling. But the big plot of the movie I can tell that by the end they did not know how to answer the “why would he give up the money” question. Even in the trailer Keanu says “I gave him money and it solved most of his problems” \n\nThen started thinking about how so many movies cannot land that answer. Another one was the movie the materialists. To make it rational to the viewers why she would choose her broke ex over the rich guy they show like 2 scenes of him being mean to her after like 10 scenes of them going to different high end restaurants having an amazing time.\n\nAny movies you guys think answer the question “money isn’t everything question” ",
        "upvotes": 207,
        "comments": 302,
        "media": null,
        "permalink": "/r/movies/comments/1oaq6t4/movies_that_answer_the_money_isnt_everything_plot/"
    },
    {
        "id": "1objixr",
        "author": "Conscious-Readings",
        "title": "\"Steve - 2025\" and \"Detachment - 2011\"",
        "content": "Anyone thought of the movie Detachment by Adrien Brody when watched Steve?\n\nI don't know where or how to begin, first the rating of the movie Steve, is really .. disappointing .. 6.4?\n\nI love the similarities but also the contrast between both movies! Both have this very dark and heavy mood/atmosphere. Shows how people who care for troubled children is hard and mentally very demanding! You've got to create this mental and psychological wall do you don't take things personally or get angry and loose or loose your patience.\n\nI loved also the contrast between both personalities!! The desperation of each character but also one is very distant (Adrien) and the other who really cares and love those children.\n\nGovernment doesn't give a shit .. people sees those children as trash .. which makes the job of teachers way heavier.\n\nWhat is your opinion??",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1objixr/steve_2025_and_detachment_2011/"
    },
    {
        "id": "1obdm8j",
        "author": "Keffpie",
        "title": "Ethan Hawke as MVP",
        "content": "So, a few years back (I think after Patricia Arquette’s Oscar for *Boyhood*) I read an article either linked from here or actually from Reddit that had calculated that if you wanted to win an Academy Award your best bet would be to have Ethan Hawke in your film. The irony was that he wouldn’t win one, just actors, directors, writers, etc around him. Obviously it was based on active actors only.\n\nDoes anyone out there have any idea the article or post I remember? I’ve looked, but I can’t find it anywhere.\n\n",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1obdm8j/ethan_hawke_as_mvp/"
    },
    {
        "id": "1oawu84",
        "author": "Roasted_Newbest_Proe",
        "title": "Best product placement in movies?",
        "content": "Watching Back to the Future for the nth time, and I hadn't noticed the amount of product placement there is, just the way it's so natural. Toyota, Texaco, Pepsi, Adidas, and more. And it got me thinking, what other movies have this type of well-done product placement?\n\nThere's of course Wayne's World, which is the blueprint for comedy product placemente. Kingsman also does agreat job with it\n\nWhat are your opinions on it?",
        "upvotes": 66,
        "comments": 271,
        "media": null,
        "permalink": "/r/movies/comments/1oawu84/best_product_placement_in_movies/"
    },
    {
        "id": "1obn98k",
        "author": "Beautiful_Rate_2377",
        "title": "Who is your favorite movie villain?",
        "content": "I very like koba, he is basically the oposite of caesar ideals and empathy but you also understand him because he suffered mistreatment in laboratory, he also hates humans but the humans mistreat koba in laboratory, like steven jacobs for example, he also tried to kill caesar by shooting on him, koba is a murderer in ape form",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1obn98k/who_is_your_favorite_movie_villain/"
    },
    {
        "id": "1oabtxv",
        "author": "MarvelsGrantMan136",
        "title": "Simu Liu Reveals a Draft of the Script for the ‘Sleeping Dogs’ Movie is Finished",
        "content": "",
        "upvotes": 1647,
        "comments": 158,
        "media": null,
        "permalink": "/r/movies/comments/1oabtxv/simu_liu_reveals_a_draft_of_the_script_for_the/"
    },
    {
        "id": "1oa7h3i",
        "author": "SanderSo47",
        "title": "Little Miss Sunshine (2006, dir. Jonathan Dayton &amp; Valerie Faris) – Dwayne's breakdown.",
        "content": "",
        "upvotes": 2805,
        "comments": 223,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/78xntjgrqxvf1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1oa7h3i/little_miss_sunshine_2006_dir_jonathan_dayton/"
    },
    {
        "id": "1obmnv3",
        "author": "NeilPoonHandler",
        "title": "Interstellar’s second life: how Christopher Nolan’s most divisive film became his most loved",
        "content": "",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/movies/comments/1obmnv3/interstellars_second_life_how_christopher_nolans/"
    },
    {
        "id": "1obm0sz",
        "author": "rambler_1987",
        "title": "Have you seen movie Anna 2018 - sorry of psychological horror - what do you think about it? What was it - just his imagination?",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1obm0sz/have_you_seen_movie_anna_2018_sorry_of/"
    },
    {
        "id": "1oblvjv",
        "author": "Upstairs-Account-269",
        "title": "question about the Lust kill in Se7en",
        "content": "So did he connect a knife to the end of an attatchable dildo and the man was forced to have sex with her and knifed her to death ?\n\nWhy did the shop owner have that photo of the thing ? no matter how you see it that knife-dildo cannot be used for anything except harming others , why would he even make it for john doe ? ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1oblvjv/question_about_the_lust_kill_in_se7en/"
    },
    {
        "id": "1oblrvc",
        "author": "Zentaitoken",
        "title": "Is it a unspoken rule that when Characters in Movies mention other Movies, they DO NOT mention movies in which one of the characters in the movie is in?",
        "content": "Like in Thor Love and Thunder, they mention Interstellar, in the Scream movies they repeatedly mention other Slashers like Friday the 13th and Halloween, every movie that does this seems to purposely avoid Movies that any of cast members stars in, do they do this because it'd be considered  \"breaking the 4th wall\"? \n\nJust a random thought that popped up",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1oblrvc/is_it_a_unspoken_rule_that_when_characters_in/"
    }
]