[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 481,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1haf6gm",
        "author": "netflix",
        "title": "Netflix received 36 Golden Globes nominations!\n\nCongratulations to Emilia Pérez, Nobody Wants This, Squid Game, Monsters: The Lyle and Erik Menendez Story, Maria, Ripley, Griselda, Black Doves, The Gentlemen, The Diplomat, A Man on the Inside, and Glen Powell who scored his first-ever nomination.",
        "content": "",
        "upvotes": 26,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1haf6gm/netflix_received_36_golden_globes_nominations/"
    },
    {
        "id": "1hguwkt",
        "author": "GaleSTRIK3",
        "title": "La Palma Was Absolutely Ridiculous ",
        "content": "I NEED to know the math behind this wave because there is no way in hell anyone on that plane is in one piece",
        "upvotes": 450,
        "comments": 107,
        "media": null,
        "permalink": "/r/netflix/comments/1hguwkt/la_palma_was_absolutely_ridiculous/"
    },
    {
        "id": "1hh1ulu",
        "author": "Pogrebnik",
        "title": "The Russo Brothers Unleash Sci-Fi Magic in the First Trailer for Netflix's 'The Electric State'",
        "content": "",
        "upvotes": 79,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1hh1ulu/the_russo_brothers_unleash_scifi_magic_in_the/"
    },
    {
        "id": "1hhgcdi",
        "author": "Alan_Stamm",
        "title": "'The Six Triple Eight' Review: Kerry Washington in Inspiring WWII Drama from Tyler Perry",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hhgcdi/the_six_triple_eight_review_kerry_washington_in/"
    },
    {
        "id": "1hhhi5g",
        "author": "Mu5hroomHead",
        "title": "Every American should watch “If Anything Happens I Love You”",
        "content": "America probably has the highest number of school shootings in the whole world. And every time a school shooting happens, it’s all over the news. It ignites conversations about gun control, etc. But in the end, nothing changes.\n\nThis short film portrays the devastation left behind after everyone forgets and moves on. It beautifully shows the destruction left behind. It’s personal, and it’s raw.\n\nI think everybody should watch this short film, especially Americans. Put yourselves in the situation of the parents…",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hhhi5g/every_american_should_watch_if_anything_happens_i/"
    },
    {
        "id": "1hh1m15",
        "author": "baranun",
        "title": "Don't Look Up",
        "content": "Great movie!\n\nI REALLY hope there won't be a giant asteroid coming towards earth in the next 4 years and turn this movie from dark comedy to humanities last documentary.",
        "upvotes": 19,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1hh1m15/dont_look_up/"
    },
    {
        "id": "1hhc4g5",
        "author": "Andoppy18",
        "title": "Was Walter White a Good Marketer?",
        "content": "",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1hhc4g5/was_walter_white_a_good_marketer/"
    },
    {
        "id": "1hhfb2z",
        "author": "Electronic-Fact6618",
        "title": "Help! I can;t seem to download movies and tv shows on my laptop",
        "content": "Title is self explanatory. I am struggling to work out how to download things. I am on a windows 11 laptop and just got Netflix again after a while. If anyone could help me sort it, I would be appreciative.\n\n  \nThanks in advance",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hhfb2z/help_i_cant_seem_to_download_movies_and_tv_shows/"
    },
    {
        "id": "1hhfasf",
        "author": "Sketchtea",
        "title": "Recommend me a good series based on..",
        "content": "I’m looking for a series like arcane, avatar (with the blue people) , re:zero. They all have something in common, pretty sure. Like 2 sides fighting against eachother whilst each side has interesting characters with good lore. Please recommend any series ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hhfasf/recommend_me_a_good_series_based_on/"
    },
    {
        "id": "1hhenad",
        "author": "lukmcl",
        "title": "\"This device is not part of your netflix household\"",
        "content": "I get this error when opening netflix, despite the fact that we don't have a home internet connection, and we don't use Netflix on our TV. It only affects 2 of us, however. Any idea why?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hhenad/this_device_is_not_part_of_your_netflix_household/"
    },
    {
        "id": "1hgjpkg",
        "author": "Alan_Stamm",
        "title": "'Carry-On' Review: Decent Airport Thriller [streaming now]",
        "content": "",
        "upvotes": 137,
        "comments": 119,
        "media": null,
        "permalink": "/r/netflix/comments/1hgjpkg/carryon_review_decent_airport_thriller_streaming/"
    },
    {
        "id": "1hh9qmy",
        "author": "Royal_Difficulty_678",
        "title": "Films / show with British (or European) academic theme? ",
        "content": "I’m looking for shows with an Oxford/ Cambridge or European academic vibe. Similar to the man who knew infinity set in Cambridge or the ones about Turing and Hawkins.  Modern shows like the 3 body problem set at Oxford are good too. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hh9qmy/films_show_with_british_or_european_academic_theme/"
    },
    {
        "id": "1hglzk1",
        "author": "Andoppy18",
        "title": "How Mindhunter’s Marketing Won Critics and True Crime Junkies — But Missed a Mass Audience",
        "content": "",
        "upvotes": 55,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1hglzk1/how_mindhunters_marketing_won_critics_and_true/"
    },
    {
        "id": "1hh4bsc",
        "author": "FakenFrugenFrokkels",
        "title": "Star Trek TNG, Voyager, Enterprise",
        "content": "Hello Netflix Sub I just discovered! I’ve noticed these titles recently showing back up on my app. Is anyone else seeing this? I’m posting because I get an error message any time I try to play them. ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hh4bsc/star_trek_tng_voyager_enterprise/"
    },
    {
        "id": "1hh872c",
        "author": "Yeeting1234",
        "title": "Netflix sharing",
        "content": "If one person of the household is travelling and activates the travel mode (because that person is away from home), can the people still at home keep using netflix?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hh872c/netflix_sharing/"
    },
    {
        "id": "1hh05lz",
        "author": "TechnologyEconomy858",
        "title": "TV error nw-4-7. AND iPhone won't cast thru screen mirror or Netflix app. Does cast thru Chromecast from Pixel",
        "content": "I am stumped.  My wife and I share a Netflix standard account.  She has an iPhone. I have a Pixel.  And we have a 10y/o Sony Bravia TV that is connected via LAN cable to our network.  The TV software is up to date.  The TV has a Chromecast dongle and an Apple TV 'dongle'.  Login functionality has gone waaaaaayy downhill almost across the board and I don't know why.  Not sure if we have one problem or more than one problem.  We didn't change anything.\n\nNetflix app works fine on both our phones.\n\nNetflix will cast to the TV just fine from my phone from within the Netflix app.\n\nNetflix will not cast from her iPhone via screen mirror or from the Netflix app.  When she tries to screen mirror Netflix, it won't let her choose our TV...the device selection is blank.  She can screen mirror all other apps to the TV just fine, so this is only a Netflix issue.\n\nWe tried accessing Netflix from within the Apple TV interface.  She scanned the QR with her phone.  Her phone said she was all set while the Apple TV interface said it had trouble signing her in, Code 113.  Why the mismatch?\n\nNetflix will not start on the TV.  It tries to, then gives an error code nw-4-7.  I've reset the TV Internet content, run the Netflix diagnostics (\"Netflix server 2...nw-4-7\"), reset the Netflix app on the TV, cleared Netflix account cache via online instructions and done everything I can access from within the Netflix app,,the Netflix app on the TV and anything else within the TV ...all to no avail.  I updated our wifi mesh software.   Every other TV app works fine, and we have no trouble with computers or our phones on our wifi.  All network things have been turned off and on to reset.  No connectivity issues were found in TV self diagnostics.\n\nI don't even mind buying a new TV (😂) but based on our symptoms I don't think that will fix the issue.  \n\nThoughts from the group?  Please and thank you 🙂 Happy holidays! ",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1hh05lz/tv_error_nw47_and_iphone_wont_cast_thru_screen/"
    },
    {
        "id": "1hhelup",
        "author": "rachiepants2017",
        "title": "Anyone else enjoying this season of Queer Eye? I love this cast!",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hhelup/anyone_else_enjoying_this_season_of_queer_eye_i/"
    },
    {
        "id": "1hhg0sw",
        "author": "angela4512",
        "title": "Kordell Beckham Reveals Sweet Piece of Advice NFL Star Brother Odell Beckham Jr. Gave Him While Starring on 'Love Island USA'",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hhg0sw/kordell_beckham_reveals_sweet_piece_of_advice_nfl/"
    },
    {
        "id": "1hhfzhg",
        "author": "Optimal-Topic1830",
        "title": "I know money talks, but I’m so over streaming TV and the constant cancelling of shows.",
        "content": "There should be a rule/law where streaming networks must pick up a show for two seasons, at least, and then can make the decision to cancel it after that. I feel like there are too many shows out there now that were never given the chance to grow its audience. ",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1hhfzhg/i_know_money_talks_but_im_so_over_streaming_tv/"
    },
    {
        "id": "1hh52rd",
        "author": "MrPink0612152504",
        "title": "All she needed was the love he gave",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/fsdptsfttm7e1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1hh52rd/all_she_needed_was_the_love_he_gave/"
    },
    {
        "id": "1hgf38t",
        "author": "Njbryan13",
        "title": "La Palma",
        "content": "Is the worst show I’ve ever loved to watch the whole thing of. Omg is the show horrible but lord knows I had to watch it from beginning until the end because of how horribly great it was done. Wtf. ",
        "upvotes": 65,
        "comments": 112,
        "media": null,
        "permalink": "/r/netflix/comments/1hgf38t/la_palma/"
    },
    {
        "id": "1hg765b",
        "author": "Whobitmyname",
        "title": "Netflix’s One Piece Season 2 Reportedly Wraps Filming",
        "content": "",
        "upvotes": 247,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1hg765b/netflixs_one_piece_season_2_reportedly_wraps/"
    },
    {
        "id": "1hgtarz",
        "author": "Zealouscat_94",
        "title": "Carry On",
        "content": "I just watched this movie and something that I wonder about is what happened to the woman with the blue hair? It seemed apparent that she was in on the scheme as well but nothing seemed to happen to her.",
        "upvotes": 8,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1hgtarz/carry_on/"
    },
    {
        "id": "1hhcmj7",
        "author": "OSTBear",
        "title": "\"Carry-On\" is amazing and is going in my Christmas Movie Rotation",
        "content": "In the spirit of Die Hard movies, this is going down as a classic Christmas movie for me.\n\nBateman's performance is incredible. If you had told me the guy from \"Horrible Bosses\" and \"The Change up\" would make a great terrorist I'd have laughed my ass off at you. Guy has way more range than I realized, even after Ozark.\n\nIt's the perfect blend of action and hoakieness and it's going to be a favorite of mine for a long time.\n\nAnyone with me?",
        "upvotes": 0,
        "comments": 25,
        "media": null,
        "permalink": "/r/netflix/comments/1hhcmj7/carryon_is_amazing_and_is_going_in_my_christmas/"
    },
    {
        "id": "1hgqgjq",
        "author": "beansrgud12343",
        "title": "Soul crushing animated shows",
        "content": "I need some really heart breaking animed show recommendations, I’ve already watched arcane and edgerunners and I want to know more shows similar to them",
        "upvotes": 5,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1hgqgjq/soul_crushing_animated_shows/"
    },
    {
        "id": "1hgwze9",
        "author": "ACunit41guy",
        "title": "Netflix glitch, it stopped listing shows that I was watching up until last week, like it thinks I am in another country.",
        "content": "I live in the US and have only ever watched content from my netflix account here in my home. For some reason Netflix seems to think I am in another country, as in it has stopped showing results for shows that I know are available in the US. Any ideas on what could be happening?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hgwze9/netflix_glitch_it_stopped_listing_shows_that_i/"
    },
    {
        "id": "1hfoujk",
        "author": "anonRedd",
        "title": "'A Man On The Inside' Renewed For Season 2 By Netflix",
        "content": "",
        "upvotes": 658,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1hfoujk/a_man_on_the_inside_renewed_for_season_2_by/"
    },
    {
        "id": "1hgu9rs",
        "author": "playdesegaymes",
        "title": "Auto Play Volume too Loud",
        "content": "Sometimes I watch Netflix on my PC and i have many things going at once Everything has different volumes and i have my system volume set about 35% of the way. Literally every program lets me designate the volume that i would like Discord lets you literally adjust individual people volume in call. \n\n  \nNetflix however you can adjust the volume of what you are watching but when you mouse over something it blasts you with the loudest preview ever. I like the preview but is it too much to ask for a universal volume setting for netflix. It can't be that hard. I'm sure a junior dev could whip something up in 30 mins. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hgu9rs/auto_play_volume_too_loud/"
    },
    {
        "id": "1hgefoi",
        "author": "VerGuy",
        "title": "Guy Ritchie Expands 'The Gentlemen' Universe to Include 'Wife &amp; Dog' [All]",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1hgefoi/guy_ritchie_expands_the_gentlemen_universe_to/"
    },
    {
        "id": "1hghzzu",
        "author": "Kongopop",
        "title": "Question about extra members",
        "content": "I have standard.  I want to add my father who is in a different house.  Does the extra member still count towards using the \"only 2\" screens on Netflix at a time rule?  I b guessing that's how it works just want the answer ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1hghzzu/question_about_extra_members/"
    },
    {
        "id": "1hgghri",
        "author": "Additional-Active-40",
        "title": "Something wrong with my subtitle fonts. ",
        "content": "I tried changing the font from the normal 'block' font to the 'casual' font, but when I restart and check my Netflix, it comes out as another type of font. I don't know why it's happening. \n\n[This is the font that shows up](https://preview.redd.it/7byppej96g7e1.png?width=539&amp;format=png&amp;auto=webp&amp;s=9f4a15c91953b37b39595a68f3a255d7ae5abf3a)\n\n[This is the settings that I put in](https://preview.redd.it/4hgye0rd6g7e1.png?width=729&amp;format=png&amp;auto=webp&amp;s=a1f4a95737ef726ba222cad4e4344ef0b517951a)\n\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1hgghri/something_wrong_with_my_subtitle_fonts/"
    }
]