[
    {
        "id": "1jthmnj",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&amp;#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 30,
        "comments": 3669,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jthmnj/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1jwiqpd",
        "author": "SixFeetBlunder-",
        "title": "On this day 7 years ago",
        "content": "",
        "upvotes": 302,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/a0k7zpv695ue1.jpeg?auto=webp&amp;s=22e069edfa9dfec3b16c832f801288278a897690"
        },
        "permalink": "/r/realmadrid/comments/1jwiqpd/on_this_day_7_years_ago/"
    },
    {
        "id": "1jw9gyx",
        "author": "Professional_Mode440",
        "title": "I'll Always Believe.",
        "content": "",
        "upvotes": 239,
        "comments": 29,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/b5juyw5it2ue1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jw9gyx/ill_always_believe/"
    },
    {
        "id": "1jwbxfm",
        "author": "Messi_1812",
        "title": "Raul saved the FUTURE of Madrid",
        "content": "",
        "upvotes": 135,
        "comments": 12,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rtwy6opmd3ue1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jwbxfm/raul_saved_the_future_of_madrid/"
    },
    {
        "id": "1jw3yxc",
        "author": "HowHeStandOn10Perc",
        "title": "Former Real Madrid manager Leo Beenhakker passes away at age 82",
        "content": "",
        "upvotes": 279,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/WG8FbpVLeUBFMfqoNQ40coXRXxyZqcXN3JNP9HXh1Xw.jpg?auto=webp&amp;s=eca77b966db6272d7641a45cb51c6c20c4ff24c5"
        },
        "permalink": "/r/realmadrid/comments/1jw3yxc/former_real_madrid_manager_leo_beenhakker_passes/"
    },
    {
        "id": "1jvvwdz",
        "author": "VelvtThunder",
        "title": "The state of this sub right now",
        "content": "",
        "upvotes": 701,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ehcnndgiwzte1.jpeg?auto=webp&amp;s=e2b2d3e588a91623cc06a4932b233cb0e97caa6b"
        },
        "permalink": "/r/realmadrid/comments/1jvvwdz/the_state_of_this_sub_right_now/"
    },
    {
        "id": "1jw4sdf",
        "author": "muaazmuaaz123",
        "title": "Who is your fav and best real Madrid winger excluding cr7",
        "content": "",
        "upvotes": 195,
        "comments": 149,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jw4sdf/who_is_your_fav_and_best_real_madrid_winger/"
    },
    {
        "id": "1jwhl5i",
        "author": "Traditional_Animal65",
        "title": "There seems to be a prevailing opinion blaming Alaba for yesterday's defeat",
        "content": "I disagree with that. While Alaba wasn't exemplary, I don't think he did that bad &amp; I believe the blame should be directed towards others.\n\nAlaba wasn't bad yesterday except for the foul on Saka that resulted in a goal from the free kick.\nHe kept Saka under control, and the only time Saka went through the defense was when Alaba went over to mark Odegaard and left Saka to bellingham. Saka went through bellingham easily and Alaba tried to sprint back. Luckily, Saka just crossed the ball, and it resulted in nothing.\n\nNow, let's talk about Alaba's tackle on Saka that resulted in the goal:\nThis tackle was made far from Alaba's position. He had to cover for the fact that certain midfielders were not doing much defensive duty (Camavinga in particular). Camavinga made a tackle in this similar position in Saka later in the match, and what do you know? He almost got red carded &amp; resulted in the 2nd goal for Declan.\n\nThe third goal was also the result of shambolic defensive midfield performance. There was far too free space for the opponents, and I don't know what to say about it. But you can see what I'm getting at.\n\n\nNow to the other question:\nWhy was the midfield easily overrun against Arsenal? I believe the answer is:\n\n1. They were outnumbered because our front line failed to fall back and support them, particularly in the 2nd half.\n2. Modric doesn't have the lungs anymore, and Valverde wasn't in the midfield to compensate for that.\n3. Camavinga is tactically illiterate and has zero sense of where to position himself. This is why he's been so bad this season. The man failed to improve since his first season. In fact, I think there's a good case for saying that he has regressed.\n4. Bellingham's workrate seems to have been worsening game after game. Particularly since January.\n\nThis is why Ceballos was so effective when played and manage to help this midfield immensely.\nHe has better tactical sense &amp; decision making, better passing range, and at least a similar workrate to Camavinga. We need Ceballos in that midfield.\n\nI do not understand how a coach like ancelotti, who went through something similar to this in 2014/2015, doesn't see this.",
        "upvotes": 22,
        "comments": 43,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jwhl5i/there_seems_to_be_a_prevailing_opinion_blaming/"
    },
    {
        "id": "1jwbs4l",
        "author": "jajaisklar",
        "title": "Will Vini, Mbappé &amp; Rodrygo ever work?",
        "content": "Individually the three are world class, no question. On a good day, they can turn a defense upside down. But my believe is, to be successful in the long run an to win titles, the attack needs to be complementary - and the three are simply not.\n\nLet’s face it: In their core they are all LW and in particular Vini &amp; Mbappés strenghts (and weaknesses) are too similar. In contrast (and I hate to say that) look at Barcas Raphina, Lewa &amp; LY, how they fit perfectly together and tick all the boxes an attack has to from my point of view.\n\nThe ugly truth in my opinion is: Unfortunately one of them has to go. I have an unpopular opinion who  that should be, but what do you think: Will we win titles with the three? ",
        "upvotes": 53,
        "comments": 99,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jwbs4l/will_vini_mbappé_rodrygo_ever_work/"
    },
    {
        "id": "1jw7o8c",
        "author": "RealMood8898",
        "title": "What is your problem with camavinga? You must not be Madrid fans",
        "content": "I understand this season he has been bad but why are people in the subreddit acting as if Cama has never played good for Real Madrid ? This is Cama first bad season for Madrid. Have you guys forgotten the player he is? It as if you guys have never seen him play. Some of you saying he has only had one good season is crazy some of you saying he hasn’t improved is crazy. This is his first bad season but if you want him to leave the team you are not a Madrid fan. This guy at his best is capable of being a top 5 midfielder in the world he has been a huge part of our comeback in 2022 and a huge part of the success we had last year. I would argue this guy hasn’t even been able to reach his potential because our manager consistently benches him even after good performances and this was last year and he consistently plays him out of position. I agree Cama deserves critism for this season because he has been disappointing regardless of injuries. but let’s not start acting as if he has shown nothing or done nothing to help this team. True Madrid fans know what this guy is capable of and we are all waiting for him to find that confidence back and find his form",
        "upvotes": 63,
        "comments": 119,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jw7o8c/what_is_your_problem_with_camavinga_you_must_not/"
    },
    {
        "id": "1jvuiip",
        "author": "zblbolapills",
        "title": "Trent is a freak of nature. Cannot stress how difficult it is to execute a pass like that. To play that at full sprint, hitting it first time while it's still bouncing, with that kind of delicate ball control, weight and accuracy? Our forwards will be having a feast.",
        "content": "",
        "upvotes": 349,
        "comments": 76,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/qp3tt2qdfzte1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jvuiip/trent_is_a_freak_of_nature_cannot_stress_how/"
    },
    {
        "id": "1jw8ek9",
        "author": "ManuMora98",
        "title": "[Basket] Important win in the last game of the Regular Season, 89-91 against Partizan with 2 points from Tavares in the last second, that leaves us chances to get to the play-offs without having to play the play-in (it depends of the results of tomorrow's games).",
        "content": "",
        "upvotes": 48,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/h76v5gkdl2ue1.jpeg?auto=webp&amp;s=efd49e72682b2b6968a97fd218dd7453c83cefda"
        },
        "permalink": "/r/realmadrid/comments/1jw8ek9/basket_important_win_in_the_last_game_of_the/"
    },
    {
        "id": "1jw15i8",
        "author": "Messmers",
        "title": "Seeing all the players post before the game on social media",
        "content": "",
        "upvotes": 113,
        "comments": 13,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/rec99p2m31ue1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jw15i8/seeing_all_the_players_post_before_the_game_on/"
    },
    {
        "id": "1jvqvrm",
        "author": "Ok-Fold6928",
        "title": "Win or Lose, Don Carlo is a Legend of the Highest Order",
        "content": "Maybe it's time for a change, but a manager who has won 3 out of 5 UCLs and reached the semi-finals in all five with us deserves a respectful farewell.\n\nIt's crazy how some people think Carlo is an idiot and Pep is a genius—meanwhile, Pep loses the UCL year after year, despite having the most balanced and stacked squad, plus a free hand to sign almost any player he wants.\n\nCarlo Ancelotti gave us everything he had. Maybe it's not enough anymore—but hearing fans talk about him like he's the most useless piece of trash is just heartbreaking. Some people are truly ungrateful, entitled, lowlifes, and it's sad to see.\n\nAnd the irony is, for most of them if they saw him in real life, they'd be begging him for a selfie just so they could show it off to their friends and feel better about their lives.\n\nShow some dignity and grace. If you're upset because your friends are trolling you, grow up already. Did you really think you were going to win everything for the rest of your life? You're watching sports—sometimes you win, sometimes you lose. Most people learn that by the age of five.\n\nI think the man is doing his best. And if his best is no longer enough, we part ways respectfully. There's no need to insult him",
        "upvotes": 520,
        "comments": 83,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k1cxr9w3zxte1.jpeg?auto=webp&amp;s=8cf33a38a6f949323afa4abe4aea0dd1ed2daf2b"
        },
        "permalink": "/r/realmadrid/comments/1jvqvrm/win_or_lose_don_carlo_is_a_legend_of_the_highest/"
    },
    {
        "id": "1jw9e6z",
        "author": "Lekanswanson",
        "title": "I hope the match against Arsenal is proof of how important Mendy is to our defence and just how much he does with barely any help.",
        "content": "Mendy is a player that gets a lot of criticism simply because he's not Marcelo. That's literally the biggest reason all the plastic fans don't like him, because he doesn't have flair like Marcelo or dribble like Marcelo but you know one thing he does better than Marcelo, that's defend which is something he is greatly under appreciated for considering this is a team without Casemiro so he usually on most occasions has to defend in a 1 v 1 against some of the best wingers in the world but he gets beat once than\nIf Mendy has been playing yesterday or even Fran, Saka has a much more quiet night than he did and yes even though I don't think Fran is as good as Mendy defensively, even though he's better offensively, he would have have still done much better than Alaba. This also goes to show how important Tchouameni is because even though Camavinga has lots of energy and is quicker, his positional awareness is nowhere near Tchouameni which would have been crucial in that midfield battle. Modric should never have started.\n\nI just hope players like Mendy and Tchouameni and even Fran can take their game to the next level if we eventually do get a manager that will help them develop their game beyound their own natural ability the way Klopp did for a lot of the youths that came through the Liverpool academy of Flicki for Raphina",
        "upvotes": 29,
        "comments": 46,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jw9e6z/i_hope_the_match_against_arsenal_is_proof_of_how/"
    },
    {
        "id": "1jvtn7x",
        "author": "Emergency-Hornet-594",
        "title": "Only 1% chance of winning according to Opta Analyst",
        "content": "Ah shit, here we go again.",
        "upvotes": 258,
        "comments": 114,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/79xk7v1f6zte1.jpeg?auto=webp&amp;s=518d04e2c004bcb1de9a6af1818afbfeb6cdfda7"
        },
        "permalink": "/r/realmadrid/comments/1jvtn7x/only_1_chance_of_winning_according_to_opta_analyst/"
    },
    {
        "id": "1jw36wv",
        "author": "tefftlon",
        "title": "Similarities of 14/15 and 24/25 seasons.",
        "content": "The previous season, Ancelotti leads Madrid to a big CL title along with a domestic trophy. \n\nThat summer a big name attacker joins the team, and an important midfielder with a wide passing range leaves without being replaced. \n\nDespite concerns, the team is in a good position at the halfway point. Then injuries and fixture congestion starts to take its toll. The team just is unable to play well.\n\nThe season ends without any major silverware. Ancelotti is sacked. The favorite to replace him is a former Spanish midfielder who was once at the club. ",
        "upvotes": 53,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jw36wv/similarities_of_1415_and_2425_seasons/"
    },
    {
        "id": "1jvq8bc",
        "author": "Ok-Fold6928",
        "title": "Fifteen times and counting",
        "content": "",
        "upvotes": 319,
        "comments": 9,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xhp9422cyxte1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jvq8bc/fifteen_times_and_counting/"
    },
    {
        "id": "1jwkxh7",
        "author": "Datrael",
        "title": "Bring Back 99/00 jerseys and track suit are now available",
        "content": "[https:\\/\\/shop.realmadrid.com\\/content\\/jerseys-kits\\/ltd-edition](https://preview.redd.it/5wegoijh16ue1.png?width=1914&amp;format=png&amp;auto=webp&amp;s=605e5a5ed892e7509b15807ccd5bbf3fa6bf2416)\n\nBeautiful, beautiful kits. Real madrid website says the away kit comes bigger sized than normal but the adidas website states that the fit is regular and to choose your usual size. In any case, the kits and track suit are now available in both the official Real Madrid store and the adidas website. \n\nJust a heads up as I was really looking forward to these and would personally hate to have missed out.",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jwkxh7/bring_back_9900_jerseys_and_track_suit_are_now/"
    },
    {
        "id": "1jv2cd0",
        "author": "Ecstatic-Light-3699",
        "title": "Nahh Seriously WHAT THE F*CK",
        "content": "",
        "upvotes": 9157,
        "comments": 328,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/p534in9rbste1.jpeg?auto=webp&amp;s=c05d9b6ae3362c09720f34eec46df43cdf2f5203"
        },
        "permalink": "/r/realmadrid/comments/1jv2cd0/nahh_seriously_what_the_fck/"
    },
    {
        "id": "1jvw2nf",
        "author": "Worried_Payment_8660",
        "title": "We Need To Talk About Jude In This Team",
        "content": "Jude has been the most important player in this squad both this season and last. Vini insane last season and Valverde now but Jude shades both for me and should have won the Ballon d’or last year due to those national performances with a dysfunctional England team too, if he was properly backed and not Vini. That's not important though. This season, the way he’s been contributing across every area of the game is something we rarely see, not just in Madrid but anywhere in world football. He’s been asked to do practically everything: controlling the midfield, creating chances, scoring goals, defending, pressing, covering for fullbacks—it’s a long list, and he’s consistently delivered in all of them. But while his versatility is a huge asset, the way he’s been used recently hasn’t always brought out his best qualities.\n\nTake the first leg against Arsenal. He was dropped into deeper and wider roles to try to stabilize a shaky midfield, and while he put in a shift and performed, like he always does, it limited his ability to dictate the game or contribute in the final third. Compare that to matches like Valencia or Real Sociedad, where he was positioned more centrally and advanced. In those games, he created chances, controlled the tempo, linked up with the attack, and even got into the box to score. We’ve seen that when he’s given freedom to play higher up the pitch, the team looks far more dangerous and cohesive.\n\nWhat makes Jude stand out, though, isn’t just his versatility. It’s the level he’s performing at in every part of the game—defending, passing, creating, finishing, pressing, and more. He’s the midfielder who plugs gaps everywhere, filling roles his teammates can’t, and yet he’s still delivering at an elite level in his own right. Look at his press-resistance, for instance: in tight games where opponents try to suffocate our midfield, Jude is often the one who finds a way through with his composure and technical skill. Add to that his workrate, his physicality, and his ability to make late runs into the box, and it feels weird sometimes how we can’t win games more easily.\n\nThis is part of why Jude hate baffles me. When he’s asked to play higher up, people complain about a lack of midfield control. When he’s tasked with more defensive running, it’s “where are the goals and assists?” But the reality is, Jude is taking on more responsibility than almost anyone else in the team, and often he’s compensating for gaps in the system or poor performances around him. Other midfielders are given clear roles and expectations; Jude is the one making up for deficiencies everywhere. The idea he has PR at this point or is any way overrated baffles me considering takes on him get wilder by the day and media and fans go out of their way to drag him after any bad Madrid performance regardless of how he did or if he does anything that shows literally any emotion or even media skills. Guess it’s just playing for Madrid though\n\nThis is exactly why the system has to be built around him. Not in a way that overburdens him, but in a way that lets him influence the game where it matters most—controlling the midfield, creating chances, and being a goal threat, all while being supported by a cohesive structure that doesn’t demand he do everything at once. When the team gives him the freedom and support he needs, he lifts everyone else around him.\n\nIf we want to secure big wins at all like completing a comeback against Arsenal, winning all the big games we just get owned in like the CDR final, or comfortably winning those smaller ones as we should, it’s going to depend on Jude being at the heart of things. Not as a utility player filling holes wherever needed, but as the focal point of a system that maximizes his strengths and builds around the best midfielder itw. Love Carlo for all he’s done but this season it’s been on him plenty and why I imagine someone else could do a better job along with many other flaws in this team.",
        "upvotes": 64,
        "comments": 96,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jvw2nf/we_need_to_talk_about_jude_in_this_team/"
    },
    {
        "id": "1jvud9g",
        "author": "Traditional_Animal65",
        "title": "The fans exonerate Ancelotti",
        "content": "In a vote of 14,162 readers of AS, \n\n53% blamed the management for poor planning for the season, \n30% blamed the players, \nAnd only17% blamed the coaching staff\n\nWhat do you think?\n",
        "upvotes": 83,
        "comments": 90,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/96VgIWiOVLQDvhhEhOsyjhQ_KW1e_HRaPfE93dG61R0.jpg?auto=webp&amp;s=a75ff220794c8b3ab5bfeb9f03a241bf97f1ae36"
        },
        "permalink": "/r/realmadrid/comments/1jvud9g/the_fans_exonerate_ancelotti/"
    },
    {
        "id": "1jverty",
        "author": "supplementarytables",
        "title": "Camavinga on Instagram",
        "content": "",
        "upvotes": 1147,
        "comments": 59,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4blgc7ed4vte1.png?auto=webp&amp;s=ca34740724349f901d49bc0e44e247855690460f"
        },
        "permalink": "/r/realmadrid/comments/1jverty/camavinga_on_instagram/"
    },
    {
        "id": "1jvu7pm",
        "author": "Pebbledthoughts",
        "title": "Arda Guler 2024/25 | Flowing like Water",
        "content": "",
        "upvotes": 53,
        "comments": 17,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6jjasa4hdzte1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jvu7pm/arda_guler_202425_flowing_like_water/"
    },
    {
        "id": "1jvjfru",
        "author": "EffectiveTie3144",
        "title": "Happy Birthday to club legend Roberto Carlos da Silva Rocha🇧🇷",
        "content": "",
        "upvotes": 368,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jvjfru/happy_birthday_to_club_legend_roberto_carlos_da/"
    },
    {
        "id": "1jvty55",
        "author": "Total_Escape_9778",
        "title": "Ronaldo also recorded 19 Goals and 2 Assists in 15 UCL QF Games for Real Madrid... We need a performance like that from mbappe to save us in the next leg 😭",
        "content": "",
        "upvotes": 48,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8n00o23o9zte1.png?auto=webp&amp;s=4f5097b93a9f3bf717afa1b4547e5fbd49a39d84"
        },
        "permalink": "/r/realmadrid/comments/1jvty55/ronaldo_also_recorded_19_goals_and_2_assists_in/"
    },
    {
        "id": "1jvb4me",
        "author": "Ready_Ad_1353",
        "title": "Thibaut Courtois on Rice's 2 goals: \"For the 1st goal, I could have put an extra man in. But I thought Rice wouldn't get as much curl on it. I take responsibility for that. For the 2nd goal, it's absolutely perfect. They were unnecessary fouls by some [Alaba &amp; Bellingham], when there was no danger\"",
        "content": "",
        "upvotes": 746,
        "comments": 63,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7k327qfydute1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jvb4me/thibaut_courtois_on_rices_2_goals_for_the_1st/"
    },
    {
        "id": "1jv2ma9",
        "author": "Immediate-Drink2196",
        "title": "Just gonna leave this here",
        "content": "Let's all drown our sorrows next week, when it's all over. \n\n\nThat is if it's all over.... ",
        "upvotes": 2181,
        "comments": 378,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/4xt3w889fste1.jpeg?auto=webp&amp;s=1cc238e9befe440e055b226f3408f8fe564f8d26"
        },
        "permalink": "/r/realmadrid/comments/1jv2ma9/just_gonna_leave_this_here/"
    },
    {
        "id": "1jv617e",
        "author": "NRaw27",
        "title": "Bro knows something we don’t",
        "content": "",
        "upvotes": 1155,
        "comments": 91,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ht46s33xbtte1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1jv617e/bro_knows_something_we_dont/"
    },
    {
        "id": "1jvmupi",
        "author": "Different_Craft5237",
        "title": "The board dealt us a shit hand, and expected the manager to pull a rabbit out of his hat, for the 2nd year straight.",
        "content": "Could Carlo had better managed the team this season. Yes, maybe be more rigid in terms of discipline, tactics, game subs. But my god, you're telling me the same manager who just 1 season ago, won the double with 2Ls all season all of a sudden forgot how to coach ? Come on now people, let's not be this naive.\n\nAll wee needed to do in the summer of 2024 was make 4 transfers to plug in for the departures and maybe 1 extra.\n\n\\- Kroos leaving meant we had to get another CM/CDM who's is actually similar. No need for yet another tall, physical lad like Tchouameni. Someone with a Kimmich/Zubimendi kind of profile. A guy who may not be the most physical, or defensively sound, but can dictate our tempo.\n\n\\- Nacho left. It still blows my mind on why he didn't pay the extra money for Yoro. Counting on Alaba and Militao to return especially with how insane this season's schedule is was a foolish gamble. And thank god we somehow found Asencio to promote.\n\n\\- Joselu left. Instead of replacing him with literally any no name #9. Didn't need to be Kane or Lewandowski level. Any tall guy who with experience would've worked. Instead they give us a unproven 5\"6 prospect. I can understand, Kane being old, a huge transfer fee would not make sense, but ffs. Sorloth after scoring that quadruple against us, we should've signed him immediately knowing Joselu was leaving. He would've gel with the squad 1000x better.\n\n\\- Carvajal getting old. This one has been a problem since like 2018. Carvajal having no actual backup. We always see the moment he's injured, the team struggled, cause we then had no natural RB. These cracks used to be partially covered by Nacho, but he left too. So now we got stuck with a RW having to play there. No fault of LV, but he's just not a RB. Period.\n\n\\- WE DID NOT NEED MBAPPE. As phenomenal of a talent as he may be, he was NEVER what that team needed, especially after seeing Vinicius progressing so much. What would've been better ? a pacey left footed winger. Yes, we have Guler but the kid has zero pace and is more of a CAM. \n\n  \nLast year, we got dealt the same shit hand after Benzema left. Carlo begged for them to sign Kane. Instead, they gave him Jude. What does he do ? He switches our formation entirely to accommodate for it. Having Jude playing as false 9 due to his eye for goal. People like to say \"It's Jude's individual brilliance in the 1st half of the season...\" As if Jude was a CDM scoring all his goals from 30 yards longshots. Meanwhile, Carlo was the one who set up the tactics to put the lad in those positions in the first place. \n\nLast year, the team even through early injuries from Courtois, Alaba, Militao, we still had balance and variety.  If the front two did not work, sub one out and bring Joselu. Now we have a tall guy to cross to, which made our attacks much more dynamic. \n\nPeople like to remember the 2016-2017 team for being \"stacked\" but the reality is the team was just so balanced and deep. Zidane could literally play 3 diff formations at will with 3 distinct tactics. Not just because he's a top manager but because he had the personnel to do so.\n\n\\- 433 : with KCM and BBC in front\n\n\\- 41212 : with Isco at CAM and Benzema - CR7 up top (sometimes even Morata - CR7)\n\n\\- 442 : with young Asencio and Vazquez at wings cause they can track back more.\n\nUltimately we can put as much blame on Ancelotti as we want, but making him a scapegoat and letting the board get away with their shit squad planning scoot free is so naive. Cause no matter how much some of you will hate to admit it, bring any other of these so called tactical managers here and give him the same hand our board gave Carlo and he's failing too. \n\nPeople are glazing Flick, he already told Laporta he wants Nico Williams, and their board is probably cooking their books as we speak to make the transfer happen. Pep after Rodri got injured, and KDB and some of his CBs, the City board 200M in the winter transfer. Our managers ask for players, get told to fuckoff X-Y-Z galactico we don't even need at that time is coming, deal with it. And when the unbalanced team fails, the only head rolling is the manager's, of course.\n\nAnyways, Carlo is leaving at the end of the season most likely. And even if for some weird reason, he's not sacked or wtv, if the board does not properly address all the gaping holes in this squad, I'd resign, just like Zidane. Cause him too was made to be the fall guy meanwhile every time he requested a transfer they told him to fuck off. People all want Xabi to come, me too. But if the board does not adjust they way they plan their squad, they'll just set him up for failure and sabotage him just like they did with Zidane and Ancelotti.\n\nPeople are worried about Ancelotti, I'm more worried about the broad committing the same sequence of mistakes they made in the 00s when they let Makelele leave in order to bring Beckham cause $$$$. And then proceeded to make every manager the scapegoat by sacking them when in reality it was a team balance issue solely on them.",
        "upvotes": 97,
        "comments": 45,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jvmupi/the_board_dealt_us_a_shit_hand_and_expected_the/"
    },
    {
        "id": "1jvpub1",
        "author": "Danickcoolman",
        "title": "Probably an uncomfortable conversation.",
        "content": "I want to have a conversation with all of you about Ancelotti, but I also want to speak about Real Madrid as a unit. I’ve seen us play since the beginning of the season and I’ve seen a lot of people on this subreddit say that “if you want Ancelotti to leave, then you’re ungrateful” when in reality I think that having such an opinion about the Don is not being ungrateful, it’s a matter of looking at what he’s doing with this team on a weekly basis and coming to the inevitable realization that Ancelotti cannot continue as Madrid manager. \n\nFirst of all, I believe that we should all thank Ancelotti for what he has done with Madrid. We were in an awful place coming into the 21/22 season and we finished with a champions league, a super copa and LaLiga. But the unfortunate truth is that a lot of this success comes down to individual brillance. Now, before you start saying that it isn’t, we need to make something clear. There is individual brillance in a well organized team with a coach that has a tactic in mind like for example Flick’s Barca and Lamine Yamal and there’s individual brillance in a non cohesive unit, so Ancelotti’s Madrid. If you watch the games every week instead of basing your opinions on rating apps, you will immediately notice that the problem with this Madrid team is that there is no cohesion, we are playing without an identity, a game plan or crucial tactics. I believe that when a team loses, the manager AND the players are at fault, but the manager has a lot of responsibility because he sets up his team in the way that he wants them to play and implements tactics to make his players better. \n\nThe game versus Arsenal demonstrates what a manager with a tactical vision can do against the other that has no idea what is going on anymore. It’s time to actually wake up guys, seriously. We get outplayed by the likes of Sociedad, Espanyol, Betis, a Milan side who lost 3-1 to Liverpool, Dortmund, Valencia at home, Barcelona, Bilbao and even Lille. Has there been a single game against a big team that Real Madrid won this season while looking good? And before you say Dortmund or even Manchester City, no they do not count. Dortmund was a reaction by the players where the individuality came out and Vini managed to score that hattrick and that Manchester City side is a horrendous team who is worse than us so us being slightly better than them was in our favor. The rest, humiliation after humiliation. It’s something that has been happening with Ancelotti’s Madrid but the simple fact that he has been winning titles is enough to blind the eyes of the masses so that people calling themselves Madrid fans will callout other fans ungrateful for wanting the manager to leave when **everyone** who watches the games can see that there’s nothing going on with this team anymore. He changes the formation every time, going from a 4-4-2 to a 4-3-3 to a 4-2-3-1, he refuses to put obvious starters over very average players who show week in and week out that they do not have the level to play for this club anymore and he doesn’t want to play Arda Guler or Bobby in matches where we need creativity and someone willing to press, someone willing to make runs in behind and contribute to the team. Everyone knows that David Alaba and Lucas Vazquez do not have the level to play for this club anymore but Ancelotti still wants to deploy the both of them as his fullbacks? Did he not see the disasterclass of Alaba against Sociedad who was about to score a hattrick of own goals? Did he not realize for the entirety of the season that any winger with a decent amount of dribbling skills can beat Vazquez and that he leaves huge gaps in behind, making it easier for the team to counterattack? It’s been the same thing with Ancelotti since the beginning of this season, he refuses to use simple logic and goes with his reasoning even though it’s obvious that it won’t work. A lot of criticism that Ancelotti gets is deserved and the majority of the time, it’s coming from Madridistas that want this team to succeed but aren’t deluded because their team wins games then and there. We do not play well and that’s undeniable.\n\nBut Ancelotti is not going to be the only point of my critique. Like I said, when a team loses, the players and the manager will be blamed and this team, almost none of them can escape what’s next. Courtois is the only one that I can’t criticize because he has saved this team and Ancelotti so many times that he very much deserves to be called a Real Madrid legend. Lucas Vazquez needs to respect himself and leave this club at the end of the season because he’s a liability in defence. Offensively, he still has his game IQ so he knows when to make a pass, when to make a run or when to cross, but defensively it’s catastrophic. He gets too high on the pitch but can’t run back so it lets the opposition team a lot of space to counter, he can’t mark his man in set pieces and he gets beaten by nearly anyone in a 1v1. When I mean anyone, he was getting beaten by Pachuca’s wingers in the Intercontinental cup final, guys that up to that competition, no one knew about. Out of the 9 goals Barcelona scored against us in the two matches, **five** of them comes from Lucas Vazquez’s side, so clearly even Flick knows that he is our weakest point in defence. Rüdiger this season has been really poor and Alaba at LB is a topic that I will not discuss anymore, Modric is too old to be starting in physically intense matches like these and the Fantastic Four showed once again why it’s not working out. It won’t work out because Ancelotti puts Bellingham as a LWB to help Alaba against Saka, the same thing that he did against Barcelona but on a lesser scale and you can even use the heat maps to justify this point. Vinicius has been in a really poor form recently, Rodrygo is downright non existent and Mbappe is the only one trying to do something right now.\n\nYou can agree or disagree with me, but I stand by what I say. This team needs a new project, a new manager who’ll give the team an identity with a tactical vision and it also needs help from Perez and the board. It’s nice to have stars in one team, but when you refuse to see the truth and think that Madrid will always win in the end even after such poor performances every week, you need to start asking yourselves the good questions. Even if we somehow win against Arsenal, do not be fooled and forget the entire season.",
        "upvotes": 49,
        "comments": 33,
        "media": null,
        "permalink": "/r/realmadrid/comments/1jvpub1/probably_an_uncomfortable_conversation/"
    }
]