[
    {
        "id": "1iu5ib9",
        "author": "BunyipPouch",
        "title": "Join us Friday 2/21 at 3PM ET for an AMA/Q&amp;A with the directors (Sam Crane, Pinny Grylls) &amp; actor (Mark Oosterveen) of Grand Theft Hamlet - Two struggling actors find solace from lockdown isolation by staging Hamlet in Grand Theft Auto Online, battling griefers as they connect through Shakespeare.",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9zvl09pg2cke1.jpeg?auto=webp&amp;s=992b0449c9560b7760fc09c8e3c051f116fa3905"
        },
        "permalink": "/r/movies/comments/1iu5ib9/join_us_friday_221_at_3pm_et_for_an_amaqa_with/"
    },
    {
        "id": "1itlqyx",
        "author": "LiteraryBoner",
        "title": "Oscar Bingo XII Submission Thread",
        "content": "#Welcome to Oscar Bingo XII. I'll be your host, [LiteraryBoner](https://images.fineartamerica.com/images/artworkimages/mediumlarge/3/well-dressed-animal-10-lizard-matthias-hauser.jpg). For over a decade now we keep coming back to this silly game in which **YOU, the users** suggest things that might actually happen at the live ceremony of the Academy Awards. Then our friends over at www.print-bingo.com create us a game card generator so we can all play in real time on March 2nd.\n\nOkay, let's get in to it!\n\n* [Last year's submission thread](https://www.reddit.com/r/movies/comments/1b3c4fv/official_oscar_bingo_submission_xi_thread/)\n* [Last year's card pickup thread](https://www.reddit.com/r/movies/comments/1ba54d1/oscar_bingo_game_card_pickup_thread_xi/)\n* [Last year's game thread](https://www.reddit.com/r/movies/comments/1bbnpzr/oscar_bingo_game_thread_xi/)\n* [List of nominees for this year](https://www.oscars.org/oscars/ceremonies/2025)\n\nHere's how it works!\n\n**Submit ideas for things that might happen during the Oscars.**\n\n* **Max 80 characters** as to fit on in the bingo squares\n\n* Do **NOT** put more than one submission in a single comment. That cannot be voted on properly and will be removed. \n\n* Live ceremony only, no red carpet or off camera awards\n\n* Predicting specific wins, such as Emilia Perez wins Best Picture, will not be considered as they limit possibilities (And who wants to wait until the final five minutes to get a Bingo?)\n\n* Please try and keep submissions within reason and not too specific. \n\n* Use the list of presenters to try and guess what the bits or featured films will be!\n\n* This thread will be randomized and votes hidden. If there's lots of suggestions be sure to refresh a few times or scroll for a bit to spread the love!\n\n**Once we have collected submissions for a couple of days, we will un-sticky the thread and start to make game cards with your suggestions. Our friends over at *www.print-bingo.com* will again be doing some specialty work with us for this.**\n\n* We will post a gamecard pickup thread the Friday before the Oscars (the 28th). All you will have to do is follow the link in the thread, do the captcha, and a small link will appear to your gamecard PDF. \n\n**We'll post the game thread Oscar Sunday. The point of the Game Thread is to discuss game related things and for me to make final decisions on the more open to interpretation squares. It will be stickied as will all these threads.**\n\n---\n\nHost:\n\n* Conan O'Brien\n\nList of presenters:\n\n* Robert Downey Jr.\n* Da'Vine Joy Randolph\n* Cillian Murphy\n* Emma Stone\n* Halley Berry\n* Penelope Cruz\n* Elle Fanning\n* Whoopi Goldberg\n* Scarlett Johansson\n* John Lithgow\n* Amy Poehler\n* June Squibb\n* Bowen Yang\n* Joe Alwyn\n* Sterling K. Brown\n* Willem Dafoe\n* Ana De Armas\n* Selena Gomez\n* Lily-Rose Depp\n* Goldie Hawn\n* Connie Nielsen\n* Ben Stiller\n* Oprah Winfrey\n\n\n#Submit in the comments and have fun!",
        "upvotes": 6,
        "comments": 57,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rUj9cNUXRKL6B7MpVtPHZfMrpba0Sp-qw_Huw363WaM.jpg?auto=webp&amp;s=1eb25b8818ed611b0682bb57ab397f9aee0bb190"
        },
        "permalink": "/r/movies/comments/1itlqyx/oscar_bingo_xii_submission_thread/"
    },
    {
        "id": "1itzbtm",
        "author": "MarvelsGrantMan136",
        "title": "James Bond Shocker: Amazon MGM Gains Creative Control of 007 Franchise as Producers Barbara Broccoli and Michael G. Wilson Step Back",
        "content": "",
        "upvotes": 14695,
        "comments": 3486,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/E9XNJM055Chu4IF7kHwhMPK4HPo95wF6MyXpTz-uSVs.jpg?auto=webp&amp;s=f2e18b3b5a9d1608454080e27e86e505a0732ae8"
        },
        "permalink": "/r/movies/comments/1itzbtm/james_bond_shocker_amazon_mgm_gains_creative/"
    },
    {
        "id": "1iu8h3w",
        "author": "KillerCroc1234567",
        "title": "Amazon MGM Studios Shelled Out An Extra $1 Billion-Plus To Take Control Of James Bond: What’s Next For The Franchise",
        "content": "",
        "upvotes": 1072,
        "comments": 381,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wD5N4VGwtt4Vy47e7om3PVTf2OGV6xolDeE-3TqxuMU.jpg?auto=webp&amp;s=72baacf2c86f4e42079bb60ea3eb9b906d248451"
        },
        "permalink": "/r/movies/comments/1iu8h3w/amazon_mgm_studios_shelled_out_an_extra_1/"
    },
    {
        "id": "1itz5sn",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for A24's 'Warfare'",
        "content": "",
        "upvotes": 2422,
        "comments": 604,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/69y4nw64wake1.jpeg?auto=webp&amp;s=5e66d53459adacdec1dc45503854886182385fa6"
        },
        "permalink": "/r/movies/comments/1itz5sn/new_poster_for_a24s_warfare/"
    },
    {
        "id": "1iu4qdi",
        "author": "NoCulture3505",
        "title": "Apple’s Miles Teller-Anya Taylor Joy-Starrer ‘The Gorge’ Becomes Streamer’s Biggest Movie Launch",
        "content": "",
        "upvotes": 950,
        "comments": 328,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GNyeBk34chdM_6GXFkbinJkGyXMJr5jNLGyTa7cM-qg.jpg?auto=webp&amp;s=a5822227a3224b29c07aa60f122e9a6c19f017f5"
        },
        "permalink": "/r/movies/comments/1iu4qdi/apples_miles_telleranya_taylor_joystarrer_the/"
    },
    {
        "id": "1itwy7k",
        "author": "MaxProwes",
        "title": "I noticed this before, but Demolition Man (1993) feels like Paul Verhoeven's movie that wasn't directed by Paul Verhoeven. Great satire, darky funny, awesome villain and entertaining as hell, everyone should watch it",
        "content": "",
        "upvotes": 2021,
        "comments": 404,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sMtBevQwcFsX6PGDphsMKVIe1Q0p6Cc_HX1uRhxqZPc.jpg?auto=webp&amp;s=1f3f1bb576f01edbbfddded00c59c0e12b030642"
        },
        "permalink": "/r/movies/comments/1itwy7k/i_noticed_this_before_but_demolition_man_1993/"
    },
    {
        "id": "1iu45nb",
        "author": "ChiefLeef22",
        "title": "DiCaprio, Scorsese Crime Movie In Works With Dwayne Johnson &amp; Emily Blunt",
        "content": "",
        "upvotes": 693,
        "comments": 348,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Kk1Rb24vDTKBgj_XQN-H9R8b8G_AdMMJ7be7AMkDluU.jpg?auto=webp&amp;s=be4cd1320efa1c8eb27519402bc9e7412549967c"
        },
        "permalink": "/r/movies/comments/1iu45nb/dicaprio_scorsese_crime_movie_in_works_with/"
    },
    {
        "id": "1iu0kpc",
        "author": "lawrencedun2002",
        "title": "Netflix Unveils $1 Billion Mexican Investment Over the Next 4 Years",
        "content": "",
        "upvotes": 625,
        "comments": 72,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GdaArz6Spd1J_zDPJWBLocUarQFcNhPuBoXen2c109A.jpg?auto=webp&amp;s=c5b091fb7077911aa38ac7526fbc1f0940c778f8"
        },
        "permalink": "/r/movies/comments/1iu0kpc/netflix_unveils_1_billion_mexican_investment_over/"
    },
    {
        "id": "1iu67jl",
        "author": "Puterboy1",
        "title": "Are there any movies where you wanted the villain to win?",
        "content": "For me it was Captain Hook in the 2003 adaptation of Peter Pan because he is the most sympathetic and I felt sorry for him having to deal with a cocky little cunt like Peter Pan. Then there was the movie Chupa with Dr. Quinn trying to capture Chupa so he could use his blood to revolutionized medicine. That doesn’t sound too bad to me, but the guy never took his time to explain why to the kids as to why he wanted to capture the creature and they viewed him as a devil who needed to be stopped.\n\nWhat’s your example of this?",
        "upvotes": 170,
        "comments": 381,
        "media": null,
        "permalink": "/r/movies/comments/1iu67jl/are_there_any_movies_where_you_wanted_the_villain/"
    },
    {
        "id": "1iu0iyd",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Locked' Starring Bill Skarsgård and Anthony Hopkins - A thief breaking into a luxury SUV realizes that he has slipped into a sophisticated game of psychological horror",
        "content": "",
        "upvotes": 347,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vbpwxqh67bke1.jpeg?auto=webp&amp;s=65e95acc5461f78e39ed193efaee99488e7e6f63"
        },
        "permalink": "/r/movies/comments/1iu0iyd/official_poster_for_locked_starring_bill/"
    },
    {
        "id": "1itl5xc",
        "author": "MarvelsGrantMan136",
        "title": "Daniel Craig Drops Out of DC Studios War Movie ‘Sgt. Rock’",
        "content": "",
        "upvotes": 4876,
        "comments": 311,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yH3pCFOZcRnQ6azgpDObLoMiGpfcT3e9jm_xChxNGho.jpg?auto=webp&amp;s=4258eac19a035db9cde13ba69ccbeaca4a49ebb1"
        },
        "permalink": "/r/movies/comments/1itl5xc/daniel_craig_drops_out_of_dc_studios_war_movie/"
    },
    {
        "id": "1iu9od5",
        "author": "Heavy-Sequence999",
        "title": "Bleakest, most emotionally devastating film you've ever seen? As for me, I have to go with Dennis Hopper's 1980 film \"Out Of The Blue\".",
        "content": "For those that haven't seen that movie, I can really only recommend it to people who are in a good enough place emotionally to handle it, because oh boy... that was a very tough watch.  Fantastic movie though.\n\nWondering what other movies come to mind for you that are in a similar vein.  I think \"Funny Games\" somewhat approached that level of bleakness, but \"Out Of The Blue\" just felt so *real* in comparison that it really reached in and wrenched my heart in a way that a movie never has before.",
        "upvotes": 100,
        "comments": 462,
        "media": null,
        "permalink": "/r/movies/comments/1iu9od5/bleakest_most_emotionally_devastating_film_youve/"
    },
    {
        "id": "1itwt79",
        "author": "vitcorleone",
        "title": "Movies where characters are stuck in a place because of weather conditions?",
        "content": "There is a huge snowstorm coming where I live so I am looking for movies with the same vibes! \n\nBodies Bodies Bodies comes to my mind. Not exactly looking for movies like The Thing or Shining or The Day Before Tomorrow, looking for less science fiction-y movies\n\nCould be murder mystery where the characters can’t leave the place until the weather gets better or stuff like that:) \n\nYou could also name a tv show episode! \n\nAll comments appreciated, thank you in advance ☺️ ",
        "upvotes": 356,
        "comments": 728,
        "media": null,
        "permalink": "/r/movies/comments/1itwt79/movies_where_characters_are_stuck_in_a_place/"
    },
    {
        "id": "1iubkin",
        "author": "Fan387",
        "title": "Souleymane Cissé Dies: Trailblazing Malian Director Was 84",
        "content": "",
        "upvotes": 50,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rMhd0RGdeKwjdDDYHsZoTaR0vv0-1-QVyj1jNjeAplo.jpg?auto=webp&amp;s=700f8b1d554f50079649227d0499ba52ddb7b115"
        },
        "permalink": "/r/movies/comments/1iubkin/souleymane_cissé_dies_trailblazing_malian/"
    },
    {
        "id": "1iu3nx5",
        "author": "TheBigShaboingboing",
        "title": "Al Pacino fans, what film was his best performance in your opinion?",
        "content": "I recently finished watching “Heat” last night, and just wow. Is this guy something or is he something?! First time I watched an Al Pacino film (yes, I know, uncultured swine I am). Him and Robert De Niro stole the show, played off of each other very well. \n\nI know there are plenty of Al Pacino gems that I need to watch on the list, but what’s a performance of his that you hold in the highest regard? I’m stuck between wanting to view “The Devil’s Advocate” or “Scarface” next before I dive into “The Godfather” Series\n\nAny suggestions are appreciated, thank you!",
        "upvotes": 128,
        "comments": 570,
        "media": null,
        "permalink": "/r/movies/comments/1iu3nx5/al_pacino_fans_what_film_was_his_best_performance/"
    },
    {
        "id": "1iu70jd",
        "author": "KombaynNikoladze2002",
        "title": "Picnic at Hanging Rock review – Australian fever dream still dazzling 50 years on",
        "content": "",
        "upvotes": 72,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bmlPYwnMhCLzMJt6j9Subt7SlSWBaZcNhbIl2PdVidQ.jpg?auto=webp&amp;s=5385678b18cb016536938d7b6817900e915b106e"
        },
        "permalink": "/r/movies/comments/1iu70jd/picnic_at_hanging_rock_review_australian_fever/"
    },
    {
        "id": "1itbdyk",
        "author": "MarvelsGrantMan136",
        "title": "First Image of John Krasinski in the New 'Jack Ryan' Movie",
        "content": "",
        "upvotes": 9413,
        "comments": 1228,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i497pk7ot4ke1.jpeg?auto=webp&amp;s=bbf6dde1c9013599813cc612d3a16d3f2a4bd57d"
        },
        "permalink": "/r/movies/comments/1itbdyk/first_image_of_john_krasinski_in_the_new_jack/"
    },
    {
        "id": "1itzwh2",
        "author": "SignificanceFun265",
        "title": "Coneheads was a much better movie than it should have been",
        "content": "Considering that it was based on some silly SNL sketches, you'd think this movie would have been a long SNL skit. But no, this movie had heart and amazing set design. The costumes were great, and any scene involving the Coneheads' house were packed with details. This wasn't some low effort spin off, the production team put effort into the movie and the dialog. There are so many little gags, from Jason Alexander's toupee to Beldar's weird naked body, it's a movie you can watch multiple times and appreciate something new. And nowadays, it's fun to see all the cameos from a very successful SNL cast at the time. Dan Aykroyd holds nothing back. And when they arrive at Remulak, scene of them flying into the atmosphere still looks good today (unlike most movies today using lazy CGI).\n\nI still don't know why it was panned at the time. I know critics hate comedies, since comedy is much harder to pull off than drama, but the movie is much more than its contemporary reputation.",
        "upvotes": 141,
        "comments": 70,
        "media": null,
        "permalink": "/r/movies/comments/1itzwh2/coneheads_was_a_much_better_movie_than_it_should/"
    },
    {
        "id": "1iu3t5o",
        "author": "HM9719",
        "title": "Disney and 20th Century Studios to celebrate the 60th anniversary of “The Sound of Music” with major theatrical re-release and 4K Blu-Ray release later this year; marketing campaign launching March 2",
        "content": "Per Press Release:\n\n“This March 2, 2025 will mark 60 years since the tunes of Rodgers &amp; Hammerstein brought theatrical hills alive with the cinematic treasure The Sound of Music. This year, fans of all ages will experience the heart-warming sights and sing-along sounds of the classic film in a beautifully restored and remastered version to be released in 4K image resolution, courtesy of the precise work endeavored by the Walt Disney Film Restoration team. Over the course of 9 months, the restoration team oversaw digital scanning of preserved film footage and expert clean-up efforts to correct any dirt, warping or other issues encountered. “Our team is honored to care for and re-deliver this classic film to audiences around the world so they can enjoy it in all its originally intended visual and audio glory,” says Kevin Schaeffer, Director, Restoration &amp; Library Management. Weaving artistic skills with innovative technology in a process more delicate than the petals of an edelweiss, the 60th anniversary restoration of The Sound of Music sings with both vibrant color and resounding melody, sharing the cinematic legacy anew for generations to come.\n\n“This enhanced version of The Sound of Music is a testament to the enduring power of this iconic masterpiece. As we enter the 60th year, the restoration will safeguard our beloved classic for generations to come,” says Imogen Lloyd Webber, who oversees the Rodgers &amp; Hammerstein brand as EVP Marketing and Communications for Concord Theatricals and Originals.\n\n \n\n“The Walt Disney Company couldn’t be a better partner to bring to life an amazing international celebration of The Sound of Music’s enduring and meaningful impact on culture,” adds Sophia Dilley, EVP of Concord Originals.”",
        "upvotes": 81,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UDjoFHLn7n_qCk2OekKPnIthZWuK5qkK5PLnViToA3s.jpg?auto=webp&amp;s=0b74c5312ae01d46a441ece24d5ae66f88b3deb7"
        },
        "permalink": "/r/movies/comments/1iu3t5o/disney_and_20th_century_studios_to_celebrate_the/"
    },
    {
        "id": "1iueekg",
        "author": "J94aep",
        "title": "23-year-old guy who loves romance movies—any other men out there who genuinely enjoy them?",
        "content": "Hey everyone,\n\nI’m a 23-year-old guy, and I absolutely love romance movies. I’ve enjoyed them since I was a kid, and my love for the genre has only grown over the years. My mom introduced me to romance movies when I was young, especially Nicholas Sparks films, and over time, I developed a real appreciation for them. I genuinely enjoy watching the dynamic between two people falling in love, seeing their connection grow, and admiring the emotions and chemistry between them.\n\nFor as long as I can remember, I’ve had a strong idea of what romance should be. Even when I was 8, I saw something beautiful in how two people could love each other, and that perspective hasn’t changed. Romance movies give me that feeling of admiration, both for the relationship itself and for the way different characters evolve emotionally.\n\nThat being said, I’ve noticed that a lot of people, especially other men, tend to call me “gay” for liking romance movies. I’m not, but it’s frustrating that people assume that just because I enjoy love stories. It makes me wonder if a lot of guys out there secretly enjoy romance movies but just don’t admit it because of how others might perceive them.\n\nSo I wanted to ask—are there any other men here who genuinely love romance movies? If so, what got you into them, and what do you love about them? Would be great to hear from others who feel the same way!",
        "upvotes": 18,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1iueekg/23yearold_guy_who_loves_romance_moviesany_other/"
    },
    {
        "id": "1itrzmu",
        "author": "WerdNerd88",
        "title": "Remember Joe's Apartment (1996) starring Jerry O'Connell? One of the worst movies of the 90s",
        "content": "https://youtu.be/CuGs9GyMIVI?si=XsEDPxmesPx_C-T3\n\nOr is it best that this movie remains forgotten?\n\nA guy who just moved to New York City rents an apartment that's infested with thousands of intelligent talking cockroaches. They talk. They sing. They even have their own secret cockroach TV channels complete with public access shows and cockroach porn. They decide to help Joe with his love life.\n\nI remember watching Roger Ebert review this movie and slowly lose his mind talking about how much he hated it.",
        "upvotes": 518,
        "comments": 216,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GTPV533CVseZ3LYzTt7uvwT8sD1WWLpIsl0pOoE_SHE.jpg?auto=webp&amp;s=0f8b8c1676a9991912e66367f7847a946c3ff41d"
        },
        "permalink": "/r/movies/comments/1itrzmu/remember_joes_apartment_1996_starring_jerry/"
    },
    {
        "id": "1iu7w7q",
        "author": "indiewire",
        "title": "Jessica Chastain and Michel Franco on Their Berlin Scorcher ‘Dreams,’ Blocking Sex Scenes, and Her Daring, Unlikable Role (Interview)",
        "content": "",
        "upvotes": 31,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xZ-lfGGssJdjn0MS7IFEs4QNHsaTz9l2Kt57NUcqAh8.jpg?auto=webp&amp;s=4e13816f6606e1f20dae1a4689580524f87a2f82"
        },
        "permalink": "/r/movies/comments/1iu7w7q/jessica_chastain_and_michel_franco_on_their/"
    },
    {
        "id": "1itd7dh",
        "author": "mille73",
        "title": "What movie could you not maintain your suspension of disbelief?",
        "content": "Suspension of Disbelief is when we ignore logical thought to enjoy superhero movies, superhuman assassins, romantic comedies, animatronic serial killers, aliens, and the like.\n\nMost recently Ridley Scott's Gladiator II took me right outta the game.\n\nDid Riddley Scott really ask himself, what was the first Gladiator missing and come up with &gt;!SHARKS! Fucking Sharks. He really said we need great white sharks in the Colosseum! I have never jumped back into reality so fast.!&lt;\n\nMe and my husband paused the movie because we just had to take the time to digest what we were watching. We even tried to Mythbuster this to see if it's even plausible and all we could come up with was &gt;!that someone had to raise baby great white sharks. But everyone knows great whites don't survive in captivity. Was ancient Rome even capable of building a tank big enough to support multiple sharks. what about one shark? And if they weren't in captivity then fishermen caught them? and then transported them to the Colosseum? Nah. Not to mention, the next day the arena was bone dry.!&lt;\n\nI really can't remember when a movie irked me this much. I am very for suspension of disbelief; I WANT to enjoy the story. But that was just too much for me. So what whacky scene took you right outta the movie.",
        "upvotes": 2778,
        "comments": 3010,
        "media": null,
        "permalink": "/r/movies/comments/1itd7dh/what_movie_could_you_not_maintain_your_suspension/"
    },
    {
        "id": "1iu0mem",
        "author": "NoCulture3505",
        "title": "Official Poster for \"Clown in the Cornfield\"",
        "content": "",
        "upvotes": 49,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vmc6qfdx7bke1.jpeg?auto=webp&amp;s=253a2a238404c2692627369b02e45d72a987aec0"
        },
        "permalink": "/r/movies/comments/1iu0mem/official_poster_for_clown_in_the_cornfield/"
    },
    {
        "id": "1ityhc0",
        "author": "zerocool4406",
        "title": "Great movies from the 80's. What would you suggest?",
        "content": "I grew up in the 80's, so I'm probably a bit biased in saying it was the greatest time for movies (in fact, probably everything 😅). But I was thinking of the movie Tango and Cash for movie night at the weekend. Now, it's nowhere near the top of my movie list, but it's still a great film. Any movies you think are deserving of a watch, that wouldn't necessarily be top of your list, but still great none the less. You can pick as many as you like. 🙂",
        "upvotes": 66,
        "comments": 401,
        "media": null,
        "permalink": "/r/movies/comments/1ityhc0/great_movies_from_the_80s_what_would_you_suggest/"
    },
    {
        "id": "1iue5a3",
        "author": "arashtp",
        "title": "Christopher Nolan on directing James Bond",
        "content": "",
        "upvotes": 9,
        "comments": 8,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/JUR0xndPDWbvT2_RGrwcIwLyMZPiHO8QGOL-6CFeyNE.jpg?auto=webp&amp;s=7cd782d426dcf6fa1b28851d907c548b29ecb08b"
        },
        "permalink": "/r/movies/comments/1iue5a3/christopher_nolan_on_directing_james_bond/"
    },
    {
        "id": "1itys4d",
        "author": "soalone34",
        "title": "Oscars Best Documentary Feature breakdown: ‘No Other Land’ is a vulnerable frontrunner",
        "content": "",
        "upvotes": 54,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Y0uAwjLdpv3gJPbz2UOAnQFpp9_5E-HodJsUjzx95NA.jpg?auto=webp&amp;s=da163dab3ad085e1b0321f62b10c50cd3fa19f2d"
        },
        "permalink": "/r/movies/comments/1itys4d/oscars_best_documentary_feature_breakdown_no/"
    },
    {
        "id": "1itnxhc",
        "author": "decaffeinatedcool",
        "title": "Cold Wallet (2024) A team of Redditors lose everything after a cryptocurrency scam leads them to plot to kidnap the \"financial influencer\" who screwed them over.",
        "content": "",
        "upvotes": 370,
        "comments": 96,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aoa2S3hUsvhTTgQ6vFeTb7p98ukItrH0KNUX-V7u9Rw.jpg?auto=webp&amp;s=a218bd3489735e27bc3e57de6ba22763502e17e9"
        },
        "permalink": "/r/movies/comments/1itnxhc/cold_wallet_2024_a_team_of_redditors_lose/"
    },
    {
        "id": "1iucxyi",
        "author": "KillerCroc1234567",
        "title": "David Leitch Teaming with Amazon MGM, Imagine for Heist Action Thriller",
        "content": "",
        "upvotes": 7,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Jffehvi5wymncP2ZgNMkNUPKVyTQP68UGoizXim-4kI.jpg?auto=webp&amp;s=e2c00f104b37634e6ed48503535cfa1734debb8c"
        },
        "permalink": "/r/movies/comments/1iucxyi/david_leitch_teaming_with_amazon_mgm_imagine_for/"
    },
    {
        "id": "1it6gw6",
        "author": "NoCulture3505",
        "title": "Cheech &amp; Chong's Last Movie [Official Trailer]",
        "content": "",
        "upvotes": 3112,
        "comments": 168,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ir5GnYlPfvxX6QzVDOy5fkomnOpAz0CsbEvS7La9VTE.jpg?auto=webp&amp;s=f5f03f8d8bbb10afeb158aa65fb58f8a733a8004"
        },
        "permalink": "/r/movies/comments/1it6gw6/cheech_chongs_last_movie_official_trailer/"
    },
    {
        "id": "1iu5y6g",
        "author": "KillerCroc1234567",
        "title": "Mckenna Grace, Fred Armisen, Bobby Lee and Sean Gunn Join Green Day-Inspired Comedy Movie",
        "content": "",
        "upvotes": 16,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FY_N6i4p84e4sZQIWDM1-kRZAK1caJiGgsiL5s1gx1Y.jpg?auto=webp&amp;s=1c7d41cee5f9be2bc291a0164dd2000afd7ae9f8"
        },
        "permalink": "/r/movies/comments/1iu5y6g/mckenna_grace_fred_armisen_bobby_lee_and_sean/"
    }
]