[
    {
        "id": "1r66ovz",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 19,
        "comments": 3855,
        "media": null,
        "permalink": "/r/realmadrid/comments/1r66ovz/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1rb06df",
        "author": "scoreboard-app",
        "title": "Post Match Thread: Osasuna vs Real Madrid",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1rb06df)",
        "upvotes": 64,
        "comments": 702,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rb06df/post_match_thread_osasuna_vs_real_madrid/"
    },
    {
        "id": "1rbwlc8",
        "author": "Resident-Stretch9723",
        "title": "Ronaldo vs Osasuna | 2012",
        "content": "",
        "upvotes": 862,
        "comments": 73,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hzozw72ou3lg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rbwlc8/ronaldo_vs_osasuna_2012/"
    },
    {
        "id": "1rblun3",
        "author": "7dek",
        "title": "Vini was seen telling Mbappé to make more runs into the box yesterday against Osasuna",
        "content": "",
        "upvotes": 932,
        "comments": 142,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/98amag7ls1lg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rblun3/vini_was_seen_telling_mbappé_to_make_more_runs/"
    },
    {
        "id": "1rbmipx",
        "author": "7dek",
        "title": "Vini after dribbling past the opposition's rb then looking up to see. Mbappé 40 yards away in the midfield chilling with tchouaméni:",
        "content": "",
        "upvotes": 730,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3wafbnf0y1lg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rbmipx/vini_after_dribbling_past_the_oppositions_rb_then/"
    },
    {
        "id": "1rbqez7",
        "author": "AgeKay93",
        "title": "Blame the midfield all you want, this is the main reason this team is unable to perform.",
        "content": "",
        "upvotes": 338,
        "comments": 131,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/n3s068haq2lg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rbqez7/blame_the_midfield_all_you_want_this_is_the_main/"
    },
    {
        "id": "1rbp2h9",
        "author": "No-Independent2522",
        "title": "Interviewer to Carlo : Has anything like what happened with Xabi and Vini ever happened to you?",
        "content": "Ancelotti in a latest interview : “Once I took Kroos out and he got angry. The next day I didn’t speak to him. We ran into each other before going out onto the field. I asked him, do we talk about what happened yesterday or is it over? And he said, it’s over.”\n\n………………………………………………………………………………………………………………",
        "upvotes": 342,
        "comments": 100,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tzeyg2v1h2lg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rbp2h9/interviewer_to_carlo_has_anything_like_what/"
    },
    {
        "id": "1rbnegs",
        "author": "Messmers",
        "title": "This isn't normal anymore, why is he all the way there? We desperately need box presence (esp now that Jude is out) and he insist on being anywhere BUT the box",
        "content": "",
        "upvotes": 283,
        "comments": 63,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2smieo1r42lg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rbnegs/this_isnt_normal_anymore_why_is_he_all_the_way/"
    },
    {
        "id": "1rbhyf0",
        "author": "MrFreedom133",
        "title": "Does Mbappe lacks this type of movements and awareness ?",
        "content": "",
        "upvotes": 582,
        "comments": 124,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zsvfwlllq0lg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rbhyf0/does_mbappe_lacks_this_type_of_movements_and/"
    },
    {
        "id": "1rbu1l7",
        "author": "Bijay12356",
        "title": "Last Season Madrid vs This Season Madrid",
        "content": "Real Madrid this season so far:\n\n- 38 games\n- 27 wins\n- 8 losses \n- 3 draws\n\nReal Madrid at this time last season:\n\n- 42 games\n- 29 wins\n- 7 losses\n- 6 draws\n\nCarlo had Lucas at RB. Everybody knows that time defense was much worse than this time. If we had had some luck on our side last season, then we could have won the CDR. We disrespected our greatest coach so much last season 🥲🥲",
        "upvotes": 83,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zahsyg4ee3lg1.jpeg?auto=webp&amp;s=d350f50e09eb890db248899bb9ad64f83987599c"
        },
        "permalink": "/r/realmadrid/comments/1rbu1l7/last_season_madrid_vs_this_season_madrid/"
    },
    {
        "id": "1rbs118",
        "author": "Kavazou77",
        "title": "I think it’s a good time to re emphasize what this club is and how despite all, talent has always won out through rough patches",
        "content": "It seems this season has had an uptick in fans trickling in and flooding the sub with very reactionary, and agenda-driven posts. \n\nIt’s normal that with social media and Madrid having some of the most recognizable names on the planet in their squad, the 2023 UCL run would have brought a massive increase in supporters. I’ve seen many of the OP’s here have relatively new accounts or just be younger in general. \n\nI point this out because I think to any fan that’s been following this team a while, you’ll know that this is yet another cycle, during another era, in Madrid history. The story of this club keeps repeating itself because of how it’s run and it’s what’s made it the best sports club to ever exist. \n\nI am not diminishing or gatekeeping any fans’ attachment and loyalty to the club, new or old. I’d just like to put into perspective for some who are new or who have forgotten what this club is and always will be.\n\nThis club will: \n\n\\- Always have the best or most marketable player on the planet, despite having other positional needs.\n\n\\- Go through 10 managers before they question if any stars are the problem. \n\n\\- Always build a squad around talent rather than system. \n\n\\- Never have a manager bigger than its stars. \n\n\\- Never spend money in the winter.\n\n\\- Never prioritize homegrown talent. \n\nThese are the basics that have been true since the 90s. If you are okay with this, then this is the club for you. \n\nAs an aside…I suggest that before a reactionary post is made, you look up the history of the Zidane, R9, Beckham era. A lot of y’all wouldn’t have survived that era. ",
        "upvotes": 77,
        "comments": 53,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rbs118/i_think_its_a_good_time_to_re_emphasize_what_this/"
    },
    {
        "id": "1rbo91l",
        "author": "DamnThatsInsaneLol",
        "title": "I think its time to give up on Mbappe as a #9. He overlaps too much with Vini and doesn't make runs into the box like he's supposed to. We should try him out at RW and see how it goes imo. He's played there before",
        "content": "https://preview.redd.it/o5z9wbmu82lg1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=38abcd5ee478c7de48e622d5fc9a984efccbe310\n\nIdeally we should be setting him up similar to how he was at the France national team. He was paired up with a traditional striker (Giroud) which allowed him to roam to the left &amp; cut in when needed. We can't do that now because Vini is undroppable apparently, plus he's in good form right now. \n\nThe only other solution (that allows both Vini &amp; Mbappe in the pitch without them overlapping) is putting Mbappe at RW with Gonzalo or Endrick as striker. Endrick is on loan ofc, so Gonzalo it is. Its worth a try imo. He's played there before &amp; was great at it. He was a RW during the 2018 World Cup which France won.\n\nOfc in such a scenario, Valverde will have to cover for Mbappe's low defensive contributions, but Valverde is a workhorse and can manage it imo. Selling either one of Mbappe or Vini is unrealistic. This seems to be the best choice imo.",
        "upvotes": 56,
        "comments": 71,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rbo91l/i_think_its_time_to_give_up_on_mbappe_as_a_9_he/"
    },
    {
        "id": "1rbljlc",
        "author": "cyrusmancub",
        "title": "Dani Ceballos suffered an injury against Osasuna and will be out for 7 weeks",
        "content": "",
        "upvotes": 78,
        "comments": 40,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rbljlc/dani_ceballos_suffered_an_injury_against_osasuna/"
    },
    {
        "id": "1rc4gkc",
        "author": "Galego_ACB",
        "title": "[Basketball] Real Madrid lost against Baskonia (89-100) in Copa del Rey final",
        "content": "",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rc4gkc/basketball_real_madrid_lost_against_baskonia/"
    },
    {
        "id": "1rbpcma",
        "author": "asensia-kopfschmerz",
        "title": "Out of possession stats: Xabi Alonso vs Arbeloa",
        "content": "",
        "upvotes": 37,
        "comments": 22,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hm9z9x41j2lg1.jpeg?auto=webp&amp;s=7938aa579695008722bf716e21ae3e49e225e83f"
        },
        "permalink": "/r/realmadrid/comments/1rbpcma/out_of_possession_stats_xabi_alonso_vs_arbeloa/"
    },
    {
        "id": "1rb322h",
        "author": "Usorojnr",
        "title": "This is completely unacceptable",
        "content": "It’s like beating a dead horse at this point, but we can’t win things with this kind of attitude. The first line of defence are the forwards. These are the basics in 2026, how long are we going to keep having these discussions? \n\nIt’s funny if all our players can just do the basics efficiently we’d be able to win most games. It’s a shame a team of this quality is underperforming because of an attitude problem. ",
        "upvotes": 1148,
        "comments": 176,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6woowyzd1xkg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rb322h/this_is_completely_unacceptable/"
    },
    {
        "id": "1rb2gsn",
        "author": "Resident-Stretch9723",
        "title": "New RECORD set | its 501 now",
        "content": "",
        "upvotes": 995,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bco5gqitwwkg1.png?auto=webp&amp;s=dc485ffffc0956c8cf87743a196c78641c4c2799"
        },
        "permalink": "/r/realmadrid/comments/1rb2gsn/new_record_set_its_501_now/"
    },
    {
        "id": "1rb1zca",
        "author": "7dek",
        "title": "Vini jr leading the press just for others to be jogging around",
        "content": "",
        "upvotes": 707,
        "comments": 89,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/ywlxdlahtwkg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rb1zca/vini_jr_leading_the_press_just_for_others_to_be/"
    },
    {
        "id": "1rb3j69",
        "author": "AbuElKess",
        "title": "What is our next Sergio Ramos doing?",
        "content": "",
        "upvotes": 400,
        "comments": 111,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tev8l9ct4xkg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rb3j69/what_is_our_next_sergio_ramos_doing/"
    },
    {
        "id": "1rb54d1",
        "author": "No-Independent2522",
        "title": "Ceballos on X: I take responsibility. 🙏🏽",
        "content": "",
        "upvotes": 320,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/24nxqhsogxkg1.jpeg?auto=webp&amp;s=2765a0991f56ff8b8e2b74bd0cd5cba6b8b93bda"
        },
        "permalink": "/r/realmadrid/comments/1rb54d1/ceballos_on_x_i_take_responsibility/"
    },
    {
        "id": "1rbilxi",
        "author": "Lekanswanson",
        "title": "This has been going on too long",
        "content": "I'm just going to get straight to the point.\n\nMbappe pros and cons.\n\nPros:\n\nFast, Great Finisher, great at penalties \n\nCons:\n\nTerrible off ball movement, Zero hold up play, Terrible playmaking, poor link up play, terrible work rate, terrible pressing. Cannot play as a striker, cannot play as a winger, can barely beat a man and can barely cross.\n\nSo the question is, are all these cons really worth the one or two good things he does really well, maybe better than anyone else in world football.\n\nMbappe had it easy at PSG, league was pretty much guarantee, he didnt have to be brilliant, he had lots of space to exploit against weak opposition and he also had Messi, Neymar who can create something from nothing. With Cavani he had someone that would do all his pressing for him allowing him to focus on scoring.\n\nThe truth is most half decent managers and teams have figured him out. Sit deep and dont allow him space to exploit and he doesn't have the dribbling in tight space that Rodrygo and Vini has and doesn't have the off ball movement of Jude (who i believe is actually being wasted as a midfielder now, he's a striker like ekitike)\n\nThen there's the obvious, people say why did everyone suddenly become worse, we have tried to blame everything else, we blame Kroos leaving, Vini ballon dor, Jude, Tchouameni, Valverde, Brahim, we have tried to blame everyone and everything else but using occams razor the right explanation is usually the one requires the least assumptions and the simplest explanation is team declined massively since Mbappe joined.\n\nYes Kroos leaving was bad but it should not nearly be as bad as what we are seeing today but that's a post for a different day. When Mbappe joined the team was still doing well with different goal scorers but Mbappe was struggling to adapt to the pace and physicality. To solve this every single person made a direct effort to try and get Mbappe scoring at their own expense. Vini started giving up penalties and taking less shots, Jude started making less runs into the box and everyone was trying to make Mbappe the star but this came at the expense of team balance and cohesion.\n\nIts funny we always ramble on about \"PROFILES\", we need this type of profile blah blah but when it comes  our striker, all of s sudden profile doesn't matter. What type of profile is Mbappe as a striker. He doesn't hold up the ball to bring others in, doesn't make runs into the box to score headers and tap ins, hes not a false 9, he's not a target man, he's not any of these, but since he scores lots of goals, the problem must be everyone else.\n\nThe goal Gonzalo scored last week, he didn't need skill or pace or trickery, he mad a simple run and Trent gave a pass and he was able to score. \n\nRobin Van Persie had, no pace, no strength, not particularly skillful, but he could finish and he knew where to be and when to be there. Nothing is more evidence of this when Guler had the ball and Mbappe literally stood infront of Vini on the left wing, and it took him a good 5 seconds before he realized he should move because Guler didn't pass to him. \n\nSo to everyone that wants proof that Mbappe is actually making others worse that's a perfect example. If Mbappe is dropped for one match all the Mbappe stans expect everyone to suddenly find form and score hattricks not taking into account just how much a difference form and team chemistry makes. Vini is actually starting to find some form and score goals now but especially when Mbappe is not on the pitch, same as GG, same as Jude, Rodrygo, Fede, almost everyone plays better when Mbappe is not on the pitch.\n\nPeople really seem to think if Mbappe is not on the team we would be fighting relegation which is ridiculous. If Mbappe was not on this team we would be a BETTER TEAM. \n\nRANT OVER, DOWNVOTE ALL YOU LIKE BUT IT'S THE TRUTH, UNTIL MBAPPE LEARNS TO PLAY HIS ROLE THE TEAM IS DOOMED.",
        "upvotes": 34,
        "comments": 86,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rbilxi/this_has_been_going_on_too_long/"
    },
    {
        "id": "1rb6x83",
        "author": "Short_Mousse_6812",
        "title": "Not getting Kane has been our biggest mistake",
        "content": "No one can deny that Mbappe is a world class player. Probably one of the best finishers and also one of the fastest. However, we did not need him. A player can be good and still not fit a team. Mbappe is essentially a winger. He’ll never be a striker because he does not play like that.\n\nWe payed a massive bonus to a player who we did not need, and we have also given him so much priority. If we had a striker like Ekitike or Kane (closest thing to Benzema) we would have someone to run in the box. Someone to support play, and to take advantage of Vini’s and Trent’s crosses. I honestly see no way we start consistently playing well as a team without a 9. This is obviously not the only problem, our defense and midfield need improvement. But, It is crazy we dropped around 120 million just as a bonus, on a player we didn’t even need. We shot ourselves in the foot.",
        "upvotes": 179,
        "comments": 89,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rb6x83/not_getting_kane_has_been_our_biggest_mistake/"
    },
    {
        "id": "1rbr3q0",
        "author": "raislander",
        "title": "I’m worried about next season and summer time. How are we going to do this?",
        "content": "After what we saw yesterday it’s clear this team needs a deep “clean”, we have players that have already given all their best, and other that don’t deserve to be in Real Madrid, I’m sorry. We saw what Ceballos did in 9 mins he was out and now again he is out for 7 weeks. But it’s not only him.\n\nLooking at the squad we need to let go, release, sell at least: Ceballos, Alaba, Mendy, Rudiguer (unfortunately) Carvajal (sad but true), camavinga, Brahim, Fran Garcia. That’s 8 players!! 6 of them defenders! How are we going to short this out. Bringing 1 or 2 additions? We will have a hard time next season again, and potentially no depth squad.\n\nI’m seeing not titles this year and nothing again next season",
        "upvotes": 10,
        "comments": 27,
        "media": null,
        "permalink": "/r/realmadrid/comments/1rbr3q0/im_worried_about_next_season_and_summer_time_how/"
    },
    {
        "id": "1rb8wxa",
        "author": "Finn_Madridista",
        "title": "The man can’t make the run😒 (OC)",
        "content": "",
        "upvotes": 135,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8pv4jxcnaykg1.jpeg?auto=webp&amp;s=6d206a5e240998bd22edf53b47ae77e1e6393884"
        },
        "permalink": "/r/realmadrid/comments/1rb8wxa/the_man_cant_make_the_run_oc/"
    },
    {
        "id": "1razjl4",
        "author": "No-Independent2522",
        "title": "Vini equalizes 1-0 Osasuna",
        "content": "",
        "upvotes": 399,
        "comments": 40,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/pvqmwiqxbwkg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1razjl4/vini_equalizes_10_osasuna/"
    },
    {
        "id": "1rblj0v",
        "author": "ManuMora98",
        "title": "[Fem] Real Madrid 2 - 0 Tenerife | Alba 46', Angeldahl 59' | Win before the international break, with the bad news of the injuries of Linda and Feller",
        "content": "",
        "upvotes": 13,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/s7fccvcvp1lg1.jpeg?auto=webp&amp;s=1bffc76d58a8b31c0206208f71626e01058f05e1"
        },
        "permalink": "/r/realmadrid/comments/1rblj0v/fem_real_madrid_2_0_tenerife_alba_46_angeldahl_59/"
    },
    {
        "id": "1rb2xj4",
        "author": "Sandro_00pium",
        "title": "One picture one thousand words",
        "content": "",
        "upvotes": 193,
        "comments": 71,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ct0ncpsg0xkg1.jpeg?auto=webp&amp;s=12211bea9273b8bd5d8627e07917996d6e10aaaa"
        },
        "permalink": "/r/realmadrid/comments/1rb2xj4/one_picture_one_thousand_words/"
    },
    {
        "id": "1rb1wy7",
        "author": "7dek",
        "title": "🗣Alvaro Arbeloa:\" We have a lot of room for improvement and when you're not at 100%,anyone can beat you\" Today they weren't at 100%",
        "content": "",
        "upvotes": 186,
        "comments": 72,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/jk7nb0mzswkg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1rb1wy7/alvaro_arbeloa_we_have_a_lot_of_room_for/"
    },
    {
        "id": "1rb2fd5",
        "author": "No-Independent2522",
        "title": "When will the season end 😭",
        "content": "",
        "upvotes": 147,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/b2bpyc5qwwkg1.jpeg?auto=webp&amp;s=90693db0f45473f5c6cea9c7839d8a088f5176ac"
        },
        "permalink": "/r/realmadrid/comments/1rb2fd5/when_will_the_season_end/"
    },
    {
        "id": "1rb040d",
        "author": "quuduu",
        "title": "Fotmob ratings from today's match",
        "content": "",
        "upvotes": 180,
        "comments": 242,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3wxn59hwfwkg1.jpeg?auto=webp&amp;s=2346e121dc0bb7808745fa8c733fb4d55d2f76c5"
        },
        "permalink": "/r/realmadrid/comments/1rb040d/fotmob_ratings_from_todays_match/"
    }
]