[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 488,
        "comments": 261,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1is0q3j",
        "author": "bluntprincess99",
        "title": "TW (Spoilers) How angry are you after seeing the American Murder: Gabby Petito ?",
        "content": "True crime documentaries usually anger us, but this angered me like no other. \n\nSpoilers\n\n\n\n\n\n\nThe man lied in his suicide letter. \nThe parents helped him cover up a murder. \n\nI mean how can people be this cruel and sociopathic. ",
        "upvotes": 115,
        "comments": 63,
        "media": null,
        "permalink": "/r/netflix/comments/1is0q3j/tw_spoilers_how_angry_are_you_after_seeing_the/"
    },
    {
        "id": "1iryv1b",
        "author": "Turtleballoon123",
        "title": "Started Baby Reindeer. It's brtutal and depressing yet compelling.",
        "content": "I don't know what to make of the show. It's brilliant, yet also brutal and depressing. Episode 4 is heart-wrenching. I've seen discussions from survivors who say the show can be triggering or who had to switch it off. I really feel for the series creator who based this off a story. It's so fucked up.",
        "upvotes": 92,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1iryv1b/started_baby_reindeer_its_brtutal_and_depressing/"
    },
    {
        "id": "1irzxha",
        "author": "yercoolmarple",
        "title": "The character Rose in The Night Agent is insufferable at this point.",
        "content": "I just have to get this off my chest, even at the risk of getting massively downvoted, this character is so poorly written. She changes her mind ten times in a single episode and is excessively annoying. The story itself is dull and weak overall with no character developments, but I could live with that if it weren’t for ***this*** one character being forcefully inserted into every situation. It made sense in Season 1 since the story revolved around her, but in Season 2? Even FBI agents are unaware of Night Action, yet somehow, this civilian is deeply involved in everything??seriously? If the writers were so intent on keeping her relevant, why not just hire her as a tech? Instead, they throw a civilian into the field like it’s nothing. To top it all off, the actor really cannot act. It was really difficult to finish season 2. I am not even getting to the other issues like poor writting, countlessly irritating character arcs.. S1 was not the greatest but it felt like this had some promise going forward and boy, oh boy, was I wrong.",
        "upvotes": 51,
        "comments": 23,
        "media": null,
        "permalink": "/r/netflix/comments/1irzxha/the_character_rose_in_the_night_agent_is/"
    },
    {
        "id": "1iruqoh",
        "author": "BlissfulEmilia",
        "title": "What's your all-time favorite Netflix original series?",
        "content": "I’ve been on the hunt for new Netflix originals to binge, and I wanted to know: what’s your all-time favorite Netflix original series? Whether it’s a drama, comedy, or documentary, I’m looking for recommendations that are must-watches. Bonus points if it’s something that really flew under the radar but ended up being amazing.",
        "upvotes": 67,
        "comments": 293,
        "media": null,
        "permalink": "/r/netflix/comments/1iruqoh/whats_your_alltime_favorite_netflix_original/"
    },
    {
        "id": "1irh528",
        "author": "mmprobablymakingitup",
        "title": "What’s a show you randomly started watching on Netflix and ended up loving?",
        "content": "I started Blacklist on a whim, not expecting much, but it completely pulled me in. Whether it was the story, characters, or just the overall vibe, I ended up binge-watching the whole thing.\n\n",
        "upvotes": 256,
        "comments": 695,
        "media": null,
        "permalink": "/r/netflix/comments/1irh528/whats_a_show_you_randomly_started_watching_on/"
    },
    {
        "id": "1irgsx6",
        "author": "Worldpeacee007",
        "title": "Official Discussion - American Murder: Gabby Petito",
        "content": "Crazy to think we are now in the era of tik Tok murder docs. Seeing victims document much of their lives in 4k adds a whole other heartbreaking element to these kinds of series and stories. I am only one episode in, but I thought this would be an interesting place to discuss the series.\n\nEdit: I have finished the series and I can say I went through pretty much every emotion while watching this-mostly anger and sadness. Gabby was such a beautiful soul. Feels like we all know someone like her.\n\n It's truly a shame so many people find themselves stuck in relationships with manipulative abusers. It was like Gabby couldn't wrap her mind around leaving him. Even in her final text message, she tells her mom that they aren't breaking up. It's almost like some people feel like if they break up with their partner, they consider *themselves* a failure. Just a really sad and devastating story. Watching the vlog outtakes of them made me so uncomfortable. It makes you think about how the internet is truly a facade.",
        "upvotes": 219,
        "comments": 753,
        "media": null,
        "permalink": "/r/netflix/comments/1irgsx6/official_discussion_american_murder_gabby_petito/"
    },
    {
        "id": "1is72r0",
        "author": "techfinpro",
        "title": "‘Stranger Things’ Jamie Campbell Bower Talked To Therapist About Not Wanting To Play Villains For A While: ‘F—s Me Up’",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is72r0/stranger_things_jamie_campbell_bower_talked_to/"
    },
    {
        "id": "1irmoed",
        "author": "quietdepths",
        "title": "American Murder : Gabby Petito Netflix",
        "content": "I just finished watching the Netflix series about this and omg how sad and shocking. These documentaries really put me off relationships these days and make me so skeptical about how people truly are and just what we see online. \n\nIt’s very true that sometimes the people that seem the happiest online are often the saddest sometimes and with the most skeletons. I personally know many couples who would constantly post how in love they are and suddenly the very next day decide to divorce. And others who never post about one another but live a very happy and quiet life.\n\nAnyway this whole case was so sad and she seemed like such a bright and bubbly girl. One thing though, I need the caveat before I say it is that I’m not blaming her parents but just I know if it were me in that situation and I had said those things to my parents about him they absolutely would expect me to come back to them and would not be happy about me continuing. I know everyone has different parenting styles but me coming from an Asian family - they wouldn’t be ok with some of the things the parents already knew.\n\nThat guy seemed really creepy but it’s the kind of creepy that isn’t obvious which makes it more scary and I do wonder just how involved their parents were. None of this matters anymore I guess, sadly she’s dead and I just hope everyone (men and women) are all careful of the kind of people they get involved with. It’s a scary world out there and relationships don’t seem to be what they were. Not saying everyone is a killer, just that…. I think it’s really hard these days ",
        "upvotes": 59,
        "comments": 179,
        "media": null,
        "permalink": "/r/netflix/comments/1irmoed/american_murder_gabby_petito_netflix/"
    },
    {
        "id": "1is2fik",
        "author": "ThinkBlink3",
        "title": "Cassandra: so much potential, so little substance",
        "content": "Well obviously spoilers ahead so read at your own risk.\n\nCassandra as a show promises so much with its premise. The movie and TV space has produced some excellent work with the whole \"AI gone rogue\" as a topic (read: Ex Machina) but Cassandra is one of those that doesn't live up to the hype it creates and can definitely be skipped.\n\nFirst of all, it features some of the dumbest side characters (Samira's family) who genuinely made my blood boil as I was watching this. I get that you need to push the story ahead but definitely not at the cost of making your characters 50 IQ. Juno doesn't tell anyone Cassandra told her where the gun is despite it almost getting her expelled. Fynn doesn't mention what his boyfriend said to him about Cassandra till it's too late and David is honestly so unlikeable and dumb, that already makes this a difficult watch.\n\nThe story starts okay, peaks around episode 4 and doesn't make any coherent sense from that point. The plot twist is not only there for the sake of it but is somehow still extremely predictable. The ending far too rushed, even for a 6 episode series. The whole plot with Samira's sister feels so badly forced in, that I had to skip past most of it in the later episodes to get to the end.\n\nSpent my weekend watching this and retrospectively I could have spent it staring at a painting and come out more content.\n\n1.5/5\n",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is2fik/cassandra_so_much_potential_so_little_substance/"
    },
    {
        "id": "1is3pde",
        "author": "Jazzlike_Custard_242",
        "title": "Mo season 2 autism representation",
        "content": "I have no words.\n\nIt’s been a very long time since I watched a show and been this emotional.\n\nI have a cousin with autism and this show just represents it so good. I was brought to tears by Sameer’s first therapy session in the new season of Mo. The actors the script everything was done amazingly. Hearing Sameer’s dialogue was truly touching.\n\nSeason 2 is so much better done than first season, as it explores the other characters more rather than focusing in on Mo alone. Really good job to everyone involved in it, I would totally recommend other people to watch it.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is3pde/mo_season_2_autism_representation/"
    },
    {
        "id": "1irnhth",
        "author": "TheTabOfficial",
        "title": "What's a Netflix show that you're glad you stuck with?",
        "content": "Sometimes you've really got to trust the process to understand why everyone is raving about a show, because the first episode or two might not hook you straight away. Which show or shows surprised you?",
        "upvotes": 29,
        "comments": 84,
        "media": null,
        "permalink": "/r/netflix/comments/1irnhth/whats_a_netflix_show_that_youre_glad_you_stuck/"
    },
    {
        "id": "1irmst1",
        "author": "AnActualWizardIRL",
        "title": "Can I turn off the game nonsense?",
        "content": "This is becoming a useability issue. The first page is all ads for daft mobile games I 100% have no interest in. There must be a way to say \"No thanks Netflix, just show me the shows?\". How would I achieve this? I just dont have the patience for this nonsense and its getting harder to work out what new content is available. ",
        "upvotes": 24,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1irmst1/can_i_turn_off_the_game_nonsense/"
    },
    {
        "id": "1is8qxa",
        "author": "S4v1r1enCh0r4k",
        "title": "K-Drama 'Boyfriend on Demand' Moves to Netflix, Starring BLACKPINK’s Jisoo &amp; Seo In Guk, releasing in 2026",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is8qxa/kdrama_boyfriend_on_demand_moves_to_netflix/"
    },
    {
        "id": "1is8qfb",
        "author": "OkNeighborhood5839",
        "title": "Did you ever buy a chill set from ign store ?",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is8qfb/did_you_ever_buy_a_chill_set_from_ign_store/"
    },
    {
        "id": "1is89tb",
        "author": "creature04",
        "title": "Back in action",
        "content": "Enjoyed the Jamie/Cameron team up, but my God did the song choice for the first two fights just ruin it for me. Im more invested in the fight scenes in action movies more then anything and when they are bad or the music they choose is horrid it just kills the movie for me. I was real excited for Cameron Diaz and Jamie fox team up, but the movie is very basic.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is89tb/back_in_action/"
    },
    {
        "id": "1is1deq",
        "author": "user74839267583",
        "title": "Binge watch",
        "content": "Shows to binge watch? I can’t seem to find one I like. Here are my favorites:\nOne tree hill \nDesperate housewives \nFriday night lights \nDead to me \nThe fosters ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1is1deq/binge_watch/"
    },
    {
        "id": "1is33nu",
        "author": "frawtlopp",
        "title": "Netflix flicker ONLY in fullscreen and ONLY when HDR is turned OFF",
        "content": "TV is TCL Roku Smart TV, no HDR setting available on it.\nPC is custom AMD/Nvidia build running Windows 11/\n\nThis is EXCLUSIVE to Netflix. It does not happen with YouTube, it does not happen with VLC, Disney, Plex etc.\n\n- If I exit full screen with HDR OFF, the flickering stops entirely.\n- If I enter full screen with HDR OFF, the flickering starts.\n- If I enable HDR via Windows Settings, the flickering stops completely in Netflix in fullscreen.\n\nThe issue is that HDR is bright as hell for me even with my TV set to the darkest setting.\n\nI have tried disabling Chrome hardware acceleration, it didnt work. \n\nThis is not a hardware issue and it is not related to software.\n\nThis is a Netflix issue because it doesnt happen ANYWHERE ELSE.\n\nAny advice? PLEASE. This is driving me insane.\n\nEdit: Some adjustments",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is33nu/netflix_flicker_only_in_fullscreen_and_only_when/"
    },
    {
        "id": "1is65jt",
        "author": "DullCourt5937",
        "title": "Help",
        "content": "I was trying to play Netflix dead cells and then an error pop up and idk how to fix it can someone help me fix it the error code is.    NPGStatusCode -1000 MSL_FAILED_TO_CREATE_CLIENT_ON_APPBOOT",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is65jt/help/"
    },
    {
        "id": "1is5wg6",
        "author": "danxsr",
        "title": "Show name from childhood",
        "content": "PLEASE if you’re a Netflix fanatic and know shows from the 2008-2012 era I’m trying to remember this show I used to watch on Netflix and ONLY Netflix from when I was a kid. I know it was out around the era of the show “Ruby Gloom” and it was a young boy who had brown hair and was white and lived in this huge, gothic mansion with his family. He has these pets/creatures/maybe ghosts?? I used to remember but I can’t remember what they were; however, they coexisted with the boy and there was one episode where the “monsters” (I guess) were like in the pipes singing a song and the boy was freaked out but this is as far of a memory I have of it. I have been looking for this show for the past year and everytime I do a deep dive in it I can NEVER find it. If anyone can help or has any idea what this is pls lmk it’s driving me insane like I cannot sleep.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1is5wg6/show_name_from_childhood/"
    },
    {
        "id": "1is5kdy",
        "author": "Western-Dot-5632",
        "title": "Is there a way to disable Netflix’s recommender engine?",
        "content": "After browsing a site that lists all active shows and movies on Netflix, I’ve realized how much good content I’ve been missing because of their recommendation algorithm ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1is5kdy/is_there_a_way_to_disable_netflixs_recommender/"
    },
    {
        "id": "1is5i57",
        "author": "1q2s3c4r5t",
        "title": "Netflix, shield, arc, g4, no Dolby vision",
        "content": "Very strange. Very very strange. My Netflix on my shield on a g4 with Sonos arc is not showing dv. All parameters are confirmed that dv should be working.\n\nAlso, I did the following-\n1) lg native app Netflix is showing dv for all my Netflix profile.\n\n2) Netflix on the shield is showing dv for all profile except the one I need, which is my profile.\n\n3) all other apps - Disney etc etc is showing dv.\n\nI’m missing dv on a single particular profile. This is awfully strange. Any advise?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is5i57/netflix_shield_arc_g4_no_dolby_vision/"
    },
    {
        "id": "1is4qo6",
        "author": "wanga2times",
        "title": "TV show recs",
        "content": " I have a Suits shaped hole in my heart so I need another series with a mix of drama,comedy, character development, loving a character then hating them and vice versa. It doesn't even need to be on Netflix atp. No Breaking Bad pls, I refuse to watch that one. I've probably seen half the show on tiktok clips.",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1is4qo6/tv_show_recs/"
    },
    {
        "id": "1ir8y1m",
        "author": "Poorteenwannabe",
        "title": "Tried starting Outlander, can someone recommend a similar show but without all the damn sexual assault?",
        "content": "I am 1.2 episodes in and I hate this show already. It’s got nice camera work and acting but that’s it, so far the plot has refused to grab my attention and the male characters are all so rapey. I hate it. Which is a shame because I love period pieces and thought perhaps I could stomach the more mature themes but just an hour or so in and I can tell it’ll be one of those shows that romanticizes women’s pain. I googled some reviews before deciding not to continue watching, and apparently it’s like this the whole show so it’s an absolute no from me. \n\nI’m down for any better recommendations if you can spare some please and thank you💗\n\n\nEdit: Thank you to all of you with your amazing recommendations!! And thank you for understanding my struggle to continue with watching Outlander without dismissing my experience. 💗\n\nBut just as remind for a few trickling comments: \n\nIt’s not that I cannot stomach such scenes, it’s the way in which this show goes about those scenes that is of my dissatisfaction. \n\nI understand a writers need to include “realism” into a story. However SA isn’t like a lighthearted comedy that you can throw in for fun, it’s something that writers should add in with purpose. So far I don’t get the feeling that this writer does that often. SA is something that startles the viewer and immediately grabs their attention. Adding it in for realism’s sake, in my own personal opinion, is a waste and distasteful. \n\nEven though I could be wrong, and if I stick it out maybe the rest of the show might make up for how often it illustrates that kind of pain to it’s audience, I’m just over scenes like that in general. I get it, you get it, we all get it. We all know it happens. From a woman’s perspective it’s exhausting to see SA as a commonplace troupe in shows all the time, period pieces or not. I’d at the very least love it if they were significant to the plot, as well as less graphic. \n\nI understand that I may come off as sensitive, but I’d rather that than be desensitized to seeing this kind of stuff on the big screen time after time again. It just gets to a point. ",
        "upvotes": 127,
        "comments": 96,
        "media": null,
        "permalink": "/r/netflix/comments/1ir8y1m/tried_starting_outlander_can_someone_recommend_a/"
    },
    {
        "id": "1iqseno",
        "author": "dailystar_news",
        "title": "Netflix star found dead at home age 24, as police investigate circumstances",
        "content": "",
        "upvotes": 1048,
        "comments": 96,
        "media": null,
        "permalink": "/r/netflix/comments/1iqseno/netflix_star_found_dead_at_home_age_24_as_police/"
    },
    {
        "id": "1is2ra4",
        "author": "burywmore",
        "title": "Netflix In Italy",
        "content": "I'm not sure if anyone knows the answer, but hopefully I can get questions answered here.\n\nWe are spending 10 days in Italy, including 7 days in Rome. Is there any way to purchase and use Netflix there?   I assume any Netflix account I have in the States is useless, but can I sign up when I'm in Italy? \n\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1is2ra4/netflix_in_italy/"
    },
    {
        "id": "1is2lbj",
        "author": "ChikyScaresYou",
        "title": "How to sell a show/movie idea to Netflix?",
        "content": "I dont know if this is the right place to ask about that, but I'll try anyway. \n\nHow do people get to have their ideas made into shows or movies for netflix? I'm genuinely curious about the process because, unless I'm really bad at it, I haven't found anywhere to \"submit\" your idea. I ask now just for curiosity, but in the future I'd love to see my novel trned into a series or a movie, but I have absolutely no idea if normal people even have a chance, or it's only for corporations, or how it works...",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1is2lbj/how_to_sell_a_showmovie_idea_to_netflix/"
    },
    {
        "id": "1irumj5",
        "author": "BreadfruitNo9500",
        "title": "Brooklyn 99",
        "content": "Logged into Netflix and it said that last day to watch Brooklyn 99 is on the 25 of this month. But a few days later it said that a new season is coming out the twenty sixth. Is it still getting removed or is it safe?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1irumj5/brooklyn_99/"
    },
    {
        "id": "1is1635",
        "author": "emmypineapples",
        "title": "Whatever happened with Wednesday?",
        "content": "Does anyone know if season 2 has started filming? this feels like euphoria bruh, like it's been so long since season 1 came out and everyone was so hype a few years ago when it came out, but do ppl still care about it now? Do you guys think it will have the same success this time around? ",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1is1635/whatever_happened_with_wednesday/"
    },
    {
        "id": "1is0sv6",
        "author": "WhileAccomplished722",
        "title": "does anyone else feel like the prologue of arcane was the only realy good part",
        "content": "ive watched all of season one and it feels like the the prologue was incredibly strong with great story and characters and \"ending\" but after that its all over the place and really boring. it still has its moments after that but it turns into just a 5/10 show not bad but not good. (not rly spoilers but i wanted to be safe)",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1is0sv6/does_anyone_else_feel_like_the_prologue_of_arcane/"
    },
    {
        "id": "1iru8pd",
        "author": "DUCKlloovvaa1497",
        "title": "Need good apocalypse comedy",
        "content": "I’ve recently finished watching both day-break and the umbrella academy and I love the apocalypse themed stuff of people trying to survive in it while the show being entertaining and not too morbid. Does anybody have any good recommendations I could find on Netflix relating to a comedic show about the supernatural/apocalypse through what I’ve described with the example shows I’ve given?",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1iru8pd/need_good_apocalypse_comedy/"
    }
]