[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1o6yj3y",
        "author": "AutoModerator",
        "title": "\"Monster: The Ed Gein Story\" is now streaming!",
        "content": "https://preview.redd.it/ij51pftml6vf1.jpg?width=1290&amp;format=pjpg&amp;auto=webp&amp;s=608f9a918c1701630ad712dfd5b0fb3c86e0131b",
        "upvotes": 0,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1o6yj3y/monster_the_ed_gein_story_is_now_streaming/"
    },
    {
        "id": "1p1suvv",
        "author": "chunkybonks",
        "title": "The Beast in Me - Matthew Rhys is perfection",
        "content": "I have been a huge fan of Matthew Rhys for years. Hello Brothers and Sisters and The Americans. He usually plays the good guy. What a departure this role was. His facial expressions alone are so telling. He definitely pulled off the suave sociopathic part hands down. \n\nNow Claire Danes was something else. I kept wishing she would have reined her face in at least 50%. It was just too much. Too much quivering. Too much warbling. Get it together woman. \n\nBrittany Snow is in everything these days. \n\nThis was one of the best Netflix original series in awhile. They’ve been pumping out a lot of junk lately. I was genuinely excited to hit play on the next episode and see how this all ended up. ",
        "upvotes": 136,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1p1suvv/the_beast_in_me_matthew_rhys_is_perfection/"
    },
    {
        "id": "1p1w5jd",
        "author": "TwlightPrincess",
        "title": "Looking for something not depressing to watch on Netflix",
        "content": "Any suggestions for something to watch that is not depressing on Netflix? Could be a show or movie. I’m depressed so I need to find something interesting, possibly funny just not depressing please",
        "upvotes": 17,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1p1w5jd/looking_for_something_not_depressing_to_watch_on/"
    },
    {
        "id": "1p1uzt4",
        "author": "CheesecakeExotic5713",
        "title": "The beast in me",
        "content": "I finished the whole season in my 8 hour overnight shift 😭 i was so into it and honestly i kept flip flopping between Nile being guilty or not. I also keep seeing a lot of Aggie hate but i thought the role was played very well and i would also be freaking out is a presumed murderer brought me out to his “running path”",
        "upvotes": 8,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p1uzt4/the_beast_in_me/"
    },
    {
        "id": "1p1hlnq",
        "author": "Emergency_Air4575",
        "title": "Am I the only one…",
        "content": "Am I seriously the only human left out here crossing my fingers and hoping, praying even, that LOUDERMILK gets a fourth season? Because I’m not ready to let this show go just yet.",
        "upvotes": 26,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1p1hlnq/am_i_the_only_one/"
    },
    {
        "id": "1p1vrp3",
        "author": "General0urumov007",
        "title": "4 minutes into the Night Agent - Season 2 and I just can't even with the acting",
        "content": "There were some horrible characters like Farr in season 1 who were miscast but season 2 already started off hot. The female agent working with Cody Banks aka Sutherland, is the most unconvincing agent I've seen. Just the way she walks with the gun. I genuinly wonder how these things even happen. It's such low production quality that gets the green light and makes it's way onto netflix. \n\nThis show's premise is actually pretty cool but the acting and other minor stuff are make this show completely unwatchable. Also, the way Sutherland runs is comical. He runs like he shit his pants. I have zero desire to continue this show future",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1p1vrp3/4_minutes_into_the_night_agent_season_2_and_i/"
    },
    {
        "id": "1p1hrkr",
        "author": "Playful_Copy_4255",
        "title": "the Beast in Me - props",
        "content": "No spoilers, but super random question- currently on ep 4; anyone know where that blue tea/coffeepot set that Madison’s family has is from? I love it lol ",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p1hrkr/the_beast_in_me_props/"
    },
    {
        "id": "1p0xovx",
        "author": "Rednit69",
        "title": "Why so dark?",
        "content": "Is it just me or is anyone else tired of intentionally darkly lit movies and or series? I get the intent is to create a mood but so many new shows have gone too far. I.E. Frankenstein, Black Rabbit etc. Thoughts?",
        "upvotes": 162,
        "comments": 66,
        "media": null,
        "permalink": "/r/netflix/comments/1p0xovx/why_so_dark/"
    },
    {
        "id": "1p1w5z8",
        "author": "MysteriousAd3954",
        "title": "Can’t remember the title of this strange show",
        "content": "I swear about a year or two ago Netflix had this ambiance “show” that was just really strange almost trippy visuals to music and I can’t remember what it was called or if it still exists I swear it was called like “ambiance TV” or something. Any help would be amazing ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p1w5z8/cant_remember_the_title_of_this_strange_show/"
    },
    {
        "id": "1p1w1bd",
        "author": "Mustard-cutt-r",
        "title": "Carman Family Deaths",
        "content": "This documentary that has it all: money, murder and autism! Did he do it? He’s definitely Autistic as all get out, but that doesn’t make him psycho- but it doesn’t make him not psycho either. If he needed to be on meds and he wasn’t on them, especially with so much childhood trauma, I could see him cracking. And from what I understand, physical oceanography and the study of currents is not “junk science” and has led to many rescues and sunken boats for a long time now. I feel his defense was reaching pretty hard to bring in one random navy seal to counter a bulk of the marine scientist’s claims. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p1w1bd/carman_family_deaths/"
    },
    {
        "id": "1p1tpo5",
        "author": "Jason2648",
        "title": "movie like frankenstein 2025",
        "content": "i was thinking about watching this but i dont know if i could sit through a 2 and a half hour movie(maybe that sounds bad,lol)i do like oscar issac and mia goth though",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p1tpo5/movie_like_frankenstein_2025/"
    },
    {
        "id": "1p1tm9b",
        "author": "le-chat-blase",
        "title": "Movie Playlist Needed",
        "content": "I don’t know who I need to send this to, but in case a person with power reads this, Netflix needs to create movie playlist options. Say I have a family Christmas and I want certain movies to play back to back without anyone needing to search for the next one. I would create a Christmas movie playlist in the Netflix app so they play one after the other. \nI’ve been thinking this for years, but never typed it into the information superhighway. ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p1tm9b/movie_playlist_needed/"
    },
    {
        "id": "1p1l6lf",
        "author": "Hungarian_menace",
        "title": "Can't watch the walking dead.",
        "content": "Every time I try to open the walking dead tab on netflix on my phone it just says \"Can't connect to netflix\" every other show still works and the show is still on netflix where I live. Is there any way I can fix this?",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1p1l6lf/cant_watch_the_walking_dead/"
    },
    {
        "id": "1p17bpa",
        "author": "Cold_Link_1057",
        "title": "suggest some cozy movies to watch",
        "content": "can y'all Please suggest some good movies/series with winter vibes.\n\n\nany genre will work fantasy, muder mystery, thriller, rom com.\n\nAnything with good story\n\n\n\n\n\n",
        "upvotes": 10,
        "comments": 46,
        "media": null,
        "permalink": "/r/netflix/comments/1p17bpa/suggest_some_cozy_movies_to_watch/"
    },
    {
        "id": "1p1a3g1",
        "author": "fanofmets12",
        "title": "Netflix ad plan &amp; Stranger Things",
        "content": "I don't have Netflix at the moment. I haven't had Netflix in over three years. \n\nWould the ad plan include the upcoming Stranger Things season 5 or no? ",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1p1a3g1/netflix_ad_plan_stranger_things/"
    },
    {
        "id": "1p1iz0l",
        "author": "FreeRangeThinker",
        "title": "Billionaires Bunker",
        "content": "What if Max’s biological father is Guillermo Falcone? \n\nAfter all Max and Guillermo look alike and Max’s mom was banging Guillermo for twenty-eight years.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p1iz0l/billionaires_bunker/"
    },
    {
        "id": "1p1ojf2",
        "author": "islandhpper",
        "title": "Simply Alice/Simplemente Alicia",
        "content": "I’m so surprised with how great this show is! At first, it seemed a bit ridiculous from an American perspective. But watch it past the first couple episodes, and it grows in depth and maturity.  The plot twists are great and there’s a wide cast of interesting characters. It handles complicated situations and feelings with empathy, a very human and without cruelty. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p1ojf2/simply_alicesimplemente_alicia/"
    },
    {
        "id": "1p1oefc",
        "author": "Lenasthoughts",
        "title": "Series Until you Burn Languages",
        "content": "I keep seeing so many posts about how good Until You (or Until You’re Born) is on Netflix, so I finally wanted to check it out for myself. But when I opened it, there’s literally no English audio option showing up for me. I’ve refreshed, checked all my settings, and even tried different devices, but it still doesn’t appear.\n\nIs anyone else dealing with this or know why the English language isn’t available?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p1oefc/series_until_you_burn_languages/"
    },
    {
        "id": "1p1lrq3",
        "author": "its_jb",
        "title": "The Longest Yard (audio issue)",
        "content": "I don’t think that this is necessarily a Netflix issue but since they are streaming it and I’m trying to watch it, I’m going to write it hear (pun intended).\n\nThe voice lines are currently only playing in the right side of my headset but all other audio (music, background sound, etc.) play in both. I didn’t know what else to do with this information.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p1lrq3/the_longest_yard_audio_issue/"
    },
    {
        "id": "1p1lf8w",
        "author": "bid0u",
        "title": "What's wrong with Weeds subtitles being all over the place?",
        "content": "Seriously, it's not even for impaired people since even when the character is in the middle of the screen, they're all fucked up to the side: [https://i.snipboard.io/GQxNMn.jpg](https://i.snipboard.io/GQxNMn.jpg)",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1p1lf8w/whats_wrong_with_weeds_subtitles_being_all_over/"
    },
    {
        "id": "1p1l03g",
        "author": "HELLFIRECHRIS",
        "title": "Physical Asia episode 8",
        "content": "Spoilers up to episode 8\n\nI’m Not the only one who thinks they handled the problem with Japan incredibly badly right ?\n\nThey spend most of episodes 7 and 8 saying we’d see Japan retry the statues event because of a technical glitch, then it jumps straight from turkey losing the ball throwing to Japan losing the statue retry.\n\nYou don’t get to see the end of the ball throwing to see if Mongolia or Japan win it (based on the points I’m assuming it was Japan), it goes straight to the Japanese team saying they’ll try to hold on to be in the top 3 then immediately cuts to them letting go not even showing us what time they managed and the Japanese captain celebrating even though they apparently did the worst in that event out of all 6 teams ?\n\nWere Japan just really bad at the statue event or did they give up because they knew they were already safe ? None of this is explained.\n\nI get that the glitch messed them up but it was handled terribly and turned into a confused mess.",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1p1l03g/physical_asia_episode_8/"
    },
    {
        "id": "1p01zjb",
        "author": "am3142",
        "title": "It’s So Refreshing to See Claire Danes’ Real Face on “The Beast In Me.”",
        "content": "Hey y’all, I just want to say how refreshing it is to see a real face, like Claire Danes’ in this latest series. NO SPOILERS! I am only on the second episode. I love that (it seems at least) she has not done any fillers, botox, or other procedures. I love that she can be fully expressive, she can fully emote, and be comfortable as a woman who is growing and aging. No shade to actresses who do get cosmetic work, the pressure to look young and beautiful all the time must be immense. I was wondering if you noticed how expressive she is as Aggie Wiggs, and if you too felt it refreshing to see a woman in all of her glory take space with her aging face in this show.",
        "upvotes": 1911,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/1p01zjb/its_so_refreshing_to_see_claire_danes_real_face/"
    },
    {
        "id": "1p1f0q5",
        "author": "Emotional_Award7077",
        "title": "Outlast season 2",
        "content": "Bri - What a let down. How are you going to claim your a bow hunter but can't string a bow? I'm sure there's more the show didn't show, but Idk why you're questioning your teammates skills when you did no hunting when you're apparently a bow hunter",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p1f0q5/outlast_season_2/"
    },
    {
        "id": "1p1iw29",
        "author": "Kurtz62",
        "title": "Wayward Season 2",
        "content": "Oh my God. We need a ‘Wayward’ season 2. \n\nThere were too many things that were left unfinished and the show is too good not to allow another season. \n\nProbably one of the best shows I’ve seen on Netflix in awhile.\n\nWhat do we as fans need to do to make sure a season 2 happens. \n\nMae Martin needs to be recognized for what they created as well. They did an outstanding job with the whole show. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1p1iw29/wayward_season_2/"
    },
    {
        "id": "1p1jyq1",
        "author": "realhankorion",
        "title": "My dream is to direct for studio like Netflix",
        "content": "I’ve made several films already, but I’m still curious about how a creator can realistically secure an opportunity to collaborate with a company like Netflix.",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1p1jyq1/my_dream_is_to_direct_for_studio_like_netflix/"
    },
    {
        "id": "1p1gaag",
        "author": "AccomplishedPut5175",
        "title": "The Witcher",
        "content": "Ugh, where do I start? First, I want to say that I've never been a fan of books, shows, and games of this kind, but... By chance, I accidentally started playing the game first, and then I decided to check out the series (I also ordered the book). I became an overnight huge fan of this genre, as well as the entire saga surrounding this series. I watched the first three seasons very quickly, and I finished the last one yesterday. I read that there was a change in the main actor, and my expectations for the series didn't change. To be honest, the first three seasons had me glued to my seat, while the last season, in my opinion, wasn't anything special (I hope no one takes offense, that's just my opinion). I have the impression that the series has gone in a different direction, and if it continues to be made, it might not be at a very good, strong level in terms of the story itself!",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1p1gaag/the_witcher/"
    },
    {
        "id": "1p0f4ky",
        "author": "Perfect_Category_907",
        "title": "My opinion on dark",
        "content": "Words are not enough to define the greatness of this show as a Mind-Bending horror mystery crime drama thriller series which encapsulates the sufferings of many people out there &amp; also answers our one of the most intriguing mysteries of our childhood while exploring the real meaning of life through the perfectly fitting Quotes in our life. There are so many subtle references that I can't even tell them all. This is such a show which will always go above your expectations, no matter how much you expect, you just need to re-watch it to realise this. One single watch is never enough. DARK IS AN EPITOME OF PERFECTION. Never believe\nanything else.",
        "upvotes": 76,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1p0f4ky/my_opinion_on_dark/"
    },
    {
        "id": "1p0nyj3",
        "author": "SSSnowBell",
        "title": "Not only is Netflix getting rid of Supernatural, but also Archer, The 100, and how I Met Your Mother. It's like I'm being targeted specifically!!",
        "content": "No way in hell I'm paying the ever-increasing subscription after they butcher my bingeables. Like literally, is there a more expensive streaming service than Netflix? I'm so done with Netflix come December...",
        "upvotes": 28,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1p0nyj3/not_only_is_netflix_getting_rid_of_supernatural/"
    },
    {
        "id": "1p1o77e",
        "author": "Kind_Dependent_5933",
        "title": "I cannot believe they’re removing supernatural off Netflix on December 17",
        "content": "They removed band of Brothers, then they remove Dexter, now supernatural. It’s absurd how they remove the stuff that draws people in. Honestly at this point I think I’m gonna cancel my subscription. ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1p1o77e/i_cannot_believe_theyre_removing_supernatural_off/"
    }
]