[
    {
        "id": "1lx8haf",
        "author": "InventionAMA",
        "title": "Hey r/movies! We're Courtney Stephens and Callie Hernandez, the filmmakers of the recent meta-fictional, experimental feature film INVENTION, that's now streaming on Mubi. You might also know Callie from La La Land, Alien: Covenant, Blair Witch, Under the Silver Lake, The Endless. Ask us anything!",
        "content": "Hey [r/movies](https://www.reddit.com/r/movies/)! We're Courtney Stephens and Callie Hernandez, the filmmakers of the recent meta-fictional feature INVENTION which riffs on real circumstances to explore the relationship between fantasy and grief -- both in personal life and how it reflects externally in America today. The film deals with weird medicine, losing dads and the emotional logic of conspiracy theory against the bucolic, literary backdrop of the Berkshires in the fall.\n\nSynopsis: In the aftermath of a conspiracy-minded father’s unexpected death, his daughter receives his patent for an experimental healing device. Featuring archive from actress Callie Hernandez's actual late father, INVENTION explores the process of grieving a complicated parent, and the filmmaking itself becomes a part of the process.\n\nTrailer: [https://www.youtube.com/watch?v=TFtolT9DE6M](https://www.youtube.com/watch?v=TFtolT9DE6M)\n\nWatch on MUBI: [https://mubi.com/en/us/films/invention-2024](https://mubi.com/en/us/films/invention-2024)\n\nAsk us anything! Back at 3 PM ET to answer questions.\n\nBios:\n\nCourtney Stephens is a writer/director of four features and numerous short films. Terra Femme, composed of amateur travel footage shot by women in the early 20th century, was a New York Times critic’s pick and has toured widely as a live performance. The American Sector (with Pacho Velez) follows slabs of the Berlin Wall installed around the US. John Lilly and the Earth Coincidence Control Office (with Michael Almereyda) explores the life of psychedelics pioneer John C. Lilly. Her films have been exhibited at MoMA, The National Gallery of Art, The Barbican, Walker Art Center, and film festivals including the Berlinale, Locarno, Rotterdam, Viennale, New Directors/New Films, Visions Du Réel, Thessaloniki, IDFA, BAFICI, True/False, Hong Kong, and the New York Film Festival. She is the recipient of a Guggenheim Fellowship, a Fulbright Scholarship, and grants from the Sloan Foundation and the Foundation for Contemporary Art.\n\nCallie Hernandez is an actress, writer and filmmaker. Her first film was Terrence Malick’s Song to Song followed by a decade of work as an actress. She is known for Ridley Scott's Alien: Covenant, Damien Chazelle's La La Land, A24’s Under the Silver Lake, HBO Max's The Flight Attendant, and Pete Ohs’ JETHICA. Upcoming work includes: Rachel Sennott’s Untitled Comedy Series, Albert Birney’s OBEX and James N. Kienitz Wilkins’ The Misconceived. In 2023, she founded an in-house film studio which yiel",
        "upvotes": 44,
        "comments": 75,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/i4102icaa9cf1.png?auto=webp&amp;s=8014786121eba690da8caeb2eac2d9c1bf0223b7"
        },
        "permalink": "/r/movies/comments/1lx8haf/hey_rmovies_were_courtney_stephens_and_callie/"
    },
    {
        "id": "1lwuvsq",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Superman) plus Throwback Discussions!",
        "content": "**New In Theaters**:\n\n* [Superman (2025)](https://old.reddit.com/r/movies/comments/1lwutny/official_discussion_superman_2025_spoilers/?)\n\n**25th Anniversary Throwback Discussion Threads**:\n\n* [Scary Movie](https://old.reddit.com/r/movies/comments/1lwutxk/official_throwback_discussion_scary_movie_spoilers/?)\n* [Disney's The Kid](https://old.reddit.com/r/movies/comments/1lwutyi/official_throwback_discussion_disneys_the_kid/?)\n* [But I'm a Cheerleader](https://old.reddit.com/r/movies/comments/1lwutzo/official_throwback_discussion_but_im_a/?)\n\n**Still In Theaters**:\n\n* [Jurassic World Rebirth](https://old.reddit.com/r/movies/comments/1lqdtaw/official_discussion_jurassic_world_rebirth/)\n* [F1: The Movie](https://old.reddit.com/r/movies/comments/1lli8lz/official_discussion_f1_the_movie_spoilers/?)\n* [M3GAN 2.0](https://old.reddit.com/r/movies/comments/1lli8nm/official_discussion_m3gan_20_spoilers/?)\n* [28 Years Later](https://www.reddit.com/r/movies/comments/1lfsc91/official_discussion_28_years_later_spoilers/)\n* [Elio](https://www.reddit.com/r/movies/comments/1lfscb2/official_discussion_elio_spoilers/)\n* [The Life of Chuck](https://www.reddit.com/r/movies/comments/1la4c8g/official_discussion_the_life_of_chuck/)\n* [Materialists](https://www.reddit.com/r/movies/comments/1la4c8n/official_discussion_materialists/)\n* [How to Train Your Dragon](https://www.reddit.com/r/movies/comments/1la4c8v/official_discussion_how_to_train_your_dragon/)\n\n\n**New On Streaming:**\n\n* [Heads of State](https://old.reddit.com/r/movies/comments/1lr5yb4/official_discussion_heads_of_state_spoilers/?)\n* [The Old Guard 2](https://old.reddit.com/r/movies/comments/1lr5ycn/official_discussion_the_old_guard_2_spoilers/?)\n* [Ice Road: Vengeance](https://old.reddit.com/r/movies/comments/1lr5ye1/official_discussion_ice_road_vengeance_spoilers/?)\n* [KPop Demon Hunters](https://www.reddit.com/r/movies/comments/1lghony/official_discussion_kpop_demon_hunters_spoilers/)\n* [Echo Valley](https://www.reddit.com/r/movies/comments/1lar0eb/official_discussion_echo_valley/) \n* [Deep Cover](https://www.reddit.com/r/movies/comments/1lar0ej/official_discussion_deep_cover/)",
        "upvotes": 84,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1lwuvsq/official_discussion_megathread_superman_plus/"
    },
    {
        "id": "1lxxilb",
        "author": "MarvelsGrantMan136",
        "title": "Sean Astin To Run For SAG-AFTRA President",
        "content": "",
        "upvotes": 23354,
        "comments": 648,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/YmrkcFw5TRizVeSRtdI1PBcPGtlKMR6LA5irFvxPW88.jpeg?auto=webp&amp;s=ddbf15755cb20d87cc88cc409a034fbd654fcb9e"
        },
        "permalink": "/r/movies/comments/1lxxilb/sean_astin_to_run_for_sagaftra_president/"
    },
    {
        "id": "1lyh2l2",
        "author": "BunyipPouch",
        "title": "First Poster for Sci-Fi Adventure 'The Man Who Shrinks' - Starring Jean Dujardin ('The Artist') - A shipbuilder inexplicably shrinks &amp; gets trapped in a basement. He must fight for survival in now-hostile ordinary household environment.",
        "content": "",
        "upvotes": 500,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ng7pkydyrjcf1.jpeg?auto=webp&amp;s=746dcad7f8667e2634c814aeb8cd1cb0ad965fcb"
        },
        "permalink": "/r/movies/comments/1lyh2l2/first_poster_for_scifi_adventure_the_man_who/"
    },
    {
        "id": "1lyktj5",
        "author": "XiskeletoniX",
        "title": "What film had an amazing concept but failed to execute it well?",
        "content": "I’m a huge fan of in time and I honestly still love the film now even with its story and plot issues, the poker scene is very memorable to me and I’m very interested in the criminal underworld that is hinted at with Alex Pettyfer (Alex rider as I know him), I wish there was more stories to be told on the big screen but i was wondering if anyone knows a film or even series where they feel the same as I do :)",
        "upvotes": 125,
        "comments": 287,
        "media": null,
        "permalink": "/r/movies/comments/1lyktj5/what_film_had_an_amazing_concept_but_failed_to/"
    },
    {
        "id": "1ly1lod",
        "author": "Scarcecrows",
        "title": "Watching Logan (2017)— has there ever been any other trilogy that started off awful and ended on such a high note?",
        "content": "X-Men: Origins had a different director than James Mangold granted, but hotdog water level writing and questionable FX made it borderline unwatchable. Then Mangold takes the reigns in The Wolverine, which while an improvement also suffers from a generic to downright bad third act that feels slapdash and rushed compared to the rest of the film (the director’s cut helps this somewhat). Then we get Logan, which IMO, is the best genre film aside from The Dark Knight (and Nolan’s trilogy had its own stumble with the enjoyable but flawed Rises). \n\nIs there any other trilogy that was so miles ahead of the first film? Or is Logan the only exception to this rule? \n\nEdit: I should preface, as rightly pointed out (thank you folks) that the trilogy could be defined loosely in this sense — but these were the three stand alone outings as Jackman’s Wolverine so, to that end, that was my metric for defining them as such and also because they do acknowledge events from the film. I believe they even tried to get Lieve back as Sabretooth and modeled X-24 after his look from Origins. So to that end, I don’t discount it. ",
        "upvotes": 1706,
        "comments": 522,
        "media": null,
        "permalink": "/r/movies/comments/1ly1lod/watching_logan_2017_has_there_ever_been_any_other/"
    },
    {
        "id": "1lygcnk",
        "author": "dancingbanana123",
        "title": "All in all, what movie do you think you've watched the most? That's including movies from when you were a kid.",
        "content": "There are a few movies that I first saw as an adult that I've seen several times now, like Good Will Hunting and Evil Dead. Idk if I've watched those more than Shark Boy and Lava Girl, though. I loved that movie as a kid and saw it so many times. My poor mother let me watch that movie three times in theaters.  She had to sit through it every time. Then it became one of those movies that you just see on TV and start watching again. Then I would rewatch it as an adult as just an amazing bad movie to laugh at. All in all, I've certainly seen it more than a dozen times. There were also all the movies we had on VHS and DVD, like the first Pokemon movie and Over the Hedge that I'm also sure I've seen a dozen times. If I had to guess though, I think Shark Boy and Lava Girl takes the crown, even though it's obviously not my favorite movie of all time today.",
        "upvotes": 225,
        "comments": 711,
        "media": null,
        "permalink": "/r/movies/comments/1lygcnk/all_in_all_what_movie_do_you_think_youve_watched/"
    },
    {
        "id": "1ly62e8",
        "author": "ratatouille211",
        "title": "Mad Max Fury Road ( 2015 ) is the greatest action movie ever!",
        "content": "I'm hammered and on my Nth watch of this masterpiece. This movie is what actions movies, and in general movies, should be. Not a single frame is wasted.\n\nIt's quite remarkable how this movie is going this way till interval, and then going back post interval and packs so much story in between its never ending action. \n\nHardy &amp; Theron nail their part but Nicholas Hoult character win the movie for me. \n\nBefore this movie, I never expected a movie to be all action. You expect movies to set a plot, to set up characters, to set up story, MMFR does everything without slowing down, and that's art for me.\n\nIt's like a video game where you follow the main character. It's like a heavy metal song you love. It's like the best TV series payoff you wait to happen for years. It's legit perfect. \n\nFrom the ridiculous guitarist belting riffs Iron Maiden would be proud of to the pole swinging assassins, it's just a feast for all senses. \n\nAnd, dare I say, if you little high, there not exists a better adrenaline inducing movie.\n\nCheers. ",
        "upvotes": 855,
        "comments": 308,
        "media": null,
        "permalink": "/r/movies/comments/1ly62e8/mad_max_fury_road_2015_is_the_greatest_action/"
    },
    {
        "id": "1ly56mk",
        "author": "Neo2199",
        "title": "From ‘The Big Lebowski’ to ‘Smurfs,’ John Goodman Reflects Candidly on His Life in Comedy",
        "content": "",
        "upvotes": 844,
        "comments": 67,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/dqRLvQ_j8cZxFwKA84OM2AY6FE8KwUtZvHNn7GEsFzw.jpeg?auto=webp&amp;s=d38a5481bc3f8336a670e6e1d3a52641b464221c"
        },
        "permalink": "/r/movies/comments/1ly56mk/from_the_big_lebowski_to_smurfs_john_goodman/"
    },
    {
        "id": "1lyhoh8",
        "author": "Galaga68",
        "title": "Night of the Comet • 1984 • Theatrical Trailer",
        "content": "",
        "upvotes": 141,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/C15rHxcbY797Ys9i2QwaR6sl1uYH2Vf0klWVegXqnFA.jpeg?auto=webp&amp;s=77355f1ad1794feb62adbc45474612b5cdb12c6d"
        },
        "permalink": "/r/movies/comments/1lyhoh8/night_of_the_comet_1984_theatrical_trailer/"
    },
    {
        "id": "1ly6v21",
        "author": "movie5short",
        "title": "New Poster for Freakier Friday (2025)",
        "content": "",
        "upvotes": 637,
        "comments": 137,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zyxml5zhghcf1.jpeg?auto=webp&amp;s=dbbe47c946cebf994a30b09b782805cc88aa3c6b"
        },
        "permalink": "/r/movies/comments/1ly6v21/new_poster_for_freakier_friday_2025/"
    },
    {
        "id": "1ly6be5",
        "author": "KillerCroc1234567",
        "title": "Evan Rachel Wood Says She Isn’t Returning for ‘Practical Magic 2’",
        "content": "",
        "upvotes": 677,
        "comments": 76,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wvZ7DzMbMftWf6jjd0hK9N3x_vDV_OBUogS-QbcGIHU.jpeg?auto=webp&amp;s=364296eb3db14e54c68067058e4b6aa98a1df591"
        },
        "permalink": "/r/movies/comments/1ly6be5/evan_rachel_wood_says_she_isnt_returning_for/"
    },
    {
        "id": "1lyap6m",
        "author": "BunyipPouch",
        "title": "New Poster for Crime-Thriller 'Sovereign' - Starring Nick Offerman, Jacob Tremblay, Thomas Mann, and Dennis Quaid - A father and son who identify as Sovereign Citizens, a group of anti-government extremists, find themselves in a standoff with a chief of police that sets off a manhunt.",
        "content": "",
        "upvotes": 283,
        "comments": 129,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cqc2ze9r9icf1.jpeg?auto=webp&amp;s=f1b427edcc1f31f7048268f1340192045af3d784"
        },
        "permalink": "/r/movies/comments/1lyap6m/new_poster_for_crimethriller_sovereign_starring/"
    },
    {
        "id": "1lyix3r",
        "author": "johnny_d123",
        "title": "Favorite “Unknown” movie you recommend watching",
        "content": "Whats your favorite “unknown” or lesser known movie that you really enjoyed watching. \n\nFor me its “Any Number Can Win” (Original French title: “Mélodie en sous-sol”, with Alain Delon\n\nPlot: A recently released convict plans one last heist, robbing a casino in Cannes. He recruits a younger, impulsive accomplice.",
        "upvotes": 77,
        "comments": 285,
        "media": null,
        "permalink": "/r/movies/comments/1lyix3r/favorite_unknown_movie_you_recommend_watching/"
    },
    {
        "id": "1lxx0p8",
        "author": "JonasKahnwald11",
        "title": "First images of Nicolas Cage, J. K. Simmons and Giancarlo Esposito from 'The Prince' - A politically-charged drama exploring the life of a troubled son within a powerful American dynasty.",
        "content": "",
        "upvotes": 1653,
        "comments": 93,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ule0u4kt4fcf1.jpeg?auto=webp&amp;s=5b1e46fdc8bc53f1c946905b0883b1b83506d909"
        },
        "permalink": "/r/movies/comments/1lxx0p8/first_images_of_nicolas_cage_j_k_simmons_and/"
    },
    {
        "id": "1lyke8a",
        "author": "ThoughtExtreme165",
        "title": "Mountainhead (2025) is the worst movie I have seen this year, spoilers",
        "content": "I just watched Mountainhead and honestly, it is the worst movie I have seen in 2025. The pacing is slow, the characters are shallow, and the plot feels like it is trying to be deep without actually saying anything. It pretends to be artistic, but it is just boring and confusing.\n\n&gt;!The plot to kill Jeff is where I completely gave up. It is supposed to be serious and emotional, but it was so cringe I actually laughed out loud. It felt like a bad parody, and then somehow Jeff survives anyway, which makes everything leading up to it completely pointless.!&lt;\n\n\n\n&gt;!The mountain does not mean anything, the visions go nowhere, and the entire journey adds up to absolutely nothing. They build up all this mystery for two hours and give you zero answers. It is just vague scenes, random symbolism, and a bunch of nonsense dressed up to seem important.!&lt;\n\n\n\nThe whole movie is a complete waste of time. It tries to look smart, but it is hollow from start to finish. In a year full of great films, Mountainhead stands out as a total failure.",
        "upvotes": 38,
        "comments": 168,
        "media": null,
        "permalink": "/r/movies/comments/1lyke8a/mountainhead_2025_is_the_worst_movie_i_have_seen/"
    },
    {
        "id": "1lyl4bw",
        "author": "tr7272",
        "title": "Spielberg’s directing is amazing even in his lesser movies",
        "content": "Was recently rewatching The Lost World and Indiana Jones and the Kingdom of the Crystal Skull to see how they hold up. Both of these films are absolutely flawed, but I am happy to say I really enjoy them, especially Lost World. \n\nStill, both of these movies have some of the dumbest fucking scenes I’ve ever seen that I genuinely don’t know how they got out of the writers room. Kicking the raptor out the window, Nuking the fridge, swinging with Monkeys, the entire character of Mac in Crystal Skull, all of that was pretty bad. \n\nBut man, there is some genuinely brilliant filmmaking in both, some of my favorite scenes from Spielberg ever. Everything with the T-Rex’s in Lost World is incredible. The Raptors long grass scene, all impeccably shot and tensely crafted filmmaking. Lost World is far and away the best Jurassic Park sequel. I really enjoy the San Diego 3rd act but it does absolutely feel very disconnected from the rest of the film. \n\nI love Crystal Skull’s opening at Area 51, vintage Indiana Jones, as well as the chase at the University. Love the chemistry between Shia Laboeuf and Harrison Ford, as they have a very interesting dynamic. I honestly think this movie is mostly very enjoyable, but definitely has the weakest 3rd act in the series. Everything after the Ants fight and waterfall is pretty stale. Still, the direction just has so much energy and urgency when compared to Dial of Destiny, which I think is good but slightly worse than Crystal Skull. Just nothing can beat Spielberg’s directing. \n\n",
        "upvotes": 35,
        "comments": 24,
        "media": null,
        "permalink": "/r/movies/comments/1lyl4bw/spielbergs_directing_is_amazing_even_in_his/"
    },
    {
        "id": "1lxk6jj",
        "author": "MarvelsGrantMan136",
        "title": "Bryan Cranston Addresses ‘Lone Wolf’ Troubles, Vows Not To Film Or Promote Movie Until Every Cast And Crew Member Is Paid Back In Full",
        "content": "",
        "upvotes": 8798,
        "comments": 228,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/n9XgMhGqDDl7Fp6XSMyvs-OeHqwiYUAGhak_iZm92CI.jpeg?auto=webp&amp;s=a0fbc8223daa852206e06336e4cb5cfc7f37c4af"
        },
        "permalink": "/r/movies/comments/1lxk6jj/bryan_cranston_addresses_lone_wolf_troubles_vows/"
    },
    {
        "id": "1ly10io",
        "author": "Neo2199",
        "title": "50 Years Later, Fascist Satire ‘A Boy and His Dog’ Goes Great with Deep Panic — and Summer Malaise",
        "content": "",
        "upvotes": 332,
        "comments": 23,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/V8uAmu-xAA66JrPQVR9mScTjScq4cJ5eAlYtNvoEemE.jpeg?auto=webp&amp;s=4ba320663891689bb900b257ee46083de602c287"
        },
        "permalink": "/r/movies/comments/1ly10io/50_years_later_fascist_satire_a_boy_and_his_dog/"
    },
    {
        "id": "1ly00mg",
        "author": "retired-tweeter",
        "title": "What dialogue in a movie that always bothered you?",
        "content": "I’m sure “don’t laugh, this ain’t reality TV” will get a lot of replies. That line is unintentionally hilarious. I may have laughed more if someone said that in real life.\n\nI am legend when Will Smith ask Anna if she knew who Bob Marley was and she said “Damian”? \n\nAlso that cheese wiz line in Endgame. Just kinda killed the entire vibe of the seriousness of that scene.",
        "upvotes": 375,
        "comments": 751,
        "media": null,
        "permalink": "/r/movies/comments/1ly00mg/what_dialogue_in_a_movie_that_always_bothered_you/"
    },
    {
        "id": "1lyeix0",
        "author": "Here_we_go_3893",
        "title": "Can you name a movie where all three acts feel like completely different movies?",
        "content": "I can’t seem to think of an example of any.\nI can think of movies where the first act is completely different from the second two. And I can think of movies where the final act is completely different from the first two. But I just can’t think of all three being different.\n\nI’m just curious if there are any examples of this, if so, what are they?",
        "upvotes": 51,
        "comments": 173,
        "media": null,
        "permalink": "/r/movies/comments/1lyeix0/can_you_name_a_movie_where_all_three_acts_feel/"
    },
    {
        "id": "1lykww3",
        "author": "ninga17",
        "title": "Zootopia 2 just had the best preview I have seen in a while",
        "content": "Hey all, \n\nJust wanted to come on here really quick after seeing \"Elio\" which I thought was fantastic btw, but not here to talk about! Before the film we had to watch previews and Zootopia 2 had a perfect trailer. It did several things correct in my opinion: \n\n1) It did not ruin any jokes or plot points of the movie! \n2) It let the audience know something new is coming, with some new characters\n3) It was quick and to the point. \n\nI feel like most previews absolutely ruin the film and make me think \"Why would I even bother seeing this in theaters?\" As a quick comparison, we got a trailer for the Gabby Dollhouse Movie and the preview told us essentially the entire film. \n\nShoutout to the person who made the Zootopia 2 trailer, I want more trailers like this! Have a great day",
        "upvotes": 16,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1lykww3/zootopia_2_just_had_the_best_preview_i_have_seen/"
    },
    {
        "id": "1lymnwv",
        "author": "justinsluss",
        "title": "Airplane II The Sequel on 4K in September",
        "content": "The 1982 film “Airplane II: The Sequel” is being released on 4K UHD Blu-ray and Special Edition Blu-ray on September 23rd via KL Studio Classics.\n\nKen Finkleman directed and co-wrote the film. It starred Robert Hays, Julie Hagerty, Lloyd Bridges, William Shatner, Peter Graves, Raymond Burr, and Chuck Connors. The cast also included Rip Torn, John Dehner, Chad Everett, Kent McCord, John Vernon, and Sonny Bono.",
        "upvotes": 11,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/D2Jtu2cl615Dk69rwQjRqTjDAzPYNmQxMb6X3z_Clpo.jpeg?auto=webp&amp;s=3773084ed1a4a19148fb566a7d4911b822268b94"
        },
        "permalink": "/r/movies/comments/1lymnwv/airplane_ii_the_sequel_on_4k_in_september/"
    },
    {
        "id": "1lx94qe",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'The Naked Gun' Starring Liam Neeson",
        "content": "",
        "upvotes": 34163,
        "comments": 1215,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ucgxqrj4f9cf1.jpeg?auto=webp&amp;s=e70feeea4ff4c5da7daca9bc2fa77edadc14e29e"
        },
        "permalink": "/r/movies/comments/1lx94qe/new_poster_for_the_naked_gun_starring_liam_neeson/"
    },
    {
        "id": "1lyjhuv",
        "author": "chiefmud",
        "title": "Looking for immersive gritty historical films",
        "content": "First of all, I loved Master and Commander. It transported me to another time and place with loads of atmosphere and historical detail. \n\nNow, I'm interested in historical depictions that aren't \"hollywood-ized\". Of course you need to juice things up with a plot, but how many films depict historical eras not in their glory, but rather in their misery? The distant past was unimaginably brutal, sick, and chaotic. The book The Wager is a good example of a gritty historical tale.\n\nAre there any movies (or shows and books for that matter) that do a good job of capturing the grit and doom of historical periods?",
        "upvotes": 13,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1lyjhuv/looking_for_immersive_gritty_historical_films/"
    },
    {
        "id": "1lxxrjc",
        "author": "Bojanglez789",
        "title": "Marlon Brando in Apocalypse Now",
        "content": "I recently saw Hearts of Darkness: A filmmakers apocalypse, which was incredible (and also quite really crazy).\n\nFrom what is shown &amp; how I interpreted that, it seems like he was only there for a paycheck. He was paid $1 million per week, refused to accept shooting schedule changes, promised to be in shape and then clearly wasn't, didn't learn his lines, hadn't read Heart of Darkness (obviously not required but it seemed like he had no clue on set based on the footage). I've also read other things (not sure if they are true or not so won't bother sharing)\n\nI know this is a divisive topic and I still think Brando was very impressive in Apocalypse now. but why was he was so difficult to work with?!? I have seen lots of talk online but never an explanation for this",
        "upvotes": 294,
        "comments": 119,
        "media": null,
        "permalink": "/r/movies/comments/1lxxrjc/marlon_brando_in_apocalypse_now/"
    },
    {
        "id": "1ly12t6",
        "author": "keepfighting90",
        "title": "Before Sunset might be the most perfect sequel ever, and just an incredible movie overall",
        "content": "I decided to jump into Richard Linklater's well-regarded Before trilogy as I recently finished the Normal People series and have been in the mood for melancholy romantic stories. Before Sunrise was really, really good - charming, romantic and captured that exuberance of doe-eyed youthful passion so well.\n\nBut Before Sunset, man, it's just on another level. Maybe it's because I'm the same age as the characters now, in my 30s and married and with some life experience but it felt so resonant. Jesse and Celine have grown and changed over the past decade - they're more jaded and cynical, and not the hopeless romantics they used to be. But this growth is what lends so much more depth and complexity in both personalities and the current state of their relationship, and how much that one night steered the course of their lives in the ensuing years.\n\nAs with Sunrise, the dialogue is really the star here and it's even better than before. Whereas in Sunrise, Jesse and Celine's conversations leaned more towards more fun and youthful and often idealistic, sometimes pseudo-intellectual (makes sense given their age), here they're tinged with a melancholy and occasional bitterness that can only be brought on by experiencing more of life. In Vienna, Jesse and Celine talked about art and love and literature and all these grand, human-condition concepts. Here, they talk about global warming, crime and broken romances. It's actually crazy just how well the script captures just how I've myself been feeling in my 30s.\n\nEthan Hawke and Julie Delpy's chemistry is as amazing as ever, and really sell the whole concept and premise.\n\nAnd that ending? Absolutely perfect. Jesse knows he's going to stay. He's probably known it all along.\n\nCan't wait to finish off the trilogy with Midnight",
        "upvotes": 159,
        "comments": 38,
        "media": null,
        "permalink": "/r/movies/comments/1ly12t6/before_sunset_might_be_the_most_perfect_sequel/"
    },
    {
        "id": "1lyk2xp",
        "author": "Icy-Management-9749",
        "title": "A Concentration Camp, a Father, and the Armor of Imagination",
        "content": "Rewatched Life is Beautiful today. When I was around 17, I asked my uncle, a Marine what he watches when he feels down or lost. He didn’t even pause didn’t even have to think. He said Life is Beautiful. At the time, I watched it but I don’t think I fully grasped it. My mind was still too young, maybe too untouched by life to comprehend it’s quiet ache, too cushioned to understand the quiet devastation hidden behind the laughter. I thought it was sweet, sad but now after life has carved itself into me now I really see it. \n\nNow at 29, rewatching it hit differently. I felt it in my bones. This film isn’t just a piece of cinema. This isn’t just a movie. It’s a father’s quiet rebellion against despair. A love story in the middle of a war. A reminder that sometimes the most heroic thing you can do is protect someone’s sense of wonder even as the world around you falls apart. It’s a meditation on love in it’s purest form. On fatherhood. On the power of imagination as a shield against horror. On hope when everything around you screams despair. It’s a love letter to the human spirit. To a father’s refusal to let the world dim his child’s light.\nIt doesn’t ask you to deny pain it simply shows you how light can still exist within it.\n\nWatching Guido that beautiful, foolish, radiant man laugh, joke, shield his son with nothing but imagination, it broke me. It reminded me of my uncle. How he never spoke much about what he saw or lived through, but how he showed up always with strength, always with humor. Maybe this is what he was trying to teach me all those years ago. That life will not always be fair. It will hurt. It will take but it will also give. And in the middle of all of it, you still get to choose how you love. You still get to choose how you show up for the people you love. You still get to choose beauty.\n\nNow coming to the movie Guido’s character is joy incarnate. He walks into every room with a joke, a sparkle, a story. Even when he’s thrown into unimaginable darkness, he keeps that light burning not for himself but for his son. Watching Guido smile through horror make a game out of hell protect his son’s innocence with nothing but humor and heart, it destroyed me. Not because it was sad. But because it was so full of love. That rare, boundless, unconditional kind. Sometimes surviving isn’t enough. Sometimes you have to find a way to make life feel beautiful even when it’s not. \n\nAnd I finally understood why my uncle a man who had tasted darkness and still chose kindness turned to this movie. Because some people don’t survive just for themselves. They survive for the ones they love. They laugh not because they’re blind to pain but because they know sometimes laughter is the only armor we’ve got. That kind of strength the quiet, selfless kind he carried too. Maybe that’s why he loved this film so much. Maybe that’s why he wanted me to see it.\n\nI wish I could sit with him today and tell him I finally get it. Years later, I finally get it. That I understand now what he was trying to show me back then. And I carry that with me now, a deeper understanding of what it means to love through pain, to protect with laughter and to believe in beauty when the world gives you every reason not to. That Life is Beautiful isn’t about denying suffering, it’s about choosing love anyway. Even when it’s hard. Even when it hurts.\n\nSo tonight, I sat with the version of me who was 17 and the version of me now. And we both cried. For the things we’ve seen. For the innocence we lost. And for the reminder that even in the most broken places, light still finds a way in.\n\nSo if your heart is heavy, if you feel like you’re losing grip watch this movie. Life is Beautiful. Not always. Not easily. But sometimes because someone chooses to make it so.\n\n",
        "upvotes": 10,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1lyk2xp/a_concentration_camp_a_father_and_the_armor_of/"
    },
    {
        "id": "1lxnwk9",
        "author": "ExistingMarzipan2422",
        "title": "What is the most “bro” movie of all time?",
        "content": "I am going on a bachelor party soon (something chill like cabin in the woods kind of vibe) and the group wants to have a movie night. Someone suggested ‘Gladiator’ stating “that’s just a bro movie”; this inspired me to ask the question….\n\nWhat is the most “bro” movie of all time? \n\nFor me, I was thinking maybe Saving Private Ryan but would love to hear what the community thinks.\n\nCheers!\n\n",
        "upvotes": 1217,
        "comments": 2201,
        "media": null,
        "permalink": "/r/movies/comments/1lxnwk9/what_is_the_most_bro_movie_of_all_time/"
    },
    {
        "id": "1lyghs1",
        "author": "Deep_Yoghurt8813",
        "title": "I wanna talk about Kids 1995",
        "content": "I really really, really liked it. It's a super raw and unflinching take on the aids epidemic in the nineties, but also about underage sex. It makes you really feel each of the characters, and I respect it for that, even if it did make for a uncomfortable watch. I already know that not everyone likes it, but I truly think everyone should try this movie at least once in their life. Also the soundtrack is dope lmao. Also for fans of harmony korine and Larry Clark, do y'all think gummo is a good watch",
        "upvotes": 15,
        "comments": 30,
        "media": null,
        "permalink": "/r/movies/comments/1lyghs1/i_wanna_talk_about_kids_1995/"
    },
    {
        "id": "1lygm4k",
        "author": "dancingbanana123",
        "title": "What age were you when you saw your first rated R movie, and how old do you think your kid would have to be before you'd let them watch one?",
        "content": "I think the first rated R movie I ever saw was when I was 5. My dad let me watch The Shining with him as long as I promised to not wake him if I had a nightmare about it. I remember telling my friends at school the next day how awesome the movie was and how a guy got hit with an axe. From then, my dad would always let me watch any R-rated movie, and then would just cover my eyes if there was any nudity in a scene. If there was a sex scene, he'd send me out of the room and tell me come back later (these were always movies playing on tv, so he had already seen them and knew when those scenes were coming up). The only movies I wasn't allowed to watch were slasher horror movies, mainly because they just knew that'd give me a nightmare. Once I was in like 6th grade or so, they were fine with me watching those.\n\nWhen I talk to others about that though, that apparently wasn't the norm with everyone. I personally liked it and thought I'd be fine with doing the same with a kid, but I'm curious what y'all's experiences were.",
        "upvotes": 15,
        "comments": 161,
        "media": null,
        "permalink": "/r/movies/comments/1lygm4k/what_age_were_you_when_you_saw_your_first_rated_r/"
    },
    {
        "id": "1lyl3f2",
        "author": "salton",
        "title": "Poo bear and Danny Parker making a deal.",
        "content": "",
        "upvotes": 3,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/4Znw_spzGyY4onhM7hrL8EI38xk-oL1jRgCk7RmblhY.jpeg?auto=webp&amp;s=cf7a857f60d0cd9c762ebe7180d4e29aaaf671bb"
        },
        "permalink": "/r/movies/comments/1lyl3f2/poo_bear_and_danny_parker_making_a_deal/"
    }
]