[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 9,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 530,
        "comments": 3956,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1ncag2d",
        "author": "powcatnipdoll",
        "title": "The new layout of Netflix is so lame",
        "content": "One of the most iconic things about Netflix was their distinct layout compared to other streaming platforms and now it looks boring, it doesn’t feel iconic anymore, plus the amount of disappointing not good shows, Hulu and Disney hotstar might just be better idk",
        "upvotes": 159,
        "comments": 26,
        "media": null,
        "permalink": "/r/netflix/comments/1ncag2d/the_new_layout_of_netflix_is_so_lame/"
    },
    {
        "id": "1nbwkfu",
        "author": "Elegant-Spare6527",
        "title": "Nothing worth watching",
        "content": "Netflix used to be the bomb. For months, and it's getting worse, there is very literally nothing worth watching. Anything new is likely some 3rd rate movie with subtitles and actors you've never heard of. Or passing off as new, movies from years ago. Used to look forward to checking each day for something good (and there was always something new). Now. Just sucks! What happened?! ",
        "upvotes": 277,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1nbwkfu/nothing_worth_watching/"
    },
    {
        "id": "1ncn0hz",
        "author": "ZestycloseFig4025",
        "title": "Ever wish your doctor explained things like Shaun does?",
        "content": "I been watching The Good Doctor and it really got me thinking about how rare it is to have a doctor who actually takes the time to explain things clearly. Shaun walks patients through their options breaks down complicated medicalinfo and never talks down to them its the kind of care a lot of people just don’t experience in real life. Most appointments I had feel rushed Lab results get thrown at me with no explanation or I get a quick everything looks fine with zero context. It leaves a lot of questions hanging and makes it hard to know what to do next or what even matters.  \nWatching The Good Doctor just kind of reinforced how helpful it is to have something that brings that kind of clarity and support into real life even if its through tech.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ncn0hz/ever_wish_your_doctor_explained_things_like_shaun/"
    },
    {
        "id": "1nblgi9",
        "author": "Deanno0",
        "title": "List the best true crime documentary’s on Netflix",
        "content": "List the best true crime documentary’s on Netflix it can be either a movie or a series just list something that’s actually like a bizarre twist or a crazy story !!! Thanks everyone ",
        "upvotes": 488,
        "comments": 404,
        "media": null,
        "permalink": "/r/netflix/comments/1nblgi9/list_the_best_true_crime_documentarys_on_netflix/"
    },
    {
        "id": "1ncm8cp",
        "author": "Sad-Rush-4269",
        "title": "Netflix indiano?",
        "content": "Hi everyone, I was looking for information. A friend of mine created an account in India directly from India, using a credit card and paying in India. It's working. I previously created neflfix with Turkish gift cards and was banned (all such accounts will be banned). I checked, and the Italian catalogs are available even if I connect from Italy and the account is Indian. Have you tried it? They told me it will work without any problems.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ncm8cp/netflix_indiano/"
    },
    {
        "id": "1nc3jau",
        "author": "dat-bitch16",
        "title": "best documentaries",
        "content": "what are the best/most controversial documentaries on netflix? im looking for ones similar to the train wreck series, tinder swindler, things like that",
        "upvotes": 30,
        "comments": 58,
        "media": null,
        "permalink": "/r/netflix/comments/1nc3jau/best_documentaries/"
    },
    {
        "id": "1ncf6rd",
        "author": "rmajor86",
        "title": "\"This account is not authorised to view recently released titles\" - I get this error on ALL devices - phone, laptop and TV. Help! (Info in body text)",
        "content": "I can watch older content, but cannot watch anything marked as \"recently added\". I have a Premium plan. I can stream in UHD with HDR etc, but any time I go to watch things that are marked \"recently added\" it says I can't watch them. This is fairly new, certainly I watched the new (half) season of Wednesday when that came out.\n\n\nThe E100 error would suggest that there's maybe a cacheing issue or something similar, but I've not used my laptop to stream in a very, very long time, there's no cache there, and like I say, its only 'Recently added\" stuff that gives this problem.\n\nI've tried streaming lots of older stuff - works great.\n\n\nI've tried streaming a variety of \"recently added\" - the same error.\n\n\nAny advice or help? I briefly tried the online chat, but they just wanted me to reset my TV, and that's obviously not going to fix what would appear to be an account level issue.\n\n\nETA - this happens on my home WiFi, as well as on 4G/5G.\n\n\nHelp!",
        "upvotes": 3,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1ncf6rd/this_account_is_not_authorised_to_view_recently/"
    },
    {
        "id": "1ncdjgi",
        "author": "Artdiction",
        "title": "Worst Roommate Ever left out the nuance: Jamison Bachman wasn’t just a villain — losing his pets may have triggered his collapse”",
        "content": "Honestly, I think Worst Roommate Ever made Jamison Bachman look way too one-dimensional. Yes, he was manipulative and parasitic for decades, but he wasn’t openly violent until very late in life. What really stood out to me was how things escalated after he lost his pets.\n\nThe dog being taken away, the court banning him from having animals, then the cat dying while he was in jail — those weren’t small things. Pets may have been his only real anchor, the only beings that didn’t reject him. Once those were gone, plus his reputation in court and his brother refusing to house him, he basically collapsed.\n\nThat’s why I don’t fully buy the “he killed his cat” angle — if he was such a bad pet parent, why were his animals alive and well for years? To me it feels more like two unstable people clashing (the last roommate probably had her own issues) until it became explosive. His suicide in jail also says a lot — not a guy who loved life ruining others, but someone full of self-hatred once stripped of control. Netflix flattened him into a villain, but the real story feels way more tragic and complicated.\n\nIf you look at people like Ricky Morrisey who scammed women and abandoned his dog, or con man like Todd Dean, that’s much colder and more psychopathic than Bachman, who at least took care of his pets. Bachman spiraled after losing them, which shows he had attachments — twisted, yes, but real.\n\nWhat do you guys take on this? Why did the latest roommate took his dog? Some Reddit posts even suggest she had her own issues (e.g. drugs), which would make this more of a “two unstable people colliding” tragedy. If this was handled better, perhaps his brother’s life can be saved. ",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ncdjgi/worst_roommate_ever_left_out_the_nuance_jamison/"
    },
    {
        "id": "1nbryhq",
        "author": "PinEasy2215",
        "title": "Love on the Spectrum tears",
        "content": "I had this fight with my partner that started because I didn’t reply to a text for like 5 hours. I was deep in a task and totally lost track of time but he took it as me being cold or avoiding blla bllaa It escalated way more than it should. That night I threw on Love on the Spectrum to distract myself and there was this one woman who said something like Sometimes I feel like I love people wrong. And I just started crying cuz its how i feel [sometimes.Im](http://sometimes.im/) def doing everything I can but it lands wrong anyway. Why is it so easy to be misunderstood when youre doing your best? How do you explain that quiet doesnt mean distant and space doesnt mean disinterest?  \n  \nThe next day I put on an episode of Couples Therapytotal emotional spiral I know and Dr. Orna was working with this couple where one partner kept shutting down emotionally and said something like Its not that you dont feel it’s that youre overwhelmed by feeling and freeze. And HOLY HELLL !!! I paused it and just sat there. It was my mirror, exactly me. Not cold just flooded. Weve been trying to work on things since. I use OurRitual on my own sometimes to help get thoughts straight before we talk it’s structured but I still have moments where I feel like Im speaking an emotional dialect no one else quite understands.He still gets frustrated and I still shut down. We havent solved it at times I still avoid my phone for half a day and brace for the guilt when I finally open it but I’m not pretending its nothing anymore. That’s new.",
        "upvotes": 79,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1nbryhq/love_on_the_spectrum_tears/"
    },
    {
        "id": "1ncdouf",
        "author": "philkren",
        "title": "Netflix deleted my balance",
        "content": "I recently noticed, that netflix deleted about 1.700 TRY (~40$)  of already paid balange off my accout. \n\nThey didn't book it back or anything...it seems they just deleted it ...WTF??\n\nHas this ever happened to someone, and what did you do about it? Support is unreachable...",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ncdouf/netflix_deleted_my_balance/"
    },
    {
        "id": "1nc0mpq",
        "author": "Ravenmn",
        "title": "Orphan Black - good memories!",
        "content": "Has anyone tried it yet? I loved this show and just watched the first episode. So good! Great set up. Interesting throughout and what an amazing ending!",
        "upvotes": 12,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nc0mpq/orphan_black_good_memories/"
    },
    {
        "id": "1ncjcxc",
        "author": "Sonicexe10",
        "title": "Hot take but sometimes I don't like Netflix making anime cause they make 2 seasons then abandon it even if the manga isn't finished",
        "content": "A good and prime example is komi can't communicate, an incredible anime that only has 2 seasons or 24 episodes and it covers the first year of their school life, then 4 years later when the anime hasn't covered the whole manga at all, they haven't announced anything for season 3 even tho they're still so much to cover from the manga.\n\n\nSometimes I just feel like Netflix does anime dirty, whether not including the rest of the seasons (like you gi oh only having the first season) or not having it in dub too ( like diama )",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1ncjcxc/hot_take_but_sometimes_i_dont_like_netflix_making/"
    },
    {
        "id": "1nbwa14",
        "author": "SoftPois0n",
        "title": "Leanne Morgan &amp; Chuck Lorre Comedy ‘Leanne’ Renewed For Season 2 By Netflix",
        "content": "",
        "upvotes": 16,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nbwa14/leanne_morgan_chuck_lorre_comedy_leanne_renewed/"
    },
    {
        "id": "1ncdlaj",
        "author": "UrthMayn",
        "title": "A worse plot hole I noticed in supacell:",
        "content": "something that’s irked me is that their abilities came outta nowhere. like yeah yeah they got powers cause of sickle cell hence why it’s called supacell but like it’s not like sickle cell is like cancer where it comes from radiation or sum else it’s an inherited genetic mutation, why didn’t their powers just be a thing already like laying dormant in them? The thing that’s annoying is there were people with powers in the very first sequence of episode 1 (a healer was tryna escape the organization’s facility) and all their powers come in randomly later on at like different times (or I guess the same time technically cause it was different episodes but that’s… kinda worse?!) Likee when the series kicks off they all randomly just acquire abilities this late in their lives with no rhyme or reason even though though sickle cell is a genetic mutation you inherit since birth and it’s been established that there are already people with powers being held captive by the evil org feels a bit (immensely) hard for me to suspend disbelief ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ncdlaj/a_worse_plot_hole_i_noticed_in_supacell/"
    },
    {
        "id": "1nclrqj",
        "author": "sjmleicester",
        "title": "Is Netflix worth it any more",
        "content": "I’ve just come off a SkyTV contract which included Netflix premium. Looking at how little I watch on Netflix anyway I’m struggling to justify continuing with it especially at the £18.99 monthly fee which seems excessive. \n\nAmazon Prime seems to off so much more these days and a cheap subscription to Disneyplus is giving me AlienEarth and a whole lot more. \n\nAre people sticking with Netflix or dumping it like SkyTV\n\nAlso can’t believe how rude their support staff are",
        "upvotes": 0,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1nclrqj/is_netflix_worth_it_any_more/"
    },
    {
        "id": "1nc3v0u",
        "author": "_hkari_",
        "title": "Comedy movies",
        "content": "Going to walmart to get some popcorn, but any good suggestions for comedy movies? Or a good documentary. Hopefully returning to some suggestions lol. Anything really helps. I saw the recent documentary of the mom that sent her daughter terrible messages. ",
        "upvotes": 4,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nc3v0u/comedy_movies/"
    },
    {
        "id": "1nc1ljv",
        "author": "Michaelscottera",
        "title": "Squid game ending disappointed the shit outta",
        "content": "I was looking forward to those VIPs being killed by the frontman,but what he did also disappointed me,like after all them vips where talking shit about his own people,and then everybody died which was expected but not Gi-Hun dammit…I was hoping he would’ve make and end to this came yet he just gave up….and then Cate Blanchett appearing out of nowhere were being the recruiter?honesty wtf",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1nc1ljv/squid_game_ending_disappointed_the_shit_outta/"
    },
    {
        "id": "1nbz6do",
        "author": "fostes1",
        "title": "Browse by subtitles",
        "content": "So i ask for my parents. I want to get one month of netflix for them. But they dont speak english. So my question is can i configure to netflix only show shows and movies that have subtitles that i choose, croatia or bosnia? And make this every time netflix is turned on because they are not tehnical persons? ",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nbz6do/browse_by_subtitles/"
    },
    {
        "id": "1nc5r51",
        "author": "Mr_Epitome",
        "title": "Greg Rucka.. More like..",
        "content": "Greg Sucka\n\nJeez! The Old Guard 2 sucked so many hot snakes I’m going to actively not watch any of his other screenplays. \n\nDon’t want to be let down anymore than we already are in these modern times? Keep the original The Old Guard at the gates. We don’t need the next generation. AI has a lot of ML training.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nc5r51/greg_rucka_more_like/"
    },
    {
        "id": "1nc2sc6",
        "author": "nicolaswalker",
        "title": "What happened to the spoilers website?",
        "content": "There used to a netflix spoilers website with a big red button and gifs of big spoiler scenes from movies/TV shows, it seems to be gone. Anyone know what happened? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nc2sc6/what_happened_to_the_spoilers_website/"
    },
    {
        "id": "1nbjf6d",
        "author": "Sweaty-Toe-6211",
        "title": "Josh Brolin Says Knives Out Sequel Cast's Chemistry was so Intense it Felt Like 'An Orgy’ on Set",
        "content": "",
        "upvotes": 20,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nbjf6d/josh_brolin_says_knives_out_sequel_casts/"
    },
    {
        "id": "1nawp65",
        "author": "AlanisBeauty",
        "title": "I’ve lost three snacks, one sock, and approximately an hour of my soul scrolling Netflix.",
        "content": "I need a show or movie so addictive it’ll make me forget I have a job, friends, and basic human responsibilities. Something that pulls me in, traps me on my couch, and convinces me that showering and eating are optional. Give me the content that will ruin my productivity, devour my free time, and leave me questioning all my life choices—but in the best way possible.",
        "upvotes": 540,
        "comments": 260,
        "media": null,
        "permalink": "/r/netflix/comments/1nawp65/ive_lost_three_snacks_one_sock_and_approximately/"
    },
    {
        "id": "1nbrd6c",
        "author": "peoplemagazine",
        "title": "Love on the Spectrum Tops Mormon Wives, Welcome to Wrexham with 2025 Emmys Win for Best Unstructured Reality Program",
        "content": "",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nbrd6c/love_on_the_spectrum_tops_mormon_wives_welcome_to/"
    },
    {
        "id": "1nc5q5u",
        "author": "thekvd",
        "title": "Ads on WWE Raw despite Premium Ultra HD Plan",
        "content": "I've been watching since the beginning and never had an ad till tonight. Restarted the app and the tv. Still ads. \n\nContacted customer service for help. First thing they did was tell me I had to use self service for account changes even though I didn't need to make any. Then, with 2 to 5 minutes between replies, spent the next half hour bouncing between \"looking into it\" and regurgitating the same article that says it's supposed be that way. \n\nThing is, it never has been. That was the point I kept making. \n\nSo I'm asking here, is anyone else seeing ads suddenly? Is it a bug? Any chance anyone here knows? \n\nThanks in advance! ",
        "upvotes": 0,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1nc5q5u/ads_on_wwe_raw_despite_premium_ultra_hd_plan/"
    },
    {
        "id": "1nc4zzs",
        "author": "bigguys45s",
        "title": "Just curious, would any SpongeBob fans like to see the classic cartoon episodes back on Netflix?",
        "content": "I sure would like to! Also along with the classic 1st 2004 and 2nd 2015 “sequel” like type movie as well.\n\nThe original SpongeBob seasons and years sure were quite special for sure! Good times indeed and nostalgic childhood memories for sure!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nc4zzs/just_curious_would_any_spongebob_fans_like_to_see/"
    },
    {
        "id": "1nbcr1b",
        "author": "Best_Blake",
        "title": "The one year anniversary of Kaos' cancellation is in a month and I'm still sad about it :(",
        "content": "I miss this show. Literally my favorite show of all time and it's just cancelled I'll never get to know what happens. The writing was sooooo clever and the cinematography and colors were beautiful. I wish I could have it back but it's hard for me to rewatch without crying because I know I'll never find out what happens.",
        "upvotes": 42,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1nbcr1b/the_one_year_anniversary_of_kaos_cancellation_is/"
    },
    {
        "id": "1nbryxr",
        "author": "Aggressive-Fudge9109",
        "title": "Help out a grad student- quick survey about streaming services",
        "content": "I’m a grad student working on my master’s thesis, and I’m researching how people use streaming services and their preferences when it comes to ads vs. ad-free subscriptions.\n\nIf you’ve got a few minutes, I’d really appreciate it if you could take my survey!\n\nhttps://forms.gle/bGADZ4h138wEsxmk7\n\nThanks so much for your time! ",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nbryxr/help_out_a_grad_student_quick_survey_about/"
    },
    {
        "id": "1nc2srp",
        "author": "BeneficialLeg3873",
        "title": "Is Franklin &amp; Bash the most fun “buddy” show to ever be canceled?",
        "content": "The answer is: yes it is.  \nI can think of quite a few good shows canceled early, but this one really stands out.  The back and forth between the main characters, the party scene at the house and of course, the great Malcolm McDowell.  What a missed opportunity.  ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nc2srp/is_franklin_bash_the_most_fun_buddy_show_to_ever/"
    },
    {
        "id": "1nc1c28",
        "author": "redstoneofajah",
        "title": "only one show doest load but others do..",
        "content": "basically i was trying to watch the last season of shameless and it wouldnt load, so i tried to watch a different show and it worked perfectly fine... i teied it with ankther show and that one worked too. I dont know what the problem is here",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nc1c28/only_one_show_doest_load_but_others_do/"
    },
    {
        "id": "1nc06n0",
        "author": "Prikjills",
        "title": "Lost Movie from my childhood",
        "content": "right so i’ve just had a convo with my friends about movies and series’s they’ve watched on Netflix and i distinctly remember this one movie (at least i think it was) and i cannot for the life of me remember the name of it or what the story entails.\n\nparts i do remember was i believe it was a video game university type setting and there was these two dudes that would share a dorm and i remember them playing this like skyrim looking game but they were portraying the game characters and they had started beef over this sword that had some strange gimmick with who wields it and what not.\n\ni also remember there being this thing with like pizza rolled up in like a cinnamon bun can that you could get from vending machines.\n\nif anyone can remember this and let me know id greatly appreciate it 🙏\n\n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nc06n0/lost_movie_from_my_childhood/"
    }
]