[
    {
        "id": "1p39131",
        "author": "IcefoxX5",
        "title": "[Match Thread] Unionistas de Salamanca CF - Real Madrid Castilla | Primera Federación, Matchday 13",
        "content": "#FT: UNIONISTAS 3:0 CASTILLA\n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n1:0 Gastón Vallés 15'\n\n2:0 Víctor Olmedo 78'\n\n3:0 Álvaro Gómez 81'\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n⚽ 15' - goal for Unionistas - bad clearance in the box after a cross, and Fran can save the volley shot that followed on the rebound nicely at first - the ball comes to Unionistas' Valles though, and Fran jumps to early lying on the ground, making it easy for him to convert the rebound\n\nHT - possibly the best half of the season against Cacereño is followed by one of the worst by Castilla, who can't find a way to control this match so far, are physically overwhelmed by Unionistas and couldn't create a noteworthy opportunity yet \n\n🔄 46' - 2nd half underway with a double sub, Aguado and Pol Fortuny on for Manu Serrano and Mesonero \n\n64' - best chance for Castilla after a solo run by Yáñez - the keeper can save his curled shot at the far post\n\n71' - penalty for Unionistas, their player heads the ball onto Joan's arm from a short distance while he was walking backwards, very debatable... \n\n74' - the game is currently halted due to an electricity outage in the stadium \n\n⚽ 78' - finally the game continues, Arbeloa's challenge is not succesful and Olmedo converts... \n\n🔄 79' - Cristian David on for David Jiménez\n\n⚽ 81' - game over for Castilla, pathetic free kick by Yáñez that ends up becoming a dangerous counter instead - their attacker hits the post first, but the rebound, despite huge amounts of time and space for our defenders, is getting recovered by Álvaro Gómez, who finishes from a tight angle. Absolutely awful performance by Castilla\n\nFT - a performance to forget and a very deserved loss for Castilla, who couldn't find their usual flow and then got taken out for good by a quick double blow in the second half. A disappointing and surprisingly bad performance after the good match against Cacereño, and they quickly need to brush it off before the next matchday\n\n\n&amp;#x200B;\n\n**Kickoff:** 21:15 CET\n\n**Venue:** Estadio Municipal Reina Sofía, Salamanca \n\n**Referee**: Aimar Velasco Arbaiza\n\n**Competition:** Primera Federación, Grupo 1, Matchday 13\n\n**Viewing options:** \n[LaLiga+](https://www.laligaplus.laliga.com/) (subscription - 14.99€/month) (only available in Spain)\n\n&amp;#x200B;\n\n**Castilla XI** (4-3-3): Fran González - Manu Serrano (46' Diego Aguado), Víctor Valdepeñas, Joan Martínez, David Jiménez (79' Cristian David) - Jorge Cestero, Thiago Pitarch, Dani Mesonero (46' Pol Fortuny) - Álvaro Leiva, César Palacios, Dani Yáñez\n\nBench: Javi Navarro (GK), Guille Súnico (GK), Mario Rivas, Lamini Fati, Álvaro Ginés, Loren Zúñiga. \n\nUnavailable: Jesús Fortea (injury), Manuel Ángel (red card suspension), Roberto Martín (injury), Bruno Iglesias (injury), Hugo de Llanos (injury), Rachad Fettal (injury). \n\nCoach: Álvaro Arbeloa\n\n&amp;#x200B;\n\n**Castilla last five matches:** WDWLW\n\n**1ª RFEF stats:** 5th | 21pt | 7-0-5 | 15:13\n",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p39131/match_thread_unionistas_de_salamanca_cf_real/"
    },
    {
        "id": "1ozddku",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 22,
        "comments": 1144,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ozddku/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1p3f6wt",
        "author": "arizonasportspain",
        "title": "Kaká vs Barcelona (A) (2009)",
        "content": "",
        "upvotes": 172,
        "comments": 22,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/xuy0dbnhdp2g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p3f6wt/kaká_vs_barcelona_a_2009/"
    },
    {
        "id": "1p3au17",
        "author": "TheFeatherDiaries",
        "title": "Arda Güler's Pressing numbers are EXCELLENT amongst La Liga midfielders with more than 500 minutes this season. Güler ranks First in Pressure Regains and Counterpressure Regains and posts elite Defensive Action Regains and Counterpressure numbers.",
        "content": "",
        "upvotes": 167,
        "comments": 30,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/vxtbjansfo2g1.jpeg?auto=webp&amp;s=8012fa89d7fadb1acaa8dd0ba69dd0a9cc31f6eb"
        },
        "permalink": "/r/realmadrid/comments/1p3au17/arda_gülers_pressing_numbers_are_excellent/"
    },
    {
        "id": "1p31cns",
        "author": "Bald-Eagle619",
        "title": "Javier Tebas: \"Illegal streaming is stealing, and stealing is prohibited in Moses’ 7th commandment in Bible. If we want a world where everything is free, then maybe we should live somewhere else — North Korea or wherever. If piracy disappeared, watching football would be much cheaper.\"",
        "content": "",
        "upvotes": 351,
        "comments": 193,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/1WvbF1KX9KBSzIHANo_21Zg3XxVBt8VbDLAI16p4Emo.jpeg?auto=webp&amp;s=4b98d4affa972ffca39ed764f685efef1b51771e"
        },
        "permalink": "/r/realmadrid/comments/1p31cns/javier_tebas_illegal_streaming_is_stealing_and/"
    },
    {
        "id": "1p34qh0",
        "author": "Brucekentbatsuper",
        "title": "English Media Under Fire for 'Relentless' Scrutiny of Jude Bellingham as Fans Question the Agenda",
        "content": "",
        "upvotes": 134,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/5XCTqzBm5Ye2j2jhnhxeGPRSDgDjUiiR-p-iV_JaaqU.png?auto=webp&amp;s=c28a927abef3248b2a992bf41a326f138329c4bc"
        },
        "permalink": "/r/realmadrid/comments/1p34qh0/english_media_under_fire_for_relentless_scrutiny/"
    },
    {
        "id": "1p3h6rw",
        "author": "jipsjips",
        "title": "How do you think Toni Kroos would’ve impacted 24-25’ had he stayed for another year?",
        "content": "Considering how smoothly Jude transitioned into the squad his first year. Do you think the addition of Mbappe would have also received the same care had Toni stayed another year? Let me know what the best and worst scenario do you think may have happened for the club. \n\nIMO him staying would have been for the best. Even if he only gave 45 mins a match. \n",
        "upvotes": 19,
        "comments": 29,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p3h6rw/how_do_you_think_toni_kroos_wouldve_impacted_2425/"
    },
    {
        "id": "1p300l1",
        "author": "KhazraShaman",
        "title": "Has anyone bought the Real Madrid adidas Gazelle shoes?",
        "content": "I find the stiff tongue to be incredibly bizzare and I'm thinking about returning them. Have you used them? What happens with the tongue after wearing the shoes for some time?",
        "upvotes": 85,
        "comments": 13,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p300l1/has_anyone_bought_the_real_madrid_adidas_gazelle/"
    },
    {
        "id": "1p31ul2",
        "author": "Ineedhelpistaken",
        "title": "Remember Mbappe bicycle kick agains BVB?",
        "content": "https://reddit.com/link/1p31ul2/video/05ncvf8hqm2g1/player\n\nWhat a brilliant goal from our future GOAT, Mbappé, genuinely one to truly remember. And the funniest part? The man pulled that off right after battling diarrhea. Imagine dropping defenders *and* dropping… well, you know. Keep that in mind every time you think about how ridiculous that finish was. Absolute madness.",
        "upvotes": 71,
        "comments": 25,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p31ul2/remember_mbappe_bicycle_kick_agains_bvb/"
    },
    {
        "id": "1p3fhug",
        "author": "Significant_Nose8649",
        "title": "Will the Supercopa affect the Levante match on Jan 18? Need advice for travel plans.",
        "content": "Hello Madridistas!\nI’ll be in Madrid for meetings between January 12–16, and I noticed that we play Levante on the 18th. I’m thinking of staying a couple more days to watch the match.\n\nMy question is: if we reach the Supercopa final on the 12th in Jeddah, is there a chance the Levante match gets postponed? Or does La Liga usually keep the schedule as it is? I’m also wondering if the Champions League match vs Ajax on the 20th affects anything.\n\nBasically: should I book my return flight for the 19th to safely catch the match, or is there a real chance that Supercopa/CL scheduling will push the Levante game to another date?\n\nAny advice from people familiar with La Liga scheduling would be really appreciated.",
        "upvotes": 8,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p3fhug/will_the_supercopa_affect_the_levante_match_on/"
    },
    {
        "id": "1p20t1t",
        "author": "Bald-Eagle619",
        "title": "Ian Wright: “Certain people are NOT ready for a black superstar in England. Everyone loves N’Golo Kante, he’s a humble black man it’s how he is. But when we Paul Pogba or Jude Bellingham that energy doesn’t fit well with these people, it FRIGHTENS these people. Jude’s too “uppity” for these people.”",
        "content": "The full quote\n\n&gt; IAN WRIGHT: “Certain people are NOT ready for a black superstar in England. \n\n&gt; Everyone loves N’Golo Kante, he’s a humble black man, it’s how he is. But when we Paul Pogba or Jude Bellingham, that energy does not fit well with these people, it FRIGHTENS these people.\n\n&gt; Jude’s too “uppity” for these people. \n\n&gt; As a black man when you go out, you are told to keep your head down. If you are black man who’s outspoken at this level, it scares certain people. \n\n&gt; This person I’m referring to is obsessed with Jude Bellingham. He’s moving off this energy, he can’t see a black man doing what Jude’s doing.”",
        "upvotes": 1165,
        "comments": 279,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/uvhky181ee2g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p20t1t/ian_wright_certain_people_are_not_ready_for_a/"
    },
    {
        "id": "1p205z2",
        "author": "TheFeatherDiaries",
        "title": "No midfielder in Europe has more assists this season than Arda Guler (9)",
        "content": "",
        "upvotes": 1061,
        "comments": 100,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/rhq6j3h57e2g1.jpeg?auto=webp&amp;s=2cc28d4c737ba130ebd8c48332dc6fec3bf1cf9b"
        },
        "permalink": "/r/realmadrid/comments/1p205z2/no_midfielder_in_europe_has_more_assists_this/"
    },
    {
        "id": "1p24t3u",
        "author": "No-Independent2522",
        "title": "English media when it comes to Bellingham",
        "content": "",
        "upvotes": 504,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yvly8wehbf2g1.jpeg?auto=webp&amp;s=cb10f78fc8248031498a060af396811a132e2aa7"
        },
        "permalink": "/r/realmadrid/comments/1p24t3u/english_media_when_it_comes_to_bellingham/"
    },
    {
        "id": "1p20et8",
        "author": "royrochemback",
        "title": "Life as Real Madrid fan in east asia",
        "content": "The next 8 matches will be played at 4 AM in my country except for the game against Athletic Club at 2 AM which is still damn late. And out of those 8 games, 7 games will fall on weekdays.\n\nI've already miss a few early morning games this season because i am just too tired and looks like I am going to miss more this season. Sucks bad.",
        "upvotes": 484,
        "comments": 97,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p20et8/life_as_real_madrid_fan_in_east_asia/"
    },
    {
        "id": "1p241i6",
        "author": "Ready_Ad_1353",
        "title": "Thibaut Courtois: \"Top 3 goalkeepers in the world now? I will step aside (laughs). Oblak in 3rd, Alisson and David Raya.\"",
        "content": "",
        "upvotes": 264,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/swIuN83O0rm1hK6xo_84W_D_3gt8RLGsaxsX08gviIQ.jpeg?auto=webp&amp;s=a06e68d8172b15f9a98b37047d31a1a77cc5074d"
        },
        "permalink": "/r/realmadrid/comments/1p241i6/thibaut_courtois_top_3_goalkeepers_in_the_world/"
    },
    {
        "id": "1p2197u",
        "author": "problematic_prodigy",
        "title": "Ig this is the right place",
        "content": "Spent about 7-8 months on loml😍😍",
        "upvotes": 62,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p2197u/ig_this_is_the_right_place/"
    },
    {
        "id": "1p19knb",
        "author": "Vagabund90",
        "title": "Toni Kroos on Vinícius' attitude during games: \"I often told him to stop, it felt like the whole team was affected. I tried many times to calm him down on the pitch, just to keep him focused. He would lose it at moments. I told him over &amp; over: \"Vini, you’re too good. You don’t need all of this\"",
        "content": "The full quote from German legend Kroos on his ex-Real Madrid teammate Vinícius\n\n\"I often told him to stop, because it felt like the whole team was being affected by his behaviour.\"\n\n\"Sometimes it can be a lot for opponents, referees, even rival fans. As a team, we felt that things were turning against us because of that.\"\n\n\"I tried many times to calm him down on the pitch, just to keep him focused, because he would lose it at moments.\"\n\n\"I told him over and over: \"Vinicius, you’re too good. You don’t need all of this\".",
        "upvotes": 1383,
        "comments": 184,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g6dv3VcbIhLtXLP_xD_mrv-iBmMrR_RbA4OD8iifnnk.jpeg?auto=webp&amp;s=2211541f01e7d4e9f3047bcaa46cf24a616ddef7"
        },
        "permalink": "/r/realmadrid/comments/1p19knb/toni_kroos_on_vinícius_attitude_during_games_i/"
    },
    {
        "id": "1p1glyr",
        "author": "Bald-Eagle619",
        "title": "[Seleção Talk] Rodrygo is currently in the worst spell of his career. He’s only scored 2 goals of his last 43 games for Real Madrid &amp; Brazil",
        "content": "",
        "upvotes": 439,
        "comments": 69,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p1glyr/seleção_talk_rodrygo_is_currently_in_the_worst/"
    },
    {
        "id": "1p195ij",
        "author": "No-Independent2522",
        "title": "Madrid fan and a normal day? Impossible",
        "content": "",
        "upvotes": 390,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/yfzmaww0582g1.jpeg?auto=webp&amp;s=e2566aec6767cebc26457c3a5b10ed40a7b535cc"
        },
        "permalink": "/r/realmadrid/comments/1p195ij/madrid_fan_and_a_normal_day_impossible/"
    },
    {
        "id": "1p1hgys",
        "author": "de_lft",
        "title": "Player availability Real Madrid 25/26 + minutes played",
        "content": "Player availability for each matchday and their amount of minutes played. \n\nDark green: Played\n\nGreen: Benched\n\nYellow: Unavailable (whether through suspension, or to rest etc)\n\nOrange: Subbed off due to injury (according to Transfermarkt and FotMob)\n\nRed: Injured\n\nIf you have any question or recommendations please let me know!\n",
        "upvotes": 130,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/u4h4q6ttn92g1.jpeg?auto=webp&amp;s=6e7d064b849366db22ef3c27dfe67b9dfa5aebac"
        },
        "permalink": "/r/realmadrid/comments/1p1hgys/player_availability_real_madrid_2526_minutes/"
    },
    {
        "id": "1p1npkh",
        "author": "RSDFitness",
        "title": "“The Day Marcelo Became a Madridista Without Even Knowing It”",
        "content": "Marcelo flew to Madrid thinking he was just getting a quick tour of the training ground. His agent hadn’t told him anything else.\n\nBut when he arrived, the Real Madrid president was already waiting for him, cameras set up, contract on the table, everything prepared.\n\n“I didn’t understand anything… I just signed.”\n\nThat moment didn’t just bring him to the club.\n\nIt started the journey of one of the greatest full-backs in Real Madrid history.",
        "upvotes": 58,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/uurTGa1jkiGom89h6TbCAi0047ldvE-meVVGKlQVFoc.jpeg?auto=webp&amp;s=e16b6456b7ec2c0c62158e2ae920b834ac634334"
        },
        "permalink": "/r/realmadrid/comments/1p1npkh/the_day_marcelo_became_a_madridista_without_even/"
    },
    {
        "id": "1p1cvot",
        "author": "DamnThatsInsaneLol",
        "title": "Rodrygo was better than Vini in both the matches Brazil played this international break",
        "content": "I hope Xabi uses Rodrygo more often when Vini isn't performing. He did well this international break. Against Senegal he got 1 assist, 3 shots, 25 accurate passes (86%), 5 duels won, rated 8.0 in [fotmob](https://www.fotmob.com/matches/senegal-vs-brazil/1rwp7u#5017003:tab=stats). Against Tunisia he got 34 accurate passes (97%), 5 duels won, 1 tackle won, rated 7.6. \n\nWe have 2 world class LWs in Vini and Rodrygo. No reason to just let one rot in the bench when there's plenty of opportunity to let both play, especially when Vini is inconsistent in his performances these days. Competition breeds improvement. We have to encourage it.\n\nAlso Gonzalo Garcia scored against Romania. He's a talented striker with good positioning &amp; he's a better aerial threat than most of our players. We should be subbing him in at the 70th minute or so if Mbappe isn't performing, or against low blocks, where we could use a conventional #9 to cross to.",
        "upvotes": 105,
        "comments": 176,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/095HSMgPPbDG-DC4n4SN6mj78p5l9lBnvJ8Lcix4-Vs.png?auto=webp&amp;s=d06ab1b4ec9f6dcf94ae7fa6aac1e6d8ace9aa74"
        },
        "permalink": "/r/realmadrid/comments/1p1cvot/rodrygo_was_better_than_vini_in_both_the_matches/"
    },
    {
        "id": "1p13aqu",
        "author": "RAYED_indian",
        "title": "Was bored in class so drew this",
        "content": "",
        "upvotes": 232,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/czf9i8ymp62g1.jpeg?auto=webp&amp;s=c3afd90f169a80bc38452feea05984fdc6426f79"
        },
        "permalink": "/r/realmadrid/comments/1p13aqu/was_bored_in_class_so_drew_this/"
    },
    {
        "id": "1p18t90",
        "author": "Puzzleheaded-Delay60",
        "title": "Our players over the International break",
        "content": "Gonzalo García 90'+90'  = 180' (1 goal)  \n  \nVinicius jr 89’ + 90’ = 179’  \n  \nBrahim  75’ + 75’ = 150’  \n  \n\\+Eder Militão  90’ + 60’ = 150’  \n  \nRodrygo  83’ + 79’ = 123’ (1 assist)  \n  \nJude Bellingham  25’ + 84’= 109’  \n  \nKylian Mbappé  90’= (2 goals 1 assist)  \n  \nArda Güler  88’ + 0’= 88’   \n  \nDavid Alaba  0’ + 0’=0'\n\nCamavinga and huijsen injured",
        "upvotes": 98,
        "comments": 29,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p18t90/our_players_over_the_international_break/"
    },
    {
        "id": "1p1i7bi",
        "author": "scoreboard-app",
        "title": "Match Thread: Arsenal Women FC - Real Madrid Femenino | UEFA Women's Champions League, League Phase, Matchday 4",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1p1i7bi)",
        "upvotes": 28,
        "comments": 14,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p1i7bi/match_thread_arsenal_women_fc_real_madrid/"
    },
    {
        "id": "1p1jgd8",
        "author": "ManuMora98",
        "title": "Arsenal W 0 - [1] Real Madrid W | Caroline Weir 43' volley",
        "content": "",
        "upvotes": 20,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Kaj75yE0CxLWW_PZnxm_kmBbDKLB1HrLenX_9jFBBWM.jpeg?auto=webp&amp;s=fabfeae5777e9b911a9b97d5242456b2b4760838"
        },
        "permalink": "/r/realmadrid/comments/1p1jgd8/arsenal_w_0_1_real_madrid_w_caroline_weir_43/"
    },
    {
        "id": "1p18c19",
        "author": "cyrusmancub",
        "title": "Two weeks out for Mili",
        "content": "",
        "upvotes": 58,
        "comments": 26,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p18c19/two_weeks_out_for_mili/"
    },
    {
        "id": "1p0hs84",
        "author": "Ill-Improvement-8670",
        "title": "If I had multiple lives, I would choose to be a Madridista every. single. time.",
        "content": "gosh do i love this club. we may have been going through a tough period of time recently, but i will never forget how much i love and cherish real madrid through thick and thin. making me look forward to something every single week, something no one or nothing else can do for me. siempre hala madrid, y nada mas🤍",
        "upvotes": 814,
        "comments": 39,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/duza5xowt12g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p0hs84/if_i_had_multiple_lives_i_would_choose_to_be_a/"
    },
    {
        "id": "1p0m9mk",
        "author": "Finn_Madridista",
        "title": "Only a few will get this one 😆 (OC)",
        "content": "",
        "upvotes": 281,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cjg7yy0hn22g1.jpeg?auto=webp&amp;s=f6471272daf3514a7f46edd71c39a7c42045298d"
        },
        "permalink": "/r/realmadrid/comments/1p0m9mk/only_a_few_will_get_this_one_oc/"
    },
    {
        "id": "1p0isvj",
        "author": "Special_Virus851",
        "title": "How 2 Strikers that dont Dominate the Box PRESS",
        "content": "",
        "upvotes": 332,
        "comments": 118,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p0isvj/how_2_strikers_that_dont_dominate_the_box_press/"
    }
]