[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 14,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 73,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1lov4h2",
        "author": "CurlyHairGirl01",
        "title": "netflix completely locked me out of my account",
        "content": "so i was just trying to watch netflix on my laptop then suddenly i got the your not apart of this household message while LITERALLY BEING ON THE WIFI\n\nlogged out and logged in does nothing, disconnected and re connected does nothing. contacted netflix  does nothing. i'm so sick of this netflix i get your losing a bit of money on people sharing accounts but jesus christ there are surely better ways to do this.\n\nEDIT: just spent an hour on tech support only to be told i could either sign out every single device or take this up with a high level of their support team (which would lead me to sit on hold for hours) thanks netflix beautiful customer support ",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lov4h2/netflix_completely_locked_me_out_of_my_account/"
    },
    {
        "id": "1lo1clp",
        "author": "Weird-Personality-31",
        "title": "get rid of netflix games.",
        "content": "I want the option to disable games. I want it gone.\n\nI hate the fact that they use money which we paid to make stupid games. this is not what netflix is about.\n\nIf I want to game I will buy my AAA games.\n\nBe gone with this trash!!",
        "upvotes": 366,
        "comments": 85,
        "media": null,
        "permalink": "/r/netflix/comments/1lo1clp/get_rid_of_netflix_games/"
    },
    {
        "id": "1lotwqq",
        "author": "Historical-Phrase106",
        "title": "Dept Q",
        "content": "I’m absolutely loving Dept Q… \nWhat are your thoughts on this series?  I am rewatching it because I feel like I missed a lot of important parts the first time around… I know Matthew Goode’s character Carl gets a bad rap, but I feel like his cockiness and sarcasm makes the show.. ",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lotwqq/dept_q/"
    },
    {
        "id": "1lohwhc",
        "author": "brianfagioli",
        "title": "NASA teams with Netflix to stream rocket launches and spacewalks this summer",
        "content": "NASA is bringing its live space content to Netflix this summer. From rocket launches to astronaut spacewalks, the streaming platform will now beam space directly into your living room.",
        "upvotes": 26,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lohwhc/nasa_teams_with_netflix_to_stream_rocket_launches/"
    },
    {
        "id": "1lolza3",
        "author": "MaverickWithANeedle",
        "title": "OLD GUARD II DROPS TOMORROW !!!",
        "content": "So excited!!!!! I cannot wait for the sequel to this movie. I wonder what direction they will go with it. Is there even a trailer out for it yet? Idk haven’t actually seen it if so. Just saw it was coming, so I hit the notification button, and have patiently waited a month. Actually longer if you count from when the first movie released. Anyway just thought I’d share my excitement haha ",
        "upvotes": 13,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lolza3/old_guard_ii_drops_tomorrow/"
    },
    {
        "id": "1lou9w3",
        "author": "Electronic-Role4668",
        "title": "Would you buy this?",
        "content": "So I'm in a long distance relationship and I'm usually talking to my SO through the phone, with headphones on, in front of my computer. Sometimes I want to watch something on Netflix while I have her in the background on my phone. But if I were to play Netflix through my computer speakers, she would be able to hear and it would disrupt the call/degrade the audio connection between us.\n\nI'm an engineer and I had the idea of making a Bluetooth device that would make it such that I can connect my headphones to both my phone and my computer at the same time. \n\nThat way, she isn't able to hear the movie in the background and I'm still able to watch my Netflix. Maybe there could even be a feature where the audio from Netflix lowers when she is speaking and returns to normal after she is done speaking (audio dimming)\n\nThis all can sort of be achieved through by buying two sets of ear buds, and wearing one earbud that is connected to the phone and the other connected to the computer, but you don't get the audio dimming feature.\n\nI'm trying to understand if this a decent idea and whether there would be interest. \n\nWhat do y'all think?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lou9w3/would_you_buy_this/"
    },
    {
        "id": "1lofr2h",
        "author": "x_aphrodite_0x",
        "title": "K-drama recommendations? 💕",
        "content": "I've noticed there's lots of k-dramas on netflix and I really wanna start watching some however I just don't know what to watch!! 💕\n\nI've watched true beauty and I really enjoyed it!! However, I'm looking for a more shorter series..?\n\nI don't really mind what I get recommended however I'm not a big fan of severe violence/gore!! Thank youuuu!!!",
        "upvotes": 24,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1lofr2h/kdrama_recommendations/"
    },
    {
        "id": "1low1y6",
        "author": "Fun_Molasses5215",
        "title": "Liam Payne to be given heartbreaking tribute in Netflix series that he filmed before his passing",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1low1y6/liam_payne_to_be_given_heartbreaking_tribute_in/"
    },
    {
        "id": "1los067",
        "author": "EfficiencyPrudent330",
        "title": "Shark 🦈 Whisperer",
        "content": "So profound, emotional, intriguing &amp; educational. I recommend for the whole family and I hope this show gets more people interested in preserving our great animals of the sea ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1los067/shark_whisperer/"
    },
    {
        "id": "1lotofe",
        "author": "Kraviken",
        "title": "Is there still no way to remove that god awfull WWE notification that keeps popping up?",
        "content": "The title says it all. I have no interest in sports. Less interested in fake sports. \n\nYet the freaking  notification keeps popping up. \n\nI have not liked it, I do not have it on my list. \nNothing that should indicate that I should get these annoying and CONSTANT notifications. \n\nIt just never ends... 😡",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lotofe/is_there_still_no_way_to_remove_that_god_awfull/"
    },
    {
        "id": "1low9hx",
        "author": "FormalAdvertising444",
        "title": "Squid Game: What if Gi Hun (Red Team) switched teams with Hyun Ju (Blue Team)",
        "content": "I know r/squidgame  is the best subreddit to discuss squid game but the moderators there keep removing my posts there and never give me explanations why even if I tried to follow their rules. But how will the story go if that happened?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1low9hx/squid_game_what_if_gi_hun_red_team_switched_teams/"
    },
    {
        "id": "1low3ws",
        "author": "isa_bru",
        "title": "I have to confirm I live at my house everytime I want to use netflix",
        "content": "So, I still live with my parents, and my mother pays for this netflix account. Sometimes when I'm bored at my boyfriend's house, I log in to netflix in his computer and watch my favorite series, my boyfriend doesn't even use the account, as he says there is nothing good on netflix. Theres no illegal account sharing, I live at my house. Like, bro, I get it they really needed to save those few bucks they lost from people sharing accounts, but now every time i access netflix, whether at home or not, I have to call my mother to get that stupid confirmation code to confirm I actually live at my house.\nThat's ridiculous, we pay such a high price for a service we supposedly can use at any time, anywhere, but as soon as someone decides to watch netflix away from home they will annoy you into leaving the platform and getting a membership from one of their competitors. ",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1low3ws/i_have_to_confirm_i_live_at_my_house_everytime_i/"
    },
    {
        "id": "1low1oz",
        "author": "TimesandSundayTimes",
        "title": "Meet Squid Game’s standout star, Park Gyu-young",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1low1oz/meet_squid_games_standout_star_park_gyuyoung/"
    },
    {
        "id": "1lovtmg",
        "author": "helplesslyhopinggg",
        "title": "Question for squid game lovers, would you take the salesman up on his game? Where you either get slapped or win $74(usd)?",
        "content": "I’m curious to see if anyone wouldn’t take this offer up. I would in the blink of an eye. I would let someone slap me over and over in exchange for $75. And if you WOULDN’T play this game, what do you do for work? ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lovtmg/question_for_squid_game_lovers_would_you_take_the/"
    },
    {
        "id": "1lovc2h",
        "author": "Holiday_Sale5114",
        "title": "WWE raw ads unskippable based on device?",
        "content": "Since January, I have been watching raw on Netflix on either my PS5 or PC. Until today, both allowed for scrubbing right past ads. \n\nIt should be noted that I only watch the raw \"replay\" and never live. \n\nToday, I was able to scrub past ads on PC, but enable to do so on the Netflix app on my PS5. \n\nHas anyone else encountered this?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lovc2h/wwe_raw_ads_unskippable_based_on_device/"
    },
    {
        "id": "1lohhor",
        "author": "gomazoa93",
        "title": "\"This device is not part of your household\"",
        "content": "My father's Netflix account was primarily set up on our house WiFi. My sister uses his profile at her separate house, I use my profile at the house + work. My mom and Dad use the Netflix almost always at home.\n\nI went to log into work and I was given this: \"this device is not part of your household\". I was able to get a 14 temp code to allow me to use it despite not being on the family wifi. \n\nSince when did Netflix require me to be on the same wifi on which we set it up with? ",
        "upvotes": 8,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1lohhor/this_device_is_not_part_of_your_household/"
    },
    {
        "id": "1lnrhna",
        "author": "antonia71007",
        "title": "a few takes of mine from the poop cruise documentary (this has definitely been talked about before but idc)",
        "content": "first of all, the guy with the glasses and the bachelorette party were so goddamn annoying. i’m pretty sure the guy cared more about his father in law than the cruise. now i get that shitting in a bag isn’t nice, but wanna know what’s worse? walking around ankle deep in other people’s piss and shit, or shitting on top of someone else’s layered shit. they were clearly all so privileged to act like that. and then they were all disgusted when the piss and shit got everywhere. who’s fault was that? yours for not using the damn bags and continuing to use the toilets. \n\nsecondly, who thought it was a good idea to open the bar? that was really stupid, they were obviously gonna go crazy. and then they were surprised when it turned into a poop deck frat party? like what did you expect?? theyve been stuck there for 4 days.\n\nthirdly, i felt bad for the dad. he was recently divorced and just wanted to have a good time with his daughter, and that was what happened, and he felt like he had failed. at least they still go on cruises together \n\nand obviously, i was dying laughing everytime the indian chef came on screen. when he was talking about someone throwing the red bag and it hitting someone else, i was rolling\n\nthat’s it folks. thanks for coming to my ted talk",
        "upvotes": 411,
        "comments": 105,
        "media": null,
        "permalink": "/r/netflix/comments/1lnrhna/a_few_takes_of_mine_from_the_poop_cruise/"
    },
    {
        "id": "1lou2o1",
        "author": "mal4frutal",
        "title": "Why does the Netflix application work so badly on cell phones?",
        "content": "I really don't understand how a multinational like Netflix can have such a bad app.\nI get disconnected all the time when I want to stream from my phone, the episodes don't play automatically, is this the case in all countries?",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lou2o1/why_does_the_netflix_application_work_so_badly_on/"
    },
    {
        "id": "1losxxl",
        "author": "ooTiramisu",
        "title": "The Magic Prank Show",
        "content": "Has anyone watched this?? It’s soo entertaining! So much time &amp; effort put into these pranks. Only 6 episodes. Hoping for a second season ✨\n\nI know a lot of people think these pranks tend to be fake buuuut idk about this one. It’s still very entertaining! ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1losxxl/the_magic_prank_show/"
    },
    {
        "id": "1loo273",
        "author": "Pleasant_Acadia_5800",
        "title": "Monday night RAW",
        "content": "What going on with the livestream?  It ended at 830.  Can't resume episode. \nWatching on Fire Stick. \nThank you \n\nStill not enough characters to post so I guess i keep typing. And typing and typing  and typing \n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1loo273/monday_night_raw/"
    },
    {
        "id": "1lorm66",
        "author": "ScottShawnDeRocks",
        "title": "Squid Game 3",
        "content": "Was this written by AI or stupidity? Both?\nI'm on the 4th episode and so much insanity has gone on. A pregnancy, birth, making the baby a participant is hands down as goofy as the masked people making the rules.\nDubs for most of the cast, but scenes with English speaking actors. \n\nWhat the hell is this slop?",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lorm66/squid_game_3/"
    },
    {
        "id": "1loa2fb",
        "author": "ElvenQueen726",
        "title": "I'm obsessed with the tiger and magpie in Kpop Demon Hunters",
        "content": "The tiger and the magpie were easily my favourite characters in the movie, and if you’re also into art and mythology like I am, here’s a little background on their historical references.\n\nIn traditional Korean art, the white tiger and magpie often appear together in a style called [Jakhodo](https://exhibitions.asianart.org/exhibitions/jakhodo-today/#:~:text=The%20tiger%20and%20magpie%20pairing%20appears%20so%20frequently%20in%20Korean%20art%20that%20it%20comprises%20its%20own%20genre%3A%20jakhodo%2C%20paintings%20depicting%20tigers%20and%20magpies) (*jak* = magpie, *ho* = tiger, *do* = painting). These images were used as talismans to ward off evil spirits.\n\nThe tiger was intentionally given those ridiculous, bulging yellow eyes to make it look dumb. That’s why it’s traditionally nicknamed “idiot tiger” (바보호랑이), and the paintings are often called *“Idiot Tiger and Scolding Magpie.”* So, in its introduction scene when the magpie looked annoyed and judgmental that was on purpose.\n\nThis art style is part of a genre called [Kkachi Horangi](https://en.wikipedia.org/wiki/Minhwa#:~:text=Kkachi%20horangi%20(%EA%B9%8C%EC%B9%98%ED%98%B8%EB%9E%91%EC%9D%B4)%20is,structure%20of%20Joseon%27s%20feudal%20society), and it’s basically satire. The goofy-looking tiger represents authority (intentionally depicted as silly and clumsy like corrupt officials or clueless aristocrats), and the magpie is the voice of the common people, calling them out.\n\nWhen Jinu mentioned he made the hat for the tiger but the bird kept stealing it, that was a reference to a real J[oseon-era Minhwa painting that shows a tiger smoking a pipe and wearing a top hat](https://korelimited.com/blogs/korelimited/the-korean-tiger-a-hallmark-of-korean-identity#:~:text=One%20of%20the%20most%20striking%20features%20of%20art%20portraying%20the%20Korean%20tiger%20is%20the%20eyes%3B%20they%20are%20often%20bulging%20and%20painted%20a%20bright%20yellow.%20This%20is%20a%20recurring%20aspect%20of%20most%2C%20if%20not%20all%20art%20with%20the%20tiger%20as%20its%20subject), while a magpie stands nearby.\n\nThe White Tiger (Baekho in Korean) is also one of the Four Holy Beasts in Sino-Korean mythology, symbolising the West and the element of metal. It’s a powerful, protective figure with deep cultural significance.\n\nI actually did a breakdown of the movie and shared some theories about the tiger in a separate [post](https://www.reddit.com/r/movies/comments/1lmhs7a/kpop_demon_hunters_movie_analysis_theories/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) if anyone’s interested.\n\nhttps://preview.redd.it/8slwt5zaz2af1.png?width=937&amp;format=png&amp;auto=webp&amp;s=813ed2ffe493193302e9f83b02839916a0229094",
        "upvotes": 9,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1loa2fb/im_obsessed_with_the_tiger_and_magpie_in_kpop/"
    },
    {
        "id": "1lolyi5",
        "author": "Mammoth_Result_102",
        "title": "Freud season 2",
        "content": "I just finished the Netflix series Freud and I'm furious at the unsatisfactory ending. It has left a hell lot of room for potential new directions. I was baffled to see there was only 1 season. Personally I give this series a 7.5/10 score because although i did think that Freud's psychological theories weren't prominent enough, overall I am content at what they have put out there. Now I am hoping there will come a season 2. Any news regarding this? It should be a no-brainer, you can literally go into so many directions with a figure like Freud. Or Nietzsche. Or Carl Jung. Sometimes i wish i was a film director, so i could do it myself haha",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lolyi5/freud_season_2/"
    },
    {
        "id": "1logael",
        "author": "As1m0v13",
        "title": "Mindhunter",
        "content": "Great series. The atmosphere, casting, acting are all top class. But Holden is no different to those he investigates. So convinced he's smarter than everyone, always right, no real concern for anyone else emotionally. It's great writing but I can't stand him",
        "upvotes": 5,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1logael/mindhunter/"
    },
    {
        "id": "1loibj8",
        "author": "FredCack",
        "title": "Not working",
        "content": "Hey so Netflix isn't working on any of my devices. Phone, laptop, ps5. It isn't a connection issue cuz my wifi is working fine on all of them. Is anyone else experiencing this issue or am I the only one?\n\n\nEDIT: It's working for me again. I see some of you are still having some problems. I wish I could help but mine just fixed itself after an hour. I hope yours fixes itself too. Have a nice day everyone!",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1loibj8/not_working/"
    },
    {
        "id": "1lok5p1",
        "author": "Ay10outof10t",
        "title": "ended my subscription on my comp but my friend in another country can still use my netflix - weirdest thing ever",
        "content": "As title says. Friend and I used to share Netflix account, I had my debit card connected to monthly fee. Recently we realized none of use it that much so couple of month ago I cancelled the membership. And obviously got logged out. Yesterday my friend was like for fun went to netlix website and was not logged out and he could see the whole feed, watch anything, etc. We were both like wtf how is this possible. \n\nNo, he has not reactivated the membership or put another card details. I'm not being charged neither does he. But the account works in his computer, where he has always been logged in.\n\nAnyone experienced anything like this? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lok5p1/ended_my_subscription_on_my_comp_but_my_friend_in/"
    },
    {
        "id": "1lo3bm1",
        "author": "LauraEats",
        "title": "Netflix Drops Teaser for ‘Troll 2,’ the Biggest Nordic Film Production Yet",
        "content": "",
        "upvotes": 18,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lo3bm1/netflix_drops_teaser_for_troll_2_the_biggest/"
    },
    {
        "id": "1loo7f1",
        "author": "RightGuarantee1092",
        "title": "Fubar S2 New Zealand reference",
        "content": "So I watched the first episode of FUBAR (don’t judge me haha)\n\nAnyway near the beginning some guys show up start shooting and all that.\n\nArnie says “they were New Zealand smugglers from the Auckland Crew” like wtf is the Auckland crew it is a city of almost 2 million people.\n\nAs every New Zealander knows getting referenced in any tv show gets us all exited but this was bizarre and jarring to me.\n\nMy question is, is it some kind of regional thing they did for engagement, if I was watching in Ireland would does he say “Irish smugglers from the Dublin Crew” or something?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1loo7f1/fubar_s2_new_zealand_reference/"
    },
    {
        "id": "1lon6l0",
        "author": "Amose152",
        "title": "Ultrawide Fullscreen Flicker",
        "content": "Hello I recently upgraded to a Samsung Odyssey G9 and ever since whenever I'm in fullscreen mode in Netflix I get a \"flicker\" where the screen moves left and right. This only happens in fullscreen mode and only in Netflix. \n\nThe only \"fix\" I've found from others is disabling \"hardware acceleration\" but this breaks HDR and 4k content.\n\nThe other \"fix\" is not viewing content in full screen mode which isn't really a fix.\n\n[Another Reddit User with same issue](https://www.reddit.com/r/ultrawidemasterrace/comments/1kyiq9g/netflix_screen_glitch/)\n\nIs there any way to open a ticket with Netflix about this?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lon6l0/ultrawide_fullscreen_flicker/"
    },
    {
        "id": "1ln8s7l",
        "author": "Jumpy-Purple7593",
        "title": "What’s a hidden gem on Netflix that you always recommend but no one ever seems to watch?",
        "content": "We all have that one show or movie we loved on Netflix, the one you tell people about constantly, but for some reason, nobody ever seems to give it a shot. Mine is “The OA” ,weird, emotional, and absolutely brilliant. Every time I recommend it, people nod politely and go right back to rewatching The Office for the 6th time. So let’s hear it: what’s your underrated favorite? Could be a foreign film, a forgotten limited series, or a random docuseries that blew your mind. ",
        "upvotes": 1619,
        "comments": 1719,
        "media": null,
        "permalink": "/r/netflix/comments/1ln8s7l/whats_a_hidden_gem_on_netflix_that_you_always/"
    }
]