[
    {
        "id": "1h4x4l7",
        "author": "Effect-Imaginary",
        "title": "Psicologi zona vanchiglia e dintorni? ",
        "content": "Con cui vi siete trovati bene e che magari non prendano un rene per seduta.\n\nGrazie in anticipo. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h4x4l7/psicologi_zona_vanchiglia_e_dintorni/"
    },
    {
        "id": "1h4wcos",
        "author": "Lauri8292",
        "title": "Torino, zona Aurora? (via Cuneo, via Bra, via Carmagnola, ecc...)",
        "content": "Ciao a tutti,  \nvorrei qualche opinione oggettiva sulla zona Aurora della città di Torino (magari di chi ci vive).  \nHo trovato un immobile molto carino, ma le vie citate nel titolo come sono?  \nSono una ragazza, vivo da sola e ogni sera dovrei uscire, perché ho un cane... E la stessa proprietaria ha ribadito più volte che la zona non è delle migliori (anzi, ci è andata giù piuttosto pesante: ha anche detto che aveva affittato la casa a due ragazze - non insieme - che sono rimaste solo un paio di mesi, perché non si sentivano sicure quando uscivano da sole di sera).  \nMi hanno parlato malissimo anche dei giardini Alimonda, che sono proprio lì dietro.  \nChe ne pensate? Può una ragazza andare a vivere lì da sola e fare due passi dopo cena, oppure la zona è così tremenda come dicono? Ero molto entusiasta della casa, però sto iniziando ad avere delle remore...\n\nGrazie in anticipo delle risposte",
        "upvotes": 2,
        "comments": 15,
        "media": null,
        "permalink": "/r/torino/comments/1h4wcos/torino_zona_aurora_via_cuneo_via_bra_via/"
    },
    {
        "id": "1h4p3ch",
        "author": "Pablo65t",
        "title": "Ma che freddo fa stamattina.... ",
        "content": "",
        "upvotes": 8,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1h4p3ch/ma_che_freddo_fa_stamattina/"
    },
    {
        "id": "1h4x0nm",
        "author": "just_a_dude_______",
        "title": "Fare il modello ",
        "content": "Cerco un'opportunità part time/occasionale giusto per mettere due soldi da parte. Come funziona questo mondo? Si contattano le agenzie? Si fanno provini? È facile essere scammati? Conoscete agenzie affidabili? Qualsiasi info è ben accetta, grazie.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1h4x0nm/fare_il_modello/"
    },
    {
        "id": "1h4rzv4",
        "author": "Aggravating_Line_623",
        "title": "Torrone Sebaste",
        "content": "Sapete indicarmi dove si trovano i furgoni del Torrone Sebaste? So di uno in via Garibaldi angolo corso Valdocco, ma per me è piuttosto scomodo. Ce n'era un altro in piazza Carducci angolo via Genova, ma non so se c'è ancora.\n\nAltri?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1h4rzv4/torrone_sebaste/"
    },
    {
        "id": "1h4rhyg",
        "author": "allfearisgone",
        "title": "come posso pagare la tassa UniTo senza un codice fiscale?",
        "content": "come posso pagare la tassa UniTo senza un codice fiscale?\n\nSalve a tutti! Non sono cittadino dell'Unione europea, soprattutto non italiano, ma UniTo mi ha messaggiato chiedendomi di pagare la tassa di 60 euro per la domanda. Tecnicamente non aprono la registrazione fino a febbraio, ma stanno chiedendo la tassa di iscrizione ora, quindi voglio pagarla. online ho visto che posso pagare solo se ho un codice fiscale, ma visto che sono a Torino per due settimane, ho deciso di fissare un appuntamento per ottenere un codice fiscale, ma non sarà fino a pochi giorni dopo la data di scadenza del 6 dicembre. Devo andare di persona e pagare in contanti o con carta di credito? \n\nVoglio farla in fretta e sto facendo del mio meglio. Mi sono anche fidato di amici italiani a Torino. Potrei pagare 60 euro per pagarlo per me? O non funziona così? Mi dispiace di fare così tante domande, sono uno straniero che sta cercando di andare a scuola qui. Grazie mille \n\n\n\n\n*anche, scusa se ho sbagliato scrivere qualcosa. L'italiano non è la mia prima lingua",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1h4rhyg/come_posso_pagare_la_tassa_unito_senza_un_codice/"
    },
    {
        "id": "1h4qabw",
        "author": "No-More-Blue",
        "title": "Negozio a Torino che compra PC usati?",
        "content": "Buongiorno, vorrei vendere il mio vecchio portatile e smartphone (in buone condizioni, o per pezzi di ricambio) e vorrei sapere se c'è un negozio a Torino che potrebbe acquistarli.\nNon mi interessa farci grandissimi soldi, mi basta sapere che non vanno buttati in un campo di rifiuti.\nGrazie a chi risponderà ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h4qabw/negozio_a_torino_che_compra_pc_usati/"
    },
    {
        "id": "1h4p7q9",
        "author": "-Spinal-",
        "title": "Dentista",
        "content": "Devo trovare un dentista, preferibilmente uno che sa anche lavorare con i bambini…\n\nQualcuno mi consiglia ?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1h4p7q9/dentista/"
    },
    {
        "id": "1h4osdz",
        "author": "al_amhara1987",
        "title": "Solitudine &amp; Torino",
        "content": "Almeno due volte a settimana c'è qualcuno che posta un disperato \"sono solo, cercasi compagnia\". Ma è una mia impressione o succede solo su r/Torino? ",
        "upvotes": 0,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1h4osdz/solitudine_torino/"
    },
    {
        "id": "1h4c9k5",
        "author": "Myboringaffairs",
        "title": "Compagnia concerti alternative",
        "content": "Ciao a tutti,sono un ragazzo di 28 anni e mi piacerebbe trovare qualcuno/a con cui andare a vedere concerti di musica alternative,posti come Spazio 211,Offtopic...\nPurtroppo non ho molte persone con cui condividere questa passione, scrivetemi se vi va,anche solo per fare due chiacchiere sulla scena musicale.\n",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1h4c9k5/compagnia_concerti_alternative/"
    },
    {
        "id": "1h4gdwu",
        "author": "paperellaghei",
        "title": "Amicizie Canavese",
        "content": "Ciao a tutti, siccome noto spesso che molti scrivono per organizzare/incontrare gente ci provo anche io:\n\nSono ormai M29, negli anni ho sempre frequentato istituti (università e no) a Torino ma dopo un periodo di lavoro a Milano e, nel contempo, di studi per la magistrale a Torino mi sono spostato a lavorare a Cirié. \n\nInutile dire che nel periodo di covid+università+lavoro mi sono mangiato il gap 24-28 anni e ormai tra vecchie amicizie che non trovo più perché o sono all'estero o già figliati o fidanzati e accasati, non ho molto da fare se non aiutare i miei nel weekend.\nNegli anni ho sempre \"corso\" per sistemarmi lavorativamente parlando ma a volte mi fermo e mi accorgo che o non c'è nessuno o quei 2-3 rimasti sono vecchi amici fuori sede che fanno fatica ad arrivare a fine mese e a cui a volte gli offro una birra/pizza pure di far qualcosa.\n\nNon ho molti hobby essendo che ho sempre cercato di tener impegnato il tempo libero, attualmente sto cercando di prendere l'abilitazione per diventare consulente finanziario autonomo ma in genere mi piacciono eventi techno, poker, politica, finanza, poker, il buon cibo e vino, escursionismo, pub e snowboard (anche se sono alle prime armi).\n\nSiccome non conosco praticamente nessuno della zona, se anche tu sei del canavese (Venaria, Caselle, Borgaro,  Cirié, Leinì, Rivarolo) scrivimi 😄.",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1h4gdwu/amicizie_canavese/"
    },
    {
        "id": "1h4gm3n",
        "author": "mainapizza",
        "title": "Hiking raggiungibili con i mezzi? ",
        "content": "Ciao :)\nIl prossimo weekend non ho la macchina ma vorrei provare lo stesso ad organizzare un piccolo giro di uno o due giorni, voi conoscete posti, anche tranquilli, raggiungibili con i mezzi?\nGrazie ",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1h4gm3n/hiking_raggiungibili_con_i_mezzi/"
    },
    {
        "id": "1h4btso",
        "author": "parkerodinsons",
        "title": "Where do i recycle monster cans",
        "content": "i have a small collection of like 15 monster cans and i dont know what to do with them, they are not accepted by recopet",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1h4btso/where_do_i_recycle_monster_cans/"
    },
    {
        "id": "1h48kvw",
        "author": "_gitza",
        "title": "Piste di pattinaggio su ghiaccio",
        "content": "Salve, come da titolo. Sapreste consigliarmi una pista di pattinaggio su ghiaccio a Torino per studenti fuorisede sprovvisti di auto? Non potrei spostarmi fuori città. Grazie mille!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h48kvw/piste_di_pattinaggio_su_ghiaccio/"
    },
    {
        "id": "1h3y8tb",
        "author": "Hopeful_Crew_6787",
        "title": "Dove farsi fare un abito blu classico?",
        "content": "Buongiorno a tutti,\n\nSono interessato a farmi fare un abito blu classico e vorrei sapere qui in città che opzioni ci sono per il su misura. \nVoi che esperienze avete avuto e quanto avete speso? \nChe consigli e indicazioni dareste?",
        "upvotes": 5,
        "comments": 18,
        "media": null,
        "permalink": "/r/torino/comments/1h3y8tb/dove_farsi_fare_un_abito_blu_classico/"
    },
    {
        "id": "1h3zq9j",
        "author": "jenefaisquebadiner",
        "title": "Enoteche imperdibili",
        "content": "Ciao a tutti!   \nSono discretamente appassionata di vini, ma mi rendo conto di acquistarli sempre negli stessi posti.  \nAvete qualche suggerimento di belle enoteche in città, con una buona selezione (soprattutto di rossi piemontesi) e magari personale esperto con cui fare due chiacchiere?   \nBonus se specializzati in Barbaresco e in centro! ",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1h3zq9j/enoteche_imperdibili/"
    },
    {
        "id": "1h4bcy2",
        "author": "Top-Text-7727",
        "title": "Miglior azienda per internet",
        "content": "Salve amici. Riecco qui il terrone trasferito a Torino per lavoro.\nHo contattato già un mese fa Linkem per la connessione a casa, perché mi sembrava ideale mettere il device fuori al balcone, senza rompere il cazzo con fibra, cavi che non vanno et simili.\nTuttavia non sono stato piu contattato dai tecnici per l'installazione del device, quindi mi sono rotto il cazzo e ho rescisso il contratto.\nDetto ciò, quale è il vostro provider e secondo voi quale è il migliore in città?io sto in Aurora vicino il museo Lavazza. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1h4bcy2/miglior_azienda_per_internet/"
    },
    {
        "id": "1h42bre",
        "author": "ZayaBt-",
        "title": "Best christmas vibe town/city",
        "content": "Ciao a tutti!\n\nWhat are some towns in Piedmont with the best Christmas atmosphere that are reachable by public transportation? I don't care much about the Christmas markets etc, just some good decorations and things to see around will do. (just for a day trip)\n\nAny recommendations? Thanks in advance!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1h42bre/best_christmas_vibe_towncity/"
    },
    {
        "id": "1h3yhqt",
        "author": "Professional-Fly2853",
        "title": "River Po Kayaking?",
        "content": "Ciao tutti,\n\nI wonder if anyone knows about the rules for the river Po specifically along Parco Valentino… if I have an inflatable kayak I travel with, can I kayak around the river Po in the Parco Valentino area?\n\nThank you in advance!",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h3yhqt/river_po_kayaking/"
    },
    {
        "id": "1h3zojh",
        "author": "-xGarnet99x-",
        "title": "Posti belli alta quota?",
        "content": "Ciao, oggi è una bella giornata e mi piacerebbe fare una passeggiata in qualche paesino di montagna/collina alta.\nStavo pensando al Forte di Bard ma ci sono andato mille volte.\nSapere consigliarmi qualche posto?\nMagari dove potersi fermare anche a cena mangiando qualcosa di tipico?\nGrazie ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h3zojh/posti_belli_alta_quota/"
    },
    {
        "id": "1h47nys",
        "author": "Standard_Meal_6973",
        "title": "Amicizie",
        "content": "Cerco amicizie a Torino mi rompo le palle, ecco le mie caratteristiche ho 20 anni, amo la formula 1, sono un ragazzo, amo follemente il sesso ahahahahah, amo i tatuaggi e sono tatuato, amo la politica e la storia e amo tutto ciò che è divertente, farei di tutto perché la vita è una e monotona",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1h47nys/amicizie/"
    },
    {
        "id": "1h3o8ow",
        "author": "lucadepa_",
        "title": "svago a torino",
        "content": "ragazzi sbaglio o torino è diventata un mortorio? il sabato sera non so più cosa fare se non andare nelle solite 2 discoteche per la mia fascia d’età (18 anni), ogni tanto penso a ciò che c’era nella mia zona fino al 2017 (nizza millefonti) si chiamava zona verde se non erro e c’era molto movimento fra ragazzi e famiglie, visto che era aperta fino a tarda serata, era aperta tutta l’estate, ora sia di inverno che d’estate questa città è diventata di una tristezza assurda a parer mio, dalle 10 di sera cala il silenzio più assoluto.\nvoi conoscete qualche locale interessante? oppure siete della mia stessa idea😂",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1h3o8ow/svago_a_torino/"
    },
    {
        "id": "1h3ld59",
        "author": "AdThese6575",
        "title": "Nuove amicizie",
        "content": "Ciao a tutti, sono un ragazzo di 28 anni.. sono un informatico e son qui da circa 3 anni. Negli ultimi mesi 3 amici con cui avevo legato molto hanno lasciato la cittá e sto cercando persone con cui passare del tempo e condividere interessi. C’è anche la mia ragazza qui. Andavo molto spesso al Bunker, alle serate Outcast.. in generale mi piace molto andare a serata di musica techno o elettronica, cosa che ora faccio con molta meno frequenza dato che non ho più una compagnia di amici. Ascolto molto hip hop/ rap americano. Cerco qualcuno con interessi simili per costruire qualcosa, i miei colleghi purtroppo sono fin troppo “normie” per la mia indole, che qualcuno mi salvi 😊",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1h3ld59/nuove_amicizie/"
    },
    {
        "id": "1h3hhrg",
        "author": "Sad-Statistician3806",
        "title": "Spazi dove giocare",
        "content": "Ciao ragazzi, qualcuno conosce un qualche posto dove poter giocare di ruolo o a giochi da tavolo? Magari uno spazio gratuito, che non implica una consumazione minima.",
        "upvotes": 7,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1h3hhrg/spazi_dove_giocare/"
    },
    {
        "id": "1h3gj31",
        "author": "Extra-Window7021",
        "title": "amicizie a torino ",
        "content": "mi sono trasferita in realtà da tre/quattro anni qui ma non ho mai avuto l’opportunità di fare amicizia con persone con interessi simili ai miei.\n\nora arriva la descrizione super top e per nulla breve:\nho 19 anni, sono una ragazza e mi piace girare, andare al cinema, andare per i bar. non ho mai provato ad andare in discoteca però esiste una prima volta per tutto! \nnon ho pretese, vorrei solo gente con cui passare tempo nella mia fin troppo monotona vita.",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1h3gj31/amicizie_a_torino/"
    },
    {
        "id": "1h3mezc",
        "author": "_L_-",
        "title": "Rievocazioni storiche in questo stile ",
        "content": "A Torino e dintorni fanno rievocazioni in stile vittoriano o qualcosa di simile?\n\nCome si partecipa a queste cose? \n",
        "upvotes": 2,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xlc8b5act34e1.jpeg?auto=webp&amp;s=7dabb7f9ca4b95af383882fe8f6e681caf6aa078"
        },
        "permalink": "/r/torino/comments/1h3mezc/rievocazioni_storiche_in_questo_stile/"
    },
    {
        "id": "1h39ofc",
        "author": "LuxJupiterian",
        "title": "Posti fighi dove fare aperitivo ",
        "content": "Ciao ragazzi, conoscete dei posti fighi anche non mainstream in quel di Torino?\nGrazie millee",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1h39ofc/posti_fighi_dove_fare_aperitivo/"
    },
    {
        "id": "1h3fxt0",
        "author": "ConcertFamiliar2790",
        "title": "Yin yoga a Torino ",
        "content": "Ciao amici, sapete consigliare un bel centro che fa corsi di Yin yoga a Torino.\n\nCerco magari un posto che organizza anche meditazioni, attività fuori, ritiri, etc, non vera e proprio palestra. \n\nGrazie in anticipo!\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1h3fxt0/yin_yoga_a_torino/"
    },
    {
        "id": "1h2tj1k",
        "author": "Reiquen",
        "title": "Ho creato un sito per giocare a \"Trova i Toret\"! 🚰",
        "content": "Ciao a tutti! Dopo aver letto il post di u/signordado sulla sfida personale di bere da tutti i Toret di Torino ho deciso di giocare anch'io.\n\nNon trovando soluzioni pratiche per tracciare i progressi, ho sviluppato un sito molto molto basic che fa esattamente questo: permette di spuntare i Toret visitati e tenere traccia delle tue tappe.\n\nSto pensando di aggiungere:\n\n\\-Una modalità di gruppo, per invitare amici, vedere chi ha trovato quali Turet e magari lasciare commenti o foto sulle fontanelle visitate.\n\n\\-Link a I Love Toret, per scoprire la storia di questi simboli torinesi, adottarli e fare una donazione per sostenerli.\n\nChe ne pensate? Scrivetmi se lo proverete  e per suggerimenti su come  migliorarlo  \nEcco il link: [Vitz.it/torino/toret](http://Vitz.it/torino/toret)  \nbuon Tour-et!",
        "upvotes": 29,
        "comments": 16,
        "media": null,
        "permalink": "/r/torino/comments/1h2tj1k/ho_creato_un_sito_per_giocare_a_trova_i_toret/"
    },
    {
        "id": "1h39n9n",
        "author": "LuxJupiterian",
        "title": "Parcheggi gratis il più vicino possibile verso San Salvario",
        "content": "Ciao ragazzi, conoscete posti dove parcheggiare gratuitamente il più vicino possibile verso San Salvario?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1h39n9n/parcheggi_gratis_il_più_vicino_possibile_verso/"
    }
]