[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 39,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1q31rfv",
        "author": "Aware-Platypus-2559",
        "title": "What is a 10/10 series on Netflix that actually has a proper, satisfying ending?",
        "content": "I’m tired of getting burned. I invest 10+ hours into a show, fall in love with the characters, and then Google it only to find out it was cancelled on a cliffhanger in Season 2.\n\nI want to start something knowing the story wraps up intentionally, not because the plug was pulled.\n\nAside from the obvious hitters like *Dark*, *The Queen's Gambit*, or *Breaking Bad*, what are some gems (hidden or popular) that actually stick the landing?\n\nGenre doesn't matter to me as long as the story is complete. I need something binge-worthy for the weekend that won't leave me angry at the end.\n\n",
        "upvotes": 719,
        "comments": 898,
        "media": null,
        "permalink": "/r/netflix/comments/1q31rfv/what_is_a_1010_series_on_netflix_that_actually/"
    },
    {
        "id": "1q2yhkg",
        "author": "caroulos123",
        "title": "Netflix doesn’t hit the same anymore",
        "content": "Lately it really feels like Netflix used to have better shows than it does now. A few years back, things like Stranger Things, Narcos, and Mindhunter felt bigger, more original, and easier to get hooked on. I actually looked forward to new seasons dropping.\n\nNow I open Netflix and spend way too long scrolling, adding things to my list but never pressing play. A lot of new shows feel rushed or forgettable, even if the idea sounds good on paper. I still watch Netflix, but the excitement isn’t the same.\n\nAm I the only one who feels this way, or do you think the quality really changed? Are there any newer shows that gave you that old Netflix feeling again?",
        "upvotes": 507,
        "comments": 159,
        "media": null,
        "permalink": "/r/netflix/comments/1q2yhkg/netflix_doesnt_hit_the_same_anymore/"
    },
    {
        "id": "1q2y3of",
        "author": "peoplemagazine",
        "title": "Stranger Things Finale: What Happened to Erica, Murray and Mr. Clarke? The Duffer Brothers Weigh In",
        "content": "",
        "upvotes": 251,
        "comments": 126,
        "media": null,
        "permalink": "/r/netflix/comments/1q2y3of/stranger_things_finale_what_happened_to_erica/"
    },
    {
        "id": "1q39ryk",
        "author": "Silly-Dot-2322",
        "title": "Highly recommend \"The following\"",
        "content": "A friend of mine, quite a while ago, recommended this series to me. I watched and was hooked! \n\nI just logged on to my Netflix, and it's on! \n\nI highly recommend. ",
        "upvotes": 39,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1q39ryk/highly_recommend_the_following/"
    },
    {
        "id": "1q2yc05",
        "author": "Dapper_Telephone_117",
        "title": "What the hell is Emily in Paris?",
        "content": "I’m just here to hate for a second and just see what everyone thinks. I’ve never really watched Emily in Paris, so I do not have in depth analysis nor do I know the correct terms for screenwriting or cinematography techniques. Anyways, my family has been watching the latest season during the holidays so I’ve seen a few clips here and there and just sat down to watch a full episode with my mom \n\nThe first thing I noticed is that this show is like in ultra HD. Everything is so detailed and at the same time layered in a thick coat of matte that it literally hurts my eyes. The world is just too spotless and it’s uncanny to watch. \n\nWhy does the world seem to exclusively revolve around Emily? Almost every scene is structured in a way that seems like the other characters only react when Emily walks in or does something. It gave me the feeling of playing a video game and getting a dialogue prompt. Also, multiple times in the episode Emily would effortlessly just resolve issues or make the correct decision and everything just works out for her (minus the main drama with her best friend sleeping with the guy I assume is her ex). Is no one else capable of having a good idea or an original thought? \n\nThe writing and staging is just horrendous. Every scene is like 30 seconds long because the characters just say what needs to be said in order to continue dragging the decaying corpse the show calls a plot. In the last scene of this episode Emily is firing this intern or whatever (because her boss can’t?) and this girl rebuttals by telling her that her best friend and possibly ex are sleeping together and that everyone knows except her. Meanwhile Julian is unnaturally standing in the background just looking at this conversation unfold. He only reacts once Emily looks at him and his response is literally to ignore the betrayal on Emily’s face and to escort the intern out of the building because Mindy is queued in for the ‘big reveal’. Mindy literally just walks in while Emily is visibly distraught and just starts talking… 😒😒😒\n\nWhy are these characters so one dimensional? Why is the dialogue so stale? Why does Emily feel so unnatural? How on earth did this show get popular enough to warrant a (fifth?) season? \n\nI obviously know that I am not the target demographic for this kind of show, but common? I would expect everyone to hold their favorite genres to a high standard. This show just seems so poorly done and I hate that  this is the state our shows are in, baffling. ",
        "upvotes": 97,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1q2yc05/what_the_hell_is_emily_in_paris/"
    },
    {
        "id": "1q3ftzz",
        "author": "niiyah_babyy",
        "title": "Favorite Harlon Coben limited series ??",
        "content": "I watched Stay close , Fool me once &amp; Run Away! I liked Stay Close and Run Away the best so far Fool me once was okay . Which ones did you watch and which one did you enjoy the most ?",
        "upvotes": 10,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1q3ftzz/favorite_harlon_coben_limited_series/"
    },
    {
        "id": "1q3k3z1",
        "author": "mustytomato",
        "title": "Is there any way to filter/block all content that doesn’t have English as the original language?",
        "content": "I’m a knitter and often listen as much as I watch, which means that shows in other languages are a no-go most of the time. Sometimes I’ll find a new show that looks interesting just to start watching it and find out that it’s in German or something. \n\nIs there any way to just block or filter out shows that aren’t in English? I positively hate dubbing, so please don’t suggest that. ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q3k3z1/is_there_any_way_to_filterblock_all_content_that/"
    },
    {
        "id": "1q34x93",
        "author": "Thissuxxors",
        "title": "Just watched 2 bangers on Netflix, any others on there?",
        "content": "The first is Abigail, I saw it being advertised and ranked #2 in the country I'm in, and being a fan of horror I decided to watch it. I was pleasantily surprised at what a clever and fun horror movie it was, definitely recommended if you like horror films.\n\nToday I was going through my List and saw that I had added - It's What's Inside and so I decided to watch it. It's the kind of movie where it tempts you to switch it off in the first 20 mins, but oh man, am I glad I didn't. It's an absolutely brilliant movie. Yeah, it has a few flaws, but at the end of it, I was thinking what the hell did I just watch, but in a good way!\n\nCan't recommend this enough. You will be pausing quite a bit because it will twist and turn your brain!\n\nAny other good reccomendations?",
        "upvotes": 19,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1q34x93/just_watched_2_bangers_on_netflix_any_others_on/"
    },
    {
        "id": "1q2eo56",
        "author": "zekevich",
        "title": "Netflix's \"second screen\" writing ideology doesn't give me hope for Netflix's future releases.",
        "content": "Them basically writing shows to \"accommodate\" for the idea that people are probably going to be scrolling on their phones while watching them, so they simplify and dumb down their shows so people can still understand what's going on while paying attention to something else. [x](https://medium.com/enrique-dans/second-screen-viewing-netflix-succumbs-to-the-dictatorship-of-the-smartphone-6b639c829fec)\n\nand quite frankly, I think this is a horrible idea. one that's going to do more harm than good. we should ***not*** be dumbing down media and art as a whole *just because* some people *might* not happen to be paying full attention.\n\nand Stranger Things 5 was a clear example of this. a good majority of the dialogue was overexplainy, exposition dumpy, unnatural and held your hand and basically treated you like you were stupid.\n\nand if THIS is any indicator of how netflix is about to write their shows in 2026 and onward? respectfully count me out, because..... 😬",
        "upvotes": 878,
        "comments": 71,
        "media": null,
        "permalink": "/r/netflix/comments/1q2eo56/netflixs_second_screen_writing_ideology_doesnt/"
    },
    {
        "id": "1q36nqz",
        "author": "zapns",
        "title": "When hiding items from your watch history, is the account owner notified?",
        "content": "Title. I want to watch Stranger Things and my parents are very anti-supernatural things so they would not be fond of me watching it. They check my continue watching all the time and I am unsure if they check the viewing history. ",
        "upvotes": 9,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1q36nqz/when_hiding_items_from_your_watch_history_is_the/"
    },
    {
        "id": "1q3ik9a",
        "author": "baileeboo01",
        "title": "Missing: Dead or Alive? season 1",
        "content": "I absolutely would not want either one of these two goobers on my own/my family’s missing persons case. Both of these woman seem to share the same brain cell…. On episode one with Lorraine missing, I feel that they were way too concerned with trying to pin the son for murder instead of actually trying to find Lorraine. Now don’t get me wrong…. I was convinced that he did it, but we were wrong! So maybe if they would have actually put some effort into trying to find Lorraine instead of solve a murder that never occurred they would have found her a lot sooner. \n\nThey had a search warrant on the house, they knew the carpet was ripped up and yet they decided to leave it there, then they had the audacity to start freaking out because the carpet was gone…. Like DUH if she was murdered (which we now know she wasn’t) of course the murderer would remove the carpet so why didn’t they take it in as evidence??? Then they were talking about “yeah we haven’t had time to call the bank yet” THAT WAS THE ANSWER THE WHOLE TIME!!!!!! And then when he started moving everything to the storage unit they said “we have the storage unit on lock down” but then ten minutes later they are talking about how he’s been taking stuff in and out of the storage unit…. Uhh I thought it was on lockdown ??? And when they go to his truck in the junk yard and they see blood all over the air mattress they said “should we call the forensic lab down here?” Well no shit Sherlock. Like holy crap!!! And then every time they went to the sons house that one police officer keep saying she was scared of him more than once and waited for backup even when there was more than one police officer ALREADY there….. like look, I am a women I know how scary it can be to be around men when you have no idea what they are going to do, but you’re a police officer. If you’re gonna be terrified of doing your job then maybe you shouldn’t be a police officer. \n\nThis show mad me so mad watching these two woman. And god forbid if I ever go missing and they end up on the case then you might as well just assume I’m dead because I’m surprised they have ever even solved one case. \n\nMaybe I’m being harsh but this is just my point of view on this, what do you guys think?? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q3ik9a/missing_dead_or_alive_season_1/"
    },
    {
        "id": "1q3dx8p",
        "author": "StrangeAsAngels66",
        "title": "Is anyone else having streaming issues?",
        "content": "I have been trying to watch Netflix and keep getting code 10035.  It is not my internet which is very fast.  Just watched something on another streaming app (which apparently I'm not supposed to mention by name or my post won't get published) with no issues so it is Netflix.",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1q3dx8p/is_anyone_else_having_streaming_issues/"
    },
    {
        "id": "1q3k006",
        "author": "Adorable_Pension_521",
        "title": "Series like Harlan coben with multiple plot twists and suburban plot!",
        "content": "Addicted to his shows pls suggest more but from different director !! Looking for binge worthy shows today !! Pls help me because I'm so bored and classes is about to start tomorrow ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q3k006/series_like_harlan_coben_with_multiple_plot/"
    },
    {
        "id": "1q3cfxr",
        "author": "Butterfly__333",
        "title": "Netflix pauses movies after a few seconds; unable to unpause them.",
        "content": "I don't watch netflix much on my laptop, and every time I try to watch, it plays about 10-15 seconds of a movie or show (Just enough to get through opening credits) then the audio cuts out, then a second later the visuals just get stuck on whatever frame. It appears to be paused, but regardless of anything I do I can't unpause it. I've had this issue for almost a year. I have a chromebook and I watch netflix in-browser. My netflix account is logged into on other devices in the home but I don't try to use it when someone else is watching netflix so that's not the issue. I just wanna be able to watch stuff again!! Is anyone else having this issue or knows what to do about it?",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1q3cfxr/netflix_pauses_movies_after_a_few_seconds_unable/"
    },
    {
        "id": "1q2squl",
        "author": "Sylverpepper",
        "title": "Stranger Things is quite something !",
        "content": "I just rewatched ALL of Stranger Things to be ready for season 5, and honestly, I loved it all over again. This series is really special and so amazing! I understand why it's so successful. I think it's meant to be watched back-to-back without waiting two years between seasons. It's not the same! And during season 5, I really felt something. It's off to a great start!\n\nIn any case, I've rarely seen people satisfied with the ending of a popular masterpiece. Whether it's a series or an anime, people are always disappointed with the ending. It's not easy to conclude a long adventure and satisfy everyone.",
        "upvotes": 29,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1q2squl/stranger_things_is_quite_something/"
    },
    {
        "id": "1q3codj",
        "author": "greennurse0128",
        "title": "Found",
        "content": "Im surprised I didn't find any topics on this. Has a late night CW or old USA feel. But better. Good story lines. Each character is more damaged than the next. End of every episode im saying *this is so f&amp;cked up*. Good show. \n\nAnyone else watching? Currently finishing up season one.",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1q3codj/found/"
    },
    {
        "id": "1q316ib",
        "author": "WestRelationship415",
        "title": "My wishes for Netflix",
        "content": "As a long time US based Netflix user there are a few wishes for the platform.  \n1/ Don’t recommend a show I have already watched and rated \n2/ clear indication in the description of base language\n3/ continue with the ‘Hot, New, Coming soon’ section and documentaries.  \n\n\nThat’s it -Simple, right?",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q316ib/my_wishes_for_netflix/"
    },
    {
        "id": "1q3gko1",
        "author": "Pollo3652",
        "title": "Netflix silencing background noises???",
        "content": "Im on the android version and have experienced this a couple times.\nIm watching something and when there is just background noise, the audio artificially gets silent, then when there is a louder noise it continues normally.\nThis only happens on my phone\nAny clue on how to solve this??",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q3gko1/netflix_silencing_background_noises/"
    },
    {
        "id": "1q3b61i",
        "author": "SkyGroundbreaking910",
        "title": "Run Away question—NO SPOILERS PLEASE!",
        "content": "In the first episode, we see Simon and Ingrid’s daughter Anya (the one still living at home who is in school) in a wheelchair in public places, but walking at home. I’ve started ep. 2 and she’s back in the wheelchair at the hospital to visit her mom. I’m not crazy! I took screenshots and even backed up to the walking scene to make sure it’s the same character. Do they address this?? Sorry if I’m just being impatient but it’s really distracting me from the already busy plot lines. ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1q3b61i/run_away_questionno_spoilers_please/"
    },
    {
        "id": "1q36pqa",
        "author": "Time-Cash-4637",
        "title": "American Man-hunt series",
        "content": "I’ve just stumbled across the American Man-hunt series on Netflix and I thought that they were absolutely fantastic.\n\nOsama bin laden was probably the pick out of the bunch with the Boston Bombers a close second. I feel like you got more exposure into the past and there day to day lives leading up to the events, I’ve learnt more in these doco-series on Netflix then watching national geographic or the discovery channel. \n\nAre they going to make more on different subjects in America or is the three on Netflix now it?, it’d be shame if they just stopped it.",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q36pqa/american_manhunt_series/"
    },
    {
        "id": "1q35qd8",
        "author": "Specialist-Ad-3133",
        "title": "Stuck on the loading screen",
        "content": "Hello everyone,\n\nIm watching netflix on my Sharp tv\n\nI use browser called BrowseHere where i go to Netflix \n\nI can log in and and choose the shows but my screen stays on loading while i can hear the sound of show in the background but it just stays loading \n\nDidnt have this problem three days ago\n\nThe situtation…\nhttps://imgur.com/a/9qwhq1f\n\nCan anyone help please?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q35qd8/stuck_on_the_loading_screen/"
    },
    {
        "id": "1q2xdl7",
        "author": "Quick_Dot_9660",
        "title": "Harlan Coben - British Adaptations?",
        "content": "So I've recently learnt Harlan Coben is American and a bulk (maybe all) of his books are set in the US but there's a large portion of his adaptations on netflix are set in the UK in kind of non descript vaguely liverpool/manchester suburbs. \n\nDoes anyone know why? It's not usually something that happens with adaptations I was wondering if anyone had any production scoops.",
        "upvotes": 6,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1q2xdl7/harlan_coben_british_adaptations/"
    },
    {
        "id": "1q36x99",
        "author": "ashuash0123",
        "title": "Run away",
        "content": "What was the expression of Simon Greene at the end. It was like he realised something but not sure why he was nodding at the end. \nNice series though. Every second of the series was interesting ",
        "upvotes": 1,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1q36x99/run_away/"
    },
    {
        "id": "1q3b4rp",
        "author": "Equivalent_Friend_12",
        "title": "Fuja by Harlan Coben",
        "content": "Impressão minha ou realmente houve uma preocupação com a escalação de um elenco bem diversificado e fora dos padrões de beleza e idade normalmente utilizados em produções dessa magnitude?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q3b4rp/fuja_by_harlan_coben/"
    },
    {
        "id": "1q3g1u2",
        "author": "coliepotter",
        "title": "Sean Combs- The Reckoning Discussion",
        "content": "Hey everyone, I just finished the diddy documentary and wow. He is so much more disgusting and vile than I already thought after watching that. I’m curious to see what everyone thought and picked up on. There are definitely a lot of questions that still need to be answered and things I’m curious about, but I’ll start with this because I feel like it was really skimmed over and it seemed so much more important to me? Lil Rod mentioned they were recording and a guy named “G” went into the bathroom with diddy and Justin, and was shot twice. My question is, why is this not being talked about more? Lil Rod literally said he pretty much has disappeared. Is there no current investigation on this? It was skimmed over in the documentary which surprised me as I feel like this is huge and can pin diddy to a murder. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1q3g1u2/sean_combs_the_reckoning_discussion/"
    },
    {
        "id": "1q3axgq",
        "author": "Emotional-Chipmunk12",
        "title": "What are some Netflix movies that you wish got a theatrical release?",
        "content": "Here are a few of my picks:\n\nFatherhood (2021) (This one was originally supposed to be in theaters, but because of COVID, it was sold to Netflix.)\n\nThey Cloned Tyrone (2023)\n\nLift (2024)\n\nMurder Mystery 2 (2023)\n\nPee-Wee's Big Holiday (2016)\n\nThe Guilty (2021)\n\nInto the Tall Grass (2019)\n\nThe Christmas Chronicles 1 + 2",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1q3axgq/what_are_some_netflix_movies_that_you_wish_got_a/"
    },
    {
        "id": "1q2m94q",
        "author": "Known_Broccoli_4274",
        "title": "Give netflix some credit",
        "content": "People moan a lot about Netflix, saying it's poor content but I have to say, I don't agree. I get we all like different things and genres but Netflix has some incredible originals they've made: virgin river, Ransom Canyon, Leanne, you. I think it's still worth money and getting the ad free for a few extra pounds definitely enhances user experience\nThe only negative I have is that they've got rid of friends &amp; the big bang theory...not many own a dvd player anymore and Netflix was the only platform that showed these series without having to purchase each individual season etc. Just my opinion 🩷",
        "upvotes": 32,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1q2m94q/give_netflix_some_credit/"
    },
    {
        "id": "1q2clxr",
        "author": "Vegetable_Engine_463",
        "title": "Anyone watched Members Only: Palm Beach? Is this really how wealthy Americans look and behave?",
        "content": "I watched Members Only: Palm Beach and the whole time I had a very odd feeling, like something was off. Visually everything checks out: luxury cars, massive mansions, yachts, ocean views, etc.\n\nAt the same time, the people in the show feel strange. The outfits look cringe and overloaded, kinda Chinese market-style. The overall vibe comes off as kitschy. In Europe this aesthetic disappeared a long time ago. In Italy if someone dressed like this showed up at a high-end event here, the reaction would be… complicated. Real wealth here usually shows through restraint, quality, and taste. Loud luxury feels outdated by decades.\n\nBecause of that, the show feels staged. Expensive scenery, dramatic behavior, exaggerated styling.\n\nAmericans, is this an accurate reflection of how wealthy elites in the US actually look and behave, especially in places like Palm Beach? Or is this more of a dressed-up TV version made for drama?",
        "upvotes": 100,
        "comments": 111,
        "media": null,
        "permalink": "/r/netflix/comments/1q2clxr/anyone_watched_members_only_palm_beach_is_this/"
    }
]