[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 487,
        "comments": 257,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1h19gp5",
        "author": "TheLaraSuChronicles",
        "title": "Netflix kids' movie, Spellbound slammed by parents for 'normalizing' divorce and 'pushing for family separation'",
        "content": "",
        "upvotes": 233,
        "comments": 104,
        "media": null,
        "permalink": "/r/netflix/comments/1h19gp5/netflix_kids_movie_spellbound_slammed_by_parents/"
    },
    {
        "id": "1h1p1d2",
        "author": "JinJaDubstep",
        "title": "Best ACTUALLY SCARY movies on Netflix currently?",
        "content": "What are some of the best actually scary movies on Netflix currently? Not a fan of slow burn movies or creepy movies. looking for movies with a lot of \"scary\" parts (ie - conjuring 2, smile 2, evil dead rise)",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h1p1d2/best_actually_scary_movies_on_netflix_currently/"
    },
    {
        "id": "1h1m7ro",
        "author": "beeemmvee",
        "title": "Buy Now!",
        "content": "Wow.\n\nI knew some of this but had no idea how far it actually went. The slime of humanity is truly revealed. \n\nThis is a must see for every human consumer on the planet. \n\n  \n",
        "upvotes": 12,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h1m7ro/buy_now/"
    },
    {
        "id": "1h15qyp",
        "author": "healthyF0X",
        "title": "The docuseries My Wife, My Abuser highlights the enormous challenges faced by male victims of domestic abuse",
        "content": "",
        "upvotes": 32,
        "comments": 10,
        "media": null,
        "permalink": "/r/netflix/comments/1h15qyp/the_docuseries_my_wife_my_abuser_highlights_the/"
    },
    {
        "id": "1h1jlhw",
        "author": "DustinFreeman",
        "title": "Few Kids TV shows disappeared from Kids profile.",
        "content": "Few of the TV shows my Kids watch disappeared from their profile that was set to TV-Y 7 rating content. They came back after I bumped up the profile to allow contents with TV-G rating.",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h1jlhw/few_kids_tv_shows_disappeared_from_kids_profile/"
    },
    {
        "id": "1h1qocj",
        "author": "Agreeable_Car_9778",
        "title": "How do I watch netflix outside of my home?",
        "content": "So I bought netflix in my country before leaving and right now I am in another country for my studies, but today it suddenly told that since the wifi I use is not same as my household wifi ill only be able to watch netflix for another 14 days on mobile before it told me to do something on my home TV which I didn't quite understand, could someone help me I dont quite understand what that means?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h1qocj/how_do_i_watch_netflix_outside_of_my_home/"
    },
    {
        "id": "1h1jjzb",
        "author": "T2p2xx",
        "title": " Loading/buffering Nightmare",
        "content": "Every time I click on an episode of a show the sound starts playing but it’s stuck on the black screen with the red buffering circle. I have to back out multiple times and come back in before it plays. Sometimes I have to reload Netflix for it to work. I don’t get it. I do the “check your network” in Netflix and it says internet connection, servers 1 &amp; 2, and connection speed are all good. I’ve deleted the application and reinstalled it on the Fire Stick. None of the other applications have issues. Is anyone else experiencing this issues? Does anyone have any suggestions on fixing it? ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h1jjzb/loadingbuffering_nightmare/"
    },
    {
        "id": "1h1lq74",
        "author": "boubou64",
        "title": "Video quality - throttling ",
        "content": "Watching Netflix regular plan no ads. Don't bother with premium because just us and a 1080p tv. Why should I bother with premium subscription?  I've been noticing pixely picture and tested my speed and it's very fast so it wasn’t bandwidth. I thought to change my plan to premium just to find out once and for all. It was almost instantaneous!.  Same internet speeds. Beautiful full HD tv netflix picture. That feels wrong. They say premium for 4k and more screens. Regular is advertised for 1080p. Looks like Netflix is throttling the regular service.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h1lq74/video_quality_throttling/"
    },
    {
        "id": "1h1bn8b",
        "author": "CarmenFiFi",
        "title": "many titles missing from netflix kids",
        "content": "i have a netflix kids profile set up on a few of our devices. today the kids tried to watch their usual shows and i noticed very few titles are coming up, including netflix originals like gabby’s dollhouse. anyone else experiencing something similar? i checked across devices and it’s the same on all. \n\ni also noticed they added several “playlists” with some of these missing shows’ episodes in them but nothing comes up when i search the titles. ",
        "upvotes": 3,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1h1bn8b/many_titles_missing_from_netflix_kids/"
    },
    {
        "id": "1h1krcd",
        "author": "Aggressive_Duck_1",
        "title": "Vizio TV Issue",
        "content": "Hi! I’m trying to set up Netflix on my Vizio TV but it is not working. Here’s a list of what I’ve done.\n\n1. Plug in TV, sign into Wi-Fi, go to Netflix (which is pre-installed and has a button on the controller.)\n2. Put in email and password several times, none of which worked. Every time it says something along the lines of “This password is wrong, try again” etc etc.\n3. Call Vizio support. Factory Reset TV, test Wi-Fi, everything. Nothing is working and I’m getting the same message.\n4. Reset Netflix password. Still get the same error message. Assume it’s a Netflix issue.\n\nAny ideas?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h1krcd/vizio_tv_issue/"
    },
    {
        "id": "1h1kkkh",
        "author": "lambdaIuka",
        "title": "My Moto 5G Stylus 2023 cannot use Netflix. It just goes to a black screen whenever I want to watch something, but I hear audio and see subtitles.",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h1kkkh/my_moto_5g_stylus_2023_cannot_use_netflix_it_just/"
    },
    {
        "id": "1h18l5c",
        "author": "Ok-Prune8783",
        "title": "\"Something went wrong\nWe are having technical difficulties and are actively working on a fix. Please try again in a few minutes\"",
        "content": "ive had this issue for the past two days on my computer with nothing working, it gives this error message, or the 'incorrect password for \\_\\_\\_\\_\\_\\_\\_ email\" even though I changed it to try to fix the problem and im using the correct one, and when I try to do a sign in code, it gives me the same damn message! non of my other devices (phone, television) are having this issue.\n\nhttps://preview.redd.it/mn613g3m2h3e1.png?width=705&amp;format=png&amp;auto=webp&amp;s=2378f8608c9ce2109f918785c882d31b0e5eb879\n\n",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1h18l5c/something_went_wrong_we_are_having_technical/"
    },
    {
        "id": "1h0zd7h",
        "author": "Thejoe923",
        "title": "Is it me or Netflix does not have a big variety of “good” comedy series? ",
        "content": "I watched: \nThe office ( both ), Brooklyn99, Superstore, Loudermilk, Tires, Shamless, Derry Girls, Big mouth, I think you should leave, Afterlife and Cunk on earth. Am i missing any other good showes?? ",
        "upvotes": 19,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1h0zd7h/is_it_me_or_netflix_does_not_have_a_big_variety/"
    },
    {
        "id": "1h17a5j",
        "author": "Beau_bell",
        "title": "Canceled show that don't feel too incomplete ",
        "content": "Another Life and Away are both shows you can watch and feel satisfied by the last episode despite it being canceled, and despite having plans for more. What other Netflix shows are like this? ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1h17a5j/canceled_show_that_dont_feel_too_incomplete/"
    },
    {
        "id": "1h1fdxy",
        "author": "PeeB4uGoToBed",
        "title": "I tried googling but couldn't find a clear answer. How bad are the ads in the ad supported tier? Are they abrupt and sudden like Hulu or are they played only before and after movies/TV show episodes?",
        "content": "Ive cut so many streaming services and im only down to 2 and one is only $3 a month for 3 months and plan on canceling that when it's up.\n\nIs the ad supported tier bearable with ads or is it just annoying like using YouTube or Hulu without an adblocker?\n\nAlso, how much of a selection do they block out on the ad supported?",
        "upvotes": 0,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1h1fdxy/i_tried_googling_but_couldnt_find_a_clear_answer/"
    },
    {
        "id": "1h0rboo",
        "author": "Sudden_Pop_2279",
        "title": "Squid Game: Season 2 | Official Trailer | December 26 on Netflix",
        "content": "",
        "upvotes": 40,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1h0rboo/squid_game_season_2_official_trailer_december_26/"
    },
    {
        "id": "1h1d84f",
        "author": "VecroLP",
        "title": "Dutch friends! Friday 6 to sunday 8th of december there is a free squidgame event in amsterdam",
        "content": "You do need to reserve tickets",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h1d84f/dutch_friends_friday_6_to_sunday_8th_of_december/"
    },
    {
        "id": "1h10vv3",
        "author": "GenTrapstar",
        "title": "Tex Mex Motors",
        "content": "Finished season 2 and watch a little bit of the shows where they do restorations. Anyways got to the end and found out Rabbit had passed away which bummed me cause I like him and Scooters chemistry on the show. Now I’m curious if they will even do a 3rd season and not even sure how they would do it cause they were a tag team when it came to hunting the cars down. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h10vv3/tex_mex_motors/"
    },
    {
        "id": "1h19grq",
        "author": "Anonymous_Brat_2006",
        "title": "My Netflix is lagging and I can't solve it anyone got solution ",
        "content": "So when I start any show my screen lags but the interface is smooth I tried almost everything does someone is facing similar problem or anyone got solution if yes please let me know ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h19grq/my_netflix_is_lagging_and_i_cant_solve_it_anyone/"
    },
    {
        "id": "1h0w5mz",
        "author": "gossamernotes",
        "title": "Netflix Announces The Summer Hikaru Died Anime with Surprise Trailer",
        "content": "",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h0w5mz/netflix_announces_the_summer_hikaru_died_anime/"
    },
    {
        "id": "1h0vlnu",
        "author": "grosevibes",
        "title": "Favorite true crimes on Netflix? ",
        "content": "Please share your favorite true crime shows or movies on Netflix! I have been obsessed with listening to true crime podcasts and am interested in watching some stories.\n\nNot interested in Dahmer recommendations. Thank you!  ",
        "upvotes": 8,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1h0vlnu/favorite_true_crimes_on_netflix/"
    },
    {
        "id": "1h1l8gp",
        "author": "Miserable_Relief8382",
        "title": "Lindsay Lohan playing the love interest in Netflix Films ",
        "content": "Some movies are Falling for Christmas, Irish Wish and Our Little Secret.\n\nFor the record, I have nothing against Lindsay Lohan. She is interesting to watch act in her scenes.\n\nHowever, she seems to be playing in movies where she is the love interest and her characters all play a sort of dorky, awkward girl who is silly and laughable.\n\nPersonally I find it hard to imagine her as a love interest because she is lacking sex appeal, she has done so much work on her face that she cannot even emote because it stays frozen, and overall I don’t find her physically attractive with the addition of her silly-girl personas. \n\nAgain, nothing against her as an actress because generally speaking I enjoy her movies. It’s just when she is a love interest I feel awkward watching her because I can’t connect with the men actually liking her, and she seems to continue being cast in these roles.\n\nAnyone else feel this way or just a me thing?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1h1l8gp/lindsay_lohan_playing_the_love_interest_in/"
    },
    {
        "id": "1h1iu1k",
        "author": "Fancy-Win9446",
        "title": "Stop the “Episodes To Go” countdown!!!",
        "content": "I recently finished two series and with a few episodes left, a message pops up saying “x episodes to go” or something like that.\n\nI hate that so much. I don’t want to know how many are left. I don’t want the spoiler that things will be concluded in a few episodes. \nIt offers nothing and ruins the suspense. \n\nIf anyone from Netflix reads this, Knock that shit off. ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1h1iu1k/stop_the_episodes_to_go_countdown/"
    },
    {
        "id": "1h19h7s",
        "author": "MuteReality",
        "title": "Netflix automatically downgrading quality while gaming [ALL]",
        "content": "Just recently it seems Netflix has changed something (Or Windows 11 has) that forces the quality of Netflix to degrade quality in lieu of performance and less lag.\n\nThis happens in any browser I use, and only while gaming, so it appears either a setting I have turned on or some feature pushed by Netflix is turning my stream down to 480p or less if I try to dual monitor a video game and also watch Netflix.\n\nDoes anyone know if there is a setting I need to toggle in Windows 11 to force the stream to stay max quality?\n\nIt has no issues whatsoever if I am just watching Netflix.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h19h7s/netflix_automatically_downgrading_quality_while/"
    },
    {
        "id": "1h0cafz",
        "author": "Matches_Malone010",
        "title": "Netflix needs to let us thumbs up or thumbs down individual seasons for shows.",
        "content": "I love Arcane season 1, but I think Arcane season 2 is pretty bad. I would still recommend people check out season 1, but I would caution them about watching season 2. I feel the same way about Umbrella Academy. Seasons 1-3 are really good, but season 4 is really bad and I feel people should know what they're getting into before they watch a show.",
        "upvotes": 48,
        "comments": 36,
        "media": null,
        "permalink": "/r/netflix/comments/1h0cafz/netflix_needs_to_let_us_thumbs_up_or_thumbs_down/"
    },
    {
        "id": "1h1cvcq",
        "author": "weirdly_intrested",
        "title": "Did i get hacked? ",
        "content": "So someone changed my netflix accounts language, changed the side the menu is on, and changed my name to \"i will delete it\" did i get hacked? What should i do? ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1h1cvcq/did_i_get_hacked/"
    },
    {
        "id": "1h0xpq9",
        "author": "descendantofJanus",
        "title": "4k/hdr plan worth it? ",
        "content": "I've an lg b2 55\" hdr oled tv, so of course, I was leaning towards this plan. Mainly to watch Wednesday (loved Beetlejuice 2, like, obsessively), maybe some Blacklist, Addams Family Values (Thanksgiving tradition) and... Idek what else they have. \n\nBut the plan being $25ish is... Rather steep. But if the pq is worth it, I'd be all for it. \n\nSo... Is it? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1h0xpq9/4khdr_plan_worth_it/"
    },
    {
        "id": "1gzvczt",
        "author": "dailymail",
        "title": "Netflix children's movie that 'teaches kids divorce is ok' is panned by parents",
        "content": "",
        "upvotes": 637,
        "comments": 130,
        "media": null,
        "permalink": "/r/netflix/comments/1gzvczt/netflix_childrens_movie_that_teaches_kids_divorce/"
    },
    {
        "id": "1h0tcoc",
        "author": "xX_Zombie8Slayer_Xx",
        "title": "A couple years ago i hovered over to Kill la Kill and when the preview music played it played really cool trap music, and i don't know what that was and i was thinking that music sounded really awesome and i have to find it.",
        "content": "So yeah i heard this music on Netflix when i hover over Kill la Kill season 1, and it played a song similar to \"Burnout Paradise by Bonce n' Beatz\" but it's really different if anyone can figure out what it is, please let me know.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1h0tcoc/a_couple_years_ago_i_hovered_over_to_kill_la_kill/"
    },
    {
        "id": "1h0t76y",
        "author": "CovertMist",
        "title": "Movies not playing in 1080P/4K what do I do?",
        "content": "I have the 4k video subscription, my PC is more than capable of playing movies in 4k and my internet speeds are SIGNIFICANTLY higher than what’s required to play a video in 4k. I also set my settings to try for highest video quality yet I’m getting 480p/720p on my PC but my TV (same internet) was able to play Fury in 4k like 5 hours ago. Can someone help?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1h0t76y/movies_not_playing_in_1080p4k_what_do_i_do/"
    }
]