[
    {
        "id": "1godiyr",
        "author": "AutoModerator",
        "title": "[Week n.45] PLEASE ASK YOUR QUESTIONS ABOUT MILAN HERE",
        "content": "This is our weekly thread. Here in the comments you can ask questions to get information about Milan (just info about Milan and \"Città Metropolitana di Milano\" and nothing else. Do not offer money to do something. Don't ask to receive private messages. Don't ask to answer to surveys/polls. Don't ask to meet people. Avoid using bold or all-caps to emphasize your comment).\n\nE.g. \"Can you tell me some good and cheap gyms in the San Siro area?\", \"I need a store where they can repair my phone. Do you know where I can go?\", \"Are there places where foreign expats hang out?\"\n\nBut do not ask for help in finding individual professionals: dentists, lawyers, accountants, architects, chefs etc. \n\nYou can ask questions in Italian or English (not both).\n\nBefore asking any questions please check our [wikipage](https://www.reddit.com/r/milano/wiki/index). If the answer to your question is already there then your comment will be removed.",
        "upvotes": 2,
        "comments": 23,
        "media": null,
        "permalink": "/r/milano/comments/1godiyr/week_n45_please_ask_your_questions_about_milan/"
    },
    {
        "id": "1gqotge",
        "author": "SlankSlankster",
        "title": "Milanese murmuration of starlings near Centrale FS",
        "content": "This was simply amazing. Outside our window near Centrale FS. I’m visiting. Is this a regular thing? Or migration gathering? ",
        "upvotes": 185,
        "comments": 10,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vkbqmdjxqq0e1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/milano/comments/1gqotge/milanese_murmuration_of_starlings_near_centrale_fs/"
    },
    {
        "id": "1gqj716",
        "author": "towm8x",
        "title": "Cosa fai per divertirti con un budget limitato?",
        "content": "Ciao! Sono appena arrivato a Milano e trovo la città piuttosto costosa. Vorrei conoscere nuove persone e partecipare ad alcuni eventi sociali, ma non è così semplice come pensavo. Ho molti interessi: tutti i tipi di sport, imparare le lingue, musica, ballo. Hai qualche consiglio per trovare tali contesti? Non ho molti soldi da spendere e non vorrei necessariamente andare in discoteca, ma non mi dispiacerebbe.\n\n\n\nCosa fate per divertirvi?\n\n\n\nConoscete comunità di calisthenics? O persone che organizzano rave diurni con musica house? Qualsiasi suggerimento interessante che avete sarebbe molto apprezzato",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/milano/comments/1gqj716/cosa_fai_per_divertirti_con_un_budget_limitato/"
    },
    {
        "id": "1gnyo6l",
        "author": "cinemaritz",
        "title": "Camminare in Milano centro é impossibile a causa delle biciclette ",
        "content": "Non potete capire il nervoso delle biciclette che ti sfrecciano davanti o da dietro mentre cammini in zona duomo, area che dovrebbe essere prettamente rilassante e per turisti. Con la scusa che il traffico stradale é molto interdetto, i pedoni camminano abbastanza liberamente ma il problema é che pieno di rider, turisti, gente di fretta che sta andando al lavoro ...in bici. Ecco sfrecciano senza un percorso preciso, spesso passando pericolosamente vicini tra pedone e cartelli..per non parlare delle bici elettriche, creando pericoli soprattutto per bambini e anziani. \n\nSe siete in ritardo per il lavoro, svegliatevi prima e prendete i mezzi pubblici e Ve la fate a piedi come la maggior parte delle persone! \n\nAl tempo stesso non posso che criticare il fenomeno di riders sottopagati che devono portarvi McDonald's sotto casa.... \n\nE lo stesso vale per alcuni turisti che pensano di essere al circuito di Monza con la loro bicicletta. \n\nQuindi o si crea una pista ciclabile all'interno dell'area duomo o io personalmente abolirei qualsiasi bici o motorino all'interno dell'\"area \n\nE lo dico da ex universitario che per anni si é fatto ore di mezzi e circa 3 km a piedi tutti i giorni \n\nEdit: parlo anche di monopattini :)",
        "upvotes": 0,
        "comments": 24,
        "media": null,
        "permalink": "/r/milano/comments/1gnyo6l/camminare_in_milano_centro_é_impossibile_a_causa/"
    },
    {
        "id": "1gmehwa",
        "author": "The_Press_Ion",
        "title": "C'è un problema nel modo in cui vengono fatte le multe",
        "content": "La mia ragazza ha appena ricevuto una multa per divieto di sosta \"perché sostava sulla carreggiata i cui margini sono evidenziati da strisce continue\". Ineccepibile.\n\nQuindi, cosa mi fa arrabbiare/mi confonde?\n\nLa multa è stata presa in via Varsavia (ortomercato), in un tratto in cui la strada è larga 20m, il traffico è scarso (era domenica) e il passaggio di pedoni è inesistente; nel frattempo qualcuno stava schivando le auto sui marciapiedi, qualche autobus era bloccato per qualche macchina parcheggiata in curva e qualcun altro ha la macchina sulle strisce blu da agosto senza aver pagato un centesimo.\n\nIo sono nato e cresciuto in provincia, ho frequentato Milano per diverso tempo e guido in città da quasi 5 anni, quindi non mi creano veramente problemi queste situazioni, ovvero sono (tristemente) abituato.\n\nEvidentemente da qualche tempo hanno ripreso a fare le multe, e le stanno facendo a caso: mandare i vigili a fare multe all'ortomercato di domenica non è la migliore scelta in termini di allocazione di risorse, secondo me.\n\nMi collego ad un altro problema che ho riscontrato: la macchinina \"controllo sosta\" di ATM con la telecamera che legge le targhe; alcune situazioni in cui non funziona:\n\n* parcheggio sulle strisce blu, vado a fare il biglietto al parcometro. Prima che io faccia il biglietto passa il controllo sosta: multa;\n* fermata sulle strisce gialle o blu, quindi sono a bordo dell'auto e posso non pagare il parcheggio. Prima che io riparta passa il controllo sosta: multa.\n\nIo dubito che questa telecamera sia in grado di riconoscere queste due fattispecie e ciò mi infastidisce.\n\nEdit: dato che la gente non sembra capire, le multe per divieto di sosta sono giuste, però non mi va giù come la violazione più frequente (parcheggio su marciapiede) sia tollerata -mi sento di dire- nel 100% dei casi.\n\nEdit2: io mi muovo coi mezzi nel 95% delle giornate. Tra qualche settimana arriverà anche il rant per trenord",
        "upvotes": 11,
        "comments": 43,
        "media": null,
        "permalink": "/r/milano/comments/1gmehwa/cè_un_problema_nel_modo_in_cui_vengono_fatte_le/"
    },
    {
        "id": "1gmrdil",
        "author": "Marzia_dt",
        "title": "Mostra Dinos Alive Milano, la consigliate?",
        "content": "Buonasera,  una domanda per chi è andato alla mostra dei dinosauri a Milano: vorrei comprare i biglietti per il compleanno del mio ragazzo, appassionato di dinosauri. Lui ha una forma lieve di autismo e non apprezza per molto tempo i luoghi affollati, con tanti stimoli visivi e acustici, per non parlare dei bambini schiamazzanti. Detto ciò, me la consigliate? Grazie!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/milano/comments/1gmrdil/mostra_dinos_alive_milano_la_consigliate/"
    },
    {
        "id": "1gmh378",
        "author": "Illustrious-Animal26",
        "title": "errore free2move - non riesco a terminare la sessione",
        "content": "Ho noleggiato un'auto da free2move con una tariffa al minuto circa un'ora e mezza prima, ho guidato per 45 minuti e quando ho voluto terminare la sessione, l'app non funziona, e negli ultimi 45 minuti ho provato a contattare l'assistenza clienti ma non rispondono. Mi stanno addebitando i minuti, cosa dovrei fare?",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/milano/comments/1gmh378/errore_free2move_non_riesco_a_terminare_la/"
    },
    {
        "id": "1gloagl",
        "author": "Froslass638",
        "title": "Film iconici su Milano che consiglierste?",
        "content": "Salve milanesi\n\nLong story short, la mia ragazza ha vissuto a lungo a Milano e ha gran nostalgia della città, per il compleanno vorrei chiudere la serata con un film che sia \"tipico\" di Milano o che ne faccia respirare la magia. Se dovessi farlo con la mia città saprei cosa prendere, ma non sapendo quasi nulla di Milano ed essendo Google di minimo aiuto vorrei chiedere consiglio a voi.\n\nChe mi consigliate?",
        "upvotes": 24,
        "comments": 49,
        "media": null,
        "permalink": "/r/milano/comments/1gloagl/film_iconici_su_milano_che_consiglierste/"
    },
    {
        "id": "1gl2wnv",
        "author": "psarnesen",
        "title": "My neighbourhood is NOT your parking garage! A needed rant about the parking situation in Milan.",
        "content": "What’s the deal with the attitude toward parking spaces and where people choose to park? I know this isn’t a new issue, and there are countless posts and articles about the parking situation in Milan. But lately, I’ve noticed something I need to vent about.\n\nIf you live in the city centre, as I do, and own a car, I understand your frustration about finding parking, so this is not for you.\n\n**This is for all of you who live outside and use a car to come into town for leisure.** \n\nMy Italian partner and I live in Porta Venezia. Next year, we’ll be expanding our family. This neighbourhood is filled with schools, kindergartens, parks, and more. This is a place where people live; this is now our home. The streets outside are where we belong and where we’ll start our little family. For however long we stay, this is our reality. You might disagree with us about starting a family in the city centre of Milan, but circumstances made this the only option at this stage. \n\nHere’s the issue: **WHY do you park on MY sidewalk? WHY do you park on top of MY green spaces? Why do you double park or block crosswalks, making it difficult and even dangerous for those living here to walk around?** \n\nI know that not everyone in this subreddit lives in the city centre. And if you do live in the centre, taking a car to go to a bar, a restaurant, or shopping on Corso Buenos Aires is, frankly, lazy. I take the metro, bus or tram all the time, and it has not been an issue so far. I also get taxis every time if there is no metro, bus or tram. Or I cycle or walk. *I live in A city centre; I use it as A city centre, not a suburb.* \n\nAnd for those of you who think, \"I pay taxes, so your street belongs to all of us,\"\n\nI bet you can drive home and park in your street, garage, or garden. Imagine if, every single day, cars were blocking every available space outside your door. The places you walk with your family, I bet you wouldn’t tolerate it for long.\n\nSo, if you absolutely have to come into the city for leisure, and a car is your only option, *pay to park*.\n\nMy neighbourhood is not your parking garage. There are designated places to park. If those are full, head to a parking garage, pay the cost and walk 5 minutes extra. It won't kill you! \n\nRant over. I know nothing will change, but I wanted to vent 😘 \n\n(I will write in Italian when I am fluent enough to rant 😅)",
        "upvotes": 32,
        "comments": 98,
        "media": null,
        "permalink": "/r/milano/comments/1gl2wnv/my_neighbourhood_is_not_your_parking_garage_a/"
    },
    {
        "id": "1gl0bno",
        "author": "One-Firefighter-5476",
        "title": "Ma i maranza che rovinano le BikeMi?",
        "content": "Troppe volte che passo accanto a stazioni BikeMi trovo gente/ragazzini che ci si siedono, ci vanno come fossero su una cyclette o pedalano al contrario, rovinano i freni, strappano gli elastici. Poi quando ne ho bisogno io le prendo e sono rotte.\n\nTutte le volte che li vedo non riesco a dire niente perché ho sempre paura che i maranza in gruppo reagiscano in modi che non riesco a gestire. ",
        "upvotes": 42,
        "comments": 23,
        "media": null,
        "permalink": "/r/milano/comments/1gl0bno/ma_i_maranza_che_rovinano_le_bikemi/"
    },
    {
        "id": "1gktde2",
        "author": "X_Galaxy_Corgi_X",
        "title": "Come non farsi seguire ai tornelli della metro? Sono stanca di questa situazione.",
        "content": "Prendo la metro ogni giorno (assieme ad altri mezzi) per andare a lavorare e puntualmente ogni mattina qualcuno mi si accoda, la cosa mi da un fastidio terribile, non per fare la guastafeste per questi soggetti, ma non voglio fare più quella che sta zitta e si sottomette a sti prepotenti.\n\nHo provato a fermarmi in mezzo di colpo o aspettare un po' prima di spostami, ma niente, i tornelli nuovi non suonano ne si chiudono e il tizio mi resta dietro ad aspettare che mi sposto, oppure come è già capitato mi spingono e basta anche facendomi quasi cadere per terra. Sono una persona molto piccola di statura, quindi sono pure abbastanza facile da \"scavalcare\".\n\nIeri mi è venuto addosso un ragazzino maranza che mi ha investito con il monopattino per passare, niente scuse ne niente, è rimasto là a fissarmi come un ebete.\n\nIo sono veramente stanca di tutto ciò, già guadagno poco e pago quasi 60€ al mese di abbonamento per fare passare qualche maleducato. O sono scema io che pago?\n\nCome fare? Non posso certo mettermi a urlare a quelli della sicurezza (le rare volte presenti) che uno vuole passare senza biglietto, non credo che qualcuno intervenga comunque.  \n\nSono veramente esasperata di trovarmi gente attaccata dietro ogni mattina.",
        "upvotes": 101,
        "comments": 53,
        "media": null,
        "permalink": "/r/milano/comments/1gktde2/come_non_farsi_seguire_ai_tornelli_della_metro/"
    },
    {
        "id": "1gl32ts",
        "author": "Ok-Mongoose1634",
        "title": "Le tre torri del quartiere city life ",
        "content": "",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/milano/comments/1gl32ts/le_tre_torri_del_quartiere_city_life/"
    },
    {
        "id": "1gkax7b",
        "author": "MyDoubtsMyTips-92",
        "title": "Milano, the place to be, finisce di piovere per 5 giorni e siamo messi già così ",
        "content": "",
        "upvotes": 73,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bkq03xhc24zd1.jpeg?auto=webp&amp;s=ace83a19381716f1c217e5174f379a39eb70cec4"
        },
        "permalink": "/r/milano/comments/1gkax7b/milano_the_place_to_be_finisce_di_piovere_per_5/"
    },
    {
        "id": "1gk8zjy",
        "author": "ThePPost",
        "title": "Tessera ATM non funzionante su alcuni dei nuovi tornelli",
        "content": "Ciao a tutti,\nDa quando hanno messo i nuovi tornelli nelle stazioni, su alcuni tornelli, ma non su tutti, la tessera non funziona il 90% delle volte. In Duomo poi, quasi mai, mentre nelle altre stazioni bene o male riesco a passare senza problemi.\n\nQualcun altro ha lo stesso problema? Vorrei evitare di spendere soldi per cambiare la tessera...per quanto l'unica spiegazione è che si sia parzialmente smagnetizzata, ma è strano che su alcuni va e altri no!",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/milano/comments/1gk8zjy/tessera_atm_non_funzionante_su_alcuni_dei_nuovi/"
    },
    {
        "id": "1gjjwt8",
        "author": "Fair-Background-4129",
        "title": "Puzza di plastica bruciata (quasi tutti i giorni da anni)",
        "content": "Ciao a tutti,\n\ncerco di essere breve.\n\nVivo da 10 anni in un paese alle porte di Milano. Stamattina alle 5:30 faccio per aprire le finestre (unico orario per cambiare l'aria perchè siamo a 3 metri da una strada che porta sulla statale) e sento subito una puzza di plastica bruciata fortissima, quindi richiudo subito.\n\n\n\nMentre scrivo sono le 18:00 e c'è stata puzza tutto il giorno, ho letteralmente trattenuto i bisogni (non la numero uno) da stamattina alle 8:00 perchè non posso aprire le finestre. Questa situazione si ripete più volte al giorno da anni e quasi tutti i giorni.\n\n\n\nChiedo a qualcuno che magari vive nella stessa zona ed ha notato questa puzza (siamo vicino a San Siro).\n\n\n\nSono ormai almeno 6 anni che andiamo avanti (senza contare la costante puzza di gas di scarico 24/7)\n\nQui pare che nessuno lo noti.\n\n\n\nps: mi sarei trasferito anni fa ma la casa è delle mia compagna e abbiamo figli, altrimenti sarei già altrove.\n\n\n\nGrazie a chi leggerà",
        "upvotes": 14,
        "comments": 17,
        "media": null,
        "permalink": "/r/milano/comments/1gjjwt8/puzza_di_plastica_bruciata_quasi_tutti_i_giorni/"
    },
    {
        "id": "1gizu7y",
        "author": "AutoModerator",
        "title": "[Week n.44] PLEASE ASK YOUR QUESTIONS ABOUT MILAN HERE",
        "content": "This is our weekly thread. Here in the comments you can ask questions to get information about Milan (just info about Milan and \"Città Metropolitana di Milano\" and nothing else. Do not offer money to do something. Don't ask to receive private messages. Don't ask to answer to surveys/polls. Don't ask to meet people. Avoid using bold or all-caps to emphasize your comment).\n\nE.g. \"Can you tell me some good and cheap gyms in the San Siro area?\", \"I need a store where they can repair my phone. Do you know where I can go?\", \"Are there places where foreign expats hang out?\"\n\nBut do not ask for help in finding individual professionals: dentists, lawyers, accountants, architects, chefs etc. \n\nYou can ask questions in Italian or English (not both).\n\nBefore asking any questions please check our [wikipage](https://www.reddit.com/r/milano/wiki/index). If the answer to your question is already there then your comment will be removed.",
        "upvotes": 5,
        "comments": 30,
        "media": null,
        "permalink": "/r/milano/comments/1gizu7y/week_n44_please_ask_your_questions_about_milan/"
    },
    {
        "id": "1gg1sa1",
        "author": "a_dude_from_europe",
        "title": "Recuperare la cintura sud come linea di metropolitana",
        "content": "Ultimamente stavo rimuginando (e sono consapevole di non essere assolutamente l'unico) sul fatto che la linea di cintura sud è grandemente sottoutilizzata (per la maggior parte del tempo passano solo i treni S9, con una frequenza di mezz'ora). Sarebbe secondo voi possibile riconvertirla in metropolitana (frequenza sui 5 minuti) più o meno facilmente? So che da anni ci sono progetti/discussioni per qualcosa di simile (la tanto decantata \"circle line\" che però appena arriva un po' più a nord va a schiantarsi con il già saturo traffico del resto della cintura ferroviaria) - per questo magari è più utile concentrarsi solamente sulla cintura sud. Questo progetto si potrebbe fare facilmente e economicamente? Sì/No? I treni merci avrebbero problemi? Andrebbero incluse/escluse più fermate? Per ora ho semplicemente aggiunto le stazioni da costruire così come immaginate nel PUMS, oltre a spostare la stazione di Porta Romana dall'altra parte del cavalcavia per comodità.\n\nhttps://preview.redd.it/8320wnt1kzxd1.png?width=993&amp;format=png&amp;auto=webp&amp;s=d33edd2fc22c1b9c0c3158b34bddd7f05e37267d",
        "upvotes": 30,
        "comments": 37,
        "media": null,
        "permalink": "/r/milano/comments/1gg1sa1/recuperare_la_cintura_sud_come_linea_di/"
    },
    {
        "id": "1gf82gm",
        "author": "lodatol",
        "title": "Biciclette su marciapiede e come comportarsi ",
        "content": "Eccomi qua a scrivere non per lamentarmi ma per cercare una soluzione che non sia quella di uscire con il taser alle 8 di mattina.\n\nPer motivi vari porto mia figlia a una scuola che non è la più vicina 300mt ma comunque è abbastanza vicina 600 mt.\n\nBene signori tra queste 2 scuole c’è un marciapiede stretto max 3 persone e visto che i bambini entrano tutti alle 8.30 vi lascio immaginare il problema: mi trovo spesso papà e mamme che corrono in bici sul marciapiede in senso opposto con i loro figli di ****** mentre io cerco di andare normalmente a piedi su un marciaPIEDE.\n\nNon un marciaBICI signori bensì a Milano ci sono i marciaPIEDI.\n\nLoro vanno di fretta ma io ogni volta devo far salire mia figlia sull’aiuola e sbuffargli in faccia(al ciclista).\n\n\nVi capita ? come procedete? Cosa mi consigliate?\n\n\nAstenersi commenti del tipo prendili a pizze in faccie, perché non sono il tipo ed inoltre non li posso neanche sgridare, in quanto la piccola altrimenti mi emula e si mette a sgridare gli altri (già successo una volta….)\n\nAvevo pensato di andare in segreteria di questa scuola e fargli una pec per chiedere di esporre avvisi in tal senso. Potrebbe essere utile?\n\nQuando piove chiudo l’ombrello e glielo punto però è una soddisfazione parziale perché si li obbliga a scendere, però ne trovo sempre di meno vista la pioggia e poi mi bagno anche io …\n",
        "upvotes": 14,
        "comments": 56,
        "media": null,
        "permalink": "/r/milano/comments/1gf82gm/biciclette_su_marciapiede_e_come_comportarsi/"
    },
    {
        "id": "1gdnq3m",
        "author": "AutoModerator",
        "title": "[Week n.43] PLEASE ASK YOUR QUESTIONS ABOUT MILAN HERE",
        "content": "This is our weekly thread. Here in the comments you can ask questions to get information about Milan (just info about Milan and \"Città Metropolitana di Milano\" and nothing else. Do not offer money to do something. Don't ask to receive private messages. Don't ask to answer to surveys/polls. Don't ask to meet people. Avoid using bold or all-caps to emphasize your comment).\n\nE.g. \"Can you tell me some good and cheap gyms in the San Siro area?\", \"I need a store where they can repair my phone. Do you know where I can go?\", \"Are there places where foreign expats hang out?\"\n\nBut do not ask for help in finding individual professionals: dentists, lawyers, accountants, architects, chefs etc. \n\nYou can ask questions in Italian or English (not both).\n\nBefore asking any questions please check our [wikipage](https://www.reddit.com/r/milano/wiki/index). If the answer to your question is already there then your comment will be removed.",
        "upvotes": 3,
        "comments": 59,
        "media": null,
        "permalink": "/r/milano/comments/1gdnq3m/week_n43_please_ask_your_questions_about_milan/"
    },
    {
        "id": "1gcteo6",
        "author": "Recent_Insurance7672",
        "title": "Lavori sulla M2 (ottobre-dicembre 2024)",
        "content": "Ciao a tutti! Qualcuno sa spiegarmi nel dettaglio che lavori stanno facendo sulla verde? Ho letto le informazioni (molto generiche) date da ATM, però vorrei capirci qualcosa in più. \nLa cosa che più mi preme sapere è se stiano effettivamente implementando il nuovo sistema di segnalamento, visto che si parla di \"implementazione della tecnologia che regola la circolazione dei treni\" e di \"elementi altamente tecnologici per migliorare le prestazioni e la frequenza dei treni\". \nSe sì, la verde sarà quindi \"semiautomatica\" come la rossa e la gialla con il macchinista che dovrà solo aprire e chiudere le porte? Spero vivamente di sì perché devono risolvere una volta per tutte la LENTEZZA CRONICA della verde. Grazie mille a chi saprà darmi una risposta.",
        "upvotes": 20,
        "comments": 13,
        "media": null,
        "permalink": "/r/milano/comments/1gcteo6/lavori_sulla_m2_ottobredicembre_2024/"
    },
    {
        "id": "1gct7ap",
        "author": "feded00",
        "title": "Video-documentario di Nova Lectio sui problemi di Milano",
        "content": "Segnalo questo video, i problemi di cui si fa menzione più o meno i soliti.",
        "upvotes": 0,
        "comments": 32,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/wd1SK8vz-6eEz95ThsscaXbU84PEY8zC2BRaBchB_UE.jpg?auto=webp&amp;s=3b2d7ab00ee07b176832874ed3fe76561dbf1186"
        },
        "permalink": "/r/milano/comments/1gct7ap/videodocumentario_di_nova_lectio_sui_problemi_di/"
    }
]