[
    {
        "id": "1jitr3y",
        "author": "TheAssessmentAMA",
        "title": "Hi Reddit–  I’m Fleur Fortuné, the director of THE ASSESSMENT, starring Elizabeth Olsen, Alicia Vikander &amp; Himesh Patel – in theaters now from Magnolia Pictures. Ask Me Anything!",
        "content": "Hi r/movies – I'm Fleur Fortuné, the director of THE ASSESSMENT, in theaters now from Magnolia Pictures. Starring Alicia Vikander, Elizabeth Olsen, Himesh Patel, and Minnie Driver,  the film had its World Premiere at TIFF 2024, and played at the Zurich Film Festival, BFI London Film Festival, and more. The film is my feature directorial debut, but I've been directing music videos (like some for Skrillex, Drake, Pharrell Williams, and Travis Scott), commercials, and shorts until now. More on the film:\n\nTHE ASSESSMENT follows Mia (Olsen) and Aaryan (Patel), a successful couple who hope to become parents in a near future where resources are extremely limited and the government keeps firm control over reproduction. They are assigned an assessor named Virginia (Vikander), who moves into their home for seven days to evaluate whether they deserve to move forward in their parenting journey. What Mia and Aaryan are hoping is a routine test quickly unravels into a psychological nightmare, forcing them to question the very foundations of their society and what it truly means to be human.\n\nTHE ASSESSMENT is now in theaters, and you can check out screenings in your area here: \n\n[https://www.theassessmentmovie.com/movie/the-assessment/book-now](https://www.theassessmentmovie.com/movie/the-assessment/book-now)\n\nOfficial Trailer:\n\n[https://youtu.be/bYmELiSalx0](https://youtu.be/bYmELiSalx0)\n\nTalk to you all later! Back at 1:15 PM today to answer any questions.\n\n",
        "upvotes": 53,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qtt4lxkdrnqe1.png?auto=webp&amp;s=259793575f199a0a3f4d1b7c27480775a54ba966"
        },
        "permalink": "/r/movies/comments/1jitr3y/hi_reddit_im_fleur_fortuné_the_director_of_the/"
    },
    {
        "id": "1jiq3v9",
        "author": "DemiFiendRSA",
        "title": "New Official Poster for A24's 'Death of a Unicorn'",
        "content": "",
        "upvotes": 1951,
        "comments": 120,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/aii8z6miymqe1.jpeg?auto=webp&amp;s=6e668a4ee68ffb54db98d6171335b7816b84b514"
        },
        "permalink": "/r/movies/comments/1jiq3v9/new_official_poster_for_a24s_death_of_a_unicorn/"
    },
    {
        "id": "1jisip5",
        "author": "RVarki",
        "title": "Seth Rogen doesn't get enough credit for the sheer volume of decent to high-quality movies and shows he's made",
        "content": "Seth Rogen has been a major figure in the film industry for almost two decades now, and in that time, a lot has been said about him, his abilities, the type of movies he makes and more recently, his political values\n\nThe one thing I've rarely seen people discuss is his insane record in terms of well made [movies and shows ](https://www.rottentomatoes.com/celebrity/sethrogen)(both as a performer and producer)\n\nJust in the past few years, he has acted in movies like Dumb Money, Fablemans, Long Shot and American Pickle, while producing TMNT:Mutant Mayhem, Joy Ride, Good Boys and Blockers. That's without talking about his hit-making run in the mid 2000s to mid 2010s, or his TV show resume, which is arguably even more impressive (he's literally about to come out with a show that has near-universal critical acclaim pre-release)\n\nUnlike other leading men who have a lot of well regarded stuff in their filmography, Rogen isn't really playing a numbers game. The man hasn't really been in a whole lot, it's just that a large portion of what he does do, is some version of good\n\n",
        "upvotes": 1282,
        "comments": 275,
        "media": null,
        "permalink": "/r/movies/comments/1jisip5/seth_rogen_doesnt_get_enough_credit_for_the_sheer/"
    },
    {
        "id": "1jiq8x5",
        "author": "BunyipPouch",
        "title": "First Image from Dystopian-Thriller 'The School Duel' - Starring Oscar Nunez ('The Office') and Kelsey Darragh - Set in near-future Florida, schoolchildren are recruited to take part in a deadly, statewide competition known as “The School Duel”, in order to try to curb the rise of school shootings.",
        "content": "",
        "upvotes": 1590,
        "comments": 310,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/bh672p4svmqe1.jpeg?auto=webp&amp;s=8c35292babaf0dc81e909626f1aa8a8200fa3b14"
        },
        "permalink": "/r/movies/comments/1jiq8x5/first_image_from_dystopianthriller_the_school/"
    },
    {
        "id": "1jik8bc",
        "author": "BenTheDiamondback",
        "title": "Could “Hot Rod” be the Best Movie Ever Made? No. But Yes. Probably.",
        "content": "I came late to this movie. Years late. A decade even. My daughter knew we loved “Popstar: Never Stop Never Stopping” thus, she said, we should love “Hot Rod.” \n\nBruh.\n\nI never laugh during an initial viewing of a comedy. Don’t know why, but any comedy I see the first time, it might elicit a chuckle here or there, maybe a chortle or a slight guffaw, but that’s about it. “Hot Rod” had me cackling the first time I watched it, and every time I’ve watched it since, I still laugh hard.\n\nSo unbelievably quotable… “Cool beans,” “BABE, WAIT, BABE!” “Yoo-hoo shitheads, I found this bag of fireworks in the men's restroom. Would you guys like to light them off?” “Let me join your crewwwWWW?” “I’ve been drinking green tea all goddamn day!” “You guys, the bathroom here is nuts!” “Ultimate punch!” “Pussyyyyyyyyyy…” “I’m Rod and I like to party.” “I said you look shitty! Goodnight, Denise!”\n\nPerfect soundtrack! Effing EUROPE songs throughout. The “You’re The Voice” montage! We know the story takes place in the age of the internet, but when? It’s timeless, sorta. 80s glam metal songs with earnest lyrics, clothes vehicles and houses that could put you in any of the last five decades. \n\nStill cannot believe this movie even exists. Thank god it does. With all of the frightened studio execs unwilling to take risks on anything because audiences are unpredictable and unreliable, for Paramount to basically go, “OK idiots, here’s $25 million, go make a movie,” it’s baffling to me. It’s also a shame this movie is still not as well known as it deserves. I would have thought, y’know, long tail rules, “Hot Rod” would have made its money back by now.\n\nI’m dropping this here for appreciation of a damn funny movie that deserves more viewers.",
        "upvotes": 857,
        "comments": 311,
        "media": null,
        "permalink": "/r/movies/comments/1jik8bc/could_hot_rod_be_the_best_movie_ever_made_no_but/"
    },
    {
        "id": "1jifdgh",
        "author": "MrGittz",
        "title": "The one Disney animated film that BEGGED to be made into a franchise/series but never did? THE GREAT MOUSE DETECTIVE. Oh how I wish we could’ve had more adventures with Basil of Baker Street",
        "content": "I know everyone always goes on about the Little Mermaid, Beauty &amp; The Beast, Aladdin etc. (&amp; those are wonderful films)\n\nBut for me? 1986’s “The Great Mouse Detective” is the **PERFECT** animated Disney film. I love practically every frame. The music, the voice acting &amp; animation? It’s wonderfully charming. Disney doing Victorian era London is always special &amp; atmospheric. \n\nFor those who don’t know the premise? It’s simple. What if Sherlock Holmes…was a mouse. Solving mice crimes. All while living in mouse hole tucked away in actual human Sherlock Holmes address of Baker Street\n\nThis movie was completed in that sweet spot where Disney had yet to make the switch to digital coloring(aka digital Ink &amp; paint aka the CAPS system) and so this film has that warmth &amp; charm that was a little bit lost when the conversion was made circa the early 1990s. It does have a very early CGI sequence in an animated film, the terrific Big Ben Clock climax. (The gears were created digitally and then traced over, not actually rendered out to film or composited digitally)\n\nSo what makes the film so special? The characters. The characters! I know this isn’t technically “Sherlock Holmes” BUT if it were, this would be my favourite rendition of the great detective. \n\nLike all great Sherlock adaptations it’s the Sherlock/Watson relationship that is the true measure of success and this movie takes the cake. David Q Dawson is our Watson stand in, he’s a caring albeit clumsy mouse, compared to Basil’s man(er..mouse) of action. They just have terrific chemistry. You buy them as friends instantly. \n\nAnd it’s this reason more adventure were needed. I don’t care in what form. Straight to video, animated series or legit theatrical sequel. So long as the same voice actors were used? Give me more! But alas, it was not meant to be. After Little Mermaid and the rest become huge cultural juggernauts, there was no more room for the relatively modest successful fare like The Great Mouse Detective. And we are all the poorer for it. Also unlike most those other films, this isn’t a musical. There’s one scene where characters break out in song. And it’s great.\n\n\nI’ve often wondered if Disney would do the same “live action” remake route befallen to so many of the animated films. Maybe in time but you’ll never do better than Vincent Price as Ratigan, Barrie Ingham as Basil and Val Bettin as Dawson. RIP.\n\nAnd that score by Henry Mancini? Now that’s a theme! Remember when we had memorable musical themes? \n\nSo? For those who haven’t had the pleasure or for those who have &amp; haven’t had the pleasure in awhile, go check out The Great Mouse Detective, bask in its charm, warmth, heart and splendor. \n\nThis movie deserved to be a franchise.",
        "upvotes": 1153,
        "comments": 156,
        "media": null,
        "permalink": "/r/movies/comments/1jifdgh/the_one_disney_animated_film_that_begged_to_be/"
    },
    {
        "id": "1jipz3u",
        "author": "Tall_Ant9568",
        "title": "What is the saddest or most emotionally jarring scene you’ve ever seen in science fiction?",
        "content": "Some contenders for me: \n\nThe Death of Boromir (LOTR)\n\nThe flute episode of Star Trek TNG\n(The Inner Light)\nSeason 5 Episode 25\n\nThe death of Cedric in Harry Potter\n\nThe end scene of Armageddon where Harry gives his last speech to his daughter:\n\n\nHarry Stamper: I know it baby. But there won't be anything to be scared of soon. Gracie, I want you to know that AJ saved us. He did. I want you to tell Chick, that I couldn't have done it without him. None of it. I want you to take care of AJ. And I wish I could be there to walk you down the aisle, but I'll... I'll look in on you from time to time, okay honey? I love you Grace.\n\n\nKingdom hearts where the world is breaking apart and it’s playing ‘Please don’t walk away’ and Sora tries to grab Kairi’s hand.\n\nEdit for: Science fiction or fantasy ",
        "upvotes": 108,
        "comments": 438,
        "media": null,
        "permalink": "/r/movies/comments/1jipz3u/what_is_the_saddest_or_most_emotionally_jarring/"
    },
    {
        "id": "1jigwf0",
        "author": "UNAMANZANA",
        "title": "My biggest problem with the Terrifier movies is that they’re honestly kind of boring.",
        "content": "Not in the “too slow” kind of way. More-so in the fact that each kill scene just keeps going and going and going. It gets to the point where it’s not even suspenseful; you watch and you just know that Art is going to do some gratuitous shit. Honestly, these movies would be a whole lot more enjoyable if each kill scene was like two minutes shorter. ",
        "upvotes": 683,
        "comments": 200,
        "media": null,
        "permalink": "/r/movies/comments/1jigwf0/my_biggest_problem_with_the_terrifier_movies_is/"
    },
    {
        "id": "1jirixr",
        "author": "Coolnave",
        "title": "\"Flow\" - How the Cat-Whale dynamic resonated with me after my mom's suicide",
        "content": "I finally watched Flow yesterday at one of the last screenings here in France, and feel so spoken to. As someone who has lost a lot of people these past few years and felt responsible for the actions of others, the theme of people entering and leaving your life during their own journey gave me a lot of parallels.\n\nBut the Cat's relationship to the Whale really resonated with me, in my heart before I could explain it. I first saw this dynamic as a \"help where you can and accept when you can't\" moral:\n\n&gt;The Whale saving the Cat, while literally lifesaving for the Cat was just a bit of effort on the Whale's part, maybe just an afterthought in its day. However, this situation could only be manufactured through the absurd scenario of the flood, where Whale just happened to have the skills needed to help. When the flood ends, the Cat is the only one with the skills/intelligence to get the rope out of the tree and help save the animals on the boat. When the Cat finds the Whale again -beached in a forest, another absurd scenario-, there is nothing he can do other than comfort the Whale while it dies. We aren't all built with the right tools for every scenario, and some problems are beyond our means, we are not able to save everyone, even if that person had previously saved us and we feel indebted to them. A very stoic moral that preaches forgiving yourself.\n\nBut I couldn't figure out why it was so powerful to me, so I went for a walk under the nighttime drizzle after the movie. I then realized that I saw the Cat &amp; Whale's relationship as that of me and my mother, who lost her battle with bipolar disorder almost 2 years ago. \n\n&gt;In addition to saving the Cat, the Whale was following the boat, serving as a source of comfort in a sea of danger. If something goes terribly wrong, the Whale would be there to save the Cat again. My mother, and most people's parents, was that source of comfort, and it's thanks to her that I am alive today, simply by virtue of being her child. She followed my boat as I sailed through the troubled waters of divorced parents, being moved as a child to a country whose language I did not speak, and through any other challenges in my life.\n\n&gt;I have spent the past 2 years guilting myself since I found her dead. With a better son, she would still be alive -despite the fact that I had already stopped 2 of her attempts and was the only thing left giving her joy in life-. And while that may be partly true simply due to the butterfly effect, for the most part, I have to accept that the external circumstances (bipolar disorder &amp; suicidal / a beached whale in the middle of the forest) were far too overwhelming. \n\nIf I watched \"Flow\" and could \"forgive\" the Cat for not being able to save the Whale, then I have to forgive myself for not being able to save my mom.",
        "upvotes": 82,
        "comments": 16,
        "media": null,
        "permalink": "/r/movies/comments/1jirixr/flow_how_the_catwhale_dynamic_resonated_with_me/"
    },
    {
        "id": "1ji3sln",
        "author": "AnonRetro",
        "title": "Rick Moranis Talk About Props from Honey, I Shrunk The Kids",
        "content": "",
        "upvotes": 2957,
        "comments": 204,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/zrFtn0VSsBoUYs0Pjn2pb-BsKaVQyIkiYSwcyXLkpeU.jpg?auto=webp&amp;s=84e3c5390b664f4d43e8e602e5a127cebe65fd20"
        },
        "permalink": "/r/movies/comments/1ji3sln/rick_moranis_talk_about_props_from_honey_i_shrunk/"
    },
    {
        "id": "1ji260v",
        "author": "Bennett1984",
        "title": "Green Room, Bone Tomahawk, The Witch, and the Must-See Films of 2015",
        "content": "",
        "upvotes": 2881,
        "comments": 376,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/m2aLA_5mFGPmBo9hnrJoRskJB_SDlx6fYq-oq02-dm4.jpg?auto=webp&amp;s=9452e5adb031c834599bd45ff8cccb38486ad9a6"
        },
        "permalink": "/r/movies/comments/1ji260v/green_room_bone_tomahawk_the_witch_and_the/"
    },
    {
        "id": "1ji3lys",
        "author": "BunyipPouch",
        "title": "New Poster for 'Freaky Tales' - Starring Pedro Pascal, Ben Mendelsohn, Jay Ellis, and Angus Cloud - An NBA star, a corrupt cop, a female rap duo, teenage punks, neo-Nazis, and a debt collector embark on a collision course in 1987 Oakland, California.",
        "content": "",
        "upvotes": 2126,
        "comments": 202,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/cdye1apixgqe1.jpeg?auto=webp&amp;s=e511e2e35052b8bf44f9724739461c40e50467cb"
        },
        "permalink": "/r/movies/comments/1ji3lys/new_poster_for_freaky_tales_starring_pedro_pascal/"
    },
    {
        "id": "1jit3br",
        "author": "NoCulture3505",
        "title": "Jack Reynor Boards Lee Cronin’s ‘The Mummy’ For Atomic Monster &amp; Blumhouse",
        "content": "",
        "upvotes": 26,
        "comments": 21,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/h20YXoOzmlPnRZd0rnrc2hxE2n0DUPQj8Co4WujAmS0.jpg?auto=webp&amp;s=bc82b69f22dff8f1f7f002bf5d22dd674b779a98"
        },
        "permalink": "/r/movies/comments/1jit3br/jack_reynor_boards_lee_cronins_the_mummy_for/"
    },
    {
        "id": "1ji60c8",
        "author": "e8odie",
        "title": "What are some instances of actors doing a complete joke take that ended up getting used in the final film?",
        "content": "For this I'm not really thinking of improv takes for comedy films, but I guess that can fit. But just recently I've seen multiple actors/directors talking about a take that was originally just meant to be funny but ended up getting used in the final product. Examples:\n\n- **A Real Pain**: after tour guide James is saying a heartfelt thank you and goodbye to Benji and just turns and nonchalantly and flatly tells David thanks. James' actor has said that that was just meant to be funny and even Jess Eisenberg originally though the take was \"ruined\" but ended up loving it and using it.\n\n- **Leon the Professional**: Gary Oldman dramatically yelling \"EVERYONE!\" was one of a couple takes that he intentionally was overdoing to make Luc Besson laugh. Turns out he liked it enough to use it in the final film.\n\n- **Severance**: TV obviously, but in the most recent episode when Mr. Milchick delivers a letter to a character and then abruptly sprints away, Tramell Tilman has said he just did that to be funny and didn't think it would be used.\n\nWhat are some more famous or interesting examples?\n\n---\n\n**EDIT**: To emphasize, I'm not necessarily interested in \"just\" improvised scenes/lines here, but specifically a delivery or take where the actor themselves thinks it's ridiculous or a joke or unusable that I'm interested in.",
        "upvotes": 1134,
        "comments": 487,
        "media": null,
        "permalink": "/r/movies/comments/1ji60c8/what_are_some_instances_of_actors_doing_a/"
    },
    {
        "id": "1ji7vlm",
        "author": "mayukhdas1999",
        "title": "First Image from 'TORNADO' - 1790s Britain. A Japanese puppeteer's daughter, Tornado gets caught up with a criminal gang when their show crosses paths with them. In an attempt to create a new life for herself, she seizes the opportunity to steal the gold from their most recent heist",
        "content": "",
        "upvotes": 762,
        "comments": 135,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8jlfsg9hshqe1.jpeg?auto=webp&amp;s=7dafb1a522a54b2cf8801f0bf8c6c5a63cd7fb8e"
        },
        "permalink": "/r/movies/comments/1ji7vlm/first_image_from_tornado_1790s_britain_a_japanese/"
    },
    {
        "id": "1jioin1",
        "author": "SamaraSurveying",
        "title": "9 (2009), the machine was meant to be the hero. (Mini essay)",
        "content": "\r\nNot all of Chekhov’s guns have to be physical objects, for instance we see it all the time in monster movies. The monsters weakness is revealed or discovered, and later used against it. To give the audience the information that the werewolf is weak to silver, but never put it into practice, creates the same narrative void as is the protagonist found a physical “anti werewolf gun” only to never use it.    \n    \r\nI would like to bring up the fact that the whole movie, 9(2009), is built around an unfired ‘Chekhov’s idea.’ We are directly given information that in my mind, built up a completely different and non-traditional ending that I was so excited for, only for the movie to fall on it’s face into the ‘generic ending’ puddle, including a good ol’, out of nowhere, Deus Ex Machina.   \n    \r\nA quick synopsis:\r\nThe movie 9 is set in a post apocalyptic world, the story starts with a scientist, the last remaining human, transferring the last part of his soul into a sack puppet using a device referred to as the Talisman. The scientist dies after the transfer.   \n    \r\nThe newly created sack puppet, labelled ‘9,’ heads off into the apocalyptic wasteland, only to be attacked by demonic robot creations. 9 eventually meets up with sack puppets 1-8. Hijinks ensue and eventually we meet the evil ‘Fabrication Machine,’ an evil machine that was corrupted by the warmongering government, resulting in it building murder machines that eventually turned on humanity and led to the lifeless wasteland the movie takes place in.   \n    \r\nThe evil Fabrication Machine obtains the soul transfer Talisman, and begins hunting down the sack puppets, eventually sucking the souls out of 1, 2, 5, 6 and 8 into itself.   \n    \r\nFor the grand finale, 9 gets the Talisman back from the Fabrication Machine, and suddenly the Talisman that has up until now only ever been a soul transference device, becomes a Deus Ex Machina laser that goes pew pew pew and kills the Machine, freeing the souls of the sack puppets (but not reviving them.) Ultimately this ending leaves just 3, 4, 7 and 9 to a bleak future, just the four of them in the endless expanse of a ruined world.   \n   \r\nNow, what is the Chekhov’s information I want to moan about? Throughout the movie we learn the following:   \n\r\n•\tThe Scientist from the beginning is the one who created the Fabrication Machine, he was a good man who built the machine to build and create for peace.  \n\r\n•\tThe Fabrication Machine is corrupted by the government, but the Scientist specifically says that: “My creation was hopelessly flawed and indeed dangerous, for it lacked the human soul”.   \n\r\n•\tThe Scientist with his benevolent soul, has transferred his soul into the 9 sack puppets. “You are all that's left of humanity. You are all the pieces of my soul.”.  \n\r\n•\tThe Fabrication Machine could easily destroy the sack puppets physically, but seems to go out of its way to specifically absorb their souls using the talisman. Note that the machine already has a specific slot/port on it to use the talisman presumably designed and installed by the Scientist.    \n    \r\nSo what ending did I see being built up with this information? Lets review:    \n     \r\n•\tThe machine is designed to create, it just chooses to create death. It still could create life, at least artificial life, should it have a change of heart.   \n\r\n•\tThe machine is evil specifically because it lacks a soul, however the Scientist included a way for it to absorb souls, since it already has a port for the Talisman. This implies the Scientist already had the Talisman and soul transfer technology before building the Fabrication Machine.   \n\r\n•\tThe Scientist transferred his ‘good soul’ into 9 sack puppets. The Machine hunts down the Talisman and sack puppets, prioritising absorbing their segments of soul over physically destroying them.   \n\r\n•\tDid the scientist plan this all along? Was the machine always meant to have a soul, but the government stopped him? Was releasing his soul into the wasteland in the form of sack puppets a desperate attempt at self-preservation, or a last ditch effort to provide his corrupted creation with the soul it both needs and craves to fulfil its original benevolent purpose?      \n     \r\nSo, what happens if the machine captures all 9 puppets? It’ll have a complete soul, the one thing it needed to not be a dick. Maybe it can find and help any remaining humans, or just create a new world of its own creations?    \n     \r\nA lot of this information was dumped on the main character, 9, right at the end, just before he laser blasts the machine. However, the end I saw coming, and was really excited about, was the idea that 9 would have to convince or trick the remaining sack puppets to sacrifice themselves to the Fabrication Machine, allowing the Scientist’s soul to reform the machine and start rebuilding the world.     \n     \r\nPros of my ending:    \nInteresting, dramatic, unexpected. Something different from the usual Hollywood happy-ever-after. In my opinion the original ending is actually pretty bleak, yeah they defeated the BBEG but there’s nothing left of the world, just the four remaining sack puppets, two of which are mute with childlike personalities. The original ending doesn’t set up any kind of post-movie goals or motivation for the remaining sack puppets, they don’t even need to eat or drink. Do the characters plan to just sit in a ruined building somewhere and twiddle their thumbs?    \n     \r\nCons of my ending:    \nIt’s heavily implied that the Scientist was the last human, there isn’t really any world for the Fabrication Machine to rebuild once it turns good. Maybe there are survivors or untouched countries beyond the setting of the movie? The Scientists plan of just releasing his soul through sock puppets and just hoping that his machine eventually hunts them all down is a bit convoluted, could he not just find the machine himself?    \n      \r\nIt’s noted on: https://nine.fandom.com/wiki/Deleted_Scenes - Trivia.    \n      \r\n“At some point during the preproduction, they had an adaptation where 9's soul actually gets sucked into the Fabrication Machine, and meets its soul to discover that the Machine was really \"0\".”.  \n    \r\nWhich hints at a similar concept, but implies the Scientist put the evil part of his soul into the Machine?\r\n",
        "upvotes": 42,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q_thnCWXPZjZW8KIHAMqjXOsE-P5n4o0KCVeyVeRl5Q.jpg?auto=webp&amp;s=508752cbfac02088209d8f71c483eea9afc93393"
        },
        "permalink": "/r/movies/comments/1jioin1/9_2009_the_machine_was_meant_to_be_the_hero_mini/"
    },
    {
        "id": "1ji2x7y",
        "author": "dafones",
        "title": "CinemaStix: Yep, I Cry Every Time (A Knight's Tale)",
        "content": "",
        "upvotes": 1047,
        "comments": 125,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/66-4981uWCvMD13vNz2G-YWCLkXbyT-rm6qoROyuUsA.jpg?auto=webp&amp;s=467808dc617f254e1528485b091e93e7b0299db9"
        },
        "permalink": "/r/movies/comments/1ji2x7y/cinemastix_yep_i_cry_every_time_a_knights_tale/"
    },
    {
        "id": "1jivkkv",
        "author": "birdnerd5280",
        "title": "The Monkey &amp; the generational curse of your father's unresolved issues",
        "content": "Just saw The Monkey last night and thoroughly enjoyed it! As always after seeing a movie I came to reddit to read a bunch of discussion threads and see what folks are saying. Lots of people talked about enjoying the campy kills and dialogue. Turning into pink mist from being electrocuted but your leg somehow flies off and smacks Theo James? \"It is what it is...the word of our Lord.\" Good stuff! What I haven't seen as much talk about is the meaning of the film. Maybe it's been posted about already and I just haven't seen it, but I got the impression some viewers were unhappy with the lack of lore for the monkey-demon itself. I thought there was a clear and neatly-resolved message inside the delightfully silly package so I thought I'd add my two cents review.\n\nTo me the monkey represents the emotional burden of men, especially fathers\\*, who repress their traumas, become stunted, and end up hurting those around them. The film shows us this harm to others on two parallel levels: the realistically fucked up relationship of an emotionally distant dad and his son, and the fantastically gruesome harm perpetrated by the monkey.\n\n\\*Of course the message works for anyone but I think fatherhood and masculinity is the most explicit. All four characters involved in the struggle over the monkey are men with dad issues. The main antagonistic relationships are dad-son, brother-brother, dad-step dad. Elijah Wood's foil to the main character is literally a \"fatherhood expert.\"\n\nHal and Bill both become a type of man in this vein: Hal emotionally repressed and distant, Bill physically violent. In real life a man like Bill wouldn't need magic monkey powers to kill people over his emotions. Family violence is a common tragedy, and at least in part this is because a patriarchal society demands men repress their emotions and become islands unto themselves (\"she was my mom too\" \"I never thought of it that way\"). The monkey kills people around the brothers because there is an evil generational curse on them, but it's only a magic one for film reasons. The real generational curse is that emotionally unavailable fathers wreak havoc on people, especially their sons.\n\nThe movie resolves when the brothers open up to each other and Hal confronts death (literally) along with his feelings of guilt, shame, and fear. By doing this in front of his son he's choosing to deal with his emotions in a healthy way and end the vicious cycle. Likewise about the monkey he says they have to \"recognize that it's ours and keep it close\" so it can do further harm. The evil bastard monkey was the emotions we repressed all along!\n\nFor me it was exactly what I wanted it to be: enjoyably campy and dumb in the best way, but with an actual message buried in the tomfoolery. Watching it with this in mind made me enjoy the movie more and also made the ending feel quite satisfying.\n\n4/5 ⭐⭐⭐⭐",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/movies/comments/1jivkkv/the_monkey_the_generational_curse_of_your_fathers/"
    },
    {
        "id": "1jiixv9",
        "author": "NewMode8949",
        "title": "films with bad experiences on set?",
        "content": "Usually when actors do a press tour they praise their cast and crew and the incredible expirience it was to work at the set. Either about how much fun it was or the lasting friendships they made. But are there films that actors openly stated to have an uncomfortable set experience? Like collectively, the process of filming was grueling and unpleasant. Whether it was because of a difficult location or other complications. And during interviews this is a known fact, that although the movie and cast relations are good, the process was not a great experience? ",
        "upvotes": 75,
        "comments": 233,
        "media": null,
        "permalink": "/r/movies/comments/1jiixv9/films_with_bad_experiences_on_set/"
    },
    {
        "id": "1jiq6h9",
        "author": "michajlo",
        "title": "What is the best movie that you've randomly stumbled upon?",
        "content": "Once every two weeks or so, I like to watch a movie that I pick almost by random. I choose a genre I feel like exploring that evening, I exclude 1-2 \"tags\", and then look for a movie that gets my attention based on the title or something similarly minor. It's not about the ratings or notable actors, but just the concept.\n\nThat's how I stumbled upon The Endless(2017), which remains one of the most bizarre but also genuinely intriguing movies I've ever seen. I knew nothing about it prior to watching, read no reviews or opinions, and now I can totally recommend it to anyone interested.\n\nAnd if you indeed are curious, it's a relatively slow and atmospheric horror that touches upon the topic of cults, the people involved in them, and those who manage to get out.\n\nAnyway, what about you? What are some movies that you found by accident that turned out to be good/interesting/thought-provoking?\n\n\n\n",
        "upvotes": 13,
        "comments": 136,
        "media": null,
        "permalink": "/r/movies/comments/1jiq6h9/what_is_the_best_movie_that_youve_randomly/"
    },
    {
        "id": "1ji2pqo",
        "author": "BrandonStRandy1993",
        "title": "Which movie has the funniest plot?",
        "content": "My vote goes to Hot Rod. The entire plot of the movie is Rod trying to raise money for his stepdad’s heart transplant so he can save his life and then kick his ass. Throw in Will Arnett and the scene where Rod falls down the hill for an hour and you’ve got one of the funniest movies of the 2000s. Which other movies are immediately funnier when you just think about the basic plot? ",
        "upvotes": 640,
        "comments": 357,
        "media": null,
        "permalink": "/r/movies/comments/1ji2pqo/which_movie_has_the_funniest_plot/"
    },
    {
        "id": "1jivohk",
        "author": "MarvelsGrantMan136",
        "title": "Nicholas Hoult To Star In Bank Heist Movie From Amazon MGM Studios With David Leitch Directing",
        "content": "",
        "upvotes": 11,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Hq68tCKHNOifREmo1_2R4TTRThiFDbbUeDyIW62nMqk.jpg?auto=webp&amp;s=e0f3ded3cdde1a46e3492fc324891f3e572eefd2"
        },
        "permalink": "/r/movies/comments/1jivohk/nicholas_hoult_to_star_in_bank_heist_movie_from/"
    },
    {
        "id": "1ji0nd1",
        "author": "pilofication",
        "title": "are there any movies, where at the end, you realize you’ve been rooting for the bad guy",
        "content": "this is a silly question, but i watched a youtube video the other day and this guy was just playing a game with his friends that he made, and he set it up to make them look like they were heros savint the world and killing bad guys, but at the end they realize they saw it all wrong and they were actually good people. idk, just had a random thought and figured id ask here",
        "upvotes": 721,
        "comments": 949,
        "media": null,
        "permalink": "/r/movies/comments/1ji0nd1/are_there_any_movies_where_at_the_end_you_realize/"
    },
    {
        "id": "1ji7hfp",
        "author": "babythot12",
        "title": "shitty movies/so bad it’s good recommendations please",
        "content": "\nHi everyone, \n\nSo my friend and I have decided to instead watch movies in the cinema that are shitty/so bad that they are actually funny.  the worst movies the world of film has to offer. The last we watched was flight risk which we found hilariously bad. \n\nDoes anyone have any recommendations like this  for this last year or or this or other years or can you please point to how I can find movies like this. ",
        "upvotes": 267,
        "comments": 1233,
        "media": null,
        "permalink": "/r/movies/comments/1ji7hfp/shitty_moviesso_bad_its_good_recommendations/"
    },
    {
        "id": "1jimvux",
        "author": "kahnkahn0227",
        "title": "\"Prima Facie\" really blew me away",
        "content": "I just watched \"Prima Facie\" last night. I didn't read any relevant introductions in advance, but I roughly knew that it was a film themed around \"law and justice.\" When I got to the cinema and started watching, I realized that it was actually a stage play, and what's more, it was a one-person show with a dense flow of lines. I was truly in awe of Jodie Comer's acting skills. At first, I was wondering why there was no scene change and why there were no other lawyers. It wasn't until more than 30 minutes later that I realized it was a one-person show. However! She was so deeply immersed in her performance, and I began to get into the rhythm of her lines. I think the most ingenious part was when she, originally a \"litigation lawyer,\" went to the court to face cross-examination. The transformation of her character signified the shift and questioning of her thoughts about the judicial system. Of course, the content itself also reminded me of Ito Shiori's \"The Black Box.\" For cases like this, there is still a long way to go for the judicial evaluation system and procedures. But I really want to cheer for the actress! I also really wish I could watch it again on the live stage!  ",
        "upvotes": 17,
        "comments": 9,
        "media": null,
        "permalink": "/r/movies/comments/1jimvux/prima_facie_really_blew_me_away/"
    },
    {
        "id": "1jiu5nu",
        "author": "Morganbanefort",
        "title": "Pixar's Pete Docter Reflects on 30 Years of 'Toy Story,' New Movie",
        "content": "",
        "upvotes": 5,
        "comments": 4,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/th-CeYK4zVjqfDWrKlKfPgjMt2TGIiejuTQyUQBvjsU.jpg?auto=webp&amp;s=ee64649d3ea7ca9516d76a0a2d59e1312688cd71"
        },
        "permalink": "/r/movies/comments/1jiu5nu/pixars_pete_docter_reflects_on_30_years_of_toy/"
    },
    {
        "id": "1jhwu9j",
        "author": "zanerands",
        "title": "Event Horizon",
        "content": "I watched event horizon about 1.5 years ago now I I think about the movie atleast once a week. It was a little bit goofy at times but the premise was really intriguing. Please for the love of god somebody create a prequel. It needs one immediately. I need one immediately lmao. Those scenes of the crew before them was super intense and grotesque but interesting nonetheless.",
        "upvotes": 964,
        "comments": 344,
        "media": null,
        "permalink": "/r/movies/comments/1jhwu9j/event_horizon/"
    },
    {
        "id": "1jiq53m",
        "author": "NoCulture3505",
        "title": "‘Strangelove’ Filmmaker Jorge Xolalpa To Direct Immigration Thriller ‘Huehxolotl’",
        "content": "",
        "upvotes": 8,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/gO7Jv34Z4sDht_UU-n58YsVD4_G2HKwzz1xZpz_4Ux0.jpg?auto=webp&amp;s=2de64f2413454aa1fedafb926d20724865c18eff"
        },
        "permalink": "/r/movies/comments/1jiq53m/strangelove_filmmaker_jorge_xolalpa_to_direct/"
    },
    {
        "id": "1jio9go",
        "author": "MrRourkeYourHost",
        "title": "Movies about leaving Earth alone in the name exploration knowing they’ll never return?",
        "content": "Anyone know of any movies where the astronaut is chosen to leave Earth for deep space exploration just to document and send back video, thoughts and images but knowing they’ll will never return. Basically signing up for a guaranteed one way trip. I know Contact and it’s a great movie but I’m looking more for sort of a one person screen play where it’s also a a study in isolation, the struggle of leaving everything behind. Of course unless they land on a planet inhabited by apes.",
        "upvotes": 11,
        "comments": 53,
        "media": null,
        "permalink": "/r/movies/comments/1jio9go/movies_about_leaving_earth_alone_in_the_name/"
    },
    {
        "id": "1jifv0b",
        "author": "dtrav001",
        "title": "Saw the Providence RI premier of the new documentary \"Secret Mall Apartment\" last night — in the mall where it happened!",
        "content": "Pretty surreal, to be sitting at the very spot where, a few hundred feet away, all this took place — a real mental time warp! The film was an unexpected delight, not just a chronicle of this remarkable story, but also a 20-year history of the city's development, gentrification and still-thriving arts scene.\n\nWe got to meet Jeremy Workman, the director, and also (get this) Michael Townsend, the artist who engendered the project, who had been permanently banned from the mall, and just that very day was finally let back in!\n\nTownsend and his friends documented the process with an old-school video camera, over years, so you got to see the whole story develop. Hauling in a thousand pounds of cinder blocks to build a wall, couches, an enormous credenza from the Salvation Army, right past security — madness. (Townsend even said they had wood flooring and a water tank for showers and washing waiting there, but couldn't get it installed before they got busted!)\n\nCan't recommend this film too highly, what a surprise, I'm still giggling to myself about it! It's in national release now … if you can get to where it's playing, I think it's well worth seeing.",
        "upvotes": 49,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1jifv0b/saw_the_providence_ri_premier_of_the_new/"
    },
    {
        "id": "1jitn41",
        "author": "Bennett1984",
        "title": "LOVE, CHARLIE: THE RISE AND FALL OF CHEF CHARLIE TROTTER - OFFICIAL TRAILER",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sQoTO5wuqTUgWx695UWYQoxA726lAcabKn63OlrNMfo.jpg?auto=webp&amp;s=37683f4200fd2f0f5dbf947c06e7b464b2776c1d"
        },
        "permalink": "/r/movies/comments/1jitn41/love_charlie_the_rise_and_fall_of_chef_charlie/"
    }
]