[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 8,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1mcqw77",
        "author": "AutoModerator",
        "title": "Megathread: The new UI update",
        "content": "Due to how prevalent these posts seem to be, discuss here!",
        "upvotes": 102,
        "comments": 318,
        "media": null,
        "permalink": "/r/netflix/comments/1mcqw77/megathread_the_new_ui_update/"
    },
    {
        "id": "1mmpw4i",
        "author": "tzt1324",
        "title": "Why is Netflix recommendation feature so bad?",
        "content": "Why is Netflix recommendation feature so bad? The entire navigation is a bad experience. It feels like the same shows and movies are recommended over several categories. And at the same time it is very difficult to find something to watch. Sometimes I spend more time searching than actually watching anything",
        "upvotes": 45,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1mmpw4i/why_is_netflix_recommendation_feature_so_bad/"
    },
    {
        "id": "1mmxwg1",
        "author": "Shaggy214",
        "title": "Your device isn’t part of the Netflix Household for this account",
        "content": "Your device isn’t part of the Netflix Household for this account. I am the only user using the account and I am getting this message on my PC while on my home network. What is going on?",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1mmxwg1/your_device_isnt_part_of_the_netflix_household/"
    },
    {
        "id": "1mmsveh",
        "author": "Antique-Salad-9249",
        "title": "Love Life. Why is no one talking about the show?",
        "content": "Just came across Love Life, which was released in 2020 and had two seasons. I’ve binge watched both of them and I thought they were both really great. Very realistic in terms of talking about dating lives and emotions and difficulties that arise. I also love that it was shot in NYC where I live. I have never heard of this show before and I’m a pretty picky person, but I thought it was fantastic with the exception of a few unrealistic scenes/occurrences in the series. It also had some really great people in it, namely Anna Kendrick, Jessica Williams, and Ego Nwodim. What are you guys think?",
        "upvotes": 11,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1mmsveh/love_life_why_is_no_one_talking_about_the_show/"
    },
    {
        "id": "1mmzsc2",
        "author": "Snowiiseal",
        "title": "Could a cancelled show still be worked on?",
        "content": "If a show were to be pitched and then picked up by Netflix and then cancelled, could it still be worked indie or via another studio? Or not cus legal reasons?",
        "upvotes": 2,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1mmzsc2/could_a_cancelled_show_still_be_worked_on/"
    },
    {
        "id": "1mmtwze",
        "author": "Spirited-Region-2611",
        "title": "Americas sweethearts season 2 felt so different.",
        "content": "I loved how magical the first season felt. It was a sort of polished docuseries that shown how mostly great being a cheerleader was. But season 2 felt like it didn’t really have direction and was slightly more dramatic and crafted. Hopefully they don’t run the brand into the ground, making it a produced dramatic reality show. ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mmtwze/americas_sweethearts_season_2_felt_so_different/"
    },
    {
        "id": "1mlvmcg",
        "author": "Old-Word6338",
        "title": "Does anyone else not like the Wednesday series on Netflix?",
        "content": "I’ve always been a big Addams Family fan, so when Netflix announced the Wednesday series, I was super excited. I didn’t expect it to be exactly like the old Addams Family. I knew it would have its own twist, but it just feels off.\n\nI honestly didn’t like the acting. It looks weird and unnatural, not in the charming, spooky Addams Family way, but in a “this doesn’t feel believable” way. The makeup doesn’t look good either, and instead of adding to the atmosphere, it makes the characters look kind of awkward.\n\nThe plot also feels too childish, like it’s trying to be edgy but still ends up being a teen drama without much depth. The detective/thriller angle is actually a good idea in theory, but the execution feels… meh.\n\nIt’s below the quality I usually expect from Netflix’s big series, and it’s disappointing because it could have been amazing.\n\nIs it just me? Or did anyone else go in with high hopes and come out feeling… meh?",
        "upvotes": 551,
        "comments": 180,
        "media": null,
        "permalink": "/r/netflix/comments/1mlvmcg/does_anyone_else_not_like_the_wednesday_series_on/"
    },
    {
        "id": "1mm45d5",
        "author": "Tall_Eye4062",
        "title": "The quality of Netflix's documentaries has been dropping.",
        "content": "Considering their recent price hike, documentaries should be getting better, not worse. Jerry Springer: Fights, Camera, Action was only 2 episodes and was super surface-level. They didn't even mention Steve, who was a big part of the show. Then you have Surviving Black Hawk Down, a 3 episode documentary that had Army Rangers using full auto M16A2s (The A2 doesn't have auto, just semi and burst). The 2001 movie did a better job of telling the story than the documentary.",
        "upvotes": 139,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1mm45d5/the_quality_of_netflixs_documentaries_has_been/"
    },
    {
        "id": "1mmzu3p",
        "author": "Appropriate_Sail7313",
        "title": "Price increase",
        "content": "I joined Netflix {because my daughter refused to pay 7 bucks extra for me to watch Kdramas!!} I did watch heaps then Netflix threw me off!!\n\nDate joined 9.6.25 2 months ago. Now I have been advised that there will be a $1 increase in September for me to enjoy more viewing pleasures??? \n\nI get the adds and honestly, they don't bother me at all so I'm not sure why the price is increasing after a short time. I pay $7.99 P/M now.",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mmzu3p/price_increase/"
    },
    {
        "id": "1mmzecc",
        "author": "Dramatic-Loan9673",
        "title": "Add extra member or new membership",
        "content": "Should I pay someone with an existing membership the $7 to add on as an extra member on their account or pay for a an entire new membership. I'd be watching on an amazon fire TV in a location separate from the owner of the account I'd be added to. Just didn't know if this worked before I did it.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mmzecc/add_extra_member_or_new_membership/"
    },
    {
        "id": "1mme9qo",
        "author": "Longjumping_Land_977",
        "title": "Brad Bradley has shared details of all the tips the family has had since Amy Bradley Is Missing came out",
        "content": "",
        "upvotes": 18,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1mme9qo/brad_bradley_has_shared_details_of_all_the_tips/"
    },
    {
        "id": "1mmivc4",
        "author": "cooconnor",
        "title": "What is a show I should binge that was originally released between 2000 and 2010?",
        "content": "I’m home with a new baby and I like this decade of shows released.   Have done a LOST rewatch and ER in the last year.  Many seasons/ep’s is fine!  Even shows that started before 2000 but went into this decade are worthy of recommendation. Thank you! ",
        "upvotes": 10,
        "comments": 93,
        "media": null,
        "permalink": "/r/netflix/comments/1mmivc4/what_is_a_show_i_should_binge_that_was_originally/"
    },
    {
        "id": "1mmx87p",
        "author": "BigHugeSnake",
        "title": "Subtitles showing up for on-screen text.",
        "content": "For example, a movie might have a text that says when and where it's taking place like \"New York, 1985\" or whatever and subtitles will pop up saying the exact same thing I'm already reading. \n\nI have all subtitles off unless what I'm watching isn't in English so I don't understand why it's doing this. Any idea how to turn it off?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mmx87p/subtitles_showing_up_for_onscreen_text/"
    },
    {
        "id": "1mmqu0n",
        "author": "langaisgayasf",
        "title": "Fantastic beasts",
        "content": "Why did they only add the first 2 movies? The third movie is as important and its really annoying that they didnt add it. Im not sure if theyll add it later on since the two movies are recently added but i hope they do bc now i feel wrong finishing the second movie when the third one isnt even here to watch. And please dont say 'just read the books' 🥹 i wanna watch the third movie and i dont use websites either + the website my friend said is the safest doesnt have fantastic beasts anw💔 ok so technically my post isnt really important but i just wanted to complain.. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mmqu0n/fantastic_beasts/"
    },
    {
        "id": "1mm6j7j",
        "author": "ToonAdventure",
        "title": "ONE PIECE: Season 2 | First Look | Netflix",
        "content": "",
        "upvotes": 43,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mm6j7j/one_piece_season_2_first_look_netflix/"
    },
    {
        "id": "1mmvonr",
        "author": "Watchhistory",
        "title": "Waterfront",
        "content": "Soapy, trashy, melodramatic, a bingeable mess! Drug trafficking jerks fighting over domination in the waters of NC's Outer Banks, all rich and glamorous.\n\nPure escapism because drug slinging is one way to avoid dealing with nazi takeover, because drug traffiking was going on  long before this, is going on now, and will be going on the heat death of the earth.  So escapism, so pulling for some characters, sort of-- coz, FAMILY! -- while other characters are the truly bad bad guys -- who also, hmmm, oddly behave like the current muck-muck$, etc., melting down with tantrums when their very smart plans don't work, who believe torture is great fun, think calling people by a variety of stupid nicknames instead of their names is a great tactic to score points in domination, and it makes for great laffs, just like being psychopathic is a great character to be -- the most funsies ever.\n\nOne does rather enjoy seeing such muck-muck get theirs, one must admit.\n\nRecommended.",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mmvonr/waterfront/"
    },
    {
        "id": "1mmdldp",
        "author": "Exciting_Event_7024",
        "title": "Did Netflix just get more expensive in Australia",
        "content": "",
        "upvotes": 10,
        "comments": 19,
        "media": null,
        "permalink": "/r/netflix/comments/1mmdldp/did_netflix_just_get_more_expensive_in_australia/"
    },
    {
        "id": "1mmuw7l",
        "author": "jpcrypto",
        "title": "Commercial free?",
        "content": "I'm NOT on a commercial-free account. I'm on the standard account with commercials. I just got through watching Supergirl and Lost in Space (2 hours of watching) and just realized I haven't seen a single commercial the whole time! Are we having some sort of commercial-free weekend or something?\n\nEDIT: I'm on the Verizon Netflix/Max $10/mo perk if that helps.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mmuw7l/commercial_free/"
    },
    {
        "id": "1mlxagw",
        "author": "Cool_Bath_77",
        "title": "PLEASE add a \"leaving soon\" section",
        "content": "Does anyone believe they would benefit from a \"leaving soon\" section added to the Netflix app?\nMy watchlist is so long and I am sure I miss out on watching titles because of them getting removed. If they added a \"leaving soon\" section to my watchlist (similar to Hulu's \"expiring\"), I would definitely always start on their app before watching something on my TV. If they added \"leaving soon\" for all the titles leaving Netflix, I probably would not watch any other app! \nWhat are your thoughts on this? Do you ever think how great it would be to have a \"leaving soon\" section added to the app or to the filter on the Netflix Mobile app?",
        "upvotes": 109,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1mlxagw/please_add_a_leaving_soon_section/"
    },
    {
        "id": "1mllxlr",
        "author": "Legitimate_Ad3625",
        "title": "As Stephen Colbert Signs Off For Summer Hiatus, He Says: “Netflix, Call Me I’m Available In June”",
        "content": "",
        "upvotes": 446,
        "comments": 40,
        "media": null,
        "permalink": "/r/netflix/comments/1mllxlr/as_stephen_colbert_signs_off_for_summer_hiatus_he/"
    },
    {
        "id": "1mm88x2",
        "author": "Top-Three-USA",
        "title": "Netflix Renews Live-Action “One Piece” for Season 3; Drops First Look at Season 2",
        "content": "",
        "upvotes": 18,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1mm88x2/netflix_renews_liveaction_one_piece_for_season_3/"
    },
    {
        "id": "1mmpvbi",
        "author": "Bright-Tomatillo-391",
        "title": "Series with a small town vibe/not NYC, LA…",
        "content": "Hi, im looking for a serie similar to the breaking bad, sons of anarchy, mayor of Kingstown kind of vibe… does anyone have any tips? I don’t want it to be displayed in a big city like New York och something but more in a small town… \nPlease help! 🙏",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1mmpvbi/series_with_a_small_town_vibenot_nyc_la/"
    },
    {
        "id": "1mmldno",
        "author": "ProfessionalNews2399",
        "title": "Why is my subtitles like this even though they were working before",
        "content": "They were working last episode and now they changed to that color and google was no help at. And I tried everything resetting it closing the app I’m on PlayStation btw ",
        "upvotes": 0,
        "comments": 6,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/zk0z6rlxm7if1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mmldno/why_is_my_subtitles_like_this_even_though_they/"
    },
    {
        "id": "1mmig6r",
        "author": "cynicalspinster21",
        "title": "Renewed my subscription and need suggestions.",
        "content": "Hi All, as the title suggests I recently renewed my netflix subscription after a year and need suggestions on what to watch.\n\nMy favorite genre is Thriller, mystery, adventure, comedy,romcom. Not a big fan of heavy dramas but comedy with a hint of drama is also great.\n\nAlso I am a binge watcher type and some of the  shows I loved in the past: Derry Girls, Travelers, \nBlacklist, Dark and all the usual cult comedies.\n\nPlease suggest some of your recent favorites as I have mostly watched all the cult classics.Thanks.\n",
        "upvotes": 1,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1mmig6r/renewed_my_subscription_and_need_suggestions/"
    },
    {
        "id": "1mmbb9e",
        "author": "FitAbalone736",
        "title": "Is Wednesday Season 2 good and worth watching?",
        "content": "\nTell me without spoilers please. I watched the first season and enjoyed it. It wasn’t like the best show ever but I enjoyed it enough to finish it. I liked all the plot twists and turns. Just wanted to get some insight from people who have seen this new season of Wednesday. Also feel free to add a brief synopsis of the plot in your comment without spoiling it please.",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1mmbb9e/is_wednesday_season_2_good_and_worth_watching/"
    },
    {
        "id": "1mlmo7a",
        "author": "ysleez",
        "title": "Unbelievable- Netflix mini series, most underrated true crime series",
        "content": "If you love shows like Mindhunter, slow paced true crime show with a lot of emotions, I'm sure you'll love this. The story really gets you to feel how upset and helpless Marie (Kaitlyn Dever) gets and it's a great performance by her as well. But you have to hold your patience, there's some unnecessary stuff tho.",
        "upvotes": 64,
        "comments": 17,
        "media": null,
        "permalink": "/r/netflix/comments/1mlmo7a/unbelievable_netflix_mini_series_most_underrated/"
    },
    {
        "id": "1mmj3r0",
        "author": "Realistic-Bread-9544",
        "title": "Wednesday",
        "content": "\n\nWhat do you guys think about the first part of season 2 for this show? Personally, I feel like it’s been quite an interesting ride so far. The plot seems to have picked up in pace compared to season 1, and there’s a lot more tension and drama building up between the characters. I’ve noticed that the writing feels sharper, and some of the storylines are finally starting to pay off after being set up earlier in the series. The new characters they introduced have also brought fresh energy and unexpected twists, which keep things exciting. Of course, there are still a few moments where the pacing slows down, but overall, it feels like the show is heading in a strong direction. I’m curious to hear whether you think the changes have improved the series or if you prefer the way season 1 unfolded.\n",
        "upvotes": 0,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/2dxt7vkz57if1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1mmj3r0/wednesday/"
    },
    {
        "id": "1mm7wxz",
        "author": "CauliflowerHuman7318",
        "title": "Netflix (on windows laptop) keeps rewinding on its own every 30 seconds, please help",
        "content": "As stated, Netflix keeps rewinding every 30 seconds, and I can't seem to fix it. I've tried uninstalling and reinstalling the app and lowering the frame rate, but neither of those things worked. Because I am using a Windows laptop, the app opens through edge as a website rather than an actual application, so I'm thinking maybe it has something do with Microsoft Edge. If anyone has any solutions, please let me know what I can do to fix this problem!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mm7wxz/netflix_on_windows_laptop_keeps_rewinding_on_its/"
    },
    {
        "id": "1mlwzik",
        "author": "Saladee_7",
        "title": "My life with the Walter boys",
        "content": "Just watched the first episode of this show. I’ve been avoiding it for the longest because I’m already exhausted with a certain other show with a similar plot (there are many shows with a similar plot). I’m tired of high school shows in general if I’m being honest. Anyways…I randomly started watching episode one and so far this has been everything I’ve feared. This show is basic, vanilla, run-of-the-mill love triangle, cringe, stiff, predictable, most boring thing ever. This show is for 14 year olds. I couldn’t even get through the first episode and this show is getting a whole other season?! Thaaaaats crazy. ",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1mlwzik/my_life_with_the_walter_boys/"
    },
    {
        "id": "1mm1b43",
        "author": "HieronymusGER",
        "title": "Looking for dumb shows like Hack my home or Instant Dream Home",
        "content": "Cant stop rewatching those shows to save my life...Is it cake kinda hits the same spot for me. Does anyone else have similar recommendations? Disney Plus or Amazon Prime are also fine",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1mm1b43/looking_for_dumb_shows_like_hack_my_home_or/"
    },
    {
        "id": "1mmiy9l",
        "author": "TheMirrorUS",
        "title": "Jennifer Lopez's marriage history as hit movie arrives on Netflix",
        "content": "",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1mmiy9l/jennifer_lopezs_marriage_history_as_hit_movie/"
    }
]