[
    {
        "id": "1ozddku",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 17,
        "comments": 277,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ozddku/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1p0agvr",
        "author": "Plane_Outside5646",
        "title": "Trent and Jude.......",
        "content": "",
        "upvotes": 311,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6sjotz0zc02g1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1p0agvr/trent_and_jude/"
    },
    {
        "id": "1p0fmlv",
        "author": "Blue_WaffIe",
        "title": "Who is elite RW today?",
        "content": "I know we haven’t figured our RW position yet. There are a lot of candidates to be a solid RW option (Rodrygo, Valverde, Guler, Brahim, Mastantuono), but so far, none are considered elite on that position.\n\nWho do you consider “elite”/significant upgrade if we signed them today? I can’t think of many options outside of Saka, Palmer, Dembele, Yamal, Olise (latter two not proven across multiple seasons). Estevao looks promising. \n\nWho else would you consider elite? ",
        "upvotes": 21,
        "comments": 48,
        "media": null,
        "permalink": "/r/realmadrid/comments/1p0fmlv/who_is_elite_rw_today/"
    },
    {
        "id": "1ozx84y",
        "author": "FergieBall_FC",
        "title": "Diario AS: Benzema: \"Return to Real Madrid? If Florentino is still there, it's possible\" | Karim Benzema remains an idol at the Bernabéu, where his memory is indelible, and he sat down with AS for an exclusive interview.",
        "content": "Diario AS: Benzema: \"Return to Real Madrid? If Florentino is still there, it's possible\" | Karim Benzema remains an idol at the Bernabéu, where his memory is indelible, and he sat down with AS for an exclusive interview. \n\nFrom José Félix Díaz \n\nFull Writeup: \n\n**Karim Benzema welcomed** ***AS*** **to Al Ittihad’s training complex in Jeddah.** Ahead was a long, relaxed conversation with the leader of the reigning Saudi Pro League and cup champions. When he signed his contract – which runs until June 30 next year – he promised to take the team to the top. He has delivered. \n\nNow comes the moment to talk and make decisions, because one thing the former Real Madrid striker is sure of is that he wants to keep playing.**“I’m 38. I feel good and motivated to keep going for two more years,”** the Frenchman says, and so much more... \n\n**How is life here in Jeddah?** \n\n“Very good, normal, like in Madrid. I really like the country. It opens up more every year and more people come. I think that’s very important for Jeddah and for Saudi Arabia. It’s not just football – there are good restaurants, beaches, plenty to do.\" \n\n**What does Saudi Arabia mean to Karim Benzema? Let’s not forget that along with Cristiano Ronaldo, you helped set a trend in Saudi football…** \n\n“Saudi Arabia needs players like Cristiano, like me, like others who’ve come to bring them some of what we have in Europe. We have to show the kids here what it takes so they can move to other clubs. It’s a country that’s opening up. People are very respectful day to day. It’s a very good place for me.” \n\n**League, Cup – you’ve made history with Al Ittihad.** \n\n“Yes, I think this club likes that, pushing itself. It has that mentality of doing beautiful things in football. The fans are incredible – every match they’re there, home or away. That’s very important for us. Last year we won the King Cup and the league. It was a very good moment, a special one for everyone.\" \n\n**Do you feel like the leader of the team?** \n\n“I’m here for that, but always to help my teammates. If I’m at my best, it’s because they allow me to be at my best. Scoring goals is the job of all of us. I can help them with advice on or off the pitch, help them improve and maybe one day move to other teams as well.” \n\n**Do you feel valued?** \n\n“Yes, a lot. When I signed I had just won the Ballon d’Or. It wasn’t the end of my career – I wanted to play, keep playing and enjoy football. I feel very good in this club. The fans are great, the boys want to work. Those are things I really appreciate every day.\" \n\n**And the fans? What are they like?** \n\n“I feel very appreciated by them. You feel it in every stadium. They’re always with you. They give you confidence.” \n\n**After so many years at the top, do you still have goals?** \n\n“To keep scoring, playing, creating plays, giving people emotion. Not just in Saudi Arabia but in the whole football world. Every time I step on the pitch, I want people to feel that. I like doing special things even in training.” \n\n**Zidane is being mentioned as the next France coach…** \n\n“I think he has everything to be there. He proved it at Real Madrid. There’s another coach now, but in my view Zizou is number one.” \n\n**Would Benzema return to the French national team?** \n\n“The national team feels a bit far away, but you never know. I focus on what I have now. \n\n**Time passes; you’re approaching three years away from Real Madrid. Is it still your team?** \n\n“It will always be my team. I still watch games when I can. It’s the best club in the world. It always has been and always will be. It’s a team with huge potential and I think it can do more than it’s doing right now.” \n\n**More? In what sense?** \n\n“I like this Real Madrid. There’s always talk, but that’s how it is. If they draw or lose, it’s suddenly a crisis. They go from being the best team in the world to questioning the coach, this player, that one… it’s normal because it’s the best club in the world. But I like this team.\" \n\n**You shared a dressing room with Xabi Alonso. Did you see the coach in him back then?**\n\n“I remember him then the same as now as a coach. Pressure, vertical passes… a style I like. He’s only been coaching six months and he’s doing very well. Give him time.\" \n\n**Will we see Karim Benzema as a coach one day?** \n\n“I don’t know. I have friends who are already doing coaching badges and always talk to me about it, but it’s hard. Footballer or coach seems different, but the pressure is the same. It’s complicated.” \n\n**This is a Real Madrid without Kroos, Modric, Casemiro, Ramos, Benzema… a team that once seemed eternal.** \n\n“True, it seemed eternal. Many great players. Football now is different, it’s something else. There’s no point comparing. Today’s Real Madrid may have more of some things, but it lacks a leader – though sometimes in football a leader isn’t necessary. They’re young; many play for their national teams and are leaders there. They have Champions Leagues. They have to find what a leader gives.\" \n\n**He doesn’t play, but Florentino Pérez is still there.** \n\n“He’s the leader. He does an incredible job, bringing players you didn’t think would arrive. What he does with the team, with the club… he’s the best.\" \n\n**Would you return? Imagine they call you…** \n\n“For what? (laughs). He’s someone I could never say no to. Florentino is special.” \n\n**What was that day in 2009 like when he showed up at your house?** \n\n“I remember the day he came to my house in Lyon. In difficult times, in good times, when I won the Ballon d’Or – he’s always been great with me. You can’t say no to him.\" \n\n**Tell me about that day in Lyon.** \n\n“Florentino was already at my house. My agent called saying we had to meet someone. ‘No, I can’t now, I have things to do.’ He insisted. ‘Who is it?’ When he told me Florentino Pérez was there, I didn’t believe it. The man who brought Ronaldo, suddenly in my house? Of course I had to go. From that moment on, all I could think about was Real Madrid, Ronaldo, Zidane…\" \n\n**You reach your house and what was Florentino Pérez doing?** \n\n“Just being normal, visiting, sitting with my parents. I was in shock but he was relaxed, speaking French with them.” \n\n**Did that day seal your move to Real Madrid?** \n\n“He told me many things in French. He talked about Real Madrid, I said yes, we shook hands and…\" \n\n**And then a whole life. Good thing your phone was on, right?** \n\n“Yes, yes (laughs). That’s how it is – a whole life. Florentino is the greatest. The level Real Madrid has in every sense is because of him.” \n\n**Because of him and the players he managed to bring, right?** \n\n“He gave me everything. A lot of confidence. He always spoke to me, to my parents, in good and bad moments.” \n\n**And there were tough moments too.** \n\n“Of course. Over a career there are difficult days when no one helps you, but he was always there.” \n\n**Two weeks ago Al Nassr and Al Ittihad faced each other: Cristiano Ronaldo vs Benzema. The greeting on the pitch looked cold… you know how journalists are.** \n\n“No, please. We had already spoken in the locker room. We hugged, talked. On the field we don’t need to do it again. Why repeat it? There’s a lot of respect, we’re fine. We don’t need to show anything. We’ve learned from each other. People act like we need to perform for TV. It’s not like that. There’s respect. On the field, each of us is focused on our job.” \n\n**Few know the truth like you, and you always defend him. But what is Vinicius like?**\n\n“He’s a really good kid with a big heart, eager to learn… a phenomenon. People put a lot – a lot – of pressure on him. Some players shouldn’t have that kind of pressure. He’s still young but already has many games for Real Madrid. You can’t forget what he’s done. You can’t say he’s bad now. It’s not fair. He’s very good, but he can do more. That’s his character. He gets angry when he’s subbed. Normal. OK, he shouldn’t do it, but that’s who he is. He gestures on the pitch and off it. It’s nothing. He feels good on the pitch, thinks he can do things, wants more touches and then gets subbed. That’s why he reacts. It’s normal. It’s nothing.\" \n\n**Do you still see him as a future Ballon d’Or?**\n\n“For me, he could win it someday. It’s difficult, but he can. The day he locks in that he’s on the pitch only to play and leaves everything else aside, he can win it. He has the quality and he’s in the best place to do it – Real Madrid. There’s nowhere better.\" \n\n**The last Ballon d’Or was Dembélé, a player who also overcame difficult moments.** \n\n“He left very tough moments behind. He’s a good person, a phenomenon, a good player. What he’s done in Paris is important. He won the Ballon d’Or because he scored a lot, especially in big, decisive matches. He deserved it.” \n\n**Let’s talk Mbappé. Are we seeing the real Mbappé this season?** \n\n“He’s much better. Scoring isn’t new for him. He did it at PSG and he’ll score at Real Madrid, even more. There will be games where he barely touches the ball. What we expect from Kylian is that when he gets one chance, he scores. Real Madrid is like that. They need him in matches like Atlético, Liverpool… teams that sit deep. He has to appear, work those situations, link up with Vini. Real Madrid expects Mbappé for those moments, to bring the Champions League. I think he can do it with the other players. Not alone. He needs Vinicius, others… that’s how it is. \n\n“Vinicius, Mbappé, Rodrygo even if he doesn’t play much, Bellingham… they have to communicate. One is there to score, another to assist. We’re not going to ask Bellingham to score because that’s Mbappé’s job, and we’re not going to ask Mbappé to be a number 10 because that’s Bellingham. They need to talk. He’s better, but he has to focus more in those moments when Real Madrid needs him because he has everything to do it.\" \n\n**Isn’t it strange how players are now judged by how much they run? Do you understand that?** \n\n“It depends. Run when you have to run, when something’s missing, because when you score, no one talks about running. Run at the right moment. I’ve scored goals by pressing – it’s part of the job. I didn’t run a lot, but I did it because I know it’s Madrid. I knew when to do it, especially in Champions League games. It’s not just scoring. The goals I scored against PSG after pressing – those little things help. I think Mbappé will do it.\" \n\n**You’ve won almost everything here in Saudi Arabia, and everything at Real Madrid. Europe loves you, they idolize you.** \n\n“Right now, I’m very good here. They show me a lot of love – players, fans, coach, staff. I watch Real Madrid games, I watch the Champions League and I imagine things. The Champions League is magical. My contract is ending, that’s true. I still don’t know if I’m staying or going. It depends on many things. I turn 38 in December. I see myself playing two more years. Physically I’m good, I work hard, and I love football. I enjoy it. We’ll see what happens, what the club thinks. \n\n“I like talking face to face and hearing what they think. The best thing for me is to continue here, but not just to stay for the sake of it for another year or two. That doesn’t work for me. The level of the league is better every year. I’ve been here three years and it keeps rising. It’s true that I have options in Europe. \n\n\"I have to consider everything, choose well, see where I feel good, without forgetting that I feel very good here and receive a lot of affection. But we’ll see. They ask things of me and I give things back. It’s fifty–fifty. But there are options. I’m not going to stop playing and competing in six months.” \n\n**Return to Real Madrid even now?** \n\n“If Florentino is still there, it’s possible. We talk, and it’s possible. I’m a Madridista. I feel it inside. Madrid is still my city. I feel like a Madridista and a Madrileño. We’ll see. If he’s there…\" ",
        "upvotes": 196,
        "comments": 17,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xs_r7IlDSp-fSkWoKogwj_iCNDy9gBQos_f_zZ26e54.jpeg?auto=webp&amp;s=362fb4f831c93fc42d1e77a4a71bcffefeaec90c"
        },
        "permalink": "/r/realmadrid/comments/1ozx84y/diario_as_benzema_return_to_real_madrid_if/"
    },
    {
        "id": "1ozlp7y",
        "author": "soldier101br",
        "title": "Militão as a right back for Brasil against Senegal,art in motion",
        "content": "",
        "upvotes": 704,
        "comments": 42,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8xg0cim9mu1g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1ozlp7y/militão_as_a_right_back_for_brasil_against/"
    },
    {
        "id": "1ozohni",
        "author": "No-Independent2522",
        "title": "Tebas has weighed in on NFL game at Bernaneu",
        "content": "",
        "upvotes": 249,
        "comments": 100,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/82zvt2e84v1g1.jpeg?auto=webp&amp;s=a3006a398a864d43b056c415bb8922db6a8134ee"
        },
        "permalink": "/r/realmadrid/comments/1ozohni/tebas_has_weighed_in_on_nfl_game_at_bernaneu/"
    },
    {
        "id": "1ozee4t",
        "author": "SamuraiGamesYT",
        "title": "BREAKING: Zinedine Zidane's return! Ex-Real Madrid boss poised to become France boss after 2026 World Cup",
        "content": "As reported by AS, France intend to appoint him as their next national team manager once Deschamps completes his final tournament at the 2026 World Cup. For months Zidane has hinted that he is ready to coach again, and France have been waiting for the right moment to bring him home.\n\nSource: Diario AS, https://www.goal.com/en-in/lists/zinedine-zidane-return-ex-real-madrid-boss-poised-to-become-france-boss-after-world-cup/blt18f3fcdaf5b14969",
        "upvotes": 659,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/EuUBnYwhSFxOmysxJF3ewDt_kvBHrxf1ZSfmC9-j_aE.jpeg?auto=webp&amp;s=3db4289e54bd1eb00ce769af40aed664f7afb712"
        },
        "permalink": "/r/realmadrid/comments/1ozee4t/breaking_zinedine_zidanes_return_exreal_madrid/"
    },
    {
        "id": "1ozpf0b",
        "author": "TheFeatherDiaries",
        "title": "Montella backs Arda to become the Best Number 10 in the world : \"We knew early on how talented Arda is. We witness Arda Güler's talent every day. He's a player who has developed a lot and continues to do so. I hope he can become the best in the world in his position, because he has that potential. \"",
        "content": "",
        "upvotes": 111,
        "comments": 33,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ozpf0b/montella_backs_arda_to_become_the_best_number_10/"
    },
    {
        "id": "1oz2e1s",
        "author": "Goat23231",
        "title": "Jude was wildly loved before joining Real Madrid",
        "content": "This is just too obvious not to point out. At 19 Jude was a captain for Dortmund, Player of the Year, and started for England at the World Cup. The media praised him, and every fan base wanted him on their team. The football world loved the wonder kid and praised his leadership. The following season he joins the biggest club in the world and continues to solidify himself as a superstar. Now people disrespect his footballing abilities and question his character. Funny how quick people change their minds. \n",
        "upvotes": 1122,
        "comments": 75,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oz2e1s/jude_was_wildly_loved_before_joining_real_madrid/"
    },
    {
        "id": "1oz9b50",
        "author": "SamuraiGamesYT",
        "title": "lan Wright defends Jude Bellingham after the criticism from English media",
        "content": "Ian Weight: \"They need to create this kind of controversy because there's nothing else to say until the World Cup, so it's going to continue like this until the World Cup. They hate the fact that they can't reach him. They hate the fact that they can't negatively influence his club career like they've done with so many others before him. A young man blessed, endowed with overflowing talent and love.\"",
        "upvotes": 285,
        "comments": 43,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oz9b50/lan_wright_defends_jude_bellingham_after_the/"
    },
    {
        "id": "1ozfxar",
        "author": "DamnThatsInsaneLol",
        "title": "Would you renew the contracts of Carvajal and Rudiger?",
        "content": "Their contracts are expiring this summer, along with Alaba's. Alaba is obviously being let go, he was good for us but he's past his prime now and injury prone, not to mention he's on insanely high wages. \n\nRudi &amp; Dani are the question. Dani is also injury prone &amp; is getting up there in age, but he's a great option to have for the RB position &amp; his experience is valuable. Rudi is a great option for CB when healthy, but his form has taken a bit of a hit recently.\n\nWhat would you do if you were in charge? Renew or let go? Personally, I'd renew. Our depth at defense isn't that great, and the season is long. If they're on reasonable wages, then keep them imo.",
        "upvotes": 50,
        "comments": 55,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ozfxar/would_you_renew_the_contracts_of_carvajal_and/"
    },
    {
        "id": "1oz1nwz",
        "author": "No-Independent2522",
        "title": "Papa Flo and Rudiger share a moment at the NFL game",
        "content": "",
        "upvotes": 454,
        "comments": 30,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/anuqrudqmp1g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oz1nwz/papa_flo_and_rudiger_share_a_moment_at_the_nfl/"
    },
    {
        "id": "1ozbv21",
        "author": "AffectionateGift3560",
        "title": "Did Jude really threw a tantrum or are the English media just overeating ? (Tuchel isn't helping)",
        "content": "https://x.com/JB5Gold/status/1990166945816264858?t=gkyTCzQhq6_k3Cr2Z-VqlQ&amp;s=19\n\n This is the clip I could gather; it's only 9 seconds, but there seems to be no overreaction, and I am not trying to call Tuchel a moron, but saying he \"wasn't happy\" and then following it by saying he has to respect his decision is kind of creating an issue from thin air. Has there ever been a pro footballer happy to get subbed off? \n\nHe isn't flailing his arms or cursing or anything; he's just being normal. Like, if any other player did it, it'd be nothing worth talking about. \n\nTuchel as a manager is feeding this journalist well.  \nLook at Xabi's interview after Vini's incident. Tuchel is constantly addressing Jude in every interview in a negative light, whilst no other managers have had bad things to say. Watch Bellingham be a scapegoat if England don't succeed.\n\n(Guys, if you can, find a better link; I don't think mine works.)",
        "upvotes": 78,
        "comments": 39,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ozbv21/did_jude_really_threw_a_tantrum_or_are_the/"
    },
    {
        "id": "1oz95cr",
        "author": "supplementarytables",
        "title": "Dean Huijsen leaves Spain camp due to muscle issues, back to Madrid from Monday.",
        "content": "",
        "upvotes": 121,
        "comments": 3,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oz95cr/dean_huijsen_leaves_spain_camp_due_to_muscle/"
    },
    {
        "id": "1oymr9p",
        "author": "No-Independent2522",
        "title": "RealMadrid on X : Transforming soccer pitch for NFL",
        "content": "",
        "upvotes": 1106,
        "comments": 73,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/57p19x5fnm1g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oymr9p/realmadrid_on_x_transforming_soccer_pitch_for_nfl/"
    },
    {
        "id": "1oz0jdc",
        "author": "Small-District1345",
        "title": "SIIIUUUUU CR7 2017 Final🐐🐐🐐",
        "content": "Better days what a time. Is this the most iconic Real madrid shirt? Definitely in recent history but what about all time??? I would definitely put it up there. That side-net finish aswell always runs through my mind😂 Also the noodle hair. 100 percent goes down in history as something unheard of from a single player",
        "upvotes": 122,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oz0jdc/siiiuuuuu_cr7_2017_final/"
    },
    {
        "id": "1oyxd4m",
        "author": "Lolman4O",
        "title": "What do you think about Flofentino's plan to propose selling between 5 and 10% of the club's shares to an external investor?",
        "content": "According to several media reports, Florentino Pérez is expected to propose, at the upcoming Annual General Assembly of Members and Representatives, the sale of between 5% and 10% of the club to a foreign investor. This operation would not turn Real Madrid into a Public Limited Sports Company (SAD); instead, a parallel corporate structure would be created to accommodate the investor’s stake.\n\nFlorentino’s goal is to bring in external capital, strengthening Real Madrid’s competitiveness against “state-backed clubs” such as Manchester City and Paris Saint-Germain. Even with the investor’s arrival, the remaining 90–95% of the shares would stay in the hands of the current members. However, these member shares would no longer be freely transferable to outside individuals, being restricted to circulation only among club members.\n\nNevertheless, for the proposal to move forward, a referendum among the members is required, along with an extraordinary assembly in which the plan would be formally presented and explained.\n",
        "upvotes": 54,
        "comments": 29,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oyxd4m/what_do_you_think_about_flofentinos_plan_to/"
    },
    {
        "id": "1oyp629",
        "author": "Working_Ingenuity107",
        "title": "Why Iker Casilias is disrespected so much across football fans?",
        "content": "Hey Madridistas \nI've been supporting Real Madrid since 2017 I remember my first Real Madrid match as 10 year old kid in the middle of summer right after installing the TV the first channel instructor opened to check if antenna's working was football channel and it was replaying Real Madrid vs Juventus ucl 2017(that day I fell in love with Real Madrid and my goat CR7) final and basically ever since then I've been supporting Real Madrid so far I watched Navas(another hugely disrespected and underated goalkeeper both within our own community and broader football community) and Courtois so obviously I wasn't around or watching when Iker was playing for Real Madrid but these last several months I've been watching early 2010s late 2000s matches of both Real Madrid and Spanish nt and so far my impression was Casilias was fucking goat in every single game I've watched and in general was so much integral to Spanish success in those years saving penalty after penalty, outperforming Buffon in penalty shoutouts, making impossible saves during the game then you look at his longevity been around whole 2000s and 2010s(like until la decima)\nwon so many trophies while being one of the most important and indispensable players of his teams \n\nAnd despite all the eye-tests,longevity,accolades there are football fans who don't think Casilias belongs to the same group as Neuer or Buffon\n\nSuch a pure character Casilias seems to be; it's unfortunate that his peak years coincided with Real Madrid's galacticos failure and one of worst periods in the club (2005-2010 especially) which had visible impacts on his stats(like clean sheets and so on) \nRegardless I definitely believe Iker Casilias is one of greatest goalkeepers(like at least top 5) of all time and by far the greatest goalkeeper of Real Madrid \n\nThank you all for your time\n",
        "upvotes": 75,
        "comments": 64,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oyp629/why_iker_casilias_is_disrespected_so_much_across/"
    },
    {
        "id": "1oyhzaf",
        "author": "Critical-Remove-1878",
        "title": "A crazy stat about our recent season that nobody talks about:",
        "content": "We're in mid November and we have won every single one of our home games in all competitions (6 in La Liga, 2 in the UCL). With the amount of negativity after our recent games, nobody even talks about how good we've been in general under Xabi.\n\nThe last time we did something similar was back in... 2011/12 season, under Mourinho. For context, Nacho had only played a couple of games for RM back then. We still had 9 UCLs, Ronaldo had 1 Ballon d'Or and Mastantuono was 4 years old. Legendary managers like Zidane or Ancelotti have never managed to win all their home games early in the season.\n\nThe 11/12 run stopped in December 10th, when we lost the Clasico at home. Considering we have 4 away games in a row, if we win against Celta and Man City in December, we can do even better.\n\nIdk about you, but I'm pretty positive about this season and Xabi in general. We're already much better in \"smaller\" games than we used to be in recent years, and that's where we usually struggled and dropped points in La Liga. Slowly we'll improve in bigger games too, we already won against Barcelona after 4 defeats in a row.\n\nHala Madrid!",
        "upvotes": 89,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oyhzaf/a_crazy_stat_about_our_recent_season_that_nobody/"
    },
    {
        "id": "1oxuhg9",
        "author": "o6ohunter",
        "title": "Alternate angle of THAT Vinicius Junior goal",
        "content": "",
        "upvotes": 1605,
        "comments": 82,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kuf5o3ltvf1g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oxuhg9/alternate_angle_of_that_vinicius_junior_goal/"
    },
    {
        "id": "1oy2rar",
        "author": "soldier101br",
        "title": "\"Militão is on a spetacular phase\" says Real Madrid legend and former coach,Carlo Ancelotti,on the post match Win of Brasil against Senegal",
        "content": "Transcription:\" i think that the duo Militão and Estêvão worked very well on the right side of the field, Militão is on a spetacular condition,physical and also mental,i believe that,2 years without playing have made him mature a lot on the mental aspect,and with that attitude,he can play in every position,back as a right back. The team was very solid at the back,and for that we're satisfied\" ",
        "upvotes": 311,
        "comments": 27,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/j1pw5jiwih1g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oy2rar/militão_is_on_a_spetacular_phase_says_real_madrid/"
    },
    {
        "id": "1oxsqa1",
        "author": "H4rryTh3K1ng",
        "title": "I hate the international break",
        "content": "Every time we have this stupid break, we always get injuries. We have Mbappe with an ankle issue and now dean is also injured. That screws us over for the next few games that we have. FIFA always so stupid for making these breaks because they are so unnecessary and always screws us over in the end. Courtois and Fede also have an issue. I’m nervous on how xabi will handle the mid season injury wave that happens every year. ",
        "upvotes": 136,
        "comments": 107,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oxsqa1/i_hate_the_international_break/"
    },
    {
        "id": "1oxttmu",
        "author": "soldier101br",
        "title": "Vini Jr.,Rodrygo,Militão and Casemiro starts for Brasil against Senegal",
        "content": "As previously commented,Vini,Rodrygo,Mili and Case were set to start against Senegal according to Very reliable news outlets. The game Will take place on Arsenal Stadium,as previously saw in other games of the seleção in London. Former players From real Madrid Danilo and Fabinho are also in the bench to be avaliable for the legend and former real Madrid coach and current Brasil coach,Carlo Ancelotti. Any questions or further news i'll Bring up in the coming hours.",
        "upvotes": 90,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1w7t8o5wqf1g1.png?auto=webp&amp;s=6e7cabe22a13f28b09ad30f73e9681c0a52c50d4"
        },
        "permalink": "/r/realmadrid/comments/1oxttmu/vini_jrrodrygomilitão_and_casemiro_starts_for/"
    },
    {
        "id": "1oy8yhh",
        "author": "Pandread",
        "title": "What is the best place to find/watch archived matches?",
        "content": "Is there a place to stream or download them?  There are so many classics and wanted to know how people are doing this currently?\n\nIdeally I would download them so I can watch any time later but if the best I can do is streaming then I will take that. \n\nI know there are torrents but finding old matches has proved difficult. ",
        "upvotes": 12,
        "comments": 6,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oy8yhh/what_is_the_best_place_to_findwatch_archived/"
    },
    {
        "id": "1oxswdz",
        "author": "o6ohunter",
        "title": "It is just crazy to think about just how differently everything could've gone if Kroos didn't retire last year",
        "content": "The bastard. \"I want to retire while I'm still at my peak.\" Bro forgot the other half of the graph. He still had easily multiple seasons left at the top level in him but chose to secure his aura and legacy forever. I can't blame or fault the man, but I can miss him. His coolness on the ball, switch of plays, the way he'd orchestrate the offense. And then you add on the fact he left the same season we signed one of the most deadliest players to have on the end of a through ball.\nI don’t even know if this type of post is allowed. Anyone else just miss Kroos?",
        "upvotes": 78,
        "comments": 53,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oxswdz/it_is_just_crazy_to_think_about_just_how/"
    },
    {
        "id": "1oxtht8",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [2]-0 CP Cacereño - César Palacios penalty 85'",
        "content": "",
        "upvotes": 53,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t70c7mc6of1g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oxtht8/real_madrid_castilla_20_cp_cacereño_césar/"
    },
    {
        "id": "1oxndww",
        "author": "Sneijder4BallondOr",
        "title": "Iván Zamorano goal against Barcelona [Jan 30, 1993]",
        "content": "",
        "upvotes": 146,
        "comments": 4,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/18pmoczi2e1g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oxndww/iván_zamorano_goal_against_barcelona_jan_30_1993/"
    },
    {
        "id": "1oxtlcu",
        "author": "scoreboard-app",
        "title": "Match Thread: FC Barcelona vs Real Madrid Live Score | Primera Division Women 25/26 | Nov 15, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1oxtlcu)",
        "upvotes": 39,
        "comments": 36,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oxtlcu/match_thread_fc_barcelona_vs_real_madrid_live/"
    },
    {
        "id": "1ox3ow4",
        "author": "WhiteWolf_08",
        "title": "Xabi Alonso after Mbappe's Injury:",
        "content": "",
        "upvotes": 1439,
        "comments": 41,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sw0um056i91g1.jpeg?auto=webp&amp;s=d6bcaa26fb5e814c381e84e23404a29524226092"
        },
        "permalink": "/r/realmadrid/comments/1ox3ow4/xabi_alonso_after_mbappes_injury/"
    },
    {
        "id": "1oxtbx4",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [1]-0 CP Cacereño - Álvaro Ginés 78'",
        "content": "",
        "upvotes": 24,
        "comments": 7,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0epycif0nf1g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oxtbx4/real_madrid_castilla_10_cp_cacereño_álvaro_ginés/"
    }
]