[
    {
        "id": "1hmfpsf",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Nosferatu / a Complete Unknown / Babygirl / The Fire Inside / The Order)",
        "content": "# New Theatrical Releases\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n[Nosferatu](https://old.reddit.com/r/movies/comments/1hmffh4/official_discussion_nosferatu_2024_spoilers/?)\n\n[Babygirl](https://old.reddit.com/r/movies/comments/1hmffj8/official_discussion_babygirl_spoilers/?)\n\n# Streaming Releases\n\n[The Order](https://old.reddit.com/r/movies/comments/1hlsi4b/official_discussion_the_order_spoilers/?) on VOD\n\n[Juror #2](https://old.reddit.com/r/movies/comments/1hjiwvb/official_discussion_juror_2_spoilers/?) on MAX\n\n# Still in Theaters\n\n[Sonic the Hedgehog 3](https://old.reddit.com/r/movies/comments/1hiae45/official_discussion_sonic_the_hedgehog_3_spoilers/?)\n\n[Mufasa: The Lion King](https://old.reddit.com/r/movies/comments/1hiae58/official_discussion_mufasa_the_lion_king_spoilers/?)\n\n[Wicked: Part 1](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/)\n\n[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/)\n\n[Kraven the Hunter](https://old.reddit.com/r/movies/comments/1hd2v8v/official_discussion_kraven_the_hunter_spoilers/?)\n\n[The Lord of the Rings: The War of Rohirrim](https://old.reddit.com/r/movies/comments/1hd2vab/official_discussion_the_lord_of_the_rings_the_war/?)",
        "upvotes": 50,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hmfpsf/official_discussion_megathread_nosferatu_a/"
    },
    {
        "id": "1hgbyi3",
        "author": "LosFrikis",
        "title": "Hey /r/movies! We’re Tyler Nilson and Michael Schwartz, writers/directors of LOS FRIKIS and PEANUT BUTTER FALCON! LOS FRIKIS is out 12/20 in LA+NY and 12/25 in other cities. Ask us anything!\n",
        "content": "",
        "upvotes": 44,
        "comments": 47,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lnz131ri6f7e1.jpeg?auto=webp&amp;s=541a37cc1e59700c3a5f184c5086fd7ec0c3ac6e"
        },
        "permalink": "/r/movies/comments/1hgbyi3/hey_rmovies_were_tyler_nilson_and_michael/"
    },
    {
        "id": "1hnuy4c",
        "author": "MarvelsGrantMan136",
        "title": "Olivia Hussey Dies: ‘Black Christmas’ &amp; ‘Romeo and Juliet’ Star Was 73",
        "content": "",
        "upvotes": 4422,
        "comments": 262,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Uwpe1ioERwTXdV5YoJNwGS42vOjjAx4ZXEWmcVXhImI.jpg?auto=webp&amp;s=a1e1711311048f506ae56b688ef8bfe3c4d26d9f"
        },
        "permalink": "/r/movies/comments/1hnuy4c/olivia_hussey_dies_black_christmas_romeo_and/"
    },
    {
        "id": "1hnpft7",
        "author": "sdfddfdaa",
        "title": "I need film to make a grown man cry.",
        "content": "Ok so... I (17) made a bet with my dad (old) to make him cry within 3 movies. It all started when I showed him and my mom a movie that came out a while ago, Look Back. Both my mom and I cried over it, but he didn't shed a tear, which got me thinking... I don't think I've seen him cry during a movie like EVER... Don't get me wrong he still liked the movie and said it DID \"move him\", I just need something to push him over the edge of tears, yk? What he told me It's apparently honest stories about strong friendships or true love that make him cry, also nothing like purposeful tearjerker (ex: Titanic). Any recommendations? He doesn't discriminate, so can be pretty much anything.\n\nBtw he cried over Futurama, to be exact the part where Leela and Fry read their future together, but that's like the only example I have...",
        "upvotes": 11184,
        "comments": 17736,
        "media": null,
        "permalink": "/r/movies/comments/1hnpft7/i_need_film_to_make_a_grown_man_cry/"
    },
    {
        "id": "1ho6mzf",
        "author": "BunyipPouch",
        "title": "I saw 298 movies in theaters in 2024. Here is my full ranking.",
        "content": "Every year I try to go to the movies as much as possible. It’s my favorite thing to do. I keep track of my thoughts/scores throughout the year, along with all of my ticket stubs. In theaters, I saw: 5 movies in 2015, 9 movies in 2016, 146 movies in 2017, 162 movies in 2018, 192 movies in 2019, 44 movies in 2020, 86 movies in 2021, 270 movies in 2022, 325 movies in 2023, and 298 movies this year. This doesn’t include rewatches, but those are pretty rare for me (7 this year). This is my 7th year doing this ranking on /r/movies. \n\nI have a subscription with AMC’s A-List, Regal’s Unlimited, and Cinemark’s MovieClub. I’m also a member of the Fort Lauderdale, Miami, and Toronto film societies. \n\nI attended 8 film festivals this year, for a total of 117 films. I attended 24 World Premieres, 11 North American Premieres, 7 US Premieres, 10 East Coast Premieres, 22 Southeast Premieres, 4 Canadian Premieres, and a few Florida/Georgia Premieres. \n\n96 of my screenings had cast and/or crew present for Q&amp;As/intros.\n\nI do these rankings and reviews/random thoughts for fun. It’s not meant to be taken super seriously. I just like movies, and I like ranking them.\n\n----------------------------------------------------------------------------------------------------------\n\n**Red Rooms** - 10/10 - The most gripping psychological-thriller since *The Girl with the Dragon Tattoo*.  Extremely disturbing and unsettling at times, but also stylish and sleek. The courtroom scenes and vampire-movie-like score stick with you for a long time. Juliette Gariépy puts in the best performance of anyone this year. There's so much amazing stuff happening with French-Canadian cinema recently and this is another great addition. Best movie of the year. One of the best movies of the past decade.\n\n**Dune: Part Two** - 9/10 - Sci-fi doesn't get much better than this. I have the seemingly-unpopular opinion that the first movie is better than the second, but both are near-perfect. Everything that can be said about Dune 1/2 has pretty much already been said. \n\n**Anora** - 9/10 \n\n**Civil War** - 9/10 \t\n\n**Nosferatu** - 9/10 - Gothic horror is so back. Lily-Rose Depp does things in this movie physically that I've never seen before on the big screen. Extremely impressed with her performance (and with Hoult/Dafoe/Skarsgard/Corrin as well). A great ensemble surrounded with perfect set design, direction, and cinematography. Loved the scenes in the castle that almost appeared black-and-white. Robert Eggers has not missed for me so far, and this is my favorite of his.\n\n**Challengers** - 9/10\n\n**Sing Sing** - 9/10 - Colman Domingo, give that man his Oscar [John Malkovich Rounders voice].\n\n**The Substance** - 9/10\n\n**You Are Not Alone** - 9/10 -\tPart La La Land, part Under the Skin, part Eternal Sunshine. A beautiful and hypnotic sci fi love story with a slight horror edge and with layers upon layers of metaphor.  It has a lot of interesting things to say about mid-20s loneliness/thoughts of suicide/love/etc.\n\n**Didi** - 9/10 -  I'm a sucker for coming-of-age dramas set in recent times. Give me more of this and mid90s-type movies pls.\n\n**The Order** - 8/10\n\n**We Live In Time**\t- 8/10 - I went in expecting heartbreak (which I got), but I didn’t expect how funny/sharp it would be. Florence and Andrew have 10/10 chemistry. Only thing keeping it from a higher score is the goofy Super Bowl of Food or whatever scene near the end. The scene at the beginning in the parking garage might be one of the most heart wrenching and well-acted scenes of the entire year. Top-tier score as well.\n\n**Love Lies Bleeding** - 8/10 - I would watch a 2-hour movie montage of Katy O'Brian working out beneath a highway underpass. A violent &amp; twisted mess of sweat/blood/sex/tears/ungodly bodily noises. A real wicked fun time.\n\n**The Goldman Case** - 8/10 - French courtroom dramas, so hot right now. An insanely smart and water-tight screenplay with engrossing performances. It reminded me a lot of Anatomy of a Fall then I realized the co-star (Arthur Harari) in this film is the co-writer of Anatomy.\n\n**The Beast** - 8/10 - A movie that's almost impossible to describe but I'll try: Dystopian-future-sci-fi, period-drama, modern-incel-breakin-thriller, all while staying completely original and beautiful. Extremely layered story and performances. Lea Seydoux and George MacKay are 2 of my favorite actors and they pulled this off with extreme precision and care. One of more harrowing final scenes of the year for sure. \n\n**Conclave** - 8/10\n\n**Saturday Night** - 8/10 - Frenetic, engaging, and a really fun time. Flies by. I wanted more. So much energy.\n\n**September 5** - 8/10\n\n**The Brutalist** - 8/10 - I have some problems with the ending, feels like it undid a lot of what was experienced, but otherwise an impressive monster of a movie. Brody and Pearce are outstanding.\n\n**Io Capitano** - 8/10\n\n**Fremont** - 8/10 - I love movies that flow like light poems, like Petite Maman or Journey to A Mother's Room. It was a very sweet and cozy. The psychiatry sessions in particular were hilarious, and the bit where the diners are reading their fortunes in the restaurants were perfect. One of my favorite lines of the year is when the old lady fortune cookie writer dies at her desk, and the boss says “she was getting too old to write about the future anyway”. The lead and Jeremy Allen White were only onscreen together but their chemistry was infectious\n\n**Seagrass** - 8/10\n\n**LaRoy, Texas** - 8/10 - A hilariously-dark Coen Brothers throwback with wonderful performances from Steve Zahn and John Magaro (who I was lucky enough to meet prior to the screening). It's bloody and smart, and that's a rare combination.\n\n**A Quiet Place: Day One** - 8/10\n\n**The Last Showgirl** - 8/10 - Apart from a few awkward line-deliveries and questionable dialogue in spots, this was a very lowkey, engaging drama with a career-best performances from Pamela Anderson and Dave Bautista. Very dreamy and light.\n\n**Friendship**\t- 8/10 - It's so fucking stupid. Absolutely no plot to speak of. There's no character development. It's barely even a movie. It's basically a 90-minute sketch. All that being said, it's so goddamn hilarious. Non-stop laughs. Most I've laughed since Red Rocket probably. It's a can't-miss for any Tim Robinson fan and a can't-miss for any fans of laughing. Kate Mara was the perfect foil character. \n\n**The Wild Robot** - 8/10 - Yes, I cried, what of it?\n\n**Relay** - 8/10 - A very solid, tight, throwback to the type of paranoid corporate-thrillers they don’t really make anymore. A super fun twist that I didn’t see coming at all, and a standout turn from Lily James. It slightly loses its way near the end.\n\n**Good One** - 8/10 - Familiar and lowkey, but with a dark edge that slowly reveals itself, and a superb breakout role from Lily Collias. Great debut film from director India Donaldson.\n\n**A Complete Unknown**\t- 8/10 - There's definitely a lack of plot but at the end of the day we all just want to see Bob Dylan's Greatest Hits performed by a generational talent in Timothee Chalamet and it definitely delivers in that aspect.\n\n**Midwives** - 8/10 - One of the more stressful movies I’ve seen in a while. My anxiety was through the roof, especially in the first half. It’s so realistic and graphic at times (and some of it *has* to be real, some birth scenes especially) that you almost get a sense that it’s a documentary. Totally nails the landing too, making you feel real anger/empathy about how Midwives are treated in France (and other places I assume).\n\n**Hellbent On Boogie** - 8/10\t\n\n**Alien: Romulus** - 8/10 - Put Cailee Spaeny in anything and I'll watch it.\n\n**Furiosa: A Mad Max Saga** - 8/10\t\n\n**The Old Oak** - 8/10 - British realism cinema at it's finest. Just another classic added to Ken Loach's resume.\n\n**Longlegs** - 8/10\t\n\n**Babygirl** - 8/10\t\n\n**One Life** - 8/10 - I'm not a huge movie-cryer but I was absolutely balling my eyes out near the \"moment\". You know it's coming and it's still hit. Impressive when a movie can do that. Last movie that hit me like that was probably Tori and Lokita, and before that Moonlight. This was up there in terms of tears. Did not really expect it going in. Devasting. Anthony Hopkins kills these types of roles, he has a way of showing bottled up regret/sadness that not many others can.\n\nThe Ministry of Ungentlemanly Warfare** - 8/10 - Over-the-top violent fun time. Totally ridiculous but it doesn't take itself seriously and that's what keeps it from veering into. Also, Eiza Gonzalez. That is all.\n\n**Strange Darling** - 8/10\n\n**Los Frikis** - 8/10\t\n\n**Suncoast** - 8/10\t\n\n**Drive-Away Dolls** - 8/10 - I want more unapologetically horny movies like this. Loved all of Beanie Feldstein's bits and the slow, sleep-deprived descent into madness of the henchmen especially. Not too sure abou the weird-cheap transitions and trippy scenes though.  \"You're a day late and a penis short\" and \"Suki that's your wall dildo!\" are two of the funniest lines of the year, within context. Give me more fast-paced 75-minute movies.\n\n**In A Violent Nature** - 8/10 -This made me feel physically nauseous several times, would strongly recommend. Some of the gnarliest kills I've ever seen on the big screen. \n\n**A Real Pain** - 8/10\n\n**Abigail**- 8/10 - As a French-Canadian, big shoutout to Kevin Durand for his on-point Quebecois accent. Also, \"Sammy, those are fucking onions\" was one of the best/funniest line deliveries of the year. Really entertaining gory vampire flick. Dan Stevens is straight up having a fun time this year and I'm enjoying it every time. Melissa Barrera is now competing with with Mia Goth and Samara Weaving as top Scream Queens.\n\n**Deadpool &amp; Wolverine** - 8/10\n\n**Bring Them Down** - 8/10 - I love me a slow-burn family feud drama that slowly snowballs into something dark and sinister. Christopher Abbott is one of my favorite working actors today and he does incredible work here, especially with the accent/Irish/body language. Disclaimer: Not recommended to people sensitive to animal violence/cruelty. There's a lot of that.\n\n**The Piano Lesson** - 8/10 - As far as Denzel Washington-produced, August Wilson adaptations are concerned, this is way above *Fences*. Felt less like a straight-up filmed play. The supernatural element and amazing Danielle Deadwyler performance (give her an Oscar soon pls) make this more layered and interesting. Bonus: I was sitting with/near the cast/crew for this one, 5-10 feet away from Denzel/Danielle/John David/Malcolm/Corey Hawkins/Ray Fisher/Michael Potts. Amazing experience.\n\n**Nickel Boys** - 8/10\n\n**Fresh Kills** - 8/10 - A really solid mob-drama told from the perspective of a mob boss' daughter, which I appreciated. It's rare you see this story from that angle. Emily Bader's scene with her dad near the end. Holy. Fucking. Shit.\n\n**Between The Temples** - 8/10 - Carol Kane was absolutely magnetic and a joy to watch in this, and Jason Schwartzman was her perfect endearing counter. Lovely movie, that makes you want to curl up into a ball and cringe to death near to end, in a good way. The most painful-to-watch family reunion/dinner since Shiva Baby. \n\n**Problemista** - 8/10 - I stand with Bank of America. Julio Torres is kind of a revelation in this. His facial expressions (and hilarious run-walk thing) are perfect. Absurd, funny, and sweet comedy with so much flair and uniqueness. Some fun little details that got good laughs out of me, like Tilda's character always having her phone light on. Chaotic in all of the right ways.\n\n**Sisterhood**\t- 8/10\n\n**Days of Happiness** - 8/10\n\n**The Apprentice** - 8/10 - It's not breaking any new ground but Sebastian Stan is a pleasure to watch transform into Trump as the movie goes on. Grimy and gross like the streets of New York in the 80s.\n\n**Wil** - 8/10\n\n**Naked Ambition: Bunny Yeager** - 8/10\n\n**Soul** - 8/10 - I didn't get to catch this during it's original run due to COVID so I'm glad it came back. My favorite Pixar movie in a little while.\n\n**Femme** - 8/10\t\n\n**I Saw the TV Glow** - 8/10 \n\n**Heretic** - 7/10 -A fun horror with sharp dialogue and an incredibly-hammy Hugh Grant performance.\n\n**Emilia Perez** - 7/10 - Some amazing musical numbers, especially the opener and \"El Mal\", and Zoe Saldana has an amazing performance where she carries the entire thing (Gomez and Gascon are getting lots of praise but I didn’t see it), but it just felt like it never fully came together to reach full potential.\n\n**Mountains** - 7/10 - A very small and warm movie about the very big and cold issue of gentrification and the real estate crisis in South Florida. Monica Sorelle is a director to watch for sure.\n\n**Skywalkers: A Love Story** - 7/10\t- Other than a few moments that seemed a bit scripted (mostly the relationship drama), this is the most thriller documentary since Free Solo.\n\n**Ghostlight** - 7/10\t\n\n**Shoshana** - 7/10 - Israeli true-life spy-thriller, a bit Bond-like. There's a few kills in here that are insanely brutal and the explosions/gunshots catch you by surprise. It had me jump a few times.\n\n**The Dead Don't Hurt** - 7/10- Extremely slow, don't go in expecting an action-packed Western, but Viggo has a really good eye for beautiful backgrounds and settings. Vicky Krieps is top-tier as always. This movie doesn't work without her. I like slow Westerns.\n\n**The Fall Guy** - 7/10\t\n\n**Thelma** - 7/10\t\n\n**Twisters** - 7/10 -Natural disaster flicks just work for me. Getting to look at Daisy Edgar-Jones for 2 hours never hurts as well.\n\n**Cuckoo** - 7/10 - Insanely impressive and physical performance from Hunter Schafer. Cool visual style and flair, but ultimately dragged down by a total clusterfuck of a plot. I was confused throughout. Hilarious German accent from Dan Stevens\n\n**Peak Season** - 7/10\t\n\n**Kneecap** - 7/10 - Some of the funniest one-liners of the year (\"Look who it is, Bone Thugz and no harmony\", \"I feel like I discovered the Beatles, if the Beatles were shit.\"). The whole RRAD storyline kept it from greatness though, that was a bit too goofy for its own good.\n\n**Wolfs** - 7/10 - I went in wanting Pitt/Clooney banter and that's exactly what I got.\n\n**Blink Twice** - 7/10\t\n\n**My Old Ass** - 7/10\t\n\n**Better Man** - 7/10\t\n\n**Nightbitch**\t- 7/10 - Your mom's favorite movie of 2024. The awful first trailer didn't do it justice, this was solid, it just doesn't get dark like you'd hope it would.\n\n**Out of Darkness**\t- 7/10 - Saw this during a Mystery Movie Monday and was pleasantly surprised. Pretty brutal, atmospheric, and violent. Some cool overhead shots and a nice score. One of the better Mystery Movies I've seen.\n\n**We Grown Now** - 7/10\t\n\n**The End We Start From** - 7/10\t\n\n**Kinds of Kindness** - 7/10 - Not the best Yorgos but deliciously-freaky and daring filmmaking nonetheless.\n\n**Babes** - 7/10\n\n**Fancy Dance** - 7/10\t\n\n**MaXXXine** - 7/10 - Definitely the weakest of the trilogy but still a solid slasher with a very interesting setting. Mia Goth has great moments like in the first two.\n\n**Horizon: An American Saga Chapter 1** - 7/10 - I don't care, the montage at the end was sick. I really hope Costner gets to fund as many of these as he wants.\n\n**Wicked - 7/10** - Pretty good, not great. Ariana Grande was the standout. There were only 2 songs that were really catchy though, wish there were more.\n\n**Juror #2** - 7/10\n\n**Fly Me to the Moon** - 7/10\t\n\n**The End** - 7/10 - Gorgeously-shot, super well acted, beautiful set design and production, but way too long and had no reason to be a musical. The songs were all exactly the same and pointless and there much so much time in between that you would forget it was even a musical. George MacKay kills it.\n\n**Being Maria** - 7/10\t\n\n**Cabrini** - 7/10 - Maybe a bit overlong but honestly not bad. Surprised it's from the same director as Sound of Freedom, it's quite a step up from that. Much larger and ambitious in scope, and the lead actress was really really great. It solidly panders to its intended audience but it’s well made enough that you can just gloss over the eye-rolling moments.\n\n**In the Land of Saints and Sinners** - 7/10 - The best Neeson action-flick in a while, so that's something. Kerry Condon as the big villain was awesome. Need more of her in stuff.\n\n**Y2K** - 7/10 - The single-funniest death scene of the year was the skateboard scene. Laughed so hard, made my night. Audience really dug this one too, good atmosphere. Fred Durst.\n\n**The Queen of My Dreams** - 7/10 - I was getting massive Deja Vu with The Persian Version last year. Extremely similar story and vibe, equally fun/honest/heartfelt.\n\n**Speak No Evil** - 7/10\t\n\n**Immaculate** - 7/10 - Sydney Sweeney stepping out of her comfort zone and doing a nun-horror is cool. Long take near the end was sick.\n\n**Gladiator II** - 7/10 - Doesn't hold a candle to the original but it was still an entertaining sandals &amp; swords story. Fred Hechinger is so awful in this though. Man, that took me out of it. \n\n**Back to Black** - 7/10 - This movie is conflicting. In a vacuum, ignoring Winehouse's actual story, it's a solid music-biopic carried by a powerhouse breakthrough performance from Marisa Abela and an amazing soundrack (obviously). On the other hand, it's a disgusting whitewash by her estate to downplay her truly awful father. The fact that he had final approval over this movie, and will financially benefit from it, is just gross and hard to ignore. The 2015 documentary does a better job telling Amy's whole story in an emotional way, and that doc made my blood boil (and is one of my favorite docs ever). \n\n**Coup!** - 7/10\t\n\n**The Hypnosis** - 7/10\t\n\n**The Last Stop in Yuma County** - 7/10\t\n\n**Your Monster** - 7/10\n\n**Blitz** - 7/10 - The cartoonish villains and improbably scenarios the kid kept finding himself in took this down a notch for me. Could've been great, but it didn't quite get there. How much bad shit can happen to one kid in 24 hours? Find out with Blitz. On a technical level it had a lot going for it though.\n\n**In the Summers** - 7/10\t\n\n**Maria** - 7/10 - Jolie kills it and it looked gorgeous but a really big step down from Jackie/Spencer for Pablo Larrain, a big 'style over substance' movie and weirdly disrespectful to Jackie Kennedy as well for some odd reason. Very weird structure.\n\n**Lost Soulz** - 7/10\n\n**The Girls Are Alright** - 7/10\n\n**All We Imagine As Light** - 7/10 - With all the hype I was expecting to be blown away. It was good but kind of a let down.\n\n**Girls Will Be Girls** - 7/10\t\n\n**Ezra** - 7/10\n\n**Young Woman and the Sea** - 7/10 - An inspiring sports-biopic with a very old-school and authentic feel. The Remember the Titans of swimming movies. It hits all of the cliches and it's super cheesy, but in all of the right ways. It just works. Daisy Ridley was great, and as far as swimming movies are concerned, it's definitely ahead of Nyad.\n\n**Hundreds of Beavers** - 7/10 - It's funny and original, I just wish it was a bit shorter. Some of the bits definitely outstay their welcome after a while. I really like the grassroots campaign they've built around this movie though, everything from the independent theatrical showings to the support of physical media. A great success story for indie film this year.\n\n**The Idea of You** - 7/10\t\n\n**Crossing** - 7/10\n\n**Sleep** - 7/10\t\n\n**Monkey Man** - 7/10 - Solid action flick for the first and third acts, but dragged down by a super boring 2nd act (where it loses all of the momentum it built) and lots of sloppy/confusing editing, especially during chase sequences. Credit for the Terrence Malick-like flashback scenes with narration/sweeping music/shots of nature/etc, pretty cool to throw those into an action movie.\n\n**The Color Purple** - 7/10\t\n\n**The Damned** - 7/10 - You're hanging out with the soldiers on the frontier of the American Civil War and almost nothing happens for the entire runtime except you learn about the characters and their thoughts on life/god/religion/etc. I enjoyed it.\n\n**Mean Girls**\t- 7/10\t\n\n**Driving Madelaine** - 7/10\t\n\n**Late Night with the Devil** - 7/10\n\t\n**Snack Shack** - 7/10 - Aside from the needless death at the end that tries too hard to squeeze tears out of your eyeballs, I thought this was a fun, raunchy, summer-y throwback comedy. This would've been one of my favorites in middle school probably.\n\n**Beetlejuice Beetlejuice** - 7/10\t\n\n**Joker: Folie a Deux** - 7/10\t\n\n**The Outrun** - 7/10 -Less a compelling story and more a showcase on Saoirse Ronan's acting abilities. The camera basically doesn't move from her for a single second and she completely carries it. She's the best.\n\n**Flow** - 7/10\n\n**Black Box Diaries** - 7/10\t\n\n**Queer** - 7/10\n\n**The Return** - 7/10\t\n\n**New Life** - 7/10\t- I really respect a movie that can pull off a wild genre-switch halfway through the movie. Went in fully blind so it was totally unexpected. Also impressive this tiny movie could license Bob Dylan’s Like A Rolling Stone (played a few times).\n\n**Lisa Frankenstein** - 7/10  - The ultimate \"could've been truly great with a R rating\" movie.\n\n**Bob Marley: One Love** - 7/10 - It does just enough to keep it out of the Super Generic Biopic Genre and any movie that can squeeze a few tears out of me gets an extra point. Sorry, that's just the rules.\n\n**Kingdom of the Planet of the Apes** - 7/10\t\n\n**1992**- 7/10 - Other than Ray Liotta being written like a ridiculous cartoon villain and some eye-rolling dialogue issues, it actually was a pretty solid crime drama... and Tyrese Gibson was…good? (/r/brandnewsentence)\n\n**French Girl** - 7/10\t\n\n**The Peasants** - 7/10 - Visually impressive and a sick score, but a schmaltzy/melodramatic story kinda kept it from the next level.\n\n**The Monk and the Gun** - 7/10\t\n\n**Bad Boys: Ride or Die**\t- 6/10\t\n\n**Seven Blessings**\t- 6/10\n\n**Knox Goes Away** - 6/10 - Michael Keaton does his best and commits but the writing &amp; performance of every single side character brings the whole thing down a bit. The cop/ex-wife/son characters are bumbling, distractingly-dumb goofballs that keep the plot from ever grounding to reality, but it ultimately gets dark and violent enough to stay pretty entertaining. The script really could've used some more cleaning up.\n\n**Trap** - 6/10 - Listen I have a lot (*a lot*) of problems with this movie but Kid Cudi randomly showing up for 5 minutes and randomly delivering insane lines like \"“I specifically said i wanted honey suckle kombucha biiiiitchhhh” made the trip to the theater worth it.\n\n**Small Things Like These** - 6/10\t\n\n**Sometimes I Think About Dying** - 6/10\t\n\n**Kidnapped**\t- 6/10\t\n\n**Asphalt City** - 6/10 - Standout performance from Tye Sheridan but this leaned a bit too much into misery porn for my liking. Every single day is the absolute worst day on the job. Extremely stress-inducing first hour. Mike Tyson being cast as the medic chief was certainly a choice...and it worked somehow?\n\n**Eden**\t- 6/10 - Had trouble getting past the awful accents and the sinking feeling that this was missed potential. I was at the World Premiere for this and someone in the audience had a medical emergency, they had to pause the screening and turn the lights on while the person was carried out on people's shoulders. Jude Law/Sydney Sweeney/Ana de Armas/Ron Howard were all there wondering what was going on. Kind of a crazy situation.\n\n**Land of Bad** - 6/10\t\n\n**Unstoppable** - 6/10\t\n\n**Godzilla x Kong: The New Empire** - 6/10 - Skull Island's bland and less impressive/memorable little brother. Thumbs up for Baby Kong and the Rio de Janeiro destruction sequence, thumbs down for the lame story and unlimited amounts of annoying human characters.\n\n**Bad Shabbos** - 6/10\t\n\n**Inside Out 2** - 6/10\t\n\n**Firebrand** - 6/10\t\n\n**A Different Man** - 6/10 - I didn't connect to this as much as most people did. Sebastian Stan is great as usual but the whole thing didn't do much for me.\n\n**Love Me** - 6/10- 10/10 for the attempt, 4/10 for the execution. There's a really good movie hidden in here somewhere, but there needed to be some cuts made to the animated portions of the film for sure.\n\n**Shell**\t- 6/10\n\n**Housekeeping for Beginners** - 6/10\t\n\n**Totem** - 6/10\n\n**The Fire Inside** - 6/10\t\n\n**Widow Clicquot**\t- 6/10 - This starts off really really really slow but then finds its footing late and ends on a solid note. Career-best performance from Haley Bennett, she really carries this.\n\n**Tuesday** - 6/10\t\n\n**Piece by Piece** - 6/10\t\n\n**The Cut** - 6/10 - Standout turns from Orlando Bloom and Caitriona Balfe, brought down by some weird editing choices. The neon-green hallucinations were a wild choice. I sat next to Katy Perry for this movie, AMA.\n\n**Memoir of a Snail** - 6/10\n\n**The Romano Twins** - 6/10\t\n\n**Mufasa: The Lion King** - 6/10\n\t\n**Film Geek** - 6/10\t\n\n**Self-Reliance** - 6/10 - Pretty cute movie with a few laughs, but the ending lost its focus and felt rushed. The Andy Samberg bits were great. I wanted more from the relationship with Anna Kendrick's character, feels like there was more to explore there. \"This an intervention.\" \"For me?\" \"No, we're just all facing the wrong direction.\"\n\n**Queen of the Ring** - 6/10\t\n\n**Coup de Chance**\t- 6/10 - It's nowhere near peak-Woody Allen but it's a passable return to form since Rifkin's Festival, Wonder Wheel, and A Rainy Day In New York (all 3 awful, with Rifkin's Festival being rock bottom for Allen's filmography). The one thing it was missing was humor. I can always trust an Allen film to at least have a few funny/witty lines (even the bad ones), but this was very cut and dry. Could've used a few more good lines.\n\n**Sasquatch Sunset** - 6/10 - I was excited for the premise and there's a few sweet/funny moments, but most of it ends up being mindless shitting/pissing/fucking. Credit for the unique idea and great views.\n\n**Bird**\t- 6/10 - One of the more disappointing films of the year. Even after the lukewarm reception at Cannes, I had super high hopes because I’m a huge Andrea Arnold fan, but the surrealism in this movie just didn’t work. It threw off the whole balance and wasn’t at all what I expected/wanted. Nikiya Adams and Barry Keoghan were both very solid, and the scene where the group sang Coldplay’s Yellow to the frog was amazing.\n\n**Omni Loop**- 6/10\t\n\n**Here**\t- 6/10 - A valiant attempt but ultimately kind of a hot mess. A few good moments keep it watchable. Some real uncanny valley shit in there too though.\n\n**Queen Rock Montreal** - 6/10\t\n\n**Turning Red** - 6/10\t\n\n**Scrambled** - 6/10\t\n\n**The Book of Clarence** -  6/10 - LaKeith Stanfield was great and committed as usual (although I don't like twin dual-roles), and James McAvoy and Cumberbatch chewing on scenery was fun, this movie had a lot of trouble figuring out what it wanted to be. I really wish it leaned more into the funny/satire and less into the serious Mel Gibson/Jim Caviezel-type biblical drama. Cool that a movie like this can be made/funded and released in theaters though.\n\n**Booger** - 6/10\t\n\n**Irena's Vow** - 6/10 - Great story, extremely generic period drama.\n\n**A Great Divide** - 6/10\t\n\n**Riff Raff** - 6/10 - A bit outdated and mean-spirited, this would've slapped in 2006, but Bill Murray and Pete Davidson as the incompetent mob assassins makes it worth a watch. \n\n**Rosalie** - 6/10\n\n**Skincare** - 6/10\t\n\n**Yellow Bus** - 6/10\n\t\n**Arcadian** - 6/10 - It's fine and stretches its tiny budget so its absolute limit but it's basically a Dollar Store A Quiet Place. The monster design and animation was hilariously-bad though, like an Asylum knock-off movie. I'm also now convinced that Nic Cage is contractually obligated to have his face smothered in fake blood for any movie.\n\n**Nutcrackers** - 6/10 \n\n**The Invisibles** - 6/10\n\t\n**Riley** -6/10\t\n\n**Rob Peace**\t- 6/10 - A well-shot movie with great direction and performance from the supporting characters (Mary J Blige and Chiwetel Ejiofor) completely dragged down by an awful lead performance by Jay Will. Also the script was a bit silly, they were trying way too hard to make him 100% infallible.\n\n**Christmas Eve in Miller's Point** - 6/10 - I liked the hectic atmosphere of the crazy Christmas family party that we've all been at, and the very scratchy look of the camera.\n\n**Rumours** - 6/10 -I can appreciate what Maddin was going for, and there's some moments that work (mostly with Cate Blanchett and Charles Dance, they were awesome), but overall surreal-absurd-fantasy-comedy like this just doesn't work for me.\n\n**Fallen Fruit** - 6/10\t\n\n**Birthrite** - 6/10\t\n\n**Crumb Catcher** - 6/10\t\n\n**Anselm** - 6/10\t\n\n**Scapegoat** - 6/10\t\n\n**Seeds** - 5/10 - There’s clearly heart and maybe a great movie in here somewhere, but it’s such a tonal mess that it’s hard to find anything to love.\n\n**Sujo** - 5/10\t\n\n**The Beekeeper** - 5/10 -This is the Rebel Moon of Jason Bourne movies. A few cool kills and classic Statham one-liners keep it from being a total loss, but it's not very good.\n\n**Unsung Hero** - 5/10\n\n**Jeanne du Barry**- 5/10\t\n\n**Treasure** - 5/10\n\n**A Sacrifice** - 5/10\t\n\n**The American Society of Magical Negroes** - 5/10 - All over the place and it gave a constant feeling of \"missed opportunity\" (a la Book of Clarence). Justice Smith is straight-up not a convincing lead. An-Li Bogan was the standout, and I saw her end twist coming from a mile away so I got that going for me which is nice.\n\n**La Syndicaliste** - 5/10\n\n**Sonic the Hedgehog 3** - 5/10\t\n\n**The Watchers** - 5/10\n\n**Borderlands** - 5/10 - Went in expecting a 1/10, got a 5/10. Nice. Life is all about the little wins.\n\n**Ghostbusters: Frozen Empire** - 5/10 - Just give this franchise a permanent rest. It wasn't awful in any particular way, but it was totally soulless and heartless. It felt like nobody really gave a shit except Kumail Nanjiani. Safe, sanitized, studio slop. They couldn't even fully commit to the one interesting thing (the gay ghost love story).\n\n**National Anthem** - 5/10\t\n\n**The 4:30 Movie**\t- 5/10 - Kevin Smith jerking himself off for 80 minutes. Would make a fun double-feature with *Snack Shack* though.\n\n**Universal Language** - 5/10 - This had a lot of hype of out Cannes and it's Canada's submission for the Oscars so I had a lot of hope, but it just didn't do much for me. Surreal-absurdism just isn't my cup of team. The only real standout scene was the one with the Quebec democrat. A rare case of the Q&amp;A being more interesting than the movie itself.\n\n**Kraven the Hunter** - 5/10\t\n\n**Time Still Turns the Pages** - 5/10\t\n\n**Upgraded** - 5/10\t- Basically a Great Value The Devil Wears Prada. Good as rom-com-background-nois. Marissa Tomei is awful in this. One of the worst performances of the year.\n\n**Sound of Hope: The Story of Possum Trot** - 5/10\t\n\n**Out of Season** - 5/10\t\n\n**Miller's Girl** - 5/10\t\n\n**Latin for All** - 5/10\t\n\n**Argylle** - 5/10 - How a movie like The Creator can be made for $80M but something so awful-looking like this needs $200M blows my mind. \n\n**I.S.S.** - 5/10 - I love a good sandwich-making climax as much as the next guy, but what a painfully awkward ending. The first 25 minutes made me think something decent could be happening then it derails hard and never recovers. The worst thing to happen to the space program since Challenger.\n\n**Get Away** - 5/10\t\n\n**Brothers** - 5/10\t\n\n**Life's a Bitch** - 5/10 - France's (bad) answer to Yorgos Lanthimos. A dry, twisted, gross, weirdly-sexual, anthology film with a lot less nudity but a lot more dogs than Kinds of Kindness. Kinda loses its way comedically and becomes a chore after the first chapter.\n\n**Azrael** - 5/10\t\n\n**Monster Summer** - 5/10 - Like a G-rated IT, with Mel Gibson for some reason (?)\n\n**Kung Fu Panda 4** - 5/10\t\n\n**Garfield** - 5/10\n\nV**illains, Inc** - 5/10 - It had a certain cheap charm but an overwhelming sense of \"SNL Digital Short sketch stretched way too thin\".\n\n**Excursion** - 5/10\t\n\n**Sleeping Dogs** -  5/10\n\n**Notice to Quit** - 5/10 - The kid actor was really good but I'm just a bit over following an extremely unlikeable lead around doing shitty things to people.\n\n**Reunion** - 5/10\n\n**The Boy in the Woods**\t- 5/10\t\n\n**Paradise** - 5/10\t\n\n**Karaoke** - 5/10\t\n\n**It Ends With Us**\t- 5/10\t\n\n**Poolman** - 4/10 - The ugly, boring,  confused lovechild of Inherent Vice and Under the Silver Lake.\n\n**Avenue of the Giants** - 4/10\t\n\n**Arthur the King** - 4/10 - Marky Mark has really devolved as an actor honestly, really tough performance from him here. It's like he's completely forgotten how to convincingly deliver lines. Right from the GoPro scenes at the beginning I knew it was gonna be a rough time. This movie is like 85% exposition.\n\n**Janet Planet** - 4/10\t- Bookended by 2 great scenes, but filled with mostly pointless garbage.\n\n**Dandelion**\t- 4/10\t\n\n**By the Stream** - 4/10\t- I enjoy Hong Sangsoo movies in very small doses. This dose was just way too big.\n\n**Venom: The Last Dance** - 4/10\t\n\n**Red One** - 4/10\t\n\n**Oh, Canada** - 4/10 - Dreadfully confusing, and Jacob Elordi puts in one of the worst performances of the year, but at least that Phosphorescent soundtrack kept me engaged. \n\n**Slingshot** - 4/10\t\n\n**Adios Buenos Aires** - 4/10\t\n\n**Humane** - 4/10\t\n\n**Some Other Woman** - 4/10\t\n\n**My Daughter, My Love** - 4/10\t\n\n**Madame Web** - 4/10 - Slop.\n\n**IF** - 4/10 - Not really for adults, not really for kids/teens. Who was this movie even for?...\n\n**Freud's Last Session** - 4/10\t\n\n**Werewolves** - 4/10 - So much lens flare. I am now blind.\n\n**Ramona at Midlife** - 4/10\t\n\n**The Last Front** - 4/10\t\n\n**My Penguin Friend** - 4/10\n\t\n**Augure** - 4/10\t\n\n**Which Brings Me To You** - 4/10 - Looking back over this ranking, I'm gonna be honest and say I have no idea what this was. Don't remember. To producers out there: please stop making your movie titles random vague sentences.\n\n**Mai** - 4/10\t\n\n**Meanwhile on Earth** - 4/10\t\n\n**Lizzie Lazarus** - 4/10\t\n\n**Or Something** - 4/10\t\n\n**The Way We Speak** - 4/10\t\n\n**Cult Killer** - 3/10 - Antonio Banderas shows up for like 5 minutes and then nopes the fuck out. Total paycheck movie.\n\n**The Feeling that the Time for Doing Something Has Passed** - 3/10 - There were some funny lines (especially the 9/11 dating profile bit) but this was so painfully dry and slow that I could never really connect. If desert-dry, awkward, deadpan delivery, with an absurd amount of BDSM-sex-stuff thrown in is your thing, you might find a few things to like. I could not.\n\n**Never Let Go** - 3/10\t\n\n**The Throwback** - 3/10\t\n\n**The City** - 3/10\t\n\n**Rats!**\t- 3/10 - This would've worked well as an edgy Youtube short in 2012.\n\n**The Best Christmas Pageant Ever** - 3/10\t\n\n**He Went That Way** - 3/10 - Half roadtrip comedy with a chimp, half brutal serial killer drama. Tonally all over the place. The kind of movie you'd expect Jacob Elordi to try to bury (a la Dicaprio with Don's Plum) and fire his agent over before it sees the light of way. Baffling decisions made by everyone here. \n\n**Megalopolis** - 2/10 - I went in expecting a mess but I was still not prepared for how bad this was. It’s Neil Breen with an unlimited budget. It felt like 6 hours. It looked so cheap and awful. A mix of Lifetime movie and a middle school play. I refuse to believe it’s bad on purpose for comedy. The only thing keeping this from a 1 is that Adam Driver/Coppola/Nathalie Emmanuel/Giancarlo Esposito were at my screening for Q&amp;A (god bless their sweet little souls for having to seriously promote this hot mess). \"What do you think of this boner I got right here?” is a line 85 year old Jon Voight actually says in a real movie in the year of our lord 2024. My therapist will hear about this.\n\n**A Boy Who Dreamt of Electricity** - 2/10\t\n\n**Isle of Hope** - 2/10 - Sometimes I wonder why I do this to myself.\n\n**Chosen Family** - 1/10\t- This was borderline unfinished and full-on embarrassing. The production value of a daytime soap opera mixed in with the sound editing of a local high school play. It's impressive how much filler (drone shots of surrounding neighborhood) can be squeezed into 84 minutes of movie. Sitting a few seats away from Heather Graham was a nice bonus (with Q&amp;A), but it couldn't come close to making up for this disaster.\n\n----------------------------------------------------------------------------------------------------------\n\n*Unranked (Re-Releases and/or TV Series):*\n\n**Dune** (Re-Release) - 10/10\n\n**Interstellar** (Re-Release) - 10/10\t\n\n**Ex Machina** (Re-Release) - 9/10\n\n**The Shawshank Redemption** (Re-Release) - 8/10\t\n\n**Bound** (Re-Release) - 8/10\n\n**Mr. &amp; Mrs. Smith Episodes 1 &amp; 2** (TV Series)\t- 7/10\n\t\n**Possession** (Re-Release) - 7/10\n\n**But I'm A Cheerleader** (Re-Release) - 7/10\n\n**The Acolyte Episodes 1 &amp; 2** (TV Series) - 6/10\n\t\n**Society** (Re-Release) - 6/10\n\n**Black Christmas** (Re-Release) - 6/10\n\n**Apples Never Fall Episode 1** (TV Series) - 6/10\t\n\n**Maniac Cop 2** (Re-Release- 6/10\n\n**The Room** (Re-Release) - 5/10\n\n**Cruel Intentions Episode 1** (TV Series)\t- 5/10\n\n**La Maquina Episode 1** (TV Series) - 4/10\n\n**After Annecy** (Short Film) - 3/10\n\n**Maniac** (Re-Release) - 3/10\n\n**Mother** (Re-Release) - 3/10\n\n----------------------------------------------------------------------------------------------------------\n\n**Stats:**\n\n**Multiple Viewings:**\n\n* Dune: Part Two (x2)\n* Babes (x2)\n* Deadpool &amp; Wolverine (x2)\n* Sing Sing (x2)\n* Back to Black (x2)\n* The Wild Robot (x2)\n* Anora (x2)\n\n**Theater Distribution by Venue/Chain:**\n\n* AMC - 96\n* Regal - 66\n* Silverspot - 18\n* Cinemark - 8\n* Landmark - 1\n* Other/Festival/Independent - 109 (Including: Arsht Center, Autonation IMAX, Cinema Paradiso, Classic Gateway, Coastal Creative, Coral Gables Art Cinema, Enzian Theater,  Hard Rock Ballroom, Koubek Center, TIFF Lightbox, Lucas Theater, Miami Theater Center, Movies of Delray, O'Cinema South Beach, Princess of Wales, Roy Thomson Hall, Royal Alexandra, Savor Cinema, SCAD Museum, Scotiabank, Tampa Theater, Trustees Theater)\n\n**Film Festivals Attended:**\n\n* Toronto International Film Festival - 30 Movies in 8 Days\n* Savannah SCAD Film Festival - 20 Movies in 8 Days\n* Miami Film Festival - 20 Movies and 1 TV Series in 10 Days\n* Florida Film Festival - 19 Movies in 6 Days\n* Miami Jewish Film Festival - 10 Movies in 7 Days\n* Popcorn Frights Film Festival - 7 Movies in 4 Days\n* Fort Lauderdale International Film Festival - 6 Movies in 4 Days\n* Gasparilla International Film Fstival - 5 Movies in 2 Days\n\n**Theater Visits by Month:**\n\nhttps://i.imgur.com/sKQYFp9.png\n\n* January: 32 \n* February: 17 \n* March: 27 \n* April: 54 \n* May: 18\n* June: 18\n* July: 12 \n* August: 24\n* September: 38 \n* October:  23\n* November: 22\n* December: 13\n\n**Theater Visits by Day of the Week:**\n\nhttps://i.imgur.com/xC7pt1S.png\n\n* Monday - 25\n* Tuesday - 23\n* Wednesday - 23\n* Thursday - 49\n* Friday - 64\n* Saturday - 67\n* Sunday - 47\n\n**Notable Missed Movies:**\n\nhttps://i.imgur.com/iPhOD5s.png\n\n**Cast/Crew/Filmmaker Q&amp;As/Appearances:**\n\n* Part 1 - https://i.imgur.com/a6JsfR0.png\n* Part 2 - https://i.imgur.com/YQIJZUl.png\n* Part 3 - https://i.imgur.com/9cyEkKY.png\n\n**Favorite Performances:** \n\nhttps://i.imgur.com/Sfv5OZB.png\n\n**Past Rankings:**\n \n* [2018 \\(162 Movies\\)](https://www.reddit.com/r/movies/comments/aavyrr/i_saw_162_movies_in_theaters_in_2018_here_is_my/)\n* [2019 \\(192 Movies\\)](https://www.reddit.com/r/movies/comments/eh71gy/i_saw_192_movies_in_theaters_in_2019_here_is_my/)\n* [2020 \\(44 Movies\\)](https://www.reddit.com/r/movies/comments/kp39ku/i_saw_44_movies_in_theaters_in_2020_here_is_my/)\n* [2021 \\(86 Movies\\)](https://www.reddit.com/r/movies/comments/ruaxif/i_saw_86_movies_in_theaters_in_2021_here_is_my/)\n* [2022 \\(270 Movies\\)](https://www.reddit.com/r/movies/comments/zzvg5y/i_saw_270_movies_in_theaters_in_2022_here_is_my/)\n* [2023 \\(325 Movies\\)](https://www.reddit.com/r/movies/comments/18v7k6g/i_saw_325_movies_in_theaters_in_2023_here_is_my/)",
        "upvotes": 250,
        "comments": 154,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TpHDe96i0cq0p2jFG-xOxlsmet47ocU7MWnaDY0WMgM.png?auto=webp&amp;s=e6f4c2327f93fceb1786131d2999f725c3141145"
        },
        "permalink": "/r/movies/comments/1ho6mzf/i_saw_298_movies_in_theaters_in_2024_here_is_my/"
    },
    {
        "id": "1hnpvcg",
        "author": "Gato1980",
        "title": "Netflix’s ‘Chronicles of Narnia’ Adaptation from Greta Gerwig Targeting December 2026 Release",
        "content": "",
        "upvotes": 3029,
        "comments": 430,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rnATP0wW0mExG7OhsO4hMKdghv8NWtUQKq_REYkhJc8.jpg?auto=webp&amp;s=468f23d55a1f11bfd2e0ec2a2863ca660ea82d0f"
        },
        "permalink": "/r/movies/comments/1hnpvcg/netflixs_chronicles_of_narnia_adaptation_from/"
    },
    {
        "id": "1hnjcbd",
        "author": "MarvelsGrantMan136",
        "title": "‘The Batman’ Sequel Heads To October 2027, Tom Cruise &amp; Alejandro G. Iñárritu Pic Sets 2026 Release, ‘Sinners’ &amp; ‘Mickey 17’ Switch Places",
        "content": "",
        "upvotes": 4791,
        "comments": 889,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ZUEr7LCTsjqRE9t1mEAtttbdlUJQQfrPE43jlBSdSKY.jpg?auto=webp&amp;s=af219878f8a0cea9e7f412f208172c6927e1dc7a"
        },
        "permalink": "/r/movies/comments/1hnjcbd/the_batman_sequel_heads_to_october_2027_tom/"
    },
    {
        "id": "1hnxw6v",
        "author": "Accomplished-Arm6471",
        "title": "Why is Mel Gibson’s wife dead in every movie?",
        "content": "Obviously I’m exaggerating, but it really does seem like in every Gibson movie his wife is either already dead or will die at some point during the runtime. \n\n-Mad Max\n-Lethal Weapon\n-Braveheart\n-The Patriot\n-Signs\n-Blood Father (if I remember right)\n\nForgive me if this is a common topic, but I only realized it tonight after watching The Patriot for the 100th time. Has anyone else noticed this?",
        "upvotes": 508,
        "comments": 213,
        "media": null,
        "permalink": "/r/movies/comments/1hnxw6v/why_is_mel_gibsons_wife_dead_in_every_movie/"
    },
    {
        "id": "1hnyx6z",
        "author": "saseg",
        "title": "Any “coming of age” movies about your early 30’s?",
        "content": "I know this is mostly a genre for 18-20 year olds, but I'm becoming disillusioned with life at this age and the future and am looking for another way to view the world. Preferably from a male perspective, but anything will do. I've always appreciated what movies can do, but I don't know of anything that hits this specific criteria. ",
        "upvotes": 423,
        "comments": 400,
        "media": null,
        "permalink": "/r/movies/comments/1hnyx6z/any_coming_of_age_movies_about_your_early_30s/"
    },
    {
        "id": "1hnufrx",
        "author": "Bandana-Verdana",
        "title": "What caused the massive drop in quality between Shrek 2 &amp; 3?",
        "content": "Regardless of your thoughts of the Shrek movies, or whether you believe the latter two films of the tetralogy get too much hate, almost all can agree that Shrek 1 and 2 are far superior to 3 and 4. I’ve always wondered what caused this sudden drop in quality. The films weren’t released very far apart from another and Shrek the Third picks up pretty much exactly where Shrek 2 left off. Yet, for whatever reason, the storytelling and quality of jokes simply come up lacking. Worse yet, the pacing in Shrek 3 seems glacial compared to the rapid-fire speed of the precious film. Was a change in staff to blame or was the studio largely responsible?",
        "upvotes": 821,
        "comments": 189,
        "media": null,
        "permalink": "/r/movies/comments/1hnufrx/what_caused_the_massive_drop_in_quality_between/"
    },
    {
        "id": "1ho6qeg",
        "author": "TreeBear007",
        "title": "Unbowed by Russian invasion, Ukraine selects ‘La Palisiada’ for Oscars submission as film industry flourishes ",
        "content": "",
        "upvotes": 68,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rPedf61ozVlIrGu55QXBQLIK72nhMqcga8AsqXD8KT8.jpg?auto=webp&amp;s=4f1b2e4a0679636222c56f8d2da0c1cb3068b144"
        },
        "permalink": "/r/movies/comments/1ho6qeg/unbowed_by_russian_invasion_ukraine_selects_la/"
    },
    {
        "id": "1ho3gbb",
        "author": "cowpool20",
        "title": "Wallace &amp; Gromit Vengeance Most Fowl is brilliant",
        "content": "Aardman have done it again. The animation is just unbelievable, the things they pull off with stop motion. The humour was always bang on. \n\nFeathers McGraw was one of my favourite villains of the year.\n\nBen Whitehead’s performance as Wallace was fantastic, he did a great job at taking over from Peter Sallis.\n\nThe movie even made me cry at the end lmao.\n\nI can’t wait for this movie to release worldwide so more people can watch it.\n\nNot sure where I’d rank it among the Wallace &amp; Gromit series yet but it’s certainly very high up.",
        "upvotes": 130,
        "comments": 19,
        "media": null,
        "permalink": "/r/movies/comments/1ho3gbb/wallace_gromit_vengeance_most_fowl_is_brilliant/"
    },
    {
        "id": "1hnqmbl",
        "author": "Wheres_MyMoney",
        "title": "So many erotic thriller from the past decade seem to be afraid to be erotic or thrilling",
        "content": "In the days of Yore, before internet porn and Instagram thots, the erotic thriller held a special place in American pop culture. \n\nMovies like Basic Instinct or Fatal Attraction in the 80's, Wild Things or Poison Ivy in the 90's pushed boundaries and tantalized viewers. They were scandalous enough that you might be quiet about watching them in the theater, but not graphic enough to be in \"that section\" at your local video rental store.\n\nHowever, I feel like these movies are all but long gone both in terms of the number they are produced in and in what they portray on screen.\n\nFor example, Babygirl released this week. I won't give any spoilers, but a lot of the reviews and comments seem to be on how for as much sex as is in the movie, it isn't really erotic. Nor is the \"mystery\" aspect all that thrilling.\n\nSimilarly, Miller's Girl released earlier this year with Jenna Ortega at the height of her fame and the story being about her sexual relationship with her professor. Yet it was so bland, seemingly afraid to \"go there\".\n\nA few years ago, The Voyeurs came out with Sydney Sweeny fresh off her Euphoria season. There was sex. There was murder. There were plot twists. There was revenge. Most of all, it was meh. \n\nI am curious, why is this (if you even agree with the premise)? Is it because graphic material is so readily available? Has society become more sex-averse? Is it something else?",
        "upvotes": 760,
        "comments": 265,
        "media": null,
        "permalink": "/r/movies/comments/1hnqmbl/so_many_erotic_thriller_from_the_past_decade_seem/"
    },
    {
        "id": "1ho8spq",
        "author": "AMA_requester",
        "title": "Charles Shyer, who wrote Private Benjamin, Smokey and the Bandit, and Father of the Bride, dies at 83",
        "content": "",
        "upvotes": 26,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/pmweb7WTL94dxNS8Z9wAyreeiasLHSky0REooC11SoQ.jpg?auto=webp&amp;s=132df625e79098765f7fd43606fc1ed5374c7e7b"
        },
        "permalink": "/r/movies/comments/1ho8spq/charles_shyer_who_wrote_private_benjamin_smokey/"
    },
    {
        "id": "1hnsa6h",
        "author": "SanderSo47",
        "title": "Kevin Smith’s Criterion Movie Closet Picks",
        "content": "",
        "upvotes": 229,
        "comments": 79,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ApyheE3lunJFuOZYSG9V7ZeGMrfmpK8KqAU8RUmfLJg.jpg?auto=webp&amp;s=83a7edd413d8da8f8929652ebc5c4d089d838899"
        },
        "permalink": "/r/movies/comments/1hnsa6h/kevin_smiths_criterion_movie_closet_picks/"
    },
    {
        "id": "1hnrw5x",
        "author": "basman11",
        "title": "Train to Busan is a brilliant movie. ",
        "content": "I am not a big fan of horror movies or zombie movies but I have been recommended to watch this movie by a lot of people. Finally watched it after being it on my watch list for years. \nI was so surprised by how crazy my experience was watching the movie. Cried like a baby towards the end for a good 5 minutes. Totally unexpected before deciding to watch a zombie movie. Loved the performances, especially of the small girl's and the making as well. \nWill explore more movies in this genre so please do recommend some! ",
        "upvotes": 196,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1hnrw5x/train_to_busan_is_a_brilliant_movie/"
    },
    {
        "id": "1hnrt9m",
        "author": "lawrencedun2002",
        "title": "The Most-Anticipated Movies of 2025",
        "content": "",
        "upvotes": 187,
        "comments": 194,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FU_jIgfbflLliPUHmsmzb0W_TV6duNmemzFdwPdkgFg.jpg?auto=webp&amp;s=3708364764a32ad5f2db33784de5a88bef0c4e14"
        },
        "permalink": "/r/movies/comments/1hnrt9m/the_mostanticipated_movies_of_2025/"
    },
    {
        "id": "1ho1nof",
        "author": "Ready_Calendar9058",
        "title": "Kubrick, Lynch, and Von Trier all make you feel uneasy in different ways, and I think it’s interesting how they do it.",
        "content": "Kubrick’s all about that cold, perfect symmetry. His shots are so precise, everything is in its place, and that can make you feel trapped. It’s like he’s designing a world where everything’s just a little too perfect—The Shining and 2001 are prime examples. It’s unsettling because there’s no room for warmth or messiness, just this suffocating control.\n\nLynch also loves symmetry, but he warps it with a surreal, dreamlike quality. It’s less about precision and more about creating a weird, subconscious unease. Movies like Mulholland Drive or Blue Velvet use strange, almost off-putting moments to dig into our fears, memories, and desires. It’s like a nightmare you can’t quite understand, but it sticks with you.\n\nThen there’s Von Trier, who throws all that control out the window. His camera’s often shaky, the frames feel off-center, and the whole thing just feels chaotic. Antichrist or Melancholia are all about raw emotion, showing the messiness and instability of human life. It’s uncomfortable because it feels so raw and unfiltered.\n\nWhat’s cool is that all three directors get the same effect—unease—but they go about it in completely different ways. One’s cold and precise, one’s surreal and psychological, and one’s just pure chaos. But they all mess with your mind in the end.",
        "upvotes": 24,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1ho1nof/kubrick_lynch_and_von_trier_all_make_you_feel/"
    },
    {
        "id": "1hnnav8",
        "author": "Davis_Crawfish",
        "title": "\"Dead Calm\" (1989): A pulsating, nerve-wrecking thriller about a couple separated from each other in the wide Pacific ocean, struggling to survive.",
        "content": "I love this movie. Sam Neil and Nicole Kidman play a married couple who've gone through the trauma of losing their child in an accident and are dealing with it by going on a vacation on their Ocean on the Pacific. Mid-travel, they find an abandoned boat with one survivor who rows himself to their Yach for help, but when the husband decides to go to the stranger's sinking schooner to see what is in there, he's confronted with a horrifying, shocking truth, which causes the separation of the couple and puts their lives in danger. \n\n\"Dead Calm\" was a disturbing, tense and suspenseful film. Both leads experience a different kind of danger, the husband is trapped on a sinking boat that is quickly submering, leaving him into MacGyver move, whereas the wife is trapped in the Yacht with a psycho and she's forced to do everything she can to stay alive. As the movie progresses, the film becomes more about the wife and Kidman manages to dominate the movie as her character, Rae, finds her inner strength, while Billy Zane's Hughie, exudes danger and menace but at the same time, sex-appeal. You can see that he's a time bomb, seemingly nice and hot but whose temper becomes increasingly psychotic as he reaches his unhinged limit (which isn't hard to do so). \n\nI must say I had no idea Kidman was 20/21 in this movie. She looks pretty mature for her role and she is very headstrong  halfway through it. You could tell she was about to be big.",
        "upvotes": 216,
        "comments": 34,
        "media": null,
        "permalink": "/r/movies/comments/1hnnav8/dead_calm_1989_a_pulsating_nervewrecking_thriller/"
    },
    {
        "id": "1hnwz6y",
        "author": "Puzzled-Tap8042",
        "title": "Irv Wilson Dies; Prolific Producer In Golden Era Of TV Movies Was 93\n",
        "content": "",
        "upvotes": 49,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RZ9_Tpi8ONtvBFEHuZa-9P2rB2f0sUHqbH4siSzYesM.jpg?auto=webp&amp;s=bbe6618b3df0c20c807ebd93ab76c560c5c88b2d"
        },
        "permalink": "/r/movies/comments/1hnwz6y/irv_wilson_dies_prolific_producer_in_golden_era/"
    },
    {
        "id": "1hn42jc",
        "author": "thermal7",
        "title": "How did Tommy Wiseau come up with $6 million dollars for his film 'The Room'?",
        "content": "So I recently read the book 'The Disaster Artist' (fantastic, hilarious read), and learned that Tommy Wiseau spent about $6 million (equivalent to about $10 million in 2024) to create his movie 'The Room'. \n\nThere seems to be some ambiguity on how Mr. Wiseau came up with the money, so I'm wondering if the knowledgable people on this forum might have some insights. \n\nThank you",
        "upvotes": 5665,
        "comments": 703,
        "media": null,
        "permalink": "/r/movies/comments/1hn42jc/how_did_tommy_wiseau_come_up_with_6_million/"
    },
    {
        "id": "1hnkfs8",
        "author": "indiewire",
        "title": "Denis Villeneuve Interview: Director on His Career, Indies, and Dune",
        "content": "",
        "upvotes": 272,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/igovn4aCnM47vGaPezp7Y8bhjo3ZnE2TrG6ZcoCWj5s.jpg?auto=webp&amp;s=94edb992ce5dfa14f59f5a1dcd5dc19a73ea330f"
        },
        "permalink": "/r/movies/comments/1hnkfs8/denis_villeneuve_interview_director_on_his_career/"
    },
    {
        "id": "1hnelds",
        "author": "AporiaParadox",
        "title": "Hollywood executive decisions that baffle you",
        "content": "Although most of the time Hollywood executives make reasonable decisions, most of which we never know about and we never really give them credit for, they often also do things that we consider to be quite dumb. Sometimes those decisions actually paid off in the end (like the Hobbit being split into 3 movies which ended up being huge box office hits despite their questionable quality) and other times there is at least something resembling an argument for why the decision was made even though many would disagree with it (like WB canning Batgirl and Coyote vs. Acme as a tax write-off, or 20th Century Fox allowing George Lucas to have the Star Wars merchandising rights because at the time merchandising for movies wasn't seen as profitable).\n\nBut sometimes they make decisions so stupid and baffling that you wonder how the hell these people still have jobs. Like why the hell did Sony keep doubling down on their Spider-Man without Spider-Man movie franchise? Venom was a hit, but Venom is Venom, an already popular character. Nobody but big comic book fans or people who watched certain Spider-Man cartoon were aware of who Morbius, Madame Web, or Kraven were. You'd think that the failure of Morbius would have made them reconsider, but nope they instead doubled down by releasing Madame Web and Kraven in the same year, and they flopped just like everyone predicted. The movies were just plain bad, the scripts were terrible, the acting was meme-worthy at best, they made movies about villains but instead turned them into anti-heroes that barely do anything villainous, there was no fun \"popcorn\" spectacle to at least keep audiences interested like with Venom, and the marketing didn't make anyone want to see the movie. Contrary to popular belief, they didn't need to make all of these movies to keep the Spider-man film rights, they did it only because they genuinely believed audiences would go see them. And they could have included Spider-Man in these movies if they'd wanted to, but they chose not to under the belief that it would confuse audiences.\n\nSo what other Hollywood executive decisions do you believe were genuinely stupid ideas?",
        "upvotes": 529,
        "comments": 1184,
        "media": null,
        "permalink": "/r/movies/comments/1hnelds/hollywood_executive_decisions_that_baffle_you/"
    },
    {
        "id": "1ho9cro",
        "author": "zombiBuddy",
        "title": "Favorite end credits song/needle drop?",
        "content": "Mine will always be \"Blue Moon\" by The Marcels in An American Werewolf in London. I don't know how to explain it, but after having seen so much carnage and tragedy, that light-hearted needle drop feels like a welcome breath of fresh air. I think it's an absolutely genius way to end the film. \n\n\nHaving Green Room go out to \"Sinister Purpose\" by Creedence is also absolutely brilliant...\n\n\nOr what about \"Hit the Road Jack\" in The House that Jack Built, haha. \n\n\nWhat are your picks?",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1ho9cro/favorite_end_credits_songneedle_drop/"
    },
    {
        "id": "1hnye4l",
        "author": "tez-pomy",
        "title": "Directors Roundtable: Denis Villeneuve, Brady Corbet, Coralie Fargeat, Malcolm Washington &amp; More",
        "content": "",
        "upvotes": 19,
        "comments": 5,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/SdFmZMDIxe0KQ8bRuaPvXdeSzyAFg71cUoRtzRs4uPk.jpg?auto=webp&amp;s=d99b782b7fb45a154f539757f9e00fe36386d20a"
        },
        "permalink": "/r/movies/comments/1hnye4l/directors_roundtable_denis_villeneuve_brady/"
    },
    {
        "id": "1ho9h4c",
        "author": "AfternoonAfraid2192",
        "title": "Soundtracks from bad/alright movies?",
        "content": "Hey guys! So i got to wondering, are there any of you out there who enjoy movies soundtracks? And if so, are there any soundtracks (like OST, Movie Score etc) from movies that you think are bad or even alright/okay to watch, but the soundtrack absolutely BANGS? \n\nOne of my favourites is The Amazing Spider-Man 2 soundtrack by Hans Zimmer. I think the movies cool dgmw! But it does lack in parts. The soundtrack however, i think is an absolute stellar bit of work! ",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1ho9h4c/soundtracks_from_badalright_movies/"
    },
    {
        "id": "1ho91t1",
        "author": "West_Conclusion_1239",
        "title": "Denzel Washington at 70: Rank his top 10 Greatest performances ever",
        "content": "Denzel Washington turns 70 years old.\n\nRank his top 10 Greatest performances ever\n\nI'll start:\n\n1. Malcolm X \n2. Training Day \n3. The Hurricane \n4. Glory\n5. Flight\n6. American Gangster \n7. Fences\n8. Philadelphia \n9. The Tragedy Of Macbeth \n10.Roman J. Israel Esq.\n\n*Yes, i do have seen Gladiator II.\n\nDo you agree?\n\nMake your top 10 \"Denzel Washington's greatest performances\" list down below.",
        "upvotes": 3,
        "comments": 22,
        "media": null,
        "permalink": "/r/movies/comments/1ho91t1/denzel_washington_at_70_rank_his_top_10_greatest/"
    },
    {
        "id": "1hnxjf6",
        "author": "lunakatolivia",
        "title": "Fun adventure movies?",
        "content": "My kids are 9 and 12 and I'm running out of movie ideas for them.  They loved Princess Bride,  A Series of Unfortunate Events,  Night at the Museum,  Hook, Jumanji, Goonies, National Treasures,  etc... I don't get hung up on ratings but we avoid sex scenes. We're looking for adventure fun with the same type of feel as the ones I listed.  Do you all have any suggestions?",
        "upvotes": 15,
        "comments": 75,
        "media": null,
        "permalink": "/r/movies/comments/1hnxjf6/fun_adventure_movies/"
    },
    {
        "id": "1hnv0ja",
        "author": "RoughingTheDiamond",
        "title": "What are the best/most iconic movie theatres in the world?",
        "content": "I'm planning a bunch of travel for 2025 and I'm thinking about challenging myself to see a movie in as many of the most iconic and meaningful theaters around the world as I can. Where should I go?\n\nI'm thinking places like the Prince Charles in London, New Bev in LA, Angelika in NYC, the original Alamo Drafthouse, the Palais in Cannes... let me know your picks!",
        "upvotes": 17,
        "comments": 61,
        "media": null,
        "permalink": "/r/movies/comments/1hnv0ja/what_are_the_bestmost_iconic_movie_theatres_in/"
    },
    {
        "id": "1hnjur1",
        "author": "I_Like_Metal_Music",
        "title": "What cinematography style is Poor Things (2023)?",
        "content": "I’m looking for movies have the same type of cinematography as Poor Things by Yorgos Lanthimos. Movies that are kind of surrealistic/gothic. I have a certain movie in the back of my mind that I’ve been trying to pinpoint that reminds me of this film but I just can’t quite grasp it. Movies that are just really weird and so is the cinematography, just kind of disjointed and surrealistic. If y’all could either give recs for similar movies or tell me what the cinematography style of it is, that would be great!",
        "upvotes": 86,
        "comments": 61,
        "media": null,
        "permalink": "/r/movies/comments/1hnjur1/what_cinematography_style_is_poor_things_2023/"
    },
    {
        "id": "1ho9647",
        "author": "ZelitaDat",
        "title": "Film with talking toys",
        "content": "I am looking for a Toy Story knockoff film featuring choppy animation and a story about talking toys. One of the characters is a purple jester; there's also a talking skateboard and a phone, but I can't remember the rest of the characters. It might have been originally from Germany, around the start 2000's. Any help og clues would be appreciated!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1ho9647/film_with_talking_toys/"
    },
    {
        "id": "1hnix3s",
        "author": "Mst3Kgf",
        "title": "Clint Eastwood's \"High Plains Drifter\" and \"Pale Rider\" make for an interesting double-bill, not just because they're both excellent Westerns that Eastwood directed as well as starred in, but because of the supernatural element they share with each other.",
        "content": "Both films have the same basic premise; Eastwood portraying a mysterious, nameless gunslinger (dubbed \"The Stranger\" in \"Drifter\" and \"Preacher\" in \"Rider\") who rides into an isolated community with a hidden agenda and gets involved in violent antics. But what they also share is the implication that both the Stranger and Preacher are not even human, but supernatural revenants back from the grave for retribution. Eastwood himself has especially liked this aspect and played it up since both films' releases (he even called Preacher an \"out and out ghost\") and it gives what would have been straight-forward Westerns an air of eeriness and dark fantasy (especially \"Drifter\", which often comes off like a horror movie).\n\nOf course, there's a lot of difference as well, since Preacher is a truly heroic figure (as expected give how much \"Rider\" owes to \"Shane\") while the Stranger is a VERY dark anti-hero. But the shared element of them being supernatural figures makes for an interesting back to back viewing.",
        "upvotes": 75,
        "comments": 18,
        "media": null,
        "permalink": "/r/movies/comments/1hnix3s/clint_eastwoods_high_plains_drifter_and_pale/"
    }
]