[
    {
        "id": "1k4sups",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Team of Canadian Thriller 'Hunting Daze' - Tuesday 4/22 at 4:00 PM ET - Director Annick Blanc, Lead Actress Nahéma Ricci ('Antigone'), and Oscar-nominated Producer Maria Gracia Turgeon ('Fauve', 'Brotherhood').",
        "content": "",
        "upvotes": 3,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ogneeim53awe1.png?auto=webp&amp;s=3791f83c66875c9081011e559a7696f2774d13bc"
        },
        "permalink": "/r/movies/comments/1k4sups/amaqa_announcement_team_of_canadian_thriller/"
    },
    {
        "id": "1k33sz5",
        "author": "SonyPictures",
        "title": "Hey everyone - Peter Stormare here. My upcoming movie, UNTIL DAWN, is out in theatres on April 25th. I'll be back this upcoming Tuesday, April 22nd at 9:30 AM PT to answer your questions about Until Dawn and anything else you might want to know. Ask me anything.",
        "content": "[ I'm looking forward to chatting with you about my upcoming movie UNTIL DAWN, which is in theatres on April 25th. Join me on r\\/movies this upcoming Tuesday, April 22nd from 9:30am PT-10:30am PT as I answer your questions about Until Dawn and anything else you might want to know.](https://preview.redd.it/132fqamd6uve1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=041be0644f759a3eb6c103e45b6ae0070d98170c)\n\n",
        "upvotes": 179,
        "comments": 111,
        "media": null,
        "permalink": "/r/movies/comments/1k33sz5/hey_everyone_peter_stormare_here_my_upcoming/"
    },
    {
        "id": "1k4kcs2",
        "author": "MarvelsGrantMan136",
        "title": "New Oscars Rule: If You Don’t See All the Nominated Films, You Can’t Vote",
        "content": "",
        "upvotes": 42543,
        "comments": 1587,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/cmKiQRTdAG60tRvxu0TW4Zn5IR8liBQippjgcfwwgPc.jpg?auto=webp&amp;s=e95db0c42e5f8436321569a5f64684c0a748dfb9"
        },
        "permalink": "/r/movies/comments/1k4kcs2/new_oscars_rule_if_you_dont_see_all_the_nominated/"
    },
    {
        "id": "1k4py8m",
        "author": "MarvelsGrantMan136",
        "title": "Michael Bay And Sydney Sweeney Team On Adaptation Of Popular Video Game ‘Outrun’ At Universal",
        "content": "",
        "upvotes": 1498,
        "comments": 531,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LjlhvZawGZDImQXpD7456GCxN2LkloecT1izi8VQZK4.jpg?auto=webp&amp;s=c4de118cfe12f90df650e01a4007899cc5e19e46"
        },
        "permalink": "/r/movies/comments/1k4py8m/michael_bay_and_sydney_sweeney_team_on_adaptation/"
    },
    {
        "id": "1k4kwxu",
        "author": "MarvelsGrantMan136",
        "title": "Ernie Hudson Taking Over Carl Weathers’ Voice Role Of Combat Carl In ‘Toy Story 5’",
        "content": "",
        "upvotes": 1428,
        "comments": 89,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/2U10McmSjJZCou9utUa2THFQcUagvzQdJeukkiB0dLw.jpg?auto=webp&amp;s=e5a9e9e5782c6a749865eb9138e573ead4a4a730"
        },
        "permalink": "/r/movies/comments/1k4kwxu/ernie_hudson_taking_over_carl_weathers_voice_role/"
    },
    {
        "id": "1k4sfzb",
        "author": "letsgopablo",
        "title": "Free Solo (2018) is NERVE-WRACKING",
        "content": "Quite possibly the most nail-biting, edge-of-your-seat documentary I've ever watched in my life. My palms were sweaty for like, 90% of the runtime. The way each climb is shot by the filmmakers Jimmy Chin and Elizabeth Vasarhelyi can only be described as epic. The grand scale of Alex Honnold's achievement is presented perfectly by the camera work, from the wide angle shots that frame him dwarfed by the massive wall of death he's climbing, to the tight close-ups of his fingers and feet digging into the rock face. It doubles as both an account of a monumental feat in rock climbing and human endurance, and a character profile about the kind of person that is willing to put his life on the line in the pursuit of perfection. Alex comes across as equally fucking crazy and inspiring. God bless his wife, she's the real hero for having the patience and compassion to deal with this guy's insanity. Highly recommend this if you haven't seen it, definitely worth the watch.",
        "upvotes": 364,
        "comments": 73,
        "media": null,
        "permalink": "/r/movies/comments/1k4sfzb/free_solo_2018_is_nervewracking/"
    },
    {
        "id": "1k4o61c",
        "author": "SanderSo47",
        "title": "April 18-20 Box Office Recap: 'Sinners' opens with a fantastic $48 million domestically, making it the best opening for a live-action original film in years. Meanwhile, 'A Minecraft Movie' crosses $700 million worldwide.",
        "content": "https://preview.redd.it/ve54b1yp29we1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=d66d93333fd7c823d8b731a79eebfac3bfbba7ad\n\nOn Easter weekend, audiences decided to go watch ***Sinners***. The result? A #1 debut, and the biggest debut for an original film in the post-COVID era. While ***A Minecraft Movie*** had to cede the top spot, it's already over $700 million worldwide.\n\nThe Top 10 earned a combined $127.9 million this weekend. That's up a massive 109.7% from last year, when ***Civil War*** held the top spot from disappointing newcomers like ***Abigail*** and ***The Ministry of Ungentlemanly Warfare***.\n\nDebuting atop, Ryan Coogler's ***Sinners*** earned a fantastic $48 million in 3,308 theaters. This is the best debut for Coogler's career outside the ***Black Panther*** films. In fact, it's the biggest debut for a live-action original film in the post-COVID climate, opening above ***Nope*** ($44.3 million).\n\nSimply put, it's a fantastic start. Take into account, getting an original film to open this high is a miracle, given that audiences are pivoting to focusing on franchises. It's a testament to the strength of Ryan Coogler and Michael B. Jordan. So how they did succeed where other original films failed?\n\nFor the past decade, Coogler has earned some great good will, thanks to his works in films like ***Creed*** and ***Black Panther***. The films have earned fantastic reception, allowing him to finally get an original title like ***Sinners*** to get greenlit. It wasn't easy, obviously; a big reason why some studios turned it down was Coogler's request to have the film rights revert to him after 25 years. So Warner Bros. took the bullet and agreed to his terms, [a decision that apparently scared a lot of Hollywood executives.](https://www.vulture.com/article/to-hollywood-the-scariest-part-of-sinners-is-ryan-coogler.html)\n\nThe film's clear selling point was Coogler and Jordan, but the premise was also very important: a 1930s horror film, with Jordan playing twins. 2025 has been very weak for horror; the biggest horror film is ***The Monkey***, which hasn't even topped $70 million worldwide. The audience was starving for a horror film and ***Sinners*** arrived at the right time to offer just that. The film's fantastic reviews cannot be ignored either; it's sitting at a marvelous 98% on Rotten Tomatoes and 84/100 on Metacritic. That makes it one of the best films of the year, so even non-horror fans wanted to see if the film would live up to the hype.\n\nAccording to Warner Bros., the biggest demos were black (49%), Caucasians (27%), Hispanic and Latino (14%), and Asian (6%). They gave it an incredible \"A\" on CinemaScore. This makes it one of the few horror films to get an \"A\" on the site (***Poltergeist*** and ***Aliens*** are the other two) in its 46-year-old history. Yes, it's insanely hard for a horror film to get this grade.\n\nWhat does this mean? That the film is gonna have some damn great legs. It's already seen in the weekend; horror films can drop over 40% on Sunday, yet ***Sinners*** dropped just 25%. With no horror competition till ***Final Destination: Bloodlines***, ***Sinners*** can have a lot of space. For now, we're predicting a $170 million domestic total for the film, which is simply fantastic all around.\n\n***A Minecraft Movie*** dropped 48% this weekend, grossing $40.4 million. That's not a bad drop, but it's still rough just like last week's. The film is not collapsing, but it's not showing great legs either. The film has amassed $343.8 million so far, and it should still hit over $450 million domestically. \n\nUnsurprisingly, ***The King of Kings*** benefitted from the Easter weekend. It dipped just 9%, earning $17.5 million this weekend. That's one of the best holds for a film playing at over 3,000 theaters. Through 10 days, the film has earned $45.6 million, although with the holiday over, maybe it will have a steep drop next weekend.\n\n20th Century Studios' ***The Amateur*** was hit by the arrival of ***Sinners***. It dropped a rough 53%, earning $7 million this weekend. While the film was aiming an old audience that doesn't go to opening weekend, it looks like the film is struggling to leg out. Through 10 days, the film has earned a weak $27.1 million, and it remains a question mark if it will hit $40 million domestically.\n\nIn fifth place, A24's ***Warfare*** dipped 42%, adding $4.8 million this weekend. Through 10 days, the film has earned $17.1 million, and it will probably end its run with around $25 million domestically.\n\nUniversal/Blumhouse's ***Drop*** added $3.2 million this weekend, which is a poor 55% drop after its already low start. Despite positive reviews and word of mouth, the audience doesn't appear to be interested in the film. Through 10 days, it has earned just $13.4 million, and it's now guaranteed to miss $20 million domestically, making it one of Blumhouse's lowest grossing titles.\n\n***COLORFUL STAGE! The Movie: A Miku Who Can’t Sing*** managed to sneak into the seventh spot, despite playing in just 800 theaters, earning $2.8 million this weekend.\n\nFocus Features' re-release of ***Pride &amp; Prejudice*** earned $2.8 million in 1,393 theaters. That takes its lifetime total to $41.3 million.\n\n***The Chosen: Last Supper — Part 3*** collapsed 75% this weekend, earning just $1.5 million this weekend. Through all 3 installments, the show has made $42.9 million so far.\n\nRounding up the Top 10 was Disney's ***Snow White***, which is nearing the end of its run. It had another brutal 58% drop, earning just $1.2 million this weekend. The film's domestic total stands at a poor $84.6 million so far.\n\nBleecker Street released ***The Wedding Banquet*** in 1,142 theaters, although the film earned just $922,906. That means that the film is gonna make less than what Ang Lee's original made back in 1993 ($6.9 million).\n\nBut the real worst performer of the week was Briarcliff's animated film ***Sneaks***. Despite playing in 1,500 theaters, the film earned an abysmal $530,786 this weekend. That's one of the worst debuts for a film playing in over 1,000 theaters. Expect this to fade quickly.\n\nAhead of its wide release this week, A24's ***The Legend of Ochi*** debuted in 4 theaters, earning $52,514. That's a $13,129 per-theater average, which is quite low (usually buzzy titles like this make $25K or more). Let's just hope it can do better when it hits wide release.\n\nJanus Films also released David Cronenberg's ***The Shrouds*** in 3 theaters, where the film earned $49,361. Alos a low $16,454 per-theater average. It will continue expanding in the coming weeks.\n\n#**OVERSEAS**\n\n***A Minecraft Movie*** earned $59 million overseas, taking its worldwide total to $720 million. The best markets are the UK ($59.2M), Germany ($27.8M), Australia ($27.4M), Mexico ($24.8M) and China ($24M). The billion mark is becoming more and more likely, pals.\n\n***Sinners*** earned $15.4 million in 71 markets, taking its worldwide numbers to $63.5 million. The best debuts were in the UK ($3.2M), France ($2M), Mexico ($1.1M), Germany ($898K) and Australia ($842K). An okay start, but it's pretty clear it's gonna lean heavily on the domestic side.\n\n***The Amateur*** added a further $11.6 million this weekend, for a $63.8 million worldwide total. The best markets are the UK ($4.1M), France ($3.3M), Mexico ($3.2M), Japan ($2.3M) and Spain ($2M). At the very least, it should hit $100 million worldwide. That'd be great if it didn't cost $60 million.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Dog Man* | Jan/31 | Universal | $36,001,940 | $97,970,355 | $140,534,355 | $40M\n\n- DreamWorks' ***Dog Man*** has ended its run with $97 million domestically and $140 million worldwide. Definitely a success, given it cost just $40 million. But something weird about the film are its legs. Normally, animated films leg out to a 3x multiplier. But ***Dog Man*** finished with just a 2.72x multiplier, making it one of the most front-loaded animated films. While the Super Bowl impacted its second weekend, not hitting the $100 million milestone after its debut is kinda disappointing. But then again, this should be enough if DreamWorks wants a new franchise.\n\n#**THIS WEEKEND**\n\nWe've got three wide releases, though it's unlikely any of them can take the top spot.\n\nThe closest that could challenge the top spot is Amazon MGM's ***The Accountant 2***, which brings back Ben Affleck, Jon Bernthal, Cynthia Addai-Robinson, and J. K. Simmons in their roles. The original film earned $155 million worldwide, and has been a huge success in streaming and home media, so a sequel was pretty much imminent. Although the 9-year gap raises concerns that they might have waited too long.\n\nAnother release is Sony's ***Until Dawn***, an adaptation of the video game. Director David F. Sandberg has had success in the horror field, and in fairness, the movie tries to change things up from the game. Nevertheless, the film's premise (a time loop involving different killers) suggests it pretty much abandoned the game's original plot. It remains to be seen if the fans will be willing to buy a ticket.\n\nAnd as mentioned, A24's ***The Legend of Ochi*** is hitting wide release. The limited release numbers were quite underwhelming, but perhaps it could surprise when it hits wide release.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 573,
        "comments": 98,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/INU4HbZtF13F77xKBrA7EXM3ghda1jdBFgWni3VG1EI.png?auto=webp&amp;s=a746808332b8b7877d66c9188411044498aea617"
        },
        "permalink": "/r/movies/comments/1k4o61c/april_1820_box_office_recap_sinners_opens_with_a/"
    },
    {
        "id": "1k4k0ur",
        "author": "MarvelsGrantMan136",
        "title": "‘Ready or Not: Here I Come’ Adds Sarah Michelle Gellar, Elijah Wood and More as Searchlight Sequel Starts Production",
        "content": "",
        "upvotes": 917,
        "comments": 115,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/jnCQIGdsKEpzMAwEr-jTANl5r14yrbua1BnWtYr-UaA.jpg?auto=webp&amp;s=16fdc769793b2c3f642eea2493b610c9657b4b40"
        },
        "permalink": "/r/movies/comments/1k4k0ur/ready_or_not_here_i_come_adds_sarah_michelle/"
    },
    {
        "id": "1k4gzgb",
        "author": "cruelsummerbummer",
        "title": "Weapons | Teaser",
        "content": "",
        "upvotes": 1301,
        "comments": 281,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/d0jpE60recb7ladjZGPmzpGfhiC3Z_CUcxE-8CmK3TE.jpg?auto=webp&amp;s=596c4516c3309855c4ecc76a2c56546281f521b6"
        },
        "permalink": "/r/movies/comments/1k4gzgb/weapons_teaser/"
    },
    {
        "id": "1k4dndi",
        "author": "indiewire",
        "title": "'Sinners' Packs in Lots of Irish Music, Ryan Coogler Explains",
        "content": "",
        "upvotes": 1331,
        "comments": 150,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-WRxuEXw0yGXZbLfKzWkMuCNmxKRMW0EKAG8S-SOuJU.jpg?auto=webp&amp;s=143bb5eeb21faa5231cf8bc05750ff29b323acfe"
        },
        "permalink": "/r/movies/comments/1k4dndi/sinners_packs_in_lots_of_irish_music_ryan_coogler/"
    },
    {
        "id": "1k4wtwl",
        "author": "dcterr",
        "title": "Dave",
        "content": "I just watched Dave tonight for about the 10th time. I love this movie! Not only is it a superbly acted comedy, but I think it also makes the very good point that anyone with a good heart could make a great president, which is what I think we need now more than ever! I also like how Dave was able to get all the right people on his side against the evil Secretary of Arms and ends up falling in love with the former First Lady. Hey, it could happen!",
        "upvotes": 61,
        "comments": 39,
        "media": null,
        "permalink": "/r/movies/comments/1k4wtwl/dave/"
    },
    {
        "id": "1k4l65c",
        "author": "KillerCroc1234567",
        "title": "‘Succession’ Star Alan Ruck Joins Horror-Thriller ‘Corporate Retreat’",
        "content": "",
        "upvotes": 303,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L1vwNJUmgzPGzLvvoKWYT34qlH3KouLSDVeumhqivt0.jpg?auto=webp&amp;s=1f0362e95553e49e28a511ad6a5c1b82e179b081"
        },
        "permalink": "/r/movies/comments/1k4l65c/succession_star_alan_ruck_joins_horrorthriller/"
    },
    {
        "id": "1k4ez4h",
        "author": "JazzlikeTea7432",
        "title": "Remember when Tom Hanks who made a great transition from successful comedy films to a big bunch of drama films. Which other actors who started off comedy made a big jump to a dramatic actor?",
        "content": "Tom Hanks in his beginning run in Hollywood had a bunch of comedy films success like Splash 1984, even one of the film with Dan Aykroyd released in 1987 I can't remember the name of it, Big 1988, Turner and Hoach 1989, The Burbs 1989, A league of their own 1992 and others. But until he did Philadelphia 1993 he became a dramatic actor and even he did Forrest Gump afterwards he had a great transition.\n\nBut which other actors who started out comedy then became a dramatic actor just like Tom Hanks did the jump from a goofy actor to serious actor well any suggestions about this?",
        "upvotes": 623,
        "comments": 747,
        "media": null,
        "permalink": "/r/movies/comments/1k4ez4h/remember_when_tom_hanks_who_made_a_great/"
    },
    {
        "id": "1k4fcox",
        "author": "RomanReignsDaBigDawg",
        "title": "Miles Caton and Ludwig Göransson perform \"I Lied to You\" from Sinners",
        "content": "",
        "upvotes": 502,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ObQqxYcXYkCxvx7C4cP1Ytisr6YBUy9apPj2XiLQse4.jpg?auto=webp&amp;s=8f6e9850f46f04da89e678793975878deec1e350"
        },
        "permalink": "/r/movies/comments/1k4fcox/miles_caton_and_ludwig_göransson_perform_i_lied/"
    },
    {
        "id": "1k4hf0z",
        "author": "chewychubacca",
        "title": "Summer Camp movies to get an 11 year old boy excited about sleepaway summer camp?",
        "content": "All I know about are movies from the 80s and 90s. I'm looking for something more modern, to help excite an ADHD kid about what fun possibilities there are at a sleepaway summer camp. Doesn't have to be particularly realistic, just something that gives an exciting vibe to get a kid over the hump of \"no, i'll hate it\", to \"maybe that will be fun, let's try it\". ",
        "upvotes": 340,
        "comments": 629,
        "media": null,
        "permalink": "/r/movies/comments/1k4hf0z/summer_camp_movies_to_get_an_11_year_old_boy/"
    },
    {
        "id": "1k4t6l9",
        "author": "BunyipPouch",
        "title": "Announcement - Our AMA/Q&amp;A with Peter Stormare ('Fargo', 'Constantine', The Big Lebowski', 'Prison Break, 'Until Dawn', 'Armageddon', 'Bad Boys 2', 'John Wick 2') is now live and Peter will be back on Tuesday 4/22 at 12:30 PM ET to answer your questions.",
        "content": "",
        "upvotes": 70,
        "comments": 10,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qbfpfvr76awe1.png?auto=webp&amp;s=792224d042124960f874ce57b53c7d8cfd2f2417"
        },
        "permalink": "/r/movies/comments/1k4t6l9/announcement_our_amaqa_with_peter_stormare_fargo/"
    },
    {
        "id": "1k4u6nh",
        "author": "skrtlee7",
        "title": "Movies that will distract my mind from reality",
        "content": "I’ve had a really tough day dealing with my anxiety and depression. I’ve been studying for my exams nonstop and need a movie to take my mind off of everything. I don’t want a movie that will uplift me or anything, I mean a movie that will take my mind off of everything. For reference, if I hadn’t already seen Scarface, inglorious bastards, Django unchained, then those would be the perfect movie for my scenario. Please lmk if you have any suggestions for me\n\nUpdate:\nI chose to watch seven. HOWEVER, I feel like this constantly so PLEASE KEEP ADDING MORE MOVIES for myself and others!! Thank you so much",
        "upvotes": 58,
        "comments": 111,
        "media": null,
        "permalink": "/r/movies/comments/1k4u6nh/movies_that_will_distract_my_mind_from_reality/"
    },
    {
        "id": "1k4ufeo",
        "author": "mikebwriter",
        "title": "Just bought a Possessor poster. Brandon Cronenberg is doing his father proud—this might be one of the smartest shockers I’ve seen.",
        "content": "I think \\*Possessor\\* (2020) is an absolute beast of a film. Grotesque, potent, and genuinely intelligent — not just another slick horror concept, but a brutal, evocative exploration of identity, corporate ethics, and psychological fragmentation. The idea of possession-as-a-service for assassination, with plausible deniability baked into its very mechanics (“no one would believe it anyway”), is such a strong sci-fi premise. But what really blew me away is how \\*\\*expertly it’s implemented\\*\\*.\n\nThe creative violence feels like early Rodriguez if he had a Cronenberg soul. Every shock is earned, not just stylized — and that final stretch? Devastating. Cronenberg Jr. Doesn’t just live up to his dad’s legacy — he’s mutating it into something uniquely his own.\n\nI loved it so much I bought a poster. Next on my haul is \\*Possession\\* (1981), which I’ve heard is equally deranged but in a totally different register.\n\nAnyone else vibe with \\*Possessor\\* this hard? Or have other twisted, intelligent horror recs in the same lane?",
        "upvotes": 50,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1k4ufeo/just_bought_a_possessor_poster_brandon_cronenberg/"
    },
    {
        "id": "1k4dsjk",
        "author": "CheechAndChongAMA",
        "title": "Hey r/movies! I'm David Bushell, director of CHEECH &amp; CHONG’S LAST MOVIE, the new doc that stars Cheech &amp; Chong and traces their legacy as groundbreaking comedians &amp; counterculture icons. I’ve produced other films like SLING BLADE, ETERNAL SUNSHINE OF THE SPOTLESS MIND and DALLAS BUYERS CLUB. AMA!",
        "content": "Hey r/movies! - I'm David Bushell (you can call me Dave), director and producer of CHEECH &amp; CHONG’S LAST MOVIE, the new “movie-mentary” that stars Cheech and Chong and traces their legacy as groundbreaking comedians and counterculture icons. I’ve produced and executive produced other films like SLING BLADE, ETERNAL SUNSHINE OF THE SPOTLESS MIND and DALLAS BUYERS CLUB! I'll be back at 7:00pm ET today to answer your questions. Ask me anything!\n\nMore info:\n\nOfficial Trailer:\n\n[https://www.youtube.com/watch?v=yFZaR4ubS20](https://www.youtube.com/watch?v=yFZaR4ubS20)\n\nCHEECH &amp; CHONG’S LAST MOVIE – Exclusively in Theaters Friday 4/25 🥦\n\nIn the 1970s, Cheech &amp; Chong redefined stand-up comedy, blending drugs, sex, rock’n’roll, and improvisation into a genre-shaping act. Their multicultural, irreverent humor turned them into icons, counterculture rock stars, and Hollywood legends. How did Cheech and Chong ignite imaginations and stay relevant over 50 years? Join them for one last ride to find out... and bring a bud!\n\nDirected by: David Bushell\n\nProduced by: David Bushell and Robbi Chong\n\nStarring: Cheech Marin and Tommy Chong\n\n",
        "upvotes": 230,
        "comments": 81,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tty7wplwy6we1.png?auto=webp&amp;s=b8633f16ea613ba7bfa1e29fea679d8226484a9a"
        },
        "permalink": "/r/movies/comments/1k4dsjk/hey_rmovies_im_david_bushell_director_of_cheech/"
    },
    {
        "id": "1k3wc44",
        "author": "ShoebillJoe",
        "title": "Little Miss Sunshine hits HARD in 2025",
        "content": "I (37 M) cried multiple times on this rewatch. A family is struggling financially while torn apart by generational gaps, politics, and ethics. Familial failure is held together only by their need to help a little girl. Not to help her win, but to simply participate in her dream. A twisted dream defined by poor American standards. But despite the family's failures, they are brought together by what really mattered the whole time: their love for one another and a common goal. \n\n  \nIt's also a great look at early Carell and Dano. \n\n  \nDoes anyone else miss those feelgood vibes that we were getting in the early 2000s from indie movies before streaming was huge?",
        "upvotes": 5062,
        "comments": 354,
        "media": null,
        "permalink": "/r/movies/comments/1k3wc44/little_miss_sunshine_hits_hard_in_2025/"
    },
    {
        "id": "1k4nusg",
        "author": "Character_Habit8513",
        "title": "How did Matilda's (1996) production create the cereal scene? The one where she fully mastered her telekinesis?",
        "content": "When I was young I am really amazed on the practical effects of that movie and recently I watched it again and appreciated it more.\n\nCouldn't find any source on how they made the cards and chips fly, and other movie magic they did. Like when she levitated the water jug, or the chalk writing.\n\nWould appreciate if anyone could give a serious answer, thank you!",
        "upvotes": 61,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1k4nusg/how_did_matildas_1996_production_create_the/"
    },
    {
        "id": "1k4on42",
        "author": "Freddy-Philmore",
        "title": "David Cronenberg has a new film coming out. I saw 3 of his classics in theaters this month (Rabid, Fly, Crash). Got a favorite or what do you think of him?",
        "content": "His new one is just coming out, but he’s been making people uncomfortable since the ’70s.\n\nI recently caught *Rabid*, *The Fly*, and *Crash* in theaters... each one incredibly absorbing in its own way. He’s just *so* good at body horror and making you squirm.\n\n*Crash* was especially wild. There’s no traditional plot... it's more about mood and atmosphere. The whole thing is sexual, creepy, and totally hypnotic.\n\nHe’s moved away from straight horror but has stayed completely relevant.\n\nI want to see Crimes of the Future before I catch the new one. ",
        "upvotes": 48,
        "comments": 84,
        "media": null,
        "permalink": "/r/movies/comments/1k4on42/david_cronenberg_has_a_new_film_coming_out_i_saw/"
    },
    {
        "id": "1k4y95u",
        "author": "Gobiggs88",
        "title": "What did IFC (Channel) used to be like?",
        "content": "I wasn’t around when it was like this but I know that IFC used to be a channel showing nothing but independent films, now all they show is Two and a Half Men reruns. For those who were there, what did IFC use to be like? It sounds like heaven for a cinephile to just turn on a channel and watch an independent film that you would have never heard of any other way. I wish I could have been around when it was like this. ",
        "upvotes": 9,
        "comments": 32,
        "media": null,
        "permalink": "/r/movies/comments/1k4y95u/what_did_ifc_channel_used_to_be_like/"
    },
    {
        "id": "1k4wody",
        "author": "kaolackian",
        "title": "Watching Love Lies Bleeding (2024) and Ed Harris plays Jena Malone’s dad. Mind blowing that this same dynamic occurred in Stepmom (1998)!",
        "content": "Was watching one of their scenes together and my brain was tickled because I kept thinking, Haven't they done something together? Reunited as father and daughter 26 years later!\n\nI couldn't find anything else about this so I thought I would post. It's crazy to me that they have both had incredible careers since 1998 and they are back in the same movie.",
        "upvotes": 13,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1k4wody/watching_love_lies_bleeding_2024_and_ed_harris/"
    },
    {
        "id": "1k41k7p",
        "author": "indiewire",
        "title": "David Cronenberg Doesn't Care About Movie Theaters",
        "content": "",
        "upvotes": 1166,
        "comments": 253,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/J_TM_5C5PuDRrAR1PRlF0CYjnAbWwOdkwLXKw-aoJGg.jpg?auto=webp&amp;s=4ddb30a8169d727c5c8e94df536e5f344c8a8aff"
        },
        "permalink": "/r/movies/comments/1k41k7p/david_cronenberg_doesnt_care_about_movie_theaters/"
    },
    {
        "id": "1k40i81",
        "author": "Amaruq93",
        "title": "\"The Bride of Frankenstein\" at 90: A 1935 horror sequel that changed movies forever",
        "content": "",
        "upvotes": 1325,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kM8BMACAcIVRdvHlrb1f7z2yid7XmDmLEmhixn5L_kQ.jpg?auto=webp&amp;s=dd662caf40ad6194ed0a74c3b872dd870fc8b032"
        },
        "permalink": "/r/movies/comments/1k40i81/the_bride_of_frankenstein_at_90_a_1935_horror/"
    },
    {
        "id": "1k4bbq0",
        "author": "Polyglotpen",
        "title": "What's one movie scene that just sticks in your head, even years later? What makes it so memorable?",
        "content": "Hey folks,\n\nYou know those movie scenes that just get stuck in your brain and you can't shake them? Not necessarily the best scene ever, or from your favorite movie, but just a single, specific moment that pops up in your head out of nowhere, even years after you've seen it.\n\nWhat's that one scene for you? What movie is it from, and what's so unforgettable about it? Was it something shocking, something beautiful, something weird, or just a really powerful moment?\n\nFor me, it's definitely a few moments from Annihilation. But one that really messed with me was when they get deeper into the Shimmer and you start seeing how the mutations are blending everything together. Like those flowers that had human-like features, or even the way the crew members started to get mixed up with the environment and each other. That whole visual of nature and people merging in this bizarre, unnatural way was so creepy and unsettling. It really made you think about what was happening in that zone. That whole idea of things losing their boundaries and becoming something else… yeah, that sticks with you. Coming from a person with plant biology background may be a reason. \n\nWhat's that one scene for you? Share the movie and what made that specific moment so unforgettable. Let's hear those scenes that are just stuck to your memory!",
        "upvotes": 159,
        "comments": 431,
        "media": null,
        "permalink": "/r/movies/comments/1k4bbq0/whats_one_movie_scene_that_just_sticks_in_your/"
    },
    {
        "id": "1k4ruvn",
        "author": "veryken",
        "title": "Deja Vu (2006) w/ Denzel Washington, Val Kilmer, Paula Patton",
        "content": "What are some unexplained and abrupt sequences you found? I watched the movie for the first time last night and really enjoyed it. It took the usual suspension of disbelief for the plot of time displacement. All good. Very interesting. Captivating. But there were some scenes that popped in from nowhere.\n\nFor one, how did Doug perfectly get onto a gurney in the local hospital in front of emergency doctors in his warp jump? Did I miss something?",
        "upvotes": 15,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1k4ruvn/deja_vu_2006_w_denzel_washington_val_kilmer_paula/"
    },
    {
        "id": "1k4y2pr",
        "author": "BlightKagami",
        "title": "The Place Beyond the Pines",
        "content": "I love this movie. I watched it again just now and it still holds up. There's just one thing I could never quite wrap my head around. What was the deal with AJ? \n\n\nI figure his weird mannerisms and weird way of talking were a byproduct of him trying to be a gangster or a tough cool kid, and also his drug habit. But is there something else that I'm missing? \n\n\nI've more or less figured that he approached Jason at first because Jason felt safe and non-threatening. I guess their similar tastes might have also made them resonate with one another, however briefly but rewatching the movie as an adult it seems self-evident that Jason didn't have many friends at school. \n\n\nSo was AJ like a bully? Did he prey on people like this a lot? Was he gay? When Avery told him not to touch Jason did he mean figuratively? As in don't get near him? Or did he mean don't hurt him? I've always been fascinated by AJ. He's definitely a fraud with a mean streak but his relationship with his father is in shambles, and its pretty obvious he was only called out to live with Avery to bolster his campaign image.",
        "upvotes": 5,
        "comments": 4,
        "media": null,
        "permalink": "/r/movies/comments/1k4y2pr/the_place_beyond_the_pines/"
    },
    {
        "id": "1k4wn0w",
        "author": "Able_Stomach_",
        "title": "Legally blonde - Ahead of its time",
        "content": "Legally blonde can eat Barbie and other such movies. Literally the best rewatch every single time. I didn't know about its part 2 tho, has anyone watched it? \nIs it as good as part 1?\n\nAlso, if anyone can recommend me a similar movie just like legally blonde. Really boost my confidence &amp; motivates me everytime I watch it.",
        "upvotes": 7,
        "comments": 11,
        "media": null,
        "permalink": "/r/movies/comments/1k4wn0w/legally_blonde_ahead_of_its_time/"
    },
    {
        "id": "1k3pmdc",
        "author": "Retrofusion11",
        "title": "Fury Road is absolutely incredible… how did no one die filming this movie",
        "content": "Might be the GOT action film, phenomenal filmmaking. The fact that no one was killed on this movie is actually a feat in its entirely. Is it true that Miller didn't write a script but had each scene sketched and drawn out? either way this movie's failure at the box office will be talked about for years to come. It should of been a success ",
        "upvotes": 3173,
        "comments": 492,
        "media": null,
        "permalink": "/r/movies/comments/1k3pmdc/fury_road_is_absolutely_incredible_how_did_no_one/"
    },
    {
        "id": "1k3iybx",
        "author": "evilangel101",
        "title": "Always loved Jena Malone's and Emily Browning's response to how it feels to play a sexualized female character.",
        "content": "",
        "upvotes": 13323,
        "comments": 974,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kdzacz0lmyve1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/movies/comments/1k3iybx/always_loved_jena_malones_and_emily_brownings/"
    }
]