[
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 76,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1j0p35u",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for July to December 2024 for over 15,000 titles",
        "content": "",
        "upvotes": 20,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1j0p35u/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1lvsll9",
        "author": "grasskisser",
        "title": "Netflix cancels The Residence",
        "content": "I just read this and I am so upset! I really enjoyed this show, so did everyone else I know who watched it. It was about a murder in the White House, and it really kept me guessing the whole time. Cordelia  Cupp, a modern day Columbo, and bird watcher was riveting!  I am so sad because Netflix, in my opinion, does this with so many shows. I wish they would at least commit and do less shows for production. They have so much junk on the platform that is no good, but this was, it really was! Tell me what you ladies and gentleman think below. Am I the only one? I would love to hear your thoughts. ",
        "upvotes": 127,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1lvsll9/netflix_cancels_the_residence/"
    },
    {
        "id": "1lvg8bt",
        "author": "Darkstar_111",
        "title": "The Sandman season 2 is... Actually really good!",
        "content": "Hate to say it, considering the allegations against the creator is harsh and serious. But the second season is better than the first. It feels carefully crafted, the actors are giving us a nuanced rendition of impossible characters and every episode flows by... Like a dream...\n\nSorry, had to go there. 🤭",
        "upvotes": 104,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1lvg8bt/the_sandman_season_2_is_actually_really_good/"
    },
    {
        "id": "1lv8tec",
        "author": "ironfalafel",
        "title": "I'm Convinced Old Guard 2 story was created and mostly written by AI, and that's why it sucked.",
        "content": "Title says it all. To wait five years for a sequel to such an original story sucked as it is, but to then receive what we got as the final product was just a slap in the face to the audience. \n\nThe entire premise seemed like it was generated using AI along with the script. Everything was just so choppy and the movie felt like it had absolutely zero substance to it. \n\nI'd almost rather pretend we never got a sequel at all. ",
        "upvotes": 134,
        "comments": 52,
        "media": null,
        "permalink": "/r/netflix/comments/1lv8tec/im_convinced_old_guard_2_story_was_created_and/"
    },
    {
        "id": "1lvzwvm",
        "author": "at1991",
        "title": "Mr. Robot, captions done match and music doesn't at times.",
        "content": "Kinda annoyed they changed some of the music. I watch with captions and they changed a OutKast song.....changed the word r.kelly (which was a more appropriate reference) to \"more but than an ashtray\" I understand copyrights but still it's part of the art. End of rant. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lvzwvm/mr_robot_captions_done_match_and_music_doesnt_at/"
    },
    {
        "id": "1lvl51z",
        "author": "buildingthebandnews",
        "title": "Building The Band premiered on Netflix tonight!",
        "content": "What was everyones thoughts? would love to know your favourite performances, who you loved, who you hated, best/worst bands formed?! my only disappointment was no Liam Payne in the first drop of episodes. I did love the tribute they did tho &lt;3",
        "upvotes": 10,
        "comments": 34,
        "media": null,
        "permalink": "/r/netflix/comments/1lvl51z/building_the_band_premiered_on_netflix_tonight/"
    },
    {
        "id": "1lviehl",
        "author": "gamerz0111",
        "title": "(Squid Game S3 spoilers) Anyone else disappointed with these two plot threads?",
        "content": "[I really thought Seong Gi-hun’s commando subplot was building up to something big — like a major action set piece once they reached the island. But instead, they got mowed down like fish in a barrel, and we were left with two guys who barely contributed to anything.](https://squid-game.fandom.com/wiki/Seong_Gi-hun#articleComments)\n\nThen there was the former North Korean soldier subplot, which felt like it belonged in an entirely different show. It barely intersected with the main characters or the core storyline. After all that gunfire, are we really supposed to believe the Front Man didn’t notice a thing?",
        "upvotes": 15,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lviehl/squid_game_s3_spoilers_anyone_else_disappointed/"
    },
    {
        "id": "1lvgc71",
        "author": "ToonAdventure",
        "title": "Wednesday: Season 2 | Official Trailer | Netflix [July 9 at 5:58 AM PT]",
        "content": "",
        "upvotes": 14,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lvgc71/wednesday_season_2_official_trailer_netflix_july/"
    },
    {
        "id": "1lvzzg3",
        "author": "Peg_Leg_Vet",
        "title": "Netflix Removed My Downloads Unexpectedly",
        "content": "I am currently traveling and will be for pretty much the whole month of July. Before leaving the US, I made sure to download a good bit of content to watch on the different plane flights. Imagine my suprise when not even two days into my trip, all of my downloaded content was gone. One movie I had downloaded just that morning while on a layover. I had only watched one movie and a couple episodes of a new season of a show. Then, to make it worse, I can't re-download any of that content because I hit my monthly limit. On top of that, I tried to download some content on another device, but am not even being given the option to do so anymore even though I have in the past.\n\nI was able to contact Netflix support who could offer no actual explanation for why my content was now missing or why I could not download to a second device. Both devices were showing under my account with titles being downloaded. And their only suggested solution was to pay for a higher tier of service that would allow me to download more content (I'm on the ad supported tier) since the one device that can download content has already maxed it's limit. That has got to be the biggest corporate greed solution ever. Why should I pay more for a service when I am not even getting what I am paying for now? I'm paying for a service that will let me download some content for travel without removing it mysteriously and without warning. I don't need 100 downloads, 15 is fine. I'm also paying for a service that is supposed to allow downloading content on two devices. Yet that isn't working either anymore. Both of my devices are new and fully compatible, and I have downloaded on both in the past. \n\nSo now I have dozens of hours to look forward to on airplanes with none of the content I was really looking forward to watching. Fortunately I still have some content from other streaming services who haven't removed my downloads mysteriously. I've been a Netflix customer since the days of mail DVDs, but this has honestly got me thinking to finally ditch Netflix. It's clear they care more about their short term profit than actually keeping customers.",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1lvzzg3/netflix_removed_my_downloads_unexpectedly/"
    },
    {
        "id": "1lvzvsp",
        "author": "SWSenthusiast",
        "title": "Can't watch Squid Game???",
        "content": "I keep getting an error that says \"This title is not available to watch instantly. Please try another title.\" whenever I try to open an episode of Squid Game.\n\nI'm able watch The Sandman, The Double, Castlevania, and everything else on my list. Is anyone else having this issue?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lvzvsp/cant_watch_squid_game/"
    },
    {
        "id": "1lvztcg",
        "author": "Dangerous_Phase_299",
        "title": "show recommendations",
        "content": "My little sister (11f) is going to a soccer camp tomorrow and needs some show recommendations. She has been obsessed with Stranger Things, but that's not the best option because she's going to be away from home and sharing a room with another kid, so we don't want to worry abt nightmares for either of them. Do you have any show or movie recommendations? preferably PG, but PG-13 is okay. Thanks!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lvztcg/show_recommendations/"
    },
    {
        "id": "1lvzgbo",
        "author": "MaxwellSmart07",
        "title": "Nominations for the worst series currently playing on Netflix?",
        "content": "I’ve seen a lot of losers, well actually I’m mostly on Reddit while my wife watches. Currently she is watching Blindspot, a ridiculous the world’s going to blow up every day FBI drams (um, farce). That’s my nomination. Any others anyone wants to warn me about. Thanks.",
        "upvotes": 1,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lvzgbo/nominations_for_the_worst_series_currently/"
    },
    {
        "id": "1lvtdxo",
        "author": "Academic-Ganache702",
        "title": "The sandman serie is deep",
        "content": "I am watching the sandman rn (being stoned) on netflix. And this movie is probably the best way to experiende how shrooms feel😅\n\nThe way how it puts you to think about life, death and certain things in live. You trip a bit and than stuff becomes clear.\n\nJust wow",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lvtdxo/the_sandman_serie_is_deep/"
    },
    {
        "id": "1lv80xo",
        "author": "greenhierogliphics",
        "title": "Animal kingdom no stopping",
        "content": "This series started kind of slow to me, but once it got rolling there’s just no stopping. I need to get to bed, but I NEED to see what’s going to happen next! On season 2 beginning episode 6. ",
        "upvotes": 50,
        "comments": 30,
        "media": null,
        "permalink": "/r/netflix/comments/1lv80xo/animal_kingdom_no_stopping/"
    },
    {
        "id": "1lvwavx",
        "author": "popsum22",
        "title": "shows I can binge on pls",
        "content": "I’ve finished modern family, Brooklyn nine nine, friends, pll. Just don’t have the energy to browse for hours lol, what show have you liked recently? I loved squid games so wouldn’t mind something like that but also something with abit of comedy. I loved love is blind uk, couldn’t get into the other ones unfortunately!",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1lvwavx/shows_i_can_binge_on_pls/"
    },
    {
        "id": "1lvw01k",
        "author": "Desperate-Pin9777",
        "title": "Recommendations",
        "content": "I’ve watched many series so far I loved loved squid game, money heist, all of us are dead. So you people know my taste then. Can you guys recommend me any similar series? 🎀",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lvw01k/recommendations/"
    },
    {
        "id": "1lvmonh",
        "author": "M_M_2",
        "title": "Is Mr robot on Netflix ?",
        "content": "I live in Lebanon, I've been waiting for Mr robot to come back on Netflix and I've been seeing people finding the series on Netflix, it says on the internet that it comes back on July 3 and i still don't have it.",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lvmonh/is_mr_robot_on_netflix/"
    },
    {
        "id": "1lvveq0",
        "author": "mebcbb",
        "title": "Resolution decreasIle? mobile?",
        "content": "It's seems that Netflix is decreasing video resolution when viewing on mobile. Sometimes I like to watch higher resolution but it forces me to watch lower quality.  Has anyone else noticed this? Do you know what they are doing?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lvveq0/resolution_decreasile_mobile/"
    },
    {
        "id": "1lvt4kr",
        "author": "Blademir1708",
        "title": "The story of kpop demon hunters was really weird (SPOILERS)",
        "content": "KPop Demon Hunters is an extremely fun movie, with banger songs, amazing vocal performances, and godly animation (sony is so good at this style). Yes, i loved the movie, but the story just left me confused at the end.\n\nWhile watching the movie, I thought that the movie was about how no one is truly evil, and everyone deserves a second chance. The evidence of this being the girls not wanting to use a diss track to make the golden honmoon because they didn't want to do it with hate, and also Jinu's whole backstory. Yes Jinu did leave his child but Rumi said in the movie that that's not all he is, which led me to believe that this would serve as a signal that demons can also be good. Also, Gwi Ma was the one who used the demons fears to take control over them, so they couldn't be completely at fault.\n\nDespite all this, Gwi Ma dies (which is expected), but every demon dies as well. Are we to believe that all of them deserved that death? Because that's not the message the movie was hinting at earlier. Jinu dies, and yes it could be argued that he paid the price for his sins, but I'd argue that 400 years of tormenting voices of his family was enough torture for the character. I feel like it would've been more interesting if they'd explored the idea of Gwi Ma being evil, and demons the humans who made mistakes and are now paying the price.\n\nThe plot point of Rumi being a half demon was interesting, and led to the actual message of the movie, of not being ashamed of you are, but it could've been explored more. The same applies to her relationship with Celine, which was just served to us through flashbacks.\n\nAlso, not a real criticism, but just a side note, what happened to the missing persons cases, cause their souls are just gone? Was the identity of Gwi Ma and Saja being demons now known to everyone? Did everyone just accept that fact?\n\nTLDR; fucking amazing animation, songs, voice acting (glad they didn't do chris pratt as jinu), and an extremely fun movie, but the plot left more to be desired\n\n  \n(Also, the sort of romance between jinu and rumi was weird, it's literally the 1000 year old anime girl that looks like she's 9 years old, but a little better)",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1lvt4kr/the_story_of_kpop_demon_hunters_was_really_weird/"
    },
    {
        "id": "1lvs9o5",
        "author": "kleverrboy",
        "title": "Liam Payne’s Posthumous Appearance On New Netflix Competition Show Has Fans In Their Feels",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lvs9o5/liam_paynes_posthumous_appearance_on_new_netflix/"
    },
    {
        "id": "1lv6cgu",
        "author": "Comprehensive-Way482",
        "title": "'Monster' Season 4 in the Works at Netflix, Focused on Lizzie Borden",
        "content": "",
        "upvotes": 29,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lv6cgu/monster_season_4_in_the_works_at_netflix_focused/"
    },
    {
        "id": "1lvrjd6",
        "author": "ThrowingAway19674",
        "title": "Can I block the carousel ads for live events?",
        "content": "I'm using the default Netflix app on my smart TV. I just don't want to see adverts (or whatever the specific term is?) for these upcoming 'events', and for some reason it really riles me that I can't let Netflix know that I have absolutely no desire for this sorta thing to be hawked at me.\n\nThe problem seems to be that I can't go to 'more info' and give it a thumbs down. Ideally there'd be the option to say 'no interest' 🤷‍♂️",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lvrjd6/can_i_block_the_carousel_ads_for_live_events/"
    },
    {
        "id": "1lvi53t",
        "author": "S4v1r1enCh0r4k",
        "title": "Jenna Ortega Is Back and Darker Than Ever in 'Wednesday' Season 2 Trailer",
        "content": "",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1lvi53t/jenna_ortega_is_back_and_darker_than_ever_in/"
    },
    {
        "id": "1lvq16z",
        "author": "RuckFeddit980",
        "title": "Did you ever notice how many Netflix shows have terrible endings?",
        "content": "(May contain spoilers)\n\nSex Education - I have already talked at length about why I think this is one of the worst series finales of all time. It undermines the entire show and makes me wish I never watched it.\n\nSquid Game - Ending was extremely dark. Maybe some people liked it, but it was controversial at best.\n\nDisenchantment: Bean really needed to have her “moment” with the other characters, especially Elfo. But instead she just bailed without even saying goodbye.\n\nFuller House: Just a triple wedding that we had been waiting for forever. Didn’t really add anything to the show.\n\n13 Reasons Why: Didn’t see this one, but the reviews of the ending were very bad. I read the book, and if it’s true that, in the TV version, Hannah Baker comes back as a ghost, then it is taking such a giant (bleep) on the book that I couldn’t bear to watch it.\n\nNot sure if I should count GLOW - the ending was never even made because of COVID.\n\nThe endings of OITNB and Never Have I Ever were passable, and I’ve heard good things about the Grace &amp; Frankie finale.\n\nBut still, I’m starting to think that going forward, I should wait for shows to be finished and gauge the reaction before I even start watching them.\n",
        "upvotes": 1,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1lvq16z/did_you_ever_notice_how_many_netflix_shows_have/"
    },
    {
        "id": "1lvk741",
        "author": "Unhappy_Jello_1559",
        "title": "How do I remove saved log in info to an android tv?",
        "content": "I want to remove my saved log in info of my netflix account in my tv because I will be selling it soon, but I just can't seem to find how. I sign out it in manage devices and delete netflix data in settings, but everytime I open netflix it is suggested acc with saved username and password. I guess, it is saved in password manager? Pls help ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lvk741/how_do_i_remove_saved_log_in_info_to_an_android_tv/"
    },
    {
        "id": "1lv9q2w",
        "author": "tealbubblewrap24",
        "title": "New layout sucks. Is there any way to return to the old one?",
        "content": "My TV doesn't let me navigate easily to see literally ANYTHING anymore. I wanna scroll movies? Gotta scroll all the way to the top. TV shows? All the way to the top. My List? All the--you get it. It sucks. It's not user-friendly at all. It makes me want to unsubscribe. How can we roll back to the prior layout?",
        "upvotes": 12,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1lv9q2w/new_layout_sucks_is_there_any_way_to_return_to/"
    },
    {
        "id": "1lvo5sj",
        "author": "GoldDerby",
        "title": "Colin Farrell vs. 'Adolescence' star Stephen Graham: From costars to Emmy competitors",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lvo5sj/colin_farrell_vs_adolescence_star_stephen_graham/"
    },
    {
        "id": "1lvcqd4",
        "author": "kachigakachiguhhh",
        "title": "Is Sirens a comedy at all?",
        "content": "When it first came out it was labeled as comedy, then dark comedy, and now it’s categorized as drama.\n\nIt screams White Lotus copy + paste to me so far, midway through E2. \n\nI was looking for a light wind down show after a long day. Wondering if I should continue watching or find something else. (I just finished North of North and loved that) ",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1lvcqd4/is_sirens_a_comedy_at_all/"
    },
    {
        "id": "1lvmqhf",
        "author": "ToonAdventure",
        "title": "Long Story Short | Official Teaser | Netflix",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lvmqhf/long_story_short_official_teaser_netflix/"
    },
    {
        "id": "1lvz9at",
        "author": "FactTime7581",
        "title": "Why do Netflix's best shows get cancelled after 2 seasons",
        "content": "Mindhunter, Marcopolo, Sandman etc is netflix allergic to good shows? Can these shows find home somewhere else?(obv Marco polo is old and people moved on but others could be rescued?)",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lvz9at/why_do_netflixs_best_shows_get_cancelled_after_2/"
    },
    {
        "id": "1lvkpb2",
        "author": "Routine_Evening1134",
        "title": "Problems with subtitles",
        "content": "I have been having problems while watching any netflix content with subtitles turned on. Every time someone starts talking and subtitles appear or when they finish talking and subtitles disappears, my screen does something weird like moving up and down. It is really annoying and makes content almost unwatchable. Any ideas what could be causing this?\n\nI’ve only had this problem in my new &lt;6 months old computer (Asus ProArt P16). I dont remember if it started happening the first time I used netflix but it has persisted for at least some months. This issue affects both the windows netflix app and netflix on google. I’ve tried restarting and redownloading netflix but it hasn’t fixed it. When I turn off subtitles it doesn’t have this issue. Any help would be greatly appreciated\n\nVideo attached showing issue",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/orb0fye43vbf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1lvkpb2/problems_with_subtitles/"
    }
]