[
    {
        "id": "1jc5dnt",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement: Ana de Armas - Thursday 5/15 at 12:00 PM ET - Star of Ballerina, Knives Out, Blonde, Blade Runner 2049, No Time To Die, Ghosted, The Gray Man, Deep Water",
        "content": "",
        "upvotes": 878,
        "comments": 134,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ml59cp306xoe1.png?auto=webp&amp;s=87978abf99e5d5093cea308eac8d21af24e0ee3f"
        },
        "permalink": "/r/movies/comments/1jc5dnt/amaqa_announcement_ana_de_armas_thursday_515_at/"
    },
    {
        "id": "1jc3g7s",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement: Kelly Marie Tran - Monday 3/17 at 1:00 PM ET - Star of Raya and the Last Dragon, The Croods: A New Age, Control Freak, Star Wars: The Last Jedi, The Wedding Banquet",
        "content": "",
        "upvotes": 87,
        "comments": 13,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7kkdptrnqwoe1.png?auto=webp&amp;s=1f6b3afd76013a178178305ad471b16e98131c7c"
        },
        "permalink": "/r/movies/comments/1jc3g7s/amaqa_announcement_kelly_marie_tran_monday_317_at/"
    },
    {
        "id": "1jcsgog",
        "author": "Unlucky-Bug2412",
        "title": "Actors Who Were Everywhere… Until They Weren’t",
        "content": "You ever notice how some actors are in everything for a few years and then just disappear? One day they’re headlining big movies, and the next, it’s like Hollywood pretends they never existed. No big scandal, no retirement announcement, just gone.\n\nTaylor Kitsch is a perfect example. After Friday Night Lights, it felt like every studio was pushing him as the next big star. He got John Carter, Battleship, and True Detective, but after a few flops, he just stopped getting those lead roles. Same thing happened with Josh Hartnett. In the early 2000s, he was in Pearl Harbor, Black Hawk Down, Sin City, and then he just kind of faded away. I heard he turned down playing Batman in The Dark Knight, which probably didn’t help. Who else do you remember being everywhere and then suddenly gone?\n",
        "upvotes": 1560,
        "comments": 2009,
        "media": null,
        "permalink": "/r/movies/comments/1jcsgog/actors_who_were_everywhere_until_they_werent/"
    },
    {
        "id": "1jcv4of",
        "author": "boib",
        "title": "Inside The Actors Studio episodes are being posted on youtube",
        "content": "",
        "upvotes": 502,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/K24PYmv4cnM2j9-xknkmCbMUO5DRa2sarjApYf5v8DI.jpg?auto=webp&amp;s=5323ad4021d2c03d601f259b9e644fe5dd8dc331"
        },
        "permalink": "/r/movies/comments/1jcv4of/inside_the_actors_studio_episodes_are_being/"
    },
    {
        "id": "1jctfim",
        "author": "Pooseygeuse",
        "title": "Serial Mom (John Waters, 1994)",
        "content": "",
        "upvotes": 441,
        "comments": 46,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/l_1TaiK-wT03w1Mntn8as52fxv4gyVdHDXH9t3CiafM.jpg?auto=webp&amp;s=2a1472ada27a27d88761b3f88eb7b72ab8791aa5"
        },
        "permalink": "/r/movies/comments/1jctfim/serial_mom_john_waters_1994/"
    },
    {
        "id": "1jcbw8g",
        "author": "Morganbanefort",
        "title": "Tom Cruise's Villain in 'Collateral' Still Rules 20 Years Later",
        "content": "",
        "upvotes": 12691,
        "comments": 819,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/FXWR-O-uAWXTn8Kw6rsJzoJEpNB_ToyTIGBx14GMoSQ.jpg?auto=webp&amp;s=f91a90bcfb1d5e2fafd4081a5c5e749e6a997c66"
        },
        "permalink": "/r/movies/comments/1jcbw8g/tom_cruises_villain_in_collateral_still_rules_20/"
    },
    {
        "id": "1jclb4t",
        "author": "Amaruq93",
        "title": "\"The Great Outdoors\" (1988) | Almost Cult Classics",
        "content": "",
        "upvotes": 987,
        "comments": 161,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/udYnEgXXyj7Vs6SGyMrmRZSFrTtUPPBt0oxCBQjJ-Eo.jpg?auto=webp&amp;s=160c1a892dd6126037bce20f6aa13a32f944162a"
        },
        "permalink": "/r/movies/comments/1jclb4t/the_great_outdoors_1988_almost_cult_classics/"
    },
    {
        "id": "1jd06bf",
        "author": "Puzzled-Tap8042",
        "title": "Émilie Dequenne Dies: Belgian Cannes Best Actress Winner Was 43",
        "content": "",
        "upvotes": 119,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/ROZ5eQXfFukzDzEWLse5oe4uV2kEgGeDltJX9o9Zqow.jpg?auto=webp&amp;s=fdf91f4278b4271ccf7b417372d6b72205506ea3"
        },
        "permalink": "/r/movies/comments/1jd06bf/émilie_dequenne_dies_belgian_cannes_best_actress/"
    },
    {
        "id": "1jcrca4",
        "author": "Bennett1984",
        "title": "Jaws, One Flew Over the Cuckoo's Nest, Barry Lyndon and the Essential Films of 1975",
        "content": "",
        "upvotes": 328,
        "comments": 35,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/L3Cd988-YkE9G3oyXT0KwPFS6YBcVVSQFDBuxcKoaTs.jpg?auto=webp&amp;s=c7953270b9edcd1f118cd70f0a3f8669b92220bd"
        },
        "permalink": "/r/movies/comments/1jcrca4/jaws_one_flew_over_the_cuckoos_nest_barry_lyndon/"
    },
    {
        "id": "1jcycaa",
        "author": "OneManFreakShow",
        "title": "Why did no one tell me that Return to Oz is awesome?",
        "content": "I watched this movie for the first time this morning. Growing up I was very familiar with it because my sister saw it on its release and was traumatized by it. All I ever knew was how supposedly scary it was, and that’s not necessarily wrong. But between all of the darker material there’s a real sense of whimsy there, and it’s all delivered with such *confidence.* The movie just throws all of these insane ideas out there and expects you to keep up, and I was enthralled the whole time. The main actress has to be one of the best displays of young acting I’ve ever seen in the genre and she’s working against *nothing.* Just props and a chicken for most of the thing. I couldn’t believe when I looked it up and found that it was the director’s only movie. What a wild ride. ",
        "upvotes": 125,
        "comments": 84,
        "media": null,
        "permalink": "/r/movies/comments/1jcycaa/why_did_no_one_tell_me_that_return_to_oz_is/"
    },
    {
        "id": "1jcispa",
        "author": "LarryKeene",
        "title": "Which comedy film delivered the biggest laugh of your lifetime?",
        "content": "I love comedy movies but a lot of movies that are labelled as 'funny' just don't make me laugh.\n\nI want a comedy to leave me with aching jaws and tears streaming down my face.\n\nWhich comedy movies have you seen that have left you unable to breathe from laughing so much?\n\nI don't mean gentle rom coms or high brow comedy that you really have to think about.\n\nI want those movies that are so outrageously funny they leave your sides aching.\n\nI'll start with 4 - 'Raising Arizona', 'Top Secret', 'Four Lions', and 'Monty Python's Life of Brian'.",
        "upvotes": 1089,
        "comments": 3672,
        "media": null,
        "permalink": "/r/movies/comments/1jcispa/which_comedy_film_delivered_the_biggest_laugh_of/"
    },
    {
        "id": "1jcph4n",
        "author": "Jaipurite28",
        "title": "What's the funniest review you have ever read of a movie?",
        "content": "For me it's David Farrier's review of Cats. I read the Cats review thread a few minutes and I cannot stop laughing.\n\n&gt;When I was 13, my parents started breeding cats. Birmans. Seal point Birmans, to be precise. I would wake and be surrounded by cats and all that the cat life entailed. Kitten cats, male cats, female cats. Cat cages, cat shows, cat breeding. Always the breeding, the eternal lifecycle of the cat burned into my retinas. The yowling, the prowling, the fucking.\n\n&gt;When I was 25, I hung out with some Furries in Hamilton. Charming folk, I really liked them. Loved Disney films. Adored My Little Pony. They got turned on by putting on dog suits, fox suits, cat suits. Adults - all yowling, prowling, fucking.\n\n&gt;I'm 37 now, I've just seen Cats the movie. I've never seen the stage show, but I know the songs. I get the gist. Big songs, big numbers. This film is something else. I am 13 again, I am 25 again. I'm at my parents house, hearing cats fuck. I'm watching a Furry put on a catsuit.\n\n&gt;This is the worst thing I've ever seen. This is what death feels like. This is the worst ketamine trip. This is the CGI from Scorpion King. I don't know if I'm five minutes in or five hours. Nothing matters anymore. This is the death of all things. Fuck it.\n",
        "upvotes": 308,
        "comments": 143,
        "media": null,
        "permalink": "/r/movies/comments/1jcph4n/whats_the_funniest_review_you_have_ever_read_of_a/"
    },
    {
        "id": "1jcl1lq",
        "author": "solis_the_novice_pro",
        "title": "Watching SOUL while depressed.",
        "content": "I just watched soul for the first time based on a coeworkers recommendation to me. I was freaking out because someone asked me when I want to do with my life, what I want to learn, any skills or knowledge I’m interested in, and I started freaking out. I don’t know. I don’t even know what I like to do for fun when I’m not at work; I just go about my day and a lot of the time I find myself sitting and waiting for the time to just pass. \nAnyways she told me to watch Soul and or inside out (I have never seen either of them), so I watched soul.\n\nFirst 30 minutes were depressing as fuck\nThe next hour was fun and entertaining\nand the last 20 ish minutes was devistating. She told me it’s supposed to be bitter sweet but I don’t get it. I just felt the movie was to relatable and it reinforced that I am not good enough and that I don’t have any purpose to be alive. \nI don’t see my therapist for a few days but I can’t hold this in. I’m internally panicking and I’m so lost.",
        "upvotes": 290,
        "comments": 42,
        "media": null,
        "permalink": "/r/movies/comments/1jcl1lq/watching_soul_while_depressed/"
    },
    {
        "id": "1jcmjws",
        "author": "ChrisEye21",
        "title": "\"Bad\" Movies You Still Like",
        "content": "Plenty of movies out there that are considered \"bad\". \n\nName a movie (less than 50% Rotten Tomatoes score) that you still like. I'll Start:\n\n\n\nIn Time (2011)\n\n\n\nMaybe its just the idea behind it that I like, im not sure. I know the movie could have been better. But I still enjoy it...but dont get me started on that awful poker scene.",
        "upvotes": 220,
        "comments": 1251,
        "media": null,
        "permalink": "/r/movies/comments/1jcmjws/bad_movies_you_still_like/"
    },
    {
        "id": "1jcqyfy",
        "author": "Tati_D_Avi13",
        "title": "What movie has the best opening scene of all time?",
        "content": "Mine is that of The Turin Horse . Béla Tarr’s **opening shot lasts nearly 10 minutes**, showing a weary old horse struggling against the wind, carrying a carriage through a barren landscape.\n\nThere’s **no dialogue, no music**—just the sound of the wind and the slow, agonizing movement of the horse. **It’s hypnotic, yet deeply unsettling.**\n\nWhy does this work? The entire film is about **the inescapable decay of life**, and this opening scene forces the audience to feel it. It’s **pure atmosphere**, pulling us into a world where hope barely flickers. So what is your favourite?",
        "upvotes": 118,
        "comments": 747,
        "media": null,
        "permalink": "/r/movies/comments/1jcqyfy/what_movie_has_the_best_opening_scene_of_all_time/"
    },
    {
        "id": "1jcq07d",
        "author": "poopybum120",
        "title": "28 Days Later - what a film",
        "content": "Rewatched Danny Boyle’s (and Alex Garland’s) 28 Days Later ahead of the upcoming release of 28 Years Later, and man, what a 10/10 movie.\n\nThose haunting shots of a sprawling, empty London still hit just as hard.The cast is phenomenal: a sexy young Cillian Murphy,  punky Naomie Harris, Brendan feckin Gleeson, and ex doctor and anti-monarchist Christopher Eccleston - virtually unknown before the film’s release. Their characters are so raw and believable, making the story frightening yet deeply human. It’s the end of the world, but in a way that’s quintessentially British - all mud, grime, and desperation.\n\nAnd there's hope too. We're treated to luvly little ambient numbers as they drive up to Manchester. Little bits of respite as they huddle around a campfire.\n\nAnd the infected. The running, frantic frothing monsters may seem old hat now, but they redefined the zombie genre. I don’t think I’ve seen a zombie film since that’s scared me as much as 28 Days. The church scene at the start of the movie is so chilling and upsetting.\n\nCant wait to check out the true sequel to this British masterpiece. Thank God for directors like Danny Boyle, stamping his muddy footprint over cinema.",
        "upvotes": 113,
        "comments": 36,
        "media": null,
        "permalink": "/r/movies/comments/1jcq07d/28_days_later_what_a_film/"
    },
    {
        "id": "1jchxgr",
        "author": "dxdx_",
        "title": "Eternal Sunshine of the Spotless Mind - a subtle implication that seems to have slipped through the cracks",
        "content": "I’ve searched high and low for references to this scene and what others took from it, but it seems no one else in the entire universe has picked up on it (at least not anyone that feels the need to share every waking thought online, anyway).\n\nThere is a scene where Mary walks over to Dr Mierzwiak’s car to chat with him. Shot from Stan’s perspective, they both look back at him and laugh amongst themselves, with Stan and the viewer unaware exactly what it is they’re laughing about. At some point in the film (it’s been a while), Stan confesses his love for Mary. In my mind, the clear implication from the conversation between Mary and Dr Mierzwiak is that Stan has at some point had Mary erased, and is now unknowingly falling for her again, something Mary and Dr Mierzwiak find to be comical.",
        "upvotes": 347,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1jchxgr/eternal_sunshine_of_the_spotless_mind_a_subtle/"
    },
    {
        "id": "1jczj1x",
        "author": "indiewire",
        "title": "Steven Soderbergh Talks Influences on 'Black Bag'",
        "content": "",
        "upvotes": 16,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yiHkViWmjPS1Zb0CbcqoFFD__ayoBAzbR52VELVH0B4.jpg?auto=webp&amp;s=9c41a02c18131ecfcb2eb06c2af5b676c4775706"
        },
        "permalink": "/r/movies/comments/1jczj1x/steven_soderbergh_talks_influences_on_black_bag/"
    },
    {
        "id": "1jc8t7z",
        "author": "OneFirefighter1233",
        "title": "12 angry men Is the most interesting movie i've ever watched",
        "content": "Hi, so first and foremost i know it's one of the greatest movies ever made, well i didnt know It until Yesterday when i watched the movie, i only knew that It was a good film and i wanted to Watch It.\n\nIt's incredible that a movie made 60+ years ago and shot mainly in One room, with 90% of the script which Is characters talking to each Other, sits as the most interesting movie i've ever watched in my life. \n\nListen, i'm not a cinephile and i dont know really nothing about cinema, i watched some movies but forgot most of them, i only care for the plot and what Is going on, if that movie keeps me interested Is good, if not i move on, and this movie Is the best thing i've ever watched, and i'm not exaggerating.\n\nI didnt find something in my life that hooked me so much and i recommend everyone to at least give a try if you didnt watch it",
        "upvotes": 1246,
        "comments": 154,
        "media": null,
        "permalink": "/r/movies/comments/1jc8t7z/12_angry_men_is_the_most_interesting_movie_ive/"
    },
    {
        "id": "1jc1ifd",
        "author": "BunyipPouch",
        "title": "First Poster for 'Neighborhood Watch' - Starring Jack Quaid &amp; Jeffrey Dean Morgan - When a mentally ill young man witnesses an abduction and the police refuse to believe him, he reluctantly turns to his next door neighbor- a bitter, retired security guard- to help him find the missing woman.",
        "content": "",
        "upvotes": 2751,
        "comments": 189,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/oa1vq485bwoe1.jpeg?auto=webp&amp;s=0e5cc4c3ef6abf9489f41d99c67a39fddb77b61d"
        },
        "permalink": "/r/movies/comments/1jc1ifd/first_poster_for_neighborhood_watch_starring_jack/"
    },
    {
        "id": "1jcqtvy",
        "author": "indiewire",
        "title": "The Best 'Leprechaun' Movies: All 8 Horror Films, Ranked",
        "content": "",
        "upvotes": 36,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/_ivCoidh4ydkns-Glk5QmRts16ILhmJ5h5LCsno4Y0o.jpg?auto=webp&amp;s=6ee371dd7f64320b87d47528027340108ea8e17e"
        },
        "permalink": "/r/movies/comments/1jcqtvy/the_best_leprechaun_movies_all_8_horror_films/"
    },
    {
        "id": "1jcdni4",
        "author": "WinstonMarrs",
        "title": "The ER doctor in Heat is a real doctor",
        "content": "I was rewatching Heat (for like the 50th time in my life at this point).  I was having fun laughing at some of the stuff that I now see as overly dramatic but I found cool when I was younger.\n\nAnyways, once it got to the hospital (filmed at St Mary's in Long Beach) scene where Lauren is taken after Pacino finds her in the tub, I was very impressed by the actors in that scene - they seemed to really memorize their hospital lingo and make it believable.  But as I watched more, I kinda felt like the main doctor had to have been someone they just found at the hospital they filmed at and told him to \"pretend this just happened\".\n\nSo I wound up doing some quick research on imdb and got his name, but he's not credited in any other movie.  Some google searching led me to his profile, and everything seems to line up and definitely looks like he was a real doctor, pretty cool:\n\nhttps://preview.redd.it/8buza1izazoe1.png?width=2080&amp;format=png&amp;auto=webp&amp;s=8e1e96c63c1d057eb2e7ec47a521cec51c3f5e27\n\nAlso, I think the blonde nurse is also a real nurse too, she seems way to natural in her actions in that scene.",
        "upvotes": 368,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1jcdni4/the_er_doctor_in_heat_is_a_real_doctor/"
    },
    {
        "id": "1jca70y",
        "author": "HughJManschitt",
        "title": "Anybody's parents let them pick out movies to watch they thought were \"family friendly\" but turned out to not be?",
        "content": "Mine was \"A Perfect World\" starring Kevin Costner and Clint Eastwood. It came out in 1993, and I'm pretty sure I was closer to 7-8 when I watched it. The reason my mother let me pick it out (from a VHS RENTAL STORE, GASP HOW ANTIQUATED) was because it had a kid in a ghost face costume on it walking with a guy she must have assumed was his father (Costner).\n\n  \nNah, this was about a pair of murderers who break out of prison and kidnap said kid, kind of a road movie with Eastwood as the Texas Ranger chief who is chasing them. It's worth a watch, it's a decent movie directed by Eastwood however as a kid it was scary to me. The ending is a gut punch too, was one of my first \"anti-hero\" sad movies. \n\nAnyway, anybody else got stories like this?",
        "upvotes": 484,
        "comments": 748,
        "media": null,
        "permalink": "/r/movies/comments/1jca70y/anybodys_parents_let_them_pick_out_movies_to/"
    },
    {
        "id": "1jcl7dg",
        "author": "BDJohnSquires",
        "title": "The Toxic Avenger Made an Appearance on the Green Chicago River for St. Patrick's Day",
        "content": "",
        "upvotes": 32,
        "comments": 12,
        "media": null,
        "permalink": "/r/movies/comments/1jcl7dg/the_toxic_avenger_made_an_appearance_on_the_green/"
    },
    {
        "id": "1jc50kh",
        "author": "Drakhanfeyr",
        "title": "Alien Romulus - WOW!",
        "content": "I was in high school when the first Alien movie came out, I've seen all of them and I love the series.  Decades later, I thought I might not enjoy Alien Romulus. Boy was I wrong. This film has new, younger characters who are believable and (mostly) likeable, a well-written story, interesting subplots/ back stories which don't detract from the main storyline, a new artificial life character who is different from any we have seen before, plus some tub-thumping one-liners which pay homage to Ripley. This is probably the second best movie of the entire franchise, after Aliens.",
        "upvotes": 644,
        "comments": 396,
        "media": null,
        "permalink": "/r/movies/comments/1jc50kh/alien_romulus_wow/"
    },
    {
        "id": "1jcw7ak",
        "author": "BunyipPouch",
        "title": "AMA/Q&amp;A Announcement - Nik Dodani - Friday 3/21 at 2:00 PM ET - Actor in 'The Parenting', 'Escape Room', 'Twisters', 'Atypical', 'Strange World'",
        "content": "",
        "upvotes": 7,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/fkq60uv4d4pe1.png?auto=webp&amp;s=ba2b34ac1b03318400b134dc92d9f23a19cfb3ff"
        },
        "permalink": "/r/movies/comments/1jcw7ak/amaqa_announcement_nik_dodani_friday_321_at_200/"
    },
    {
        "id": "1jcn10i",
        "author": "UmpireMental7070",
        "title": "What are some other good movies like Taken, Nobody, The Equalizer?",
        "content": "Looking for more good movies where the protagonist is a seemingly normal family man type who is actually a highly trained professional like ex-special forces, etc who goes on an ass-kicking spree in search of revenge after bad guys mess with their family or other innocent people.  There has to be a bunch more movies in this genre to add to my list.",
        "upvotes": 23,
        "comments": 231,
        "media": null,
        "permalink": "/r/movies/comments/1jcn10i/what_are_some_other_good_movies_like_taken_nobody/"
    },
    {
        "id": "1jcsxzc",
        "author": "Pooseygeuse",
        "title": "Warning: Parental Advisory (2002)",
        "content": "",
        "upvotes": 9,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/TKKJSGtBMW_yTtm1LKw5JuEkpaYH4O357F-gkixE8ek.jpg?auto=webp&amp;s=3a2ca14e6e82901a04e4b4abdf647f56144be204"
        },
        "permalink": "/r/movies/comments/1jcsxzc/warning_parental_advisory_2002/"
    },
    {
        "id": "1jcsv6o",
        "author": "user10513",
        "title": "Movies that changed your life?",
        "content": "I'm currently going through a difficult time and have been finding a lot of comfort in movies. I saw that 'Soul' was recommended for feeling lost and it sparked my curiosity. What films have profoundly impacted your life or way of thinking? I'm looking for movies that have resonated deeply with you, or that have changed how you think about life. Thanks!",
        "upvotes": 9,
        "comments": 46,
        "media": null,
        "permalink": "/r/movies/comments/1jcsv6o/movies_that_changed_your_life/"
    },
    {
        "id": "1jcuas1",
        "author": "n00biwankan00bi",
        "title": "Which scenes become “perfected” due to the soundtrack?",
        "content": "I’m talking about scenes where they couldn’t have picked a better song to complete it. It’s almost like the wrote the scene for the song itself but still flows with the movie.\n\nSome I can think of are:\n\nShawn of the Dead - “Don’t Stop Me Now”\n\nThe Kingsman - “Free Bird”\n\nReservoir Dogs - “Stuck in the Middle With You”\n\nEdit: I’m not referring to original music/scores. Those are written for their scene, but you could include pieces such as\n\nMisery - “Moonlight Sonata” (sorry I stole a good one)",
        "upvotes": 8,
        "comments": 57,
        "media": null,
        "permalink": "/r/movies/comments/1jcuas1/which_scenes_become_perfected_due_to_the/"
    },
    {
        "id": "1jcdq5e",
        "author": "CamaroLover2020",
        "title": "Biggest Movie Achievement in history..",
        "content": "For me it's the movie \"Coherence\" they had a budget of only $50,000, they didn't use ANY scripts, and it only took 5 days to film, and it's actually a very good movie.....probably one I'll watch again in a couple years to understand it better...as it's a mind trip, and takes more than one sitting to get everything that's going on.",
        "upvotes": 114,
        "comments": 112,
        "media": null,
        "permalink": "/r/movies/comments/1jcdq5e/biggest_movie_achievement_in_history/"
    },
    {
        "id": "1jc3qga",
        "author": "soviet_turd",
        "title": "the use of color in \"Her\" is just genius",
        "content": "I'll begin by saying that this movie is absolutely one of the most beautiful films ive ever seen. The bright colors (red, orange, yellow and green) have such an impact on the vibe of the film. With that said, Theo wears ALOT of red and orange colors. Similarly, the OS1 primary color is a bright orange which matches his shirt in the posted frame. Colors like red and pink symbolize love, and In this case, the start of Theodore and Samanthas romantic journey. Theodore continues to wear these bright orange/red shirts during the \"Honeymoon phase\" (as Theodore calls it) of their relationship. It signifies a healthy beginning to true love.\n\nHowever, as we dive into the issues that Theo and Sam face, he wears more neutral colors such as pale blue and white. When Sams prostitute shows up, Theo is wearing a white shirt. In this moment Theo is extremely uncomfortable, as he is being asked to have sex with someone hes never met by his computer girlfriend. This ultimately causes a pretty deep split between the two, probably the biggest we see in the whole movie aside from the breakup.\n\nAlthough It is a pretty obvious detail, the color usage is a very nice touch in my opinion. I love that colors symbolize the strength and status of Theo and Sams relationship as the movie plays on.\n\nhttps://preview.redd.it/6vmtsjj4twoe1.jpg?width=1064&amp;format=pjpg&amp;auto=webp&amp;s=9c0480a652ffe064fcd40d642c62d3100348a651\n\n",
        "upvotes": 414,
        "comments": 32,
        "media": null,
        "permalink": "/r/movies/comments/1jc3qga/the_use_of_color_in_her_is_just_genius/"
    }
]