[
    {
        "id": "1i91uga",
        "author": "BunyipPouch",
        "title": "Announcement: Today's AMA/Q&amp;A with Brady Corbet, director of A24's 'The Brutalist' has unfortunately been cancelled.",
        "content": "",
        "upvotes": 93,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/lhkbu3klfzee1.jpeg?auto=webp&amp;s=0d23f73e5cc6f009fb15f0af7adf892fad781c82"
        },
        "permalink": "/r/movies/comments/1i91uga/announcement_todays_amaqa_with_brady_corbet/"
    },
    {
        "id": "1i6llai",
        "author": "ICumCoffee",
        "title": "What is the Best Film You Watched Last Week? (01/14/25 – 01/21/25)",
        "content": "The way this works is that you post a review of the Best Film you watched this week. It can be any new or old release that you want to talk about.\n\n**Here are some rules:**\n\n1. **Check to see if your favorite film of last week has been posted already.**\n2. **Please post your favorite film of last week.**\n3. **Explain why you enjoyed your film.**\n4. **ALWAYS use SPOILER TAGS.**\n5. **Comments that only contain the title of the film will be removed.**\n\n[Last Week's Best Submissions:](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/)\n\n|Film|User|\n|:-|:-|\n|[Nosferatu (2024)](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/m748z7l/)|Comic\\_Book\\_Reader|\n|[The Last Samurai (2003)](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/m73rn48/)|acerage|\n|[Get Away (2024)](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/m73rdky/)|parky101|\n|[Better Man (2024)](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/m75mj6u/)|\\_Maui\\_|\n|[Asteroid City (2023)](https://old.reddit.com/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/m77zpoc/)|roadrunner440x6|\n\n​",
        "upvotes": 29,
        "comments": 110,
        "media": null,
        "permalink": "/r/movies/comments/1i6llai/what_is_the_best_film_you_watched_last_week/"
    },
    {
        "id": "1i99efa",
        "author": "Sisiwakanamaru",
        "title": "Sandra Bullock and Nicole Kidman will officially return for ‘Practical Magic 2.’",
        "content": "",
        "upvotes": 1565,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/arFthvZbWgIQZN-ZI2aPrABalZOvMWFTj2uwXVwQAL4.jpg?auto=webp&amp;s=55157e771f3262dd1250dab67d4e296193de7be5"
        },
        "permalink": "/r/movies/comments/1i99efa/sandra_bullock_and_nicole_kidman_will_officially/"
    },
    {
        "id": "1i94cwg",
        "author": "mayukhdas1999",
        "title": "First Image of Daisy Ridley in 'WE BURY THE DEAD' - In the aftermath of a catastrophic military experiment, a desperate woman joins a \"body retrieval unit” in the hope of finding her husband alive, but her search takes a chilling turn when the corpses start showing signs of life",
        "content": "",
        "upvotes": 2083,
        "comments": 140,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9ux81zejyzee1.jpeg?auto=webp&amp;s=d1c1011591bf244168117feb7fe753e0661f90e5"
        },
        "permalink": "/r/movies/comments/1i94cwg/first_image_of_daisy_ridley_in_we_bury_the_dead/"
    },
    {
        "id": "1i8twf3",
        "author": "cheff1616",
        "title": "When does a movie really start? Connecticut official wants theaters to post accurate times",
        "content": "This is giving hidden-fees-on-Ticketmaster",
        "upvotes": 10092,
        "comments": 1072,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DnK7yD3XqPe3vUdccBYCJfcb6UnoyEvdhnxr7AEhe7k.jpg?auto=webp&amp;s=ac421bc646ace8247f8b8e6ed6cedbaea0716e0d"
        },
        "permalink": "/r/movies/comments/1i8twf3/when_does_a_movie_really_start_connecticut/"
    },
    {
        "id": "1i98pfx",
        "author": "MarvelsGrantMan136",
        "title": "Zach Cregger to Tackle ‘Resident Evil’ Reboot, Igniting Bidding War",
        "content": "",
        "upvotes": 966,
        "comments": 138,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/m-uTYCJep8m9dWlHRUdR7w-zhkAbQKr6xyfnnLpB8fU.jpg?auto=webp&amp;s=db49d5588519c6a7b09a406d9033faa0872e687d"
        },
        "permalink": "/r/movies/comments/1i98pfx/zach_cregger_to_tackle_resident_evil_reboot/"
    },
    {
        "id": "1i96d1t",
        "author": "MarvelsGrantMan136",
        "title": "Daisy Ridley’s ‘Star Wars’ Movie Enlists 'Oceans 12' Writer George Nolfi",
        "content": "",
        "upvotes": 1218,
        "comments": 530,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/sLMggscKx6M-hltLgebaePbbSq55olabZbz9yLNvQz4.jpg?auto=webp&amp;s=9cc4930e048f00ebf02c95c01283302ea0008e35"
        },
        "permalink": "/r/movies/comments/1i96d1t/daisy_ridleys_star_wars_movie_enlists_oceans_12/"
    },
    {
        "id": "1i8sgep",
        "author": "Zaku71",
        "title": "Eric Stoltz made me understand the tragedy of the ending of Back to the Future and the inhumanity of the American Dream.",
        "content": "I think a good part of here knows the story behind the first casting of the protagonist of \"Back to the Future\". Michael J. Fox was not available and Eric Stoltz was chosen. But his type of acting was not suitable for what was a comedy, he was fired and MJF who had become available was called. The rest is history.\n\nBut recently I saw an interview with Lea Thompson (who plays Marty McFly's mother, Lorraine Baines).\n\n[https://www.youtube.com/watch?v=r-\\_lWQhgLYA](https://www.youtube.com/watch?v=r-_lWQhgLYA)\n\nHere she tells an interesting anecdote. After the first reading of the script with the actors they are all enthusiastic, the story is great everyone laughs etc etc. Then they ask Eric what he thinks and he says it is a tragedy. Because at the end of the film Marty remembers a past and a family that no longer exists. His new family are strangers who have lived a totally different life. And this new family has lost a son, because at home they have a stranger who coincidentally has the same name.\n\nAnd I add, the movie tells us that all this is perfectly okay why? Because now Marty has a nicer house, he has a new car, he has so many *things*. Marty has lost his whole life but in exchange he has so many new material goods. And this is the essence of the American Dream, as long as you have things (goods, money, power, fame), everything else (love, family, beliefs) can be sacrificed.\n\n(I think that even Crispin Glover - who played Marty's dad, was very critical about the movie message: money and financial success = happiness)",
        "upvotes": 7789,
        "comments": 1096,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XzfKNWWJFBlrEqy-261eJkMTosqqsC_z6rpRwIQ-YPI.jpg?auto=webp&amp;s=8101554b1ff8048953908cc27734fbce5701a977"
        },
        "permalink": "/r/movies/comments/1i8sgep/eric_stoltz_made_me_understand_the_tragedy_of_the/"
    },
    {
        "id": "1i9dt36",
        "author": "New_Transition8925",
        "title": "Movies that capture the *feel* of the 1990s",
        "content": "I was born the in early 1990s, but was really too young to remember how exactly those times felt (socially, politically, aesthetically, etc.) It doesn’t have to necessarily be a movie *made* in the 90s (I’m sure that will make the most sense though), I’m just looking for movies that highlight the general feeling of the time. \n\nI’m hoping to watch some films that really capture the era, all recs are welcome! ",
        "upvotes": 301,
        "comments": 842,
        "media": null,
        "permalink": "/r/movies/comments/1i9dt36/movies_that_capture_the_feel_of_the_1990s/"
    },
    {
        "id": "1i8xn1a",
        "author": "MarvelsGrantMan136",
        "title": "New Image of Scarlett Johansson and Jonathan Bailey in 'Jurassic World: Rebirth'",
        "content": "",
        "upvotes": 2224,
        "comments": 782,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/peq10eybkyee1.jpeg?auto=webp&amp;s=86b6733df1c17e8c677355076f2155e29cf6ee84"
        },
        "permalink": "/r/movies/comments/1i8xn1a/new_image_of_scarlett_johansson_and_jonathan/"
    },
    {
        "id": "1i92zz7",
        "author": "MarvelsGrantMan136",
        "title": "The Wayans Brothers' 'Scary Movie' Reboot Sets June 12, 2026 Theatrical Release",
        "content": "",
        "upvotes": 1002,
        "comments": 166,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/nFX73oZFhtc2OcUcyP4pWU4Am7Akj3hjDDMvZorax18.jpg?auto=webp&amp;s=ca755e6531bd1a8cfffa86388e7d637e4b6f30ae"
        },
        "permalink": "/r/movies/comments/1i92zz7/the_wayans_brothers_scary_movie_reboot_sets_june/"
    },
    {
        "id": "1i93nsx",
        "author": "SanderSo47",
        "title": "Denis Villeneuve’s Criterion Movie Closet Picks",
        "content": "",
        "upvotes": 825,
        "comments": 69,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NFJRwW7vD18SjRLNRvaZ9KAP4Ju2xHR4_mg90qKfkKQ.jpg?auto=webp&amp;s=ffebd3aaed533e1be369d0910132e9639268b456"
        },
        "permalink": "/r/movies/comments/1i93nsx/denis_villeneuves_criterion_movie_closet_picks/"
    },
    {
        "id": "1i91mrt",
        "author": "NoCulture3505",
        "title": "‘Godzilla x Kong’ Sequel Adds Kaitlyn Dever To Cast",
        "content": "",
        "upvotes": 885,
        "comments": 247,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/x35qIYmfXnliBZTgCdv7hOd21yskhEaM2hond9IwRIw.jpg?auto=webp&amp;s=f11abf0a187d1762cff802d91be0ddf8fea5449a"
        },
        "permalink": "/r/movies/comments/1i91mrt/godzilla_x_kong_sequel_adds_kaitlyn_dever_to_cast/"
    },
    {
        "id": "1i94d5b",
        "author": "mayukhdas1999",
        "title": "First Image of Rosamund Pike in 'HALLOW ROAD' - A teenage girl accidentally hits a pedestrian and urgently calls her parents for help. In a frantic rush to reach her, the parents drive down the eerie and desolate Hallow Road, only to uncover dark secrets that threaten to tear their family apart",
        "content": "",
        "upvotes": 436,
        "comments": 78,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2a9hflgdxzee1.jpeg?auto=webp&amp;s=c4470c8280413484c7b697655126d897d80a4c88"
        },
        "permalink": "/r/movies/comments/1i94d5b/first_image_of_rosamund_pike_in_hallow_road_a/"
    },
    {
        "id": "1i8n8d9",
        "author": "herewego199209",
        "title": "After re-watching Superbad again for the 1000th time since I first watched it as a freshman in high-school when it came out, I have to say it's a 10/10 perfect comedy imo. One of the best comedy scripts ever and the movie does not date like a lot of teen sex comedies.",
        "content": "There's some comedies from my childhood and teens that I watch now that I still have nostalgia for, but I look at them and I go yeah this is dated or this isn't as funny as I remember. I had that feeling a few years ago with American Pie where I watched it again and it really started to feel dated which is alarming for me because it seems like yesterday I was watching that movie as a kid on HBO behind my parents back. Superbad to me from start to finish is as perfect of a comedy as you're going to get. A very funny, relatable script from Seth Rogen and Evan Goldberg. Really cool locations and sets by Greg mottle and all the characters are so perfectly cast and portrayed. Not one missed joke in the entire movie and it's genuinely a movie that even at 32 I still laugh at damn near every frame now as I did at 14 when I saw it in theaters. ",
        "upvotes": 2060,
        "comments": 293,
        "media": null,
        "permalink": "/r/movies/comments/1i8n8d9/after_rewatching_superbad_again_for_the_1000th/"
    },
    {
        "id": "1i8vpx7",
        "author": "MrDannyOcean",
        "title": "The killer interior design in Hitchcock’s “Rope”",
        "content": "",
        "upvotes": 354,
        "comments": 38,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/U9LkGzc-e2G6aTiDTIwHj1csR9R2eYCNaxRlbU53poE.jpg?auto=webp&amp;s=32050a616916b0f282806413b9af079fb5ea0fcf"
        },
        "permalink": "/r/movies/comments/1i8vpx7/the_killer_interior_design_in_hitchcocks_rope/"
    },
    {
        "id": "1i90p05",
        "author": "Apprehensive_Way8674",
        "title": "Citizen Kane’s camerawork is mind-blowing",
        "content": "I bought Citizen Kane on iTunes a while back and finally decided to turn it on.\n\nI watched it when I was a teenager and didn’t appreciate it at the time.\n\nAlmost every single shot has some kind of amazing movement, framing or cinematography.\n\nI am flabbergasted at what they pulled off all the way back then - especially given how routine most camerawork was at the time.\n\nIf you for some reason haven’t watched it, but geek out on people like Cuaron, I can’t recommend you watch it this weekend enough.",
        "upvotes": 173,
        "comments": 67,
        "media": null,
        "permalink": "/r/movies/comments/1i90p05/citizen_kanes_camerawork_is_mindblowing/"
    },
    {
        "id": "1i92stz",
        "author": "Frank_and_Beanz",
        "title": "The ending to Judas and the Black Messiah.",
        "content": "One of the saddest, sickest, most infuriating scenes put to film, and to know it was based on a real act makes my blood boil to rage. Fantastic recreation technically, the acting top notch. But fuck, what a heinous moment in history of man. I hadn't known about it before choosing to watch the movie so I think it was an important story to tell.\n\nAnd to show the real guy at the end pretty obviously just coping with what he did by acting like anything he did was courageous is crazyyyy. Like, my man, you were snaking your own people for YEARS. You took your own life after that documentary. You felt life ending guilt about what you did.\n\nJust a well made film. Lakeith getting nominated in Supporting though is wild lol.",
        "upvotes": 128,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1i92stz/the_ending_to_judas_and_the_black_messiah/"
    },
    {
        "id": "1i98rnz",
        "author": "Old_Campaign653",
        "title": "Rewatching The Social Network in 2025",
        "content": "One of my all time favorite movies. I especially love the breakdown of each main character and their ideologies:\n\nAt the top, you have the clashing between Eduardo Saverin and Sean Parker. \n\nEduardo is a good guy with bad ideas. He tries to monetize the site too early, and can’t see the forest for the trees. Despite this, he is a team player and is the only person to put his money where his mouth is and fund the company. It’s this naivety that ultimately gets him ousted from his own company by Mark and Sean. \n\nSean Parker is his exact opposite - a bad guy with really good ideas. He is able to predict the path social media is on, and even calls out the success of photo/video based sites while coked out of his mind. He knows how to influence Mark, but he is a creepy leech who ultimately enjoys lurking after college girls more than he enjoys creating companies.\n\nOn the other side, you have the Winklevii and Divya. The very definition of “born on third base and think they hit a triple”. \n\nThey are suing Mark mostly based on what they feel their site could have been, vs. what it ever actually was. They never had a website or a product to compare to Facebook. They had a lot of money and influence which they used to consistently fail upwards while thinking they were “playing fair” the whole time. \n\nFinally, there’s Mark caught in the middle. He reminds me a lot of Louis Bloom in Nightcrawler, when Jake Gyllenhaal says “what if my problem wasn’t that I don’t understand people, it was that I don’t like them?” \n\nIMO, Mark understands people better than he’s ever given credit for. He understands the insecurity that drives much of a person’s actions, and the innate desire everyone has for intimacy. This is demonstrated in the beginning of the movie with his facemash site. He knows everyone will use it, because it lets them compare themselves to people they know. This is essentially what Facebook and social media became in the 2010s - a way to compare your whole life to everyone else’s highlight reels.\n\nHe also knows that the Winklevii are onto something with their website idea, but he resents them because they don’t even understand why it’s so valuable. He hates how little they crave any kind of companionship or intimacy, since they have grown up in an abundance of both. \n\nUltimately, the movie is about a bunch of rich kids arguing with each other. 15 years later, everyone involved is richer than they were, and nothing really happened. Sorkin and Fincher took the most boring premise ever and turned it into one of the most fascinating movies I’ve ever watched.",
        "upvotes": 54,
        "comments": 17,
        "media": null,
        "permalink": "/r/movies/comments/1i98rnz/rewatching_the_social_network_in_2025/"
    },
    {
        "id": "1i8b45a",
        "author": "MarvelsGrantMan136",
        "title": "New Posters for Bong Joon-ho's 'Mickey 17'",
        "content": "",
        "upvotes": 9971,
        "comments": 252,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/3uta1mseksee1.jpeg?auto=webp&amp;s=a8d7d793197c56754a03bfd7d488c958d56d7673"
        },
        "permalink": "/r/movies/comments/1i8b45a/new_posters_for_bong_joonhos_mickey_17/"
    },
    {
        "id": "1i8yek9",
        "author": "Ankh4921",
        "title": "Which actors/actress do you feel don’t live up to the hype?",
        "content": "Not BAD actors. Just ‘ok’ actors, and not great enough to justify their fame. \n\nOne example for me would be George Clooney. I’m struggling to think of a performance where he has really moved me. And I don’t understand why he is so highly regarded as an actor, apart from his reputation as a nice guy, and his role as beloved Dr. Doug Ross in E.R.\n\nDon’t get me wrong - I enjoyed E.R. and I liked his character. I’m NOT saying he’s a bad actor. It’s just that when I see him in a movie it feels like I’m watching George Clooney act, rather than the character he is portraying. \n\nSo which actors do you feel this way about? ",
        "upvotes": 153,
        "comments": 1218,
        "media": null,
        "permalink": "/r/movies/comments/1i8yek9/which_actorsactress_do_you_feel_dont_live_up_to/"
    },
    {
        "id": "1i8hipy",
        "author": "30Bones",
        "title": "First image from REDUX REDUX - In an attempt to avenge her daughter’s death, IRENE KELLY travels through parallel universes, killing her daughter’s murderer over and over again. She grows addicted to the revenge streak, putting her own humanity in jeopardy. (SXSW 2025)",
        "content": " ",
        "upvotes": 2590,
        "comments": 196,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/hw9o63w9xtee1.jpeg?auto=webp&amp;s=66b7b77a9cf2afebe23da697280079e99acb6c93"
        },
        "permalink": "/r/movies/comments/1i8hipy/first_image_from_redux_redux_in_an_attempt_to/"
    },
    {
        "id": "1i9ess7",
        "author": "latticep",
        "title": "Who is the most beloved living actor?",
        "content": "Not necessarily who is the greatest or most accomplished. For example, whose death do you think would result in greatest global mourning? Personally, I think it's Ian McKellen. I think the world will be devasted when he passes. Watching RotK today and hearing him tell Pippin about death and White Shores made me misty eyed. May he enjoy many more years of good health! ",
        "upvotes": 14,
        "comments": 194,
        "media": null,
        "permalink": "/r/movies/comments/1i9ess7/who_is_the_most_beloved_living_actor/"
    },
    {
        "id": "1i905qs",
        "author": "NoCulture3505",
        "title": "Brad Pitt To Produce &amp; Star In ‘Heart Of The Beast,’ David Ayer’s Action Adventure Pic For Paramount",
        "content": "",
        "upvotes": 99,
        "comments": 44,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9OtfcZi87wPZecT72quTOHtkwVMCOVN7C_cQ6mOBnx8.jpg?auto=webp&amp;s=1597b3348ad1df7941a8248ecae01e2600a4b775"
        },
        "permalink": "/r/movies/comments/1i905qs/brad_pitt_to_produce_star_in_heart_of_the_beast/"
    },
    {
        "id": "1i98ezi",
        "author": "Davis_Crawfish",
        "title": "Joe Pesci in \"Goodfellas\": What are your thoughts on Tommy DeVito?",
        "content": "I thought Joe Pesci did an amazing job in Goodfellas and he completely deserved to win the Oscar. It's not easy to stand out in a film with Robert DeNiro, Lorraine Bracco, Ray Liotta and Paul Sorvino but Joe Pesci was excellent, he nailed the part. \n\nI hated Tommy but I was also fascinated by him. This was a guy who was kind to his mother and knew how to draw a audience for himself but he also knew how to put the fear of God on anyone. I think the scene where he shoots Spider's foot for fun and then kills the kid because Spider cursed him out is where one realizes how genuinely awful he is. He was already bad just for being a mobster and had a temper but Spider was just a kid, probably another young Henry, which is why Henry looked down at Spider's body with sadness because he saw himself in Spider. He could have died like Spider, had he been faced with someone as nutty as Tommy. Even Jimmy chided Tommy for shooting the kid. When Jimmy Conway thinks you've gone too far, it's really bad. \n\nI definitely think Tommy DeVito is one of the most charismatic but heinous gangsters in American Cinema and Joe Pesci played him brilliantly.",
        "upvotes": 31,
        "comments": 71,
        "media": null,
        "permalink": "/r/movies/comments/1i98ezi/joe_pesci_in_goodfellas_what_are_your_thoughts_on/"
    },
    {
        "id": "1i99431",
        "author": "rayrayrayray",
        "title": "What are your thoughts on Quick Change (1990)?",
        "content": "I remember watching this in the theatre with a couple of friends in high school and we were sore from laughing so much. I havent heard too many people mention it here so wondered if it still holds up today. There was a scene with a bike joust that was so bizarre and funny that I was in tears from laughing so hard.\n\nhttps://preview.redd.it/kjfxilrgz0fe1.jpg?width=810&amp;format=pjpg&amp;auto=webp&amp;s=ad0910db5e5670903fc1aae90cef55c4bac6b6c2\n\n",
        "upvotes": 24,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1i99431/what_are_your_thoughts_on_quick_change_1990/"
    },
    {
        "id": "1i93xd6",
        "author": "ludaman14",
        "title": "Taking movies less and less seriously as I get older",
        "content": "And I mean that in a good way. When I was younger I always viewed movies through a critic's lense. I would pay attention to details that may or may not make sense. Continuity errors. Realism. Plot details. Etc. If they checked off certain boxes (character growth, realistic action scenes if any, a flow to the plot that made sense, etc) then I would say I just watched a good movie. If not, I would just say the movie isn't good and dismiss it completely while trashing it if it ever came up in conversation. I wanted to \"have good taste\" and to me that meant it had to somewhat align with award season nominees or the general public's opinion. \n\nOver the past few years, though, I realize I've been doing it wrong. I have loosened this criteria I had in my head and began to soak up movies in the way they were primarily intended...to just have fun. Yes, I can still technically recognize when a movie is doing an amazing job conveying a message, shot well, well written, etc, but those things are not required for me to just have fun. As an example, I know many of us would agree the Michael Bay Transformers movies aren't considered quality filmmaking/storytelling. I won't be led down a rabbit hole of soul seeking questions pondering what it means to struggle morally, financially, etc. But...I will walk away having been wowed by the visuals, sound design, and over the top action scenes. I will have walked away doing what most of us want to do, escape reality for a bit.\n\nSo, all this to say, I've grown to appreciate a lot more movies than I did before because the lenses I'm wearing aren't meant to judge anymore. I just sit along for the ride, laugh at how a dumb teenager investigates a weird noise during a horror movie, and just accept that no one aims for John Wick's head or hands while he covers himself with the bulletproof suit jacket. Also, I accept that a suit jacket is plausible. The only lenses I'm wearing are prescription because without them I won't see crap \n\nPS: I still have standards and The Strangers Chapter 1 was  one of the dumbest, nonsensical movies I've seen in recent years. Couldn't have fun. Was just angry the whole time.",
        "upvotes": 36,
        "comments": 74,
        "media": null,
        "permalink": "/r/movies/comments/1i93xd6/taking_movies_less_and_less_seriously_as_i_get/"
    },
    {
        "id": "1i9a2fb",
        "author": "ultros03",
        "title": "How much does the quality of a soundtrack impact your rating of a movie?",
        "content": "I was thinking, and I feel some of my favorite movies are ranked so high in my book because of their outstanding soundtracks.  Taxi Driver, Pulp Fiction, Inglorious Basterds, The Good the Bad and the Ugly are some of my most favorite movies and all have stellar soundtracks. For me, even mediocre movies like Interstellar and Scarface get major bonus points because of their amazing soundtracks. Guys like Morricone, Zimmer, Williams, and Herrmann don't receive enough credit for how much they elevated the movies they composed for. I couldn't have been more ecstatic than when Morricone finally won an Oscar for Hateful Eight after so much brilliance.  Anyone else feel this way?",
        "upvotes": 15,
        "comments": 52,
        "media": null,
        "permalink": "/r/movies/comments/1i9a2fb/how_much_does_the_quality_of_a_soundtrack_impact/"
    },
    {
        "id": "1i8ajcr",
        "author": "MarvelsGrantMan136",
        "title": "Robert Eggers Set to Write and Direct ‘Labyrinth’ Sequel At TriStar",
        "content": "",
        "upvotes": 3165,
        "comments": 691,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rjQktfgRqkGg0p1tbPwMdDkN0UeqAQL12hfTyBEjydw.jpg?auto=webp&amp;s=154b88a3c833974982427694534a45ce79ca973b"
        },
        "permalink": "/r/movies/comments/1i8ajcr/robert_eggers_set_to_write_and_direct_labyrinth/"
    },
    {
        "id": "1i9b54l",
        "author": "First-Exchange-7324",
        "title": "Animated Movies With Most Oscar Nominations",
        "content": "I created a list of the animated movies with the most Oscar nominations because I had trouble finding a similar list on the Internet. If the animated film won in that category, it is in bold. Also, many of these movies had multiple nominations for Best Original Song. If it had two nominations for Best Original Song, I added \"x 2\". If it had three nominations, it is followed by \"x 3\". Also, for this list, I am counting Honorary and Special Achievement Oscars.\n\nLet me know if I made any mistakes or forgot any films.\n\n  \n6 Nominations\n\nBeauty and the Beast- Best Picture, **Best Original Score**, **Best Original Song** x 3, Best Sound\n\nWall-E- Best Original Screenplay, Best Original Score, Best Original Song, Best Sound Editing, Best Sound Mixing, **Best Animated Feature**\n\n \n\n5 Nominations\n\nAladdin- **Best Original Score, Best Original Song** x 2, Best Sound, Best Sound Editing\n\nRatatouille- Best Original Screenplay, Best Original Score, Best Sound Editing, Best Sound Mixing, **Best Animated Feature**\n\nUp- Best Picture, Best Original Screenplay, **Best Original Score**, Best Sound Editing, **Best Animated Feature**\n\nToy Story 3- Best Picture, Best Adapted Screenplay, **Best Original Song**, Best Sound Editing, **Best Animated Feature**\n\n \n\n4 Nominations\n\nThe Lion King- **Best Original Score, Best Original Song** x 3\n\nToy Story- Best Original Screenplay, Best Original Score, Best Original Song, **Special Achievement**\n\nMonsters, Inc.- Best Original Score, **Best Original Song**, Best Sound Editing, Best Animated Feature\n\nFinding Nemo- Best Original Screenplay, Best Original Score, Best Sound Editing, **Best Animated Feature**\n\nThe Incredibles- Best Original Screenplay, **Best Sound Editing**, Best Sound Mixing, **Best Animated Feature**\n\n \n\n3 Nominations\n\nBambi- Best Original Score, Best Original Song, Best Sound\n\nCinderella- Best Original Score, Best Original Song, Best Sound\n\nThe Little Mermaid- **Best Original Score, Best Original Song** x 2                          \n\nThe Polar Express- Best Original Song, Best Sound Editing, Best Sound Mixing\n\nThe Princess and the Frog- Best Original Song x 2, Best Animated Feature\n\nSoul- **Best Original Score,** Best Sound, **Best Animated Feature**\n\nFlee- Best Animated Feature, Best International Feature, Best Documentary Feature\n\nEncanto- Best Original Score, Best Original Song, **Best Animated Feature**\n\nThe Wild Robot- Best Original Score, Best Sound, Best Animated Feature (TBA if it wins any of these categories)\n\nSources:\n\n[https://en.wikipedia.org/wiki/List\\_of\\_animated\\_feature\\_films\\_nominated\\_for\\_Academy\\_Awards](https://en.wikipedia.org/wiki/List_of_animated_feature_films_nominated_for_Academy_Awards)\n\n[https://en.wikipedia.org/wiki/Academy\\_Award\\_for\\_Best\\_Animated\\_Feature](https://en.wikipedia.org/wiki/Academy_Award_for_Best_Animated_Feature)",
        "upvotes": 10,
        "comments": 13,
        "media": null,
        "permalink": "/r/movies/comments/1i9b54l/animated_movies_with_most_oscar_nominations/"
    },
    {
        "id": "1i8mb9r",
        "author": "PulIthEld",
        "title": "Falling Down (1993) is my new favorite movie. It absolutely nails America.",
        "content": "I dont really know what else to say.  I can't believe it took me so long to see this movie.  I've seen clips, I've seen some of its imagery, but somehow I never watched it till now.  \n\nThe movie has you rooting for \"the bad guy\" the entire time.  I loved the dichotomy between the Sheriff and Foster, where they both reach a breaking point with bullshit and go past the point of no return.\n\nAlmost all of the points are still relevant today.  The overpriced goods, the screwed up politics and bureaucracies, liars prospering, Nazis, people getting rich off useless and empty services, wasting land and wealth on the few while the majority are suffering.  \n\nWhat a great goddamn movie.",
        "upvotes": 567,
        "comments": 288,
        "media": null,
        "permalink": "/r/movies/comments/1i8mb9r/falling_down_1993_is_my_new_favorite_movie_it/"
    },
    {
        "id": "1i8tc50",
        "author": "AaronYaygar",
        "title": "Free streaming services are genuinely fantastic now.",
        "content": "As someone who can't really afford a streaming service 24/7 (though I do snag a lot of the free trials that get thrown out there) I've been relying more and more on things like Tubi and Freevee for my monthly movies and shows. Vudu/Fandango also carries a few fun things for free (though the app sadly isn't available on PS4 anymore), and Pluto TV tends to have a solid selection as well.\n\nAs an example of the quality work that Tubi is frequently showing off these days, they've currently got Heat, Train To Busan, Taxi Driver, Point Break, and Dances With Wolves all sitting pretty in their selection.. and that's just the very tip of the iceberg when it comes to the interesting things in their archives, much of it hidden away underneath the large pile of trashy stuff that they also tend to have lying around.\n\nBlockbusters, indie gems, gritty action classics, forgotten oddball work; the variety that you can find on a lot of these services is just awesome. So if there's any other film fans out there who ever struggle to find something interesting to watch, I just wanted to say: take a scroll through the archives of these services, and I think you'll find at least a few things that catch your eye.",
        "upvotes": 123,
        "comments": 48,
        "media": null,
        "permalink": "/r/movies/comments/1i8tc50/free_streaming_services_are_genuinely_fantastic/"
    }
]