[
    {
        "id": "1hmfpsf",
        "author": "LiteraryBoner",
        "title": "Official Discussion Megathread (Nosferatu / a Complete Unknown / Babygirl / The Fire Inside / The Order)",
        "content": "# New Theatrical Releases\n\n[A Complete Unknown](https://old.reddit.com/r/movies/comments/1hlsi27/official_discussion_a_complete_unknown_spoilers/?)\n\n[The Fire Inside](https://old.reddit.com/r/movies/comments/1hlsi3n/official_discussion_the_fire_inside_spoilers/?)\n\n[Nosferatu](https://old.reddit.com/r/movies/comments/1hmffh4/official_discussion_nosferatu_2024_spoilers/?)\n\n[Babygirl](https://old.reddit.com/r/movies/comments/1hmffj8/official_discussion_babygirl_spoilers/?)\n\n# Streaming Releases\n\n[Nightbitch](https://old.reddit.com/r/movies/comments/1homiqy/official_discussion_nightbitch_spoilers/)\n\n[The Order](https://old.reddit.com/r/movies/comments/1hlsi4b/official_discussion_the_order_spoilers/?) on VOD\n\n[Juror #2](https://old.reddit.com/r/movies/comments/1hjiwvb/official_discussion_juror_2_spoilers/?) on MAX\n\n# Still in Theaters\n\n[Sonic the Hedgehog 3](https://old.reddit.com/r/movies/comments/1hiae45/official_discussion_sonic_the_hedgehog_3_spoilers/?)\n\n[Mufasa: The Lion King](https://old.reddit.com/r/movies/comments/1hiae58/official_discussion_mufasa_the_lion_king_spoilers/?)\n\n[Wicked: Part 1](https://old.reddit.com/r/movies/comments/1gwxxy1/official_discussion_wicked_part_i_spoilers/)\n\n[Moana 2](https://old.reddit.com/r/movies/comments/1h0uevk/official_discussion_moana_2_spoilers/)\n\n[Gladiator II](https://old.reddit.com/r/movies/comments/1gwxxwd/official_discussion_gladiator_ii_spoilers/)\n\n[Kraven the Hunter](https://old.reddit.com/r/movies/comments/1hd2v8v/official_discussion_kraven_the_hunter_spoilers/?)\n\n[The Lord of the Rings: The War of Rohirrim](https://old.reddit.com/r/movies/comments/1hd2vab/official_discussion_the_lord_of_the_rings_the_war/?)",
        "upvotes": 76,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hmfpsf/official_discussion_megathread_nosferatu_a/"
    },
    {
        "id": "1hpp7yt",
        "author": "SanderSo47",
        "title": "December 27-29 Box Office Recap: 'Sonic 3' and 'Mufasa' fight for the top spot at the box office. 'Nosferatu' opens with a fantastic $40.3 million in its first five days, already becoming Robert Eggers' highest grossing film. 'A Complete Unknown' settles for sixth place with $23.1 million.",
        "content": "https://preview.redd.it/k21dn07d40ae1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=5b2edf912cefe80f8f6936c9ec0814e5006ae794\n\n#**Normally you'd wait till the Weekend Actuals are out. But the numbers are delayed due to the holidays, so you'll only have estimates for now. The same could happen next week.**\n\nIt was a fierce battle at the box office.\n\n***Sonic 3*** and ***Mufasa: The Lion King*** fought for the top spot, with the hedgehog currently leaning on the top spot for now. On Christmas, we got 4 newcomers, with mixed results. ***Nosferatu*** delivered a fantastic debut and became Robert Eggers' highest grossing film in just 5 days, while ***A Complete Unknown*** had a very solid start. On the other hand, ***Babygirl*** had a soft start, while ***The Fire Inside*** failed to attract interest.\n\nThe Top 10 earned a combined $159.2 million this weekend. That's up a huge 58% from last year, when ***Wonka*** returned to the top spot.\n\nStaying on top, ***Sonic 3*** earned $38 million this weekend ($59.9 million five-day). That represents a 37% drop, which is better than the previous films. There were concerns over the weekdays, as it appeared that it was front-loaded and would show weak legs, but it looks like it recovered for now.\n\nThrough ten days, the film has amassed $136.8 million. It should have another great hold this weekend, which will allow it to hit $200 million very soon. It can go as high as $250 million at this pace.\n\nSettling for second place, ***Mufasa*** made $37.1 million this weekend ($63.7 million five-day). That's a very nice 5% increase from last weekend. It had a soft debut but it's showing some strength. Through 10 days, it has made $113.4 million. Despite this increase, the film is still off a massive 68% from the 2019 film through the same point. We'll see how much it can earn through the holidays.\n\nExceeding expectations, Robert Eggers' ***Nosferatu*** debuted with a fantastic $21.1 million this weekend ($40.3 million five-day). This is not just Eggers' biggest debut by a wide margin, but it's already his highest grossing film domestically, passing ***The Northman*** ($34.2 million). It's also the fourth biggest debut for Focus Features.\n\nThis is an amazing result in any sense of the word, and showed that Eggers could finally hit the mainstream audience (***The Northman*** was supposed to be that film, but it didn't quite land at the box office). But that still raises the question: how was this film able to debut this high and far above Eggers' films? Credit must go to a fantastic marketing campaign, which offered enough intrigue and darkness to attract audiences. The decision to hide Bill Skarsgård's appearance as the iconic Count Orlok from the trailers panned out very well; if you want to watch him, you have to pay a ticket.\n\nIt can be said that Eggers' brand has also increased in past years. While ***The Northman*** wasn't a box office hit, Focus Features confirmed that the film eventually became profitable after a few months thanks to strong VOD numbers and other post-theatrical markets, and this was a big reason why they were confident in greenlighting ***Nosferatu***. Also, while remaking a 1922 silent German Expressionist film feels like it would struggle to get recognition, ***Nosferatu*** actually had some exposure to the audience. A lot of kids were introduced to this character in that iconic ***SpongeBob SquarePants*** episode. That helped the film build awareness. \n\nAccording to Focus Features, 55% of the audience was male and 56% of the audience was in the 18-34 demographic. While critics raved about the film, audiences wasn't as much; they gave it a weak \"B–\" on CinemaScore. That's not actually a bad score for a horror film, given they often fall in the C range. Nevertheless, without horror competition till ***Wolf Man*** in mid January, ***Nosferatu*** should hold well through the holidays. While it's unclear how much it can earn, one thing is clear: this is hitting $100 million domestically, which is an amazing result.\n\n***Wicked*** rose 37%, adding $19.4 million this weekend ($31.7 million five-day). On Christmas day, it added a sing-along version, which boosted the numbers. The film has earned a fantastic $424 million so far.\n\nAfter its weak legs, ***Moana 2*** had its best drop so far. It jumped 38%, adding $18.2 million this weekend. A much needed recovery, given it wasn't holding well after its gigantic opening. The film has earned $394.6 million so far, and will hit the $400 million milestone in a few days.\n\nDebuting in sixth place, Searchlight's ***A Complete Unknown*** earned $11.6 million ($23.1 million five-day). This is one of the best debuts for Searchlight, and its opening day ($7.2 million) was a record for the studio. If we want to compare it to James Mangold's films, the five-day debut is slightly above of what ***Walk the Line*** made in 3 days ($22.3 million). \n\nThis is a solid start, and the only reason why it's not fantastic is that it's carrying an extensive $60-$70 million budget, putting a lot of pressure in the film. Bob Dylan is one of the most iconic singers and songwriters of the past century, although he is still not as popular as other musicians in other biopics. For example, Queen, Elton John and Bob Marley are more popular with current audiences than Dylan. So the film had only one selling point: its star Timothée Chalamet.\n\nLike him or not, Chalamet is one of the most popular young stars of our times. He already had huge hits in the past year with ***Wonka*** and ***Dune: Part Two***, and he's already set for another film, ***Marty Supreme***, which also opens on Christmas Day next year. Deadline reported that 36% of the audience watched the film for Chalamet, cementing a status as a box office draw. Reviews were also solid enough to win over audiences, and some Oscar buzz is on the horizon.\n\nAccording to Searchlight, the audience was equally split between men and women. Unsurprisingly, the big demo was adults; 62% of the audience was 35 and over. They gave it a strong \"A\" on CinemaScore, which bodes very well for its legs. And you have to remember that this is targeting an old audience, which doesn't rush out to watch a film as soon as possible. We'll keep an eye on this one, but the incoming Oscar buzz should help it stay in theaters for quite  a long time.\n\nIn a distant seventh place, A24's ***Babygirl*** earned $4.3 million ($7.2 million five-day). That's quite a soft start, especially considering that the film was playing in 2,115 theaters, and the fact that A24 pushed it as its main attraction for the holidays.\n\nThe film is sold as an erotic thriller, but that can be a mixed bag at the box office. Outside the ***Fifty Shades of Grey***, erotic thrillers haven't performed very well at the box office. And despite having a big name in Nicole Kidman, she hasn't had a good run as of late; she hasn't had a single box office hit since ***The Upside*** back in 2019. Her recent success has been on streaming and on TV, leaving questions over her star power at the box office (even though she's the face of AMC).\n\nAccording to A24, 53% of the audience was female and 44% of the audience was 35 and over. While critics were positive of the film, the audience wasn't forgiving; they gave it a very weak \"B–\" on CinemaScore, which might be due to the nature of the film itself. While Kidman has some Oscar buzz, it would be a surprise if the film made anything above $20 million domestically.\n\n***Gladiator II*** continues showing some great late legs. The film eased just 9% and earned $4.1 million this weekend. That takes its domestic total to $163 million. It's gonna head to around $175 million.\n\nAngel Studios' ***Homestead*** had the worst drop in the Top 10. It dropped 47%, adding $3.1 million this weekend. That takes its domestic total to $12.8 million, and it suggests that it will fall off when the holidays are over.\n\nRounding up the Top 10 was the last newcomer of the week, Amazon MGM's ***The Fire Inside***. Despite setting it at 2,006 theaters, the film bombed with just $2 million ($4.3 million five-day). That's the 28th worst debut for any film playing at 2,000+ theaters.\n\nThis isn't a surprising result. Amazon didn't appear to focus on properly marketing the film, choosing to simply dump it on Christmas and hoping that it would find an audience. After all, ***The Boys in the Boat*** over-performed last year, showing there was a market for sports dramas. But the film simply lacked a hook; people simply weren't interested in Claressa Shields' story. Even with the talent involved, it simply wasn't enough.\n\nAccording to MGM, 51% of the audience was female and 51% was 35 and over. On the bright side, the audience gave it a strong \"A\" on CinemaScore, which fits nicely with its great reviews. But even with that, it's unlikely it can turn things around.\n\n***Kraven the Hunter*** slightly recovered after its awful second weekend drop, even if it fell on the bad side of the drops. It dropped 44%, adding $1.7 million this weekend. Sadly, with an anemic $21.3 million domestic total so far, there's nothing to celebrate here. It might hit $25 million, but it won't get much higher than that.\n\nBut while ***Kraven*** kept showing weak legs, ***The Lord of the Rings: The War of the Rohirrim*** does not appear to have any legs. The film collapsed 63%, earning just $455,000 this weekend. Absolutely horrible considering the rest of the films had fantastic holds. The film has made just $8.5 million domestically, and it's now guaranteed to finish below $10 million.\n\nParamount chose to open the Robbie Williams biopic ***Better Man*** in 6 theaters, ahead of its wide release on January 10. But the film flopped with just $18,000 ($35,000 five-day), which translates to a very poor $3,000 per-theater average. Not a surprise, considering Williams failed to find an audience in America. This is a bad sign for its wide release.\n\n#**OVERSEAS**\n\n***Mufasa*** was still on top in the rest of the world, albeit only slightly. It added $77 million this weekend, taking its worldwide total to $327 million. The best markets currently are France ($20.9M), UK ($15.8M), Mexico ($15.5M), Italy ($14.4M) and Germany ($13.6M).\n\n***Sonic 3*** made its debut in the rest of the world, debuting with a dazzling $74 million in 52 markets, taking its worldwide total to $210 million. That's a huge 83% of the second film's debut. The best debuts were the UK ($15.1M), Mexico ($10.3M), France ($7.3M), Australia ($5.5M), Germany ($5.5M), Spain ($3.3M), Panama ($2.3M); Peru ($1.6M), Colombia ($1.3M) and Malaysia ($1.3M), all of which were records for the franchise. It should have no problem hitting $500 million, and it still has some markets left.\n\n***Moana 2*** added $36 million this weekend, and its worldwide total is now $882 million. The best markets are France ($53.9M), UK ($42.6M), Germany ($34.8M), Mexico ($28.2M) and Brazil ($25.7M).\n\nIn a major milestone, ***Wicked*** has now passed ***Mamma Mia!*** to become the highest grossing Broadway adaptation, with a current worldwide total of $634 million. The best markets are the UK ($67M), Australia ($24.8M), Korea ($14.2M), Germany ($11.8M) and Mexico ($9.9M).\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Heretic* | Nov/8 | A24 | $10,829,810 | $27,716,205 | $42,703,807 | $10M\n\n- A24's ***Heretic*** has closed with $42 million worldwide. That's a very solid start, even if the film didn't have a lot of staying power after its good debut. If Hugh Grant making a Jar-Jar impression is not enough to get you to buy a ticket, nothing will.",
        "upvotes": 176,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/UsfdGAkh1IxdywQuaZAtKyPHE84GbGZoPXH8oqdNDxc.png?auto=webp&amp;s=e0931a977d1cac08b034c4a0a03fb55a018ab231"
        },
        "permalink": "/r/movies/comments/1hpp7yt/december_2729_box_office_recap_sonic_3_and_mufasa/"
    },
    {
        "id": "1hqaoki",
        "author": "ubcstaffer123",
        "title": "Nosferatu is the stuff of exquisitely erotic nightmares",
        "content": "",
        "upvotes": 1084,
        "comments": 342,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/DDGMrU8QLWk1YClzYX7Fke6FbWmUJG8gJY7O2J5HTh0.jpg?auto=webp&amp;s=d7f4697f104e2002d1ccbfe6a70fa8700db1f056"
        },
        "permalink": "/r/movies/comments/1hqaoki/nosferatu_is_the_stuff_of_exquisitely_erotic/"
    },
    {
        "id": "1hqep7c",
        "author": "Puzzled-Tap8042",
        "title": "Karolyn Grimes, Zuzu in ‘It’s a Wonderful Life,’ Looks Back on a Life That Wasn’t Always Wonderful;The 84-year-old, who was six when she played Jimmy Stewart and Donna Reed's daughter, was orphaned at 15 and later lost a son to suicide, didn't even see the Christmas classic until she was 40",
        "content": "",
        "upvotes": 262,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Pcr5S5N_0A8TR-XAdJKz91N-Tq5Foy6kkWX47noXBss.jpg?auto=webp&amp;s=9f63fd3bdcdb501b6cdf76d0b56db69cb937d552"
        },
        "permalink": "/r/movies/comments/1hqep7c/karolyn_grimes_zuzu_in_its_a_wonderful_life_looks/"
    },
    {
        "id": "1hqh120",
        "author": "BunyipPouch",
        "title": "New Poster for Dystopian-Thriller '2073' - It’s the year 2073, the worst fears of modern life have been realized. Surveillance drones fill the burnt orange skies and militarized police roam the wrecked streets, while survivors hide away underground, struggling to remember a free &amp; hopeful existence.",
        "content": "",
        "upvotes": 167,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/iubldnh6d7ae1.jpeg?auto=webp&amp;s=9a03f19ea55b5e55f85372150f2a444c40e2e2bf"
        },
        "permalink": "/r/movies/comments/1hqh120/new_poster_for_dystopianthriller_2073_its_the/"
    },
    {
        "id": "1hpsddf",
        "author": "MarvelsGrantMan136",
        "title": "Jason Momoa To Play Lobo In ‘Supergirl: Woman Of Tomorrow’",
        "content": "",
        "upvotes": 9744,
        "comments": 1016,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OAb9kVxJt-rwl774VRvElaGO_bjGjT_HVXM8yrTFE54.jpg?auto=webp&amp;s=10a7b0cfcd59c9ec1519397df99367ab43d9b6f9"
        },
        "permalink": "/r/movies/comments/1hpsddf/jason_momoa_to_play_lobo_in_supergirl_woman_of/"
    },
    {
        "id": "1hq5wyz",
        "author": "Hookton",
        "title": "Who do you think are the most noticeable age miscasts?",
        "content": "I've just been rewatching The History Boys and one particular actor stuck out to me. The main group are all Hollywood teenagers (aka babyfaced late-20s in a school uniform) and they're pretty convincing as teenagers.\n\nBut one of them... I looked him up and he's around the same age as his cast classmates but I swear to god he looks easily 40+. Least believable teenager I've ever seen on screen.",
        "upvotes": 775,
        "comments": 903,
        "media": null,
        "permalink": "/r/movies/comments/1hq5wyz/who_do_you_think_are_the_most_noticeable_age/"
    },
    {
        "id": "1hpxh09",
        "author": "MarvelsGrantMan136",
        "title": "‘Star Wars’ Actor Angus MacInnes (Gold Leader Jon \"Dutch\" Vander) Dies at 77",
        "content": "",
        "upvotes": 2030,
        "comments": 89,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/QzKvUP0uynjcTdHNjw4C4q5upk690Ph3GbXu6I06QKA.jpg?auto=webp&amp;s=b2c3c8547ef8901e5618a20f8dc783f76e79786a"
        },
        "permalink": "/r/movies/comments/1hpxh09/star_wars_actor_angus_macinnes_gold_leader_jon/"
    },
    {
        "id": "1hpu0qn",
        "author": "indiewire",
        "title": "The 30 Best Nude Scenes in Film, from ‘Shortbus’ to ‘Blue Velvet’ to ‘No Hard Feelings’",
        "content": "",
        "upvotes": 2436,
        "comments": 616,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/BY3G6rWx_JbiquYffzQcS3_KcdI2mTJHCKoaK3BmzTw.jpg?auto=webp&amp;s=fc1b27e1cc33b2de319b0977974051f9071e3481"
        },
        "permalink": "/r/movies/comments/1hpu0qn/the_30_best_nude_scenes_in_film_from_shortbus_to/"
    },
    {
        "id": "1hpoeci",
        "author": "dragondiaper",
        "title": "PSA: Hundreds of Beavers is free on YouTube",
        "content": "",
        "upvotes": 2584,
        "comments": 444,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/76ZReWomzFEI3mpen9c1ztPqZ4wAUAgDkBrEDerXs3Y.jpg?auto=webp&amp;s=08246297a9423eac8d8c3f75e632c26ed24cdeb3"
        },
        "permalink": "/r/movies/comments/1hpoeci/psa_hundreds_of_beavers_is_free_on_youtube/"
    },
    {
        "id": "1hq3ofi",
        "author": "simondufresne",
        "title": "Another Reason To Not Abandon Physical Media",
        "content": "So I love and collect movies, we've got well over 1500 individual movies in our library and I know we've all gotten used to hearing the arguments that you never really \"own\" anything with digital purchases, and companies can take these movies offline at any time etc etc. and that's all true! \n\nBut another massive point i want to give physical media is also all the extras that come along with the discs. \n\nThese interactive DVD menus, the GAMES they would sometimes shove into the discs, the commentaries, making ofs, interviews, special features. If someone doesn't upload them to youtube and save them they're just gone. \n\nI'm going through Disney plus right now because there are TWO disney movies I don't own on disc and after watching the movie I went to their extras and it's just the original trailer to the movie. I'm looking online at the list of features on the DVD and I've got:\n\n* Deleted Scenes\n* behind the scenes footage\n* outtakes\n* art galleries and storyboards\n* audio and visual commentaries\n* fact or fiction deep dive into the history of the movie's lore\n* how the language of the movie was created\n* character design breakdowns\n* interviews with the cast and creatives\n\noh yeah and FOUR of the movie's trailers along with images of the print campaigns.\n\n  \nbut thanks for that ONE trailer as an Extra DisneyPlus, yeah - I love that.\n\n  \nok rant over - don't throw away your discs y'all.",
        "upvotes": 284,
        "comments": 93,
        "media": null,
        "permalink": "/r/movies/comments/1hq3ofi/another_reason_to_not_abandon_physical_media/"
    },
    {
        "id": "1hq2cx1",
        "author": "Effective-Celery8053",
        "title": "Don't get scammed into seeing homestead",
        "content": "It was so awful. Basically a 2 hour trailer to set up the TV show. I bought tickets mainly because I was interested in the sweepstakes, and the trailer looked like something right up my alley (I love anything post apocalypse) but what a waste of 2 hours. \n\nThe setup didn't make any sense (two random dudes in a fishing boat can set off a nuke inside of random barrels? Then Russia takes out our entire electric grid?)\n\nThe only conflict was: oh our food *might* run out in months, what will we ever do? And a swat team that randomly showed up because of a corrupt government official that needs his taxes! (Who, after all brief shootout, decides to just leave?)\n\nI actually do like the message that them letting in the \"\"\"refugees\"\"\" in (basically just their neighbors outside their gate) was ultimately beneficial to them, but that's going to piss their target off so much that actually might be kinda funny. \n\nThen it wraps up with basically a trailer for a show that is streaming now and a QR code to \"pay it forward\" (buy more tickets for other people) ",
        "upvotes": 346,
        "comments": 59,
        "media": null,
        "permalink": "/r/movies/comments/1hq2cx1/dont_get_scammed_into_seeing_homestead/"
    },
    {
        "id": "1hptut5",
        "author": "indiewire",
        "title": "'Nosferatu' Robert Eggers Interview: Learning His Craft on ‘Northman’",
        "content": "",
        "upvotes": 985,
        "comments": 146,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/LEnjYdHjAsZi7kBLaT7n_1u6YaleA22aR-3IMncqUgA.jpg?auto=webp&amp;s=95f868321f7d819fa373090dce95a8c4e6989bd6"
        },
        "permalink": "/r/movies/comments/1hptut5/nosferatu_robert_eggers_interview_learning_his/"
    },
    {
        "id": "1hprdj0",
        "author": "Task_Force-191",
        "title": "The Wild Robot Returns To Theaters On January 17th",
        "content": "",
        "upvotes": 1027,
        "comments": 107,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6xjsCy0XCpiwkODnYPJa68Gm4lGESJC--ZSydrrabAs.jpg?auto=webp&amp;s=7c01c588ec3e9f79bf13c23dc0754b7efe768a73"
        },
        "permalink": "/r/movies/comments/1hprdj0/the_wild_robot_returns_to_theaters_on_january_17th/"
    },
    {
        "id": "1hpxyrm",
        "author": "canada11235813",
        "title": "Movies where the Director's Cut is notably \"worse\" than the original?",
        "content": "I've seen Amadeus more than 20x over the years, but recently had the opportunity to see the Director's Cut for the first time... and was somewhat disappointed with it.\n\nThe Amadeus I've seen many times comes from the original DVD of the original theatrical release. When over at some friend's house recently, I suggested this movie, and the only version available for streaming was the DC.\n\nThe DC adds 20 minutes and a few sub-plots, and some gratuitous and unnecessary nudity. The sub-plots don't add much to the story, but do interrupt the flow of the original, which, in hindsight, was a masterfully edited in the way it flawlessly unrolled the story at a perfect pace.\n\nThe DC does add more music as well, which is great... except it also interrupts the aforementioned flow.\n\nWhile it was really cool to see these characters I've seen so many times in \"new\" situations, I feel the DC in this case was a step backwards from the original. Of course, having seen the original so many times and loved it, any changes made to this movie will be met with some serious scrutiny from me. And, of course, who am I to question Milos Forman -- it's his vision after all.\n\nAll that being said, I'd be interested to hear from those of you who've seen both versions of this movie, and which do you prefer?\n\nAnd, as per the title, are there other movies that come to mind that shouldn't have been meddled with? I know there are many Star Wars purists who have a lot to say. Any others?\n\n",
        "upvotes": 317,
        "comments": 607,
        "media": null,
        "permalink": "/r/movies/comments/1hpxyrm/movies_where_the_directors_cut_is_notably_worse/"
    },
    {
        "id": "1hqbh6l",
        "author": "Dope_12345",
        "title": "Major league ",
        "content": "Last night on the plane i watched major league on my ipad with my headphones. Its a movie i watched and enjoyed when i was younger, but i wanted to see if its still any good in my thirthies. \n\nThis movie completely surprised me in such a positive way. It was amazing!! The storyline is great, the characters are just so well played. That scene where Charlie sheen enters the field and the whole stadium is signing \"WILD THING\" gave me goosebumps. \n\nDuring the flight i had a couple of moment where i laughed out loud. There are some lines in this movie that were so funny: \n\nHats for bats, keep bats warm, gracias. \n\nJesus, i like him very much but he no help with  curveball. YOU TRYNNA SAY JESUS CHRIST CANT HIT A CURVEBALL? \n\nThe soundeffects of this movie are amazing it feels as if you are watching a real game. \n\nI highly recommend it to anyone who watched this movie when they were younger to watch it again! It was amazing!\n",
        "upvotes": 30,
        "comments": 38,
        "media": null,
        "permalink": "/r/movies/comments/1hqbh6l/major_league/"
    },
    {
        "id": "1hqf44t",
        "author": "lordofabyss",
        "title": "People who are watching movies tonight, which one is it and why did you pick it? ",
        "content": "So people who are at home and are watching movie(s) which one is it and why. I am planning to watch Bad times at El royals.  I love whodunit flicks and this movie has been on my watchlist for long time. Alternatively I will be watching Dressed to Kill as I watched Body Double few days back and loved it. ",
        "upvotes": 15,
        "comments": 108,
        "media": null,
        "permalink": "/r/movies/comments/1hqf44t/people_who_are_watching_movies_tonight_which_one/"
    },
    {
        "id": "1hpuyna",
        "author": "sketchesbyboze",
        "title": "Realized I Hallucinated an Entire Scene in Die Hard",
        "content": "I watched Die Hard with my family the other night. It's been ten years since I last saw it. Of course there's a famous scene early in the film where McClane kills one of Gruber's goons, then writes on his shirt, \"Now I have a machine gun. Ho, ho, ho!\" I could have SWORN there was an iconic callback to this scene later in the movie, when Gruber steals McClane's gun and disappears into a nearby elevator. Just as the doors close, Gruber says, \"Now \\*I\\* have a machine gun! Ho, ho, ho!\" with a delivery that brought down the house at my last theatrical screening in 2014.   \n  \nI spent the whole film waiting for this moment, my favorite moment in the film. And it never happened. Thinking maybe I had somehow zoned out and missed it, I googled the scene after the movie and ... I seem to have made it up? Imagined the entire sequence? It's a very surreal feeling, like learning that Robert Mitchum never sings \"Leaning on the Everlasting Arms\" in The Night of the Hunter. Thinking back on it, I suppose if Gruber had stolen a machine gun, he would have simply shot McClane and the film would've been over. ",
        "upvotes": 426,
        "comments": 120,
        "media": null,
        "permalink": "/r/movies/comments/1hpuyna/realized_i_hallucinated_an_entire_scene_in_die/"
    },
    {
        "id": "1hpaj6c",
        "author": "Gato1980",
        "title": "Robert De Niro’s $1 billion Wildflower Studios, the world’s first vertical film studio and production soundstage in Queens, NY, is complete and already operational",
        "content": "",
        "upvotes": 17301,
        "comments": 909,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/j9xB8Zx68285-ZMPznMHYZaZMmeUm1Rx4nktVVzT4yk.jpg?auto=webp&amp;s=6223e2d00b85c9034c9075530826596f17a2aed4"
        },
        "permalink": "/r/movies/comments/1hpaj6c/robert_de_niros_1_billion_wildflower_studios_the/"
    },
    {
        "id": "1hpzti5",
        "author": "Longjumping_Thing723",
        "title": "Why is movie dialogue vs SFX so quiet?",
        "content": "Trying to watch the latest aliens movie and I have to have subtitles because the dialogue is so quiet! But whenever there is an inch of action it’s like someone’s put the volume up to 200%\n\nI get that movies are made for cinema first but I wish there could be a middle ground. Considering streaming/home watching absolutely dominates numbers vs going out to the cinema nowadays.",
        "upvotes": 185,
        "comments": 166,
        "media": null,
        "permalink": "/r/movies/comments/1hpzti5/why_is_movie_dialogue_vs_sfx_so_quiet/"
    },
    {
        "id": "1hqhljh",
        "author": "VirtualMoneyLover",
        "title": "The Highwaymen (2019) is more of a social commentary than a crime thriller",
        "content": "Last night I rewatched it on Netflix and I couldn't fail to notice certain parallels to current events. The Bonnie and Clyde story is told from the law enforcement's POV, but showing that the murderrers,robbers are quite popular in the age of depression and economic uncertainty.\n\nAt one point Harrelson's character says while driving through a tent camp:\" I didn't know how good I had it.\" although he is living in a forclosured by the bank house.\n\nWe can even understand why Bonnie and Clyde became popular, they mostly robber banks and killed policemen. The banks were the ones doing the foreclosures and the policemen were enforcing that. \n(they did murder innocents too though but that didn't alter their public perception)\n\nThe whole movie has a beautiful but haunting soundtrack, and there are no winners here, everybody is suffering some way or other. Great characters and script....",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hqhljh/the_highwaymen_2019_is_more_of_a_social/"
    },
    {
        "id": "1hqhk6j",
        "author": "Garvilan",
        "title": "Villains whose motives are to create a problem, and then sell the solution?",
        "content": "I feel like I remember this in a movie but cannot remember which. \n\nJoe Lonsdale co-founded a company that can shoot EMP blasts in a targeted cone, without hurting the tech that is firing the EMP. \n\nHe is also co-founder of a militarized drone company, that is going to create naval drones for the military. \n\nThis is giving me major Bond villain vibes, but I cannot remember where exactly this trope was from. ",
        "upvotes": 4,
        "comments": 5,
        "media": null,
        "permalink": "/r/movies/comments/1hqhk6j/villains_whose_motives_are_to_create_a_problem/"
    },
    {
        "id": "1hphh03",
        "author": "Front_Sugar4784",
        "title": "The (Good Will Hunting) “will leaving Skylar scene” is so devastating to me",
        "content": "I watched the movie for the first time today, decided to give it a shot. Great movie. The part in the scene that truly got to me is where Skylar starts crying after will reveals his dad put cigarettes out on him when he was younger. It all goes down hill from there as will says he doesn’t love her and she breaks down. Something about the scene makes it stick out like a sore thumb. It’s incredible, acting is crazy good. \n\n\nhttps://youtu.be/e4hXrrc8fA8?si=WqNx3YCfEwLuNiJH\n",
        "upvotes": 1904,
        "comments": 180,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/bOyxqI1KEzyX6QdtKbT9VrMM9EPBBfgwdXvldcsCmKA.jpg?auto=webp&amp;s=80d729440a237d92873090b6ac6ad56e4b89bf0d"
        },
        "permalink": "/r/movies/comments/1hphh03/the_good_will_hunting_will_leaving_skylar_scene/"
    },
    {
        "id": "1hpogfs",
        "author": "SuplexCity-Mayor",
        "title": "Se7en 30th Anniversary | Experience It In IMAX | Official Trailer",
        "content": "",
        "upvotes": 461,
        "comments": 100,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Yo9rsYx4GSdlUJnzOd9GIXCyLWNkuLgUyaS7le4QVcs.jpg?auto=webp&amp;s=37cdeac2299f522987969e6d54f57e2e2d62f078"
        },
        "permalink": "/r/movies/comments/1hpogfs/se7en_30th_anniversary_experience_it_in_imax/"
    },
    {
        "id": "1hqfjti",
        "author": "QuaPatetOrbis641988",
        "title": "8 Seconds. The biopic on Lane Frost",
        "content": "Not sure how known or unknown the film is as wikipedia lists it grossed 19 million back in 1994. It starred of Luke Perry of \"90210\"fame.\n\nIt's a solid gem that captures the rodeo cowboy culture of the period. Not award worthy perhaps but an interesting setting anf subject matter. If nothing else, a good example of a tv actor trying to launch a movie career.",
        "upvotes": 4,
        "comments": 10,
        "media": null,
        "permalink": "/r/movies/comments/1hqfjti/8_seconds_the_biopic_on_lane_frost/"
    },
    {
        "id": "1hqeuv3",
        "author": "LongBilly",
        "title": "Just discovered Doctor Sleep and loved it. Any other below the radar recommendations?",
        "content": "I found a recommendation for Doctor Sleep and decided to give it a try.  I didn't even know this movie existed.  I thought it had a slow start, but in hindsight I see that time was well spent.  When the movie did speed up, I felt I understood these characters and knew what was going on.  My partner and I both found this movie very satisfying and were pleasantly surprised as many Stephen King adaptations are sub-par.  I would happily place this in the top 3 adaptations of the author.\n\nEdit:  Thank you all for the suggestions so far.  I've added a few to my list.  To further clarify, I didn't necessarily mean that I was wondering about other Stephen King adaptations, or horror generally, but rather what are some other films which didn't get the audience they deserved.\n\nP.S. Yes, I saw \"The Shining\" first.\n\nI can't help but wonder what else I may have missed that's worth the watch.  Any suggestions?",
        "upvotes": 4,
        "comments": 38,
        "media": null,
        "permalink": "/r/movies/comments/1hqeuv3/just_discovered_doctor_sleep_and_loved_it_any/"
    },
    {
        "id": "1hqhzh5",
        "author": "Misprinted_Zedruu",
        "title": "Looking for website that lists all previously un-released movies and shows",
        "content": "Im looking for a website that provides a list of all new movies and shows. By new I mean previously unavailable on any other streaming service, just released, brand new. \n\nI've been using JustWatch, but it does not actually filter for new content.  I can filter for new, which provides content that was added to streaming services regardless of release date. I can add the filter to show only released this year, but I still get movie and shows that are added to streaming services from earlier this year.  For example, Dune part 2 was just added to netflix and even though its been available to stream since March it still shows up under new because netflix just added it.\n\nAny help is appreciated :) ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/movies/comments/1hqhzh5/looking_for_website_that_lists_all_previously/"
    },
    {
        "id": "1hpdh9u",
        "author": "gearwest11",
        "title": "I never realize how many serious blows the major movie industry dealt with in the 2010’s ",
        "content": "From the death of the video rental stores (especially with Blockbuster), to the Sony Pictures hack, to the rise of streaming and the misguided push from the major  studios by creating their own or rebranding one, to the Harvey Weinstein scandal which leads to the #Metoo movement, and the big blow of it all was the Disney/Fox merger resulting one less major studio to make movies and less variety now.\n\nAnd honestly those factors feel like the reasons why this decade so far as far as mainstream movies goes has been less than stellar. \n\nIt's sad too because there was a time a studio would greenlight a quirky comedy like Zombieland or Hot Tub Time Machine or the Oscar bait but crowd pleasing drama like Argo or The Martian. Now those kinds of movies are so far in between and mostly become Netflix filler even if the film is good it's buried by a cluttered algorithm. \n\n\n\n",
        "upvotes": 1787,
        "comments": 211,
        "media": null,
        "permalink": "/r/movies/comments/1hpdh9u/i_never_realize_how_many_serious_blows_the_major/"
    },
    {
        "id": "1hpvl3h",
        "author": "JayDunzo",
        "title": "Ghost Ship is a chef’s kiss so-bad-it’s-good movie",
        "content": "It's an amazing, accidental work of art. A mindblowingly stupid, entertaining total blunder of a movie. The choices in the dialogue and plot are epically dumb in the best possible way, and it's all dead serious. There's not a single attempt at comedy or comic relief. All purely unintentional. It's up there with stuff like Anaconda or Ewe Boll\nmovies, but somehow even better. The whole movie, you're just like: Wait.. noooo, they're not seriously. Yep! Wow. How could they have decided to go with that line?! We were blown away with entertainment from start to finish, but it IS a bad movie at the end of the day. The only downside is it leaves you wishing you could watch it for the first time again. Not much re-watching value. \n\nIt made us think a lot about what constitutes a so-bad-it's-good movie. I think the only rule is: You can't try to make one on purpose, like these corporate, faux-meta wink-wink, fake it's-so-bad-it's-good movies of today. The 80's and 90's are peppered with great ones, but I think the early 2000's were the apex. It's so embarrassing and hilarious what audiences thought was cool back then ",
        "upvotes": 75,
        "comments": 95,
        "media": null,
        "permalink": "/r/movies/comments/1hpvl3h/ghost_ship_is_a_chefs_kiss_sobaditsgood_movie/"
    },
    {
        "id": "1hpqs6p",
        "author": "everonwardwealthier",
        "title": "What's a good movie to watch on New Year's Eve?",
        "content": "I'm not getting any good ideas and want the movie to be holiday appropriate for once since I don't usually. Maybe a movie that takes place on new years and has new years as a theme. Got some ideas about this?\n\nThis post needs to contain 300 words but there really isn't anything to say except what I wrote in paragraph one so I am going to add this second paragraph amd let the thread slide past the Reddit censor bots but I tell you what they should let you re-edit a rejected post instead of making you create a new one that would make things somewhat easier without the redundancy so there it is if that ain't enough then I am not going to write a third one.\n\n12/31/2024 230am EDIT:\n\nI got out a notebook and wrote all of your suggestions down and tallied them up.  270 replies got about 70 different titles, here's the most popular ones.\n\n* When Harry Met Sally\n* Strange Days\n* 200 Cigarettes\n* The Poseidon Adventure\n* Forrest Gump\n* The Apartment\n* Ghostbusters 2\n* New Year's Eve (2011)\n* Trading Places\n* Groundhog Day\n* New Year's Evil (1980)\n* Entrapment\n* Get Crazy\n* Four Rooms\n* Terror Train (1980)\n\nNon-holiday movies frequently given are Star Wars, Lord of the Rings and Back to the Future.  Many time-traveling flicks.Thanks for your responses and if you want another 50 suggestions read the comments.",
        "upvotes": 129,
        "comments": 301,
        "media": null,
        "permalink": "/r/movies/comments/1hpqs6p/whats_a_good_movie_to_watch_on_new_years_eve/"
    },
    {
        "id": "1hq5vcm",
        "author": "GTAwheelman",
        "title": "Best places to watch classic movies? (pre 1960's)",
        "content": "Max is good as it has TCM. I've also found Tubi to have some good classics as well.\n\nMy mother(75) and I (36) enjoy watching the old classics.  Staring actors like  Humphrey Bogart , William Powell, James Stewart and such. \n\nBogart movies are easy to come by on most streaming sites. However William Powell movies like The Thin Man and Jewel Robbery are not. Lots of places have them for rent or buy digital but no streaming. Which if I have to purchase I would rather have a DVD or BluRay. \n\nAccording to google the last time this was asked here was 4yrs ago. Most suggestions were TCM, Max, Prime, or Criterion. Prime no longer has good selection IMO. Criterion seems ok but I haven't spent much time with it.  \n\n",
        "upvotes": 13,
        "comments": 25,
        "media": null,
        "permalink": "/r/movies/comments/1hq5vcm/best_places_to_watch_classic_movies_pre_1960s/"
    },
    {
        "id": "1hpvzf8",
        "author": "indiewire",
        "title": "65 Directors Pick Their Favorite Films of 2024",
        "content": "",
        "upvotes": 58,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tZ28ksiRG7aFjVV7oONlzQaWn4zlRywaHKHV5HoDwIg.jpg?auto=webp&amp;s=5d2aa99bc3e4d0fdc7798e2085631e5bdf9f6314"
        },
        "permalink": "/r/movies/comments/1hpvzf8/65_directors_pick_their_favorite_films_of_2024/"
    }
]