[
    {
        "id": "1i17gtb",
        "author": "ICumCoffee",
        "title": "What is the Best Film You Watched Last Week? (01/07/25 – 01/14/25)",
        "content": "The way this works is that you post a review of the Best Film you watched this week. It can be any new or old release that you want to talk about.\n\n**Here are some rules:**\n\n1. **Check to see if your favorite film of last week has been posted already.**\n2. **Please post your favorite film of last week.**\n3. **Explain why you enjoyed your film.**\n4. **ALWAYS use SPOILER TAGS.**\n5. **Comments that only contain the title of the film will be removed.**",
        "upvotes": 15,
        "comments": 37,
        "media": null,
        "permalink": "/r/movies/comments/1i17gtb/what_is_the_best_film_you_watched_last_week/"
    },
    {
        "id": "1i0w6jg",
        "author": "SanderSo47",
        "title": "January 10-12 Box Office Recap: 'Den of Thieves 2' takes the #1 spot from 'Mufasa' and 'Sonic', debuting with $15 million domestically. However, 'Better Man' massively flopped in its wide expansion, debuting at #13 with a terrible $1 million from 1,291 theaters, against its $110 million budget.",
        "content": "https://preview.redd.it/wyyfpflzhvce1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=9e6b820d9a6c3bcf91bab0d1448e8d898d5716f5\n\nTurns out the kingdom didn't last long.\n\nWhether it was a surprise or not, ***Den of Thieves 2: Pantera*** managed to dethrone ***Mufasa: The Lion King*** for the top spot at the box office. In some very bad news, the wide expansion of ***Better Man*** was a complete disaster, finishing outside the Top 10.\n\nThe Top 10 earned a combined $69.6 million this weekend. That's down 16.8% from last year, when ***Mean Girls*** and ***The Beekeeper*** opened. Despite the current LA fires, the LA market still accounted for 8% of the weekend's gross, which is actually above the usual 7.9% in a normal weekend.\n\nDebuting at #1, ***Den of Thieves 2: Pantera*** earned $15 million in 3,008 theaters. That's almost on par with the original ***Den of Thieves*** ($15.2 million). It's also the first Lionsgate film to hit #1 at the box office since ***The Hunger Games: The Ballad of Songbirds &amp; Snakes*** in 2023 (they've had a very bad run last year).\n\nEven though it arrived 7 years later, clearly the interest was there for a ***Den of Thieves*** sequel. Compared to a lot of recent actions flicks with Gerard Butler, it has maintained that popularity thanks to home media and streaming. But these films corner the exact same market: the dad movie market. There's an audience who simply wants to watch an old-school action movie, and ***Den of Thieves*** delivers that (just like ***The Beekeeper*** did one year ago). The LA fires also didn't do much impact in its box office numbers; the LA market generated 10.4% of the film's box office, which is actually bigger than the original's 9.3% LA share.\n\nAccording to Lionsgate, 63% of the audience was male. As mentioned, this was a dad movie; 79% of the audience was 25 and over, with 52% over 35. They gave it a \"B+\" on CinemaScore, which is the same grade as the original. January looks quite weak, although it will have to compete with stuff like ***Wolf Man*** and ***Flight Risk*** in a few weeks. Nevertheless, it has enough gas to hit $40 million domestically.\n\nThe reign of ***Mufasa*** lasted just one weekend, as it had to go back to the second spot. The film dropped 39.4%, adding $14.2 million this weekend. The film has earned $188.7 million, which is a colossal 61% behind the 2019 film through the same point.\n\nIn third place, ***Sonic the Hedgehog 3*** dropped 46.8%, adding $11.3 million. With this, it has not only passed the second film's gross, but it also passed the $200 million milestone. It has earned $204.8 million so far, and it should finish with around $240 million domestically.\n\nIn fourth place, Focus Features' ***Nosferatu*** dropped 47.3%, adding $6.8 million this weekend. That takes its domestic total to a fantastic $81.8 million, and it's still on pace to finish with over $100 million, assuming it's not killed by ***Wolf Man*** this weekend.\n\n***Moana 2*** fell back to Earth after its holiday boost. It dropped 47.5%, earning $6.5 million this weekend. The film has amassed $434.8 million domestically.\n\nSearchlight's ***A Complete Unknown*** eased 37.4%, adding $5.1 million this weekend. With this, the film has crossed $50 million domestically, although the dream of $100 million died.\n\n***Wicked*** had a slightly rough drop. This time, it fell 48.7%, grossing $5.1 million this weekend. Nevertheless, it's not like Universal ain't hurtin'; the film has made $70 million in PVOD in its first week. The film has earned a fantastic $458 million so far.\n\nIn eighth place, A24's ***Babygirl*** is still holding very well despite the end of the holidays. The film eased just 30.6% (the best drop in the top 10), adding $3 million this weekend. The film has earned a damn good $21.7 million so far.\n\nIn ninth place, the Indian film ***Game Changer*** earned $2 million from just 805 theaters.\n\nRounding up the Top 10 was Roadside Attractions' ***The Last Showgirl***, which finally had its wide release after having a limited weekend run at a single theater last month. It debuted with a solid $1.5 million in 870 theaters. While it's set to expand it in to a few more theaters, don't expect it to hit $10 million.\n\nA24 expanded ***The Brutalist*** to 68 theaters, coming off its big wins at the Golden Globes last week. The film grossed a pretty great $1.3 million, which is a very strong $20,408 per-theater average. So far, the film has earned $2.7 million. It will see another expansion this weekend, before finally hitting wide release the following weekend.\n\n***Gladiator II*** fell 53.4%, adding $1.2 million this weekend. The film's domestic total stands at $170.9 million.\n\nWe have to go all the way to the #13 spot to find the weekend's other expansion, Paramount's ***Better Man***, the Robbie Williams biopic. We knew it was not gonna break out, given that its limited release numbers were very poor. Yet the film managed to surprise us by going even lower.\n\n***Better Man*** debuted in 1,291 theaters, and the film earned a terrible $1 million. Yep, you read that correctly. That's an anemic $824 per-theater average. Assuming that each theater played this five times a day at a regular $11.90 ticket price, that means that there were just 4 people in each screening. Woah. And to make things worse, the film cost $110 million. Now, Paramount is not deeply invested in here; they only picked the distribution rights to the film for $25 million. They won't lose a lot of money, but this will be another money loss for them.\n\nThe American market was never going crazy for a Robbie Williams biopic for a simple reason: they have no idea who Robbie Williams is. That's quite surprising, given that he's the one of the best-selling singers in history (75 million records sold puts him in the same vein as The Weeknd, Green Day, Oasis, Nirvana and Imagine Dragons). But despite his popularity across Europe, Oceania and Latin America, Williams never broke out in America. Only two of his songs made it in the Billboard Top 100 (\"Angels\" and \"Millennium\") and they both peaked at #53 and #72. So despite selling out a lot of concerts and records, he's still a complete unknown in America.\n\nThere's also the decision that was supposed to be its selling point, but still drew a polarizing reaction. To separate itself from other biopics, the film decided to depict Williams as a CGI chimpanzee. Bonus points for originality, but that also confused the general audience. So the audience are left with two questions \"who is Robbie Williams?\" and \"why is he a chimpanzee?\" Instead of trying to find more or listen to a few songs from Williams, they simply chose to not watch it all. After all, a music biopic is aimed at big fans of a singer, so why would they pay for an artist they don't care about? Even with great reviews (88% on RT and 77 on Metacritic), that's not enough to make them change their mind.\n\nAccording to Paramount, 56% of the audience was male, and 52% was 25 and over. Despite some great word of mouth (83% on PostTrak, 63% definite recommend), this is not a film that will leg out. It's not gonna hit $5 million domestically, and it's likely it could miss $3 million as well. We want to say it will be saved overseas, but the film has been disappointing in the UK and Australia so far. This is a flop.\n\n#**OVERSEAS**\n\n***Mufasa: The Lion King*** topped the box office with $27.8 million overseas, taking its worldwide total to $542 million. The film's best markets are France ($33.7M), UK ($29.9M), Mexico ($24.6M), Germany ($24M) and Italy ($21.8M).\n\n***Sonic the Hedgehog 3*** added $20.3 million, as it's nearing $400 million worldwide. Most notably, it opened in China, where it flopped with only a little over $1 million. The film's best markets are UK ($25.9M), Mexico ($18.8M), France ($15.8M), Australia ($13.2M) and Brazil ($9.2M).\n\n***Nosferatu*** added $13.7 million, taking its worldwide total to a fantastic $135.4 million. It's Robert Egger's highest grossing film by a wide margin, passing ***The Northman*** a long time ago. The best markets are the UK ($11.1M), Mexico ($6.03M), Italy ($4.3M), Germany ($3.5M) and Australia ($3.4M).\n\n***Moana*** added $11.1 million, helping it reach $990 million worldwide. The film's best markets are France ($60.6M), UK ($49.7M), Germany ($41.7M), Mexico ($30.2M) and Australia ($29.5M). It's hitting the billion milestone sometime this week.\n\n#**FILMS THAT ENDED THEIR RUN THIS WEEK**\n\nMovie | Release Date | Studio | Domestic Opening | Domestic Total | Worldwide Total | Budget |\n----------|----------|----------|:--------:|:--------:|:--------:|:--------:\n*Venom: The Last Dance* | Oct/25 | Sony | $51,012,404 | $139,755,882 | $474,775,261 | $120M\n*Y2K* | Dec/6 | A24 | $2,113,923 | $3,763,863 | $3,763,863 | $15M\n\n- Sony's ***Venom: The Last Dance*** has closed with $474 million worldwide. Despite its poor reception and word of mouth (\"B–\" on CinemaScore), the film benefitted from a lack of competition, as studios chose to avoid releasing anything close to the election. A success? Definitely. But the film still ended up making less money than ***Let There Be Carnage***, which was released in worse conditions and had no China grosses. Who knows what's the future for this character.\n\n- A24's ***Y2K*** has closed with a very poor $3.7 million in North America, which is a very bad 1.78x multiplier. Despite Kyle Mooney's interest in filmmaking, the film struggled to balance its horror and comedy elements, but at the end of the day, the audience simply wasn't interested. Let's hope his next film is much better, if he ever gets the chance.\n\n#**THIS WEEKEND**\n\nWe find two newcomers this weekend.\n\nThe first, and perhaps the weekend's winner, is Universal/Blumhouse's ***Wolf Man***. The film is the latest addition in Universal's reboot of their Classic Monsters line-up, after the success of ***The Invisible Man*** (also written and directed by Leigh Whannell). Horror is a very reliable genre, so perhaps we might be looking at another winner here.\n\nThe other wide release is Sony's ***One of Them Days***, which stars Keke Palmer and SZA as two friends who seek to avoid eviction. In the current landscape, there's been very few comedies not tied to IPS, so this can be a good test to see the interest in R-rated comedies.\n\n#**ANNOUNCEMENT**\n\nAs this weekend falls on the MLK weekend, the actuals will probably be delayed by a day. So the post will go up on Tuesday.\n\n____________________________________________________________________________________________\n\nIf you're interested in following the box office, come join us in r/BoxOffice.",
        "upvotes": 527,
        "comments": 234,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/J6sHqGlCE7IFtAjJ00C2QFPkrDUmHHSevojLsDVqiBg.png?auto=webp&amp;s=29b3406b72bfc098e28d778b27f2bc98003c832f"
        },
        "permalink": "/r/movies/comments/1i0w6jg/january_1012_box_office_recap_den_of_thieves_2/"
    },
    {
        "id": "1i19am5",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'Love Hurts' Starring Ke Huy Quan",
        "content": "",
        "upvotes": 790,
        "comments": 121,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/uq1zic9nfzce1.jpeg?auto=webp&amp;s=f8a48f2895c664006f25490d932fcfc283f98082"
        },
        "permalink": "/r/movies/comments/1i19am5/new_poster_for_love_hurts_starring_ke_huy_quan/"
    },
    {
        "id": "1i11bwr",
        "author": "capacitorfluxing",
        "title": "Ultra Movie Nerds: What is a movie quote that literally makes zero sense due to a clear mistake in the filmmaking process (bad editing/rewrites/continuity errors/etc), but often goes unnoticed by virtually all movie-goers? Bonus points if you know why it made the final cut",
        "content": "In Ghostbusters, the fountain scene with Venkman hounding Dana for a date ends with:\n\n**Dana: I’ll see you Thursday.**\n\n**Venkman: I’ll bring the Roylance Guide** **and we’ll eat and read.**\n\nIt's said so fast, honestly, most people only hear something like \"eat and read.\" But what the hell is Venkman talking about? \n\nIn the original script, \"The Roylance Guide to Secret Societies and Sects\" is mentioned in dialog earlier in the movie, akin to mentions of \"Tobin's Spirit Guide.\" Except, famously, GB was largely ad-libbed and reworked scene by scene as they were shooting, and mention of Roylance ended up being dropped. Slight problem: the Dana/Venkman fountain scene was the first shot on the film, so no one had any idea it'd go away. \n\nNot sure why they didn't just re-record the dialog, because a lot had to be anyway due to the fountain noise. In the end, I imagine they just didn't care. ",
        "upvotes": 1524,
        "comments": 1125,
        "media": null,
        "permalink": "/r/movies/comments/1i11bwr/ultra_movie_nerds_what_is_a_movie_quote_that/"
    },
    {
        "id": "1i18s1z",
        "author": "FiremanPCT2016",
        "title": "Tony Slattery Dead: 'Whose Line Is It Anyway'? Star Was 65",
        "content": "",
        "upvotes": 361,
        "comments": 15,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kyF8qgsagwFTf3kNgCxE5G-3yLC_XgcvmrXSeokJ9UE.jpg?auto=webp&amp;s=c9c4e322a6978c47f1acab5345c2ad454abfb686"
        },
        "permalink": "/r/movies/comments/1i18s1z/tony_slattery_dead_whose_line_is_it_anyway_star/"
    },
    {
        "id": "1i16p47",
        "author": "DemiFiendRSA",
        "title": "UNTIL DAWN – Film First Footage",
        "content": "",
        "upvotes": 342,
        "comments": 183,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/OOgwAxJnKuGBywCxKy5_vVzBJwYHVTdNCY03Js9XZuc.jpg?auto=webp&amp;s=0c32c934c0e08e34ea63d51ab69adb769848887a"
        },
        "permalink": "/r/movies/comments/1i16p47/until_dawn_film_first_footage/"
    },
    {
        "id": "1i12971",
        "author": "jacobeliaas",
        "title": "What are some *actually* controversial movies?",
        "content": "The discussion around Emilia Perez has really made me want to know of other movies that are as polarising as it.\n\nWhen I ask this I’m not looking for A Clockwork Orange or Salo or Kids or other films like that. I really want to know movies that have everyone divided. \n\nI’ve made quite [an extensive list](https://boxd.it/zC16c) already but I’d really love some more input. ",
        "upvotes": 727,
        "comments": 1621,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/rQrqxXvlDGJ-7NYoRd8hw4n0Dq29KQdVNU50VKXaojY.jpg?auto=webp&amp;s=0030c1b7cc2ecb1cdc2a97bb8dd47aec1a9acd6f"
        },
        "permalink": "/r/movies/comments/1i12971/what_are_some_actually_controversial_movies/"
    },
    {
        "id": "1i11vfs",
        "author": "Beautiful-Throat6392",
        "title": "‘Kneecap’ Dominates Irish Academy Awards Nominations With 17 Nods",
        "content": "",
        "upvotes": 380,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/lJ3LsM8FZdLLhOHmFWbkSOBUuceQ0oO0RBw6cZ9l_2A.jpg?auto=webp&amp;s=487f5a0d38d943d2b1d94bc28ec5648c2a0cf9f4"
        },
        "permalink": "/r/movies/comments/1i11vfs/kneecap_dominates_irish_academy_awards/"
    },
    {
        "id": "1i0w106",
        "author": "joesen_one",
        "title": "‘Sing Sing’ Cast of Formerly Incarcerated Actors Reuniting to Perform the Play From the Movie Live in Off-Broadway on February 3",
        "content": "",
        "upvotes": 746,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/xAwwISVkcbE5b3mMANVY0h_OgiVsQ430Q532gFVJJa8.jpg?auto=webp&amp;s=71f1f9544485e56312f58268dbddee7cd4670d0e"
        },
        "permalink": "/r/movies/comments/1i0w106/sing_sing_cast_of_formerly_incarcerated_actors/"
    },
    {
        "id": "1i19hbv",
        "author": "KillerCroc1234567",
        "title": "Poster for “Woman in the Yard”",
        "content": "",
        "upvotes": 65,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/w06avqq4hzce1.jpeg?auto=webp&amp;s=269c65996f01c2517257e5e43037cb8d6d07afb4"
        },
        "permalink": "/r/movies/comments/1i19hbv/poster_for_woman_in_the_yard/"
    },
    {
        "id": "1i17ydi",
        "author": "NoCulture3505",
        "title": "‘Dune 2,’ ‘Kingdom of the Planet of the Apes,’ ‘Better Man’ Among Visual Effects Society Feature Noms",
        "content": "",
        "upvotes": 71,
        "comments": 7,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/7zp2Wgub8bVGxGTXFlYWdiwREQEYKPD0ntgvkjpEWIk.jpg?auto=webp&amp;s=df769c9bc92badea28d5c07f834dc485416d63e9"
        },
        "permalink": "/r/movies/comments/1i17ydi/dune_2_kingdom_of_the_planet_of_the_apes_better/"
    },
    {
        "id": "1i0fvr5",
        "author": "MarvelsGrantMan136",
        "title": "‘The Substance’ Lands Theatrical Re-Release Amid Oscar Season (Starting January 17)",
        "content": "",
        "upvotes": 6066,
        "comments": 551,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/IKin1UnfaG1ZbM52MCYSPBwYwDQXQEP1jOh0tfxGRIo.jpg?auto=webp&amp;s=ce6299933cc1c956f44ace1862b29da86f9314b5"
        },
        "permalink": "/r/movies/comments/1i0fvr5/the_substance_lands_theatrical_rerelease_amid/"
    },
    {
        "id": "1i1501d",
        "author": "These_Feed_2616",
        "title": "Edward Norton",
        "content": "Guy is incredible, and one of the most talented actors of his generation, his first role was Primal Fear, you know someone is a great actor if their debut role is Primal Fear, American History X was amazing, he was so convincing in that role, Rounders, Fight Club etc. and he killed it as Pete Seeger recently in “A Complete Unknown” I hope he gets a career resurgence after this because he is a true artist and deserves to be having a much greater career",
        "upvotes": 82,
        "comments": 117,
        "media": null,
        "permalink": "/r/movies/comments/1i1501d/edward_norton/"
    },
    {
        "id": "1i10wqa",
        "author": "Videowulff",
        "title": "Police Academy Appreciation Post - Still one of the silliest comedy franchises of all time.",
        "content": "I don't care. I love all the movies, even that weird one where they went to Russia or something. Even though there was a drop in quality once Guttenberg left, it was still a fun series that knew when to be silly and when to hit proper social commentary. \n\nFor example: I love how HighTower protects Hooks in the first movie when the instructor calls her a racial slur. While the flipping the car over may be played for laughs, it is still a great scene of HighTower protecting his buddy from a racist rant. Not to mention the movies really show Positive Masculinity between the characters.\n\nLike, no one makes fun of Tackleberry when he admits to being a virgin at his age. In fact, they all support him and act as his wingmen. All the guy (protagonist) characters love and support one another and any teasing is just good natured fun and never cruel. \n\nI also think it is in that Russia movie where the (usually antagonistic) Lassarad proclaims that he plans to rescue his squad because (paraphrasing): \"They are idiots, but they are MY idiots!\" \n\nNot to mention they also created some of the best lady bad-asses with Callahan, Hooks, Kirkland (who proves to be even more of a bad-ass than Tackleberry), Mrs. Feldman, and Laura (Who is just as crazed as Bobcat's Zed).\n\nAnd, of course, who can forget the infamous Blue Oyster Bar!\n\n  \nSure the movies are silly and dumb but they were able to keep the series going with new characters (many introduced in previous films like SweetChuck and Zed) and still maintain that sense of humor and kindness from the original films.\n\n  \nWhich is your favorite and which scene do you particularly find the funniest? ",
        "upvotes": 176,
        "comments": 56,
        "media": null,
        "permalink": "/r/movies/comments/1i10wqa/police_academy_appreciation_post_still_one_of_the/"
    },
    {
        "id": "1i19als",
        "author": "Comic_Book_Reader",
        "title": "The Woman In The Yard | Official Trailer",
        "content": "&gt;Don’t let her in. #TheWomanInTheYardMovie​ only in theaters March 28. \n----\n\n&gt;From Blumhouse, the most successful global brand in horror, comes a terrifying new original film starring BAFTA and SAG nominee Danielle Deadwyler, star of Till, The Harder They Fall and the Emmy nominated limited series Station Eleven.\n\n&gt;The Woman in the Yard is directed by Jaume Collet-Serra (Black Adam, Jungle Cruise), who recently directed Deadwyler in the upcoming action thriller Carry On. The film is written by first-time feature screenwriter Sam Stefanak.\n\n&gt;The film is produced by Jason Blum, producer of Five Nights at Freddy’s, M3GAN and The Black Phone, along with acclaimed Emmy nominated filmmaker Stephanie Allain (The Exorcist: Believer, Hustle &amp; Flow), and is executive produced by star Danielle Deadwyler, director Jaume Collet-Serra, Gabrielle Ebron, Scott Greenberg and James Moran.\n\n&gt;Blumhouse’s The Woman in the Yard will be distributed by Universal Pictures.",
        "upvotes": 29,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/tM9nnsbKzVsKJ3SFQ321JEtyjYU-zlLLVhgu-QdxqSU.jpg?auto=webp&amp;s=4dd5e98f6efe2907e48d19f975db324908987237"
        },
        "permalink": "/r/movies/comments/1i19als/the_woman_in_the_yard_official_trailer/"
    },
    {
        "id": "1i199zp",
        "author": "MarvelsGrantMan136",
        "title": "The Witcher: Sirens of The Deep | Official Trailer | Netflix",
        "content": "",
        "upvotes": 20,
        "comments": 3,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/vBs3cZbI-9lnSukBFt__WEqTlTKFSmrg_Uwvbim0Iv0.jpg?auto=webp&amp;s=f271b8523aa8f9ff25100e52079a15da5a71c4aa"
        },
        "permalink": "/r/movies/comments/1i199zp/the_witcher_sirens_of_the_deep_official_trailer/"
    },
    {
        "id": "1i0goty",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'Borderline' Starring Samara Weaving and Ray Nicholson - Set in Los Angeles in the 1990s, a pop star's home is broken in by an obsessive fan who delusively believes they are getting married and manipulates their surroundings to create a wedding atmosphere.",
        "content": "",
        "upvotes": 1610,
        "comments": 273,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xs5r8qmj6sce1.jpeg?auto=webp&amp;s=3c9f98ba04bc60cebd3d184c81a93521dce21e5f"
        },
        "permalink": "/r/movies/comments/1i0goty/official_poster_for_borderline_starring_samara/"
    },
    {
        "id": "1i16mgs",
        "author": "Sanlear",
        "title": "Over three films, Jamie Foxx caught Michael Mann in transition",
        "content": "",
        "upvotes": 24,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6n2YFareicBNL2LyJPQzbbNuVolZjUBi9i10u6UTEPw.jpg?auto=webp&amp;s=54d0da714fff160e8965f2190b05dfcb213e7431"
        },
        "permalink": "/r/movies/comments/1i16mgs/over_three_films_jamie_foxx_caught_michael_mann/"
    },
    {
        "id": "1i19if6",
        "author": "SkepOfTheNorth",
        "title": "What is the original \"Come closer.... closer\" from?",
        "content": "This might be a really silly question with a very obvious and famous answer - but nonetheless I genuinely don't know the answer, so apologies for my ignorance.\n\nI happened to be watching an old episode of \"Boy Meets World\" where Corey Matthews is weak in a hospital bed and tells his teacher Mr. Feeney \"Come closer....closer!\"\n\nI then started remembering this seemed to be a scene that was routinely mimicked and satirized in a variety of a TV shows and movies back in the day (and probably still today, perhaps)\n\nIs there an original scene from a movie that this is parodied from? And if so what is the original?",
        "upvotes": 14,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1i19if6/what_is_the_original_come_closer_closer_from/"
    },
    {
        "id": "1i0tjr4",
        "author": "Steingar",
        "title": "I watched several dozen old noir films. Here are the best in my opinion.",
        "content": "As the title says, I recently sat down to watch several dozen noir films from the \"classic period\" of the 40's and 50's. I've always had an interest in noir, but struggled to find the initiative to watch such old movies. I got the opportunity from a recent trip home, and was (mostly) delighted by what I saw. I wanted to share my recommendations across different categories for anyone who was interested.\n\n*Favourite cinematography:* **Night of the Hunter (1955).** About a serial killing preacher who marries into a grieving family to try and find some buried cash. It has some astoundingly beautiful shots, especially in how it plays with light and darkness. Standout is the scene where two characters having a stand-off sing to one another in the night.\n\n*Favourite acting:* **Sunset Boulevard (1950).** A scriptwriter gets involved with an ageing actress who can't come to terms with her fading star. A film about film, Gloria Swanson as Norma Desmond has incredible range; she somehow manages to pull off being hammy, pathetic, terrifying, and funny, sometimes at the same time. A lot of old films \"feel\" old and antiquated, but this one is electrifying even by today's standards.\n\n*Favourite scene:* **Strangers on a Train (1951).** The OG story of \"criss cross\" murders, where a psychopath kills someone for a stranger, and then demands said stranger do the same for him in return. Robert Walker as the unhinged Bruno is just so hammy and fun to watch, and in particular the scene where he stares emotionlessly at the protagonist from across the tennis court is iconic. (I like tennis, so maybe I'm biased.)\n\n*Favourite plot:* **Out of the Past (1947).** A PI with a dark past is dragged back into one final sordid affair. With slimy gangsters, a country-spanning plot, the definitive femme fatale, and a deeply nihilistic ending, this feels like a hardboiled novel that leaped right onto the screen.\n\n*Favourite concept:* **Double Indemnity (1944).** An insurance broker helps his lover murder her husband, and then has to do what he can to cover it up. I suppose we've all wondered if we could get away with murder, and this film really shows the grittiness of the affair as the noose tightens around the protagonist's proverbial throat.\n\n*Favourite overall film:* **In a Lonely Place (1950).** A violent scriptwriter gets involved with a beautiful young neighbour, but questions of his involvement in a murder strain their relationship. I saw about 5 Humphrey Bogart films in this time and this is his best role by far. The steady, gradual march to the explosive ending is executed perfectly. I honestly didn't think that such old films could really emotionally \"connect\" with me, but this one left me stunned with its brilliance and pathos. Easily one of my top 10 of all time.\n\nThat's that! There's obviously other good ones (\"Woman in the Window\", \"A Touch of Evil\", etc.) but I think the above gets the point across.\n\nHave you seen the above films? Do you have any other favourites I missed?",
        "upvotes": 207,
        "comments": 123,
        "media": null,
        "permalink": "/r/movies/comments/1i0tjr4/i_watched_several_dozen_old_noir_films_here_are/"
    },
    {
        "id": "1i0k39r",
        "author": "indiewire",
        "title": "Oscar Nominations Pushed to January 23, the Same Day Sundance Begins",
        "content": "",
        "upvotes": 533,
        "comments": 24,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/owxu0D4BaCE5ufv39I-shpNK-Q-4Wbg1B-C1ll_8B-g.jpg?auto=webp&amp;s=63c5f2ff096d97a26b56cc1dd039e30dc3c4e105"
        },
        "permalink": "/r/movies/comments/1i0k39r/oscar_nominations_pushed_to_january_23_the_same/"
    },
    {
        "id": "1i0idje",
        "author": "ggroover97",
        "title": "John Woo, Chow Yun-fat Classics Among 156-Film Golden Princess Library Acquired by Shout! Studios (EXCLUSIVE)",
        "content": "",
        "upvotes": 541,
        "comments": 52,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/yCs3JPeNKLyJW9EQ5sWGPXSi3Xj8oaQE5GADqLihH64.jpg?auto=webp&amp;s=dc3fb1bbce11a859bacbe71f4d16f282b590725c"
        },
        "permalink": "/r/movies/comments/1i0idje/john_woo_chow_yunfat_classics_among_156film/"
    },
    {
        "id": "1i0uj2i",
        "author": "1974Mustache",
        "title": "Your favorite offbeat actor/actress",
        "content": "Curious who your favorite performer is! When they pop up in a movie or show and you instantly do the (DiCaprio meme and say-“HEY”!) I’ll start, Steve Zahn. I believe the first time I ever saw him was in “That Thing you Do” and kind of forgot about him until “Saving Silverman” came out. That performance solidified a special spot for me. \nWho is yours? ",
        "upvotes": 107,
        "comments": 290,
        "media": null,
        "permalink": "/r/movies/comments/1i0uj2i/your_favorite_offbeat_actoractress/"
    },
    {
        "id": "1i0leo0",
        "author": "NoCulture3505",
        "title": "Jesse Armstrong’s Next Project Is HBO Film Set During Financial Crisis",
        "content": "",
        "upvotes": 331,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/-df7sXClKxLQX6IHaDfK1nsOox11KPFs-_MWYUsV__A.jpg?auto=webp&amp;s=aef2123ffea4e754adfebffedfc53b5b4f0468dc"
        },
        "permalink": "/r/movies/comments/1i0leo0/jesse_armstrongs_next_project_is_hbo_film_set/"
    },
    {
        "id": "1i1a589",
        "author": "Conscious_Test_7954",
        "title": "The Strategy of the Snail is a fantastic film about resilience and wittiness",
        "content": "I love films that tackle themes of political and power corruption with cleverness and heart. As someone from Colombia, where the cinema industry is often overlooked and associated with narco-related themes, it's refreshing to see a film that addresses everyday struggles and social issues with so much fun\n\nI would describe \"La estrategia del Caracol\" as a charming escape comedy-drama with charismatic and relatable characters. The film's setting and struggles, still pertinent to Bogotá residents today, are portrayed with care, respect, and humor.\n\nIf you're interested in Latin American cinema, particularly Colombian films, I can not recommend \"La estrategia del Caracol\" enough.\nIf you have seen it, what do you think? ",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/movies/comments/1i1a589/the_strategy_of_the_snail_is_a_fantastic_film/"
    },
    {
        "id": "1i0incu",
        "author": "Task_Force-191",
        "title": "PRESENCE - Official Trailer #2 - In Theaters January 24",
        "content": "",
        "upvotes": 421,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/XU51DkF4Nb2iJvDShBry_TNedtLXuPfnfOsh01WyWT4.jpg?auto=webp&amp;s=0ed1a08002dbf04aa7dddbd1db9d946978a4e80d"
        },
        "permalink": "/r/movies/comments/1i0incu/presence_official_trailer_2_in_theaters_january_24/"
    },
    {
        "id": "1i0ezci",
        "author": "artpayne",
        "title": "Michael Douglas waking up in a Mexican cemetery in The Game (1997) is the worst nightmare come true. Hell, the whole Mexico scene could work as a self-contained short film.",
        "content": "",
        "upvotes": 681,
        "comments": 164,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/9-4qZ4t1d-Rc2FaLT96N9rzDk-J4PdQyRpezXUnxs6A.jpg?auto=webp&amp;s=847b1217b324702e084c3e4a45af251593b5741e"
        },
        "permalink": "/r/movies/comments/1i0ezci/michael_douglas_waking_up_in_a_mexican_cemetery/"
    },
    {
        "id": "1i1ag2j",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for Barry Levinson’s ‘Alto Knights’ Starring Robert De Niro - Follows two of New York's most notorious organized crime bosses, Frank Costello and Vito Genovese (both played by De Niro), as they vie for control of the city's streets.",
        "content": "",
        "upvotes": 4,
        "comments": 19,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wzgvactfozce1.jpeg?auto=webp&amp;s=d7b6956ea52c260afd5466b06b132f3eee2e8a42"
        },
        "permalink": "/r/movies/comments/1i1ag2j/official_poster_for_barry_levinsons_alto_knights/"
    },
    {
        "id": "1i0iskr",
        "author": "falafelthe3",
        "title": "Where Do You Put The Camera? - Every Frame a Painting",
        "content": "",
        "upvotes": 380,
        "comments": 26,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aA6d978H5xTjzsA30xaCKRBn6mrUmHwvLMswszHmH6Q.jpg?auto=webp&amp;s=307eb21a168fcd3607d6a04462474ade223ab375"
        },
        "permalink": "/r/movies/comments/1i0iskr/where_do_you_put_the_camera_every_frame_a_painting/"
    },
    {
        "id": "1i10vcu",
        "author": "creep187",
        "title": "COMPANION - Psychological Thriller (Trailer)",
        "content": "",
        "upvotes": 25,
        "comments": 9,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/qMaD0OltiEFmwh8zRPHwzHxlbXYDZ3oeE-GdR5aNCG0.jpg?auto=webp&amp;s=b1a4c7756478943d6f531c7f87e7f29a5963ecdd"
        },
        "permalink": "/r/movies/comments/1i10vcu/companion_psychological_thriller_trailer/"
    },
    {
        "id": "1i0qobh",
        "author": "Successful-Plan114",
        "title": "Smile 2 was pretty good",
        "content": "Watched it last night. Had the climax figured from the get go, really, but overall it was pretty entertaining. The gore was top notch. The creep factor, especially the apartment sequence, was quite high. Something about crazed smiling people really gets me. Super creepy. Better than the first? Don't know, but i can't wait for the 3rd film now. They better make a 3rd film. That's all. Enjoyable horror romp that had me wanting it to just not end. Gimme more.",
        "upvotes": 136,
        "comments": 208,
        "media": null,
        "permalink": "/r/movies/comments/1i0qobh/smile_2_was_pretty_good/"
    },
    {
        "id": "1i0asn6",
        "author": "InspectorMendel",
        "title": "What's the oldest movie you enjoyed? (Without \"grading it on a curve\" because it's so old)",
        "content": "What's the movie you watched and enjoyed that was released the earliest? Not \"good for an old movie\" or \"good considering the tech that they had at a time\", just unironically \"I had a good time with this one\".\n\nI watched the original Nosferatu (1922) yesterday and was surprised that it managed to genuinely spook me. By the halfway point I forgot I was watching a silent movie over a century old, I was on the edge of my seat.\n\nSome other likely answers to get you started:\n\n* Snow White and the Seven Dwarfs -- 1937\n* The Wizard of Oz -- 1939\n* Casablanca -- 1942",
        "upvotes": 1003,
        "comments": 2727,
        "media": null,
        "permalink": "/r/movies/comments/1i0asn6/whats_the_oldest_movie_you_enjoyed_without/"
    }
]