[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 39,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 10,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1pxmcdo",
        "author": "akssh_art",
        "title": "“Stranger Things is just supposed to be a fun sci-fi show” cannot be an excuse for Season 5’s mediocre writing",
        "content": "There’s a part of the fandom that’s using the argument that Stranger Things is just supposed to be a fun sci-fi, with fun cast and emotions, but this does not sit right with me at all. \n\nThe show not only has taken so long to finish, but has also been (I think?) Netflix’s biggest show till date, bringing in a new Sci-Fi IP which demands quality in its storytelling given its scale. Till Season 4, I thoroughly enjoyed the lore of the universe. I felt like the sci-fi elements were the priority (if there was any) and the “fun” stuff was sort of secondary. Season 5 feels like the writers turned into a bunch of teenagers and wrote up some BS to finish the plot.\n\nThe only thing I have liked is the Upside Down being a wormhole. Apart from that, from The Crawl to The Bridge, almost all elements of the lore have insane number of loopholes. Plus, the actors have such cringe dialogues. This wasn’t the show I fell in love with.\n\nSaying “this is just supposed to be a fun sci-fi” screams of calling a superhero movie “just a fun movie” or a shonen anime “just a shonen.”\n\nThe world you build has to make sense, the rules you establish have to matter, and the way you make these stories into a reality has to be upto the mark man. \n",
        "upvotes": 356,
        "comments": 236,
        "media": null,
        "permalink": "/r/netflix/comments/1pxmcdo/stranger_things_is_just_supposed_to_be_a_fun/"
    },
    {
        "id": "1px7c2n",
        "author": "Tricky-Bat-2638",
        "title": "Anyone else Disappointed with season 5 of stranger things?",
        "content": "Finding it a little disappointing considering how amazing the first 4 seasons were. \n\nDustin’s character is starting to really grate on me and will has spend most of seasons 1-5 sleeping. Joyce’s voice has just got more irritating as the seasons have gone on. \n\nAnd Millie Bobby brows face barely moves. I’m not judging her for having work done to her face but I do feel like there should be rules in long term series about having a large amount of plastic surgery. Her top lip is huge and barely moves and there’s  minimal expression on her face due to Botox. Some dramatic scenes are ruined from the lack of movement &amp; expression in her face.\n\nOverall I’m a little disappointed",
        "upvotes": 1160,
        "comments": 549,
        "media": null,
        "permalink": "/r/netflix/comments/1px7c2n/anyone_else_disappointed_with_season_5_of/"
    },
    {
        "id": "1pxibja",
        "author": "fluffnubs",
        "title": "The video quality on Netflix is total garbage, and has gotten progressively worse since 2020.",
        "content": "It’s almost unwatchable. We watched the latest Knives Out movie last night and it was like there was a static overlay. If you stared at any characters forehead for more that half a second you’d think it was almost \\*moving\\*. It’s terrible. We have the premium 4K package, a newer 4K TV with full HDR etc etc. Netflix has the highest subscription price of the major streaming services and the video quality - \\*even of their own in-house produced films/shows\\* - is a total, complete compressed mess. We watched Weapons on Crave immediately after and the quality was 1000% better. It was insane the difference. \n\nI remember during the Covid pandemic, they sent out a notice saying they were further compressing the streams to conserve bandwidth under high demand, but it’s never come back. \n\nI’ve been on the fence about even keeping my subscription, and I think this is the final straw. ",
        "upvotes": 48,
        "comments": 76,
        "media": null,
        "permalink": "/r/netflix/comments/1pxibja/the_video_quality_on_netflix_is_total_garbage_and/"
    },
    {
        "id": "1pwqjqs",
        "author": "justameesa",
        "title": "Stranger Things might crash as hard as GOT",
        "content": "The writing is not doing any favors to the plot or the characters. At this point of time listing things from the 80s is the only \"appeal\" to this nostalgia driven show.\n\nD&amp;D curse much? ( Duffer and Duffer)",
        "upvotes": 1810,
        "comments": 963,
        "media": null,
        "permalink": "/r/netflix/comments/1pwqjqs/stranger_things_might_crash_as_hard_as_got/"
    },
    {
        "id": "1pxv4u6",
        "author": "Yuck_Few",
        "title": "Black Rabbit",
        "content": "Since Reddit unfortunately doesn't let you edit a title when you make a typo, I just had to scrap the whole thing and start over... anyway \n\n\nI went into it already expecting it to be good just because it's Jason Bateman and I was not disappointed \n\nBasically first two episode set up the premise, this is the situation they're in and this is how screwed they are if they don't find a solution and then starting it episode 3, the writers do a really good job of snowballing and escalating the tension with each episode. \n\nIn my opinion, Bateman is underutilized as an antagonist character who doesn't think he's the villain.\nHe's really talented at that casual dry situational cruelty. \n\nthat's why he was good and carry on also\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pxv4u6/black_rabbit/"
    },
    {
        "id": "1pxk2z3",
        "author": "Neverendingstory1-",
        "title": "What’s a show you’re still mad that it got canceled?",
        "content": "I’ll start Black AF I liked the show. I thought it was funny and I related to the show. I grew up black and from the same area. It was good to see a show I kind of related too. I thought it was way better than blackish and was sad it got cancelled after one season.",
        "upvotes": 19,
        "comments": 149,
        "media": null,
        "permalink": "/r/netflix/comments/1pxk2z3/whats_a_show_youre_still_mad_that_it_got_canceled/"
    },
    {
        "id": "1px8qwn",
        "author": "stroh_1002",
        "title": "Sadie Sink on her Stranger Things hair for season five: 'You have all this stuff in your cave, and you couldn’t find a hair tie or a hairbrush? It was a huge jump scare when I was watching the season for the first time'",
        "content": "",
        "upvotes": 77,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1px8qwn/sadie_sink_on_her_stranger_things_hair_for_season/"
    },
    {
        "id": "1px72yu",
        "author": "SirLiftsalot0",
        "title": "Anyone else struggling to finish the new Stranger Things season?",
        "content": "I loved Stranger Things earlier, but honestly this season felt more like a task than something I wanted to watch.\nThe pacing was slow, the tension didn’t land, and a lot of the episodes felt stretched without real payoff.\n\nIt wasn’t exactly boring, but it definitely lacked the thrill and “can’t wait for the next episode” feeling the show used to have.\nCurious if I’m alone here or if others felt the same.",
        "upvotes": 74,
        "comments": 157,
        "media": null,
        "permalink": "/r/netflix/comments/1px72yu/anyone_else_struggling_to_finish_the_new_stranger/"
    },
    {
        "id": "1pwzt7w",
        "author": "TurnipYadaYada6941",
        "title": "The new Netflix UI is atrocious!",
        "content": "Which idiot put the top level menu at the top, where you cannot reach it without scroll for eternity!\n\n  \nDid the same idiot make it impossible to filter films by genre easily?\n\nis there any way to get Netflix to provide a usable II?",
        "upvotes": 177,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1pwzt7w/the_new_netflix_ui_is_atrocious/"
    },
    {
        "id": "1pwtmvv",
        "author": "Normal_Comfort_5847",
        "title": "So we’re just supposed to know Stranger Things lore from a stage play (The First Shadow) now?",
        "content": "I get that Stranger Things: The First Shadow (Broadway / West End) is meant to deepen the lore, but honestly it feels like it introduces major information that should not be locked behind a stage play that most fans will never see.\n\nThere are things in the show that already felt like loose threads, and now it turns out they are “explained” in the play:\n\n1. Henry’s cave memory in Season 5, where he’s clearly interacting with / absorbing Mind Flayer-like particles. In the show, this is presented as something mysterious and significant… but never really followed up on in a satisfying way. Apparently the play adds context, but the series itself doesn’t.\n\n2. The Oklahoma poster in Max’s hand during one of Henry’s memories strongly suggests Joyce, Hopper, and Henry all went to school together. That’s a huge implication; yet across four seasons, Joyce and Hop never say a single word about knowing Henry Creel? Not even a hint?\n\n3. Henry’s early connection to the Upside Down, Brenner’s involvement, and the timeline of how everything starts are apparently much clearer in the play but on screen, it still feels incomplete or oddly rushed.\n\nThe problem isn’t expanded lore. It’s that the main TV series feels like it’s missing chapters unless you’ve seen a West End/ Broadway show that:\n\nA. isn’t accessible worldwide,\n\nB. isn’t cheap,\n\nC. and won’t be seen by the vast majority of viewers.\n\nAt this point, it feels like they should’ve done a limited prequel season or special between Season 4 and 5 to properly set this up. Relying on a stage production to carry essential canon just makes Season 4 feel retroactively unfinished.\n\nWith only one episode left, I’m worried the finale will have too much ground to cover, and that casual viewers will never even realize why certain things don’t quite add up.\n\nEnd rant. Curious if this bugs anyone else or if I’m just overthinking it. \n\n\nEdit: No, I’m not saying anyone should fly to New York or London to see the play. Yes, the play exists, and the creators have stated it’s important for understanding the show’s ending. Yes, it might be addressed in the finale, and yes, I’m waiting for the last episode. No, discussing a TV series on a TV subreddit isn’t a “life crisis” or proof that I have nothing better to do; it’s simply something I wanted to talk about.\n",
        "upvotes": 427,
        "comments": 136,
        "media": null,
        "permalink": "/r/netflix/comments/1pwtmvv/so_were_just_supposed_to_know_stranger_things/"
    },
    {
        "id": "1pwtfiu",
        "author": "job_hunter101",
        "title": "Any one else hate these batch releases?",
        "content": "Either release it all at once so we can binge it, or release it weekly so people can enjoy discussing it each week. Instead, these batch releases make me hate it entirely. You usually wouldn’t know when these get released and sometimes it’ll be days before you even know it, unless you don’t have any life. \n\nIt’s bad enough as it is with the yearly gaps between each season and to add these batch releases to it just makes my interest go down the drain. ",
        "upvotes": 321,
        "comments": 65,
        "media": null,
        "permalink": "/r/netflix/comments/1pwtfiu/any_one_else_hate_these_batch_releases/"
    },
    {
        "id": "1pxmggp",
        "author": "Klutzy_Belt_2296",
        "title": "Relay is a pretty decent movie",
        "content": "I know a lot of times people many times are looking for recommendations, and I know the struggle of trying to find a movie or show that will actually appeal to you on here.\n\nAnd I already left my thoughts on another movie on here so I thought, why not leave my thoughts on some of the good ones too.\n\nAnd the most recent one for me was Relay. I just watched it today and it is honestly pretty decent! It had its fair share of surprises and the action scenes were very fun to watch. If you are looking for something to watch, I definitely would recommend it if you like action-y type of movies.",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pxmggp/relay_is_a_pretty_decent_movie/"
    },
    {
        "id": "1pxsup4",
        "author": "Illustrious_Salt_569",
        "title": "Streaming quality downgrade",
        "content": "I don't know if it's the internet where I live (maybe because of bad weather conditions?) or something is up on their end. But watching a show at the moment currently looks staticy in some scenes right now. Even though last night it looked perfectly fine with no issues whatsoever. It's not unwatchable by any means, but definitely noticeable. Anyone else having this problem or just me?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pxsup4/streaming_quality_downgrade/"
    },
    {
        "id": "1pxe1k7",
        "author": "ReneKiller",
        "title": "What are some good but lesser known shows?",
        "content": "What are some good but lesser known shows on Netflix, preferably with an actual ending or a confirmed continuation?\n\nI've just watched 1899, which I really liked, only to learn that season 1 ends in a massive cliffhanger and of course Netflix cancelled season 2.\n\nI don't really have a genre preference except I'm not really interested in romantic shows.\n\nEDIT: Thanks for all the answers. I've seen a few of them but most are new to me. I'll check them out.",
        "upvotes": 10,
        "comments": 35,
        "media": null,
        "permalink": "/r/netflix/comments/1pxe1k7/what_are_some_good_but_lesser_known_shows/"
    },
    {
        "id": "1pxk58h",
        "author": "Vettechjen",
        "title": "Pretty disturbing show",
        "content": "I just finished Delirium on Netflix and it was a little hard to follow at first but I must say it turned out to be a little disturbing. I don’t usually find shows that I would consider disturbing but this one had it.",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pxk58h/pretty_disturbing_show/"
    },
    {
        "id": "1pxr62c",
        "author": "Vesimelooniz",
        "title": "Hi could somebody help me with this error message?!",
        "content": "So when i try to download netflix on my PC it gives me this error message: \"The application was unable tto start correctly (0xoOOOO142)\".  So if anybody has any idea why does it do this i would really appriciete if you could help me!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pxr62c/hi_could_somebody_help_me_with_this_error_message/"
    },
    {
        "id": "1pxq2s3",
        "author": "Twan88mot",
        "title": "Series en films in Nederland",
        "content": "Hi!\nOndanks de nieuwe ui kan ik niet goed zoeken, maar welke series of films (beschikbaar in Nederland) zijn het kijken waard?\nHet moet niet de meest gewelddadige en bloederige onderwerpen hebben maar een beetje actie is helemaal leuk!\nIk hoor graag opties, misschien een kleine rode draad erbij? Scheelt vast veel trailers kijken!\nThnx!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pxq2s3/series_en_films_in_nederland/"
    },
    {
        "id": "1pxo1vb",
        "author": "ConsciouslyKind93",
        "title": "Maze Runner (movies): Good sci-fi plot with a poorly written finale",
        "content": "**Disclaimer:** All my opinions here are strictly in perspective of the movie trilogy plot writing, not the books.  \n  \nFor some stories, taking creative liberty in movies and going in different direction from the books is sensible and can be rewarding, and this series had that potential, but they screwed it up.  \n  \nThe writing was poor and had plot holes, especially in the 3rd movie - \n\n**1.** They never explained how our protagonists even managed to track the freight train moving all the immune kids (including Minho) and plan that attack\n\n**2.** Thomas and Aris discover not only immune children kept in suspended animation state, but also baby grievers - and they don't say or do anything about it - which is so against the character build up of Thomas in the entire series. Ideally you'd think Thomas would be the kinda guy who would blow up the griever pods before escaping the facility. \n\n**3.** The plot change from books had great potential - that Thomas' antibodies had specifically evolved to destroy the virus - but they didn't explore this aspect at all in the climax.\n\n**4.** They never explained (science or medically) how Gally actually came back from the dead. And if they had to leave it so vague and unexplained, they could have easily used that same intentional vague technique to bring back Newt as well.\n\n**5.** So much emotional value and screen time was invested in Chuck's wooden souvenir, but they never provided closure to that aspect, Thomas never met his parents to hand it to them. Ideally it shouldn't have been even shown as a dying promise because logically speaking, how would he even know if his parents are even alive or dead given that there was a deadly virus pandemic out there?!\n\n**6.** Ava Paige says that the virus is airborne and no place on the planet is safe, so how does some island suddenly become safe haven for everyone in the climax of the movie?\n\n**7.** Dr. Mary dies. Ava Paige dies. And in the end even Teresa dies. The doctor with a goatee who was extracting serum from Minho was also sedated by Minho during his escape and the building was blown by the resistance shortly after, so I'm assuming that even he is dead, along with all other scientists in the building. So people who have the knowledge to create serum from Thomas' blood are all gone. So how will the world be cured?\n\n**8.** Speaking of which, the whole climax and ending is just left on a hopeless grim note. Newt is gone. The world is not cured. No closure to the audience on whether WICKED operations were shut down or not. After all the sacrifices, twists, betrayals, tears and blood, no happy ending to the plot and no hint of \"a better tomorrow\" scenario.\n\nThey could have done so much justice to an otherwise great plot. ",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pxo1vb/maze_runner_movies_good_scifi_plot_with_a_poorly/"
    },
    {
        "id": "1pwyp4j",
        "author": "Glarms3",
        "title": "Need a long show to binge",
        "content": "I’m looking for a Netflix show with a lot of seasons, something I can stick with for weeks and not run out of episodes fast. I prefer serious shows with a good story, not something super light or random.\n\nI’ve already seen stuff like Breaking Bad and Ozark, and I liked that kind of vibe. Any good long-running shows you’d recommend right now? What kept you hooked for multiple seasons?",
        "upvotes": 34,
        "comments": 158,
        "media": null,
        "permalink": "/r/netflix/comments/1pwyp4j/need_a_long_show_to_binge/"
    },
    {
        "id": "1pxfeuz",
        "author": "Infinite-Albatross44",
        "title": "The Threesome",
        "content": "If you’re going into this expecting something sexy, don’t. I’m all for drama and real-life, grounded storytelling, but with the title and the insinuation, it really underdelivers. The acting wasn’t great either, and honestly, it just fell flat. I wouldn’t recommend wasting your time.",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pxfeuz/the_threesome/"
    },
    {
        "id": "1pxhwid",
        "author": "No_Hope_3770",
        "title": "Other sci fi suggestions?",
        "content": "What other sci fi tv shows would you say are a MUST watch that are on Netflix right now? Other than Stranger Things. I am open to anything. I loved tv shows like The 100 and of course Stranger Things. ",
        "upvotes": 2,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1pxhwid/other_sci_fi_suggestions/"
    },
    {
        "id": "1pw29y9",
        "author": "Unlucky_Monitor_9644",
        "title": "Millie Bobby Brown",
        "content": "I’ve watched a lot of TV over the years and I’ve really enjoyed Stranger Things, but I do not understand how people laud MBB for this role. \n\nTo me the acting is as one dimensional as it comes and perhaps it’s the writing, but there doesn’t seem to be anything truly challenging about 11’s character. \n\nThe endless praise for MBB’s portrayal just doesn’t sit right with me. ",
        "upvotes": 3081,
        "comments": 648,
        "media": null,
        "permalink": "/r/netflix/comments/1pw29y9/millie_bobby_brown/"
    },
    {
        "id": "1pwuz38",
        "author": "Strange_Light5219",
        "title": "Isn't Stranger Things missing the Ultimate Unbeatable villain?",
        "content": "If you think about it, the Mind Flayer does seem like this looming, unstoppable force compared to Vecna. Vecna's powerful, sure, but the Mind Flayer feels like this bigger, more all-encompassing threat. It's not just one dude with crazy powers—it’s this force that controls the entire Upside Down.\n\nIf Vecna had been taken out earlier, leaving the Mind Flayer as the final big bad, it could’ve made for an epic conclusion, especially with the whole \"creature from another dimension\" vibe. Plus, we’ve seen so much of Vecna already and defeated him once, so a new, final enemy could've really upped the tension.\n\nThe final season could've had a nice twist if they just focused on the Mind Flayer and made it a true battle for survival. I think it would've given the show even more of a chaotic, \"can they even win?\" energy. What do you think peeps?\n\n\n",
        "upvotes": 28,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1pwuz38/isnt_stranger_things_missing_the_ultimate/"
    },
    {
        "id": "1pxre8p",
        "author": "Equivalent_Plan_5653",
        "title": "Just watched \"Speak no evil\". This might be one of the dumbest movies I've watched in my entire life.",
        "content": "None of the characters actions make any sense, all twists can be predicted 20 minutes beforehand. Terrible, terrible movie, nearly as dumb as \"the perfection\".",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pxre8p/just_watched_speak_no_evil_this_might_be_one_of/"
    },
    {
        "id": "1px4ass",
        "author": "MamaMia1325",
        "title": "61st Street...hidden gem",
        "content": "61st Street...\n\nI never heard of it until my husband put it on last night and we are 5 episodes into season 1. This series is great and I never heard of it before. Holt McCallany is 1 of my favorite actors and he plays such a great bad guy in this. Who else has watched??",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1px4ass/61st_streethidden_gem/"
    },
    {
        "id": "1pxb53i",
        "author": "Sea_Committee9480",
        "title": "Elway",
        "content": "As a CO native who grew up adjacent to the Broncos and experienced all of the Super Bowl failures and victories first hand, I just wanted to say thank you for this documentary. Elway has always been a golden boy and he's a true Colorado treasure. Shout out to Steve Antonopulos for his cameo appearance, you're looking great Steve!",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pxb53i/elway/"
    },
    {
        "id": "1pxraqp",
        "author": "Vegetable-Pie-8120",
        "title": "I’m ready to pull my hair out…..",
        "content": "So, got a new 75” TV from Santa.  Speed running through the old seasons of Emily in Paris so I can watch the new one and remember what happened.  This means watching at 1.5 speed.\n\nI’m finding out you can’t change the speed you’re watching at on a TV.  Okay, no problem.  I’ll just pull it up on my phone and screen cast.  Nope, gives me error E100 and tells me to use the app on the TV to watch.  WELL MAKE THE STUPID APP WORK PROPERLY AND I WILL!! 🤬\n\nPlease tell me there’s a way around this (besides watch on my phone that’s why I got a big TV 😭)",
        "upvotes": 0,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1pxraqp/im_ready_to_pull_my_hair_out/"
    },
    {
        "id": "1pxsl4t",
        "author": "Fun-Strength-3812",
        "title": "Netflix subscription (scam)",
        "content": "Really? Grabe scammer talaga worth of 279 lang Wala ka? Hayop ka! Ilang araw palang namin nagagmit Yung account tas nawala na. Sana talaga makarma ka buset ka! Karmahin ka sana ng matindi! ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pxsl4t/netflix_subscription_scam/"
    }
]