[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 12,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 706,
        "comments": 5196,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nyv5v2",
        "author": "DMFD_x_Gamer",
        "title": "Just found a relic in a packed away box.",
        "content": "Still has a CD in it. Not sure what the movie is though. The envelope is sealed. I dont even have a DVD player anymore so im in no real hurry to see what's inside. Still a cool find. ",
        "upvotes": 734,
        "comments": 94,
        "media": null,
        "permalink": "/r/netflix/comments/1nyv5v2/just_found_a_relic_in_a_packed_away_box/"
    },
    {
        "id": "1nytmw9",
        "author": "Last-Upstairs1387",
        "title": "What is a Netflix show you think deserved way more attention",
        "content": "I just finished watching The OA and honestly I cannot stop thinking about it. I had heard about it years ago but never got around to watching it until now. And wow. It was so different from anything I have seen before. Strange, emotional, and full of mystery. The way the story was told kept pulling me in. I kept wondering what would happen next.\n\nAfter I finished I looked it up and saw it had a lot of praise but was cancelled after only two seasons. That made me kind of sad because I really feel like it could have gone somewhere even bigger if it had more time. Netflix has so many shows that end up disappearing under the radar, even when they are really good.\n\nSo I wanted to throw this out to the community. What is a Netflix show you think deserved way more attention? Not the big ones everyone talks about, but those hidden gems that maybe only a small group of people know about.\n\nFor me The OA will stick with me for a long time. I keep thinking about its ending and the questions it leaves open. I wish more people had seen it so we could talk about it.\n\nI would love to hear your picks. Is there a show you watched on Netflix that surprised you and deserved more love? Something you wish had gotten more seasons or more people watching? I feel like this could turn into a great list of hidden gems we all need to check out.\n\n",
        "upvotes": 415,
        "comments": 641,
        "media": null,
        "permalink": "/r/netflix/comments/1nytmw9/what_is_a_netflix_show_you_think_deserved_way/"
    },
    {
        "id": "1nz263e",
        "author": "no_tengas_miedo",
        "title": "Ed Gein is pretty bad",
        "content": "At first I thought it was going to be good. Especially the first 2 chapters, I liked them a lot, but throughout the series my desire to watch it disappears. It all consists of telling stories about psychosis actors, the Texas massacre, film producers who were inspired by him, and above all, romances they have had and experiences that are not real or are still theories.\nI thought I was going to see how Ed Gein acted, the things he did, what he did with corpses, everything. But instead I find that shit. \nI had a lot of hype for this season, I thought it would be good and above all that it would be the creepiest of all. But it feels pretty bad. It's morbid of me to want to see more of what the crimes were like and how he really acted, but damn, that's better than wanting to see stories that never happened about his life.",
        "upvotes": 116,
        "comments": 124,
        "media": null,
        "permalink": "/r/netflix/comments/1nz263e/ed_gein_is_pretty_bad/"
    },
    {
        "id": "1nybuog",
        "author": "TheCruelHand",
        "title": "What the hell did they do to the Ed Gein story?",
        "content": "I get taking some creative liberties, but holy shit did they do everything they could make stuff up. \n\nIt will take any common person two seconds of research to learn that this isn’t how his life really was. \n\nIt is a major known fact that after his mother died, he boarded up her room and left it the way it was the day she died. And that he never dug his mother up. \n\nBut somehow here that’s exactly what’s happened?\n\nIt’s known he made furniture, bowls and a skin suit out of the people he dug up. \n\nI’m only on episode 4 and it’s like pulling teeth trying to watch this show at this point. \n\nAlso what with parallel story about Alfred Hitchcock that wasn’t shown at all in the trailers?\n\nRyan Murphy should not be allowed to make shows anymore.  \n\n\nUpdate - I’ve been corrected, he turned one of his victims into his “mother” and put his mother’s clothes on her. That is my mistake \n",
        "upvotes": 708,
        "comments": 447,
        "media": null,
        "permalink": "/r/netflix/comments/1nybuog/what_the_hell_did_they_do_to_the_ed_gein_story/"
    },
    {
        "id": "1nz2i0y",
        "author": "DefiantRanger9",
        "title": "Any suggestions for a cute, fun series",
        "content": "With 20-30 minute episodes? Some shows I’ve enjoyed so far were Kim’s Convenience, Good Girls, Weeds, Schitts Creek, Reba and Seinfeld (rewatch), Workin Moms was hilarious, and Shameless (even if the episodes were a bit longer). Oh, Younger was kind of cute too. ",
        "upvotes": 13,
        "comments": 41,
        "media": null,
        "permalink": "/r/netflix/comments/1nz2i0y/any_suggestions_for_a_cute_fun_series/"
    },
    {
        "id": "1nz5cy6",
        "author": "Lifesabitch59",
        "title": "Ed gein",
        "content": "Why couldn't they stick to just the facts of this case! That is enough to be a great series. All the fake storylines just take away from the series imo",
        "upvotes": 6,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nz5cy6/ed_gein/"
    },
    {
        "id": "1nzc8hl",
        "author": "Muted_Reflection_449",
        "title": "Music in documentaries",
        "content": "I must have watched most documentaries by now. Especially American and British ones, but some others.\nIs it just me, or is somebody else annoyed by the (almost) constant underlying music in many of them? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nzc8hl/music_in_documentaries/"
    },
    {
        "id": "1nz782s",
        "author": "kasey1017",
        "title": "Need something to keep me HOOKED",
        "content": "M/29. Favorite shows \n\nOZARK\nTEHRAN \nFAUDA\nTHE FAMILY MAN\nBODYGUARD\nTHE NIGHT AGENT \n\nNeed a show similar. Keeps me guessing and wanting more. Twist and turns. Obviously love anything political , FBI , police , espionage, Terrorism, and more. \n\nCan we name some ???\n\nThank you! \n\n",
        "upvotes": 4,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1nz782s/need_something_to_keep_me_hooked/"
    },
    {
        "id": "1nz9d1y",
        "author": "metalmonkey_7",
        "title": "Netflix Issues",
        "content": "Am I the only one who can’t watch anything? I’m to the point where I’m about to cancel my subscription! \n\nI can’t make it through an episode without constant pauses and/or being kicked off of the App. I have several streaming services and Netflix is the only one that I have this problem with. It’s been happening every time I try to watch it recently. ",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nz9d1y/netflix_issues/"
    },
    {
        "id": "1nz4q41",
        "author": "OhMySullivan",
        "title": "Any Netflix suggestions I should watch before I cancel?",
        "content": "I really don't support a lot of things Netflix does but they have some good shows that are Netflix exclusive so I subscribed so I could catch up but then I'm gonna cancel and move on to a different streaming service so I'm not paying for multiple services at once. Before I cancel, what should I watch?",
        "upvotes": 5,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1nz4q41/any_netflix_suggestions_i_should_watch_before_i/"
    },
    {
        "id": "1nz2bvd",
        "author": "itsmebroskies",
        "title": "Wayward and Mae’s acting (spoilers)",
        "content": "I literally spent the whole first episode repeatedly questioning who would cast Mae for a role in this show, and a lead role none the less, just for the episode to end and Mae’s name being cited as the creator and (sometimes) writer. Their acting was so incredibly horrible, it felt like a self insert fan fiction where they could be the “good” guy and wear tank tops that show off their biceps, and then occasionally take it off to show their tattoos and muscles. They’re so flat and lack any genuine emotion or expressions and should have never been given a lead role, even if they created it, was the director not doing their job? Why’re they being out acted by literally EVERY character and child in the show. Even that little cute kid that won the mountain episode was amazing despite barely having any speaking lines. I think they were out of their depth and should’ve stayed as a creator but had the self awareness to understand that they weren’t fit for this job.\n\nThe show itself was really interesting and had a lot of potential, however, there were some confusing plot lines. Honestly, for the most part, it seems like the “therapy” they do actually helps the kids confront their issues in a way? But then Abbie told Leila that it was just Evelyn messing with her head and that her original memories were actually true. This was kind of confusing because it seemed like blocked trauma coming out but if they meant for it to be just a manipulation of Evelyn then I think it didn’t translate fully for me. Of course this isn’t to say that everything happening at the school wasn’t fully insane. The ending also didn’t sit right, specifically Alex’s character arc. How does the character who is constantly trying to do good end up staying through that? Is it because he keeps violently hurting people over and over again so now he feels connected to her because “awe babe we’re both murderers &lt;3)? He pissed me off so much every time he would hurt someone because, for example, with that one dad whose house he went to, he could’ve fully stopped him and told him that he wasn’t a spy, but he chose to beat his ass till he was half dead? If they meant to show that Evelyn was right because he repeated the patterns of his fathers violence even while actively trying to be different then that would make sense, but I think the way they wrote the story, and once again, Mae’s HORRENDOUS acting, it didn’t translate well. I suppose it would also make sense why he chose to stay given Evelyn’s scene telling them that he doesn’t love his wife and he just loves the idea of the family she can give him, but I think these thoughts and emotions should’ve been expressed in a better way, because with Alex’s constant flat tone and facial expressions regardless of what’s happening in the scene, you’d think there were pebbles up there.\n\nAlso, a little note of appreciation for the actress who played Evelyn, she was AMAZING, her character deserved a bigger, better show.\n\nWhat do you guys think? I think writing all of this down helped me understand some decisions that I hadn’t considered.",
        "upvotes": 3,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nz2bvd/wayward_and_maes_acting_spoilers/"
    },
    {
        "id": "1nyvh4v",
        "author": "peoplemagazine",
        "title": "Leighton Meester Teases the 'Drama' to Come When She Stars Opposite Husband Adam Brody in Nobody Wants This",
        "content": "",
        "upvotes": 9,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nyvh4v/leighton_meester_teases_the_drama_to_come_when/"
    },
    {
        "id": "1nzajir",
        "author": "Bitter_ligma",
        "title": "Monster Season 3 Ed gein",
        "content": "Spoilers\n\n\n I thought episode 1 to 6 was really good but episode 7 was boring and oh my God, episode 8 was just awful. THEY HAVE ED GEIN SOLVING THE TED BUNDY CASE, but they also copy mindhunter.\n\n\nThey have the charaters from mindhunter and put them in episode 8. It's not the same actors but they're dressed and look exactly like the characters. They even recreate a scene from that show in this one. \n\nI couldn't believe my eyes, I was seeing another show within this show. Ryan Murphy should just make mindhunter season 3, he basically recreated it. \n\nBut they have ed gein solving the ted bundy case, what is going on? It's like they didn't have enough content for all 8 episodes so they just went crazy with the last one. Also episode 8 is boring, outside of the crime origin part, ed by himself in the mental hospital just isn't interesting. They also have 2 dance sequences and the show just drags at the end. Theres no more plot just end the show. \n\nThey also beat you over the head with ed influencing psycho, Texas chainsaw massacre and silence of the lambs. They only have one shot of the silence of the lambs. I think it's kinda unfair that we get backstory of how psycho and texas chainsaw massacre was made but only 1 shot for silence of the lambs \n\n",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nzajir/monster_season_3_ed_gein/"
    },
    {
        "id": "1nyu04s",
        "author": "TylerSpicknell",
        "title": "Haunted Hotel is perfect for October.",
        "content": "It's normal to look at spooky things all month long during October in preparation for Halloween, and I'd say Haunted Hotel is great for that. I was reluctant to watch it because Netflix has a habit of having their animated shows only last one season, but after Season 2 was announced I figured I had to watch it. I also knew that since it was close to October I should watch it during the month. \n\nGreat idea, because it's the perfect thing to watch to get into the Halloween spirit and at the same time get some light-hearted horrors. I mean, if you want to look at a sitcom while trying to get spooked for the month then this is the perfect show for you. ",
        "upvotes": 8,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nyu04s/haunted_hotel_is_perfect_for_october/"
    },
    {
        "id": "1nz1oxm",
        "author": "Round_Imagination_20",
        "title": "Monster: Ed Gein Netflix show is unintentionally hilarious and historically messy",
        "content": "The Ed Gein story is horrifying and grotesque. It inspired so many Hollywood killers like Leatherface and Norman Bates. But man, Ed Gein in the Netflix show is so funny. I find myself laughing way more than I expected. His voice is so goofy, it is almost cartoonish.\n\nThe show feels a bit unfocused. The whole Nazi influence angle about him being inspired to make human skin lampshades by Ilse Koch the Beast of Buchenwald is likely true in part, but they overstate it. Gein was interested in true crime, human atrocities, and other disturbing things, but the show paints him like he was a Nazi. They could have mentioned it once and moved on, but they really overdo it. That scene at the Tavern especially felt so weird and unnecessary.\n\nIt is also much more historically inaccurate than I expected. They take way too many artistic liberties. I even googled some of the stuff he supposedly did, and a lot of it never happened. The show invents characters like a romantic interest, suggests he influenced or consulted on other crimes, exaggerates his psychological state, and misrepresents his family and relationships.\n\nHitchcock intentionally did not show the gruesome shower scene in Psycho, but this show goes full on with it, making people disgusted and frightened. Most of what happens on screen never actually happened and is just for drama, which is fine if it is focused and well done.\n\nAnyone else find it tonally all over the place? Like half thriller-drama, half accidental comedy? I wanted to like this because the Monster series was intriguing and I learned stuff about Dahmer and the Menendez brothers, but this just feels like modern Hollywood slop. ",
        "upvotes": 3,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1nz1oxm/monster_ed_gein_netflix_show_is_unintentionally/"
    },
    {
        "id": "1ny08z4",
        "author": "Last-Upstairs1387",
        "title": "Netflix Has Gone Downhill",
        "content": "I’m bracing for downvotes, but hear me out: Netflix has gone down. Not crash-and-burn down, but a steady slide from must-have to “I’ll resub when there’s a buzzy release.” I get that plenty of people still love it, but what used to feel like discovery now feels like searching, and that shift matters.\n\nThe biggest crack is trust. Too many promising shows get axed after a season or two, so viewers stop investing. It’s hard to recommend something when you might be setting a friend up for a cliffhanger that never gets resolved. Netflix still lands hits, but fewer cut through the noise, and the middle tier—the quirky, mid-budget series that built the brand—has thinned out. What’s left is an awkward mix of glossy tentpoles and disposable reality.\n\nPricing and policies haven’t helped. Between tier reshuffles, an ad-supported option, and the password-sharing crackdown, Netflix asks for more while delivering less certainty. If I’m paying premium, I want premium clarity: finished stories, a strong middle class of originals, and an interface that helps me find them. Instead, the algorithm cycles the same tiles, autoplay shouts at me, and the Top 10 often reads like a marketing strip rather than a reliable compass.\n\nThe binge model, once Netflix’s superpower, is showing its limits. A full-season drop creates a weekend of hype and a Monday of amnesia. Competitors that pace releases weekly keep conversation alive longer, which builds community and anticipation. Netflix’s experiments with split seasons feel more like damage control than a coherent strategy for keeping shows in the zeitgeist.\n\nI know the counterpoint: scale demands broad bets. Serving the whole world means optimizing for averages, and averages don’t produce many cult classics. There are still gems—especially international series—but they’re buried under repetition and generic thumbnails. Personalization should feel like a path that widens as you walk it, not a carousel that loops you back to the same five options.\n\nWhat would winning look like? Start with a renewed commitment to finishing stories—greenlight responsibly and communicate clearly about endpoints. Reinvest in the mid-tier that keeps people engaged between megahits. Rethink curation beyond raw engagement: elevate human-programmed shelves, surface more staff picks, and rotate true discovery rows weekly. On product, make autoplay opt-in, expand “because you watched” with smarter, transparent explanations, and let users pin interests so the home screen adapts to them, not the other way around.\n\nAnd if you disagree, that’s fine. I expect pushback, maybe even a pile-on. But the criticism comes from a place of former love. Netflix made streaming exciting because it felt bold and curious. Lately, it feels cautious and crowded. The audience is still here, willing to be surprised. The question is whether Netflix wants to be surprising again.\n\nIf you’re still all-in on Netflix, tell me what I’m missing and what’s genuinely great right now. I’d love to be convinced to stay subscribed year-round instead of hopping in and out for the next shiny release.\n\n",
        "upvotes": 567,
        "comments": 194,
        "media": null,
        "permalink": "/r/netflix/comments/1ny08z4/netflix_has_gone_downhill/"
    },
    {
        "id": "1nyujxi",
        "author": "Adventurous_Ant5428",
        "title": "Why are people saying Wayward acting is bad?",
        "content": "I thought acting was pretty good from everyone especially from Evelyn, Abbie, &amp; Leila. The only noticeable mid acting for me was Alex the policeman b/c their emotions felt monotone, but it didn’t stop me from being immersed into the show. ",
        "upvotes": 7,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1nyujxi/why_are_people_saying_wayward_acting_is_bad/"
    },
    {
        "id": "1nyrqn0",
        "author": "G_R_2006",
        "title": "Do you Guys think Adaline was real in the Ed Gein story or his imagination",
        "content": "IMO\n\nAdeline Watkins was in his mind; she wasn’t real. It was his imagination that created her.\n\nMy arguments:\n\t•\tHe had schizophrenia, so he imagined many things that weren’t there or forgot things.\n\t•\tWhen Adeline came into his house and said she was going to clean up, she started doing that. But when the police arrived, you could see how filthy the place really was and that nothing had been cleaned.\n\t•\tThe psychologist in the series even said that he hears other voices encouraging him, when in reality, it’s his own thoughts. You can also hear Adeline saying, “Have sex with a corpse,” to Ed Gein. That was what he was thinking at the moment, but he thought she was the one saying it.\n\t•\tIn the last episode, it’s mentioned that the asylum has to make budget cuts, so it’s possible he wasn’t getting his full medication anymore. His schizophrenia might have partially come back, which is why Adeline Watkins appeared in his mind again.\n\t•\tIn the last episode, we see that she’s the same age as when Ed was arrested, so in his mind, she never aged.\n\t•\tBefore anyone argues that she had separate scenes without Ed Gein — like when she went to New York — Ilse Koch, the Nazi, also had scenes where Ed wasn’t present. He just wanted to make it seem real in his mind.\n\nI think they wanted to show us by him saying. Don’t kill people to her. He grew as a person and was saying to himself. I’m not going to kill people again. Because it is wrong \n\nI know she really existed; she said she had a relationship with him, but later she took it back.\n\nI think Ryan Murphy wants us to decide whether it was real or not since many people believe she actually had a relationship with him, while others say she was a liar.\n\nJust like in The Menendez Brothers, you also see the parents’ side — that they’re proud of their kids. Ryan Murphy does this to make us decide which side is real. That’s exactly what happens in this series — he wants us to decide whether she was real or not.\n\nLet me know if you disagree — I’m curious to hear your opinion on my theory.",
        "upvotes": 5,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nyrqn0/do_you_guys_think_adaline_was_real_in_the_ed_gein/"
    },
    {
        "id": "1nyr4rt",
        "author": "Round-Refrigerator99",
        "title": "Spoilers for episode 9 of Haunted Hotel: How do you think Nathan did it?",
        "content": "I think he hung himself because when Nathan said how he thought he choked on grapes, Kathrine said \"Not exactly\" implying that he did choke himself in some way",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nyr4rt/spoilers_for_episode_9_of_haunted_hotel_how_do/"
    },
    {
        "id": "1nz3xf4",
        "author": "pat4611",
        "title": "Why doesn’t Netflix have a annual subscription plan?",
        "content": "I’m really curious as to why they don’t have an annual subscription plan every other streaming service like Amazon or Disney+ has one. why hasn’t Netflix?",
        "upvotes": 1,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1nz3xf4/why_doesnt_netflix_have_a_annual_subscription_plan/"
    },
    {
        "id": "1nz3ch9",
        "author": "nayandnem",
        "title": "Just a question about Wayward and Mae Martin",
        "content": "So I know they said that the show was based on their friend’s experiences in a Troubled Teen institution but from interviews, it seems like their friend was there for conversion therapy. \n\nWhen watching this show I was kind of taken aback by how accepting everyone was of a transman in 2003 and was confused about the camp not being homophobic, again in 2003. \n\nDidn’t most of these schools have conversion therapy, at least back then? Mae’s character Alex even hinted at it when talking to one of Laura’s ex classmates. \n\nI wonder if this was a choice by Mae because they were planning to play the main character? So it would be normalized in the show and it wouldn’t be odd that the town just accepted and respected a transman? \n\nIt just feels disingenuous to the time, but I was a kid and living in the bible belt so maybe my memory is skewed. \n\nI think it should have been a plot point to be honest, it would add more to the story. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nz3ch9/just_a_question_about_wayward_and_mae_martin/"
    },
    {
        "id": "1nz359x",
        "author": "ElCivilMx-ReG",
        "title": "\"Estafador de Tinder\" Detenido otra vez. ¿ sera su fin? 👀",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nz359x/estafador_de_tinder_detenido_otra_vez_sera_su_fin/"
    },
    {
        "id": "1nz95sj",
        "author": "No_Platform_9044",
        "title": "Can’t access account",
        "content": "Hi! I’m not sure if this allowed on this sub, sorry if not!\n\nMy boyfriend created his Netflix account on his TV, and never linked his phone number, or verified his email.\n\nThis wasn’t an issue until he tried logging on the mobile app, to find his email wasn’t working. \n\nThrough a lot of rabbit holes, we found he misspelt his email. Now, he created that misspelt email account, but can’t login to it, due to Gmail flagging it. We have to wait a few business days for it to be repealed.\n\nWe tried contacting chat support for Netflix, but the help we got was very short and rude. They kept sending up the same three suggestions that pop up on the main Netflix help page. Which is no help to us, we can’t access the email. \n\nWe kept pushing for help, to which the Netflix support agent said no one would help us, and the account is now under monitoring.\n\nIt’s to the point where we are considering going to the bank and having them cancel Netflix for us. Does anyone have any suggestions on what we can do? This has been a huge headache, and a big turn off for Netflix. ",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nz95sj/cant_access_account/"
    },
    {
        "id": "1nz19u6",
        "author": "Professional_Ad9153",
        "title": "Netflix Profiles are gone",
        "content": "Logged in today for the first time since only yesterday and 4 profiles aren't there.  What happened? Can I get them back?  Is this a common thing to happen?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nz19u6/netflix_profiles_are_gone/"
    },
    {
        "id": "1nz7ydn",
        "author": "Alaska-vampire",
        "title": "Ed Gein",
        "content": "Should the victims of Ed Gein wrongfully portrayed in the show be able to sue Netflix? It seems like they went a bit far with the shop owner and even the girl who saw him on and off again. This can’t be right to the families that are still living?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nz7ydn/ed_gein/"
    },
    {
        "id": "1nyzjho",
        "author": "CompetitiveBeat4918",
        "title": "Next Gen Chef CIA property/kitchens look SO DATED.",
        "content": "I have not seen a shittier looking kitchen on a Netflix show, the dining area shown in episode 4, looked absolutely terrible too.\n\nHow is this the top school of entire America when it looks like my grandma's 100 year old kitchen. \n\nAmerican gastronomy needs aesthetics and finese.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nyzjho/next_gen_chef_cia_propertykitchens_look_so_dated/"
    },
    {
        "id": "1nyxtcv",
        "author": "Cute_Note_3624",
        "title": "What should I watch first",
        "content": "which is more worth it to binge watch ( fast paced, unpredictable plot twist, suspenseful thrilling ) \nrank them\n\nthe girlfriend prime video 2025 \nwayward 2025 \nmonster ed gein series netflix \ndevious maids",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1nyxtcv/what_should_i_watch_first/"
    },
    {
        "id": "1nz3byq",
        "author": "No_Mathematician7456",
        "title": "Why can't Netflix understand I'm watching Love Death Robots again?",
        "content": "Hi. I watched this show before. Everything was fine. Now I started watching it again and...  Netflix won't add it to \"continue watching\". It doesn't remember where I stopped. After each episode instead of starting playing the next one it sends me to a different show. What's wrong?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nz3byq/why_cant_netflix_understand_im_watching_love/"
    }
]