[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 496,
        "comments": 259,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1imcay0",
        "author": "BlackenceGhost",
        "title": "Choose your top 3 Cobra Kai babes - Leave in comments",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1imcay0/choose_your_top_3_cobra_kai_babes_leave_in/"
    },
    {
        "id": "1im280c",
        "author": "Sweaty-Toe-6211",
        "title": "Duffer Brothers Confirm No Spin-Offs: Stranger Things Characters Won’t Return After Season 5!",
        "content": "",
        "upvotes": 230,
        "comments": 37,
        "media": null,
        "permalink": "/r/netflix/comments/1im280c/duffer_brothers_confirm_no_spinoffs_stranger/"
    },
    {
        "id": "1imjl2u",
        "author": "indiewire",
        "title": "‘Apple Cider Vinegar’: What Happened to Real-Life Scammer Belle Gibson? (Explained)",
        "content": "",
        "upvotes": 11,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1imjl2u/apple_cider_vinegar_what_happened_to_reallife/"
    },
    {
        "id": "1imapxt",
        "author": "Scout1228",
        "title": "Anyone else hate this?",
        "content": "I am seriously getting traumatized by the booming noise that assaults me even when I click for more info on a movie. Why is this necessary? Anyone else hate this on Netflix?\n",
        "upvotes": 22,
        "comments": 31,
        "media": null,
        "permalink": "/r/netflix/comments/1imapxt/anyone_else_hate_this/"
    },
    {
        "id": "1imm2zv",
        "author": "CaliforniaMuscleGuy",
        "title": "3 Great Shows",
        "content": "These shows were so good, I binged watched them within a couple of days. \n\n1. The Accident: A tragic accident radically changes the lives of several families, triggering a spiral of guilt, resentment and violence that will lead them to explore the furthest limits of pain, resistance and pity. (Soooooooo damn good) \n2. Cassandra: A family moves into the oldest smart home in Germany, decades after the original owner dies; the AI household helper awakens, and is resolved to never be alone again. (Think Alexa with the heart of Chucky hehe) \n3. Apple Cider Vinegar: Two young women advocate for wellness remedies to cure deadly illnesses, unraveling their lives as they unknowingly - and knowingly - mislead the world. (This one had me floored 😳😳😳). ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1imm2zv/3_great_shows/"
    },
    {
        "id": "1immqm3",
        "author": "vanderzee",
        "title": "netflix deskto: is there nothging i can do against  game suggestions?",
        "content": "i miss moviers and show suggestions,  it was great to remind me of new seasons, or even to discover things i prolly would not have watched otherwise. but for the past months i get nothing but mobile game apps, not a single show or movie. on desktop there isnt even an option to acess games (to downvote them)\n\ni use netflix on windows 10 with edge browser, and never used netflix on mobile, and even less ever played any mobile game\n\n\n\nis there really nothing that can be done?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1immqm3/netflix_deskto_is_there_nothging_i_can_do_against/"
    },
    {
        "id": "1ilv83j",
        "author": "VerdeAzul74",
        "title": "Best Netflix documentaries that I may have missed?",
        "content": "I’ve seen quite a few documentaries on Netflix and am looking for something recommended. What do you recommend based on what I’ve seen? Favorites are marked with a *\n\nAmerican Murder\n\nAmerican Nightmare*\n\nThe Deepest Breath*\n\nFyre\n\nGirl in the Picture\n\nInto the Deep*\n\nInto the Fire*\n\nThe Staircase\n\nSweet Bobby\n\nThe Tinder Swindler\n\n\nI’ve seen more but I’m drawing a black rn. Also tried Wild, Wild Country but the scenes of nudity were too much. Likewise, tried Don’t F with Cats and I can’t stand watching animals being harmed and the same would go for Blackfish.",
        "upvotes": 67,
        "comments": 146,
        "media": null,
        "permalink": "/r/netflix/comments/1ilv83j/best_netflix_documentaries_that_i_may_have_missed/"
    },
    {
        "id": "1im7ssh",
        "author": "meepmeepbinch",
        "title": "Why did Anna Delvey go to jail, but not Belle Gibson?",
        "content": "After watching these two Netflix shows, I wonder why didn't Belle Gibson get sent to jail, I feel like what she did in comparison to what Anna Delvey did was WAYYYY worse. What do you think? \n\nEdit for typo. ",
        "upvotes": 8,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1im7ssh/why_did_anna_delvey_go_to_jail_but_not_belle/"
    },
    {
        "id": "1imbvdz",
        "author": "wolfy1091",
        "title": "Temporary passcode",
        "content": "How many of these can you get? I’m visiting family out of state been away a month and a half plan on going back home in a few days. netflix on my iPad has been working all this time now suddenly I get this device is not apart of your house hold. I have family in my house that watch on my tv back home.\n\ndumb mod.  I’m not begging for access to accounts.  It’s my own Account.   Mine\n\n“Your post was begging for access to Netflix accounts. That is not permitted in this subreddit”",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1imbvdz/temporary_passcode/"
    },
    {
        "id": "1imk7b2",
        "author": "_zyx_716",
        "title": "I have a question",
        "content": "I live back and forth between two different houses and I'm wondering if I paid for an account if I would only be able to use it at one of them because of the only on household rule",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1imk7b2/i_have_a_question/"
    },
    {
        "id": "1im9xzu",
        "author": "Atlast_2091",
        "title": "Cobra Kai: Season 6 Part 3 Sneak Peek | Netflix",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1im9xzu/cobra_kai_season_6_part_3_sneak_peek_netflix/"
    },
    {
        "id": "1imglee",
        "author": "ZealousidealFloor105",
        "title": "Show recommendations on Netflix",
        "content": "Okay so my last 2 years of Netflix has literally been me cycling between B99, The Good Place, and Superstore, and while I stand by the statement that the shows are amazing I want something new. I enjoyed the first few seasons of psych but hate the office. Idk what but there's just something about it I don't like. Other random shows I liked were the blacklist, final space, the man on the inside, suits and death note.\n\nThanks!",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1imglee/show_recommendations_on_netflix/"
    },
    {
        "id": "1img4a4",
        "author": "Admirable-Maximum-48",
        "title": "The Big Day",
        "content": "Sorry if I’m posting this in the wrong place, but I’ve been looking for this song for a very, very long time, and it just came to my mind again. I can’t find it anywhere. \nWhat is the name of the song that plays during Irina’s wedding in the Netflix series The Big Day? Collection 2, Episode 1",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1img4a4/the_big_day/"
    },
    {
        "id": "1imfwdj",
        "author": "Mr_Rotch_61",
        "title": "Netflix PC black screen when going fullscreen on Microsoft Edge \"input timing\"",
        "content": "I use Netflix on my PC, mainly through Microsoft Edge.\n\nOn my Gigabyte Aorus FO32U2P monitor, Netflix works fine.\n\nBut on my Alienware AW3423DWF Ultrawide, when I go fullscreen, the image goes black as soon as the UI disappears (I still get audio).\n\nTrying to understand why this is happening. I do have HEVC installed in the Microsoft Store. This only seems to be a problem with Microsoft Edge and the Netflix app from the Microsoft Store. Netflix on Firefox works fine.\n\nEdit: I should also mention I cleared my browser's Cookies &amp; Cache, as well as doing a clean install of the most recent Nvidia drivers.\n\nEdit 2: So if I disable Graphics Acceleration in Microsoft Edge, the video doesn't go black anymore. Problem is, I like using Graphics Acceleration so that my ICC Color Profiles load correctly, so the colors aren't overblown on my monitor. Any idea on how to fix this Graphics Acceleration issue?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1imfwdj/netflix_pc_black_screen_when_going_fullscreen_on/"
    },
    {
        "id": "1im2yxv",
        "author": "S4v1r1enCh0r4k",
        "title": "Five Fast and Furious movies are leaving Netflix on February 12th, some of them will be available on Peacock",
        "content": "",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1im2yxv/five_fast_and_furious_movies_are_leaving_netflix/"
    },
    {
        "id": "1imducd",
        "author": "LetsGoForPlanB",
        "title": "Netflix EU new horrible UI",
        "content": "New UI is horrible. Can only see 3 titles at any given time on my TV while browsing Netflix. It's now worse than Prime and Disney.\n\nAny way to revert to an older version?",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1imducd/netflix_eu_new_horrible_ui/"
    },
    {
        "id": "1im4nlb",
        "author": "forlornforbit",
        "title": "Enjoying the zaniness of Celebrity Bear Hunt but the game logic makes no sense!",
        "content": "Celebrity Bear Hunt is a fun show, undoubtedly. But every episode I watch leaves me a little but perplexed / annoyed by the lack of logic in the rules of the competition and how Bear approaches it.\n\nFirstly, the way people get selected for the Bear Pit. On some episodes this makes sense but on others it doesn't. On the episode where they cross the rope bridge, Bear or the producers decided that Shirley wouldn't face the Bear Pit even though she was directly responsible for her team's loss.\n\nOnce in the Bear Pit, the rules about who gets caught and who gets eliminated seem completely arbitrary.\n\nIt's very obvious Bear isn't putting much effort into hunting contestants. He often sees a contestant in close proximity, and decides not to chase after them, even though he could easily catch them.\n\nThen the decision about who gets eliminated is for some reason divorced from the actual outcome of the Bear Pit. Surely, if 4 people are in the pit, trying not to get caught, and 1 of them is going to be eliminated... then the first person caught should be eliminated. Or the last one to escape. That would be an objective way to decide.\n\nBut no, the decision is made separately by Bear (or producers) - he's using evidence from their performance in the Bear Pit, but making a subjective judgement about who deserves to go. We have seen players get caught in traps really early through stupid decisions, and then be allowed to stay because Bear preferred to eliminate someone else - even though that person evaded capture much longer.\n\nOne final point - what is the point of Holly Willoughby being employed as a presenter on this show? She has such a minimal role. She isn't involved at all in the Bear Pit and isn't even present when Bear decides who is going to be eliminated. \n\n",
        "upvotes": 2,
        "comments": 15,
        "media": null,
        "permalink": "/r/netflix/comments/1im4nlb/enjoying_the_zaniness_of_celebrity_bear_hunt_but/"
    },
    {
        "id": "1imci0i",
        "author": "Somethingman_121224",
        "title": "Joe Manganiello Teases Crocodile's Arc in Live-Action 'One Piece' Season 2",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1imci0i/joe_manganiello_teases_crocodiles_arc_in/"
    },
    {
        "id": "1il84am",
        "author": "Dreambeamed",
        "title": "Kinda pregnant - only about 15 minutes into the movie and already a little grossed out?",
        "content": "Anyone else think Amy Schumer saying sexually explicit dialogue to minors in high school in the classroom scene pretty wrong....? I'm only about 15 minutes in and had to post on Reddit about it find someone who felt the same. Am I crazy 😭\n\nJust seems a little inappropriate and a desperate attempt to be funny....\n\nAnd I just now saw a scene where she criticizes another character for being a teacher and being inappropriate 🤷‍♀️\n",
        "upvotes": 567,
        "comments": 284,
        "media": null,
        "permalink": "/r/netflix/comments/1il84am/kinda_pregnant_only_about_15_minutes_into_the/"
    },
    {
        "id": "1immfps",
        "author": "Opening_Strike8292",
        "title": "Imagine common side effects was a Netflix original",
        "content": "Just take a moment to visualize how much of a fucking let down it would be to watch this amazing show get canceled after two great seasons, just for a bland show of border line child porn called big mouth to get renewed again.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1immfps/imagine_common_side_effects_was_a_netflix_original/"
    },
    {
        "id": "1im0cri",
        "author": "ChiliPeppa_Squirrel",
        "title": "Night Agent Season 2 Question (Spoilers)",
        "content": "I just finished watching Night Age Season 2, and I’m not happy with it. I thought Season 1 was excellent, but this season felt all over the place.\n\nFirst off, Rose was incredibly annoying. She couldn’t decide if she wanted to stay or go back to California; she flip-flopped like four times in a single episode!\n\nThen there’s the whole Iranian involvement… which left me completely confused. What exactly was their role in all of this? It felt like they were introduced, but their purpose wasn’t clearly explained.\n\nAnother thing that bothered me: they never mentioned the name of the mysterious country the Bala family is from. Why keep that a secret?\n\nAnd speaking of the Bala family; why would Vickor Bala use the chemical KX on his own people? That made no sense to me. Now he suddenly wants revenge on the U.S.? For what exactly? His motivations just felt weak.\n\nOverall, the season didn’t make much sense to me. But back to my main question: What was the Iranians’ involvement? It really confused me, and I’d love to hear what others think.\n",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1im0cri/night_agent_season_2_question_spoilers/"
    },
    {
        "id": "1ilqi9a",
        "author": "Responsible-Spot9317",
        "title": "Who here likes ZeroCalCare, Masameer and Bad Exorcist",
        "content": "Has anyone seen these shows",
        "upvotes": 13,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ilqi9a/who_here_likes_zerocalcare_masameer_and_bad/"
    },
    {
        "id": "1ilp72h",
        "author": "90PoundsOfFury",
        "title": "Received new Netflix account emails, but I never signed up. Contacted Netflix to cancel the account and they said I had to contact Verizon (partner) to cancel it. I don’t have an account with Verizon, and Verizon said there’s nothing they can do.  How do I ensure this account is cancelled?",
        "content": "When I spoke with Netflix, they said only Verizon can cancel the partner account.  Verizon says they can’t do anything because there is no phone account and can’t search by email address at all.  ",
        "upvotes": 11,
        "comments": 11,
        "media": null,
        "permalink": "/r/netflix/comments/1ilp72h/received_new_netflix_account_emails_but_i_never/"
    },
    {
        "id": "1iljq2i",
        "author": "KitchenBeneficial302",
        "title": "4 Films from Netflix Animation in 2025",
        "content": "# Four Films from Netflix Animation\n* In Your Dreams - February 28, 2025 (limited), March 7, 2025 (Netflix)\n* The Twits - June 13, 2025\n* Untitled Charlie Bean, Paul Briggs and John Ripa film - July 25, 2025\n* Untitled Don Bluth, Gary Goldman and Dexter Fletcher film - November 21, 2025",
        "upvotes": 12,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iljq2i/4_films_from_netflix_animation_in_2025/"
    },
    {
        "id": "1ilwqpc",
        "author": "AlternativeCoyote413",
        "title": "Are The Diplomat &amp; The Night Agent of the same universe?",
        "content": "The ending credits are almost identical and both have themes around crimes within the government. It could be different timelines now and soon we’ll see the same Presidents in the others plot? Thoughts?",
        "upvotes": 1,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1ilwqpc/are_the_diplomat_the_night_agent_of_the_same/"
    },
    {
        "id": "1iljxmn",
        "author": "Atlast_2091",
        "title": "Is Friendly Rivalry (2025) kdrama series coming to netflix?",
        "content": "My subscriptions currently on-hold for valentines. So, I can't remember if I mark (notify) this show before pausing monthly plan. If you need info about the show [Trailer](https://youtu.be/_keUPuita5Q?si=oDgv8WqVTpmEGFFK) \\- [MyDramaList](https://mydramalist.com/764499-friendly-competition) ",
        "upvotes": 10,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1iljxmn/is_friendly_rivalry_2025_kdrama_series_coming_to/"
    },
    {
        "id": "1im1lwq",
        "author": "ametist0",
        "title": "Brightness Changes From Subtitles M1 iPad Pro",
        "content": "Whenever I turn the subtitles on, the bright parts of the screen become darker when they appear. Also, the black bars on the screen turn much brighter. This issue does not exist when I turn off the subtitles. I found a lot of complaints about this, but the only fix I could find is to stop using subtitles altogether.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1im1lwq/brightness_changes_from_subtitles_m1_ipad_pro/"
    },
    {
        "id": "1im0i88",
        "author": "okaybhaii",
        "title": "Ladies and Gentlemen! Swades💗✨",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t1k7d40ei9ie1/DASH_480.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1im0i88/ladies_and_gentlemen_swades/"
    },
    {
        "id": "1im4832",
        "author": "Neat_Stick_5902",
        "title": "Some netflix shows are not available",
        "content": "So apparently even if you pay for a netflix membership some of the shows or movies now are not available unless you upgrade to the ad free version. Pretty sure we are just canceling it at this point",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1im4832/some_netflix_shows_are_not_available/"
    },
    {
        "id": "1ilaxzi",
        "author": "Robemilak",
        "title": "Ben Affleck to Replace Matt Damon in Netflix Thriller 'Animals'",
        "content": "",
        "upvotes": 22,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1ilaxzi/ben_affleck_to_replace_matt_damon_in_netflix/"
    },
    {
        "id": "1ilmsy9",
        "author": "cardsrealm",
        "title": "Apple Cider Vinegar (Series): True Story, Synopsis, Trailers and Cast!",
        "content": "",
        "upvotes": 4,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1ilmsy9/apple_cider_vinegar_series_true_story_synopsis/"
    }
]