[
    {
        "id": "1qnd1ex",
        "author": "RM_Official_Thread",
        "title": "Weekly Open Thread - General Discussion",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n\n\n\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "upvotes": 16,
        "comments": 2781,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qnd1ex/weekly_open_thread_general_discussion/"
    },
    {
        "id": "1qppleu",
        "author": "scoreboard-app",
        "title": "Post Match Thread: Benfica vs Real Madrid, UCL Match 8",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1qppleu)",
        "upvotes": 333,
        "comments": 2573,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qppleu/post_match_thread_benfica_vs_real_madrid_ucl/"
    },
    {
        "id": "1qqfzbd",
        "author": "AbuElKess",
        "title": "Reminder: up until that day we were top of the league, 7 points ahead of Barcelona, and second in the Champions League.",
        "content": "",
        "upvotes": 2737,
        "comments": 271,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/abalq3yqvbgg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qqfzbd/reminder_up_until_that_day_we_were_top_of_the/"
    },
    {
        "id": "1qqynyy",
        "author": "oiomelanda",
        "title": "😂😂😂😂😂😂😂😂😂 sums up our current state",
        "content": "",
        "upvotes": 105,
        "comments": 12,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/18terrm3tfgg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qqynyy/sums_up_our_current_state/"
    },
    {
        "id": "1qqfsfk",
        "author": "brownberriess1",
        "title": "People often say he's our best player aside from courtois. I say he's our best alongside him",
        "content": "",
        "upvotes": 498,
        "comments": 68,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/g3qp04blubgg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qqfsfk/people_often_say_hes_our_best_player_aside_from/"
    },
    {
        "id": "1qq6fkn",
        "author": "Ready_Ad_1353",
        "title": "Courtois congratulates Trubin after the match: True sportsmanship!!!",
        "content": "",
        "upvotes": 1371,
        "comments": 32,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hg5t4qgp0agg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qq6fkn/courtois_congratulates_trubin_after_the_match/"
    },
    {
        "id": "1qqyw1i",
        "author": "Texas_Shepard",
        "title": "Something poêple forget about vini's renewal",
        "content": "Look im not going to talk about his bad form rn, obviously he can and will play better in the future.\n\nBut let me remind you of few names, alaba, Bale, hazard, kaka, james. You know what they have in common? \nWe signed them for a long ass time, for a huge salary and for years they fell off the power curve and we had to pay their wages instead of improving the team. \n\nIm scared we will do the same with vini. We renew him for 5/6 years. He'll play 2 more good seasons and then when he's past that 27 y/o his burst speed is gone and he'lls Slowly get worse. Now we stuck with him and huge salary instead of refreshing the squad. \n\nThis is why vini leaving is better, despite me thinking he'll overcome his bad form. ",
        "upvotes": 35,
        "comments": 15,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qqyw1i/something_poêple_forget_about_vinis_renewal/"
    },
    {
        "id": "1qqxbyb",
        "author": "hdsiysaist",
        "title": "vinícius júnior has to be sold",
        "content": "there’s a point where the past doesn’t matter, I’ve defended vinicius multiple times after shit performances in this sub but it reached point where he becomes indefensible, I’ve always excused his attitude to refs because he was delivering, ignored the fact he plays selfishly because he delivered, ignored the fact that he was a diva because again delivered. but he isn’t at that level anymore and we aren’t a club that waits for a player to “regain their form” you’re either RM level or not\n\nselling him and much of the deadweight in the club will be the smartest decision the board will be making from the last 5 years\n\nthis team has to be built around mbappe/jude.\n\na diamond 4 of mbappe and GG upfront makes the most sense\n\nim just very unsure about who starts as 10, because if arda starts then signing any DLP will be a massive headache, because then there is fede on the bench, (who imo is still a world class player, and his pervious matches prove that). so someone has to be the sacrificial lamb here and its either arda or fede.\n\nand its absolutely disastrous that fede has been play as a RB, it’s inexcusable the fact that we have 0 depth in defence\n\nso thats why the club needs to break the bank for nico schlotterbeck, signing ibrahima konate will prove to me that club haven’t learned from their mistakes, he has lots of bozo moments, could be outmuscled easily and is injury prone.\n\nselling the deadweight/letting them go for free: vini, rodrygo, ceballos, mendy, rudiger, alaba and militao.\n\nI love militao but he’s injury prone and just eats up the wage bill\n\ndani carvajal is still serviceable for us, we can promote victor valdepeñas, david jimenez and joan martinez from the academy, and resign chema andres and nico paz.\n\nand people who try to blame raul ascenio are complete brats who probably started to support this team recently, he’s been basically forced to lead this backline in his 2nd season of professional football, but players like dean hujisen and even carerras can get away with murder. is his red card silly, yes! but doesn’t warrant all this hate, NO.\n\nhe’s still a very important part of this team and is clearly better then hujisen imo\n\nmasta has to been loaned out, he’s an AM, who’s been forced to play on the right OR we can demote him to castilla and let him get used to play as a RW, because he can’t beat his man at all and he isn’t pacey enough. his work rate has been exceptional though\n\nbrahim is a good bench option, and most players I mentioned should be re-signed/promoted if they understand that they are BENCH players. you aren’t gonna be in the starting xi. just good rotational bench options",
        "upvotes": 44,
        "comments": 47,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qqxbyb/vinícius_júnior_has_to_be_sold/"
    },
    {
        "id": "1qq984j",
        "author": "dark4403",
        "title": "Arda Güler cheering on the team after the second goal, he gave absolutely everything and as a reward he went to the bench...",
        "content": "",
        "upvotes": 676,
        "comments": 73,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/eibz62zsnagg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qq984j/arda_güler_cheering_on_the_team_after_the_second/"
    },
    {
        "id": "1qqnip5",
        "author": "Old-Discussion-3776",
        "title": "We Lost, But It’s Part of Football",
        "content": "We lost with a horrible performance yesterday, and it hurts a lot, especially when it’s against a team that is fighting relegation. But football is unpredictable. Even big clubs like PSG, who once won the sextuple and were considered unstoppable, are now struggling and sitting around 11th place. This shows that no team stays at its peak forever and that some matches are simply tough — not just physically, but mentally as well. Players are human. They feel pressure, fatigue, criticism, and expectations. They don’t step onto the pitch wanting to lose. They want to win because victories bring pride, recognition, and satisfaction, not just money. When things go wrong, it’s often more about confidence and mentality than a lack of effort.\n\nIt’s easy for fans to say that players are only here for money, but the reality is more complex. Many of these players receive massive offers from Saudi clubs and elsewhere, yet they still choose to play for Real Madrid because of what this club represents. Yes, the loss hurts deeply — I couldn’t sleep properly either — but we have to remember that they lost too, and it hurts them as well. Booing our own players only makes things worse. Just like we expect support from friends and family when we are at our lowest, our team also deserves backing during difficult times. This is their club as much as it is ours, and standing by them now is what true support really means.",
        "upvotes": 125,
        "comments": 32,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/7qonauu39dgg1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qqnip5/we_lost_but_its_part_of_football/"
    },
    {
        "id": "1qqga33",
        "author": "Messmers",
        "title": "Anyone else ended up laughing at this final play from us?",
        "content": "",
        "upvotes": 220,
        "comments": 51,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/gdj18nekxbgg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qqga33/anyone_else_ended_up_laughing_at_this_final_play/"
    },
    {
        "id": "1qq9ab7",
        "author": "dark4403",
        "title": "For me, only Mbappe and Courtois deserve the love from the fans.",
        "content": "",
        "upvotes": 440,
        "comments": 113,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/mu3hoq08oagg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qq9ab7/for_me_only_mbappe_and_courtois_deserve_the_love/"
    },
    {
        "id": "1qqbnp0",
        "author": "13AA",
        "title": "Me to Vini , Bellingham , Valverde",
        "content": "",
        "upvotes": 297,
        "comments": 36,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/24cztixg4bgg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qqbnp0/me_to_vini_bellingham_valverde/"
    },
    {
        "id": "1qr043a",
        "author": "Substantial_Dot_8714",
        "title": "Vinícius Júnior is currently the top assister in the champions league. He's on course to finish as the club’s top assister for a fourth consecutive season in the competition.",
        "content": "",
        "upvotes": 9,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/9ljuh69t8ggg1.jpeg?auto=webp&amp;s=c5b65eba3ddcb5571abaa88fa24a0f466702843b"
        },
        "permalink": "/r/realmadrid/comments/1qr043a/vinícius_júnior_is_currently_the_top_assister_in/"
    },
    {
        "id": "1qqc3lh",
        "author": "Bijay12356",
        "title": "Give me, My happiness back man 😓😓",
        "content": "",
        "upvotes": 203,
        "comments": 13,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/o08uq9577bgg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qqc3lh/give_me_my_happiness_back_man/"
    },
    {
        "id": "1qpsywm",
        "author": "o6ohunter",
        "title": "Arda Guler’s reaction to being subbed off",
        "content": "",
        "upvotes": 2543,
        "comments": 344,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/6w69q2d2m6gg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qpsywm/arda_gulers_reaction_to_being_subbed_off/"
    },
    {
        "id": "1qpu271",
        "author": "ch1nkkyy",
        "title": "Players headed straight to the locker room while an angry Courtois stopped a few to show appreciation for the fans who traveled",
        "content": "",
        "upvotes": 2002,
        "comments": 157,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/h22ftuh7u6gg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qpu271/players_headed_straight_to_the_locker_room_while/"
    },
    {
        "id": "1qqze73",
        "author": "ace-s",
        "title": "The right choice would have been to sub out Vini(or even Jude) instead of Guler",
        "content": "I'm really speechless. We have a team that has 3 players that are completely untouchable and will throw a tantrum if they are subbed out. Atleast Mbappe actually performs consistently(for now). \n\nHow any manager is supposed to make changes when they can realistically rotate 6 players. \n\nHow Guler reacted was wrong but he is a kid and when one of the captains does this, he would learn too. \n\nHonestly,   \nWouldnt it have been better to bring in Gonzalo Garcia for Vini, put Mbappe on the wings?\n\nThe moment Xabi's time ended was when Vini threw his tantrum and the board supported it, but I bet Vini and his friends hated Xabi from the beggining for being to strict, for wanting to rotate more, for demanding more from the players. \n\nWhat makes me sad is that, we were 7 points ahead of Barca while having a team that did not back the manager. Imagine if they truly backed him!!!!!!",
        "upvotes": 5,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qqze73/the_right_choice_would_have_been_to_sub_out/"
    },
    {
        "id": "1qq5ym4",
        "author": "ace-s",
        "title": "Mourinho would turn these players into warriors and setup the next generation like he did in 10-11. What he did to Zlatan still gives me chills",
        "content": "",
        "upvotes": 263,
        "comments": 65,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/8yg2nvhwv9gg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qq5ym4/mourinho_would_turn_these_players_into_warriors/"
    },
    {
        "id": "1qq73j8",
        "author": "Short_Mousse_6812",
        "title": "We have too many players that are not Real Madrid level",
        "content": "   We bought an unproven Mastantuono for a big amount of money for basically no reason. He has a future, but he currently should not be starting every game by any means. We have Tchoumeni who is great physically, but when it comes to the ball, he can’t shoot, pass, or drive it forward. We have Huijsen who we only bought because of his talent and projection. Yeah, he knows what to do with the ball, but under pressure he crumbles. He has no physical and he gets bullied of the ball easily. Then we have Alaba, Ceballos, and Mendy who just occupy space on the bench or in the hospital. When it comes to actual World Class players we only have two, Courtouis and Mbappe. How did we get to the point where we need to overhaul midfield, defense and the right wing? Our situation will not start to change until we get rid of players who bring nothing, and start bringing PROVEN players. Not some 17 year old South American, but someone who we know for a fact is good. The fact we did not even try to get Guehi still haunts me, and we dropped 60 on mastantuono, crazy. ",
        "upvotes": 208,
        "comments": 121,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qq73j8/we_have_too_many_players_that_are_not_real_madrid/"
    },
    {
        "id": "1qqbspr",
        "author": "Ready_Ad_1353",
        "title": "Kylian Mbappe has already reached the highest goal tally in the UCL from the previous season (Raphinha, 13)",
        "content": "",
        "upvotes": 102,
        "comments": 58,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/k7jd181f5bgg1.jpeg?auto=webp&amp;s=0efcabde39b8138f4090981022111872103fb922"
        },
        "permalink": "/r/realmadrid/comments/1qqbspr/kylian_mbappe_has_already_reached_the_highest/"
    },
    {
        "id": "1qpzenj",
        "author": "AbuElKess",
        "title": "Vinicius 1 vs 5 attempt - Mbappe down injured",
        "content": "",
        "upvotes": 701,
        "comments": 126,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/tt8oovzy08gg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qpzenj/vinicius_1_vs_5_attempt_mbappe_down_injured/"
    },
    {
        "id": "1qq0bwx",
        "author": "Betonomeshalka",
        "title": "Formation of Madrid before the 4th goal, the team had to defend 6v8",
        "content": "Both Vini and Mbappe really expected to get the ball bounced back to them and be saviors?\n\nI believe that saving the team starts from defending as one team, and only then start thinking about scoring the goal. As I was arguing before on this sub, this team won’t be able to compete against a disciplined, high-pressing team.",
        "upvotes": 588,
        "comments": 92,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/c2linzgh98gg1.jpeg?auto=webp&amp;s=c302829e969fb01fc632e5574a9528b4b299e2a4"
        },
        "permalink": "/r/realmadrid/comments/1qq0bwx/formation_of_madrid_before_the_4th_goal_the_team/"
    },
    {
        "id": "1qqb9es",
        "author": "ace-s",
        "title": "How Arbeloa and Flo talk to the players",
        "content": "",
        "upvotes": 95,
        "comments": 14,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/5ua6uyev1bgg1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qqb9es/how_arbeloa_and_flo_talk_to_the_players/"
    },
    {
        "id": "1qqyraz",
        "author": "Texas_Shepard",
        "title": "Regarding arbeloa's press conferences",
        "content": "Arbeloa keeps saying it's his fault for the losses and it's not the players. And it's clear he's gonna say that for all future disappointment. \nBut respectfully, if it's your fault, then why are you on the job? If you're admitting that you are the reason we're out of copa and out of top 8 after being 3rd.Then leave and let soemone better. \n\nTldr: if it's your fault then gtfo",
        "upvotes": 5,
        "comments": 7,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qqyraz/regarding_arbeloas_press_conferences/"
    },
    {
        "id": "1qpvxem",
        "author": "Maravilla_23",
        "title": "He is the “Special One” for a reason! I’d take him back in a heartbeat.",
        "content": "",
        "upvotes": 947,
        "comments": 82,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/hv4ct4ml87gg1/CMAF_360.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qpvxem/he_is_the_special_one_for_a_reason_id_take_him/"
    },
    {
        "id": "1qqn1jd",
        "author": "Mastermind_737",
        "title": "The team is just a mess tactically and the middle class is non-existent. We need defenders who defend and midfielders that stick to the basics.",
        "content": "If Jude isn't playing as an 8 then Guler and Mastantuono needs to be replaced by proper midfielders. But you can't have Guler and Jude together without another midfielder besides Tchouameni to help cover. We need balance, these are football fundamentals. Those are the things Xabi always looked out for causing frustration from players who didn't care about the structure of the team. In 23/24 champions final we had 4 midfielders playing Kroos, Cama, Valverde, and Jude with Modric Tchouameni Ceballos on the bench too. In 21/22 we had 4 again with Valverde, Kroos, Modric and Casemiro with Cama and Ceballos on the bench. In 17/18 and 16/17 again 4 with Isco, Kroos, Modric, and Casemiro.  And now we have only Jude and Tchouameni as starting midfielders with Cama on the bench and Fede at right back. We need a strong middle class, if not the system fails with defenders becoming exposed and attackers don't get any service. ",
        "upvotes": 22,
        "comments": 35,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qqn1jd/the_team_is_just_a_mess_tactically_and_the_middle/"
    },
    {
        "id": "1qqcat5",
        "author": "Few-Variety-6926",
        "title": "Me after the watching the game",
        "content": "",
        "upvotes": 69,
        "comments": 7,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/osguh3um8bgg1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1qqcat5/me_after_the_watching_the_game/"
    },
    {
        "id": "1qq3q32",
        "author": "aquilitosrmcf",
        "title": "We need to scrap the stupid seniority captain rule and name Courtois the captain",
        "content": "This is by no means our biggest problem right now but game after game I feel that Valverde and Vinicius are not fit to captain this club, especially after shit last night where they want to run back to the changing room and hide from the fans and Courtois is screaming at them to face the fans. \n\nHow many times have Vinicius and Valverde faced the media after a loss? It's a joke, it's always Courtois and he always speaks truthfully, analyticaly and being self-critical. \n\nHe's the only one with the experience and maturity (apart from Carvajal but he never plays) to actually lead this team.\n\nThen again... The armband probably doesn't mean anything to these brats. ",
        "upvotes": 225,
        "comments": 44,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qq3q32/we_need_to_scrap_the_stupid_seniority_captain/"
    },
    {
        "id": "1qqfk2x",
        "author": "Babo_stats",
        "title": "Real Madrid player availability tracker 25/26 | february update",
        "content": "Real Madrid player availability tracker 25/26, updated for february. I've made 2 versions, one with only first team players who've played this season (slide 1) and one with every player that has gotten minutes this season (slide 2).\n\nLight green: Made minutes  \nGreen: On the bench for the entire game  \nYellow: Didn't travel with the team for whatever reason (rest, suspension, Afcon etc)  \nOrange: Subbed off due to injury (according to FotMob and TransferMarkt)  \nRed: Injured  \nBlack: Part of a different team\n\nIf you have any ideas to improve this or see any mistakes, please let me know!",
        "upvotes": 40,
        "comments": 12,
        "media": null,
        "permalink": "/r/realmadrid/comments/1qqfk2x/real_madrid_player_availability_tracker_2526/"
    }
]