[
    {
        "id": "1h3y8tb",
        "author": "Hopeful_Crew_6787",
        "title": "Dove farsi fare un abito blu classico?",
        "content": "Buongiorno a tutti,\n\nSono interessato a farmi fare un abito blu classico e vorrei sapere qui in città che opzioni ci sono per il su misura. \nVoi che esperienze avete avuto e quanto avete speso? \nChe consigli e indicazioni dareste?",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1h3y8tb/dove_farsi_fare_un_abito_blu_classico/"
    },
    {
        "id": "1h3yhqt",
        "author": "Professional-Fly2853",
        "title": "River Po Kayaking?",
        "content": "Ciao tutti,\n\nI wonder if anyone knows about the rules for the river Po specifically along Parco Valentino… if I have an inflatable kayak I travel with, can I kayak around the river Po in the Parco Valentino area?\n\nThank you in advance!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1h3yhqt/river_po_kayaking/"
    },
    {
        "id": "1h3ld59",
        "author": "AdThese6575",
        "title": "Nuove amicizie",
        "content": "Ciao a tutti, sono un ragazzo di 28 anni.. sono un informatico e son qui da circa 3 anni. Negli ultimi mesi 3 amici con cui avevo legato molto hanno lasciato la cittá e sto cercando persone con cui passare del tempo e condividere interessi. C’è anche la mia ragazza qui. Andavo molto spesso al Bunker, alle serate Outcast.. in generale mi piace molto andare a serata di musica techno o elettronica, cosa che ora faccio con molta meno frequenza dato che non ho più una compagnia di amici. Ascolto molto hip hop/ rap americano. Cerco qualcuno con interessi simili per costruire qualcosa, i miei colleghi purtroppo sono fin troppo “normie” per la mia indole, che qualcuno mi salvi 😊",
        "upvotes": 4,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1h3ld59/nuove_amicizie/"
    },
    {
        "id": "1h3hhrg",
        "author": "Sad-Statistician3806",
        "title": "Spazi dove giocare",
        "content": "Ciao ragazzi, qualcuno conosce un qualche posto dove poter giocare di ruolo o a giochi da tavolo? Magari uno spazio gratuito, che non implica una consumazione minima.",
        "upvotes": 4,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1h3hhrg/spazi_dove_giocare/"
    },
    {
        "id": "1h3mezc",
        "author": "_L_-",
        "title": "Rievocazioni storiche in questo stile ",
        "content": "A Torino e dintorni fanno rievocazioni in stile vittoriano o qualcosa di simile?\n\nCome si partecipa a queste cose? \n",
        "upvotes": 2,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xlc8b5act34e1.jpeg?auto=webp&amp;s=7dabb7f9ca4b95af383882fe8f6e681caf6aa078"
        },
        "permalink": "/r/torino/comments/1h3mezc/rievocazioni_storiche_in_questo_stile/"
    },
    {
        "id": "1h3o8ow",
        "author": "lucadepa_",
        "title": "svago a torino",
        "content": "ragazzi sbaglio o torino è diventata un mortorio? il sabato sera non so più cosa fare se non andare nelle solite 2 discoteche per la mia fascia d’età (18 anni), ogni tanto penso a ciò che c’era nella mia zona fino al 2017 (nizza millefonti) si chiamava zona verde se non erro e c’era molto movimento fra ragazzi e famiglie, visto che era aperta fino a tarda serata, era aperta tutta l’estate, ora sia di inverno che d’estate questa città è diventata di una tristezza assurda a parer mio, dalle 10 di sera cala il silenzio più assoluto.\nvoi conoscete qualche locale interessante? oppure siete della mia stessa idea😂",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1h3o8ow/svago_a_torino/"
    },
    {
        "id": "1h3gj31",
        "author": "Extra-Window7021",
        "title": "amicizie a torino ",
        "content": "mi sono trasferita in realtà da tre/quattro anni qui ma non ho mai avuto l’opportunità di fare amicizia con persone con interessi simili ai miei.\n\nora arriva la descrizione super top e per nulla breve:\nho 19 anni, sono una ragazza e mi piace girare, andare al cinema, andare per i bar. non ho mai provato ad andare in discoteca però esiste una prima volta per tutto! \nnon ho pretese, vorrei solo gente con cui passare tempo nella mia fin troppo monotona vita.",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1h3gj31/amicizie_a_torino/"
    },
    {
        "id": "1h39ofc",
        "author": "LuxJupiterian",
        "title": "Posti fighi dove fare aperitivo ",
        "content": "Ciao ragazzi, conoscete dei posti fighi anche non mainstream in quel di Torino?\nGrazie millee",
        "upvotes": 6,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1h39ofc/posti_fighi_dove_fare_aperitivo/"
    },
    {
        "id": "1h3fxt0",
        "author": "ConcertFamiliar2790",
        "title": "Yin yoga a Torino ",
        "content": "Ciao amici, sapete consigliare un bel centro che fa corsi di Yin yoga a Torino.\n\nCerco magari un posto che organizza anche meditazioni, attività fuori, ritiri, etc, non vera e proprio palestra. \n\nGrazie in anticipo!\n",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1h3fxt0/yin_yoga_a_torino/"
    },
    {
        "id": "1h2tj1k",
        "author": "Reiquen",
        "title": "Ho creato un sito per giocare a \"Trova i Toret\"! 🚰",
        "content": "Ciao a tutti! Dopo aver letto il post di u/signordado sulla sfida personale di bere da tutti i Toret di Torino ho deciso di giocare anch'io.\n\nNon trovando soluzioni pratiche per tracciare i progressi, ho sviluppato un sito molto molto basic che fa esattamente questo: permette di spuntare i Toret visitati e tenere traccia delle tue tappe.\n\nSto pensando di aggiungere:\n\n\\-Una modalità di gruppo, per invitare amici, vedere chi ha trovato quali Turet e magari lasciare commenti o foto sulle fontanelle visitate.\n\n\\-Link a I Love Toret, per scoprire la storia di questi simboli torinesi, adottarli e fare una donazione per sostenerli.\n\nChe ne pensate? Scrivetmi se lo proverete  e per suggerimenti su come  migliorarlo  \nEcco il link: [Vitz.it/torino/toret](http://Vitz.it/torino/toret)  \nbuon Tour-et!",
        "upvotes": 27,
        "comments": 14,
        "media": null,
        "permalink": "/r/torino/comments/1h2tj1k/ho_creato_un_sito_per_giocare_a_trova_i_toret/"
    },
    {
        "id": "1h39n9n",
        "author": "LuxJupiterian",
        "title": "Parcheggi gratis il più vicino possibile verso San Salvario",
        "content": "Ciao ragazzi, conoscete posti dove parcheggiare gratuitamente il più vicino possibile verso San Salvario?",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1h39n9n/parcheggi_gratis_il_più_vicino_possibile_verso/"
    },
    {
        "id": "1h2xxoz",
        "author": "mmmmmmmmmmmmmat",
        "title": "Nuove amicizie a Torino",
        "content": "Ciao a tutti!! Mi chiamo Matteo e sono un ragazzo di 24 anni di Torino. Ho visto che la gente scrive qui per cercare nuove conoscenze e ho pensato di provare anche io. Durante gli anni del liceo avevo una bella compagnia di amici, poi tra una cosa e l'altra ci siamo persi di vista e all'uni non ho legato molto. Ora lavoro e ho un paio di amici conosciuti di recente. Sono anche fidanzato, per cui non posso dire di essere solo, però allo stesso tempo mi manca avere una bella compagnia di amici maschi con cui passare qualche serata easy, uscire a bere una birra in centro, a dire cazzate e cose così. Mi piacerebbe creare un bel gruppo di amici che condivida un po' i miei interessi, ma sono aperto anche a situazioni diverse. Mi piace molto tutto quello che ha a che fare con la creatività, amo la musica rock/punk (da ragazzino avevo anche una band), amo leggere, parlare di arte, filosofia, attualità, andare alle mostre e concerti... insomma un po' di tutto. Scrivetemi se vi può interessare fare due chiacchiere✨✨",
        "upvotes": 7,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h2xxoz/nuove_amicizie_a_torino/"
    },
    {
        "id": "1h30i4d",
        "author": "MrDasse",
        "title": "Fare qualcosa di diverso",
        "content": "Abito a Torino da sempre, ma sinceramente non ho mai trovato persone (o comunque davvero difficile) che condividessero le mie passioni, in particolare modo le ragazze.\n\nGiustamente qualcuno potrebbe chiedersi \"E che saranno mai?\" Nulla di strano a dire il vero : trekking in montagna, sciare, gite in moto, viaggi e in generale altre attività all'aperto. Normali no? Eppure la gente che mi circonda ha come hobby/obbiettivi : sfondarsi e fare serata, andare costantemente a ballare oppure piazzarsi costantemente in centro.\n\nSono consapevole del fatto che le mie non siano attività strane o strampalate, però non so davvero dove trovare qualcuno con cui possa condividerle.\n\nVoi dove cerchereste?",
        "upvotes": 3,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1h30i4d/fare_qualcosa_di_diverso/"
    },
    {
        "id": "1h2v04h",
        "author": "Realistic_Exam_6242",
        "title": "Stand-up di Domenica?",
        "content": "Esistono locali che fanno stand up comedy la domenica a Torino?",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1h2v04h/standup_di_domenica/"
    },
    {
        "id": "1h2krgg",
        "author": "Meiyo_ayoo",
        "title": "Idee",
        "content": "Buongiorno a tutti voi torinesi! Avrei una domanda semplice e concisa da farvi, cosa mancherebbe / aggiustereste a torino? \nVi do un po’ di contesto.\nVenerdì prossimo il sindaco dovrebbe venire nella mia scuola a raccogliere idee riguardo al “cosa aggiungere a torino”. Ho pensato di chiedere a voi popolani facenti parte di diversi ceti sociali perché, come me, vivete a torino! \nDunque vi ringrazio e attendo vostri consigli.\n\nEdit: Ho capito che il problema è la GTT ma vi prego di consigliare anche altro.",
        "upvotes": 14,
        "comments": 54,
        "media": null,
        "permalink": "/r/torino/comments/1h2krgg/idee/"
    },
    {
        "id": "1h2v110",
        "author": "PuzzleheadedHotel406",
        "title": "Negozio per parrucca cosplay?",
        "content": "Come da titolo, vorrei provare a prendere una parrucca per un cosplay per il Xmas Comics che si avvicina, ma ordinando adesso online da siti che non siano Amazon )che è abbastanza caro) c'è il rischio che la parrucca non mi arrivi in tempo.\nConoscete qualche negozio a Torino dove potrei cercare?",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1h2v110/negozio_per_parrucca_cosplay/"
    },
    {
        "id": "1h2kfcy",
        "author": "SessRinSama",
        "title": "DOVE È MEGLIO ABITARE TRA RIVOLI/ALPIGNANO/ROSTA?",
        "content": "Sto valutando di trasferirmi per lavoro a Torino con la mia famiglia. Siccome non voglio abitare in città, stavo valutando le località vicine. Quali tra Rivoli, Alpignano e Rosta sono più tranquille e anche sicure a livello residenziale secondo voi?",
        "upvotes": 3,
        "comments": 22,
        "media": null,
        "permalink": "/r/torino/comments/1h2kfcy/dove_è_meglio_abitare_tra_rivolialpignanorosta/"
    },
    {
        "id": "1h2h94c",
        "author": "Unlikely-Amoeba-5985",
        "title": "Week in Torino",
        "content": "Ciao! I’m coming to Torino for a week (7/12-14/12) and looking for good things to do, to Eat, to Dance and to have fun. Maybe with a local guide or such? Any recommendations? ",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1h2h94c/week_in_torino/"
    },
    {
        "id": "1h2dn18",
        "author": "EntertainmentMean826",
        "title": "mi piacerebbe molto fare nuove amicizie (Lombardia,Piemonte) (aiutatemi mi annoio così tanto) ",
        "content": "Buongiorno a tutti, mi chiamo mateusz, ho 18 anni e vengo dalla Georgia.\n\nVivo in Piemonte da un anno ormai. Attualmente sto imparando l'italiano e spero di fare progressi significativi con il tempo. Parlo anche la mia lingua madre, il georgiano, e sono fluente in inglese e russo.\n\nNon mi considero una persona particolarmente impegnata nella vita quotidiana. Sono una persona semplice, ma trovo molta gioia in questo. Adoro ascoltare musica, fare lunghe passeggiate per la città, scoprendo angoli nascosti e nuovi punti di vista. È un modo per sentirmi in sintonia con l'ambiente che mi circonda. Mi piace anche scattare foto, e ho diverse fotocamere per catturare quei momenti. \nInoltre, mi sto tatuando da solo, una passione che mi permette di esprimere la mia creatività e di migliorare con ogni nuovo disegno. Amo guardare film e, soprattutto, parlare di qualsiasi cosa che stimoli una conversazione interessante. Sono molto aperto a discutere di qualsiasi argomento e mi piacerebbe trovare qualcuno con cui praticare l'italiano.\n\n Spero di fare nuove amicizie e di incontrare persone interessanti, potrei anche scambiare un po' di inglese, se volete tutti.\n\n(il mio instagram è sul profilo) \n\nbuonagiornata a tutti 🙏🏻\n",
        "upvotes": 6,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1h2dn18/mi_piacerebbe_molto_fare_nuove_amicizie/"
    },
    {
        "id": "1h2i0bz",
        "author": "Practical-Desk1327",
        "title": "Stampa 3D sostenibile",
        "content": "Ciao a tutti, \n\nstampo in 3D da una vita ed ora sto cercando di cambiare un pò di abitudini per essere più ecosostenibile. Ho iniziato ad informarmi quindi sui filamenti che possono essere riciclabili ma ho, ahimè scoperto che essere riciclabile non vuol dire che può essere riciclato, ad esempio, il PLA fatto da fonti vegetali che potrebbe essere smaltito come plastica, non viene riconosciuto dai sistemi di riciclaggio delle centrali e quindi viene buttato comunque nell'indifferenziato. Mi chiedo quindi : \n\n1) Esistono dei filamenti che posso buttare nell'organico? \n\n2) Esistono qui a Torino dei posti dove poter portare tutto il PLA e che si occupano poi di riciclarlo? \n\nSo che forse non è il miglior posto per chiedere questa cosa sulla stampa 3D, ma volendo smaltirlo a Torino non avevo altre idee. Se volete consigliarmi altri luoghi dove chiedere sono ben accetti!   \nGrazieeeee",
        "upvotes": 2,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1h2i0bz/stampa_3d_sostenibile/"
    },
    {
        "id": "1h2hy6o",
        "author": "ConcertFamiliar2790",
        "title": "Nuoto libero?",
        "content": "Ciao amici, sapete consigliare una piscina per nuoto libero a Torino, idealmente vicino il Centro? 25 o 50 metri\n\nGrazie in anticipo!\n",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h2hy6o/nuoto_libero/"
    },
    {
        "id": "1h2g0s3",
        "author": "itmegiadaaa",
        "title": "Nasty party",
        "content": "Qualcun* che viene al banana mia stasera? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1h2g0s3/nasty_party/"
    },
    {
        "id": "1h1xqms",
        "author": "ssweetnothings",
        "title": "luoghi alternativi?",
        "content": "Ciao! Ho 19 anni e mi sono trasferita da poco a Torino, cerco luoghi in cui fanno eventi/ serate alternative o più in generale anche luoghi in cui si può conoscere gente appassionata di musica, cinema, arte più in generale. So che ce ne sono tanti ma non so davvero come muovermi, qualcuno sa darmi una mano? \n",
        "upvotes": 13,
        "comments": 12,
        "media": null,
        "permalink": "/r/torino/comments/1h1xqms/luoghi_alternativi/"
    },
    {
        "id": "1h22nuh",
        "author": "Rude-Green3601",
        "title": "Quanto pagate di Tari ",
        "content": "Io pago per un bilocale di 50 metri dove vivono 2 persone 200€ anno è corretto?",
        "upvotes": 4,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1h22nuh/quanto_pagate_di_tari/"
    },
    {
        "id": "1h1zjiy",
        "author": "framillman",
        "title": "CAF Patronato Ex ENPALS",
        "content": "Ciao torinesi!\n\nHo bisogno di un consiglio da voi: avete un riferimento di un patronato che ne sappia qualcosa di ex Enpals? Grazie!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1h1zjiy/caf_patronato_ex_enpals/"
    },
    {
        "id": "1h1tt5e",
        "author": "SkyeDoesRandomStuff",
        "title": "Salone del libro: libri in lingua",
        "content": "Hey, stavo pensando di andare al salone del libro l’anno prossimo. Hanno libri in lingua originale? Cioè, se il libro è stato scritto in inglese, lo potrò acquistare in inglese? O hanno solo libri in italiano?",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1h1tt5e/salone_del_libro_libri_in_lingua/"
    },
    {
        "id": "1h1abox",
        "author": "Skylinegt-r34",
        "title": "sono un ragazzo di Torino che vive a settimo di 37 anni è mi sento molto solo, qualcuno che è disposto a fare conoscenza? preferirei ragazze perchè ho sempre fatto fdatica a relazionarmi con l'altro sesso, ma vanno benissimo anche ragazzi, purchè possa fare amicizia",
        "content": "Ciao a tutti, sto passando un periodaccio... mi sento tanto solo, ed ho bisogno di avere qualche amico/a accanto, qualcuno è disposto a perdere un pò di tempo con me... so di essere uno un pò \"difficile\" come gusti, ma ho anche un cuore grande e mi piacerebbe trovare qualcuno con cui passare le serate ed i week end a giocare, chiaccherare, vedere un film o bere una birra...spero qualcuno possa rispondere... grazie",
        "upvotes": 41,
        "comments": 40,
        "media": null,
        "permalink": "/r/torino/comments/1h1abox/sono_un_ragazzo_di_torino_che_vive_a_settimo_di/"
    },
    {
        "id": "1h1g63f",
        "author": "mo_one",
        "title": "Amicizie queer a torino?",
        "content": "Ehilà, sono un ragazzo bisessuale, Bulgaro, e mi chiedevo se c'è gente queer a torino che vuole fare amicizia? Ho abbastanza amici etero, e vorrei fare qualche amico nella comunità\n\nStudio informatica alla unito, e mi piacciono I giochi da tavolo/ruolo, scrivere ogni tanto, imparare lingue lingue, programmare (duh), e gli anime (anche se non li guardo da un po). (So che non è molto descrittivo, ma potete sempre guardare il mio profilo per vedere che genere di persona sono)",
        "upvotes": 8,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1h1g63f/amicizie_queer_a_torino/"
    },
    {
        "id": "1h1760d",
        "author": "sbrodolino_21",
        "title": "Multa GTT",
        "content": "Oggi sono stato multato da GTT perché sono salito su un tram, avendo acquistato il biglietto sull'app ToMove per android, ma senza validarlo. Il problema è che questo tram era talmente pieno che non era possibile raggiungere i validatori. Ci ho provato ma non è stato possibile e non volevo dare il mio cellulare a qualcuno per convalidare.\nNon era neanche possibile fare l'autoconvalida in quanto android.\n\nPosso fare qualcosa? Devo veramente essere multato io per le loro inefficienze?",
        "upvotes": 20,
        "comments": 20,
        "media": null,
        "permalink": "/r/torino/comments/1h1760d/multa_gtt/"
    },
    {
        "id": "1h0yqe7",
        "author": "MicheleCaracas",
        "title": "Nuovi orari metro per Dicembre e Gennaio (non abituatevi troppo bene)",
        "content": "Dal sito GTT:\n\nLa metropolitana dal 2 dicembre offre un servizio prolungato per rispondere alle esigenze di cittadini e visitatori. La rimodulazione dell’orario tiene conto dell’aumento di mobilità tipico del periodo e la possibilità di integrare l’estensione oraria fino a tutto gennaio grazie all’avanzamento delle attività di aggiornamento tecnologico in corso.\n\nPrime partenze dai capolinea di Fermi e Bengasi sono confermate alle 5.30 tutti i giorni tranne la domenica con partenza ore 7.00. Le ultime partenze dai capolinea di Fermi e Bengasi saranno alle 21.30 il lunedì, alle 24.00 dal martedì al giovedì e alla domenica. Venerdì e sabato ultime partenze alle 1.00.\n\nLa rimodulazione degli orari è il risultato di una stretta collaborazione con la Città e si integra con il progresso dei lavori di migrazione degli impianti di terra del sistema di segnalamento CBTC. I lavori in questa fase non interferiscono sul servizio ed è quindi stato tecnicamente possibile estendere gli orari. Le attività di migrazione del sistema riprenderanno nel mese di febbraio 2025. ",
        "upvotes": 35,
        "comments": 27,
        "media": null,
        "permalink": "/r/torino/comments/1h0yqe7/nuovi_orari_metro_per_dicembre_e_gennaio_non/"
    }
]