[
    {
        "id": "1l3pmef",
        "author": "AutoModerator",
        "title": "Netflix's Innovative New TV Experience Featuring Enhanced Design, Responsive Recommendations, and a New Way to Search",
        "content": "",
        "upvotes": 13,
        "comments": 88,
        "media": null,
        "permalink": "/r/netflix/comments/1l3pmef/netflixs_innovative_new_tv_experience_featuring/"
    },
    {
        "id": "1kgc0ok",
        "author": "anonRedd",
        "title": "Squid Game - The Final Games Begin June 27",
        "content": "",
        "upvotes": 68,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1kgc0ok/squid_game_the_final_games_begin_june_27/"
    },
    {
        "id": "1ll2oz9",
        "author": "Present-Listen6921",
        "title": "The new Netflix UI is SO bad and unintuitive.",
        "content": "Some obvious issues I noticed:\n1. The home and category buttons have moved from the left of the screen to the top. Which means if I need to access them after having scrolled down a few rows of content, I have to scroll all the way up again one row at a time to get to them. Alternatively the “Back” button can take you there but that’s not intuitive at all?!\n2. The content cards should be zoomed out at least 2x to see more content in one screen, right now on a 55 inch screen I can see only 3.5 content cards in one view which seems quite restrictive and way more no. Of clicks than required when I’m browsing through content to find something to watch.\n—-\nDoes anyone know if there is an option for users to revert to the older version? :(",
        "upvotes": 42,
        "comments": 20,
        "media": null,
        "permalink": "/r/netflix/comments/1ll2oz9/the_new_netflix_ui_is_so_bad_and_unintuitive/"
    },
    {
        "id": "1lkrm3k",
        "author": "gubigal",
        "title": "Dept. Q - Has it been renewed for another Season?",
        "content": "It needs to be.  Best show I’ve seen on Netflix in a long time.  Not what I was expecting and there are so many things I just love about the show.  The casting is phenomenal, the subplots and stories associated with each character aren’t over done or exploited.  It’s a proper amount of mysterious but powering through  and are more reflective of real life where everyone has their own struggle.  The main plot was great.  Ending was awesome.\n\nThere needs to be a season 2.  I need more of this.  Netflix - are you listening?  Season 2.",
        "upvotes": 80,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1lkrm3k/dept_q_has_it_been_renewed_for_another_season/"
    },
    {
        "id": "1lkabs8",
        "author": "Longjumping_Land_977",
        "title": "Carnival Cruises has issued a new statement about the Trainwreck: Poop Cruise documentary",
        "content": "",
        "upvotes": 384,
        "comments": 164,
        "media": null,
        "permalink": "/r/netflix/comments/1lkabs8/carnival_cruises_has_issued_a_new_statement_about/"
    },
    {
        "id": "1lkp6rl",
        "author": "FukudaSan007",
        "title": "'Bet' Renewed For Second Season By Netflix",
        "content": "I really like this show and I thought for sure it wouldn't be renewed. Very happy to be wrong. I have seen the anime it's based on, of which I was also a fan, and Bet is quite a departure. However, it doesn't bother me and can stand apart from the source material. Hopefully, the second season will be as good as the first. \n",
        "upvotes": 42,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lkp6rl/bet_renewed_for_second_season_by_netflix/"
    },
    {
        "id": "1ll07j0",
        "author": "Fluffy_Hope_7287",
        "title": "I loved K-Pop Demon Hunters – but I really hope they turn it into a full series!",
        "content": "Just watched K-Pop Demon Hunters and honestly, I LOVED it. The concept, the animation, the music, the action – it was such a fun ride with way more emotional depth than I expected. But I really hope this isn’t the end and they continue the story, either with a sequel or (fingers crossed) a full series.\n\nThere’s just so much more they could explore. Like, we never got the full story of how Rumi's mom fell in love with a demon?? That could be an entire arc on its own. Also, how did the girls even meet and form the band? The dynamic is so strong, and I’d love to see those early days – both as idols and as demon hunters.\n\nPlus, the demon threat is definitely not over. At the end, the new Honmoon wasn’t gold, which I’m sure means demons can still escape into the human world. That feels like a huge open door for future stories.\n\nAnd okay, can we talk about Jinu?? I know he died, but he gave his soul to Rumi – what if that means he could come back? Maybe not as a human, but as an angel or some kind of spirit warrior? I feel like his story isn’t over yet.\n\nAnyway, I’m just hoping enough people support the movie so the creators get the green light to keep building this world. There’s so much potential!\n\nAnyone else feel the same?",
        "upvotes": 6,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1ll07j0/i_loved_kpop_demon_hunters_but_i_really_hope_they/"
    },
    {
        "id": "1ll49j4",
        "author": "eve_patchett",
        "title": "Extra member",
        "content": "Have taken over payment for our main account (standard plus extra member)\nExtra member wants to pay for their account separately and separate the accounts completely using their extra member login, how do I make that happen? ",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1ll49j4/extra_member/"
    },
    {
        "id": "1ll4r2p",
        "author": "EPIC1NUGGET",
        "title": "What is this, and how do I fix it?",
        "content": "https://preview.redd.it/54p0rsctta9f1.png?width=740&amp;format=png&amp;auto=webp&amp;s=0572ecf222960d651a057e2dc3434ef23af1133f\n\nFor some reason when I try and watch Netflix on my pc this pops up and I don't know what it means by it, I just really confused as to why this shows now since it didn't show like a week ago",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1ll4r2p/what_is_this_and_how_do_i_fix_it/"
    },
    {
        "id": "1lk447f",
        "author": "IrishStarUS",
        "title": "Cobra Kai stars seen in furious row after Martin Kove 'bit' Alicia Hannah-Kim",
        "content": "",
        "upvotes": 146,
        "comments": 32,
        "media": null,
        "permalink": "/r/netflix/comments/1lk447f/cobra_kai_stars_seen_in_furious_row_after_martin/"
    },
    {
        "id": "1lklx58",
        "author": "lalauvte",
        "title": "what movie should i watch tonight? no horrors plz",
        "content": "just wondering i really need to watch a movie that will entertain me and enjoyable for my adhd if that makes sense. i like romance, mystery , murder , sci fi  and anime comment below plz (:",
        "upvotes": 10,
        "comments": 51,
        "media": null,
        "permalink": "/r/netflix/comments/1lklx58/what_movie_should_i_watch_tonight_no_horrors_plz/"
    },
    {
        "id": "1lkvhjo",
        "author": "Ok-Display-6604",
        "title": "Song titles!",
        "content": "In your opinion, what's one of the greatest show or movie opening songs? Is it just the song or the entire opening scene? And do you prefer long or short opening scenes? ",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1lkvhjo/song_titles/"
    },
    {
        "id": "1lktx2a",
        "author": "Adritenki",
        "title": "Why is Scissor Seven season 5 still not on Netflix, not even any announcement or new?",
        "content": "Scissor Seven is really an amazing show (a donghua, a Chinese animated show, to be specific) which also has an awesome dub.\n\nSeason 5 was released in China in October 2024, which means 8 months ago. I would understand 6 months later, like I think it happened with season 4. But 8 months and any single announcement or something? At least Netflix could say if they really are going to something or it is cancelled or something.\n\nBasically, this all sums up in: Scissor Seven season 5 on Netflix? Yes? No? And, if yes, when?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lktx2a/why_is_scissor_seven_season_5_still_not_on/"
    },
    {
        "id": "1ljwlqb",
        "author": "CorpseJuiceSlurpee",
        "title": "Thoughts on Trainwreck: Poop Cruise",
        "content": "I just finished the documentary and I was pretty disappointed in the quality of this documentary.\n\nGenerally, it seems like an interesting topic, and something that I remember happening but don't really know the details of; and I feel like the events leading up to and the cause of the outage were covered pretty well. And that's kind of where my compliments on this doc stops.\n\nThe crew they interviewed were somewhat interesting.The lady who was the voice of the ship was had some great detail of the event because she was where the action and decisions were happening. The chef had some funny anecdotes. The Russian lady was solely there to be horny and call Americans stupid.\n\nThey seemingly found the absolute worst passengers to comment on their experiences. There was little more relayed than it was gross and upsetting. The bachelorette party was insufferable and somehow 12 years later hasn't changed a bit. They acted like such stereotypical bachelorette \"woo girls\" that I can't tell if they were putting on an act or if that's genuinely how they are. \n\nThe entirety of the father-daughter footage can be summed up in, \"I was scared and this experience was not what we paid for.\"\n\nI don't know if this was just the interviewees in particular or maybe it's a true cross section of the type of people who go on cruises, but all the passengers acted like pooping in the red biohazard bags was the absolute end of the world. The son in law seemed to care for little else except that. His grand victory was finding a working toilet. That's might have been the highlight of his life. I've shit into wag bags before and carried it out with me. It's not the most pleasant thing but you do what you gotta do. And they didn't even have to pack it out, they could put it in garbage cans around the ship.\n\nAdditionally all the passengers acted like they were alone on a raft weathering the elements, forced to hand deliver their turds into red bags. Let's be real, they say on their asses while the crew did actual work amidst spoiled people on their worst behavior.\n\nI would have loved to hear what the crew was doing to help passengers day to day, and they did a bit here and there, but it was never really covered. And I would have loved to hear what went on interpersonally on the ship between passengers. People were doing shitty things like hoarding and claiming territory, was there bartering? Did people form loose alliances? This could have been an interesting study on human behavior and instead the biggest takeaway was poop lasagna.\n\nAlso, there's a tie for biggest piece of shit between the Carnival Marketing guy and the Cruise Lawyer.  \n\n3/10 - Still not as bad as Untold: The Liver King",
        "upvotes": 106,
        "comments": 100,
        "media": null,
        "permalink": "/r/netflix/comments/1ljwlqb/thoughts_on_trainwreck_poop_cruise/"
    },
    {
        "id": "1lkjggi",
        "author": "Ok-Display-6604",
        "title": "The rookie",
        "content": "I've tried google'ing it but haven't seen a solid answer to the question, is season 7 of 'The rookie' ever coming to Netflix or not? Thanks in advance! ",
        "upvotes": 3,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lkjggi/the_rookie/"
    },
    {
        "id": "1lkquxu",
        "author": "FancyKraken",
        "title": "KPop Demon Hunters Merch sizes",
        "content": "I want to purchase some KPop Demon Hunters merch, but there are no size charts for any of the shirts and hoodies. I can't order anything without knowing what the measurements are. Does anyone know if there is one for their products or one for the KPop products specifically? Thanks!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lkquxu/kpop_demon_hunters_merch_sizes/"
    },
    {
        "id": "1lkqaxe",
        "author": "Thivious",
        "title": "Kpop demon hunter",
        "content": "Hello someone know how to find the full ost of kpop demon hunter in french, i find in VO very easily but for all the other language its very harder, i can only find the scene where the music play. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lkqaxe/kpop_demon_hunter/"
    },
    {
        "id": "1lkq32j",
        "author": "Gullible-Ad178",
        "title": "KPop Demon Hunters \"New Honmoon\"?",
        "content": "Hi. Just wanted to hear other people's opinion on this bc I haven't been able to see any discourse about this anywhere else but I finished watching KDH and I felt the ending fell a bit flat for me.\n\nSpoilers ahead, if you haven't seen it.\n\n\nThe entire setup was rooted on how Rumi's double identity potentially changes the perspective of hunters' roles and what demons are. I thought Rumi coming into terms with her identity and who Jinu was, making a new Honmoon meant accepting that demons were just manipulated by Gwi-Ma.\n\nInstead, though, we get Jinu as the only redeemable demon who sacrifices himself, and the rest of the Saja Boys getting killed together with other demons. \n\nSo my question really is, how is the new honmoon any different for the demons ? Is it only different for Rumi?",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lkq32j/kpop_demon_hunters_new_honmoon/"
    },
    {
        "id": "1lkwovr",
        "author": "Avenheit",
        "title": "Randomly charged for \"extra member slot\"",
        "content": "What the hell is this?\n\nYou're telling me, the ACCOUNT OWNER, that I can't bloody watch my OWN ACCOUNT on different networks?\n\nI moved from home, MY ACCOUNT was and STILL IS, for my father and I.\n\nSo I can't watch MY ACCOUNT because I don't live at home anymore?\n\nNetflix,  tell me why I should give you any ounce of respect??",
        "upvotes": 0,
        "comments": 18,
        "media": null,
        "permalink": "/r/netflix/comments/1lkwovr/randomly_charged_for_extra_member_slot/"
    },
    {
        "id": "1lk19la",
        "author": "Complex_Grass6312",
        "title": "Just watched The Twelve — why is no one talking about this??",
        "content": "I randomly clicked on The Twelve last night and ended up bingeing the entire thing. It’s one of the best courtroom dramas I’ve seen. I’ve seen zero promotion for this, and it’s honestly criminal how buried it is.\n\nHas anyone else seen this? Or know of any similar hidden gems I should check out next?",
        "upvotes": 21,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1lk19la/just_watched_the_twelve_why_is_no_one_talking/"
    },
    {
        "id": "1lktrpe",
        "author": "SnapSketchStudios",
        "title": "Hmm",
        "content": "",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lktrpe/hmm/"
    },
    {
        "id": "1lk3f8n",
        "author": "EconomistAdvanced120",
        "title": "FUBAR",
        "content": "Surely I am not alone in wanting a Season 3!?! So many good things going for this show… i can’t help but think it just kept getting better and before I knew it I was at the end of season 2 😥I just wish I had the words to describe a show that had the thrill of action yet literally wetting my pants laughing! Please let me know I’m not alone in loving this show!\n",
        "upvotes": 12,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1lk3f8n/fubar/"
    },
    {
        "id": "1ljoc5n",
        "author": "Vashknives",
        "title": "Any way to get Netflix for cheaper?",
        "content": "Was wondering if theres any way to get the Netflix subscription for cheaper? Currently paying around $25 and looking to see if theres any discounts or promos for the premium plan. Any help would be greatly appreciated!",
        "upvotes": 393,
        "comments": 57,
        "media": null,
        "permalink": "/r/netflix/comments/1ljoc5n/any_way_to_get_netflix_for_cheaper/"
    },
    {
        "id": "1lkky5m",
        "author": "MaterialDate5460",
        "title": "Is it worth downgrading if I’m only using for one show?",
        "content": "I have been paying for standard for about 6 months, and everything that I have seen is pretty much meh, except for Venture Bros. I am asking for advice on whether I should downgrade for just that show specifically. If I do and I finish the show, should I cancel immediately afterwards? Thanks for your time",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1lkky5m/is_it_worth_downgrading_if_im_only_using_for_one/"
    },
    {
        "id": "1ljevku",
        "author": "Gnnz",
        "title": "The Good Place worth watching?",
        "content": "This pops up constantly on my Netflix and I am considering starting. For those of you that have watched it or are currently watching it, is it worth the watch?",
        "upvotes": 298,
        "comments": 202,
        "media": null,
        "permalink": "/r/netflix/comments/1ljevku/the_good_place_worth_watching/"
    },
    {
        "id": "1lkk11y",
        "author": "Ok-Display-6604",
        "title": "Don't know what to watch!",
        "content": "I just finished 'The rookie' and don't know what to watch next! Some things I've liked are : shadow&amp;bone, b99, Dexter, sherlock, The society, Inside man, House, Derry girls, The sandman, Lucifer. Can you recommend me anything based on this? Thanks in advance! ",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lkk11y/dont_know_what_to_watch/"
    },
    {
        "id": "1lk34iv",
        "author": "ineedhelp6789",
        "title": "How to revert to old layout?",
        "content": "The new netflix layout is horrendously useless. Im using google chromecast.\n\nI have a lot in \"my list\", and i have to scroll through each of them just to find the shows.\n\nI always check the \"coming this week\" and \"coming next week\", now it's gone.\n\nAny way to revert back to the old layout?",
        "upvotes": 7,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1lk34iv/how_to_revert_to_old_layout/"
    },
    {
        "id": "1lkjgoy",
        "author": "MamaMia1325",
        "title": "The Waterfront characters...",
        "content": "I'm on episode 6 and Cane has grown on me and is now my favorite character. I hated Bree at first but now I love her. I can't stand Topher Grace's character. I think they made him too over the top. I'm loving the brother and sister dynamic between Bree and Cane but neither parent has grown on me. They really didn't make either one very likable.",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lkjgoy/the_waterfront_characters/"
    },
    {
        "id": "1ljj0a1",
        "author": "OkStretch9367",
        "title": "Dept Q",
        "content": "Me and my partner loved this. I just hope the do a season 2. So many unanswered question about what happened to the main character. Anyone who loves police shows should give this watch",
        "upvotes": 133,
        "comments": 29,
        "media": null,
        "permalink": "/r/netflix/comments/1ljj0a1/dept_q/"
    },
    {
        "id": "1lkg3dc",
        "author": "keltoid15",
        "title": "4 pm EST June 25",
        "content": "And I get nothing on Netflix -- black screen - every other app works -- anyone else having a problem? I was watching it earlier today, no problem!!  So, not sure!!",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1lkg3dc/4_pm_est_june_25/"
    },
    {
        "id": "1lk6sx8",
        "author": "bubblez4eva",
        "title": "KPop Demon Hunters (Korean or English)",
        "content": "Hi All,\n\n\nI've read a few reviews in how good this movie is and want to watch it. However no one ever says if they watched it in English or Korean. I want to knowbwhat's the optimal version? I keep hearing how good the songs are, and want to be able to enjoy them tot the fullest. ",
        "upvotes": 0,
        "comments": 9,
        "media": null,
        "permalink": "/r/netflix/comments/1lk6sx8/kpop_demon_hunters_korean_or_english/"
    },
    {
        "id": "1lk1s9c",
        "author": "Indoril-Nerevar337",
        "title": "‘Cobra Kai’ Actor Accused of Biting Co-Star Hard Enough to Nearly Draw Blood: \"He Grabbed My Arm Again to Kiss it\"",
        "content": "",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1lk1s9c/cobra_kai_actor_accused_of_biting_costar_hard/"
    }
]