[
    {
        "id": "1lzz8vz",
        "author": "Pinchus121",
        "title": "I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix and host of the Naked Lunch podcast. I travel the world eating incredible food and talking to even more incredible people. Let’s dish! AMA.",
        "content": "Hi Reddit! I’m Phil Rosenthal, host of Somebody Feed Phil on Netflix, and host of the Naked Lunch podcast with my good friend David Wild. I’ve spent the last several years traveling the globe with a fork in hand, trying to prove that the best way to connect with people is through good food and a lot of laughs. Season 8 of Somebody Feed Phil is now streaming on Netflix and we’re serving up new episodes of Naked Lunch every week wherever you get your podcasts, including chats with legends like Jane Fonda, John Stamos, Allison Janney, and so many more!  \n  \nGot questions about the best food cities, behind-the-scenes stories from the road (or the sitcom world), or where I stand on pineapple on pizza? I’m all yours!  \n  \nLet’s eat and chat.  \n  \nPhil  \nu/Pinchus121\n\nhttps://preview.redd.it/4k4qn42nrwcf1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=19b27cd4f54858b592249a41b78424ec7203a1e5\n\n\n\n&gt;Thanks everyone for joining in! Be sure to check out Season 8 of Somebody Feed Phil now on Netflix and listen to new episodes of my podcast \"Naked Lunch\" every week!",
        "upvotes": 90,
        "comments": 118,
        "media": null,
        "permalink": "/r/netflix/comments/1lzz8vz/im_phil_rosenthal_host_of_somebody_feed_phil_on/"
    },
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1m4pyf9",
        "author": "AustinBaze",
        "title": "Stop Asking Me \"Who's Watching?\" Dammit.",
        "content": "[Please Stop Asking](https://preview.redd.it/vdi33l6te1ef1.jpg?width=890&amp;format=pjpg&amp;auto=webp&amp;s=efe046b37cc706f4349d0958c889462ec978c8f4)\n\nSingle, no kids.  There is only one Netflix profile.  There is only one subscriber. There has only ever been ONE profile and one subscriber. Ever.   \nThere has only been answer ever to this question for the 10 years or so you have been asking it.  I'm bored with it, are you Netflix?   \n",
        "upvotes": 621,
        "comments": 59,
        "media": null,
        "permalink": "/r/netflix/comments/1m4pyf9/stop_asking_me_whos_watching_dammit/"
    },
    {
        "id": "1m4mze7",
        "author": "Due-Needleworker-218",
        "title": "How to stop them recommending me shows I’ve already watched..",
        "content": "I watch quite a lot of shows and movies on Netflix and they still suggest/recommend stuff to me that I previously watched like a week ago. Is there a way to stop this or maybe hide certain titles after u watched them? ",
        "upvotes": 61,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1m4mze7/how_to_stop_them_recommending_me_shows_ive/"
    },
    {
        "id": "1m4zpjy",
        "author": "hoozyrdaddy",
        "title": "Allow users to turn off Autoplay from TVs",
        "content": "It’s absurd that this is no longer allowed… And it’s a very obvious ploy to get people to have the app on their TVs and on their phones when it doesn’t need to be on every single device that we own.",
        "upvotes": 5,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1m4zpjy/allow_users_to_turn_off_autoplay_from_tvs/"
    },
    {
        "id": "1m56nww",
        "author": "Honest-Pay2893",
        "title": "The Assessment",
        "content": "Really Dissatisfied watching this movie because instantly to me music was exactly like the Netflix show DARK which did not get as much notice/hype and is imo 10000% better. Give credit where credit is due that composer should have credited the person that made that sound “trendy”. Made me kind of mad? \n",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m56nww/the_assessment/"
    },
    {
        "id": "1m56hvd",
        "author": "eksukoon",
        "title": "Vanessa Kirby’s Fierce Transformation in Netflix’s “Night Always Comes”",
        "content": "",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m56hvd/vanessa_kirbys_fierce_transformation_in_netflixs/"
    },
    {
        "id": "1m56d9t",
        "author": "Lonely_Fault_9599",
        "title": "Fear street question",
        "content": "\nFear street question \n\nAfter fear street prom queen who do you think should direct/write the next fear street movie and what book should be adapted next ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m56d9t/fear_street_question/"
    },
    {
        "id": "1m5685o",
        "author": "WiseCityStepper",
        "title": "Do you think Season 2 of Wednesday will surpass Squid Games and become the most watched Netflix show ever",
        "content": "i’ve seen a lot of hype for Wednesday when it first came out and it’s been nearly 3 years since then, do you think it could be the season to surpass Squid Games? ",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m5685o/do_you_think_season_2_of_wednesday_will_surpass/"
    },
    {
        "id": "1m4sz8w",
        "author": "James_15625_",
        "title": "Fubar Swedish Mafia",
        "content": "Not really a spoiler but the Swedish Mafia all driving a Volvo on Fubar is like next level 😂😂😂\n\nI loved the many quirks the show has. Like Arnold’s movies being referenced. Also I think after true lies, this is yet another story of him being the ladies guy. \n\nWhat really makes you want to watch the series are his wife and daughter though. Awesome casting!",
        "upvotes": 6,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m4sz8w/fubar_swedish_mafia/"
    },
    {
        "id": "1m4r1zh",
        "author": "LilBitofSunshine99",
        "title": "Has anyone else watched Entitled?",
        "content": "Damn this show is so crazy. I don't know how else to describe it. Only 8 episodes for season 1 and they're only 30ish minutes apiece. I was hooked by the last 5 minutes of episode 1 and had to binge the rest. \n\nI'm curious about others' opinions. \n",
        "upvotes": 6,
        "comments": 13,
        "media": null,
        "permalink": "/r/netflix/comments/1m4r1zh/has_anyone_else_watched_entitled/"
    },
    {
        "id": "1m491ao",
        "author": "Next-Wash-7113",
        "title": "Untamed - omfg, y’all!",
        "content": "Episode one - shocking!! And it just better as it went! I’m only through episode three so no spoilers but you guys??! \nCast is AMAZING! You really feel for them and their circumstances! \nAlso!! The views and images are absolutely BREATHTAKING!! I want to go there now ",
        "upvotes": 103,
        "comments": 61,
        "media": null,
        "permalink": "/r/netflix/comments/1m491ao/untamed_omfg_yall/"
    },
    {
        "id": "1m4xx7r",
        "author": "Easy_Philosopher1023",
        "title": "Need recommendations please",
        "content": "Having trouble finding something not crappy or boring. Seems like everything has been done over and over again. Some things that I absolutely love:\nThe Witcher\nThe Umbrella Academy\nThe haunting of Hill House and Bly Manor (and anything Mike Flanagan, House of Usher, Midnight Mass, etc)\nThe Sandman\nStranger Things\nLost\nOne Piece\nSweet Tooth\nYou \nThe 100\nKaos\n\nHorror, Sci-Fi and Fantasy are my go tos. \n\nI’ve tried a few that were flops:\nDiscovery of witches\nDead boy detectives\n\nEverything just seems so played out. Don’t tell me Shadow and Bone, I want to read the books first!\n\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m4xx7r/need_recommendations_please/"
    },
    {
        "id": "1m4vw7w",
        "author": "snowblindsided",
        "title": "NETFLIX KPop Demon Hunters sing-along theatrical release when?",
        "content": "So we can sing together and be Golden?   I will buy All The Popcorn Buckets.  \\o/\n\nOh, and contact the Hatsune Miku people.  You may be on to something here.\n",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m4vw7w/netflix_kpop_demon_hunters_singalong_theatrical/"
    },
    {
        "id": "1m4zlfk",
        "author": "40-1Segert",
        "title": "Why is aways part 2 or the second film available...  But not the first one?",
        "content": "This is really doing my head in. I think hey i want to watch dune. Because people say those are really good movies. Cool. Netflix has those right? Only part 2.... WHY? Just... What is the purpose of only having part 2 on netflix. While not having the first movie? I cant watch part 2 now. Since i havent seen the first one. That is not enjoyable to me/\n\nAnd Dune is not the only example of this.  John wick film series is also not complete. For example.\n\nSurely im not the only one with this frustration right? Sometimes i set something aside to watch later. Maybe a month goes by. Since live is busy. And... its gone. It really is now or never sometimes now with netflix. This isnt how it used to be. I have netflix since... 8 years ago? 9? And it was complete freedom of watching whatever you wanted whenever. Now it feels very limited. And having the part 2 movies and not part 1 being available. Is very frustrating. \n\nI get it. Licences and all that. But to be honest. As a consumer. I dont care about that. I care about having the freedom to watch whatever i want. Whenever i want. Binge watching some movies. Like i was planning this evening. I wanted to binge watch dune 1 and 2. Sadly not possible...\n\nAnyone else get this frustation? Any specific series you had this with?",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m4zlfk/why_is_aways_part_2_or_the_second_film_available/"
    },
    {
        "id": "1m4y7qz",
        "author": "Similar-Toe4495",
        "title": "What's this film called?",
        "content": "Sorry I have such little to go on, I really cant remember anything about this film, except it had British actors in it, set in maybe Australia, a woman goes away to her families-friend's beach house and her little girl gets caught in a fire or a tornado while playing hide and seek",
        "upvotes": 1,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m4y7qz/whats_this_film_called/"
    },
    {
        "id": "1m4wcq6",
        "author": "LookUpThenLookDown",
        "title": "Finished watching Dirk Gently. Really love it but sad it got cancelled",
        "content": "I spent a whole day watching Dirk Gently. I started watching it because of the clips I saw online. I watched episode one few years back, was very confused stop and didn't even finished the episode, big mistake because now it's on my top favorite shows. Such a great cast, and such a unique storyline. What I love even more is that I can feel the chemistry with the characters, Elijah Woods and Samuel Barnett together was something I didn't know I needed in life. Shame that it got cancelled. After s2 I really wanted to know what happened after especially my favorite characters Bert and Ken. But we have to move on. It's been almost a decade since it was cancelled, maybe if it's still possible even a little possibility of a book or comic but it's been so long, I get it if the show runners or writers moved on.\n\nAnyway what are your thoughts on the show?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m4wcq6/finished_watching_dirk_gently_really_love_it_but/"
    },
    {
        "id": "1m4kdzr",
        "author": "starmaxeros",
        "title": "Winx Club: The Magic is Back is coming to Netflix on October 2",
        "content": "",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m4kdzr/winx_club_the_magic_is_back_is_coming_to_netflix/"
    },
    {
        "id": "1m4hs0l",
        "author": "Content-Ad-5883",
        "title": "ADAM SANDLER MOVIES",
        "content": "Is anyone here also loves Happy Madison Productions by Adam Sandler? I could bingewatch his movies all day and night. Specially the comedy one, well most of them are comedies. I have this hint that, if Rob Schneider appears... that movie would be a 10/10! Idk, I'm just proud of him because his half-Filipino. Honestly, I just watched some of his film through Netflix and Loklok. \n\nHere's the films I've watch and I will rate it based on my experience while watching (or secret crush on cast. clue: AS) Consider this as my recommendations if you love his films so much!\n\n- Grown Ups 1 &amp; 2 8/10\n- 50 First Dates 1000/10\n- Just Go With It 8/10\n- The Longest Yard 7.5/10\n- Big Daddy 9/10\n- Hotel Transylvania 1, 2, 3 &amp; 4 10000/10\n- The Cobbler 4/10\n- Punch-Drunk Love 6/10\n- The Do Over 9.5/10\n- Murder Mystery 1&amp; 2 7/10\n- Your So Not Invited To My Batmitzvah 8/10\n- Hubbie Holloween 8.9/10\n- Don't Mess with the Zohan 10000000/10\n- Happy Gilmore 1 11/10\n- Billy Madison 7.6/10\n- The Click 8.5/10\n- Blended 6/10\n- That's My Boy 100000000000/10 \n- Pixels 8.6/10\n- Anger Management 5/10\n- The Ridiculous 6 10/10\n- Sandy Wexler 5/10\n- The Week Of 1000000000000/10\n\nI'm so excited about HAPPY GILMORE 2, JULY 25TH ON NETFLIX &lt;3333333\n\nI know there's movies of him that I still don't watch, I just can't find them. Maybe y'all can send hel:p where can I watch it.",
        "upvotes": 4,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1m4hs0l/adam_sandler_movies/"
    },
    {
        "id": "1m4qze3",
        "author": "Exotic-College1042",
        "title": "Update household - no text option?",
        "content": "Has this happened to anyone? \nThis week, on the updating household page, the send text option is not longer available.\n\nThey only have a send email option. \n\nWhat's up with that? Anyone know?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m4qze3/update_household_no_text_option/"
    },
    {
        "id": "1m4o4h7",
        "author": "ves_2727",
        "title": "5.1 sound enable in windows",
        "content": "I have an external usb 5.1 DAC , how to view supported movies and shows  in 5.1,in  browser i'm only able to see stereo option in audio settings. P.S Windows detects 5.1 ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m4o4h7/51_sound_enable_in_windows/"
    },
    {
        "id": "1m4nr4y",
        "author": "dystopian_teen",
        "title": "shiny mobile app?",
        "content": "when i move my phone the poster goes shiny in different places... has anyone else noticed this as a new feature? \n\ni was wondering if maybe apple had an app running in the background that was causing the shininess like a sticker and this is nothing to do with netflix",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vonq3ccjw0ef1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1m4nr4y/shiny_mobile_app/"
    },
    {
        "id": "1m47v72",
        "author": "No_Chocolate_7401",
        "title": "Help — we miss Kaos!",
        "content": "\n*and can’t come to grips that there will never be more!* What else can we watch that is similar? Anything come close? The whole vibe, the comedy, the raunch, the gods and goddesses  — we are here for it. ",
        "upvotes": 12,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1m47v72/help_we_miss_kaos/"
    },
    {
        "id": "1m4ltri",
        "author": "No_Caterpillar7863",
        "title": "Account hacked ?",
        "content": "Today I got a message from Netflix on my gmail saying that another device has been signed into my account and gave a location...the message came simultaneously after I signed from device...I tried changing the password and signing out of all devices but it kept on happening...my email account has not been hacked...is it a bug or something?",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1m4ltri/account_hacked/"
    },
    {
        "id": "1m4x4b9",
        "author": "NoCalAzoreana",
        "title": "Rejecting request to upgrade to 4k Subscription messed up my new TV",
        "content": "In the recent pre-Prime sale I bought a 55 in Insignia TV. Love it! I had to reload my apps but no problem. I was watching Netflix and a pop up says you have the 1080 subscription do you want to PAY MORE and get the 4K subscription? Ummm…no…I do not want to pay more…no thanks. Then, after that, any time I played something, the picture would flash and as it played an 8 inch bar across the tv had no picture and would flash. I set out to return it but was suggested to restore to factory settings. TV is back to normal. Has anyone had anything similar happen?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m4x4b9/rejecting_request_to_upgrade_to_4k_subscription/"
    },
    {
        "id": "1m43sck",
        "author": "Petal_Ripple73",
        "title": "For those who’ve seen Baby Reindeer — did it change how you think about victimhood, mental health, or how messy online relationships can get?",
        "content": "I watched Baby Reindeer last week and honestly... I’m still thinking about it. I went in expecting something like your usual dark true-crime drama, but it felt way more personal and uncomfortable — in a good way, if that makes sense.\n\nIt really messed with my head a bit. The way it explores obsession, blurred boundaries, trauma, and even how we sometimes downplay our own experiences — it hit way closer to home than I expected.\n\nI’m still not even sure how I feel about certain parts. Like, who's the “real” victim here? Can you be both harmed and harmful? It just left me with way more questions than answers.\n\nDid it stick with anyone else like that? What parts hit you the hardest?",
        "upvotes": 16,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1m43sck/for_those_whove_seen_baby_reindeer_did_it_change/"
    },
    {
        "id": "1m4ct0m",
        "author": "Ok_Profit4705",
        "title": "Best rainy Saturday night movies?",
        "content": "Horror and thriller are ideal! We’re settling in for a long night/early morning marathon with all the movie snacks soon. Best movies or shows for a rainy Saturday? We love horror of any kind. Love mountain, woods, or beach settings but not picky! ",
        "upvotes": 4,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m4ct0m/best_rainy_saturday_night_movies/"
    },
    {
        "id": "1m4k4vn",
        "author": "Talavklo",
        "title": "Help with updating payment method.",
        "content": "**Hi everyone,**  \nI’m genuinely losing my mind over this Netflix situation. My credit card expired this month, so I went to update it with my new one. That part works fine, *great*. But then it asks me to verify my phone number by sending a confirmation code… and here’s where things go completely off the rails.\n\nFor some reason, I *cannot* change the country prefix. It’s stuck on Ecuador, even though I live in Austria and the number saved in my account is my *Austrian* number. No idea how or why Ecuador got involved here, or why I can’t switch it.\n\nObviously, I’m frustrated. I’ve tried contacting customer service, but no luck so far. My payment is due *tomorrow*, and I really don’t want to lose my subscription. I use Netflix all the time. But at this point, I honestly don’t know what else to do.\n\nHas anyone dealt with this kind of issue and managed to fix it? Any advice would be massively appreciated.\n\nThanks in advance!",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m4k4vn/help_with_updating_payment_method/"
    },
    {
        "id": "1m4fxpe",
        "author": "rollitodcanela_",
        "title": "when a show has a documentary what do u watch first?",
        "content": "I've been meaning to watch the new Spanish show \"Superstar\" based on the life of Tamara, an early 2000's Spanish Icon. But I saw that Netflix released a documentary on her life \"I'm Still a Superstar\" at the same time... I don't know what to watch first.\n\nThis is sort of a Netflix trend. Like the Menéndez Brothers Show and the doc coming out the same year. Or the other way around with the doc show \"This is the Zodiac Speaking\" and adding Fincher's \"Zodiac\" to the platform around a similar time. \n\nI'm curious for the doc watchers out there which way do you go?? ",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1m4fxpe/when_a_show_has_a_documentary_what_do_u_watch/"
    },
    {
        "id": "1m4fwej",
        "author": "FlowCon",
        "title": "am i the only one this happens to?",
        "content": "I’ll put on a show I binged when I go to sleep - typically a small rotation of series - but it’ll get to a point where instead of playing an episode start to finish and then starting the next episode it will just run the episode plus the entirety of the credits in different languages.\n\nThen when i go to hit “watch next episode” or what have you when I come back to it, it just plays that same previous episode and does the credits thing all over again.\n\nA couple of things have temporarily fixed this but for the most part it’s been recurring for the majority of this year.\n\nhow do I fix this??\n\nalso this is happened for \nBreaking Bad / Better Call Saul / Your Honor / Squid Games / and Ozark in case anybody asks",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1m4fwej/am_i_the_only_one_this_happens_to/"
    },
    {
        "id": "1m43pvr",
        "author": "Exotic-Pepper-2527",
        "title": "Tv show recommendations",
        "content": "Please give me some suggestions \nI liked :\nSons of anarchy \nPower\nBetter caul Saul \nOzark \nMosquito coast\nAnimal kingdom \n\nI like gangster/ mob family crime shows ",
        "upvotes": 7,
        "comments": 24,
        "media": null,
        "permalink": "/r/netflix/comments/1m43pvr/tv_show_recommendations/"
    },
    {
        "id": "1m4pssx",
        "author": "Lazy_wolflady343",
        "title": "PLEASE TELL ME IM NOT THE ONLY ONE WHO MOTICED",
        "content": "Ok so we know at the beginning when we hear and see little Rumi sining\n\nWe are hunters voices strong\nSlaying demons with our song\nFix the world and make it right\nWhen darkness finally meets the light\n\nRight? Okay so if you listen throughout the movie when things get intense with Rumi you can hear the song playing in the background, with words and maybe without. One big scene is when Rumi goes to Celine and she has her emotional breakdown. Listen and you can hear it.\n\nPlease tell me im not the only 🙏 \n",
        "upvotes": 0,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/3v4qicyod1ef1/DASH_720.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1m4pssx/please_tell_me_im_not_the_only_one_who_moticed/"
    }
]