[
    {
        "id": "mxm3re",
        "author": "N3DSdude",
        "title": "/r/Netflix Discord Server",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "upvotes": 474,
        "comments": 249,
        "media": null,
        "permalink": "/r/netflix/comments/mxm3re/rnetflix_discord_server/"
    },
    {
        "id": "1gqkqem",
        "author": "Atlast_2091",
        "title": "The Night Agent: Season 2 | Official Teaser | Netflix",
        "content": "",
        "upvotes": 41,
        "comments": 16,
        "media": null,
        "permalink": "/r/netflix/comments/1gqkqem/the_night_agent_season_2_official_teaser_netflix/"
    },
    {
        "id": "1gqjzs3",
        "author": "ALVARO39YT",
        "title": "A 70-Million-User Success: Netflix's Ad-Supported Plan Pays Off",
        "content": "",
        "upvotes": 21,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1gqjzs3/a_70millionuser_success_netflixs_adsupported_plan/"
    },
    {
        "id": "1gqrshh",
        "author": "Alan_Stamm",
        "title": "'The Lost Children:' Extraordinary story of four missing kids in Colombian rainforest [3-star review]",
        "content": "",
        "upvotes": 4,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gqrshh/the_lost_children_extraordinary_story_of_four/"
    },
    {
        "id": "1gqq2ao",
        "author": "iPhone13pm",
        "title": "Carry-On | Official Trailer | Netflix",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gqq2ao/carryon_official_trailer_netflix/"
    },
    {
        "id": "1gqqd1y",
        "author": "Promax1127",
        "title": "How do I fix this problem ",
        "content": "So I let my friend borrow my account, and when I watch a show it doesn’t save my progress on what part I was in the show, but it does for him. How can I possibly fix this?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gqqd1y/how_do_i_fix_this_problem/"
    },
    {
        "id": "1gpynmr",
        "author": "opheliasdinosaur",
        "title": "Stop first season cliffhangers",
        "content": "Is anyone else ever really frustrated with a good, unique first series that ends on a cliff hanger and then gets cancelled because it didn't hit the top 5 viewing figures in week 1 or 2?\n\nNetflix needs to stop this crap. Either have a rule that all first seasons have a closed story arc or give shows time to build viewership.\n\nGood example - dead boy detectives = I'm devastated there's no season 2, but it was a closed arc, all major ploy points resolved and I don't feel that netflix stole 8 hours of my life.\n\nBad example - the midnight club, or a whole bunch of others that I had on a watch list and then removed when I found out they were cancelled but left on a cliff hanger. I have no incentive to watch them now. \n\nAt least where there is a closed arc, I may still go and watch a cancelled show.\n\nDoes anyone else feel like this?",
        "upvotes": 92,
        "comments": 62,
        "media": null,
        "permalink": "/r/netflix/comments/1gpynmr/stop_first_season_cliffhangers/"
    },
    {
        "id": "1gqr836",
        "author": "West-Weakness-753",
        "title": "Is Standard with ads worth it? Looking for specific shows!",
        "content": "I'm going to be getting netflix again, but after reading that there are limited movies and TV shows, I'm really unsure if what I want to watch will be available. \nI'm wanting to watch The 100, Breaking Bad, The Haunting of Hill House, and Shameless. There's a bunch more, but I can't think of them! \nCan anyone tell me if these are available? And possibly let me know of some good movies or shows that won't be available so I'm prepared? I've tried researching, but literally every result had a different answer. \nPlease spam me with any information! ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gqr836/is_standard_with_ads_worth_it_looking_for/"
    },
    {
        "id": "1gq7a6x",
        "author": "LetterheadFun3697",
        "title": "'Avatar: The Last Airbender' Season 2 Finds Its Joo Dee, Long Feng, The Boulder and Casts 'Sympathizer' Star Hoa Xuande",
        "content": "",
        "upvotes": 17,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1gq7a6x/avatar_the_last_airbender_season_2_finds_its_joo/"
    },
    {
        "id": "1gqn6o6",
        "author": "antoinefbm",
        "title": "Looking for a specific Netflix show from around 2019",
        "content": "I've been looking for a show I had watched at this time but can't remember the name. The main character was a girl and she lived in this poor city under better one that was over a cliff. there was also a sand tornado I think that broke a lot of things in the poor city. to get to the better place, people had to do challenges in a sort of closed building. at the end after the girl wins there's a plot twist which is that to get to that better place, people must get sterilized. ",
        "upvotes": 1,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gqn6o6/looking_for_a_specific_netflix_show_from_around/"
    },
    {
        "id": "1gqmre9",
        "author": "Mawzipan_",
        "title": "Help finding a show ",
        "content": "Hey all, I recently remembered a show from Netflix and I can not remember what it's called. I watched it a while back. Briefly what I remember is a tomboy ish girl who lives in like a weird house/bunker thing with her parents and I think they were dommsdayers ? She meets some other girl and they try to befriend each other. At some point in the show the girl goes to some meeting and finds out her mother never hugged her/ did the skin to skin contact move with her after birth and thinks that's why she is the way she is. Some of this may be wrong but it's driving me crazy. If anyone knows what this could be plz lmk ! Thanks in Advance ! ",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gqmre9/help_finding_a_show/"
    },
    {
        "id": "1gpxwsn",
        "author": "D01211",
        "title": "Netflix offers lower quality  for extra members ",
        "content": "I’ve noticed that 4K isn’t available on my account that has been invited as an extra member to a 4K account. Looks like Netflix lowers the quality on the extra account if you purchased the plan with ads even if the main account is 4K. This isn’t communicated anywhere on the website as the website clearly says:\n\nThe same video and audio quality as the member who invited them.\n\nI asked the customer service and apparently you have to contact them in order to find out that the plan you’ve purchased is different to what Netflix advertises. ",
        "upvotes": 51,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1gpxwsn/netflix_offers_lower_quality_for_extra_members/"
    },
    {
        "id": "1gqk51v",
        "author": "Separate_Ad_9223",
        "title": "Quick question ",
        "content": "So my friends and I want to watch the Paul vs Tyson fight at my house and I do not have a Netflix account but one of my friends does. \n\nIs it possible for him to log into his Netflix account for the day at my house so we can watch it here? I’ve heard you can use your Netflix account on vacation so I thought this plan might work.\n\nWe are located in Canada btw I’m not sure if that makes a difference atall.\n\nThanks in advance everyone!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1gqk51v/quick_question/"
    },
    {
        "id": "1gqjssh",
        "author": "Hunbjor",
        "title": "Subtitles read differently than actual dialogue ",
        "content": "Long story short, I suffer from a neurological disorder, specifically inattentive ADHD and High-Functioning Autism, so I usually keep subtitles on no matter what language I am watching in. Recently, I noticed subtitles are completely different from what is actually being said on screen. Anybody else?",
        "upvotes": 1,
        "comments": 14,
        "media": null,
        "permalink": "/r/netflix/comments/1gqjssh/subtitles_read_differently_than_actual_dialogue/"
    },
    {
        "id": "1gqjftm",
        "author": "QarzImperiusrealLoL",
        "title": "Are there any legal downloads for the app on Android aside from the play store?",
        "content": "I have a quite wierd issue. I had family link for a long time, my mom blocked some apps during this time and one of them was Netflix. At the time i didn't bother as we didn't have a subscription or an account. However recently i turned 15 and the family link restrictions were completely removed, however, Netflix is still blocked on my Play Store and says \"app blocked by a parent\". All other blocked apps automatically returned except Netflix. My mom doesn't have access to parental controls anymore. This creates a problem for me as we have recently purchased a subscription. So because of this i ask, are there any legal apk type downloads that i can put our account into. Thanks im advance.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gqjftm/are_there_any_legal_downloads_for_the_app_on/"
    },
    {
        "id": "1gpas31",
        "author": "Kamala_lost",
        "title": "Enough Mark Wahlberg!",
        "content": "He plays the same character in every movie! He's not that charasmatic and in my opinion can't carry a movie alone. He's fine in something like The Departed. He must have one hell of an agent - he is the star in half the movies on Netflix. \n\nAlso, Chris Pratt is not a good voice actor. I wanted to watch the new Garfield movie but can't tolerate his voice acting. \n\nBoth Wahlberg and Pratt are better off in ensemble casts - they're not interesting enough on their own.  ",
        "upvotes": 685,
        "comments": 178,
        "media": null,
        "permalink": "/r/netflix/comments/1gpas31/enough_mark_wahlberg/"
    },
    {
        "id": "1gq8a05",
        "author": "Historical-Pizza6330",
        "title": "Need some help",
        "content": "\n\nHey everyone, I’m having a frustrating issue with Netflix and hoping someone here can help. Whenever I try to watch certain shows or movies \"mostly happens using the netflix app\", instead of giving me the “Play” option, it just says “Remind Me.” I’m unable to watch anything I want because it keeps showing this button, even on shows I’ve watched before. I’ve tried logging out and back in, restarting my device, and even uninstalling and reinstalling the app, but nothing seems to fix it. It happens across multiple devices, so I don’t think it’s a problem with just one. Has anyone experienced this, or does anyone know what’s causing it and how to fix it? Any advice would be greatly appreciated – I just want to be able to watch my shows again! Thanks in advance!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gq8a05/need_some_help/"
    },
    {
        "id": "1gqa4x1",
        "author": "sidroy81",
        "title": "Dibakar Banerjee's stalled film Tees premieres at DIFF to rousing reception: Here's why Netflix India isn't releasing it",
        "content": "",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1gqa4x1/dibakar_banerjees_stalled_film_tees_premieres_at/"
    },
    {
        "id": "1gpqr6c",
        "author": "AffectionateBit5872",
        "title": "Why is every new show 6 eps?",
        "content": "The diplomat is my favorite show on Netflix and it's 6 ep run was way to short compared to it's 8 ep first season which also felt to short. As well as the excellent new show Territory was only 6 eps. I was also looking ahead and 2 shows I'm insanely excited for Black Doves and American Primevil are also going to be only 6 eps. It's insane that every few years it feels like they push the ep count lower. Which is extra crazy because they count shows on minutes watched which basically sets new shows up to fail and is the reason we have no new shows.",
        "upvotes": 22,
        "comments": 48,
        "media": null,
        "permalink": "/r/netflix/comments/1gpqr6c/why_is_every_new_show_6_eps/"
    },
    {
        "id": "1gq9hn3",
        "author": "Last_Day_2282",
        "title": "Help me find this show. ",
        "content": "I’ve been driving myself absolutely insane over this. \nSo, back in 2017ish, 2015-2018, I watched this show on Netflix. It was a limited series (one season) about a crime/psychological mystery thriller with a detective who was hunting a serial killer. I remember him with brown hair and kind of looked like the actor who plays Kronk? He was friends or became friends with this other middle age man with blonde hair (I see his face so vividly but do NOT know where he’s from). \nI’m pretty sure the “friend” the detective made was actually the father or step father of this girl who was killed by the serial killer. There’s a plot twist at the end that I don’t want to say, but the show was so damn good. \nI think they took it off Netflix, I can’t find it. I think the title was like one word? Something really unexpected idk it might have started with an S. \n\nPLEASE HELP ME IVE BEEN GOOGLING FOR HOURS AND GOT NOTHING",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1gq9hn3/help_me_find_this_show/"
    },
    {
        "id": "1gpx9ea",
        "author": "TheDadThatGrills",
        "title": "The Rise of the Golden Idol (released today- $20) is available as part of your Netflix membership.",
        "content": "Tried posting this to /r/Games but the mods removed it as not being relevant to their sub. Understand that most subscribers sleep on the game portion of their membership, but give this one a serious look if you enjoy murder mysteries. ",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1gpx9ea/the_rise_of_the_golden_idol_released_today_20_is/"
    }
]