[
    {
        "id": "1h3xmgd",
        "author": "AutoModerator",
        "title": "LA PIOLA - friends meetup!",
        "content": "Vuoi conoscere persone? Organizzare una gita in montagna? Un aperitivo in centro? Posta qui e trova altri redditor con i tuoi interessi!\n\nDo you want to meet new people? Grab a beer? Stroll the city with locals? Write here!\n\n# USEFUL GROUPS\n\n[CIBO &amp; TRASH](https://t.me/+K_tQ4Zzi0S80YjFk): Gruppo per condividere la passione del cibo soprattutto quello Trash. Si organizzano e si possono proporre uscite dedicate al cibo e tanto altro.\n\n[LA TAVERNA DELLO STUDENTE](https://t.me/latavernadellostudente/5207): club di serate di giochi da tavolo, giochi di ruolo, magic e altro, ogni venerdì al Comala\n\nAny questions? Your telegram group got blocked by the spam filter? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 1,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/g30QJSClHjRAUvFBqKJa-Re4duFBniS6HkLBoJRdgOQ.jpg?auto=webp&amp;s=2c44cf9a902b77de7dce3b5cad542f22791fb32e"
        },
        "permalink": "/r/torino/comments/1h3xmgd/la_piola_friends_meetup/"
    },
    {
        "id": "1h3xmg1",
        "author": "AutoModerator",
        "title": "BACHECA ANNUNCI - buying, selling, apartment hunting, etc",
        "content": "Posta qui ogni annuncio di compravendita (biglietti di concerti, affitti, la qualunque). Ogni post sul sub a riguardo verrà cancellato e rediretto qua.\n\nPost here all your bulletin board notices: for things you're selling, buying, promoting or apartments you're renting/looking for! Any standalone post will be deleted and redirected here.\n\nTelegram group for apartment hunting: https://t.me/CaseStudentiTorino\n\nAny questions? [Message the moderators](https://www.reddit.com/message/compose?to=/r/torino)!",
        "upvotes": 3,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/q8POE4jCcQQiMrZ2hbEYxzlH3dlB5cdywYViNYK-mKE.jpg?auto=webp&amp;s=ef8b272fb58ecaee50adfb5b416930662b4e8dfa"
        },
        "permalink": "/r/torino/comments/1h3xmg1/bacheca_annunci_buying_selling_apartment_hunting/"
    },
    {
        "id": "1hp1f2g",
        "author": "Manag3r",
        "title": "Furto bici",
        "content": "Salve. Quando si deve lasciare la bici parcheggiata in luogo pubblico, quale pensate sia, per la vostra esperienza, il modo migliore per evitare che venga rubata?",
        "upvotes": 8,
        "comments": 13,
        "media": null,
        "permalink": "/r/torino/comments/1hp1f2g/furto_bici/"
    },
    {
        "id": "1hp408u",
        "author": "wherearemyburritos",
        "title": "IELTS ",
        "content": "Ciao a tutti, spero lei vacanze stiano proseguendo bene.\nCome da titolo sto cercando una struttura/scuola/associazione dove poter fare l'IELTS.\nQualcuno di vuoi potrebbe, nel caso l'avesse fatto, darmi dei consigli? \nGrazie mille ",
        "upvotes": 3,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hp408u/ielts/"
    },
    {
        "id": "1hovy5b",
        "author": "kdb1104",
        "title": "Cinema con film in lingua inglese?",
        "content": "Ciao! Vorrei tanto vedere un film (Noseferatu!) ma preferisco vederlo in inglese (piuttosto che doppiato in italiano).  \n\nCi sono cinema a Torino che proiettano film recenti in lingua originale inglese?\n\nGrazie!  ",
        "upvotes": 6,
        "comments": 6,
        "media": null,
        "permalink": "/r/torino/comments/1hovy5b/cinema_con_film_in_lingua_inglese/"
    },
    {
        "id": "1hp6pdd",
        "author": "Altruistic_Syrup_373",
        "title": "Consigli per un buon brunch a Torino vicino alla fermata FlixBus su Corso Vittorio Emanuele?",
        "content": "Ciao a tutti!\n\nSarò a Torino il 3 gennaio e cerco un posto dove fare un buon brunch vicino alla fermata FlixBus su Corso Vittorio Emanuele II. Sto cercando qualcosa di qualità, ma che non sia troppo caro. Qualcuno ha qualche suggerimento?\n\nGrazie in anticipo! 😊",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hp6pdd/consigli_per_un_buon_brunch_a_torino_vicino_alla/"
    },
    {
        "id": "1hozda7",
        "author": "Eye-Dust",
        "title": "Contenitori alluminio pressofuso",
        "content": "Ciao, per caso conoscete negozi che vendono questo tipo di contenitori?",
        "upvotes": 1,
        "comments": 12,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ehz3jd9jct9e1.jpeg?auto=webp&amp;s=83dfcfd8bdb8feabd925b7f6dab9f1a92a9268d7"
        },
        "permalink": "/r/torino/comments/1hozda7/contenitori_alluminio_pressofuso/"
    },
    {
        "id": "1ho2wsm",
        "author": "Top-Text-7727",
        "title": "Askatasuna è davvero così terribile o è un capro espiatorio?",
        "content": "Il titolo è già esplicativo. Vi chiedo di mantenere un linguaggio rispettoso a priori del colore politico. ",
        "upvotes": 45,
        "comments": 49,
        "media": null,
        "permalink": "/r/torino/comments/1ho2wsm/askatasuna_è_davvero_così_terribile_o_è_un_capro/"
    },
    {
        "id": "1ho7ln7",
        "author": "lordmax10",
        "title": "Oggi Sì Oscuro Signore al Mufant.",
        "content": "",
        "upvotes": 18,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sv3783zgvl9e1.jpeg?auto=webp&amp;s=ada73da1276a695135a484cf424100dee2116fca"
        },
        "permalink": "/r/torino/comments/1ho7ln7/oggi_sì_oscuro_signore_al_mufant/"
    },
    {
        "id": "1ho6w8n",
        "author": "Boring-Painting823",
        "title": "CAPODANNO? ",
        "content": "Ciao! Siamo un piccolo gruppetto di ragazzi e ragazze che come al solito non si sono organizzati per capodanno sottovalutato l'impatto morale che la suddetta disorganizzazione avrebbe creato in questi ultimi giorni di dicembre. Conoscete o sapete di qualche di situazione assurda in cui potremmo infiltrarci all'ultimo? ",
        "upvotes": 5,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1ho6w8n/capodanno/"
    },
    {
        "id": "1ho90tl",
        "author": "Designer_Speech2700",
        "title": "Parrucchiere uomo Pinerolo e dintorni",
        "content": "Sono alla ricerca di un parrucchiere nell’area del pinerolese, in grado di realizzare tagli dal respiro internazionale che non siano l’ormai onnipresente mullet e che sappia proporre tagli ad hoc a seconda della fisionomia del viso del cliente. Consigli?",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1ho90tl/parrucchiere_uomo_pinerolo_e_dintorni/"
    },
    {
        "id": "1ho4dzm",
        "author": "MorrowSky",
        "title": "Buying a yoyo in Torino",
        "content": "G'day everyone, would anyone be able to suggest where one can buy a yoyo in Torino. Was unable to find one in any of the toy stores. \nThanks in advance ",
        "upvotes": 2,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1ho4dzm/buying_a_yoyo_in_torino/"
    },
    {
        "id": "1ho26bz",
        "author": "lordmax10",
        "title": "Al MuFant con Sì, OScuro Signore e i draghi di Andrea Wise",
        "content": "Fà Natale Fantasy  \n  \nOggi e domani al @MuFant  \n  \n  \nhttp://www.comune.torino.it/eventi/calendario/fa-natale-fantasy/\n\n",
        "upvotes": 3,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1ho26bz/al_mufant_con_sì_oscuro_signore_e_i_draghi_di/"
    },
    {
        "id": "1hoimn4",
        "author": "Immediate_Meeting_37",
        "title": "Esperienza Torinese",
        "content": "Ciao ragazzi da anni il mio lavoro mi porta in giro per il mondo, a ciò ho sommato il mio immenso amore per le donne e per l’arte del sesso e l’erotismo in tutte le sue sfaccettature e ovunque vada diciamo che mi piace amare al meglio le donne locali.\nGrazia vuole che mi capiti a Torino stavolta e dato che in Italia purtroppo non ci metto piede da vari anni chiedo a voi comunità di Reddit i migliori eventi e posti devoti al culto del sesso, come case del piacere o orgie, di solito mi porto a casa ragazze o signore che conosco in giro o alle feste e quindi se sapete consigliarmi qualche evento vi sarei grato, mi hanno parlato anche della red line e puttantour di Torino sapete darmi qualche informazione o dritta a riguardo? Sapete se c’è una suddivisione di aree per la prostituzione ? Ad esempio zona di ragazze del est o africane o trans (così da starci al sicuro) \nStarò un paio di mesi e non voglio perdermi niente \nCome funziona con la legge ? \nGrazie mille.\n",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/torino/comments/1hoimn4/esperienza_torinese/"
    },
    {
        "id": "1ho2gem",
        "author": "pietrino97",
        "title": "Opinioni su Corso Fratelli Rosselli, a Moncalieri (Torino)?",
        "content": "Ciao a tutti, sto valutando l'affitto ad un prezzo davvero vantaggioso di un bilocale in Corso Fratelli Rosselli, proprio all'inizio di Via Ventimiglia.\nNon essendo di Torino, come è la zona? Sarei automunito, è sicuro lasciare la macchina parcheggiata in strada? Lavorerò a Moncalieri, quindi sarebbe comodo sia come distanza dal lavoro sia dal centro città e dai mezzi avendo vicino il capolinea della metro... Grazie!!",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1ho2gem/opinioni_su_corso_fratelli_rosselli_a_moncalieri/"
    },
    {
        "id": "1hnoqeq",
        "author": "itslilou",
        "title": "Cosa fanno i torinesi per Capodanno?",
        "content": "Ciao! Sono nuova a Torino e non sono sicura di cosa fare il 31. Probabilmente sarò con un amico, ma anche lui è nuovo qui, quindi siamo entrambi all'oscuro. Ci sono fuochi d'artificio, la gente esce in una certa parte della città, ci sono feste?\nGrazie!",
        "upvotes": 7,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1hnoqeq/cosa_fanno_i_torinesi_per_capodanno/"
    },
    {
        "id": "1hnlavg",
        "author": "No_Rich_6596",
        "title": "Università di Torino:  dipartimento di Giurisprudenza ",
        "content": "Frequento a distanza il corso  Global Law. L'11 Gennaio devo partecipare a due lezioni in aula B2 e A4 e non avedo mai messo piede nella sede universitaria ho paura di perdermi e non riuscire a partecipare alle lezioni. Qualche consiglio su come arrivare alla sede e poi alle aule senza perdermi ? Ps: ho pensato di contattare qualche compagno di corso ma essendo che non conosco nessuno la cosa è abbastanza difficile. \n\nSe conoscete qualcuno che frequenta mandatemi un messaggio cosi magari non diventerà una giornata da incubo.\n\nPs: Grazie in anticipo.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1hnlavg/università_di_torino_dipartimento_di/"
    },
    {
        "id": "1hnjxz9",
        "author": "pietrino97",
        "title": "Palestra a Torino zona Lingotto/Palazzo del Lavoro?",
        "content": "Ciao a tutti, sto valutando un bilocale in zona Palazzo del Lavoro, a Torino, a sud del Lingotto.\nCi sono delle palestre con sala pesi in zona? Da Google Maps non trovo granché... vorrei allenarmi😅 Grazie!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hnjxz9/palestra_a_torino_zona_lingottopalazzo_del_lavoro/"
    },
    {
        "id": "1hncm85",
        "author": "pietrino97",
        "title": "Opinioni su Corso Dante a Moncalieri (Torino)?",
        "content": "Ciao a tutti, presto vedrò un bilocale in affitto su Corso Dante, a Moncalieri (Torino), poco a sud del capolinea della metro Bengasi. Cosa ne pensate della zona? È sicuro lasciare la macchina parcheggiata in strada? Non conosco Torino, non so esattamente se sia una zona/via sicura o no.\n\nE domanda sconnessa, ci sono palestre con sala pesi nei dintorni? Da Google Maps non appare granché... grazie!",
        "upvotes": 3,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1hncm85/opinioni_su_corso_dante_a_moncalieri_torino/"
    },
    {
        "id": "1hnj281",
        "author": "Mithra8989",
        "title": "Help cucina etnica/asiatica",
        "content": "Ciao torinesi\n\ncome da titolo, avrei bisogno di un paio di suggerimenti su dove reperire certi ingredienti.\n\nDove posso trovare ingredienti legati principalmente alla cucina giapponese? (es.  katsuobushi/mirin/alghe kombu essiccate).\n\nHo girato alcuni posti che ruotano intorno a Porta Palazzo, ma non sono riuscito a soddisfare le mie ricerche.\n\nQualcuno mi sa indicare qualche negozio dedicato?\n\nGrazie",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1hnj281/help_cucina_etnicaasiatica/"
    },
    {
        "id": "1hni27n",
        "author": "LilBed023",
        "title": "Vintage mechanic/racer suit",
        "content": "Hello everyone, I’m currently in Turin and looking to buy a vintage mechanic or racer suit. Are there any stores that might sell those? Thanks in advance!",
        "upvotes": 1,
        "comments": 1,
        "media": null,
        "permalink": "/r/torino/comments/1hni27n/vintage_mechanicracer_suit/"
    },
    {
        "id": "1hncnza",
        "author": "Few_Anywhere_2095",
        "title": "Serata all'Audiodrome 28/12",
        "content": "Ciao a tutti, mi chiamo Matteo e sono appassionato di techno ma non ho amici che condividano questa mia passione, per cui non sono neanche molto esperto della scena torinese. Ho visto che c'è una serata domani sera 28/12 all'Audiodrome di Moncalieri a cui mi piacerebbe andare e sarebbe bello trovare compagnia con cui condividere l'esperienza :) O anche ad altre serate in altri posti e giorni, sarò qui fino al 10 gennaio\n\nAlcune mie generalità  \nHo 25 anni e sono nato e abito a Pinerolo, al momento sto facendo servizio civile all'estero ma sono a casa per le vacanze di natale (e mi annoio un po' francamente)  \nSono molto tranquillo e alla buona e mi piace conoscere persone\n\nLooking forward to hear from you\n\nedit: chiaramente sono molto aperto anche a info e opinioni sul club dato che non ci sono mai andato grazie!",
        "upvotes": 0,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1hncnza/serata_allaudiodrome_2812/"
    },
    {
        "id": "1hnc62i",
        "author": "No-Disaster-2966",
        "title": "Nutrizionista sportivo a Torino",
        "content": "Ciao a tutti! Sono un pugile agonistico e mi sono trasferito da qualche mese a Torino.\nIl prossimo anno vorrei combattere e mi servirà l'aiuto di un nutrizionista nelle varie fasi della stagione agonistica, quindi che sia in grado di farmi diete adeguate e misurazioni della composizione corporea. Avete qualche nome valido da suggerirmi? Grazie a tutti.",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/torino/comments/1hnc62i/nutrizionista_sportivo_a_torino/"
    },
    {
        "id": "1hmv3ad",
        "author": "_gitza",
        "title": "Appello agli appassionati Nintendo",
        "content": "Buonasera redditors, tra di voi sicuramente c’è qualche esperto di Nintendo a cui chiedo assistenza. \nPossiedo un Nintendo DSi XL e vorrei acquistare un R4 compatibile. C’è qualche negozio a Torino che le vende o sapete come posso muovermi per trovarne una?\nVi ringrazio! ",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/torino/comments/1hmv3ad/appello_agli_appassionati_nintendo/"
    },
    {
        "id": "1hmyjgf",
        "author": "Altruistic_Syrup_373",
        "title": "Torrefazione Ferrucci a Torino",
        "content": "Ciao a tutti!\n\nQualcuno conosce il locale \" Bar Torrefazione Ferrucci\" a Torino? Sto cercando informazioni sui prezzi, gli orari di apertura e la qualità del posto. \nMi interessa in particolare perché sembra non essere troppo lontano dalla fermata FlixBus. Qualsiasi consiglio o recensione è super apprezzato. Grazie in anticipo!",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/torino/comments/1hmyjgf/torrefazione_ferrucci_a_torino/"
    },
    {
        "id": "1hmwmhf",
        "author": "sturmfrey",
        "title": "gtt card for train and bus?",
        "content": "hello. I'm a student that recently came to Turin and I need to get a GTT card bc I use the tram and bus everyday.\n\nI wanted to apply online but don't know which subscription to choose.\nShould I choose the annual subscription under 26 or the multi monthly in formula area?\n\nBc the annual subscription mentions trains and trams but excludes sub urban buses? \nor did i misunderstand? \n\nIf I take that, how do I access bus services? I'm just really lost and confused. ",
        "upvotes": 1,
        "comments": 7,
        "media": null,
        "permalink": "/r/torino/comments/1hmwmhf/gtt_card_for_train_and_bus/"
    },
    {
        "id": "1hm8l5c",
        "author": "thep3Dr0",
        "title": "Argentino a Torino in cerca di opportunità per lavorare e imparare: tanta voglia di crescere!",
        "content": "Ciao a tutti e buone feste! Sono un argentino arrivato a Torino un mese fa. Vorrei trovare un lavoro per entrare in contatto con persone del posto e imparare la lingua il più rapidamente possibile. Ho conoscenze di informatica, ma non ho problemi ad apprendere compiti di qualsiasi tipo. Sono una persona che ama imparare, con molta voglia di lavorare e andare avanti.\n\nDispongo della ricevuta del permesso di soggiorno. Se ti interessa conoscere un'altra cultura o conosci qualcuno che abbia bisogno di assumere qualcuno, non esitare a scrivermi in privato, mi sarebbe di grande aiuto. Grazie mille!\n\n",
        "upvotes": 9,
        "comments": 0,
        "media": null,
        "permalink": "/r/torino/comments/1hm8l5c/argentino_a_torino_in_cerca_di_opportunità_per/"
    },
    {
        "id": "1hmc4tm",
        "author": "gigf_74",
        "title": "Eventi/feste per capodanno?",
        "content": "Qualcuno conosce degli eventi/feste a cui partecipare a capodanno? Mi sono trovato senza nessun piano e non ho voglia di passarlo a casa, quindi mi chiedevo se qualcuno potesse aiutarmi.\nPossibilmente non la solita disco solo",
        "upvotes": 2,
        "comments": 9,
        "media": null,
        "permalink": "/r/torino/comments/1hmc4tm/eventifeste_per_capodanno/"
    },
    {
        "id": "1hml1x2",
        "author": "LudWitt98",
        "title": "Is there any open supermarket today?",
        "content": "",
        "upvotes": 0,
        "comments": 10,
        "media": null,
        "permalink": "/r/torino/comments/1hml1x2/is_there_any_open_supermarket_today/"
    },
    {
        "id": "1hm8l7z",
        "author": "pietrino97",
        "title": "Trasferimento a Torino - Come fare col parcheggio?",
        "content": "Ciao a tutti, tra meno di due mesi mi trasferirò a Torino, e lavorando poco fuori città avrò bisogno della macchina (Moncalieri), pertanto dovrò portarla in città.\nAncora non ho trovato casa, pertanto non ho un domicilio, né tantomeno la residenza, ma ovviamente soprattutto nel primo periodo dove trovo casa, la prendo.\nPosso sapere come mi consigliate di fare per il parcheggio indipendentemente dalla zona in cui troverò casa? Mi spiego, è possibile fare abbonamenti da esibire sul cruscotto qualora lasciassi la macchina in un posteggio blu senza dover pagare quei 1,70€/h? Ci sono parcheggi gratuiti o posti auto gratuiti lungo le vie anche del centro? O in generale, si trovano? Oppure la possibilità di fare abbonamenti per parcheggi al coperto/aperto o lungo le vie senza spendere un occhio della testa? Tra l'altro, l'auto sarà a nome di mia mamma essendo sua, va bene lo stesso? In zona Lingotto, ci sono parcheggi gratuiti? Se ne trovano? Non ci capisco nulla, sono DISPERATO e il sito di GTT devo dire non aiuta moltissimo😅\n\nCi saranno poi giorni in cui farò smart working e quindi non mi servirà l'auto, ma ecco non essendo abituato ad una realtà cittadina grande come Torino per quanto riguarda i parcheggi, vorrei capire come gestirmi la cosa. Accetto tutti i consigli che avete da darmi.",
        "upvotes": 3,
        "comments": 37,
        "media": null,
        "permalink": "/r/torino/comments/1hm8l7z/trasferimento_a_torino_come_fare_col_parcheggio/"
    },
    {
        "id": "1hlf3jb",
        "author": "SteamPaz",
        "title": "Sunset - 13/10/2024, 19:03",
        "content": "",
        "upvotes": 106,
        "comments": 6,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0iaou2ta8t8e1.jpeg?auto=webp&amp;s=6f6460c288dc0d161eace761cb66e6425de3fdf1"
        },
        "permalink": "/r/torino/comments/1hlf3jb/sunset_13102024_1903/"
    },
    {
        "id": "1hlxkv8",
        "author": "Zero3993",
        "title": "Parcheggio Natale",
        "content": "Per caso oggi (25 dicembre) il parcheggio blu zona Bernini si paga ?\nAl solito i siti di regione e GTT sono di un livello di informazione infimo",
        "upvotes": 2,
        "comments": 4,
        "media": null,
        "permalink": "/r/torino/comments/1hlxkv8/parcheggio_natale/"
    }
]