[
    {
        "id": "1j9jo6x",
        "author": "LooneyTunesAMA",
        "title": "Hey /r/movies! I'm Eric Bauza, the voice behind your favorite Looney Tunes legends! Our new movie 'The Day the Earth Blew Up: A Looney Tunes Movie' hits theatres this Friday! I've also voiced characters from TMNT, Batman, Puss In Boots, The Muppets, The Fairly OddParents, and more. AMA!",
        "content": "",
        "upvotes": 188,
        "comments": 80,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/dw8hu3jhc9oe1.png?auto=webp&amp;s=875d952bd20172880bdbcefd3e4df280d09da1fb"
        },
        "permalink": "/r/movies/comments/1j9jo6x/hey_rmovies_im_eric_bauza_the_voice_behind_your/"
    },
    {
        "id": "1j8e1wm",
        "author": "novocainemovie",
        "title": "Hi, I’m Jack Quaid, from the upcoming movie NOVOCAINE and you might also know me as one of The Boys. AMA!",
        "content": "Hey Reddit! Jack Quaid here.\n\nYou’ve seen me as Hughie from “The Boys,” Richie from ‘Scream’ and most recently Josh from ‘Companion.’\n\nI’m excited to chat with you guys about my new movie ‘Novocaine’ where I play Nathan Caine, who feels no pain and goes on a batshit insane journey for love.\n\nIt’s hilarious, it’s gory, it’s somehow… romantic? There’s tons of bonkers fight scenes and it’s just an overall good time – can’t wait for you guys to check it out in theaters this weekend.\n\nI’ll be back on March 12 at 12:30pm ET / 9:30am PT to answer your questions!\n\nhttps://preview.redd.it/gfb67mkrfyne1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=240208d607cf45ed78b7687ebeff4b3ecbc096e0\n\n",
        "upvotes": 1417,
        "comments": 918,
        "media": null,
        "permalink": "/r/movies/comments/1j8e1wm/hi_im_jack_quaid_from_the_upcoming_movie/"
    },
    {
        "id": "1j9668o",
        "author": "MarvelsGrantMan136",
        "title": "Gene Winfield Dies: Custom Car Designer For ‘Blade Runner’, ‘RoboCop’, ‘Star Trek’ &amp; More Was 97",
        "content": "",
        "upvotes": 3768,
        "comments": 65,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/kUYWEhtlrYUjhl2MCBLiAW0u9Xyn0_kiy-Nw5JwOUdE.jpg?auto=webp&amp;s=74deb824fc367292e2d0aa37625269566c4127d0"
        },
        "permalink": "/r/movies/comments/1j9668o/gene_winfield_dies_custom_car_designer_for_blade/"
    },
    {
        "id": "1j9m4qi",
        "author": "ggroover97",
        "title": "‘This Is Spinal Tap’ Sequel Lands at Bleecker Street for September Release",
        "content": "",
        "upvotes": 247,
        "comments": 64,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3tk3m2Wb4rrAWl3EEwIAR4LXVE-jQRTHudYUkQBbbe8.jpg?auto=webp&amp;s=a04db2e98ef7cd73e1d36f672195b71ef79030de"
        },
        "permalink": "/r/movies/comments/1j9m4qi/this_is_spinal_tap_sequel_lands_at_bleecker/"
    },
    {
        "id": "1j9fju4",
        "author": "gilette_bayonete",
        "title": "The most disturbing movie death that comes to mind",
        "content": "Definitely Mellish from Saving Private Ryan. I love how it's silent for a few moments then the Germans shoot back through the wall, hitting the other GI in the neck. \n\nOne sticks his head out and Mellish drops him but the rifle goes empty so he rushes the last German. It's a scrappy, dirty fight which seems to last FOREVER, while the GI is still laying there bleeding to death. It breaks my heart hearing Mellish calling out for Rieben, who had been busy taking out the 20mm cannon. They're fighting for so long that the GI bleeds out.\n\nMellish did have the upper hand - he was on top with the knife but the German reversed and disarmed him. Then it was over for Mellish. I like that they showed humanity and that the German didn't take pleasure in stabbing Mellish.\n\nIt's actually a very accurate portrayal as well - The Fallschirmjager, German paratroopers actually held the most hand-to-hand combat victories in all of WW2. You can tell by his camouflage he's not regular German infantry. ",
        "upvotes": 692,
        "comments": 1311,
        "media": null,
        "permalink": "/r/movies/comments/1j9fju4/the_most_disturbing_movie_death_that_comes_to_mind/"
    },
    {
        "id": "1j8wplr",
        "author": "OkyouSay",
        "title": "‘Robots’ at 20 – This kids’ movie was weirdly prophetic about 2025",
        "content": "",
        "upvotes": 5743,
        "comments": 251,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/HOiz9OXdxXiiG43f3dTQfq-kkN0570BWMRGPqQZ34ak.jpg?auto=webp&amp;s=3af99e111429182dc3abf2b10adae8b0d90bb744"
        },
        "permalink": "/r/movies/comments/1j8wplr/robots_at_20_this_kids_movie_was_weirdly/"
    },
    {
        "id": "1j9m2cu",
        "author": "Melanismdotcom",
        "title": "Spinal Tap II Teaser",
        "content": "",
        "upvotes": 87,
        "comments": 28,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/3hSZNXInLitTR_TxHvPvZinOiO5GY70iW5rZjbMUGWo.jpg?auto=webp&amp;s=e7ce7596e85901a7f6f6cc587ab71623d023f58d"
        },
        "permalink": "/r/movies/comments/1j9m2cu/spinal_tap_ii_teaser/"
    },
    {
        "id": "1j8voqx",
        "author": "MarvelsGrantMan136",
        "title": "Hayao Miyazaki's 'Princess Mononoke' is Getting a New 4K Restoration Released Exclusively in IMAX on March 26 - Official Trailer",
        "content": "",
        "upvotes": 4511,
        "comments": 209,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/GZmaDFpiq4ytLR-o3snmfEY7176IHEL7ny5nRQcN6-w.jpg?auto=webp&amp;s=061994e833ea739faea1ff6c7811594808eb6de1"
        },
        "permalink": "/r/movies/comments/1j8voqx/hayao_miyazakis_princess_mononoke_is_getting_a/"
    },
    {
        "id": "1j8rpx1",
        "author": "MarvelsGrantMan136",
        "title": "First Images from 'Deep Cover' Starring Bryce Dallas Howard, Orlando Bloom &amp; Nick Mohammed - Three improv actors are hired by the police to help stage low-level stings. Their instinct to ‘always say yes’ without breaking character leads them deep inside the London criminal underworld.",
        "content": "",
        "upvotes": 7886,
        "comments": 550,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/xicgz3vdj2oe1.jpeg?auto=webp&amp;s=ee2f76e1f40118dea14042bcc1222542fca71ffa"
        },
        "permalink": "/r/movies/comments/1j8rpx1/first_images_from_deep_cover_starring_bryce/"
    },
    {
        "id": "1j8y1yq",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for 'The Luckiest Man in America' Starring Paul Walter Houser - Depicts the 1984 scandal orchestrated by Michael Larson when he appeared on and won the game show Press Your Luck",
        "content": "",
        "upvotes": 3058,
        "comments": 582,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/qb6zdymzt3oe1.jpeg?auto=webp&amp;s=47d53c93a39d1159c1740cb1c101eb775a5642c2"
        },
        "permalink": "/r/movies/comments/1j8y1yq/official_poster_for_the_luckiest_man_in_america/"
    },
    {
        "id": "1j9negr",
        "author": "MarvelsGrantMan136",
        "title": "Lilo &amp; Stitch | Official Trailer | In Theaters May 23",
        "content": "",
        "upvotes": 58,
        "comments": 60,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/aJrbdPC-XzpDFrr-lsp1lDxxodXnV5hQI1wjfOurzpE.jpg?auto=webp&amp;s=9aff1b955027bbefbe9c2b5dc876395d68391e2e"
        },
        "permalink": "/r/movies/comments/1j9negr/lilo_stitch_official_trailer_in_theaters_may_23/"
    },
    {
        "id": "1j9jpex",
        "author": "TunaMeltEnjoyer",
        "title": "Movies that you could just listen to/enjoy as a blind person?",
        "content": "I've long argued that one of the reasons Star Wars (1977) is one of my favorite films is because it works as an radioplay. If you listen to it like a podcast, with no visuals, it is still fantastic. At presenting what's happening at the time effortlessly, but also it's soundtrack and sound design are second to none.\n\n\n\nWhat other films do you think this could be applicable to?",
        "upvotes": 75,
        "comments": 101,
        "media": null,
        "permalink": "/r/movies/comments/1j9jpex/movies_that_you_could_just_listen_toenjoy_as_a/"
    },
    {
        "id": "1j9i1pn",
        "author": "TJ_Fox",
        "title": "\"The Rule of Jenny Pen\" - truly disturbing New Zealand psychological horror movie starring Geoffrey Rush and John Lithgow, now playing.",
        "content": "This movie is headed to Shudder soon, but for those who prefer the cinema experience, I recommend catching it while you can. \n\nGeoffrey Rush plays the high-handed, pompous Judge Stefan Mortensen, who suffers a massive and debilitating stroke while sentencing a pedophile to 16 years in prison (and then berating the children's mother for putting them in harm's way). Highly intelligent but moralistic and arrogant, Mortensen's life changes forever in that moment, and he finds himself installed as a resident in a nursing home, largely confined to a wheelchair and suddenly suffering all the indignities of dependence.\n\nMaking matters much worse are the tag team of fellow patient/inmate Dave Crealy (John Lithgow) and his therapy puppet/avatar, an eyeless baby doll named Jenny Pen. Crealy used to work at the nursing home and uses his intimate knowledge of the system (and keen mind plus relatively superior strength and spryness) to covertly terrorize the other residents, forcing them into his sadistic games while role-playing as a harmless dementia patient whenever the staff are around. \n\nThe scene is set for an epic battle of wills and wits pitting the increasingly feeble Judge Mortensen against the seemingly unstoppable Crealy.\n\nBased on a short story by New Zealand author Owen Marshall, *The Rule of Jenny Pen* is seriously creepy, unsettling stuff, masterfully acted by Lithgow and Rush. Worth seeing!",
        "upvotes": 79,
        "comments": 7,
        "media": null,
        "permalink": "/r/movies/comments/1j9i1pn/the_rule_of_jenny_pen_truly_disturbing_new/"
    },
    {
        "id": "1j9murn",
        "author": "NeverEat_Pears",
        "title": "Marching Powder has to be worst movie I've seen in the cinema for a long time",
        "content": "Marching Powder, starring Danny Dyer and directed by Nick Love, released in the UK recently. The pair worked on The Football Factory (2004) about football hooliganism which was a commercial and critical success. They also made crime drama The Business, the following year. Love also made The Firm, another film about hooliganism. \n\nThis movie, again about hoolignasm, was seen as a spiritual successor to The Football Factory (TFF) . They put a great trailer together which really convinced me to watch the movie. It was basically Dyer doing his own cockney geezer shtick and I, like many fans, find him very amusing. I respect the fact he's done so well in an industry mired in class disparity and nepotism. \n\nSo, I was convinced to see the movie, in part hoping it was a worthy successor to TFF (wishful thinking) and in a bid to support a lower budget British comedy as I'd like to see more of them in the cinema.\n\nWell, it turns out the trailer had all the best jokes, making the film look like a bombastic romp about Dyer's escapades. The reality of the matter is the film completely pulled its punches and seemed totally confused about its messaging. Thoroughly mismarketed and badly executed. \n\nIt was more of a comedy drama, switching between Dyer's antics and his wife's journey from becoming less of a housewife and taking an art class. The film had real mixed messaging. \n\nHalf the film presented itself as a 'funny' romp following Dyer's antics. The other half seemed to be a melodrama about his mental health issues and his wife's need to regain her identity.\n\nThe film hadn't really been marketed in this way and it's not what I had signed up, I wanted the funny romp. It felt like the film, in a cowardly manner, pulled its punches and tried to make up for the more problematic aspects by throwing on a coat of melodrama and sentimantility. \n\nI found myself checking my watch at all the more dramatic moments which were painful to get through, as the writing was just so poor and it felt so cringey. There's even a Love Actually-esque scene where Dyer and his wife exchange written notes on pads of paper through a restaurant window 🤮. The scenes with Dyer's kid are painful to sit through as well, basically kid says cringey things in an innocent way that a kid usually wouldn't say type of humour. \n\nOn top of this approach, none of the characters appear to learn a thing throughout the movie. So the audience has had to sit through this drama and then there  isn't any character growth.\n\n&gt;!Dyer is back fighting. His wife stays with him, despite the fact the character doesn't have any redeeming qualities and hasn't even tried that hard to change. She stays with him for love but!&lt; I didn't pick up on any chemistry between the leads. So the messaging here that she &gt;!should settle for his behaviour!&lt; is baffling.\n\nAs you'd expect, the humour is the lowest common denominator stuff. Lots of 'shocking' jokes about drugs and sex which feel very dated and easy. To my recollection, the comedy in TFF wasn't anywhere near this crass. Like the writing here is really vulgar. When you get people comparing it to TFF and The Business, that really is an insult to those movies as Marching Powder is just so bad. \n\nI just want to highlight the fact this isn't coming from a prudish mentality on my part. I actually wanted more of the football hooligan side of things and more Dyer's antics. If you're going to make a movie about it, just go for it. Unfortunately, it failed on every level.",
        "upvotes": 35,
        "comments": 33,
        "media": null,
        "permalink": "/r/movies/comments/1j9murn/marching_powder_has_to_be_worst_movie_ive_seen_in/"
    },
    {
        "id": "1j93vfh",
        "author": "girafa",
        "title": "Back in 1993, Lori Petty filmed two days on Demolition Man before being replaced by Sandra Bullock",
        "content": "",
        "upvotes": 783,
        "comments": 216,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/F6AGihc6sjMmnVLm-XWIe0jcP2vPZpBwjOqH2PhZX-c.jpg?auto=webp&amp;s=13353f39561ed11ccd79ec9880d3b36c19dcc81c"
        },
        "permalink": "/r/movies/comments/1j93vfh/back_in_1993_lori_petty_filmed_two_days_on/"
    },
    {
        "id": "1j9lef9",
        "author": "ownselfoh",
        "title": "What's your favorite movie quote from a film you've never watched?",
        "content": "I can go first. I always say \"Hercules, Hercules!\" to reward someone for accomplishing a difficult task. In 30 years, I've never seen The Nutty Professor. Imagine I never will, but that has really stuck with me.\n\nBut then again, how many people quote Scarface without having really sat down to watch it?",
        "upvotes": 39,
        "comments": 74,
        "media": null,
        "permalink": "/r/movies/comments/1j9lef9/whats_your_favorite_movie_quote_from_a_film_youve/"
    },
    {
        "id": "1j9htn6",
        "author": "UnfitDanderer",
        "title": "Movies like Knives Out",
        "content": "So, my wife has loved the first two films in this series and nearly any time we try to watch movies together no she wants us to watch something similar but it’s so hard to find. \nDoes anyone have any recommendations that are at all similar to this series in terms of tone and quality? \nWe eagerly anticipate the third instalment later in 2025.  ",
        "upvotes": 60,
        "comments": 150,
        "media": null,
        "permalink": "/r/movies/comments/1j9htn6/movies_like_knives_out/"
    },
    {
        "id": "1j9dndz",
        "author": "Significant_Slip4030",
        "title": "Dog Day Afternoon 50th Anniversary",
        "content": "Al Pacino talked about Sidney Lumet’s Dog Day Afternoon at the Aero Theater last Tuesday. Lumet’s daughter did a surprise appearance at the screening. Pacino deep dives into the making of the film and reflects on acting brother John Cazale.\n\nHeard the Q&amp;A discussion got pushed a couple times but kudos to Pacino and his team for making it work and rescheduling a date that worked out. \n\nLooked like a fun screening for the audience.",
        "upvotes": 139,
        "comments": 11,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/Qq1arXu2HNVdkBqlNk1p1TltPONkT4Z50Pkd3-oTTPc.jpg?auto=webp&amp;s=12a4f6534b27a5e58545755d5422568279a5d199"
        },
        "permalink": "/r/movies/comments/1j9dndz/dog_day_afternoon_50th_anniversary/"
    },
    {
        "id": "1j8wweu",
        "author": "mcchinly",
        "title": "What’s a movie nobody can convince you is good",
        "content": "Like I’m talking about a movie with critical acclaim everyone tells you it’s an amazing movie and you just do not like it at all or just don’t see the wide appeal no matter how much you’ve watched it or had people tell you how mad you are for not liking it\n\nFor me its hereditary went in to see it in the cinema. It just did nothing for me at all the story I understood what was going on but it just didn’t grip me at all and I just didn’t find it as spooky scary enough to keep me entertained. Said to my friend group I was disappointed and when they all had seen it gave me the “you just didn’t understand what was going on” or I must of been confused when watching it so it wasn’t as good. Honestly I was that disappointed I’ve never watched it again because it’s too long for me to sit through it again and be like yeh this is as disappointing as the first watch. ",
        "upvotes": 1380,
        "comments": 7601,
        "media": null,
        "permalink": "/r/movies/comments/1j8wweu/whats_a_movie_nobody_can_convince_you_is_good/"
    },
    {
        "id": "1j8v55v",
        "author": "LarryKeene",
        "title": "What are your \"10/10 you'll never watch again?\"",
        "content": "Not all great movies have high rewatch value, some due to being plot driven, others because they are simply too nasty or unnerving.\n\nFor me, one was Requiem for a Dream.\n\nHit close to home with a family member who is a recovering meth addict.\n\nI was blown away by it, but I never want to watch it again.\n\nNevertheless, I do recommend everyone to go and see it, especially if you’re a fan of Jared Leto and Jennifer Connelly.",
        "upvotes": 1269,
        "comments": 2425,
        "media": null,
        "permalink": "/r/movies/comments/1j8v55v/what_are_your_1010_youll_never_watch_again/"
    },
    {
        "id": "1j9fmru",
        "author": "Sufficient_Muscle670",
        "title": "The Lost Empire(1984) - This Movie Exists",
        "content": "",
        "upvotes": 54,
        "comments": 16,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/RF9ib0T_nv-qFbS2E0HYuiuPOWccR7GKM6ApfYgMfnk.jpg?auto=webp&amp;s=84db6f0eb64b78e04cb27b23937a6bc9b1ff7821"
        },
        "permalink": "/r/movies/comments/1j9fmru/the_lost_empire1984_this_movie_exists/"
    },
    {
        "id": "1j8vxg7",
        "author": "verissimoallan",
        "title": "Stan Lee’s Tumultuous Final Years to Be Explored in Documentary. Jon Bolerjack filmed hundreds of hours of footage which he says shows bad behavior by those around the Marvel legend. Now he is turning it into a doc, 'Stan Lee: The Final Chapter.'",
        "content": "",
        "upvotes": 962,
        "comments": 70,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/6Zf-y10iSiGmwQSLsSFALYGN8FZAl6OsJ7lY1UwhThU.jpg?auto=webp&amp;s=c441bd4b3d35aedfef1ad53ae112a10d591c8b71"
        },
        "permalink": "/r/movies/comments/1j8vxg7/stan_lees_tumultuous_final_years_to_be_explored/"
    },
    {
        "id": "1j8we6s",
        "author": "MarvelsGrantMan136",
        "title": "Official Poster for the 4K Restoration of Hayao Miyazaki's 'Princess Mononoke', Releasing in IMAX on March 26",
        "content": "",
        "upvotes": 756,
        "comments": 45,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/ilc9ho7qi3oe1.jpeg?auto=webp&amp;s=9bee6563320ae5ed742ac7ef16d34ff0322de1a0"
        },
        "permalink": "/r/movies/comments/1j8we6s/official_poster_for_the_4k_restoration_of_hayao/"
    },
    {
        "id": "1j9jtaz",
        "author": "TheBigChicken444",
        "title": "Is Freaks (1932) worth a watch?",
        "content": "I don’t know much about the movie, really only knowing about it from one scene in the movie, (I’m sure you know which). But that scene alone raises some interesting themes, especially considering the era it was made. It was a time with far less acceptance of minorities and those society deemed ‘different.’”\n\n",
        "upvotes": 18,
        "comments": 32,
        "media": null,
        "permalink": "/r/movies/comments/1j9jtaz/is_freaks_1932_worth_a_watch/"
    },
    {
        "id": "1j9n9b7",
        "author": "Coconut_Scrambled",
        "title": "\"Inception\" world building was too good to use in just one movie",
        "content": "Majority of the run time in Inception movie was taken up by exposition and explaining the rules of the world and how it works. 'Inception' itself was apparently a new thing to the protagonists within the universe since they usually did 'extraction'. \n\nNow I totally understand that this maybe an unpopular opinion given how franchises often cheapen the original IP by either not following the original rules or introducing newer characters who are better than original characters etc. However, IMO, there was too much world building in Inception to be used just for this one movie. Too much was left on the table. We didn't get to see the protagonists facing any challenges with extraction and succeeding. We didn't get to see the extents to which reality bending is possible within a dream. We didn't get to explore more about Yusuf's paid dream machine business. We didn't get to see the origin of the machine and how and why it was created (It is mentioned that military used it to train but how did they find this idea in the first place?). Is it just the military that use it to train or do architects and engineers plan their building designs there? Do university students use it to study even while sleeping? Are there corporations trying to commercialize these and put the good stuff behind a paywall? Do mourning people use them to talk to their dead relatives?\n\nI think we should have a franchise from this universe- at least a few more movies or a series. Nolan could direct or at least supervise any efforts to extend this universe to ensure the quality is maintained.",
        "upvotes": 11,
        "comments": 15,
        "media": null,
        "permalink": "/r/movies/comments/1j9n9b7/inception_world_building_was_too_good_to_use_in/"
    },
    {
        "id": "1j8tys9",
        "author": "JonasKahnwald11",
        "title": "Official Poster for 'The Uninvited' - Starring Elizabeth Reaser, Walton Goggins and Pedro Pascal",
        "content": "",
        "upvotes": 706,
        "comments": 111,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/g6df62qw03oe1.jpeg?auto=webp&amp;s=fa286ba5df6720cef95c393ad9b40335dcd42da8"
        },
        "permalink": "/r/movies/comments/1j8tys9/official_poster_for_the_uninvited_starring/"
    },
    {
        "id": "1j8xcrx",
        "author": "NoCulture3505",
        "title": "Steve Buscemi Joins Martin McDonagh’s ‘Wild Horse Nine’",
        "content": "",
        "upvotes": 360,
        "comments": 49,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/s_ShbFK5h-0XJ6IJjzWaxA_nSP2yq-czQnQyAC12iDI.jpg?auto=webp&amp;s=754b04712f158e596131855aacedd69a4aedd536"
        },
        "permalink": "/r/movies/comments/1j8xcrx/steve_buscemi_joins_martin_mcdonaghs_wild_horse/"
    },
    {
        "id": "1j8ru02",
        "author": "RadDayAMA",
        "title": "Hi /r/movies! I'm Bill Allen, lead actor of the 1986 cult-classic sports film 'RAD'. It was recently restored &amp; remastered in 4K and is coming back to theaters on March 21st for RAD DAY 2025, on top of the physical release. Ask me anything!",
        "content": "",
        "upvotes": 656,
        "comments": 220,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/n2wudfesj2oe1.png?auto=webp&amp;s=6bf62c9b7b9229f5503f4691d700c422930c946f"
        },
        "permalink": "/r/movies/comments/1j8ru02/hi_rmovies_im_bill_allen_lead_actor_of_the_1986/"
    },
    {
        "id": "1j98wze",
        "author": "itsmethatguyoverhere",
        "title": "Movies where another story is told in the background?",
        "content": "Can't think of any examples but I've always saw the movie where there's actually a totally different story being told through details in the background or things that aren't necessarily called attention to. This isn't a great example but I think of how \"into the furnace\" there is a few points where you hear news casts in the background that aren't references or shown but sort of add to the setting even tho they are easy to miss",
        "upvotes": 68,
        "comments": 74,
        "media": null,
        "permalink": "/r/movies/comments/1j98wze/movies_where_another_story_is_told_in_the/"
    },
    {
        "id": "1j9nxao",
        "author": "MarvelsGrantMan136",
        "title": "New Poster for 'ASH' Starring Eiza González &amp; Aaron Paul, Directed by Flying Lotus - A woman wakes up on a distant planet and finds the crew of her space station viciously killed. Her investigation into what happened sets in motion a terrifying chain of events.",
        "content": "",
        "upvotes": 5,
        "comments": 0,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/8dcaxbb0baoe1.jpeg?auto=webp&amp;s=f4b65716030767b64232f52f33620e9676e2f3f0"
        },
        "permalink": "/r/movies/comments/1j9nxao/new_poster_for_ash_starring_eiza_gonzález_aaron/"
    },
    {
        "id": "1j9m0a6",
        "author": "Planito",
        "title": "Can you give me a list of the 5 must watch 1950's movies in your opinion?",
        "content": "Can you give me a list of the 5 must watch 1950's movies in your opinion? I want to watch movies in a chronological order starting from the 1950's I will watch 100 movies from every decade from the 1950' until 2010's. That will be a lot of movies and I hope I can get some very nice recommendations here.\nThanks",
        "upvotes": 7,
        "comments": 41,
        "media": null,
        "permalink": "/r/movies/comments/1j9m0a6/can_you_give_me_a_list_of_the_5_must_watch_1950s/"
    },
    {
        "id": "1j907ef",
        "author": "VeryPteri",
        "title": "We've heard of actors playing against their type. But what directors have directed against their type?",
        "content": "i.e. directors known for doing certain types of genres opting to direct a film that's very far removed from that genre. The closest I can think of is Jared Hess, who usually did small scale comedies, now being given the reins of a $150 million Minecraft film. \n\nOthers that come to mind are Guillermo del Toro and George Miller, who I'd say don't have a type and are instead known for their range.",
        "upvotes": 175,
        "comments": 441,
        "media": null,
        "permalink": "/r/movies/comments/1j907ef/weve_heard_of_actors_playing_against_their_type/"
    }
]