[
    {
        "id": "1m2ohav",
        "author": "anonRedd",
        "title": "Netflix Biannual Engagement Report: Viewing Data for January through June 2025 for over 16,000 titles",
        "content": "",
        "upvotes": 11,
        "comments": 12,
        "media": null,
        "permalink": "/r/netflix/comments/1m2ohav/netflix_biannual_engagement_report_viewing_data/"
    },
    {
        "id": "1n5c3tq",
        "author": "AutoModerator",
        "title": "UNKNOWN NUMBER: THE HIGH SCHOOL CATFISH Discussion Megathread",
        "content": "Vulgar, taunting texts blow up the phones of a teen and her boyfriend. Who's sending them — and why? This twisty documentary reveals the shocking answer.",
        "upvotes": 699,
        "comments": 5125,
        "media": null,
        "permalink": "/r/netflix/comments/1n5c3tq/unknown_number_the_high_school_catfish_discussion/"
    },
    {
        "id": "1nu9kbz",
        "author": "Tr0jan___",
        "title": "Ms. Rachel announced as the new global ambassador for PCRF (Palestine Children's Relief Fund)",
        "content": "",
        "upvotes": 171,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nu9kbz/ms_rachel_announced_as_the_new_global_ambassador/"
    },
    {
        "id": "1nulcv9",
        "author": "Travisauce",
        "title": "Need something new to binge.",
        "content": "What’s the most underrated show on Netflix right now?\n\n\nI feel like I’ve seen all the popular ones (Stranger Things, Dark, etc.), but I want something that doesn’t get talked about as much. Any hidden gems you’d recommend?",
        "upvotes": 35,
        "comments": 197,
        "media": null,
        "permalink": "/r/netflix/comments/1nulcv9/need_something_new_to_binge/"
    },
    {
        "id": "1nuabrk",
        "author": "Sweaty-Toe-6211",
        "title": "'THE WITCHER' Season 4 reportedly cost over $25M per episode, making it $221M overall - The total budget for ‘THE WITCHER’ series has now reached an estimated $720M",
        "content": "",
        "upvotes": 118,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1nuabrk/the_witcher_season_4_reportedly_cost_over_25m_per/"
    },
    {
        "id": "1nulvlm",
        "author": "FNAFLV22",
        "title": "Just heard of “Maniac” and saw the IMDb rating. To those who have seen both shows, which show did you like more?",
        "content": "",
        "upvotes": 26,
        "comments": 44,
        "media": null,
        "permalink": "/r/netflix/comments/1nulvlm/just_heard_of_maniac_and_saw_the_imdb_rating_to/"
    },
    {
        "id": "1nu5lno",
        "author": "Original2021",
        "title": "Toni Collette totally carried the Wayward series",
        "content": "This has to be one of the oddest shows I’ve ever seen. The storyline had potential but the bad acting (aside from one of two performances) and unrealistic storyline was terrible. There was some mention about some of the kids jointing government agencies but they all lived in the town. Like huh??? The only saving grace was Toni Collette’s performance. She’s the only reason I watched until the end. I hope she gets an Emmy nomination for having to make something out of a Nonsensical script. ",
        "upvotes": 131,
        "comments": 75,
        "media": null,
        "permalink": "/r/netflix/comments/1nu5lno/toni_collette_totally_carried_the_wayward_series/"
    },
    {
        "id": "1nu8did",
        "author": "Sea-Opposite3920",
        "title": "Why does everybody hate Wayward",
        "content": "It completely gripped me for 7 hours. I mean sure its unrealistic and there were plot holes, but like it's fiction. The acting was great - I thought - and the emotional abuse which lead to character developments felt real. Not everyones cup of tea I suppose. ",
        "upvotes": 44,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1nu8did/why_does_everybody_hate_wayward/"
    },
    {
        "id": "1nutwjv",
        "author": "Eaglemama70",
        "title": "HOUSE OF GUINESS",
        "content": "I pretty much binged this series. It is so good! I am biased being 35% Irish. There is something about Irish music and men beating the shit out of each other!!!",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nutwjv/house_of_guiness/"
    },
    {
        "id": "1nusucl",
        "author": "EnderFreakYT",
        "title": "“Get a code to watch on this TV” cannot select options",
        "content": "So i recently was hit with the lovely get a code to watch screen and when i click the “im traveling” button, it takes me to a page to request a code… except it doesnt let me highlight the button and select it. Its happening on both xbox and on the TV remote itself.\n\nAny ideas?",
        "upvotes": 2,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nusucl/get_a_code_to_watch_on_this_tv_cannot_select/"
    },
    {
        "id": "1nur96v",
        "author": "Signal-Style-6159",
        "title": "Nightmares of Nature - wowza",
        "content": "Has anyone seen it yet?  It's awesome.  \nIt is a different perspective on nature.\nI've never seen anything like it.\nI have been watching nature documentaries for over 55 years.  Thank you Netflix!  More please 🦉🐜🐊",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nur96v/nightmares_of_nature_wowza/"
    },
    {
        "id": "1nuvf16",
        "author": "Worth_Vermicelli_319",
        "title": "In the mood for a sci-fi and romance series that has both psychological and romantic tension.",
        "content": "I’m in the mood for a sci-fi and romance series that has both psychological and romantic tension. I have watched Dark, 1899, Into the Night, Call Me by Your Name, and Normal People. Can you recommend me something that’s a combo between them and has a similar theme?",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nuvf16/in_the_mood_for_a_scifi_and_romance_series_that/"
    },
    {
        "id": "1nuh62m",
        "author": "Anteater_Able",
        "title": "Duffer Brothers on Netflix Exit, Stranger Things Future",
        "content": "",
        "upvotes": 4,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1nuh62m/duffer_brothers_on_netflix_exit_stranger_things/"
    },
    {
        "id": "1nurrf3",
        "author": "ranch_avocados",
        "title": "Email subject line",
        "content": "So.... Netflix sends out the usual emails about this movie or that movie. I'm fine with it, if ts good to know.\n\nBut my question is....can you change these emails and make them stop putting your profile name in the subject line of the emails? \n\nThx",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nurrf3/email_subject_line/"
    },
    {
        "id": "1nuq5sc",
        "author": "pennycollinz",
        "title": "Does Wayward speed up after the first episode?",
        "content": "Got through the first episode and nothing seemed to pick up and *stay* exciting. There are definitely questions to be answered, it's definitely weird but so far none of the characters seem exciting enough to want to know what happens to them. Is the show a slow burn or does it pick up after the first episode?\n\n\nEdit: spelling",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1nuq5sc/does_wayward_speed_up_after_the_first_episode/"
    },
    {
        "id": "1ntkjg0",
        "author": "jerkoff1610",
        "title": "An actual family member reveals six things Netflix’s House of Guinness gets wrong in the show",
        "content": "",
        "upvotes": 227,
        "comments": 70,
        "media": null,
        "permalink": "/r/netflix/comments/1ntkjg0/an_actual_family_member_reveals_six_things/"
    },
    {
        "id": "1nunqo3",
        "author": "HistoryfictionDetect",
        "title": "Looking for Recs for Comfy TV Series NOT RATED MA",
        "content": "Hi! I recently got Netflix and am looking for TV series recommendations. I love mystery, supernatural, fantasy, etc but am struggling to find story-based shows that aren't rated MA. I love quirky shows like Pushing Daisies, Psych, and Chuck and am hoping to find something to watch that is fun and creative. Any suggestions?",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nunqo3/looking_for_recs_for_comfy_tv_series_not_rated_ma/"
    },
    {
        "id": "1nul19l",
        "author": "swagy_swagerson",
        "title": "Watching Berzerk on Netflix and there there are these coloured dashes in the upper quarter of the frame.",
        "content": "Hopefully you can make the dashes out in the video. I know nothing is wrong with my tv because as you can see the dashes disappear as soon as I exit the video. \n\nAlso I'm in the UAE if that's relevant.",
        "upvotes": 1,
        "comments": 0,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/c95a9n3nhcsf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nul19l/watching_berzerk_on_netflix_and_there_there_are/"
    },
    {
        "id": "1nul0n2",
        "author": "vibebee",
        "title": "Am I going crazy or is Netflix changing words to censored versions",
        "content": "Currently watching Glow on Netflix and there is a cameraman that used to work in porn, which is mentioned a few times in the show. Both times the word is meant to be \"porn\" they say \"corn\". I'm not sure if they actually say this in the show, if I'm losing my hearing or if Netflix is suttely censoring words with AI?",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nul0n2/am_i_going_crazy_or_is_netflix_changing_words_to/"
    },
    {
        "id": "1nujhjm",
        "author": "Eclipse8301",
        "title": "How does account sharing work.",
        "content": "I'm so confused, i'm just trying to move my account (Email 1) to a family account (Email 2).\n\n-So I transferred my profile (it shows up now in Email 2 just fine.\n\n-I canceled my account (Email 1)\n\n-Now email 2 received a text message that says that my profile from Email 1 is pending and needs to be confirmed?\n\n-Ok? So family member sends me the link, it brings me to an account creating/activation screen?\n\nWhat is going on, don't i just use Email 2's account and password? Why do i need to create a new one? (heck why couldn't i just use my original account sign in info while i'm at it?)\n\nWhy is this so confusing.....",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nujhjm/how_does_account_sharing_work/"
    },
    {
        "id": "1nu8e71",
        "author": "LCarbonus",
        "title": "Alice in Borderland... Season 3?!",
        "content": "Is it just me or does Alice in Borderland closes per-fec-tly in season 2? Has anyone read the manga? Does it have more there? Because this feels like it's just them trying to milk the cow a bit more. ",
        "upvotes": 5,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1nu8e71/alice_in_borderland_season_3/"
    },
    {
        "id": "1nufmuv",
        "author": "Practical-Finger-613",
        "title": "can u guys help me",
        "content": "so I bought a netflix subscription and I did rhe payment and everything the money went through but netflix is showing \"ur payment is pending\" I don't know what to do \nI contacted costumer support and after 7 MINUTESS an agent finally got the call I told them about my situation and they hang up. please help",
        "upvotes": 0,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nufmuv/can_u_guys_help_me/"
    },
    {
        "id": "1nu8iz8",
        "author": "Interesting_Ad8895",
        "title": "Whats the series you unexpectedly just keep going back to for a relaxing rerun, let me start",
        "content": "[Ngl  am about to watch this for the fourth  wtime, and I just really enjoy the storyline and the dynamic between North &amp; South, Right &amp; Wrong, Good &amp; Bad](https://preview.redd.it/3asuxio1s9sf1.png?width=2598&amp;format=png&amp;auto=webp&amp;s=2d0ab639e2f2190d1bf9d9441d590a915efcf293)",
        "upvotes": 3,
        "comments": 5,
        "media": null,
        "permalink": "/r/netflix/comments/1nu8iz8/whats_the_series_you_unexpectedly_just_keep_going/"
    },
    {
        "id": "1nunxb9",
        "author": "seon_syain",
        "title": "Rec. request for my husband",
        "content": "My husband (44 y)  never watches Netflix. Always watches only what is on cable. Except lately there are more and more evenings we don't see anything interesting anymore. So I want to suggest something that is on Netflix. But his taste is very difficult. Maybe you can help me find something he might like. The list of things he doesn't like is long:\nPreferably no fighting or guns. None to little romance. No Asian (so no k-drama's for instance). No extreme dumb humour. No extreme enthusiastic people, because that does not look sincere. No explicit sexscenes. Must be spoken in languages: English, Dutch, German or French.\n\nMovies/series he liked in the past: Home Alone, Jumanji, Cool Runnings, Night at the Museum, National Treasure, Mees Kees, Kommisaris Rex, Tremors, Arachnafobia.",
        "upvotes": 0,
        "comments": 54,
        "media": null,
        "permalink": "/r/netflix/comments/1nunxb9/rec_request_for_my_husband/"
    },
    {
        "id": "1nu84xh",
        "author": "piemat94",
        "title": "Breaking Bad suddenly disappeared from my netlix",
        "content": "Hello,\n\n  \nI am totally new on Netflix platform thus apologies if this issue may sound trivial. Since yesterday I cannot find Breaking Bad on the list of available series on the website. Everything was going smooth and fine so far until yesterday. When I was trying to launch BB from a history I got an UI3003 indicating that the product is not available in my country.\n\n\n\n I looked up on the internet and some of the troubleshooting steps involved clearing the browser's history and cache however this didn't work. I launched the Netflix app on my mobile phone with the same issue however when I turned my wi-fi off and switch to mobile data (set to Czech Republic) it reappeared. Does anybody know what may be the reason of this sudden regional exclusion?\n\n  \nThank you.",
        "upvotes": 2,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1nu84xh/breaking_bad_suddenly_disappeared_from_my_netlix/"
    },
    {
        "id": "1nua230",
        "author": "Marshall_Lawson",
        "title": "Wednesday pilot vs show",
        "content": "I just watched S1 E2 of Wednesday last night and it feels different from the pilot. The pilot was closer to being cinematic in quality. Episode 2, the one with the canoe race, feels much more amateurish in pacing, direction, acting, writing, etc. It's like watching someone play an RPG videogame. Most of the characters speak entirely in cliches (the roommate and the queen bee girl especially). The dialog is so clean like how they take turns perfectly and don't really move around while talking. Wednesday gets away with that because she's a creepy deadpan snarker and Ortega pulls off the deadpan thing very well. But, most of the characters aren't suited to it. \n\nIf the argument is \"This is made for teens\", well, okay even when I was a teenager I could tell a good quality screen production from a cheesy one. \n\nIf the rest of the series is like this I'm probably going to be really disappointed, which is too bad because I think Ortega, Zeta-Jones, Guzman, and the kid that plays Pugsley are great casting for the Addams family.",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nua230/wednesday_pilot_vs_show/"
    },
    {
        "id": "1ntdvac",
        "author": "Prudent_Swimming_296",
        "title": "Wayward (SPOILERS)",
        "content": "Was left very underwhelmed. Honestly just poorly written and not well thought out.\n\nI didn’t buy Leila’s sudden change of heart in the end at all and I didn’t buy Abby and Rory’s romance.\n\nWhy was the kid in the beginning who got stabbed by Alex affected by Laura’s mumbling? No answers.\n\nWhat’s the significance of the toads? Never revisited.\n\nWhat happened to the other kids at Tall Pines? Did they escape? Wasn’t addressed.\n\nWTF was the point of that whole “ponderosa” corporation plot point if it played absolutely no role in the story? Never answered.\n\nThis show was full of sloppy writing, massive plot holes, underdeveloped characters, arcs that were started but never took off or finished, and an ending that just felt like a total cop out. Very unsatisfying and not very good.\n\nI’m praying they don’t make a second season but given how popular it is, it’s very much a possibility.",
        "upvotes": 96,
        "comments": 67,
        "media": null,
        "permalink": "/r/netflix/comments/1ntdvac/wayward_spoilers/"
    },
    {
        "id": "1nu8rws",
        "author": "Rare-Connection-7084",
        "title": "Autoplay setting disappeared",
        "content": "Ok. Autoplay seems to have stopped working consistently and I can't find the settings anywhere. Netflix updated and the home screen is different. The menu is at the top not the left side anymore. The first few episodes I watch are playing all the way to the end of the credits and then suddenly it will autoplay again. I'm watching netflix through my lg tv menu. ",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1nu8rws/autoplay_setting_disappeared/"
    },
    {
        "id": "1nsrqsy",
        "author": "Ok_Kiwi_5692",
        "title": "I feel so bad for the dad in this show man",
        "content": "Adolescence (2025)",
        "upvotes": 1927,
        "comments": 366,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/95txb29ffxrf1/DASH_1080.mp4?source=fallback"
        },
        "permalink": "/r/netflix/comments/1nsrqsy/i_feel_so_bad_for_the_dad_in_this_show_man/"
    },
    {
        "id": "1nu70uf",
        "author": "AMillion-dreams",
        "title": "Suggestions Please!",
        "content": "So, I have watched Friends, 2 Broke Girls, Young Sheldon, Lucifer, Why Women Kill, Scream Queens, American Housewife, Modern Family, The Vampire Diaries, The Originals, Reign, Game of Thrones, Bridgerton, and the Rookie.\nNow I'm looking for a great series to watch.\n\nAll suggestions are welcomed!",
        "upvotes": 1,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1nu70uf/suggestions_please/"
    }
]