[
    {
        "id": "1pf1glb",
        "author": "AutoModerator",
        "title": "Netflix to Acquire Warner Bros. Following the Separation of Discovery Global for a Total Enterprise Value of $82.7 Billion (Equity Value of $72.0 Billion)",
        "content": "",
        "upvotes": 36,
        "comments": 28,
        "media": null,
        "permalink": "/r/netflix/comments/1pf1glb/netflix_to_acquire_warner_bros_following_the/"
    },
    {
        "id": "1pcfokw",
        "author": "DaraNetflixGames",
        "title": "Stranger Things x Netflix Puzzled: Puzzles just got a little.. stranger? 👀",
        "content": "Hi everyone! There's a brand new way to experience Hawkins and the Upside Down - this time through word and visual puzzles in Netflix's daily puzzle platform, Netflix Puzzled.   \n  \nI’m Dara, a Community Manager at Netflix Games, and I wanted to share a bit more about how Stranger Things is taking over one of our latest games.\n\n**Event Details:**  \nDates: Nov 26 - Jan 8  \nWhere to play: [https://bit.ly/NetflixPuzzled ](https://bit.ly/NetflixPuzzled)  \n*(The link should send you to the right place on mobile or web, depending on your device)*\n\n**Stranger Things x Netflix Puzzled**:\n\n* Solve daily puzzles to relive iconic Stranger Things moments\n* **Unlock exclusive behind-the-scenes videos** as rewards\n* Explore challenges packed with Easter eggs only true fans will catch\n\nThe event is available to everyone, on mobile and tudum.com/puzzled - **no Netflix account required**! :) We worked closely with the Stranger Things team to keep it true to the series and accessible to everyone. \n\nOutside of the event, there’s also a regular lineup of daily word, logic, and visual puzzles like Bonza, Crossover, Keysmash, Sudoku, Starstruck, Jigsaw, and more, with additional themed events planned.\n\nGive it a try and share your thoughts below - we'd love to hear from you!   \n \n\nPS: Posted with the admins' approval. Thanks and hope you enjoy it! ",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pcfokw/stranger_things_x_netflix_puzzled_puzzles_just/"
    },
    {
        "id": "1psjdzz",
        "author": "Alldogsgotoheaven12",
        "title": "Dave Chapelle The Unstoppable Reaction",
        "content": "This didn’t feel like stand up as much as it felt like a victory lap. The vibe was basically I’m richer than all of you combined. I’m wiser. I’m philosophical. I’ve made it. And you can tell I’ve made it because I talk really slow now, pause a lot, smoke a cigarette on stage, and let the crowd applaud my existence. There were way more stories than jokes. Not sharp stories that build to something clever, just rambling anecdotes that relied on the audience already being on his side. It felt less like he was trying to make people laugh and more like he knew people would cheer no matter what he said. And they did. This felt safe, comfortable and almost lazy. Like he knows the brand is bulletproof, so why bother tightening the material? I get that he’s earned the right to do whatever he wants. He’s one of the greatest to ever do it. But greatness doesn’t mean every mic drop deserves a standing ovation. At some point, slowing your delivery and sounding profound isn’t the same thing as being funny.\n\nIt just feels like we’re watching a legend turn into a motivational speaker with better lighting, and the crowd keeps rewarding it.",
        "upvotes": 341,
        "comments": 212,
        "media": null,
        "permalink": "/r/netflix/comments/1psjdzz/dave_chapelle_the_unstoppable_reaction/"
    },
    {
        "id": "1ps65y7",
        "author": "Pope_Twitch",
        "title": "Netflix keeps cancelling shows",
        "content": "Hello everyone,\n\n  \nThis post is mostly a rant about Netflix and the way they handle stuff with many of their shows. I came to realize Netflix has an absurd strategy to keep customers locked in releasing new series/shows at a steady pace but for the majority, series are almost never finished unless they are really classics or series they have acquired. I am really annoyed but the number of times I locked into one of the series and then have to realize there will not be any ending of the show. It came to the point where I even start to lookup whether or not there is going to be a final season before investing the time to check it out. \n\n  \nSeries which have left a bitter taste to me personally since there is no \"what's next\":\n\n* Marco Polo\n* Away\n* 1899\n* Snowpiercer\n* Barbarians\n* Pulse\n* The recruit\n* Boots\n* Lost in space (it has an ending but there was more imo)\n* ..\n\nI know this post is not going to make any difference and I understand more than anybody else the business, it is money first, customers second but damn me, damn me for watching unfinished series. Especially the science fiction seems to be affected by this problem quite a lot. (or maybe that is because I watch too many of those)\n\nI just hope I am not the only one who has this feeling and who has been disappointed more than once in the past years?",
        "upvotes": 289,
        "comments": 397,
        "media": null,
        "permalink": "/r/netflix/comments/1ps65y7/netflix_keeps_cancelling_shows/"
    },
    {
        "id": "1ps9ss8",
        "author": "anonychef117",
        "title": "Why did Jake Paul fight AJ?",
        "content": "If he can't even defeat pro Cruiserweights (hes probably light heavyweight?) properly, why the hell did he move up to heavweight and choose one of the top heavyweights to fight? \n\nI just don't get why he actually fought AJ. I thought it was a joke because he only fights 70yo men. I thought it was a fake news on social media but he actually fought him (didn't know until i saw the recommended highlights pop up on youtube yesterday).\n\nSo why did he fight him? \n\n\nEdit: I know he fought him for money but he could've chosen another retired senior citizen with a cane to fight him again for $$$. He didn't have to choose one of the top heavyweight boxer to fight him, as Jake Paul is two weightclasses below heavyweight. (Light HW)\n",
        "upvotes": 98,
        "comments": 136,
        "media": null,
        "permalink": "/r/netflix/comments/1ps9ss8/why_did_jake_paul_fight_aj/"
    },
    {
        "id": "1psf5io",
        "author": "AppropriateLadder497",
        "title": "Good end of the world movies?",
        "content": "I’m looking for a movie on Netflix that would be a good end-of-the-world movie. The type of movie that just leaves you anxious because you have no idea what’s going to happen next, and the characters are so confused because they have no idea what’s going on. I don’t know why, but I really enjoyed Leave the World Behind when it came out. Any recommendations? ",
        "upvotes": 19,
        "comments": 42,
        "media": null,
        "permalink": "/r/netflix/comments/1psf5io/good_end_of_the_world_movies/"
    },
    {
        "id": "1psbcig",
        "author": "No-Goat5212",
        "title": "The Flash becomes the most watched superhero show (licensed) on Netflix",
        "content": "During its peak on Netflix U.S., The Flash clearly outperformed other DC television series in total watch time. Reports based on streaming analytics show The Flash accumulating over 300 million hours watched in measured periods, making it the most-watched Arrowverse series on Netflix by a wide margin. By comparison, Arrow generated roughly half that amount of viewing time, while Supergirl, Legends of Tomorrow, and Black Lightning trailed far behind. The gap was driven by The Flash’s long episode seasons, nine-season run, and strong rewatch behavior. Even compared to other licensed Netflix hits, few superhero shows matched its sustained minutes-watched performance. This dominance confirms that The Flash was not only the most popular DC series on Netflix U.S., but also the platform’s most-watched licensed superhero show overall.",
        "upvotes": 29,
        "comments": 21,
        "media": null,
        "permalink": "/r/netflix/comments/1psbcig/the_flash_becomes_the_most_watched_superhero_show/"
    },
    {
        "id": "1psciz3",
        "author": "xjsjxigskdnfn",
        "title": "Dash and Lilly should’ve got a second season!!!",
        "content": "Was such a great Christmas show and the actors were incredible. Really think it deserved a second season as there was so much further to go in the story. ",
        "upvotes": 13,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1psciz3/dash_and_lilly_shouldve_got_a_second_season/"
    },
    {
        "id": "1pst3kf",
        "author": "NewProperty9247",
        "title": "Stranger Things- First Watch",
        "content": "In the Season 4 finale of Stranger Things, the Hawkins group deliberately lures Vecna into attacking Max so that his physical body can be attacked while he is in a trance.\n\nThe California group (with Eleven) clearly knew this plan in advance. Given that context, why didn’t the Hawkins group simply wait for Eleven to physically reach Hawkins? She was already en route and would have arrived by the next day at most.\n\nInstead, Eleven was forced to fight Vecna remotely, which visibly weakened her and limited her effectiveness. From a tactical standpoint, this seems like the worst possible option:\n\n\t•\tVecna was strongest inside the Mindscape.\n\n\t•\tEleven was weakest when fighting telepathically across distance.\n\n\t•\tThe group already knew Vecna could wait and choose his moment.\n\nWaiting for Eleven to arrive would have allowed:\n\n\t•\tA direct confrontation with Vecna at full strength.\n\n\t•\tNo need to risk Max as bait.\n\n\t•\tNo split attention or exhaustion for Eleven.",
        "upvotes": 0,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1pst3kf/stranger_things_first_watch/"
    },
    {
        "id": "1psbo1r",
        "author": "ProjectMason",
        "title": "Recommended to watch this week: The Perfect Neighbor",
        "content": "My girlfriend and I are getting into Netflix, and for those of you that already seen this documentary, we asked for your suggestions on other true crime documentary you found enjoyable or even relevant to this one so we can consider watching. \n\nIn my opinion, I don’t know why they gave that old hag 25 years, just throw her away for life. ",
        "upvotes": 13,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1psbo1r/recommended_to_watch_this_week_the_perfect/"
    },
    {
        "id": "1psrnht",
        "author": "Ross_Heartfilia",
        "title": "Interneg vs search bar.",
        "content": "When I search for shows like nurse jackie or teen wolf in the search bar I get nothing but if I type it in on Google like (teen wolf Netflix) I get taken to the page but there's no play button is this because it's not there anymore or something else also I have the ad free subscription so all shows should come up and work. ",
        "upvotes": 1,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1psrnht/interneg_vs_search_bar/"
    },
    {
        "id": "1psa2h4",
        "author": "SwimmingThrough_5059",
        "title": "Christmas originals 2025 vs 2024?",
        "content": "To anyone else, did it feel like Netflix' original holiday content in 2024 made a bigger impact?\n\n2024 had: Hot Frosty, The Merry Gentlemen, Our Little Secret (Lindsay Lohan), Meet Me Next Christmas (Christina Milian) and Sabrina Carpenter's special.\n\nThis year had: Champagne Problems, Jingle Bell Heist, A Merry Little Ex-Mas and My Secret Santa.\n\nNow, none of these movies are high-quality, obviously, but it felt like the 2024 movies made a bigger impact. What do others think? Are there are 2025 originals that I missed that are worth watching?",
        "upvotes": 12,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1psa2h4/christmas_originals_2025_vs_2024/"
    },
    {
        "id": "1psbji6",
        "author": "stellacampus",
        "title": "Relay was really good",
        "content": "A complex, slow burn type suspense thriller with a somewhat novel concept. The acting was consistently good and I was captivated throughout. One of the better movies Netflix has put up in a while.",
        "upvotes": 9,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1psbji6/relay_was_really_good/"
    },
    {
        "id": "1pso19h",
        "author": "Andrepartthree",
        "title": "Does Netflix really keep your info (watch list et cetera) for 24 months?",
        "content": "I know it says it right there on their website :P\n\n[https://help.netflix.com/en/node/407#:\\~:text=We%20keep%20your%20Viewing%20Activity,Your%20recommendations](https://help.netflix.com/en/node/407#:~:text=We%20keep%20your%20Viewing%20Activity,Your%20recommendations)\n\nunder \"rejoining netflix\" if you click on that part.. but I was looking for feedback from anyone who cancelled their netflix for say 3 or more months then rejoined later on.. was your watchlist still there on netflix?   And/or your progress far as which episodes you'd watched and which ones you had not?\n\nI'm aware of the Netflix option to pause your membership for 3 months and will be doing so (scored 3 free months of apple TV through my roku device so will binge that for 3 months :) ).. but I'm not sure if pausing for 3 months is a \"you can do that ONCE per Netflix member for your entire life\" or if it's more often than that?  Tried to find the answer myself by google searching without any luck but maybe I'm just dumb :P\n\nThanks in advance to anyone who reads this and replies :) ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1pso19h/does_netflix_really_keep_your_info_watch_list_et/"
    },
    {
        "id": "1psf4x9",
        "author": "rogekmartin",
        "title": "Suggest tv series like Person of Interest (2011)",
        "content": "Suggest me a tv series like Person of Interest from 2011. It was really far ahead of its time. The production quality was cheap but the story they were trying to convey was amazing. Something which is becoming a more of a issue now and people are not realising it!",
        "upvotes": 3,
        "comments": 1,
        "media": null,
        "permalink": "/r/netflix/comments/1psf4x9/suggest_tv_series_like_person_of_interest_2011/"
    },
    {
        "id": "1psmylb",
        "author": "dayton462016",
        "title": "Background binging",
        "content": "I'm looking for suggestions to binge in the background while I do other stuff. Looking for shows with lots of seasons and reality-ish. I enjoy crafty/competition shows- think Project Runway or Flea Market Flip. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1psmylb/background_binging/"
    },
    {
        "id": "1psmulf",
        "author": "STUPIDNEWCOMMENTS",
        "title": "Not in household but I’m literally in my house?",
        "content": "I’m getting the not in household message on iPad. But I’m literally in my house. Trying to find the set household in settings but it doesn’t show up? I haven’t had a TV attached to Netflix in years. I watch either through my Apple TV or on iPad. Totally confused as to how to fix this. Also, this is so stupid and Netflix sucks",
        "upvotes": 2,
        "comments": 7,
        "media": null,
        "permalink": "/r/netflix/comments/1psmulf/not_in_household_but_im_literally_in_my_house/"
    },
    {
        "id": "1psmcqf",
        "author": "imdstuf",
        "title": "Christmas selection",
        "content": "I have both Netflix and Amazon Prime currently.  I don't pay for Prime just for streaming, but it isn't bad.  Between the two, most of the year I don't miss not having HBOMax, Hulu, Apple TV, or Paramount, even when people are buzzing about some shows I haven't watched.  \n\nChristmas time is the only time I feel somewhat let down by Netflix and Prime.  Neither carries any of the well known Christmas movies, except maybe the classic version of Miracle on 34th Street and It's A Wonderful Life on Prime (but those are also on free platforms).\n\nI do miss watching A Christmas Story, Elf, Fred Clause (don't judge me), A Christmas vacation, the 90s version of A Miracle on 34th Street and some others \n\nDoes anyone else who doesn't have anything other than Netflix or Netflix and Prime feel this void this time or year also? ",
        "upvotes": 0,
        "comments": 2,
        "media": null,
        "permalink": "/r/netflix/comments/1psmcqf/christmas_selection/"
    },
    {
        "id": "1pskl8d",
        "author": "wagwanggggggg",
        "title": "Paul Thonas Anderson movies",
        "content": "Are there any PTA movies on Netflix at the moment? I really wanted to watch one as I have never watched one of his movies. It can be in any country, i just really need to watch one of his movies🫠",
        "upvotes": 0,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1pskl8d/paul_thonas_anderson_movies/"
    },
    {
        "id": "1pr6ly8",
        "author": "TheMirrorUS",
        "title": "Anthony Joshua slammed as Netflix viewers claim Jake Paul fight was 'rigged'",
        "content": "# Anthony Joshua secured a sixth-round victory over Jake Paul, but fans claimed that the fight was rigged after barely any punches landed in the opening three rounds. Thoughts? ",
        "upvotes": 2216,
        "comments": 751,
        "media": null,
        "permalink": "/r/netflix/comments/1pr6ly8/anthony_joshua_slammed_as_netflix_viewers_claim/"
    },
    {
        "id": "1psefyn",
        "author": "Natural-Aerie6693",
        "title": "Greatest Night in Pop Netflix documentary opening music",
        "content": "Started watching this documentary and the opening music at 01:38 hit me like a ton of bricks! What a catchy riff! Anyone have any idea who the artist/guitarist/band name is? No luck using shazam and Google. ",
        "upvotes": 2,
        "comments": 3,
        "media": null,
        "permalink": "/r/netflix/comments/1psefyn/greatest_night_in_pop_netflix_documentary_opening/"
    },
    {
        "id": "1prc2ys",
        "author": "Notoriously_So",
        "title": "Netflix Has Stopped Allowing Streaming From Phone to TV: How to Watch Now",
        "content": "",
        "upvotes": 555,
        "comments": 55,
        "media": null,
        "permalink": "/r/netflix/comments/1prc2ys/netflix_has_stopped_allowing_streaming_from_phone/"
    },
    {
        "id": "1pshesh",
        "author": "MamaMia1325",
        "title": "Don Crowder aka Tom Pelphrey in Love and Death...",
        "content": "...looks so much like John Cena that it's uncanny. I binged this entire series today and I really enjoyed it. Has anyone also seen Candy on Hulu? I'm wondering which one is better...",
        "upvotes": 0,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1pshesh/don_crowder_aka_tom_pelphrey_in_love_and_death/"
    },
    {
        "id": "1psgljb",
        "author": "yerrr_fleurrr",
        "title": "Building the Band vs Next Act",
        "content": "So I was completely obsessed with Building the Band when it came out. I rewatched certain episodes multiple times because of how much I loved performances and band chemistry and I have all top 4 groups on my playlists in some way shape or form now that they're all established. Im not crazy about reality TV or scripted drama, but I love music and great performances. My confusion is that I keep seeing these trailers for Simon Cowell's Next Act pop up on my page and the talent seems nowhere near what we were seeing on BTB, even compared to artists that didnt make it past the first episode. It could just be a marketing fail on Netflixs part and Simon Cowell clearly has clout in the band building market. Im just trying to figure out if the show is worth a watch or if this is just a cash grab from Netflix trying to feed off the success of BTB with minimal effort",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1psgljb/building_the_band_vs_next_act/"
    },
    {
        "id": "1psb1g5",
        "author": "mmmory",
        "title": "Weird bug on 4k playback on Pc?",
        "content": "My netflix only allows 1 episode per day with 4k quality apparently. It sounds weird right?\n\nI even got Dolby Vision working.\n\nI start an episode and see the resolution in 4K, great.\n\nThen, on the next episode the resolution is 1080p and it never increases, ever.\n\nLike it enables dolby vision but the resolution is 1080p and the bitrate is so crap like 1500 kbps or something. \n\nNothing changes configuration-wise, yet it streams one episode in 4K and the other in 1080p.\n\nLike I don't even know what is the issue because I literally watched 4k dolby vision on the same setup minutes ago.\n\nUsing Edge, all extensions are installed, no other screen is active, no background internet activity that consumes bandwith yet it's still not working. Anyone having a similar issue?",
        "upvotes": 2,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1psb1g5/weird_bug_on_4k_playback_on_pc/"
    },
    {
        "id": "1psd0n6",
        "author": "Kaskelontti",
        "title": "Korean Series",
        "content": " The cliffhangers at the end of each episode of Korean series are the best thing ever! Prove me wrong! I always start getting excited just before the end of the episode, wondering what's going to go wrong. Everything is fine, then everything falls apart, but in the next episode everything is fine again. Perfect!",
        "upvotes": 1,
        "comments": 0,
        "media": null,
        "permalink": "/r/netflix/comments/1psd0n6/korean_series/"
    },
    {
        "id": "1pssez4",
        "author": "Latter-Possibility-6",
        "title": "Four hours in and already cancelled.",
        "content": "Signed up for an account tonight to watch a show I’ve been wanting to see. \n\nGot thru the registration process fine and dandy, so I started watching. \n\nTwo episodes in, I get a notification on my Tav that I need to update my billing information, so I do. \n\nThey double charged me. I called them and they are denying it up and down. \n\nI’m seriously thinking about going to my states AG or something cause this is crap. ",
        "upvotes": 0,
        "comments": 4,
        "media": null,
        "permalink": "/r/netflix/comments/1pssez4/four_hours_in_and_already_cancelled/"
    },
    {
        "id": "1psajh9",
        "author": "Adventurous_Bus_5456",
        "title": "household thing is kinda unnecessary",
        "content": "I haven't had any problem until today. I'm a college student studying in a different city and my mom recently moved houses. Idk how the wifi thing works for netflix but her current house doesn't have wifi so we can't like choose it as a main wifi or anything. Idk how to bypass this without having to ask my mom for a code every 2 weeks 😵‍💫",
        "upvotes": 0,
        "comments": 8,
        "media": null,
        "permalink": "/r/netflix/comments/1psajh9/household_thing_is_kinda_unnecessary/"
    },
    {
        "id": "1psog3p",
        "author": "Majestic-Day-5024",
        "title": "AJ's popularity rise after weekend?",
        "content": "something that's took me by surprise a bit over the past couple of days, mainly on social media... i've noticed AJ get a lot more exposure, &amp; it just got me thinking, was there still a lot of people who before his fight with JP not know who he was? \n\nI mean to me that sounds almost ridiculous but maybe that was exactly the case, mainly in the US obviously but I just wanted to see if people thought the same.\n\nlots of \"influencers\" seem to be commenting saying all sorts of compliments &amp; it really has the feel of seeing him for the first time, I find it all very amusing haha\n",
        "upvotes": 0,
        "comments": 6,
        "media": null,
        "permalink": "/r/netflix/comments/1psog3p/ajs_popularity_rise_after_weekend/"
    },
    {
        "id": "1pse5r0",
        "author": "AssociateLittle1487",
        "title": "So it’s been 6 months since Squid Game 3 aired! How do you feel about it/ rate it out of 10?",
        "content": "Do you miss it? Do you wish certain things were done differently? Do you wish someone else lived etc.?\n\nAlso, do you think the squid game subreddit praises Season 3 too much?",
        "upvotes": 0,
        "comments": 22,
        "media": null,
        "permalink": "/r/netflix/comments/1pse5r0/so_its_been_6_months_since_squid_game_3_aired_how/"
    }
]