[
    {
        "id": "1oxr7f0",
        "author": "IcefoxX5",
        "title": "[Match Thread] Real Madrid Castilla - CP Cacereño | Primera Federación, Matchday 12",
        "content": "#FT: CASTILLA 2:0 CACEREÑO\n\n&amp;#x200B;\n\n#1ª FEDERACIÓN\n\n&amp;#x200B;\n\n**Scorers/replays:** \n\n1:0 Álvaro Ginés 78'\n\n2:0 César Palacios (p) 85'\n\n&amp;#x200B;\n\n**match updates:** \n\n1' - kickoff, vamos! \n\n3' - heavy rain is pouring down in Madrid, as the team will try to recover from the heavy defeat suffered in Mérida last week. The unnecessary and inglorious ending of the match has left David Jiménez suspended for this match, the captain Manuel Ángel for 3 matches, and Arbeloa for two matches, meaning his assistant, Julián Carmona is on the sidelines today and next week. Additionally, the team has to compensate for the injuries of Fortea, Fettal, de Llanos and Roberto Martín, while Fran González is with Spain U21\n\n27' - heavy elbow into the Cacereño player's face by Álvaro Leiva, I'm surprised their coach is not asking for a review since their player was treated for a significant nose bleed for a couple of minutes, but he can continue \n\n45'+1 - Mesonero with a free kick near the edge of the box, but from a very tight angle - his cross is hit hard, but gets slightly deflected, and ends up hitting the post, biggest chance for Castilla so far \n\nHT - Castilla are dominating possession without generating much danger in a half that was fully conditioned by the heavy rain and the drenched pitch - if the rain doesn't stop, the conditions won't get better, so this match will be a literal fight in the mud won by whichever team wants it the most \n\n🔄 46' - second half is underway, Diego Aguado comes off after his early yellow card, Cristian David on the pitch now\n\n58' - spectacular dribble by Manu Serrano, who nutmegs his opponent and enters the box - he lays it off to Palacios, whose shot is too central and their keeper can save it \n\n🔄 61' - Loren and Pitarch off, Álvaro Ginés and Bruno on\n\n63' - triple chance for Castilla - Bruno Iglesias' gets put through in the box, but his quick shot is saved by the keeper - the ball drops for Mesonero, who is tackled as he shoots and can't direct the ball goalwards, but instead to Álvaro Ginés, who shoots from a short distance but it gets blocked \n\n65' - Mesonero's shot from the edge of the box is saved by the keeper once more. The goal needs to come quickly now, the Castilla dominance is overwhelming\n\n🔄 70' - Arbeloa and his proxy Julián Carmona use up all their subs early on, Yáñez and Pol Fortuny on for Leiva and Mesonero\n\n74' - Bruno Iglesias with a Kroos-like shot from deep, and it hits the post again... Bad luck at this point for Castilla \n\n⚽ 78' - GOLLLLLL DEL CASTILLA - Finally! The ball is played out to the left wing, where Bruno puts in a nice cross towards the far post. Cacereño make an error in the marking, and Álvaro Ginés is completely open at the far post to head it into the net from a short distance - he crowns his official debut for Castilla with a goal! \n\n82' - penalty for Castilla! Yáñez is brought down at the edge of the box during a counter attack\n\n⚽ 85' - GOLLLLLL DEL CASTILLA - after a review to see whether the foul was really on the line or just outside, the penalty is given - Palacios steps up and sends the keeper the wrong way, hopefully sealing a very deserved victory! \n\nFT - despite the absence of various players and Arbeloa himself, Castilla manage their potentially best performance of the season in the second half - after struggling more with the waterlogged pitch then the opponent in the first half, the team dominated even more after the rain finally stopped, creating a variety of opportunities, hitting the post twice and finally scoring two goals for a very deserved win. All the players who had to step in today like Mesonero, Bruno, Leiva and Álvaro Ginés contributed nicely, making the absentee list hardly felt on the pitch. Castilla are now 4th again, just 1 point from the leader for the moment\n\n&amp;#x200B;\n\n**Kickoff:** 14:00 CET\n\n**Venue:** Estadio Alfredo di Stéfano, Madrid\n\n**Referee**:  Álvaro Juncal Moreira\n\n**Competition:** Primera Federación, Grupo 1, Matchday 12\n\n**Viewing options:** \n[LaLiga+](https://www.laligaplus.laliga.com/) (subscription - 14.99€/month) (only available in Spain)\n\n&amp;#x200B;\n\n**Castilla XI** (4-3-3): Sergio Mestre - Manu Serrano, Víctor Valdepeñas, Joan Martínez, Diego Aguado (46' Cristian David) - Jorge Cestero, Thiago Pitarch (61' Bruno Iglesias), Dani Mesonero (70' Pol Fortuny) - Álvaro Leiva (70' Dani Yáñez), Loren Zúñiga (61' Álvaro Ginés), César Palacios \n\nBench: Javi Navarro (GK), Guille Súnico (GK), Mario Rivas, Lamini Fati, Álvaro Lezcano. \n\nUnavailable: Fran González (Spain U21 call-up), David Jiménez (red card suspension), Jesús Fortea (injury), Manuel Ángel (red card suspension), Roberto Martín (injury), Hugo de Llanos (injury), Rachad Fettal (injury). \n\nCoach: Álvaro Arbeloa\n\n&amp;#x200B;\n\n**Castilla last five matches:** WWDWL\n\n**1ª RFEF stats:** 5th | 18pt | 6-0-5 | 13:13\n",
        "upvotes": 7,
        "comments": 0,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oxr7f0/match_thread_real_madrid_castilla_cp_cacereño/"
    },
    {
        "id": "1oxtlcu",
        "author": "scoreboard-app",
        "title": "Match Thread: FC Barcelona vs Real Madrid Live Score | Primera Division Women 25/26 | Nov 15, 2025",
        "content": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/realmadrid/comments/1oxtlcu)",
        "upvotes": 31,
        "comments": 32,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oxtlcu/match_thread_fc_barcelona_vs_real_madrid_live/"
    },
    {
        "id": "1oxuhg9",
        "author": "o6ohunter",
        "title": "Alternate angle of THAT Vinicius Junior goal",
        "content": "",
        "upvotes": 1009,
        "comments": 65,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/kuf5o3ltvf1g1/CMAF_480.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oxuhg9/alternate_angle_of_that_vinicius_junior_goal/"
    },
    {
        "id": "1oy2rar",
        "author": "soldier101br",
        "title": "\"Militão is on a spetacular phase\" says Real Madrid legend and former coach,Carlo Ancelotti,on the post match Win of Brasil against Senegal",
        "content": "Transcription:\" i think that the duo Militão and Estêvão worked very well on the right side of the field, Militão is on a spetacular condition,physical and also mental,i believe that,2 years without playing have made him mature a lot on the mental aspect,and with that attitude,he can play in every position,back as a right back. The team was very solid at the back,and for that we're satisfied\" ",
        "upvotes": 216,
        "comments": 21,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/j1pw5jiwih1g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oy2rar/militão_is_on_a_spetacular_phase_says_real_madrid/"
    },
    {
        "id": "1oxsqa1",
        "author": "H4rryTh3K1ng",
        "title": "I hate the international break",
        "content": "Every time we have this stupid break, we always get injuries. We have Mbappe with an ankle issue and now dean is also injured. That screws us over for the next few games that we have. FIFA always so stupid for making these breaks because they are so unnecessary and always screws us over in the end. Courtois and Fede also have an issue. I’m nervous on how xabi will handle the mid season injury wave that happens every year. ",
        "upvotes": 106,
        "comments": 52,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oxsqa1/i_hate_the_international_break/"
    },
    {
        "id": "1oxttmu",
        "author": "soldier101br",
        "title": "Vini Jr.,Rodrygo,Militão and Casemiro starts for Brasil against Senegal",
        "content": "As previously commented,Vini,Rodrygo,Mili and Case were set to start against Senegal according to Very reliable news outlets. The game Will take place on Arsenal Stadium,as previously saw in other games of the seleção in London. Former players From real Madrid Danilo and Fabinho are also in the bench to be avaliable for the legend and former real Madrid coach and current Brasil coach,Carlo Ancelotti. Any questions or further news i'll Bring up in the coming hours.",
        "upvotes": 41,
        "comments": 2,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/1w7t8o5wqf1g1.png?auto=webp&amp;s=6e7cabe22a13f28b09ad30f73e9681c0a52c50d4"
        },
        "permalink": "/r/realmadrid/comments/1oxttmu/vini_jrrodrygomilitão_and_casemiro_starts_for/"
    },
    {
        "id": "1oxswdz",
        "author": "o6ohunter",
        "title": "It is just crazy to think about just how differently everything could've gone if Kroos didn't retire last year",
        "content": "The bastard. \"I want to retire while I'm still at my peak.\" Bro forgot the other half of the graph. He still had easily multiple seasons left at the top level in him but chose to secure his aura and legacy forever. I can't blame or fault the man, but I can miss him. His coolness on the ball, switch of plays, the way he'd orchestrate the offense. And then you add on the fact he left the same season we signed one of the most deadliest players to have on the end of a through ball.\nI don’t even know if this type of post is allowed. Anyone else just miss Kroos?",
        "upvotes": 45,
        "comments": 39,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oxswdz/it_is_just_crazy_to_think_about_just_how/"
    },
    {
        "id": "1oxndww",
        "author": "Sneijder4BallondOr",
        "title": "Iván Zamorano goal against Barcelona [Jan 30, 1993]",
        "content": "",
        "upvotes": 93,
        "comments": 2,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/18pmoczi2e1g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oxndww/iván_zamorano_goal_against_barcelona_jan_30_1993/"
    },
    {
        "id": "1oxtht8",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [2]-0 CP Cacereño - César Palacios penalty 85'",
        "content": "",
        "upvotes": 30,
        "comments": 1,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/t70c7mc6of1g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oxtht8/real_madrid_castilla_20_cp_cacereño_césar/"
    },
    {
        "id": "1oy8yhh",
        "author": "Pandread",
        "title": "What is the best place to find/watch archived matches?",
        "content": "Is there a place to stream or download them?  There are so many classics and wanted to know how people are doing this currently?\n\nIdeally I would download them so I can watch any time later but if the best I can do is streaming then I will take that. \n\nI know there are torrents but finding old matches has proved difficult. ",
        "upvotes": 5,
        "comments": 5,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oy8yhh/what_is_the_best_place_to_findwatch_archived/"
    },
    {
        "id": "1ox3ow4",
        "author": "WhiteWolf_08",
        "title": "Xabi Alonso after Mbappe's Injury:",
        "content": "",
        "upvotes": 1253,
        "comments": 39,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/sw0um056i91g1.jpeg?auto=webp&amp;s=d6bcaa26fb5e814c381e84e23404a29524226092"
        },
        "permalink": "/r/realmadrid/comments/1ox3ow4/xabi_alonso_after_mbappes_injury/"
    },
    {
        "id": "1oxtbx4",
        "author": "IcefoxX5",
        "title": "Real Madrid Castilla [1]-0 CP Cacereño - Álvaro Ginés 78'",
        "content": "",
        "upvotes": 14,
        "comments": 5,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/0epycif0nf1g1/CMAF_1080.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1oxtbx4/real_madrid_castilla_10_cp_cacereño_álvaro_ginés/"
    },
    {
        "id": "1ox0tjs",
        "author": "No-Independent2522",
        "title": "Thought r/realmadrid had wild takes… then I saw England fans.",
        "content": "",
        "upvotes": 424,
        "comments": 145,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/7dufyfjez81g1.jpeg?auto=webp&amp;s=1473bcb0664048924d281449ad85fa6560ca2dbd"
        },
        "permalink": "/r/realmadrid/comments/1ox0tjs/thought_rrealmadrid_had_wild_takes_then_i_saw/"
    },
    {
        "id": "1oxehq5",
        "author": "Outrageous-Brain-395",
        "title": "Has Florentino Pérez surpassed Santiago Bernabeú's legacy at Real Madrid?",
        "content": "Do you think Florentino Pérez has surpassed Santiago Bernabeú as the most important president in the history of this institution? If you include everything, not just men's football, but like the basketball team and the creation of a women's team, I think he has done a lot for the club. The Bernabeú has been upgraded under his tenure, he's brought in Galácticos and won a lot of UCL trophies, in both his 1st and 2nd stint. Fans would always say, you can't replace Cristiano, or Kroos, or Modric, or Ramos, or Zidane, etc. but I think Pérez is probably going to be the one person we'll miss the most. We literally had to wait decades to go from Bernabeú to Pérez, I wonder how long until the next great Real Madrid president shows up.",
        "upvotes": 62,
        "comments": 11,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oxehq5/has_florentino_pérez_surpassed_santiago_bernabeús/"
    },
    {
        "id": "1ox4aa2",
        "author": "Small-Ideal-5839",
        "title": "I rewatched Liverpool vs Real Madrid and I think we overreacted a bit 😬",
        "content": "\nAfter rewatching the match, a few things stood out:\n\n1. It wasn’t as bad as it first seemed.\nThe first half showed promising rotations and chance creation, but the final pass and finishing were missing. The players are still adapting to a system that requires composure on the ball, something easier to execute in La Liga than against high-intensity teams like Liverpool. We did manage to bypass their midfield often, but the end product wasn’t there.\n\n\n2. Old habits are hard to break.\nThis team is used to transition football, so shifting to a possession-oriented style will take time. Vini, for example, still looks to attack immediately rather than recycle play when needed. We need more patience instead of forcing every forward move into a chance.\n\n\n3. Arda Güler needs experience.\nHe had a decent first half despite small mistakes, but looked lost when shifted left after the break. I’d chalk that up to inexperience rather than pressure. While many fans see him as a No. 10, I still believe he’s better suited to developing into a deep-lying playmaker.\n\n\n4. Xabi experimented heavily in the second half.\nThe tactical tweaks didn’t come off because the players didn’t seem fully prepared for them. Güler looked uncertain, Rodrygo didn’t seem to know his role, and the defensive rotations (Fede dropping in, later Tchouameni) caused confusion rather than control. Xabi’s adjustments tried to solve one issue but created another, something normal early in a new coach’s cycle. The team simply needs more time to absorb his ideas.\n\n\n\nOverall:\nThe loss to Liverpool is just a small setback in a long-term project. What matters most is that Xabi keeps the dressing room. Despite negative leaks, I believe, he can still succeed. If he does, Real could dominate for another decade.\n\nHala Madrid.\n\n(Will add more thoughts after watching the Rayo Vallecano match.)",
        "upvotes": 100,
        "comments": 55,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ox4aa2/i_rewatched_liverpool_vs_real_madrid_and_i_think/"
    },
    {
        "id": "1owzo6p",
        "author": "Early_Ad_5386",
        "title": "Rated 10 league games of Ronaldo 11/12 so far.",
        "content": "Ratings: based on all actions\n\n  \nReal Madrid vs Real Zaragoza (A)—9.44/10\n\nReal Madrid vs. Getafe (H)—8.72/10\n\nReal Madrid vs Levante (A)—6.11/10\n\nReal Madrid vs Racing Santander (A)—6.58/10\n\nReal Madrid vs Rayo Vallecano (H)—9.66/10\n\nReal Madrid vs Espanyol (A)—8.59/10\n\nReal Madrid vs Real Betis (H)—8.03/10 \n\nReal Madrid vs Malaga (A)—10.32/10 (some 10-rated matches can go beyond 10 since no 10-rated matches are equal to each other)\n\nReal Madrid vs Villarreal (H)—7.44/10\n\n  \nStats:\n\nGoals: 10\n\nNPGs: 7\n\nBCC/QCC: 6\n\nKey passes with other good chance: 11\n\n\n\nWill do more ratings later.  :)",
        "upvotes": 152,
        "comments": 20,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/zchxe3aqr81g1.jpeg?auto=webp&amp;s=743d37c4d0cd4b4979567404c28d03f08484b7c5"
        },
        "permalink": "/r/realmadrid/comments/1owzo6p/rated_10_league_games_of_ronaldo_1112_so_far/"
    },
    {
        "id": "1oweur2",
        "author": "Jungkooks_bunny_ears",
        "title": "Kylian Mbappé reaches 400 career goals at 26 years old. He becomes the YOUNGEST player in the 21st century to reach 400 career goals.",
        "content": "",
        "upvotes": 2180,
        "comments": 151,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/wwt4jm77n31g1.jpeg?auto=webp&amp;s=07167f2239aa0e24cba3132036e3f07cd40aef1f"
        },
        "permalink": "/r/realmadrid/comments/1oweur2/kylian_mbappé_reaches_400_career_goals_at_26/"
    },
    {
        "id": "1owv1k9",
        "author": "RM-PostMatchSurveys",
        "title": "[Post-Match Survey Results] Real Madrid 0-0 Rayo Vallecano",
        "content": "",
        "upvotes": 155,
        "comments": 33,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/2ygjs5qlt71g1.png?auto=webp&amp;s=7f1f523a867af9e54e7a8bfce8399abbcc1a13ba"
        },
        "permalink": "/r/realmadrid/comments/1owv1k9/postmatch_survey_results_real_madrid_00_rayo/"
    },
    {
        "id": "1oy5tu6",
        "author": "HonestSpursFan",
        "title": "Why do Real Madrid Women always collapse in El Clásico?",
        "content": "I was watching the game last night (as a neutral but hoping Madrid would win for something different, also Barça have annoying fans) and unlike last season where Madrid got a historic 3–1 away win over Barça, this season it returned to usual with a 4–0 away defeat for Las Blancas (the same as the 4–0 loss at home last season).\n\nYes Barça have a better squad and Madrid need to start caring about their women's team a lot more, but the squad difference isn't big enough to be bent over every single time. Last season there were five El Clásicos: Barça won 4–0, 5–0 (twice) and 3–1 then Madrid won 3–1.\n\nBarça lost 1–0 to Sociedad this season and 2–1 to Levante last season, so they are beatable, plus they only have 17 players due to their financial problems. It's almost like Madrid have been given their best present and chance at silverware but yet they keep proving they can't do it.\n\nDo your players just not play for the badge or what?",
        "upvotes": 0,
        "comments": 20,
        "media": null,
        "permalink": "/r/realmadrid/comments/1oy5tu6/why_do_real_madrid_women_always_collapse_in_el/"
    },
    {
        "id": "1owijuq",
        "author": "EndouShuuya",
        "title": "TODAY TRAINING INTENSITY! VAMOOOOOOOOSSSS!",
        "content": "",
        "upvotes": 162,
        "comments": 18,
        "media": {
            "type": "video",
            "url": "https://v.redd.it/vrh7x7icf41g1/CMAF_720.mp4?source=fallback"
        },
        "permalink": "/r/realmadrid/comments/1owijuq/today_training_intensity_vamoooooooossss/"
    },
    {
        "id": "1ow7jid",
        "author": "Gaengsa",
        "title": "Nico Paz vs Arda Guler 2025/26",
        "content": "",
        "upvotes": 471,
        "comments": 130,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/0zfrfwon921g1.jpeg?auto=webp&amp;s=a22cc35d6e1459899b0f400216d15d6bb3c1b2c9"
        },
        "permalink": "/r/realmadrid/comments/1ow7jid/nico_paz_vs_arda_guler_202526/"
    },
    {
        "id": "1ow2biw",
        "author": "No-Independent2522",
        "title": "Bernabeu is set to host the first NFL game in Spain this Sunday",
        "content": "",
        "upvotes": 581,
        "comments": 79,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ow2biw/bernabeu_is_set_to_host_the_first_nfl_game_in/"
    },
    {
        "id": "1ownlhy",
        "author": "Blue_WaffIe",
        "title": "Valverde - Trent RW/RB",
        "content": "Both of these fine gentlemen can play on either position. People—myself included—have been complaining about the quality of our right flank. Trent deserves a chance in the team now. I would like to see us try a RW/RB overlap/interchange between Trent and Valverde. It would draw so much attention/confusion for the opposite defence trying to mark that.\n\nWholesome replies only pls xxx my uncle’s neighbour’s dog is critically ill, we’re all going through it rn. ",
        "upvotes": 34,
        "comments": 18,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ownlhy/valverde_trent_rwrb/"
    },
    {
        "id": "1ows5ha",
        "author": "liarmkn",
        "title": "Real Madrid pre-match fan meet-ups UCL",
        "content": "Hello, after many years RM is coming to play in my country and since I'm probably never finding tickets for the match, does anyone know where they announce about these meet and greets (for pictures and autographs) like they do before matches? I want to know place and time or about where they're staying to even see them from far and I don't know where to go to find out. I have some information from some other madrid fan friends I have because they seem more involved, but they seem to know nothing about this. Also, about the tickets, do you know RM itself sells away tickets for ucl nights? Maybe if I can't find home tickets I can find away ones!? thhanks\n",
        "upvotes": 7,
        "comments": 1,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ows5ha/real_madrid_prematch_fan_meetups_ucl/"
    },
    {
        "id": "1ow0nss",
        "author": "TheFeatherDiaries",
        "title": "[Fabrizio Romano on X] : Vini Jr on Carlo Ancelotti : ''He is passing confidence, making everyone feel comfortable, taking advantage of each player’s best characteristics in their positions. He gives us peace of mind, making the work easier and everyone enjoys it.''",
        "content": "",
        "upvotes": 265,
        "comments": 81,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ow0nss/fabrizio_romano_on_x_vini_jr_on_carlo_ancelotti/"
    },
    {
        "id": "1ovs7s9",
        "author": "No-Independent2522",
        "title": "While every post here is about our great decline, enjoy a meme",
        "content": "",
        "upvotes": 772,
        "comments": 51,
        "media": {
            "type": "image",
            "url": "https://preview.redd.it/tfzom6pggy0g1.jpeg?auto=webp&amp;s=1a0b388abcf0dbae837d279f51cdfe468f274acc"
        },
        "permalink": "/r/realmadrid/comments/1ovs7s9/while_every_post_here_is_about_our_great_decline/"
    },
    {
        "id": "1ow1q85",
        "author": "cyrusmancub",
        "title": "Camavinga is out with injury for France’s match against Ukraine and is doubtful against Azerbaijan. It will be decided after tonight’s match whether he returns to Madrid.",
        "content": "",
        "upvotes": 93,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ow1q85/camavinga_is_out_with_injury_for_frances_match/"
    },
    {
        "id": "1ow0q9j",
        "author": "Lekanswanson",
        "title": "I think the board needs more criticism than they are getting",
        "content": "This post will probably be deleted but the truth is I think the board is much more to blame for the shit show than any individual player is and this isn't even me saying this because we lost one or two matches. People going crazy over one or two losses are overreacting but its a valid criticism to say that the way we lost certain matches have been very embarrassing as a supporter of the club. \n\nWhen we won the champions league and league last I don't even think we had the best players individually in the world compared to some other teams but we had a balance like no other. Vini and Rodrygo offered something different to Bellingham and Joselu. Kroos, Valverde and Tchouameni complemented each other and then you could rotate them with Camavinga and modric as needed. We had the ever reliable and professional Nacho and the beast Rudiger in the back Lunin was a positive surprise.\n\nBut the recruitment since that season has been poor and even though I criticized Ancelotti for what I perceived to be a lack of tactics i also realized just how difficult a job he had but still his inability to properly rotate and make early subs probably caused some of our injury issues. \n\nFor example, it took Kroos years of playing the same position to master it, he didn't become the Kroos we know overnight but for some reason we expect Bellingham who has shown he has a knack for getting goals and being a good poacher to suddenly become Kroos.\n\nWhen France won the world cup, there's a reason Giroud was a keypart, he offered a different dimension to the Mbappes and the griezmans but yet we signed Mbappe as a F1 car and expect him to play like a monster truck instead of maybe just signing the monster truck we needed.\n\nWe are asking Tchouameni to play like Kroos when that was never his game, that's like asking Casemiro to turn into modric, they are simply not that type of players but they allow those type of players to flourish.\n\nRamos was also prone to mistakes and stupid red cards early in his career but we expect Dean to become the Ramos we all remember when he was in his prime.\n\n\nBut in saying all this we are still top of the league even with all the flaws in the team and considering we have a manager thats still getting to know the team. Stop blaming individual players and instead blame the board for not properly rebuilding the team with the right players because expecting players to suddenly change their attributes to be a different player is not going to work. Mbappe will never be that type of striker, Valverde or. Bellingham will never be a dictator, Vini will never stop dribbling, Camavinga will never be a winger and Curtois will never be a ball playing keeper. Alonso has to find a way to get the best out of what he has and I trust he will and if we win even the league this year I'll be satisfied with that.",
        "upvotes": 77,
        "comments": 58,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ow0q9j/i_think_the_board_needs_more_criticism_than_they/"
    },
    {
        "id": "1owi4tt",
        "author": "bluefoxlive",
        "title": "Understanding Fede Valverde’s mindset - ‘What It Means to Play for Uruguay’",
        "content": "Original content. A short 3.5-minute documentary that helps explain something Madrid fans often mention about Fede Valverde: his mentality. A lot of pundits ask how he plays with such intensity every match, and understanding La Celeste’s culture gives some context to why he’s wired the way he is as a leader.   \n  \nHere’s the video if you’re interested on basically why Valverde plays the way he does. ",
        "upvotes": 9,
        "comments": 1,
        "media": {
            "type": "image",
            "url": "https://external-preview.redd.it/NXRxoQFdJ77X0hOKCZlkYzAijeXMZGKhR8zL1FbPl_E.jpeg?auto=webp&amp;s=114ee8484b291764731b6bed2903a03f3b1fdecd"
        },
        "permalink": "/r/realmadrid/comments/1owi4tt/understanding_fede_valverdes_mindset_what_it/"
    },
    {
        "id": "1ovb6lf",
        "author": "soldier101br",
        "title": "Arsenal U16 players had the chance to meet the Madrid stars Vini Jr. and Rodrygo after the seleção training session",
        "content": "",
        "upvotes": 376,
        "comments": 16,
        "media": null,
        "permalink": "/r/realmadrid/comments/1ovb6lf/arsenal_u16_players_had_the_chance_to_meet_the/"
    }
]